{
  "id": "aKKHR2YBTlTomsSBcI4y",
  "document": {
    "title": "People v. Hines",
    "full_title": "THE PEOPLE AND v. GARY DALE HINES AND .",
    "jurisdiction": "California Supreme Court",
    "date": "1997-06-26T00:00:00.000Z",
    "docket": "S006640",
    "body": "A jury convicted defendant Gary Dale Hines of two counts of murder (Pen. Code, § 187), \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e with these special circumstances: robbery murder ( § 190.2, subd. (a)(17)(i)), burglary murder ( § 190.2, subd. (a)(17)(vii)), and multiple murder ( § 190.2, subd. (a)(3)). The jury also convicted him of robbery ( § 211), burglary ( § 459), grand theft of an automobile ( § 487.3), and possession of a firearm by a convicted felon ( § 12021), and found that he was armed with a firearm in the commission of the robbery, the burglary, and the two murders ( § 12022.5). At the penalty phase, the jury returned a verdict of death. Defendant's appeal to this court is automatic. ( § 1239, subd. (b).) We affirm the judgment in its entirety.\n\nI. FACTS\n\nA. Guilt Phase -- Prosecution's Case\n\nIn 1985, Lawrence \"Bud\" Roberts, his wife Kathryn, and their daughters, Donna and Michelle, moved from Grande Ronde, in Oregon, to the North Highlands area of Sacramento County, California. In the summer of 1986, when Donna was 15 years old and Michelle was 10, the family moved from North Highlands to a house at 4840 Priscilla Lane in south Sacramento.\n\nAt that time, Rebecca Palanuk, a friend of Donna Roberts from Grand Ronde, stayed with the Roberts family for three weeks, and helped them move to their new home. Palanuk had a brief romance with defendant, Gary Dale Hines. Defendant had visited Palanuk once at the Robertses' North Highlands house and saw her three times at the south Sacramento house. When defendant noticed Bud Roberts's pink fiberglass replica of a 1923 Ford Model-T roadster in the garage, he told Palanuk that he was going to \"get\" the roadster \"one way or another.\" After defendant spent a night in a motel with Palanuk and Donna Roberts, Palanuk told defendant she did not want to see him again. About the same time, defendant's probation officer told him not to see Palanuk.\n\nIn September 1986, at the request of a mutual friend, Viola DuCoing and Justin Comer gave defendant and two companions, Jamie Pyle and Mary Ann Poindexter, a ride from Auburn to Sacramento. During the drive, DuCoing, Comer, Pyle, and Poindexter all heard defendant say that the next time he went to court, he would go in a pink roadster. Defendant also told an acquaintance, Terri Wilson, that he was going to \"repossess\" a \"real nice roadster\" from \"a friend.\"\n\nJamie Pyle spent the night of September 14, 1986, at the Sacramento home of Steve Tabor. Also present were defendant and several other people. During the evening, defendant played with a pearl-handled pistol. Early the next morning (September 15), Pyle and two others drove defendant and Randal Houseman to a location in south Sacramento that was unfamiliar to Pyle, and dropped them off. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nAbout 10:30 that morning, Donna Roberts called Jiy Williams, a friend who had lived next door to the Roberts family when they lived in Grand Ronde, Oregon. According to Williams, Donna sounded \"kind of nervous, scared.\" Williams heard two and possibly three male voices in the background; near the end of the conversation, he heard one of the voices tell Donna, \"Hurry up and get off the phone.\" Williams asked who was present, and Donna told him. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThat afternoon, Michelle Roberts came to the home of a neighbor, Steven Mejia, crying, and told him that she thought her mother had been killed. Mejia called the police. At the Roberts home, the police found the bodies of Kathryn and Donna Roberts. Both victims had suffered multiple gunshot wounds. Donna had been blindfolded, her mouth gagged with socks, and her hands and feet bound with shoestrings and a telephone cord. The master bedroom had been ransacked. Missing from the home were the pink roadster, the purses of Kathryn and Donna, and several rifles and pistols kept in a gun case. In addition, a videocassette recorder (VCR) had been moved from the living room to the garage.\n\nNine separate witnesses saw two White males driving Bud Roberts's pink roadster through the streets of Sacramento between noon and 1:30 p.m. on September 15, the day that Donna and Kathryn Roberts were killed. Most of the witnesses testified that the men were in their late teens or early 20's. (Defendant was 20 years old at the time; Houseman was 16.) Four witnesses (Jeffrey Doyle, George Perez, Lynette Douke, and James Quirk) identified Randal Houseman as the passenger in the car. Another witness (William Johnson) identified defendant as the driver.\n\nThat afternoon, defendant and Houseman drove the roadster to Steve Tabor's home, arriving about 2:00. A neighbor of Tabor's, Diane Mallett, tentatively identified defendant as the driver of the roadster, and identified Houseman as the only passenger. At Tabor's home, defendant told his friends Terri Wilson and Mary Ann Poindexter that the roadster belonged to him. Around 3:00 p.m., defendant and Houseman drove the roadster to the nearby home of Viola DuCoing, where defendant told Justin Comer that the roadster belonged to him. Defendant and Houseman left 15 minutes later and returned to Tabor's home.\n\nThat evening, defendant and Houseman drove the roadster to the home of Terri Wilson. According to Wilson, defendant and Houseman brought shotguns or rifles into the house, which they claimed were theirs. Defendant asked Wilson for sheets and blankets to cover the car.\n\nThat same evening, two of Wilson's neighbors, James Carpenter and his daughter Christie, noticed the roadster at Wilson's home. Early the next morning, September 16, 1986, James Carpenter read a newspaper story about the murders and the roadster; after determining that the car was still at the Wilson home, he called the police.\n\nPolice officers placed Wilson's home under surveillance. When an old pickup truck left the residence, police officers tried to detain it, but the driver took off at high speed. The police pursued the truck until it crashed into a fence, and arrested the two occupants: Frank Hiler (Terri Wilson's boyfriend), and Cyndi Wilson (Terri's sister). In the cab of the pickup, police found five rifles that had been stolen from the victims' home, and were wrapped in a quilt from the victims' bed. Also in the truck was a purse belonging to Cyndi Wilson, which contained a .22-caliber bullet and a list of the guns found at the Roberts house.\n\nAt 9:30 that morning, Officer Ken Walker arrested defendant at Terri Wilson's home. The officer found defendant sitting in a living room chair. Next to the chair was a tote bag belonging to murder victim Donna Roberts. The bag contained the ignition switch from the Robertses' roadster, a starter pistol and pocket knife belonging to Bud Roberts, some plastic baggies, and a loaded .22-caliber High Standard revolver. Jamie Pyle identified the revolver as the pearl-handled pistol she had seen defendant playing with the night before the murders, and she said that defendant had also been holding it on the morning of his arrest. On a small table in front of the chair where defendant had been sitting were two handwritten notes, each containing a list of the guns stolen from the Roberts home, with a price next to each gun. David Crowe, an examiner of questioned documents for the California Department of Justice, testified that defendant had written one of the notes and that Randal Houseman had written the other.\n\nHouseman was also in Terri Wilson's living room when defendant was arrested. Beneath the couch on which Houseman was sitting was a loaded handgun that belonged to Bud Roberts. Behind Wilson's house, police found the stolen roadster partially covered with blankets and cardboard.\n\nRobert Springer, a supervising identification technician for the Sacramento Police Department, testified that a palm print on a wall of the entry hall of the Roberts home matched defendant's, as did fingerprints on the roadster, on the lists of stolen guns, on the baggies found in Donna Roberts's tote bag, and on the VCR in the Robertses' garage. Springer also found finger and palm prints made by Houseman on the entryway to the Roberts home, the baggies in the tote bag, the roadster, and the gun lists.\n\nCriminalist Robert Garbutt testified that bullets found at the scene of the murders had rifling characteristics similar to test shots fired from the .22-caliber High Standard revolver that was found in Donna Roberts's tote bag, the gun defendant had been playing with the night before the murders. Garbutt could not, however, conclusively identify the revolver as the murder weapon. He also testified that he found tiny spots of blood on the pants and shoes defendant was wearing at the time of his arrest, and blood on the shirt Houseman was wearing when he was arrested.\n\nA pathologist, Dr. Thomas Amott, testified that Donna Roberts had been shot four times: in her right eye, her left thigh, the middle of her back, and a close-range shot behind her right ear. The gag on her mouth had been tied so tightly that it had caused tears of the frenulum, the tissue connecting the tongue to the floor of the mouth. Kathryn Roberts, like her daughter Donna, had been shot behind the right ear at close range; she also had been shot in her left wrist and twice in the back. In addition, she suffered these injuries: two head lacerations that were inflicted by a blunt object such as a crowbar or pistol butt; several stab wounds to her neck, possibly inflicted by scissors; several large bruises; defensive wounds on her hands that broke bones in a thumb and two fingers; and purplish hemorrhages in the skin of her neck that could have been caused by forcefully applied fingertips.\n\nB. Guilt Phase -- Defense Case\n\nDefendant, testifying in his own behalf, admitted that he participated in stealing the Robertses' pink roadster, but he denied playing any role in the murders of Donna and Kathryn Roberts.\n\nDefendant said that on the day the murders took place, he had gone with Randal Houseman to the Roberts home to talk to Rebecca Palanuk to find out whether she was pregnant, as he had heard. (Defendant claimed he was unaware that Palanuk had returned to Oregon, and was no longer staying with the Roberts family.) At defendant's request, Houseman went to the door to see if Palanuk was home, while defendant, who had been warned by his probation officer to stay away from the home, waited at a nearby bus stop. After waiting for more than half an hour for Houseman to return, defendant walked up to the house. He saw Houseman in the garage; \"a whole bunch of stuff\" was in the pink roadster. While defendant \"hot-wired\" the car, Houseman entered the house. When Houseman returned, he and defendant drove away in the roadster.\n\nDefendant denied telling prosecution witnesses DuCoing, Comer, Pyle, and Poindexter that the next time he went to court he would go in a roadster, denied entering the Roberts home on the day of the murders, and denied any knowledge of the killings.\n\nOn rebuttal, the prosecution introduced a tape recording of a conversation between defendant and Randal Houseman that took place in a holding cell at the jail after their arrest, in which defendant made statements contrary to his trial testimony. (The contents of the tape recording will be discussed in pt. II.L., post.)\n\nC. Penalty Phase -- Prosecution's Case\n\nDavid Frye testified that on April 27, 1984, he telephoned the home of Teresa Smith, his former girlfriend and the mother of his son. When defendant answered, Frye told him to leave the house; defendant responded with profanities. Frye then drove to Smith's house and walked up to the front door, where defendant was standing. Defendant cocked a sawed-off shotgun, pointed it at Frye and said, \"I will blow your fucking head off.\" Frye entered the house, telling defendant he was going to call the police. Defendant left.\n\nLarry Wilson, a visitor at the Smith home, confirmed Frye's account of this incident. He said that defendant had loaded the gun before Frye arrived, and that Frye, who was over six feet tall and weighed over two hundred pounds, was very angry and was ready to fight defendant when he arrived at the house.\n\nDeputy Sheriff Earl Warren III, assigned to the Sacramento County jail, stated that defendant, on the day after his arrest, used profanity, threatened to throw soap bars at Warren and to kick him in the face, and physically resisted Warren's efforts to force him to stand facing the wall. Later that day, defendant said to Warren: \"I am going to kill you. This is a threat. You're dead.\" Six months later, while Deputy Warren was searching defendant's belongings in his jail cell, defendant told Warren, \"Stop going through my stuff or I will kick you in the face.\"\n\nDeputy Sheriff James Cooper testified that he and defendant had several \"verbal altercations\" while defendant was in custody awaiting trial and that on one occasion defendant told him, \"I am going to fuck you up.\" Scott French, a reserve deputy with the Sacramento County Sheriff's Department who worked at the jail, testified that on August 28, 1987, he heard defendant say of Deputy Cooper that defendant would \"beat his ass down\" and that \"his days are short.\" Cooper was not present at the time.\n\nDeputy Sheriff Steve Linebarger stated that on February 15, 1988, while searching defendant's jail cell, he found in defendant's mattress a six-inch plastic knife, bound with cloth on one end and sharpened on both edges.\n\nD. Penalty Phase -- Defense Case\n\nFrita Hines, defendant's aunt, testified that she had known defendant since he was nine years old. When defendant was approximately 14 years old, his father moved to another state with defendant's sister and 2 brothers, leaving defendant in the custody of his mother. Defendant's mother, an alcoholic who was hospitalized frequently for alcohol-related illnesses, was unable to care for defendant and allowed him to do whatever he liked. She died three years after defendant's father had left. Defendant often visited Frita Hines while he was a teenager and lived at her home for some time. Defendant behaved well at Hines's home, and took care of her in 1985, when she had emergency surgery. Hines expressed her love for defendant, and asked the jury not to sentence him to death.\n\nDenise Nicol testified that she had dated defendant for a few months and broke up with him in August 1986, shortly before his arrest in this case. At first, defendant treated her well, but later their relationship deteriorated, largely because of their use of drugs. She, too, asked the jury to spare defendant's life.\n\nRichard O'Toole, a teacher, stated that defendant was one of his students at a Rio Linda continuation school from the seventh or eighth grade until the tenth grade. Defendant was not a disciplinary problem and often talked to O'Toole about his broken home.\n\nDr. Edward Grover, a staff psychologist at Camarillo State Hospital, interviewed defendant and gave this opinion: defendant suffers from an \"antisocial personality disorder,\" which is associated with poor bonding between mother and child in the early stages of development. If sentenced to prison, defendant would at first rebel against the prison's \"authority structure,\" but would \"mellow out\" within 10 years. Ultimately defendant could have a productive life in prison, a Conclusion Dr. Grover based in part on his experience as an intern at the California Men's Colony, a prison in San Luis Obispo.\n\nTo rebut the testimony of prosecution witnesses David Frye and Larry Wilson that defendant had assaulted Frye with a sawed-off shotgun, defendant called Lisa Smith, Wilson's sister. Smith said she was present on the day the confrontation between defendant and Frye occurred. Frye had threatened to \"beat the hell out of\" defendant. She described Frye as a violent man; he once broke her jaw and he kicked her sister in the stomach when she was pregnant. Defendant was simply defending himself when he pointed the gun at Frye. She claimed the gun was a flare gun, not a sawed-off shotgun.\n\nTo counter Deputy Warren's testimony that defendant had threatened to kill him on the day after defendant's arrest, defendant called Joe Tinker, an inmate at the county jail on the day of the alleged threats. On that day, according to Tinker, Deputy Warren and other deputies came to defendant's jail cell and asked defendant to remove his clothes so that they could take photographs of him. Tinker then heard sounds as if the officers were beating defendant. Inmates, Tinker said, commonly use threats and profanity against the jailers.\n\nII. PRETRIAL AND GUILT PHASE ISSUES\n\nA. Marsden Motions\n\n1. Background\n\nOn three occasions (twice before trial and once during jury selection), defendant moved, under People v. Marsden (1970) 2 Cal. 3d 118, 84 Cal. Rptr. 156, 465 P.2d 44, for the discharge of his appointed attorneys and for appointment of other counsel to represent him. Each time, the trial court denied the motion after conducting an in camera hearing on the issue.\n\nDefendant made his first Marsden motion on December 18, 1986, when he was arraigned in superior court before Judge Tochterman. When the court asked defendant why he wanted his attorneys replaced, defendant replied that lead counsel Bradley Holmes was \"not doing his job.\" Asked by the court to be more specific, defendant complained that Holmes had not kept him informed as to what was taking place in court, had not shown him a discovery motion before filing it, and had not kept his promise to send an investigator to the jail to talk to him.\n\nThe court asked Attorney Holmes to comment. Holmes said that earlier in the day he had given defendant all of the discovery furnished by the prosecutor. He had as yet been unable to have defendant listen to 18 or 20 tape-recorded statements of witnesses that had been furnished in discovery, but he was trying to find a means to do so. Although Holmes had been appointed to represent defendant in September 1986, it was not until November that defendant had provided sufficient facts for Holmes to start an investigation. Holmes had retained an investigator who would begin work as soon as he had finished going through defendant's file. Holmes had visited defendant at the jail on a number of occasions, had talked to him frequently on the telephone, had given him copies of all motions filed, and had interviewed some witnesses.\n\nDefendant then complained that he had not received copies of all of the police reports turned over to the defense by the prosecution. Attorney Holmes replied that he had given defendant copies of all the reports, and that defendant's mistaken belief that some were missing was caused by the confusing manner in which the district attorney's office had numbered the pages of the reports. The court denied the motion.\n\nDefendant made a second Marsden motion on June 19, 1987. On that day, the trial court, after denying the prosecutor's motion to join defendant's case for trial with that of his accomplice, Randal Houseman, asked if defendant would waive time so that his trial could be held after Houseman's. Defendant refused to waive time, and asked for a new attorney. Judge Tochterman conducted a second in camera hearing, again asking defendant to state his reasons for wanting counsel removed. Defendant replied that he and lead counsel Holmes \"cannot communicate with each other,\" and that every time he attempted to say anything to Holmes, Holmes interrupted him. He also complained that Holmes had not filed a motion to suppress evidence under section 1538.5 and other unspecified motions.\n\nIn response, lead counsel Holmes explained that he had prepared a motion to suppress evidence, but had not yet filed it for tactical reasons, and that he intended to file it just before trial. He believed that communication between defendant and himself had been \"pretty good\" and that much of defendant's discomfort with him arose from the court's request that defendant waive time until after the trial of his accomplice, Houseman. Defendant, Holmes said, was eager to go to trial and was therefore reluctant to waive time. Before this particular appearance in court, Holmes had not discussed with defendant the possibility that a time waiver of this length might be appropriate. Holmes expressed confidence that if given a chance to discuss the situation with defendant more fully, the problem could be worked out.\n\nDefendant confirmed that he had been reluctant to waive time. In response to further inquiries from the court, he asserted that he lacked a relationship of trust with Holmes, but he did not specify any other problems between them.\n\nThe court denied the motion, finding that Attorney Holmes had given defendant no reason not to trust him, and that any lack of cooperation was attributable to defendant, not to his counsel.\n\nOn March 2, 1988, during jury selection, defendant made a third Marsden motion, this time before Judge Rothwell Mason, who was assigned to hear the trial. When defendant asserted that \"confusion\" between him and his attorneys had been \"erupting,\" the trial court asked defendant to elaborate. Defendant said he could not do so immediately, so the court suggested that defendant \"give it some thought,\" and \"sit down with a pad and pencil\" and come up with specific reasons for his dissatisfaction with his counsel. Once defendant had done so, the court stated, it would hold a formal hearing. Defendant agreed. Jury selection then continued.\n\nFive days later, on March 7, the court held a formal hearing on defendant's Marsden motion. Defendant explained that he had difficulty communicating with Attorney Holmes, and that Holmes's attitude had changed for the worse after defendant had made his most recent Marsden motion. Defendant added that he had written to the California Appellate Project and the Northern California Coalition Against the Death Penalty asking for help, and he showed the court the letters he had received in response. He offered no particulars of the alleged difficulties in communicating with lead counsel Holmes. The trial court denied the motion.\n\n2. Duty of inquiry\n\nDefendant faults the trial court for not conducting a more extensive inquiry into defendant's dissatisfaction with his trial counsel. In Marsden, we held that \"a Judge who denies a motion for substitution of attorneys solely on the basis of his courtroom observations, despite a defendant's offer to relate specific instances of misconduct, abuses the exercise of his discretion to determine the competency of the attorney.\" ( People v. Marsden, (supra) , 2 Cal. 3d at p. 124.) Thus, \"when a defendant moves for substitution of appointed counsel, the court must consider any specific examples of counsel's inadequate representation that the defendant wishes to enumerate.\" ( People v. Webster (1991) 54 Cal. 3d 411, 435, 285 Cal. Rptr. 31, 814 P.2d 1273.) That occurred here.\n\nAs set forth in the preceding section, the first two in camera Marsden hearings conducted by the court were quite thorough. On each occasion, the court repeatedly asked defendant to clarify the reasons for his dissatisfaction with counsel, and thereafter questioned defendant's lead attorney at length to determine whether defendant's allegations warranted counsel's replacement. Although the third hearing was not as thorough as the first two, the court again made great efforts to have defendant explain the nature of the difficulties defendant was having with counsel. When defendant was unable to do so, the court gave defendant as much time as he needed to formulate his reasons for wanting different counsel. In short, at each of the three Marsden hearings the trial court fully complied with its duty to ascertain the nature of the problems defendant claimed he was having with his appointed counsel.\n\n3. Appointment of independent counsel\n\nDefendant faults the trial court for not appointing independent counsel to assist him in arguing that he was entitled to replacement of his appointed counsel. He argues that because he was young (21 years old at the time of trial) and not well educated (a high school dropout, according to the probation report), he could not clearly articulate the reasons why he believed his attorneys should be replaced. He points out that a trial court must appoint counsel to assist a defendant moving for a new trial on the grounds of ineffective assistance of counsel whenever \"a failure to replace the appointed attorney would substantially impair the right to assistance of counsel . . . .\" ( People v. Smith (1993) 6 Cal. 4th 684, 696, 863 P.2d 192; see also People v. Stewart (1985) 171 Cal. App. 3d 388, 217 Cal. Rptr. 306.) But Smith holds only that in such situations the trial court should replace the defendant's existing counsel with a new attorney; it does not suggest that a defendant should ever be simultaneously represented by two attorneys, one of whom is challenging the other's competence.\n\nDefendant, moreover, did not ask the trial court to appoint independent counsel to assist him in making his Marsden motion, and the trial court acted properly when it did not appoint such counsel on its own initiative. Unlike a hearing on a motion for a new trial, a Marsden hearing is not a full-blown adversarial proceeding, but an informal hearing in which the court ascertains the nature of the defendant's allegations regarding the defects in counsel's representation and decides whether the allegations have sufficient substance to warrant counsel's replacement. Appointment of independent counsel to assist a defendant in making a Marsden motion is likely to cause unnecessary delay, and may damage the attorney-client relationship in those cases in which the trial court ultimately concludes that the motion should be denied. We see no need for trial courts to appoint independent counsel to assist defendants making such motions. (See People v. Smith, (supra) , 6 Cal. 4th at p. 695 [\"We are unaware of any authority supporting the appointment of simultaneous and independent, but potentially rival, attorneys to represent defendant.\"]; People v. Daniels (1991) 52 Cal. 3d 815, 848, 277 Cal. Rptr. 122, 802 P.2d 906.)\n\nAccording to defendant, the trial court's failure to appoint independent counsel to assist him in making his Marsden motion denied him the right to counsel guaranteed by the Sixth and Fourteenth Amendments to the United States Constitution and by article I, section 15 of the California Constitution. Defendant, however, was represented by counsel, albeit by counsel with whom he had expressed dissatisfaction and hence was seeking to have discharged. Defendant cites no authority holding that an accused has a constitutional right to the assistance of a separate attorney to argue that appointed trial counsel is ineffective and should be replaced, and we decline to so hold.\n\n4. Denial of the Marsden motions\n\nDefendant contends that the trial court erred when it denied each of his three Marsden motions. He argues that the hearings conducted on those motions demonstrated a \"significant disagreement as to tactics and strategy\" between defendant and his trial counsel, and that there was a \"substantial deterioration\" of the attorney-client relationship. We perceive no error.\n\nA trial court should grant a defendant's Marsden motion only when the defendant has made \"a substantial showing that failure to order substitution is likely to result in constitutionally inadequate representation\" ( People v. Crandell (1988) 46 Cal. 3d 833, 859, 251 Cal. Rptr. 227, 760 P.2d 423), or stated slightly differently, \"if the record shows that the first appointed attorney is not providing adequate representation or that the defendant and the attorney have become embroiled in such an irreconcilable conflict that ineffective representation is likely to result\" ( People v. Smith, supra, 6 Cal. 4th at p. 696). Defendant made no such showing here; rather, he merely made vague, unsubstantiated allegations that he and his lead attorney had trouble communicating. Defense counsel's explanations at the Marsden hearing, set forth earlier, showed that the asserted communication problems were not insoluble and had not given rise to such an irreconcilable conflict that ineffective representation was likely to result. Under the circumstances, the trial court properly concluded that there was no need to replace defendant's counsel.\n\nDefendant faults the trial court for its comments, made in the course of denying defendant's third Marsden motion, that counsel's courtroom performance had been \"superb\" and that the court's \"own subjective perception\" was that defendant \"couldn't be further wrong\" in believing that counsel's voir dire during the previous few days demonstrated a negative attitude about the case. These comments, defendant contends, indicate that the trial court improperly based its denial of defendant's Marsden motion on its personal observations of defense counsel's performance. We disagree.\n\nUnderlying defendant's complaint is this statement from Marsden : \"The defendant may have knowledge of conduct and events relevant to the diligence and competence of his attorney which are not apparent to the trial Judge from observations within the four corners of the courtroom. Indeed, 'when inadequate representation is alleged, the critical factual inquiry ordinarily relates to matters outside the trial record . . . .' [Citation.] Thus, a Judge who denies a motion for substitution of attorneys solely on the basis of his courtroom observations, despite a defendant's offer to relate specific instances of misconduct, abuses the exercise of his discretion to determine the competency of the attorney.\" ( People v. Marsden, supra, 2 Cal. 3d at pp. 123-124, italics added.) In this case, however, defendant's dissatisfaction with his counsel was based in part on matters that occurred within the courtroom, such as defendant's assertion that counsel's manner of questioning prospective jurors displayed counsel's negative attitude toward defendant's case. Because the trial court had personally observed defense counsel's conduct, it could properly comment on the quality of his performance.\n\n5. Alleged prosecutorial interference\n\nDefendant argues that the prosecutor improperly \"interfered\" with the trial court's consideration of his first Marsden motion. He states that the decision whether to replace a defendant's appointed counsel is a matter for the court, the defendant, and the defendant's attorney (see People v. Madrid (1985) 168 Cal. App. 3d 14, 19, 213 Cal. Rptr. 813 [trial court should generally honor timely defense request to exclude prosecutor from Marsden hearing]; People v. Dennis (1986) 177 Cal. App. 3d 863, 871, 223 Cal. Rptr. 236 [same]), and that here the prosecutor committed misconduct by advising the court of his \"personal views\" on whether defendant's attorney should be replaced.\n\nWe find no impropriety. The prosecutor was not present during defendant's first Marsden hearing. Before the hearing, the prosecutor made this statement to the court: \"Your honor . . . this is the first I heard there was going to be a Marsden motion. I don't have the applicable essence of the Marsden criteria right on the tip of my tongue. I don't know if it's [a] complete breakdown in the relationship or whatever the standard is. I know the Court is aware of it. I would simply request, your Honor, since I cannot be present, that the Court even though this is a capital case not rule from the posture of abundance of caution or bend over backwards or any such posture but instead apply Marsden in the strictest sense, and that [if] the defendant is not entitled to it to simply deny the motion.\" In essence, the prosecutor merely asked the court not to be swayed by extraneous factors in considering defendant's Marsden motion, but instead to follow the law. We see no impropriety in these remarks.\n\nB. Defendant's Motion to Represent Himself\n\nDefendant contends that the trial court improperly denied his motion for self-representation. The relevant facts are these: On March 7, 1988, the seventh day of jury selection, the trial court held a hearing on defendant's third motion under People v. Marsden, supra, 2 Cal. 3d 118, to have his appointed counsel discharged and replaced. (See pt. II.A., ante.) After defendant described the difficulties he was having with defense counsel, the court asked if he had anything more to say. Defendant stated: \"I would be asking that if -- if I can't get this granted that I would like to proceed in pro per if possible, you know. If I can't get this granted or I know it's the Court's discretion to be co-counsel.\" The court warned defendant at length of the risks and pitfalls of self-representation, but stressed that if defendant insisted upon representing himself, he had an \"absolute right\" to do so under Faretta v. California (1975) 422 U.S. 806, 45 L. Ed. 2d 562, 95 S. Ct. 2525. After urging defendant to \"think about it\" and denying his Marsden motion, the court took a short recess. Thereafter, jury selection continued, and no further mention was made of defendant's desire for self-representation that day.\n\nThe next day, just before the noon recess, defense counsel inquired about the status of defendant's motion for self-representation, or Faretta motion. ( Faretta v. California, supra, 422 U.S. 806, 45 L. Ed. 2d 562, 95 S. Ct. 2525.) The trial court replied that no such motion was pending before it. The court explained that in response to defendant's \"chance comment\" about wanting to represent himself, which was made in the course of the Marsden hearing, the court had suggested to defendant that he \"think about that overnight.\" The court then asked defendant, \"You wouldn't seriously be making a Faretta motion to have your attorneys fired, would you?\" Defendant replied, \"The thought is deeply in mind, let's put it that way.\" The court told defendant that \"it's not in your best interest to do it,\" added that it would not permit defendant to use the threat of a Faretta motion to \"blackmail\" the court into granting defendant's Marsden motion (which it had previously denied), and praised defendant's attorney. It concluded, \"I do not deem to have a Faretta motion before me at the moment.\" Defendant voiced no disagreement, and jury selection continued that afternoon.\n\nDefendant now argues that the trial court improperly denied his Faretta motion. Not so.\n\nCriminal defendants who wish to act as their own attorneys have a constitutional right to do so. ( Faretta v. California, supra, 422 U.S. 806; People v. Jones (1991) 53 Cal. 3d 1115, 1141, 282 Cal. Rptr. 465, 811 P.2d 757.) To invoke that right, however, a defendant \" ' \"should make an unequivocal assertion of that right within a reasonable time prior to the commencement of trial.\" ' \" ( People v. Horton (1995) 11 Cal. 4th 1068, 1107, 906 P.2d 478, italics in original.) In this case, defendant never made such an assertion. As mentioned earlier, defendant made his request for self-representation at the Marsden hearing, stating that \"if\" the court was going to deny his Marsden motion, he would like to act as his own attorney \"if possible,\" with the assistance of advisory counsel to be appointed by the court. The next day, when the issue of self-representation was again discussed, defendant told the court that he had the \"thought\" of self-representation \"deeply in mind,\" indicating that having been warned by the trial court the previous day of the perils of self representation and told to give the matter serious thought, he was still considering the matter. Defendant's comments do not represent an unequivocal request to act as his own attorney. Lending support to this Conclusion is the lack of any attempt by defendant to correct the trial court when, following the just-described comments by defendant, the court said, \"I do not deem to have a Faretta motion before me at the moment.\" (See Jackson v. Ylst (9th Cir. 1990) 921 F.2d 882, 888 [self-representation request that was an \"impulsive response\" to the trial court's denial of the defendant's motion for substitute counsel and was not renewed at a later court date was not unequivocal].)\n\nLater that day, after jury selection proceedings, the trial court told defendant that, after researching the matter, it had concluded that under People v. Windham (1977) 19 Cal. 3d 121, 137 Cal. Rptr. 8, 560 P.2d 1187, a defendant who made a Faretta motion after trial had begun was not automatically entitled to self-representation. The court did not state whether it would permit defendant to represent himself were he to move for self-representation, and defendant did not say he wanted to do so. Defendant argues that the trial court misled him by comparing his case to Windham \"in an attempt to convince [defendant] that he would not prevail on the Faretta motion.\" He contends that Windham is factually distinguishable, for in that case the Faretta motion was untimely because it was made on the last day of trial, whereas here defendant raised the issue of self-representation during voir dire, before the jury had been sworn and thus before the commencement of trial. The trial court, however, did not tell defendant that his case was factually identical to Windham, and it accurately described Windham's holding. (See People v. Marshall (1996) 13 Cal. 4th 799, 827, 919 P.2d 1280.) Thus, the court's remarks did not mislead defendant.\n\nC. Conflict of Interest\n\nDefendant accuses his two trial attorneys of having an irreconcilable conflict of interest with him, because they were appointed by the trial court and received compensation from the State of California, which had an interest in convicting defendant of the crimes charged. This circumstance, defendant asserts, may have prevented defense counsel from vigorously objecting to any errors by the trial court, because of their desire to receive appointments in future cases. Defendant suggests that in the future any appointments of counsel and provisions for their fees \"should be managed by some entity such as local and/or the State Bar Association rather than the Courts before whom the appointed counsel is appearing.\"\n\nWe find no conflict of interest. The interest of the State of California is not to secure the convictions of every person charged with a crime, but rather to assure that every criminal defendant receives a fair trial, so that only the guilty will be convicted. Defendant's bald assertion that the courts are reluctant to reappoint attorneys who have vigorously represented their clients is nothing more than an accusation unfounded by anything in the record before us and unsupported by any citation of authority.\n\nFor similar reasons, we reject defendant's conflict of interest argument pertaining to his appointed counsel on this appeal.\n\nD. Trial Court's Description of Defendant's Prior Convictions\n\nDefendant had two prior convictions for burglary. During voir dire, pursuant to a stipulation by the parties, the trial court told the prospective jurors about one of these prior burglary convictions. After the jury had been selected, but before the prosecutor made his opening statement, the court read the information to the jury. Included in the charges against defendant was the offense of possession of a firearm by a convicted felon. ( § 12021.) While explaining this charge to the jury, the trial court stated: \"At the . . . request of both counsel, you have . . . learned . . . that the defendant had previously been convicted of a charge of robbery and possession of a firearm by a previous conviction.\" (Italics added.) Defendant, however, had no prior convictions for robbery or possession of a firearm. The prosecutor immediately pointed out the court's mistake, saying, \"No, previous conviction of burglary.\" The court then stated, \"Previously been convicted of a count of burglary. Strike that, I have no information about a previous conviction for robbery.\"\n\nAs defendant points out, although the trial court's clarifying statement to the jury properly stated defendant had no prior robbery conviction, it failed to correct the court's erroneous statement that defendant had a prior conviction for possession of a firearm. Thus, the court's words could well have confused the jury with regard to whether defendant had also suffered a prior conviction for possession of a firearm. Any such confusion, however, could not have affected the jury's verdict, given the overwhelming evidence of defendant's guilt: his fingerprints were found in incriminating locations at the victims' house, he left the murder scene in the victims' roadster, and when arrested he was sitting next to Donna Roberts's tote bag, which contained a gun that displayed the same rifling characteristics as bullets found at the murder scene. Defendant also contends that defense counsel was ineffective for failing to object to the trial court's misstatement of his prior convictions. Given the overwhelming evidence of defendant's guilt, any ineffectiveness on the part of defendant's trial counsel was harmless.\n\nE. Prior Burglary Convictions\n\nAfter defendant testified in his own defense, the prosecutor impeached him by eliciting from him the fact that he had two prior felony convictions for burglary. Defendant now contends that the prosecutor should not have been permitted to use these convictions to impeach him. Because defendant did not object at trial, he is precluded from raising this issue on appeal. ( People v. Stewart (1983) 140 Cal. App. 3d 11, 16, 189 Cal. Rptr. 141; see People v. Rollo (1977) 20 Cal. 3d 109, 116, 141 Cal. Rptr. 177, 569 P.2d 771.)\n\nF. Testimony by Defendant\n\nDefendant contends that certain acts by his trial counsel denied him the right not to testify at his own trial. A Discussion of the pertinent facts follows.\n\nOn the morning of April 6, 1988, just before the defense presented its case, defense counsel asked the trial court for, and received, a 15-minute continuance because of \"a last-minute change with regard to whether [defendant] would testify or not.\" Thereafter, counsel told the court that any differences with defendant had been resolved. In his opening statement to the jury, lead counsel Bradley Holmes mentioned that defendant would testify on his own behalf.\n\nThat afternoon, defendant asked the trial court for a hearing in camera. There he complained that by mentioning during the opening statement that defendant intended to testify, counsel had in effect coerced him to do so. Counsel responded that he had discussed the matter with defendant before making his opening statement. He had explained that the decision whether to testify was entirely up to defendant, but had recommended that defendant take the witness stand.\n\nThe court commented that counsel had acted properly in mentioning to the jury that defendant would testify. The court also told defendant that if he ultimately decided not to do so, it would explain to the jury that this was his right and that the jury should draw no adverse inferences from counsel's earlier statement to the jury that defendant would testify. The court then suggested that counsel discuss the matter further with defendant.\n\nTrial did not resume until April 12, 1988. In the meantime, defendant had sent the trial court a letter complaining that his attorneys were unprepared, were lying to him, had not visited him at the jail in several months, and only once had discussed with him whether he should testify. The court held another in camera hearing on the matter on April 12. Attorney Julian Macias (defendant's second counsel) told the court that he had visited defendant the night before the defense began its case, and had explained that defendant was under no compulsion to testify, but that certain defense evidence could be presented only if defendant did so. He denied coercing defendant into testifying. Lead attorney Holmes said that defendant had originally agreed to testify, but had vacillated on the morning of defense's counsel's opening statement. Just before the opening statement, Holmes had leaned over counsel table and asked defendant, \"Are you sure you're going to testify?\" Upon receiving defendant's assent, Holmes made his opening statement in which he mentioned defendant's intent to take the witness stand. Only later did defendant have second thoughts about his decision.\n\nThe trial court reiterated what it had told defendant before: If defendant chose not to testify, the court would instruct the jury to draw no adverse inferences from defendant's failure to do so. Later that day, defendant did testify on his own behalf.\n\nDefendant complains that his counsel's opening statement to the jury coerced him into testifying. We disagree.\n\n\"Every criminal defendant is privileged to testify in his own defense, or to refuse to do so.\" ( Harris v. New York (1971) 401 U.S. 222, 225, 28 L. Ed. 2d 1, 91 S. Ct. 643.) The defendant's \"absolute right not to be called as a witness and not to testify\" arises from the Fifth Amendment to the United States Constitution and article I, section 15 of the California Constitution. ( Cramer v. Tyars (1979) 23 Cal. 3d 131, 137, 151 Cal. Rptr. 653, 588 P.2d 793.) Although tactical decisions at trial are generally counsel's responsibility, the decision whether to testify, a question of fundamental importance, is made by the defendant after consultation with counsel. ( People v. McKenzie (1983) 34 Cal. 3d 616, 631, fn. 9, 194 Cal. Rptr. 462, 668 P.2d 769; U.S. v. Martinez (9th Cir. 1989) 883 F.2d 750, 755, vacated other grounds (1991) 928 F.2d 1470; see also People v. Robles (1970) 2 Cal. 3d 205, 215, 85 Cal. Rptr. 166, 466 P.2d 710.)\n\nHere, as discussed above, it was only after defendant had told counsel of his willingness to testify that counsel so informed the jury in his opening statement. This was an appropriate tactical decision. Although counsel's tactical decision made it more difficult for defendant to reconsider his decision to testify, it did not unfairly coerce him or deprive him of his right to decide whether to testify.\n\nWe also reject defendant's contention that his trial counsel was ineffective for failing to adequately \"prepare\" defendant to testify. Assuming for the sake of argument that competent counsel has such a duty, the record in this case does not show what steps counsel took to prepare defendant for taking the witness stand (see People v. Wilson (1992) 3 Cal. 4th 926, 936, 838 P.2d 1212), or that defendant's testimony would have been different had there been greater preparation ( U.S. v. Mealy (7th Cir. 1988) 851 F.2d 890, 909).\n\nG. Telephone Conversation Between Donna Roberts and Jiy Williams\n\n1. Background\n\nOutside the jury's presence, Jiy Williams, a friend and former neighbor of Donna Roberts, testified that Donna telephoned him on the day she was murdered. During the conversation, Williams heard voices in the background and asked, \"Who's there?\" Donna replied that \"Gary\" was present. Williams said, \"Gary Hines?\" Donna replied, \"Yes.\"\n\nBefore trial, defendant moved to exclude the conversation between Williams and Donna Roberts. At the time of the prosecutor's opening statement, the trial court had not yet decided how to rule on the motion. The court told the prosecutor: \"You better protect your flank, careful on your opening statement that you don't go too far out on a limb. There is the distinct possibility I will rule that you may not get in the identification of the name on that telephone call.\"\n\nIn his opening statement, the prosecutor, after telling the jury that Donna had called Williams on the day she was killed, said: \"While they were talking, [Williams] could hear a male voice in the background, and he inquired. And based on information that [Williams] got from Donna, he called the Palanuks when he learned about the murders, and told them what he knew. They called the police and told the police what Jiy had told them. And, with that information the police then go out to where they now know that roadster is at, 1245 Ascot. They get that information, and the information where the roadster is right about the same time, and they go out there. And Lieutenant Ken Walker has a photograph of Gary Hines now before they ever enter that house . . . .\" Defendant asked the trial court to instruct the jury to disregard the prosecutor's comments. The court refused to do so.\n\nAfter the prosecutor's opening statement, but before Williams testified, the trial court ruled that Williams could testify generally about the conversation between Donna Roberts and himself, but that Donna's statement that defendant was present during the conversation was inadmissible hearsay. Thereafter, Williams testified that he had received a call from Donna at 10:30 on the morning she was killed, that in the conversation Donna told him that she missed him and would visit him soon, that while talking to her he had heard two or more male voices in the background, and that the conversation was ended after Williams heard a male voice say, \"Hurry up and get off the phone.\"\n\nThe prosecutor asked Williams whether in his telephone conversation with Donna Roberts he had asked her who else was present at the Robertses' house; Williams said he had. On redirect examination, the prosecutor, following up on this earlier question, asked Williams: \"I want you to answer the next question yes or no, okay. When you asked her who was in the background there, okay, did she tell you?\" Williams answered. \"Yes.\" Defendant did not object. After asking three other questions of no importance here, the prosecutor concluded his examination of Williams, and the court took a short recess. During the recess, defendant moved for a mistrial, arguing that by asking Williams whether Donna Roberts had told him who was present during the conversation, the prosecutor had circumvented the trial court's ruling excluding Donna's answer that defendant was there. The court denied the mistrial motion, but offered to give the jury \"an appropriate admonition.\" Defendant asked the court not to do so because \"that would have the affect [ sic ] of waving a flag in their face.\" He also explained that he had not objected when the question was asked because he feared that the objection would enhance the prejudicial effect of the question. Honoring defendant's request, the court gave no admonition.\n\nThe day after Williams's testimony, one of the jurors submitted to the court this written question: \"On 9/16 the police had Mr. Hines already as a suspect. What clues or evidence did the police have on the 15th that lead [ sic ] them to suspect Mr. Hines?\" After consultation with counsel, the court read the question to the entire jury. The court admonished the jury not to speculate about what evidence the police had when it arrested defendant: \"The police are allowed to rely on things including hearsay to establish probable cause to go into a home or to make an arrest that fall far short of the regular requirements of what a jury may hear in a courtroom trial. . . . I am satisfied that the hearsay evidence that has brought [defendant's] name to the forefront and caused [the police] to get a picture of him and check him out was legally done there. . . . That's not any evidence that you should convict the man of murder or any or [ sic (other?)] charge. You're not going to know specifically why the police went out there because it involves some hearsay, and I ruled that this jury cannot hear that. I didn't write the California Evidence Code. The legislature did.\"\n\n2. Admissibility of Donna Roberts's telephone call to Jiy Williams\n\nDefendant contends that the trial court should have excluded the telephone call between Jiy Williams and Donna Roberts in its entirety. The call, defendant asserts, had no relevance except for Donna's statement to Williams that defendant was present, a statement which the trial court ruled to be inadmissible hearsay. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nWe reject defendant's contention that the entire telephone conversation was inadmissible. At trial, the defense argued that it was Randal Houseman alone who had committed the murders of Kathleen and Donna Roberts, and that defendant never entered the Roberts home on the day of the murders. Williams's testimony that, in his telephone conversation with Donna Roberts, he heard more than one male voice in the background was obviously not hearsay, and tended to disprove defendant's claim that Houseman had acted alone in perpetrating the murders. With respect to defendant's assertion that the voices Williams heard could have come from the radio or television, that was a matter for the jury to decide.\n\nThe trial court should, however, have excluded Williams's inquiry of Donna Roberts, \"Who is there in the house with you?\" The mere fact that Williams asked the question was irrelevant, and telling the jury he had done so might have led it to speculate that Donna Roberts had answered by telling Williams that defendant was present. In the in limine hearing held before Williams testified, the court explicitly gave permission for the prosecutor to ask this question.\n\nThe prosecutor thereafter followed up this question with one that implied even more strongly that Roberts had identified defendant, asking: \"When you asked her who was in the background there, okay, did she tell you?\" Williams responded affirmatively. Although defendant cites this question as misconduct, it was permitted by the trial court's erroneous ruling at the in limine hearing, which allowed the prosecutor to ask any question short of eliciting the fact that Donna Roberts had told Williams that defendant was present.\n\nDefendant argues that the error violated his right to confront and cross-examine witnesses, guaranteed by the Sixth Amendment to the federal Constitution. He did not, however, object on this ground at trial, and therefore has not preserved the issue. ( People v. Alvarez (1996) 14 Cal. 4th 155, 186, 926 P.2d 365; People v. Gordon (1990) 50 Cal. 3d 1223, 1254, fn. 6, 270 Cal. Rptr. 451, 792 P.2d 251.) In any event, we find no violation of the confrontation clause. Admission of Donna Roberts's statement identifying defendant would not have violated the federal Constitution, as it would be admissible in the federal courts and most states under the \"present sense exception\" to the hearsay rule. (See Fed. Rules Evid., rule 803(1) (28 U.S.C.) [Hearsay exception for \"A statement describing or explaining an event or condition made while the declarant was perceiving the event or condition, or immediately thereafter.\"]; Booth v. State (Md. 1986) 306 Md. 313, 508 A.2d 976, 979 [a \"majority of states\" have adopted the present sense exception]; see also Fed. Rules Evid., rule 804(b)(5) (28 U.S.C.) [Hearsay exception for statement by unavailable witness \"if the court determines that (A) the statement is offered as evidence of a material fact; (B) the statement is more probative on the point for which it is offered than any other evidence which the proponent can procure through reasonable efforts; and (C) the general purposes of these rules and the interests of Justice will best be served by admission of the statement into evidence.\"].) \"Where proffered hearsay has sufficient guarantees of reliability to come within a firmly rooted exception to the hearsay rule, the Confrontation Clause is satisfied.\" ( White v. Illinois (1992) 502 U.S. 346, 356, 116 L. Ed. 2d 848, 112 S. Ct. 736.) Thus, the trial court did not violate the confrontation clause when it permitted the prosecutor to ask questions from which the jury could infer that Roberts had identified defendant, and the error is one of state law only.\n\nExamined under state law, the error was harmless. Before the murders defendant told numerous people that he intended to obtain a pink roadster, and at trial he admitted that he stole the victims' pink roadster immediately after they were killed. His fingerprints were found in the hallway of the victims' house and on the underside of a VCR that the killers moved from the victims' living room to their garage. When arrested, he was seated next to victim Donna Roberts's tote bag, wearing pants and shoes stained with blood. In the tote bag was a gun that witness Jamie Pyle saw defendant playing with the night before and the day after the murders. Bullets test-fired from this gun had rifling characteristics similar to bullets found at the scene of the murders. Defendant also had written a list of the guns stolen from the victims' house, along with prices at which they could be sold.\n\nDefendant's account of the episode -- that he remained outside the victims' home while Randal Houseman went to the door because he did not want to disobey the orders of his probation officer, but that he willingly joined Houseman in stealing the victims' roadster -- was inherently implausible. His claim that only Houseman entered the victims' house was contradicted by Jiy Williams's testimony that when Donna Roberts telephoned him on the morning of her death he heard more than one male voice in the background. In short, the evidence of defendant's guilt was overwhelming, and there is not a reasonable probability that the trial's outcome would have been different if the court had excluded Williams's question to Donna Roberts. ( People v. Watson (1956) 46 Cal. 2d 818, 836, 299 P.2d 243.)\n\n3. Prosecutor's opening statement\n\nIn the portion of his opening statement quoted above, the prosecutor never explicitly told the jury that Donna Roberts, in her telephone call to Jiy Williams, had identified defendant as one of the persons who was present during the call. Nevertheless, defendant argues, the prosecutor implied that Donna had identified defendant, and therefore was guilty of misconduct. As noted above, defendant objected to the prosecutor's comments and asked the trial court to admonish the jury to disregard them. The court denied the request.\n\nWe agree with defendant that the jury might have inferred from the prosecutor's comments that Donna Roberts had identified defendant in her conversation with Jiy Williams. The prosecutor told the jury that Williams had \"inquired\" about the \"male voice\" he heard during the conversation; that Williams told the Palanuks about the conversation, that the Palanuks told the police, and the police immediately went to the house \"where they now know that roadster is at,\" with defendant's photograph. The jury might have inferred from the prosecutor's comments that Donna Roberts had identified defendant in her conversation with Williams, that Williams had passed this information on to the Palanuks who in turn had told the police, as a result of which the police brought defendant's picture with them when they went to seize the roadster.\n\nThe situation was not improved by the trial court's response when a juror, perhaps because of the prosecutor's comment in his opening statement, asked what evidence led the police to suspect defendant of committing the murders. The court should simply have told the jury that there was no evidence on this point, and reminded it not to speculate about matters as to which there was no evidence. Instead, the court improperly told the jury that the police had hearsay evidence of defendant's guilt (\"I am satisfied that the hearsay evidence that has brought [defendant's] name to the forefront . . . was legally done\"), and improperly implied that information was withheld from the jury because of technical rules of which the court disapproved (\"I didn't write the Evidence Code. The Legislature did.\").\n\nAny misconduct by the prosecutor was, however, harmless. As explained in the preceding section, the evidence of defendant's guilt was overwhelming. There is no reasonable probability that the outcome of the trial would have been different if the prosecutor had not mentioned the telephone call in question in his opening statement. ( People v. Watson, supra, 46 Cal. 2d 818, 836.) \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\n4. Mistrial\n\nAfter Jiy Williams testified that in his telephone conversation with Donna Roberts, she had answered his question about who was with her at the house, defendant moved for a mistrial. The trial court denied the motion, but offered to admonish the jury to disregard Williams's testimony. Defendant asked the court not to do so, fearing that the admonition would have the effect of drawing the jury's attention to this testimony, thus increasing its prejudicial effect.\n\nDefendant now asserts that Williams's testimony was so prejudicial that no admonition by the trial court would have been sufficient to cure it, and that the court, therefore, should have granted his motion for mistrial. We disagree.\n\n\"A mistrial should be granted if the court is apprised of prejudice that it Judges incurable by admonition or instruction. ( People v. Woodberry (1970) 10 Cal. App. 3d 695, 708, 89 Cal. Rptr. 330.) Whether a particular incident is incurably prejudicial is by its nature a speculative matter, and the trial court is vested with considerable discretion in ruling on mistrial motions.\" ( People v. Haskett (1982) 30 Cal. 3d 841, 854, 180 Cal. Rptr. 640, 640 P.2d 776; see also People v. Stansbury (1993) 4 Cal. 4th 1017, 1060, 846 P.2d 756; People v. Cooper (1991) 53 Cal. 3d 771, 838-839, 281 Cal. Rptr. 90, 809 P.2d 865; People v. Wharton (1991) 53 Cal. 3d 522, 565, 280 Cal. Rptr. 631, 809 P.2d 290.) Here, an admonition would have been adequate to prevent the jury from speculating that Donna Roberts had identified defendant in her telephone conversation with Williams. Thus, the trial court did not abuse its discretion when it denied defendant's motion for a mistrial.\n\nH. Proceedings Conducted in Defendant's Absence\n\nDefendant contends that the trial court erred in conducting some of the trial proceedings in his absence.\n\nA criminal defendant's right to be personally present at trial is guaranteed by the Sixth and Fourteenth Amendments of the federal Constitution, as well as by article I, section 15 of the California Constitution and by sections 977 and 1043 of the California Penal Code. ( People v. Jones, supra, 53 Cal. 3d at p. 1141; People v. Douglas (1990) 50 Cal. 3d 468, 517, 268 Cal. Rptr. 126, 788 P.2d 640.) A defendant, however, \"does not have a right to be present at every hearing held in the course of a trial.\" ( People v. Price, (1991) 1 Cal. 4th 324, 407, 821 P.2d 610.) A defendant's presence is required if it \"bears a reasonable and substantial relation to his full opportunity to defend against the charges.\" ( People v. Freeman (1994) 8 Cal. 4th 450, 511, 882 P.2d 249.) The defendant must show that any violation of this right resulted in prejudice or violated the defendant's right to a fair and impartial trial. ( People v. Jackson (1980) 28 Cal. 3d 264, 310, 168 Cal. Rptr. 603, 618 P.2d 149.)\n\nDefendant first argues that his right to be present was violated on February 11, 1988. On that day, defendant's case was called for trial. Defendant was not present. No courtrooms were available, and the trial court ordered the case \"trailed\" to February 16, 1988. Defendant's absence from this brief proceeding on February 11 in no way impaired his right to defend himself against the charges.\n\nNext, defendant claims that the trial court violated his right to be present on March 18, 1988, when, he asserts, the court conducted voir dire in his absence. No voir dire, however, was conducted in defendant's absence. Defendant was absent only for a matter of seconds, while the court and counsel discussed whether the trial should resume at 1:45 or at 2:00 that afternoon. After this Discussion, the court briefly recessed. Although the trial court did not say whether or not defendant was present when voir dire resumed after the recess, his presence may be inferred not only from the fact that the court, during voir dire, suggested that defense counsel take a few minutes to consult with defendant before deciding whether to accept the jury or to exercise a peremptory challenge, but also from the March 18 minute order, which states that defendant was present during the proceedings that day.\n\nAdditionally, defendant contends that he was denied his right to be present on March 23, 1988. On that day, just before the noon recess, the court had ordered the jury to silently examine two photographs that had been admitted into evidence. Defendant was at that point escorted from the courtroom. During that brief absence, no new evidence or testimony was presented to the jury, and defendant's ability to defend himself was not impaired.\n\nFinally, defendant complains that in his absence the trial court questioned Juror Elizabeth Bahr about a telephone call she had received from defendant during the two-week period between the end of the guilt phase and the beginning of the penalty phase. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Defendant was not brought to court for this appearance because he had told jail personnel he was ill. When the court called the jail to verify the reason for defendant's absence, it spoke to a nurse who said that defendant had a history of faking illness. Skeptical of defendant's claim of illness and unwilling to send Juror Bahr home without hearing from her, the court allowed Juror Bahr to describe the telephone call she had received from defendant. The court took no action until a week later, when defendant came back to court, at which time Bahr repeated her account.\n\nBecause the record contains no evidence (aside from the trial court's hearsay statement about its telephone conversation with the jail nurse) that defendant was malingering, it is unclear whether defendant voluntarily absented himself from the proceeding at which Juror Bahr first described her conversation with him. (See People v. Price, supra, 1 Cal. 4th at p. 405 [trial court properly found that defendant's acts constituted a voluntary waiver of his right to be present].) In any event, because the trial court took no action at that proceeding and at defendant's next court appearance had Juror Bahr repeat, in defendant's presence, what she had earlier told the court, defendant's ability to defend himself was not impaired in any manner.\n\nI. Informing Jury of Houseman's Conviction\n\nPursuant to a stipulation by the parties, the trial court told the jury that Randal Houseman had been tried and convicted of unspecified offenses based on his involvement in the crimes defendant was charged with committing. Because the defense expressly agreed that the court so inform the jury, defendant cannot claim, as he does now, that in doing so the trial court committed prejudicial error. We further reject defendant's contention that his attorney's decision to enter into this stipulation constituted ineffective assistance of counsel. It was to defendant's advantage that the jury be told of Houseman's conviction, for defendant's theory at trial was that Houseman was the sole perpetrator of the murders. Thus, counsel's decision to inform the jury of Houseman's conviction was tactically reasonable.\n\nJ. Defendant's Claim of Judicial Bias\n\nDefendant contends that his right to an impartial jury was impaired because the jury was influenced by the \"the trial court's readily apparent pro-prosecution bias.\" He asserts that the court demonstrated its bias by: (1) objecting on its own initiative to two questions by defense counsel; (2) telling the jury that one prosecution witness (a Sacramento police officer) had been promoted between the time of arrest and trial and that another had been a student of United States Supreme Court Justice Anthony Kennedy; (3) telling the prosecutor, when defendant objected that the prosecutor was asking leading questions of Detective Ronald Aurich, \"I doubt if you are going to put perjury into Officer Aurich's mouth . . .\"; (4) describing the prosecutor to the jury in glowing terms without doing the same for the defense attorneys; and (5) taking into account the prosecutor's schedule with respect to breaks and lunch hours, without giving the same consideration to defense counsel. Defendant has not preserved the issue for appeal because he made no objection to any of the trial court's allegedly improper actions. ( People v. Fudge (1994) 7 Cal. 4th 1075, 1108, 875 P.2d 36; People v. Wright (1990) 52 Cal. 3d 367, 411, 276 Cal. Rptr. 731, 802 P.2d 221.)\n\nK. Permitting Jury to View Videotape of Search\n\nAs previously explained, on the morning of September 16, 1986, police officers arrested defendant and Randal Houseman at the Sacramento home of Terri Wilson. They then searched Wilson's home and seized various items of evidence that were later used against defendant at trial. Officer Angel Delgadillo recorded portions of the search on videotape, which the prosecution showed to the jury at trial.\n\nBefore trial, defendant moved to suppress the videotape. At the suppression hearing, the following evidence was offered.\n\nOfficer Delgadillo testified that he arrived at Terri Wilson's house about 1:30 p.m., and began taping the search half an hour later. At one point, the searching officers argued about the manner in which the search should be conducted. Officer Delgadillo intended to turn off the video camera during the argument, but neglected to do so. After the argument was over, he discovered that the video camera had recorded it. Because he believed the argument to be \"unprofessional,\" he rewound the videotape to the point just before the argument began, and resumed videotaping the search. Because the remainder of the search lasted a shorter time than the argument among the officers, a small portion of the argument was not recorded over and thus remained on the videotape. No search was conducted during the argument. Defendant contended at trial that by rewinding the tape to erase the officers' argument, Officer Delgadillo had willfully destroyed material evidence potentially favorable to the defense.\n\nAt the Conclusion of the hearing, the trial court denied defendant's motion to suppress the videotape. Defendant argues that the denial was error.\n\nLaw enforcement agencies have a duty to preserve evidence \"that might be expected to play a significant role in the suspect's defense.\" ( California v. Trombetta (1984) 467 U.S. 479, 488, 81 L. Ed. 2d 413, 104 S. Ct. 2528; People v. Beeler (1995) 9 Cal. 4th 953, 976, 891 P.2d 153; People v. Webb (1993) 6 Cal. 4th 494, 519, 862 P.2d 779; People v. Zapien (1993) 4 Cal. 4th 929, 964, 846 P.2d 704.) To fall within the scope of this duty, the evidence \"must both possess an exculpatory value that was apparent before the evidence was destroyed, and be of such a nature that the defendant would be unable to obtain comparable evidence by reasonably available means.\" ( Trombetta, supra, 467 U.S. at p. 489; Beeler, supra, 9 Cal. 4th at p. 976.) Furthermore, \"unless a criminal defendant can show bad faith on the part of the police, failure to preserve potentially useful evidence does not constitute a denial of due process of law.\" ( Arizona v. Youngblood (1988) 488 U.S. 51, 58, 102 L. Ed. 2d 281, 109 S. Ct. 333; Beeler, supra, 9 Cal. 4th at p. 976; Webb, supra, 6 Cal. 4th at p. 519.)\n\nHere, the videotape's erased portion pertaining to the arguments among the searching police officers did not \"possess an exculpatory value that was apparent before the evidence was destroyed.\" ( California v. Trombetta, supra, 467 U.S. at p. 489.) The uncontradicted testimony of Officer Delgadillo, who videotaped the event, established that no evidence-gathering activities were recorded on the videotape's erased portion, which had contained only an argument among the searching officers. Defendant does not explain how that argument could have played \"a significant role in [his] defense.\" ( Trombetta, supra, 467 U.S. at p. 488.) We conclude that the trial court properly denied defendant's motion to suppress the videotape.\n\nDefendant further contends that because Officer Delgadillo erased the argument between the officers, the videotape \"did not accurately depict the scene which it purported to represent\" and should therefore have been suppressed. Not so. The videotape depicted the officers' search of Wilson's house; it did not purport to depict the argument that took place during the search. The jury was informed that the argument had occurred, and that the police had erased the portion of the videotape on which the argument was recorded. The trial court did not err by denying defendant's motion to suppress the videotape on this ground.\n\nL. Permitting Jury to Hear Tape-Recorded Conversation Between Defendant and Houseman\n\nOn rebuttal, the prosecution played, over defendant's objection, a tape recording of a conversation between defendant and Randal Houseman that took place in a holding cell on the afternoon of their arrest. In the conversation, defendant denied going to the home of Steve Tabor on the day of the murders and denied ever seeing a roadster. Both defendant and Houseman professed ignorance about the murder charges they were facing. Their comments suggested that they suspected their conversation was being recorded.\n\nDuring the conversation, either defendant or Houseman stated: \"(Inaudible) night. Because, remember, I pulled those blankets over the steering wheel. Blanket wasn't -- it was back off the dash.\" Sacramento Police Sergeant Ralph Coyle testified that in his opinion defendant was the one who said those words.\n\nDefendant argues that the trial court should have excluded the tape recording. We disagree.\n\nDefendant cursorily contends that the statement was \"taken in a police-dominated atmosphere\" and therefore violated his Sixth Amendment right to counsel and his Fifth Amendment privilege against self incrimination. He cites no authority in support of this contention, which in any event is without merit. ( People v. Champion (1995) 9 Cal. 4th 879, 911, 891 P.2d 93.)\n\nDefendant next argues that because police officers recorded the jail conversation without his knowledge, they conducted an unreasonable search and seizure (U.S. Const., 4th and 14th Amends.) and violated title III of the Omnibus Crime Control and Safe Streets Act of 1968 (18 U.S.C.S. §§ 2510-2520). He offers no analysis or case authority in support of these claims, both of which are without merit. (See Lanza v. New York (1962) 370 U.S. 139, 8 L. Ed. 2d 384, 82 S. Ct. 1218 [search and seizure]; Donaldson v. Superior Court (1983) 35 Cal. 3d 24, 196 Cal. Rptr. 704, 672 P.2d 110 [same]; People v. Von Villas (1992) 11 Cal. App. 4th 175, 223-225 [Omnibus Crime Control and Safe Streets Act].)\n\nDefendant also contends that the recorded jail conversation violated his state right to privacy (Cal. Const., art. I, § 1), the state prohibition against illegal searches and seizures (Cal. Const., Art. I, § 13), and sections 2600 and 2601 of the California Penal Code (see DeLancie v. Superior Court (1982) 31 Cal. 3d 865, 873, 183 Cal. Rptr. 866, 647 P.2d 142). Even assuming that these claims have merit, defendant is not entitled to obtain suppression of the tape-recording. In general, relevant evidence that is illegally obtained under California law is nonetheless admissible, so long as federal law does not bar its admission. (See Cal. Const. art. I, § 28, subd. (d); People v. May (1988) 44 Cal. 3d 309, 319, 243 Cal. Rptr. 369, 748 P.2d 307; In re Lance W. (1985) 37 Cal. 3d 873, 886-887, 210 Cal. Rptr. 631, 694 P.2d 744; Ahmad A. v. Superior Court (1989) 215 Cal. App. 3d 528, 534-536, 263 Cal. Rptr. 747.)\n\nAdditionally, defendant argues that admission of the tape recording violated his right to confront adverse witnesses (U.S. Const., 6th Amend.), because he was unable to cross-examine Houseman, whose statements in the tape-recorded conversation were (he claims) admitted against him. In Bruton v. United States (1968) 391 U.S. 123, 135-136, 20 L. Ed. 2d 476, 88 S. Ct. 1620, the United States Supreme Court held that a defendant's right to confront adverse witnesses was violated by the admission of a nontestifying codefendant's \"powerfully incriminating\" statements implicating the defendant. Houseman, however, made no statements implicating defendant in the tape-recorded conversation; accordingly, defendant's inability to cross-examine Houseman did not violate his right of confrontation. (See Richardson v. Marsh (1987) 481 U.S. 200, 208, 95 L. Ed. 2d 176, 107 S. Ct. 1702; United States v. Enriquez-Estrada (9th Cir. 1993) 999 F.2d 1355, 1359.)\n\nFinally, defendant asserts that the tape-recorded statement was inadmissible because its probative value was \"substantially outweighed by the probability that its admission [would] . . . (b) create substantial danger of undue prejudice . . .\" (Evid. Code, § 352), claiming, as he did at trial, that the jury may well have been offended by his constant use of obscenities throughout the conversation. We disagree.\n\nAs we pointed out earlier, comments made in the recorded jail conversation between defendant and Houseman suggested their suspicion that their Discussion was being recorded. In the course of the Discussion, defendant denied seeing a roadster or going to the home of Steve Tabor on the day of the murders. Although these statements were exculpatory, they were inconsistent with defendant's own trial testimony that he drove the roadster to Tabor's home on the day of the murders. Similarly, defendant's admission in the recorded conversation that he helped to cover the \"steering wheel\" (presumably of the roadster stolen by the killers) with a blanket was inconsistent with his trial testimony that he did not help to cover the car. Also, at trial prosecution witnesses contradicted these statements by defendant. In addition, during the recorded conversation defendant asked no questions of Houseman about what had happened at the victims' home on the day of the murders; this lack of curiosity, as the trial court noted, was inconsistent with defendant's trial testimony that he remained outside the house and played no role in the killings. For these reasons, the trial court did not abuse its discretion when it found that any prejudicial effect arising from the jury's listening to defendant's profanity-laden remarks on the tape did not outweigh the conversation's probative value. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nM. Prosecutorial Misconduct\n\nWhen questioning witnesses, the prosecutor repeatedly characterized the deaths of Kathryn and Donna Roberts as \"murders.\" For example, the prosecutor asked witness Jerod Dierling: \"Do you remember the day the murders were discovered?\" And when cross-examining defendant, he asked, \"Well, obviously, you don't think you're guilty of the murders, do you?\"\n\nDefendant points out that the question whether the killings of Kathryn and Donna Roberts were acts of murder was a matter for the jury to decide. By asking questions that described the slayings as murders, defendant contends, the prosecutor inappropriately \"conditioned\" the jury to find that they were in fact murders.\n\nDefendant, however, never objected to the prosecutor's questions; thus, he is barred from asserting this claim on appeal. ( People v. Carpenter (1997) 15 Cal. 4th 312, 413, 935 P.2d 708.) Nor was counsel ineffective, as defendant claims, for failing to object. There was no reason for counsel to do so because defendant did not dispute that both victims had been murdered; instead, he denied that he was the murderer. Indeed, given the evidence that the victims were shot at close range in the course of a burglary (thus triggering the felony-murder rule), and that one victim, Donna Roberts, was bound and gagged (thus negating the possibilities that the killing occurred in self-defense or in the heat of passion), it would have been absurd for defendant to argue that the killings were not murders.\n\nDefendant further contends that questions using the word \"murder\" that the prosecutor directed at defendant caused him to concede that the slayings were murders, and that these questions, combined with defendant's answers, in effect elicited a plea of guilty from defendant without the appropriate admonitions required by Boykin v. Alabama (1969) 395 U.S. 238, 23 L. Ed. 2d 274, 89 S. Ct. 1709, and In re Tahl (1969) 1 Cal. 3d 122, 81 Cal. Rptr. 577, 460 P.2d 449. Recognizing that his counsel made no objection to the prosecutor's questions, he argues that counsel's failure to object on this ground was ineffective assistance of counsel. The contention is meritless. Boykin and Tahl require that a defendant, before entering a plea of guilty, be advised of and waive the constitutional rights to trial by jury and to confront and cross-examine witnesses, as well as the privilege against self-incrimination. ( Tahl, supra, 1 Cal. 3d at p. 132.) No advisement need be given when a defendant is questioned in the midst of a trial in which there has been no denial of those rights. ( People v. Adams (1993) 6 Cal. 4th 570, 577, 862 P.2d 831.) For the same reason, we reject defendant's argument that the court should have told defendant of his rights under Boykin v. Alabama, supra, 395 U.S. 238, and In re Tahl, supra, 1 Cal. 3d 122, before the prosecutor's questions to defendant whether he had prior convictions for burglary and whether he was guilty of car theft in this case.\n\nN. Photographs of Donna Roberts's Corpse\n\nOver defendant's objection, the prosecution introduced into evidence three photographs of Donna Roberts's corpse. Defendant argues that one photograph would have sufficed, and that the remaining two served only to inflame the passions of the jury.\n\nA trial court has broad discretion in determining whether photographs offered for admission into evidence are unduly gruesome or inflammatory. ( People v. Lucas (1995) 12 Cal. 4th 415, 449, 907 P.2d 373; People v. Memro (1995) 11 Cal. 4th 786, 866, 905 P.2d 1305.) Here, the photographs depicted the wounds inflicted on Donna Roberts and the manner in which she was bound, and thus were relevant to show defendant's premeditation and intent to kill. ( People v. Crittenden (1994) 9 Cal. 4th 83, 133, 885 P.2d 887; People v. Clair (1992) 2 Cal. 4th 629, 660, 828 P.2d 705.) One photograph (exhibit No. 3A-U) showed the position of Donna Roberts's body when it was found, with bindings on her wrists and feet, and a wound in her thigh. The other two photographs (exhibit Nos. 3A-T and 3A-V) showed the gag in her mouth, her blindfold, and the bullet wound in her eye. Any conceivable error in showing the jury all three photographs instead of only one was harmless, given the strength of the evidence of defendant's guilt. (See People v. Anderson (1987) 43 Cal. 3d 1104, 1136-1137, 240 Cal. Rptr. 585, 742 P.2d 1306.)\n\nO. Defendant's Cross-examination of Prosecution Witnesses\n\nDefendant argues that the trial court repeatedly cut off his cross-examination of prosecution witnesses Viola DuCoing, Jamie Pyle, and Mary Anne Poindexter, thereby violating his right to confront adverse witnesses, as guaranteed by the Sixth and Fourteenth Amendments to the United States Constitution, by section 28 of article I of the California Constitution, and by subdivision 3 of section 686.\n\n\"The confrontation clause allows 'trial Judges . . . wide latitude . . . to impose reasonable limits on . . . cross-examination based on concerns about, among other things, harassment, prejudice, confusion of the issues, the witness' safety, or interrogation that is repetitive or only marginally relevant.' \" ( People v. Clair, supra, 2 Cal. 4th at p. 656, fn. 3, quoting Delaware v. Van Arsdall (1986) 475 U.S. 673, 679, 89 L. Ed. 2d 674, 106 S. Ct. 1431.) In this case, the rulings about which defendant complains occurred when the prosecutor objected to questions by defense counsel that were irrelevant, vague, and argumentative. The questions concerned issues that were at best marginally relevant, such as the length of time that Jamie Pyle remained \"high\" after injecting methamphetamine and the type of shirt that defendant was wearing when he said he would go to court in a roadster. The trial court properly sustained the prosecutor's objections to these questions, and we find no impairment in defendant's ability to thoroughly cross-examine prosecution witnesses Viola DuCoing, Jamie Pyle, and Mary Anne Poindexter.\n\nP. Evidence Regarding the Victims' Family\n\nProsecution witness Stephen Mejia testified that on the afternoon of September 15, 1986, 10-year-old Michelle Roberts came to his door and tearfully told him that she thought her mother had been killed. During closing argument at the guilt phase, the prosecutor remarked that Michelle \"perhaps fortunately\" was not home when her mother and sister were killed. Defendant argues that the prosecutor elicited Mejia's testimony to inflame the jury's passions through \"victim impact\" evidence at the guilt phase of trial, and that the prosecutor's comment in closing argument had the same goal. This \"outrageous tactic,\" defendant asserts, constituted prosecutorial misconduct. Defendant, however, did not object in either instance. Thus, he has not preserved the right to raise the issue on appeal. ( People v. Carpenter, supra, 15 Cal. 4th at p. 413.)\n\nWith respect to defendant's contention that his counsel's failure to object to Mejia's testimony was ineffective assistance of counsel, an objection would have been unavailing. Mejia's testimony was admissible because it established the time of the victims' death and explained how and why police officers were summoned to the victims' home; it was far less inflammatory than calling Michelle Roberts to testify. ( People v. Thomas (1992) 2 Cal. 4th 489, 522-523, 828 P.2d 101.) Equally meritless is defendant's contention that his counsel was incompetent for not objecting to the prosecutor's passing comment regarding Michelle Roberts. The comment was innocuous and unlikely to inflame the jury\n\nQ. Competence of Defense Counsel\n\nDefendant contends that his attorneys ineffectively represented him throughout the guilt phase of trial. Defendant may prevail on this claim only if the record shows that his counsel's performance \"fell below an objective standard of reasonableness under prevailing professional norms\" ( People v. Mincey (1992) 2 Cal. 4th 408, 449, 827 P.2d 388) and there is a \"reasonable probability\" that counsel's unprofessional conduct affected the result of the proceeding; that is, a probability \"sufficient to undermine confidence in the outcome\" ( Strickland v. Washington (1984) 466 U.S. 668, 694, 80 L. Ed. 2d 674, 104 S. Ct. 2052).\n\nDefendant lists various instances of alleged inadequate representation. Each is closely related to a different claim of error, and has been considered and rejected in connection with that claim. For instance, defendant's claim that his counsel was ineffective for not objecting to the prosecutor's use of the word \"murder\" to describe the homicides was discussed earlier in conjunction with defendant's claim that the prosecutor committed misconduct by doing so. (See pt. II. M., ante.) \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Most of the claims of incompetence involve actions by counsel that were objectively reasonable. As to the remainder of these claims, any possible ineffectiveness by counsel was harmless. Considered either individually or collectively, the instances of alleged ineffectiveness noted by defendant do not show that counsel engaged in unprofessional conduct that undermines our confidence in the outcome of the trial. ( Strickland v. Washington, supra, 466 U.S. at p. 694.)\n\nR. Instructional Error\n\n1. Felony-murder rule\n\nThe trial court instructed the jury that it could convict defendant of first degree murder under the felony-murder rule if it found that he had committed a robbery or burglary and that he or an accomplice had killed a person in the course of that crime, even if the victim was killed unintentionally or by accident. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Defendant makes the bare assertion that the felony-murder rule is unconstitutional because it permits a defendant who lacks the intent to kill to be convicted of first degree murder. He gives no reasons in support of this argument, nor does he identify any provision of either the state or the federal Constitution that he perceives to be violated by the felony-murder rule. He therefore has not shown that the felony-murder rule is unconstitutional.\n\nDefendant also argues that by instructing the jury that it could convict him of first degree murder even if it did not find that he had the intent to kill, the trial court may have led the jury to believe that it could also find the special circumstance allegations to be true without finding that defendant harbored the intent to kill. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e We disagree. The court explicitly instructed the jury: \"A special circumstance must be proved beyond a reasonable doubt, and you must unanimously agree that the defendant intended that a human being be killed.\" Furthermore, the court explained to the jury that the special circumstance allegations and the felony-murder rule differed in that the former required intent to kill while the latter did not. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e These instructions left no possibility of confusion.\n\nFinally, defendant contends that his murder convictions should be reversed because the trial court did not, on its own initiative, instruct the jury that if one person kills in the perpetration of a burglary or robbery while acting alone, a defendant who thereafter aids and abets the burglar or robber may not be convicted of first degree murder under the felony-murder rule. We disagree.\n\nDefendant relies primarily on People v. Pulido (1997) 15 Cal. 4th 713. There, we held that section 189's first degree felony-murder rule does not apply to \"late joiners\" who participate in the felonious enterprise only after the murder has been completed. (15 Cal. 4th at p. 726; see also People v. Esquivel (1994) 28 Cal. App. 4th 1386.) We had no occasion to decide whether the trial court was obligated to instruct on late joiners on its own initiative, because the jury necessarily found that the defendant in that case was not a late joiner when it found true a robbery-murder special-circumstance allegation. ( People v. Pulido, supra, at pp. 726-727.) The same is true in this case.\n\nHere, as in People v. Pulido, the trial court instructed the jury that it could only find the burglary-murder and robbery-murder special-circumstance allegations true if it found that the murders were committed \"while the defendant was engaged in or was an accomplice in\" a burglary or robbery. Moreover, as previously explained, the trial court also instructed the jury that it could not find the special circumstance allegations true unless it found that defendant himself acted with the intent to kill. Thus, by finding the special circumstance allegations true, the jury necessarily found that defendant's participation in the crimes herein began before the victims were killed. As a result, \"'the factual question posed by the omitted instruction was necessarily resolved adversely to defendant under other, properly given instructions'\" ( People v. Pulido, supra, 15 Cal. 4th at p 726), and reversal is not required.\n\n2. Proof of mental state\n\nThe trial court gave the jury a standard instruction on how to evaluate circumstantial evidence of defendant's mental state. (CALJIC No. 2.02 (4th ed. 1979).) \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e The instruction included this sentence: \"If . . . one interpretation of the evidence as to such specific intent or mental state appears to you to be unreasonable and the other interpretation to be reasonable it would be your duty to accept the reasonable interpretation and to reject the unreasonable.\" (Italics added.)\n\nDefendant argues that this instruction, because of its use of the word \"appears,\" is inconsistent with the requirement, under the due process clause of the 14th Amendment to the federal Constitution, that a defendant may be convicted only if the jury finds guilt to be proven beyond a reasonable doubt. ( Cage v. Louisiana (1990) 498 U.S. 39, 112 L. Ed. 2d 339, 111 S. Ct. 328.) To tell the jury that it must accept a \"guilty interpretation of the evidence\" if it \" appears to be reasonable,\" defendant contends, is providing the jury with a standard of proof that is well below the requirement of proof beyond a reasonable doubt.\n\nWe rejected a similar contention in People v. Jennings (1991) 53 Cal. 3d 334, 386, 279 Cal. Rptr. 780, 807 P.2d 1009: \"The plain meaning of [this] instruction[] merely informs the jury to reject unreasonable interpretations of the evidence and to give the defendant the benefit of any reasonable doubt. No reasonable juror would have interpreted [this] instruction[] to permit a criminal conviction where the evidence shows defendant was 'apparently' guilty, yet not guilty beyond a reasonable doubt.\" (See also People v. Hawkins (1995) 10 Cal. 4th 920, 954-955, 897 P.2d 574; People v. Freeman, supra, 8 Cal. 4th 450, 506; People v. Noguera (1992) 4 Cal. 4th 599, 634, 842 P.2d 1160 [all rejecting identical claim].)\n\nDefendant also contends that because the instruction used the word \"duty,\" it operated as \"an impermissible mandatory, conclusive presumption of guilt upon a finding that a guilty interpretation of the evidence 'appears to be reasonable . . . .' \" This contention, too, we rejected in People v. Jennings, supra, 53 Cal. 3d at page 386.\n\nDefendant further argues that CALJIC No. 2.90 (4th ed. 1979), a standard instruction defining reasonable doubt that was given by the trial court in this case, is constitutionally defective because it contains the terms \"moral evidence\" and \"to a moral certainty.\" Both this court ( People v. Freeman, supra, 8 Cal. 4th at pp. 501-505) and the United States Supreme Court ( Victor v. Nebraska (1994) 511 U.S. 1, 127 L. Ed. 2d 583, 114 S. Ct. 1239) have rejected this claim.\n\n3. CALJIC Nos. 8.83 and 8.83.1\n\nDefendant asked the trial court to instruct the jury pursuant to CALJIC No. 8.83 (Special Circumstances -- Sufficiency of Circumstantial Evidence -- Generally) and CALJIC No. 8.83.1 (Special Circumstances -- Sufficiency of Circumstantial Evidence to Prove Required Mental State). The court refused to do so. Defendant now complains that the court committed prejudicial error. We disagree. The two instructions, each of which discusses the sufficiency of circumstantial evidence to prove special circumstance allegations, were duplicative of another instruction (CALJIC No. 2.01) by the court telling the jury how to evaluate circumstantial evidence generally. This was precisely the reason for the court's refusal to give the instructions requested by the defense, a decision in which defense counsel acquiesced when, following the court's explanation, he responded: \"That's fine.\"\n\n4. CALJIC No. 2.11.5\n\nThe trial court instructed the jury: \"There has been evidence in this case indicating that a person other than defendant was or may have been involved in the crime for which the defendant is on trial. You must not discuss or give any consideration as to why the other person is not being prosecuted or whether he has been or will be prosecuted.\"\n\nDefendant contends that this pattern instruction (CALJIC No. 2.11.5) was incomplete and therefore erroneous. He relies on People v. Farmer (1989) 47 Cal. 3d 888, 254 Cal. Rptr. 508, 765 P.2d 940. In that case, we said that CALJIC No. 2.11.5 \"would be more informative and might better deter speculation if it told the jury explicitly that its sole duty is to decide whether this defendant is guilty and that there are many reasons why someone who also appears to have been involved might not be a codefendant in this particular trial.\" (47 Cal. 3d at pp. 918-919.) We concluded, however, that the instruction \"accurately states the law\" and is therefore not misleading. ( Id. at p. 919.) Thus, the trial court in this case did not err by giving this instruction.\n\n5. Lesser included offenses\n\nOn the charge that defendant murdered Kathryn Roberts, the trial court instructed the jury on the lesser included offense of voluntary manslaughter. The court told the jury, however, that voluntary manslaughter was not an option on the count charging defendant with the murder of Donna Roberts.\n\nDefendant contends that his trial counsel was ineffective for failing to ask the trial court to instruct the jury on lesser offenses included within the charged crime of murder of Donna Roberts. Although defendant does not specify such lesser offenses, we assume he is referring to the voluntary manslaughter instruction that the trial court gave on the charged offense of murder of Kathryn Roberts.\n\nThe evidence at trial provided no basis for an instruction on voluntary manslaughter as to the murder of Donna Roberts. She was bound, gagged, and shot through the head at close range. There was no evidence from which the jury could have concluded that defendant killed her in a \"sudden quarrel or heat of passion\" ( § 192, subd. (a)) or in the unreasonable but good faith belief in the necessity of self-defense ( People v. Flannel (1979) 25 Cal. 3d 668, 160 Cal. Rptr. 84, 603 P.2d 1). Thus, an instruction on voluntary manslaughter would not have been appropriate. (See People v. Barton (1995) 12 Cal. 4th 186, 196, fn. 5, 906 P.2d 531.) Consequently, defense counsel did not render ineffective assistance for not requesting such an instruction.\n\nIII. PENALTY PHASE ISSUES\n\nA. Jury Misconduct\n\n1. Defendant's telephone calls to jurors\n\nAfter the jury returned its guilt phase verdict convicting defendant of murder with special circumstances, but before the beginning of the penalty phase, the trial court received information that defendant had made a telephone call to Juror Elizabeth Bahr. The court summoned counsel and asked Juror Bahr to explain what had happened. She responded that when she answered the phone, defendant identified himself and asked if Bahr was on the jury. Bahr said she was; defendant then asked, \"Did you hear all the evidence?\" \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Bahr replied she had. She then said she did not want to talk to defendant and hung up. Initially Bahr was upset about the call, but she later decided that \"it was okay.\" The trial court took no further action at that time because defendant was not present. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nA week later, rejecting defendant's request that the jurors be individually questioned to determine which of them had received telephone calls, the trial court asked the entire jury panel, in defendant's presence, whether any of them had received calls \"reported to be from [defendant] or [from] an interested party in the case.\" Juror Bahr and Juror David Craig said they had received calls. The court told the jury that there was \"nothing sinister in all this,\" but that it wanted to question the two jurors briefly in chambers \"to complete the record.\" Juror Bahr then repeated, outside the presence of the other jurors, her account of her conversation with defendant, and said that after receiving the call she had notified the police. She stated that she was not frightened by defendant's telephone call, but that she had told her daughter, who was \"a little bit perturbed.\" She had not told other jurors about the call, and did not think it had impaired her ability to fairly Judge defendant's case.\n\nThereafter, the court questioned Juror Craig. He said his wife had answered the telephone and told him that he had a collect call from defendant. Craig told his wife not to accept the call. He then called the sheriff. Although Juror Craig said the call \"was upsetting at the time,\" his initial concern arose from a fear that the call was made by a friend of defendant who was out of custody and might be planning an act of retaliation. He became less worried when he learned that defendant himself had made the call. He saw no reason why he could not remain as a juror on the case.\n\nNeither defendant nor the prosecutor asked the court to excuse either Juror Bahr or Juror Craig, and the two jurors remained on the panel.\n\nDefendant now raises three claims of error arising from this series of events.\n\nFirst, defendant contends that the trial court's inquiry to the jurors about the telephone calls \"prejudiced the entire panel.\" He asserts that in asking the jurors collectively whether they had received calls concerning the case, and receiving affirmative responses from Jurors Bahr and Craig, the trial court revealed that it was defendant who had made the calls. Not so. In asking the jurors whether they had received a call \" reported to be from [defendant] or [from] an interested party in the case,\" the court carefully phrased its question to the jury in a manner that did not reveal whether any juror had received a call from defendant himself. Furthermore, the court stressed that there was \"nothing sinister\" in the calls, and that it was questioning the jurors only \"to complete the record.\" We perceive no error.\n\nSecond, defendant asserts that Juror Bahr engaged in misconduct by accepting the telephone call from defendant, that Jurors Bahr and Craig engaged in misconduct by discussing the calls with others (Juror Bahr told her daughter about the call; Juror Craig reported the call to the sheriff's office and apparently discussed it with his wife), and that defense counsel was incompetent for not objecting to the alleged misconduct. Defendant is barred from complaining about any conceivable misconduct by Juror Bahr in accepting his call because he invited any \"misconduct\" by making the telephone call in the first place. (See People v. Williams (1988) 44 Cal. 3d 1127, 1156, 245 Cal. Rptr. 635, 751 P.2d 901 [\"As a matter of policy, a defendant is not permitted to profit from his own misconduct.\"].) Nor did Jurors Bahr and Craig act improperly when they discussed the calls with others: although they were not permitted to discuss the facts of defendant's case with others, this prohibition did not extend to the telephone calls he made to them. Thus, defense counsel was not ineffective for failing to object.\n\nFinally, defendant faults the trial court for not ascertaining whether the other jurors' ability to be impartial had been impaired by the disclosure of the telephone calls to Jurors Bahr and Craig. We find no error. The court had no reason to believe that, except for Jurors Bahr and Craig, any of the jurors knew that defendant had made the calls. Because there was no indication or suggestion that the jury's impartiality had in any way been impaired, there was no need for the court to question the panel further.\n\n2. Discharge of Juror Yoder\n\nMidway through the penalty phase of the trial, Juror Gene Yoder told the trial court, outside the presence of the other jurors, that when he had left the courthouse in his car on one occasion two to three weeks earlier, another car had followed him home. When Yoder realized he was being followed, he made a U-turn and drove towards the pursuing car. Looking inside, he saw three people. Thereafter, when Larry Wilson (a prosecution witness who had been a friend of defendant) testified at the penalty phase, Yoder identified Wilson as one of the persons he had seen in the car. The court asked Yoder to remain on the jury while it investigated the matter, and asked the prosecutor to request Wilson to return to court.\n\nThat afternoon, the trial court questioned Wilson in Juror Yoder's presence, but outside the presence of the other jurors. Wilson denied that he had followed Yoder home. Juror Yoder insisted that he still believed that Wilson had been in the car that followed him, and said that he had told Jurors Peterson and Kambas about the incident.\n\nWith the agreement of both the prosecutor and defendant, the trial court discharged Juror Yoder. The court told the jury that the discharged occurred because of \"a matter of some concern to [Yoder] and his wife,\" but that it believed the matter was \"a case of mistaken identity\" and that it had \"no reason to think there is anything of a sinister nature.\"\n\nLater, the trial court questioned Jurors Kambas and Peterson outside the presence of the other jurors. Both jurors said that there was nothing in what Juror Yoder had told them that would impair their abilities to fairly Judge the case, and the court commented that it believed Yoder had misidentified Wilson. Neither juror was discharged.\n\nDefendant faults the trial court for not asking Jurors Kambas and Peterson whether they had discussed with other jury members the claim of Juror Yoder that he had been followed, and for not telling these two jurors not to discuss the matter with other jurors. The trial court did not err. Neither Juror Kambas nor Juror Peterson regarded Juror Yoder's comments to them as a cause for concern, and the trial court had no reason to believe that they would discuss those comments with other jurors in a manner that would impair the ability of other jurors to deliberate fairly. The trial court was also careful to allay any possible fears of other jurors by telling them that Juror Yoder's concerns appeared to be \"a case of mistaken identity.\" We note that the defense did not ask the court to further question or to admonish Jurors Kambas and Peterson, and never requested that they be discharged. Indeed, lead counsel stated that he was \"totally satisfied\" with the court's actions.\n\nAccording to defendant, the combined effect of the telephone calls to Jurors Bahr and Craig and the episode involving Juror Yoder was that the entire jury panel was \"tainted by fear,\" either of defendant himself or of witness Wilson. The record, however, does not support this speculation.\n\nDefendant also complains that his trial counsel was ineffective because he did not object to Juror Yoder's \"misconduct\" (presumably referring to the fact that Yoder discussed the fact that he had been followed with Jurors Kambas and Peterson), and failed to ask for a mistrial or a new jury for the penalty phase of the trial. Counsel was not ineffective: Juror Yoder committed no act of misconduct by mentioning to the court his belief that he had been followed. Thus, there was no basis for counsel to move for a mistrial or to request a new jury.\n\n3. Juror Upton's consultation with her pastor\n\nDuring jury selection, defense counsel asked prospective juror Beatrice Upton about the views of her church (the Assembly of God) on capital punishment, and if selected as a juror whether those views would affect her ability to be fair. Upton responded that she would have to speak to her pastor to find out her church's stand on the death penalty. After further inquiry from the trial court, Upton said that because she was \"active in the church\" and \"in leadership,\" she felt that \"whatever I would say would always represent the church.\" She was uncertain whether this would impair her ability to obey the trial court's instructions.\n\nThe court then took a brief recess to handle an unrelated matter. When jury selection resumed, Upton mentioned that during the recess she had telephoned the head of her church's Bible school, and was told that there was nothing in the literature published by the Assembly of God on the issue of capital punishment, \"and that, if anything, scripturally, it is for capital punishment.\" Based on this conversation, Upton believed that she would have no difficulty voting either for or against the death penalty in defendant's case. Upton was not challenged by the prosecution or the defense, and she served as a juror.\n\nDefendant argues that the trial court should have dismissed Upton from the panel of prospective jurors because of her \"misconduct\" in asking a member of her church about the church's stand on capital punishment. Defendant, however, accepted the jury, including Juror Upton, when he had seven of his twenty peremptory challenges remaining; this suggested that he did not believe that any \"misconduct\" by Upton had impaired her ability to fairly sit in judgment. (See People v. Carpenter, supra, 15 Cal. 4th at p. 361.) In any event, Upton's telephone call, which occurred weeks before the beginning of trial and brought no extrinsic materials into the deliberative process, was not misconduct.\n\nDefendant also accuses the trial court of misconduct \"when it suggested that Juror Upton might discuss the matter with her pastor.\" The court, however, never suggested that Upton should talk to her pastor.\n\nB. Issues Relating to the Admission of Evidence\n\n1. Admission of weapon found in defendant's jail cell\n\nThe prosecution presented evidence that while defendant was in custody awaiting trial, Sacramento County Sheriff's deputies searched his cell, finding a plastic inmate-made knife concealed in defendant's mattress. Defendant argues that this evidence should have been excluded because the prosecution offered no evidence that defendant knew of the knife's presence. He also contends that regardless of whether he was aware of the knife, his possession of the knife was not admissible under section 190.3, factor (b). This statutory provision permits the prosecution at the penalty phase of a capital case to introduce evidence of \"criminal activity by the defendant which involves the use or attempted use of force or violence or the express or implied threat to use force or violence.\" Here, defendant notes, the prosecution offered no evidence that he ever held or used the knife.\n\nDefendant's failure to object to admission of the knife at trial bars him from raising the issue. ( People v. Champion, supra, 9 Cal. 4th at p. 923.) As to defendant's argument that his counsel was ineffective for not objecting, he is wrong. \"It is settled that a defendant's knowing possession of a potentially dangerous weapon in custody is admissible under [section 190.3,] factor (b). Such conduct is unlawful and involves an implied threat of violence even where there is no evidence defendant used or displayed it in a provocative or threatening manner. [Citations.] The trier of fact is free to consider any 'innocent explanation' for defendant's possession of the item, but such inferences do not render the evidence inadmissible per se.\" ( People v. Tuilaepa (1992) 4 Cal. 4th 569, 589, 842 P.2d 1142.) In this case, the jury could reasonably infer from the knife's presence in defendant's mattress that defendant knowingly possessed the knife. Thus, an objection by defense counsel to admission of the knife into evidence would have been futile.\n\n2. Testimony that defendant used a sawed-off shotgun\n\nAs previously mentioned (see pt. I.C., ante), prosecution witnesses David Frye and Larry Wilson testified that defendant had pointed a sawed-off shotgun at Frye and threatened to shoot him. After defense witness Lisa Smith testified that the weapon was not a shotgun but a flare gun that was as large as a shotgun, Sacramento Police Detective Marc Hensley testified in rebuttal that there are no flare guns as large as a shotgun.\n\nDefendant contends that none of the prosecution witnesses qualified as an expert in weaponry, and therefore they should not have been permitted to identify the type of gun that defendant had pointed at Frye. Because defendant failed to object to the testimony of these witnesses at trial, he is barred from challenging it on appeal. ( People v. Champion, supra, 9 Cal. 4th at p. 923.) Also, defense counsel cannot be faulted for not objecting. Shotguns are sufficiently within common experience; therefore, Frye and Wilson could properly identify the weapon they saw as a shotgun. (See Evid. Code, § 800.) And Detective Hensley's testimony was based on his experience with flare guns while serving four years as an air crewman in the United States Navy and during his twelve years as a police officer.\n\n3. Testimony that defendants in murder cases may be violent\n\nAs previously mentioned (see pt. I.C., ante), Deputy Scott French testified he had heard defendant threaten that if he ever found Deputy Cooper alone, defendant would \"beat his ass down.\" On cross-examination, defense counsel asked French, \"But yet you didn't know any reason why [defendant] would be particularly defiant or angry at Officer Cooper?\" French replied, \"Well, kind of like you said earlier with special treatment. The only reason why that [ sic ] we take extra caution with people that are going to murder trials is because they are possibly going to be violent.\"\n\nAccording to defendant, Deputy French's \"blanket statement that murder defendants are going to be violent\" violated his \"constitutional right to an individualized evaluation and sentencing.\" Defendant's failure to object to the officer's answer at trial precludes him from raising the issue on appeal. In any event, although it was not responsive to the question asked by defendant, the officer's observation that jailers are particularly careful with defendants in murder cases because they are \"possibly going to be violent\" was an innocuous comment that in no way impaired defendant's right to an individualized penalty determination.\n\n4. Statements by defendant to sheriff's deputies\n\nAs explained earlier (see pt. I.C., ante), the prosecution presented evidence that defendant had made threats and engaged in other misconduct directed at sheriff's deputies at the jail where he was incarcerated pending his trial.\n\nDeputy Warren testified that on the day after defendant's arrest defendant used profanity and disobeyed Warren's order that he stand on a yellow line and face the wall with his hands in his pockets. Later that day, when police technicians tried to photograph defendant to determine whether he had suffered injuries that might be relevant to the charges against him, defendant became argumentative and hostile, so that Warren had to physically restrain him. Defendant said that Deputy Warren \"would be sorry [he] ever saw\" defendant. After the photographs were taken, defendant threatened to throw bars of soap at Warren. Later that day, when Warren encountered defendant in the jail lobby, defendant said: \"I am going to kill you. This is a threat. You're dead.\" Six months later, during a search of the property in defendant's cell, defendant told Deputy Warren, \"Stop going through my stuff or I will kick you in the face.\"\n\nDeputy French testified he heard defendant say of Deputy James Cooper that defendant would \"beat his ass down\" and that \"his days are short.\" Officer Cooper testified that he and defendant had had several \"verbal altercations,\" and that on one occasion defendant threatened, \"I am going to fuck you up.\"\n\nIn closing argument, the prosecutor argued that when making the threats discussed above, defendant had violated section 69, which prohibits \"attempts, by means of any threat or violence, to deter or prevent an executive officer from performing any duty imposed upon such officer by law. . . .\" Therefore, the prosecutor contended, the threats were \"criminal activity . . . which involved the . . . express or implied threat to use force or violence\" ( § 190.3, factor (b)) that the jury could consider as evidence in aggravation.\n\nDefendant argues that the trial court should have concluded that these threats were improperly admitted because the prosecutor failed to give notice that he intended to use them as evidence in aggravation. ( § 190.3) But defendant did not object to the officers' testimony on this ground, and he therefore may not now raise the issue. ( People v. Pinholster (1992) 1 Cal. 4th 865, 956, 824 P.2d 571.) We also reject defendant's contention that his counsel was incompetent for failing to object to evidence of the threats on this ground. Although the prosecutor's written notices do not mention the threats, the prosecutor may well have told defense counsel that he intended to use the statements long before trial. In any event, the ordinary remedy for lack of notice is a continuance to enable the defendant to counter the prosecution's evidence. ( People v. Carrera (1989) 49 Cal. 3d 291, 334, 261 Cal. Rptr. 348, 777 P.2d 121.) The record does not show that a continuance in this case would have led to the discovery of additional information that would have enabled defendant to respond more effectively to the prosecution's evidence.\n\nDefendant further asserts that none of the threats violated section 69, because in each instance he lacked the intent and present ability to interfere with any officer in the performance of his duties. Thus, he contends, the threats were not admissible under section 190, factor (b) as \"criminal activity . . . which involved the express or implied threat to use force or violence.\" (See People v. Boyd (1985) 38 Cal. 3d 762, 772, 215 Cal. Rptr. 1, 700 P.2d 782 [construing factor (b) as limited to conduct that violates a penal statute].) Defendant, however, did not object on this ground in the trial court, and therefore is precluded from raising this issue on appeal. ( People v. Pinholster, supra, 1 Cal. 4th at p. 960.) Nevertheless, we address it on the merits because, anticipating our rejection of his contention on this ground, defendant argues that his counsel was incompetent for failing to object.\n\nThere was substantial evidence that defendant's threats to Deputy Warren violated section 69. Defendant made three threats to Warren. The first was made while defendant was resisting attempts to photograph him and Warren was restraining him. From defendant's comment that Warren \"would be sorry [he] ever saw\" defendant, the jury could reasonably infer that the purpose of this threat was to prevent Warren from restraining defendant. Later that day, defendant made a second threat when he expressly said he would kill Deputy Warren. The jury could reasonably have found that this was another attempt to discourage Deputy Warren from attempting to make defendant obey the rules of the jail. Defendant argues that when he made these threats, he lacked the present ability to carry them out. But a present ability to carry out threats is not required if, as here, the target of the threat could reasonably fear retaliatory action on some future occasion. (See People v. Walker (1988) 47 Cal. 3d 605, 639, 253 Cal. Rptr. 863, 765 P.2d 70 [courtroom threat by incarcerated capital defendant to \"get me a D.A.\" satisfied all elements of section 69].) On the third occasion, defendant threatened to kick Deputy Warren if he persisted in searching defendant's property. To prevent defendant from carrying out this threat, Warren walked defendant to the end of the hallway before completing the search. The jury could reasonably believe that defendant had the intent and ability to carry out the threat.\n\nWith respect to the threatening comments defendant made regarding Deputy Cooper, however, the evidence does not show that they violated section 69. Defendant's comment that Cooper's \"days were short\" was not directed toward Cooper but to other inmates, and therefore was not made with the specific intent to deter or prevent Cooper from performing his duties, as required by section 69. ( People v. MacKenzie (1995) 34 Cal. App. 4th 1256, 1280; In re M.L.B. (1980) 110 Cal. App. 3d 501, 503, 168 Cal. Rptr. 57.) Although defendant's statement that \"I am going to fuck you up\" was made directly to Deputy Cooper, the latter could not recall the circumstances under which the statement was made. Thus, the record does not show that defendant made this statement for the purpose of deterring Deputy Cooper from performing his duties. Nevertheless, counsel's failure to object to these statements was harmless. ( Strickland v. Washington, supra, 466 U.S. 668 at p. 694.) The statements were relatively insignificant, as the trial court noted at the time of sentencing, and in any event were cumulative to the properly admitted evidence regarding defendant's threats toward Deputy Warren. (See People v. Tuilaepa, supra 4 Cal. 4th at pp. 589-591; People v. Pinholster, supra, 1 Cal. 4th at pp. 961-963.)\n\nDefendant challenges the constitutionality of section 69, contending it is overbroad on its face because it punishes the exercise of constitutionally protected speech, and overbroad as applied to him because he did not have the immediate ability to carry out his threats at the time he made them. At trial, defendant did not attack the constitutionality of section 69. Nevertheless, we will consider the issue on the merits because it involves \"a pure question of law which is presented by undisputed facts.\" ( Hale v. Morgan (1978) 22 Cal. 3d 388, 394, 149 Cal. Rptr. 375, 584 P.2d 512.) Pertinent here is an observation we made in a recent decision: \"As long as the threat reasonably appears to be a serious expression of intention to inflict bodily harm [citation] and its circumstances are such that there is a reasonable tendency to produce in the victim a fear that the threat will be carried out,\" a statute proscribing such threats \"is not unconstitutional for lacking a requirement of immediacy or imminence.\" ( In re M.S. (1995) 10 Cal. 4th 698, 714, 896 P.2d 1365.) Thus, threats may be constitutionally prohibited even when there is no immediate danger that they will be carried out. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nAdditionally, defendant argues that section 69 is void for vagueness because \"the appellate courts cannot agree whether mere speech, some act, or a violent act is required to establish a violation of Section 69.\" We find no such disagreement. Section 69 prohibits two distinct types of activity -- threats and violent conduct -- when either activity constitutes an attempt \"to deter or prevent an executive officer from performing any duty imposed upon such officer by law.\" \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Plainly, the statute does not require that a defendant engage in both threats and violent conduct. Defendant asserts that People v. Patino (1979) 95 Cal. App. 3d 11, 27, 156 Cal. Rptr. 815, and People v. Buice (1964) 230 Cal. App. 2d 324, 336, 40 Cal. Rptr. 877, hold to the contrary. They do not.\n\n5. Cumulative effect of errors\n\nDefendant argues that considered collectively, the alleged errors in admission of evidence at the penalty phase of his trial, discussed above, created a risk that the jury's imposition of the death penalty was not reliable, in violation of the Eighth and Fourteenth Amendments to the United States Constitution. Because we have found no errors in the admission of evidence, this claim fails.\n\nC. Prosecutorial Misconduct\n\nDefendant contends that the prosecutor in his closing argument to the jury engaged in various instances of misconduct.\n\n1. Asking jury to consider nonstatutory factors\n\nIn his closing argument to the jury, the prosecutor called defendant: (1) \"arrogant, cold, and malicious\"; (2) a \"predator[]\"; (3) a \"thief\"; (4) \"defiant\"; (5) \"a perjurer and a liar\"; (6) a \"suborner of perjury\"; and (7) \"a drug trafficker and . . . a runner.\" Defendant argues that by making these characterizations, the prosecutor impermissibly asked the jury to impose the death penalty based on non-statutory aggravating factors. (See People v. Boyd, supra, 38 Cal. 3d at pp. 773-774.)\n\nDefendant's failure to object at trial to these comments bars him from challenging them on appeal. ( People v. Mayfield (1997) 14 Cal. 4th 668, 801, 928 P.2d 485.) In any event, most of the remarks were proper. The first three characterizations were made in the course of fair comment on the evidence presented at trial and referred to the \"circumstances of the crime of which the defendant was convicted.\" ( § 190.3, factor (a).) Comments (4), (5), and (6) were an appropriate response to the evidence of defendant's good character offered by defense witness Frita Hines. (See People v. Noguera, supra, 4 Cal. 4th 599, 643-645, 842 P.2d 1160.) Any error arising from the prosecutor's passing comment that defendant was a \"drug trafficker and . . . a runner\" was harmless, as it is not reasonably possible that the outcome of the penalty phase would have been different had the comment not been made. ( Id. at p. 645.)\n\n2. Comment on prison life\n\nIn his closing argument to the jury, the prosecutor told the jury that \"any stereotypes that you've had about what prison life is like from the 1930's where they . . . are confined in their cells for 24 hours a day and then they march in long step to the mess hall, you can forget that.\" Defendant argues that this remark in essence asked the jury to consider prison conditions as a factor in reaching its penalty verdict. (See People v. Ray (1996) 13 Cal. 4th 313, 352, 914 P.2d 846 [defense prohibited from \"introducing evidence at the penalty phase concerning the daily routine and general conditions of confinement for inmates sentenced to life imprisonment without possibility of parole\"].) Defendant's failure to object at trial precludes him from now raising this issue. ( People v. Mayfield, supra, 14 Cal. 4th at p. 801.) Moreover, the comment was not improper. The prosecutor made this remark in closing argument after the defense first raised the issue of prison conditions by presenting to the jury Dr. Edward Grover's testimony that prison inmates are not \"warehoused\" and can lead productive lives. We consider the prosecutor's remarks fair comment on this testimony.\n\n3. Prosecutor's reading of passage from book\n\nDefendant contends that the prosecutor engaged in misconduct by reading, over defendant's objection, a passage from a book in closing argument. Although defendant claims that the passage injected evidence outside the record into the closing argument, this was not the case. Rather, the passage expressed the view that at a murder trial the victim is often forgotten because the focus of the trial is on the defendant. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e The prosecutor used the passage as part of his argument that the jury should not forget the victims in this case or what defendant did to them. The trial court did not abuse its discretion when it permitted the prosecutor to read the passage in question. (See People v. Rowland (1992) 4 Cal. 4th 238, 277 \u0026 fn. 17, 841 P.2d 897 [Rejecting claim that by reading the same quotation at issue here, the prosecutor \"suggested that the 'judicial system unfairly protects the defendant at the expense of ignoring the victim.' \"].)\n\n4. Prosecutor's argument regarding the absence of mitigating evidence\n\nDefendant contends that the prosecutor improperly argued that because there was no evidence of certain statutory mitigating factors, the jury should consider those factors as aggravating. ( People v. Champion, supra, 9 Cal. 4th at p. 939; People v. Davenport (1985) 41 Cal. 3d 247, 289, 221 Cal. Rptr. 794, 710 P.2d 861.) Because the defense did not object to the prosecutor's statements, it has not preserved this issue for consideration on appeal. ( People v. Champion, supra, 9 Cal. 4th at p. 939.) In any event, defense counsel acted properly in not objecting. The prosecutor explained to the jury why, in his view, each of the various potentially mitigating factors was \"not applicable.\" He never suggested that the lack of mitigating evidence transformed them into factors in aggravation. (Compare with People v. Edelbacher (1989) 47 Cal. 3d 983, 1034, 254 Cal. Rptr. 586, 766 P.2d 1 [when defense offered no evidence of statutory mitigating factors, prosecutor in his closing argument improperly relied on a chart listing the factors as aggravating].) There was thus no impropriety in the prosecutor's remarks.\n\n5. Prosecutor's argument regarding mitigating evidence\n\nAccording to defendant, the prosecutor improperly argued that the jury should consider as evidence in aggravation the mitigating evidence defendant presented pertaining to his character and background. (See People v. Edelbacher, supra, 47 Cal. 3d at p. 1033 [\"Evidence of a defendant's character and background is admissible . . . only to extenuate the gravity of a crime; it cannot be used as a factor in aggravation.\"].) Here, however, the prosecutor merely argued that the jury should not regard the testimony of defendant's witnesses as mitigating; he did not ask the jury to view their testimony as aggravating. In any event, defendant has not preserved this issue for appellate review because of his failure to object to the prosecutor's remarks at trial. ( People v. Lucas, supra, 12 Cal. 4th 415, 495.)\n\nD. Defendant's Claim of Ineffective Assistance of Counsel\n\nThe defense called Dr. Edward Grover to testify at the penalty phase of trial. As previously mentioned (see pt. I.D., ante), Dr. Grover testified defendant suffered from an \"antisocial personality disorder,\" which is associated with poor bonding between mother and child at an early age. He concluded that if sentenced to prison for life without the possibility of parole, defendant would be likely to \"mellow\" within 10 years, and that ultimately defendant could be expected to lead a productive life in prison.\n\nDefendant argues that Dr. Grover's testimony benefited the prosecution, and that to the extent it was based on Dr. Grover's interview with defendant, it was obtained in violation of his Fifth Amendment privilege against self-incrimination. This evidence, however, did not violate that privilege because it was offered by defendant on his own behalf.\n\nDefendant also appears to argue that his counsel's decision to call Dr. Grover to testify constituted ineffective assistance of counsel. The record does not support that claim. \"When, as here, counsel's reasons are not apparent from the record, we will not assume inadequacy of representation unless counsel had no conceivable tactical purpose.\" ( People v. Diaz (1992) 3 Cal. 4th 495, 558, 834 P.2d 1171.) Although reasonable minds could differ on the beneficial value of Dr. Grover's testimony to the defense (see Whitmore v. Lockhart (8th Cir. 1993) 8 F.3d 614, 617 [defense counsel not ineffective for failing to introduce evidence, during penalty phase, of the defendant's antisocial personality disorder]), counsel could reasonably have believed that on balance the benefits of Dr. Grover's testimony that defendant's disorder was one associated with poor maternal bonding at an early age, and that defendant would be likely to \"mellow\" in prison, would outweigh any harm resulting from Dr. Grover's statement that defendant had an \"antisocial personality disorder.\" It is not at all uncommon for defendants in capital cases to present such testimony. (See, e.g., People v. Davis (1995) 10 Cal. 4th 463, 528, 896 P.2d 119; People v. Clark (1993) 5 Cal. 4th 950, 976, 857 P.2d 1099; People v. Clark (1992) 3 Cal. 4th 41, 153, 833 P.2d 561; People v. Beardslee (1991) 53 Cal. 3d 68, 117, 279 Cal. Rptr. 276, 806 P.2d 1311; People v. Benson (1990) 52 Cal. 3d 754, 769, 276 Cal. Rptr. 827, 802 P.2d 330; People v. McLain (1988) 46 Cal. 3d 97, 105, 249 Cal. Rptr. 630, 757 P.2d 569.)\n\nE. Instructional Issues\n\n1. Uncharged crime\n\nThe trial court instructed the jury that if it found that defendant had committed the crime of assault with a deadly weapon on David Frye, it could consider that fact as a circumstance in aggravation. Defendant argues that the record contained no evidence that he committed this crime. He reasons that there was no evidence that the gun he pointed at Frye was loaded, and that he therefore lacked the \"present ability to commit a violent injury on the person\" of another. ( People v. Bekele (1995) 33 Cal. App. 4th 1457, 1463; People v. Schwartz (1992) 2 Cal. App. 4th 1319, 1325; see § 240.) The prosecution did, however, present evidence that the gun was loaded: Larry Wilson specifically testified that defendant loaded the gun before Frye's arrival at the house where the assault occurred. Although defendant claims that this evidence was not credible because later in his testimony Wilson, citing the passage of time, expressed uncertainty about whether he had actually seen defendant load the gun, Wilson acknowledged that at the time the incident occurred he had told the police that he had seen defendant load the gun. There was thus substantial evidence from which the jury could conclude that the gun was loaded.\n\nThe trial court also instructed the jury that it could consider the evidence offered by the prosecutor regarding defendant's conduct at the jail while awaiting trial (see pt. III.B.4., ante) if it found, beyond a reasonable doubt, that this behavior violated section 69 (resisting an executive officer by threats or violence). Defendant asserts that the trial court should not have given this instruction, citing the same grounds that form the basis for his claim, previously addressed in part III.B.4, that the trial court should not have permitted the prosecutor to present evidence regarding his conduct at the jail. As we explained, there was evidence from which the jury could find that defendant's threats and physical resistance to Deputy Warren violated section 69. To the extent that the trial court's instruction also applied to defendant's other threatening statements, the error was harmless, as we explained in our Discussion of the admissibility of this evidence.\n\n2. Jury instructions requested by defendant\n\nDefendant challenges as error the trial court's refusal to give several special instructions he requested. We address each of these instructions separately.\n\n\"Special Instruction No. 2\" would have required all 12 jurors to agree on the existence of an aggravating factor before considering that factor in reaching the penalty verdict, and would have barred the jury from imposing a death sentence unless all 12 jurors believed beyond a reasonable doubt that the aggravating circumstances in the case outweighed the mitigating circumstances. The trial court correctly rejected the proposed instruction as inaccurate: As we have held, the jury need not unanimously agree on the truth of aggravating factors ( People v. Bacigalupo (1991) 1 Cal. 4th 103, 147, 820 P.2d 559), and the \"beyond a reasonable doubt\" standard used to determine guilt or innocence does not apply to the jury's penalty determination. ( People v. Visciotti (1992) 2 Cal. 4th 1, 67-68, 825 P.2d 388.)\n\nIn \"Special Instruction No. 3,\" defendant asked the trial court to instruct the jury that it should not weigh \"the deterrent or nondeterrent effect of the death penalty or the monetary cost to the State of execution or maintaining a prisoner for life\" in determining whether to impose life imprisonment or death. Because the prosecutor did not raise the issues of deterrence and cost at trial, the trial court properly refused to give this instruction. ( People v. Benson, supra, 52 Cal. 3d at p. 807.) Furthermore, any conceivable error in failing to give the instruction was harmless. (See People v. Bacigalupo, (supra) , 1 Cal. 4th at p. 146 [failure to give identical instruction not prejudicial because deterrence and cost were not emphasized at trial]; People v. Thompson (1988) 45 Cal. 3d 86, 132, 246 Cal. Rptr. 245, 753 P.2d 37 [same].)\n\n\"Special Instruction No. 4\" stated that the jury should not consider evidence that defendant committed a violent act unless it unanimously believed beyond a reasonable doubt that defendant committed that act. The proposed instruction was erroneous: Jury unanimity on such \"foundational\" matters is not required. ( People v. Miranda (1987) 44 Cal. 3d 57, 99, 241 Cal. Rptr. 594, 744 P.2d 1127; see also People v. Johnson (1992) 3 Cal. 4th 1183, 1245, 842 P.2d 1; People v. Taylor (1990) 52 Cal. 3d 719, 749, 276 Cal. Rptr. 391, 801 P.2d 1142.)\n\n\"Special Instruction No. 5\" was a reworded version of CALJIC No. 8.84.1 (1986 rev.) that the trial court gave in this case, and explained to the jury the statutory factors in aggravation and mitigation set forth in section 190.3. Defendant's proposed instruction omitted aggravating factors (b) (violent criminal acts) and (c) (prior felony convictions), rephrased most of the statutory mitigating factors in a manner favorable to defendant, and added several additional factors in mitigation. The trial court properly concluded that CALJIC No. 8.84.1 was a more accurate description of the law than the instruction requested by defendant.\n\n\"Special Instruction No. 6\" would have instructed the jury that it could consider in mitigation a variety of specific facts presented by defendant during the penalty phase. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e The trial court properly refused to give this proposed instruction as it was argumentative, that is, \"of such a character as to invite the jury to draw inferences favorable to one of the parties from specified items of evidence.\" ( People v. Gordon, supra, 50 Cal. 3d at p. 1276; see also People v. Fauber, supra, 2 Cal. 4th at pp. 865-866; People v. Cooper, supra, 53 Cal. 3d at p. 844.)\n\n\"Special Instruction No. 7\" invited the jury to consider the disparity in sentence between defendant and his accomplice, Randal Houseman, in deciding whether to impose the death penalty. The proposed instruction was inaccurate, for a sentence imposed on a codefendant is irrelevant to the jury's penalty determination. ( People v. Danielson (1992) 3 Cal. 4th 691, 717-718, 838 P.2d 729; People v. Belmontes (1988) 45 Cal. 3d 744, 810-813, 248 Cal. Rptr. 126, 755 P.2d 310.)\n\n\"Special Instruction No. 8\" would have instructed the jury that it could consider \"lingering doubt\" regarding defendant's guilt in determining the appropriate penalty. The proposed instruction was unnecessary. The trial court instructed the jury that in making its penalty determination, it could consider \"the circumstances of the crime of which defendant was convicted in the present proceeding and the existence of any special circumstance found to be true\" ( § 190.3, factor (a)), and \"any other circumstance which extenuates the gravity of the crime, even though it is not a legal excuse for the crime, and any sympathetic or other aspect of the defendant's character or record that the defendant offers as a basis for a sentence less than death, whether or not related to the offense for which he is on trial\" (id., factor (k)). These instructions sufficiently encompassed the concept of lingering doubt, and the trial court was under no duty to give a more specific instruction. ( People v. Osband (1996) 13 Cal. 4th 622, 716, 919 P.2d 640; People v. Sanchez (1995) 12 Cal. 4th 1, 78, 906 P.2d 1129; People v. Price, (supra) , 1 Cal. 4th at p. 489.) The court properly permitted defendant to argue to the jury that it should not impose the death penalty if it had \"lingering doubts\" regarding defendant's guilt.\n\n\"Special Instruction No. 9\" requested by defendant stated: (1) the jury should not limit its consideration of mitigating factors to those factors specifically listed by the trial court; (2) mitigating circumstances need not be proven beyond a reasonable doubt, and the jury \"must find that a mitigating circumstance exists if there is any substantial evidence to support it\"; (3) a single mitigating circumstance may outweigh all the aggravating factors; and (4) the jury could use \"mercy, sympathy or sentiment\" in deciding how to weigh each mitigating factor. Part (1) of the proposed instruction was duplicative of an instruction given by the trial court that the jury could consider \"any other circumstance which extenuates the gravity of the crime even though it is not a legal excuse for the crime and any sympathetic or other aspects of the defendant's character or record that the defendant offers as a basis for a sentence less than death, whether or not related to the offense for which he is on trial.\" Part (2) of the proposed instruction is unnecessary and erroneous, as we explained when we upheld a trial court's refusal to give a similar instruction in People v. Bonillas (1989) 48 Cal. 3d 757, 790, 257 Cal. Rptr. 895, 771 P.2d 844. (See also People v. Garceau (1993) 6 Cal. 4th 140, 208, 862 P.2d 664; People v. Carpenter, supra, 15 Cal. 4th at pp. 417-418.) Part (3) of the requested instruction is argumentative, because it states that a single mitigating circumstance may be dispositive without saying the same about a single aggravating circumstance. ( People v. Mickey (1991) 54 Cal. 3d 612, 697, 286 Cal. Rptr. 801, 818 P.2d 84.) Part (4) of the proffered instruction was included in the trial court's oral instructions to the jury: \"The law does permit you specifically at this stage to be influenced by mercy or sentiment or sympathy for a defendant in arriving at a proper penalty in the case.\"\n\n\"Special Instruction No. 10\" requested by defendant stated that a verdict of life without possibility of parole means that \"the defendant will be imprisoned for the rest of his life\" and the death penalty means that \"the defendant will be executed\"; for jurors to conclude otherwise, the instruction stated, \"would be to rely on conjecture and speculation and would be a violation of your oath as trial jurors.\" In People v. Mickey, supra, 54 Cal. 3d at pages 700-701, we held that such an instruction is inaccurate: \" 'It is . . . incorrect to tell the jury the penalty of death or life without possibility of parole will inexorably be carried out . . . .' \"\n\n\"Special Instruction No. 11\" would have told the jury that if it had a reasonable doubt whether to impose the death penalty or life without possibility of parole, it must impose the latter sentence. This proposed instruction, like defendant's \"Special Instruction No. 2\" we discussed earlier, was inaccurate because the \"beyond a reasonable doubt\" standard does not apply to the jury's penalty determination. ( People v. Visciotti, supra, 2 Cal. 4th at pp. 67-68.)\n\n\"Special Instruction No. 12\" would have told the jury that it was not required to reach a verdict, and that the possibility of a hung jury is an \"inevitable byproduct\" of the unanimous jury requirement. We have never suggested that trial courts should give such an instruction on request. In this case, however, the trial court orally supplemented its written instructions with comments that incorporated the essence of Special Instruction No. 12: \"Nothing I have said requires you to reach a unanimous verdict. That is, before you reach a verdict you would be required to be unanimous. We're not going to keep you here forever until you arrive at a unanimous verdict. We expect you to do your best to seek to achieve a verdict, if you can.\"\n\n\"Special Instruction No. 13\" requested by defendant was a modified version of CALJIC No. 8.84.2 (1986 rev.) given by the trial court. The requested instruction stated that the jury was \"not permitted to consider any factor as aggravating unless it is specified on the list of [aggravating] factors,\" but that there was \"no limitation\" on what the jury could consider as mitigating. It would have told the jury that it could \"consider pity, sympathy, or mercy for the defendant in deciding on the appropriate penalty.\" It also said, \"If a mitigating circumstance or an aspect of the defendant's background or his character, called to your attention by the evidence or your observations of Gary Hines, arouses sympathy or compassion such as to persuade you that death is not the appropriate penalty, you shall act in response thereto and impose a punishment of life without the possibility of parole . . . .\" It further stated that the jury need not impose the death sentence even if it concluded that the factors in aggravation so substantially outweighed those in mitigation that a death sentence was justified.\n\nDefendant's proposed instruction added nothing of significance to the instruction given, CALJIC No. 8.84.2, and it was less \"balanced\" or neutral in tone. We have previously held that a trial court need not instruct the jury that it may impose a sentence of life without the possibility of parole even if the jury has concluded that the circumstances in aggravation outweigh those in mitigation. ( People v. Beeler, supra, 9 Cal. 4th at p. 997; People v. Edwards (1991) 54 Cal. 3d 787, 842, 819 P.2d 436.)\n\nF. Verdict Forms\n\nAt the penalty phase, the trial court submitted two verdict forms to the jury. One form read: \"We the jury in the above entitled cause find the penalty shall be life imprisonment without possibility of parole.\" The other read: \"We, the jury in the above-entitled cause, find that the penalty shall be death.\" Defendant points out that although the jury had convicted him of two counts of murder with special circumstances, the verdict forms did not require the jury to return a separate verdict of life without possibility of parole or death on each count. Accordingly, he argues, the judgment of death must be reversed \"because it cannot be determined whether the jury unanimously voted the punishment of death . . . on any single count.\"\n\nWe rejected a similar contention in People v. Crittenden, supra, 9 Cal. 4th 83. In that case, we held that at a penalty trial after a defendant has been convicted of multiple counts of capital murder, the trial court may employ separate verdict forms for separate counts but is not required to do so. In determining whether to impose the death penalty, we said a jury may consider \"the circumstances of the crime of which the defendant was committed\" ( § 190.3, factor (a)), and need not unanimously agree on the particular factual circumstances or aspects of the case that render death the appropriate penalty. Accordingly, we concluded the jury need not unanimously agree as to which of the murders committed warrants the death penalty, so long as the jury unanimously agrees that death is the appropriate penalty. ( Crittenden, supra, at p. 159.) Under Crittenden, therefore, the trial court in this case did not err when it did not submit to the jury separate penalty verdicts for each count of murder.\n\nG. Trial Court's Response to Jury's Questions\n\nDuring its penalty deliberations, the jury submitted to the trial court three written questions:\n\n\"1. If the jury finds that the penalty should be death, what sentence would apply if the death penalty law is ruled unconstitutional or if changed by voters as an initiative?\n\n\"2. Can our penalty decision be modified through any part of the appeal process? a) Can a death penalty be reduced to a penalty of life imprisonment without possibility of parole? b) Can a penalty of life imprisonment without possibility of parole be reduced to a lesser term of imprisonment?\n\n\"3. What happens if the jury becomes hopelessly deadlocked? a) Does the Judge make a penalty decision? b) Is a mistrial declared? (And what will happen if a mistrial is declared) c) Other possibility?\"\n\nAfter consulting with counsel, the trial court decided to answer the first and second questions, but not the third. Beginning with the jury's inquiry as to whether its penalty decision could be modified, the court gave a lengthy discourse, taking up over five pages of transcript. The court explained that the framers of the death penalty law intended to make the law \"as firm and unshakable as they possibly could\" in ensuring that sentences of death or life without parole, if imposed by the jury, would be carried out. Accordingly, the court continued, the law provides that no parole board, board of prison terms or other administrative agency has the power to modify such sentences, and it was \"theoretically possible\" that this court could overturn the jury's sentence or that the Governor could pardon defendant. It stressed, however, that the jury should not speculate on the possibility of a pardon. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nIn response to the jury's inquiry as to the sentence that would be imposed if the death penalty law were ruled unconstitutional or changed by the voters, the trial court again gave a lengthy response. It told the jury that \"nobody can say for sure what's going to happen,\" but that the last time the United States Supreme Court declared the death penalty unconstitutional, the decision had \"a very broad effect of wiping out the death penalty cases then in the pipeline . . . .\" If the voters were to alter the death penalty law, the court said, \"I won't try to predict what will happen, because there are various ways it could be written. More or less attention given to retroactivity.\" The court then explained that the last time the electorate amended the death penalty law, in 1978, cases in which the offense had occurred before the new law was enacted were tried under the previous law. The court emphasized that none of these matters should affect the jury's deliberations in this case. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nAfter telling the jury that it could not answer the jury's third question, regarding the effect of a hung jury, the trial court again told the jury to \"assume the law will work,\" and not to speculate about what might happen in the future. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nDefendant argues that by telling the jury that a death sentence could be reduced by commutation or by a decision of this court, the trial court improperly minimized the jury's sense of responsibility for determining whether death was the appropriate sentence. We disagree.\n\nIn People v. Ramos (1984) 37 Cal. 3d 136, 207 Cal. Rptr. 800, 689 P.2d 430, we held that a trial court generally should not instruct (absent a defense request) on the Governor's commutation power. As we explained, however, this rule is inapplicable if the jury itself raises the issue: \"When the jury raises the commutation issue itself -- either during voir dire or in a question posed to the court during deliberations -- the matter obviously cannot be avoided and is probably best handled by a short statement indicating that the Governor's commutation power applies to both sentences [death or life without possibility of parole] but emphasizing that it would be a violation of the juror's duty to consider the possibility of such commutation in determining the appropriate sentence.\" ( Id. at p. 159, fn. 12.) Since Ramos, we have held in several cases that trial courts in capital cases did not err by answering a jury question generally related to the commutation power in the manner suggested above. ( People v. Davis, supra, 10 Cal. 4th at pp. 546-547; People v. Whitt (1990) 51 Cal. 3d 620, 655-657, 274 Cal. Rptr. 252, 798 P.2d 849; People v. Hunter (1989) 49 Cal. 3d 957, 980-983, 264 Cal. Rptr. 367, 782 P.2d 608.)\n\nIn this case the questions posed by the jury did not explicitly refer to the Governor's commutation power. The issue was implicit, however, in the jury's question whether its penalty could be modified \"through any part of the appeal process.\" (See People v. Hunter, supra, 49 Cal. 3d at pp. 980-983 [commutation instruction appropriate when jury asked, \"under what circumstances could [defendant] be released from prison?\"].) Thus, the trial court appropriately concluded that the instruction suggested by Ramos, supra, 37 Cal. 3d at page 159, footnote 12, was called for. The court correctly instructed the jury that the Governor had the power to commute either a death sentence or a sentence of life without possibility of parole, but that it would be \"improper\" and \"a violation of your duty as jurors\" to consider the possibility of a pardon or commutation in determining the appropriate penalty.\n\nOur decision in Ramos, supra, 37 Cal. 3d 136, did not discuss the manner in which a trial court should respond when, as here, a jury inquires whether its penalty determination can be overturned either by the voters or by this court. We find no error, however, in the court's response to this question, which acknowledged both possibilities, but urged the jury not to speculate on the matter. Although we do not recommend a lengthy Discussion of the question as occurred here, we conclude that the court's Discussion did not prejudice defendant, because it was accompanied by an admonition that the jury should not consider these matters in arriving at its penalty determination.\n\nDefendant notes that the trial court never explicitly admonished the jury not to speculate about the possibility that his sentence might be overturned on appeal. He argues that by telling the jury not to speculate about the possibility that the Governor might commute defendant's sentence, without a similar admonition regarding the possibility that this court might reverse his sentence on appeal, the trial court encouraged the jury to speculate on the possible actions of this court. We disagree. The trial court's remarks, viewed as a whole, correctly exhorted the jury to do its job and not to speculate about what any other person or persons, including this court, might do at some time in the future. It is not reasonably possible that the jury could have viewed the remarks as encouraging it to speculate on the likely outcome of defendant's appeal.\n\nDefendant asserts that the trial court's comments did not provide the jury with accurate information concerning the likelihood of commutation and parole. He points out that in California a sentence of a person (such as defendant) who has twice been convicted of a felony may be commuted only if four Justices of this court so recommend. The trial court, he complains, did not mention this to the jury. We find no error. The trial court properly did not attempt to describe for the jury the precise statutory requirements controlling the Governor's exercise of the commutation power, because they were irrelevant to the jury's penalty determination. As we said when rejecting a similar claim in People v. Carpenter, supra, 15 Cal. 4th at page 360: \"There was no need to discuss the law of commutation exhaustively and good reason not to stress defendant's record.\"\n\nContrary to defendant's contention, the trial court's response to the jury's questions does not resemble the instruction at issue in Hamilton v. Vasquez (9th Cir. 1994) 17 F.3d 1149. There, the federal court held that a California trial court's commutation instruction, given without any inquiry by the jury on the matter, prejudiced the defendant because it implied that he would be eligible for parole in less than 17 years, an inaccuracy compounded when the prosecutor told the jury that the defendant, if sentenced to prison, would be \" 'conniving and devising ways to manipulate the system and get out.' \" ( Id. at pp. 1162-1163.) \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Here, by contrast, the trial court told the jury that \"no parole board . . . or anything with a similar function . . . has the power to reduce either one of those penalties [death or life without possibility of parole],\" and the prosecutor never suggested that defendant would find a way to get out of prison.\n\nDefendant asserts that the trial court's comments were \"inherently contradictory in that the jury was told to assume that future governors will perform their constitutional [commutation] duties in the correct and responsible manner . . . while, in the same breath, urging them not to speculate.\" He does not explain the nature of the alleged contradiction. We see no inconsistency or impropriety in a trial court's statement to the jury to assume that future Governors will not abuse their powers of commutation, and not to speculate on how those powers would be exercised.\n\nFinally, defendant contends that by refusing to answer the jury's question what would happen if it was unable to reach a verdict, the trial court prevented the jury from being fully informed as to the consequences of its actions, thereby violating defendant's constitutional right to a fair trial as well as the provision in section 1138. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e As we have explained in previous decisions, an instruction explaining the consequences of a hung jury \"would have the potential for unduly confusing and misguiding the jury in their proper role and function in the penalty determination process.\" ( People v. Belmontes, supra, 45 Cal. 3d at p. 814; see also People v. Thomas, supra, 2 Cal. 4th at p. 539; People v. Morris (1991) 53 Cal. 3d 152, 227, 279 Cal. Rptr. 720, 807 P.2d 949.) Thus, in this case the trial court did not err when it refused to answer the jury's question.\n\nH. Cumulative Errors\n\nDefendant argues that as a result of the cumulative effect of the errors at the guilt and penalty phases, his trial lacked the \"fundamental fairness\" mandated by the Eighth and Fourteenth Amendments to the federal Constitution. We disagree. Whether considered separately or in combination, the few errors that occurred during defendant's trial, as discussed earlier, were inconsequential.\n\nIV. POSTTRIAL AND CONSTITUTIONAL ISSUES\n\nA. Search of Defendant's Cell\n\nOn February 20, 1988, just before the start of jury selection, defense counsel informed the trial court that defendant's cell had been searched by officers who \"just entered his cell, started scattering his papers around,\" and \"started reading some of his mail,\" including correspondence between defendant and counsel. Counsel did not ask the court to take action, saying only that he would look into the matter.\n\nDefense counsel made no further mention of the incident until July 5, 1988, after the completion of the penalty phase of trial, but before the trial court's imposition of sentence. In an ex parte hearing, defense counsel asserted that the searching officers had seized certain documents from defendant. These documents, which were returned to defendant by the jail a few days before the ex parte hearing, included a declaration that had been presented to the trial court under seal as part of defendant's opposition to the prosecution's motion to join his case with that of his accomplice, Randal Houseman, and that described in detail the defense theory of the case. Counsel made no specific motion, explaining, \"it's just the propensity for some wrong being done here is the reason I bring this to the Court's attention.\" The trial court refused to take any action ex parte, suggested that the matter be considered on July 8, 1988, when the prosecutor would be present, and ordered that the prosecutor be given a transcript of the ex parte hearing.\n\nOn July 8, the trial court asked the prosecutor to comment on the possibility that the trial was \"tainted by improper receipt of an action on confidential attorney/client material from the defense . . . .\" The prosecutor replied that he was \"absolutely unaware that [the jail] confiscated anything of a confidential nature\" and that he \"never received any type of oral, written or any other form of communication from any source whatsoever\" that would give him \"any insight as to what the defense was going to be.\" Defendant did not ask for and the trial court did not take any action.\n\nDefendant contends that the seizure of his legal papers by jail officials violated his constitutional right to privacy and his \"right to keep secure defense documents.\" Assuming for the sake of argument improper action by jail personnel, defendant has not preserved this issue for appeal, as he made no motion of any kind regarding the matter in the trial court. Moreover, there is no evidence that the seizure had any effect on defendant's trial, because, as discussed above, the prosecutor did not know of the seizure of defendant's papers.\n\nB. Motion to Modify the Death Penalty\n\nBefore ruling on the automatic motion to modify penalty ( § 190.4, subd. (e)), the trial court said that it had read and considered the probation report. Although, as defendant points out, the court should not have done so ( People v. Lewis (1990) 50 Cal. 3d 262, 287, 266 Cal. Rptr. 834, 786 P.2d 892), the error was harmless. Because the trial court did not mention any material in the probation report when giving its reasons for denying the modification motion, we must assume that it was not improperly influenced by the report. ( People v. Cudjo (1993) 6 Cal. 4th 585, 636, 863 P.2d 635; People v. Bacigalupo, supra, 1 Cal. 4th at p. 150.)\n\nDefendant argues that when it denied the motion for modification, the trial court improperly considered defendant's drug use and young age to be factors in aggravation. The record belies defendant's contention. With respect to defendant's drug use, the trial court said: \"I'm thinking of it, I think, for whatever mitigation I can give. It, perhaps, explains some of the cold blooded nature of what went on.\" (Italics added.) The trial court did not mention defendant's age when ruling on the modification motion, but when sentencing defendant on his noncapital crimes it observed that defendant's age was a mitigating factor.\n\nC. Constitutionality of the California Death Penalty Scheme\n\nDefendant characterizes the California death penalty scheme as unconstitutional because it does not require the jury to specify the facts and circumstances relied upon to conclude that the defendant should be sentenced to death, thus precluding \"any meaningful individualized determination at the penalty phase or appellate review of that determination,\" and failing \"to ensure that the jury reached its result rationally instead of through prejudice, fear, and caprice . . . .\" We have repeatedly rejected this contention (see, e.g., People v. Champion, supra, 9 Cal. 4th at pp. 950-951; People v. Rodriguez (1986) 42 Cal. 3d 730, 777, 230 Cal. Rptr. 667, 726 P.2d 113; People v. Frierson (1979) 25 Cal. 3d 142, 178-180, 158 Cal. Rptr. 281, 599 P.2d 587) and do not reconsider it here.\n\nDefendant also contends that the death penalty sentencing scheme violates his state and federal constitutional rights to equal protection and due process because there is a disparity between the statutory procedure for other felony sentences, which requires the trial court to give reasons for its sentencing choices, and the death penalty sentencing scheme, which requires no such reasons. We rejected such a claim in People v. Medina (1990) 51 Cal. 3d 870, 910, 274 Cal. Rptr. 849, 799 P.2d 1282.\n\nDefendant further asserts that the California death penalty scheme violates the federal Constitution's guarantee of due process and its prohibition of cruel and unusual punishment because the jury is not required to find unanimously and beyond a reasonable doubt, and to indicate on the record, the specific aggravating circumstances upon which it has sentenced a defendant to death. We have in previous decisions rejected this argument. (See, e.g., People v. Hardy (1992) 2 Cal. 4th 86, 214, 825 P.2d 781; People v. Sully (1991) 53 Cal. 3d 1195, 1251-1252, 283 Cal. Rptr. 144, 812 P.2d 163.)\n\nFinally, defendant challenges California's death penalty scheme as unconstitutional because it does not require: (1) written findings as to the aggravating factors selected by the jury; (2) proof beyond a reasonable doubt of aggravating factors; (3) jury unanimity on aggravating factors; (4) a finding that aggravating factors outweigh mitigating factors beyond a reasonable doubt; (5) a finding that death is the appropriate punishment beyond a reasonable doubt; (6) a procedure to enable a reviewing court to meaningfully evaluate the sentencer's decision; and (7) a presumption that life without the possibility of parole is the appropriate sentence. He concedes that we have previously rejected these claims, but urges us to reconsider them. We decline to do so.\n\nD. Proportionality Review\n\nAccording to defendant, application of the death penalty in his case is disproportionate to his personal culpability, and is therefore cruel or unusual punishment, in violation of article I, section 17 of the California Constitution. (See People v. Dillon (1983) 34 Cal. 3d 441, 478-489, 194 Cal. Rptr. 390, 668 P.2d 697; In re Lynch (1972) 8 Cal. 3d 410, 105 Cal. Rptr. 217, 503 P.2d 921.) He points out that he was only 20 years old when he committed the murders, and that he had no prior history of violence.\n\nTo determine whether a sentence is cruel or unusual as applied to a particular defendant, a reviewing court must examine the circumstances of the offense, including its motive, the extent of the defendant's involvement in the crime, the manner in which the crime was committed, and the consequences of the defendant's acts. The court must also consider the personal characteristics of the defendant, including age, prior criminality, and mental capabilities. ( People v. Dillon, supra, 34 Cal. 3d at p. 479.) If the court concludes that the penalty imposed is \"grossly disproportionate to the defendant's individual culpability\" (ibid.), or, stated another way, that the punishment \" ' \"shocks the conscience and offends fundamental notions of human dignity\" ' \" ( People v. Cox (1991) 53 Cal. 3d 618, 690, 280 Cal. Rptr. 692, 809 P.2d 351), the court must invalidate the sentence as unconstitutional.\n\nHere, the imposition of the death sentence is not cruel or unusual punishment. Defendant and his 16-year-old companion entered their victims' home, bound and gagged a 15-year-old girl and brutally beat her mother. They shot each victim four times; to ensure death, they shot each victim behind the ear at close range. They then drove around Sacramento in the roadster they had stolen from the victims' home, showing it off to their friends. Not once during this time did defendant display the slightest remorse for the murders. That defendant played a dominant role in the planning and commission of the crimes can be reasonably inferred from circumstantial evidence: Defendant was four years older than his sixteen-year-old companion, he had repeatedly expressed a desire to obtain the victims' roadster, he was familiar with the victims' house, and he had been seen with the gun that was most likely the murder weapon. Although young -- 20 -- at the time of the murders, defendant already had 2 prior felony convictions, both for burglary. Given all of these facts, defendant's sentence is not disproportionate to his personal culpability.\n\nDefendant also argues that his death sentence violates the proportionality standards of the Eighth Amendment to the federal Constitution \"because the penalty has been imposed by a jury that has not considered the absence of any prior violent history.\" He faults defense counsel for not offering evidence to show defendant's lack of previous violence. Defendant's prior history did show violent conduct. As discussed earlier (see pt. I.C., ante) the prosecution offered evidence at the penalty phase that defendant pointed a cocked and loaded sawed-off shotgun at David Frye, threatening to blow off Frye's head. Defendant's presentence probation report notes that he had a misdemeanor conviction for brandishing a weapon, apparently arising from his encounter with Frye. Given this violent incident, counsel cannot be faulted for not offering evidence at trial that defendant had no prior record of violence.\n\nE. Reduction of Sentence\n\nDefendant urges this court, based on our authority under section 1181, subdivision 7 \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e and section 1260, \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e to reduce his death penalty to a sentence of life without possibility of parole.\n\nNo majority opinion of this court has addressed the applicability of these statutes to an appeal of a capital case since the current death penalty law was enacted by the Legislature in 1977 and modified by the electorate the following year. (But see People v. Lucero (1988) 44 Cal. 3d 1006, 1034-1036, 245 Cal. Rptr. 185, 750 P.2d 1342 (conc. and dis. opn. of Mosk, J.); People v. Holt (1984) 37 Cal. 3d 436, 463-464, 208 Cal. Rptr. 547, 690 P.2d 1207 (conc. and dis. opn. of Mosk, J.).) Numerous cases decided under California's previous capital punishment scheme, however, held that section 1260 and subdivision 7 of section 1181 do not give this court the power to substitute its judgment as to choice of penalty for that of the trier of fact, and that the court may not reduce a capital defendant's sentence from death to life imprisonment simply because it disagrees with the jury's penalty determination. ( In re Anderson (1968) 69 Cal. 2d 613, 623, 73 Cal. Rptr. 21, 447 P.2d 117; People v. Lookadoo (1967) 66 Cal. 2d 307, 327, 57 Cal. Rptr. 608, 425 P.2d 208; People v. Mitchell (1966) 63 Cal. 2d 805, 821, 48 Cal. Rptr. 371, 409 P.2d 211; People v. Howk (1961) 56 Cal. 2d 687, 699-701, 16 Cal. Rptr. 370, 365 P.2d 426; People v. Monk (1961) 56 Cal. 2d 288, 300, 14 Cal. Rptr. 633, 363 P.2d 865; People v. Rittger (1960) 54 Cal. 2d 720, 734-735, 7 Cal. Rptr. 901, 355 P.2d 645; People v. Cash (1959) 52 Cal. 2d 841, 845, 345 P.2d 462; People v. Green (1956) 47 Cal. 2d 209, 235, 302 P.2d 307; see also People v. Odle (1951) 37 Cal. 2d 52, 230 P.2d 345.) Section 1260 and subdivision 7 of section 1181 have not been altered significantly since those cases were decided.\n\nWhen the Legislature reinstated the death penalty in 1977, it provided in section 190.4 that the trial court should automatically consider whether to modify any sentence of death under section 1181, subdivision 7. Section 190.4 contained no suggestion that we should do the same on appeal. Instead, it provided: \"The denial of the modification of a death penalty verdict pursuant to subdivision (7) of Section 1181 shall be reviewed on the defendant's automatic appeal . . . .\" (Stats. 1977, ch. 316, § 12, p. 1261.) The electorate left this portion of section 190.4 unchanged when it revised the statute as part of the \"Briggs Initiative\" in 1978. Under the statutory language, our role is to review the trial court's ruling on a defendant's modification motion for error, rather than to independently evaluate whether the evidence shows that the defendant's sentence of death is appropriate. The Legislature and the electorate thus have acquiesced in the numerous decisions of this court, cited above, holding that we lack the power to overturn a judgment of death simply because we disagree with the jury's penalty determination. We therefore see no reason to reconsider those decisions. Absent prejudicial error or legal insufficiency of evidence, this court must uphold the jury's verdict of death.\n\nConclusion\n\nFor the reasons set forth above, we affirm the judgment, including the sentence of death, in its entirety.\n\nKENNARD, J.\n\nWE CONCUR:\n\nGEORGE, C.J.\n\nBAXTER, J.\n\nWERDEGAR, J.\n\nCHIN, J.\n\nBROWN, J.\n\nCONCURRING OPINION BY MOSK, J.\n\nI concur in the judgment.\n\nI write separately to state, and to explain, my adherence to the view that we have \"authority under Penal Code sections 1181, subdivision 7, and 1260,\" to \"reduce [a] sentence from death to life imprisonment without possibility of parole . . . .\" ( People v. Heishman (1988) 45 Cal. 3d 147, 206, 246 Cal. Rptr. 673, 753 P.2d 629 (conc. and dis. opn. of Mosk, J.); accord, People v. Ramirez (1990) 50 Cal. 3d 1158, 1202-1203, 270 Cal. Rptr. 286, 791 P.2d 965 (conc. and dis. opn. of Mosk, J.); People v. Allison (1989) 48 Cal. 3d 879, 918, 258 Cal. Rptr. 208, 771 P.2d 1294 (conc. and dis. opn. of Mosk, J.); People v. Adcox (1988) 47 Cal. 3d 207, 277, 253 Cal. Rptr. 55, 763 P.2d 906 (conc. and dis. opn. of Mosk, J.); People v. Coleman (1988) 46 Cal. 3d 749, 789, 251 Cal. Rptr. 83, 759 P.2d 1260 (conc. and dis. opn. of Mosk, J.); People v. Lucero (1988) 44 Cal. 3d 1006, 1034-1036, 245 Cal. Rptr. 185, 750 P.2d 1342 (conc. and dis. opn. of Mosk, J.); People v. Coleman (1985) 38 Cal. 3d 69, 98, 211 Cal. Rptr. 102, 695 P.2d 189 (dis. opn. of Mosk, J.); People v. Holt (1984) 37 Cal. 3d 436, 463-464, 208 Cal. Rptr. 547, 690 P.2d 1207 (conc. and dis. opn. of Mosk, J.); People v. Mabry (1969) 71 Cal. 2d 430, 446-449, 78 Cal. Rptr. 655, 455 P.2d 759 (conc. opn. of Mosk, J.).)\n\nPenal Code section 1181 (section 1181) deals with appellate courts, including this one, indirectly. It provides that, \"when a verdict has been rendered or a finding made against the defendant, the [trial] court may, upon his application, grant a new trial in [certain] cases only . . . .\" It specifies a number of circumstances. It lists one such in its subdivision 7: \"When the verdict or finding is contrary to law or evidence, but in any case wherein authority is vested by statute in the trial court or jury to recommend or determine as a part of its verdict or finding the punishment to be imposed, the court may modify such verdict or finding by imposing the lesser punishment without granting or ordering a new trial, and this power shall extend to any court to which the case may be appealed. . . .\" (Italics added.)\n\nPenal Code section 1260 (section 1260) deals with appellate courts directly. It provides that the appellate court \"may reverse, affirm, or modify a judgment or order appealed from, or reduce the degree of the offense or attempted offense or the punishment imposed, and may set aside, affirm, or modify any or all of the proceedings subsequent to, or dependent upon, such judgment or order, and may, if proper, order a new trial and may, if proper, remand the cause to the trial court for such further proceedings as may be just under the circumstances.\"\n\nIt is evident that section 1181, subdivision 7, and section 1260 are complementary. Section 1260 defines what an appellate court has authority to do. Under this provision, an appellate court may, among other things, \"reduce . . . the punishment imposed\" for an offense. For its part, section 1181, subdivision 7, defines, in part, when an appellate court has authority to do what it may. Under this provision, an appellate court may reduce the punishment imposed \"when [a] verdict or finding\" choosing between available statutory punishments is \"contrary to law or evidence\" -- specifically, it may \"modify such verdict or finding by imposing the lesser punishment.\"\n\nIt is also evident that section 1181, subdivision 7, and section 1260 are of general applicability. Certainly, they are not limited in their operation so far as they touch the death penalty law, which appears at Penal Code section 190 et seq. (section 190 et seq.). To quote section 1181, subdivision 7, the death penalty law is paradigmatic of provisions \"wherein authority is vested by statute in the trial court or jury to recommend or determine as a part of its verdict or finding the punishment to be imposed.\" Moreover, the death penalty law refers to section 1181, subdivision 7, and does so expressly. In section 190.4, subdivision (e), it provides in pertinent part that, \"in every case in which the trier of fact has returned a verdict or finding imposing the death penalty, the defendant shall be deemed to have made an application for modification of such verdict or finding pursuant to Subdivision 7 of Section 11 [ sic : read Section 1181]\" on the ground that it is \"contrary to law or the evidence presented.\"\n\nAlthough we do indeed have authority under section 1181, subdivision 7, and section 1260 to reduce a sentence from death to life imprisonment without possibility of parole, our power is limited. In passing on an automatic application for modification of a verdict or finding of death pursuant to section 190.4, subdivision (e), the trial Judge \"shall review the evidence, consider, take into account, and be guided by the aggravating and mitigating circumstances . . ., and shall make a determination as to whether\" the trier of fact's at least implicit verdict or finding \"that the aggravating circumstances outweigh the mitigating circumstances\" is \"contrary to law or the evidence presented.\" He must first give the evidence, which he received at trial, the weight he himself believes it deserves. (E.g., People v. Marshall (1990) 50 Cal. 3d 907, 942, 269 Cal. Rptr. 269, 790 P.2d 676.) He must then determine whether the trier of fact's at least implicit Conclusion that aggravation outweighs mitigation is contrary to law or evidence. In considering a request to reduce a sentence of death, we, like the trial Judge, must determine whether the trier of fact's at least implicit Conclusion that aggravation outweighs mitigation is contrary to law or evidence. But, unlike the trial Judge, we can do so only after viewing the evidence, which comes to us on a cold record, in the light most favorable to the punishment imposed. (Cf. People v. Longwith (1981) 125 Cal. App. 3d 400, 414-415, 178 Cal. Rptr. 136 [noncapital case].)\n\nFurthermore, although we do indeed have authority under section 1181, subdivision 7, and section 1260 to reduce a sentence from death to life imprisonment without possibility of parole, our exercise of such power will likely be rare. In passing on an automatic application for modification of a verdict or finding of death pursuant to section 190.4, subdivision (e), the trial Judge will presumably grant relief if indeed he should (cf. Evid. Code, § 664 [establishing a presumption that \"official duty has been regularly performed\"]) -- that is, if the trier of fact's at least implicit Conclusion that aggravation outweighs mitigation is, in fact, contrary to law or evidence. Hence, in considering a request to reduce a sentence of death, we shall have occasion to grant relief only in the assumedly uncommon situation in which the trial Judge has erroneously refused to do so.\n\nTo the extent that the majority state that we do not have authority under section 1181, subdivision 7, and section 1260 to reduce a sentence from death to life imprisonment without possibility of parole \"simply because we disagree with\" the trier of fact's choice (maj. opn., ante, at p. 91; accord, id. at p. 90), they are right. Pursuant to section 190.4, subdivision (e), we can do so only after we view the evidence in the light most favorable to the punishment imposed, and only if we then determine that the trier of fact's at least implicit Conclusion that aggravation outweighs mitigation is contrary to law or evidence.\n\nBut to the extent that the majority imply that we do not have authority under section 1181, subdivision 7, and section 1260 to reduce a sentence from death to life imprisonment without possibility of parole under any circumstances, they are wrong. In part, they argue inclusio unius est exclusio alterius : section 190.4, subdivision (e), requires the trial Judge automatically to decide whether to modify a verdict or finding of death; it does not require us automatically to consider whether to reduce a sentence of death but only to review the trial Judge's decision. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Such an argument comes up short. Perhaps one can infer that only the trial Judge must decide whether to modify a verdict or finding of death even in the absence of a request. But one simply cannot infer that we may only review the trial Judge's decision and may not reduce a sentence of death even in the presence of a request. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e In other part, the majority argue precedent. The decisions they cite find their source in People v. Odle (1951) 37 Cal. 2d 52, 230 P.2d 345. Odle held that we did not have authority to reduce a sentence of death. (37 Cal. 3d at pp. 55-59.) It may have been correct when it was decided. At that time, subdivision 7 in its present form had not yet been added to section 1181. (See Stats. 1933, ch. 520, § 1, p. 1341.) In other words, at that time, we did not yet possess the \"power\" to reduce the \"punishment . . . imposed\" for an offense \"when [a] verdict or finding\" choosing between available statutory punishments was \"contrary to law or evidence.\" Soon thereafter, however, we were given that very \"power\" through the addition to section 1181 of subdivision 7 in its present form. (Stats. 1951, ch. 1674, § 117, p. 3851.)\n\nEven though we do indeed have authority under section 1181, subdivision 7, and section 1260 to reduce a sentence from death to life imprisonment without possibility of parole, I would not exercise our power in this cause. Viewing the evidence in the light most favorable to the punishment imposed, I cannot determine that the jury's implicit Conclusion that aggravation outweighs mitigation is contrary to law or evidence.\n\nMOSK, J.\n\n\u003cspan class=\"fn\"\u003e1. Unless otherwise stated, all further statutory references are to the Penal Code.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The record contains no evidence that Houseman, who was separately tried and was also convicted of murder, had ever previously visited the Roberts residence. Defendant and Houseman were apparently not close friends, and had only known each other a short time before the murders in this case took place.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. In an in limine hearing, Williams testified that Donna Roberts told him that defendant was at the house, but the trial court excluded this statement by Donna as hearsay. (See pt. II.G., post.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The Attorney General challenges the propriety of the trial court's ruling that the statement was inadmissible. He contends that the statement was admissible either as a spontaneous declaration (Evid. Code, § 1240) or as a contemporaneous statement to explain the conduct of Donna Roberts (Evid. Code, § 1241). Because the prosecutor did not attempt to justify admission of the statement on either of these grounds, the Attorney General may not now assert them as a basis for challenging the trial court's ruling excluding the statement. ( People v. Fauber (1992) 2 Cal. 4th 792, 854, 831 P.2d 249; Lorenzana v. Superior Court (1973) 9 Cal. 3d 626, 640, 108 Cal. Rptr. 585, 511 P.2d 33.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eEven if the prosecutor had attempted to justify admission of the statement on these grounds, the trial court would not have abused its discretion in ruling that the statement was inadmissible. To be admissible as a spontaneous statement, a hearsay declaration must purport \"to narrate, describe, or explain an act, condition, or event perceived by the declarant\" and must be \"made spontaneously while the declarant was under the stress of excitement caused by such perception.\" (Evid. Code, § 1240.) \"The decision whether to admit a statement as a spontaneous utterance lies within the discretion of the trial court.\" ( People v. Pearch (1991) 229 Cal. App. 3d 1282, 1290, 280 Cal. Rptr. 584; see also People v. Gallego (1990) 52 Cal. 3d 115, 175, 276 Cal. Rptr. 679, 802 P.2d 169.) Here, the trial court could reasonably have concluded that Donna Roberts's identification of defendant in response to a question from Williams was not spontaneous (see People v. Poggi (1988) 45 Cal. 3d 306, 319, 246 Cal. Rptr. 886, 753 P.2d 1082 [whether a statement was made in response to a question is an important factor, though not dispositive, on \"the issue of spontaneity\"]) and that Williams's trial testimony that Donna Roberts sounded \"kind of nervous, scared like\" was insufficient to show that her statement was \"the instinctive and uninhibited expression of the speaker's actual impressions and belief.\" ( People v. Farmer (1989) 47 Cal. 3d 888, 903, 254 Cal. Rptr. 508, 765 P.2d 940; see also Pearch, supra, 229 Cal. App. 3d at pp. 1290-1291). The statement was not admissible to explain the conduct of Donna Roberts (Evid. Code, § 1241), as her conduct was not in issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. We also reject defendant's contention that his counsel was ineffective for failing to move for a mistrial following the prosecutor's opening statement. Such a motion would have been futile, given the trial court's refusal to admonish the jury to disregard the prosecutor's comments.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The facts relating to this conversation are described in greater detail in part III.A.1., post.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. We also reject defendant's contentions that the prosecution failed to establish a foundation for admission of the tape-recorded conversation and that Sergeant Coyle was erroneously permitted to testify as to his \"opinion\" that it was defendant (and not Houseman) who said: \"(Inaudible) night. Because, remember, I pulled those blankets over the steering wheel. Blanket wasn't -- it was back off the dash.\" On the first point, the record shows that Sergeant Coyle briefly described the circumstances under which the conversation between defendant and Houseman was taped. Had defendant believed this foundation was inadequate, it was incumbent upon him to bring the matter to the attention of the trial court, and he may not raise the issue for the first time on appeal. ( People v. Price, supra, 1 Cal. 4th at p. 430.) As for the admission of Sergeant Coyle's opinion, defendant's failure to make a proper objection at trial bars him from raising the issue on appeal. (See People v. Sims (1993) 5 Cal. 4th 405, 448.) In any event, the trial court specifically cautioned the jury that the identity of the person who made the statement was unclear, that a question mark appeared in that portion of the written transcript of the tape recording, and that it was for the jury to decide whose voice made that particular comment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. See also part II.D. (failure to object to inadvertent misstatements by the trial court); part II.G. (failure to move for mistrial when the prosecutor mentioned the Jiy Williams telephone call in his opening statement); part II.I. (failure to object to references to Randal Houseman's trial and conviction); part II.M. (failure to object to the form of the prosecutor's questions while cross-examining defendant), part II.R. (failure to request lesser included offense instructions for the killing of Donna Roberts).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The instruction in full read: \"If a human being is killed by any one of several persons engaged in the perpetration of, or attempt to perpetrate, the crime of robbery or burglary, all persons who either directly and actively commit the act constituting such crime or who with knowledge of the unlawful purpose of the perpetrator of the crime and with the intent or purpose of committing, encouraging, or facilitating the commission of the offense aid, promote, encourage, or instigate by act or advice its commission, are guilty of murder of the first degree, whether the killing is intentional, unintentional, or accidental.\" (See CALJIC No. 8.27 (4th ed. 1979) (1984 pocket pt.).)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. On September 15, 1986, when the murders in this case were committed, the multiple-murder, burglary-murder, and robbery-murder special circumstances all required the intent to kill. ( Carlos v. Superior Court (1983) 35 Cal. 3d 131, 197 Cal. Rptr. 79, 672 P.2d 862; People v. Ashmus (1991) 54 Cal. 3d 932, 981, 820 P.2d 214; In re Baert (1988) 205 Cal. App. 3d 514, 252 Cal. Rptr. 418.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The trial court told the jury: \"You can compare instructions 51 [felony murder] and 61 [felony-murder special circumstance] to see the difference between the mere finding of guilt of felony murder and the added finding of guilt under special circumstance of felony murder. The latter requires an intention that a human being be killed as well as the intention to commit the robbery. The former, the finding of guilty of first degree felony murder, only requires the intention to commit the underlying offense, even if the killing turns out to be unintentional or even accidental.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The full instruction read to the jury stated: \"The specific intent or mental state with which an act is done may be shown by the circumstances surrounding the commission of the act. But you may not find the defendant guilty of the offenses charged in Counts 1, 2, 3, 4, and 5, unless the proved circumstances not only are consistent with the theory that he had the required specific intent or mental state but cannot be reconciled with any other rational Conclusion. Also, if the evidence as to any such specific intent or mental state is susceptible of two reasonable interpretations, one of which points to the existence of the specific intent or mental state, and the other to the absence of the specific intent or mental state, it is your duty to adopt that interpretation which points to the absence of the specific intent or mental state. If, on the other hand, one interpretation of the evidence as to such specific intent or mental state appears to you to be reasonable and the other interpretation to be unreasonable it would be your duty to accept the reasonable interpretation and to reject the unreasonable.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Juror Bahr was 85 years old. During the trial, questions had arisen concerning her ability to hear the testimony of some witnesses. According to the prosecutor, officers working at the jail heard defendant bragging, after his telephone call to Juror Bahr, that she had told him that she was unable to hear all or some of the proceedings, and that she had only voted to convict him because she was \"pressured\" to do so.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Defendant was not brought to court because he had complained that he was ill. His claim that he was thereby denied his right to be present during the proceedings against him was addressed in part II.H., ante.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. We note that a defendant's threat may violate section 69 even if the officer who is the object of the threat does not in fact fear that it will be carried out. The statute requires only that the defendant make the threat for the purpose of inducing such fear, and to thereby deter or prevent the threatened officer from performing any legally imposed duty. (See People v. Superior Court (Anderson) (1984) 151 Cal. App. 3d 893, 897, 199 Cal. Rptr. 150.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Another portion of section 69 also makes it a crime to \"knowingly resist[], by the use of force or violence, [an] officer in the performance of his duty . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. This was the passage read by the prosecutor: \"When one person kills another, there is immediate revulsion at the nature of the crime. But in a time so short as to seem indecent, to the members of the personal family, the dead person ceases to exist as an identifiable person. To those individuals in this community of good will and empathy, warmth and compassion, only one of the key actors in the drama remains with whom to commiserate and that is always the criminal. The dead person ceases to be a part of everyday reality, ceases to exist. She is only a figure in a historic event. We inevitably turn away from the past toward the ongoing reality. And the ongoing reality is the criminal, trapped, anxious, desperate, belligerent. [He] usurps the compassion that justifiably belongs to his victim. He steals the victim's moral constituency along with her life.\" The prosecutor did not identify the author or the title of the work in which the quotation appeared.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. \"Special Instruction No. 6\" stated: \"In determining which penalty is to be imposed on Gary Hines you shall also consider, take into account, and be guided by the following mitigating factors related to the background of Mr. Hines if you find them applicable: (a) Any sympathetic or other aspect of Mr. Hines' character, background, history, family ties, mental condition, or physical condition that he offers as a basis for a sentence less than death, whether or not related to the offenses for which he is on trial, including, but not limited to, the following: (1) The age, immaturity, or lack of emotional development of Mr. Hines at the time of the crimes; (2) That he was left by his father; (3) That his mother was an alcoholic; (4) That he spend [ sic ] his formative years without any parental direction; (5) That he, himself, has a history of addiction to, or abuse of, narcotics, dangerous drugs, or other consciousness-altering substances; (6) That despite these problems he was a student who displayed no disciplinary problems; (7) That he has a history of gainful employment; (8) That he is remorseful; (9) The likelihood that he will not be a danger to others if sentenced to life imprisonment without possibility of parole; (10) The likely effect of a sentence of death on his family and friends; (11) His willingness and ability to comply with the terms of his sentence of life imprisonment without possibility of parole; (12) His potential for rehabilitation and for contributing affirmatively to the lives of his family, friends, and fellow inmates; (13) Any other sympathetic or other aspect of Mr. Hines' character or record that he offers as a basis for a sentence less than death, whether or not related to the offenses for which he is on trial.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Regarding the jury's duty not to speculate on the possibility of a pardon, the trial court said: \"I now instruct you, however, that it would be improper for you folks to speculate on the possibility of some action to be taken by a future governor. It would be improper as you carry out your present duties. It is not your function here in this proceeding to try to predict whether this defendant would ever be an appropriate subject for or a possible beneficiary of any act of pardon or commutation by some future governor some time in the future. So far as you're concerned, you are to decide only if this man shall be sentenced in this proceeding to the death penalty or the alternative, to a penalty of life imprisonment without possibility of parole. If upon consideration of all the evidence and . . . within the framework of the instructions that you received yesterday, you are able to reach one or the other of those two possible verdicts, you must assume that future governors will perform their constitutional duties in the correct and responsible manner. It would be a violation of your duty as jurors if you were to arrive at any penalty in this proceeding [--] either one of the two options you were instructed on [--] simply because of . . . one or more juror's speculation about or concern about the future exercise of the constitutional powers and duties by governor or appropriate officer.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Regarding the jury's duty not to consider possible changes in the law, the court said: \"I'm going to emphasize what I told you a couple minutes ago, it really would be improper for you to speculate or to base your decision on the matter before you[,] on some fear of and concern about suspicion that officials charged with the exercise of law, whether that could be members of the legislature or whatever, would be improper for you to speculate that there is going to be any improper undiligent performance of their duties. And so I would commend to your strong attention, don't get off on red herring issues like that. Just concentrate within the framework of the instructions you have gotten. See if you can arrive at a unanimous verdict between the options available to you today and don't let yourself get off on a side track of speculating what could happen in the future.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The court stated: \"Patronizing as it may sound in a way I'm telling you what the law tells you, do not base your verdict here on speculation, on trying to place your bets against future speculative possibilities on the assumption that the system will work in a sincere and proper and legal fashion and the people aren't out to torpedo it and don't try to draw up bogeyman instances of all bad things that could happen. Assume the law will work. You have an important part to play in it to try to make the decision and the specific question before you, but not to try to make provisions for all the future speculative possibilities.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. This court, however, found the trial court's commutation instruction in Hamilton's trial to be nonprejudicial because the court also told the jury not to consider the possibility of commutation or parole in its penalty determination. ( People v. Hamilton (1988) 45 Cal. 3d 351, 375, 247 Cal. Rptr. 31, 753 P.2d 1109.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The statute provides in relevant part: \"After the jury have retired for deliberation, . . . if they desire to be informed on any point of law arising in the case, they must require the officer to conduct them into court. Upon being brought into court, the information required must be given in the presence of, or after notice to, the prosecuting attorney, and the defendant or his counsel, or after they have been called.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Section 1181 provides in relevant part: \"When a verdict has been rendered or a finding made against the defendant, the court may, upon his application, grant a new trial, in the following cases only: . . . 7. When the verdict or finding is contrary to law or evidence, but in any case wherein authority is vested by statute in the trial court or jury to recommend or determine as a part of its verdict or finding the punishment to be imposed, the court may modify such verdict or finding by imposing the lesser punishment without granting or ordering a new trial, and this power shall extend to any court to which the case may be appealed; . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Section 1260 states: \"The court may reverse, affirm, or modify a judgment or order appealed from, or reduce the degree of the offense or attempted offense or the punishment imposed, and may set aside, affirm, or modify any or all of the proceedings subsequent to, or dependent upon, such judgment or order, and may, if proper, order a new trial and may, if proper, remand the cause to the trial court for such further proceedings as may be just under the circumstances.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eCONCURRING FOOTNOTES\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 In pertinent part, Penal Code section 190.4, subdivision (e), states: \"The denial of the modification of the death penalty verdict pursuant to subdivision (7) of Section 1181 shall be reviewed on the defendant's automatic appeal . . . . The granting of the application shall be reviewed on the People's appeal . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 The majority base a perfunctory argument of \"acquiescence\" on their argument of inclusio unius est exclusio alterius. The former falls with the latter's failure.\u003c/span\u003e\n\n",
    "body_length": 197766,
    "citedas": [
      "15 Cal.4th 997",
      "16 Cal.4th 825B",
      "938 P.2d 388",
      "64 Cal.Rptr.2d 594"
    ],
    "attorneys": "Martin H. Kresse, under appointment by the Supreme Court, for Defendant and Appellant. Daniel E. Lungren, Attorney General, George Williamson, Chief Assistant Attorney General, Robert R. Anderson, Assistant Attorney General, Edmund D. McMurray and Susan J. Orton, Deputy Attorneys General, for Plaintiff and Respondent.",
    "category": [
      "36",
      "78"
    ],
    "judges": "Kennard, J. WE Concur: George, C.j., Baxter, J., Werdegar, J., Chin, J., Brown, J. Concurring Opinion BY Mosk, J.",
    "citation_count": 589
  }
}
