{
  "id": "Zs6TYWYBTlTomsSB0Q8H",
  "document": {
    "title": "Manufactured Housing Communities of Washington v. America",
    "full_title": "MANUFACTURED HOUSING COMMUNITIES OF WASHINGTON, A NONPROFIT WASHINGTON CORPORATION THE STATE OF WASHINGTON; AND MOBILE HOME OWNERS OF V. AMERICA, INC., A CORPORATION .",
    "jurisdiction": "Washington Supreme Court",
    "date": "2000-11-09T00:00:00.000Z",
    "docket": "No. 66831-1",
    "body": "Oral Argument Date: 03/07/2000 02/25/1999\n\nEn Banc\n\nManufactured Housing Communities of Washington challenges the constitutionality of chapter 59.23 RCW, the mobile home parks--resident ownership act, which gives qualified tenants a right of first refusal to purchase a mobile home park. Finding an unconstitutional taking of private property for private use in violation of amended article I, section 16 of the Washington State Constitution, we reverse the Court of Appeals.\n\nFACTS\n\nIn 1995, Manufactured Housing Communities of Washington (Park Owners), an association of mobile home park owners, commenced this declaratory judgment action. The Park Owners argued that the mobile home parks--resident ownership act (the Act) creates an unconstitutional taking of property in violation of amended article I, section 16 of the Washington State Constitution, as well as the Fifth Amendment of the United States Constitution.\n\nThe superior court denied the Park Owners' motion for summary judgment and dismissed the complaint after granting summary judgment to the State. The Court of Appeals affirmed, holding the Act did not amount to an unconstitutional taking of property. Manufactured Housing Communities v. State, 90 Wn. App. 257, 259, 951 P.2d 1142 (1998).\n\nWith the permission of the Chief Justice, the Pacific Legal Foundation, the Building Association of Washington and the Washington Association of Realtors filed amicus curiae briefs in support of the Park Owners. The Washington State Association of Municipal Attorneys filed an amicus curiae brief supporting the State.\n\nTHE ACT\n\nIn 1993, the Washington State Legislature, concerned with the availability of mobile home park housing, adopted chapter 59.23 RCW, the Act. RCW 59.23.005. This Act gives mobile home park tenants a right of first refusal when the park owner decides to sell a mobile home park. RCW 59.23.025.\n\nTo exercise a right of first refusal, the tenants must organize into a \"qualified tenant organization\"\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and give the park owner written notice\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e of \"a present and continuing desire to purchase the mobile home park.\" RCW 59.23.015. Once the park owner has received such notice, the park owner must notify the tenants of any agreement to sell the park to a third party, as well as disclose the agreement's terms. If the park owner fails to properly notify the qualified tenant organization, a pending third party sale is voidable. RCW 59.23.030.\n\nUpon receiving proper notice, the tenants have 30 days in which to pay the park owner two percent of the third party's agreed purchase price and to tender a purchase and sale agreement as financially favorable as the agreement between the owner and the third party. RCW 59.23.025. If the tenants meet these requirements within the 30-day period, the park owner must sell them the park. RCW 59.23.025. If, however, the tenants fail to meet these requirements or if, in the case of seller financing, the owner determines selling the park to the tenants would create a greater financial risk than selling to the third party, the owner may proceed with the sale to the third party. RCW 59.23.025.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nSTANDARD OF REVIEW\n\nWhen reviewing an appeal from summary judgment, an appellate court employs the same analysis as the trial court. Margola Assocs. v. City of Seattle, 121 Wn.2d 625, 634, 854 P.2d 23 (1993). Legal issues are reviewed de novo, and factual issues are reviewed in the light most favorable to the nonmoving party. Margola, 121 Wn.2d at 634. Because this is a facial challenge, no facts are in dispute and we, therefore, decide the Park Owners' claim solely as a matter of law.\n\nCLAIMS\n\nThe Park Owners contend chapter 59.23 RCW eviscerates fundamentally important ownership rights. Specifically, the Park Owners believe the Act's mere existence destroys the right to (1) freely dispose of their property, (2) exclude others, and (3) immediately close the sale of a mobile home park. The Park Owners claim that if a park owner decides to sell, chapter 59.23 RCW allows the State to delay the sale and forcibly substitute the owner's chosen buyer with a buyer selected by the State. According to the Park Owners, taking the right of first refusal and then granting this right to private mobile home park tenants, solely for the tenants' private use, violates amended article I, section 16 of the Washington State Constitution, which expressly provides \"Private property shall not be taken for private use . . . .\" Const. art. I, sec. 16 (amend. 9). The Park Owners believe invalidation of chapter 59.23 RCW is the only appropriate remedy.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nThe State argues that chapter 59.23 RCW is a legitimate exercise of the police power and makes several additional arguments against the Park Owners' conclusion that chapter 59.23 RCW constitutes a taking prohibited by either the Washington State Constitution or the United States Constitution. First, the State argues that a right of first refusal is not subject to a takings analysis because it is not a property interest. Second, the State argues that a \"total taking\" has not occurred because chapter 59.23 RCW does not deny the park owners all economically beneficial use of their property. Third, the State argues that a taking has not occurred through physical invasion because chapter 59.23 RCW does not require the Park Owners to submit to the physical occupation of their land. Finally, the State argues that even if a taking has occurred, chapter 59.23 RCW achieves a legitimate \"public use\" and, therefore, article I, section 16 requires payment of just compensation rather than the statute's automatic invalidation.\n\nPOLICE POWER\n\nThe government, through the police power, often regulates and restricts the use of private property in the interest of the public. Police power is inherent in the state by virtue of its granted sovereignty. Shea v. Olson, 185 Wash. 143, 153, 53 P.2d 615 (1936). \"It exists without express declaration, and the only limitation upon it is that it must reasonably tend to correct some evil or promote some interest of the state, and not violate any direct or positive mandate of the constitution.\" Shea, 185 Wash. at 153. However, as noted in Conger v. Pierce County, 116 Wash. 27, 35-36, 198 P. 377 (1921), the police power is not unlimited and, when stretched too far, is a power \"most likely to be abused.\" In Conger, an early Washington case which determined a county had exceeded the scope of the police power, this court said:\n\n{The police power} has been defined as an inherent power in the state which permits it to prevent all things harmful to the comfort, welfare and safety of society. It is based on necessity. It is exercised for the benefit of the public health, peace and welfare. Regulating and restricting the use of private property in the interest of the public is its chief business. It is the basis of the idea that the private individual must suffer without other compensation than the benefit to be received by the general public. It does not authorize the taking or damaging of private property in the sense used in the constitution with reference to taking such property for a public use. Eminent domain takes private property for a public use, while the police power regulates its use and enjoyment, or if it takes or damages it, it is not a taking or damaging for the public use, but to conserve the safety, morals, health, and general welfare of the public. Conger, 116 Wash. at 36.\n\nREGULATORY TAKINGS\n\nUnder existing Washington and federal law, a police power measure can violate amended article I, section 16 of the Washington State Constitution or the Fifth Amendment of the United States Constitution and thus be subject to a categorical \"facial\" taking challenge when: (1) a regulation effects a total taking of all economically viable use of one's property, Lucas v. So. Carolina Coastal Council, 505 U. S. 1003, 1019, 112 S. Ct. 2886, 120 L. Ed. 2d 798 (1992); or (2) the regulation has resulted in an actual physical invasion upon one's property, Loretto v. Teleprompter Manhattan CATV Corp., 458 U. S. 419, 102 S. Ct. 3164, 73 L. Ed. 2d 868 (1982); or (3) a regulation destroys one or more of the fundamental attributes of ownership (the right to possess, exclude other and to dispose of property), Presbytery of Seattle v. King County, 114 Wn.2d 320, 330, 787 P.2d 907 (1990); or (4) the regulations were employed to enhance the value of publicly held property, Orion Corp. v. State, 109 Wn.2d 621, 651, 747 P.2d 1062 (1987).\n\nRegulations have also been found unconstitutional because they violate substantive due process, whether or not a total taking or physical invasion has actually occurred.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e See Guimont v. Clarke, 121 Wn.2d 586, 608, 854 P.2d 1 (1993); Margola,121 Wn.2d at 649.\n\nSTATE CONSTITUTIONAL ANALYSIS\n\nWe must determine, based upon a Gunwall\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e analysis, whether a regulatory taking rather than lawful use of police power has occurred under the Washington State Constitution.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e This undertaking requires us first to examine six nonexclusive neutral criteria to determine whether the Washington State Constitution extends broader rights to its citizens than does the United States Constitution.\" Gunwall,106 Wn.2d at 61.\n\nThe Text of the State Constitution and its Parallels with the Federal Document\n\nThe first two Gunwall factors are: (1) the textual language of the state constitutional provision at issue and (2) differences in the parallel texts of the federal and state constitutions.\n\nAmended article I, section 16 of the Washington State Constitution provides:\n\nSec. 16 EMINENT DOMAIN. Private property shall not be taken for private use, except for private ways of necessity, and for drains, flumes, or ditches on or across the lands of others for agricultural, domestic, or sanitary purposes. No private property shall be taken or damaged for public or private use without just compensation having been first made, or paid into court for the owner, and no right-of-way shall be appropriated to the use of any corporation other than municipal until full compensation therefor be first made in money, or ascertained and paid into court for the owner, irrespective of any benefit from any improvement proposed by such corporation, which compensation shall be ascertained by a jury, unless a jury be waived, as in other civil cases in courts of record, in the manner prescribed by law. Whenever an attempt is made to take private property for a use alleged to be public, the question whether the contemplated use be really public shall be a judicial question, and determined as such, without regard to any legislative assertion that the use is public: Provided, That the taking of private property by the state for land reclamation and settlement purposes is hereby declared to be for public use.\n\nOn the other hand, the takings clause of the Fifth Amendment states simply: 'nor shall private property be taken for public use, without just compensation.' A striking textual difference between these two constitutions is the sheer detail of article I, section 16. A second significant difference is the addition of the word damaged in the state version and the requirement that compensation must first be made. Neither of these differences, however, are key to this analysis.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e What is key is article I, section 16's absolute prohibition against taking private property for private use. The Fifth Amendment only provides similar protections by inference. Moreover, unlike the Fifth Amendment, article I, section 16 expressly renders the question of public versus private a judicial question: 'Whenever an attempt is made to take private property for a use alleged to be public, the question whether the contemplated use be really public shall be a judicial question, and determined as such, without regard to any legislative assertion that the use is public . . . .' Const. art I, sec. 16 (amend. 9).\n\nThis court has consistently focused on textual differences between related state and federal constitutional provisions. Additional language in the state constitution has led to greater protections of individual liberties in several cases. See, e.g., State v. Brayman, 110 Wn.2d 183, 201, 751 P.2d 294 (1988) (addition of gender in state equal rights amendment provides more protection than federal equal protection clause); State v. Boland, 115 Wn.2d 571, 580, 800 P.2d 1112 (1990) (additional language in state search and seizure clause provides greater protection than federal Fourth Amendment). Hence, as Justice Utter explained, '{o}rdinary rules of textual and constitutional interpretation, as well as the logic of federalism, require that meaning be given to the differences in language between the Washington and United States Constitutions .' Robert F. Utter, Freedom and Diversity in a Federal System: Perspectives on State Constitutions and the Washington Declaration of Rights, 7 U. Puget Sound L. Rev. 491, 515 (1984) (footnotes omitted). The key differences between the Fifth Amendment and article I, section 16 are significant and support a literal interpretation of 'private use' as employed in the Washington State Constitution.\n\nState Constitutional and Common Law History\n\nThe third Gunwall factor requires an examination of Washington constitutional and common law history. The Park Owners contend that because the federal constitution predates the state constitution, the state drafters presumably knew the contents of the federal document and deliberately chose to make the state constitutional provision more detailed, providing greater protection for the property owner. Br. of Pet'r at 17.\n\nDuring the Washington State Constitutional Convention in 1889, concern was publicly voiced over the taking of private property for private enterprise. Washington Standard (Olympia), August 9, 1889, p. 1, col. 4. Moreover, certain constitutional delegates were strongly opposed to various exceptions to the absolute prohibition against taking private property for private use.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nPre-existing State Law\n\nThe fourth Gunwall factor addresses pre-existing state law. The State of Washington has a long history of extending greater protections against governmental takings of private property by literally defining what constitutes 'private use.' Before examining pre-existing Washington law concerning private versus public use, we first compare the use of terms in relevant federal case law. While Washington case law concerns 'private/public use' the federal cases concern 'private/public purposes.' Case law demonstrates these terms are not synonymous.\n\nThe United States Supreme Court has repeatedly stated 'one person's property may not be taken for the benefit of another private person without justifying public purpose, even though compensation be paid.' Thompson v. Consolidated Gas Utils. Corp., 300 U.S. 55, 80, 57 S. Ct. 364, 376, 81 L. Ed. 510 (1937); Cincinnati v. Vester, 281 U.S. 439, 447, 50 S. Ct. 360, 362, 74 L. Ed. 950 (1930); Madisonville Traction Co. v. St. Bernard Mining Co., 196 U.S. 239, 251-52, 25 S. Ct. 251, 255-56, 49 L. Ed. 462 (1905); Fallbrook Irrigation Dist. v. Bradley, 164 U.S. 112, 159, 17 S. Ct. 56, 63, 41 L. Ed. 369 (1896). However, if the legislature's purpose is legitimate and its means not irrational, a legislative taking can and will withstand a public use challenge provided just compensation is paid. Hawaii Housing Auth. v Midkiff, 467 U.S. 229, 242, 104 S. Ct. 2321, 81 L. Ed. 2d 186 (1984) (citing Western \u0026 Southern Life Ins. Co. v. State Bd. of Equalization, 451 U.S. 648, 671-72, 101 S. Ct. 2070, 2084, 68 L. Ed. 2d 514 (1981)).\n\nWashington courts, on the other hand, have provided a more restrictive interpretation of public use. In fact, this court has consistently held that a 'beneficial use is not necessarily a public use.' In re Petition of Seattle, 96 Wn.2d 616, 627, 638 P.2d 549 (1981) (citing State ex rel. Oregon-Washington R.R. \u0026 Navigation Co. v. Superior Court, 155 Wash. 651, 657-58, 286 P. 33 (1930) and Hogue v. Port of Seattle, 54 Wn.2d 799, 825, 831, 837-38, 341 P.2d 171 (1959)). Accordingly, pre-existing state law provides a literal definition of 'private use.' Washington state courts thus provide Washington citizens with enhanced protections against taking private property for private use.\n\nDifferences in Structure Between the State and Federal Constitutions\n\nThe fifth Gunwall factor, structural differences between the federal and state constitutions also favors enhanced protections to Washington citizens by maintaining a literal interpretation of 'private use.' As previously noted, there are marked differences between the two relevant provisions. But, because the United States Constitution is a grant of enumerated powers to the federal government and the Washington State Constitution serves to limit the otherwise plenary powers of the state government, the state constitution can be looked at as a source of great protections directly reserved in the people. Gunwall, 106 Wn.2d at 62. Thus, the structural differences allow Washington courts to forbid the taking of private property for private use even in cases where the Fifth Amendment may permit such takings.\n\nMatters of Particular State Interest or Local Concern\n\nThe sixth and last Gunwall factor asks whether the clause deals with matters of particular state or local concern. It suffices to say that taking private property for private use is clearly a matter of local concern consistently recognized by Washington courts. State ex rel.Wash. State Convention \u0026 Trade Ctr. v. Evans, 136 Wn.2d 811, 822, 966 P.2d 1252 (1988); In re Seattle, 96 Wn.2d 616; Healy Lumber Co. v. Morris, 33 Wash. 490, 509, 74 P. 681 (1903).\n\nAPPLICATION\n\nHaving concluded on the basis of the foregoing analysis that 'private use' under amended article I, section 16 is defined more literally than under the Fifth Amendment, and that Washington's interpretation of \"public use\" has been more restrictive, we next apply these terms to the present case. Chapter 59.23 RCW authorizes the State to take from the park owner the right to sell to anyone of choice, at any time, and gives tenants a right to preempt the owner's sale to another and to substitute themselves as buyers. This is apparent from RCW 59.23.015, which says that if a qualified tenant organization expresses a 'desire' to purchase, 'the park may then be sold only according to this chapter.' Moreover, RCW 59.23.025 provides that, if the tenant organization tenders two percent of the price plus a purchase and sale agreement comparable to the third party's offer, 'the mobile home park owner must sell the mobile home park to the qualified tenant organization.' Therefore, the legislature takes from the park owner the right to freely dispose of his or her property and gives to tenants a right of first refusal to acquire the property by blocking the owner's sale to the third party and substituting themselves as buyers. The result is that the Legislature has authorized the taking of private property from the owner for the tenants' private use in direct violation of the first sentence of article I, section 16.\n\nPublic Benefit Not Necessarily Public Use\n\nThe alleged public benefit in this case is even more tenuous than the alleged public use in other Washington cases, which concluded alleged public uses were actually private uses. For example, unlike the proposed development in In re Seattle, discussed more fully below, the public here will not own the land. In fact, no member of the general public can even use the parks as would the shoppers envisioned in In re Seattle. See In re Seattle, 96 Wn.2d at 619-20. The statute's design and its effect provide a beneficial use for private individuals only.\n\nThe eminent domain provision of the Washington State Constitution provides a complete restriction against taking private property for private use: 'Private property shall not be taken for private use . . . .' Const. art. I, sec. 16 (amend. 9). This absolute language is further strengthened by the enumeration of specific, but here inapplicable, exceptions 'for private ways of necessity, and for drains, flumes, or ditches on or across the lands of others for agricultural, domestic, or sanitary purposes.' Const. art. I, sec. 16 (amend. 9). These specific exceptions are incorporated into an otherwise absolute prohibition precluding taking private property for private use. This prohibition is not conditioned on payment of compensation. Whether or not a tenant organization might ultimately pay the owner the same price he or she is to receive from a third party buyer is irrelevant. Hence, this absolute prohibition against taking private property for private use bars any additional inquiry about compensation and requires invalidation of Chapter 59.23 RCW.\n\nPublic Purpose Not Necessarily Public Use\n\nSome commentators have criticized Washington's existing takings analysis, particularly insofar as it relies on an ad hoc inquiry into the specific \"purpose of the infringement\" to distinguish police power from a regulatory taking. Stanley H. Barer, Comment, Distinguishing Eminent Domain from Police Power and Tort, 38 Wash. L. Rev. 607, 609-10 (1963). Professor Richard Settle urges the court to adopt an approach with a higher predictive value. See Richard L. Settle, Regulatory Taking Doctrine in Washington: Now You See It, Now You Don't, 12 U. Puget Sound L. Rev. 339, 386-95 (1989). He proposes that the court recognize, as a threshold principle when examining regulatory challenges to police power, that there are two categories of police power regulation that are subject to quite different taking standards. These categories divide regulations, on the basis of their purpose and effect, into those that effectively deprive a property owner of a fundamental attribute of property and those that do not. Settle, supra, at 386-87 (footnotes omitted).\n\nProfessor Settle further notes,\n\n{r}egulations that deprive an owner of a fundamental attribute of ownership generally are held to be takings without applying the ripeness requirement or distinguishing between facial and as applied challenges; without balancing public gain and private loss; and without considering diminution in property value, disappointment of investment-backed expectations, whether value lost is offset by reciprocal benefits, and whether reasonable value remains. In short, such regulations are subject to essentially the same doctrine as that applicable to government exercises of eminent domain and government physical invasions traditionally characterized as inverse condemnations. Settle, supra, at 387 (footnote omitted).\n\nFundamental Attribute of Property Ownership\n\nIn the present case, the Park Owners believe that a valuable property right has been taken. Before engaging in a takings analysis, however, it must first be determined if \"property\" has actually been taken. William B. Stoebuck, Non-trespassory Takings in Washington sec.1.7, at 7 (1980). As the Park Owners point out,\n\n\"'Property in a thing consists not merely in its ownership and possession but in the unrestricted right of use, enjoyment and disposal. Anything which destroys any of these elements of property, to that extent destroys property itself. The substantial value of property lies in its use. If the right of use be denied, the value of the property is annihilated and ownership is rendered a barren right.'\" Ackerman v. Port of Seattle, 55 Wn.2d 400, 409, 348 P.2d 664 (1960) (emphasis added) (quoting Spann v. City of Dallas, 111 Tex. 350, 355, 235 S.W. 513 (1921)), overruled on other grounds by Highline Sch. Dist. No. 401 v. Port of Seattle, 87 Wn.2d 6, 548 P.2d 1085 (1976).\n\nWashington courts have consistently recognized that \"the right to possess, to exclude others, or to dispose of property\" are \"fundamental attribute{s} of property ownership.\" Guimont, 121 Wn.2d at 595; Robinson v. City of Seattle, 119 Wn.2d 34, 50, 830 P.2d 318 (1992); Presbytery, 114 Wn.2d at 329-30. This notion is not unique. The United States Supreme Court has long held property consists of a \"group of rights inhering in the citizen's relation to the physical thing, as the right to possess, use and dispose of it.\" United States v. General Motors Corp., 323 U.S. 373, 378, 65 S. Ct. 357, 89 L. Ed. 311 (1945). Similarly, other jurisdictions recognize \"{t}he constitutional guaranty securing to every person the right of 'acquiring, possessing, and protecting property,' . . . includes the right to dispose of such property in such innocent manner as he pleases . . . .\" Ex Parte Quarg, 149 Cal. 79, 80, 84 P. 766 (1906); Tennant v. John Tennant Mem'l Home, 167 Cal. 570, 575, 140 P. 242 (1914); Laguna Royale Owners Ass'n v. Darger, 119 Cal. App. 3d 670, 681, 174 Cal. Rptr. 136 (1981).\n\nAlthough a right of first refusal has no binding effect unless the offeror decides to sell, at such time it then legally constrains the owner. \"A right of first refusal to purchase is a valuable prerogative, limiting the owner's right to freely dispose of his property by compelling him to offer it first to the party who has the first right to buy.\" Northwest Television Club, Inc. v. Gross Seattle, Inc., 26 Wn. App. 111, 116, 612 P.2d 422 (1980), rev'd in part on other ground by, 96 Wn.2d 973, 634 P.2d 837 (1981) (citing 11 Samuel Williston, A Treatise on the Law of Contracts sec. 1441A, at 949-50 (3d ed. 1968)).\n\nCases from other jurisdictions are also instructive. For example, a right of first refusal contained in by-laws of a condominium was deemed a property interest sufficient to constitute a covenant running with the land. Anderson v. 50 East 72nd St. Condominium,129 Misc.2d 295, 296, 492 N.Y.S. 989, 990 (1985); see also Taormina Theosophical Community, Inc., v. Silver, 140 Cal. App. 3d 964, 968, 190 Cal. Rptr. 38, 40 (1983) (striking down a right of first refusal in covenants as illegal restraint on alienation). A right of first refusal between joint owners was a sufficient interest in land to constitute a covenant running with the land which could be enforced against the co-owner's successors in interest so long as joint owner continued to own his interest in the property. HSL Linda Gardens Props., Ltd. v. Seymour, 163 Ariz. 396, 788 P.2d 129 (1990).\n\nAlthough a right of first refusal to purchase property is a \"preemptive\" right it has nonetheless been held to be an interest in property as well. \"It {a right of first refusal} is an interest in property, and not merely a contractual right, whereby the preemptioner acquires an equitable right in the property, which vests only when the property owner decides to sell.\" Ayers v. Townsend, 324 Md. 666, 674-75, 598 A.2d 470, 474 (1991) (citing Ferrero Constr. Co. v. Dennis Rourke Corp., 311 Md. 560, 565, 536 A.2d 1137 (1988)). In noting the practical effects of a right of first refusal, the Ferrero court observed:\n\nThe third type of right of first refusal permits the preemptioner to purchase the property at a price equal to any bona fide offer that the owner, his heirs or assigns desire to accept. In this situation, however, many prospective purchasers, recognizing that a matching offer from the preemptioner will defeat their bids, simply will not bid on the property. This in turn will depress the property's value and discourage the owner from attempting to sell. Ferraro, 536 A.2d at 1144.\n\nThat a right of first refusal, even one created by statute, can create an interest in property is illustrated by the case of Crowell v. Delafield Farmers Mut. Fire Ins. Co., 463 N.W.2d 737, 740 (1990). Minnesota created a statutory right of first refusal for owners of farms to protect them against a sale by a creditor enforcing a debt by requiring the creditor agency or corporation to give notice to the former owner and permitting that owner to meet the terms of a third party offer. Minn. Stat. Ann. sec. 500.24, subd. 5, at 568 (West 1990). The right of first refusal was a sufficient interest in land to provide the basis of an insurable interest for a debtor holding over even after expiration of the period of redemption. Unlike the present case, the Minnesota statute does not implicate takings because it regulates a creditor-debtor relationship.\n\nThe diverse array of cases above clearly demonstrates that a right of first refusal, although a preemptive right for the grantee, can also constitute a property interest even as to a grantee. For the grantor, the power to grant a right of first refusal is part and parcel of the power to dispose of property. Until granted, such right remains indivisible from the \"bundle of sticks\" representing the valuable incidents of ownership along with the right to possess, use and exclude others.\n\nRelying on Robroy Land Co. v. Prather, 95 Wn.2d 66, 622 P.2d 367 (1980), the State attempts to avoid the inevitable conclusion that the right of first refusal in the hands of the property owner is a valuable property right. The State's reliance on Robroy is erroneous for three reasons. First, unlike the present case, the right of first refusal in Robroy was voluntary and given for consideration. 95 Wn.2d at 67. Second, the holding of Robroy deals with the definition of property for purposes of the rule against perpetuities. 95 Wn.2d at 69-70. It is inapplicable to a takings question. Third, Robroy analyzes the right of first refusal in the hands of the grantee, which is inapplicable when analyzing the grantor's property rights.\n\nDistinguishing a right of first refusal in the hands of a grantee is important because such a right is generally regarded as only preemptive. However, the right to grant first refusal is a part of \"the bundle of sticks\"\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e which the owner enjoys as a vested incident of ownership. As Philip Nichols explains, in The Law of Eminent Domain, 'property is often used to describe the corporeal object that is the subject of ownership, as well as the aggregate rights that an owner possesses in or with respect to such a corporeal object.' 2 Nichols on Eminent Domain sec. 5.01{2}{d}, at 5-10 (3d rev. ed. 1999) (footnote omitted). Property is not one single right, but is composed of several distinct rights, which each may be subject to regulation. \"{T}he right of property includes four particulars: (1) right of occupation; (2) right of excluding others; (3) right of disposition, or the right of transfer in the integral right to other persons; (4) right of transmission . . . .\" Nichols, supra, sec. 5.01{5}{b}, at 5-30 to 5-31 (citing Jeremy Bentham, The Principles of Morals and Legislation 248 (1948)).\n\nIn holding the owner of an unexercised option to purchase land possessed a compensable property right, the Supreme Court of California observed:\n\n\"'{T}he right to compensation is to be determined by whether the Condemnation has deprived the claimant of a valuable right rather than by whether his right can technically be called an 'estate' or 'interest' in the land.'\" County of San Diego v. Miller, 13 Cal. 3d 684, 691, 532 P.2d 139, 119 Cal. Rptr. 491 (1975) (quoting United States v. 53 Acres of Land, 139 F.2d 244, 247 (2d Cir. 1943)); cf. Spokane Sch. Dist. No. 81 v. Parzybok, 96 Wn.2d 95, 633 P.2d 1324 (1981) (holding optionee suffered a loss of property--be it only a contract right--and was therefore entitled to share in condemnation award).\n\nIn Gregory v. City of San Juan Capistrano, 142 Cal. App. 3d 72, 191 Cal. Rptr. 47 (1983),\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e several mobile home park owners challenged an ordinance which required owners planning to sell mobile home parks to first offer it to the residents. Finding this provision in the ordinance constituted an impermissible taking, the court reasoned:\n\nThis part of the ordinance effects an outright abrogation of well-recognized property rights. The ability to sell and transfer property is a fundamental aspect of property ownership. Property consists mainly of three powers: possession, use, and disposition. (U.S. v. General Motors Corp., supra., 323 U.S. at 377-378 {65 S. Ct. 357, 89 L. Ed. 311 (1945)}.) . . . This part of the ordinance simply appropriates an owner's right to sell his property to persons of his choice. City has thus 'extinguish{ed} a fundamental attribute of ownership,' in violation of federal and state Constitutions. (See Agins v. Tiburon, supra, 447 U.S. at 262 {100 S. Ct. 2138, 65 L. Ed. 106 (1980)}).\n\nIn addition, this part of the ordinance appropriates the owner's legally recognized right to sell a right of first refusal or preemptive right in the mobilehome park. It is well established that a preemptive right is a valuable property right which may be bought, sold, and enforced in a court of law. Capistrano, 142 Cal. App. 3d at 88-89 (some citations omitted).\n\nViewed in the context of an owner's rights, it is apparent that Robroy should not control the outcome of this case. It is irrelevant whether the tenants gain a \"vested interest\" in the property. The question is not what the tenants gain, but what the park owner loses. Here, the statute deprives park owners of a fundamental attribute of ownership.\n\nStatutory Transfer\n\nThe instant case falls within the rule that would generally find a taking where a regulation deprives the owner of a fundamental attribute of property ownership. See Guimont, 121 Wn.2d at 605 n.7; Settle, supra, at 387. However, we are persuaded that a taking has occurred in this case not only because an owner is deprived of a fundamental attribute of ownership, but also because this property right is statutorily transferred. In Ackerman, this court said:\n\nWhen restrictions upon the ownership of private property fall into the category of \"proper exercise of the police power,\" they, validly, may be imposed without payment of compensation. The difficulty arises in deciding whether a restriction is an exercise of the police power or an exercise of the eminent domain power. When private property rights are actually destroyed through the governmental action, then police power rules are usually applicable. See State ex rel. Miller v. Cain (1952), 40 Wn. (2d) 216, 242 P. (2d) 505. But, when private property rights are taken from the individual and are conferred upon the public for public use, eminent domain principles are applicable. See, generally, Conger v. Pierce County (1921), 116 Wash. 27, 198 Pac. 377, 18 A.L.R. 393. 55 Wn.2d at 408; see also Brazil v. City of Auburn, 93 Wn.2d 484, 490-91, 610 P.2d 909 (1980); Highline, 87 Wn.2d at 17.\n\nHere, the actual effect of chapter 59.23 RCW is more closely akin to the exercise of eminent domain, and not the police power, because the property right is not only taken, but it is statutorily transferred to a private party for an alleged public use. \"Eminent domain\" is defined as \"{t}he power to take private property for public use by the state, municipalities, and private persons or corporations authorized to exercise functions of public character.\" Black's Law Dictionary 523 (6th ed. 1990). Similarly, \"condemnation\" is the \"{p}rocess of taking private property for public use through the power of eminent domain.\" Id. at 292. Washington law recognizes that \"'{t}he authority to condemn must be expressly given or necessarily implied.'\" State ex rel. Wauconda Inv. Co. v. Superior Court, 68 Wash. 660, 662, 124 P. 127 (1912) (emphasis added) (quoting In re Willis Ave., 56 Mich. 244, 22 N.W. 871 (1885)). While chapter 59.23 RCW says nothing about condemnation, its condemnatory effect is necessarily implied.\n\nChapter 59.23 RCW provides that when a \"qualified tenant organization\" gives written notice of \"a present and continuing desire to purchase the mobile home park, the park may then be sold only according to this chapter.\" RCW 59.23.015 (emphasis added). Once a park owner thus enters into a purchase and sale agreement with a third party, the park owner \"must\" notify the tenant and disclose the terms of the agreement. If within 30 days the tenants pay the owner two percent of the third party's agreed purchase price and tenders a purchase and sale agreement at least as favorable as the agreement between the owner and the third party, the owner \"must\" sell the park to the tenants.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Chapter 59.23.025 RCW. In effect, Chapter 59.23 RCW takes a fundamentally important property right from the Park Owners and then transfers that right to private parties for an alleged public use.\n\nPublic Use Required\n\nWe conclude that a right of first refusal in the hands of the Park Owners is a fundamental attribute of ownership and a valuable property right, and that the forced transfer of this right under chapter 59.23 RCW constitutes a taking. We next consider whether the proposed use of the property is constitutionally permitted.\n\nBoth the state and federal constitutions give citizens the guarantee that private property shall not be taken for \"public use\" without just compensation. U.S. Const. amend. V; Wash. Const. art. I, sec. 16 (amend. 9). \"The Fifth Amendment's guarantee that private property shall not be taken for public use without just compensation was designed to bar Government from forcing some people alone to bear public burdens which, in all fairness and justice, should be borne by the public as a whole.\" Armstrong v. United States, 364 U.S. 40, 49, 80 S. Ct. 1563, 4 L. Ed. 2d 1554 (1960). While the eminent domain provision of the Washington State Constitution similarly recognizes the requirement of just compensation when private property is taken for a public use, this constitutional provision also expressly provides that \"Private property shall not be taken for private use . . . .\" Const. art I, sec. 16 (amend. 9). Thus, unless a private use falls within article I, section 16's specifically articulated exceptions, the Washington State Constitution explicitly prohibits taking private property solely for a private use - with or without compensation. See generally Evans, 136 Wn.2d at 825-32. (Sanders, J., dissenting).\n\nThe State argues that even if Chapter 59.23 RCW takes the Park Owners' private property, this taking is for a \"public use,\" requiring payment of just compensation for any resulting damage and not automatic invalidation of the statute. According to the State, chapter 59.23 RCW achieves a valid public use by \"maintaining a significant source of low income and elderly housing.\" Br. of Resp't at 36. The State thus contends that even though a right of first refusal benefits private mobile home park tenants, an important public use is involved because \"the Legislature found that mobile home parks provide 'a significant' but increasingly insecure source of homeownership for 'many Washington residents.'\" Br. of Resp't at 36 (quoting RCW 59.23.005). In short, the State argues that it \"has used its police power for a valid public use of preserving dwindling housing stocks for an important and particularly vulnerable segment of society.\" Br. of Resp't at 38.\n\nThe State, apparently assuming \"public purpose\" and \"public use\" are always the same thing under existing Washington law, argues that preserving a declining housing resource so greatly benefits the public that RCW 59.23 plainly converts the private use to a public use. It does not. Washington courts have a long history of restricting governmental takings of private property under eminent domain by literally defining \"private use.\" This court has often held that a \"beneficial use is not necessarily a public use.\" In re City of Seattle, 96 Wn.2d 616, 627, 638 P.2d 549 (1981) (citing State ex rel. Oregon-Washington R.R. \u0026 Navigation Co. v. Superior Court, 155 Wash. 651, 657-58, 286 P. 33 (1930) and Hogue v. Port of Seattle, 54 Wn.2d 799, 825, 831, 837-38, 341 P.2d 171 (1959)).\n\nIn re Seattle, for example, addressed the City of Seattle's ordinance implementing a large urban improvement project designed to guard against urban decay. The project required Seattle to acquire all properties necessary for the project and then transfer large portions of the property to private retailers. Recognizing that impeding urban decay and providing shopping areas, owned by private individuals but used by the general public, provide substantial benefits to the public, this court stated:\n\n\"{i}t may be conceded that the Westlake Project is in 'the public interest'. However, the fact that the public interest may require it is insufficient if the use is not really public.\" In re Seattle, 96 Wn.2d at 627. This court further stated that \"{i}f a private use is combined with a public use in such a way that the two cannot be separated, the right of eminent domain cannot be invoked.\"\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e In re Seattle, 96 Wn.2d at 627.\n\nAs Justice Dunbar, a convention delegate and member of the Judicial Department responsible for the final proposal of article I, section 16 to the convention stated, \"the use under consideration must be either a use by the public, or by some agency which is quasi public, and not simply a use which may incidentally or indirectly promote the public interest or general prosperity of the state.\" Healy Lumber Co. v. Morris, 33 Wash. 490, 509, 74 P. 681 (1903). This court has often followed a similar line of reasoning. In Hogue, for example, this court concluded \"it is the duty of the courts to uphold the rights of private property owners against the inroads of public bodies who seek to acquire it for private purposes which they honestly believe to be essential for the public good.\" Hogue, 54 Wn.2d at 838.\n\nChapter 59.23 RCW authorizes the State to take from the park owner the right to sell to anyone of choice, at any time, and gives tenants a right to preempt the owner's sale to another and to substitute themselves as buyers. Then, after a mobile home park has been forcibly sold to a \"qualified tenant organization,\" no member of the public can use the park. In fact, only the park tenants can freely use it. Although preserving dwindling housing stocks for a particularly vulnerable segment of society provides a \"public benefit,\" this public benefit does not constitute a public use. See In re Seattle, 96 Wn.2d at 638; Hogue, 54 Wn.2d at 825; Oregon-Washington R.R. \u0026 Navigation Co., 155 Wash. at 657-58.\n\nThe conclusion that chapter 59.23 RCW results solely in a private use is further supported by the Legislature's silence concerning public entitlement to occupy and use the park after the private tenants buy it. To the contrary, RCW 59.23 would vest ownership (and, by extension the new owners' and former tenants' right to possess, exclude others, and dispose of it) in a \"qualified tenant organization\" with membership requiring \"(a) Payment of reasonable dues; and (b) being a tenant in the park.\" RCW 59.23.020(3). On the face of the Act, the public would not be entitled to \"use\" the park if a \"qualified tenant organization\" became the owner.\n\nAlthough White Bros. \u0026 Crum Co. v. Watson, 64 Wash. 666, 671, 117 P. 497 (1911), is factually distinct from this case, the late Judge Ellis very clearly and persuasively set out the dangers inherent in the reasoning argued by the State:\n\nIf it is something in which he has the actual right of property there is no rule of law nor principle of equity which would warrant a court in taking it from him against his will for the benefit of another. No amount of hardship in a given case would justify the establishment of such a precedent. The next step in the invasion of the right of property would be to invite the courts to measure the comparative needs of private parties, and compel a transfer to the one most needing and who might best utilize the property. If a man may be required to surrender what is his own, because he does not need it and cannot use it, and because another does need it and can use it, then there is no reason why he may not be required to surrender what he needs but little because another needs it much. A doctrine so insidiously dangerous should never find lodgment in the body of the law through judicial declaration.\n\nCONCLUSION\n\nWe have found that the statutory grant of a right of first refusal to tenants of mobile home parks, amounts to a taking and transfer of private property without a judicial determination of public necessity and without just compensation having been first paid as required by amended article I, section 16. Moreover, the transfer is legislatively granted to the tenants who are private persons, not the public. Giving the provision in article I, section 16 that \"Private property shall not be taken for private use . . .\" its deserved effect, chapter 59.23 RCW must be invalidated. The state constitution's absolute prohibition against taking private property solely for a private use is not conditioned on payment of compensation. Whether or not a tenant organization might ultimately pay the owner the same price he or she is to receive from a third party is irrelevant. Hence, this absolute prohibition against taking private property for private use bars any additional inquiry about compensation and requires invalidation of chapter 59.23 RCW.\n\nHere, the well-intentioned effort of the Legislature to encourage the conversion of mobile home parks to resident ownership conflicts with Washington State's constitutional prohibition against taking private property solely for a private use. We therefore reverse the Court of Appeals.\n\nJOHNSON, J. (dissenting)\n\nAlthough I agree with some of the majority's analysis, I cannot support its conclusion because of three critical flaws in its reasoning. First, the majority improperly focuses its Gunwall\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e analysis on the remedy provided by the Washington State Constitution, while what is at issue here is only the threshold question of whether a taking has occurred, a determination all parties agree is controlled by this court's decision in Guimont v. Clarke, 121 Wn.2d 586, 595, 854 P.2d 1 (1993). Next, the majority states that a right of first refusal is a right of property, despite the fact that decisions of this court and the Court of Appeals have concluded it is not. E.g., Robroy Land Co. v. Prather, 95 Wn.2d 66, 70-72, 622 P.2d 367 (1980). Finally, the majority disregards the requirement that even if a property right is implicated, under a facial challenge of the type presented here no taking occurs unless the mere enactment of the statute denies the property owner all economically viable use of his or her land. Guimont, 121 Wn.2d at 602.\n\nThe parties agree our first task is to determine whether the enactment of chapter 59.23 RCW constitutes a regulatory taking. See Guimont, 121 Wn.2d at 605 (under facial challenge, party must show mere enactment of statute works a taking). The parties also concede Guimont provides the analytical framework for this determination. Therefore, if we conclude under Guimont that a facial taking has occurred, then it is appropriate to move to the next issue: whether article I, section 16 (amend. 9) of the Washington State Constitution provides a greater remedy than the Fifth Amendment to the United States Constitution. If, however, Guimont tells us no taking has occurred, the question of whether the state constitution might provide a more expansive remedy should be left for another day.\n\nUnder Guimont's threshold inquiry, we ask 'whether the regulation destroys or derogates any fundamental attribute of property ownership: including the right to possess; to exclude others; . . . to dispose of property . . . {or} to make some economically viable use of the property.' Guimont, 121 Wn.2d at 602 (citing Presbytery of Seattle v. King County, 114 Wn.2d 320, 329-30, 787 P.2d 907 (1990); Sintra, Inc. v. City of Seattle, 119 Wn.2d 1, 14 n.6, 829 P.2d 765 (1992); Robinson v. City of Seattle, 119 Wn.2d 34, 49-50, 830 P.2d 318 (1992); Lucas v. S. Carolina Coastal Council, 505 U.S. 1003, 1015-19, 112 S. Ct. 2886, 120 L. Ed. 2d 798 (1992)). In addition, when, as here, an enactment is challenged on its face, we must ask whether 'the statute denies the owner of all economically viable use of the property.' Guimont, 121 Wn.2d at 605; accord Presbytery, 114 Wn.2d at 334; Orion Corp. v. State, 109 Wn.2d 621, 656, 747 P.2d 1062 (1987); see also Lucas, 505 U.S. at 1016 \u0026 n.6; Keystone Bituminous Coal Ass'n v. DeBenedictis, 480 U.S. 470, 495, 107 S. Ct. 1232, 94 L. Ed. 2d 472 (1987); Hodel v. Virginia Surface Mining \u0026 Reclamation Ass'n, 452 U.S. 264, 296, 101 S. Ct. 2352, 69 L. Ed. 2d 1 (1981).\n\nOf course, petitioners can only prevail on their takings claim if a right of first refusal is 'property.' See Penn Cent. Transp. Co. v. City of New York, 438 U.S. 104, 124-25, 98 S. Ct. 2646, 57 L. Ed. 2d 631 (1978) (describing dismissal of takings claims because the interests involved were not property) (citing United States v. Willow River Power Co., 324 U.S. 499, 65 S. Ct. 761, 89 L. Ed. 1101 (1945); United States v. Chandler-Dunbar Water Power Co., 229 U.S. 53, 33 S. Ct. 667, 57 L. Ed. 1063 (1913)); see also William B. Stoebuck, Non-trespassory Takings in Washington sec. 1.7, at 7 (1980) (noting the first question in a takings analysis is 'to determine if that which has been 'taken' is 'property'').\n\nWhether a property interest exists for the purposes of a takings analysis is determined by reference to state law. E.g., Phillips v. Washington Legal Found., 524 U.S. 156, 164, 118 S. Ct. 1925, 141 L. Ed. 2d 174 (1998). Our cases have unquestionably established that not only is a right of first refusal not a fundamental attribute of property ownership, it is not a property right at all. Robroy, 95 Wn.2d at 70-72; see also Bennett Veneer Factors, Inc. v Brewer, 73 Wn.2d 849, 853, 856, 441 P.2d 128 (1968); Old Nat'l Bank v. Arneson, 54 Wn. App. 717, 721, 776 P.2d 145 (1989); Feider v. Feider, 40 Wn. App. 589, 592, 699 P.2d 801 (1985).\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nThe majority attempts to distinguish our holding in Robroy, but the distinction is unpersuasive. While the issue in Robroy was presented in the context of the rule against perpetuities, its holding that a right of first refusal is not a property interest is equally applicable in this case. This conclusion is consistent with cases analyzing a right of first refusal in other contexts. For example, a right of first refusal does not implicate the real property statute of frauds, nor does it run with the land for the purpose of enforcing an equitable servitude. See Old Nat'l Bank, 54 Wn. App. at 722; Feider, 40 Wn. App. at 593. Because 'no interest in land is created by a right of first refusal{,} only personal rights are affected.' Old Nat'l Bank, 54 Wn. App. at 721 (emphasis added).\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nFurthermore, although Robroy addressed a right of first refusal in the hands of a grantee, this is irrelevant for purposes of characterizing the interest as real or personal property. If a grant of a right of first refusal does not create a real property interest in a grantee, then a fortiori legislation affecting a grantor's ability to convey such an option does not 'take' any real property interest from the grantor. One cannot take what was never there to begin with.\n\nEven if, however, the statute implicated a fundamental attribute of property ownership, this does not mean a taking has occurred. E.g., Guimont, 121 Wn.2d at 605 (regulation must 'destroy' fundamental attribute of property ownership); Orion, 109 Wn.2d at 664 (addressing whether fundamental attributes of ownership have been 'extinguished'). 'Not every infringement on a fundamental attribute of property ownership necessarily constitutes a 'taking'.' Guimont, 121 Wn.2d at 603 n.6 (emphasis added) (citing Presbytery, 114 Wn.2d at 333 n.21); see also PruneYard Shopping Ctr. v. Robins, 447 U.S. 74, 82-83, 100 S. Ct. 2035, 64 L. Ed. 2d 741 (1980); Armstrong v. United States, 364 U.S. 40, 48, 80 S. Ct. 1563, 4 L. Ed. 2d 1554 (1960) (contrasting 'total destruction by the Government of all value' with 'a mere 'consequential incidence' of a valid regulatory measure'); Garneau v. City of Seattle, 147 F.3d 802, 818-19 (9th Cir. 1998) (Williams, J., concurring).\n\n'{F}acial challenges to the economic impact of land use regulations require the landowner to prove the regulation denies all economically viable use of the owner's property . . . .' Guimont, 121 Wn.2d at 602 (emphasis added); see also Suitum v. Tahoe Reg'l Planning Agency, 520 U.S. 725, 736 \u0026 n.10, 117 S. Ct. 1659, 137 L. Ed. 2d 980 (1997) (citing Keystone, 480 U.S. at 495; Hodel, 452 U.S. at 297). The majority erroneously omits this requirement in setting forth the standards for a facial taking. Majority at 7-8. For example, the majority relies on Presbytery for the premise that the destruction of a fundamental attribute of property ownership, by itself, may serve as the basis for a facial taking. Majority at 7 (citing Presbytery, 114 Wn.2d at 330). Presbytery makes clear, however, that such a challenge cannot succeed unless the property owner also establishes that all economical use of his or her property is eviscerated. Presbytery, 114 Wn.2d at 333-34.\n\nIn Guimont, we were faced with a facial takings challenge to the Mobile Home Relocation Assistance Act, chapter 59.21 RCW. That statute required 'the owner of a mobile home park to pay relocation assistance to the park's tenants if the owner wants to close the park or convert it to another use.' Guimont, 121 Wn.2d at 591 (citing Laws of 1990, ch. 171, sec. 2(1)). Despite the obvious economic impacts of this regulation, this court rejected a facial challenge by mobile home park owners because they could not establish that the 'regulation of their property's use under the Act denies them all economically viable use of their property.' Guimont, 121 Wn.2d at 606.\n\nWhereas Guimont involved an actual monetary payment by the park owners, this case involves a far less invasive regulation. Both this court and the Court of Appeals have recognized the minimal economic impact of a right of first refusal. See, e.g., Robroy, 95 Wn.2d at 70 (a right of first refusal did not create a restraint on alienation because '{t}he marketability of the property remain{ed} unfettered.') (emphasis added); Feider, 40 Wn. App. at 593-94 (grant of right of first refusal did not 'touch and concern' the land because there was 'nothing in the record to indicate the value of the land of the respective parties here was increased or decreased or even affected by the agreement.' (emphasis added)).\n\nIndeed, we have previously suggested that the creation of a right of first refusal may lead to a more favorable economic result for petitioners: The interference with alienation present in a requirement that a designated person be afforded a reasonable opportunity to meet any offer received from a third person by an owner desirous of selling is so slight that the major policies furthered by freedom of alienation are not infringed to a degree which requires invalidation. Under these circumstances, the owner has two potential buyers at the same price and is assured of a reasonably prompt culmination of the sale. Such restraints are, therefore, valid. Robroy, 95 Wn.2d at 70-71 (emphasis added) (quoting Restatement of Property sec. 413 cmt. on subsection (1) (1944)).\n\nThis conclusion is compelling in the context of a facial challenge such as that presented in this case because no evidence of negative economic impact has been established. Applying this analytical framework established by our case law is also consistent with a recent analogous case that rejected a takings challenge under a similar statute. See Greenfield Country Estates Tenants Ass'n v. Deep, 423 Mass. 81, 87, 666 N.E.2d 988 (1996).\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e The court held because the Massachusetts law (like the Washington statute) did not restrict transfers of property by gift, devise, or operation of law, or require property to be sold on terms less favorable than could be received from a third party, the owner's freedom to transfer was minimally limited.\n\nThe statutory right of first refusal cannot be said materially to affect the marketability of the property so as to deprive it of economic value. We do not speculate as to the validity of {defendants'} unsubstantiated assertions that the restriction results in a diminution in property value or reduces the pool of prospective purchasers. We note only that mere conditioning the sale of the property to a right of first refusal does not amount to a taking. Greenfield County Estates, 423 Mass. at 87 (citing Andrus v. Allard, 444 U.S. 51, 66, 100 S. Ct. 318, 62 L. Ed. 2d 210 (1979)).\n\nThis reasoning mirrors our jurisprudence on facial regulatory takings and demonstrates that regardless of whether a successful as applied or due process challenge might be brought in the future, the mere enactment of chapter 59.23 RCW does not deprive petitioners of all economically viable use of their land. The fact this case presents a facial challenge to a regulatory taking also renders inapplicable the majority's argument that a taking may occur when property is 'statutorily transferred.' Majority at 25 (emphasis omitted). While this may be true, the cases cited by the majority for this premise all involve as applied challenges where defined pieces of property were allegedly taken. Majority at 25 (citing Brazil v. City of Auburn, 93 Wn.2d 484, 490-91, 610 P.2d 909 (1980); Highline Sch. Dist. No. 401 v. Port of Seattle, 87 Wn.2d 6, 17, 548 P.2d 1085 (1976); Ackerman v. Port of Seattle, 55 Wn.2d 400, 408, 329 P.2d 210, 348 P.2d 664, overruled on other grounds by Highline Sch. Dist. No. 401, 87 Wn.2d 6). All three of these cases also involved physical invasions and not regulatory takings. Both Highline and Ackerman dealt with aircraft flights through private airspace over parcels near the Seattle Tacoma International Airport, while Brazil dealt with the City of Auburn's construction of a public roadway on private land. Highline, 87 Wn.2d at 7; Ackerman, 55 Wn.2d at 402-03; Brazil, 93 Wn.2d at 485.\n\nPhysical invasions are treated very differently than regulatory takings. E.g., Presbytery, 114 Wn.2d at 335; Penn Cent. Transp. Co., 438 U.S. at 124. These cases simply do not provide the majority the authority to abandon the facial challenge and regulatory takings jurisprudence developed over the past two decades by this court.\n\n'{S}ome regulations, by their very nature, are just not subject to facial attack on takings grounds.' S. Pac. Transp. Co. v. City of Los Angeles, 922 F.2d 498, 506 n.9 (9th Cir. 1990), cert. denied, 502 U.S. 943, 112 S. Ct. 382, 116 L. Ed. 2d 333 (1991). Because no property has been taken from petitioners by the enactment of chapter 59.23 RCW and because petitioners cannot demonstrate the economic harm or physical invasion that must be shown in a facial challenge, I would conclude this statute is not a taking. I would, therefore, not reach the question of whether article I, section 16 (amend. 9) of the Washington State Constitution may, in some circumstances, provide greater protection than the Fifth Amendment. I would affirm the Court of Appeals and the superior court on the ground that no unconstitutional facial taking has occurred.\n\nTALMADGE, J. (dissenting)\n\nToday, the Washington Supreme Court strikes down legislation designed to assist the vulnerable, and fundamentally alters the judicial treatment of the police power, an attribute of government long-recognized everywhere as essential to our fundamental notions of ordered liberty. Today, the Washington Supreme Court revives the Lochner\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e era, when a conservative United States Supreme Court struck down measure after measure of state legislation designed to ease the burdens of the oppressed and those in need. Today, the Washington Supreme Court returns to the days when property rights were considered more important than human rights.\n\nIt is bitterly ironic that this should happen in Washington. This state was an early leader in passing laws banning child labor, setting minimum wages for women and children, promoting mine safety, and limiting hours an employer could require employees to work -- all long before federal legislation on the same subjects. In the early 20th Century, our predecessors on this Court upheld such legislation against the challenges of the powerful in society. The spirit that animated those days has been displaced in this case by a new property rights absolutism that distorts the relationship between the legislative and judicial branches, and usurps for the Washington Supreme Court the role of final arbiter of what is good social legislation.\n\nBy unsoundly equating any regulation of land with a taking of land by eminent domain, the majority pushes the parameters of Washington's eminent domain law far beyond anything envisioned by our constitutional framers or the framers of any other state constitution. The majority departs from the traditional elements of takings law we articulated in Guimont v. Clarke, 121 Wn.2d 586, 854 P.2d 1 (1993), cert. denied, 510 U.S. 1176, 114 S. Ct. 1216, 127 L. Ed. 2d 563 (1994), in favor of a novel interpretation of art. I, sec. 16 of our Constitution by suggesting even a minor regulation of property may be a taking.\n\nBecause the mobile home statute in question here does not effect a taking of the mobile home park owners' property, and because the majority's opinion calls into question numerous other appropriate regulations of property pursuant to the State's well-settled police powers, I agree with Justice Johnson's dissent. I write separately to express my concern for what the majority's disposition of this case does to the police power in Washington as it has been exercised since 1889.\n\nA. Mobile and Manufactured Homes\n\nAt the outset, this facial challenge to the Mobile Home Parks Resident Ownership Act, chapter 59.23 RCW (the Act), relates to legislation enacted pursuant to the police power of the State of Washington. The majority has appropriately described how the Act operates and the facial constitutional challenge the petitioners have made to the statutory enactment. But, in conjunction with its flawed interpretation, the majority neglects to discuss the practical reality of mobile home life.\n\nMobile homes are not mobile. The term is a vestige of earlier times when mobile homes were more like today's recreational vehicles. Today mobile homes are 'designed to be placed permanently on a pad and maintained there for life.' Roger Colton \u0026 Michael Sheehan, The Problem of Mass Evictions in Mobile Home Parks Subject to Conversion, 8-Spring, J. Affordable Housing \u0026 Community Dev. L. 231, 232 (1999). 'Once 'planted' and 'plugged in,' they are not easily relocated.' Miller v. Valley Forge Vill., 43 N.Y.2d 626, 374 N.E.2d 118, 120 (1978). Moreover, In most instances a mobile home owner in a park is required to remove the wheels and anchor the home to the ground in order to facilitate connections with electricity, water and sewerage. Thus it is only at substantial expense that a mobile home can be removed from a park with no ready place to go. Malvern Courts, Inc. v. Stephens, 275 Pa. Super. 518, 419 A.2d 21, 23 (1980).\n\nPhysically moving a double- or triple-wide mobile home involves 'unsealing; unroofing the roofed-over seams; mechanically separating the sections; disconnecting plumbing and other utilities; removing carports, porches, and similar fixtures; and lifting the home off its foundation or supports.' Colton \u0026 Sheehan, supra, 232. Costs of relocation, assuming relocation is even possible for older units, can range as high as $10,000. Id. It is the immobility of mobile homes that 'accounts for most of the problems and abuses endured by mobile home tenants.' Luther Zeigler, Statutory Protections for Mobile Home Park Tenants -- The New York Model, 14 Real Estate L.J. 77, 78 (1985).\n\nThe effects on mobile home owners (home owners) faced with moving because mobile home park owners (park owners) want to convert a mobile home park to another use can be devastating. A home owner owns the mobile home, but only rents the land on which it sits. Closure and conversion of a mobile home park force the owner either to move, or to abandon what may be his most valuable equity investment, a mobile home, to the developer's bulldozer. Displacement from a mobile home park can 'mean economic ruin for a mobile home owner.' Karl Manheim, Tenant Eviction Protection and the Takings Clause, 1989 Wis. L. Rev. 925, 956 n.179 (1989). See Granat v. Keasler, 99 Wn.2d 564, 663 P.2d 830 (discussing similar problems for owners of houseboats renting moorage), cert. denied, 464 U.S. 1018, 104 S. Ct. 549, 78 L. Ed. 2d 723 (1983).\n\nAvailability of affordable housing is one of the goals of the Growth Management Act. RCW 36.70A.020(4). Mobile homes present affordable housing options for large segments of society. The President's Commission on Housing declared:\n\n{M}anufactured housing is a significant source of affordable housing for American families, particularly first-time homebuyers, the elderly, and low-and moderate-income families. . . . Almost all local and state regulations, however, discriminate against manufactured housing. These discriminatory policies cause communities to ignore and forgo a promising opportunity to narrow the gap between supply and demand for affordable housing. Molly A. Sellman, Equal Treatment of Housing: A Proposed Model State Code for Manufactured Housing, 20 Urb. L. 73, 74 n.3 (1988) (quoting The Report of the President's Commission on Housing 56, 85 (1982)).\n\nThe human dimension to mobile home ownership is considerable. 'Mobile home residents are typically poorer than the average rental household, with incomes lower by one-third. Many home owners are elderly residents with friends, contacts, and community that have centered on the park for years, if not decades.' Colton \u0026 Sheehan, supra, at 233. The costs to the community in terms of providing public housing for evicted mobile home owners who are low-income families or the elderly, for example, are enormous. Exacerbating the problem is the scarcity of mobile home parks:\n\nSome towns exclude mobile homes altogether; others limit how long the homes can stay in town. Most frequently, municipalities confine mobile homes to privately-owned mobile home parks and restrict the number of parks permitted in the town. Consequently, there is a major shortage of space for mobile homes. Thus the owner who needs to rent a lot for his mobile home has no choice but to enter the 'park owner's market' in which the demand for space far exceeds the supply of available lots. Thomas G. Moukawsher, Mobile Home Parks and Connecticut's Regulatory Scheme: A Takings Analysis, 17 Conn. L. Rev. 811, 814-15 (1985) (footnotes omitted). See Jay M. Zitter, Annotation, Validity of Zoning or Building Regulations Restricting Mobile Homes or Trailers to Established Mobile Home or Trailer Parks, 17 A.L.R.4th 106 (1982).\n\nNot surprisingly, abuses abound in this seller's market:\n\nPark owners have been criticized for charging exorbitant entrance fees and for claiming from their tenants miscellaneous, and often arbitrary, charges, in addition to fees for extra cars, children, pets, or guests. Most important, the combination of short leases, entrance fees, and prohibitions of on-the-lot sales have allowed some park owners to make substantial profits by evicting home owners and their homes. Because of the space shortage, many evicted mobile home owners have lost their investments. Park owners have not allowed the homes to be sold on their land, and there are few, if any, other places to put them. Consequently, the evicted homes are worth much less when offered for sale. Moukawsher, supra, at 815 (footnotes omitted). The Maryland Court of Appeals in 1980 detailed abuses afflicting mobile home tenants:\n\nDespite the rising popularity of relatively low cost mobile homes, many communities have enacted zoning regulations which exclude them entirely or severely limit the areas where they may be placed, frequently restricting them to mobile home parks. Thus, the mobile home owner is compelled to rent space from the park owners who, because of the limited availability of space and the high cost of relocation, are able to dictate unfavorable rental terms and conditions. As a result, mobile home owners often have been forced to buy mobile homes from the park owner in order to obtain a site, to pay excessive entrance fees, to buy specified commodities from specified dealers, to pay the park owner a commission on the sale of the mobile home, or, upon sale, to remove and pay an exit fee. Cider Barrel Mobile Home Court v. Eader, 287 Md. 571, 414 A.2d 1246, 1248 (1980).\n\nManifestly, home owners have markedly less bargaining power -- in fact, they have none, as upon eviction they become homeless and may lose what is likely their most valuable asset, their homes -- than do park owners. As a consequence, home owners are not in a position individually to bargain at arm's length with their landlords, the park owners.\n\nB. The Legislation\n\nIn response to these inequities and the abuses home owners often suffer, and in an attempt to bolster the home owners' bargaining position, the Legislature enacted the Mobile Home Relocation Assistance Act in 1989, chapter 59.21 RCW, requiring the owner of a mobile home park to pay relocation assistance to the park's tenants if the owner wanted to close the park or convert it to other use.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e The law provided $4,500 relocation assistance for single-wide mobile homes and $7,500 relocation assistance for double-wide mobile homes. Laws of 1990, ch. 171, sec. 2(1). We struck down the law as a violation of the park owners' substantive due process rights under the Fourteenth Amendment, but we also held the law was not a taking of property without just compensation. Guimont, 121 Wn.2d at 614.\n\nApparently in response to Guimont and as a reflection of continuing concern about the plight of mobile home owners, the Legislature enacted chapter 59.23 RCW, expressing its findings and intent as follows:\n\nThe legislature finds that mobile home parks provide a significant source of homeownership for many Washington residents, but increasing rents and low vacancy rates, as well as the pressure to convert mobile home parks to other uses, increasingly make mobile home park living insecure for mobile home owners. The legislature also finds that many homeowners who reside in mobile home parks are also those residents most in need of reasonable security in the siting of their manufactured homes. It is the intent of the legislature to encourage and facilitate the conversion of mobile home parks to resident ownership in the event of a voluntary sale of the park. RCW 59.23.005.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e The bill passed both the Senate and the House of Representatives without a single dissenting vote in either body. The House Bill Report of April 8, 1993 states:\n\nThis is a compromise worked out between park owners and tenants to address mobile home landlord-tenant issues. Agreement has been reached on such issues as removing problem tenants from the park, eliminating no-cause evictions with 12 months notice, allowing tenants to purchase parks when the owner is selling to other than a relative, and allowing park owners to purchase mobile homes for sale by the tenant to other than relatives. This bill will improve the relationship between good tenants and park owners, and will better enable the few problem tenants and the few problem park owners to be addressed more effectively. H.B. Rep. ESSB 5482 (Wash. 1993) (emphasis added).\n\nAccording to the same bill report, there was no testimony against the bill, while two representatives of the Washington Mobile Home Park Owners spoke in support of the bill. Two years later the park owners brought the present lawsuit claiming chapter 59.23 RCW is unconstitutional.\n\nC. The Act Does Not Take the Park Owners' Property\n\nIn agreeing with the park owners, the majority says: 'The instant case falls within the rule that would generally find a taking where a regulation deprives the owner of a fundamental attribute of property ownership.' Majority op. at 25. For the majority, any regulation affecting any fundamental attribute of property is a taking. Thus does the majority facilely dispose of 130 years of American regulatory taking jurisprudence, beginning with Pumpelly v. Green Bay \u0026 Miss. Canal Co., 80 U.S. (13 Wall.) 166, 20 L. Ed. 557 (1871), and continuing to the present day:\n\nAlmost from the inception of our regulatory takings doctrine, we have held that whether a regulation of property goes so far that 'there must be an exercise of eminent domain and compensation to sustain the act . . . depends upon the particular facts.' Pennsylvania Coal Co. v. Mahon, 260 U.S. 393, 413{, 43 S. Ct. 158, 67 L. Ed. 322} (1922); accord, Keystone Bituminous Coal, supra, at 473-474{, 107 S. Ct. 1232}. Consistent with this understanding, we have described determinations of liability in regulatory takings cases as ' 'essentially ad hoc, factual inquiries,' ' Lucas, supra, at 1015{, 112 S. Ct. 2886} (quoting Penn Central Transp. Co. v. New York City, 438 U.S. 104, 124{, 98 S. Ct. 2646, 57 L. Ed. 2d 631} (1978)), requiring 'complex factual assessments of the purposes and economic effects of government actions.' City of Monterey v. Del Monte Dunes at Monterey, Ltd., 526 U.S. 687, 720, 119 S. Ct. 1624, 143 L. Ed. 2d 882 (1999).\n\nNo factual inquiries or complex assessments beset the majority and deter it from formulating its unprecedented rule. The majority's analysis is flawed from the outset.\n\n1. The Majority's Gunwall Analysis and Property Rights in Washington.\n\nWithout saying why it is necessary to do so, the majority undertakes an analysis pursuant to State v. Gunwall, 106 Wn.2d 54, 720 P.2d 808 (1986). The original intent of a Gunwall analysis was to determine whether 'the constitution of the State of Washington should be considered as extending broader rights to its citizens than does the United States Constitution.' Id. at 61.\n\nThe majority looks at the first sentence of Wash. const. art. I, sec. 16 -- 'Private property shall not be taken for private use'\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e -- and concludes our constitution provides more protection for private property owners than does the Fifth Amendment to the United States Constitution. How the majority gets there is a monumental puzzle, because the Fifth Amendment does not mention 'private use.' The Fifth Amendment speaks only of public use: 'nor shall private property be taken for public use, without just compensation.'\n\nThe majority tells us that we have taken a much more restrictive view of the meaning of public use than has the United States Supreme Court. Majority op. at 13. The majority is quite right. Compare, e.g., In re Petition of Seattle, 96 Wn.2d 616, 627, 638 P.2d 549 (1981) (holding a beneficial use is not necessarily a public use), with Haw. Hous. Auth v. Midkiff, 467 U.S. 229, 242, 104 S. Ct. 2331, 81 L. Ed. 2d 186 (1984) (public use requirement coterminous with the scope of a sovereign's police powers.).\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e But the term public use does not appear in the first sentence of art. I, sec. 16, the provision the majority says is key to its analysis. It would have been a more revealing and more fruitful exercise for the majority to have compared the constitutional meaning of the sentence it relies on in our constitution -- 'Private property shall not be taken for private use' -- with the United States Supreme Court's treatment of that concept.\n\nIn 1896, the Court addressed the question of takings for private use and said categorically: 'The taking by a state of the private property of one person or corporation, without the owner's consent, for the private use of another, is not due process of law, and is a violation of the fourteenth article of amendment of the constitution of the United States.' M. Pac. Ry. Co. v. State of Neb., 164 U.S. 403, 417 17 S. Ct. 130, 41 L. Ed. 489 (1896). This proposition became so well entrenched in federal jurisprudence that the Court of Appeals for the Ninth Circuit was able to say 100 years later: 'It is overwhelmingly clear from more than a century of precedent that the government violates the Constitution when it takes private property for private use. . . .' Armendariz v. Penman, 75 F.3d 1311, 1320-21 (9th Cir. 1996). Indeed, there is a primeval notion in American law to the effect that the taking of private property for private use is not even a permissible action of government. In a famous passage, Justice Samuel Chase said in Calder v. Bull, 3 U.S. (3 Dall.) 386, 388, 1 L.Ed. 648 (1798):\n\nAn ACT of the Legislature (for I cannot call it a law) contrary to the great first principles of the social compact, cannot be considered a rightful exercise of legislative authority. The obligation of a law in governments established on express compact, and on republican principles, must be determined by the nature of the power, on which it is founded. A few instances will suffice to explain what I mean. A law that punished a citizen for an innocent action, or, in other words, for an act, which, when done, was in violation of no existing law; a law that destroys, or impairs, the lawful private contracts of citizens; a law that makes a man a Judge in his own cause; or a law that takes property from A. and gives it to B: It is against all reason and justice, for a people to entrust a Legislature with SUCH powers; and, therefore, it cannot be presumed that they have done it. The genius, the nature, and the spirit, of our State Governments, amount to a prohibition of such acts of legislation; and the general principles of law and reason forbid them.\n\nJustice Chase was speaking here not of constitutional law, but of natural law, of powers no government may exercise because 'general principles of law and reason forbid them.'\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e The aphorism about the prohibition against taking from A and giving to B is enshrined in American law. Justice Story said in 1829: 'We know of no case, in which a legislative act to transfer the property of A. to B. without his consent, has ever been held a constitutional exercise of legislative power, in any state in the Union.' Wilkinson v. Leland, 27 U.S. (2 Pet.) 627, 657, 7 L.Ed. 542 (1829). The Supreme Court has cited Chase's aphorism as recently as 1998. See Eastern Enters. v. Apfel, 524 U.S. 498, 522, 118 S. Ct. 2131, 141 L. Ed. 2d 451 (1998).\n\nAlthough there can be little argument in justification of the idea the government may arbitrarily take your private property and give it over to someone else's private use (as opposed to public use), Chase's aphorism has been employed on occasion to pernicious effect. For example, in invalidating New York's pioneering worker's compensation law, the New York Court of Appeals gave as one of the invalidating reasons the requirement for employers to pay premiums into the fund to pay injured workers was 'taking the property of A. and giving it to B., and that cannot be done under our Constitutions.' Ives v. S. Buffalo Ry. Co., 201 N.Y. 271, 94 N.E. 431, 440 (1911). By contrast, that same year our predecessors on this Court, true to their Progressive Era and Populist roots, rejected similar property rights arguments to become the first court in the country to uphold the constitutionality of worker's compensation legislation. See State v. Clausen, 65 Wash. 156, 184-88, 117 P. 1101 (1911) (''{I}t is established by a series of cases that an ulterior public advantage may justify a comparatively insignificant taking of private property for what, in its immediate purpose, is a private use.'' (quoting Noble State Bank v. Haskell, 219 U.S. 104, 110, 31 S. Ct. 186, 55 L. Ed. 112 (1911) (Holmes, J.)).\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nAgainst that background, we turn to Washington's constitutional provision, 'Private property shall not be taken for private use.' That is plain enough, but that is not all the first sentence of art. I, sec. 16 says. The remainder of the sentence goes on to say private property may be taken for private use 'for private ways of necessity, and for drains, flumes, or ditches on or across the lands of others for agricultural, domestic, or sanitary purposes.' But isn't this taking private property from A and giving it to B for private use? Doesn't this provision in our state constitution violate the Fourteenth Amendment per Missouri Pacific Railway? The answer to the first question is yes; the answer to the second question is no.\n\nWe considered these very questions in Mountain Timber Co. v. Superior Court of Cowlitz County, 77 Wash. 585, 137 P. 994 (1914). Mountain Timber wanted to condemn land belonging to another for use as a logging road. There was no outlet for the company's timber other than over the land of the respondent. See id. at 586. A 1913 statute enacted pursuant to art. I, sec. 16's exception for private ways of necessity allowed as much: 'An owner, or one entitled to the beneficial use, of land which is so situate with respect to the land of another that it is necessary for its proper use and enjoyment to have and maintain a private way of necessity . . . may condemn and take lands of such other sufficient in area for the construction and maintenance of such private way of necessity, . . . The term 'private way of necessity,' as used in this act, shall mean and include a right of way on, across, over or through the land of another for means of ingress and egress, and the construction and maintenance thereon of roads, logging roads, flumes, canals, ditches, tunnels, tramways and other structures upon, over and through which timber, stone, minerals or other valuable materials and products may be transported and carried. Mountain Timber, 77 Wash. at 586 (quoting Laws of 1913, at 412). The statute provided for compensation for the condemnation. See id.\n\nNevertheless, the owner of the property resisted the condemnation by demurrer, and the trial court refused to permit the condemnation. See id.\n\nIn a unanimous opinion authored by Justice Gose, we began with a 'recurrence to certain fundamental principles,' noting ''the power of eminent domain is not a reserved, but an inherent right, a right which pertains to sovereignty as a necessary, constant and inextinguishable attribute.'' Id.. at 587, 588 (quoting 1 John Lewis, Eminent Domain sec. 3 (3d ed. 1909)).\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e After saying the power of eminent domain is an inherent attribute of sovereignty, we carefully corrected a misstatement in an earlier case that art. I, sec. 16 grants the right to take private property for private use. Not so, we said. The proper way to look at it is that the State, as the sovereign, has the inherent power to condemn any land for any use, and that art. I, sec. 16 carves out a constitutional exception regarding private use. Art. I, sec. 16 simply excludes private ways of necessity from the exception for private use. See Mountain Timber, 77 Wash. at 590. Thus, the challenged statute did nothing more than provide a procedure for what the State had the inherent authority to do.\n\nWith respect to the federal constitutionality of the statute, we said: 'The taking of private property for private use for the promotion of the general welfare, upon due notice and hearing and the payment of compensation,\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e is not incompatible with due process of law, as guaranteed by the Federal constitution.' Id. at 592 (citing Head v. Amoskeag Mfg. Co., 113 U.S. 9, 5 S. Ct. 441, 28 L. Ed. 889 (1885). The 'general welfare' we referred to existed because the road 'prevents a private individual from bottling up a portion of the resources of the state.' Mountain Timber, 77 Wash. at 590. The Court of Appeals for the Ninth Circuit later affirmed the constitutionality of the statute under the Fourteenth Amendment in Ruddock v. Bloedel Donovan Lumber Mills, 28 F.2d 684, 687 (9th Cir. 1928).\n\nTo summarize the foregoing discussion, we know, pursuant to the Ninth Circuit's strong statement in Armendariz, the taking of private property for private use violates Fourteenth Amendment due process under federal jurisprudence. We also know under Wash. const. art. I, sec. 16, the government may take private property for private use so long as the taking promotes the general welfare and compensation is paid, and that such a taking does not violate Fourteenth Amendment due process.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Consequently, one can hardly agree with the majority that our state constitution provides greater protection for private property than the federal constitution. At the very least, the two constitutions provide similar protection. The taking of private property for private use that occurred in Mountain Timber received validation both in Washington's Supreme Court and the Court of Appeals for the Ninth Circuit.\n\n2. No Taking of Property Occurred Here.\n\nAs the majority correctly points out, under either the Fifth Amendment or art. I, sec. 16, in order for a taking to occur, government must take a citizen's property. Thus, the first task in any taking analysis is to identify what property, if any, is involved. The majority identifies two species of property, a right of first refusal and the right to dispose of property, but unfortunately conflates its assessment of the two, leading to analytical confusion. The majority discusses the right of first refusal and treats it as equivalent to a fundamental attribute of property, the right to dispose of it. But the majority fails properly to characterize the nature of a right of first refusal.\n\nThe majority says the right of first refusal in the hands of the property owner is a valuable property right. Justice Johnson correctly points out this so-called right is not a property right susceptible to a takings analysis.\n\nProperly analyzed, what the park owners claim the statute unconstitutionally took from them is their alleged right to sell their mobile home parks in any manner they might choose to whomever they might choose.\n\nUntil today, we have interpreted art. I, sec. 16 and the Fifth Amendment as essentially coextensive. Highline Sch. Dist. No. 401 v. Port of Seattle, 87 Wn.2d 6, 11, 548 P.2d 1085 (1976); Orion Corp. v. State, 109 Wn.2d 621, 657-58, 747 P.2d 1062 (1987), cert. denied, 486 U.S. 1022, 108 S. Ct. 1996, 100 L. Ed. 2d 227 (1988). Because the majority offers no sustainable reason why we should not continue to do so, its singular excursion into regulatory taking law, which has no parallel anywhere and in fact directly contradicts all United States Supreme Court decisions on regulatory takings, is difficult to follow or support. The proper course, which we followed in Guimont, is to continue to apply the ample, well-established federal law of regulatory takings.\n\nIn Guimont, we adopted the United States Supreme Court's formulation for a facial taking. Neither the park owners nor the majority relies on this test for authority, of course, because they simply cannot show the challenged statute fails any aspect of the Guimont test.\n\nFirst, a taking may be present where there is a physical invasion of the property by government. Loretto v. Teleprompter Manhattan CATV Corp., 458 U.S. 419, 426, 102 S. Ct. 3164, 73 L. Ed. 2d 868 (1982) ('a permanent physical occupation authorized by government is a taking without regard to the public interests that it may serve.'). Obviously, no such physical invasion occurs as a result of the challenged statute in this case.\n\nSecond, a taking may be present if the action of the government in regulating the uses that can be made of the property denies the landowner all economically viable use of the property:\n\n. . . {T}o succeed in proving that a statute on its face effects a taking by regulating the uses that can be made of property, the landowner must show that the mere enactment of the statute denies the owner of all economically viable use of the property. Guimont, 121 Wn.2d at 605 (footnote omitted).\n\nAs the Supreme Court explained in PruneYard Shopping Ctr. v. Robins, 447 U.S. 74, 84, 100 S. Ct. 2035, 64 L. Ed. 2d 741 (1980), to establish a constitutional taking, a property owner must prove the rights lost were 'so essential to the use or economic value of {the} property that {a} state-authorized limitation of it amounted to a 'taking'.' See also Lucas v. S.C. Coastal Council, 505 U.S. 1003, 1018, 112 S. Ct. 2886, 120 L. Ed. 2d 798 (1992); City of Monterey v. Del Monte Dunes at Monterey, Ltd., 526 U.S. 687, 119 S. Ct. 1624, 1644, 143 L. Ed. 2d 882 (1999) (holding determination of deprivation of all economically viable use is a jury question). Again, park owners in this case cannot demonstrate such a total taking of property by governmental regulation occurred, in any sense.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nFinally, a taking by enactment of a statute or regulation can be demonstrated when the government action destroys or derogates a fundamental attribute of ownership. Guimont, 121 Wn.2d at 602.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Guimont indicates a taking cannot be found unless a fundamental attribute of ownership is actually destroyed or derogated. The term 'destroyed or derogated' has been discussed in several Washington cases. See Presbytery of Seattle v. King County, 114 Wn.2d 320, 329-30, 787 P.2d 907 ('court{s} should ask whether the regulation destroys one or more of the fundamental attributes of ownership'), cert. denied, 498 U.S. 911, 111 S. Ct. 284, 112 L. Ed. 2d 238 (1990); Sintra, Inc. v. City of Seattle, 119 Wn.2d 1, 14 n.6, 829 P.2d 765 ('regulation may also be a taking if it destroys one or more of the fundamental attributes of property ownership'), cert. denied, 506 U.S. 1028, 113 S. Ct. 676, 121 L. Ed. 2d 598 (1992); Robinson v. City of Seattle, 119 Wn.2d 34, 50, 830 P.2d 318 ('we ask whether the regulation destroys or derogates any fundamental attribute of ownership'), cert. denied, 506 U.S. 1028, 113 S. Ct. 676, 121 L. Ed. 2d 598 (1992); see also Margola Assocs. v. City of Seattle, 121 Wn.2d 625, 643, 854 P.2d 23 (1993) ('court first asks whether the challenged regulation destroys one or more fundamental attributes of property ownership'). The majority blithely asserts because the Act 'destroys or derogates' a fundamental attribute of ownership, it is a taking. The majority's assertion is superficial and far too simplistic. As Justice Oliver Wendell Holmes so aptly said, 'General propositions do not decide concrete cases.' Lochner v. New York, 198 U.S. 45, 76, 25 S. Ct. 539, 49 L. Ed. 937 (1905) (Holmes, J., dissenting), overruled in part on other grounds by Day-Brite Lighting Inc. v. State of Mo., 342 U.S. 421, 72 S.Ct. 405, 96 L.Ed. 469 (1952).\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nFirst, '{i}t is true that not every destruction or injury to property by governmental action has been held to be a 'taking' in the constitutional sense.' Armstrong v. United States, 364 U.S. 40, 48, 80 S. Ct. 1563, 4 L. Ed. 2d 1554 (1960). Accord Eastern Enters. v. Apfel, 524 U.S. 498, 118 S. Ct. 2131, 2146, 141 L. Ed. 2d 451 (1998) ('The party challenging the government action bears a substantial burden, for not every destruction or injury to property by such action is a constitutional taking.'); PruneYard, 447 U.S. at 82; Penn Cent. Transp. Co. v. City of New York, 438 U.S. 104, 144, 98 S. Ct. 2646, 57 L. Ed. 2d 631 (1978); Alderwood Assocs. v. Wash. Council, 96 Wn.2d 230, 251, 635 P.2d 108 (1981) (Dolliver, J., concurring). Even the intellectual father of the modern property rights movement, Professor Richard A. Epstein, has written, 'But government restraint on property does not necessarily violate the Constitution as a deprivation of property rights. Even if left uncompensated, such restraints could well be justified under the state's police power.' Richard A. Epstein, Lest We Forget: Buchanan v. Warley and Constitutional Jurisprudence of the 'Progressive Era,' 51 Vand. L. Rev. 787, 789 (1998). In other words, simply concluding a regulation affects some fundamental attribute of property initiates the inquiry, rather than ends it, as the majority opinion would have it. The inquiry into when a regulatory taking exists has assumed many forms. A study of each of them demonstrates conclusively the absence of a taking here.\n\n1. The Holmes Test\n\nIn the famous case, Pennsylvania Coal Co. v. Mahon, 260 U.S. 393, 415, 43 S. Ct. 158, 67 L. Ed. 322 (1922), Justice Holmes wrote: 'The general rule at least is that while property may be regulated to a certain extent, if regulation goes too far it will be recognized as a taking.' The first part of this sentence, 'property may be regulated to a certain extent,' is often overlooked. It means the police power may legitimately regulate property. As Justice Antonin Scalia, writing for the majority 70 years later said: 'It seems to us that the property owner necessarily expects the uses of his property to be restricted, from time to time, by various measures newly enacted by the State in legitimate exercise of its police powers.' Lucas v. S.C. Coastal Council, 505 U.S. 1003, 1027, 112 S. Ct. 2886, 120 L. Ed. 2d 798 (1992).\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Thus, regulation of property is not forbidden. The question as Holmes posed it is when does a regulation go so far as to constitute a taking: 'For just as there comes a point at which the police power ceases and leaves only that of eminent domain, it may be conceded that regulations of the present sort {rent control} pressed to a certain height might amount to a taking without due process.' Block v. Hirsch, 256 U.S. 135, 156, 41 S. Ct. 458, 65 L. Ed. 865 (1921) (upholding District of Columbia rent control law).\n\nThe determination of when a regulation goes 'too far' is necessarily a substantive judgment. The object of the 'too far' inquiry is 'to distinguish the point at which regulation becomes so onerous that it has the same effect as an appropriation of the property through eminent domain or physical possession.' Williamson County Reg'l Planning Comm'n v. Hamilton Bank, 473 U.S. 172, 199, 105 S. Ct. 3108, 87 L. Ed. 2d 126 (1985). Here, the effect of the challenged Act is negligible. A park owner must simply give the park tenants notice of an impending sale and accept their offer if it equals the first offer. The park owner is financially as well off as if the statute were not in effect. By any test imaginable, other than an absolute prohibition against any regulation of property, the statute in the present case does not go too far.\n\n2. The Armstrong Test\n\nJustice Black said in Armstrong v. United States, 364 U.S. 40, 49, 80 S. Ct. 1563, 4 L. Ed. 2d 1554 (1960), 'The Fifth Amendment's guarantee that private property shall not be taken for a public use without just compensation was designed to bar Government from forcing some people alone to bear public burdens which, in all fairness and justice, should be borne by the public as a whole.' The Supreme Court has lately referred to this statement as an expression of the Fifth Amendment's 'concern{ } for proportionality.' City of Monterey v. Del Monte Dunes at Monterey, Ltd., 526 U.S. 687, 702, 119 S. Ct. 1624, 143 L. Ed. 2d 882 (1999). Thus, the question of whether a regulation effects a taking 'necessarily requires a weighing of private and public interests.' Agins v. City of Tiburon, 447 U.S. 255, 261, 100 S. Ct. 2138, 65 L. Ed. 2d 106 (1980). In the balance here, is the park owners' wish to sell the park free of the right of first refusal the statute gives the park tenants balanced against the devastating economic and social consequences of the sale of a mobile home park on its tenants. Justice Black used the phrase 'in all fairness and justice.' What fairness or justice is there in the majority's assertion that a month's delay in a park owner's ability to sell is more important than the fates of the park tenants? Park tenants who because of the sale become homeless create new burdens for the people of Washington. To avoid these harsh results, the Legislature voted unanimously to give the park tenants a chance to remain in their homes by buying the park. The Legislature imposed a minimal obligation on the park owner -- to forbear for 30 days to give the tenants a chance to buy the park. That minimal obligation, compared to the severe effects and costs to society of displacing tenants, leads to the conclusion that the statute does not require the park owners to bear a burden out of proportion to the burden that ought to be borne by society as a whole.\n\n3. Substantive Due Process\n\nPetitioner Manufactured Housing Communities of Washington has not challenged the statute on substantive due process grounds, so there is no substantive due process question before the Court. But because analysis of an alleged taking under both the 'too far' test and the Armstrong test involves substantive weighing determinations, it is helpful and instructive to look at how we might analyze this case under our substantive due process protocol.\n\nWe said in Presbytery of Seattle, 114 Wn.2d at 330: To determine whether the regulation violates due process, the court should engage in the classic 3-prong due process test and ask: (1) whether the regulation is aimed at achieving a legitimate public purpose; (2) whether it uses means that are reasonably necessary to achieve that purpose; and (3) whether it is unduly oppressive on the land owner. 'In other words, 1) there must be a public problem or 'evil,' 2) the regulation must tend to solve this problem, and 3) the regulation must not be 'unduly oppressive' upon the person regulated.' The third inquiry will usually be the difficult and determinative one. (Footnotes omitted.)\n\nApplying that analysis here, it is easy to see the challenged statute has a legitimate public purpose: the avoidance of economic devastation and homelessness following the sale of a mobile home park. The statute plainly uses means reasonably necessary to achieve its goal: giving the park tenants a chance to buy the park would prevent their displacement. Finally, the third prong, consideration of whether the statute is unduly oppressive, can lead only to the conclusion it is not: the statute does not result in any financial detriment to the park owners whatsoever. Compared to the social and economic costs of displacement of park tenants, the trivial delay in the sale of a park the statute imposes can hardly be considered unduly oppressive.\n\n4. The Penn Central Test\n\nTwenty-one years ago in Penn Central, 438 U.S. 104, the United States Supreme Court adopted an analytical protocol for assessing takings. In affirming a New York Court of Appeals decision upholding as against a regulatory taking challenge the City Landmarks Preservation Commission's denial of permission to build a 50-story office building over Grand Central Terminal, the Court noted its regulatory takings jurisprudence had not been based on fixed rules:\n\nIn engaging in these essentially ad hoc, factual inquiries, the Court's decisions have identified several factors that have particular significance. The economic impact of the regulation on the claimant and, particularly, the extent to which the regulation has interfered with distinct investment-backed expectations are, of course, relevant considerations. See Goldblatt v. {Town of} Hempstead, {369 U.S. 590, 594, 82 S. Ct. 987, 990, 8 L.Ed. 2d 130 (1962)}. So, too, is the character of the governmental action. A 'taking' may more readily be found when the interference with property can be characterized as a physical invasion by government, see, e. g., United States v. Causby, 328 U.S. 256{, 66 S. Ct. 1062, 90 L. Ed. 1206} (1946), than when interference arises from some public program adjusting the benefits and burdens of economic life to promote the common good. Id. at 124 (emphasis added). Accord Eastern Enterprises, 118 S. Ct. at 2146.\n\nThus, to determine whether a regulatory taking has occurred, the United States Supreme Court looks to the character of the regulation, the economic impact on the landowner, and the extent of interference with investment-backed expectations. Until today, we have followed the Penn Central three-part balancing test. Presbytery of Seattle, 114 Wn.2d at 334. The majority offers no reason why we should now overrule Presbytery and Guimont and abandon the Penn Central test.\n\nIn any event, the park owners cannot meet the three-part Penn Central balancing test:\n\n1. Character of the Regulation.\n\nLooking first to the character of the regulation, one can hardly deem it oppressive or burdensome. Unlike the statute we struck down in Guimont, the Act requires no financial contribution from the park owners. In fact, it may actually provide a benefit to the owners by helping improve the market for the mobile home park. A prospective third-party purchaser is more likely to offer a higher price for the park, knowing the home owners may match the offer. The statute, by providing notice to tenants and giving them a chance to bid the fair market value for a park, thus has the effect of promoting and encouraging a free and efficient market. An efficient market should work to the financial advantage of park owners.\n\nMoreover, the United States Supreme Court has repeatedly upheld regulations adjusting the benefits and burdens of economic life to promote the social good, even though those regulations may have destroyed or adversely affected property interests.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e See, e.g., Connolly v. Pension Benefit Guar. Corp., 475 U.S. 211, 225, 106 S. Ct. 1018, 89 L. Ed. 2d 166 (1986) (provisions of Multi-Employer Pension Plan Amendments Act of 1980, requiring withdrawing employers to pay proportionate share of plan's unfunded vested benefits, did not violate Fifth Amendment taking clause); Penn Cent. Transp. Co., 438 U.S. at 125 (owners of historic building could not establish a taking merely by showing landmark preservation ordinance prevented them from exploiting airspace above the building); City of Eastlake v. Forest City Enterps., Inc., 426 U.S. 668, 674, n.8, 96 S. Ct. 2358, 49 L. Ed. 2d 132 (1976) ('By its nature, zoning 'interferes' significantly with owners' uses of property. It is hornbook law that '{m}ere diminution of market value or interference with the property owner's personal plans and desires relative to his property is insufficient to invalidate a zoning ordinance or to entitle him to a variance or rezoning.' 8 E. McQuillin, Municipal Corporations sec. 25.44, p. 111 (3d ed. 1965).'); Goldblatt v. Town of Hempstead, 369 U.S. 590, 592, 82 S. Ct. 987, 8 L. Ed. 2d 130 (1962) ('Concededly the ordinance completely prohibits a beneficial use to which the property has previously been devoted. However, such a characterization does not tell us whether or not the ordinance is unconstitutional. It is an oft-repeated truism that every regulation necessarily speaks as a prohibition. If this ordinance is otherwise a valid exercise of the town's police powers, the fact that it deprives the property of its most beneficial use does not render it unconstitutional.'); Vill. of Euclid v. Ambler Realty Co., 272 U.S. 365, 47 S. Ct. 114, 71 L. Ed. 303 (1926) (zoning ordinances not unconstitutional takings).\n\nAs the Supreme Court said in Connolly, 475 U.S. at 223:\n\nIn the course of regulating commercial and other human affairs, Congress routinely creates burdens for some that directly benefit others. For example, Congress may set minimum wages, control prices, or create causes of action that did not previously exist. Given the propriety of the governmental power to regulate, it cannot be said that the Taking Clause is violated whenever legislation requires one person to use his or her assets for the benefit of another.\n\nBut the majority's new approach to takings would appear to hold any effect on a use of property by a governmental regulation is sufficient to meet this prong of the test. While there is at least some superficial attraction to the park owners' assertion they have the right to sell their own property to anybody they might want to sell it to for whatever beneficial or whimsical or even capricious reason that occurs to them, our law has never said the right to dispose of property is so fundamental as to be an unfettered right. Such a view is entirely unsupported in our law.\n\nWashington law limits the disposition of property in a legion of ways.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e A person may legally own a large supply of bottled liquor, but cannot go into a retail business to sell it in Washington because liquor sales are permitted only at state-run stores under the authority of the Liquor Control Board. A person may have a license to sell liquor at a restaurant or bar, but cannot sell liquor between the hours of 2:00 a.m. and 6:00 a.m. WAC 314-16-050. We have long upheld the authority of the Liquor Control Board to set the hours of operation of establishments that sell liquor. State ex rel. Thornbury v. Gregory, 191 Wash. 70, 70 P.2d 788 (1937). Such prohibitions and restrictions on liquor sales survived takings challenges as long ago as 1877. See, e.g., Mugler v. Kansas, 123 U.S. 623, 8 S. Ct. 273, 31 L. Ed. 205 (1887) (upholding Kansas statute prohibiting sale of alcoholic beverages as against a takings challenge based on the loss of value of property devoted to beer production).\n\nA person certainly has no right to sell tobacco products to whomever he or she wishes. It is a gross misdemeanor in Washington to sell tobacco products to those under 18. RCW 26.28.080. This statute, carrying a criminal penalty for its violation, is in derogation of one's right to dispose of one's property. Would the majority declare it a taking for that reason? If not, how would the majority distinguish its holding here?\n\nOne may legally own a cache of firearms, but cannot sell them free of an armada of federal and state laws. See 18 U.S.C. sec. 921 (firearms); RCW 9.41.110 (unlawful to sell pistols without a license); RCW 9.41.190 (unlawful to sell machine guns and short-barreled shotguns). Would the majority declare these laws takings and facially unconstitutional derogations of one's right to dispose of property?\n\nOur antidiscrimination law specifically and in no uncertain terms limits the right of a property owner to dispose of property in any way he or she may desire. RCW 49.60.030(1) bars discrimination in real estate transactions. RCW 49.60.222 declares it to be an unfair practice for any person, whether acting for himself, herself, or another, to discriminate 'because of sex, marital status, race, creed, color, national origin, families with children status, the presence of any sensory, mental, or physical disability, or the use of a trained dog guide or service animal by a disabled person{.}' Unfair practices include refusing to engage in a real estate transaction, refusing to negotiate for a real estate transaction, misrepresenting the availability of real property for sale or rental, and expelling a person from real property, with heavy civil penalties for violations enumerated at section .225. Of particular note is the prohibition against expelling someone from occupancy of real property for discriminatory reasons. RCW 49.60.222(1)(i). This statute implicates the right to exclude others, another fundamental attribute of property. The remedy for these violations may be a forced sale to the discrimination victim. RCW 49.60.250(5). Under the majority's analysis, these antidiscrimination statutes are facially unconstitutional and void because they destroy or derogate the right to dispose of property. How would the majority distinguish its holding here?\n\nAll zoning laws would be abrogated under the majority's analysis as well because they interfere with the possession and use of private property.\n\nThe majority chooses to consider each stick in the bundle of sticks and concludes any effect on any aspect of property is a taking. It cites Ackerman v. Port of Seattle, 55 Wn.2d 400, 409, 348 P.2d 664 (1960), for the following proposition:\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\n'Property in a thing consists not merely in its ownership and possession, but in the unrestricted right of use, enjoyment and disposal. Anything which destroys any of these elements of property, to that extent destroys the property itself. The substantial value of property lies in its use. If the right of use be denied, the value of the property is annihilated and ownership is rendered a barren right.'\n\nThe majority's analysis is further flawed because there is no such thing in Washington as an 'unrestricted right of use' of property, and there never has been. We said in State v. Lawrence, 165 Wash. 508, 517, 6 P.2d 363 (1931), 'All property is held subject to such restraints and regulations as the state may constitutionally make in the exercise of its police power.'\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nMoreover, the United States Supreme Court has never allowed property in takings cases to be assessed in a disaggregated sense and has never accorded 'essential' status to the fundamental attribute of property asserted in this case, the right to dispose of property. In a seminal case that ought to be dispositive of the issue here, Andrus v. Allard, 444 U.S. 51, 100 S. Ct. 318, 62 L. Ed. 2d 210 (1979), the Court considered a federal statute that prohibited commercial transactions in parts of birds legally killed before the birds came under the protection of the Bald Eagle Protection Act, 16 U.S.C. sec. 668(a).\n\nThe issue reached the Court on the petition of persons engaged in the trade of Indian artifacts. They had in their possession for the purpose of sale at the time the Act went into effect artifacts partly composed of feathers from protected birds. They argued the enactment deprived them of property without just compensation because they could no longer sell the artifacts for profit.\n\nThe Court rejected the argument. At the outset, the Court noted:\n\n{G}overnment regulation -- by definition -- involves the adjustment of rights for the public good. Often this adjustment curtails some potential for the use or economic exploitation of private property. To require compensation in all such circumstances would effectively compel government to regulate by purchase. Andrus, 444 U.S. at 65 (emphasis omitted).\n\nThe Court recognized the Act placed a 'significant restriction' on the owners' right to dispose of the artifacts. But this was not enough:\n\n{T}he denial of one traditional property right does not always amount to a taking. At least where an owner possesses a full 'bundle' of property rights, the destruction of one 'strand' of the bundle is not a taking, because the aggregate must be viewed in its entirety. Id. at 65-66.\n\nThus, the Court concluded, the Act did not effect a taking, because even though the artifact owners could no longer sell the artifacts, they 'retain the rights to possess and transport their property, and to donate or devise the protected birds.' Id. at 66.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nThe situation in Andrus parallels the situation in the present case, except the effect on the park owners is less onerous because the challenged statute does not destroy their right to sell, as in Andrus; it merely restricts and conditions sale for a short period of time. But the park owners retain every other right of ownership to their property: the right to possess it; the right to use it; the right to manage it; the right to income from it; the right to consume or destroy it at the conclusion of the leasehold terms; the right to modify it; the right to devise it. See Robert J. Goldstein, Green Wood in the Bundle of Sticks: Fitting Environmental Ethics and Ecology into Real Property Law, 25 B.C. Envtl. Aff. L. Rev. 347, 375 (1998) (discussing the rights to property). Pursuant to Andrus, there is no taking in this case where the interference to rights to ownership is so minimal compared to the full panoply of ownership rights the park owners retain.\n\nOther Supreme Court cases in addition to Andrus inveigh against disaggregating property rights -- considering only single sticks from the bundle -- and hold the proper approach is to consider the effect of a regulation on the property as a whole: ' 'Taking' jurisprudence does not divide a single parcel into discrete segments and attempt to determine whether rights in a particular segment have been entirely abrogated.' Penn Cent. Transp. Co. v. City of New York, 438 U.S. 104, 130, 98 S. Ct. 2646, 57 L. Ed. 2d 631 (1978); Keystone Bituminous Coal Ass'n v. DeBenedictis, 480 U.S. 470, 498, 107 S. Ct. 1232, 94 L. Ed. 2d 472 (1987). In a more recent case, Concrete Pipe \u0026 Prods. of Cal., Inc. v. Constr. Laborers Pension Trust for So. Cal., 508 U.S. 602, 644, 113 S. Ct. 2264, 124 L. Ed. 2d 539 (1993), the Court said a 'parcel of property could not first be divided into what was taken and what was left for the purpose of demonstrating the taking of the former to be complete and hence compensable.' That is also the law of Washington: 'Similarly, our own state case law demonstrates that a regulatory scheme's economic impact is to be determined by viewing the full bundle of property rights in its entirety.' Presbytery of Seattle, 114 Wn.2d at 335 (quoting Penn Cent. and citing Washington cases). Thus, until today, Washington takings jurisprudence has looked to the entirety of the property allegedly taken, not just to one stick in the bundle of property rights. The majority opinion changes that principle without acknowledging what it is doing or justifying the change.\n\nIf we did not look at the effect of a regulation on property in its entirety, every land use restriction could be disaggregated from the entirety of the property and challenged as a taking. Examples would include the diminution in value from side yard and setback requirements on individual lots. 'A requirement that a building occupy no more than a specified percentage of the lot on which it is located could be characterized as a taking of the vacant area.' Keystone, 480 U.S. at 498.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nIn summary, the character of the regulation here challenged is in the mainstream of regulation that has been constitutionally permissible for most of the twentieth century. There is nothing novel or oppressive enough about the Act to suggest the character of the regulation here fails constitutional muster.\n\n2. Economic Impact on the Owner.\n\nBecause this case is a facial taking claim, there is no evidence in the record of economic impact. As discussed above, however, a regulation that has no economic effect other than to create the potential for a bidding war over the sale of a mobile home park, thereby assuring a sale at fair market value, can hardly work to a park owner's economic disadvantage.\n\n3. Interference with Investment-Backed Expectations.\n\nThis inquiry typically arises in the downzone context, where a jurisdiction might attempt to downzone property from a more intensive use, and therefore more lucrative use, to a less intensive use, such as a change from industrial or commercial to single-family residential or park. We addressed a like issue in Estate of Friedman v. Pierce County, 112 Wn.2d 68, 78-79, 768 P.2d 462 (1989) (quoting Junji Shimazaki, Comment, Land Use Takings and the Problem of Ripeness in the United States Supreme Court Cases, 1 B.Y.U. J. Pub. L. 375, 381-82 (1987)):\n\nUnlike eminent domain proceedings where the government actually acquires fee title, land use regulations only limit actual or potential use and enjoyment of private property. Consequently, when land use ordinances are challenged, courts must ascertain the remaining value of the regulated property to determine the amount of economic impact caused by the regulation. This is done largely by determining what remaining use of the property the ordinance permits. If substantial use remains, the amount of diminution in value or the effect upon the reasonable investment-backed expectations of the landowner are normally not significant enough to warrant a takings judgment. If, on the other hand, nearly all uses are depleted, a taking under the fifth amendment may exist.\n\nOne cannot easily detect any interference with investment-backed expectations brought about by the challenged statute in this case, let alone such a reduction in the value of a mobile home park that 'nearly all uses are depleted{.}'\n\nIn summary, under all of the United States Supreme Court's tests for a taking, tests we have also adopted in Guimont, there is no taking here.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e The Act permits the park owners to continue to use their property exactly as they had been using it, both as to rents and profits, and as to possible capital gains upon sale. As Justice Holmes noted: 'Government hardly could go on if to some extent values incident to property could not be diminished without paying for every such change in the general law.' Pa. Coal, 260 U.S. at 413. Here, where there is not even a diminution in value, there can be no taking.\n\nCONCLUSION\n\nEvery member of the Washington State Senate and House of Representatives, regardless of partisan or philosophical persuasion, in compassionate recognition of the plight of mobile home park tenants forced to move because of a sale of a mobile home park, enacted legislation to give tenants the opportunity to purchase mobile home parks at fair market value in the event owners wish to sell. The legislation restricts the park owner's right to sell for a limited period of only 30 days, and assures the park owner will receive fair market value by allowing the tenants to buy at a price the owner has already deemed acceptable.\n\nFundamentally, the statute effects no seizure or physical invasion of land, nor damage to land, requiring just compensation. Nor does the challenged statute involve permanent restrictions on the use of private property, as in the case of zoning. Purely and simply, this is a case involving an economic regulation that is within the power of government to enact. That the regulation happens to concern the sale of land is merely incidental, and does not transform this case into a takings case.\n\nThe majority's erroneous conclusion that any regulation of an attribute of property is a taking thrusts us into extraordinarily dangerous waters, broadening takings law in ways so wide-ranging and unconfined as to call into question innumerable, legitimate, necessary government actions. In effect, the majority would have us install the very principles of Referendum 48 the people of Washington resoundingly rejected in the 1995 general election.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nThe majority's takings analysis has no principled limitation, and fundamentally affects every aspect of the police power granted to government under our Constitution. As early as Conger v. Pierce County, 116 Wash. 27, 35-36, 198 P. 377 (1921), we said:\n\nIt is easy to understand the principles upon which the police power doctrine is based, but difficult to define in language its limitations. It is not inconsistent with nor antagonistic to the rules of law concerning the taking of private property for a public use. Because of its elasticity and the inability to define or fix its exact limitations, there is sometimes a natural tendency on the part of the courts to stretch this power in order to bridge over otherwise difficult situations, and for like reasons it is a power most likely to be abused. It has been defined as an inherent power in the state which permits it to prevent all things harmful to the comfort, welfare and safety of society. It is based on necessity. It is exercised for the benefit of the public health, peace and welfare.\n\nRegulating and restricting the use of private property in the interest of the public is its chief business. It is the basis of the idea that the private individual must suffer without other compensation than the benefit to be received by the general public. It does not authorize the taking or damaging of private property in the sense used in the constitution with reference to taking such property for a public use. Eminent domain takes private property for a public use, while the police power regulates its use and enjoyment, or if it takes or damages it, it is not a taking or damaging for the public use, but to conserve the safety, morals, health and general welfare of the public.\n\nI fear the majority's analysis needlessly intrudes on the police power in untold ways affecting everything from social welfare law to public health rules to environmental and land use regulation.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e The very imprecision of the majority's takings analysis invites innumerable challenges to important police power enactments. I believe the analysis of the Court of Appeals here was fundamentally correct and I would affirm the Court of Appeals' decision.\n\nSANDERS, J. (concurring)\n\nI concur this statute unconstitutionally takes private property for private use, but write separately to add a perspective not otherwise presented.\n\nPolice Power Not Implicated\n\nBoth the majority and the dissents compare and contrast, more or less, an exercise of the police power, which may require no compensation,\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e with an exercise of the power of eminent domain, which always does.\n\nBut a principled dichotomy makes sense only if we use the term 'police power' in the sense of its original understanding,\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e used by the majority at 6-7 in its extended quotation from Conger v. Pierce County, 116 Wash. 27, 36, 198 P. 377 (1921) ('to prevent all things harmful to the comfort, welfare and safety of society'). Certainly by that definition what we have here is not an exercise of the police power at all. Rather it is a garden variety appropriation of an interest in private property for the benefit of others, not a limitation on the use of that property to protect others from harm. Cf. Sintra, Inc. v. City of Seattle, 119 Wn.2d 1, 16, 829 P.2d 765 (1992) (regulatory scheme which goes beyond preventing harm to affirmatively provide low-cost housing is not proper exercise of police power but crosses taking threshold). This statute is not an exercise of the police power because the police power, in its purest form, is the 'power to secure rights, through restraints or sanctions, not some general power to provide public goods.' Cato Handbook for Congress: Policy Recommendations for the 106th Congress 206 (Edward H. Crane \u0026 David Boaz eds., 1999). When the government acquires a public good, it does not do so as an exercise of the police power but rather the power of eminent domain. William B. Stoebuck, A General Theory of Eminent Domain, 47 Wash. L. Rev. 553, 569 (1972).\n\nThe distinction between the legitimate exercise of the police power and the power of eminent domain is aptly described in Conger after a most appropriate beginning to its analysis:\n\nIt seems to us that a recurrence to certain fundamental principles may assist us in reaching a correct conclusion. One of the greatest contributions of the English-speaking people to civilization is the protection by law of the private individual in the enjoyment of his property and his personal liberties against the demands and aggressions of the public. No better illustration of the progressive growth of this principle can be found than that contained in our various state constitutions with reference to the taking of private property for a public use. Conger, 116 Wash. at 33-34.\n\nIn Conger Pierce County defended against an action to recover compensation for an alleged inverse condemnation, asserting that its actions were no more than a legitimate exercise of the police power for which no compensation would be due. This caused us to compare and contrast the police power with the power of eminent domain:\n\nIndeed, it is the police power theory upon which respondents seem most strongly to rely. It is probable that this power is the most exalted attribute of government, and, like the power of eminent domain, it existed before and independently of constitutions. . . . It is not inconsistent with nor antagonistic to the rules of law concerning the taking of private property for a public use. Because of its elasticity and the inability to define or fix its exact limitations, there is sometimes a natural tendency on the part of the courts to stretch this power in order to bridge over otherwise difficult situations, and for like reasons it is a power most likely to be abused. . . . Eminent domain takes private property for a public use, while the police power regulates its use and enjoyment, or if it takes or damages it, it is not a taking or damaging for the public use, but to conserve the safety, morals, health and general welfare of the public.\n\n'. . . But the moment the legislature passes beyond mere regulation, and attempts to deprive the individual of his property, or of some substantial interest therein, under pretense of regulation, then the act becomes one of eminent domain, and is subject to the obligations and limitations which attend an exercise of that power.' Conger, 116 Wash. at 35-37 (quoting 1 John Lewis, A Treatise on the Law of Eminent Domain sec. 6 (3d ed. 1909)).\n\nThe majority's retreat from this principled dichotomy as reflected in Conger and like authorities is understandable given modern confusion over the nature of the police power. If, for example, construction of a baseball stadium is now deemed an exercise of the police power, as it was in CLEAN v. State, 130 Wn.2d 782, 805, 928 P.2d 1054 (1996), amended (Jan. 13, 1997), the language of the common law and the vocabulary of our founders has been so radically altered in meaning so as to require new words to express old ideas. See Hugh D. Spitzer, Municipal Police Power in Washington State, 75 Wash. L. Rev. 495, 506 (2000) ('This broad definition of the police power appears overinclusive and thus not analytically useful.'). Where the police power never ends, the takings clause never begins.\n\nI also take issue with Justice Talmadge's claim that '{a}ll zoning laws would be abrogated under the majority's analysis as well because they interfere with the possession and use of private property.' Dissent, Talmadge, J., at 36. Zoning laws which limit the harmful use of one person's property so as to protect the legal entitlements of others are not enacted for the acquisition of public goods, but rather for the protection of private rights in general. I say 'in general' because it would be in excess of the legitimate police power to utilize state power to bestow parochial benefits on a particular private person that are not generally available to all society on like terms. See Norco Constr., Inc. v. King County, 97 Wn.2d 680, 685, 649 P.2d 103 (1982); Nagatani Bros., Inc. v. Skagit County Bd. of Comm'rs, 46 Wn. App. 106, 728 P.2d 1104 (1986), aff'd as modified by 108 Wn.2d 477, 739 P.2d 696 (1987). Cf. State ex rel. Seattle Title Trust Co. v. Roberge, 278 U.S. 116, 122, 49 S. Ct. 50, 73 L. Ed. 210 (1928) (conditioning land use permit on consent of neighbors violates due process). This distinction is omitted from Justice Talmadge's dissent.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e Cf. Dissent, Talmadge, J., at 43-44.\n\nAppropriation, Not Protection\n\nThe statute at issue effects a taking because it does not protect against harmful, rights-violating activity, but rather damages, or appropriates, property for the benefit of others. Although, as the dissents point out, the potential dislocation of mobile home tenants resulting from the loss of mobile home park use through sale may be a source of hardship to those tenants, such sale certainly does not breach any of their legal rights or entitlements. Indeed these tenancies are merely temporary by nature, and it is no breach of a tenant's rights for the property owner to terminate the lease upon the contracted date of expiration.\n\nProperty is a Bundle of Rights\n\nThe dissent raises the further objection that the facts here do not involve a taking of property at all, at least in the same sense as discussed above. I think the answer to this question turns on the very meaning of 'property.' I agree the issue is exactly as Justice Talmadge poses it: 'Properly analyzed, what the park owners claim the statute unconstitutionally took from them is their alleged right to sell their mobile home parks in any manner they might choose to whomever they might choose.' Dissent, Talmadge, J., at 20.\n\nBut as the ''legal term property denotes not material things but certain rights,'' Majority at 22 n.10 (quoting William B. Stoebuck, A General Theory of Eminent Domain, 47 Wash. L. Rev. 553, 600 (1972)), the dissent fails to recognize that when the government takes one right from the bundle which comprises 'property,' it thereby takes an aspect or attribute of the property itself. Cf. Loretto v. Teleprompter Manhattan CATV Corp., 458 U.S. 419, 433, 102 S. Ct. 3164, 73 L. Ed. 2d 868 (1982) (citing Kaiser Aetna v. United States, 444 U.S. 164, 176, 100 S. Ct. 383, 62 L. Ed. 2d 332 (1979) (The right to exclude is 'one of the most essential sticks in the bundle of rights that are commonly characterized as property.')). See State ex rel. Smith v. Superior Court, 26 Wash. 278, 287, 66 P. 385 (1901) (''If property, then, consists not in tangible things themselves, but in certain rights in and appurtenant to those things, it follows that, when a person is deprived of any of those rights, he is to that extent deprived of his property, and hence, that his property may be taken, in the constitutional sense, though his title and possession remain undisturbed ; . . . .'') (quoting John Lewis, A Treatise on the Law of Eminent Domain in the United States sec. 56 (2d ed. 1900)).\n\nIf one of the rights of property has been damaged or removed from the bundle, the property has accordingly been damaged or taken to that extent. The unfettered right to sell one's possession is as 'fundamental {an} attribute of property' as is the right to assert an exclusive possessory interest against even the slightest physical invasion. Guimont v. Clarke, 121 Wn.2d 586, 602, 854 P.2d 1 (1993) ('{T}he court must first ask whether the regulation destroys or derogates any fundamental attribute of property ownership: including the right to . . . dispose of property.'); Loretto, 458 U.S. at 435-36 ('Property rights in a physical thing have been described as the rights 'to possess, use and dispose of it'' (quoting United States v. General Motors Corp., 323 U.S. 373, 378, 65 S. Ct. 357, 359, 89 L. Ed. 311 (1945))); whereas, 'even though the owner may retain the bare legal right to dispose of the occupied space by transfer or sale, the permanent occupation of that space by a stranger will ordinarily empty the right of any value . . . .' (id. at 436) (emphasis added)). When the government deprives a person of a fundamental right of property, 'the government does not simply take a single 'strand' from the 'bundle' of property rights: it chops through the bundle, taking a slice of every strand.' Id. at 435 (quoting Andrus v. Allard, 444 U.S. 51, 65-66, 100 S. Ct. 318, 62 L. Ed. 2d 210 (1979)).\n\nMoreover, I would posit, since the right of first refusal may be transferred from one person to another, it is clearly 'property' in that sense as well since ''property' in eminent domain means every species of interest in land and things of a kind that an owner might transfer to another private person.' Stoebuck, supra, 47 Wash. L. Rev. at 606. Likewise, I take issue with the view expressed in both dissents that the majority's analysis is somehow inconsistent with Guimont. Cf. Dissent, Johnson, J., at 2. In reality the majority strictly applies the Guimont holding that an appropriation for public use of a fundamental attribute of property ownership constitutes a taking in eminent domain. Thus, I disagree with the dissent that 'petitioners can only prevail on their takings claim if a right of first refusal is 'property'' in and of itself. Dissent, Johnson, J., at 3. Even if the right of first refusal were not itself 'property,' imposing such a condition on sale plainly derogates the unfettered right to transfer, which is a fundamental attribute of ownership in the parcel.\n\nThat the public may benefit from the acquisition is certainly no reason to characterize the appropriation as anything other than a taking. Rather, the greater the public benefit from appropriating or damaging the property, the more justified the suspicion that a 'taking' has in fact occurred. Therefore when it is argued an acquisition or limitation of one's property is justified because it serves a public purpose, we must question all the more why a discrete property owner must bear a burden that in justice should be borne by many shoulders. Mission Springs, Inc. v. City of Spokane, 134 Wn.2d 947, 964, 954 P.2d 250 (1998) ('The talisman of a taking is government action which forces some private persons alone to shoulder affirmative public burdens, 'which, in all fairness and justice, should be borne by the public as a whole.'' (quoting Armstrong v. United States, 364 U.S. 40, 49, 80 S. Ct. 1563, 4 L. Ed. 2d 1554 (1960))).\n\nUse Restriction Analysis Not Implicated\n\nI agree with the majority's characterization of 'existing' law which finds a facial taking in circumstances which may include 'a total taking of all economically viable use of one's property,'\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e Majority at 7, although I would qualify that is not the only circumstance.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e Rather, I think considerations pertaining to use restrictions must be applied to circumstances involving use restrictions, not deprivations which destroy or appropriate one of the other fundamentals of property ownership. Loretto, 458 U.S. at 427, 430 (distinction between abrogation of fundamental right of property ownership and 'a regulation that merely restricts the use of property' must be observed). Use restrictions must be evaluated based on their impact on the entire parcel, see, e.g., Presbytery of Seattle v. King County, 114 Wn.2d 320, 787 P.2d 907 (1990) (wetland use restriction which leaves room for development on the parcel not necessarily a taking); however, deprivations of the fundamental right to possess, exclude, or transfer do not implicate what use has been taken, or remains.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e Therefore it makes no sense, and is improper, to balance the fundamental property right appropriated against remaining uses to test whether a taking has transpired. Cf. Dissent, Johnson, J., at 7. Cf. Loretto, 458 U.S. at 425, 430, 436, 438 n.16 ('whether the installation {of a cable TV wire box} is a taking does not depend on whether the volume of space it occupies is bigger than a breadbox').\n\nExamples of this principle include not only physical invasions but also conditions on land use permits which impose an exaction not serving the same legitimate public purpose as the permitting requirement itself. Such is an illegitimate taking which cannot be cured by compensation. In Nollan v. Cal. Coastal Comm'n, 483 U.S. 825, 107 S. Ct. 3141, 97 L. Ed. 2d 677 (1987), for example, the Supreme Court found an unconstitutional taking when a building permit was conditioned on the payment of an unrelated exaction, notwithstanding the property owner's full use of his entire parcel for an existing single family residence.\n\nIn summary, when a fundamental aspect of property is taken, however slightly, the 'character of the governmental action,' Penn Cent. Transp. Co. v. City of New York, 438 U.S. 104, 124, 98 S. Ct. 2646, 51 L. Ed. 2d 631 (1978), 'not only is an important factor in resolving whether the action works a taking but also is determinative.' Loretto, 458 U.S. at 426, see also 432 (emphasis added).\n\nIn the same vein, I understand Professor Settle's view that deprivations of a fundamental attribute of property ownership constitute a taking to be a comment on existing law, at least enlightened existing law, rather than so much a plea for reformation.\n\nDue Process Distinguished\n\nI do not see substantive due process as adding anything to our understanding about what is or is not a taking, although it is no doubt true, as the majority says, the doctrines have indeed been conflated and confused from time to time. Rather, we have recognized the criteria to establish a taking are ''quite different'' from that required to establish a due process violation. Mission Springs, 134 Wn.2d at 964 (quoting Nollan, 483 U.S. at 835 n.3).\n\nI therefore emphatically agree with the majority's conclusion that '{t}he instant case falls within the rule that would generally find a taking where a regulation deprives the owner of a fundamental attribute of property ownership,' Majority at 25, and see that as the dispositive feature of the majority's analysis.\n\nTaking for Private Use\n\nSo too I agree with the majority's view that this property is not only taken, but taken for private use. This is the feature of the case which most directly invokes our state constitution's express prohibition against taking private property for private use. As the majority observes, 'the Washington State Constitution explicitly prohibits taking private property solely for a private use--with or without compensation.' Majority at 28 (emphasis added). However, I would qualify, the same constitution equally prohibits a taking for even a partially private use. In re Petition of City of Seattle, 96 Wn.2d 616, 627, 638 P.2d 549 (1981); State ex rel. Wash. State Convention \u0026 Trade Ctr. v. Evans, 136 Wn.2d 811, 829-36, 966 P.2d 1252 (1998) (Sanders, J., dissenting). Notwithstanding, the appropriation here is not directed to a partially private destination, but a wholly private one.\n\nI therefore concur.\n\nAPPENDIX\n\nThe following states have enacted laws to protect mobile home owners from abuse by mobile home park owners. In most cases, these laws are similar in nature to landlord-tenant legislation, but contain protective provisions specific to mobile home park conditions. Alaska -- Alaska Stat. sec. 34.03.225 (Lexis 1998).\n\nArizona -- Mobile Home Parks Residential Landlord and Tenant Act, Ariz. Rev. Stat. Ann. sec.sec. 33-1401 to 33-1492 (West 2000).\n\nCalifornia -- Mobilehome Parks Act, Cal. Health \u0026 Safety Code sec.sec. 18200-18700 (West 1992). The California Legislature declared the following conditions and rights of residents of mobile home parks:\n\nThe Legislature finds and declares that increasing numbers of Californians live in manufactured homes and mobilehomes and that most of those living in such manufactured homes and mobilehomes reside in mobilehome parks. Because of the high cost of moving manufactured homes and mobilehomes, most owners of manufactured homes and mobilehomes reside within mobilehome parks for substantial periods of time. Because of the relatively permanent nature of residence in such parks and the substantial investment which a manufactured home or mobilehome represents, residents of mobilehome parks are entitled to live in conditions which assure their health, safety, general welfare, and a decent living environment, and which protect the investment of their manufactured homes and mobilehomes.\n\nCal. Health \u0026 Safety Code sec. 18250 (West 1992).\n\nColorado -- Mobile Home Park Act, Colo. Rev. Stat. sec.sec. 38-12-200.1 to 38-12-217 (Bradford 1999).\n\nConnecticut -- Conn. Gen. Stat. Ann. sec. 21-70a (West 1994) (requires park owner to pay mobile home owners relocation expenses and compensatory payments when there is change in land use of mobile home park).\n\nDelaware -- Mobile Home Lots and Leases Act, tit. 25, ch. 70. Legislature found 'emergency situation exists with respect to housing for Delaware citizens, many of them elderly, in mobile home parks intending to convert into multiple-unit usage.' Del. Code Ann. tit. 25, sec. 7101 (Michie 1989). See Del. Code Ann. tit. 25, sec. 7108 (creating in tenants option to purchase park upon notice of intent by park owner to convert the use of the park).\n\nFlorida -- Florida Mobile Home Act, tit. 20A, ch. 723. Fla. Stat. Ann. sec. 723.071 (West 1988) gives mobile home park tenants the right of first refusal on proposed sale of park.\n\nIdaho -- Mobile Home Park Landlord-Tenant Act, Idaho Code sec.sec. 55-2001 to 55-2019 (Michie 1994).\n\nIllinois -- Mobile Home Park Act, Ch. 210, Ill. Comp. Stat. Ann. sec.sec. 115/1-115/27 (West 1998). The Illinois Legislature declared in its statement of findings:\n\nThe General Assembly of Illinois finds: (1) that there is a serious housing shortage in this state; (2) that rising costs in the building construction field has seriously impeded the building of new housing, particularly for moderate and low income citizens; (3) that the existing housing stock is continuously depleted through demolition resulting from aging buildings, urban renewal, highway construction and other necessary public improvements; (4) that advances in the construction of mobile homes has significantly increased the importance of this mode of housing; (5) that through proper regulation and licensing mobile homes can contribute to the quality housing of Illinois citizens. Id. sec. 115/1.\n\nIowa -- Mobile Home Parks Residential Landlord and Tenant Act, Iowa Code Ann. sec.sec. 562B.1-562B.32 (West 1992).\n\nKansas -- Mobile Home Parks Residential Landlord and Tenant Act, Kan. Stat. Ann. sec.sec. 58-25,100 to 58-25, 126 (1994).\n\nKentucky -- Mobile Home and Recreational Vehicle Park Act of 1972, Ky. Rev. Stat. Ann. sec.sec. 219.310 (Michie 1995).\n\nMaine -- Me. Rev. Stat. Ann. tit. 10, sec.sec. 9091-9100 (West 1997). Section 9094-A requires 45-day notice to tenants prior to owner's executing purchase and sale agreement.\n\nMaryland -- Md. Ann. Code Real Prop. sec. 8A-101 (Michie 1996).\n\nMassachusetts -- Mass. Gen. Laws Ann. Ch. 140, sec.sec. 32F-32S (West 1998). Section 32R establishes the right of first refusal for tenants.\n\nMichigan -- Mobile Home Commission Act, Mich. Stat. Ann. sec. 19.855(128) (Lexis 1998).\n\nMinnesota -- Minn. Stat. Ann. sec. 327C.095 (West 1995) requires payment of relocation costs if park is to convert to other use or close.\n\nMontana -- Residential Landlord and Tenant Act of 1977; Mont. Code Ann. sec. 70-24-436(2) (West 1999) requires notice to tenants for proposed change in use of park.\n\nNebraska -- Mobile Home Landlord and Tenant Act, Neb. Rev. Stat. Ann. sec.sec. 76-1450 to 76-14, 111 (1996).\n\nNevada -- Nev. Rev. Stat. Ann. sec. 118B.010 (1999).\n\nNew Hampshire -- N.H. Rev. Stat. Ann. sec. 205-A:21 (1989) (requiring 60 days' notice to tenants before owner may accept offer to buy or transfer park; requires owners to consider in good faith offers from tenants to purchase).\n\nNew Jersey -- N.J. Stat. Ann. sec.sec. 46:8C to 46:8C-21 (West 1999). Section 46:8C-11 gives right of first refusal to tenants.\n\nNew Mexico -- N.M. Stat. Ann. sec.sec. 47-10-2 to 47-10-20 (Michie 1998).\n\nNew York -- N.Y. Real Prop. tit. 49, sec. 233 (McKinney 1989).\n\nNorth Carolina -- N.C. Gen. Stat. sec. 42-36.1 (1999).\n\nNorth Dakota -- N.D. Cent. Code sec. 23-10-01 (Michie 1999).\n\nOhio -- Page's Ohio Rev. Code Ann. tit. 37, sec.sec. 3733.09-3733.20 (1997).\n\nOregon -- Or. Rev. Stat. Ann. sec.sec. 446.003-446.547 (Lexis Supp. 1998).\n\nPennsylvania -- Pa. Cons. Stat. Ann. tit. 68, sec.sec. 398.1-398.11 (West 1998). 'The purpose of this legislation is to give special protection to mobile home owners in mobile home parks.' Malvern Courts, Inc. v. Stephens, 275 Pa. Super. 518, 419 A.2d 21, 23 (1980).\n\nRhode Island -- R.I. Gen. Laws sec. 31-44-3.1 (1994) grants right of refusal to tenant associations in mobile home parks.\n\nSouth Carolina -- Manufactured Home Park Tenancy Act, S.C. Code Ann. tit. 27, sec.sec. 27-47-10 to 27-47-620 (West Supp. 1999).\n\nUtah -- Mobile Home Park Residency Act, Utah Code Ann. sec.sec. 57-16-1 to 57-16-51.1 (Michie 1994). The Utah State Legislature declared:\n\nThe high cost of moving mobile homes, the requirements of mobile home parks relating to their installation, and the cost of landscaping and lot preparation necessitate that the owners of mobile homes occupied within mobile home parks be provided with protection from actual or constructive eviction.\n\nUtah Code Ann. sec. 57-16-2.\n\nVermont -- Vt. Stat. Ann. tit. 10, sec.sec. 6201-6266 (Michie 1997). Vt. Stat. Ann. tit. 10, sec. 6242 grants right of first refusal to tenants and requires owner negotiate in good faith.\n\nVirginia -- Manufactured Home Lot Rental Act, Va. Code Ann. sec.sec. 55-248.41 to 55-248.52 (Michie 1995).\n\nWest Virginia -- W. Va. Code sec.sec. 37-15-1 to 37-15-8 (Michie 1997).\n\nWisconsin -- Wis. Stat. Ann. sec. 710.15 (West Supp. 1999).\n\n\u003cspan class=\"fn\"\u003e1. \"A 'qualified tenant organization' means a formal organization of tenants in the park in question, organized for the purpose of purchasing the park, with membership made available to all tenants with the only requirements for membership being: (a) Payment of reasonable dues; and (b) being a tenant in the park.\" RCW 59.23.020(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. \" 'Notice' for the purposes of this section means a writing signed by sixty percent of the tenants in the park indicating that they desire to participate in the purchase of the park, and that they are contractually bound to the other signators of the notice to participate by purchasing an ownership interest that will entitle them to occupy a mobile home space for the remainder of their life or for a term of at least fifteen years.\" RCW 59.23.015.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The Act exempts the transfer or sale of a mobile home park to a relative if the relative signs a written agreement to maintain the property as a mobile home park. RCW 59.23.025, .035.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The Park Owners make two additional claims. First, they claim chapter 59.23 RCW violates the takings clause of the United States Constitution. Second, the Park Owners argue that even if chapter 59.23 RCW does not violate the federal takings clause, chapter 59.23 RCW still violates the Washington State Constitution because the addition of the word \"damaged\" in amended article I, section 16 provides greater protections against governmental takings than the Fifth Amendment of the United States Constitution. Resolving these issues is unnecessary for the disposition of this case. Finding adequate relief under the Washington State Constitution, it is unnecessary to rely on the United States Constitution for guidance in this case. See Allied Daily Newspapers v. Eikenberry, 121 Wn.2d 205, 209, 848 P.2d 1258 (1993) (Because a Substitute House Bill violated article I, section 10 of the Washington State Constitution, it was unnecessary to determine whether that Bill also violated the Fourteenth Amendment of the United States Constitution).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. This case concerns only a takings challenge because the Park Owners voluntarily dismissed their substantive due process claim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. State v. Gunwall 106 Wn.2d 54, 61, 720 P.2d 808 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. In his dissent, in addition to many political arguments, Justice Talmadge argues that we should follow the \"proper course\" as outlined in Guimont, 121 Wn.2d 586, and \"continue to apply the ample, well-established federal law of regulatory takings.\" Dissent at 12 (also citing Highline Sch. Dist. No. 401 v. Port of Seattle, 87 Wn.2d 6, 11, 548 P.2d 1085 (1976); and Orion Corp. v. State, 109 Wn.2d 621, 657-58, 747 P.2d 1062 (1987), cert. denied, 486 U.S. 1022, 108 S. Ct. 1996, 100 L. Ed. 2d 227 (1988)). However, the Guimont court specifically declined to undertake a state constitutional Gunwall analysis. See 121 Wn.2d 586. The same was true in Orion. See 109 Wn.2d at 657-58. Furthermore, Highline nowhere states the proposition for which it is cited - that the takings' provisions in our state and federal are identical. See 87 Wn.2d at 11. Finally, although Orion was decided 18 months after Gunwall, it makes no reference to Gunwall and, therefore, any assertion that Orion holds that federal and state constitution takings analyses are coextensive is without benefit of the analysis required by Gunwall. Consequently, in this case, we answer the call to conduct a Gunwall analysis for the first time and should not be limited to prior pronouncements of parallelism between our state and federal takings' clauses. I would further note that if Gunwall holds any significance in civil cases, pre-Gunwall decisions, or decisions sans a Gunwall analysis, are not binding. Absent a proper analysis on the Gunwall factors, a procedural hurdle we invariably impose upon parties who assert that greater protections exist under our state constitution, the question remains an open one. To ask less of this court than we ask of litigants who come before it would be hypocritical and ill-advised.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. While the Park Owners claim the addition of the word 'damaged' in article I, section 16 provides greater protections against government takings than the Fifth Amendment, resolving this issue is unnecessary for the disposition of this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Delegate Turner, for instance, moved to strike 'except for private ways of necessity.' 'Turner said such private ways should not be made at the expense of other private property, but that such a right of way should be included in the purchase of isolated land.' Quentin Shipley Smith, The Journal of the Washington State Constitutional Convention, 1889, at 504, (Beverly Paulik Rosenow ed., 1962).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. \"In the words of Morris R. Cohen, 'Anyone who frees himself from the crudest materialism readily recognizes that as a legal term property denotes not material things but certain rights.'\" William B. Stoebuck, A General Theory of Eminent Domain, 47 Wash. L. Rev. 553, 600 (1972) (quoting Morris R. Cohen, Property and Sovereignty, 13 Cornell L.Q. 8, 11 (1927)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Although subsequent cases have disapproved of Gregory's takings analysis related to rent control ordinances, these cases have not criticized Gregory's takings analysis relative to a right of first refusal. See Fischer v. City of Berkeley, 37 Cal.3d 644, 685 n.43, 693 P.2d 261, 209 Cal. Rptr. 682 (1984); Cotati Alliance for Better Hous. v. City of Cotati, 148 Cal. App. 3d 280, 288-89, 195 Cal Rptr. 825 (1983); Oceanside Mobilehome Park Owners' Ass'n. v. City of Oceanside, 157 Cal. App. 3d 887, 900, 204 Cal. Rptr. 239 (1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. As previously noted, if the tenants fail to meet these requirements, or if, in the case of seller financing, the owner determines selling the park to the tenants would create a greater financial risk selling to the third party, the owner may proceed with the sale to the third party. RCW 59.23.025.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. This court has held that condemnation for both public and private use is permissible under the state constitution if the proposed private use is subordinate and incidental to the public use, requiring no more property be condemned than necessary for the public use. State v. Evans, 136 Wn.2d 811, 822, 966 P.2d 1252 (1998).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. State v. Gunwall, 106 Wn.2d 54, 720 P.2d 808 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Numerous other jurisdictions are in accord with this position, many in the context of rejecting a takings challenge. See, e.g., State v. Block, 660 F.2d 1240, 1256 (8th Cir. 1981) (state statute granting federal government right of first refusal not a taking even if some diminution in value results); Kaiser Dev. Co. v. City \u0026 County of Honolulu, 649 F. Supp. 926, 937 (D. Haw. 1986) (right of first refusal not a compensable interest in regulatory taking challenge); Gartley v. Ricketts, 107 N.M. 451, 453, 760 P.2d 143 (1988) (right of first refusal not a 'future interest' and, therefore, not subject to rule against perpetuities); City of Ashland v. Kittle, 347 S.W.2d 522, 524 (Ky. 1961) (right of first refusal is a contract right not compensable in eminent domain proceeding).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. As the majority notes, petitioners waived their due process claim in this case. However, the majority's jealous protection of petitioner's contractual rights closely resembles a substantive due process analysis. 'It is settled by various decisions of this court that state constitutions and state laws may regulate life in many ways which we as legislators might think as injudicious or if you like as tyrannical as this, and which equally with this interfere with the liberty to contract.' Lochner v. New York, 198 U.S. 45, 75, 25 S. Ct. 539, 49 L. Ed. 937 (1905) (Holmes, J., dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. In Greenfield County Estates, the statutory provision granting a right of first refusal read as follows: 'An owner of a manufactured housing community must notify each tenant by certified mail of the owner's intent to sell or lease the land on which the community is located. Such notice must occur within fourteen days after the owner makes public his or her interest to sell the manufactured housing community, and at least forty-five days before the sale or lease occurs. . . . If more than fifty per cent of the tenants residing in the community, . . . so request in writing, the owner must notify each resident of receipt of a bona fide offer to purchase the land that the owner intends to accept. The group then has the right to purchase the community on substantially similar terms and conditions as the third-party bona fide offeror . . . .' Greenfield County Estates, 423 Mass. at 83 n.7 (citing Mass. Gen. Laws, ch. 140, sec. 32R (1994)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Lochner v. New York, 198 U.S. 45, 25 S. Ct. 539, 49 L. Ed. 937 (1905).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Most other states have also reacted to the plight of mobile home owners and have enacted protective legislation. See Appendix, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. A similar statute in Massachusetts contains the following statement of legislative intent: Unless mobile home owners receive futher protection in relocating their homes upon mobile home park discontinuances than the law now affords, this increasing shortage of mobile home park sites and increasing cost of relocation will generate serious threats to the public health, safety, and general welfare of the citizens of the commonwealth, particularly the elderly and persons of low and moderate income. Mass. Gen. Laws Ann., ch. 140, sec. 32L, Historical and Statutory Notes at 512 (West 1991).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. 'What is key is article I, section 16's absolute prohibition against taking private property for private use.' Majority op. at 10.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Washington's public use and public purpose standards are more stringent than those of federal jurisdictions. See Victor B. Flatt, A Brazen Proposal: Increasing Affordable Housing Through Zoning and the Eminent Domain Powers, 5 Stan. L. \u0026 Pol'y Rev. 115 (1994).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Justice Iredell did not agree: If, on the other hand, the legislature of the Union, or the legislature of any member of the Union, shall pass a law, within the general scope of their constitutional power, the court cannot pronounce it to be void, merely because it is, in their judgment, contrary to the principles of natural justice. The ideas of natural justice are regulated by no fixed standard: the ablest and the purest men have differed upon the subject; and all that the court could properly say, in such an event, would be, that the legislature (possessed of an equal right of opinion) had passed an act which, in the opinion of the judges, was inconsistent with the abstract principles of natural justice. Calder, 3 U.S. at 398-99. Here, perhaps is the first pitched argument in the United States Supreme Court over judicial restraint. Furthermore, it may be open to question whether the Chase aphorism is as immutable as property rights absolutists would have it. Justice Holmes once wrote: All rights tend to declare themselves absolute to their logical extreme. Yet all in fact are limited by the neighborhood of principles of policy which are other than those on which the particular right is founded, and which become strong enough to hold their own when a certain point is reached. The limits set to property by other public interests present themselves as a branch of what is called the police power of the state. The boundary at which the conflicting interests balance cannot be determined by any general formula in advance, but points in the line, or helping to establish it, are fixed by decisions that this or that concrete case falls on the nearer or farther side. For instance, the police power may limit the height of buildings in a city, without compensation. To that extent it cuts down what otherwise would be the rights of property. But if it should attempt to limit the height so far as to make an ordinary building lot wholly useless, the rights of property would prevail over the other public interest, and the police power would fail. Hudson County Water Co. v. McCarter, 209 U.S. 349, 355, 28 S. Ct. 529, 52 L. Ed. 828 (1908). Moreover: 'In the last analysis nearly every law transfers something from A to B. It matters not whether this advantage be tangible or fancied, large or small. Somebody gains, somebody loses, for you cannot create an advantage out of a vacuum. This makes the whole question one of degree, and there is no principle, no fundamental right, in a matter of degree.' R. Luce, Legislative Problems 60 (1935, reprinted 1971) quoted in Frank R. Strong, Substantive Due Process of Law: A Dichotomy of Sense and Nonsense 172 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. We addressed New York's contrary Ives decision directly in Clausen:: We shall offer no criticism of the opinion. We will only say that notwithstanding the decision comes from the highest court of the first state of the Union, and is supported by a most persuasive argument, we have not been able to yield our consent to the view there taken. We conclude, therefore, that the act in question violates no provision of either the state or Federal constitutions, and that the auditor should give it effect. Let the writ issue. Clausen, 65 Wash. at 212. Constitutional convention leader, Chief Justice Dunbar, signed the majority opinion. Only Justice Chadwick dissented in Clausen, but not on the property rights issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. 'This power, denominated the eminent domain of the state, is, as its name imports, paramount to all private rights vested under the government, and these last are, by necessary implication, held in subordination to this power, and must yield in every instance to its proper exercise.' West River Bridge Co. v. Dix, 47 U.S. (6 How.) 507, 532, 12 L. Ed. 535 (1848).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The 1913 statute provided compensation for the taking of private ways of necessity. Mountain Timber, 77 Wash. at 586.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. 'This court has repeatedly held that ch. 133, Laws of 1913, p. 412, here drawn in question, is not violative of any rights guaranteed by the state or federal constitution.' Huntoon v. King County, 145 Wash. 307, 313, 260 P.2d 527 (1927).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Justice Rehnquist, writing in PruneYard, a case involving the right to exclude others from one's property, said: 'here appellants have failed to demonstrate that the 'right to exclude others' is so essential to the use or economic value of their property that the state-authorized limitation of it amounted to a 'taking.'' PruneYard, 447 U.S. at 84. Thus, even the hallowed right to exclude others is not an absolute right permitting no incursion but is subject to a balancing of interests. The majority here does no balancing whatsoever.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Although we said this in Guimont, the United States Supreme Court has never indicated that any regulation affecting any fundamental attribute of property is a per se facial taking. Rather, the Court has first concluded that a physical invasion, for instance, is a categorical taking because the right to exclude others is one of the most essential sticks in the bundle of rights concerning property. Thus, simply labeling something a fundamental attribute of property does not automatically mean its deprivation is a categorical taking.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. One scholar has described attempts to determine when regulation goes so far that it becomes a taking as the 'lawyer's equivalent of the physicist's hunt for the quark.' Charles Haar, Land-Use Planning 766 (3d ed. 1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Justice Scalia's comment echoes the famous and oft-quoted statement by Chief Justice Lemuel Shaw in 1851: We think it a well settled principle, growing out of the nature of well ordered civil society, that every holder of property, however absolute and unqualified may be his title, holds it under the implied liability that his use of it may be so regulated, that it shall not be injurious to the equal enjoyment of others having an equal right to the enjoyment of their property, not injurious to the rights of the community. All property in this commonwealth . . . is derived directly or indirectly from the government, and held subject to those general regulations, which are necessary to the common good and general welfare. Rights of property, like all other social and conventional rights, are subject to such reasonable limitations in their enjoyment, as shall prevent them from being injurious, and to such reasonable restraints and regulations established by law, as the legislature, under the governing and controlling power vested in them by the constitution, may think necessary and expedient. Commonwealth v. Alger, 61 Mass. (7 Cush.) 53, 84-85 (1851). Accord State v. Dexter, 32 Wn.2d 551, 558, 202 P.2d 906 (1949) (quoting with approval); State v. Van Vlack, 101 Wash. 503, 509, 172 P. 563 (1918) (quoting with approval). Justice Joseph Story wrote: 'All the property and vested rights of individuals are subject to such regulations of police as the legislature may establish with a view to protect the community and its several members against such use or employment thereof as would be injurious to society or unjust toward other individuals.' 2 Joseph Story, Commentaries on the Constitution of the United States sec. 1954, at 700-01 (5th ed. 1891) (emphasis added) (quoting Commonwealth v. Alger with approval).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. 'Under the 'character-of-the-regulation' prong of the regulatory takings analysis, '{a} 'taking' may more readily be found when the interference with property can be characterized as a physical invasion by government than when interference arises from some public program adjusting the benefits and burdens of economic life to promote the social good.' ' Thomas v. Anchorage Equal Rights Comm'n, 165 F.3d 692, 709 (9th Cir. 1999) (quoting Penn Cent., 438 U.S. at 124). As previously noted, no physical invasion is occasioned by the Act.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. See, e.g., RCW 9.46.310 (unlawful to sell gambling devices without a license); RCW 15.08.070 (unlawful to sell certain by-products of infected fruits and vegetables); RCW 15.13.390 (unlawful to sell horticultural plants that do not meet certain requirements); RCW 15.36.031 (unlawful to sell milk without license); RCW 15.37.030 (unlawful to sell milk that is not Grade A); RCW 15.54.400 (superphosphate containing less than 18 percent available phosphoric acid may not be sold in Washington); RCW 16.49.075 (unlawful to sell uninspected meat); RCW 16.49A.350 (horse carcasses may not be sold unless properly labeled); RCW 32.32.110 (capital stock of mutual savings bank owned by directors and officers may not be sold within three years of purchase); RCW 33.48.180 (savings and loan association may not sell stock without authorization); RCW 70.74.020 (explosives cannot be sold unless in compliance with law). In each of these instances, State law places a restriction or prohibition on the disposition of items otherwise legal to own.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. The quote Ackerman used was from a 1921 Texas case, Spann v. City of Dallas, 111 Tex. 350, 235 S.W. 513 (1921). The quote speaks of the 'unrestricted right of use' of property. A 'right' to use property without restriction obviously trumps zoning laws. It may be that Spann was the law of Texas in 1921 and forbade zoning laws. But Spann came before the landmark decision upholding the constitutionality of zoning laws, Vill. of Euclid v. Ambler Realty Co., 272 U.S. 365, 47 S. Ct. 114, 71 L. Ed. 303 (1926), and prior to the 1927 passage of legislation in Texas giving cities the power to enact zoning ordinances. See Price v. City of Junction, 711 F.2d 582, 588 (5th Cir. 1983), for a discussion of Spann. We upheld the constitutionality of zoning ordinances 47 years ago in State ex rel. Miller v. Cain, 40 Wn.2d 216, 218, 242 P.2d 505 (1952) ('Zoning ordinances are constitutional in principle as a valid exercise of the police power{,}' citing Village of Euclid.). For a majority of this Court to reintroduce Spann into our cases brings into question the constitutional validity of all Washington zoning laws, the Growth Management Act, the Shorelines Management Act, the State Environmental Policy Act, and every other statute that in any way derogates the so-called 'unrestricted right of use' of property. The Spann quote, if taken as the law of Washington, would have a pernicious and devastating effect on decades of Washington land use regulations. We should extirpate it from our case books rather than repeat it here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. 'It is, we believe, the universally accepted view that all property is derived from society.' Mountain Timber, 77 Wash. at 592. To illustrate the necessity for a societal framework in order for rights to property to exist, consider the statute at bar, RCW 59.23.030, setting forth the sanction for failure to comply with the act: 'If the court determines that the notice provisions of this chapter have been violated, the court shall issue an order setting aside the improper sale.' How would such an order operate? Surely, as an order affecting real property, someone would record the order with the county auditor, where it would appear with the description of the relevant parcel. The order setting aside the improper sale would effectively reconvey the land to the park owner because the improper conveyance would no longer be of record. This means the purported purchaser would be unable to enforce any rights to the property. He could not seek assistance from the sheriff to 'exclude others' because he could not establish the land belonged to him in the absence of society's recognition of the conveyance. He could not sell the land because he would find no buyers for land he could not show clear title to. He could not enforce collection of rents from the mobile home tenants because in order to do so, he would have to set forth in a complaint that he is the landlord entitled to the rents, and while he may allege as much, he can never prove he is the landlord because there is no record of his ownership the law recognizes as valid. In such a case, while there may have been a valid contract for the sale of land between a willing seller and a willing buyer, without society's imprimatur, no cognizable conveyance of title occurred.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. The right to dispose of property as a fundamental aspect of property ownership has no firm grounding in Anglo-American law. The noted historian, Forrest McDonald, has observed: 'But the crucial fact is that ownership did not include the absolute right to buy or sell one's property in a free market; that was not a part of the scheme of things in eighteenth-century England and America.' Forrest McDonald, Novus Ordo Seclorum, The Intellectual Origins of the Constitution 14 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Even if such disaggregation of sticks from the bundle were a permissible mode of analysis, the majority's approach would fail to establish a facial taking. Diminution in property value, standing alone, does not establish a 'taking.' Penn Cent., 438 U.S. at 131 (citing cases).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. I note, however, the majority's belief 'a taking has occurred in this case not only because an owner is deprived of a fundamental attribute of property, but also because this property is statutorily transferred.' (Court's emphasis.) Majority op. at 25. The majority improperly conflates the prohibition of taking with the prohibition of taking for a private use. If there is no taking in the first place, as the foregoing discussion demonstrates, one cannot create a taking out of thin air by arguing what is taken has been taken for private use. Logically, there is no need to reach the question of private versus public use if there has been no constitutionally cognizable taking in the first instance. But even assuming the majority is correct in reaching the private versus public use question, its disposition of this case would invalidate, for instance, our Minimum Wage Act (MWA), chapter 49.46 RCW, because the requirement to pay minimum wages is the taking of private property (the money of an employer) and transferring it for private use to employees. The constitutionality of the federal minimum wage law, the Fair Labor Standards Act (FLSA), has been settled since United States v. Darby, 312 U.S. 100, 312 U.S. 657, 61 S. Ct. 451, 85 L. Ed. 609 (1941). Washington's MWA survived a constitutional challenge and has been settled law since 1960. Peterson v. Hagan, 56 Wn.2d 48, 351 P.2d 127 (1960). Neither the FLSA nor the MWA would survive the majority's approach. Lest there be any mistake in this regard, Professor Richard A. Epstein has written: 'Restrictions on hours or wages are without question limitations upon the power of the employer to dispose of property.' Richard A. Epstein, Takings 280 (1985). How will the majority distinguish its holding here? Likewise, many zoning ordinances are for the benefit of private parties. Consider, for instance, an area zoned for single-family residences. Suppose a particular homeowner wished to dismantle his house and build a 24-hour convenience store on his property. Such a commercial use would obviously increase the value of his land greatly. It would also decrease the value of homes in the immediate vicinity of the proposed convenience store, because resulting continual traffic, noise, and parking lot lights at all hours of the day and night would make it unpleasant to live there. The zoning ordinance would forbid such a commercial enterprise in a single-family residential neighborhood, of course. But the owner wishing to build the convenience store could claim the zoning ordinance diminished the value of his land solely for the private benefit of his neighbors. Under the majority's analysis, the zoning ordinance would be a forbidden taking of private property for private use.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Laws of 1995, ch. 98, the so-called Private Property Regulatory Fairness Act, purported to require full compensation to property owners if a governmental entity regulated or took any 'action, requirement, or restriction' limiting 'the use or development {of} private property.' Laws of 1995, ch. 98, sec.sec. 4(2); 7(4). The voters rejected this legislation by a vote of 796, 869 to 544,788 (59 percent to 41 percent).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. The concurrence presents an aberrational view of the nature and extent of the police power that is reflective of libertarian fabulism rather than history and law. The concurrence quotes a publication of the libertarian 'think tank,' the Cato Institute, for the erroneous proposition that the police power is the ''power to secure rights, through restraints or sanctions, not some general power to provide public goods.'' Concurrence at 2 (quoting Cato Handbook for Congress: Policy Recommendations for the 106th Congress 206 (Edward H. Crane \u0026 David Boaz, eds., 1999)). The usual formulation is that the police power is plenary, limited only by constitutional provisions. See, e.g., Rhod-A-Zalea \u0026 35th, Inc. v. Snohomish County, 136 Wn.2d 1, 16 n.1, 959 P.2d 1024 (1998) (police power regulations limited only by constitutional safeguards). Justice Sanders asserts the modern onset of police power regulation has caused the formerly limited exercise of government regulation to 'erode from its point of origin.' Weden v. San Juan County, 135 Wn.2d 678, 727, 958 P.2d 273 (1998) (Sanders, J., dissenting). The proposition is demonstrably incorrect. This libertarian version of American history is pure fable, as the notion of the police power as a 'substantive limitation on governmental authority,' id. (Sanders, J., dissenting), is inconsistent with history and constitutional law. One chief libertarian myth about government regulation is that America in the past was a golden age of laissez-faire, free market, antiregulatory government. Scholarly research and commentary, not to mention mere perusal of old statute books, demonstrate the pervasiveness of police power regulation in early times. William Letwin writes: Before the Civil War, the constitutional authority of the states to carry on any and every form of economic regulation was seldom questioned. And this acceptance was not for want of regulations to question. On the contrary, state and local governments set the prices to be charged by wagoners, wood sawyers, chimneysweeps, pawnbrokers, hackney carriages, ferries, wharfs, bridges, and bakers; required licensing of auctioneers, retailers, restaurants, taverns, vendors of lottery tickets, and slaughterhouses; and inspected the quality of timber, shingles, onions, butter, nails, tobacco, salted meat and fish, and bread. This very incomplete list attest to an intention to exercise detailed control over the operation of markets, especially (though not only) those that have since been characterized as providing 'public services' and those thought to be morally dubious because of association with usury, betting intoxication, or excessive jubilation. William Letwin, Economic Regulation, in 2 Encyclopedia of the American Constitution 603 (Leonard W. Levy \u0026 Kenneth L. Karst eds., 1996). In colonial America ''virtually every aspect of economic life was subject to nonmarket controls.'' Jonathan R.T. Hughes, The Governmental Habit: Economic Controls from Colonial Times to the Present 49 (1977), quoted in Harry N. Scheiber, Private Rights and Public Power: American Law, Capitalism, and the Republican Polity in Nineteenth-Century America, 107 Yale L.J. 823, 843 (1997). See also William J. Novak, Common Regulation: Legal Origins of State Power in America, 45 Hastings L.J. 1061, 1076-79 (1994) (listing numerous examples of regulation of all aspects of life in early America). In his dissent in Weden, to which Justice Sanders refers the reader in his present concurrence, he extols Justice T.L. Stiles, a member of Washington's constitutional convention and a justice of this Court from 1889 to 1895. Justice Sanders quotes with evident approval from a speech Stiles gave: 'Laws have been passed in one state and another abridging the right of contract, the right to sell merchandise, the right to labor upon public works, the right to labor more than a certain number of hours, the right to freely come and go, the right to pursue legitimate trades, and a mass of others. . . . {Legislators who support such legislation} hide in swarms, behind the newly coined phrase, 'police power,' and that other more venerable phrase, 'the public welfare,' both of which, like 'public policy,' are often, if one may use such an expression, liveries of heaven stolen to serve the devil in.' Weden, 135 Wn.2d at 726 (Sanders, J., dissenting) (quoting C.S. Reinhart, History of the Supreme Court of the Territory and State of Washington 49-50 (n.d.)). Students of the Lochner era will recognize this rhetoric. The service of the devil Stiles was speaking about, of course, was the onset of Progressive Era legislation enacted to remedy the horrendous burdens working men and women faced in the early days of the Industrial Age. Stiles evidently thought such legislation the work of the devil. Stiles refers to the right of contract as sacrosanct. This was the view advanced by those who, like Stiles, were opposed to maximum work hours laws like the eight-hour day. In 1911, the United States Supreme Court put the right-to-contract argument to rest: {F}reedom of contract is a qualified, and not an absolute, right. There is no absolute freedom to do as one wills or to contract as one chooses. The guaranty of liberty does not withdraw from legislative supervision that wide department of activity which consists of the making of contracts, or deny to government the power to provide restrictive safeguards. Liberty implies the absence of arbitrary restraint, not immunity from reasonable regulations and prohibitions imposed in the interests of the community. Chicago, B. \u0026 Q.R. Co. v. McGuire, 219 U.S. 549, 566, 31 S. Ct. 259, 55 L. Ed. 328 (1911). Justice Sanders presents Stiles' comments as evidence of the prevailing view in Washington near the time of our constitutional convention. History shows the views of Stiles, who left the Court in 1895, were aberrational and idiosyncratic, not typical. Manifestly, in the early years of Washington's existence, the scope of the police power extended far beyond the mere prevention of nuisance, and included a wide range of applications to public welfare. Perhaps the clearest and most powerful exposition of the police power from the early days of Washington's statehood is the following statement by Justice Chadwick: Having in mind the sovereignty of the state, it would be folly to define the term. To define is to limit that which from the nature of things cannot be limited, but which is rather to be adjusted to conditions touching the common welfare, when covered by legislative enactments. The police power is to the public what the law of necessity is to the individual. It is comprehended in the maxim salus populi suprema lex. It is not a rule, it is an evolution. State v. Mountain Timber Co., 75 Wash. 581, 588, 135 P. 645 (1913), aff'd 243 U.S. 219, 37 S. Ct. 260, 61 L. Ed. 685 (1917). One hundred years of Washington jurisprudence reveal a much different view of the police power than what Justice Sanders presents. See generally Philip A. Talmadge, The Myth of Property Absolutism and Modern Government: The Interaction of Police Power and Property Rights, 75 Wash. L. Rev. 857 (2000).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. See, e.g., Mugler v. Kansas, 123 U.S. 623, 668-69, 8 S. Ct. 273, 31 L. Ed. 205 (1887). For an enlightened discussion of the Mugler rule and its modification in more recent decisions beginning with Pennsylvania Coal Co. v. Mahon, 260 U.S. 393, 43 S. Ct. 158, 67 L. Ed. 322 (1922), see John M. Groen \u0026 Richard M. Stephens, Takings Law, Lucas, and the Growth Management Act, 16 U. Puget Sound L. Rev. 1259, 1269-71 (1993).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. For an historical discussion, see Weden v. San Juan County, 135 Wn.2d 678, 723-29, 958 P.2d 273 (1998) (Sanders, J., dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. Justice Talmadge's claim that '{T}he Washington Supreme Court returns to the days when property rights were considered more important than human rights' is long on polemics but short on reason. Dissent, Talmadge, J., at 1. The fallacy of this statement is well summarized by the United States Supreme Court in Lynch v. Household Finance Corp., 405 U.S. 538, 552, 92 S. Ct. 1113, 1121-22, 31 L. Ed. 2d 424 (1972): Property does not have rights. People have rights. The right to enjoy property without unlawful deprivation, no less than the right to speak or the right to travel, is in truth a 'personal' right, whether the 'property' in question be a welfare check, a home, or a savings account. In fact, a fundamental interdependence exists between the personal right to liberty and the personal right in property. Neither could have meaning without the other. That rights in property are basic civil rights has long been recognized.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. Actually, the original language upon which the majority's observation is based appears in Agins v. City of Tiburon, 447 U.S. 255, 260, 100 S. Ct. 2138, 2141, 65 L. Ed. 2d 106 (1980): The application of a general zoning law to particular property effects a taking if the ordinance does not substantially advance legitimate state interests or denies an owner economically viable use of his land. (Citations omitted.) Absent is our majority's 'all.' Cf. Lucas v. S.C. Coastal Council, 505 U.S. 1003, 1019 n.8, 112 S. Ct. 2886, 120 L. Ed. 2d 798 (1992) (An 'analysis errs in its assumption that the landowner whose deprivation is one step short of complete is not entitled to compensation.').\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. Moreover, once there is a taking of property in the constitutional sense it matters not what the value so appropriated may be except to measure compensation due. As a matter of fact, the cable TV wire which invaded Loretta's property may have enhanced its value, yet took the property nonetheless.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. This distinguishes Justice Talmadge's discussion of disaggregating property rights (Dissent (Talmadge, J.) at 41) as a principle limited to use restrictions, but inapplicable to abrogations of other fundamentals of property ownership such as possession, exclusion, or the unfettered right of sale. In Loretto, for example, the physical intrusion of a cable television wire did not remotely interfere with the overall use of the parcel, nor even markedly diminish its value; however, because it derogated a fundamental aspect of ownership it was deemed a taking per se. Cf. Presbytery of Seattle v. King County, 114 Wn.2d 320, 787 P.2d 907 (1990) (use restrictions which pertain to one portion of a parcel but allow development on the remainder, may withstand a taking challenge).\u003c/span\u003e\n\n",
    "body_length": 182609,
    "citedas": [
      "142 Wash.2d 347",
      "142 Wash.2d 347"
    ],
    "attorneys": "Counsel:Counsel for Petitioner(s)John D. Blankinship Montgomery Purdue Blankinship \u0026 Austin 17045 12th Ave NW Shoreline, WA 98177 Jerry W. Spoonemore Montgomery Purdue Blankinship \u0026 Austin 940 Mountain Lane Edmonds, WA 98020 Michael E. Gossler Montgomery Purdue Blankinship \u0026 Austin 701 5th Ave Ste 5800 Seattle, WA 98104Counsel for Respondent(s) Dan R. Young Bjorklund \u0026 Young 1000 2nd Ave Ste 3310 Seattle, WA 98104 Jerri L. Thomas Assistant Attorney General 2425 Bristol Ct SW PO Box 40109 Olympia, WA 98504-0109 Alan D. Copsey 2425 Bristol Ct SW PO Box 40109 Olympia, WA 98504-0109Amicus Curiae on behalf of Pacific Legal Foundation Brent D. Boger Attorney At Law 210 E 13th St PO Box 1995 Vancouver, WA 98668 William R. Maurer Perkins Coie One Bellevue Cntr 411 108th Ave NE Ste 1800 Bellevue, WA 98004-5584 Robin L. Rivett Pacific Legal Foundation 10940 NE 33rd Place Suite 109 Bellevue, WA 98004Amicus Curiae on behalf of Buildling Industry association of Wa Stephen H. Overstreet General Counsel-Building Industry Assn of Wa The Mccleary Mansion 111 West 21st Avenue Olympia, WA 98501Amicus Curiae on behalf of Washington Association of Realtors John M. Groen Groen Stephens \u0026 Klinge Llp 2101 112th Ave NE Suite 110 Bellevue, WA 98004-2944Amicus Curiae on behalf of Washington State Association of Muni Sandra M. Watson Assistant City Attorney Law Dept. Rm #1000 600 4th Ave Seattle, WA 98104 Wayne D. Tanaka Ogden Murphy Wallace 2100 Westlake Ctr Tower 1601 Fifth Ave. Seattle, WA 98101Amicus Curiae on behalf of Association of Washington Cities Sandra M. Watson Assistant City Attorney Law Dept. Rm #1000 600 4th Ave Seattle, WA 98104 Wayne D. Tanaka Ogden Murphy Wallace 2100 Westlake Ctr Tower 1601 Fifth Ave. Seattle, WA 98101",
    "category": [
      "243",
      "75",
      "213"
    ],
    "judges": "Judges:Authored by Faith E IrelandConcurring: Richard P. GuyBarbara A. Madsen Gerry L. Alexander Bobbe J. Bridge Richard B. SandersDissenting: Charles W. Johnson Charles Z. Smith Philip A. Talmadge",
    "citation_count": 2
  }
}
