{
  "id": "Q4U5P2YBTlTomsSBUu8S",
  "document": {
    "title": "ETW Corporation v. Jireh Publishing",
    "full_title": "ETW CORPORATION v. JIREH PUBLISHING, INC. .",
    "jurisdiction": "Sixth Circuit",
    "date": "2003-06-20T00:00:00.000Z",
    "docket": "No. 00-3584",
    "body": "RECOMMENDED FOR FULL-TEXT PUBLICATION Pursuant to Sixth Circuit Rule 206\n\nELECTRONIC CITATION: 2003 FED App. 0207P (6th Cir.)\n\nArgued: September 14, 2001\n\nGRAHAM, D. J., delivered the opinion of the court, in which SILER, J., joined. CLAY, J. (pp. 40-78), delivered a separate dissenting opinion.\n\nOPINION\n\nPlaintiff-Appellant ETW Corporation (\"ETW\") is the licensing agent of Eldrick \"Tiger\" Woods (\"Woods\"), one of the world's most famous professional golfers. Woods, chairman of the board of ETW, has assigned to it the exclusive right to exploit his name, image, likeness, and signature, and all other publicity rights. ETW owns a United States trademark registration for the mark \"TIGER WOODS\" (Registration No. 2,194,381) for use in connection with \"art prints, calendars, mounted photographs, notebooks, pencils, pens, posters, trading cards, and unmounted photographs.\"\n\nDefendant-Appellee Jireh Publishing, Inc. (\"Jireh\") of Tuscaloosa, Alabama, is the publisher of artwork created by Rick Rush (\"Rush\"). Rush, who refers to himself as \"America's sports artist,\" has created paintings of famous figures in sports and famous sports events. A few examples include Michael Jordan, Mark McGuire, Coach Paul \"Bear\" Bryant, the Pebble Beach Golf Tournament, and the America's Cup Yacht Race. Jireh has produced and successfully marketed limited edition art prints made from Rush's paintings.\n\nIn 1998, Rush created a painting entitled The Masters of Augusta, which commemorates Woods's victory at the Masters Tournament in Augusta, Georgia, in 1997. At that event, Woods became the youngest player ever to win the Masters Tournament, while setting a 72-hole record for the tournament and a record 12- stroke margin of victory. In the foreground of Rush's painting are three views of Woods in different poses. In the center, he is completing the swing of a golf club, and on each side he is crouching, lining up and/or observing the progress of a putt. To the left of Woods is his caddy, Mike \"Fluff\" Cowan, and to his right is his final round partner's caddy. Behind these figures is the Augusta National Clubhouse. In a blue background behind the clubhouse are likenesses of famous golfers of the past looking down on Woods. These include Arnold Palmer, Sam Snead, Ben Hogan, Walter Hagen, Bobby Jones, and Jack Nicklaus. Behind them is the Masters leader board.\n\nThe limited edition prints distributed by Jireh consist of an image of Rush's painting which includes Rush's signature at the bottom right hand corner. Beneath the image of the painting, in block letters, is its title, \"The Masters Of Augusta.\" Beneath the title, in block letters of equal height, is the artist's name, \"Rick Rush,\" and beneath the artist's name, in smaller upper and lower case letters, is the legend \"Painting America Through Sports.\"\n\nAs sold by Jireh, the limited edition prints are enclosed in a white envelope, accompanied with literature which includes a large photograph of Rush, a description of his art, and a narrative description of the subject painting. On the front of the envelope, Rush's name appears in block letters inside a rectangle, which includes the legend \"Painting America Through Sports.\" Along the bottom is a large reproduction of Rush's signature two inches high and ten inches long. On the back of the envelope, under the flap, are the words \"Masters of Augusta\" in letters that are three-eights of an inch high, and \"Tiger Woods\" in letters that are one-fourth of an inch high. Woods's name also appears in the narrative description of the painting where he is mentioned twice in twenty-eight lines of text. The text also includes references to the six other famous golfers depicted in the background of the painting as well as the two caddies.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Jireh published and marketed two hundred and fifty 22½\" x 30\" serigraphs and five thousand 9\" x 11\" lithographs of The Masters of Augusta at an issuing price of $700 for the serigraphs and $100 for the lithographs.\n\nETW filed suit against Jireh on June 26, 1998, in the United States District Court for the Northern District of Ohio, alleging trademark infringement in violation of the Lanham Act, 15 U.S.C. §1114; dilution of the mark under the Lanham Act, 15 U.S.C. §1125(c); unfair competition and false advertising under the Lanham Act, 15 U.S.C. §1125(a); unfair competition and deceptive trade practices under Ohio Revised Code §4165.01; unfair competition and trademark infringement under Ohio common law; and violation of Woods's right of publicity under Ohio common law. Jireh counterclaimed, seeking a declaratory judgment that Rush's art prints are protected by the First Amendment and do not violate the Lanham Act. Both parties moved for summary judgment. The district court granted Jireh's motion for summary judgment and dismissed the case. See ETW Corp. v. Jireh Pub., Inc., 99 F.Supp.2d 829 (N.D. Ohio 2000). ETW timely perfected an appeal to this court.\n\nI. Standard of Review\n\nWe review the district court's grant of summary judgment de novo. Sperle v. Michigan Dep't of Corr., 297 F.3d 483, 490 (6th Cir. 2002). Summary judgment is proper where there exists no issue of material fact and the moving party is entitled to judgment as a matter of law. Fed.R.Civ.P. 56(c). In considering such a motion, the court construes all reasonable factual inferences in favor of the nonmoving party. Matsushita Elec. Indus. Co. v. Zenith Radio Corp., 475 U.S. 574, 587 (1986). The central issue is \"whether the evidence presents a sufficient disagreement to require submission to a jury or whether it is so one-sided that one party must prevail as a matter of law.\" Anderson v. Liberty Lobby, Inc., 477 U.S. 242, 251-52 (1986).\n\nII. Trademark Claims Based on the Unauthorized Use of the Registered Trademark \"Tiger Woods\"\n\nETW claims that the prints of Rush's work constitute the unauthorized use of a registered trademark in violation of the Lanham Act, 15 U.S.C. §1114, and Ohio law. Because trademark claims under Ohio law follow the same analysis as those under the Lanham Act, our discussion of the federal trademark claims will therefore encompass the state trademark claims as well.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Rock \u0026 Roll Hall of Fame \u0026 Museum, Inc. v. Gentile Prods., 134 F.3d 749, 754 (6th Cir. 1998)(citing Daddy's Junky Music Stores, Inc. v. Big Daddy's Family Music Ctr., 109 F.3d 275, 288 (6th Cir. 1997)).\n\nETW claims that Jireh infringed the registered mark \"Tiger Woods\" by including these words in marketing materials which accompanied the prints of Rush's painting. The words \"Tiger Woods\" do not appear on the face of the prints, nor are they included in the title of the painting. The words \"Tiger Woods\" do appear under the flap of the envelopes which contain the prints, and Woods is mentioned twice in the narrative which accompanies the prints.\n\nThe Lanham Act provides a defense to an infringement claim where the use of the mark \"is a use, otherwise than as a mark, ... which is descriptive of and used fairly and in good faith only to describe the goods ... of such party[.]\" 15 U.S.C. §1115(b)(4); see San Francisco Arts and Athletics, Inc. v. U.S. Olympic Comm., 483 U.S. 522, 565 (1987); Herman Miller, Inc. v. Palazzetti Imports and Exports, Inc., 270 F.3d 298, 319 (6th Cir. 2001)(\"Under the doctrine of 'fair use,' the holder of a trademark cannot prevent others from using the word that forms the trademark in its primary or descriptive sense.\")(emphasis in the original); Car-Freshner Corp. v. S.C. Johnson \u0026 Son, Inc., 70 F.3d 267, 270 (2nd Cir. 1995)(\"[F]air use permits others to use a protected mark to describe aspects of their own goods[.]\"). In evaluating a defendant's fair use defense, a court must consider whether defendant has used the mark: (1) in its descriptive sense; and (2) in good faith. Victoria's Secret Stores v. Artco Equip. Co.,, 194 F. Supp.2d 704, 724 (S.D. Ohio 2002); see also Cairns v. Franklin Mint Co., 292 F.3d 1139, 1151 (9th Cir. 2002).\n\nA celebrity's name may be used in the title of an artistic work so long as there is some artistic relevance. See Rogers v. Grimaldi, 875 F.2d 994, 997 (2nd Cir. 1989); New York Racing Ass'n v. Perlmutter Publ'g, Inc., No. 95-CV-994, 1996 WL 465298 at *4 (N.D.N.Y. July 19, 1996) (finding the use of a registered mark on the title of a painting protected by the First Amendment). The use of Woods's name on the back of the envelope containing the print and in the narrative description of the print are purely descriptive and there is nothing to indicate that they were used other than in good faith. The prints, the envelopes which contain them, and the narrative materials which accompany them clearly identify Rush as the source of the print.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Woods is mentioned only to describe the content of the print.\n\nThe district court properly granted summary judgment on ETW's claim for violation of its registered mark, \"Tiger Woods,\" on the grounds that the claim was barred by the fair use defense as a matter of law.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nIII. Trademark Claims Under 15 U.S.C. §1125(a) Based on the Unauthorized Use of the Likeness of Tiger Woods\n\nSection 43(a) of the Lanham Act, 15 U.S.C. §1125(a), provides \"a right of action to persons engaged in interstate and foreign commerce, against deceptive and misleading use of words, names, symbols, or devices, or any combination thereof, which have been adopted by a ... merchant to identify his goods and distinguish them from those manufactured by others[.]\" Federal-Mogul-Bower Bearings, Inc. v. Azoff, 313 F.2d 405, 408 (6th Cir. 1963); see also Frisch's Restaurant, Inc. v. Shoney's, Inc., 759 F.2d 1261, 1264 (6th Cir. 1985); Frisch's Restaurants, Inc. v. Elby's Big Boy of Steubenville, Inc., 670 F.2d 642, 647 (6th Cir.), cert. denied, 459 U.S. 916 (1982).\n\nETW has registered Woods's name as a trademark, but it has not registered any image or likeness of Woods. Nevertheless, ETW claims to have trademark rights in Woods's image and likeness. Section 43 (a) of the Lanham Act provides a federal cause of action for infringement of an unregistered trademark which affords such marks essentially the same protection as those that are registered. See Two Pesos, Inc. v. Taco Cabana, Inc., 505 U.S. 763, 768 (1992)(\"[I]t is common ground that §43(a) protects qualifying unregistered trademarks and that the general principles qualifying a mark for registration under §2 of the Lanham Act are for the most part applicable in determining whether an unregistered mark is entitled to protection under §43(a).\").\n\nThe Lanham Act defines a trademark as including \"any word, name, symbol, or device, or any combination thereof\" used by a person \"to identify and distinguish his or her goods ... from those manufactured or sold by others and to indicate the source of the goods, even if that source is unknown.\" 15 U.S.C. §1127. The essence of a trademark is a designation in the form of a distinguishing name, symbol or device which is used to identify a person's goods and distinguish them from the goods of another. See Taco Cabana, 505 U.S. at 768 (\"In order to be [protected], a mark must be capable of distinguishing the [owner's] goods from those of others.\"). Not every word, name, symbol or device qualifies as a protectable mark; rather, it must be proven that it performs the job of identification, i.e., to identify one source and to distinguish it from other sources. If it does not do this, then it is not protectable as a trademark. See J. Thomas McCarthy, McCarthy on Trademarks and Unfair Competition, §3:1 (2002).\n\n\"[A] trademark, unlike a copyright or patent, is not a 'right in gross' that enables a holder to enjoin all reproductions.\" Boston Athletic Ass'n v. Sullivan, 867 F.2d 22, 35 (1st Cir. 1989)(citing Univ. of Notre Dame du Lac v. J.C. Gourmet Food Imports Co., 703 F.2d 1372, 1374 (Fed. Cir. 1983)).\n\nHere, ETW claims protection under the Lanham Act for any and all images of Tiger Woods.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e This is an untenable claim. ETW asks us, in effect, to constitute Woods himself as a walking, talking trademark. Images and likenesses of Woods are not protectable as a trademark because they do not perform the trademark function of designation. They do not distinguish and identify the source of goods. They cannot function as a trademark because there are undoubtedly thousands of images and likenesses of Woods taken by countless photographers, and drawn, sketched, or painted by numerous artists, which have been published in many forms of media, and sold and distributed throughout the world. No reasonable person could believe that merely because these photographs or paintings contain Woods's likeness or image, they all originated with Woods.\n\nWe hold that, as a general rule, a person's image or likeness cannot function as a trademark. Our conclusion is supported by the decisions of other courts which have addressed this issue. In Pirone v. MacMillan, Inc., 894 F.2d 579 (2nd Cir. 1990), the Second Circuit rejected a trademark claim asserted by the daughters of baseball legend Babe Ruth. The plaintiffs objected to the use of Ruth's likeness in three photographs which appeared in a calendar published by the defendant. The court rejected their claim, holding that \"a photograph of a human being, unlike a portrait of a fanciful cartoon character, is not inherently 'distinctive' in the trademark sense of tending to indicate origin.\" Id. at 583. The court noted that Ruth \"was one of the most photographed men of his generation, a larger than life hero to millions and an historical figure[.]\" Id. The Second Circuit Court concluded that a consumer could not reasonably believe that Ruth sponsored the calendar:\n\n[A]n ordinarily prudent purchaser would have no difficulty discerning that these photos are merely the subject matter of the calendar and do not in any way indicate sponsorship. No reasonable jury could find a likelihood of confusion.\n\nId. at 585. The court observed that \"[u]nder some circumstances, a photograph of a person may be a valid trademark--if, for example, a particular photograph was consistently used on specific goods.\" Id. at 583. The court rejected plaintiffs' assertion of trademark rights in every photograph of Ruth.\n\nIn Estate of Presley v. Russen, 513 F. Supp. 1339, 1363-1364 (D.N.J. 1981), the court rejected a claim by the estate of Elvis Presley that his image and likeness was a valid mark. The court did find, however, as suggested by the Second Circuit in Pirone, that one particular image of Presley had been consistently used in the advertising and sale of Elvis Presley entertainment services to identify those services and that the image could likely be found to function as a mark.\n\nIn Rock and Roll Hall of Fame, the plaintiff asserted trademark rights in the design of the building which houses the Rock and Roll Hall of Fame in Cleveland, Ohio, and claimed that defendant's poster featuring a photograph of the museum against a colorful sunset was a violation of its trademark rights. 134 F.3d at 751. This court, with one judge dissenting, reversed the judgment of the district court which granted plaintiff's request for a preliminary injunction. After reviewing the evidence, the majority concluded:\n\nIn reviewing the Museum's disparate uses of several different perspectives of its building design, we cannot conclude that they create a consistent and distinct commercial impression as an indicator of a single source of origin or sponsorship. To be more specific, we cannot conclude on this record that it is likely that the Museum has established a valid trademark in every photograph which, like Gentile's, prominently displays the front of the Museum's building.\n\nId. at 755. In reaching this conclusion, this court approved and followed Pirone and Estate of Presley.\n\nHere, ETW does not claim that a particular photograph of Woods has been consistently used on specific goods.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Instead, ETW's claim is identical to that of the plaintiffs in Pirone, a sweeping claim to trademark rights in every photograph and image of Woods. Woods, like Ruth, is one of the most photographed sports figures of his generation, but this alone does not suffice to create a trademark claim.\n\nThe district court properly granted summary judgment on ETW's claim of trademark rights in all images and likenesses of Tiger Woods.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nIV. Lanham Act Unfair Competition and False Endorsement Claims, Ohio Right to Privacy Claims, and the First Amendment Defense\n\nA. Introduction\n\nETW's claims under §43(a) of the Lanham Act, 15 U.S.C. §1125(a), include claims of unfair competition and false advertising in the nature of false endorsement. ETW has also asserted a claim for infringement of the right of publicity under Ohio law. The elements of a Lanham Act false endorsement claim are similar to the elements of a right of publicity claim under Ohio law. In fact, one legal scholar has said that a Lanham Act false endorsement claim is the federal equivalent of the right of publicity. See Bruce P. Keller, The Right Of Publicity: Past, Present, and Future, 1207 PLI Corp. Law and Prac. Handbook, 159, 170 (October 2000). Therefore, cases which address both these types of claims should be instructive in determining whether Jireh is entitled to summary judgment on those claims.\n\nIn addition, Jireh has raised the First Amendment as a defense to all of ETW's claims, arguing that Rush's use of Woods's image in his painting is protected expression. Cases involving Lanham Act false endorsement claims and state law claims of the right of publicity have considered the impact of the First Amendment on those types of claims. We will begin with a discussion of the scope of First Amendment rights in the context of works of art, and will then proceed to examine how First Amendment rights have been balanced against intellectual property rights in cases involving the Lanham Act and state law rights of publicity. Finally, we will apply the relevant legal principles to the facts of this case.\n\nB. First Amendment Defense\n\nThe protection of the First Amendment is not limited to written or spoken words, but includes other mediums of expression, including music, pictures, films, photographs, paintings, drawings, engravings, prints, and sculptures. See Hurley v. Irish-American Gay, Lesbian and Bisexual Group of Boston, 515 U.S. 557, 569 (1995)(\"[T]he Constitution looks beyond written or spoken words as mediums of expression.\"); Ward v. Rock Against Racism, 491 U.S. 781, 790 (1989) (\"Music, as a form of expression and communication, is protected under the First Amendment.\"); Zacchini v. Scripts-Howard Broadcasting Co., 433 U.S. 562, 578 (1977)(\"There is no doubt that entertainment, as well as news, enjoys First Amendment protection.\"); Kaplan v. California, 413 U.S. 115, 119-120 (1973)(\"[P]ictures, films, paintings, drawings, and engravings ... have First Amendment protection[.]\"); Bery v. City of New York, 97 F.3d 689, 695 (2nd Cir. 1996)(\"[V]isual art is as wide ranging in its depiction of ideas, concepts and emotions as any book, treatise, pamphlet or other writing, and is similarly entitled to full First Amendment protection.\").\n\nSpeech is protected even though it is carried in a form that is sold for profit. See Smith v. California, 361 U.S. 147, 150 (1959) (\"It is of course no matter that the dissemination [of books and other forms of the printed word] takes place under commercial auspices.\"); see also Buckley v. Valeo, 424 U.S. 1 (1976)(paid advertisement); Time, Inc. v. Hill, 385 U.S. 374, 397 (1967) (\"'That books, newspapers, and magazines are published and sold for profit does not prevent them from being a form of expression whose liberty is safeguarded by the First Amendment.'\")(quoting Joseph Burstyn, Inc. v. Wilson, 343 U.S. 495, 501-502) (1952)); New York Times Co. v. Sullivan, 376 U.S. 254 (1964) (solicitation to pay or contribute money). The fact that expressive materials are sold does not diminish the degree of protection to which they are entitled under the First Amendment. City of Lakewood v. Plain Dealer Publ'g Co., 486 U.S. 750, 756 n.5 (1988).\n\nPublishers disseminating the work of others who create expressive materials also come wholly within the protective shield of the First Amendment. See, e.g., Simon \u0026 Schuster, Inc. v. Members of New York State Crime Victims Bd., 502 U.S. 105, 116 (1991)(both the author and the publishing house are \"speakers\" for purposes of the First Amendment); Sullivan, 376 U.S. at 286-88 (finding New York Times fully protected by the First Amendment for publishing a paid editorial advertisement). See also First Nat'l Bank of Boston v. Bellotti, 435 U.S. 765, 782 (1978).\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nEven pure commercial speech is entitled to significant First Amendment protection. See City of Cincinnati v. Discovery Network, Inc., 507 U.S. 410, 423 (1993); Bd. of Trustees of the State University of New York v. Fox, 492 U.S. 469, 473-74 (1989); Central Hudson Gas and Electric Corp. v. Pub. Serv. Comm'n of New York, 447 U.S. 557 (1980); Virginia State Bd. of Pharmacy v. Virginia Citizens Consumer Council, Inc., 425 U.S. 748 (1976). Commercial speech is \"speech which does 'no more than propose a commercial transaction[.]'\" Virginia State Bd. of Pharmacy, 425 U.S. at 762 (quoting Pittsburgh Press Co. v. Pittsburgh Comm'n on Human Relations, 413 U.S. 376, 385 (1973)); see also Central Hudson Gas and Electric Corp., 447 U.S. at 566 (articulating a four part test to bring commercial speech within the protection of the First Amendment).\n\nRush's prints are not commercial speech. They do not propose a commercial transaction. Accordingly, they are entitled to the full protection of the First Amendment. Thus, we are called upon to decide whether Woods's intellectual property rights must yield to Rush's First Amendment rights.\n\nC. Lanham Act False Endorsement Claim\n\nThe district court did not specifically discuss ETW's false endorsement claim in granting summary judgment to Jireh. The gist of the false endorsement claim is that the presence of Woods's image in Jireh's print implies that he has endorsed Jireh's product. See McCarthy, The Rights of Publicity and Privacy, §5:30 (2d ed. 2000)(hereinafter \"McCarthy on Publicity and Privacy\"). Courts have recognized false endorsement claims under §43(a) of the Lanham Act where a celebrity's image or persona is used in association with a product so as to imply that the celebrity endorses the product.\n\nFalse endorsement occurs when a celebrity's identity is connected with a product or service in such a way that consumers are likely to be misled about the celebrity's sponsorship or approval of the product or service. See, e.g., Wendt v. Host Int'l, Inc., 125 F.3d 806 (9th Cir. 1997)(animatronic robotic figures resembling actors in Cheers television program used to advertise chain of airport bars modeled on Cheers set); Abdul-Jabar v. General Motors Corp., 85 F.3d 407 (9th Cir. 1996)(athlete's name and accomplishments used in television advertisement for Oldsmobile automobiles); Waits v. Frito-Lay, Inc., 978 F.2d 1093 (9th Cir. 1992)(imitation of singer's unique voice used in radio commercial advertising Dorito Chips); White v. Samsung Electronics America, Inc., 971 F.2d 1395 (9th Cir. 1992)(female robot bearing resemblance to television celebrity, Vanna White, turning letters in what appeared to be the \"Wheel of Fortune\" game show set in television commercial advertising electronics products); Allen v. National Video, Inc., 610 F.Supp. 612 (S.D.N.Y. 1985)(photograph of Woody Allen look-alike in national advertising campaign for video club).\n\nIn Landham v. Lewis Galoob Toys, Inc., 227 F.3d 619, 626 (6th Cir. 2000), we noted:\n\nA false designation of origin claim brought by an entertainer under §43(a) of the Lanham Act in a case such as this is equivalent to a false association or endorsement claim, see Waits, 978 F.2d at 1110, and the \"mark\" at issue is the plaintiff's identity. See White, 971 F.2d at 1399-1400.\n\nId. at 626.\n\nIn the ordinary false endorsement claim, the controlling issue is likelihood of confusion. This court has formulated an eight-factor test to determine the likelihood of confusion. See Landham, 227 F.3d at 626; Wynn Oil Co. v. Thomas, 839 F.2d 1183, 1186 (6th Cir. 1988). However, for the reasons discussed below, we conclude that where the defendant has articulated a colorable claim that the use of a celebrity's identity is protected by the First Amendment, the likelihood of confusion test is not appropriate because it fails to adequately consider the interests protected by the First Amendment.\n\nIn Rogers v. Grimaldi, 875 F.2d 994 (2nd Cir. 1989), Ginger Rogers, the surviving member of one of the most famous duos in show business history, brought suit against the producers and distributors of a movie entitled Ginger and Fred. The film was not about Ginger Rogers and Fred Astaire, but about two fictional Italian cabaret performers who imitated Rogers and Astaire and became known in Italy as \"Ginger and Fred.\" Rogers asserted claims under §43(a) of the Lanham Act. The Second Circuit began its analysis by noting that \"[m]ovies, plays, books, and songs are all indisputably works of artistic expression and deserve protection.\" Id. at 997. The court concluded that \"[b]ecause overextension of Lanham Act restrictions in the area of titles might intrude on First Amendment values, we must construe the Act narrowly to avoid such a conflict.\" Id. at 998.\n\nThe Second Circuit court rejected Rogers' argument that First Amendment concerns are implicated only where the author has no alternative means of expression. Her argument was based on Lloyd Corp. v. Tanner, 407 U.S. 551, 566-67 (1972), where the Supreme Court held that respondents had no First Amendment right to distribute handbills in the interior mall area of petitioner's privately-owned shopping center, noting that respondents had adequate alternative means of communication. Noting that this test had been applied by several courts in the trademark context, the Rogers court rejected the \"no alternative means\" test because it \"does not sufficiently accommodate the public's interest in free expression[.]\" 875 F.2d at 999. The court concluded:\n\nWe believe that in general the Act should be construed to apply to artistic works only where the public interest in avoiding consumer confusion outweighs the public interest in free expression. In the context of allegedly misleading titles using a celebrity's name, that balance will normally not support application of the Act unless the title has no artistic relevance to the underlying work whatsoever, or, if it has some artistic relevance, unless the title explicitly misleads as to the source or the content of the work.\n\nId.\n\nAlthough Rogers produced some evidence of consumer confusion, the court found:\n\nThe survey evidence, even if its validity is assumed, indicates at most that some members of the public would draw the incorrect inference that Rogers had some involvement with the film. But that risk of misunderstanding, not engendered by any overt claim in the title, is so outweighed by the interests in artistic expression as to preclude application of the Lanham Act.\n\nId. at 1001. The Second Circuit affirmed the district court's decision granting summary judgment to the defendants.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nIn Cliff Notes, Inc. v. Bantam Doubleday Dell Pub. Group, Inc., 886 F.2d 490, 495 (2nd Cir. 1989), the Second Circuit held that the Rogers test is not limited to literary titles but is generally applicable to Lanham Act claims against works of artistic expression. Like Rogers, ETW argues that the district court should have considered whether alternative means existed for Jireh to express itself without violating Woods's intellectual property rights.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e We agree with the Second Circuit's conclusion that the \"no alternative means\" test does not sufficiently accommodate the public's interest in free expression.\n\nIn Mattel, Inc. v. MCA Records, Inc., 296 F.3d 894 (9th Cir. 2002), the Ninth Circuit adopted and applied the Rogers test where the plaintiff asserted Lanham Act claims against the producer of a song entitled \"Barbie Girl\" which evoked the image of plaintiff's famous doll. The court held that in the case of expressive speech, its traditional likelihood of confusion test \"fails to account for the full weight of the public's interest in free expression.\" 296 F.3d at 900. After expressly adopting the Rogers standard as its own, the court set forth the following analysis:\n\nApplying Rogers to our case, we conclude that MCA's use of Barbie is not an infringement of Mattel's trademark. Under the first prong of Rogers, the use of Barbie in the song title clearly is relevant to the underlying work, namely, the song itself. As noted, the song is about Barbie and the values Aqua claims she represents. The song title does not explicitly mislead as to the source of the work; it does not, explicitly or otherwise, suggest that it was produced by Mattel. The only indication that Mattel might be associated with the song is the use of Barbie in the title; if this were enough to satisfy this prong of the Rogers test, it would render Rogers a nullity. We therefore agree with the district court that MCA was entitled to summary judgment on this ground.\n\n296 F.3d at 902. Thus, both the Second Circuit and the Ninth Circuit have held that in Lanham Act false endorsement cases involving artistic expression, the likelihood of confusion test does not give sufficient weight to the public interest in free expression. Both courts rejected the \"no alternative means\" test. They held instead that the Lanham Act should be applied to artistic works only where the public interest in avoiding confusion outweighs the public interest in free expression. They agreed that the public interest in free expression should prevail if the use of the celebrity's image has artistic relevance, unless it is used in such a way that it explicitly misleads as to the source of the work.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nIn Parks v. LaFace Records, 329 F.3d 437 (6th Cir. 2003), we joined the Second and Ninth Circuits in holding that the likelihood of confusion and \"alternative means\" tests do not give sufficient weight to the public interest in freedom of expression. In Parks, we adopted the Rogers test as the law of the Sixth Circuit:\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nThe application of Rogers in Mattel, we well as in cases decided in other circuits, persuades us that Rogers is the best test for balancing Defendants' and the public's interest in free expression under the First Amendment against Parks' and the public's interest in enforcement of the Lanham Act. We thus apply the Rogers test to the facts before us.\n\nId. at 451-52 (quoting Rogers, 875 F.2d at 999).\n\nD. Right of Publicity Claim\n\nETW claims that Jireh's publication and marketing of prints of Rush's painting violates Woods's right of publicity. The right of publicity is an intellectual property right of recent origin which has been defined as the inherent right of every human being to control the commercial use of his or her identity. See McCarthy on Publicity and Privacy, §1:3. The right of publicity is a creature of state law \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e and its violation gives rise to a cause of action for the commercial tort of unfair competition. Id.\n\nThe right of publicity is, somewhat paradoxically, an outgrowth of the right of privacy. See McCarthy on Publicity and Privacy, §1:4. A cause of action for violation of the right was first recognized in Haelan Laboratories, Inc. v. Topps Chewing Gum, Inc., 202 F.2d 866 (2nd Cir. 1953), where the Second Circuit held that New York's common law protected a baseball player's right in the publicity value of his photograph, and in the process coined the phrase \"right of publicity\" as the name of this right.\n\nThe Ohio Supreme Court \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e recognized the right of publicity in 1976 in Zacchini v. Scripps-Howard Broadcasting Co., 47 Ohio St.2d 224, 351 N.E.2d 454 (1976).\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e In Zacchini, which involved the videotaping and subsequent rebroadcast on a television news program of plaintiff's human cannonball act, the Ohio Supreme Court held that Zacchini's right of publicity was trumped by the First Amendment. On appeal, the Supreme Court of the United States reversed, holding that the First Amendment did not insulate defendant from liability for violating Zacchini's state law right of publicity where defendant published the plaintiff's entire act. See Zacchini v. Scripps-Howard Broadcasting Co., 433 U.S. 562 (1977). Zacchini is the only United States Supreme Court decision on the right of publicity.\n\nThere are few Ohio decisions defining the contours of the right of publicity in the aftermath of Zacchini. In Vinci v. American Can Co., 9 Ohio St.3d 98, 459 N.E.2d 507 (1984), the Ohio Supreme Court merely reaffirmed its recognition of the right and devoted the remainder of its opinion to the issue of class action certification. Vinci was an Olympic gold medal weight lifter who brought a class action on behalf of himself and other Olympic athletes whose names and likenesses were used on a series of disposable drinking cups promoted by a partnership between the Minute Maid Corporation and the United States Olympic Committee. The Supreme Court of Ohio held that the action could be maintained as a class action. After remanding the case to the Cuyahoga County Court of Appeals, that court, with one judge dissenting, upheld the grant of summary judgment to the defendants, holding that \"the mention of the athletes' names within the context of accurate, historical information was incidental to the promotion of the Dixie Cups by the partnership\" and that the \"reference to the athletes and their accomplishments was purely informational[.]\" Vinci v. American Can Co., 69 Ohio App.3d 727, 729, 591 N.E.2d 793, 794 (1990).\n\nIn Bajpayee v. Rothermich, 53 Ohio App.2d 117, 372 N.E.2d 817 (1977), the Ohio Court of Appeals for Franklin County held that the plaintiff's right of publicity was violated where the defendant presented plaintiff's pharmacological research paper as his own before the American Society of Clinical Pharmacology and Therapeutics.\n\nFinally, in Parma International, Inc. v. Bartos, No. 89CA004573, 1990 Ohio App. LEXIS 508 (Feb. 7, 1990), the Ohio Court of Appeals for Lorain County reversed a trial court's grant of summary judgment for the defendant where the defendant had continued to use the plaintiff's name and likeness on the packaging of its product and in its advertising literature after the plaintiff ceased his employment with the defendant. The issue in Parma International was whether the plaintiff had consented to the continued use of his name and likeness.\n\nWhen the Ohio Supreme Court recognized the right of publicity, it relied heavily on the Restatement (Second) of Torts, §652. See Zacchini, 47 Ohio St.2d at 230. The court quoted the entire text of §652(C) of the Restatement, as well as comments a., b., c. and d. Id.\n\nThe Restatement originally treated the right of publicity as a branch of the right of privacy and included it in a chapter entitled \"Invasion of Privacy.\" In 1995, the American Law Institute transferred its exposition of the right of publicity to the Restatement (Third) of Unfair Competition, Chapter 4, §46, in a chapter entitled \"Appropriation of Trade Values.\" The current version of the Restatement (Third) of Unfair Competition defines the right of publicity as follows:\n\nAppropriation of the Commercial Value of a Person's Identity: The Right of Publicity\n\nOne who appropriates the commercial value of a person's identity by using without consent the person's name, likeness, or other indicia of identity for purposes of trade is subject to liability for the relief appropriate under the rules stated in §§ 48 and 49.\n\nId.\n\nIn §46, Comment c, Rationale for Protection, the authors of the Restatement suggest that courts may justifiably be reluctant to adopt a broad construction of the right.\n\nThe rationales underlying recognition of a right of publicity are generally less compelling than those that justify rights in trademarks or trade secrets. The commercial value of a person's identity often results from success in endeavors such as entertainment or sports that offer their own substantial rewards. Any additional incentive attributable to the right of publicity may have only marginal significance. In other cases the commercial value acquired by a person's identity is largely fortuitous or otherwise unrelated to any investment made by the individual, thus diminishing the weight of the property and unjust enrichment rationales for protection. In addition, the public interest in avoiding false suggestions of endorsement or sponsorship can be pursued through the cause of action for deceptive marketing. Thus, courts may be properly reluctant to adopt a broad construction of the publicity right. See § 47.\n\nIn §47, Comment c, the authors of the Restatement note, \"The right of publicity as recognized by statute and common law is fundamentally constrained by the public and constitutional interest in freedom of expression.\" In the same comment, the authors state that \"[t]he use of a person's identity primarily for the purpose of communicating information or expressing ideas is not generally actionable as a violation of the person's right of publicity.\" Various examples are given, including the use of the person's name or likeness in news reporting in newspapers and magazines. The Restatement recognizes that this limitation on the right is not confined to news reporting but extends to use in \"entertainment and other creative works, including both fiction and non-fiction.\" Id. The authors list examples of protected uses of a celebrity's identity, likeness or image, including unauthorized print or broadcast biographies and novels, plays or motion pictures. Id. According to the Restatement, such uses are not protected, however, if the name or likeness is used solely to attract attention to a work that is not related to the identified person, and the privilege may be lost if the work contains substantial falsifications. Id.\n\nWe believe the courts of Ohio would follow the principles of the Restatement in defining the limits of the right of publicity. The Ohio Supreme Court's decision in Zacchini suggests that Ohio is inclined to give substantial weight to the public interest in freedom of expression when balancing it against the personal and proprietary interests recognized by the right of publicity. This suggestion is reenforced by the decision in Vinci.\n\nThis court first encountered the right of publicity in Memphis Development Foundation v. Factors Etc., Inc., 616 F.2d 956 (6th Cir. 1980), where the issue presented was whether the heirs of Elvis Presley retained his right of publicity after his death. We concluded that they did not. We held that under Tennessee law, \"[t]he famous have an exclusive legal right during life to control and profit from the commercial use of their name and personality.\" Id. at 957. Noting that the Tennessee courts had not addressed the issue, we decided the case \"in the light of practical and policy considerations, the treatment of other similar rights in our legal system, the relative weight of the conflicting interests of the parties, and certain moral presuppositions concerning death, privacy, inheritability and economic opportunity.\" Id. at 958.\n\nIn Carson v. Here's Johnny Portable Toilets, Inc., 698 F.2d 831 (6th Cir. 1983), a majority of this court, with Judge Kennedy dissenting, held that television comedian and talk show host Johnny Carson's right of publicity was invaded when defendant used the phrase with which Carson was commonly introduced on his television program. In Carson, we held that \"a celebrity has a protected pecuniary interest in the commercial exploitation of his identity.\" Id. at 835.\n\nIn Landham, 227 F.3d at 625-26, this court held that Landham, a fringe actor who played supporting roles in several motion pictures, had failed to show a violation of his right of publicity when defendant marketed an action figure of a character he had played but which did not bear a personal resemblance to him. This court found that Landham had failed to show that his persona had significant value or that the toy invoked his persona as distinct from that of the fictional character he played.\n\nThere is an inherent tension between the right of publicity and the right of freedom of expression under the First Amendment. This tension becomes particularly acute when the person seeking to enforce the right is a famous actor, athlete, politician, or otherwise famous person whose exploits, activities, accomplishments, and personal life are subject to constant scrutiny and comment in the public media. In Memphis Development Foundation, 616 F.2d at 959, this court discussed the problems of judicial line drawing that would arise if it should recognize the inheritability of publicity rights, including the question \"[a]t what point does the right collide with the right of free expression guaranteed by the First Amendment?\" In Carson, after noting that the First Amendment protects commercial speech, Judge Kennedy opined in her dissent that \"public policy requires that the public's interest in free enterprise and free expression take precedence over any interest Johnny Carson may have in a phrase associated with his person.\" Carson, 698 F.2d at 841. In Landham, we noted \"the careful balance that courts have gradually constructed between the right of publicity and the First Amendment[.]\" 227 F.3d at 626.\n\nIn a series of recent cases, other circuits have been called upon to establish the boundaries between the right of publicity and the First Amendment. In Rogers, the Second Circuit affirmed the district court's grant of summary judgment on Rogers' right of publicity claim, noting that commentators have \"advocated limits on the right of publicity to accommodate First Amendment concerns.\" 875 F.2d at 1004 n.11. That court also cited three cases \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e in which state courts refused to extend the right of publicity to bar the use of a celebrity's name in the title and text of a fictional or semi-fictional book or movie. Id. at 1004.\n\nIn White, television celebrity Vanna White, brought suit against Samsung Electronics, alleging that its television advertisement which featured a female-shaped robot wearing a long gown, blonde wig, large jewelry, and turning letters in what appeared to be the \"Wheel of Fortune\" game show set, violated her California common law right of publicity and her rights under the Lanham Act. The Ninth Circuit, with Judge Alarcon dissenting in part, reversed the grant of summary judgment to defendant, holding that White had produced sufficient evidence that defendant's advertisement appropriated her identity in violation of her right of publicity, and that the issue of confusion about White's endorsement of defendant's product created a jury issue which precluded summary judgment on her Lanham Act claim. In so holding, the court rejected the defendant's parody defense which posited that the advertisement was a parody of White's television act and was protected speech.\n\nA suggestion for rehearing en banc failed. Three judges dissented from the order rejecting the suggestion for a rehearing en banc. See White v. Samsung Electronics America, Inc., 989 F.2d 1512 (9th Cir. 1993). Judge Kozinski, writing the dissenting opinion, observed, \"Something very dangerous is going on here.... Overprotecting intellectual property is as harmful as underprotecting it. Creativity is impossible without a rich public domain.\" 989 F.2d at 1513. Later, he commented:\n\nIntellectual property rights aren't free: They're imposed at the expense of future creators and of the public at large.... This is why intellectual property law is full of careful balances between what's set aside for the owner and what's left in the public domain for the rest of us[.]\n\nId. at 1516. In Landham, this court declined to follow the majority in White and, instead, cited Judge Kozinski's dissent with approval. See 227 F.3d at 626.\n\nIn Cardtoons, L.C. v. Major League Baseball Players Assoc., 95 F.3d 959 (10th Cir. 1996), the Tenth Circuit held that the plaintiff's First Amendment right to free expression outweighed the defendant's proprietary right of publicity. The plaintiff in Cardtoons contracted with a political cartoonist, a sports artist, and a sports author and journalist to design a set of trading cards which featured readily identifiable caricatures of major league baseball players with a humorous commentary about their careers on the back. The cards ridiculed the players using a variety of themes. The cards used similar names, recognizable caricatures, distinctive team colors and commentaries about individual players which left no doubt about their identity. The Tenth Circuit held that the defendant's use of the player's likenesses on its trading cards would violate their rights of publicity under an Oklahoma statute. Addressing the defendant's First Amendment claim, the court held:\n\nCardtoons' parody trading cards receive full protection under the First Amendment. The cards provide social commentary on public figures, major league baseball players, who are involved in a significant commercial enterprise, major league baseball. While not core political speech ... this type of commentary on an important social institution constitutes protected expression.\n\nCardtoons, 95 F.3d at 969. The Tenth Circuit rejected the reasoning of the panel majority in White, and expressed its agreement with the dissenting opinions of Judges Alarcon and Kozinski. See 95 F.3d at 970 (\"We disagree with the result in [White] for reasons discussed in the two dissents that it engendered.\"). In striking the balance between the players' property rights and the defendant's First Amendment rights, the court in Cardtoons commented on the pervasive presence of celebrities in the media, sports and entertainment. The court noted that celebrities are an important part of our public vocabulary and have come to symbolize certain ideas and values:\n\nAs one commentator explained, celebrities are \"common points of reference for millions of individuals who may never interact with one another, but who share, by virtue of their participation in a mediated culture, a common experience and a collective memory.\" John B. Thompson, Ideology and Modern Culture: Critical Social Theory in the Era of Mass Communication 163 (1990). Through their pervasive presence in the media, sports and entertainment celebrities come to symbolize certain ideas and values.... Celebrities, then, are an important element of the shared communicative resources of our cultural domain.\n\nCardtoons, 95 F.3d at 972.\n\nThe court observed that one of the justifications often given for the right of publicity is the furthering of economic goals such as stimulating athletic and artistic achievement by securing to celebrities the fruits of their labors and talents. The court then noted that major league baseball players' salaries currently average over one million dollars per year and commented:\n\nSuch figures suggest that \"even without the right of publicity the rate of return to stardom in the entertainment and sports fields is probably high enough to bring forth a more than 'adequate' supply of creative effort and achievement.\" ... In addition, even in the absence of publicity rights, celebrities would still be able to reap financial reward from authorized appearances and endorsements. The extra income generated by licensing one's identity does not provide a necessary inducement to enter and achieve in the realm of sports and entertainment. Thus, while publicity rights may provide some incentive for creativity and achievement, the magnitude and importance of that incentive has been exaggerated.\n\nCardtoons, 95 F.3d at 974 (citation omitted). Noting that another justification for publicity rights is the prevention of unjust enrichment, the court observed that \"Cardtoons added a significant creative component of its own to the celebrity identity and created an entirely new product.\" Cardtoons, 95 F.3d at 976. The Tenth Circuit affirmed the district court's ruling that the trading cards were expression protected by the First Amendment.\n\nIn Hoffman v. Capital Cities/ABC, Inc., 255 F.3d 1180 (9th Cir. 2001), the Ninth Circuit was again presented with a case involving the tension between the right of publicity and the First Amendment. The plaintiff, actor Dustin Hoffman, brought suit against a magazine and its publisher, seeking to recover on state law claims for the violation of his right of publicity, for unfair competition and for violation of the Lanham Act, based on allegations that the magazine used, without his permission, a still photograph from a motion picture to create a computer-generated image which falsely depicted him wearing fashion designer's women's clothes. The court rejected Hoffman's claims, holding that the magazine article was entitled to full protection under the First Amendment.\n\nIn 1982, Hoffman starred in the movie Tootsie, playing a male actor who dresses as a woman to get a part on a television soap opera. A still photograph from the movie showed Hoffman in character in a red, long-sleeved sequined evening dress and high heels, posing in front of an American flag. In March, 1997, the defendant L.A. Magazine, Inc. (\"LAM\") published an issue of its magazine which contained an article entitled \"Grand Illusions\", which used computer technology to alter famous film stills to make it appear that the actors were wearing spring 1997 fashions. The article contained sixteen familiar scenes of famous actors from famous movies. In the photo of Hoffman, his head and the American flag appeared as they did in the original, but his body and the long sleeved, red dress were replaced by the body of a male model in the same pose, wearing a spaghetti-strapped, cream colored silk evening dress and high heeled sandals. The text on the page identified the still as from the movie Tootsie and read \"Dustin Hoffman isn't a drag in a butter-colored silk gown by Richard Tyler and Ralph Lauren heels.\" Id. at 1183. Hoffman's complaint alleged that LAM's publication of the altered photograph misappropriated his name and likeness, in violation of his California common law and statutory rights of publicity. LAM replied that its challenged use of the Tootsie photo was protected under the First Amendment.\n\nQuoting this court's decision in Landham, the Tenth Circuit began its opinion by stating, \"We evaluate this defense aware of 'the careful balance that courts have gradually constructed between the right of publicity and the First Amendment and federal intellectual laws.'\" Hoffman, 255 F.3d at 1183-1184. The court concluded that LAM's publication of the altered Tootsie photograph was not commercial speech:\n\nViewed in context, the article as a whole is a combination of fashion photography, humor, and visual and verbal editorial comment on classic films and famous actors. Any commercial aspects are \"inextricably entwined\" with expressive elements, and so they cannot be separated out \"from the fully protected whole\". (Citations omitted).\n\nHoffman, 255 F.3d at 1185. The court concluded that LAM was entitled to the full First Amendment protection accorded non-commercial speech which could be defeated only by proof of actual malice.\n\nIn Comedy III Productions, Inc. v. Gary Saderup, Inc., 25 Cal. 4th 387, 21 P.3d 797 (2001), the California Supreme Court adopted a transformative use test in determining whether the artistic use of a celebrity's image is protected by the First Amendment. Saderup, an artist with over twenty-five years experience in making charcoal drawings of celebrities, created a drawing of the famous comedy team, The Three Stooges. The drawings were used to create lithographic and silk screen masters, which were then used to produce lithographic prints and silk screen images on T-shirts. Comedy III, the owner of all rights to the former comedy act, brought suit against Saderup under a California statute, which grants the right of publicity to successors in interest of deceased celebrities.\n\nThe California Supreme Court found that Saderup's portraits were entitled to First Amendment protection because they were \"expressive works and not an advertisement or endorsement of a product.\" Id. at 396, 21 P.3d at 802. In discussing the tension between the right of publicity and the First Amendment, the court observed:\n\n[B]ecause celebrities take on personal meanings to many individuals in the society, the creative appropriation of celebrity images can be an important avenue of individual expression. As one commentator has stated: \"Entertainment and sports celebrities are the leading players in our Public Drama. We tell tales, both tall and cautionary, about them. We monitor their comings and goings, their missteps and heartbreaks. We copy their mannerisms, their styles, their modes of conversation and of consumption. Whether or not celebrities are 'the chief agents of moral change in the United States,' they certainly are widely used--far more than are our institutionally anchored elites-- to symbolize individual aspirations, group identities and cultural values. Their images are thus important expressive and communicative resources: the peculiar, yet familiar idiom in which we conduct a fair portion of our cultural business and everyday conversation.\" (Madow, Private Ownership of Public Image: Popular Culture and Publicity Rights (1993) 81 Cal. L. Rev. 125, 128 (Madow, italics and fns. omitted).\n\nId. at 397, 21 P.3d at 803.\n\nThe court rejected the proposition that Saderup's lithographs and T-shirts lost their First Amendment protection because they were not original single works of art, but were instead part of a commercial enterprise designed to generate profit solely from the sale of multiple reproductions of likenesses of The Three Stooges:\n\n[T]his position has no basis in logic or authority. No one would claim that a published book, because it is one of many copies, receives less First Amendment protection than the original manuscript.... [A] reproduction of a celebrity image that, as explained above, contains significant creative elements is entitled to as much First Amendment protection as an original work of art.\n\nId. at 408, 21 P.3d at 810.\n\nBorrowing part of the fair use defense from copyright law, the California court proposed the following test for distinguishing between protected and unprotected expression when the right of publicity conflicts with the First Amendment:\n\nWhen artistic expression takes the form of a literal depiction or imitation of a celebrity for commercial gain, directly trespassing on the right of publicity without adding significant expression beyond that trespass, the state law interest in protecting the fruits of artistic labor outweighs the expressive interests of the imitative artist.\n\nOn the other hand, when a work contains significant transformative elements, it is not only especially worthy of First Amendment protection, but it is also less likely to interfere with the economic interest protected by the right of publicity....\n\nAccordingly, First Amendment protection of such works outweighs whatever interest the state may have in enforcing the right of publicity.\n\nId. at 405, 21 P.3d at 808 (footnote and citations omitted). Later in its opinion, the California court restated the test as follows:\n\nAnother way of stating the inquiry is whether the celebrity likeness is one of the \"raw materials\" from which an original work is synthesized, or whether the depiction or imitation of the celebrity is the very sum and substance of the work in question.\n\nId. at 406, 21 P.3d at 809.\n\nFinally, citing the art of Andy Warhol, the court noted that even literal reproductions of celebrity portraits may be protected by the First Amendment.\n\nThrough distortion and the careful manipulation of context, Warhol was able to convey a message that went beyond the commercial exploitation of celebrity images and became a form of ironic social comment on the dehumanization of celebrity itself.... Although the distinction between protected and unprotected expression will sometimes be subtle, it is no more so than other distinctions triers of fact are called on to make in First Amendment jurisprudence.\n\nId. at 408-409, 21 P.3d at 811 (citations and footnote omitted).\n\nWe conclude that in deciding whether the sale of Rush's prints violate Woods's right of publicity, we will look to the Ohio case law and the Restatement (Third) of Unfair Competition. In deciding where the line should be drawn between Woods's intellectual property rights and the First Amendment, we find ourselves in agreement with the dissenting judges in White,\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e the Tenth Circuit's decision in Cardtoons, and the Ninth Circuit's decision in Hoffman, and we will follow them in determining whether Rush's work is protected by the First Amendment. Finally, we believe that the transformative elements test adopted by the Supreme Court of California in Comedy III Productions, will assist us in determining where the proper balance lies between the First Amendment and Woods's intellectual property rights. We turn now to a further examination of Rush's work and its subject.\n\nE. Application of the Law to the Evidence in this Case\n\nThe evidence in the record reveals that Rush's work consists of much more than a mere literal likeness of Woods. It is a panorama of Woods's victory at the 1997 Masters Tournament, with all of the trappings of that tournament in full view, including the Augusta clubhouse, the leader board, images of Woods's caddy, and his final round partner's caddy. These elements in themselves are sufficient to bring Rush's work within the protection of the First Amendment. The Masters Tournament is probably the world's most famous golf tournament and Woods's victory in the 1997 tournament was a historic event in the world of sports. A piece of art that portrays a historic sporting event communicates and celebrates the value our culture attaches to such events. It would be ironic indeed if the presence of the image of the victorious athlete would deny the work First Amendment protection. Furthermore, Rush's work includes not only images of Woods and the two caddies, but also carefully crafted likenesses of six past winners of the Masters Tournament: Arnold Palmer, Sam Snead, Ben Hogan, Walter Hagen, Bobby Jones, and Jack Nicklaus, a veritable pantheon of golf's greats. Rush's work conveys the message that Woods himself will someday join that revered group.\n\nTurning first to ETW's Lanham Act false endorsement claim, we agree with the courts that hold that the Lanham Act should be applied to artistic works only where the public interest in avoiding confusion outweighs the public interest in free expression. The Rogers test is helpful in striking that balance in the instant case. We find that the presence of Woods's image in Rush's painting The Masters Of Augusta does have artistic relevance to the underlying work and that it does not explicitly mislead as to the source of the work.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e We believe that the principles followed in Cardtoons, Hoffman and Comedy III are also relevant in determining whether the Lanham Act applies to Rush's work, and we find that it does not.\n\nWe find, like the court in Rogers, that plaintiff's survey evidence, even if its validity is assumed, indicates at most that some members of the public would draw the incorrect inference that Woods had some connection with Rush's print.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e The risk of misunderstanding, not engendered by any explicit indication on the face of the print, is so outweighed by the interest in artistic expression as to preclude application of the Act. We disagree with the dissent's suggestion that a jury must decide where the balance should be struck and where the boundaries should be drawn between the rights conferred by the Lanham Act and the protections of the First Amendment.\n\nIn regard to the Ohio law right of publicity claim, we conclude that Ohio would construe its right of publicity as suggested in the Restatement (Third) of Unfair Competition, Chapter 4, Section 47, Comment d., which articulates a rule analogous to the rule of fair use in copyright law. Under this rule, the substantiality and market effect of the use of the celebrity's image is analyzed in light of the informational and creative content of the defendant's use. Applying this rule, we conclude that Rush's work has substantial informational and creative content which outweighs any adverse effect on ETW's market and that Rush's work does not violate Woods's right of publicity.\n\nWe further find that Rush's work is expression which is entitled to the full protection of the First Amendment and not the more limited protection afforded to commercial speech. When we balance the magnitude of the speech restriction against the interest in protecting Woods's intellectual property right, we encounter precisely the same considerations weighed by the Tenth Circuit in Cardtoons. These include consideration of the fact that through their pervasive presence in the media, sports and entertainment celebrities have come to symbolize certain ideas and values in our society and have become a valuable means of expression in our culture. As the Tenth Circuit observed \"[c]elebrities ... are an important element of the shared communicative resources of our cultural domain.\" Cardtoons, 95 F.3d at 972.\n\nIn balancing these interests against Woods's right of publicity, we note that Woods, like most sports and entertainment celebrities with commercially valuable identities, engages in an activity, professional golf, that in itself generates a significant amount of income which is unrelated to his right of publicity. Even in the absence of his right of publicity, he would still be able to reap substantial financial rewards from authorized appearances and endorsements. It is not at all clear that the appearance of Woods's likeness in artwork prints which display one of his major achievements will reduce the commercial value of his likeness.\n\nWhile the right of publicity allows celebrities like Woods to enjoy the fruits of their labors, here Rush has added a significant creative component of his own to Woods's identity. Permitting Woods's right of publicity to trump Rush's right of freedom of expression would extinguish Rush's right to profit from his creative enterprise.\n\nAfter balancing the societal and personal interests embodied in the First Amendment against Woods's property rights, we conclude that the effect of limiting Woods's right of publicity in this case is negligible and significantly outweighed by society's interest in freedom of artistic expression.\n\nFinally, applying the transformative effects test adopted by the Supreme Court of California in Comedy III, we find that Rush's work does contain significant transformative elements which make it especially worthy of First Amendment protection and also less likely to interfere with the economic interest protected by Woods' right of publicity. Unlike the unadorned, nearly photographic reproduction of the faces of The Three Stooges in Comedy III, Rush's work does not capitalize solely on a literal depiction of Woods. Rather, Rush's work consists of a collage of images in addition to Woods's image which are combined to describe, in artistic form, a historic event in sports history and to convey a message about the significance of Woods's achievement in that event. Because Rush's work has substantial transformative elements, it is entitled to the full protection of the First Amendment. In this case, we find that Woods's right of publicity must yield to the First Amendment.\n\nV. Conclusion\n\nIn accordance with the foregoing, the judgment of the District Court granting summary judgment to Jireh Publishing is affirmed.\n\nDISSENT\n\nCLAY, Circuit Judge, dissenting.\n\nGenuine issues of material fact remain for trial as to the claims brought by Plaintiff, ETW Corporation, under the Lanham Act, 15 U.S.C. § 1114 and § 1125, and Ohio common law for trademark infringement, unfair competition, and dilution; therefore, I would reverse the district court's judgment and remand the case for trial as to these claims. No genuine issue of material fact remains for trial that Defendant, Jireh Publishing, violated Plaintiff's right of publicity under Ohio common law; therefore, I would reverse the district court's judgment on Plaintiff's right of publicity claim and remand with instructions that the district court enter summary judgment in favor of Plaintiff. For these reasons, I respectfully dissent from the majority opinion, and shall address Plaintiff's claims in an order somewhat different than that utilized by the majority.\n\nI. Trademark Claims Based Defendant's Unauthorized Use of the Unregistered Mark--§ 43(a) of the Lanham Act, 15 U.S.C. § 1125(a)\n\nAt the outset, it should be noted that the majority's characterization of this claim as the \"Unauthorized Use of the Likeness of Tiger Woods\" is misleading. Such a characterization bolsters the majority's unfounded position that Plaintiff is seeking protection under the Lanham Act for any and all images of Tiger Woods, but, indeed, such is not the case. Plaintiff's amended complaint squarely sets forth Defendant's conduct to which Plaintiff takes issue--Defendant's portrayal of Woods in his famous golf swing at the Masters Tournament in Augusta as set forth in Rush's print. Plaintiff provided evidence that there was a \"high incidence\" of consumer confusion as to Woods being the origin or sponsor of The Masters of Augusta print by Rick Rush, thus demonstrating, at the very a least, that a question of fact remains for trial as to whether Woods used this image as a trademark and whether Defendant's print infringed upon the mark. See Rock \u0026 Roll Hall of Fame \u0026 Museum, Inc. v. Gentile Prods., 134 F.3d 749, 753 (6th Cir. 1998) (hereinafter \"Rock \u0026 Roll Hall of Fame\" or \"Rock \u0026 Roll\").\n\nThe majority's contention as set forth in footnote 5 of its opinion, that \"Plaintiff's first amended complaint does not allege that Woods has used any specific image or likeness as a trademark,\" misses the point. That is, Plaintiff's complaint expressly takes issue with Defendant's unauthorized sale of Rush's print depicting Woods, and Plaintiff has proffered evidence to show that consumers are confused as to Woods being the sponsor or origin of the print, thereby establishing, particularly for purposes of summary judgment, that the image of Woods in Rush's print has been used as a trademark. The majority's repeated disagreement with this point as set forth in footnote 6 of its opinion flies in the face of several propositions of law.\n\nSection 1125(a), or § 43(a), of the Lanham Act (\"the Act\") \"makes illegal a broad array of rather amorphous practices that are commonly arranged under the loose rubric of 'unfair competition.'\" Sovereign Order of Saint John of Jerusalem, Inc. v. Grady, 119 F.3d 1236, 1242 (6th Cir. 1997); see also Wal-Mart Stores, Inc. v. Samara Bros., Inc., 529 U.S. 205, 209 (2000) (quoting 15 U.S.C. § 1125(a)) (\"In addition to protecting registered marks, the Lanham Act, in § 43(a), gives a producer a cause of action for the use by any person of 'any word, term, name, symbol, or device, or any combination thereof . . . which . . . is likely to cause confusion . . . as to the origin, sponsorship, or approval of his or her goods . . . .'\"). Section 1125(a) is the counterpart to section 1114 of the federal trademark infringement statute, where the former protects certain unregistered marks, while the latter protects registered marks. Id. However, \"whether alleging infringement of a registered trademark, pursuant to 15 U.S.C. § 1114(1), or infringement of an unregistered trademark, pursuant to 15 U.S.C. § 1125(a)(1), it is clear that a plaintiff must show that it has actually used the designation at issue as a trademark, and that the defendant has also used the same or a similar designation, as a trademark.\" Rock \u0026 Roll, 134 F.3d at 753 (emphasis in Rock \u0026 Roll). \"[I]n order to be protected [or considered] as a valid trademark, a designation must create 'a separate and distinct commercial impression, which . . . performs the trademark function of identifying the source of the merchandise to the customers.'\" Id. (quoting In re Chem. Dynamics, Inc., 839 F.2d 1569, 1571 (Fed. Cir. 1988)).\n\nTo this end, \"the plaintiff must establish a likelihood that the defendant's designation will be confused with the plaintiff's trademark, such that consumers are mistakenly led to believe that the defendant's goods are produced or sponsored by the plaintiff.\" Id. at 753-54. Indeed, whether a claim brought under § 1114 for infringement of a registered mark, or whether it is brought under § 1125(a) for infringement of an unregistered mark, the touchstone of the claim is \"likelihood of confusion.\" See Bird v. Parsons, 289 F.3d 865, 877 (6th Cir. 2002) (\"Generally speaking, the key question in cases where a plaintiff alleges trademark infringement and unfair competition is whether the defendant's actions create a likelihood of confusion as to the origin of the parties' goods or services.\"); see also Paccar Inc. v. TeleScan Techs., L.L.C, 319 F.3d 243, 249 (6th Cir. 2003) (\"'The touchstone of liability under § 1114 is whether the defendant's use of the disputed mark is likely to cause confusion among consumers regarding the origin of the goods offered by the parties.'\") (quoting Daddy's Junky Music Stores, Inc. v. Big Daddy's Family Music Ctr., 109 F.3d 275, 280 (6th Cir. 1997)); Sovereign Order of Saint John of Jerusalem, Inc., 119 F.3d at 1243 (noting that \"the touchstone of a section 1125(a) unfair competition claim is whether the defendant's actions are likely to cause confusion\") (citation and internal quotation marks omitted).\n\nThis Court has embraced the following eight-factor test for determining likelihood of confusion. These eight factors are not mechanically applied; rather, they simply serve as guidelines to aid in the Court's analysis:\n\n1. strength of plaintiff's mark;\n\n2. relatedness of the goods;\n\n3. similarity of the marks;\n\n4. evidence of actual confusion;\n\n5. marketing channels used;\n\n6. likely degree of purchaser care;\n\n7. defendant's intent in selecting the mark;\n\n8. likelihood of expansion of the product lines.\n\nLandham v. Lewis Galoob Toys, Inc., 227 F.3d 619, 626-27 (6th Cir. 2000) (\"[These factors] 'imply no mathematical precision, and a plaintiff need not show that all, or even most of the factors listed are present in any particular case to be successful.'\") (quoting Wynn Oil Co. v. Thomas, 839 F.2d 1183, 1186 (6th Cir. 1988)); see also Polaroid Corp. v. Polarad Elecs. Corp., 287 F.2d 492, 495 (2d Cir. 1961) (espousing the eight-factor likelihood of confusion test).\n\nThe majority ignores this body of well established jurisprudence by holding that \"as a general rule, a person's image or likeness cannot function as a trademark.\" Indeed, if a plaintiff alleging infringement in the unregistered mark of his image or likeness in the product of another brings forth evidence of consumer confusion, then the image or likeness of the plaintiff may very well be functioning \"as a trademark\" for purposes of § 1125(a), see Rock \u0026 Roll Hall of Fame, 134 F.3d at 753, and a question of fact may be created as to whether the defendant's unauthorized use of the mark infringed on the plaintiff's rights. See Terrant Serv. Agency v. Am. Standard, Inc., 12 F.3d 609, 617 (6th Cir. 1993) (holding that evidence of consumer confusion established a question of fact for the jury on the plaintiff's trademark infringement and unfair competition claims).\n\nIn support of its sweeping holding, the majority relies in part upon Pirone v. MacMillan, Inc., 894 F.2d 579 (2d Cir. 1990); however, a close reading of Pirone does not support the majority's position but instead follows the long line of cases establishing that a plaintiff may succeed on a claim under § 1125(a) for infringement of the unregistered mark of his likeness or image by bringing forth evidence of consumer confusion. To illustrate, in Pirone the estate of the famous baseball player Babe Ruth brought suit against the manufacturer of a pocket calender bearing the photograph of Babe Ruth, among other famous baseball players, claiming trademark infringement under § 32 (registered mark) and § 43(a) (unregistered mark). See id. at 582. In discussing the plaintiff's claims made under § 43(a), the Second Circuit noted that claims under § 43(a) are broader than those made under § 32, inasmuch as they cover a broader array of violations. Id. The court went on to state that\n\nthe crucial determinant in an action for trademark infringement or unfair competition is whether there is any likelihood that an appreciable number of ordinarily prudent purchasers are likely to be misled, or indeed simply confused, as to the source of the goods in question. In order to be confused, a consumer need not believe that the Ruth estate actually produced the calender. The public's belief that the mark's owner sponsored or otherwise approved the use of the trademark satisfies the confusion requirement.\n\nId. at 584 (internal quotation marks and citations omitted; emphasis added). Because the plaintiff \"failed to present a material issue of fact on the question of likelihood of consumer confusion,\" the Second Circuit found that summary judgment on the plaintiff's § 43(a) claim was proper. Id. at 585. Thus, contrary to the majority's abbreviated discussion of Pirone, the Second Circuit did not find that the plaintiff's claim in that case failed because trademark rights cannot be established in the likeness of an individual; rather, the plaintiff's claim fell prey to the defendant's motion for summary judgment because no evidence of consumer confusion was presented to support the claim.\n\nThe majority also relies upon Rock \u0026 Roll Hall of Fame in support of its holding; however, as with Pirone, Rock \u0026 Roll Hall of Fame does not espouse the proposition that the majority claims. That is, contrary to the majority's implication here, the Court in Rock \u0026 Roll Hall of Fame did not conclude that the plaintiff's § 43(a) claim for trademark infringement of the Museum's building design failed because the Museum's image or design could not function as a trademark. Instead, the Court in Rock \u0026 Roll Hall of Fame held that the plaintiff's claim failed because there was no evidence of consumer confusion so as to demonstrate that the Museum's image had been used as a trademark. See 134 F.3d at 754. Indeed, the majority found the lack of evidence regarding consumer confusion to be \"pivotal\" in reaching its conclusion. Id.\n\nFinally, the majority cites to Estate of Elvis Presley v. Russen, 513 F. Supp. 1339 (D.N.J. 1981) in support of its holding that as a general rule a person's image or likeness cannot function as a trademark. As with the other cases upon which the majority relies, Presley does not stand for the proposition that a person's likeness or image cannot function as a trademark; rather, the Presley court found that \"the available evidence [did] not support\" the plaintiff's proposition that \"the likeness and image of Elvis Presley serve[d] as a service mark.\" Id. at 1363-64. In other words, if the plaintiff had proffered evidence to support its proposition, then its claim may very well have succeeded. Indeed, the court found that \"there [was] sufficient evidence in the record\" for the court to conclude that a certain image of Presley, coined by the court as the \"Elvis Pose,\" had acquired secondary meaning so as to be protectable as a service mark. Id. at 1365.\n\nSimply stated, contrary to the majority's contention, the jurisprudence clearly indicates that a person's image or likeness can function as a trademark as long as there is evidence demonstrating that the likeness or image was used as a trademark; which is to say, the image can function as a trademark as long as there is evidence of consumer confusion as to the source of the merchandise upon which the image appears. See, e.g., Rock \u0026 Roll, 134 F.3d at 753. And, significantly, in the matter at hand Plaintiff brought forth such evidence regarding the image of Woods portrayed in Rush's print by way of an affidavit from Dr. Carl Block, President and CEO of Marketeam Associates, a national marketing and research firm. Dr. Block stated that a survey had been conducted regarding the public's perception of Defendant's poster in relation to Tiger Woods. Based on the results of the survey, Dr. Block concluded that \"there is a high incidence of confusion among the relevant consuming universe concerning the affiliation, connection, approval or sponsorship between Tiger Woods and The Masters of Augusta print by Rick Rush\" such that \"there is an extremely high probability that members of the relevant consuming universe believe that Tiger Woods has an affiliation or connection with . . . the print.\" (J.A. at 311, Block Affidavit at ¶¶ 5-6.) Dr. Block also stated that the survey demonstrated that only 11% of respondents believed that Tiger Woods did not have an affiliation or connection with the poster, while fully 62% of respondents believed that Woods was affiliated or connected with the poster or had \"approv[ed] or sponsored it.\" (J.A. at 311, Block Aff. at ¶ 5.) Dr. Block characterized this as \"one of the highest incidences of confusion that Marketeam has ever recorded in such surveys regarding whether or not a likelihood of confusion exists in a trademark dispute.\" (J.A. at 211, Block Affidavit at ¶ 5.)\n\nInasmuch as Plaintiff proffered evidence of consumer confusion as to Woods' affiliation with or sponsorship of the poster, Plaintiff proffered evidence that it has used this image of Tiger Woods \"as a trademark.\" See Rock \u0026 Roll Hall of Fame, 134 F.3d at 753-54 (noting that in order to demonstrate that it used a designation as a trademark, \"the plaintiff must establish a likelihood that the defendant's designation will be confused with the plaintiff's trademark, such that consumers are mistakenly led to believe that the defendant's goods are produced or sponsored by the plaintiff\"); see also Restatement (Third) of Unfair Competition § 46 cmt. b, 537 (1995) (emphasis added) (\"[I]f the defendant's unauthorized use creates a false suggestion of endorsement or a likelihood of confusion as to source or sponsorship, liability may also be imposed for . . . trademark or trade name infringement.\"). Thus, the district court erred in failing to inquire further into Plaintiff's § 43(a) claims by conducting the eight-factor test, and Plaintiff should be provided the opportunity to have a jury decide whether its § 43(a) claims are viable. See Pirone, 894 F.2d at 584 (noting that the eight-factor test for likelihood of confusion is normally a factual question for the jury); see also Terrant Serv. Agency, 12 F.3d at 617 (holding that evidence of consumer confusion established a question of fact for the jury on the plaintiff's trademark infringement and unfair competition claims).\n\nWith that said, it is difficult to conceive how the majority arrives at its conclusion that Plaintiff \"does not claim that a particular photograph of Woods has been consistently used on specific goods\" but instead makes \"a sweeping claim to trademark rights in every photograph and image of Woods.\" As indicated in the outset of this discussion, Plaintiff's complaint specifically takes issue with the image of Woods as depicted in Rush's Masters of Augusta print and, moreover, Plaintiff has come forward with strong evidence of consumer confusion to support its claim that this image of Woods has been used as a trademark for purposes of supporting its § 43(a) claim. The majority's failure to acknowledge the significance of this evidence constitutes a fatal flaw in its analysis because it is settled that \"if the defendant's unauthorized use creates a false suggestion of endorsement or a likelihood of confusion as to source or sponsorship, liability may also be imposed for . . . trademark or trade name infringement.\" Restatement (Third) of Unfair Competition § 46 cmt. b, 537 (1995) (emphasis added); see also Bird, 289 F.3d at 877 (noting that \"the key question in cases where a plaintiff alleges trademark infringement and unfair competition is whether the defendant's actions create a likelihood of confusion as to the origin of the parties' goods or services\").\n\nFinally, as explained in the next section, even by adopting the Second Circuit's balancing approach when considering a Lanham Act claim involving an artistic expression, Plaintiff's likelihood of confusion evidence should, and indeed must, be considered in deciding Plaintiff's claim for infringement of the unregistered mark. As the Second Circuit has also proclaimed, \"[t]rademark protection is not lost simply because the alleging infringing use is in connection with an artistic expression.\" Cliffs Notes, Inc. v. Bantam Doubleday Dell Publ'g Group, Inc., 886 F.2d 490, 493 (2d Cir. 1989) (alteration in Cliffs Notes) (quoting Silverman v. CBS Inc., 870 F.2d 40, 49 (2d Cir. 1989)).\n\nII. Lanham Act Unfair Competition \u0026 False Endorsement Claims--§ 1125(a)\n\nRegarding Plaintiff's claim for false endorsement, the majority concludes that \"where the defendant has articulated a colorable claim that the use of a celebrity's identity is protected by the First Amendment, the likelihood of confusion test is not appropriate because it fails to adequately consider the interests protected by the First Amendment.\" In support of this conclusion, the majority relies upon the Second Circuit's decision in Rogers v. Grimaldi, 875 F.2d 994 (2d Cir. 1989) and Mattel, Inc. v. MCA Records, Inc., 296 F.3d 894 (9th Cir. 2002), and ultimately holds that under these cases, the Lanham Act is not applicable to Plaintiff's claim, thus obviating the need to address Plaintiff's evidence of consumer confusion. The majority misapplies the test set forth and applied in these cases, and thus reaches an erroneous result.\n\nThis dissent focuses on the majority's misapplication of the Rogers balancing test and resulting erroneous conclusion; however, this dissent should not be interpreted as endorsing the application of the Rogers test to the facts of this case. Rather, the point made by the dissent is that even under the Rogers standard, questions of fact remain precluding summary judgment. This dissent also emphasizes that even relying solely on the eight-factor likelihood of confusion test as the district court did below--i.e., not employing any balancing test--questions of fact remain for trial on Plaintiff's § 43(a) claims inasmuch as there is evidence on the record of consumer confusion as to Woods' sponsorship of Rush's print, evidence that Woods has used the image portrayed in the print as a trademark, and evidence that, as a celebrity, Woods has property rights in his name and image. See, e.g., Parks v. LaFace Records, 329 F.3d 437, 447 \u0026 n.3 (6th Cir. 2003); Rock \u0026 Roll, 134 F.3d at 753.\n\nThis Court applied Rogers for the first time in Parks v. LaFace Records, 329 F.3d at 448, which was a trademark case involving \"a dispute over the name of a song.\" In doing so, the Court specifically stated that it found the standard set forth in Rogers and its progeny to be the \"best test\" of those available \"for balancing Defendants' and the public's interest in free expression under the First Amendment against Parks' and the public's interest in enforcement of the Lanham Act\" as to \"the facts before [it].\" Id. at 451-52. In other words, in Parks this Court applied the Rogers test for the first time in this circuit, but the Court limited the application to the facts of that case, which involved a song title. Id. at 458 (stating the application of the second prong of the Rogers test \"in the context of using a celebrity's name in the title of some artistic work\"). Contrary to the assertions made by the majority in this case, the Parks court did not, as the majority does here, adopt Rogers wholesale as the law of this circuit in any trademark dispute involving an artistic expression. Rather, Parks applied Rogers \"to the facts before [it]\" where like Rogers, Parks involved a title. Id. at 452.\n\nIn Rogers and later in Mattel, the Second Circuit and the Ninth Circuit, respectively, were faced with § 1125(a) false endorsement claims as they specifically related to titles. As explained by the Rogers court, the fact that the claims were brought as to titles was significant in determining the scope of the Lanham Act to be applied. That is, in analyzing the challenge brought by the actress Ginger Rogers to the film entitled Ginger and Fred, the Second Circuit recognized that although\n\nFirst Amendment concerns do not insulate titles of artistic works from all Lanham Act claims, such concerns must nonetheless inform our consideration of the scope of the Act as applied to claims involving such titles. Titles, like the artistic works they identify, are of a hybrid nature, combining artistic expression and commercial promotion. The title of a movie may be both an integral element of the film-maker's expression as well as a significant means of marketing the film to the public. The artistic and commercial elements of titles are inextricably intertwined. Film-makers and authors frequently rely on word-play, ambiguity, irony, and allusion in titling their works. Furthermore, their interest in freedom of artistic expression is shared by their audience. The subtleties of a title can enrich a reader's or a viewer's understanding of a work. Consumers of artistic works thus have a dual interest: They have an interest in not being misled and they also have an interest in enjoying the results of the author's freedom of expression. For all of these reasons, the expressive element of titles requires more protection than the labeling of ordinary commercial products.\n\nRogers, 875 F.2d at 998 (emphasis added).\n\nUpon recognizing the specific nature of titles as they relate to protection under the Lanham Act, the Second Circuit addressed Rogers' contention that First Amendment concerns were implicated only where a title is so intimately related to the subject matter of a work that the author has no alternative means of expressing what the work is about. Id. The Second Circuit found that the \"no alternative avenues\" test \"d[id] not sufficiently accommodate the public's interest in free expression,\" but also found that the district court's rule \"that the Lanham Act [was] inapplicable to all titles that can be considered artistic expression[,] d[id] not sufficiently protect the public against flagrant deception.\" Id. at 999. As a result, the court crafted a balancing test and opined that \"[w]e believe that in general the Act should be construed to apply to artistic works only where the public interest in avoiding consumer confusion outweighs the public interest in free expression.\" Id.\n\nIn applying this test to Rogers' claim, the Second Circuit first noted that the title \"Ginger and Fred\" contained \"no explicit indication that Rogers [had] endorsed the film or had a role in producing it.\" Id. at 1001. The court went on to note that the survey evidence adduced by Rogers, even if validly assumed, \"indicate[d] at most that some members of the public would draw the incorrect inference that Rogers had some involvement with the film[;]\" however, \"that risk of misunderstanding, not engendered by any overt claim in the title, [was] so outweighed by the interests in artistic expression as to preclude application of the Lanham Act.\" Id. Thus, the court held that \"the sponsorship and endorsement aspects of Rogers' Lanham Act claim [for false endorsement] raise[d] no 'genuine' issue that requires submission to the jury.\" Id.\n\nThe majority in the case at hand recognizes that the Second Circuit affirmed the district court's grant of summary judgment to Rogers, and also recognizes that the court considered Rogers' survey evidence when seeking to strike the appropriate balance between the public interest in not being mislead and the public's interest in free expression for purposes of determining whether summary judgment was proper. However, in applying the Rogers balancing test to facts if this case, the majority fails to consider Plaintiff's survey evidence of consumer confusion and fails to do so under the scope of the Lanham Act relevant to the artistic work at issue.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Instead, without any meaningful consideration whatsoever of Plaintiff's survey evidence, or for that matter any meaningful explanation of why Rush's print has artistic relevance for purposes of conducting a balancing of interests of any significance, the majority simply concludes that \"the presence of Woods' image in Rush's painting The Masters Of Augusta does have artistic relevance to the underlying work and that it does not explicitly mislead as to the source of the work.\" Indeed, this is not the approach taken by the Second Circuit in Rogers, where the court specifically considered the survey evidence, and did so as to the specific form in which the false endorsement was made--a title to a motion picture, and found that although a factual dispute existed, it was not \"genuine\" for purposes of surviving summary judgment. See Rogers, 875 F.2d at 1001.\n\nIn response to this dissent, the majority merely set forth a single paragraph to its opinion claiming to take into account evidence of actual consumer confusion as balanced against Rush's \"artistic expression\" for purposes of concluding that the risk of consumer misunderstanding is so outweighed by the interest in artistic expression that application of the Act is \"precluded.\" This single two-sentence paragraph fails to engage in any meaningful analysis of the balancing of the interests at hand, and particularly fails to account for the role of the eight-factor test in the Rogers balancing test. A significant inquiry into both prongs of the Rogers test is necessary when attempting to strike the appropriate balancing of interests, especially at the summary judgment stage, because questions of fact may be inappropriately decided in the absence any meaningful inquiry. See, e.g. Parks, 329 F.3d at 459 (remanding the case where issues of fact remained for trial as to the first prong, \"the artistic relevance prong,\" of the Rogers test). Indeed, this Court remanded the case in Parks because questions of fact remained for trial as to the first prong of the Rogers test thus preventing the Court from balancing any interests as a matter of law at summary judgment. Id.\n\nThe majority's contention that this case is like Rogers because the survey evidence merely indicates that some members of the public would draw the incorrect inference that Woods had some connection with Rush's print fails to account for the differences in the type of survey evidence in this case as opposed to that in Rogers. In Rogers the survey evidence indicated that only about 14% of the consumers polled indicated that Ginger Rogers was \"involved in any way with making the film[;]\" however, in this case, 62% of the consumers polled indicated that they believed that Woods had an \"affiliation\" or \"connection\" with Rush's print, or \"approved\" or \"sponsored\" the print. See 875 F.2d at 1001 n.8. And of particular significance, the Rogers court found that such survey evidence failed to create a genuine issue of fact for the jury. Here, on the other hand, considering the stark difference in actual consumer confusion between this case and Rogers, a genuine issue of fact has been demonstrated for purposes of allowing this matter to proceed. See Anderson v. Liberty Lobby, Inc., 477 U.S. 242, 251-52 (1986) (noting that an issue of fact is \"genuine\" if the evidence is such that a reasonable jury could return a verdict for the non-movant). The majority's misleading and wholesale use of language from Rogers cannot serve to compel the outcome it argues for where the evidence and the facts involved differ so significantly.\n\nAs in Rogers, the artistic expression at issue in Mattel, the case from the Ninth Circuit relied upon by the majority, involved a title. See Mattel, 296 F.3d at 898. Specifically, the plaintiff, Mattel, Inc., creator of the Barbie doll, filed suit against MCA Records, Inc., along with others who produced, marketed, and sold the song \"Barbie Girl,\" alleging trademark infringement, among other things. In addressing the plaintiff's claim, the Ninth Circuit first noted that \"[o]ur likelihood-of-confusion test generally strikes a comfortable balance between the trademark owner's property rights and the public's expressive interests.\" Id. at 900 (citation omitted). However, the court went on to recognize that \"when a trademark owner asserts a right to control how we express ourselves-- when we'd find it difficult to describe the product any other way (as in the case of aspirin), or when the mark (like Rolls Royce) has taken on an expressive meaning apart from its source-identifying function--applying the traditional test fails to account for the full weight of the public's interest in free expression.\" Id. Said differently, \"the trademark owner does not have the right to control public discourse whenever the public imbues his mark with a meaning beyond its source-identifying function.\" Id. (citation omitted).\n\nWith this in mind, the Mattel court then looked to Rogers and the Second Circuit's analysis therein. Mattel, 296 F.3d at 901. The Ninth Circuit noted that the result in Rogers may have been different if, for example, \"a pair of dancing shoes had been labeled Ginger and Fred, [because] a dancer might have suspected that Rogers was associated with the shoes (or at least one of them), just as Michael Jordan has endorsed Nike sneakers that claim to fly through the air.\" Id. \"But,\" the court went on to note, \"Ginger and Fred was not a brand of shoe; it was the title of a movie and, for the reasons explained by the Second Circuit, deserved to be treated differently.\" Id. at 901-02. Thus, the court expressly noted the nature of the artistic expression, a title, and adopted the Rogers standard that \"literary titles do not violate the Lanham Act 'unless the title has no artistic relevance to the underlying work whatsoever, or, if it has some artistic relevance, unless the title explicitly misleads as to the source or the content of the work.'\" Id. at 902 (quoting Rogers, 875 F.2d at 999 (footnote omitted)). In concluding that \"MCA's use of Barbie [was] not an infringement of Mattel's trademark[,]\" through the application of the Rogers balancing test, the court expressly found that \"[t]he song title does not explicitly mislead as to source of the work; it does not, explicitly or otherwise, suggest that it was produced by Mattel. The only indication that Mattel might be associated with the song is the use of Barbie in the title; if this were enough to satisfy [the second] prong of the Rogers test, it would render Rogers a nullity.\" Id. (emphasis in Mattel).\n\nAs indicated, the majority in the instant case relies in part upon Mattel when concluding that Plaintiff's false endorsement claim fails because the presence of Woods' image in Rush's print has artistic relevance and does not explicitly mislead under the Rogers balancing test. However, the majority fails to consider the distinction set forth in Mattel--that the result in Rogers may have been different if, for example, \"a pair of dancing shoes had been labeled Ginger and Fred, [because] a dancer might have suspected that Rogers was associated with the shoes (or at least one of them), just as Michael Jordan has endorsed Nike sneakers that claim to fly through the air.\" Id. Indeed, the image of Woods holding his famous golf swing at the Masters, as nearly precisely portrayed in the poster sold by Nike by way of Plaintiff's authorization, may have mislead a sports enthusiast or golfer to believe that Woods was associated with Rush's print. And the survey evidence strongly indicates that such is the case. (J.A. at 311, Block Affidavit at ¶¶ 5-6.) (\"[T]here is an extremely high probability that members of the relevant consuming universe believe that Tiger Woods has an affiliation or connection with . . . the print.\"). As a result, this case is distinguishable from Mattel because Plaintiff has brought forth evidence of a high degree of consumer confusion.\n\nIn response to this dissent, the majority added what appears as footnote 11 of its opinion stating, among other things, that it fails to see the significance of the comment made in Mattel that the result in Rogers may have been different if a pair of dancing shoes had been labeled Ginger and Fred, inasmuch as \"Woods's image in Rush's print is not used to identify a product.\" The \"product\" in this case is Rush's print, and Rush prominently depicts Woods holding his swing at the Masters Tournament in the print, entitled The Masters of Augusta, such that the evidence indicates that consumers believe that Woods sponsored or approved of the print.\n\nWhile it is true that Rogers and Mattel employ a balancing test as opposed to the traditional eight-factor likelihood of confusion test set forth for trademark and unfair competition claims, these cases do not stand for the proposition that evidence of consumer confusion should be totally ignored in seeking to strike the appropriate balance between the public interest in free expression and the public interest in not being mislead. The Rogers court considered the survey evidence in striking the appropriate balance in that case, and thus the survey evidence should have been considered by the majority in this case, particularly where the expression at issue involves not just a title with no apparent connection to the product, but rather the total persona and embodiment of Woods in a pose closely associated with his status as a famous golfer which has been sold for commercial gain in the past. See Rogers, 875 F.2d at 1001 (concluding that the survey evidence did not raise a \"genuine\" issue of material fact for trial as to the plaintiff's false endorsement claim, particularly where the \"title 'Ginger and Fred' contain[ed] no explicit indication that Rogers endorsed the film or had a role in producing it); see also Mattel, 296 F.3d at 902 (holding that summary judgment in favor of the defendants was appropriate because the \"only indication that Mattel might be associated with the song [was] the use of Barbie in the title\"--i.e., there was no evidence of likelihood of confusion) (emphasis in original).\n\nThe majority's failure to meaningfully consider Plaintiff's survey evidence is especially questionable in light of its citation and reliance upon Cliffs Notes, Inc. v. Bantam Doubleday Dell Publishing Group, Inc., 886 F.2d 490 (2d Cir. 1989). The Second Circuit decided Cliffs Notes shortly after deciding Rogers and, while recognizing that Rogers specifically involved a challenge to a title, found that the Rogers balancing test nonetheless applied to the parody at issue. Id. at 495. The court held that \"the Rogers balancing approach is generally applicable to Lanham Act claims against works of artistic expression, a category that includes parody. This approach takes into account the ultimate test in trademark law, namely, the likelihood of confusion as to source of the goods in question.\" Id. (citations and internal quotation marks omitted; emphasis added). In a footnote, the court explained that where the challenged work is one involving artistic expression, \"the Polaroid factors [the eight-factor test] should be applied with proper weight given to First Amendment considerations . . . .\" Id. at 495 n.3. In other words, in Cliffs Notes the Second Circuit made clear that when applying the Rogers balancing test--weighing the public interest in avoiding consumer confusion against the public interest in free expression-- the eight-factor likelihood of confusion test and the evidence associated therewith, is to be considered in the balance when determining the weight to be afforded the public interest in avoiding consumer confusion. See id. at 495 \u0026 n.3.\n\nThe majority claims in footnote 12 of its opinion that the dissent's \"insistence on applying the likelihood of confusion test appears untenable in light of Parks.\" However, in light of the Second Circuit's instruction in Cliffs Notes, that evidence associated with the eight-factor likelihood of confusion test is to be considered when determining the public interest in avoiding consumer confusion under the Rogers balancing test, it is the majority's \"insistence\" in rejecting evidence of consumer confusion that \"appears untenable.\" See Cliffs Notes, 886 F.2d at 495 n.3. And, in light of the express language of Parks, the majority's position not only \"appears untenable\" but is completely unfounded. The Parks court recognized that Rogers qualified its holding in stating that \"if the title of the work is artistically relevant to its content, there is no violation of the Lanham Act unless the 'title explicitly misleads as to the source of or the content of the work.'\" Parks, 329 F.3d at 458 (quoting Rogers, 875 F.2d at 999) (emphasis in Parks). Thus, Parks acknowledged that evidence of the likelihood of confusion must be considered for purposes of determining whether the expression at issue misleads the public as to the source of the work. See id. If the evidence establishes that the expression misleads the public as to the source of the work, then the balance likely weighs against the public interest in free expression. Id. Simply stated, in order to conduct any type of meaningful balance, the Court must consider evidence under both prongs of the Rogers test, and evidence of the likelihood of confusion as set forth in the eight-factor test is to be considered under the \"misleading prong,\" as characterized by Parks. See id.; see also Cliffs Notes, 886 F.2d at 495 n.3.\n\nIn the matter at hand, however, the majority completely eschews the eight-factor test and the evidence associated therewith when applying the Rogers balancing test. Thus, even if the majority is correct in its decision to broadly adopt the Rogers balancing test as the law of this circuit in any case where a false endorsement or trademark claim is made against a work involving an artistic expression, the majority erroneously applies the balancing test by simply abandoning the considerations and evidence associated with the eight-factor likelihood of confusion test. In other words, the majority's approach in this case not only adopts a standard that has never been used in this fashion by our circuit, but misapplies the standard, thereby leaving this circuit without proper guidance. As indicated, supra, the majority's single-sentence attempt at balancing of the interests falls woefully short of any meaningful consideration of the matter.\n\nEven under the Rogers standard, it is necessary for this case to be remanded on the issue of Plaintiff's false endorsement claim since questions of fact remain as to the degree of consumer confusion associated with Rush's print and Woods' endorsement thereof. To hold otherwise not only runs counter to the approach espoused in Rogers and its progeny, but to the express word of Congress: that a plaintiff may prevail on a Lanham Act claim if he can prove that the use in commerce of the trademark \"in connection with goods or services\" is \"likely to cause confusion, to cause mistake, or to deceive as to the affiliation, connection, or association of such person with another person, or as to the origin, sponsorship, or approval of his or her goods, services, or commercial activities by another person . . . .\" 15 U.S.C. § 1125(a)(1)(A) (emphasis added). This is not to say that the ultimate outcome here would necessarily be a favorable one for Plaintiff; however, a jury should be able to make that decision after hearing all of the evidence presented by Plaintiff, as opposed to the majority's truncated and abbreviated approach which fails to engage in any meaningful consideration of pertinent and relevant evidence of consumer confusion, and fails to engage in any significant balancing of the interests.\n\nIII. Trademark Claims Based on the Unauthorized Use of the Registered Mark--§ 32 of the Lanham Act, 15 U.S.C. § 1114\n\nPlaintiff brought suit against Defendant under § 32 for infringement of Plaintiff's registered mark, \"TIGER WOODS.\" The mark appears on the back of the envelope containing Rush's print as well as in the narrative description of the print. The district court found that because Plaintiff failed to demonstrate that Defendant's image of Woods was an infringing use, Defendant's use of the registered mark amounted to a \"fair use\" under 15 U.S.C. § 1115(b). The majority makes a similar conclusion that Defendant's use of the registered mark amounts to a fair use, but does so on the basis that the work upon which the registered mark appears or accompanies is an artistic expression. Whether following the reasoning of the district court or the majority, the result is shortsighted because it assumes that the underlying work upon which the registered mark appears is not an infringing use.\n\nAs explained in the above sections, Plaintiff brought forth evidence of actual consumer confusion in this case sufficient to create a genuine issue of material fact for trial as to whether the prints upon which the registered mark appears or accompanies is an infringing use of the unregistered mark under § 43(a). Indeed, the fatal flaw in the majority's outcome as to Plaintiff's claims brought under § 43(a) is its failure to consider the evidence of actual consumer confusion proffered by Plaintiff, or any of the other factors looked to when determining consumer confusion. Thus, to conclude that Defendant's use of the registered mark is a fair use because the underlying work is not an infringing use is erroneous. Contrary to the majority's contention in footnote 4 of its opinion, this dissent does not \"misunderstand\" the majority's holding that Plaintiff's claim on this issue fails because Defendant's use of the registered mark was a fair use. The point made here is that the majority erroneously bases its fair use holding on its contention that the item upon which the mark appears, Rush's print, is not itself an infringing use.\n\nThe proper approach is to look at Defendant's use of the registered mark in the context of evidence of consumer confusion in order to determine whether the fair use doctrine can be applicable. See Paccar Inc. v. TeleScan Techs., L.L.C., 319 F.3d 243, 255-56 (6th Cir. 2003) (noting that \"a finding of a likelihood of confusion forecloses a fair use defense\") (citations omitted). Once again, the majority fails to engage in any meaningful inquiry into consumer confusion and instead simply concludes that because Defendant's print is an artistic expression, the use of the registered mark in association therewith constitutes a permissible fair use under the Act. This approach is in contravention to the application of the fair use doctrine and § 32 of the Act. See id. at 249, 255-56.\n\nThus, as with Plaintiff's claims brought under § 43(a) for infringement of the unregistered mark, the jury should be allowed to hear evidence as to the eight factors employed when ascertaining a likelihood of consumer confusion, and this is true even if a balancing approach is used. See, e.g., Rogers, 875 F.2d at 999. Furthermore, even assuming the majority to be correct in its notation that Plaintiff's survey evidence of actual confusion was limited to the print itself and not the envelope or narrative accompanying the print, thus apparently leaving the fourth factor without evidentiary support, this still does nothing to change the fact that the remaining factors should be looked to for a proper determination of whether consumer confusion exists. See Wynn Oil Co. v. Am. Way Serv. Corp., 943 F.2d 595, 604 (6th Cir. 1991) (finding that a lack of actual consumer confusion is not fatal to a § 32 claim where the remaining factors as a whole demonstrated consumer confusion). It should be pointed out that the majority's contention, as set forth in footnote 4 of its opinion, that the dissent inappropriately discusses evidence of actual consumer confusion in reference to Plaintiff's claim for infringement of the registered mark, is baffling and simply wrong. The point being made here is that even assuming the that the evidence of actual consumer confusion does not apply to Plaintiff's claim under § 32, this does nothing to change the fact that the other seven factors specific to the likelihood of confusion test should be examined, particularly at the summary judgment stage. See id.\n\nIV. Dilution of the Mark under 15 U.S.C. § 1125\n\nIn Count II of its amended complaint, Plaintiff alleged dilution of the registered mark \"TIGER WOODS\" in violation of section 43(c) of the Act, 15 U.S.C. § 1125(c). The district court failed to engage in any independent analysis of Plaintiff's dilution claim, and instead simply found that the dilution claim fell prey to summary judgment for the same reasons that Plaintiff's trademark claims fell prey to summary judgment. See ETW Corp. v. Jireh Publ'g, Inc., 99 F.Supp.2d 829, 834 (N.D. Ohio 2000). The majority likewise fails to engage in any independent analysis and simply concludes in footnote 7 of its opinion that \"since Woods's likeness does not function as a trademark which is subject to protection under the Lanham Act, it follows that a dilution claim does not lie.\" Aside from its erroneous conclusion that Plaintiff has not brought forth evidence that Woods' image as portrayed in the print functions as a trademark, the majority's conclusion in this regard is perplexing and legally incorrect inasmuch as Plaintiff based its dilution claim on the registered trademark. In addition, although it is true that \"fair use\" of a registered mark precludes an action for dilution under 15 U.S.C. § 1125(c)(4)(A), as stated in Part III of this dissent, the majority erroneously concludes that Defendant's use of the registered mark is a \"fair use\" inasmuch as the majority completely fails to consider evidence of consumer confusion. Thus, the majority's \"short shrift given to [Plaintiff's] dilution claim[ ]\" cannot carry the day. Kellogg Co. v. Exxon Corp., 209 F.3d 562, 576 (6th Cir. 2000); see also Moseley v. V Secret Catalogue, Inc., 537 U.S. 418, 123 S. Ct. 1115, 1119-122 (2003) (finding that a claim for dilution may stand even though the plaintiff's claim for trademark infringement was not successful).\n\nThe Lanham Act, as amended by the Federal Trademark Dilution Act of 1995, defines the term \"dilution\" as \"the lessening of the capacity of a famous mark to identify and distinguish goods or services, regardless of the presence or absence of--(1) competition between the owner of the famous mark and other parties, or (2) likelihood of confusion, mistake, or deception.\" 15 U.S.C. § 1127 (emphasis added). This Court has identified factors that a plaintiff must fulfill in order to succeed on a federal dilution claim, \"'(1) the senior mark must be famous; (2) it must be distinctive; (3) the junior use must be a commercial use in commerce; (4) it must begin after the senior mark has become famous; and (5) it must cause dilution of the distinctive quality of the senior mark.'\" Kellogg, 209 F.3d at 577 (quoting Nabisco, Inc. v. PF Brands, Inc., 191 F.3d 208, 215 (2d Cir. 1999)). The Supreme Court recently made clear that in order to demonstrate dilution, the plaintiff must proffer objective evidence of actual dilution, \"but that does not mean that the consequences of dilution, such as actual loss of sales or profits, must also be proved.\" Moseley, 123 S. Ct. at 1124. Inasmuch as Plaintiff in the case at hand has brought forward evidence on each of these five elements of a federal dilution claim, the jury should be allowed to consider this claim as well.\n\nV. Ohio Common Law Right of Publicity Claim\n\nThe majority makes a somewhat disjointed holding regarding Plaintiff's right of publicity claim. It first concludes that, under the rule of the Restatement, \"Rush's work has substantial informational and creative content which outweighs any adverse effect on ETW's [Plaintiff's] market and the Rush's work does not violate Woods's right of publicity.\" Then, the majority appears to engage in a separate analysis or balancing of the interests under the law of various circuits when it takes into account the degree of First Amendment protection that should be afforded Rush's print against Woods' \"intellectual property right\" in order to conclude that \"[p]ermitting Woods' right of publicity to trump Rush's right of freedom of expression would extinguish Rush's right to profit from his creative enterprise.\" Finally, engaging in yet a separate analysis under the \"transformative effects test\" pronounced by the California Supreme Court, the majority concludes that \"[b]ecause Rush's work has substantial transformative elements, it is entitled to the full protection of the First Amendment. In this case, we find that Woods's right of publicity must yield to the First Amendment.\" Thus, it appears that the majority engages in three separate analyses, and arrives at three separate holdings, although all of which reach the same result.\n\nThe majority's analysis not only fails in its disjointed approach but in its outcome as well. The approach best suited for addressing Plaintiff's right of publicity claim in this case is that taken by the California Supreme Court in Comedy III Productions v. Gary Saderup, Inc., 21 P.3d 797 (Cal. 2001). This is so because the Court in Comedy III took account of a celebrity's right of publicity and the principles of the right in general, as balanced against competing First Amendment concerns, in arriving at a test for purposes of adjudicating a case that is nearly on all fours with the matter at hand. This approach takes into account all of the competing interests while allowing for a single well-determined outcome that provides guidance and adds to the jurisprudence as a whole. Before applying the Comedy III approach to the facts of this case, it is useful to review the background of the birth of the right of publicity, the considerations embodied in the right, and the competing First Amendment interests in freedom of expression.\n\nA. Background of the Right of Publicity\n\nThe right of publicity was born out of the common law right to privacy \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e when Circuit Judge Jerome Frank explicitly recognized the right of publicity as an independent action in Haelan Laboratories, Inc. v. Topps Chewing Gum, 202 F.2d 866, 868 (2d Cir. 1953). There, Judge Frank opined that\n\nin addition to and independent of that right of privacy . . . , a man has a right in the publicity value of his photograph, i.e., the right to grant the exclusive privilege of publishing his picture, and that such a grant may validly be made 'in gross,' i.e., without an accompanying transfer of a business or of anything else. Whether it be labelled a 'property' right is immaterial; for here, as often elsewhere, the tag 'property' simply symbolizes the fact that courts enforce a claim which has pecuniary worth.\n\nThis right might be called a 'right of publicity.' For it is common knowledge that many prominent persons (especially actors and ball-players), far from having their feelings bruised through public exposure of their likenesses, would feel sorely deprived if they no longer received money for authorizing advertisements, popularizing their countenances, displayed in newspapers, magazines, busses, trains and subways. The right of publicity would usually yield them no money unless it could be made the subject of an exclusive grant which barred any other advertiser from using their pictures.\n\nId.; see also Restatement (Third) of Unfair Competition § 46 cmt. b, 529 (1995) (noting the origins behind the right of publicity, and the historical connection between publicity rights and the right to privacy). Up until the time that Judge Frank labeled what he viewed as the right to control commercial use of human identity as the \"right of publicity,\" the law \"seemed unable to accommodate the claims of those whose identity was already public\"--i.e, the famous. See McCarthy, The Rights of Publicity and Privacy § 1:7 (2d ed. 2000). In other words, until the right of publicity was recognized, it appeared counterintuitive for a famous individual to base his claim that his identity was being used commercially without permission on the right of privacy. The right to privacy is premised upon the right to \"left alone,\" and the famous person had already become well known commercially. However, it was the commercial nature of the person's identity which was precisely at issue; that is, it was not the desire to be left alone, but the desire to control the use of and be compensated for the use of one's persona. See id. And \"thus was born the concept of a property right in the commercial value of every person's identity.\" Id. (emphasis in original)\n\nAlthough the right of publicity grew out of the right of privacy, the right of publicity has within it characteristics of other rights such that it has been described as a \"'sui generis mixture of personal rights, property rights, and rights under unfair competition.'\" See id. (quoting S. J. Hoffman, Limitations on the Right of Publicity, 28 Bull. Copyright Soc'y 111, 112 (1980)). In addition, principles from various other areas of the law have been looked to and borrowed from when deciding right of publicity matters such as the law of copyright, trademark, and misappropriation. See id. Because of its inception in the law of privacy, and because of the various legal principles from other areas incorporated within it, the right of publicity remains a cause of action wherein the law is far from settled.\n\nThat notwithstanding, since Haelan, \"[t]he right of a person, whether or not termed 'right of publicity,' to control the commercial value and exploitation of his or her name and likeness has received wide recognition by the courts.\" Estate of Elvis Presley v. Russen, 513 F. Supp. 1339, 1353 n.6 (D. N.J. 1981) (collecting cases). This Court has spoken on the right of publicity as follows:\n\nThe right of publicity has developed to protect the commercial interest of celebrities in their identities. The theory of the right is that a celebrity's identity can be valuable in the promotion of products, and the celebrity has an interest that may be protected from the unauthorized commercial exploitation of that identity. In Memphis Development Foundation v. Factors Etc., Inc., 616 F.2d 956 (6th Cir. 1980), we stated: \"The famous have an exclusive legal right during life to control and profit from the commercial use of their name and personality.\" Id. at 957.\n\nCarson v. Here's Johnny Portable Toilets, Inc., 698 F.2d 831, 835 (6th Cir. 1983) (analyzing right to publicity claim brought under Michigan common law). However, it should also be noted that other courts and commentators as well have found that \"non-celebrities should also be permitted to recover upon proof that the appropriated identity possessed commercial value.\" Restatement, supra § 46 cmt. d, 538; see McCarthy, supra § 4:3 (\"[T]he basic possession of a right of publicity should have nothing to do with 'celebrity' status. Rather, 'celebrity' status will only be relevant to the economic value of a plaintiff's identity and persona.\") (footnote omitted); Roberta Rosenthal Kwall, The Right of Publicity vs. The First Amendment: A Property and Liability Rule Analysis, 70 Ind. L.J. 47, 55-56 (1994) (noting that \"the right of publicity has the potential for safeguarding from unauthorized use any marketable and publicly recognizable attribute of any individual, regardless of whether that person is a celebrity\") (footnote omitted); see also Vinci v. Am. Can Co., 459 N.E.2d 507, 510 (Ohio 1984) (finding that \"the degree of notoriety\" is relevant to damages rather than liability).\n\nAt the present time, a majority of states recognize a right of publicity through common law, by statute, or both. See McCarthy, supra § 6:3 (noting that \"at the time of this writing, under either statute or common law, the right of publicity is recognized as the law of twenty-eight states\"); Restatement, supra § 46 statutory note (listing California, Florida, Kentucky, Massachusetts, Nebraska, Nevada, New York, Oklahoma, Rhode Island, Tennessee, Texas, Virginia, and Wisconsin as those states recognizing a statutory right of publicity). Ohio recognizes the right of publicity as a part of the state's common law, see Zacchini v. Scripps-Howard Broad. Co., 351 N.E.2d 454 (Ohio 1976), rev'd on other grounds, 433 U.S. 562, 572 (1977), and has recently codified that right.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e See Ohio Rev. Code § 2741.01 and § 2741.02 (defining \"persona\" to mean \"an individual's name, voice, signature, photograph, image, likeness, or distinctive appearance, if any of these aspects have commercial \"value;\" and making the unauthorized use of an individual's persona for a commercial purpose during the individual's lifetime or for a period of sixty years after the individual's death, a violation of the statute).\n\nAlthough the wide recognition of the right of publicity among the states is a clear indication of its acceptance in the jurisprudence of society today, the differences between the various state statutes has led to confusion such that there is a large body of opinion advocating that a uniform preemptive federal law be adopted. See Symposium, Rights of Publicity: An In-Depth Analysis of the New Legislative Proposal to Congress, 16 Cardozo Arts \u0026 Ent. L.J. 209, 210 (1998) (\"[O]ur Task Force has . . . initiated a discussion aimed at producing its own federal right of publicity statute . . . . The subcommittee generally believes that a uniform body of law is desirable in this area, compared to the patchwork quilt with which the people of the United States are now afflicted.\")(comments of Steven M. Getzoff, then Chair of the American Bar Association Joint Task Force on federalizing the right of publicity); see also Alice Haemmerli, Whose Who? The Case for a Kantian Right of Publicity, 49 Duke L.J. 383, 477 (1999) (recognizing that \"[t]here appears to be a general consensus that a uniform right of publicity is sorely needed,\" and that \"[i]t also appears that most advocates of uniformity believe that preemptive federal law, rather than a uniform code or model state statutes, would more readily achieve that goal\").\n\nAside from the confusing development of the right of publicity, and aside from the many differences associated with the various state statutes in effect, the point of confusion most associated with the right of publicity law is its interplay with the First Amendment. Each doctrine advances its own set of societal interests which often are in tension with one another. Those societal interests advanced by the right of publicity have been suggested to be that of \"fostering creativity, safeguarding the individual's enjoyment of the fruits of her labors, preventing consumer deception, and preventing unjust enrichment.\" Roberta Rosenthal Kwall, The Right of Publicity vs. The First Amendment: A Property and Liability Rule Analysis, 70 Ind. L.J. 47, 54 (1994) (footnotes omitted); see also Michael Madow, Private Ownership of Public Image: Popular Culture and Publicity Rights, 81 Calif. L. Rev. 127, 178-79 (1993) (suggesting that the \"main justifications\" for the right of publicity are \"moral arguments\" (the right of individuals to reap the fruits of their labors); \"economic arguments\" (needed incentive to stimulate creative growth); and \"consumer protection\" (protects consumers from deception and related marketplace harms). Two of the most frequently cited justifications for First Amendment free speech guarantees in this regard are the advancement of knowledge and search for the truth by fostering a free marketplace of ideas necessary to a democratic society, as well as the fulfillment of the human need for self-expression. Id. at 65-66. The tension between these interests is self-evident: while we want a free marketplace of ideas and expression, we wish to insure that any commercial value gained from that expression is not unjustly obtained through another's labors. See Zacchini, 433 U.S. at 576 (\"No social purpose is served by having the defendant [in a right of publicity case] get free some aspect of the plaintiff that would have market value and for which he would normally pay.\").\n\nMeasures aimed at striking the appropriate balance between these competing interests have been the subject of much legal commentary. See, e.g., Haemmerli, supra at 383-84 (proposing to balance the right of publicity as an autonomy-based property right and the First Amendment values of freedom of expression); Kwall, supra at 48, 63-113 (exposing the \"massive confusion\" surrounding the conflict between the right of publicity and the First Amendment, while proposing to resolve the conflict by applying a property and liability rule framework). Yet another commentator has expressed concern that the right of publicity frustrates the principles behind the First Amendment. See Madow, supra at 127 (arguing that \"private, centralized ownership and control of celebrity images poses a more serious threat to cultural pluralism and self-determination than is sometimes realized\"). The argument goes that as a society, we freely monitor the \"comings and goings, missteps and heartbreaks\" of celebrities, along with attempting to copy or emulate \"their mannerisms, their styles, their modes of conversation and their modes of consumption;\" however, \"[b]y virtue of what is now widely known as the 'right of publicity,' the 'commercial' value of a celebrity's name, likeness, and other identifying characteristics is her private property, which she may enjoy and exploit, transfer and bequeath, as she alone thinks best.\" Id. at 128, 130 (footnotes omitted). This, it is maintained, leads to a potential right of censorship on the part of the celebrity thereby \"limit[ing] the expressive and communicative opportunities of the rest of us.\" Id. at 145-46.\n\nDespite the various commentary and scholarship assessing the virtues and drawbacks to the right of publicity when compared to First Amendment principles, the fact remains that the right of publicity is an accepted right and striking the balance between an individual's right of publicity against the speaker's First Amendment right is not an easy one. Bearing in mind the principles justifying the two rights, it is clear why Woods' right of publicity does not bow to Defendant's First Amendment rights in this case.\n\nB. Woods' Right of Publicity Claim in this Case\n\nZacchini v. Scripps-Howard Broadcasting Company is the sole case from the Supreme Court to directly address the right of publicity, and the case came to the Supreme Court by way of certiorari from the Ohio Supreme Court under Ohio common law. See Zacchini, 351 N.E.2d 454 (Ohio 1976), rev'd on other grounds, 433 U.S. 562, 572 (1977). The plaintiff, Zacchini, was the performer of a live human cannonball act who subsequently sued a television station that had videotaped and broadcast his entire performance without his consent. See 433 U.S. at 563-64. The Supreme Court found in favor of Zacchini, holding that the First Amendment did not protect the television station against a right of publicity claim under Ohio common law. Id. at 565-66. The Court explained that the enforcement of the right of publicity claim was not at odds with the First Amendment inasmuch as \"the rationale for [protecting the right of publicity] is the straightforward one of preventing unjust enrichment by the theft of good will. No social purpose is served by having the defendant get free some aspect of the plaintiff that would have market value and for which he would normally pay.\" Id. at 576.\n\nIndeed, since Zacchini, \"[t]he right of publicity has often been invoked in the context of commercial speech when the appropriation of a celebrity likeness creates a false and misleading impression that the celebrity is endorsing a product.\" See Comedy III Prods., Inc. v. Saderup, Inc., 21 P.3d 797, 802 (Cal. 2001) (citing Waits v. Frito-Lay, Inc. 978 F.2d 1093 (9th Cir. 1992); Midler v. Ford Motor Co., 849 F.2d 460 (9th Cir. 1988)). \"Because the First Amendment does not protect false and misleading commercial speech, and because even non-misleading commercial speech is generally subject to somewhat lesser First Amendment protection, see Central Hudson Gas \u0026 Elec. Corp. v. Pub. Serv. Com'n, 447 U.S. 557, 563-64 \u0026 566 (1980), the right of publicity often trumps the right of advertisers to make use of celebrity figures.\" Comedy III, 21 P.3d at 802. In this case, to the extent that the district court was correct in characterizing Defendant's prints as expressive works and not as commercial products, even though Defendant was selling the prints for financial gain, the issue becomes what degree of First Amendment protection should be afforded to Defendant's expressive work.\n\nIn answering this question, one must look beyond Zacchini inasmuch as Zacchini has been criticized as being very \"narrowly drawn\" in that it involved the wholesale reproduction of a live \"entire act,\" which is quite distinguishable from the unauthorized use of a person's identity, particularly when the unauthorized use is in the form of an expressive work, as in the matter at hand. See McCarthy, supra at § 8:27 (recognizing that \"while the Zacchini majority and dissenting opinions have been picked apart word by word by the commentators, no clear message emerges and no general rule is discernible by which to predict the result of conflicts between the right of publicity and the First Amendment.\") With that in mind, guidance is provided by the California Supreme Court because it has addressed the specific issue in a case nearly on all fours with that presented here; namely, Comedy III Productions v. Gary Saderup, Inc., 21 P.3d 797 (Cal. 2001). See McCarthy, supra at § 8:27 (stating that when deciding Comedy III, the California Supreme Court found that when the challenged speech is not in the category of \"commercial speech,\" what Zacchini teaches us is that valid interests behind the right of publicity must be balanced against First Amendment policies, and that an accommodation must be reached).\n\nIn Comedy III, the plaintiff, Comedy III Productions, which is the registered owner of all rights to the former comedy act known as The Three Stooges, filed suit against the defendants, Gary Saderup and Gary Saderup, Inc., seeking damages and injunctive relief for violation of, among other things, California's right of publicity statute in connection with the defendants' sale of T-shirts and lithographs bearing the image of the Three Stooges produced from a charcoal drawing done by Saderup. See 21 P.3d at 800. The defendants sold the T-shirts and lithographs without the plaintiff's consent, profiting $75,000 from the sale of these items. Id. at 800-01. The trial court found for the plaintiff, and entered judgment in the amount of $75,000 as well as $150,000 in attorney's fees plus costs. Id. at 801. The court also issued a permanent injunction restraining Saderup from violating the statute by use of any likeness of The Three Stooges in lithographs, T-shirts, \"or any other medium by which Saderup's artwork may be sold or marketed.\" Id. In addition, the trial court enjoined Sadurap in several other respects regarding his marketing products in connection with The Three Stooges, but allowed Saderup's original charcoal drawing from which the reproductions were made to be exempt from the injunction. Id. at 801.\n\nThe defendants appealed, and the court of appeals modified the judgment by striking the injunction on the basis that the plaintiff had not shown a likelihood of continued violation of the statute, and that the wording of the statute was overbroad. Id. However, the court of appeals affirmed in all other respects, thereby rejecting the defendants' arguments that 1) his conduct did not violate the terms of the statute; and 2) in any event, his conduct was protected by the constitutional guaranty of freedom of speech under the First Amendment. Id. The defendants appealed to the California Supreme Court, which granted leave to address the two arguments raised by the defendants. Id. For purposes of the matter at hand, we focus on the Supreme Court of California's analysis of the First Amendment argument.\n\nThe court began by recognizing that the defendants' First Amendment claim presented a difficult issue, in that the works in question were expressive works and not commercial advertisements. See Comedy III, 21 P.3d at 802. The court noted that \"[a]lthough [the defendants'] work was done for financial gain, the First Amendment is not limited to those who publish without charge . . . . An expressive activity does not lose its constitutional protection because it is undertaken for profit.\" See id. (alterations, internal quotation marks, and citation omitted). The court then recognized the high degree of First Amendment protection for noncommercial speech about celebrities, but at the same time noted that not all expression that trenches on the right of publicity receives such protection. See id. Specifically, the court opined:\n\nThe right of publicity, like copyright, protects a form of intellectual property that society deems to have some social utility. Often considerable money, time and energy are needed to develop one's prominence in a particular field. Years of labor may be required before one's skill, reputation, notoriety or virtues are sufficiently developed to permit an economic return through some medium of commercial promotion. For some, the investment may eventually create considerable commercial value in one's identity.\n\nId. at 804-05 (internal quotation marks and citation omitted).\n\nThe court then found that the case before it exemplified that kind of creative labor. Id. According to the California Supreme Court, the three men who came to enjoy celebrity status began their career in vaudeville and it was a \"long and arduous\" process until the three finally enjoyed the heights of slapstick comic celebrities known as The Three Stooges. See 21 P.3d at 805. As the court stated, \"[t]hrough their talent and labor, they joined the relatively small group of actors who constructed identifiable, recurrent comic personalities that they brought to the many parts they were scripted to play.\" Id. As a result, the issue became whether the defendants' First Amendment rights trumped the plaintiff's right of publicity.\n\nRelying on Zacchini and several cases from lower courts recognizing a celebrity's right of publicity, the court found that depictions of celebrities which amounted to little more than the appropriation of the celebrity's economic value, were not protected by the First Amendment. See id. at 805. As that premise related to the expressive works at issue, the court opined:\n\nIt is admittedly not a simple matter to develop a test that will unerringly distinguish between forms of artistic expression protected by the First Amendment and those that must give way to the right of publicity. Certainly, any such test must incorporate the principle that the right of publicity cannot, consistent with the First Amendment, be a right to control the celebrity's image by censoring disagreeable portrayals. Once the celebrity thrusts himself or herself forward into the limelight, the First Amendment dictates that the right to comment on, parody, lampoon, and make other expressive uses of the celebrity image must be given broad scope. The necessary implication of this observation is that the right of publicity is essentially an economic right. What the right of publicity holder possesses is not a right of censorship, but a right to prevent others from misappropriating the economic value generated by the celebrity's fame through the merchandising of the \"name, voice, signature, photograph, or likeness\" of the celebrity.\n\nComedy III, 21 F.3d at 807-08. Beyond this precept, the court looked to the first factor of copyright's fair use doctrine - \"the purpose and character of the use\" - for guidance. Id. at 808 (quoting 17 U.S.C. § 107(1)).\n\nThe court further looked to the United States Supreme Court regarding the purpose and application of this fair use factor and noted that the inquiry involved \"'whether the new work merely supersede[s] the objects of the original creation, or instead adds something new, with a further purpose or different character, altering the first with new expression, meaning, or message; it asks, in other words, whether and to what extent the new work is transformative.'\" Comedy III, 21 P.3d at 808 (internal quotation marks and citations omitted) (quoting Campbell v. Acuff-Rose Music, Inc., 510 U.S. 569, 579 (1994)). The court found that looking to whether the work in question possessed any \"transformative\" elements squared with the Supreme Court's finding in Zacchini that \"[w]hen artistic expression takes the form of a literal depiction or imitation of a celebrity for commercial gain, directly trespassing on the right of publicity without adding significant expression beyond that trespass, the state law interest in protecting the fruits of artistic labor outweighs the expressive interests of the imitative artist.\" Id. (citing Zacchini, 433 U.S. at 575-76). In other words, although the Supreme Court did not apply the transformative test per se in Zacchini, the Court looked to whether the defendant had simply appropriated the plaintiff's performance in its entirety without any further creative effort. In addition, the court noted that the \"transformative\" test also squared with the First Amendment and the right of publicity inasmuch as \"works of parody or other distortions of the celebrity figure are not, from the celebrity fan's viewpoint, good substitutes for conventional depictions of the celebrity and therefore do not generally threaten markets for celebrity memorabilia that the right of publicity is designed to protect.\" Id. (citing Cardtoons, L.C. v. Major League Baseball Players Assoc., 95 F.3d 959, 974 (10th Cir. 1996)). Said differently, \"[t]he 'transformative' test . . . protect[s] the right-of-publicity holder's core interest in monopolizing the merchandising of celebrity images without unnecessarily impinging on the artists' right of free expression.\" Id. at 808 n.10.\n\nApplying the transformative test to an artist's work at issue in Comedy III, the charcoal sketch made into lithographs and printed on T-shirts, the court found that the defendants' work was not protected inasmuch as the creative contribution was subordinated to the overall goal of creating a literal image of the Three Stooges to commercially exploit their fame. Id. at 811. In doing so, the court noted that when an \"artist's skill and talent is manifestly subordinated to the overall goal of creating a conventional portrait of a celebrity so as to commercially exploit his or her fame, then the artist's right of free expression is outweighed by the right of publicity.\" Id.\n\nIn the instant case, where we are faced with an expressive work and the question of whether that work is protected under the First Amendment, the reasoning and transformative test set forth in Comedy III are in line with the Supreme Court's reasoning in Zacchini as well as in harmony with the goals of both the right to publicity and the First Amendment. Applying the test here, it is difficult to discern any appreciable transformative or creative contribution in Defendant's prints so as to entitle them to First Amendment protection. \"A literal depiction of a celebrity, even if accomplished with great skill, may still be subject to a right of publicity challenge. The inquiry is in a sense more quantitative than qualitative, asking whether the literal and imitative or the creative elements predominate in the work.\" Comedy III, 21 P.3d at 809 (footnote omitted).\n\nIndeed, the rendition done by Rush is nearly identical to that in the poster distributed by Nike. Although the faces and partial body images of other famous golfers appear in blue sketch blending in the background of Rush's print, the clear focus of the work is Woods in full body image wearing his red shirt and holding his famous swing in the pose which is nearly identical to that depicted in the Nike poster. Rush's print does not depict Woods in the same vein as the other golfers, such that the focus of the print is not the Masters Tournament or the other golfers who have won the prestigious green jacket award, but that of Woods holding his famous golf swing while at that tournament. Thus, although it is apparent that Rush is an adequately skilled artist, after viewing the prints in question it is also apparent that Rush's ability in this regard is \"subordinated to the overall goal of creating literal, conventional depictions of [Tiger Woods] so as to exploit his. . . fame [such that Rush's] right of free expression is outweighed by [Woods'] right of publicity.\" See id. at 811.\n\nIn fact, the narrative that accompanies the prints expressly discusses Woods and his fame:\n\nBut the center of their [other golfers'] gaze is 1997 winner Tiger Woods, here flanked by his caddie, \"Fluff\", and final round player partner's (Constantino Rocca) caddie on right, displaying that awesome swing that sends a golf ball straighter and truer than should be humanly possible. Only his uncanny putting ability serves to complete his dominating performance that lifts him alongside the Masters of Augusta.\n\nAccordingly, contrary to the majority's conclusion otherwise, it is clear that the prints gain their commercial value by exploiting the fame and celebrity status that Woods has worked to achieve. Under such facts, the right of publicity is not outweighed by the right of free expression. See Comedy III, 21 P.3d at 811 (noting that the marketability and economic value of the defendant's work was derived primarily from the fame of the three celebrities that it depicted and was therefore not protected by the First Amendment).\n\nThis conclusion regarding Plaintiff's right of publicity claim is in harmony with that regarding Plaintiff's claims brought under the Lanham Act. As the Restatement explains:\n\nProof of deception or confusion is not required in order to establish an infringement of the right of publicity. However, if the defendant's unauthorized use creates a false suggestion of endorsement or a likelihood of confusion as to source or sponsorship, liability may also be imposed for deceptive marketing or trademark or trade name infringement.\n\nRestatement, supra § 46 cmt. b, 537.\n\nBecause Plaintiff has come forward with evidence of consumer confusion as to Woods' sponsorship of the products in question, it is for the jury to decide whether liability should be imposed for Plaintiff's claims brought under the Lanham Act, and this is true whether employing the balancing approach set forth in Rogers or simply employing the eight-factor test in the traditional sense. The majority's failure to do so in this case is in complete contravention to the intent of Congress, the principles of trademark law, and the well-established body of jurisprudence in this area. In addition, the jury should also be allowed to consider evidence regarding Plaintiff's federal dilution claim inasmuch as Plaintiff has proffered evidence on each element of this claim. Finally, although Plaintiff is entitled to summary judgment on its right of publicity claim, at the very least, this claim presents a question for the jury as well.\n\nI therefore respectfully dissent from the majority opinion affirming summary judgment to Defendant as to all of Plaintiff's claims.\n\n\u003cspan class=\"fn\"\u003e1. The Honorable James L. Graham, United States District Judge for the Southern District of Ohio, sitting by designation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The narrative reads as follows: The Masters of Augusta Undeniably, the essence of golf is Augusta National, The Masters. And, as sure as Spring itself, when the azaleas' plethora of color burst upon this uniquely manicured playground of golf's greatest, an almost heavenly awe overtakes the crowd. Because there is something about Augusta--a golden thread of nostalgia that weaves its way through the entire spectacle. Something will happen here that has happened for decades. Greatness will emerge. A Tiger Woods will unleash an incomparable swing and bury his opponents in his wake. Amid the memorable hanging baskets of the Augusta National Clubhouse, Ben Hogan's Bridge, the 13th rock wall, and the dazzling floral logo that greets each guest, a star is born, and he's for real. And attesting from the Leader Board are the men who have formed a golfer's \"field of dreams.\" Men like Arnold Palmer with his omnipresent \"Arnie's Army\" roaring its approval; there's flamboyant Slammin' Sammy Snead or the irrepressible Ben Hogan; of course, you'll find Walter Hagen, who played his first Masters in 1934. And who can forget Bobby Jones, a truly great one, who always played as an amateur here, never as a professional. Last there's the Golden Bear, Jack Nicklaus, standing tall with six Masters to his credit, a man whose golfing prowess sets him apart from mere mortals. But the center of their gaze is 1997 winner Tiger Woods, here flanked by his caddie, \"Fluff\", and final round player partner's (Constantino Rocca) caddie on right, displaying that awesome swing that sends a golf ball straighter and truer than should be humanly possible. Only his uncanny putting ability serves to complete his dominating performance that lifts him alongside the Masters of Augusta. In this unique work of art, America's Sports Artist, Rick Rush has blended the charm and boastful beauty of nature with the magnificence of a gilded golfing history and unabashed power and confidence of youth to deliver a masterpiece: \"The Masters of Augusta.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. ETW acknowledges that the court need not separately address its state law claims for trademark infringement, unfair competition and deceptive trade practices. See Final Brief of ETW, p. 31 n.17.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. ETW's survey evidence on likelihood of confusion was limited to the prints of Rush's painting and did not include the materials which used Woods's name.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The dissent misunderstands the basis for our holding that defendant's use of the registered mark \"Tiger Woods\" is not infringing. We find only that defendant's use of the mark was a fair use under established trademark law. This finding is not linked in any way with our separate finding that defendant's use of Woods's image was not an infringement of plaintiff's claimed unregistered trademark in all images and likenesses of Woods. The dissent's discussion of plaintiff's evidence of consumer confusion in connection with plaintiff's claim of violation of the registered trademark \"Tiger Woods\" is inapposite because the survey subjects were shown only the Rush print, which does not contain the words \"Tiger Woods.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The dissent states that we have incorrectly characterized plaintiff's claim, and that the plaintiff is not seeking to protect any and all images of Woods, but only the image which appears in Rush's print, and that there is \"at the very least ... a question of fact ... as to whether Woods has used this image as a trademark....\" We stand by our characterization of plaintiff's claim. Plaintiff's first amended complaint does not allege that Woods has used any specific image or likeness as a trademark. There is no evidence in the record that Woods has consistently used any specific image or likeness as a trademark. As the district court correctly pointed out, all of the images of Woods which were submitted by the plaintiff in the course of the summary judgment proceedings are different. The image of Woods in the Nike poster referred to in the dissent is readily distinguishable from the central image in the Rush print. It features, among other things, a different facial expression, a different position of the hands, and a different position of the golf club. Finally, we note that there is not just one but three very different images of Woods in the Rush print: one standing and swinging a club, and two crouching--one with hands on the ball and club, and the other with hands over eyes. Plaintiff claims that all three violated its unregistered trademark in Woods's likeness and image.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. We disagree with the dissent's conclusion that the results of plaintiff's consumer confusion survey, in which the respondents were shown only the Rush print, show that the plaintiff has used a specific image of Woods as a trademark.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. This includes ETW's claims of dilution under 15 U.S.C. §1125(c). Because Woods's likeness does not function as a trademark which is subject to protection under the Lanham Act, it follows that a dilution claim does not lie. The dissent has correctly noted that Woods's dilution claim is limited to the registered mark \"Tiger Woods\". That claim would be precluded by the fair use doctrine as discussed in Part II above. Furthermore, unlike the dissent, we conclude that plaintiff's consumer survey evidence cannot support plaintiff's claim of dilution of its registered mark because the survey respondents were not shown any materials which included the registered mark.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. ETW's argument that only the original work and not its copies are protected would lead to absurd results. For example, the original manuscript of an unauthorized biography would be protected, but not the published copies. The original script of a play or a movie would be protected, but not live performances or films produced from it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The court distinguished its earlier decision in Dallas Cowboys Cheerleaders, Inc. v. Pussycat Cinema, Ltd., 604 F.2d 200 (2nd Cir. 1979), saying \"We do not read Dallas Cowboys Cheerleaders as generally precluding all consideration of First Amendment concerns whenever an allegedly infringing author has 'alternative avenues of communication.'\" 875 F.2d at 999 n.4.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. ETW argues that this court adopted the \"alternative means\" test in Elvis Presley Enterprises v. Elvisly Yours, Inc., 936 F.2d 889 (6th Cir. 1991). This is not the case. Elvisly Yours, Inc. involved the sale of Elvis Presley memorabilia covered by plaintiff's trademarks. Defendant asserted the defenses of laches and acquiescence. No First Amendment issues were raised. This court affirmed a permanent injunction issued by the district court but narrowed its scope because \"there are various activities that Shaw could engage in that would not violate EPE's legitimate trademark and publicity rights, such as writing a magazine article or book about Elvis Presley, or dealing in properly licensed products.\" Id. at 897.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. We disagree with the dissent's suggestion that the rule of Rogers and Mattel is limited to titles of artistic works. We believe that the principles identified in these decisions are generally applicable to all cases involving literary or artistic works where the defendant has articulated a colorable claim that the use of a celebrity's identity is protected by the First Amendment. The dissent contends that we have overlooked the comment in Mattel that the result in Rogers may have been different if, for example, \"a pair of dancing shoes had been labeled Ginger and Fred, [because] a dancer might have suspected that Rogers was associated with the shoes (or at least one of them), just as Michael Jordan has endorsed Nike sneakers that claim to make you fly through the air.\" Mattel, 296 F.3d at 901. We fail to see the relevance of this distinction, because Woods's image in Rush's print is not used to identify a product.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The dissent's continued insistence on applying the likelihood of confusion test appears untenable in light of Parks.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Approximately half of the states have adopted some form of the right of publicity either at common law or by statute. See McCarthy on publicity and privacy, §6:1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. ETW is a Florida corporation with its principal place of business in Cleveland, Ohio. Both parties have argued this case on the premise that Ohio law applies to ETW's right of publicity claim. Thus, the court will apply Ohio law. See Suarez Corporation v. CBS, Inc., No. 93-3307, 1994 WL 142785 (6th Cir. April 19, 1994) (applying Ohio law to invasion of privacy claim where Ohio was plaintiff's principal place of business).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. In 1999, the right of publicity was codified in the provisions of Ohio Revised Code Chapter 2741. However, this litigation was commenced before the effective date of the Ohio statutory provisions, and ETW does not invoke them.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Hicks v. Casablanca Records, 464 F.Supp. 426 (S.D.N.Y. 1978); Frosch v. Grossett \u0026 Dunlop, Inc., 75 A.D.2d 768, 427 N.Y.S.2d 828 (lst Dep't 1980); and Guglielmi v. Spelling-Goldberg Productions, 25 Cal.3d 860, 160 Cal.Rptr. 352, 603 P.2d 454, 455 (1979) (Bird, C.J., concurring).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. In Parks, we applied the Rogers test to plaintiff's right of publicity claims and cited with approval Judge Kozinski's dissent in White, 989 F.2d at 1516. Parks, 329 F.3d at 449.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Unlike Parks, here there is no genuine issue of material fact about the artistic relevance of the image of Woods in Rush's print. See Ruffin-Steinback v. dePasse, 82 F.Supp.2d 723 (E.D. Mich. 2000) aff'd 267 F.3d 457 (6th Cir. 2001) (likeness of members of Motown group \"Temptations\" used to promote televised mini-series and video cassette based on partly fictionalized story about group); Seale v. Gramercy Pictures, 949 F.Supp. 331 (E.D. Pa. 1996) (use of plaintiff's name and likeness on cover of pictorial history book and home video clearly related to content of book and film).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Respondents in the survey were handed a copy of Rush's print and were asked the question: \"Do you believe that Tiger Woods has an affiliation or connection with this print or that he has given his approval or has sponsored it?\" Sixty-two percent answered \"Yes\"; eleven percent said \"No\"; and twenty-seven percent said \"Don't Know.\" The terms \"affiliated with\" and \"connected with\" were not defined. Some respondents may have thought that Woods's mere presence in the print was itself an affiliation or connection. No control questions were asked to clarify this. Furthermore, the respondents were not given the packaging in which Jireh distributed the prints which prominently features Rush and contains no suggestion that Woods sponsored or approved the print.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Contrary to the claim made by the majority in footnote 11 of its opinion, this dissent in no way suggests that the balancing test set forth in Rogers is limited to titles. Rather, it is the majority's failure to consider evidence of confusion under the eight-factor test in relation to the specific artistic expression when applying the Rogers test to which this dissent takes issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Commentators agree that the impetus behind privacy law in general was the seminal article authored by Samuel D. Warren and Louis D. Brandeis, The Right to Privacy, 4 Harv. L. Rev. 193, 195 (1890), where the authors contended that people had a right to be left alone. See J. Thomas McCarthy, The Rights of Publicity and Privacy § 1.11 (2d ed. 2000). Later, Prosser and Keeton proposed the legal recognition of a right to privacy encompassing four distinct causes of action, with the fourth being the misappropriation of an individual's name or likeness, from which the right of publicity evolved. See W. Page Keeton et al., Prosser and Keeton on the Law of Torts § 117, at 851-68 (5th ed. 1984); see also David J. Michnal, Tiger's Paper Tiger: The Endangered Right of Publicity, 58 Wash. \u0026 Lee L. Rev. 1155, 1159-160 (2001) (chronicling the evolution of publicity rights).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Because Ohio's right of publicity statute was enacted after the inception of this case, Plaintiff concedes that it is inapplicable here; however, Plaintiff looks to the statute by analogy as support for its common law right of publicity claim. See Plaintiff's Brief on Appeal at 19-20.\u003c/span\u003e\n\n",
    "body_length": 157611,
    "citedas": [
      "332 F.3d 915",
      "2003 Fed.App. 0207",
      "67 U.S.P.Q.2d 1065"
    ],
    "attorneys": "Counsel Argued: Terence J. Clark, Squire, Sanders \u0026 Dempsey, Los Angeles, California, for Appellant. Dennis J.Niermann, Dennis J. Niermann Company, Cleveland, Ohio, for Appellee. J. Michael Murray, Berkman,Gordon, Murray \u0026 DeVAN, Cleveland, Ohio, for Amici Curiae. ON Brief: Terence J. Clark, Squire,Sanders \u0026 Dempsey, Los Angeles, California, Thomas G. Kovach, Squire, Sanders \u0026 Dempsey, Cleveland,Ohio, for Appellant. Dennis J. Niermann, Dennis J. Niermann Company, Cleveland, Ohio, for Appellee. J. MichaelMurray, Lorraine R. Baumgardner, Berkman, Gordon, Murray \u0026 DeVAN, Cleveland, Ohio, Lucy A. Dalglish,The Reporters Committee For Freedom OF The Press, Arlington, Virginia, James E. Hough, Morrison\u0026 Foerster, New York, New York, Adam B. Liptak, New York Times Company Legal Department, NewYork, New York, Diane L. Zimmerman, New York University Law School, New York, New York, Mark S.Lee, Manatt, Phelps \u0026 Phillips, Los Angeles, California, Joseph A. Kohanski, Geffner \u0026 Bush, Burbank,California, Russell S. Jones, Jr., Shughart, Thomson \u0026 Kilroy, Kansas City, Missouri, Bruce S. Meyer, Lynda M.Braun, Weil, Gotshal \u0026 Manges, New York, New York, for Amici Curiae.",
    "category": [
      "243",
      "252"
    ],
    "judges": "Before: Siler and Clay, Circuit Judges; Graham, District Judge.*fn1",
    "citation_count": 85
  }
}
