{
  "id": "hbmUTmYBTlTomsSBhS8r",
  "document": {
    "title": "Mosley v. Magnolia Petroleum Co.",
    "full_title": "MOSLEY ET AL. v. MAGNOLIA PETROLEUM CO. ET AL.",
    "jurisdiction": "New Mexico Supreme Court",
    "date": "1941-06-10T00:00:00.000Z",
    "docket": "No. 4312",
    "body": "Upon consideration of the second motion for rehearing, previous opinions are withdrawn and the following substituted:\n\nBRICE, Chief Justice.\n\nThis action was instituted by appellants (who will be styled plaintiffs) to quiet title to an undivided one-half interest in the oil, gas and other minerals in and under 160 acres of land situated in Lea County, New Mexico; and to cancel certain deeds purporting to transfer mineral interests therein to appellees (who will be styled defendants) and their predecessors in title.\n\nThe plaintiffs, who held by patent from the United States, pleaded in detail a chain of title from them to the defendants, and alleged that a certain deed purporting to have been executed by them to one Burke,\n\nthrough which each of the defendants claims a one-fourth interest in said minerals, was a false, forged and altered instrument, and passed no title; by reason of which all subsequent conveyances in each of the defendants' chain of title are void; that title had never passed from them.\n\nThe defendants pleaded the general issue, and specially, in substance as follows:\n\nThe plaintiffs knew, a year prior to the date defendants' predecessor obtained a deed from Burke, and more than seven years prior to the filing of this suit in the district court, that the Burke deed had been altered in the manner hereinafter stated, and that the altered deed was of record in the deed records of Lea County. They knew that some interested person might at any time purchase this property, relying upon the apparent validity of the Burke deed, and the fact of its alteration would not be disclosed by the record or become known to him unless plaintiffs should seasonably institute legal proceedings such as this suit, or otherwise make a public record of their claim, which they failed to do.\n\nThat defendants and their predecessors in title had no knowledge of any defect in said deed or of any fact that would put them on inquiry regarding it; that they purchased said interests in reliance upon the title as disclosed by the public records and the opinion of reputable attorneys that the title as thus disclosed was good; that they were without knowledge, actual or constructive, that plaintiffs claimed any interest therein; that the plaintiffs, from the date of the sale to Asbury, knew that the property was steadily increasing in value; that at the date this suit was instituted (which was after oil had been discovered in the vicinity of the land) the property was worth many thousands of dollars.\n\nThat it was the duty of the plaintiffs, under the circumstances stated, to protect unknown purchasers against the hidden defect in the Burke deed by making a public record of their claim, either by court action or otherwise; so that any person interested in its purchase would be advised thereof and not necessarily rely upon the record of the void deed, and thereby be induced to purchase said property in the belief that the deed was genuine; which duty they failed to perform.\n\nThat by reason of the facts stated the plaintiffs are estopped, and are barred by their laches from maintaining this action, or to establish title to the property in suit as against defendants.\n\nThe plaintiffs replied to the defenses of estoppel and laches, in substance, that when they discovered the record of \"the false, forged and materially altered deed\" in June, 1928, in order to protect their title and show by the public record their claim to the property the plaintiff, Ennis C. Mosley, on the 7th of June, 1928, executed, acknowledged and delivered a mineral deed conveying an undivided one-half interest in the minerals in said lands to plaintiff Mrs. Nellie E. Mosley, which was placed of record on that date; and thereafter on July 2, 1928, in order to\n\ngive further notice of plaintiffs' claim, the plaintiff Nellie E. Mosley executed and delivered to plaintiff Ennis C. Mosley a like conveyance, transferring the same property back to him, which deed was duly acknowledged and placed of record on the 3rd day of July, 1928. That at the time of the purchase of said property by defendants and their predecessors these deeds were of record. That in June, 1928, they employed attorneys to protect their interests by filing suit to cancel the Burke deed, and were advised by said attorneys, after a delay of two or three months, that plaintiffs did not have a cause of action. That they did not again employ attorneys, or make arrangements to sue, until a short time before this action was instituted. That defendants had notice of plaintiffs' claim when they purchased said property, and had no legal right to rely alone upon the record of said altered deed.\n\nThe facts, as found by the trial court, are, in substance, as follows:\n\nThat prior to 1927 plaintiffs were the owners in fee simple of the 160 acres of land in question, evidenced by a patent from the United States, dated August 10, 1921, and recorded in 1926. They sold the surface rights, and leased the reserved mineral interests. Thereafter, on November 29, 1927, they agreed to sell and convey to one Asbury an undivided three-fourths interest in the underlying minerals for $800, subject to the oil and gas lease mentioned. In the execution of this agreement, and at Asbury's suggestion, two deeds were signed and acknowledged by plaintiffs, one conveying to Asbury an undivided one-half of the mineral interests mentioned, and the other an undivided one-fourth thereof.\n\nBy agreement of the parties the deeds were sent to a bank at Cisco, Texas, to be held by it as escrow agent for thirty days, during which time Asbury had the privilege of paying the purchase price and taking the deeds; failing which, the deeds were to be returned to plaintiffs by the bank. Upon receipt of the deeds by the Cisco bank, Asbury tortiously secured possession of the one conveying the larger interest, after which (according to defendants' brief and the findings of the court) --\n\n\"* * * Asbury and Bates took the one-half deed to Bates' office at Cisco and by the use of a chemical eradicator removed the name of Asbury, as grantee, and inserted the name of E. T. Burke. They also removed the figure '1/2' in four places where it had been written in the deed to indicate the interest conveyed and wrote in lieu thereof the word 'one-half'. In like manner they erased the land description 'SE 1/4' and wrote instead 'Southeast Quarter.' The consideration shown in the deed was Five Hundred Dollars written in words and figures, and this was changed to Ten Dollars. The wife of Mosley had signed the deed 'Nellie E. Mosley;' the initial 'E' was removed from the signature and from the certificate of acknowledgement. The word 'who' in the certificate of acknowledgement was changed to 'her' in the last line.\n\n\"After these alterations were made in the deed, Asbury and Bates took the deed and abstract to Abilene, some fifty miles away, and at Burke's direction, submitted them to Burke's attorney for a title examination. The abstract contained only a few entries and the examination was completed and the title opinion written and delivered to Burke on the same day. The title was approved and the purchase price of $800 for the one-half interest, was paid by Burke on the same day. Asbury and Bates returned to Cisco the same day and took up the Mosley draft with the proceeds from the sale to Burke, and thereupon received the one-fourth deed, which had remained in the bank * * *.\"\n\n\"The altered deed which was delivered to Burke was forwarded for record by him and was filed for record in Lea County, on December 14, 1927.\"\n\nBefore J. H. Reynolds purchased said property from Burke for Cranfill \u0026 Reynolds (now defendant General Crude Oil Co.), he had made a complete abstract of the title thereof and caused the same to be examined by an employee in their behalf.\n\nBefore the defendant Magnolia Petroleum Corporation purchased an interest from Cranfill \u0026 Reynolds, it had a complete abstract of title thereof examined by its attorney, who had none of the original papers before him and none of the alterations in the Burke deed were shown by said abstract, and it purchased without knowledge of any of the changes in the Burke deed, or claims of plaintiffs.\n\nThe alterations in the Burke deed were made without the knowledge of the Cisco bank, and plaintiffs first learned of them by an inspection of the deed records of Lea County, about June 22, 1928; but they never knew that these alterations were made in the deed while it was tortiously in Asbury's possession, and that the deed had never been delivered, until so stated by defendants' counsel at the opening of the trial of this suit.\n\nAt the time Asbury contracted to buy the property it was of the value of $800, and thereafter steadily increased in value, and at the time this suit was filed it was worth many thousands of dollars.\n\nIn June, 1928, plaintiffs contracted to convey to one Payne an undivided one-half interest in the minerals in said land, but were informed that according to the record title they had theretofore conveyed three-fourths to others. It was at this time they discovered the alteration of the Burke deed by an inspection of the deed records of Lea County, and immediately employed attorneys to institute suit to cancel it, who later advised them that they did not have a cause of action against Burke.\n\nPlaintiff Ennis C. Mosley conveyed to his wife, by deed recorded June 7, 1928, an undivided one-half interest in the minerals under the lands; and plaintiff Mrs. Mosley reconveyed the same property to plaintiff Mosley, by deed filed for record July 3, 1928.\n\nSome time thereafter (the date was not given) the plaintiffs retained G. L. Reese,\n\nSr., an attorney of Roswell, New Mexico, to institute this suit in the district court, but nothing was done until the present suit was filed on the 16th day of April, 1935, after the discovery of oil near the property in suit.\n\nThat since the institution of this action the defendants have procured a quit claim deed from Asbury, conveying the property in suit to Burke.\n\nFinding of Fact No. 9 is as follows: \"That the price received for said mineral interests was the fair market value thereof at the time of the sale, but that in the year 1936, three oil wells were brought in on said land by the lessee thereof, the Humble Oil \u0026 Refining Company; and that the defendants herein and their successors in interest have collected the annual rentals thereof continuously since said date; * * *\"\n\nPlaintiffs urge that the following part thereof has no support in the evidence: \"That the defendants herein and their successors in interest have collected the annual rentals thereof continuously since said date.\" We understand from reading the trial court's opinion that he intended to find that the defendants and their predecessors in title had collected the annual rentals of $10 continuously since the alleged sale to Asbury. The only evidence regarding this matter was a record of the lessee, introduced by stipulation of the parties, which established that plaintiffs collected the rentals for the years of 1928, 1929 and 1930, and the defendants collected them thereafter. Obviously, as made, the finding is not supported by any evidence and it must be cancelled. But the facts stipulated by the parties (as stated above) will be accepted as true and so considered in our disposition of the case.\n\nFinding No. 11 is cancelled because it is not a finding of fact, but a statement regarding the testimony of witnesses.\n\nCertain alleged errors are based upon statements in the trial court's opinion. The opinion is not a \"decision\" as contemplated by Sec. 105-813, N.M.Sts.1929 (now Supreme Court Rule 105-813); and error cannot be predicated thereon.\n\nThe decision (findings of fact and conclusions of law) is the basis upon which the judgment of the court rests (Victor Gold \u0026 Silver Mining Company v. Nat'l Bank, etc., 18 Utah 87, 55 P. 72, 72 Am.St.Rep. 767); the opinion consists of the reasons given for the judgment and findings. It may be referred to as an aid in construing ambiguous findings (Lepper et al. v. Wisconsin Sugar Co., 146 Wis. 494, 128 N.W. 54, 131 N.W. 985) and for the argument and reasons given in support of findings, conclusions, rulings and holdings (Morehouse v. Brooklyn Heights R. Co., 185 N.Y. 520, 78 N.E. 179, 7 Ann.Cas. 377, 379); but the rights of the parties are controlled by the findings as stated in the decision of the court, if a decision is filed; and we are not permitted to add to or take from them by resort to the opinion. Brothers v. United States, 250 U.S. 88, 39 S. Ct. 426, 63 L. Ed. 859; Reibel v. Mueller,\n\n177 Minn. 602, 225 N.W. 924, 66 A.L.R. 1; United States v. Sioux City Stock Yards Co., 8 Cir., 167 F. 126; Fleischmann C. Company v. United States, 270 U.S. 349, 46 S. Ct. 284, 70 L. Ed. 624; Miller v. Marks, 46 Utah 257, 148 P. 421; Boehm v. Wermuth, 194 Wis. 82, 215 N.W. 818; Schmoldt v. Loper, 174 Wis. 152, 182 N.W. 728; Keeley et al. v. Ophir, etc., Co., 8 Cir., 169 F. 598; Scholle v. Finnell, 173 Cal. 372, 159 P. 1179; Goldfield v. Roger, 8 Cir., 249 F. 39; Stock Growers' Finance Co. v. Hildreth, 30 Ariz. 505, 249 P. 71. If, at times, we have, in our discretion, ruled upon statements in the bill of exceptions or opinion, presented and accepted by the parties as a finding of fact, it was not because the practice was proper or approved of by us, but because it was acquiesced in by the parties. Wormley v. Grand Rapids Trust Co., 232 Mich. 680, 206 N.W. 307. The trial court concluded in his opinion, though not by his decision, that defendants were \"bona fide purchasers for value without notice,\" and the parties have treated it as a part of the decision, and it is so presented here. We will so treat the question.\n\nThe court's conclusions of law upon the facts stated are as follows:\n\n\"That as between the plaintiffs and the defendants Magnolia Petroleum Company and General Crude Oil Company, that the delivery of the deed to the one-half interest was made, as a matter of law, when the bank delivered it into the possession of Asbury, and it should be considered that the material alterations therein, to-wit, that of the substitution of the name of Burke as grantee, was made after delivery;\n\n\"That the plaintiffs have parted with their title to said mineral interest, and further, that by reason of their laches, they cannot maintain this action.\"\n\nThe trial court erred in concluding that the rule of \"relation back to the first delivery\" applies to the facts of this case.\n\nA well known authority (4 Thompson on Real Property, Sec. 3953) has stated that \"Whether an innocent purchaser from a grantee who wrongfully obtained a deed deposited in escrow without performing the condition, thereby acquired title to the property, is a question upon which there is much conflict of authority;\" and (Id. Sec. 3953) \"the better opinion, however, upon principle, and that supported by the weight of authority, is that a subsequent purchaser in good faith acquires a good title though his grantor had received his deed from a depositary without performing the condition upon which such deed was to be delivered.\" An amazing statement, for not a single authority cited by the text writer in support of the last proposition sustains his conclusion. The only one that even by dictum supports it is Hubbard v. Greeley, 84 Me. 340, 24 A. 799, 800, 17 L.R.A. 511, from which the author quotes, and the second syllabus of which supports the text; but the court stated: \"We rest our decision upon the ground that the deed was, in fact, delivered to the grantees' attorney as such, and that such a delivery is equivalent to a delivery to the grantee himself.\"\n\nIt was upon these authorities, and the case of Somes v. Brewer, 2 Pick., Mass., 184, 13 Am.Dec. 406 (cited in support of the text mentioned, but which it does not support), that the trial court concluded that the defendants were innocent purchasers, and therefore delivery related back to the deposit of the escrow, or \"first delivery.\"\n\nThe doctrine of relation back to the first delivery of an escrow has application to those cases where by reason of incidents happening between the first and second delivery, such fiction is necessary to give the deed effect to prevent injuries that would result from legal impediments or the like, and thereby effectuate the intention of the parties (Devlin on Real Estate Sec. 328); as in cases where either the grantor (Stanton v. Miller, 58 N.Y. 192) or the grantee (Prewitt v. Ashford, 90 Ala. 294, 7 So. 831) died after the first delivery; or where, between the two deliveries, one of the parties becomes insane and is incapable of carrying out an agreement (Simpson v. McGlathery, 52 Miss. 723); or where a woman marries between the date of the deposit of the first delivery and the second and thereby incapacitates herself to make a deed (Wellborn v. Weaver, 17 Ga. 267, 63 Am.Dec. 235); or where the grantor has sold to a third person, who had notice of the escrow, after the first delivery, and the grantee carried out the conditions of the escrow (Conneau v. Geis, 73 Cal. 176, 14 P. 580, 2 Am.St.Rep. 785). The rule has no application to a case where a grantee wrongfully obtains possession of the instrument from the escrow holder, even though thereafter ratified. In such cases title passes as of the date of the ratification. Carlisle v. National Oil \u0026 Development Co., 108 Okl. 18, 234 P. 629; Waldock v. Frisco Lumber Co., 71 Okl. 200, 176 P. 218; and see generally annotation in 117 A.L.R. beginning at page 69. It is the general rule that where a deed is executed and placed in escrow to be delivered upon a condition subsequent, it will be given effect as of the date of the final or effective delivery. May v. Emerson, 52 Or. 262, 96 P. 454, 96 P. 1065, 16 Ann.Cas. 1129; Prutsman v. Baker, 30 Wis. 644, 11 Am. Rep. 592; anno. 117 A.L.R. page 69 et seq.\n\nThe deed in question was void for three reasons: First, it was never delivered; second, it was fraudulently obtained from the escrow holder without complying with the escrow agreement (Roberts v. Humphreys, 27 N.M. 277, 199 P. 1006; Otero v. Albuquerque, 22 N.M. 128, 158 P. 798 and anno. 48 A.L.R. 405 et seq.); and, third, the unauthorized substitution of Burke's name as grantee for that of Asbury was a material alteration of an undelivered deed, and destroyed its force as a conveyance; and defendants who purport to have paid value, without knowledge of the invalidity of the Burke deed, are not protected, Roberts v. Humphreys, supra; Sipes v. Perdomo et al., 118 Okl. 181, 247 P. 689; King v. De Tar, 112 Neb. 535, 199 N.W. 847; 16 Am.Jur. \"Deeds\" Sec. 29; 2 Am.Jur. \"Alteration of Deeds\" Sec. 31; Restatement of Law of Contracts, Sec. 434.\n\nWe stated in Otero v. Albuquerque, supra [22 N.M. 128, 158 P. 799]: \"In the present case, however, the delivery of the deed was procured by fraud practiced upon the escrow holder. The deed, therefore, was void, and transferred no title. 'A deed, which has been surreptitiously and fraudulently obtained from the grantor without his knowledge or consent, does not, even as against a subsequent purchaser without notice, transfer title. A deed purloined or stolen from the grantor, or possession of which was fraudulently or wrongfully obtained from him without his knowledge, consent, or acquiescence, is no more effectual to pass title to the supposed grantee than if it were a total forgery, and an instrument of the latter kind had been spread upon the record.'\"\n\nTo the same effect are: Spotts et al. v. Whitaker et al., Tex.Civ.App., 157 S.W. 422; Wiggenhorn v. Daniels, 149 Mo. 160, 50 S.W. 807; McGinn v. Tobey, 62 Mich. 252, 28 N.W. 818, 4 Am.St.Rep. 848; Jackson v. Lynn et al., 94 Iowa 151, 62 N.W. 704, 58 Am.St.Rep. 386; Balfour v. Hopkins, 9 Cir., 93 F. 564; Houston Land \u0026 Trust Co. v. Hubbard, 37 Tex.Civ.App. 546, 85 S.W. 474; Steffian et al. v. Milmo Nat'l Bank, 69 Tex. 513, 6 S.W. 823; Clevenger v. Moore et al., 126 Okl. 246, 259 P. 219, 54 A.L.R. 1237; Houston v. Forman et al., 92 Fla. 1, 109 So. 297, 48 A.L.R. 401 and anno. at page 430. Both the deed and its record were nullities. Scheer v. Stolz, infra; Meley v. Collins, infra; Epps v. McCallum Realty Co., 139 S.C. 481, 138 S.E. 297; Stone v. French et al., infra; 16 Am. Jur. \"Deeds\" Sec. 21.\n\nSee also the following cases, in each of which it was held that a forged instrument and its record are utterly void, and its record is not constructive notice, 2 Devlin on Deeds, 3d Ed., Sec. 726; Scheer v. Stolz, 41 N.M. 585, 72 P.2d 606; and one who purchases relying upon the record alone, though without knowledge of the invalidity of the instrument, is not protected as an innocent purchaser, Catto v. Hollister, 39 N.D. 1, 166 N.W. 506, though the deed had been of record for years with the owner's knowledge, Meley v. Collins, 41 Cal. 663, 10 Am.Rep. 279; Pom.Eq.Jur., 3d Ed., Sec. 918; Chandler v. White, 84 Ill. 435; Stone v. French, 37 Kan. 145, 14 P. 530, 1 Am.St.Rep. 237; Com'rs Court v. Burke, Tex.Civ.App., 262 S.W. 94; West v. Houston Oil Co., 56 Tex.Civ.App. 341, 120 S.W. 228; Chamberlain v. Showalter, 5 Tex.Civ.App. 226, 23 S.W. 1017; Kypadel, etc., Co. v. Millard, 165 Ky 432, 177 S.W. 270; Gulf Coal \u0026 Coke Co. v. Alabama Coal \u0026 Coke Co., 145 Ala. 228, 40 So. 397.\n\nBut we need not multiply authorities, the defendants agree to these general rules. They state: \"It is a general rule, of course, that a change in the name of the grantee in a deed before delivery without consent of the grantor voids the transfer. There is no controversy about the rule. It is also a general rule, as stated by this court in the case of Roberts v. Humphreys, 27 N.M. 277, 199 P. 1006, and\n\nOtero v. City of Albuquerque, 22 N.M. 128, 158 P. 798, above referred to, that an instrument in escrow wrongfully obtained without compliance with the escrow passes no title, even in the hands of an innocent purchaser. * * *\"\n\nWhether the erasures and substitutions in the Burke deed amounted to a forgery we need not decide; for whether a forgery or not, when Asbury erased his name as grantee and inserted that of Burke in its place in the undelivered deed, he destroyed it as a conveyance as effectively as though the entire instrument had been forged, and it passed no title to Burke, or through him to the defendants. Otero v. City of Albuquerque, supra. It was not admissible in evidence as a muniment of title in its altered or original form, and the trial court erred in so admitting it. It was a nullity and established nothing except the fact that it had been materially altered, and was admissible for no other purpose. Ruby v. Talbott, 5 N.M. 251, 21 P. 72, 3 L.R.A. 724; Wood v. Steele, 6 Wall. 80, 18 L. Ed. 725; Brady v. Berwind-White, Etc., Co., 106 F. 824; Schmidt v. Quinzel, 55 N.J.Eq. 792, 38 A. 665; Hecht v. Shenners, 126 Wis. 27, 105 N.W. 309; Jones v. Crowley, 57 N.J.L. 222, 30 A. 871; 2 C.J., Alteration of Instruments, ยง 28; 3 C.J.S., Alteration of Instruments, ยง 18; 2 A.J. \"Alteration of Instruments\" Sec. 31.\n\nThe deed and the record thereof must go out, except as evidence of the alterations.\n\nWe all agree that no title passed to Burke, or through him to either defendant; that on June 22, 1928, the date that plaintiffs discovered the record of the altered deed, they owned the property in fee simple; that if they had filed suit on that date they would have prevailed.\n\nIf plaintiffs had a complete title on the date named (as we all agree they had), then all past transactions (including that with Asbury) had spent their force without affecting it. Plaintiffs' title was no different, and just as secure against the claim under and through the Burke deed, as would be that of any other land owner against a claim under a void instrument. They could have sold it on that day and have conveyed a complete title to the purchaser. It necessarily follows that on the date named the defendants' predecessor Burke had no semblance of title, and could convey none to defendants. This being true, plaintiffs could lose title involuntarily only by some sufficient subsequent occurrence that under the law would deprive them of the right to assert it, and not by reason of any previous dealings with Asbury regarding the property.\n\nAs a preliminary to the defense of estoppel, and apparently for the purpose of proving themselves good faith purchasers, the defendants assert that they had complete abstracts of title of the property in suit examined by their respective attorneys; that the defect in the Burke deed was not apparent in the record, and they\n\npurchased without knowledge of the alterations or of plaintiffs' claim of title.\n\nExcept as otherwise provided by Statute, the rule caveat emptor applies to a purchaser of real property. Simmons Creek Coal Co. v. Doran, 142 U.S. 417, 12 S. Ct. 239, 35 L. Ed. 1063. The responsibility for securing the title of the owner rests upon the purchaser. He must, at his peril, secure title from one who has title to convey. Catto v. Hollister, supra; Meley v. Collins, supra. The owner whose title is of record is not required to stand guard over it, or protect the unwary against buying a spurious title, unless duty so demands. Saylor v. Kentucky, etc., Corp., 205 Ky. 724, 266 S.W. 388, 50 A.L.R. 666.\n\nThe examiner of an abstract of title to land ordinarily assumes that it correctly reflects the record of the instruments in the chain of title, and that such instruments are genuine and valid, unless it otherwise appears, or can be inferred from information contained in the abstract. An authority on the subject states: \"In addition to the general survey of title from all the instruments and proceedings, each particular step must be examined technically and critically, and its own sufficiency or insufficiency passed upon. Under the English system this would consist of a comparison of the original instruments with the abstract, but this task under the American system, is supposed to have been satisfactorily performed by the abstract maker, and all that counsel is expected to do is to see that the instruments as they are presented are sufficient in form and substantially correct.\" Warville on Abstracts of Title, 3d Ed., Sec. 593.\n\nIf it is the duty of the abstract maker to compare the original instruments with the record, as stated in the text quoted, we are satisfied that it is a duty seldom, if ever, performed in this country. Ordinarily the abstract maker assumes that the record is a correct copy of the instruments recorded and enters into no quest regarding the genuineness or validity of an original instrument.\n\nOnly valid instruments are authorized to be filed or recorded, of which purchasers are charged with notice. If a false or void document, purporting upon its face to be a conveyance, is recorded, the record, like the instrument, is void and no more protects a purchaser than if it did not exist. Scheer v. Stolz, supra; Steele's Lessee v. Spencer, 1 Pet. 552, 7 L. Ed. 259. Thompson on Real Prop. Sec. 4025.\n\nThe opinions of the defendants' examiners, therefore, did not purport to cover the question of void documents or records, regarding which the defendants assumed the risk. And, assuming -- as has been suggested -- that millions of dollars are invested upon the faith of the genuineness of the instruments duly recorded and upon abstracts reflecting such records; nevertheless, there is an element of negligence and considerable risk incurred in such reliance; and there is no principle of\n\nlaw that permits a would be purchaser of land to shift this responsibility to the land owner, unless voluntarily assumed by him by acts or silence amounting in law to fraud, notwithstanding the latter's superior knowledge of the title.\n\nIn the books are many cases holding that purchasers had no title to property bought in reliance upon the record of void instruments, such as forgeries, undelivered deeds, deeds by minors or others under disability, deeds purporting to convey community property executed by the husband alone, and the like, or where an owner is in actual possession under an unrecorded deed; none of which defects were disclosed by the records.\n\nIt is common knowledge that the title to oil properties will be contested by someone connected with the title, if there is a remote chance of success. Likewise, defendants must have known that recorders are not called upon to question the validity of instruments offered for record; that a void conveyance might be in the apparent chain of title reflected by an abstract, and the infirmity not disclosed by the public record.\n\nComing to the defense of estoppel, we find that the defendants have pleaded it, with the particularity and precision that the law requires (Warren v. New York Life Ins. Co., 40 N.M. 253, 58 P.2d 1175; and anno. 120 A.L.R. 105); the substance of which we have stated.\n\nNeither the pleadings nor the findings state a single affirmative act on the part of plaintiffs that misled the defendants or induced them to purchase the property in suit. They did not alter the deed or place it of record or intimate to any person by words, acts, or silence, that Burke was the owner of the property or that they were not the owners. If they are estopped to claim title it must be upon defendants' theory that a duty rested upon them to apprise the public by court action, or other effective means, that another had caused to be placed of record a deed affecting the title to their property that was to all intents and purposes a forgery.\n\nAccording to defendants' plea of estoppel, their sole reliance for evidence of title in their grantors was upon the records of instruments affecting it in the county clerk's office, and the opinion of their respective examiners of abstracts of title. The finding of the court was to the effect that each defendant relied upon the opinion of its examiner regarding the title as reflected by the abstracts of title furnished by it.\n\nThe question then is: Did the plaintiffs owe a duty to every person (that is the public) to protect them individually and collectively (known or unknown) against the hidden defects in the record of the Burke deed, which required them to take some affirmative action, such as the filing of this or a like suit, or by otherwise giving record notice of their claim under penalty of losing their property? In no other way could the public (including the defendants) have been effectively warned of the\n\nlurking danger in the record, if, as here, the investigation of the title should go no further than the examination of an abstract of title.\n\nIt is the general rule that no such duty is owed to the public by an owner of real property.\n\nThe case of Wiser v. Lawler, 189 U.S. 260, 23 S. Ct. 624, 628, 47 L. Ed. 802, is quite instructive on the question of the duty of the owner of land to give public notice in such cases. Contract purchasers of mines, pursuant to an escrow agreement which required the proceeds of operations to be applied to the purchase price, and containing a forfeiture clause, issued prospectuses in which false statements regarding the title were made that misled purchasers of stock in that corporation. The mine owners' title was of record, but they knew of the sending out of such prospectuses and must have known they would mislead the public. The Supreme Court said:\n\n\"So, too, to constitute an estoppel, either by express representation or by silence, there must not only be a duty to speak, but the purchase must have been made in reliance upon the conduct of the party sought to be estopped. * * *\n\n\"No duty to speak arises from the mere fact that a man is aware that another may take an action prejudicial to himself if the real facts are not disclosed. * * * As stated by Bigelow on Estoppel, 5th Ed. page 596: 'So long as he is not brought into contact with the person about to act, and does not know who that person may be, he is under no obligation to seek him out, or to stop a transaction which is not due to his own conduct as the natural and obvious result of it.' It cannot be that A would be estopped by silence with respect to his title to property which B is about to purchase, when he has no knowledge that B contemplates buying and B has no knowledge that A is connected with the property. We know of no case holding that a man is estopped by silence as against the public, or any particular person with whom he has no fiduciary relations. It was said by the court of appeals of New York in Viele v. Judson, 82 N.Y. 32, 40, of the cases holding a party to be estopped by his silence: 'In all of them the silence operated as a fraud and actually itself misled. In all there was both the specific opportunity and apparent duty to speak. And, in all, the party maintaining silence knew that some one else was relying upon that silence, and either acting or about to act as he would not have done, had the truth been told. These elements are essential to create a duty to speak.'\" (Emphasis ours.).\n\nIn the case of Saylor v. Kentucky, etc., Corp., 205 Ky. 724, 266 S.W. 388, 389, 50 A.L.R. 666, to which is appended an extensive note on the question of estoppel for failure to disclose title, it is stated: \"There is no principle of law making it the duty of a landowner to seek out and ascertain whether others are wrongfully entering into negotiations for his land. It would render land titles very insecure if one could be estopped from claiming his property because\n\nhe had failed to learn of such transactions or because he could have reasonably known of such sale. The law of estoppel is exactly the opposite. Knowledge must be carried to the party sought to be estopped, and with such knowledge he must have acted or spoken, or have remained silent under circumstances that called for a statement on his part, and such statements or conduct must have been acted upon to the prejudice of the party seeking the estoppel.\"\n\nRegarding equitable estoppel, see Dye v. Crary, 13 N.M. 439, 85 P. 1038, 9 L.R.A., N.S., 1136; Id., 12 N.M. 460, 78 P. 533; Crary v. Dye, 208 U.S. 516, 28 S. Ct. 360, 52 L. Ed. 595; 10 R.C.L., Estoppel, Sec. 21; 2 Pom.Eq.Jur., 4th Ed., Secs. 805, 807, 811, 818; 19 A. J., Estoppel, Sec. 34; 21 C.J., Estoppel, Sec. 116.\n\nOn the specific question the decisions of the courts are almost unanimous in holding in cases where the facts are similar, that the owner of land is not estopped to claim title to his property. The question has been so decided innumerable times. The Supreme Court of California, in the early case of Meley v. Collins, 41 Cal. 663, 10 Am.Rep. 279, decided it. According to the facts of that case, a forged deed was recorded in 1859. The grantee therein sold to an innocent purchaser in 1865, who deeded the property to Collins in 1866. The owner of the land had known of the forgery and that it was of record prior to 1861. The action was commenced in 1867. The opinion applies so perfectly to the facts in this case that we quote therefrom, as follows:\n\n\"The case does not show that the plaintiff knew of the respective sales of the property by Gilbert and his vendee, or that either of them intended to effect a sale, until after the respective conveyances had been executed. * * * If the plaintiff is estopped to set up her title because the defendant purchased the property five years after the plaintiff knew that the deed was of record -- she not having taken any steps during that time to attack the deed -- then the delay of one year or one month would afford the defendant the same advantage. The proposition advanced in the instructions, when stripped of accidental and immaterial circumstances is, that if the defendant purchased the property and paid the consideration without any notice that the deed in question was a forgery, and after the plaintiff knew that the deed was of record, and before she had taken any steps to have it annulled, she is estopped to allege that it is not her deed.\n\n\"The cases which lay down the familiar doctrine -- that one who stands by, and purposely or negligently suffers his property to be disposed of by another, is estopped to assert his title to the property -- have no application here, for the plaintiff did not 'stand by' while Gilbert or his vendee was selling her property. * * *\n\n\"Could it be shown to be the duty of the owner of property, whenever another person asserts title to such property, or is apparently the owner of it, to proceed at once\n\nto vindicate his title and destroy the apparent title in such other person, there would be but little difficulty in holding that his neglect so to do, could be relied upon as an estoppel by a purchaser from such person, in good faith and for a valuable consideration. If such were the rule, there would be no difficulty in finding cases in point. * * * The owner of property is justified in relying upon his title; and he is under no obligation to proceed against all persons who may assert a hostile title, although another person might be deceived by the apparent genuineness of such hostile title. * * * In the case at bar, it cannot be said that the plaintiff, by any act or neglect, induced the purchase by the defendant. It was not her duty, if her own interests did not require it, to take the necessary steps to have the deed to Gilbert annulled. It is true that a purchaser from him, relying on the record, might be injured, but he could readily protect himself by exacting from his vendor the necessary covenants.\"\n\nThe decisions are so uniform on the question that we content ourselves with citing, without further comment, the following authorities to the same effect: 2 Pom.Eq.Jur., 4th Ed., Sec. 918; Kypadel Coal \u0026 Lumber Co. et al. v. Millard et al., supra; Balfour v. Hopkins, 9 Cir., 93 F. 564; Westlake et al. v. Dunn et al., 184 Mass. 260, 68 N.E. 212, 100 Am.St.Rep. 557; Catto v. Hollister et al., supra; Gioscio v. Lautenschlager et al., 23 Cal.App.2d 616, 73 P.2d 1230; Gulf C. \u0026 C. Co. v. Alabama C. \u0026 C. Co., supra; Hakes Inv. Co. v. Lyons, 166 Cal. 557, 137 P. 911; Franklin v. Killilea et al., 126 Wis. 88, 104 N.W. 993; Saylor v. Kentucky, etc., Corp., 205 Ky. 724, 266 S.W. 388, 50 A.L.R. 666, and anno. at pages 668 et seq.; Houston v. Forman, 92 Fla. 1, 109 So. 297, 48 A.L.R. 401 and anno. at page 405; Clevenger v. Moore, 126 Okl. 246, 259 P. 219, 54 A.L.R. 1237 and anno. at page 1246; Houston v. Adams, 85 Fla. 291, 95 So. 859; Sipes et al. v. Perdomo, supra; Johnston Realty Corp. v. Showalter, 80 Cal.App. 176, 250 P. 289; Everts v. Agnes, 4 Wis. 343, 65 Am.Dec. 314; Harkreader v. Clayton, 56 Miss. 383, 31 Am.Rep. 369; Spotts v. Whitaker et al., Tex.Civ.App., 157 S.W. 422; Houston Land \u0026 Tr. Co. v. Hubbard et al., 37 Tex.Civ.App. 546, 85 S.W. 474; Tisher v. Beckwith, 30 Wis. 55, 56, 11 Am.Rep. 546; Wallace v. Harmstad, 15 Pa. 462, 53 Am.Dec. 603; Stone v. French, supra.\n\nSlight negligence on the part of a land owner, coupled with knowledge that a void deed was of record, which together misled a purchaser into the belief that his grantor's title was good, has been seized upon by some courts as a ground of estoppel. Such are cases which hold that where an undelivered deed is placed of record with the knowledge of the grantor named therein, and through his negligence or permission, the grantee holds possession of the premises and thereby deceives a purchaser into believing the named grantee is the owner, the grantor is estopped to claim title as against a purchaser from the occupant of the land. Mohlis v. Trauffler, 91 Iowa 751,\n\n60 N.W. 521; Shurtz v. Colvin et al., 55 Ohio St. 274, 45 N.E. 527; Johnson v. Erlandson, 14 N.D. 518, 105 N.W. 722; Quick v. Milligan, 108 Ind. 419, 9 N.E. 392, 58 Am.Rep. 49; McConnell v. Rowland, 48 W.Va. 276, 37 S.E. 586; Haven v. Kramer, 41 Iowa 382; Blight v. Schenck, 10 Pa. 285, 293, 51 Am.Dec. 478; Mays v. Shields, 117 Ga. 814, 45 S.E. 68; Pittman v. Sofley, 64 Ill. 155, 156; Macomber v. Kinney, 114 Minn. 146, 128 N.W. 1001, 130 N.W. 851.\n\nThe oil lease executed by plaintiffs in 1926 granted to the lessee the right to explore for oil, gas, etc., for a term of ten years from its date, and thereafter as long as oil and gas, or either of them, are produced by the lessee. The only possession to which the mineral rights in the property were susceptible, was an entry followed by exploration for minerals. Heck v. Morgan, 88 W.Va. 102, 106 S.E. 413. This right to possession has rested in the lessee since 1926, but was not exercised by it until 1936, after this suit was filed. We need not approve or disapprove the doctrine of these cases; it is not applicable here, as neither of the defendants, their grantors or Burke have been in possession of the property at any time.\n\nWe have found but two cases (and no others are cited by the defendants), decided solely upon the proposition that the failure to expunge from the record a void deed before an innocent purchaser had bought the property described in the deed, is alone sufficient to estop the owner of the land from claiming title. These cases are: Allen et al. v. Powell et al., 65 Ind.App. 601, 115 N.E. 96, and Costello v. Meade, 55 How.Prac., N.Y., 356; neither of which is the opinion of the highest court of a state, and both are opposed to the great weight of authority.\n\nThe vice in the doctrine of these cases is that the duty to protect unknown would-be purchasers is shifted to the land owner in opposition to the rule caveat emptor. The legislature alone has such authority.\n\nNotwithstanding dicta in some opinions of courts of last resort, none, so far as we are informed, has held under similar facts that a land owner was estopped to claim title to his property.\n\nIn support of the defense of laches defendants assert they were bona fide purchasers for value without notice of plaintiffs' title, and the trial court so held. This was error. Defendants were not purchasers, and they have not the semblance of title. The application of the doctrine of \"bona fide purchasers for value without notice\" is limited to those who purchase the legal title to property without notice of outstanding equities, or knowledge of facts that charge them with such notice. It has no application to one who has no semblance of title. The rule is stated by the United States Supreme Court, through Chief Justice Marshall, as follows: \"The rules of law respecting a purchaser without notice, are formed for the protection of him who purchases a legal estate, and pays the purchase-money, without a knowledge of the outstanding equity; they do not protect a\n\nperson who acquires no semblance of title. They apply fully, only to the purchaser of the legal estate; even the purchaser of an equity is bound to take notice of any prior equity.\" Vattier v. Hinde, 7 Pet. 252, 253, 8 L. Ed. 675. And through Mr. Justice Brandeis, as follows:\n\n\"The claim which the relator makes in this court rests wholly upon the fact that the relator was a bona fide purchaser for value. But the doctrine of bona fide purchaser for value applies only to purchasers of the legal estate. Hawley v. Diller, 178 U.S. 476, 484, 20 S. Ct. 986, 44 L. Ed. 1157 [1158]. It 'is in no respect a rule of property, but a rule of inaction.' Pomeroy, Equity Jurisprudence ยง 743. It is a shield by which the purchaser of a legal title may protect himself against the holder of an equity, not a sword by which the owner of an equity may overcome the holder of both the legal title and an equity. Boone v. Chiles, 10 Pet. 177, 210, 9 L. Ed. 388, 400.\" Duncan Townsite Co. v. Lane, 245 U.S. 308, 38 S. Ct. 99, 101, 62 L. Ed. 309.\n\nAlso see: Hawley v. Diller, 178 U.S. 476, 20 S. Ct. 986, 44 L. Ed. 1157; Boone v. Chiles, 10 Pet. 177, 9 L. Ed. 388; Mitchell v. Sherman E. McEwen Associates, 360 Ill. 278, 196 N.E. 186; Myers v. Van Buskirk, 96 Fla. 704, 119 So. 123; Dodge v. Briggs, C.C., 27 F. 160; Texas Lbr. Mfg. Co. v. Branch, 5 Cir., 60 F. 201; Betts v. Ward, 196 Ala. 248, 72 So. 110; King v. Diffey, Tex.Civ.App., 192 S.W. 262; Allen v. Ayer, 26 Or. 589, 39 P. 1; Gibson v. Gibson, 200 Ala. 591, 76 So. 949; Thomas v. Scougale, 90 Wash. 162, 155 P. 847, Ann.Cas.1918C, 452, and note beginning at page 456.\n\nThe defendants are not bona fide purchasers for value; a subject we will again discuss in this opinion.\n\nBut if defendants had been innocent purchasers (and they were not) it would have availed them nothing. The bar of laches has no application because it never runs in favor of one claiming real property, by or through a void deed, who is not in possession; or against a duly recorded title, Secret Valley Land Co. v. Perry, 187 Cal. 420, 202 P. 449; Stanley et al. v. Westover, 93 Cal.App. 97, 269 P. 468; Sanborn v. South Florida Naval Stores Co., 75 Fla. 145, 78 So. 428; Baker v. McFarland, 77 Tex. 294, 13 S.W. 1042; Myers v. DeLisle, 259 Mo. 506, 168 S.W. 676, 52 L.R.A., N.S., 937; Chilton v. Nickey, 261 Mo. 232, 169 S.W. 978; Kypadel Coal \u0026 Lbr. Co. v. Millard, supra.\n\nUnder the facts the plaintiffs were not barred by laches. This conclusion is supported both by reason and the great weight of authority.\n\n\"* * * Any alteration of a deed by erasure or substitution of the name of the grantee is a material alteration and forgery just as is an unauthorized signing of the grantor's name * * * (16 Am.Jrs. 'Deeds' Sec. 26). A forged deed, in the sense defined above, is absolutely void and wholly ineffectual to pass title, even to a subsequent innocent purchaser from the grantee under such forged deed. * * * (Id. Sec. 27). Mere delay in suing to recover\n\npossession of land purporting to be conveyed by a forged deed or in having the instrument set aside short of the time necessary to establish title in the grantee and those claiming through him by adverse possession does not affect the grantor's right to relief even as against an innocent purchaser from the purported grantee under a forged deed. * * * (Id. Sec. 28.)\n\n\"The plaintiff brings this action to quiet her title to all the land described in the complaint. She obtained a judgment. She is the owner of the patent title. Defendants claim under a deed which is clearly and confessedly forged, and appeal to this court. The claim is that plaintiff was negligent in not looking after her title, procuring abstracts, and promptly commencing an action to cancel the forged deeds.\n\n\"The claim is futile. A party who has a good title to real property under recorded deeds has no occasion to keep watch of his title. Every purchaser or mortgagee must at his peril see that he gets title from one having title to convey. The appeal presents nothing worthy of any consideration or comment.\" Catto v. Hollister, et al., 39 N.D. 1, 166 N.W. 506, 507.\n\nAlso see: Colby v. Title Ins. Co., 160 Cal. 632, 117 P. 913, 35 L.R.A.,N.S., 813, Ann.Cas.1913A, 515; Gioscio v. Lautenschlager et al., supra; Spotts v. Whitaker et al., supra; Houston Land \u0026 Trust Co. v. Hubbard et al., supra; Johnston Realty Co. v. Showalter, supra; Kypadel Coal \u0026 Lumber Co. et al. v. Millard, supra; Saylor v. Kentucky, etc., Corp., supra, and anno. particularly at page 712 of 50 A.L.R.; Secret Valley Land Co. v. Perry, 187 Cal. 420, 202 P. 449; Smith v. Burrus, 139 Ga. 10, 76 S.E. 362; Chandler v. White, 84 Ill. 435; French v. French, Court of Chancery of Tenn., 52 S.W. 517; Newport v. Hatton, 195 Cal. 132, 231 P. 987; 51 C.J. \"Quieting Title\" Sec. 128; 2 Pom.Eq.Jur., 3d Ed., Secs. 805, 810, 821; 19 Am.Jur. \"Equity\" Secs. 498 et seq; 21 C.J. \"Equity\" Sec. 211 et seq.\n\nA number of the cases cited in support of our conclusion on the question of estoppel also supports our conclusion on the question of laches.\n\nA land owner is neither estopped to claim title nor is he barred from asserting it by laches, if his only fault is failure to sue to expunge from the public records a forged or void deed to lands in the actual possession of no one, which he neither made nor had recorded; although he knew, or should have known, that one of the public unknown to him, might purchase the property, assuming the validity of the record of the void instrument.\n\nThis disposes of every question raised by the assignment of errors and would ordinarily determine the case. The special defenses were bottomed upon the assumption that plaintiffs owed a duty to the public to expunge the Burke deed from the records, and upon nothing else. Defendants stated in their original answer brief that there were but two controlling questions:\n\n\"1. Did the trial court err in its finding that Mosley agreed to sell to Asbury an undivided three-fourths interest in the minerals in the SE 1/4 of Sec. 10 for a consideration of $800 and that Asbury paid the purchase price within the stipulated time?\n\n\"2. Are the appellants precluded by laches and estoppel from any recovery?\"\n\nThese questions have been answered, but defendants submitted certain objections to our opinion and decision in their second motion for rehearing, which will now be disposed of. It is said: \"That the opinion of the court is based largely upon precedents in which the facts involved are entirely different from the facts involved in this cause whereby important and substantial equitable rules applicable in this case have been ignored by the court.\"\n\nThe argument is that the rule which we have followed, holding that a materially altered deed is void and that an instrument wrongfully obtained from escrow passes no title, is not applicable to the facts of this case. Defendants state: \"* * * There is no doubt about the rules as laid down by these cases, but to apply them to the facts of this case and permit them to control the decision of this court is to surrender principles of equity for technical rules, and to ignore the controlling equities in the case. They are cases in which the owner was defrauded without having any connection with the transaction, and certainly no duty could be cast upon him to expunge the record.\"\n\nAs we understand, defendants' contention seems to be that while the land owner is not required to expunge from the record a forged instrument made with intent to defraud, he is required to do so where there was no injury or intentional wrong doing.\n\nDefendants have cited no authorities in support of their proposition and we have found none.\n\nThe trial court made no decision upon the question of whether the alterations and substitutions in the Burke deed were made with a fraudulent intent, but it is utterly immaterial with what intent or what motive these erasures and substitutions were made. We will assume that there was no fraudulent intent and that the motive was honest. Nevertheless the deed was a nullity and was of no more force and effect than if it had been forged with intent to defraud. Wood v. Steele, 6 Wall. 80, 81, 18 L. Ed. 725. In this case the Supreme Court of the United States said:\n\n\"It was a rule of the common law as far back as the reign of Edward III, that a rasure in a deed avoids it. * * * It is now settled, in both English and American jurisprudence, that a material alteration in any commercial paper, without the consent of the party sought to be charged, extinguishes his liability. * * *\n\n\"The grounds of the discharge in such cases are obvious. The agreement is no longer the one into which the defendant entered. Its identity is changed; another is substituted without his consent; and by a party who had no authority to consent for\n\nhim. There is no longer the necessary concurrence of minds. * * *\n\n\"The defendant could no more have prevented the alteration than he could have prevented a complete fabrication; and he had as little reason to anticipate one as the other. The law regards the security, after it is altered, as an entire forgery with respect to the parties who have not consented, and so far as they are concerned, deals with it accordingly.\"\n\nAlso see: Gray v. Williams, 91 Vt. 111, 99 A. 735; Otto v. Halff, 89 Tex. 384, 34 S.W. 910, 59 Am.St.Rep. 384; Holloway v. Gano, 125 Kan. 3, 262 P. 573; Idaho State Bank v. Hooper Sugar Co., 74 Utah 24, 276 P. 659, 68 A.L.R. 969; and see 2 A.J. \"Alteration of Instruments\" Sec. 16; 3 C.J.S., Alteration of Instruments, ยง 7.\n\nA distinction is made in cases of commercial paper only to the extent that if the intent with which the alteration was made was not fraudulent, an action may be maintained on the original debt, but the paper itself is utterly void and the alteration discharges the collateral security. Otto v. Halff, supra; Holloway v. Gano, supra; 3 C.J.S., Alteration of Instruments, ยงยง 9 and 10. But in this case there was no debt upon which to sue. The contract was all contained in the undelivered deed. The effect was no different than if the whole instrument had been forged. Otero v. Albuquerque, supra.\n\nThe result is that the transactions with Asbury left plaintiffs with title in fee simple, evidenced by a patent from the United States to the property in question. We know of no special rule of estoppel that would apply to the facts of this case. The defendants have no title, and the plaintiffs have not, by act, word, or silence, estopped themselves from claiming title.\n\nDefendants' next contention is as follows: \"That contrary to fundamental principles of equity the court has rendered an inequitable decree in that it has permitted plaintiffs who sold their property, received and retained the agreed purchase price, and acquiesced in such sale for many years while the property increased substantially in value, to come into this court and obtain affirmative relief in the nature of a decree quieting their title to said property.\"\n\nAt the request of Asbury, two deeds were made by plaintiffs to him as grantee; one conveying 1/2 the underlying minerals and the other 1/4 thereof, in 160 acres of land, for a consideration of $800. Evidently the property in suit was valued at the time at 2/3 of $800, or $533.33. Our conclusion, it is asserted, is inequitable because the plaintiffs have never tendered to anyone the $533.33; and particularly they have not tendered it in this suit. This question is raised for the first time on the second motion for rehearing and is not available to defendants, but in any event is without merit.\n\nIf ordinarily plaintiffs should have tendered the consideration in the district court (Sloss-Sheffield Steel \u0026 Iron Co. v. Board of Trustees, Etc., 130 Ala. 403, 30 So. 433;\n\nTwin Lakes Land \u0026 Water Co. v. Dohner, 6 Cir., 242 F. 399), the error is not available to defendants now.\n\nIf it has merit, the question should have been raised in the district court by demurrer or motion to dismiss the bill for want of equity. The case was tried on its merits below without objection to the pleadings, and we must necessarily follow the course of that trial. Twin Lakes Land \u0026 Water Co. v. Dohner, supra. The trial court could have imposed conditions in the absence of a tender, if his decision had been in favor of the plaintiffs. Jones v. McGonigle, 327 Mo. 457, 37 S.W.2d 892, 74 A.L.R. 550.\n\nMuch is said by defendants regarding plaintiffs' retention of the consideration paid them for the land. We are not advised just what they should have done with the money. To whom should it have been tendered, and who would have accepted it? They were diligent in employing attorneys when they discovered the altered deed, but they were advised at that time they were without remedy. We are well satisfied no party to these transactions (surely not the defendants) would have accepted the money if it had been tendered. Plaintiffs were justified in holding it until the question of title could be settled in court.\n\nIt is asserted that the long time which elapsed between the discovery by plaintiffs of the alterations and the filing of this suit, the receipt by defendants of the rental of $10 per annum for a number of years, and the retention of the consideration, constituted a ratification of the alterations in the deed and its delivery.\n\nRatification was not pleaded, was not raised in the district court or in this court, except in the second motion for rehearing. It cannot be considered by us. Candelaria v. Gutierrez, 30 N.M. 195, 230 P. 436; Smith v. Barnes, 51 Mont. 202, 149 P. 963, Ann.Cas.1917D 330; Erickson v. First Nat'l Bank, 44 Neb. 622, 62 N.W. 1078, 28 L.R.A. 577, 48 Am.St.Rep. 753; Wayne County Nat'l Bank v. Kneeland, 61 Okl. 265, 161 P. 193; Bolt v. State Sav. Bank, Tex.Civ.App., 179 S.W. 1119. The burden of proof to show ratification (if the deed could have been ratified) was on defendants (State v. Findley, 101 Mo. 368, 14 S.W. 111), and there is no finding or substantial evidence of a ratification.\n\nThere are authorities which hold that a materially altered deed may be ratified by the grantors named in it without a re-execution or new delivery; while others hold, with the better reason, it would seem that as a sale of real estate to be binding must be evidenced by a memorandum in writing signed by the person to be bound (Statute of Frauds) and duly delivered, an unauthorized alteration could not be ratified except by a new execution and delivery. Moelle v. Sherwood, 148 U.S. 21, 13 S. Ct. 426, 37 L. Ed. 350; Waldron v. Waller, 65 W.Va. 605, 64 S.E. 964, 32 L.R.A.,N.S., 284; Church v. Combs, 332 Mo. 334, 58 S.W.2d 467. On this question generally see notes, Ann.Cas.1917D, 335; 67 A.L.R. 364.\n\nWe need not, at this time, choose between the rules, for ratification was not\n\nproven under either. The failure to bring suit earlier and the retention of the consideration paid by Asbury did not, as we have held, affect the defendants' title. Now it is asserted (without finding to support it) that defendants claim of title was ratified or acquiesced in by the failure of plaintiffs to object to the payment of the $10 monthly rental by plaintiffs' lessee to the defendants. It is asserted that the receipt of this rental was equivalent to possession; that it was \"the only possession to which the property was susceptible.\"\n\nUnder the terms of the lease the Humble Oil \u0026 Refining Co. was entitled to possession of the property by entry for the purpose of operating for oil and gas, and this was the only possession to which the property was susceptible. The lessee did not take possession until 1936 (after this suit was filed), and neither Burke nor the defendants has had possession of the property at any time.\n\nIt has been held that one claiming under a void deed obtains no title, or right that can ripen into a title, by paying taxes acquiesced in for years by the owners, and which they had failed to pay; that only actual possession can accomplish it. Merrifield v. Buckner, 41 N.M. 442, 70 P.2d 896; Sanborn v. South Florida Naval Stores Co., supra; Myers v. DeLisle, supra. The failure of plaintiffs to object to the payment of the rental to defendants was not a ratification of the Burke deed, even though ratification had been pleaded as a defense, and could have been accomplished without a new execution and redelivery of the deed.\n\nThe case of Patterson v. Hewitt, 11 N.M. 1, 66 P. 552, 55 L.R.A. 658, affirmed in 195 U.S. 309, 25 S. Ct. 35, 49 L. Ed. 214, cited by defendants, is not in point. Hewitt held the legal title, and he and associates were in possession of the mining property, and had been for eight years, and had performed the labor and advanced the money for five years for its development, which resulted in the discovery of a large body of gold ore. It was held that eight years delay in bringing his action for a deed barred Patterson's right. This is an entirely different case. The defendants have neither title, semblance of title, possession, or any other claim upon the property.\n\nDefendants' misfortune is to be regretted, but we find no inequitable conduct on the part of plaintiffs that should deprive them of their statutory right to quiet the title to their property as against the defendants who have no semblance of title.\n\nThe last question is whether a decree following our opinion will award equitable relief to plaintiffs in court with unclean hands; and if so, whether we should order a dismissal.\n\nThis contention was not made below, and is first raised by defendants in their second motion for rehearing. Under the rules and decisions of this court, the defendants are not authorized to raise it at this stage of the proceeding.\n\nIt is asserted, however, that courts regard the \"clean hands\" maxim as of such importance that they will raise the question on their own motion in proper\n\ncases. This is correct, generally speaking, but the trial court, who alone is the trier of facts in this state, should have acted, or should have been called upon first to act upon the matter.\n\nPlaintiffs' \"unclean hands,\" defendants assert, are proved by the following:\n\n1. That plaintiffs pleaded and testified that they sold only a one-fourth interest in the minerals to the defendants for the $800; that the Burke deed was a copy of the other deed, signed at Asbury's request; that it was altered by Asbury so that it purported to convey a one-half interest in the minerals; that such testimony was willfully false.\n\n2. That the plaintiffs allege in their amended complaint, and testified, that to show of record their interest in the land in question the plaintiff, Ennis C. Mosley, conveyed to his wife the property in question, and she thereafter conveyed the same back to him, and placed the deeds of record, thereby making a double record of their claim. This, it is asserted, was false and known to be false, because the first of the two deeds was made and recorded before plaintiffs knew of the alterations in the Burke deed.\n\nThere is a sharp conflict in the testimony as to whether the deed as orginally written, purported to convey one-fourth or one-half the minerals. It is true, the district judge, upon weighing the evidence, decided that it originally conveyed a one-half interest, but he did not hold by this decision that plaintiffs were perjurers. Cases must be decided, and the district judge finds the facts according to what, in his judgment, the weight of the evidence establishes; but he is not infallible, and his findings may be incorrect notwithstanding we are bound by them.\n\nRegarding the last charge, neither of the plaintiffs signed or verified the pleadings, nor did their testimony support the allegations mentioned.\n\nThe defendants have cited no case from any appellate court that has decided the question as presented here. In our search only two cases have been found where the maxim was raised first and enforced in an appellate court. They are: Armstrong v. Gresham, 73 Colo. 13, 213 P. 114; and Primeau v. Granfield, 2 Cir., 193 F. 911. The defendants, after a contest on the merits in which they were losers, and as a last resort, seek to relegate the plaintiffs to an action at law. If we should dismiss a case upon such grounds and as here raised, there will be no shadow of doubt of the iniquity of the party, and we do not find this to be such a case.\n\nThis disposes of all questions raised by the parties. But a new doctrine has been injected into the case, which should not be passed without comment. It is said that our conclusion \"results in a grave injustice to innocent purchasers of a valuable property and operates to return said property to the plaintiffs, its former owners, who then will have both the property and the money paid them for it.\" This statement is not correct. Defendants are not purchasers (innocent or otherwise) of any interest,\n\nlegal or equitable, in the property, and plaintiffs are not \"former owners,\" but the owners of the property. It will not be returned to them because they have owned it since it was patented.\n\nBeginning with an unwarranted premise, it is then asserted that as defendants are \"innocent purchasers\" the doctrine of laches runs in their favor. We have held, and all agree, that defendants are not bona fide purchasers for value; that they purchased no interest, legal or equitable, in the property, and have never been in possession. They are not \"innocent purchasers\" of anything. Laches never run in favor of one who has never contacted the title or possession of property. That is the situation of the defendants. The bar of laches cannot run in their favor (see authorities heretofore cited on this question). The fact that they paid out their money for a spurious title without knowledge of plaintiffs' title, or any facts which, under the law would require them to take notice of it (if true) avails nothing.\n\nAs we have stated, defendants are not purchasers at all, and we know of no rule of law that permits one, who has neither a legal or an equitable interest in property, or the possession of it, to avail himself of the bar of laches against the owner. We need not pass upon the question of whether the defendants are \"innocent purchasers\" in the sense suggested, but should state that we do not subscribe to the doctrine advanced that a would-be purchaser of property, who has actual notice of the contents of a recorded deed, may ignore it and be held immune from the charge of negligence or gross negligence, if after \"weighing the possibilities or probabilities\" of ownership, he accepts a spurious title. It is our understanding that when a prospective purchaser of property has knowledge that another claims title thereto under a recorded deed, he is conclusively charged, not only with notice of the contents of the deed, but with notice of \"all the estates, rights, titles and interests created or conferred by it or arising from its provisions,\" and he buys at his peril, 2 Pom.Eq.Jur., 4th Ed., Sec. 655. It is more than notice; it is knowledge of the fact of a claim of title, and he takes subject to the legal effect of such deed, notwithstanding he \"weighed the probabilities\" of ownership and therefrom came to the decision that the title was in another than the real owner. Such a doctrine would destroy the intended effect of the recording acts. Kidder v. Pueschner, 211 Wis. 19, 247 N.W. 315; 2 Pom.Eq.Jur. (4th ed.) Secs. 649 and 655; Ochoa v. Hernandez Y Morales, 230 U.S. 139, 33 S. Ct. 1033, 57 L. Ed. 1427; United States v. S. P. \u0026 C. del Agua Co., 4 N.M. 405, 17 P. 337; 23 R.C.L. \"Records\" Sec. 83; Loser v. Plainfield Sav. Bank, 149 Iowa 672, 128 N.W. 1101, 31 L.R.A.,N.S., 1112; Northwestern Nat'l Bank v. Freeman, 171 U.S. 620, 19 S. Ct. 36, 43 L. Ed. 307; Krueger v. United States, 246 U.S. 69, 38 S. Ct. 262, 62 L. Ed. 582; Simmons Creek Coal Co. v. Doran, 142 U.S. 417, 12 S. Ct. 239, 35 L. Ed. 1063; Warville on Abstracts of Title, 4th Ed., Sec. 61; Devlin on Deeds, 3d Ed., Sec.\n\n741; 5 Thompson on Real Property, Secs. 4025-4128.\n\nFor the purpose of securing facts upon which to base a conclusion that defendants were \"innocent purchasers\", the findings of the court have been supplemented by resort to the testimony, in violation of a rule long established in this state. We have consistently held that this court is not a fact finding body; Greenfield v. Bruskas, 41 N.M. 346, 68 P.2d 921; and that the facts found by the trial court, if supported by substantial evidence, are the basis of a decision by this court. Daniel v. Clark, 39 N.M. 494, 50 P.2d 429. We stated in Dailey v. Foster, 17 N.M. 654, 134 P. 206, 208:\n\n\"* * * It is manifest, therefore, that the court failed to specifically find upon one of the material issues in the case. Judgment, however, was entered for the defendant, and, as the plaintiff had the burden of proof, the presumption is that the court found this issue in favor of the defendant.\n\n\"'We cannot aid the finding by inference or intendment, and must regard silence upon a material point as a finding against the party having the burden.' Coffinberry v. McClellan, 164 Ind. 131, 73 N.E. 97.\"\n\nWe approved this holding in Byerts v. Schmidt, 25 N.M. 219, 180 P. 284. As far as we have gone regarding essential facts not found, is to remand the case for further findings, Farmers' Dev. Co. v. Rayado L. \u0026 I. Co., 28 N.M. 357, 213 P. 202; and to assume that where the trial court refused requested findings upon any particular proposition, that in support of the judgment the facts would be considered as made the converse of those requested, (the correctness of which this writer seriously questions), In re Frick Book \u0026 Stat. Co., 38 N.M. 120, 28 P.2d 660. Certainly it would not be so in the absence of substantial evidence to support a converse finding.\n\nSome courts hold that no fact other than those specifically included in the findings of the trial court will be presumed or implied, Tackett v. Cunningham, Tex.Civ.App., 91 S.W.2d 965; others that all additional facts necessary to sustain a judgment will be implied if there is evidence not in conflict with the express findings that would support them, Barth Merc. Co. v. Jaramillo, 46 Ariz. 365, 51 P.2d 252; Henke \u0026 Pillot v. Amalgamated, etc., Co., Tex.Civ.App., 109 S.W.2d 1083; Hanna, etc., Bank v. Matson, 53 Wyo. 1, 77 P.2d 621; and still others hold that in the absence of a finding of fact on a particular point necessary to support a judgment, it will be presumed that there was not sufficient evidence to warrant it, Calloway v. Twin City Creamery Co., 190 Wash. 173, 67 P.2d 329; MacDiarmid v. McDevitt, 97 Cal.App. 414, 275 P. 500; Hubbard v. San Diego Elec. R. Co., 201 Cal. 53, 54, 255 P. 508. But the rule of this court is that where special findings of fact are silent on a material point, it is deemed to be found against the party having\n\nthe burden of proof, if not waived; in this case the defendants. Byerts v. Smith, supra.\n\nWe are not permitted to supplement the findings of the trial court by resort to the testimony. If the findings are incomplete in that they are silent on any material point, it should be supplied as an ultimate fact found against defendants, who, in this case, have the burden of proof on all contested issues; unless the case should be remanded to complete the findings. Byerts v. Schmidt, supra.\n\nThe defendants requested no findings of fact, and made no objection to any found by the court, in the preparation of which we assume they assisted. The testimony is out of the case except for review to determine whether the findings are supported by substantial evidence, or whether requested findings should have been made, or to construe ambiguous findings. It is superseded by the findings of fact. Wells v. Gulf R. Co., 42 N.M. 378, 79 P.2d 921; Wilson v. Williams, 43 N.M. 173, 87 P.2d 683; Wright v. Atkinson, 39 N.M. 307, 46 P.2d 667; In re Chavez' Will, 39 N.M. 304, 46 P.2d 665; Daniel v. Clark, 39 N.M. 494, 50 P.2d 429; Fair v. Morrow, 40 N.M. 11, 52 P.2d 612.\n\nBut, accepting all the alleged facts lifted from the testimony and the opinion of the trial court as supplementing the findings of fact, it is not established that defendants were bona fide purchasers for value, or entitled to the protection of the bar of laches.\n\nIt is said, \"All authorities hold that a party may not in equity recover property for which he has been paid without tendering back the purchase price.\" True, of course, if title has passed, and the action is in fact to recover it. The rule stated has application to suits to recover property, the title to which has passed to one who fraudulently obtained it, or the like. This is not an action to recover the title to property. The plaintiffs have never parted with it. The purpose of the action was to remove a cloud from plaintiffs' title, and quiet title presently vested in them. The statute authorizes such action, and to maintain it plaintiffs are not required to tender to anyone the consideration received for an abortive sale from a person who claims no interest in the property; but the trial court, on equitable principles, may require it.\n\nIt is unnecessary to choose between the Federal rule, or the general rule of reasonable diligence regarding implied notice, to determine whether defendants are \"innocent purchasers\" in the sense stated. The bar of laches is not available to them under either. The question of implied notice is not in the case.\n\nThis court has applied both the Federal rule and the rule of reasonable diligence on the question of implied notice, and we do not agree that we are bound to either. We leave it open to be decided when the occasion arises.\n\nThe special defenses were bottomed upon the assumption that plaintiffs owed a duty to the public to expunge the Burke deed Page 261} from the records, and upon nothing else. Much confusion would have been avoided if the issues had been confined to those made by the parties under the assignment of errors. But the importance of the case has impelled us to decide questions which, under the facts found and the issues presented, were not ordinarily subject to review.\n\nThe second motion for rehearing is overruled. The judgment is reversed and cause remanded with instructions to set aside the decree and enter a decree for plaintiffs. The condition that plaintiffs pay into the court, for its disposition, $533.33 with six per cent from date of payment, may be added if the trial court is of the opinion that this should be required.\n\nIt is so ordered.\n\nBICKLEY, Justice (concurring specially).\n\nOf course the burden of proof is on the party alleging and relying on estoppel to establish all the facts necessary to constitute it. 21 C.J. 1250. This is true in the ordinary case. The principles of estoppel are salutary, yet they are, in this case, confronted with the equally wholesome penalty doctrine, designed broadly to discourage forgeries and similar offenses, as well as to protect the title holders to the effect that the innocent purchaser takes nothing by a forged deed. In this clash between the application of beneficial doctrines, we should apply severer tests to a claimed estoppel than ordinarily, lest the retarding effect of the penalty doctrine be unduly diminished. In other words, the ordinary burden of proof, under the circumstances here present, is elevated into a heavier burden, and he who asserts estoppel to destroy the penalty doctrine must be charged with a greater degree of diligence in examination of the record of title he contemplates acquiring than in the ordinary case where no adverse public policy doctrine stands in the way.\n\nSo viewing the matter, I find that the case for laches and estoppel urged by the defendants is not strong enough to render inoperative the penalty doctrine and turn the plaintiff out of court, and, in practical effect, transfer the title to the defendants, a result which the penalty doctrine repels.\n\nFurthermore, the vital circumstance that the material alterations in the deeds had been made before delivery was unknown to plaintiffs during the period of time when, according to defendants' theory, plaintiffs were under a duty to speak more effectively than by the recorded conveyances from Mosley to his wife and from her back to him. Whatever attacks the Mosleys contemplated making upon the conveyances alleged to have been made by them to Asbury might have failed and still the vital one of material alteration before delivery of the deed they executed with Asbury as the intended grantee have left the title in the Mosleys. Even though the views of the dissenting Justices may be persuasive that\n\nthe Mosleys were under a duty to more emphatically assert their claim of alteration of the deed, they may not be properly charged with laches in publishing to the world that the alteration was made before delivery, because this they did not know until after this law suit was commenced.\n\nI accept it as apparent that the Mosleys claimed attempt to give notice of the alterations in the deed to Asbury, by the interchange of the recorded deeds aforesaid, was not for the purpose of giving notice of the vital circumstance that the alterations were made before delivery, because of this circumstance they were not aware. Yet it may be that the inquiry which should have been stimulated by the record of this interchange of deeds between the Mosleys would have led inquiring minds to knowledge of the fact of the alterations, and also to the circumstance of alteration before delivery. It is not known just what started the inquiry by the defendants, but it is apparent that they found out more than the plaintiffs knew, namely, that the alterations were made before delivery, because it was through the defendants that the plaintiff learned at the trial of this law suit of the chronological relation of alterations and delivery.\n\nWhat they learned when they learned it, they might have learned in time to have forestalled their purchase had they timely taken notice of the records.\n\nI concur in the decision of Mr. Justice BRICE.\n\nSADLER, Justice (dissenting).\n\nThe majority opinion results in a grave injustice to innocent purchasers of a valuable property and operates to return said property to the plaintiffs, its former owners, who then will have both the property and the money paid them for it. And they are to have this relief at the hands of a court of equity in a strict application of the penalty doctrine in its relation to altered instruments under facts which I believe fully sustain the trial court's finding that they are guilty of laches. Equity's abhorrence of penalties and forfeitures is axiomatic. And while equity courts as well as courts of law recognize and will enforce the penalty doctrine, nevertheless, where no fraud is perpetrated on the party invoking it, equity's abhorrence of penalties should prompt it to seize upon even slight circumstances to estop a party from reaping benefits under it as against innocent purchasers.\n\nWe must determine at the threshold the propriety of applying the doctrine of laches in favor of the defendants. This prompts the inquiry whether they are innocent purchasers. The trial court so found. If such, they are entitled to the benefit of the doctrine. I will accept the majority view that materially altering the mineral deed prior to delivery left the plaintiffs invested with the legal title to the property involved. But this does not settle the question of their present right to it. The more pertinent inquiry is whether they are in a position to assert their title against the\n\ndefendants. I think they may not because the defendants occupy the position of innocent purchasers, in the sense of having purchased in good faith, and are entitled to interpose laches.\n\nThe only things appearing in the abstract pointed out as calculated to put either defendant upon inquiry at the time of their respective purchases were the entries in reference to the Paine transaction. In its statement of plaintiffs' and defendants' chain of title, the prevailing opinion does not disclose that on June 11, 1928, a lis pendens notice was recorded in Lea County, New Mexico, incident to a suit by Paine against the Mosleys for breach of agreement to convey to Paine a one-half interest in the minerals in the property involved. This lis pendens was dissolved by dismissal of the Paine suit on July 11, 1928, the date upon which Paine recorded his deed from the Mosleys, dated June 23, 1928, to a one-fourth mineral interest.\n\nIn summarizing the pleadings, the opinion recites the allegations of plaintiffs' reply to the defenses of estoppel and laches which were in substance that the deed from Mosley to his wife recorded June 7, 1928, and the deed from the wife back to Mosley, recorded July 3, 1928, were made for the purpose of showing by the public record their claim to the property. These were mere allegations and the majority do not contend there is the slightest evidence in the record to support them. On the contrary, at the time of Mosley's deed to his wife, recorded June 7, 1928, the Mosleys were ignorant of the fact that their deed had been altered, something they learned for the first time on June 22, 1928. This is conceded. It seems obvious that the deed from Mosley to his wife was made in an effort to avoid the Paine contract upon which the Mosleys were sued two days later. And the wife's deed back to Mosley, recorded July 3, 1928, was made in connection with the Paine settlement, whereby the Mosleys conveyed to Paine the one-fourth interest of which they still had record ownership for exactly one-half the price they had agreed to convey one-half interest. The trial court found that Paine sued the Mosleys to enforce his contract with them and that these deeds between husband and wife \"were in connection with their trouble and litigation with Paine\".\n\nThe cases of Kitchen v. Schuster, 14 N.M. 164, 89 P. 261, and Taylor v. Hanchett Oil Co., 37 N.M. 606, 27 P.2d 59, lay down the rule that has been adopted in this jurisdiction on the question of constructive notice (perhaps more correctly denominated \"implied notice\" in its application to the facts of this case. Mishawaka-St. Joseph Loan \u0026 Trust Co. v. Neu, 209 Ind. 433, 196 N.E. 85, 105 A.L.R. 881). The true rule to be deduced from these decisions is that absent actual notice, where the facts brought to the knowledge of the intending purchaser are such that in the exercise of ordinary care he ought to inquire, but does not, and his failure so to do amounts to gross or culpable negligence, he will be\n\ncharged with a knowledge of all the facts which the inquiry, pursued with reasonable diligence, would have revealed. Want of ordinary care alone will not charge him. The circumstances must be such that the failure to make the inquiry suggested by ordinary care will convict the intending purchaser of gross or culpable negligence if he is to be visited with all the consequences of having made the purchase with actual knowledge of the facts. That such is the test applied in this jurisdiction as early as the decision in Kitchen v. Schuster, supra, and more recently in Taylor v. Hanchett Oil Co., supra, seems clear. Note this language of the rule, quoted approvingly in the Taylor case [37 N.M. 606, 27 P.2d 60] from United States v. Detroit T. \u0026 L. Co., 200 U.S. 321, 26 S. Ct. 282, 50 L. Ed. 499, to-wit: \"'the question, then, when it is sought to affect a purchaser with constructive notice, is not whether he had the means of obtaining, and might, by prudent caution, have obtained the knowledge in question, but whether not obtaining was an act of gross or culpable negligence.'\"\n\nThis is what is known as the federal rule on constructive notice. We adopted it in Kitchen v. Schuster, supra, in territorial days and have reaffirmed it since statehood, in Taylor v. Hanchett Oil Co., supra, after being freed from the binding effect of United States Supreme Court decisions on such a matter. In Kitchen v. Schuster, supra [14 N.M. 164, 89 P. 265], we quoted approvingly from United States v. Detroit T. \u0026 L. Co., supra, as follows: \"The proper rule governing constructive notice is in our judgment stated in United States v. Detroit Co., 200 U.S. 321, 323, 26 S. Ct. 282, 285, 50 L. Ed. 499, where it is said: 'When a person has not actual notice he ought not to be treated as if he had notice, unless the circumstances are such as enable the court to say, not only that he might have acquired, but also that he ought to have acquired it, but for his gross negligence in the conduct of the business in question. The question then, when it is sought to affect a purchaser with constructive notice, is not whether he had [the] means of obtaining [and might, by prudent caution, have obtained] the knowledge in question, but whether not obtaining was an act of gross or culpable negligence.'\"\n\nCahill v. Seitz, 93 App.Div. 105, 86 N.Y.S. 1009, 1013, is a case in which it was sought to charge a purchaser through a judgment roll in a foreclosure action that a guardian in socage bid in the property from the showing in said roll that the owner was an infant, that her mother and father had died intestate, and that she lived with such guardian, who was her paternal uncle, and had no other general or other guardian. The court, after stating the contention of plaintiff's counsel, said: \"We feel constrained to differ with him. * * * While the rule charging people with knowledge of the law includes principles which are complex, obscure, and of infrequent application, as well as those\n\nwhich are simple and familiar, we do not think it is out of the way, in the consideration of what was a reasonable diligence in reference to this title, to bear in mind that a guardianship in socage comes by operation of law, rather than by express appointment; that it is of comparatively infrequent occurrence, and seldom becomes an important element in the transmission of titles. An attorney of average experience and expertness in examining a title might very well fail to direct his mind to the possibility of such a guardianship. We see nothing in the facts disclosed by the judgment roll, that Cahill was the uncle of and temporarily harboring plaintiff, who was an infant and an orphan, to suggest that he was her oldest and nearest relative, and therefore her guardian by operation of law. It seems to us that the facts disclosed were entirely negative upon this subject. It might just as well be thought that he was the youngest as well as the oldest uncle. In fact, the evidence given by plaintiff herself upon the trial was not altogether too clear upon this point. Neither do we think that there was anything in the purchase by Cahill of this property upon the sale which was reasonably calculated to excite inquiry and lead to information. The presumption is in favor of legal conduct, and not in favor of violations of obligations. To our mind, it was more natural for subsequent grantees to assume that Cahill, in purchasing this property, acted rightfully, and with the intention, on account of his general relationship to plaintiff, to deal with and administer the property for her ultimate benefit, than it was for them to suspect that he was so purchasing in violation of his obligations as a guardian, and to the final detriment and injury of the plaintiff.\"\n\nNoticing the distinction between the rule of other jurisdictions and the rule in the federal courts which is the rule in New Mexico, the Circuit Court of Appeals for the Ninth Circuit in Tobey v. Kilbourne, 222 F. 760, 764, Ann.Cas.1918C, 470, said: \"And it is not held in the federal courts that notice of facts such as would put a reasonably prudent man upon inquiry is constructive notice of the fraud. The rule of those courts is that, where it is sought to affect a bona fide purchaser for value with constructive notice, the question is not whether he had the means of obtaining, and might by prudent caution have obtained, the knowledge in question, but whether his not obtaining it was an act of gross or culpable negligence. Wilson v. Wall, 6 Wall. 83, 18 L. Ed. 727; United States v. Detroit Lumber Co., 200 U.S. 321-333, 26 S. Ct. 282, 50 L. Ed. 499; Reed v. Munn, [8 Cir.], 148 F. 737, 80 C.C.A. 215.\"\n\nOther cases sustaining my conclusion that the two defendants are in fact innocent purchasers for value without notice are Woodworth v. Paige, 5 Ohio St. 70; Hall v. Livingston, 3 Del. Ch. 348, 396-398; Kennedy v. Bridge, 120 Okl. 51, 250 P. 427; Reed v. Munn, 8 Cir., 148 F. 737, 80 C.C.A. 215, certiorari denied, 207 U.S. 588, 28 S. Ct. 255, 52 L. Ed. 353; Charles\n\nv. Roxana Petroleum Corporation, 8 Cir., 282 F. 983; Strong v. Strong, Tex.Civ.App., 66 S.W.2d 751, affirmed 128 Tex. 470, 98 S.W.2d 346, 109 A.L.R. 739.\n\nSo far as my research discloses, the rule upon the question of constructive notice as announced in United States v. Detroit T. \u0026 L. Co., supra, has remained the guide for the federal courts. Certainly that case has not been overruled in its pronouncements upon the subject. Occasionally, as in Reynolds v. Moseley, 8 Cir., 32 F.2d 979, 981, a federal court will give a statement of the rule which might be deemed a variant thereof, at least as indicating that a want of ordinary care alone in noticing and following up facts \"sufficient to put a reasonably prudent man upon inquiry\" will charge the intending purchaser with all the consequences of actual knowledge. It may be conceded, too, that a statement of the rule such as that just phrased represents the weight of authority, and in the case of some states, at least, which follow it, obviously is based upon the language of a governing statute. See Doran v. Dazey, 5 N.D. 167, 64 N.W. 1023, 57 Am.St.Rep. 550. An analysis of any seeming departure by the federal courts from the rule as announced in the Detroit Company case will always disclose, as it does in Reynolds v. Moseley, supra, that there not only was present a want of ordinary care, but that the claimed innocent purchaser was guilty of gross or culpable negligence in failing to follow up the inquiry which the known facts reasonably suggested.\n\nAnd so it is as to some of our own decisions relied upon by plaintiffs as holding that mere want of ordinary caution will bind the purchaser as though possessed of actual knowledge of the unknown facts to have been ascertained by an inquiry. In United States v. San Pedro Canon del Agua Company, supra [4 N.M. 405, 17 P. 401], the court after reviewing the facts relied upon as calling for inquiry held they were \"sufficient to arouse the grave suspicion of any man of ordinary prudence.\" To ignore \"gravely suspicious\" circumstances in accepting title, to say the least, amounts to \"gross or culpable negligence.\" Even if there were inconsistency between some of the statements in that case and what was said in Kitchen v. Schuster and Taylor v. Hanchett Oil Company, supra the latter cases control, being later decisions in point of time.\n\nThe opinion in Smith \u0026 Ricker v. Hill Bros., 17 N.M. 415, 134 P. 243, is not in conflict with the federal rule adopted in Kitchen v. Schuster, supra. We first expressed grave doubt whether the recording statutes gave constructive notice at all of the purported chattel mortgage relied upon by appellees in the Hill Bros. case. Then, assuming applicability of the statute and that an intending purchaser saw and examined the record, we held that what such purchaser observed would have furnished no clue to the transaction between appellees' mortgagor and appellant, Duran, relied upon as constituting a sale of sheep supposedly mortgaged to appellees and that Duran's rights were unaffected by what the record\n\ndisclosed. If there was no duty to inquire we should hardly expect to find a binding statement of the rule governing in default of an inquiry. The statement just made also is applicable to Shephard v. Van Doren, 40 N.M. 380, 60 P.2d 635, another of the cases relied upon by plaintiffs. Furthermore, a careful study of the opinions in that case and in the case of Ham v. Ellis, 42 N.M. 241, 76 P.2d 952, discloses no real conflict between them and the cases of Kitchen v. Schuster and Taylor v. Hanchett Oil Company, supra, upon the question under discussion. Indeed, Ham v. Ellis, supra, does not deal with the situation before us. What is there said concerning the duty to inquire relates to efforts to bind a principal by virtue of dealings with him through his special agent. In such cases, a strict duty of investigation as to the limits of the agent's authority is the rule. Ham v. Ellis, supra, and cases cited.\n\nThe majority say they will postpone to another day and decide when the occasion arises whether the federal rule, applied in Kitchen v. Schuster, supra, and later deliberately adopted in Taylor v. Hanchett Oil Co., supra, remains the law of this state upon the question of constructive notice; or, whether the test of ordinary care, approved in the old case of United States v. San Pedro \u0026 Canon del Agua Co., 4 N.M. 405, 17 P. 337, decided long before the Kitchen and Taylor cases, is to govern upon the question. As already shown in my discussion of the Canon del Agua case, supra, the facts warranted a finding of gross or culpable negligence. The prevailing opinion thus takes notice both of the ordinary care rule mentioned in the Canon del Agua case and of the federal rule adopted in Kitchen v. Schuster and Taylor v. Hanchett Oil Co., supra, expresses no preference for either and finally proceeds to decide this case without disclosing which rule it follows. If applying the ordinary care rule set forth in the Canon del Agua case by the early territorial court, then the later Kitchen and Taylor cases following the federal decisions are overruled. If they are to be overruled this truly is not a case calling for any such declaration.\n\nTurning now to an application of the principles discussed to the facts of this case. The decisive inquiry is whether the defendants were guilty of gross or culpable negligence in failing to follow up known facts. If not, obviously they are not to be charged in law as possessing actual knowledge of facts of which they admittedly were ignorant in fact. Want of ordinary care may be assumed but under our rule we must go further and determine whether it amounted to gross or culpable negligence. It may be conceded at the outset that the Mosleys' act in contracting the sale of a one-half interest in the minerals to Paine when the abstract disclosed ownership of only a one-fourth interest, unexplained, would reasonably suggest dual contingencies. The one first and the more naturally arising in the mind of the title examiner is that of innocent mistake -- forgetfulness on the part of vendors as to exact quantity of fractional\n\ninterests already conveyed or on the part of the scrivener in writing in the quantity of interest intended to be conveyed. The second contingency, although more remote, which ought also to have suggested itself to the mind of the careful title examiner, is the question whether the deeds abstracted spoke the truth with reference to interests already conveyed. Were such deeds or any of them forgeries? Were any of them materially altered or surreptitiously delivered? Because of the sinister implications attending indulgence of this thought as a possible explanation of the Paine contract, as already indicated, it naturally would assume less importance or predominance in the title examiner's mind as the true explanation than the one first suggested -- innocent mistake.\n\nProceeding from this point, however, the instruments abstracted in connection with the Paine transaction, instead of setting the examiner out upon an investigation, were actually calculated to dissipate the examiner's fears that a sinister explanation existed and to confirm the more natural assumption that contracting the sale of the one-half interest was explainable upon the innocent ground of mistake or inadvertence. Subsequent to making the Paine contract, and almost coincident with Paine's suit against the Mosleys for breach thereof the abstract discloses a conveyance from Mosley to his wife and later from the wife back to Mosley, each describing the interest conveyed as one-half. Then following the Paine suit, a conveyance from the Mosleys to him of a one-fourth interest in the minerals. Thus in spite of an apparently excessive claim of interest on the part of the Mosleys in the Paine contract and in the interchange of deeds between husband and wife, the whole transaction ends with a conveyance by them to Paine of an interest in exact accord as to quantity with the interest shown by the abstract to remain in them, viz., one-fourth.\n\nWas it bad faith for the examiner to conclude in view of the circumstances that the Mosleys, having discovered their mistake in contracting the sale of an excessive interest and having been sued by Paine on account thereof, settled and compromised the suit and secured its dismissal by a conveyance to Paine of the interest actually owned? I think not where, as here, the examiner was absolutely correct in the conclusions drawn. Cf. Magee v. Miller, 37 N.M. 293, 22 P.2d 118. This much is absolutely certain, if we are to give effect to the trial court's findings, and it is that contracting the sale of a one-half interest to Paine was due to mistake on the Mosleys' part. The trial court rejected the story of the plaintiffs that they sold only a one-fourth interest to Asbury, giving him a duplicate copy of the deed which had been raised to a deed for a one-half interest with Burke's name substituted as grantee. It found on the contrary that plaintiffs had actually sold a three-fourths interest -- a one-fourth interest being described in one deed and a one-half interest in the other. It was this latter deed in which Burke's name was substituted as grantee.\n\nAccordingly, when the Mosleys contracted to sell a one-half interest to Paine they should have known that they already had executed deeds conveying away interests totaling three-fourths. They should have remembered that they had received the agreed purchase price of eight hundred dollars for such interests and still retained it. They had every reason to believe they had forever parted with title to that three-fourths interest and absolutely no reason to think otherwise. They then were wholly ignorant of an admittedly unusual chain of circumstances under which by accident of governing legal principles applicable to the situation, title remained in them to the one-half interest already validly conveyed so far as they knew.\n\nHence, their claim to a one-half interest reflected from the Paine contract, and the deed made by Mosley to his wife in an effort to avoid it, had no connection whatever in fact with the material alteration of their prior deed before delivery by the substitution of Burke's name as grantee. They had never heard of it. No explanation of the Paine contract is at all possible under the court's findings than that of mistake. And when the idea of mistake entered the title examiner's mind as the most plausible, even if not the only explanation of the Paine contract and the interchange of deeds between Mosley and wife, he was fortunate enough to have surmised what indeed was the true explanation. Upon the question of even ordinary care, I repeat again a short excerpt from Cahill v. Seitz, supra: \"While the rule charging people with knowledge of the law includes principles which are complex, obscure, and of infrequent application, as well as those which are simple and familiar, we do not think it is out of the way, in the consideration of what was a reasonable diligence in reference to this title, to bear in mind that a guardianship in socage comes by operation of law, rather than by express appointment; that it is of comparatively infrequent occurrence, and seldom becomes an important element in the transmission of titles.\"\n\nCertainly, the unusual chain of circumstances which eventuated in title remaining in plaintiffs by operation of law is of \"comparatively infrequent occurrence\". The possibility of it or of the existence of other facts resulting in the nullity of one of the deeds abstracted is to be weighed, as pointed out in Cahill v. Seitz, supra, in the light of the rule that \"the presumption is in favor of legal conduct, and not in favor of violations of obligations.\" See also Smith \u0026 Ricker v. Hill Bros., 17 N.M. 415, 134 P. 243, and Shaw v. Board of Education, 38 N.M. 298, 31 P.2d 993, 93 A.L.R. 432.\n\nFurthermore, the known facts about the Paine contract, including the deed Mosley made to his wife in an effort to avoid it, afford no clue to, nor bear any natural and reasonable connection with, the ultimate fact, viz., the alteration of the Burke deed before delivery, which operated by accident of law to leave plaintiffs still invested with the title. In 46 C.J. 547, ยง 35, under the\n\nsubject \"Notice\", sub-heading \"Relation of Known Facts to Ultimate Facts\", it is said: \"The rule imputes notice only of those facts that are naturally and reasonably connected with the fact known, and of which the known fact or facts can be said to furnish a clue. It does not impute notice of every conceivable fact and circumstance however remote which might come to light by exhausting all possible means of knowledge.\" Cf. Smith \u0026 Ricker v. Hill Bros., supra.\n\nThe language of the Supreme Court of Oklahoma in Kennedy v. Bridge, supra, is pertinent to the rule just expressed. In that case the plaintiff, a good faith purchaser of the lot in question, sued defendants in ejectment. The plaintiff's position was invulnerable unless the construction of a garage on the rear of said lot by the owner of an adjoining lot and the projection over the property line of his small office building, through mistake, made the lot an \"occupied lot\" and put the plaintiff upon inquiry which likely would have resulted in a disclosure of the ownership of the lot by defendants under a verbal trust. The court rejected the contention of defendants with comment as follows [120 Okl. 51, 250 P. 429]: \"J. W. Adams testified that there was nothing on the property at the time he purchased it. Dr. E. F. Nickells testified that through error and mistake he built his office in part upon the lot in question, thinking that he was building it upon his own lot, and without any intent on his part to construct the building on the lot in question; that he constructed the little garage under the same circumstances; and that he had never at any time paid any rent to anyone for the use of the lot. This evidence, we think, reasonably tended to show that the lot in question was vacant at the time the plaintiff obtained his deed on October 15, 1924, or, if it was not unoccupied, that the possession of Dr. Nickells was purely accidental, and in no way connected with the claim asserted by defendants. The fact that Dr. Nickells, in attempting to take possession of his own property, inadvertently located his office and garage upon the lot in question would not suggest any connection between that fact and an outstanding claim asserted by some third party to said lot so as to require a purchaser to make inquiry concerning such claim.\"\n\nHere, too, it may be said that the apparent claim to ownership of a one-half interest reflected by the Paine contract \"was purely accidental and in no way connected with the claim asserted by plaintiffs.\"\n\nThe conclusion follows that under all the circumstances the defendants were not guilty of gross or culpable negligence in failing to pursue the inquiry suggested beyond the explanation afforded by the abstract itself. While it is true some apprehension of danger in the possible invalidity or nullity of the deed for one-fourth interest to Asbury and Bates or for the one-half interest to Burke would arise, nevertheless, involving as it did implications of fraud and even of criminal conduct, it naturally would seem more remote\n\nthan the likelihood of mistake or inadvertence. Weighing these possibilities, the examiner then came across entries in the abstract itself -- the dismissal of the Paine suit and the deed to Paine of a one-fourth interest -- which were calculated to allay the suspicion of fraud and to confirm the idea of mistake. Under the unusual situation here disclosed, the defendants were not grossly or culpably negligent in failing to investigate beyond the facts disclosed by the abstract, a conclusion necessary to charge them with actual knowledge that the Burke deed was materially altered before delivery. In other words, there was no bad faith and under the authorities cited, supra, which apply the federal rule adopted in this jurisdiction, gross or culpable negligence is treated in effect as the equivalent of bad faith.\n\nThis leads to the conclusion that the defendants are innocent or good faith purchasers. In other words, they did not purchase in bad faith and, therefore, are entitled to invoke the defenses of laches and estoppel. Of course, they are not innocent purchasers in the sense in which the phrase often is used, as affording a complete defense, merely by virtue of that status, against hidden or unknown equities in property conveyed. There cannot be an innocent purchaser in that sense claiming under a forged or otherwise void deed. The defendants do not even claim to be innocent purchasers under the Burke deed in that sense, but only in the sense in which the expression is used in 16 A.J. 452, Deeds, ยง 27 (quoted in the prevailing opinion), where it is said: \"A forged deed, in the sense defined above, is absolutely void and wholly ineffectual to pass title, even to a subsequent innocent purchaser from the grantee under such forged deed.\" (Italics mine.) See, also, Id. ยง 28 for another and similar use of the phrase. It is only in the sense in which the authors of the text just quoted use the expression, that it is here employed. But if defendants are innocent or good faith purchasers in this sense, they may rely upon laches and estoppel.\n\nAll of us agree that mere proof that a purchaser under a forged or otherwise void deed bought in good faith and without notice of any vice in the deed to his grantor, does not make him an innocent purchaser in the sense in which that phrase is often used, viz., as one who has complete protection by virtue of his standing as such. Now, we are agreed on that. We are also agreed that the Burke deed was void and conveyed no title. The facts show that Mosley knew the altered deed was of record more than a year before Reynolds purchased for General Crude Oil Company. Assuming what I maintain, that Reynolds is an innocent purchaser in the sense stated, let us suppose that Mosley, with knowledge of the nullity of the Burke deed, had stood by, observed and heard Burke selling the property to Reynolds and Reynolds paying over to Burke the ten thousand dollar purchase price and that Mosley offered no word of protest nor in any fashion challenged Burke's right to convey. Would anyone contend for a moment that equity would later permit Mosley to assert his\n\ntitle against Reynolds? Certainly not. Its refusal to extend him aid would not be because of Reynolds' standing as an innocent purchaser alone, but that status plus his, Mosley's, conduct. However, if Reynolds at the time knew facts of such strength that his purchase amounted to bad faith, then not being an innocent purchaser, he could not raise up equities in his behalf in reliance upon estoppel or laches.\n\nAt this point, I must express my disagreement with the majority statement, considered in all its implications, that \"we are not permitted to add to or take from the findings by resort to the opinion of the district court or to the testimony\" and that an opinion of the trial court \"adds nothing to the facts of the case\". Of course, it is not meant that upon a challenge to the sufficiency of the evidence to sustain the findings, the testimony may not be looked to for substantiality. Furthermore, in support of a judgment, but not in derogation of it, where the findings made are silent on a material issue, a finding on such issue favorable to the judgment will be presumed, if supported by the evidence. Naturally, the evidence must be examined in such a case to ascertain whether it will support the presumed finding. This is entirely logical since a general finding only is a finding of every material issue for the party in whose favor the general finding is made. And as to material issues upon which the findings are silent the judgment amounts to a general finding. Every presumption is indulged in support of the judgment. This is one of them.\n\nNeither do I think the opinion of a trial court is as unimportant as may be inferred from the prevailing opinion. True, the trial court is not required to write or file one, but if it does, under our own rules, it must be incorporated in the transcript as a part of the record proper. Supreme Court Rule XIV, ยง 3. We may resort to it or to the testimony to explain inconsistent, indefinite or ambiguous findings, or to explain the trial court's theory. Hartzell v. Jackson, 41 N.M. 700, 706, 73 P.2d 820; National Liberty Ins. Co. v. Silva, 43 N.M. 283, 92 P.2d 161.\n\nI agree with the majority that the opinion of the trial court, when filed, is not the \"decision\" contemplated by 1929 Comp., ยง 105-813, but I do not concede what might be inferred from their statement, viz., that if findings be irregularly included in the opinion, as is sometimes done by trial judges, that we must or may ignore them. We may adopt a rule to that effect later but we have never done so yet. If findings of fact are found in an opinion we have a right to consider them and in the interest of justice should do so. The cases are many in which we find just this situation to exist. The trial judge will combine in one document his findings, conclusions and opinion, as in the case at bar. Often they are interspersed until it is difficult to tell where findings end and opinion begins. It is a loose practice and not to be commended but a change in our policy toward it should come by rule, not by decision where the rights of the parties are affected.\n\nA brief consideration of the action of the majority in canceling finding No. 9 may illustrate my meaning. This finding, so far as material, reads: \"9. That the price received for said mineral interests was the fair market value thereof at the time of the sale, but that in the year 1936, three oil wells were brought in on said land by the lessee thereof, the Humble Oil \u0026 Refining Company; and that the defendants herein and their successors in interest have collected the annual rentals thereof continuously since said date;\"\n\nThe trial court attached some significance to the fact that plaintiffs had stood by for several years with knowledge that the altered deed was of record and acquiesced in the payment of annual rentals or lease money to the grantee named in it or those claiming under him when plaintiffs themselves were the ones entitled thereto if standing upon the invalidity of the altered deed. For whatever basis this finding may have in the evidence as support for the judgment rendered, it is disregarded as found facts by the total abrogation of the finding in the prevailing opinion. The portion of it supported by undisputed evidence is considered, when established by the record, not cumpulsorily, but only as a matter of grace on the part of this court.\n\nThe strictness with which the prevailing opinion appraises the findings of the trial court is a new doctrine to me. I do not believe any previous decision of this court will support so severe an appraisal of findings which presumptively support the judgment under review. Heretofore, the record upon which findings are based has been deemed a vast reservoir of support for but not against the judgment and the findings upon which it rests.\n\nThe cancellation of finding No. 9, heretofore discussed, is but a single instance of this technical treatment of findings. But there are others. The prevailing opinion asserts \"the trial court concluded in his opinion, though not by his decision, that defendants were 'bona fide purchasers for value without notice', and the parties have treated it as a part of the decision, and it is so presented here. We will so treat the question\". However, the court expressly found in the 15th paragraph of its decision (findings and conclusions) that \"the Magnolia Company bought without knowledge, either express or implied, of any of said changes\" (alterations). Furthermore, in several instances, there is found in the opinion part of the document entitled \"Findings of fact, Opinion and Conclusions of Law\", what is essentially a finding of fact, or mixed finding and conclusion, that both defendants are \"purchasers in good faith without knowledge of any wrongful delivery of the deed, or of any adverse claims of the plaintiff(s)\". Although, as the prevailing opinion states, this will be treated as a part of the decision (findings, etc.), again is this done, not as the defendants are entitled to have it treated as a found fact, as a matter of right, but only as a concession on the part of the court and a matter of grace or discretion.\n\nThis is an unusual case. There is not another like it in the books. It is not the case of an innocent owner about to lose his estate through a forged deed. In the ordinary case of a forged deed the true owner is about to be defrauded of his estate or some part of it. He has never agreed to sell to anybody and has received nothing on account of a pretended sale. Here the plaintiffs did sell at a price agreeable to them. They received and still retain the purchase price. It is only by accident of the law (an application of the penalty doctrine) that they find themselves still invested with the legal title. This doctrine is penal and exemplary. It does not exist for the special benefit of him whose writing is materially altered. He derives an advantage, it is true, but only in furnishing an example to the public at large. If other proof of this were needed beyond the force of the statement itself, it is rendered conclusive, by recalling that the alteration is deemed material even though the change may be to the maker's financial advantage, as in reducing the rate of interest or the amount of his obligation, if made without his consent. 3 C.J.S. 948-950, ยงยง 33 and 35, under title Alteration of Instruments.\n\nUnder such circumstances, where by accident of a doctrine not intended for his special benefit, an owner finds himself still possessed of title to property which he has sold and attempted to convey and for which he has been paid the agreed purchase price, which he still retains, it is my idea that equity should require of him unusual diligence in the assertion of his claims of ownership thereto and the chancellor should not hesitate to base estoppel upon any equivocal conduct, significant silence or unusual delay on his part, to protect the rights of innocent purchasers of the same property.\n\nIt seems unjust and unfair to me to permit an owner even as against a forged or otherwise void deed placed of record and bearing all earmarks of authenticity and genuineness to sit idly by and permit an unsuspecting public to deal with the property and invest upon the faith of the apparent verity of such an instrument. The injustice is emphasized by the fact that no longer as of old is it the usual practice for the vendor to pass along to the vendee for inspection all original muniments of title. Such was the rule and practice in the early periods of conveyancing. In such circumstances the purchaser or his attorney had the opportunity to inspect the original instrument for evidences of fraud, forgery or alteration. But in the multiplicity of transfers of a given piece of property in the commercial minded world of to-day this practice is found no longer feasible and is not generally followed. All of us know that millions are invested daily in America upon the faith of the genuineness of instruments duly recorded as reflected by certified abstracts thereof. Considered in the light of this universal practice and in view of the further fact that instances are rare in which an owner of property is sought to be defrauded of it by virtue of a forged, altered or undelivered deed, it seems only fair to apply a liberal doctrine of laches to\n\nsuch a situation in favor of the innocent purchaser.\n\nThere are well reasoned cases sustaining the conclusions announced. Most of them are cases wherein a deed has been wrongfully or fraudulently taken from escrow and placed of record. Then the rights of innocent purchasers dealing with the property upon the faith of it have intervened. It is uniformly held that such a deed for want of proper delivery passes no title and is wholly null and void. In many of the cases the purported deed is likened in effect to a forgery. And, yet, due to delay, acquiescence, or other equivocal conduct, the courts have not hesitated to hold the true owner estopped to assert his title against an innocent purchaser of the property. See McConnell v. Rowland, 48 W. Va. 276, 37 S.E. 586; Haven v. Kramer, 41 Iowa 382; Connell v. Connell, 32 W.Va. 319, 9 S.E. 252; Mays v. Shields, 117 Ga. 814, 45 S.E. 68; Pittman v. Sofley, 64 Ill. 155; Quick v. Milligan, 108 Ind. 419, 9 N.E. 392, 58 Am.Rep. 49; and an excellent annotation in 48 A.L.R. 405 under subject \"Effect of unauthorized delivery or fraudulent procurement of escrow on title or interest in property\". At page 425 under the sub-topic \"Estoppel, Waiver or Ratification\" will be found discussed some of the cases just cited.\n\nIn Mays v. Shields, supra, the Supreme Court of Georgia, said [117 Ga. 814, 45 S.E. 69]: \"There was no instruction that, if Shields subsequently ratified the delivery, the deed would become valid, nor was the jury told that if, with knowledge that the deed was on record, Shields took no steps to have the record expunged, he would be estopped from denying the title of an innocent purchaser buying on the faith of the record. Where a grantor delivers a deed in escrow, and learns that it has been improperly delivered to the grantee, or that it has been recorded, he must at once take steps to prevent innocent third persons from acting to their injury. Such knowledge would bring the case within the rule as to which of two innocent persons must suffer. Id. ยงยง 3937, 3940.\" (Italics mine.)\n\nSee, also, Costello v. Meade, 55 How. Prac., N.Y., 356.\n\nIn most of these cases possession followed the deed and, of course, involving property capable of physical possession, influenced the decision reached. But that possession is not a controlling factor where the property is of a kind that cannot be physically possessed, or is unoccupied and no one is in the actual visible possession of it, is also established by sound reason and authority.\n\nIn Allen v. Powell, 65 Ind.App. 601, 115 N.E. 96, 100, the court dealt with a case somewhat similar to the one at bar. The plaintiff claimed the deed was surreptitiously abstracted from her handbag and the name of the grantee inserted therein. The rights of an innocent purchaser from such grantee arose. The court said:\n\n\"It is a conceded fact that regardless of the means by which Crawford possessed himself of the deed involved here, appellee\n\non or about July 31st had full knowledge of the state of the record in the recorder's office, and that some innocent person might be deceived to his injury thereby. Such a situation is sufficient to present the question recognized by the court in the instruction under consideration, whether appellee is estopped by her conduct on that occasion and subsequent thereto to deny the validity of the deed as against innocent purchasers. * * * In either case, she having acquired full knowledge of the facts on or about July 31st, the question is presented whether her conduct or inaction thereafter under all the circumstances, including the element of time, amounted to such negligence or such a breach of duty owing to others as that it may be said that she by her conduct enabled the injury to be inflicted, and that as a consequence she was estopped to deny the validity of the deed as against appellants.\n\n\"It has frequently been held that where a person named as grantee in a deed, in the absence of a legal delivery or of an intent to deliver it, wrongfully obtains possession of it and causes it to be recorded, the grantor, having or obtaining knowledge of the facts, is required to take steps promptly to prevent innocent third persons from acting to their prejudice in reliance on the record, and that by failing to do so, such grantor will be held guilty of such laches or such negligent conduct as will stand as a barrier to his asserting title as against such an innocent purchaser. See the following: Mays v. Shields, 117 Ga. 814, 45 S.E. 68; Pittman v. Sofley, 64 Ill. 155; Haven v. Kramer, 41 Iowa 382; McConnell v. Rowland, 48 W.Va. 276, 37 S.E. 586; Costello v. Meade, 55 How.Prac. (N.Y.) 356; Johnson v. Erlandson, 14 N.D. 518, 105 N.W. 722; Breeze v. Brooks, 22 L.R.A. 256, note; Quick v. Milligan, 108 Ind. 419, 9 N.E. 392, 58 Am.Rep. 49. In a number of the foregoing some importance is attached to the fact that possession followed the conveyances involved, but we do not regard such element as controlling where, as here, the real estate conveyed is unoccupied and no person is in the actual visible possession of it. * * *\n\n\"' Delay in the assertion of a right, unless satisfactorily explained, operates in equity as evidence of assent, acquiescence or waiver.' Connell v. Connell, 32 W.Va. 319, 9 S.E. 252.\" (Italics mine.)\n\nJohnson v. Erlandson, 14 N.D. 518, 105 N.W. 722, 724, is another case supporting the view of the Indiana Court in Allen v. Powell, supra, that possession is not a controlling element where the land is unoccupied and no person is in the actual visible possession of it. In this case the deed was fraudulently delivered and placed of record. The court said: \"There is a conflict of authority on the question as to whether an unauthorized delivery of a deed held in escrow conveys any title even in favor of an innocent purchaser. We express no opinion on that question, as we are satisfied that upon the evidence in this case it must be held that the defendant is estopped by his own negligence to deny Baker's right to convey to plaintiff. The\n\ndeed from defendant to Baker was taken from the custody of the depository and recorded September 28, 1892. The defendant was fully aware of that fact within a very short time after it occurred. He made occasional demands upon Baker for a reconveyance, but permitted himself to be lulled into inaction by Baker's promises to reconvey or settle in some other manner. The defendant's action after he discovered the abstraction and recording of the deed is such that it gives, at least, ground to the claim that he ratified the unauthorized delivery and accepted Baker's promise of compensation for the land. He never paid any taxes on the land, or exercised any dominion over it, and knowingly permitted Baker to hold himself out to the world as the rightful grantee. This condition of affairs had existed for about two years before plaintiff purchased. Since that time defendant has never attempted to assert his right to the land until this action was commenced. Meanwhile Baker had died. * * * Mays v. Shields, 117 Ga. 814, 45 S.E. 68; Costello v. Meade, 55 How.Prac. (N.Y.) 356; Haven v. Kramer, 41 Iowa  384; Quick v. Milligan, 108 Ind. 419 9 N.E. 392, 58 Am.Rep. 49; Connell v. Connell, 32 W.Va. 319, 9 S.E. 252.\"\n\nThe doctrine of Allen v. Powell and Johnson v. Erlandson, supra, is peculiarly applicable to the present case. The subject of the sale by the Mosleys was a mineral interest, incapable of physical possession. \"In fact, however, no one had * * * possession of the fugitive oil apart from the lands under which it lay.\" Thompson, Trustee v. Magnolia Petroleum Co., 309 U.S. 478, 60 S. Ct. 628, 630, 84 L. Ed. 876. When the defendant, General Crude Oil Company, purchased the one-half interest from Burke on July 19, 1929, the Mosleys had parted with title to and possession of the surface and had executed deeds conveying away the entire mineral interest. No one was in physical possession of the mineral content of the land nor could be and the only right of occupying the surface for exploratory purposes was in Humble Oil \u0026 Refining Co., lessee under an oil and gas lease under which no operations had been begun as yet. Collier v. Collier, 184 Okl. 38, 84 P.2d 603. This being the situation, the plaintiffs stood by for more than a year prior to the purchase by defendants with full knowledge that Burke was not their grantee and did nothing to challenge his record right to sell and convey to innocent purchasers. In so doing they invited the public to invest on the faith of it and are not entitled to the aid of equity in upsetting the result their own inaction encouraged.\n\nThis was a duty resting upon plaintiffs to take action before the purchase by defendants. If they had moved promptly, upon learning of it, to challenge the verity of the Burke deed, or at least, within a reasonable time under all the circumstances (which may be a very short time), the ten thousand dollars laid out by defendants on the faith of its record would never have been expended. But when there is added to this inaction for more than a year approximately\n\nsix years of further delay and inaction before the institution of suit, during all of which time the property was known by plaintiffs to be rapidly appreciating in value and during the last four years of which time they acquiesced, without protest, in payment of annual rentals to defendants as the true owners of the interests now adversely claimed by plaintiffs, it is simply incomprehensible to me that equity should not hold them barred by laches.\n\nAt the time the property was sold by Mosley to Asbury, according to the court's finding, it had a reasonable value of $800. This embraced a three-fourths interest in the minerals. In June, 1928, a one-fourth interest was sold by Mosley to Paine for $1,000. In June, 1929, Burke sold his one-half interest for $10,000. At the time this suit was instituted the property was of the value of $20,000. At the time of the trial it was worth considerably more and still more at this time as all counsel agree it has several producing wells on it.\n\nThe suit was actually brought approximately seven years after the Mosleys discovered these deeds on record. The lapse of time had been so great that the notary public who took the acknowledgements to the deeds in question had no independent recollection of the transaction and had to rely upon his record which was incomplete. The witness Hitson, assistant cashier of the escrow bank, shows by his testimony that he had no independent recollection of the transaction, and the attorneys to whom Mosley related the circumstances of his case, Stagner and Neal, testifying by consent of all parties, stated their recollection was hazy as to what he told them although quite sure he then made no claim of having sold only a one-fourth interest. The witness Burke testified his recollection was vague as to what happened at the time he purchased the property. In fact the testimony of all the witnesses concerning this transaction showed the effect of the lapse of time. In addition, both banks handling the transaction had closed, and the records relating to it had been misplaced or destroyed.\n\nThe principles here applicable in favor of good faith purchasers have been invoked so often in equity as to amount almost to truisms. In 21 C.J. 225, Sec. 220, under the topic \"Equity\", the author states: \"A person may not withhold his claim, awaiting the outcome of an enterprise, and then, after a decided turn has taken place in his favor, assert his interest, especially where he has thus avoided the risks of the enterprise. Accordingly, if the property involved is of a speculative or fluctuating character, more than ordinary promptness is required of a claimant; he must press his claim at the earliest possible time. This rule is applied with great strictness in the case of mining property, since it is of specially precarious nature, and is exposed to the utmost fluctuations in value.\"\n\nAgain at 21 C.J. 231, ยง 225, it is said: \"If, in the course of an inexcusable delay in the assertion of a right, changes occur\n\nin the subject matter of the transaction in suit or in the relative positions of the parties thereto, as a result of which it is impossible to place the parties in statu quo, and the enforcement of the right would work inequity, relief will be denied because of laches. Prejudice to defendant may prevent relief whether the change in circumstances is the result of the delay itself, or is due to the voluntary act of defendant, provided he acted without notice of plaintiff's rights; if he had notice thereof he cannot assert prejudice.\"\n\nSee also Patterson v. Hewitt, 11 N.M. 1, 66 P. 552, 55 L.R.A. 658, affirmed 195 U.S. 309, 25 S. Ct. 35, 49 L. Ed. 214; Little Bill v. Swanson, 64 Wash. 650, 117 P. 481; Felix v. Patrick, 145 U.S. 317, 12 S. Ct. 862, 36 L. Ed. 719; Weniger v. Success Mining Co., 8 Cir., 227 F. 548; Holman v. Gulf Refining Company, 5 Cir., 76 F.2d 94.\n\nSpecial attention is directed to the cases of Macomber v. Kinney, 114 Minn. 146, 128 N.W. 1001, 130 N.W. 851, and Mohlis v. Trauffler, 91 Iowa 751, 60 N.W. 521. These cases are perhaps as closely related to the one at bar as any to be found in the books. Each of them dictates an affirmance of the judgment reviewed upon the doctrine of laches and estoppel. The similarity in the contentions of the plaintiffs here and of the plaintiff in the Macomber case is reflected by the following quotation from the opinion, to-wit [114 Minn. 146, 128 N.W. 1003]: \"Plaintiff's contention is this: That estoppel rested on the mere silence or inaction of plaintiff. The plaintiff had in no wise made any active misrepresentations. Alworth and those whose title was of the same kind did not claim that they were induced to purchase or expend money in reliance on any word or conduct of plaintiff. The state of the records was a sufficient warning to the general public, and of itself showed that he owed no especial duty to the public or to any particular person to take any step to clear his title or in any wise to protect his interest. The law makes no provision for filing or recording of declarations of title, or of claims to title, nor of affidavits as to forgery. Nobody relied on plaintiff's silence or was misled by it. On the contrary, defendants clearly appear to have relied on the record, and on the attorney's opinion that the title was valid. In consequence it is insisted that plaintiff was not estopped.\" Many authorities are reviewed and the court's holding is epitomized in the following paragraph of the syllabus to the case, to-wit: \"One who is in possession of land, or who has recorded his title, is ordinarily under no obligation to speak or take any action concerning a defect in his title. But if one not in possession has an interest in land which does not appear on record, fails to disclose it, and stands by and suffers the estate to be sold and improved with knowledge that the title had been mistaken, he will not be allowed to assert his claim against the purchaser. Gregg v. Von Phul, 1 Wall. 274, 17 L. Ed. 536, followed and applied.\"\n\nIt is my conclusion that plaintiffs are barred by laches from asserting against defendants\n\nthe title remaining in them by reason of the material alteration prior to delivery of the escrow deed. In so concluding, I am not unmindful of our statement in Algodones Land Company v. Frank, 21 N.M. 82, 153 P. 1032, 1034, that \"mere lapse of time gives no ground for the application of the doctrine\" of laches. But here we have something more -- rapid and extraordinary appreciation in the value of property having a highly speculative character; loss of records incident to closing of banks and unsatisfactory testimony due to faulty memories consequent on the lapse of time. Under some of the text statements and cases cited, supra, silence and inaction over an appreciable period of time as respects property that has greatly enhanced in value have been considered of major significance in applying laches.\n\nIf, with knowledge of the alteration, plaintiffs had stood by and, without protest, had observed defendants making large expenditures for improvements, it could not successfully be contended the plaintiffs were not estopped. Pray, wherein is the difference between the supposed factor and what actually happened? The plaintiffs did stand by for almost seven years and watch the property appreciate in value by leaps and bounds due to its oil possibilities -- thousands upon thousands of dollars in value being added yearly -- and, yet, they reserved this claim within the secrecy of their own bosoms until oil had been discovered so near the property as to render almost certain the presence of oil under it. Then, they struck. Where is the difference in legal effect between the loss to an innocent purchaser of thousands of dollars in enhanced value and its loss in physical improvements? I see none.\n\nIf this be not enough to deafen the chancellor's ears to plaintiffs' importunities, as it did below, then their failure to offer to do equity by returning the purchase price while reclaiming its quid pro quo, debars them under every maxim of equity with which I am familiar and every system of jurisprudence from the Mosaic down to the present time.\n\nWould the majority contend the plaintiffs not bound if with actual knowledge of just what did occur -- a material alteration before delivery -- they had accepted the eight hundred dollars? Suppose, upon returning to the bank Asbury and Bates had explained to the Cashier just what had occurred and he in turn upon tendering the money to plaintiffs likewise had informed them. Could they accept the money and then challenge the deed? All the books and all the cases heretofore have said, \"No\". Under the authorities, retention of the consideration by plaintiffs, even after full knowledge of the facts, would confirm delivery to Asbury, the grantee first named in the Burke deed, from whom title would pass by the quit claim deed in evidence, procured pending suit, from Asbury to defendants. Certainly, it estops plaintiffs from asserting title against defendants.\n\nIt may be argued that if plaintiffs owe anybody a return of this money, it is to Asbury, the original grantee in the altered\n\ndeed, and not to Burke or to the defendants; and, secondly, that the failure to tender back could not constitute estoppel by conduct or ratification because both presuppose knowledge of all the facts and admittedly plaintiffs first learned that the alteration occurred before delivery from the opening statement of defendants' counsel at the trial. But they knew it then, did they not? There was still time to amend and offer to do equity. There was yet time to be just, or to pretend to be.\n\nIt is easy to understand why plaintiffs did not offer to restore. They had presented a theory in the facts which, if true, did not call upon them to restore. The case had not yet been tried. To offer to restore might raise a question in the trial court's mind as to the truth of the story that they sold only a one-fourth interest, for which they were to receive eight hundred dollars. They went to trial upon that theory. The trial judge rejected it as untrue. If untrue, the plaintiffs knew it was so from the beginning and equity does not absolve those seeking its aid from duties arising on facts found to be true because of embarrassment incident to the making of allegations found to be false.\n\nYet, not to this good day have plaintiffs offered to pay into court for whomsoever may be entitled thereto the money which paid for the property they seek to reclaim. It is no answer to say it belongs to Asbury. He was a party defendant. Although in default when plaintiffs learned the time of the alteration, the money could have been tendered for his benefit if found to be the one entitled thereto. If to accept the money after knowledge of the facts would bind plaintiffs, a conclusion not open to challenge, retaining it after such knowledge is and should be of like effect. Warren v. New York Life Insurance Co., 40 N.M. 253, 58 P.2d 1175; Albarado v. Chavez, 36 N.M. 186, 10 P.2d 1102. The trial court did not find and the majority do not contend, however wrongful and unauthorized the act, that Asbury and Bates intended to perpetrate a fraud on the Mosleys in altering the deed as they did. Whether the trial court accepted the explanation of Asbury and Bates that they had previously sold royalty to Burke and knew his attorneys would not accept a deed showing Asbury as grantee without a new abstract or certificate from Lea County incorporating it; and knew that Burke's attorneys would not pass a mineral deed if the fractional interests were stated in figures instead of words and that such attorneys required land descriptions to be written in full and not abbreviated, we do not know. We do know there was no finding of fraudulent intent.\n\nAll the authorities hold that a party may not in equity recover property for which he has been paid without tendering back the purchase price. In other words, a party may not have both the property and the money paid him for it. See Oland v. Malson, 39 Okl. 456, 135 P. 1055; Cotton v. Gregory, 10 Neb. 125, 4 N.W. 939; Harris v. Geneva Mill Co., 209 Ala. 538, 96 So.\n\n622; Spokane Valley State Bank v. Lutes, 133 Wash. 66, 233 P. 308; Gochnauer v. Union Trust Company, 225 Pa. 503, 74 A. 371; Hansen v. Bellman, 161 Or. 373, 88 P.2d 295. See, also, exhaustive note in 130 Am.St.Rep. 910 (Art. XI, page 971), and 19 Am.Jur. 443, ยง 24, under title \"Escrow\".\n\nThe statement of the text in American Jurisprudence, just cited, concerning the effect of conduct which will estop the true owner from assailing a deed fraudulently delivered from escrow, is just as applicable to the rights of innocent purchasers in relation to a deed materially altered. The author declares: \"The rule that a fraudulent delivery by, or procurement from, the depositary of a deed deposited in escrow will not operate to pass the title, even in favor of a subsequent purchaser in good faith without notice, does not extend to enabling the grantor to recognize or affirm the grantee's possession of the instrument as valid for some purposes and to disclaim such instrument as being nugatory for all others, especially when to do so would result in injury to an innocent party.\"\n\n\"The right to rely upon the fact of the material alteration of an instrument as a defense against an action thereon may be waived by one in whose favor such right exists, or a party to an altered instrument may, by his silence or conduct, which misleads another to his prejudice, estop himself from asserting the invalidity of the instrument by reason of the alteration.\" 2 Am.Jur. 628, ยง 40.\n\nOland v. Malson, supra, involved the improper delivery of a deed held in escrow. Pertinent remarks of the court touching the question now discussed are as follows [39 Okl. 456, 135 P. 1056]: \"Considering the many claims of the parties, pro and con, as shown in the pleadings, and the rather involved character of the issues presented, this case presents difficulties; but it is apparent at a glance that the disposition of this case made by the trial court cannot be allowed to stand. It cannot be right, in either law or morals, for the defendant in this case to get the $900 paid him early in 1910, together with the $1,400 and interest placed to his credit in 1911, and retain same, [and] also have awarded to him the farm with its revenues for those two years. A statement of the proposition defeats it.\" (Italics mine.) In that case, as here, as said by the court, \"defendant [plaintiffs here] makes no further mention of the $900 paid him, nor does he offer to return the same\". And here, as there, \"it cannot be right, in either law or morals\", for the plaintiffs to eat their cake and have it, too; to recover the mineral interest from innocent purchasers while retaining the money paid them for it.\n\nCotton v. Gregory, supra, is particularly applicable in that there the former owner was held estopped from challenging delivery of the deed by accepting and retaining the purchase price of one lot, title to which was deraigned by a subsequent purchaser under the void deed. If, as the Nebraska court correctly held, the plaintiff\n\nwas estopped to repudiate the wrongfully delivered deed, because she had \"received and retains\" the purchase price of one of several lots described in it, a fortiori, are plaintiffs here estopped to attack the Burke deed as originally executed when they received and still retain the purchase price for all of the property described in it.\n\nThe majority may misconceive my position on the effect of plaintiffs' failure to offer to do equity. I do not maintain that retaining the purchase price while seeking to recover the property it paid for vests title in the defendants on the theory of ratification of the altered Burke deed. But, I do strongly insist that it is a factor to be considered by the trial court upon the issue whether they are estopped to assert their title against the defendants and whether, even though the chancellor deems them owners of the legal right to the property, their unenviable position of getting the property and the purchase price, too, without at least offering to restore the latter, so shocks his conscience as to cause him to withhold the aid of equity. The words \"ratification\", \"acquiescence\", \"estoppel\" and \"waiver\" are often loosely used interchangeably, but they are not synonymous. 52 C.J. 1145, ยง 3. It is in the sense of \"estoppel\" that I use the term in discussing the effect of plaintiffs' retention of the purchase price while seeking to recover the property.\n\nBut, say the majority of this equity in defendants' favor -- retention of the purchase price while reclaiming the mineral interest it paid for -- \"This question is raised for the first time on the second motion for rehearing and is not available to defendants, but in any event is without merit\". Having demonstrated that it is not without merit, it will now be established that this equity was relied upon in aid of the defense of estoppel in the first briefs filed by defendants for the original hearing in this court. And it will later be shown that under the peculiar situation existing under the pleadings and trial in the case, the defendants are entitled to rely upon the question here as the trial court did, in part, below.\n\nThe following excerpts from defendants' brief in chief for the original hearing (with italics supplied for the particular language) show their reliance on this circumstance as one of the grounds of estoppel:\n\n\"* * * and this (relief prayed by plaintiff) at the instance of a grantor against innocent purchasers more than seven years after he discovered these alterations and who has received and retained the full agreed purchase price.\"\n\n\"Appellants seem to recognize the validity of this transfer for the purpose of retaining the purchase price, then they undertake to repudiate it for all other purposes.\"\n\n\"* * * we have a case where appellants have sold a three-fourths interest in the minerals in a tract of land for an agreed consideration and where the consideration was paid within the agreed time and accepted and retained by the grantors. Under the\n\nrule well established in this court by the decisions cited in this brief, a court of equity will not grant a decree at the behest of the appellants quieting their title to the property involved, regardless of whether a valid deed was ever delivered because they have accepted the agreed purchase price and have parted with the equitable title to the mineral interest if not the legal title.\"\n\nIn a summary of equities and considerations supporting an order of affirmance, near the close of their brief in chief, the defendants say:\n\n\"We submit that this court should keep in mind that the trial court, in making its findings and conclusions, had before it certain undisputed facts in this case, which we enumerate as follows: (Paragraphs 1 to 3 omitted.)\n\n\"4. The agreed consideration for the transaction was $800.00.\n\n\"5. This consideration was paid within the agreed time and accepted and retained by appellants.\"\n\nIt is also clear that the trial judge did not overlook this equity in defendants' favor. On page 93 of the transcript, in his opinion, Judge McGhee said: \"It seems to me, in this class of cases, where leases and royalties are subject to such violent fluctuations in value, that those who dispute their title should be compelled to act promptly and not sit by and wait for development which may prove the land to be greatly valuable for oil, and then come in and assert their claims; or, on the other hand, if oil is not found, be allowed to affirm their contract and retain the fruits thereof, although the original purchase price may have been small.\"\n\nFinally, at the conclusion of the whole case, it was within the province of the trial court to dismiss the bill for want of equity. Within the decree in defendants' favor, such disposition may be embraced. True, the decree goes further, deciding upon the merits of the facts adduced that plaintiffs are estopped from challenging the defendants' title. That decree, as it stands and upon becoming final, renders res adjudicata the merits in all future actions at law or suits in equity between the same parties or their privies. This court, even though the majority feel called upon to set aside that decree, as they do, should not withhold from the chancellor the power, undoubtedly possessed, to say whether litigants in the position plaintiffs occupy, move his conscience to award them any relief; whether, regardless of their strict legal rights, his conscience may not dictate that he refuse to extend the aid of equity to accomplish so grave an injustice in favor of parties who have never even offered to do equity, relegating them to an action at law to enforce whatever rights they may have; and, indeed, to declare whether such disposition be within the decree already rendered.\n\nThe offer to do equity is something required of one who seeks her aid and is not forgiven or excused by considerations of\n\nexpediency or speculation as to whether the offer will be accepted. It is the actor's conduct in this respect, not that of his adversary, that is screened before the chancellor's gaze. It is a technical answer to suggest there was no motion to dismiss nor any demurrer with want of equity as a ground. The defendants have claimed the greater right in their presentation below and in their assignments here -- a decree on the merits and its affirmance with estoppel as one of their chief defenses. Throughout they have stressed the unconscionable position the plaintiffs occupy in suing to recover the mineral interest involved while retaining the purchase price paid them for it.\n\nI maintain that even without motion to dismiss, when the facts disclose plaintiffs' position unconscionable, as where under a strict application of the penal doctrine invoked, they are about to recover property which they have sold and have been paid for without so much as offering to restore what they have received for it, or where otherwise under the facts their seeking the aid of equity without offering to do equity places them in an unconscionable position, every chancellor has the right to say: \"I wash my hands of it. If you have rights at law, that is where you must claim them. I refuse to extend the arm of equity in your behalf.\" It is the chancellor's privilege to say whether he does feel so moved here. The present disposition of the case amounts to a practical denial of that right.\n\nThe majority, however, apparently moved by the strong and obvious inequity of a result that would leave plaintiffs with the property and the money paid them for it as well, in their disposition of the case do give the chancellor (in whose province the matter peculiarly rests primarily), leave to require payment into the registry of the court for disposition to the parties entitled thereto, the money paid them for the property with 6% interest from the date they received it, as a condition to awarding any relief. This they will, of course, now do, if so required. The property has become worth many, many times what they sold it for due to large oil discoveries. But what the majority do not do is to leave the chancellor freedom to exercise fully his discretion in respect of this matter -- the right to say whether disgorging the purchase price under compulsion, the failure to have offered voluntarily to restore it, together with other unconscionable aspects of their case, do not move his conscience to withhold equity's aid altogether, relegating them to an action at law for enforcement of whatever rights, if any, they may have. In other words, the chancellor is permitted a partial but not a complete exercise of his discretion in a matter controlled by conscience. If the chancellor is to have the right to say the plaintiffs shall not have relief unless they restore the money received, why not the right to say they shall be denied relief for not having offered voluntarily to restore?\n\nFurthermore, the estoppel of plaintiffs to claim the aid of equity arose on the facts as found by the court. If the facts had been found as pleaded and testified to by plaintiffs, they were not called upon to restore. Under such circumstances the strict rule of a special plea of estoppel by him who invokes it is relaxed. Cf. 19 A.J. ยง 182, page 838. The plaintiffs claimed below and still insist here that they sold only a one-fourth interest for eight hundred dollars, delivering to Asbury and Bates an executed and acknowledged copy of the deed for their files; that it was this copy which was altered to describe a one-half interest as that conveyed and by substituting Burke's name as grantee and delivering the same as an original which was recorded.\n\nThe trial court found, upon evidence to the contrary, conceded substantial by the majority, that plaintiff did sell a three-fourths interest for eight hundred dollars, evidenced by two deeds, one for a one-fourth and the other for a one-half interest, both placed in escrow in a Texas bank and that the latter deed, without authority, was taken from the bank and materially altered before delivery by the substitution of Burke's name as grantee. There was no middle ground in this conflict. The trial court believed the defendants' witnesses on this sharply contested issue of veracity. And the plaintiffs are in the anomalous position of challenging before this court, as they did below, the truth of the very facts upon which the majority hold them entitled to recover. But, I make no point of this except to mention it as an incongruity sometimes met with in the law. Cf. Rogers v. Rogers, Tex.Civ.App., 230 S.W. 489. It does explain, however, why neither plaintiffs' pleading nor their proof exposed them at the trial prior to findings to a motion to dismiss for a failure to offer to do equity. It was only when the facts were found contrary to their pleading and testimony that reliance upon the failure became pertinent under any condition but not under conditions then present since coincidentally with announcing its findings, the trial court pronounced judgment in defendants' favor on the merits. If that judgment is to be set aside, the defendants are still entitled to the chancellor's voice on whether in any event he deems plaintiffs entitled to the aid of equity, whatever may be their rights at law.\n\nThe prevailing opinion reaches the result it does in what I consider a strict application of the penalty doctrine in relation to altered instruments. Under it, the plaintiffs will get a now valuable property which they sold at a price then agreeable to them which they received and still retain and have never voluntarily offered to return to the rightful owners. Under another penalty doctrine written into the Statute of Frauds, equity consistently declines to permit it to be made an instrument of fraud or imposition. A like attitude toward the penalty doctrine here invoked would result in an order of affirmance. I think that is the proper disposition. But at all events, judgment for plaintiffs should not be ordered,\n\nthus denying to the chancellor an exercise of a discretion vested in him to determine when equitable relief should be withheld.\n\nI dissent.\n\n",
    "body_length": 151625,
    "citedas": [
      "45 N.M. 230",
      "114 P.2d 740"
    ],
    "attorneys": "G. L. Reese, Sr., of Roswell, G. L. Reese, Jr., of Carlsbad, and Fred O. Jaye, of De Leon, Texas, for appellants. Atwood \u0026 Malone, of Roswell, Palmer Bradley, of Houston, Texas, and Hervey, Dow, Hill \u0026 Hinkle, of Roswell, for appellees.",
    "category": [
      "252"
    ],
    "judges": "Brice, Chief Justice. Mabry, J., concurs. Bickley, Justice (concurring specially). Sadler, Justice (dissenting). Zinn, J., concurs.",
    "citation_count": 42
  }
}
