{
  "id": "RLgfTmYBTlTomsSBshGY",
  "document": {
    "title": "07/01/54 STORMON v. WEISS ET AL.",
    "full_title": "STORMON v. WEISS ET AL.",
    "jurisdiction": "North Dakota Supreme Court",
    "date": "1954-07-01T00:00:00.000Z",
    "docket": "No. 7285",
    "body": "On Petitions for Rehearing.\n\nThe contestants have presented a petition for rehearing which discusses no points of fact or law that were not carefully considered by this court and covered by the prevailing opinion.\n\nThe petitioner and appellant has also filed a petition for rehearing asking for a rehearing only insofar as the scope of our mandate is concerned. It is pointed out that our determination that a new trial is 'granted on all the issues' is indefinite and might give rise to a controversy as to whether issues pleaded but not presented at the trial and therefore abandoned might be presented on the new trial. As we emphasized throughout the opinion there were but two questions presented in the trial of the case and urged and argued on this appeal. They were the questions of competency and undue influence. The new trial which we have ordered will be the third trial of this case on the merits. It was not our intention that issues abandoned on the second trial should be resurrected and presented upon the third. Insofar as our language might be subject to the interpretation that would include issues that may have been pleaded and abandoned, it is hereby interpreted and restricted to a new trial of those issues pertaining to the questions of competency and undue influence.\n\nIt is further argued that the special concurrence of Judge Johnson 'holds that there should be a retrial only upon the issue of undue influence, unless the contestants are able to present newly discovered evidence relating to the competency of the testatrix.' This is a misinterpretation of the special concurrence which, in effect, advises the trial court that our determination of the insufficiency of the evidence with respect to the issue of competency is conclusive upon the trial court unless 'it should appear at a new trial that new or additional evidence is available for presentation to a jury upon that question.' This statement is in accordance with the long established rule of this court that a decision holding the evidence to be insufficient to sustain the verdict becomes the law of the case and will control on a new trial or second appeal where the facts are substantially the same. Minot Flour Mill Co. v. Auslander, 62 N.D. 374, 243 N.W. 750; Asbury Hospital v. Cass County, 73 N.D. 469, 16 N.W.2d 523; Desautel v. North Dakota Workmen's Compensation Bureau, 75 N.D. 405, 28 N.W.2d 378; Huus v. Ringo, 77 N.D. 837, 47 N.W.2d 216. See also Dubs v. Northern Pac. R. Co., 51 N.D. 113, 199 N.W. 191. The petitions for rehearing are denied.\n\nSyllabus by the Court.\n\n1. A person who has reached the age of eighteen years may make a will disposing of all or any part of his estate. Section 56-0201 NDRC 1943.\n\n2. Where the validity of a will is challenged on the ground of lack of testamentary capacity on the part of the testator, there is a presumption of sanity and capacity and the burden of proving lack of capacity rests upon the contestants.\n\n3. In determining the issue of testamentary capacity the ultimate question is whether the testator was competent at the time of the execution of the will.\n\n4. Testimony as to oral statements made by a deceased person is generally regarded as the weakest kind of evidence and subject to close scrutiny.\n\n5. The action of a testatrix in willing her estate to the husband of her niece in preference to her sisters is not so unnatural as to warrant the inference that she was incompetent to make a testamentary Disposition of her property.\n\n6. Where one of the contestants of the probate of a will on the ground of mental incompetency testified regarding the testatrix that 'She was too sick a woman to make a will.' and it does not appear that the witness was informed or knew of the legal requirements of testamentary capacity and the facts related by the witness do not support a Conclusion of testamentary incapacity, the statement of the witness is without probative value.\n\n7. A non-expert who is not a subscribing witness may testify as to his opinion of the mental condition of a testator at the time of the execution of a will only after it has been shown that the witness has had an opportunity of knowing the condition of the testator's mind and he has stated facts which justify his opinion.\n\n8. A subscribing witness to a will may give his opinion as to the mental capacity of the testator without stating the facts upon which it is based or otherwise establishing his qualifications to Judge the testator's mental capacity.\n\n9. The burden of proof is on one who offers a will for probate to establish the execution of the will in the manner prescribed by statute.\n\n10. Contestants of a will who challenge its validity on the ground of undue influence have the burden of sustaining their challenge.\n\n11. Where a will is challenged on the ground of undue influence and it appears that the will under which the proponent was the sole beneficiary, to the exclusion of sisters of the testatrix, was drawn by the proponent, an attorney who has at various times over a period of years advised the testatrix on legal matters and who was the husband of the testatrix's niece, and it also appears that the execution of the will, while in conformity with the statute, was perfunctory and the will was not discussed or read to or by the testatrix in the presence of the subscribing witnesses and the terms of the will were not disclosed until after the death of the testatrix, when it was produced by the proponent in whose possession it had remained from the time of its execution, an inference of undue influence arises which casts upon the proponent the burden of going forward with the evidence to overcome the inference.\n\n12. Where the validity of the execution of a will is challenged on the ground that the execution was obtained through the undue influence of the plaintiff, an attorney, who drew the will and was named therein as sole beneficiary, the credibility of the uncontradicted and uncorroborated testimony of the plaintiff is for the trier of the facts to determine in the light of other facts and circumstances which give rise to the inference that the execution of the will was obtained through the exercise of undue influence.\n\n13. Where evidence has been produced giving rise to an inference of undue influence on the part of a beneficiary who drafted a will and evidence was produced tending to show that the testatrix, although sixty-four years of age and suffering from an illness that required an operation, from which she later recovered, was mentally competent to make a testamentary Disposition of her property and lived seven years after making the will without changing it, during which she managed her own business affairs with considerable success, and the beneficiary testified that the testatrix dictated the terms of the will, which she read, and it was left with her for some twenty minutes while he summoned a subscribing witness, it is held that the question of whether the beneficiary exercised undue influence in procuring the execution of the will is for the trier of facts to determine and a motion for a judgment notwithstanding the verdict on the part of the proponent was properly denied.\n\n14. An attorney, without the consent of his client, cannot be examined as to any communication made by the client to him, nor as to his advice given thereon in the course of professional employment. Section 31-0106 NDRC 1943.\n\n15. The basis of any valid objection to the testimony of an attorney under the provisions of Section 31-0106, NDRC 1943, is the relationship of attorney and client and the burden of showing the relationship is on the objector.\n\n16. Where an attending physician is requested by the testator to witness his will, and in accordance with that request does subscribe to the will as a witness, the testator waives the restrictions on the competency of the physician as a witness prescribed by Section 31-0106, NDRC, 1943, and the physician, in an action involving the validity of the will, may be called as a witness and examined and cross-examined the same as any other subscribing witness.\n\nMorris, This is an appeal from a judgment of the District Court of Pierce County vacating and annulling a decree of the County Court of Pierce County admitting a will to probate. The will involved was executed by Ethol G. McIntyre on July 15, 1941. Ethol G. McIntyre died on July 9, 1948, at Miami, Florida. At the time of her death she was, and for many years prior thereto she had been, a resident of Pierce County in this state. She had no children and left no surviving spouse, her husband having died in 1930; but left surviving her three sisters and several nephews and nieces, the children of two deceased sisters. By the terms of the will in question here all former wills made by said Ethol G. McIntyre were revoked, all property owned by her at the time of her death was devised and bequeathed to John A. Stormon, the husband of one of her nieces, and said John A. Stormon was appointed to be executor of the will. In due time John A. Stormon filed in the County Court of Pierce County a petition praying for the probate of the will. The three sisters of Mrs. McIntyre and the children of one of her deceased sisters filed written objections to admitting the will to probate. Such objections were filed first by two of the sisters and a son of one of the deceased sisters. Such objections were signed and verified by one of the attorneys for the contestants on information and belief. Subsequently an amended answer and objections to the petition for the probate of the will were filed by the three sisters of Mrs. McIntyre and by two nephews and two nieces, the children of one of the deceased sisters. The remaining nephews and nieces, children of the other deceased sister filed no objections. In such objections and answer it is stated that the alleged and purported will offered for probate is not the true last will and testament of the deceased, that at the time of the supposed execution of the purported will the decedent was not of sound and disposing mind but 'was of such extreme mental agitation and physical pain that she was not capable of making or undertaking to make a will'; that at the time of the execution of such will she was under the restraint and undue influence exercised by John A. Stormon, that for a long time prior thereto said Stormon had advised the decedent on legal and business matters and that she retained him for many years as her attorney, paid him legal fees for services performed, that said Stormon misused and abused his influence to such extent 'that the decedent was prevailed upon, in the purported will, to disinherit her natural heirs, the members of her family, toward whom she cherished natural affection, and by virtue of said dominant and undue influence of said Stormon he himself became the named beneficiary of the decedent to the unjust, unnatural and unfair exclusion of decedent's family.' That the purported will was at all times kept in the office safe of said Stormon and its contents not divulged to those having equal right to know its provisions. In the first answer and objection it was alleged: 'That said supposed will is not in the handwriting of decedent, and the signature thereto is not decedent's name or in her handwriting, and no person claiming to have signed the name of decedent to said supposed will by his direction has written his own name as a witness to said supposed will.' In the amended answer and objections it was and is alleged 'that subsequent to the execution of the purported will the said decedent repeatedly suggested to John A. Stormon that the provisions of the purported will, signed July 15, 1941, be changed, and revoked; that he took no steps to do so; that by reason thereof, if said purported will were to be operative, the said John A. Stormon would be a trustee of his own wrong.' The amended answer and objections were signed by one of the sisters in behalf of all the contestants, and in the verification it was and is stated that she has read the answer and objections 'knows its contents and that it is true, except as to those allegations made on information and belief, and as to them she believes it to be true.'\n\nThe petitioner, John A. Stormon, interposed a reply or answer to the written answers and objections filed by the contestants wherein he denied each and every allegation contained in such answers and objections except as admitted or qualified. He denied that Ethol G. McIntyre was of unsound mind or mentally incompetent at the time she executed the will or at any time and alleges that the will offered for probate is the last will and testament of Ethol G. McIntyre. He alleges it was subscribed by her as and for her last will and testament and that said last will was signed by the said deceased in the presence of J. A. Johnson and W. H. Adams as witnesses thereto who at her request subscribed their names thereto as subscribing witnesses in the presence of the deceased and in the presence of each other. That the signature to the last will and testament is the genuine signature of Ethol G. McIntyre made in the presence of J. A. Johnson and W. H. Adams as subscribing witnesses thereto who at the request of the deceased, and in the presence of each other and of the deceased subscribed their names thereto. That at the time of the execution of said last will and testament the said Ethol G. McIntyre was of sound and disposing mind and memory. He denies the allegations in the answer and objections that the decedent signed the will under restraint, undue influence and fraudulent representations and statements on the part of Stormon and alleges that said Ethol G. McIntyre, the testatrix, disposed of her property freely and voluntarily in accordance with her own wishes and desires and without any influence on the part of any person whatsoever.\n\nThe issues framed by the pleadings were duly tried and the county court made findings of fact and Conclusions of law sustaining the contentions of the petitioner and made an order admitting the will to probate and appointing John A. Stormon to be executor of the will and issued letters testamentary to him. The contestants appealed to the district court from the judgment and order of the county court and the case came on for trial in the district court and was tried to a jury upon the pleadings that had been filed in the county court. The trial resulted in a disagreement of the jury. Thereafter motion was made in the district court to dismiss the appeal from the county court because of defective proceedings on the appeal to the district court. Such motion was granted and judgment of dismissal was duly rendered and entered. On appeal to this Court such judgment was reversed and the cause remanded for further proceedings. In re McIntyre's Estate, 78 N.D. 10, 47 N.W.2d 527. After the case had been remanded to the district court the petitioner Stormon moved for a change of place of trial on the ground that he could not have a fair and impartial trial in Pierce County. Affidavits were submitted by the petitioner in support of the motion and counter-affidavits were submitted by the contestants. The trial court denied the motion for the change of place of trial and the case was again tried to a jury in the district court upon the pleadings that had been filed in the county court.\n\nA number of witnesses were called by the parties and testified upon the trial. When the contestants had rested their case the petitioner moved the court to direct a verdict sustaining the validity of the will upon the grounds that the evidence showed conclusively that the will was properly executed by Mrs. McIntyre, was properly witnessed and in all respects executed and attested as required by law, that the evidence conclusively shows that at the time of the execution of the will Mrs. McIntyre was of sound mind and entirely competent to make a will; that the evidence further shows that she was not under any undue influence, but that the will was in fact her own free act and deed. That the evidence further shows that she lived for seven years subsequent to the execution of the will and that she was at all times free from any duress or undue influence and that she was at all times free to revoke said will or execute a new one to express any intent or desire had there been any dissatisfaction on her part with the will she executed on July 15, 1941; but that she had expressed confirmation of the will. The trial court denied the motion. At the close of all the testimony petitioner renewed the motion for a directed verdict. The court denied the motion and the case was submitted to the jury.\n\nIn its instructions to the jury the court said:\n\n'Two general questions are presented for your consideration, namely: (1) Was the testatrix, Ethol G. McIntyre, competent to make her will at the time the will in question was executed? and (2) Was the will in question procured by undue influence?'\n\n'You should first consider and determine the question of whether testatrix Ethol G. McIntyre was competent to make her will at the time she executed the same.'\n\n'If you believe from a fair preponderance of the evidence that the testatrix Ethol G. McIntyre, at the time of making her will, which has been received in evidence, did not have testamentary capacity, then you need go no further in your deliberations to answer the second question as to whether the will was procured by undue influence, but you should find that the will in question is not the will of Ethol G. McIntyre, and if you do so find, from a fair preponderance of the evidence, that she was then and there incompetent to make a will, you will also, in addition to signing a general verdict to that effect, sign the special question submitted to you on the question of her competency.\n\n'On the other hand, if you find that Ethol G. McIntyre, at the time of executing her will, was mentally competent to make her will, then you should proceed to determine the second question, namely: 'Was the will in question procured by undue influence?'\n\n'Two forms of verdict will be submitted to you, one reads (omitting the formal parts): 'We, the jury, duly empanelled and sworn to try the above-entitled action, do find that the will in question and offered in evidence is not the will of Ethol G. McIntyre, deceased.' If you find from a fair preponderance of the evidence that at the time of the execution of such will by Ethol G. McIntyre that she was not competent to make a will, or if you find from a fair preponderance of the evidence that the will in question was procured by undue influence and was not, in fact, the will of the decedent, then you will use this form of verdict and you will have your foreman sign and date the same.\n\n'In addition to the foregoing form of verdict, the Court is submitting to you a special question to be answered by you, touching upon the competency of Ethol G. McIntyre to make her will at the time she executed the same, which question reads as follows: 'Was the testatrix, Ethol G. McIntyre, mentally competent to make her will at the time when she executed the same?' It is your duty to answer this question 'Yes' or 'No' irrespective of the probable effect such answer may have and must be determined and answered upon the facts as you find them in the case, from a fair preponderance of the evidence. This separate question will be taken with you to your jury room, and as you answer it you will insert in the space provided the answer 'Yes' or 'No' and when you have so answered it, the foreman will sign and date it and you will return it into court with your verdict.\n\n'The other form of verdict reads (omitting the formal parts): 'We, the jury, duly empanelled and sworn to try the above-entitled action, do find that the will in question and received in evidence is the will of Ethol G. McIntyre, deceased.' If you find from the evidence and under these instructions that she was competent to make her will, or, that the will in question was not procured by undue influence as defined to you and that the will was that of the deceased, then you will use this form of verdict and you will have your foreman sign and date the same.'\n\nThe jury returned a verdict as follows:\n\nSpecial question: 'Was the testatrix Ethol G. McIntyre mentally competent to make a will at the time when she executed the same? Answer: No.'\n\nGeneral verdict: 'We, the jury, duly empanelled and sworn to try the above-entitled action, do find that the will in question and offered in evidence is not the will of Ethol G. McIntyre, deceased.'\n\nUpon the return of this verdict and the special finding the trial court ordered that judgment be rendered and entered, that the will in question and previously admitted to probate is not the will of Ethol G. McIntyre, deceased; that the order and decree of the County Court of Pierce County admitting said will to probate and appointing John A. Stormon executor and directing the issuance of letters testamentary to him be in all things vacated, annulled and set aside; and that the Judge of the County Court of Pierce County be directed to enter an order revoking in all things the order admitting to probate the document purporting to be the last will and testament of Ethol G. McIntyre, deceased, and appointing John A. Stormon as executor, and canceling and revoking the letters testamentary theretofore issued to said Stormon. Judgment was entered accordingly pursuant to such order for judgment. Thereafter the petitioner John A. Stormon moved the court for judgment notwithstanding the verdict or for a new trial. Such motion was denied by the trial court. Thereafter the said petitioner, John A. Stormon, appealed to this Court from the judgment of the district court and from the order denying his motion for judgment notwithstanding the verdict or for a new trial.\n\nIn order to clarify the issues presented for determination on this appeal it should be mentioned that no evidence was introduced or attempted to be introduced showing that the signature to the will was not in the handwriting of the decedent or 'that subsequent to the execution of the will the decedent repeatedly suggested to John A. Stormon that the provisions of the purported will signed July 15, 1941, be changed and revoked.' These allegations were wholly ignored upon the trial; and, as said, there was no proof of any kind tending to support these allegations. In his instructions to the jury the trial court said:\n\n'With reference to the necessary form and ceremony to be gone through, you are instructed that the will in evidence, dated July 15, 1941, is the valid and legal will of Ethol G. McIntyre if, at the time of the execution thereof, she was capable of making a will and if, at the same time, it was not procured by undue influence.\n\n'It is undisputed that Ethol G. McIntyre died in July, 1948, a resident of the County of Pierce and State of North Dakota, and that she left property within said County of Pierce. It is further conceded by all parties that the decedent Ethol G. McIntyre on the evening of July 15, 1941, duly executed the will in evidence, dated July 15, 1941, in the presence of two witnesses to whom she declared it to be her last will and testament, and which said witnesses in the presence of the testatrix and in the presence of each other and at the request of the testatrix signed such will as witnesses; that such will was prepared by the petitioner John A. Stormon, who was at said time an attorney at law and who was at said time the husband of a niece of the decedent; that said will was delivered into the possession of the petitioner John A. Stormon on July 15, 1941, for safe-keeping, and that said will remained in the possession of John A. Stormon until it was by him presented for probate.'\n\nThe challenge to the sufficiency of the evidence to sustain the verdict is therefore restricted to the sufficiency of the evidence to sustain the finding of the jury that the testatrix was not competent to make a will. And the question as to the mental competency of the testator to make a will is to be determined as of the time of the execution of the will. 1 Page on Wills, pp. 233-234; 68 C. J. 416.\n\n'In determining the issue of testamentary capacity, the only question is whether the testator was competent at the time of the execution of the will.' 28 A. \u0026 E. Ency. of Law, 2d Ed., p. 77.\n\nMrs. McIntyre owned a home in Wolford in Pierce County, North Dakota, and at Mrs. McIntyre's invitation her sister Mrs. Nerison and her husband came to Wolford the first week of July, 1940, and took up their residence there. The Nerisons and Mrs. McIntyre were living there in July, 1941. Mrs. Nerison testified that Mrs. McIntyre became ill and Mrs. Nerison desired to call a doctor but Mrs. McIntyre did not want this done and stated that 'as soon as this attack blows over I am going up and have a check-up'; that the pain became worse and on Sunday, July 13th, Mrs. McIntyre asked Mrs. Nerison to take her to Rolla where they would pick up Mrs. Rosscup (a niece of Mrs. McIntyre and of Mrs. Nerison), and then go to Dr. Johnson and the hospital at Bottineau. That they went by auto, Mrs. Nerison driving. That it was a rainy afternoon. That Mrs. McIntyre became nauseated and they decided it were better not to go by way of Rolla but to go directly to Bottineau. That she called Dr. Johnson by long distance telephone from Dunseith to be certain that he would be available and that he asked them to come directly to his office or clinic. That they reached Bottineau about 9 o'clock in the evening and went to Dr. Johnson's office or clinic. That after he had examined Mrs. McIntyre he called the hospital and directed that she go to the hospital. That as she recalls Dr. Johnson gave Mrs. McIntyre some medicine at the office to ease her pain. That it was about 11 o'clock that evening when Mrs. McIntyre reached the hospital.\n\nDr. Johnson testified that Mrs. McIntyre came to consult him on July 13, 1941. That she had a pain in her abdomen, that she was admitted to the hospital that night, that on July 15th he was called to witness an instrument which she executed. On being shown the will in question here he testified that the document which was exhibited to him was the one which he witnessed. He testified that he saw Mrs. McIntyre sign it in his presence, that no one urged her to sign it, that at the time she signed it Attorney Adams of Bottineau and Mr. Stormon were present. That she said it was her will and that she requested that he and Mr. Adams each sign as a subscribing witness. He testified:\n\n'Q. There was some evidence offered the other day by Mrs. Nerison with reference to some medicine being given to Mrs. McIntyre, I believe on the fifteenth day of July, to ease her pain. If you wish you may refer to the medical, the hospital records, and from that can you tell us whether or not anything was administered to Mrs. McIntyre that would in any way have affected her mental alertness the evening of July the fifteenth? A. She had a small dose of morphine shortly after twelve o'clock a. m. on the fifteenth. One-eighth of one -- or one-eighth of a grain of morphine. This was administered on account of some reaction following the dye that was given for gall bladder picture partly nauseated, and so on, and the nurse called me up at that time, * * *. This is a small dose. * * *\n\n'Q. Would a dose of one-eighth of a grain of morphine, administered some eighteen hours beforehand, in any manner affect her mental alertness at the time the will was executed? A. There was no effect remaining at the time the will was signed.'\n\nDr. Johnson testified that it was the practice of the hospital to call the physician in charge before morphine was administered and determine whether morphine should be administered. He further testified that during the time Mrs. McIntyre was in the hospital he had occasion to visit her frequently and talk with her. That she did not at any time consult him with reference to any mental ailment and that he did not observe any mental ailment, that she was a very bright woman, that at the time the will was executed she carried on a conversation with Dr. Johnson and with Mr. Adams, and that it was a perfectly normal and intelligent conversation.\n\nThe petitioner sought to prove by questions propounded to Dr. Johnson that at the time the will was executed by her she was competent and in full control of her mental faculties. There was objection by contestants' attorneys on the ground that the testimony sought to be adduced was privileged because of patient-physician relationship between Dr. Johnson and Mrs. McIntyre. Petitioner's attorneys also made an offer of proof to which the same objection was made by contestants' attorneys. The objection was sustained and the proffered testimony was not admitted.\n\nMr. Adams testified that he is a practising attorney in the City of Bottineau and has been practising there for more than 40 years. That he was one of the subscribing witnesses to the will of Mrs. McIntyre on July 15, 1941. That the will was executed in a room at St. Joseph's Hospital at Bottineau. That Mr. Stormon came to his home in Bottineau in the evening while Adams was working in his yard, that he accompanied Stormon to the hospital to Mrs. McIntyre's room. That she was sitting up in bed when he was introduced to her, that he had never met her before, that Dr. Johnson was there and that she said that she wished that Dr. Johnson and Mr. Adams would witness her will, that she said it was her will, that she signed it in their presence, that no one urged her to sign it, that he and Dr. Johnson signed it as subscribing witnesses at her request in her presence and in the presence of each other, that it is his recollection that she was sitting up in bed when he was introduced to her and when she signed the will.\n\nMrs. Nerison testified that she was about sixteen or seventeen years younger than Mrs. McIntyre. That Mrs. McIntyre was born in 1877 and that Mrs. Nerison was born in 1893. That after she and Mrs. McIntyre had married there was as much association between them and their sisters as possible. That she frequently helped Mrs. McIntyre with small loans, that in 1939 she loaned Mrs. McIntyre $140 to make payment on her car. That this took place in California where Mrs. Nerison and her husband were living at the time and that Mrs. McIntyre was spending the winter with them. Mrs. Nerison testified that Mrs. McIntyre gave a note for the loan of funds to make payment on the car. She identified another note given by Mrs. McIntyre in October, 1938, for $775 to Rev. and Mrs. Nerison payable one year after date and identified a list of checks sent to Mrs. McIntyre totaling $638.50. She further testified that the loans referred to by her were all repaid with the exception of an item or two for which she had submitted a claim against the estate of Mrs. McIntyre. Mrs. Nerison testified that her husband was pastor of a church at Wilmot, South Dakota, and that they lived at Wilmot for more than twenty years. That they moved to Wolford in 1940 when her husband was forced to resign because of ill health and that they have made their home at the McIntyre home in Wolford the greater part of the time since 1940. That Mrs. McIntyre gave them the use of an upstairs apartment in her house rent free and invited and urged them to come.\n\nMrs. Nerison testified that after Mrs. McIntyre was taken to the hospital she (Mrs. Nerison) went to the Stone Hotel in Bottineau. That she went to the hospital to see Mrs. McIntyre both on the 14th and 15th days of July. That when she was in the hospital on the 14th Mrs. McIntyre was given something to alleviate pain but that she (Mrs. Nerison) does not know what it was. That she spent considerable time at the hospital that day and that she saw Mrs. Stormon at the hospital. That Mrs. Stormon had taken her father there for treatment because of an operation that had been performed on his nose sometime before. That she had left word at the desk at the clinic to tell them (Mrs. Stormon and her father) that Mrs. McIntyre was at the hospital and after they were through at the clinic they came to the hospital. That on July 15th she went to the hospital before 8 o'clock in the morning. She was asked by contestants' counsel, -- 'Can you tell us of your own knowledge whether anything was done to alleviate Mrs. McIntyre's pain on the 15th?' She answered, 'Well, I saw medication administered but I don't know what it was.' When asked whether the medication seemed to give any relief to Mrs. McIntyre, she answered, 'She was very drowsy.' Mrs. Nerison testified that she did not go to the hospital on the night of July 15th. That shortly after supper that evening Mr. and Mrs. Stormon came to the Stone Hotel, that they talked together and that Mrs. Stormon stated that John (Mr. Stormon) was going to the hospital on business, and that Mrs. Stormon stayed with her until Mr. Stormon returned, which she estimates was sometime between 9 and 10 o'clock that evening. On cross-examination she testified:\n\n'Q. You knew that Mr. Stormon's business at the hospital was with Mrs. McIntyre, did you not? A. Well, I presumed it was. She just said he was going to the hospital on business.\n\n'Q. And, as a matter of fact, hadn't Mrs. McIntyre requested you that morning to call Mr. Stormon on the telephone to come over? A. No, sir, she had not. * * *\n\n'Q. You presume that he had been called by the hospital? A. I presume, but I don't know.\n\n'Q. Anyway, from what you presumed or from what you knew, you believed that a will had been drawn at the hospital that night? Did you not? A. Well, I don't know what other business a lawyer would have with a woman that was as low as she was.\n\n'Q. So you took it for granted that that was the business that was -- A. I sensed -- I sensed that that must be the case.\n\n'Q. Did you ask Mrs. McIntyre about the business or if a will had been made when you next talked with her? A. Mr. Duffy, I have better manners than that.\n\n'Q. You mean that you wouldn't ask your sister anything about whether she had made a will or not? A. I certainly would not.\n\n'Q. You thought that Mrs. McIntyre was perfectly competent to take care of her own business without any assistance or suggestions from you? A. No, sir. I did not think she was competent. She was too sick a woman to make a will. * * *\n\n'Q. Then if you thought that, didn't you feel under any obligation to do anything about finding out from her after she was well whether or not she had made a will or whether or not the will that she may have made was one that satisfied her? A. No, sir, I did not feel under any obligation to inquire into her personal affairs.'\n\nMrs. Nerison testified that she never asked Mrs. McIntyre about the business that she and Mr. Stormon transacted at the hospital that evening. That she and Mrs. McIntyre occupied the same house, and were there together in the summertime for some seven years after that business was transacted. That during that time Mrs. Nerison made no inquiry and Mrs. McIntyre made no statement regarding such matter. She testified that Mrs. McIntyre wore glasses and she had her glasses with her in the hospital, that her eyes were giving her trouble and that she wrote letters for Mrs. McIntyre while she was in the hospital, to members of her family. Mrs. Nerison testified that she left Bottineau on the morning of July 16th and went to her home at Wolford, that she returned to Bottineau on Friday, July 18th, and entered the hospital for surgery the next morning, that is, Saturday, July 19th. That she and Mrs. McIntyre were in separate rooms the first week and after that they shared a room in the hospital. That Rev. Nerison (Mrs. Nerison's husband) brought Mrs. McIntyre from the hospital to her home in Wolford the first part of August, that she continued to convalesce but slowly. She testified:\n\n'Q. Mrs. Nerison, Mrs. McIntyre was not recovered until after May of 1942, is that correct? A. Yes, I would say sometime -- she had a fall during the winter which retarded her recovery.'\n\nMrs. Nerison testified that she recalls Mrs. McIntyre going to Duluth in September, 1941, to attend the funeral of Henry Middaugh. That there was some coolness or estrangement between her and Mrs. McIntyre after she and her husband came back to Wolford in 1940, that she understood that their coming to Mrs. McIntyre's home had caused some jealousy, that there were those who tried to make trouble between them and succeeded for a short time. That in the winter of 1944 they (she and her husband) were managing an apartment house in Long Beach and that Mrs. McIntyre wrote them in 1944 and asked them to forgive her for any hurt she had caused them and begged them to come back, that she understood someone had said things to Mrs. McIntyre which resulted in her coolness toward Mrs. Nerison, that that is what Mrs. McIntyre told Mrs. Nerison but 'she never stated who.' She further testified that in 1947 Mrs. McIntyre wrote a list of the names of her sisters, nephews, and nieces on the back of a circular. There were twenty-one of these relatives in all. Mrs. McIntyre said she would like to have deeded a quarter section of land to each one, but as long as she had indebtedness she hadn't done so because she needed the revenue to clear up her debts. Mrs. Nerison testified that in 1935 or 1936 Mrs. McIntyre, who then was in California, sent her an olographic will wherein she left all her property to Mrs. Nerison, that nothing was left to any of the other sisters. That the will was accompanied by a letter wherein Mrs. McIntyre stated that she was sending the will because she was going out on an excursion on the ocean and had a feeling that she might not come back and that 'if I don't come back, this is the way I want it.' She told us to put the will in our safety deposit box and my husband put it in our box at the bank. When Mrs. McIntyre returned in the spring my husband went down to the bank and brought the will up to the house and returned it to her. The letter which it was said accompanied the will was not introduced in evidence and the only evidence relating to the will was the testimony of Mrs. Nerison.\n\nIn the course of Mrs. Nerison's testimony there was offered in evidence a copy of a letter which she testified was in the handwriting of Mrs. McIntyre and had been written by her to the Collector of Internal Revenue. The letter is addressed to the Collector of Internal Revenue at Fargo and is dated May 14, 1942. In that letter she said:\n\n'Illness has caused an last hour rush with my income tax report -- The 'blank' is some what confusing -- perhaps because I am not yet very clear in my thinking. I will as briefly as possible explain the situation.\n\n1st I am a widow\n\nThe property is farm land, worked by tenants on the 50-50 basis.\n\nTotal income from crops sold also, Government Parity \u0026 Conservation payments total $8,828.00.\n\nI have no other income.'\n\nThere follows a statement of various expenses and payments for which deductions may be made, such as taxes, interest on Federal Land Bank loans and other indebtedness, and various expenditures incident to the farming operations such as taxes, expenditures for seed, threshing, insurance and repairs. Stress is laid upon the statement, 'The 'blank' is some what confusing -- perhaps because I am not yet very clear in my thinking.' It is contended that this is a declaration on the part of the testator indicating mental incompetency and lack of testamentary capacity.\n\nContestants introduced in evidence a will executed by Mrs. McIntyre, September 7, 1931. The will was prepared at Rugby by Harold B. Nelson, then a practising lawyer in that city and now one of the district Judges of the State. The will directed that the executor named in the will as soon after the decease of the testator, as conveniently might be, pay all her just debts and funeral expenses. It expressly revoked all former wills, codicils or other testamentary Dispositions theretofore made by her and provided that her estate descend to her lawful heirs according to the law of succession of the State of North Dakota. It stated, 'this instrument is made for the express purpose of revoking all former wills, codicils and testamentary Dispositions heretofore made by me,' and appointing an executor for the estate. She appointed as such executor Harold B. Nelson, the attorney who had prepared the will and who also had represented her in litigation involving the estate of her deceased husband. The contestants called as witnesses the subscribing witnesses to the will, Lutz and Gronvold, both residents of Rugby. Gronvold testified that he had lived in Rugby all his life. That he knew Mrs. McIntyre and witnessed the will executed September 7, 1931, which was exhibited to him, that he and Lutz signed the same as attesting witnesses in the office of Harold B. Nelson at Rugby, that he had known Mrs. McIntyre for a period commencing about five years prior to the execution of the will. That he was with the Gronvold Motor Company of Rugby. That Mrs. McIntyre transacted considerable business with such company and was in their place of business at Rugby quite frequently during that period of time. That he had an opportunity to see whether she was an alert and intelligent woman, that he thought she was very much so in transacting her business. That she exercised her own judgment and did not rely entirely upon the persuasiveness of the salesman or whoever was doing business with her, that Mrs. McIntyre was one of the regular customers of the Gronvold Motor Company, that she was in there quite often, once a month or so. That the last year he saw her was in 1941 or 1942.\n\nLutz testified that he had been employed by the Gronvold Motor Company for about twenty-five years, that he knew Mrs. McIntyre, that he signed as one of the attesting witnesses on the will made September 7, 1931, that they were in Mr. Nelson's office at the time the will was signed, that he had known Mrs. McIntyre since about 1931, and that she did business with the Gronvold Motor Company from time to time, that this continued up until 1947 or thereabouts, that she was a bright, intelligent woman and was that all the time that he knew her, that in carrying on her business transactions she exercised her own independent judgment and seemed very capable. That during the time she lived in Wolford she was over at Rugby for service on her car and matters of that kind quite regularly, probably once every two or three weeks.\n\nGeorge Nerison testified that he is the husband of Ina Nerison, that he knew Mrs. McIntyre for about twenty-five years and that during that time she and her sisters were on friendly terms. That he has visited at Mrs. McIntyre's home on many occasions. That he was in the Veterans' Hospital at Minneapolis for many years and in 1940 when he and his family had to move from Wilmot, South Dakota, their former home, Mrs. McIntyre came to see him at the hospital and said: 'George, I would like very much for you and Ina and the boys to move up to my place. You know I am alone in that big house and I would like very much to have you move up there.' That they had been up there previously, especially in the summertime; that she never asked him to manage any of her farms but asked about matters relating to the farms. That he did some repair work on her buildings especially the one in town. That in certain instances she asked his advice in connection with her farming operations. That he was pastor at the funeral services held for her at Wolford, the last services being conducted at Rugby by a minister from Rolla. That Mrs. McIntyre and her sisters corresponded regularly and sent round robin letters to each other and all maintained friendly relations up to the time of her death. That in 1947 Mrs. McIntyre, who then was in Florida, wired him (Rev. Nerison) to come down; that she had her car there and wished very much to bring that back of North Dakota because of the liability that might be incurred. The guests in the guest house wanted to use it and she felt responsible for any accident that might happen so she was anxious to get it back but didn't care to drive alone that far through all the traffic, so 'she wired me to come down and, of course, paid all of my expenses.' I went to Miami and we drove back in her car. This was in the first part of August 1947. I would say that Mrs. McIntyre was a person who made friendships quickly and was a woman who sometimes placed her trust quickly. In 1946 we were all invited to Stormon's summer home at Lake Upsilon for a day but she said before we got up to the lake, 'Now, if you folks want to stay overnight, you may do so and I will come back for you tomorrow, but, under no circumstances do I want to stay overnight and be under any obligation to the Stormons.' None of us stayed overnight except my son. We are living in the McIntyre home at Wolford at the present time. We have called that home since 1940.\n\nJulia Hart was called as a witness by the contestants. She testified that she knew Mrs. McIntyre, visited and sometimes stayed in her home at Wolford. That she knew that Mrs. McIntyre was in the hospital at Bottineau in July, 1941, and talked with her after she returned home. That this was about the first part of August, 1941. Mrs. Hart testified she met Mrs. McIntyre on the street and asked her 'how she felt and so forth' and that Mrs. McIntyre asked her up to the house to have lunch with her and so she went up and was there for awhile. That Mrs. McIntyre had talked things over with Mrs. Hart's husband, and seemed to be interested in Johnny (Mrs. Hart's son) and asked what provision she (Mrs. Hart) had made for him, that Mrs. Hart told her and Mrs. McIntyre agreed that she (Mrs. Hart) was right. She testified further:\n\n'Q. And then what did you say to her? A. 'What have you done about yours?'\n\n'Q. And what did she say in response to that? A. She didn't speak for a minute and then she said, 'Well, I fixed up some papers with John Stormon that I think will take care of me until I get a will made.'\n\n'Q. And was that all that was said at that time about that particular subject? A. No, I asked her what kind of a paper.\n\n'Q. Oh, yes. A. And she got up and asked me if I would have some more coffee. She didn't say much about answering it, and then she went in the kitchen.'\n\nWhen asked if Mrs. McIntyre was an impressionable woman, she answered, 'I couldn't say that, but she sometimes asked me questions in regard to the farms and I never had a business transaction with Mrs. McIntyre. I never borrowed nor loaned money, and I think if she liked you, she would do a lot for you.'\n\n'Q. And do you also know whether or not she was subject to firsthand impressions; this is, did she quickly make friends? A. I think she did; very easy to make friends.'\n\nJohn A. Stormon testified: I have practiced law in Rolette County for thirty-four years. I was acquainted with Mrs. McIntyre. I prepared contracts for her in matters of joint tenancy and prepared some contracts for deed during the last two years of her life. In the Cooper estate in which Mrs. McIntyre and her sisters were interested I prepared the order allowing the account and the final decree of distribution and served the citation for the final hearing for the administrator. I prepared the instrument marked Exhibit 5, the will of Mrs. McIntyre made on July 15, 1941. On the day before, that is on July 14th, about suppertime I was informed by my wife that Mrs. McIntyre was in the hospital at Bottineau. My wife had been over at the hospital that day with her father (Rosscup) who received some medical treatment there. There was no Discussion between my wife and myself about going over to Bottineau to see Mrs. McIntyre that day nor was there any such talk in the forenoon of July 15th. About 4:30 o'clock in the afternoon of July 15th I received a telephone call from Bottineau telling me that Mrs. McIntyre was going to have an operation and asked that I come over and prepare her will. Mrs. Stormon and I left for Bottineau somewhere around 6 o'clock and reached there approximately 7 o'clock. I brought with me my L. C. Smith-Corona portable typewriter and a legal blank of a will. I did not carry a standard machine with me. I used the legal blank in writing the will. We first went to the hospital and Mrs. Stormon and I both went up to see Mrs. McIntyre. Mrs. McIntyre said: 'John and I have some business to attend to' and then my wife left and went up town. I knew she was going down to the hotel to see Mrs. Nerison. Mrs. McIntyre had her glasses on during the evening and I think she had them on when I walked into the room. If not, they were lying on the bedside table. I went to my automobile for the portable typewriter and my brief case. I at no time advised or urged Mrs. McIntyre to make the will. I did not plan the will. Mrs. McIntyre dictated the provisions thereof and I wrote the will in accordance with her directions. With respect to paragraph 5 of the will which gives the executor authority to sell and convert property into cash, she stated that the unpaid taxes and encumbrances on the land were such that it might be necessary to sell some land in a hurry to make a redemptions so for that reason she wanted this provision in the will. I wrote the will on my portable typewriter in the hospital office. After I had written the will I took it to Mrs. McIntyre's room. I gave it to her and she read the will During the time I was away to bring Mr. Adams the will was with Mrs. McIntyre. My best judgment would be that I was gone about 15 to 20 minutes. I was present in the room when Mrs. McIntyre signed the will and when Mr. Adams and Dr. Johnson signed as attesting witnesses. On July 15, 1941, there were four lawyers in the City of Bottineau, one being Mr. Adams. I was married to Eva Rosscup, my present wife, in October, 1917. Mrs. McIntyre employed Harold B. Nelson of Rugby as her attorney to probate the estate of her husband, John H. McIntyre. Mrs. McIntyre filed Mr. McIntyre's will and later another will was filed and there was a contest and the original will filed by Mrs. McIntyre was admitted to probate. I did not have an envelope with me at Bottineau and I brought the will back to my office at Rolla, placed a notation on the envelope and then placed the will therein and sealed it. Later I placed the envelope containing the will with other papers belonging to Mrs. McIntyre in a larger envelope. The other papers were principally United States Savings Bonds that I received from time to time as they were sent to me or delivered to me by her. These papers were kept in a metal safekeeping box in the vault in my office at Rolla. During the years I have practiced at Rolla I have drawn a good many wills and many of them have been left with me for safekeeping, to be placed in the vault. I have quite a number at the present time. My guess would be in the neighborhood of fifty.\n\nMr. Stormon testified that Mrs. McIntyre's property at the time the will was made on July 15, 1941, consisted of the residence in Wolford in Pierce County and farm lands in Rolette and Pierce Counties. There were in all approximately 3800 acres of such farm lands. One quarter in Rolette County came to her on division of the property in the Cooper Estate and title to one or two quarters in Pierce County was in her name at the time of the death of Mr. McIntyre. Title to the rest of the land came to her by virtue of the final decree of distribution in the estate of her husband, John H. McIntyre. At the time the will was executed there were mortgages against the lands in both counties. There were mortgages of record against the lands in Rolette to the Federal Land Bank or Land Bank Commissioner totaling $10,500 and a mortgage to Tillie Traynor for $1192.00, there were three mortgages of record against the lands in Pierce County totaling $12,300. There were unpaid taxes against the lands in both counties. In Rolette County there was a contract for adjustment of delinquent taxes, Laws N.D.1937, Ch. 240, in the amount of approximately $2,100. The 1940 taxes were also unpaid. The total taxes due and unpaid on the Rolette County lands amounted to $2,424 without interest or penalty. The Federal Land Bank had paid taxes from 1934 to 1939 on the lands on which it had a loan. There was also a contract for the adjustment of delinquent taxes in Pierce County on the home and lots in Wolford and farm lands in Pierce County aggregating something over $3,300. Mr. Stormon testified that in 1942 Mrs. McIntyre brought me certain Government bonds. I think the first bonds were delivered to me on the street. Other bonds were subsequently delivered to me at the office. She also bought additional bonds in 1943, 1944, and 1945 which were brought to me. The bonds were all put in the big brown envelope in which the will was kept. Of the bonds purchased by Mrs. McIntyre in 1942 and so delivered to and held by Stormon $300 in maturity value contained Stormon's name either as joint payee or were payable to him in case of death of Mrs. McIntyre; of the bonds purchased in 1943, $700 in maturity value were made so payable; of the bonds purchased in 1944, $4,500 were made so payable; of the bonds purchased in 1945, $1,000 were made so payable. Mr. Stormon testified that Mrs. McIntyre came to his office in the forenoon of November 9, 1946, and asked him to figure out approximately the cash value of the bonds. That he took the envelope containing the will and the bonds from the metal box in the vault, opened the envelope and laid the contents out on the table where he was sitting on one side and she on the other. That she asked Stormon to telephone the president of the Rolette County State Bank and ascertain if she could bring over some bonds she wanted to redeem. That he answered in the affirmative and that she took the bonds to the Rolette County State Bank about a block away and cashed them. That this was at the time she was back in North Dakota to obtain some funds needed to complete the purchase of the guest house in Florida. He testified further that Mrs. McIntyre told him in the fall of 1946 that she was getting a loan of $10,000 from her sister Mrs. Hong. That he had seen the claim which Mrs. Hong has filed against the estate and as executor of the estate he has verified the fact that Mrs. McIntyre acknowledged this obligation. That the first notice he had of the death of Mrs. McIntyre was on July 9th, 1948, when he received a telegram to that effect from her sister Mrs. Hong.\n\nJ. W. Moffatt testified that he is cashier of the Merchants Bank at Rugby and had been working for the bank in that capacity since 1928. That he had been acquainted with Mrs. McIntyre for about fifteen years. That during that time she did banking business at the Merchants Bank, that is, she was a banking patron of that bank for about fifteen years. That she purchased United States Savings Bonds through the bank, that they were either purchased directly through the bank or came in from one of the various bond drives that were conducted throughout the country. He produced and there was offered in evidence records of the bonds purchased by Mrs. McIntyre which were in effect duplicates of the bonds that had been issued. These records showed that some of the bonds had been issued to Mrs. McIntyre personally but that a large number of them had been issued to her and were payable on her death to John A. Stormon. He testified that these records had been in the hands of the bank since the bonds were issued. Moffatt testified that Mrs. McIntyre came to the bank to look after her own affairs. That he had occasion to take care of some of her matters personally. That she made several loans. That at times she made loans which he handled personally. That they transacted business with Mrs. McIntyre in 1941. That he recalls one loan which he made in 1946 at the time she bought the apartment in Florida. He recalls a conversation with her in connection with that transaction. She asked for a large loan which the bank was unable to make but he did make her a loan which he believes was for $500. The conversation that he had with her at that time was on an intelligent level. That Mr. Stormon never came to the bank in connection with Mrs. McIntyre's affairs during her lifetime. Moffatt testified that he was in the bank practically all the time. That he recalled that a man by the name of Parkman was employed by Mrs. McIntyre at one time but he does not know anything about whether Mrs. McIntyre turned over to Parkman blank checks to be filled in by him.\n\nEva Stormon testified: I am the wife of John Stormon. We were married in 1917 and have lived at Rolla since we were married. My mother, Rosa Rosscup, was a sister of Mrs. McIntyre, Mrs. Nerison and Mrs. Hong. I have known Mrs. McIntyre ever since I was a little girl. I also was well acquainted with her husband. They frequently visited at the Rosscup home when I was a little girl and also at the Stormon home after I and Mr. Stormon were married. Mrs. McIntyre was very good to me. I visited her and she visited me throughout the years. She called me when her husband died to be with her and all through the years we have been back and forth. Mr. McIntyre died in 1930. He died in his home in Wolford. She called me the morning that he died saying she was alone and would I please come and be with her. I did go and stay with her. On July 14, 1941, I was at Dr. Johnson's clinic at Bottineau in connection with some treatment that my father was to receive and while I was there I received word that Mrs. McIntyre was in the hospital. It was either the nurse or the girl at the desk in the clinic that told us that Mrs. McIntyre desired to see us up at the hospital and so I and my father and Susie Rosscup all went up to the hospital. She was in bed, slightly sitting up. She carried on a conversation with me and the others who were present. I remember asking her how she felt and she told us the tests she was going through. My father was quite restless and kept picking at the adhesive tape that held the bandage on his nose and I remember her joking him saying that he was far too old to be picking his nose. She appeared to be bright and intelligent at the time and understood what was going on. In these respects she was as bright as she normally was. Mrs. McIntyre was a very bright woman. Since the death of her husband she had managed a considerable amount of farm land in Pierce and Rolette Counties. I was in the hospital again on the 15th of July. When I told my husband, John Stormon, at suppertime on the 14th that Mrs. McIntyre was in the hospital we made no plans to go to Bottineau to see her the next day. She did not advise me when she was going to have the operation. She did not know, she was still taking tests. On the 15th Mr. Stormon came and told me that he had had a call from Aunt Ethol to come and make her will. We went directly to the hospital at Bottineau. Mr. Stormon and I went to her room in the hospital together. She carried on an intelligent conversation with us. I asked her how she was feeling and she told me about having to go through the operation and that Dr. Johnson had told her that she need have no fear and she asked how we had gotten home with dad. She asked if my sister-in-law and I would come to the hospital and be with her before the took the ether and also after she was coming out of the ether because someone had told her that people said such peculiar things when they were going under. After this talk she said, 'John and I have a little business to take care of.' I took that as an invitation to leave the room and I did leave. I went to the Stone Hotel, I went to the desk and asked for the number of Mrs. Nerison's room, I went up and Mrs. Nerison was writing letters. She seemed surprised to see me and I told her that Mr. Stormon had been called by Aunt Ethol to come over on a little business, and we went outside and walked up and down on the street. We went over and looked at Dr. Johnson's flowers and Mrs. Johnson invited us to come and look at her garden. I remember having a conversation with Mrs. McIntyre with reference to her will in 1947. The Discussion was in my home at Rolla. I was in the kitchen getting lunch and she came and sat down at the kitchen table. She said, 'Eva, this is the last time I will see you before I leave for Miami, and there is something I want to tell you. I have left you considerable, but I realize in my affairs that it takes a man to handle men. John is my administrator, but I want you to see to it that Howard and Dean (sons of Mr. and Mrs. Stormon) each get the thousand dollars Uncle John wished them to have.' I said, 'Ethol, the girls will not like that. Catherine has done well. Why do you not have her for your administrator?' She answered, 'I do not want Catherine.' She said, 'Catherine and Ada have plenty and too much to worry about already.'\n\nHarold B. Nelson testified that he is at the present one of the district Judges of this state. That before being elevated to that position he practiced law in Rugby since 1916. That during that time he was an attorney for Mrs. McIntyre and acted as her attorney in the proceeding involving the probate of a will or wills involving her husband's estate. That he personally handled substantially all the probate proceedings. That he also acted as attorney for Mrs. McIntyre subsequent to the probate of her husband's estate. That he prepared a will for her in 1931. That he also assisted her with a loan in 1946 and between those dates she consulted him on various matters. That in the various contacts with Mrs. McIntyre she personally handled her business affairs. That she discussed with him many times matters arising in connection with her husband's estate, also the reasons for making her will in 1931 and the problems that called for the loan she was negotiating in 1946, that was the time she was purchasing the guest house in Florida. That she carried on those conversations and interviews as an intelligent person would. That he saw Mrs. McIntyre at various times during 1939, 1940 and 1941, and that at all times she carried on her conversations and business as an intelligent person would do. That she appeared to be entirely competent to handle her business.\n\nAda Hong, testified that she is Mrs. McIntyre's sister, that she was in Miami, Florida, at the time of Mrs. McIntyre's death on July 9, 1948. That Mrs. McIntyre was 72 years old when she died. That Mrs. McIntyre had a home at Wolford, North Dakota, where she had lived for many years also that she had a house (guest house) in Miami, Florida, which she bought in 1946. That there were six sisters (the Cooper sisters) that is, four sisters other than Mrs. McIntyre and Mrs. Hong. That after 1920 all the sisters had left North Dakota except Mrs. Rosscup (Mrs. Stormon's mother) and Mrs. McIntyre. (It appears in the record that Mrs. McIntyre and her husband were married in 1894). Mrs. Hong testified that after their marriage Mrs. McIntyre and her husband usually went to Florida or the Isle of Pines for the winter. That they spent some sixteen winters on the Isle of Pines. That Mrs. McIntyre took a correspondence course in Law. That Mr. McIntyre died in 1930 and that after his death Mrs. McIntyre took over the management of the farms that Mr. McIntyre owned in North Dakota at the time of his death but that she at one time employed one Mr. Parkman to aid in such management. Mrs. Hong testified that upon the death of Mrs. McIntyre she wired John Stormon informing him of her death. She testified that Mrs. McIntyre had always told her in case of her death to wire her attorney Mr. Stormon or notify him. That Mrs. McIntyre did not tell her he would look after her affairs if anything happened to her but that she did tell her that he would look after the farms while she was away, for instance. Mrs. Hong testified that after Mrs. McIntyre had purchased the guest house in Miami she requested that Mrs. Hong loan her some money or go in with her in the purchase of the guest house. That in October or November 1946 Mrs. Hong loaned Mrs. McIntyre $10,000. That Mrs. McIntyre paid $60,000 for the property, that she made various propositions to Mrs. Hong relative to her sharing in the profits of the guest house but she did not arrive at any final Disposition other than that she gave Mrs. Hong a note for $10,000 for the amount of the loan. That that obligation is still owing and that Mrs. Hong has filed a claim against the estate of Mrs. McIntyre for the amount of money owing to her on such note.\n\nA photostatic copy of the note was offered and received in evidence as a part of the testimony of Mrs. Hong. The note bears date November 12, 1946, is payable on demand and bears interest at the rate of ten per cent per annum, interest payable semi-annually. There was also offered and received in evidence as a part of the testimony of Mrs. Hong a photostatic copy of a contract dated on the same date as the note. This entire contract is in the handwriting of Mrs. McIntyre, it refers to the loan and to the promissory note and provides that Mrs. Hong may elect to use the note or the monies therefrom to acquire a one-sixth interest in the guest house in lieu of payment of the note and in event of such election she is entitled to receive a one-sixth interest in the net proceeds and in the event of the death of Mrs. Hong, $10,000 and accumulated interest and profits or both shall be paid to her children. There was also offered and received in evidence as part of the testimony of Mrs. Hong another agreement dated May 1, 1947, written by Mrs. McIntyre, referring to the fact that Mrs. Hong had furnished $10,000 used in the purchase of the guest house and that said guest house is listed for sale at $5,500 in excess of the amount paid for it and stating further that Mrs. McIntyre promised Mrs. Hong $10,000 and in addition thereto one-half of the profits of sale, if any; and such agreement provides that in the event the sale of the guest house is made at a loss then Mrs. Hong is to receive $5,000 over and above the $10,000 in lieu of the agreement first made for one-half of the profits. Such agreements are presented with the note in support of the claim filed by Mrs. Hong in the county court against the Estate of Mrs. McIntyre.\n\nMrs. Hong testified that in July, 1947, one Mrs. Domberg who at that time was a paying guest in the guest house offered to take over and manage the guest house until Mrs. McIntyre (who at that time was about to leave and did leave on a trip to North Dakota) came back to Florida. Mrs. Domberg did so take over and manage the guest house until Mrs. McIntyre returned from her trip to North Dakota about Thanksgiving 1947. Mrs. Hong testified that in December 1947 Mrs. McIntyre wrote and asked her to return that she did return in December, 1947, and that she again assumed the duties of assisting Mrs. McIntyre in the operation of the guest house. That she was again called home to Minnesota in May, 1948, and returned to Miami about the middle of June 1948 and that she again assisted Mrs. McIntyre in managing the guest house from the time she returned in June until Mrs. McIntyre's death. Mrs. Hong testified also that while she (Mrs. Hong) was gone to Minnesota Mrs. McIntyre closed the deal whereby Mrs. Hong bought a house, located about two blocks from the guest house.\n\nMrs. Hong testified concerning Mrs. McIntyre's last illness and the physician who attended her and performed the operation. She testified that Mrs. McIntyre had been taking treatment from a firm of chiropractors consisting of husband and wife and that they had advised her to consult a certain doctor in Miami and that when this became known to Mrs. McIntyre's friend, Mr. Davis, he tried to stop it. That she (Mrs. Hong) urged that her sister get the best medical care possible. That Mr. Davis and she went to the hospital but that Mrs. Hong was unable to walk the stairs and that Mr. Davis was the logical one to urge her to get better care, that she (Mrs. Hong) had a conversation with the physician who attended Mrs. McIntyre and performed the operation and urged him to have a doctor in consultation but that he refused to do so. She testified that after the death of Mrs. McIntyre she went to North Dakota and attended the funeral exercises, that shortly after the funeral she and the other living sisters of Mrs. McIntyre and Mrs. Nerison's husband met at Mr. Stormon's home in Rolla, and that Stormon read the will and that that was the first time she learned of the provisions of the will.\n\nMrs. Hjelmer Orvedal who was called as a witness in behalf of the contestants testified that she has lived at Wolford about 29 years. That her husband rented land from Mrs. McIntyre and farmed the same for some 26 years. That during that time they were in contact with Mrs. McIntyre a great deal of the time. That during such time Mrs. McIntyre was, as far as she knows, friendly with her sisters and as far as she observed was on friendly relations with all the members of her family. That she occasionally mentioned them in casual conversations and spoke of them in a kindly manner. That Mrs. McIntyre was a friendly woman. That she at one time employed a man named Parkman. That in a way he was manager of her farms. That at one time Mrs. McIntyre signed checks in blank and allowed Parkman to fill them out in connection with the farming operations. That she saw Mrs. McIntyre about the time she went to the hospital in Bottineau in July, 1941. That some three or four days before Mrs. McIntyre went to the hospital she saw her at her home. That Mrs. McIntyre was not feeling very well. That she also saw Mrs. McIntyre after she came out of the hospital. That Mrs. McIntyre and her sisters visited back and forth. That she was never in Mrs. McIntyre's house when Mrs. McIntyre was writing letters to her sisters but by reason of what Mrs. McIntyre said at different times she knows that she did correspond with them. That she visited with Mrs. McIntyre two or three days before she went to the hospital. She further testified:\n\n'Q. And did she carry on an intelligent conversation with you at the time? In other words, she conversed back and forth with you and discussed things, is that right? A. No.\n\n'Q. What did she say to you, if anything? A. Well, she was telling me she wasn't feeling good, she had to see a doctor, and --\n\n'Q. Was there anything that was not normal as far as her conversation was concerned that she had with you? A. Oh, at times she felt pretty tough. She couldn't visit like she used to.\n\n'Q. But she talked to you, didn't she? A. Yes.\n\n'Q. And there wasn't anything abnormal about her conversation with you, was there? A. Not at that time.\n\n'Q. After she came out of the hospital, you say her condition was good, is that correct? A. Well, after an operation your condition isn't too good at any time, and she wasn't either.\n\n'Q. I mean she was feeling all right as far as you could see? A. Well, she felt as good as expected.'\n\nHjelmer Orvedal called as a witness by the contestants testified: I live at Wolford and have lived there for 29 years. I was acquainted with Mrs. McIntyre ever since I came to Wolford. I farmed lands for her for 26 years and in the spring of 1940 acted as overseer in some of her farming operations. In 1935 I saw a man named Parkman who represented Mrs. McIntyre on matters relating to her lands. Mr. Parkman had some checks that had been signed by Mrs. McIntyre with the name of the payee and the amount left blank. He came to see me relating to settlement for the crop on land which I had farmed. He filled in the amount and my name and gave me the check. I think he had a couple more blank checks at the time. I did not see this happen except on that one occasion. As far as I know Mrs. McIntyre's relations with her sisters were always friendly. I do not think I ever heard her say anything against any of her sisters. I was in her home in Wolford quite a few times and saw Mrs. McIntyre and her sister Mrs. Nerison frequently visiting together downstairs. I never saw any unfriendly relations between them.\n\nRobert Mundy was called and testified as a witness for the contestants. He testified that he has lived in Minneapolis since 1918. That his mother and Mrs. McIntyre were sisters. That he and his aunt Mrs. McIntyre were always on good terms. That there was a strong family loyalty between the Cooper sisters (of which Mrs. McIntyre was one). That they wrote round robin letters to each other and corresponded back and forth. That Mrs. McIntyre visited his mother frequently and once mailed her a ticket to enable her to go to California to visit her sister Catherine.\n\nOne A. O. Knutsen called as a witness for the contestants testified that he resides in California, that he formerly lived at Wolford and became acquainted with Mrs. McIntyre in 1910. That between 1912 and 1944 they corresponded occasionally. That she was in California in 1937 and was anxious that some cleaner which she had compounded should be a success because she wanted to make some money so she could leave it to her sisters because she did not think she would ever be able to make any money from her North Dakota farms. That her attitude toward her sisters, nieces and nephews was always very favorable and that she told him (Knutsen) many times that they had been very good to her and that some day she wanted them to have anything and everything she had. That the last time he saw her and talked to her was in 1937. She never made any statements to him after 1937.\n\nClarence E. Follman was called as a witness by the contestants and testified: I lived in the Wolford vicinity some 45 years. I met Mrs. McIntyre and her late husband. I imagine I knew Mrs. McIntyre for about 35 years. I knew who she was when I met her, that is all. In the spring of 1946 she bought some seed barley from me and when she paid me for it we had a conversation. She offered to sell me a quarter section of land. I was not interested and did not buy the land. She said she had no children but it was her intention to leave her property to her sisters equally. She said she was leaving her property to her sisters. She did not say how many sisters she had or a thing about it and I did not ask any questions. She did not say whether she had or had not made a will or anything of that. That is about all the conversation we had. She wanted to sell the land and I did not want to buy it and I told her so in my response.\n\nW. O. Greer was called as a witness by the contestants. He testified that he lives in north Miami, Florida, and is engaged in the real estate business there. That he first became acquainted with Mrs. McIntyre in the winter season of 1929 or 1930. That she stayed at the hotel which Mr. Greer and his wife were than operating. That she frequently asked his opinion and would act on his advice. That she also accepted the advice of strangers. That about 1930 or 1931 a man staying at the hotel interested her in a roulette wheel and some plan for playing a winning game. That he did not know how much it really cost but she said she lost some money on it. That she asked him what he thought about it and he said he did not think it could be done. That he did not think she should spend any money or time on it. That she bought a guest house in Miami. That she did not ask his advice on that and he did not know she was planning to buy it. That she wanted a small house and he could not find anything for her, and later she bought the guest house. She said she paid $60,000 for it. That the property was listed with his company at $50,000 but he understands that the Keyes people (a real estate broker in Miami) took it at $67,500. That he did not think it was a sound investment at $60,000, compared with other values at the time it was not worth that much. On the market at that time $45,000 would have been a good price for it. That he understands the furniture was part of the sale. That in 1933 she was considering taking a long time lease on two buildings and she wanted him to manage it for her. That he told her it was too big an undertaking and might get her into a lot of trouble. He said to her 'I refuse to go into it with you' and the deal dropped through. That a few months later she had under consideration taking a long time lease on another building and repairing it into a hotel. That his wife and he talked her out of it. In these two matters she consulted with him before going into the deal and upon his advising her adversely she abided by his judgment and abandoned the transactions. That he would say that Mrs. McIntyre was a very nice woman.\n\nMrs. Greer called as a witness by the contestants testified that Mrs. McIntyre checked into their hotel in the fall of 1930 and that she knew her off and on from that time until her death. That when Mrs. McIntyre came she was in deep trouble and that she told them about her contesting her husband's will. That she was with her considerable during the five winters that she was at the hotel. That she learned much about her business affairs and her plans. That Mrs. McIntyre went back to North Dakota in 1936 and came back to Miami in 1945 and in 1946 bought the guest house. That Ada Hong, her sister, who had been running the guest house for Mrs. McIntyre was sick and that Mrs. McIntyre called Mrs. Greer and told her she wanted to sell the guest house to her, and that she answered that she would not be able to pay $60,000 for a guest house, that Mrs. McIntyre said her sister was going away and she could not carry on the guest house without her or someone to help. That she owed her sister about $15,000 and that without that she could not have bought the place and she said 'If you consider it, I'll make you able to own it, because what I want is just a home here the rest of my life,' and she said: 'There will be plenty left for them to fight over when I'm gone, and I want you to take this place.' That she was a very trusting person and would go out and would go with persons she became acquainted with, even strangers on a business venture. 'Q. Then was she of a suspicious nature or not? A. Well, in some cases, yes; some no.' It was easy for people to make friends with her. She usually accepted people at their face value. She would become very infatuated, you might say. At a time when she was in the hotel there was a man trying to sell her a roulette wheel. He was a great schemer and was always selling some books or some scheme or something and he came in one day with this miniature roulette wheel and they would sit around nights and play this roulette wheel and then she got telling me about they had a system that would beat it. It was going to make them rich. They went out to Miami Beach and places where they were trying to put the thing over. In the spring she started for North Dakota and somehow she changed her ticket on the way up and took another route and went to Reno. She told me about it when she got back. It was not a success. I do not know whether she put in any money. There were people that came in with projects like numbering streets, I believe she invested some money in that but I don't know. We stopped her from doing many things she wanted to do because it was poor judgment. She discussed with me and my husband the purchase of real estate just before the purchase of the guest house. She said she wanted to buy a small house. She asked me to go up with her to look at trailers, and two days before she purchased the guest house we went down to the trailer park to look at trailers, and she came into town the next morning with Mr. Greer. She said nothing about the guest house. She was talking about leasing one at that time not buying one. She did not discuss the purchase of the guest house with me before buying it. After the death of Mrs. McIntyre I had a conversation with Mrs. Domberg, it was about the will and she said, 'You will be a witness for John Stormon, won't you?' and I said, 'I don't know anything about it.' And she said, 'Well, you know Mrs. McIntyre was a very competent woman' and I said I don't know about that. Mrs. Domberg is now operating the guest house. I heard that she is employed by the curator to do so.\n\nBruce Davis called as a witness by contestants testified that he is in the real estate business in Miami. That he knew Mrs. McIntyre from the latter part of 1926 and transacted business for her in which she reposed trust in him. That the last time was in 1926 when she sold some lots out in the county section of Coral Gables, she executed the deeds before she left for North Dakota and left the closing of the matters with him. Up until 1941 he had contacts with her. In 1926 while her husband was alive, Davis and his wife and Mrs. McIntyre and her husband had adjoining apartments. She made friends very easily. There were times when she would come to him with things people had told her which were entirely out of line which she accepted as a fact. In 1933 or 1934 she came to the house with a miniature roulette wheel that she had purchased from someone and a system for playing the wheel that you could not lose, that she had used the wheel many times to test the system and the system was O.K. and she wanted him to go out with her to one of the gambling places and she would furnish the money and he was to do the playing. That it took a great deal of talking on his part to convince her there was no such thing as a system to play the roulette wheel and he never did go with her because he did not believe in it. That the man who had proposed to sell her this wheel was a stranger. From his knowledge of her he would say she was a very trusting woman. She was quite a religious woman. He does not know how much she paid the man for the roulette wheel, a couple hundred dollars at least. In his opinion it had no value at all. He thinks she quickly received strangers and relied on them. She had a corporation in Florida. They sold a cleaning compound. His father was working with her at the time, and they attempted several times to get her to put this business on what they thought would be a paying basis, and a businesslike way to handle it, she was very lax about any business operations. She made friends easily. She had at one time a business manager for her farms in North Dakota, who, she told him, took advantage of her on several occasions and cost her considerable money. The doctor who performed the operation on her shortly before her death she had known less than ten days. That the doctor does not enjoy a very good reputation among people he knows. That from what he knew of Mrs. McIntyre he would say that she was quick to accept everyone's intentions as being good. There was a man by the name of Currier who lived across from them in Coral Gables in 1927, that borrowed some money from her, that she had known him only a very short time. He borrowed the money to buy a boat and he never did buy the boat. The amount of the loan was $1,500. Davis testified he has been in the real estate business on and off since 1931. That he was in the hotel business before that and for the last year has been in both hotel and real estate business. Mrs. McIntyre easily accepted other people's statements as being correct. She was not inclined to discredit them. From the experience he had with her and his knowledge of her he thinks she was more or less vulnerable to be taken advantage of by persons inclined to unscrupulous business than the average person. Over the years he has known her he would say she was of a trusting nature. The characteristics he has described were present during all the time he knew her. He knew of the purchase by Mrs. McIntyre of the guest house in Miami. At the time she was living with them, and she told his wife she was looking for a small five-room house. That was in September or first part of October, 1946. He was working at the hotel so he arranged for her to use one of the chauffeurs to answer some ads she got out of the paper. That night when she came home she told him she had bought a guest house for $60,000 and wanted him to go by next day and look at it. This was quite a surprise as he did not know she had any intentions of making a purchase of this kind. When he did go by the next day and inspected the property, he told her he thought she had paid too much money for it, and that she replied that is what she wanted, and if she paid too much, why, she still wanted the property. This property was listed with the Keyes Company for forty thousand dollars some time before that. He testified that he and his wife went to North Dakota and traveled back to Florida with Mrs. McIntyre. That she had $6,000 with her in checks that she had received from wheat that had been sold from her farms. That they stopped overnight at a tourist camp at Dodge City, Kansas. That the next morning Mrs. McIntyre came to the room occupied by Mr. and Mrs. Davis and said someone had stolen her money. That she had a large suitcase and in going through that the checks were found. She had the checks in the suitcase all the time and thought she had them in her pocketbook. She was very careless about things of that kind. He never met Mr. Stormon. She told him several times that he was her attorney. The last time was when she went north to get the money and she said she would have to see her attorney to complete the purchase of the house. That is the only instance he recalls except for the fact that Mr. Cooper (in Miami) and Mr. Nelson (at Rugby) used to be her attorneys. He had heard her talk of them at times. She never discussed her will with him and she never discussed with him her relations with her sisters and whether or not she wanted to remember them in her will. He heard her say around 1932, 1933 and 1934 that she was hard up. He heard that the financial picture improved after the advent of the war and the improvement in price of farm products and farm land. The trend in the Miami real estate market beginning in 1945 and continuing say through 1947 was up, was the most radicial increase in real estate values that they have observed here since 1925 and 1926. The real estate market was very high and that was true with respect to both improved and unimproved property. In the spring of 1946 restrictions were placed on building so that no one except the\n\nGI or someone who had priority could obtain building material. The man from whom she purchased the property was identified with a reputable and reliable real estate corporation having been in business in Miami for 25 or 30 years. The lots which he sold for Mrs. McIntyre west of Miami, the trust she reposed in him in that transaction was predicated upon a friendship of some years. She never promised him anything for any favors he did for her and she never told him she was going to remember him in her will. In fact, she never discussed it. In the last few years her memory seemed to be getting rather bad and in talking she would sometimes repeat herself. He does not recall that that existed back in the 1940's, say in 1940.\n\nMrs. Christina Domberg called as a witness by the petitioner testified that she first became acquainted with Mrs. McIntyre in 1947. That at that time Mrs. Domberg's husband, who is a commercial traveler and had been transferred from Orlando, was staying at the guest house operated by Mrs. McIntyre in Miami. That Mrs. Domberg went to Miami several times to spend weekends with her husband and thus became acquainted with Mrs. McIntyre. That in July, 1947, Mrs. McIntyre told her that she was going to North Dakota and asked Mrs. Domberg to manage the guest house while she was gone. That Mrs. Domberg agreed to do this and it was agreed between them that Mrs. Domberg was to be paid for her services $18 a week and five percent of the gross income during the time she served. That it was Mrs. McIntyre's intention to be gone for only about six weeks, and Mrs. Domberg testified that in a conversation with Mrs. McIntyre regarding the proposed trip 'I told her that she didn't have to be back by the end of the six weeks if she needed more time to take care of her business, a few days more or a week or so wouldn't make any difference to me, but to take care of all her affairs while she was there this time so that if she didn't want to make the trip the next year she wouldn't have to, and it was in that conversation that she mentioned her will. 'Well,' she said, 'if you mean my will,' she says, 'I made that several years ago.' That Mrs. McIntyre did not return from North Dakota until just before Thanksgiving. That upon her return she again took over the management of the guest house and Mrs. Domberg and her husband moved into their own home which had been waiting for them from the first of September. Mrs. Domberg testified that Mrs. McIntyre's sister (Mrs. Hong) was not in Miami at any time during the time that Mrs. McIntyre was in North Dakota and that she had never met Mrs. Hong until after she returned to Miami after Thanksgiving, 1947. Mrs. Domberg testified that during the time Mrs. McIntyre was in Miami she (Mrs. McIntyre) was actively in charge of the guest house and looked after all matters incident to carrying on the business. That Mrs. McIntyre was a very smart woman and handled her affairs well. Mrs. Domberg testified that after the Dombergs had moved into their home Mrs. Domberg kept up her contact with Mrs. McIntyre, that they talked to each other by telephone, that she went over and visited Mrs. McIntyre and that Mrs. McIntyre at times came to their home, that Mrs. McIntyre had left her car in North Dakota and that she frequently went riding with them, and that at times they ate meals together in some restaurant. That Mrs. McIntyre in discussing her affairs with them stated that she was not leaving any of her money to her sisters. Mrs. Domberg testified that in May 1948 Mrs. McIntyre stated that she had plans for going away for the summer and she requested Mrs. Domberg to come back and manage the guest house as she had done the previous summer. Mrs. Domberg testified that the doctor who performed the operation on Mrs. McIntyre for a duodenal ulcer was one of the specialists in Miami in performing an operation of that type. She testified that she accompanied Mrs. McIntyre to the doctor's office the day before she entered the hospital. She testified that Mrs. McIntyre expected to leave the hospital and come home the next day and that a thrombosis developed during the night which caused her death. That she was present in the hospital when Mrs. McIntyre died.\n\nAnn Grinaker was called as a witness by the petitioner. She testified that she came to Devils Lake in 1904 and has lived in Devils Lake or its immediate vicinity continually with the exception of the times that she has been nursing in other parts of the county. That she attended the public schools of Devils Lake and that the petitioner John Stormon also attended such schools at the same time. That she is a registered nurse and graduated as such in 1921. That in 1941 she accompanied Mr. and Mrs. Henry Middaugh who were her neighbors at Lakewood, a suburb of Devils Lake, when they drove to Bottineau to visit Mrs. McIntyre when she was in the hospital there. That Mr. Middaugh was engaged in the practice of law in Duluth, Minnesota. That before going to Duluth he had practiced law for a number of years at Devils Lake. That the Middaughs had a home nearby Miss Grinaker's home at Lakewood. That Mr. Middaugh died in September, 1941, some two months after he and his wife accompanied by Miss Grinaker had visited Mrs. McIntyre in the hospital at Bottineau. That Mrs. McIntyre, Mrs. Buttz, the wife of the district Judge at Devils Lake, and Miss Grinaker drove to Duluth, Minnesota, by car to attend Mr. Middaugh's funeral. After the death of her husband Mrs. Middaugh returned to Devils Lake and took up her residence at Lakewood. That in 1942 Mrs. McIntyre came to Devils Lake and visited Mrs. Middaugh at her home at Lakewood; that she also visited Miss Grinaker. Miss Grinaker testified that in the course of a conversation which she then had with Mrs. McIntyre, Mrs. McIntyre in referring to what provision she intended to make as to the Disposition of her property in the event of her death stated, 'I intend to leave my property to John Stormon.' When asked if she recalled any more of the conversation which led up to Mrs. McIntyre's statement as to what she was going to do with her property on her death Miss Grinaker answered, 'it might have been on account of Mrs. Middaugh's probating her husband's estate.'\n\nAs has been pointed out, the trial court determined that there were only two questions to be submitted to the jury, namely: (1) the question of testamentary capacity, and (2) undue influence. The court instructed the jury that it was incumbent upon them to determine first the question of testamentary capacity and if they found that the testatrix lacked testamentary capacity that this would end their deliberations and it would be unnecessary for them to consider or determine the question of undue influence. Upon the trial there was no attempt to indicate that the evidence that was offered and received was offered as bearing upon the specific question of testamentary capacity or upon the question of undue influence and, of course, some of the evidence had a bearing upon both questions. Hence, in summarizing the evidence we have made no attempt to restrict or summarize only the evidence pertinent or relating to the question of testamentary capacity but all evidence that has been offered and received has been summarized.\n\nIt is the settled law in this state that where a will is contested on the ground that the testator did not have sufficient mental capacity to make a will the contestant has the burden of establishing by competent evidence that at the time the will was made the testator did not have testamentary capacity. Black v. Smith, 58 N.D. 109, 224 N.W. 915; Edwardson v. Gerwien, 41 N.D. 506, 171 N.W. 101. While there are authorities to the contrary the rule adopted in this state has been adopted in many states and is supported by the decisions of many courts. Leach v. Burr, 188 U.S. 510, 23 S.Ct. 393, 47 L.Ed. 567; Brosnan v. Brosnan, 263 U.S. 345, 44 S.Ct. 117, 68 L.Ed. 332; Mayo v. Jones, 78 N.C. 402; In re Burns' Will, 121 N.C. 336, 28 S.E. 519; In re Brown's Will, 200 N.C. 440, 157 S.E. 420; In re Sexton's Estate, 199 Cal. 759, 251 P. 778; In re Smith's Estate, 53 Ariz. 505, 91 P.2d 254; In re Hansen's Estate, 50 Utah 207, 167 P. 256; In re Greene's Estate, 40 Ariz. 274, 11 P.2d 947; In re Heller's Estate, 233 Iowa 1356, 11 N.W.2d 586; In re Hayer's Estate, 230 Iowa 880, 299 N.W. 431; In re Bryan's Estate, 82 Utah 390, 25 P.2d 602; In re McLeish's Will, 209 Wis. 417, 245 N.W. 197; In re Will of Grosse, 208 Wis. 473, 476, 243 N.W. 465. See, also, 2 Page on Wills, Lifetime edition, Sec. 767 and authorities collated in Notes 2 and 3; 68 C.J. pp. 447-448 and authorities collated in Notes 43 and 44.\n\nThe Supreme Court of Wisconsin has held that parties alleging that a testator did not have sufficient mental capacity to make a will have the burden of proof, by clear, convincing, and satisfactory evidence. In re Scherrer's Estate, 242 Wis. 211, 7 N.W.2d 848. And that mental incompetency to make a will 'must be established by clear, convincing and satisfactory evidence.' In re Sawall's Estate, 240 Wis. 265, 3 N.W.2d 373, 375. See, also, In re Olson's Guardianship, 236 Wis. 301, 295 N.W. 24; Will of Grosse, supra; In re McLeish's Will, supra.\n\nThe laws of this state, in force at the time of the execution of the will in controversy, provided:\n\n'Every person over the age of eighteen years of sound mind may be last will dispose of all his estate, real and personal * * *.' C.L.1913,  5640; NDRC 1943, 56-0201.\n\n'Every estate and interest in real or personal property to which heirs, husband, widow or next of kin might succeed may be disposed of by will.' C.L.1913,  5643; NDRC 1943, 56-0204.\n\n'A testamentary Disposition may be made to any person capable by law of taking the property so disposed of, except that no corporation can take under a will, unless expressly authorized by statute so to take.' C.L.1913,  5644; NDRC 1943, 56-0205.\n\n'Every will, other than a nuncupative will, must be in writing; and every will, other than an olographic will and a nuncupative will, must be executed and attested as follows:\n\n'1. It must be subscribed at the end thereof by the testator himself, or some person in his presence and by his direction must subscribe his name thereto.\n\n'2. The subscription must be made in the presence of the attesting witnesses, or be acknowledged by the testator to them to have been made by him or by his authority.\n\n'3. The testator must at the time of subscribing or acknowledging the same declare to the attesting witnesses that the instrument is his will; and,\n\n'4. There must be two attesting witnesses, each of whom must sign his name as a witness at the end of the will at the testator's request and in his presence.' C.L.1913,  5649; NDRC 1943, Sections 56-0301 and 56-0302.\n\nThe will involved in this proceeding was executed in conformity with the section of the code last above quoted. The will was subscribed by the testatrix in the presence of the two persons who signed as subscribing witnesses. At the time of subscribing she declared that the instrument was her last will and testament and requested the two persons who signed as attesting witnesses to sign their names as such witnesses and they did sign their names as attesting witnesses in the presence of the testatrix and in the presence of each other. As was said by the trial court in its instructions to the jury:\n\n'It is undisputed that Ethol G. McIntyre died in July, 1948, a resident of the County of Pierce and State of North Dakota, and that she left property within said County of Pierce. It is further conceded by all parties that the decedent Ethol G. McIntyre on the evening of July 15, 1941, duly executed the will in evidence, dated July 15, 1941, in the presence of two witnesses to whom she declared it to be her last will and testament, and which said witnesses in the presence of the testatrix and in the presence of each other and at the request of the testatrix signed such will as witnesses.'\n\nUpon the trial the will was identified by the two subscribing witnesses as the will that was executed by the testatrix on July 15, 1941, and to which they then affixed their signatures as attesting witnesses. The will was offered and received in evidence and is part of the record on this appeal. The record contains many other instruments signed by the testatrix, most of which were offered in evidence by the contestants including the will which the testatrix made in 1931 and certain letters and checks written and signed by her at different times. The will involved in this action was written upon a legal blank containing a line for the signature of the testatrix. Every member of this Court has carefully examined the testatrix' signature on the will and compared the same with her admitted signatures on the prior will executed by her in 1931 and her signatures on checks, letters and other exhibits that were offered and received in evidence. Those signatures are all admitted to be the signatures of the testatrix. Some of these signatures antedated the execution of the will and some were made on different dates subsequent to the execution of the will and the signature of the testatrix to the will in question here is in every respect the normal, natural and characteristic signature of the testatrix. The signature is affixed on the line that was provided for the signature of the testatrix. It was affixed in a firm, natural hand. There is nothing to indicate any weakness or any difficulty on the part of the testatrix in writing her name. No nervousness or trembling is apparent. The signature was made clearly and firmly. It has been said that a normal signature by the testator or testatrix as the case may be 'tends to disprove mental and physical weakness.' 57 Am.Juris., Wills, p. 109, Sec. 108; In re Keen's Estate, 299 Pa. 430, 149 A. 737; Adams v. Simpson, 358 Mo. 168, 174, 213 S.W.2d 908; In re Arnold's Estate, 16 Cal.2d 573, 107 P.2d 25.\n\nAs has been pointed out the laws of this state in force at the time of the execution of the will in controversy provided that every will other than a nuncupative will must be in writing and that every will other than an olographic will and a nuncupative will must be subscribed at the end thereof by the testator himself, or some person in his presence or by his direction must subscribe his name thereto. That such subscribing must be had in the presence of the attesting witnesses or be acknowledged by the testator to have been made by him or by his authority. That the testator at the time of subscribing or acknowledging the same must declare to the attesting witnesses that the instrument is his will; that there must be two attesting witnesses each of whom must sign his name at the end of the will at the testator's request and in his presence. C.L.1913,  5649; NDRC 1943, 56-0301, 56-0302. The will involved in this controversy was subscribed by the testatrix herself in the presence of the two attesting witnesses and at the time of subscribing the instrument the testatrix declared to the attesting witnesses that the instrument was her will, and requested the two attesting witnesses, namely, her attending physician Dr. Johnson and Mr. Adams an attorney at law, to sign their names as attesting witnesses. They did so sign their names and both of these witnesses appeared and testified in person upon the trial in the district court. They were cross examined by the attorneys for the contestants and their testimony has been summarized above. The witnesses were not impeached or their testimony contradicted. Dr. Johnson, the attending physician, testified that during the time Mrs. McIntyre was in the hospital he had occasion to visit her frequently and talk with her, that he did not observe any mental ailment, that she was a very bright woman and that at the time the will was executed she carried on a conversation with Dr. Johnson and with Mr. Adams and that it was a perfectly normal and intelligent conversation.\n\nUnder the laws of this state an attesting witness to a will knows that he is acting as such attesting witness. He is not in the dark as to the nature of the instrument to which he subscribes his name as an attesting witness. He has heard the testator or testatrix declare that it is his or her will as the case may be.\n\nCourts have assigned different reasons for the purpose of the requirement that a will must be attested by witnesses. 57 Am.Juris., Wills, Sec. 286, p. 221. It seems, obvious, however, that under a statute like ours which specifically requires that the testator declare that the instrument is his will and must be subscribed by the testator in the presence of the attesting witnesses and that they must attest the will in the presence of the testator and in the presence of each other that the purpose and object of attesting is something more than to merely witness the execution of a document and to furnish proof of the signature of the testator and of the identity of the instrument attested.\n\n'The purpose of the legislature in requiring witnesses to attest and subscribe the will is undoubtedly to demand something more than the mere act of writing their names upon the will. The word 'witness,' and the word 'attesting' both imply that the witness must have some knowledge of the facts concerning the execution of the will.' 1 Page on Wills, Lifetime Edition, pp. 622-623, Sec. 344.\n\nIn American Jurisprudence (57 Am.Juris. Sec. 302, p. 232) it is said:\n\n'The cases hold, with rare exceptions, that it is the duty of an attesting or subscribing witness to a will to observe and judge of the mental capacity of the testator, and satisfy himself of the existence thereof. Such duty is corollary, it is said, to his duty to see the will signed or to ascertain otherwise that the signature affixed is the signature of the testator.'\n\nSee, also, Annotations 35 A.L.R. 79; In re Mitchell's Estate, 41 Wash.2d 326, 249 P.2d 385, 395.\n\nCorpus Juris (68 C.J. 673) says:\n\n'It is a rule of very general application that witnesses attest not only the due execution of the will by the testator, but also his mental capacity to make a valid will at the time of the execution thereof. One who signs his name to a will as a witness thereof declares that the testator is mentally capable of making the will, for certainly no credible person of intelligence would attest such an instrument if he knew, or had reasonable cause to believe, that testamentary capacity was wanting. If the witnesses think the testator lacking in capacity to make a will, they should refuse their attestation.'\n\nIn Chase v. Lincoln, 3 Mass. 236-237, the Supreme Judicial Court of Massachusetts said:\n\n'the legislature, in requiring three subscribing witnesses to a will, did not contemplate the mere formality of signing their names. An idiot might do this. These witnesses are placed round the testator to ascertain and judge of his capacity, * * *.'\n\nIn Werstler v. Custer, 46 Pa. 502, the Supreme Court of Pennsylvania said:\n\n'It is the duty of subscribing witnesses to be satisfied of the testator's sanity before they subscribe the instrument. No honest man will subscribe as a witness to a will, or any other instrument executed by an insane man, an imbecile, an idiot, or a person manifestly incompetent for any reason to perform, with legal effect, the act in question. A duty attaches to the witness to satisfy himself of the competency of the party before he lends his name to attest the act.'\n\nIn Stevens v. Leonard, 154 Ind. 67, 56 N.E. 27, 31, 77 Am.St.Rep. 446, the Court said:\n\n'It cannot be thought possible that an honest man, of ordinary intelligence, would subscribe his name as a witness to an instrument executed by a person whom he believed to be of unsound mind or under coercion or constraint. The fact that such a man voluntarily identifies himself with the transaction as a witness is an indication that in his opinion the person executing the instrument is competent to do so. The witness must be understood to attest not merely the act of signing, but also the mental capacity of the testator to sign.'\n\nIn re Schmidt's Will, Sur., 139 N.Y.S. 464, 477, the Court said:\n\n'Attesting witnesses are required for the purpose of seeing, in the first instance, that the testator was in such a condition as enabled him to make his last will, and next that he executed it under free conditions and in conformity with the law regulating testamentary Dispositions. If an attesting witness has any doubt on the score of the testator's competency, he has no business to make himself an attesting witness to a will; and it is declared a fraud so to do when the witness has doubts on testator's capacity.'\n\nReference is made to the testimony of Mr. Knutsen, Mr. Follman, and Mrs. Nerison relating to statements which they say were made to them by Mrs. McIntyre, which it is argued shows that she did not know of the existence of the will involved in this proceeding. Mr. Knutsen testified that he resides in California; that he formerly resided in Wolford and became acquainted with Mrs. McIntyre in 1910. He testifies by a deposition taken in November 1949. He states that in 1937 Mrs. McIntyre was in California. She then told the witness that she had compounded a cleaner which she was very anxious should be a success because she wanted to make some money so she could leave it to her sisters because she didn't think she would ever be able to make any money from her North Dakota farm land. Her attitude toward her sisters, nieces, and nephews was very favorable. She said they had all been very good to her and that some day she wanted them to have everything that she had.\n\nMr. Follman testified that he lived in the Wolford vicinity for some forty-five years and had known Mrs. McIntyre for about thirty-five years. He said: 'I knew who she was when I met her, that's all.' In the spring of 1946 she bought some seed barley from him and he had a conversation with her when she paid for it. She offered to sell him a quarter section of land and she said she had no children, but it was her intention to leave her property to her sisters equally; that she was leaving her property to her sisters. She did not say how many sisters she had or whether or not she had made a will. The will in question was executed July 15, 1941. The conversation with Mr. Knutsen was some four years before the execution of the will; that with Mr. Follman was more than four years after its execution. Both of these conversations are remote in point of time. Testimony as to oral statements allegedly made by deceased persons is generally regarded as the weakest kind of evidence and is subject to the closest scrutiny. 31 C.J.S., Evidence,  266. In Re Carlson's Estate, 286 Ill.App. 81, 2 N.E.2d 963, 965, the court said:\n\n'courts lend a very unwilling ear to statements of what dead men have said.' 57 Am.Juris., Wills Sec. 124.\n\nThe testimony of Mrs. Nerison that Mrs. McIntyre declared it to be her intention to deed a quarter section of land to each of her blood relatives was, of course, not inconsistent with the will or with her knowledge of the existence of the will. She could have carried out that intention and deeded the land if she had so desired without in any way modifying the terms of the will. The will would have been applicable to whatever property she owned at her death. The idea of deeding land as outright gifts during her lifetime was itself rather inconsistent with any idea of having the lands pass either by will or by descent and distribution. She may have for a time entertained the idea of making such deeds and then rejected the idea and allowed the lands to pass as she had provided in the will. According to the testimony of Mrs. Nerison the testatrix had cleared up the debts by the fall of 1947, yet she carried out no intention to deed the lands, if such an intention was ever entertained by her. This testimony has not the slightest bearing upon the testamentary capacity of Mrs. McIntyre at the time the will was executed.\n\n'Exposed to all the infirmities mentioned in the preceding section and to the further objection that it is impossible, in most cases, to convict the witness of perjury if his testimony is willfully false, testimony as to the oral statements of deceased persons is therefore regarded as the weakest kind of evidence and subjected to the closest scrutiny.' 31 C.J.S., Evidence,  266. See, also, Cahill v. Mockett, 143 Neb. 730, 10 N.W.2d 679.\n\n'Evidence of declarations of a decedent though admitted without objection, is of inconsiderable weight, * * *.' In re Lekos' Estate, 109 Cal.App.2d 42, 240 P.2d 387, 389.\n\nWith respect to the issue of incompetency we start with the fundamental principle that sanity and testamentary capacity are presumed. Black v. Smith, 58 N.D. 109, 224 N.W. 915; Hedderich v. Hedderich, 18 N.D. 488, 123 N.W. 276; Edwardson v. Gerwien, 41 N.D. 506, 171 N.W. 101; Schmidt v. Schmidt, 47 Minn. 451, 50 N.W. 598; In re Llewellyn's Estate, 296 Pa. 74, 145 A. 810, 66 A.L.R. 222; 57 Am.Juris., Wills, Sec. 91; 1 Underhill on the Law of Wills, Sec. 86.\n\nAn exact rule or standard for determining testamentary capacity applicable in all cases cannot well be formulated, but general statements that will materially assist in evaluating evidence of testamentary capacity or determining whether evidence has any probative value at all may be stated. In Black v. Smith, (supra) [58 N.D. 109, 224 N.W. 920], this court said:\n\n'The capacity to execute a will has so often been defined as being the ability of the testator to know the extent and character of his property, to be mindful of the natural objects of his bounty, and to appreciate the character of the act in which he is engaged, that this simple test may be applied as elementary and without the citation of authority.'\n\nIn 1 Page on Wills, Lifetime Edition, Sec. 132, we find that:\n\n'The standard of testamentary capacity which has finally been agreed upon, in substance, by the great weight of authority is as follows: Testator must have sufficient strength and clearness of mind and memory, to know, in general, without prompting, the nature and extent of the property of which he is about to dispose, and nature of the act which he is about to perform, and the names and identity of the persons who are to be the objects of his bounty, and his relation towards them. He must have sufficient mind and memory to understand all of these facts; and a charge, in negative form, that capacity is lacking if testator is not able to know all of these facts, is erroneous, since he lacks capacity if he is unable to understand any one of them. He must also be able to appreciate the relations of these factors to one another, and to recollect the decision which he has formed.'\n\nAnd in Section 133 of the same work it is stated that:\n\n'If testator actually remembers and knows what his property is, who are the natural objects of his bounty, and who are the proposed beneficiaries, and his duties towards them, and if he actually understands the nature of the act which he is performing, capacity to make a will is established, at least in the absence of an insane delusion.'\n\nWe have no statutory requirement for capacity to make a will other than that the testator must be a person eighteen years of age or older. Section 56-0201, NDRC 1943.\n\nA competent testator may dispose of his property as he wishes without regard to the desires of prospective beneficiaries or the views of juries or courts so long as the terms of the will are not prohibited by law or opposed to public policy. In re Markham's Estate, 46 Cal.App.2d 307, 115 P.2d 866; In re Benson's Estate, 110 Mont. 25, 98 P.2d 868.\n\nIt is argued that the will in this case makes an unnatural Disposition of the testator's property and is therefore of itself evidence of incompetency. In this case the testatrix bestowed her estate upon the husband of a niece in preference to her sisters. This is not an action so unnatural as to warrant the inference that she was incompetent to make a testamentary Disposition of her property. In this state the reciprocal duty of support arises only from the relationship of husband and wife and parent and child.\n\n'It is well settled that collateral heirs, such as brothers and sisters, are not 'natural objects of bounty' as that term is used in the interpretation of wills, and therefore, in cases such as this, where the next of kin are collaterals and one or more are unprovided for in the will, the pretermitted persons, in order to establish that the instrument is unnatural, must show affirmatively that they had peculiar or superior claims to the decedent's bounty; and, if no such claim is adduced, the instrument cannot be held to be unnatural.' In re Easton's Estate, 140 Cal.App. 367, 35 P.2d 614, 619.\n\n'Nephews, nieces, brothers, sisters, and other collateral heirs, are not, because of such relationship alone, natural or normal objects of bounty.' In re Nolan's Estate, 25 Cal.App.2d 738, 78 P.2d 456, 458.\n\nBut see Page v. Phelps, 108 Conn. 572, 143 A. 890.\n\nIn a leading case, In re McDevitt's Estate, 95 Cal. 17, 30 P. 101, 106, the Supreme Court of California said:\n\n'Of course, juries lean against wills which to them seem unequal or unjust. But the right to dispose of one's property by will is most solemnly assured by law, and is a most valuable incident to ownership, and does not depend upon its judicious use. The beneficiaries of a will are as much entitled to protection as any other property owners, and courts abdicate their functions when they permit the prejudicies of a jury to set aside a will merely upon suspicion, or because it does not conform to theirs ideas of what was just and proper.'\n\nThe trial court submitted to the jury this question:\n\n'Was the testatrix, Ethol G. McIntyre, mentally competent to make her will at the time when she executed the same?'\n\nTo which the jury answered: 'No.' The court instructed the jury:\n\n'Two general questions are presented for your consideration, namely: (1) Was the testatrix, Ethol G. McIntyre, competent to make her will at the time the will in question was executed? and (2) Was the will in question procured by undue influence?'\n\nThe members of the jury were further instructed that they should first consider and determine whether the testatrix was competent to make her will at the time she executed it and if they so found from a fair preponderance of the evidence they should determine the question of undue influence. We assume that the jury followed the court's instructions and, having answered the question concerning the competency of the testatrix in the negative, rendered its verdict accordingly and gave no consideration to the question of undue influence.\n\nThe question confronting us at this point, the proponent having moved for a directed verdict at the close of the case and later having moved for a judgment notwithstanding the verdict, is whether the evidence is sufficient to sustain the verdict as against the attack of those motions.\n\n'* * * the court is not at liberty to review or revise the action of the jury, unless the verdict is without substantial support in the evidence.' Keller v. Reichert, 49 N.D. 74, 189 N.W. 690, 692.\n\nIn a summary of evidence on lack of testamentary capacity respondents specify 'inability (of Mrs. McIntyre) to carry on intelligent conversation for 2 days before trip to hospital.' This specification is predicated upon the testimony of Mrs. Hjelmer Orvedal that she visited with Mrs. McIntyre two or three days before she went to the hospital and in answer to questions propounded she gave answers as follows:\n\n'Q. And did she carry on an intelligent conversation with you at the time? * * * In other words, she conversed back and forth with you and discussed things, is that right? A. No.\n\n'Q. What did she say to you, if anything? A. Well, she was telling me she wasn't feeling good, she had to see a doctor, and --\n\n'Q. Was there anything that was not normal as far as her conversation was concerned that she had with you? A. Oh, at times she felt pretty tough. She couldn't visit like she used to.\n\n'Q. But she talked to you, didn't she? A. Yes.\n\n'Q. And there wasn't anything abnormal about her conversation with you, was there? A. Not at that time.'\n\nClearly Mrs. Orvedal did not testify that Mrs. McIntyre was unable to carry on an intelligent conversation. The question was: 'And did she carry on an intelligent conversation with you at the time?' 'In other words, she conversed back and forth with you and discussed things, is that right?' In such situation the question actually resolved itself into the last portion thereof, namely, 'she conversed back and forth with you and discussed things, is that right?' Mrs. Orvedal answered: 'No.' Thereupon she relates generally what Mrs. McIntyre said and further testified that there wasn't anything abnormal about her conversation with Mrs. Orvedal at that time.\n\nReference is also made to the testimony of Mrs. Hart, and it is said that such testimony shows that Mrs. McIntyre 'did not know of the will' that is involved in this proceeding. As has been shown above Mrs. Hart testified that some time after Mrs. McIntyre came home from the hospital she met Mrs. McIntyre on the street in Wolford and that Mrs. McIntyre asked her to come to the house and have lunch with her. That she accepted the invitation and while there they had a conversation wherein Mrs. McIntyre asked what provision Mrs. Hart had made for her son John in the event of her death. That Mrs. Hart told her what provision she had made and that Mrs. McIntyre agreed that that was right. As to what further conversation was had Mrs. Hart testified:\n\n'Q. And then what did you say to her? A. 'What have you done about yours?'\n\n'Q. And what did she say in response to that? A. She didn't speak for a minute and then she said, 'Well, I fixed up some papers with John Stormon that I think will take care of me until I get a will made.'\n\n'Q. And was that all that was said at that time about that particular subject? A. No, I asked her what kind of a paper.\n\n'Q. Oh, yes. A. And she got up and asked me if I would have some more coffee. She didn't say much about answering it, and then she went in the kitchen.'\n\nMrs. McIntyre had had considerable experience with wills. She knew that a will could be revoked. It was specifically provided in the will she made in 1931 that all former wills were revoked and according to Mrs. Nerison's testimony Mrs. McIntyre made an olographic will in 1935 because of an ocean trip she was about to take. By that will all property of which she died seized would be given to her sister, Mrs. Nerison, and thus changed the distribution provided in the will of 1931. That olographic will according to the testimony of Mrs. Nerison was later returned to Mrs. McIntyre as the emergency which caused it to be made had passed. Mrs. McIntyre knew that she could at any time revoke or change the will which she executed on July 15, 1941. That will was effective only until she changed her mind and changed the provisions of that will as she had an unquestioned right to do. According to Mrs. Hart's testimony, however, Mrs. McIntyre was fully aware of the fact that John Stormon had prepared and she had executed a paper which would take care of matters in event of her death 'until she made a will.' This statement shows that she had knowledge of the instrument that John Stormon had drawn and that she assumed that that instrument would take care of matters concerning the distribution of her property in case of her death, until a will was made. When Mrs. Hart asked Mrs. McIntyre what kind of a paper it was, Mrs. McIntyre did not answer the question but changed the subject of conversation. Mrs. Hart said that Mrs. McIntyre got up and asked if she (Mrs. Hart) would have some more coffee and then went into the kitchen. This testimony does show that Mrs. McIntyre had knowledge and recollection of the execution of a paper that John Stormon had drawn. This testimony does not tend to show any lack of mental capacity on the part of Mrs. McIntyre either at the time the will was made or at the time the conversation took place. It would not be strange if Mrs. McIntyre did not care to discuss her intimate personal matters with Mrs. Hart, and her disposal of the matter by changing the topic of conversation showed mental alertness and tact rather than mental incapacity.\n\nReference is made by respondents to the letter written by Mrs. McIntyre to the Collector of Internal Revenue on May 14, 1942, which letter has been summarized above; and it is said that this letter tends to establish testamentary incapacity on the part of Mrs. McIntyre. The will was made July 15, 1941. The letter in question was written May 14, 1942. Mrs. McIntyre was discharged from the hospital and returned to her home at Wolford in the latter part of July or in the first part of August, 1941. In the first part of September, 1941, she made a trip by auto to Duluth, Minnesota, to attend the funeral of her friend Henry Middaugh. According to the testimony of Mrs. Nerison, Mrs. McIntyre had a fall during the winter which retarded her recovery. The time she was injured by such fall or the extent of her injuries are not further described. This letter to the Collector of Internal Revenue obviously had no bearing and threw no light upon the mental capacity of Mrs. McIntyre on July 15, 1941, when she made the will. The letter does not indicate any lack of mental capacity or lack of memory but quite the reverse. It is a succinct statement of her gross income, the sources from whence it came and of allowable deductions. It does not tend in any manner to establish lack of testamentary capacity on the part of Mrs. McIntyre on July 15, 1941.\n\nWe have set forth and reviewed the evidence at length. All of the evidence, with one exception, produced by contestants on the issue of testamentary capacity is fragmentary and remote. That one exception is the testimony of Mrs. Nerison, who stated she saw medication administered to Mrs. McIntyre on the day the will was executed but didn't know what it was. Counsel then asked: 'Did the medication seem to give any relief to Mrs. McIntyre?' And the reply was: 'She was very drowsy.' This witness further testified that Mrs. McIntyre could not see to read and had no interest. She was very despondent and depressed. She did have glasses with her at the hospital. They were bifocals. On cross examination Mrs. Nerison testified that she presumed that a will had been drawn at the hospital by Mr. Stormon and said: 'Well, I don't know what other business a lawyer would have with a woman that was as low as she was.' She did not ask Mrs. McIntyre about the will when the witness next talked to her. Then follows this question and answer:\n\n'You thought that Mrs. McIntyre was perfectly competent to take care of her own business without any assistance or suggestions from you?'\n\n'No, sir. I did not think she was competent. She was too sick a woman to make a will.'\n\nWhere a will is contested on the ground that the testator did not have testamentary capacity, the inquiry and proof as to such capacity should be directed to the time when the will was executed. The critical inquiry in determining testator's mental capacity to execute a will is directed to his condition of mind at the very time he signed the will and evidence of his previous or subsequent conduct is admissible only so far as it may throw light on his mental condition at the precise moment that the will was signed. 1 Page on Wills, Lifetime Edition, pp. 233-234; 68 C.J. 416, 1112; In re Dupont's Estate, 60 Cal.App.2d 276, 140 P.2d 866; Jackson v. Waller, 126 Conn. 294, 10 A.2d 763; In re Hayer's Estate, 230 Iowa 880, 299 N.W. 431; In re Kaiser's Estate, 150 Neb. 295, 34 N.W.2d 366; In re Getchell's Estate, 295 Mich. 681, 295 N.W. 360; In re Inda's Estate, 146 Neb. 179, 19 N.W.2d 37; In re Hargrove's Will, 206 N.C. 307, 173 S.E. 577; In re Kesich's Estate, 244 Wis. 374, 12 N.W.2d 688. In re Hayer's Estate, (supra) [230 Iowa 880, 299 N.W. 433], it was said:\n\n'The important and controlling fact in the case is the condition of testatrix at the very time the will was executed. It is not sufficient to impeach the validity of the instrument merely to show that testatrix had cerebral hemorrhage in the front part of the brain on the right side; that her mentality was to some extent weakened and impaired; that she had defective memory; that she was unable, upon all occasions, to recognize her acquaintances and friends; that she manifested some change from the quiet dignity and culture formerly observed, to an altered personality and an inclination toward facetiousness and, to some extent, indifference to the character of her speech and conversation. * * *\n\n'Mental weakness due to disease does not deprive one of testamentary capacity until it has progressed to the extent that the power of intelligent action has been destroyed. Mere forgetfulness and enfeeblement of the body are not alone sufficient to disqualify one from making a will. The disqualification which deprives one of testamentary capacity must exist at the very time of the execution of the instrument.'\n\nCorpus Juris, 68 C.J.P. 443, says:\n\n'Physical infirmities, disabilities, and afflictions of themselves do not incapacitate an individual from making a testamentary Disposition of his property, and a sick person may make a valid will, even in his last illness, or when he is in a dying condition, unless the surrounding circumstances are such as show that he was not possessed of testamentary capacity.'\n\nIn Page on Wills (1 Page on Wills, Lifetime Edition, p. 312) it is said:\n\n'Physical suffering does not, of itself, render testator incompetent. One who suffers from cancer, or consumption, or Bright's disease, or kidney infection, or who suffers from pain incessantly, or one who is very old and weak, may, nevertheless, make a valid will.\n\n'One who is in his last illness, or at the point of death, may have capacity to make a will.'\n\nIn its decision In re Jernberg's Estate, 153 Minn. 458, 190 N.W. 990, 991, the Supreme Court of Minnesota said:\n\n'Deceased was very ill. She had submitted to a surgical operation that day, an injection of fluid into her veins. But physical weakness does not signify mental incapacity. (Schmidt v. Schmidt, 47 Minn. 451, 50 N.W. 598), nor does old age. (Little v. Little, 83 Minn. 324, 86 N.W. 408). That the will disregards family ties or is unwise or unjust, or is, for other reasons, such as the court does not approve, does not signify that it is invalid.'\n\nThe statement of Mrs. Nerison that Mrs. McIntyre 'was too sick a woman to make a will' was obviously a conjecture or Conclusion and had no probative force as evidence of lack of testamentary capacity of the testatrix. Scott v. Gibson, 194 Ga. 503, 22 S.E.2d 51. See also, In re Fehrenkamp's Estate, 154 Neb. 488, 496, 48 N.W.2d 421, 427; Speer v. Speer, 146 Iowa 6, 123 N.W. 176, 27 L.R.A.,N.S., 294, 140 Am.St.Rep. 268. Scott v. Gibson, (supra) [194 Ga. 503, 22 S.E.2d 52], was a will contest. A question arose in that case as to the probative effect of testimony of a witness that at the time the will was made the testatrix 'was not in a condition * * * to make a will'. In the opinion in the case the Supreme Court of Georgia in disposing of that question said:\n\n'The testimony of the witness that the testatrix 'was not in a condition * * * to make a will' states a legal Conclusion, and, although admitted without objection, can not be considered in support of the verdict, since it is entirely without probative value. * * * 'such testimony whether objected to or not, or whether it was accompanied by his reasons in support of such opinion, would be totally without probative value, * * *.'\n\nDr. Johnson testified that Mrs. McIntyre was given a small dose of morphine at or shortly after midnight, that is, shortly after 12 o'clock A.M. on July 15th. That this medicine was given because of nausea, a reaction from the dye that had been given to her incident to the taking of X-ray photographs of the gall bladder. That it was a small dose, and when asked whether this would in any manner affect her mental alertness at the time the will was executed he answered: 'There was no effect remaining at the time the will was signed.' Dr. Johnson further testified that Mrs. McIntyre did not consult with him with reference to any mental ailment, and that he did not observe any mental ailment on the part of Mrs. McIntyre in his dealings with her. That at the time the will was executed Mrs. McIntyre carried on a conversation with Dr. Johnson and Mr. Adams and that it was a perfectly normal and intelligent conversation. All of Dr. Johnson's testimony is uncontradicted and the witness was not impeached.\n\nThe will in question was identified by the subscribing witnesses and offered and received in evidence upon the trial of this case and is part of the record on this appeal. Such will has been examined with care by every member of this Court and the signature of the testatrix thereto compared with her signature on many other instruments, some signed by her before and some signed subsequent to the execution of the will and all of which are conceded to be the genuine signatures of the testatrix. The signature attached to the will is the normal and characteristic signature of Mrs. McIntyre as attached to such other instruments and was made in a firm and steady hand.\n\nContestants argue upon authority of Auld v. Cathro, 20 N.D. 461, 128 N.W. 1025, 32 L.R.A.,N.S., 71, Ann.Cas. 1913A, 90, that the evidence of capacity given on the part of Mrs. Nerison is competent, is important, and was proper for the consideration of the jury in determining the capacity of Mrs. McIntyre. They further point out that this testimony was elicited on cross examination and its admissibility was in no manner challenged by counsel for the proponent.\n\nIn Auld v. Cathro, supra, this court held that a non-expert witness who is not a subscribing witness will be allowed to express an opinion on the issue of sanity of the testator only after the witness has testified to acts, conversations, or conduct which bear upon the issue of sanity. After noting that sanity is not necessarily synonymous with capacity to make a testamentary Disposition, we would say that the rule stated in Auld v. Cathro, supra, is the general one. 2 Page on Wills, Lifetime Edition, Sec. 784; 57 Am.Juris., Wills, Sec. 128; Annotation 155 A.L.R. 281.\n\nIn Prescott v. Merrick, 46 N.D. 67, 179 N.W. 693, this court said:\n\n'Upon an issue of mental incompetency to make a will, the contestants asked witnesses who had observed the condition of the deceased whether or not in their opinion he had sufficient mental capacity to make a will, to know the Disposition he was making of his property, and the beneficiaries. It is held that the inquiry in this form does not amount to reversible error.'\n\nIn arriving at that decision the court observed:\n\n'The objection that the questions were so framed as to permit the witnesses to draw the legal Conclusion which must be left to the jury under proper instructions presents a principle which has given rise to some difficulty in its application. The principle for which the appellants contend is clear enough. It is for the jury, and not for the witnesses, to say whether the deceased had the requisite capacity to make a will. Wigmore, Ev.Sec. 1958. But the difficulty of presenting to the jury the condition of mind of a person whose competency is assailed is such that frequently it cannot be done to the best advantage without permitting the witness to state the condition in terms of Conclusions. The witness must necessarily state a Conclusion of capacity or lack of capacity from his own experience and judgment as to what constitutes capacity for doing certain acts. The fact that the law has defined the degree of capacity to perform the same acts should not, in itself, render the Conclusion of the witnesses altogether incompetent where there is presented to the jury, as in the instant case, all of the facts from which the Conclusion is drawn. It remains, nevertheless, the opinion of the witness as to the mental condition. For instance, there is much testimony in the record before us to the effect that the deceased was slow to recognize even his most intimate friends; that at times he seemed to think that he did not have sufficient property to care for himself. The natural inference to be drawn from such testimony would be that he did not comprehend his property and the objects of his beneficence; from which it would follow that he had not the mental capacity to make a will. In the questions objected to, however, the legal definition of capacity to make a will was incorporated, and the inquiry thus limited to the ability of the deceased to comprehend his property and dispose of it to beneficiaries. In these circumstances we are of the opinion that it was not error to overrule the objections to the questions.'\n\nIt is to be particularly noted from the above quotation that the legal definition of capacity was incorporated in the questions and thus the witness was informed of the legal meaning and scope of the term capacity. In the situation now before us the Conclusions of the witness were not responsive to the question. They were entirely voluntary and there is nothing in the record to indicate that the witness was informed as to the legal scope and meaning of the term capacity or competency with reference to the execution of a will.\n\nThe failure of the record to show upon what facts the opinion of this witness was based or the extent of her comprehension of the legal effect of the Conclusion she volunteered is not the only weakness of this evidence. The facts which she did relate with reference to Mrs. McIntyre's physical condition do not justify the Conclusions which were expressed. The testatrix may have been sick and drowsy and still perfectly competent to make a will. In a much stronger case for the contestants somewhat similar evidence was held to be without probative force and insufficient to warrant the submission of the case to the jury. We quote from Speer v. Speer, 146 Iowa 6, 123 N.W. 176, 177, 27 L.R.A.,N.S., 294, 140 Am.St.Rep. 268, as follows:\n\n'Only two of the witnesses saw him on the day when the will was executed. Neither of these witnesses was present at the time of its execution, or attempted execution. They speak of his physical weakness, his failure to recognize them, and his apparent inability to converse as to his condition or his affairs. Without considering the evidence which was excluded by the court, we are unable to find anything in the record substantially tending to show that testator may not have been in such condition when the will was in fact executed that he could understand what he was doing and express his deliberate purpose as to the Disposition of his property. Mere mental weakness, not due to mental disease, but solely to physical infirmity, does not constitute mental unsoundness. Hanrahan v. O'Toole, 139 Iowa 229, 117 N.W. 675. On the other hand, it is well settled that there may be testamentary incapacity without actual insanity or unsoundness of mind. Manatt v. Scott, 106 Iowa 203, 76 N.W. 717, 68 Am.St.Rep. 293; Garretson v. Hubbard, 110 Iowa 7, 81 N.W. 174. But mere weakness of mental power will not render a person incapable of executing a will. It is not necessary that he should be competent to make contracts or transact business. Old age and failure of memory do not of themselves necessarily take away a testator's capacity to dispose of property. Perkins v. Perkins, 116 Iowa 253, 90 N.W. 55. There is nothing in this case to bring it within the case of In re Wiltsey's Will, 135 Iowa 430, 109 N.W. 776, where it appeared that relatives in attendance upon testator at the time the will was executed took advantage of his lack of mental capacity due to sickness to practically dictate to him the Disposition which he should make of his property. In Duggan v. McGreen, 78 Iowa 591, 43 N.W. 547, there was affirmative evidence to show that testator was in confusion as to the persons and objects which he would reasonably have had in mind in an attempt to dispose of his property. Here the Disposition was not complicated, and there is nothing to indicate that the execution of the will was not simply the carrying out of a plan previously and definitely entertained, so that the only mental capacity necessary to be exercised was that of determining whether or not he should make a will in that form. We are satisfied that the evidence as admitted by the court did not present such a case as to justify the submission to the jury of the question whether testator at the time this instrument was executed was incapable of making a valid will. A verdict setting aside the probate of the will would, we think, have been without proper support. Fothergill v. Fothergill, 129 Iowa 93, 105 N.W. 377.'\n\nIt is clear that the facts related by Mrs. Nerison are such that they do not justify the Conclusion or opinion of the witness as a matter of fact as well as a matter of law. The Conclusions volunteered by her were not justified. They have no probative value whatever. Such unsupported Conclusions of a non-expert add no evidentiary support to a jury's verdict. The fact that the Conclusions were expressed in the course of cross examination without objection or a motion to strike adds nothing to the probative force of the statements.\n\nAfter this somewhat lengthy review and Discussion of the facts and the law, we can reach no other Conclusion but that there was no substantial evidence to support the finding of the jury that Ethol G. McIntyre was not mentally competent to make her will at the time she executed it.\n\nThe appellant specified error upon the rejection of certain testimony of the subscribing witness, Dr. Johnson. This error was cured, in part at least, by subsequent testimony and was not pressed on reargument. In view of the necessity for a new trial, we discuss the point as being one likely to arise upon a retrial of the case. This witness was permitted to testify that he acted as a subscribing witness to the will; that Mrs. McIntyre, in his presence and in the presence of the other subscribing witness, Mr. Adams, signed and executed the will; that she said the instrument was her will and requested Dr. Johnson and Mr. Adams to act as subscribing witnesses; and that two days later Mrs. McIntyre was operated on by the doctor; that she first consulted him with regard to her ailment on July 13, two days before the execution of the will. The appellant then sought to show by questions and by offer of proof that in the opinion of the doctor Mrs. McIntyre, at the time the will was executed, was in all respects competent, in full control of her mental faculties, was not laboring under any undue influence, or was in any way unable to comprehend the nature of the act that she was engaged in performing. Objections were sustained and this proffered testimony on the part of the doctor was rejected by the trial court, except as to evidence of undue influence. The rejection of this evidence was error.\n\nThe contestants based their objections on Section 31-0106, NDRC 1943, which, in part, provides:\n\n'A physician or surgeon, without the consent of his patient, cannot be examined as to any information acquired in attending the patient which was necessary to enable him to prescribe or act for the patient; * * *.'\n\nWith respect to the testimony of Mrs. Nerison we have discussed the general rule as to the expressions of opinion on the part of non-expert witnesses to the mental condition of a testator. That rule, however, does not apply to attesting witnesses of the will. Brownlie v. Brownlie, 357 Ill. 117, 191 N.E. 268, 93 A.L.R. 1041, and annotation 1049; In re Olson's Estate, 176 Minn. 360, 223 N.W. 677.\n\nIn 2 Page on Wills, Lifetime Edition, Sec. 778, p. 522, it is said:\n\n'It is settled by the almost unanimous weight of authority that the subscribing witnesses to a will may give their opinion as to the sanity or insanity of the testator without any reference to their means of determining his mental capacity, or their ability to Judge of his capacity with the means at their disposal.'\n\nSee, also, 1 Schouler on Wills, etc., 6th Ed., Sec. 232, p. 280; 1 Wigmore on Evidence, 2d Ed., Sec. 689; 22 C.J. 609, 32 C.J.S., Evidence,  507; 3 Chamberlayne, The Modern Law of Evidence, pp. 2596-2599, Sections 1925, 1927.\n\nHad Dr. Johnson not been the attending physician of Mrs. McIntyre, he could have expressed his opinion with respect to her mental competency at the time she subscribed to the will in his presence. The neat question therefore is: Does the fact that he was at that time her attending physician render him incompetent to testify as to her mental condition because of the provisions of Section 31-0106, NDRC 1943? The trial court felt that it did and sustained the contestants' objection on that ground.\n\nThis precise question was passed upon by the Supreme Court of California under a statute similar in context and identical in meaning with ours. It was held that a testator in making his attending physician a subscribing witness to his will waived the privilege provided by the statute and invited a full and proper examination of the witness with respect to matters and facts upon which his lips would otherwise have been sealed. The same result was reached under similar statutes in Points v. Nier, 91 Wash. 20, 157 P. 44, and Weis v. Weis, 76 Ohio App. 483, 65 N.E.2d 300. In Wigmore on Evidence, 3d Ed., Sec. 2390, it is said:\n\n'To request a physician to attest one's will is by implication to request him to bear testimony if called on, to all facts affecting the validity of the will, and is therefore a waiver.'\n\nWe have reached the Conclusion that where an attending physician is requested by the testator to witness his will and in accordance with that request does subscribe to the will as a witness, the testator thereby waives the restrictions on the competency of the physician as a witness prescribed by Section 31-0106 NDRC 1943 and such physician in an action involving the validity of the will may be called as a witness and examined and cross-examined the same as any other subscribing witness. See, also, In re Bottger's Estate, 14 Wash.2d 676, 129 P.2d 518; Underhill on the Law of Wills, Sec. 208.\n\nUp to this point we have determined that the evidence on the issue of incapacity is insufficient to sustain the verdict of the jury and that the trial court erroneously restricted the testimony of the witness, Dr. Johnson, with respect to the mental capacity of the testatrix at the time the will was executed. The next issue is that of undue influence, the exact point being whether the evidence is sufficient to take that issue to the jury, in which event there must be a new trial, or whether the appellant's motion for judgment notwithstanding the verdict should be granted. Under the instructions of the trial court the jury never reached the question of undue influence. As the record now stands, if the evidence is sufficient to have supported a verdict for the contestants on the ground that the will was executed under undue influence, a new trial must be had. If the evidence on that issue is insufficient, the appellant is entitled to a judgment notwithstanding the verdict.\n\nThe contestants assert that the relationship of attorney and client existed between Mr. Stormon and Mrs. McIntyre at the time the will was drawn and that he being the sole beneficiary under the will which he prepared, a presumption arises that the execution of the will was the result of undue influence exercised by the proponent. On the other hand, the proponent argues that the relationship of attorney and client did not then exist and that in any event the terms of the will were determined by Mrs. McIntyre entirely upon her own volition, uninfluenced by the proponent.\n\nIn determining the sufficiency of the evidence under plaintiff's motion for judgment notwithstanding the verdict, the evidence must be considered in the light most favorable to the contestants. In re Fehrenkamp's Estate, 154 Neb. 488, 48 N.W.2d 421. Although the jury has not actually passed upon the issue of undue influence we must now approach it under the challenge of proponent's motion as though the jury had determined that issue adversely to the validity of the will.\n\nWe have already set forth the evidence, including the testimony of Mr. Stormon. Without dwelling upon it further, it is clear to us that the evidence is insufficient to support a determination by a jury that at the time the will was executed the relationship of attorney and client did exist between the proponent and the testatrix.\n\nA court will look with suspicion upon a substantial bequest to an attorney who drafted the will and should subject the transaction to close scrutiny. In 2 Page on Wills, Lifetime Edition, Sec. 829, it is stated:\n\n'If an attorney draws a will under which he takes a substantial benefit, a presumption of undue influence arises.'\n\nIn 5 Am.Juris., Attorneys at Law, Sec. 51, we find that:\n\n'if a lawyer, in drawing a will, drafts himself a bequest, he must explain the circumstances and show that the gift was freely and willingly made; he must, in other words, show that he did not embrace the opportunity of exerting undue influence over the testator.'\n\nIn Wigmore on Evidence, 3d Edition, Sec. 2503, it is said:\n\n'Where the grantee or other beneficiary of a deed or will is a person who has maintained intimate relations with the grantor or testator, or has drafted or advised the terms of the instrument, a presumption of undue influence or of fraud on the part of the beneficiary has often been applied. But it is not possible to say that any single circumstance or group of facts is the invariable mark of such a presumption, or that there is any uniform rule capable of application apart from the facts of each case.'\n\nIn a leading California case, In re Witt's Estate, 198 Cal. 407, 245 P. 197, 202, an heir challenged a will drawn by an attorney who was the sole beneficiary on the grounds of fraud and undue influence. The court said:\n\n'The burden of proof to establish all of the elements of fraud or undue influence was not, in the instant case, upon the contestant, as is the usual situation upon the contest of a will. The burden was upon the defendant, by reason of his relationship of attorney to Mrs. Witt, to overcome the presumption of fraud and unfair dealing which is automatically raised by the law as a protection to a client against the strong influence to which the confidential relation naturally gives rise. All dealings between an attorney and his client for the benefit of the former are not only closely scrutinized, but are presumptively invalid, on the ground of constructive fraud, and such presumption can be overcome only by the clearest and most satisfactory evidence. * * *\n\n'The fact that an advantage was obtained by the attorney is evidenced by the terms of the will itself wherein he was bequeathed all of the property of the testatrix. Defendant insists that there is no proof of any advantage obtained by him by reason of the fact that the will was the result of a fair and equitable contract between himself and the decedent whereby she agreed to will him all of her property in return for an agreement by him to see that she should not during her lifetime be in want. Conceding this, merely for the purpose of argument, it will suffice to say that the evidence adduced by the contestant shows that, having in mind the condition of Mrs. Witt's health, Mr. Lantz stood to gain more by the contract than Mrs. Witt. The prima facie showing of contestant in this particular was, therefore, sufficient to show an advantage obtained by the attorney by virtue of his confidential relationship.\n\n'Moreover, the will was drafted and drawn in the office of Mr. Lantz, and was signed by two of his employees as witnesses. Mr. Lantz testified that it was prepared in his office principally by himself. Also one of the subscribing witnesses testified that Mr. Lantz was in the room and talked to Mrs. Witt about the will before she signed it. A presumption of undue influence arises from proof of the existence of a confidential relation between the testatrix and the beneficiary, 'coupled with activity on the part of the latter in the preparation of the will.'\n\nAfter a further review of the evidence the court reached the Conclusion that the jury was warranted in determining that the defendant had not sustained the burden of proof that rested upon him and had not overcome the presumption.\n\nIn the subsequent case of In re Butts' Estate, 201 Cal. 185, 256 P. 200, 201, the court says:\n\n'The record presents a case wherein an attorney is the sole beneficiary under a will of his client, drawn by himself. It presents a case where there is a conflict between the presumption that the law raises, growing out of such relationship, and the testimony of witnesses offered by the proponent. The question as to whether or not the disputable presumption was overcome by the evidence introduced by the proponent was one to be determined by the jury.'\n\nIn St. Leger's Appeal, 34 Conn. 434, 91 Am.Dec. 735, it is held that when the relation of attorney and client subsists between the testator and legatee and the will is drawn by the latter, undue influence will be presumed but this presumption is one of fact which may be rebutted by proper evidence that satisfies the jury.\n\nIn Wunderlich v. Buerger, 287 Ill. 440, 122 N.E. 827, 829, the testator's attorney who prepared the will was made residuary legatee to his substantial benefit. The court said:\n\n'The existence of a fiduciary relation between a testator and a legatee does not raise a presumption of undue influence in the case of a will as in the case of a deed. * * * The presumption in this case arises only out of the fact that the defendant in error prepared the will by which he benefited. The strength of the presumption and the amount of proof required to overcome it must depend upon the circumstances of each case.'\n\nThe appellate court held that the circuit court was justified under the evidence in holding that the legal presumption of undue influence had been overcome and in admitting the will to probate.\n\nIn New Jersey we find two cases involving the general facts under Discussion. In the case of In re Cooper's Will, 75 N.J.Eq. 177, 71 A. 676, a will and codicil were prepared by an attorney who was appointed executor, received a specific legacy and benefited substantially as residuary legatee. His son also received a legacy. The attorney procured the witnesses and supervised the execution of the will. It was held that the attorney must overcome the presumption of undue influence raised by these facts before he could benefit by the will.\n\nIn re Bishop's Will, 96 N.J.Eq. 595, 125 A. 384, 385, it was held:\n\n'An attorney who draws or actively participates in the making of his client's will, by which he substantially benefits, has the burden cast upon him of establishing that it was not the result of undue influence.'\n\nIn the case of In re Putnam's Will, 135 Misc. 311, 238 N.Y.S. 112, it was held that, where the testatrix's attorney was the draftsman of her will and a substantial beneficiary thereunder, the question of whether the will was procured by undue influence was for the jury.\n\nIn Tarr v. Vivian, 272 Mass. 150, 172 N.E. 257, 258, the contestant was a sister and sole heir at law of the deceased testator. She filed a motion for the framing of two issues for trial by jury. The motion was denied. The first issue was that of unsoundness of mind. It was held that ground for submitting this issue was not sustained by the statement of expected proof submitted on the motion. The second issue was that of undue influence on the part of the chief beneficiary who drafted the will and was present at its execution. In reversing the decree and ordering a trial by jury on the issue of undue influence the court said:\n\n'When a person of advanced years, having near kindred but no children, through an attorney at law with whom he is personally intimate and has important and confidential business relations but who is not a kinsman, executes an instrument as a will without independent and disinterested advice, where by a small fraction of his estate is given to his next of kin and to charity and the residue of it to the attorney at law and his family, the law views the transaction with considerable jealousy. Slight additional circumstances indicating susceptibility to influence on the part of the alleged testator, or dominating power on the part of the attorney, would support a finding of undue influence. The relation of attorney and client is in any event highly confidential and fiduciary, and business dealings between them are discouraged by the policy of the law.'\n\nThe Massachusetts court is silent with reference to the existence of a presumption of undue influence.\n\nIn re Daly's Estate, 59 S.D. 403, 240 N.W. 342, involved a will drawn by an attorney which bequeathed about five-sixths of the estate to the attorney's son in trust, with the attorney as trustee. The court made no reference to a presumption but held that although the evidence was somewhat conflicting it was sufficient to sustain the inference of fact made by the trial court that undue influence on the part of the attorney was operative when the will was executed.\n\nIn re Keeley's Estate, 167 Minn. 120, 208 N.W. 535, 536, discloses these basic facts: The testator died in 1924 at the age of seventy-six, leaving an estate of $58,000. On December 22, 1921, he had made the will involved in the litigation which was in the handwriting of his brother who was a lawyer. The brother was named executor. The court says:\n\n'The mere fact that a confidential or fiduciary relation existed, with opportunity to exercise influence, does not establish undue influence. Here we have such a situation, as well as activity on the part of the beneficiary in drawing the will, and its execution was under such circumstances that no living person but the beneficiary knew whether the testator knew the contents of the will.'\n\nThe trial court made a finding of undue influence. In affirming the decision the appellate court said:\n\n'Such facts as here involved, in law, permit, but do not command, a finding of undue influence. They make a prima facie case which the trier of fact may accept or reject. Such facts call for explanation but still remain questions of fact, whether the preponderance of the proof is with the proponent of the will, even if no explanation is made. Failure to explain satisfactorily may be an additional fact of more or less weight. Defendant's evidence may be sufficient to destroy the prima facie case so made. Such prima facie case in this action is strengthened by other evidence. It is opposed by the denials of the appellant. Being an interested party, his testimony is not binding upon the court in determining the facts.'\n\nIn Iowa there is a line of cases dealing with the validity of wills drawn for their clients by attorneys who are also substantial beneficiaries. These cases do not say that a presumption arises from the relationship and conduct of the parties but they hold that the facts and circumstances are such as to require the submission of the question of undue influence to the jury. The latest case is In re Ankeny's Estate, 238 Iowa 754, 28 N.W.2d 414, 418, in which the previous cases are cited. It is of particular interest to us because the facts are similar to those before us on this issue. There was no evidence that the testator was of unsound mind. He was eighty-five years of age at the time the will was made and lived two years more. He was a widower living in a house on a farm that he had owned for a number of years. The estate was appraised at $31,000. Bequests were made amounting to about $19,000. The residue was left to the attorney who drew the will. The contestant was the testator's sister who lived on a farm about three miles from him. There were other relatives. There was no evidence that he was on unfriendly terms with his relatives. After the will was executed, it was taken in charge by the attorney and placed in his lock box. There was no evidence that the testator ever saw the will after its execution. The trial court found that item eleven, being the residuary clause, was executed by the testator under undue influence but the rest of the will was not. The judgment appealed from denied probate to item eleven and admitted the rest of the will to probate. Upon appeal, the court was chiefly concerned with the question of whether or not there was proof sufficient to support the submission of the case to a jury. It reached the Conclusion that there was and affirmed the judgment.\n\nIn reaching its decision the court comments on and quotes from Graham v. Courtright, 180 Iowa 394, 161 N.W. 774, as follows:\n\n'In the Graham case we held that an attorney in the drawing of a will acts in a confidential relation to the testator, he being specially called because of testator's long friendship with him. It is there held that as long as the inferences to be drawn from a given state of facts are in equipoise, the question of undue influence is for the jury. The case does not hold that a presumption necessarily arises, but 'the existence of a confidential relation, such as that of guardian and ward, attorney and client, religious adviser and layman, and the like, affords peculiar opportunities for unduly exercising influence over the mind, and where the dominant party, in such relation, initiates the preparation of the will or gives directions as to its contents to the scrivener or writes it himself, in other words, is active either in its preparation or execution, and is made a beneficiary thereunder, a suspicion arises that the benefaction may have resulted from the exertion of undue influence over the testator, rather than from his free volition. The strength of this suspicion necessarily depends on the circumstances of each particular case.'\n\nThe court further remarks:\n\n'Ordinarily, an attorney in a situation such as this, knowing that he was the beneficiary of a large part of decedent's property, would have taken steps at least to secure the taking of advice and the consultation with another attorney. The court had a right, under these circumstances, to feel that there was at least some indication that desire for gain had overcome not only the attorney's ethical ideas, but his sense of prudence.'\n\nAnd again the court says:\n\n'Proponent argues that the fact that testator had never sought to change the will during the interval of two years is strong evidence that the will expressed the testator's own desire rather than the influence of another, and cites a large number of authorities. We think this circumstance indicates very little, but it was one which might be considered by the court which would also take into consideration that the will was in actual possession of the lawyer and beneficiary under the will.'\n\nFew challenges to the validity of wills on the ground of undue influence have reached this court. We have never considered whether a presumption of undue influence arises from the fact that an attorney draws a will under which he takes a substantial benefit. We have no statutory presumption applicable to this situation. Our careful study of the cases and texts dealing with this question leads us to the Conclusion that we should not by judicial precedent establish a rule that a presumption of undue influence invariably arises from the fact that a will is drawn for a client by an attorney who becomes a major beneficiary under the will. The conditions under which such wills might be drawn could conceivably differ so greatly that such a presumption in one case would serve the ends of Justice but in another would be an impelling force in the creation of inJustice.\n\nIn Coffin v. Coffin, 23 N.Y. 9, 80 Am. Dec. 235, it is said:\n\n'As I have observed, there is no rule of law which prevents a person who prepares a will from taking a legacy under it. In the language of Baron Parke, in Butlin v. Barry, 1 Curt. Ecc. 637, 'all that can be truly said is, that if a person, whether an attorney or not, prepare a will with a legacy to himself, it is at most a suspicious circumstance of more or less weight, according to the facts of each particular case; in some, of no weight at all, as in the case suggested, varying according to circumstances; for instance, the quantum of the legacy, the proportion it bears to the property disposed of, and numerous other contingencies.'\n\nWhether undue influence exists in connection with the execution of a will and the credibility of witnesses whose testimony bears upon the validity of the execution are primarily questions for the trier of facts, in this case the jury. Keller v. Reichert, 49 N.D. 74, 189 N.W. 690; Hultberg v. Hultberg, 49 N.D. 761, 193 N.W. 605.\n\nIt is argued that the testimony of John Stormon as to the circumstances surrounding and the details of the preparation of the will by him at the hospital is undisputed and negatives any presumption or inference that the will was the result of undue influence, despite the fact that he is the party plaintiff and the party interested in sustaining the validity of the will under which he is sole beneficiary. In 20 Am.Jur., Evidence, Section 1180, it is said:\n\n'Many cases may be cited as illustrating the principle that the testimony of an interested witness, though uncontradicted, is for the triers of facts, whether court or jury, who are not bound thereby. In other cases, however, it is held that the triers of facts, whether court or jury, are not justified in disregarding the uncontradicted testimony of an interested witness.'\n\nSee annotation 'Uncontradicted testimony of interested witnesses,' 8 A.L.R. 814.\n\nA great divergence of facts in various cases has given rise to the application of different rules. Under the facts in this case, however, we have no doubt that it is proper to apply the general rule that the credibility of the plaintiff's testimony is for the jury to determine, although there is, and under the circumstances could be, no direct contradiction. In Mar Shee v. Maryland Assurance Corp., 190 Cal. 1, 210 P. 269, cited by plaintiff, it is held that a disputable presumption has no weight as against a fact proved by the uncontradicted testimony of a party or of his witnesses under circumstances which afford no indication that the testimony is the product of mistake or inadvertence and when the fact so proved is wholly irreconcilable with the presumption. On the other hand, in Taylor v. J. B. Hill Co., 31 Cal.2d 373, 189 P.2d 258, it was held that the trial court was not bound by the testimony of interested witnesses as against the inferences which were deductible from other facts in the case contrary thereto. In Keating v. Morrissey, 6 Cal.App. 163, 91 P. 677, 679, it is succinctly stated that:\n\n'A court or jury is not bound to believe an interested witness as against a presumption, if the latter satisfies its mind.'\n\nAnd in McDonald v. Hewlett, 102 Cal.App.2d 680, 228 P.2d 83, 88, 24 A.L.R.2d 1281, it is stated:\n\n'Obviously, where the trial court reasonably does not believe the rebutting testimony the presumption is unimpaired.'\n\nTo the same effect are Pierce v. Wright, 117 Cal.App.2d 718, 256 P.2d 1049, and Freer v. Wells Fargo Bank and Union Trust Co., 75 Cal.App.2d 150, 170 P.2d 491. In Washington we find two cases where it was held that a jury might disregard the evidence of an interested witness and give effect to a contrary presumption. They are State Finance Company v. Hamacher, 171 Wash. 15, 17 P.2d 610, and Barach v. Island Empire Telephone and Telegraph Co., 151 Wash. 279, 275 P. 713.\n\nIn support of the general proposition that the trier of facts is the Judge of the credibility of the witness and is not required to accept the uncontradicted evidence of an uncorroborated interested party we cite Ratley v. Industrial Commission, 74 Ariz. 347, 248 P.2d 997; Texas Employers' Insurance Ass'n v. Lee, Tex.Civ.App., 254 S.W.2d 902; Berard v. Dolan, 118 Vt. 116, 100 A.2d 581; Gammill v. Nunes, 104 Cal.App.2d 185, 231 P.2d 86; In re Witt's Estate, 198 Cal. 407, 245 P. 197. In Piwowarski v. Cornwell, 273 N.Y. 226, 7 N.E.2d 111, 112, it is said of interested witnesses:\n\n'Their credibility, even though their testimony be uncontradicted, when contradiction is impossible and its truthfulness or accuracy is open to a reasonable doubt, was exclusively for the jury.'\n\nIn South Dakota it appears that the courts are not bound to accept the statements of witnesses who have an interest in the question at issue. Jorgensen v. Jorgensen, 74 S.D. 239, 51 N.W.2d 632; Crilly v. Morris, 70 S.D. 584, 19 N.W.2d 836. In re Tjarks' Estate, 55 S.D. 636, 227 N.W. 84, 85, contains this statement:\n\n'Where the only person who could directly dispute a witness is dead, the testimony of that witness should be clearly scrutinized, its reasonable probability should be carefully considered, and, for this purpose, attention should be given to the circumstances surrounding any transaction which the witness may narrate, and his testimony compared with all inferences derivable from all the established facts. Re Bailey, 111 App.Div. 909, 98 N.Y.S. 725. To accept the testimony of appellants' witnesses as conclusive, we would be obliged to find that the testimony was not improbable, and that none of the proven circumstances of fact tend to discredit or raise substantial doubts as to the verity of the same. In short, we may consider that the testimony offered by appellants is not directly contradicted or denied by any witness of respondent, and yet we would have to consider whether there are any permissible deductions, by way of inference, which may be drawn from any of the evidence to raise a substantial doubt as to the truth of appellants' showing.' Quoted with approval in Hills v. Hill, 58 S.D. 556, 237 N.W. 769.\n\nThe credibility of the uncontradicted and uncorroborated testimony of the plaintiff is for the trier of facts to determine in the light of other facts and circumstances which tend to support the inference that the execution of the will was obtained through the exercise of undue influence. Janssen v. Kohler, 71 N.D. 247, 299 N.W. 900.\n\nThe burden of proof was on the proponent to establish the execution of the will in the manner prescribed by our statute. Section 56-0302, NDRC 1943. This burden was met by the testimony of the subscribing witnesses. The contestants challenge the validity of the will upon the ground of undue influence. Theirs was the burden to sustain this challenge, which they attempted to do by showing that the will under which the proponent was the sole beneficiary, to the exclusion of sisters of the testatrix, was drawn by the proponent, an attorney who had at various times over a period of years advised the testatrix on legal matters and who was the husband of the testatrix's niece; that the terms of the will were not disclosed until after the death of the testatrix, when it was produced by the proponent, in whose posession it had remained from the time of its execution. These facts and circumstances cast upon the proponent the burden of going forward with the evidence to overcome the inference of undue influence to which they gave rise.\n\nOn behalf of the proponent, evidence was produced tending to show testatrix, although sixty-four years of age and suffering from an illness that required an operation from which she later recovered, was mentally competent to make a testamentary Disposition of her property and lived seven years after making the will without changing it, during which she managed her own business affairs with considerable success. The proponent testified that the testatrix dictated the terms of the will to him. She read it and it was left with her for some twenty minutes while he summoned the subscribing witness, Adams. On the other hand, the will was not discussed in the presence of the subscribing witnesses. Its execution, while in conformity with the statute, was rather perfunctory. Under the record thus presented the jury should be permitted to consider all of the facts and circumstances bearing upon the issue of undue influence without being weighted by a presumption, the nature and effect of which is always difficult for the court to explain to the jury. The question of undue influence is clearly for the triers of fact to determine. This court cannot say as a matter of law that a determination by a jury that the executrix executed the will under undue influence could not be sustained. The trial court did not err in determining that appellant's motion for judgment notwithstanding the verdict should be denied.\n\nAnother specification of error requires our further comment. The witness, Hon. J. J. Kehoe, a district Judge, testified that in 1937 or 1938 when he was a practicing lawyer testatrix came to his office and spent about an hour in conversation with him. That she never consulted him as her attorney at any time; that about six years prior to the conversation in question he had represented a claimant against the estate of her deceased husband. She never paid the witness any attorney fees. She asked the witness for some information. He did not consider it legal advice. It was not necessarily information which would be sought only in a lawyer's office. Anybody might know what he told her. It was a matter concerning which an attorney was especially qualified to answer. It was a matter covered by statute and the witness was acquainted with it. It was a preliminary question that might lead up to something further. The question did not relate to the interpretation of statutes. It was not a matter of Disposition of property. They discussed a variety of nonbusiness matters. An objection to the testimony of the witness regarding his conversation with the testatrix on that occasion was sustained. The ground of the objection was paragraph 1 of Section 31-0106, N.D.R.C 1943, which provides:\n\n'An attorney, without the consent of his client, cannot be examined as to any communication made by the client to him, nor as to his advice given thereon in the course of professional employment; * * *.'\n\nThe basis of any valid objection under this provision must be the relationship of attorney and client. The burden of showing that such relationship existed is on the objector. Booren v. McWilliams, 26 N.D. 558, 145 N.W. 410, Ann.Cas. 1916A, 388; Stoddard v. Kendall, 140 Iowa 688, 119 N.W. 138.\n\n'The privileged character of the communication must appear; the mere fact that the person offered as a witness is an attorney at law does not render it improper fro him to relate statements or communications made to him by another; nor is the fact that the person whose statements are sought to be proven was the client of a particular lawyer at the time the communication was made, sufficient in itself to exclude the testimony of the latter concerning it.' Thornton on Attorneys at Law, Sec. 96.\n\nThe relationship of attorney and client rests upon contract. The contract may be either express or it may be implied from the conduct of the parties. Moe v. Zitek, 75 N.D. 222, 27 N.W.2d 10; Thornton on Attorneys at Law, Sec. 134. After contestants' objection was sustained, the proponent made this offer of proof:\n\n'The petitioner offers to prove by the witness J. J. Kehoe, that upon the occasion to which he has already referred in his testimony, that Mrs. McIntyre told him that she intended to leave her property to the Stormon family.'\n\nThis evidence was erroneously excluded. It does not appear that at the time of the communication in question the relationship of attorney and client existed between the witness and the testatrix or that the communication was made in the course of professional employment.\n\nThe verdict cannot stand because it is based on a finding of incompetency that is not sustained by the evidence and is affected by errors in the exclusion of evidence heretofore discussed. On the other hand, for reasons that we have stated with reference to the issue of undue influence, the proponent is not entitled to judgment notwithstanding the verdict. Our decision, therefore, is that the judgment appealed from is reversed and a new trial granted on all the issues.\n\nMorris, This is an appeal from a judgment of the District Court of Pierce County vacating and annulling a decree of the County Court of Pierce County admitting a will to probate. The will involved was executed by Ethol G. McIntyre on July 15, 1941. JOHNSON, Judge (concurring). The facts in this case have been set forth and discussed in detail and the law applicable to the issues has been fully and completely stated. I agree with the main opinion and the syllabus thereof.\n\nThere are circumstances present in the evidence in this case which give rise to an inference or presumption of undue influence. It is for the jury to appraise and determine whether on the basis of these circumstances and all the evidence presented undue influence entered into the execution of the will of Ethol G. McIntyre.\n\nThe trial court submitted this case to the jury on the theory that there were two general questions presented for its consideration. The court said:\n\n'Two general questions are presented for your consideration, namely: (1) Was the testatrix, Ethol G. McIntyre, competent to make her will at the time the will in question was executed? and (2) Was the will in question procured by undue influence?'\n\n'You should first consider and determine the question of whether testatrix Ethol G. McIntyre was competent to make her will at the time she executed the same.'\n\n'If you believe from a fair preponderance of the evidence that the testatrix Ethol G. McIntyre, at the time of making her will, which has been received in evidence, did not have testamentary capacity, then you need go no further in your deliberations to answer the second question as to whether the will was procured by undue influence, but you should find that the will in question is not the will of Ethol G. McIntyre, and if you do so find, from a fair preponderance of the evidence, that she was then and there competent to make a will, you will also, in addition to signing a general verdict to that effect, sign the special questions submitted to you on the question of her competency.' (Italics supplied.)\n\nUnder the instructions as above set forth it is entirely possible that the jury in its deliberations rendered its verdict without ever considering whether the will in question was executed under undue influence. The court told the jury that it could do so. It also told the jury that if Mrs. McIntyre was incompetent to make a will that 'in addition to signing a general verdict to that effect' the jury should sign the special question submitted as to her competency.\n\nIn rendering its verdict the jury answered the special question, 'Was the testatrix Ethol G. McIntyre mentally competent to make a will at the time when she executed the same? A. No.' Then followed a general verdict: 'We, the jury, duly empanelled and sworn to try the above entitled action, do find that the will in question and offered in evidence is not the will of Ethol G. McIntyre, deceased.'\n\nThe special finding in this case is authorized by our statute Section 28-1502 of the 1953 Supp. to the North Dakota Revised Code of 1943. This statute says:\n\n'and the jury shall make their answers thereto [referring to questions submitted] in writing. The court may also direct the jury, if they render a general verdict, to find in writing any particular question of fact, to be stated as aforesaid. * * * When the special findings of fact are inconsistent with the general verdict, the former controls the latter and the court must give judgment accordingly.'\n\nThe general verdict in the case at bar was in no way inconsistent with the answer to the special question or special finding of fact. The special question or finding of fact stated that the testatrix Ethol G. McIntyre was not mentally competent to make a will at the time she executed the same, and for all that can be ascertained, the general verdict rendered by the jury to the effect that the will in question was not the will of Ethol G. McIntyre could involve the same considerations by the jury as the answer to the special question. It, therefore, appears that it is entirely possible that the jury never did reach the second issue presented in this case. It is impossible for this court to determine from the general verdict rendered by the jury whether it did, or did not, consider the second issue presented of undue influence. We must assume that the jury did not, in view of the instructions presented, consider the question of undue influence.\n\nThis court has held many times that a judgment notwithstanding the verdict should not be granted unless the moving party is entitled to judgment on the merits as a matter of law. Westerso v. City of Williston, 77 N.D. 251, 42 N.W.2d 429, and cases therein cited. A motion for judgment notwithstanding the verdict will not be granted where there is an issue for the jury to pass upon under the evidence as it doe not go to the weight of the evidence. Nelson v. Scherling, 71 N.D. 337, 300 N.W. 803, at page 804. In passing upon such matter the evidence is considered in the light most favorable to the party against whom the motion is made. State ex rel. Brazerol v. Yellow Cab Company, 62 N.D. 733, 736, 245 N.W. 382, 384.\n\nThe circumstances under which an attorney draws a will for a client by which he is the sole beneficiary and retains possession of the will necessarily raises the issue of undue influence. The authorities cited in the main opinion amply support the proposition that the determination of whether there was undue influence is for the triers of the facts.\n\nThe cases and authorities cited in the main opinion support the rule that a presumption of undue influence arises where an attorney takes a substantial benefit under a will drawn by him for a client; that under such circumstances it is up to him to explain and show that the gift was freely and voluntarily given and that he did not embrace the opportunity of exerting undue influence; that the burden of overcoming the presumption of undue influence and possible unfair dealing raised by the law as a protection to a client against the possible strong influence that may be exerted by an attorney in the confidential relationship existing between him and his client can be overcome only by the clearest and most satisfactory evidence; that the disputable presumption of undue influence by an attorney who has drawn a will for a client in which he is a substantial beneficiary is one that must be overcome by evidence introduced by him as proponent of the will and is a question to be determined by the jury; that the strength of such presumption and the amount of evidence required to overcome it must be dependent upon the circumstances of each case; that where facts, such as here, are involved they permit but do not command a finding of undue influence, but they at least make a prima facie case for the jury which the jury may either accept or reject; that some of the cases indicate that a suspicion or inference of undue influence requires that under the facts and circumstances of the case the question be presented to the jury.\n\nThere was an inference or presumption of undue influence present in the case at bar and the jury was instructed on the basis that the issue of undue influence was a question of fact for their determination. If this court grants the motion for judgment notwithstanding the verdict, such determination would as a matter of law be a declaration that there was no inference or presumption of undue influence involved, or in any event, it would amount to a declaration that if there was an inference or presumption of undue influence, that it was overcome by evidence presented by the proponent of the will. That is also a question of fact and one that should be determined by a jury. It is the basic reason why the motion for judgment notwithstanding the verdict should not be granted.\n\nNo matter what our views might be as to the weight of the evidence of undue influence, it is for the jury to pass upon that question.\n\nIt is for the jury to pass upon all questions of fact, and since the determination of whether there was undue influence is a question of fact, or whether an inference or presumption thereof was overcome by evidence, is also a question of fact, this court in the initial instance, in a jury case, may not pass upon that question.\n\nIf a new trial is granted in this case and no other evidence or newly discovered evidence is presented bearing on the mental capacity of Ethol G. McIntyre, it would appear that the main opinion would amply support the theory that the issue of testamentary capacity or competency of the deceased to make a will has been determined, and that the only issue remaining in this case is whether or not there was undue influence exerted in the execution of the will of the deceased.\n\nThis court has held that it is not at liberty to review or revise the action of the jury unless the verdict is without substantial support in the evidence. Keller v. Reichert, 49 N.D. 74, 189 N.W. 690. Neither should this court, on a question of fact, in a jury case, substitute its determination upon such question of fact for that of the jury. A motion for judgment notwithstanding verdict will not be sustained where there is an issue for the jury. Nelson v. Grondahl, 12 N.D. 130, 96 N.W. 299; Olstad v. Stockgrowers Credit Corporation, 66 N.D. 416, 266 N.W. 109. Likewise a motion for verdict notwithstanding judgment will not be granted where there is an issue for the jury.\n\nIt can not be said in this case that the motion for judgment notwithstanding the verdict should be granted as a matter of law. The judgment appealed from should be reversed and a new trial granted on the issue of undue influence and also on the issue of testamentary capacity or competency of the deceased to make a will, if it should appear at a new trial that new or additional evidence is available for presentation to a jury upon that question.\n\nFor the reasons here stated, as well as those set forth in the main opinion, the motion for judgment notwithstanding the verdict was properly denied.\n\nMorris, This is an appeal from a judgment of the District Court of Pierce County vacating and annulling a decree of the County Court of Pierce County admitting a will to probate. The will involved was executed by Ethol G. McIntyre on July 15, 1941. JOHNSON, Judge (concurring). SATHRE, Judge (dissenting). We are all agreed that the will was properly executed in due and legal form and that the testatrix had testamentary capacity to execute the will. The majority opinion concludes however that upon the record presented the question of undue influence is a question of fact and should be submitted to the jury. The writer is unable to agree with this Conclusion.\n\nThe issue of undue influence is based upon the fact that the proponent of the will, a lawyer, drew the will and that he is the beneficiary under the terms of the will. It is undisputed that the proponent who was the beneficiary drew the will. His testimony is that he was called by the testatrix to draw her will; that he drew the will; that he typed it on his typewriter in accordance with the terms dictated by the testatrix without any suggestions from him. He thereupon left the will with the testatrix about twenty minutes while he went out and procured the attendance of a doctor and a lawyer as attesting witnesses. Both of them testified that they signed the will as witnesses at the request of the testatrix in her presence and in the presence of each other and that she declared to them that it was her last will and testament. So far as to the writer has been able to discover from reading the transcript there is no direct evidence nor are there any circumstances which would indicate that the testatrix after the execution of the will at any time indicated either by word or act that she had been subjected to undue influence or that she was dissatisfied with the provisions of the will. The will was executed shortly before she had an operation for removal of her gall bladder. She recovered from the operation and she lived for seven years thereafter without at any time taking any action or expressing any intent to change or revoke the will. Earlier in her life she had executed two wills both of which she afterwards revoked. One of these wills was prepared by her shortly before she planned to take an ocean trip. In this will she left the property to her sister, a Mrs. Nerison. After her return from her trip the will was returned to her and it was destroyed. During the seven years after the execution of the will, she traveled regularly between North Dakota and Florida. She bought property in Florida of considerable value. During all of that time she conducted her own business affairs, and if she had felt that undue influence had been exerted on her when she executed her will or that she was dissatisfied with its provisions, she had ample time and opportunity to change it. She had had experience in such matters previously for, as pointed out, she had drawn two prior wills each of which she afterwards revoked. In the Nebraska case, In re Fehrenkamp's Estate, 154 Neb. 488, 48 N.W.2d 421, cited in the majority opinion, proceedings were brought to contest the will of the testator. The issue was tried to the court and a jury. At the close of the testimony the proponent moved for a directed verdict which was denied. The proponent of the will appealed from the order. The supreme court reversed the judgment of the trial court and remanded the case to the trial court with directions to enter judgment for the proponent upon the motion for a directed verdict. The contestant was a brother of the testatrix. There is evidence in the case that both before and after the execution of the will testatrix had told the contestant, her brother and others, that she left all of her property including her home to him. (The contestant contended that the testatrix did not understand the nature of her act in making the will and relied upon the testimony of a non-expert witness who was permitted to testify over objection that in her opinion the testatrix did not know what she was doing when she made the will.\n\nIn the case of In re Thompson Estate, 153 Neb. 375, 44 N.W.2d 814, 818, the rule with reference to undue influence is stated as follows:\n\n'In a will contest on the ground of undue influence the burden is on the contestant to prove by a preponderance of the evidence (1) that the testator was a person who would be subject to such influence, (2) that there was opportunity to exercise such influence, (3) that there was a Disposition to exercise such influence, and (4) that the result was the effect of such influence.' In re Estate of Farr, 150 Neb. 615, 35 N.W.2d 489, 490. Proponent directs attention to elements (1) and (4) of the above rule.\n\n'In order to invalidate a will, undue influence must be of such a character as to destroy the free agency of the testator and substitute another person's will for his own.' In re Estate of Heineman, 144 Neb. 442, 13 N.W.2d 569. See, also, In re Estate of Goist, 146 Neb. 1, 18 N.W.2d 513'.\n\nAnd in the case of In re Heineman's Estate, 144 Neb. 442, 13 N.W.2d 569, the Supreme Court of Nebraska said:\n\n'Undue influence cannot be inferred alone from motive or opportunity. There must be some evidence, direct or circumstantial, to show that undue influence not only existed, but that it was exercised at the very time the will was executed.' In re Estate of Heineman, supra.\n\nThe majority opinion cites the Iowa case In re Ankeny's Estate, 238 Iowa 754, 28 N.W.2d 414, 419.\n\nA close examination of the facts in that case show that they differ materially from the facts in the case at bar. The testator in the Iowa case was a widower living alone in a house on a farm that he had owned for a number of years. His estate was appraised at $31,000. The will was drawn by an attorney who was the beneficiary of one third of the value of the estate. The administratrix was the daughter of the attorney who drew the will. The will was executed on May 27, 1943. The testator died on April 24, 1945 less than two years after the will had been executed. At the time of the execution of the will he was 85 years old. The will was dictated and prepared by Meeker, the attorney and under his direction. There was a long relationship of attorney and client between the attorney and testator and this relationship was in existence at the time decedent's will was prepared. The will was retained by the attorney in his lock box and was under the control of himself and members of his family until after the death of the testator after which the will was filed for probate. With reference to the relationship between the testator and the attorney who dictated and prepared the will we quote from the opinion:\n\n'The court had a right to consider, in connection with the above facts, what might be termed a vigorous campaign by the Meeker family in an effort to maintain intimate relations with the decedent. After the death of Mrs. Ankeny the Meeker family commenced visiting testator and entertaining him on holiday occasions. They were constantly sending him postal cards and visiting him. This may have been the natural kindness toward an old man who lived alone, or it may have arisen from other reasons, but it added to and made stronger the relationship that existed between the decedent and his attorney.'\n\nThere is no evidence in the instant case of any such overtures by the proponent of the will or his family towards the testatrix. With reference to the manner in which the will was prepared in the Ankeny case the opinion states that the evidence shows that the will was dictated and prepared by and under the direction of the attorney who drew it and his daughter was nominated as executrix thereof. The will of the testatrix in the instant case was short and she could easily have read it during the twenty minutes she alone had it in her possession while Mr. Stormon was gone to procure the attesting witnesses to the will. She was about to submit to a major operation with a possibility that she might not survive the ordeal, and being of sound mind and memory she certainly would wish to ascertain the contents of her will. In this respect the circumstances surrounding the execution of the will of Ethel G. McIntyre the testatrix in the instant case, were materially different from the facts and circumstances in the Ankeny case. The testimony of Mr. Stormon is not contradicted and there is no testimony or circumstances from which it can legitimately be inferred that he in any way exerted any undue influence upon the testatrix. On the contrary, in the writer's opinion, the evidence as to the conduct of the testatrix during the seven years after the execution of the will shows conclusively that she was entirely free to exercise her own judgment without any undue influence when the will was executed.\n\nThe question of undue influence was considered in the recent Nebraska case In re O'Donnell's Estate, Neb., 64 N.W.2d 116, 123. This was a will contest in which the validity of an instrument purporting to be the last will and testament of one Nellie O'Donnell was involved. The contestants were children of a deceased brother of the testatrix. The appeal is from an order directing a verdict in favor of the proponents of the will and ordering the will admitted to probate. The will gave to the proponents of the will and members of their family the major part of the estate of the testatrix. They were not related to the testatrix but were old friends and neighbors of the testatrix, and two of them, husband and wife, were nominated as executor and executrix respectively. As to the mentality of the testatrix in In re O'Donnell's Estate we quote from the opinion of the Court:\n\n'It appears from the record that the testatrix, during her childhood, school, and Sunday school periods in Saunders County, was described as slow to learn, backward, and having had much difficulty in comprehending her lessons. One witness described her in later years as 'simple minded,' and another witness described her as not possessed of normal understanding or intelligence. When she attended functions, social or otherwise, she was accompanied by a member of the family to and from the same, while her brothers and sisters were not restricted in this respect. She attended country school until she was 17 or 18 years of age and then attended a boarding school in Lincoln for a year. Her brothers and sisters attended Fremont normal college and later taught school or engaged in gainful occupations, while the testatrix stayed at home and did house work described as 'menial' work. She had no outside friends as did the other members of the family. Her condition in such respect did not improve, at least, as shown by the testimony, up to the time of her father's death in 1929, when she was 50 or 51 years of age.'\n\nThe main question on appeal was whether or not the trial court erred in not submitting to the jury the issue of undue influence alleged to have been exerted on the testatrix by Clara M. Topp and Adolph J. Topp, neighbors and friends of the deceased and who were the executors of the will. With reference to the elements necessary to be established to warrant the rejection of the will on the grounds of undue influence the court stated the rule which we have quoted from the case of In re Thompson's Estate, supra. The court further stated that 'the burden is on contestants to produce evidence tending to prove each of the four elements stated above, as a prerequisite of their right to have the issues submitted to a jury for determination. * * * If any one of the essential elements enumerated is not supported by evidence or reasonable inference drawn from a fact or facts otherwise established, the contention of undue influence must be rejected. The evidence must tend to show undue influence directly in reference to the will in question, and be of such nature as to control the will of the testator and cause him to do something that he did not intend. Suspicion or supposition of undue influence is not sufficient to require the submission of the question to a jury or to sustain a verdict.' We quote further from the opinion In re O'Donnell's Estate, supra:\n\n'It should be stated here that it is not the function of this court to determine the question whether or not undue influence has been established, but only the question whether or not there was sufficient evidence to justify submission of that question to a jury. See, In re Estate of Kerr, 117 Neb. 630, 222 N.W. 63; In re Estate of Noren, 119 Neb. 653, 230 N.W. 495'.\n\nThe opinion continues:\n\n'In addition, there are other propositions of law applicable to a determination of this appeal as it relates to undue influence, as follows: A testator may dispose of his property as he pleases. The law does not require that he recognize his relatives therein, nor does it put any obstacle in the way of the aged or infirm in making Disposition of their property by will; provided, only, that their mentality conforms to the accepted tests at the time of the execution of such testamentary instrument. See, In re Estate of Bose, 136 Neb. 156, 285 N.W. 319; In re Estate of Goist, 146 Neb. 1, 18 N.W.2d 513'.\n\nIn the instant case the record shows that after the execution of her will, and from 1943 to 1945 the testatrix bought U.S. bonds the maturity value of which was $6,500 and that the bonds contained Stormon's name either as joint payee, or were payable to him in case of her death. The cashier of the Merchants Bank at Rugby testified that testatrix had been a customer of his bank for fifteen years; that she purchased U.S. bonds directly from the bank and that some bonds came in from the several bond drives; that the record of the bank showed that some of the bonds were issued directly to testatrix, but that a large number of them were payable to her and were payable on her death to John A. Stormon. These bonds were bought by herself, on her own initiative and it can not be said that she was influenced by Stormon when she bought them. This same witness testified that the testatrix personally conducted her business with the bank and that John A. Stormon never was with her in the bank. Reference is also made to the testimony of Mr. Lutz. He was one of the attesting witnesses of an earlier will executed by the testatrix. He testified that he had known the testatrix since 1931; that he was with the Gronvold Motor Co. at Rugby and that the testatrix had done a considerable amount of business with that company; that she was a bright and intelligent woman and in carrying on her business transactions she exercised her own independent judgment and seemed very capable.\n\nThe majority opinion is predicated upon the naked inference that may be drawn from the fact that the proponent of the will drew it and was the beneficiary thereunder. Standing alone without any evidence negativing such inference the question of undue influence might properly be submitted to the jury. But when we fairly consider the testimony in the record as to the business ability of the testatrix, her experience with wills, and other business matters after the death of her husband and particularly during the seven years after she executed the will in question, it seems clear that any inference, or even presumption, of undue influence has been completely overcome and removed, leaving no issue of fact for submission to the jury. As stated in the majority opinion:\n\n'We have never considered whether a presumption of undue influence arises from the fact that an attorney draws a will under which he takes a substantial benefit. We have no statutory presumption applicable to this situation. Our careful study of the cases and texts dealing with this question leads us to the Conclusion that we should not by judicial precedent establish a rule that a presumption of undue influence invariably arises from the fact that a will is drawn for a client by an attorney who becomes a major beneficiary under the will. The conditions under which such wills might be drawn could conceivably differ so greatly that such a presumption in one case would serve the ends of Justice but in another would be an impelling force in the creation of inJustice.'\n\nEvery person of sound mind and memory has the constitutional and legal right to dispose of his property by will in any manner that be may choose. It is a sacred right which courts are in duty bound to respect and protect. In the instant case the contestants have wholly failed to produce any evidence, either direct or circumstantial, to prove the four elements which are necessary prerequisites to have the issue of undue influence submitted to the jury for determination. True, there was opportunity for exertion of undue influence but there is not the slightest evidence that such influence was exerted by Mr. Stormon. Furthermore, as pointed out herein, there is no evidence in the record that the testatrix, subsequent to the execution of the will, ever intimated that she had been subjected to undue influence by Mr. Stormon; nor is there any competent evidence that the will of the testatrix was the result of undue influence. It seems clear to the writer that the contestants have failed to establish by any credible evidence that the testatrix, Ethol G. McIntyre was induced to execute the will in question through any undue influence. It would therefore be unfair and unjust to the testatrix to submit the question of undue influence to a jury that might be more disposed to base a verdict upon the question whether testatrix in disposing of her property was fair to her relatives rather than upon her fundamental right to make Disposition thereof as she saw fit and as she directed in her will. The motion for judgment notwithstanding the verdict should have been granted.\n\nI am authorized to say that Hon. GEO. THOM, Jr., District Judge, sitting in the stead of GRIMSON, J., concurs in the views herein expressed.\n\n",
    "body_length": 203665,
    "citedas": [
      "65 N.W.2d 475"
    ],
    "attorneys": "Roland A. Heringer, Rugby, Sinness \u0026 Duffy, Devils, Lake, and J. Howard Stormon, Rolla, for petitioner and appellant. C.a. Waldron and Bruce M. Van Sickle, Minot, John Finch Arneson and Robert Elliot, Jr., Minneapolis, Minn., of counsel, for contestants and respondents. Chief Justice. *fn1 The summary of the facts was prepared and many of the cited authorities were collected by the late Judge A.m. Christianson who participated in several conferences on this case.",
    "category": [
      "243",
      "75"
    ],
    "judges": "Burke, J., concurs.",
    "citation_count": 0
  }
}
