{
  "id": "n4AqHJQBep42eRA9L9Bf",
  "document": {
    "title": "City Homes, Inc. v. Hazelwood",
    "full_title": "CITY HOMES, INC. v. Brittany HAZELWOOD",
    "jurisdiction": "Court of Special Appeals of Maryland",
    "date": "2013-03-22T00:00:00+0000",
    "docket": "No. 2109",
    "body": "WATTS, J. This case involves an action brought by Brittany Hazelwood, appellee, against City Homes, Inc., appellant, for damages allegedly caused by her exposure to lead paint at 4 North Stockton Street, Baltimore, Maryland (“4 North Stockton”), a residence owned and operated by appellant. Following an eight-day trial, a jury sitting in the Circuit Court for Baltimore City returned a verdict in favor of appellee for a total of $5,100,000, including $900,000 in economic damages for lost earning capacity and $4,200,000 in non-economic damages. On *619post-trial motion, the circuit court reduced the non-economic damages award to $350,000 in accordance with the cap on non-economic damages, thereby reducing the total award to $1,250,000. After the denial of other post-trial motions and imposition of sanctions in the amount of $10,135.45 against appellant and in the amount of $10,000 against appellant’s counsel, William C. Parler, Jr., appellant noted this appeal. On appeal, appellant presents nine issues, which we consolidate and quote: I. Whether the [circuit] court committed legal error or abused its discretion when it[: (1) ] erroneously denied [a]ppellant’s motions to exclude the testimony of Dr. Eric Sundel despite Dr. Sundel’s complete lack of experience in treating patients with lead exposure, diagnosing injuries based on lead exposure, or determining the source of an alleged exposure ... [; and (2) ] disregarded, in violation of Maryland Rule 5-702, the fact that Dr. Sundel had no factual basis upon which to base his opinions? II. Whether the [circuit] court committed legal error or abused its discretion in denying [a]ppellant’s motions to exclude Christopher White as an expert regarding the testing conducted by A[rc] Environmental given that Mr. White was not present for the testing, had limited experience with the equipment used, and was unable to operate the equipment when challenged? III. Whether the [circuit] court committed legal error or abused its discretion when it allowed the reports of A[rc] Environmental into evidence despite the known flaws regarding the equipment used? IV. Whether the [circuit] court committed legal error or abused its discretion when it denied [a]ppellant’s motion to amend or alter the jury verdict regarding economic damages despite the fact that there was no legal or factual basis for the award and the award was not reduced to present value as required by Maryland law? *620V. Whether the [circuit] court committed legal error or abused its discretion when it denied [appellant’s motion to amend or alter the jury verdict and allowed the verdict to exceed the liability insurance amount carried by [appellant, a charitable organization with immunity under Maryland law? VI. Whether the [circuit] court committed legal error or abused its discretion by violating [appellant’s rights under the Fourteenth Amendment of the United States Constitution and Article 24 of the Maryland Declaration of Rights when it ordered post-trial sanctions against [appellant in the amount of $10,135.45? VII. Whether the [circuit] court committed legal error or abused its discretion when it ordered sanctions against [appellant’s counsel in the amount of $10,000 for failure to produce documents responsive to discovery requests in violation of [appellant’s counsel’s due process rights under the Fourteenth Amendment of the United States Constitution and Article 24 of the Maryland Declaration of Rights? VIII. Whether the [circuit] court committed legal error or abused its discretion when it quashed [appellant’s subpoena to obtain the records of the jury commissioner and denied [appellant’s motion for new trial challenging the admittance of an unqualified and biased juror onto the panel? For the reasons set forth below, we answer questions I, VI, and VII in the affirmative. In light of our answer to question I, we do not address questions III, IV, V, or VIII, and briefly address question II for guidance. We vacate the circuit court’s imposition of sanctions against appellant in the amount of $10,135.45 and against William C. Parler, Jr. in the amount of $10,000. We, therefore, reverse and remand the case for further proceedings consistent with this opinion. FACTUAL AND PROCEDURAL BACKGROUND Appellee was born November 23, 1990. Appellee resided at 4 North Stockton from July 1993 through 2000, where she was *621allegedly exposed to lead paint. Having purchased the property on December 30, 1986, appellant owned 4 North Stockton during the period in which appellee resided at the property. Appellee’s blood-lead levels were tested and reported on seven separate occasions — on October 8, 1992, April 8, 1993, July 16, 1993, August 16, 1994, April 18, 1995, July 17, 1995, and November 3,1998.1 (1) Pretrial Proceedings (a) Complaint On May 28, 2009, appellee filed a Complaint and Demand for Jury Trial in the Circuit Court for Baltimore City against appellant and Barry Mankowitz, the person who “managed, maintained, operated and controlled the property at 4 N. Stockton Street.” In the complaint, appellee alleged: (1) Negligence against appellant; (2) Unfair Trade Practices against appellant; (3) Negligence against Mankowitz; and (4) Unfair Trade Practices against Mankowitz. (b) Amended Complaint On August 6, 2010, appellee filed an Amended Complaint and Demand for Jury Trial against appellant, Mankowitz, Helen H. Hunt, and the Estate of Helen H. Hunt. In the amended complaint, appellee alleged that appellant owned property located at both 4 North Stockton and 6 North Stockton Street (“6 North Stockton”), and that Mankowitz managed both properties. Appellee alleged that Hunt owned and managed property located at 1606 Lemmon Street (“1606 Lemmon”). As to appellee’s residency history, appellee alleged: from 1990 to 2000, she resided with her parents at 4 North Stock*622ton;2 from 1990 to 1998, she visited 6 North Stockton, where her grandfather leased property; and from 1990 to 1998, she resided at 1606 Lemmon.3 Appellee alleged that, at each of the three properties, she was exposed to “chipping, peeling, and flaking lead-based paint powder and dust[.]” In the amended complaint, appellee alleged: (1) Negligence against appellant concerning 4 North Stockton; (2) Unfair Trade Practices against appellant concerning 4 North Stockton; (3) Negligence against Mankowitz concerning 4 North Stockton; (4) Unfair Trade Practices against Mankowitz concerning 4 North Stockton; (5) Negligence against appellant concerning 6 North Stockton; (6) Unfair Trade Practices against appellant concerning 6 North Stockton; (7) Negligence against Mankowitz concerning 6 North Stockton; (8) Unfair Trade Practices against Mankowitz concerning 6 North Stockton; (9) Negligence against Hunt concerning 1606 Lemmon; (10) Unfair Trade Practices against Hunt concerning 1606 Lemmon; (11) Negligence against the Estate of Helen H. Hunt concerning 1606 Lemmon; and (12) Unfair Trade Practices against the Estate of Helen H. Hunt concerning 1606 Lemmon.4 *623(c) Designation of Experts: Dr. Eric Sundel and Christopher J. White On April 12, 2010, appellee’s counsel sent a letter to appellant’s counsel designating, inter alia, Dr. Eric Sundel and Christopher J. White as expert witnesses. As to Dr. Sundel, appellee stated: Dr. Sundel is a pediatrician who will review records and reports and is expected to render an opinion that the deficits of [appellee] are related to [her] exposure to lead paint at the [subject] properties, and that [s]he has permanent brain damage and a loss of Intelligence Quotient points as a result of that lead exposure. Dr. Sundel’s opinions are based upon his review of the medical, environmental and school records, Answers to Interrogatories, Deposition testimony, photographs and any other documents related to this case and also upon the numerous medical studies that link cognitive deficiencies and IQ loss to early childhood exposure. Further, Dr. Sundel relies upon his medical education, training and experience in reaching his conclusions. As to White, appellee stated: Christopher J. White, A[rc] Environmental Inc., Program Manager.... Based upon review of the testing of the subject property, Mr. White will render an opinion regarding the presence of lead-based paint on the interior and exterior of the property at the time of testing, as well as the time [appellee] lived at the subject property. Mr. White’s conclusions will be based upon the Federal ban on the use of lead based paint in residential housing in 1978, the Baltimore City Housing Code, the age of the dwelling, the condition of the dwelling at the time of testing the results of the testing performed, his education, training and experience. *624(d) Motion to Strike Arc Environmental Report On October 26, 2010, appellant filed a Motion to Strike Arc Environmental Report, alleging that appellee failed to provide notice of lead testing occurring at 4 North Stockton on August 19, 2010, in violation of a scheduling order issued by the circuit court. Appellant contended that it was deprived of the opportunity to attend the lead testing, and thereby “not afforded an opportunity to ascertain what equipment was used for the testing, ... [and] to confirm that testing protocols for the lead samples were adhered to[.]” Appellant requested that the circuit court strike a report prepared by White dated September 2, 2010, for 4 North Stockton titled “Lead-based Paint Survey Report (Exterior Only)” (the “September 2nd Report”). White prepared the report based on a lead-based paint testing data sheet completed by Arc technician Timothy Wilton as a result of the August 19, 2010, testing. On November 12, 2010, appellant filed a Line withdrawing the motion to strike filed on October 26, 2010. On November 15, 2010, appellant filed a second Motion to Strike September 2, 2010 Arc Environmental Report, raising the same arguments made in the earlier motion. On November 30, 2010, appellee filed an opposition to the motion to strike the September 2nd Report, contending that the motion was moot as appellant permitted testing at 4 North Stockton “for the existence of lead paint on November 2, 2010[,] and [a] representative from [appellant’s Counsel was present for the interi- or and exterior lead tests of [4 North Stockton] on November 2, 2010.” Attached to the opposition was a report dated November 5, 2010, prepared by White-based on technician Timothy Wilton’s lead-based paint testing data sheet — for 4 North Stockton titled “Lead-based Paint Survey Report” (the “November 5th Report”). In the November 5th Report, White reported: Lead-based paint was detected above the Maryland standard (\u0026gt; 0.7mg/cm2) on the following components in this property: *625 Room Component front exterior basement door jamb; door jamb living room window casing; baseboard 1st floor hallway door casing and jamb; baseboard kitchen door casing and jamb; window sill lsh-2nd floor stairs stair stringer bathroom window casing 2nd floor hallway baseboard 2nd floor rear bedroom window casing; doorjamb 2nd floor front bedroom window casing; baseboard 2nd-3rd floor stairs stair stringer 3rd floor front bedroom window casing; closet door casing 3rd floor rear bedroom door jamb rear exterior door jamb In the November 5th Report, White stated that Wilson used an “LPA-1 x-ray fluorescence (‘XRF’) spectrum analyzer, serial # 1373, manufactured by Radiation Monitoring Devices, Inc. (RMD)” to perform the survey. White stated that “[c]alibration check readings [were conducted] to ensure that [the] XRF instrument [was] within acceptable precision and accuracy levels throughout the entire inspection process.” A handwritten note by Wilton stated that “a representative for defense counsel was present during testing.” On January 24, 2011, the circuit court issued an Order denying appellant’s motion to strike the September 2nd Report as moot. (e) Motions to Exclude Experts and for Summary Judgment On April 8, 2011, appellant and Mankowitz filed a “Motion to Exclude [Appellee]’s Experts and Motion for Summary Judgment.” As to Dr. Sundel, appellant and Mankowitz contended that Dr. Sundel “should be precluded from testifying as to the source of [appellee]’s alleged injuries or as to medical causation, as he lacks the qualifications and the factual basis to do so required by Md. Rule 5-702.” Appellant and Mankowitz argued that Dr. Sundel was not qualified to opine as to the source of appellee’s alleged lead exposure or the cause of appellee’s alleged injuries. Appellant and Mankowitz argued that there were numerous reasons why Dr. Sundel was not qualified to render an opinion as to the source of lead expo*626sure, including that he was not a Maryland certified risk assessor, he had not conducted a full risk assessment, he had not examined or spoken with appellee, he “formulated his opinions solely based on the records selected and submitted to him by [appelleej’s counsel[,]” he had not published any articles concerning lead or been involved in any studies related to lead, he had treated only one patient suffering from lead exposure, and he lacked “the ability to determine whether declining lead levels are indicative of previously ingested lead being redistributed or newly ingested lead.” Appellant and Mankowitz maintained that Dr. Sundel was not qualified to testify as to the source of appellee’s injuries because he “did not have training or experience in determining whether lead exposure was the source of a patient’s injuries[,]” and did “not follow a reliable methodology when formulating his opinions regarding [appelleej’s IQ loss [because] he ‘extrapolate[d]’ from studies[.J” Appellant and Mankowitz asserted that Dr. Sundel lacked a “basic understanding of the relevant studies and surveys regarding lead exposure and medical causation.” Appellant and Mankowitz maintained that Dr. Sundel lacked a sufficient factual basis to opine that 4 North Stockton was a substantial contributing factor to appellee’s alleged injuries because his opinion was based solely on the “inadmissible testimony of [ ] White, and the fatally flawed and inadmissible Arc Environmental tests[,J” and the age of the property. As to Arc Environmental, appellant and Mankowitz argued that the “reports [prepared] by Arc Environmental, and any testimony related to the reports, should be excluded as the ARC XRF test results are unreliable, unverifiable, and thus, inadmissible.” Appellant and Mankowitz asserted that, at a deposition taken on January 18, 2011, White testified that he has never been accepted as an expert by a trial court nor testified at any trial, and that Timothy Wilton — not White— conducted the lead testing at 4 North Stockton for Arc Environmental. As White did not perform and was not present for the testing at 4 North Stockton, appellant and Mankowitz asserted that White would be unable to offer an *627opinion as to: (1) the condition of the equipment used; (2) the calibration of the XRF machine performed before and after testing at 4 North Stockton; (3) where the XRF machines were placed during the testing; or (4) the exact areas of the property that were tested. Appellant and Mankowitz alleged that, without knowing where the tests were performed at 4 North Stockton, they were unable to duplicate the tests “to ascertain the reliability of [appelleej’s test results.” Appellant and Mankowitz contended that the September 2nd and November 5th Reports were inadmissible for two reasons: (1) the XRF machines used “detect other sources of lead and, therefore, the results of the A[rc] Report are unreliable, unverifiable and unfairly prejudicial”; and (2) the Arc Environmental testing “was not a full risk assessment and thus, the results cannot be relied upon.” Specifically, appellant and Mankowitz alleged that the XRF machines tested more than the top layer of a given surface for lead, and instead “w[ould] test positive if there is lead within the substrate itself[,]” ie. “lead well beneath the surface of the exterior layer of paint produces a positive result, even if no lead paint existed on the surface.”5 Appellant and Mankowitz contended that a full risk assessment — which includes tests of the water or soil at a property as well as a questionnaire completed by a plaintiffs family — was not performed, and that trial courts have excluded test results in circumstances where a full risk assessment is not conducted. Appellant and Mankowitz asserted that Arc Environmental performed only a “Lawyer 40 shot survey,” in which the inspector completes forty readings, with one test on each surface, and faded to perform the more comprehensive full risk assessment. On April 26, 2011, appellee filed an Opposition to the motion to exclude and for summary judgment, contending that Dr. Sundel was qualified as an expert in pediatrics as a result of his knowledge, skill, experience, training, and education, and *628that “his testimony is appropriate on the particular subject of lead poisoning.” Appellee argued that an expert’s knowledge may come from many sources, and that Dr. Sundel’s knowledge came “from his experiences and observations as a medical student and pediatrician[,] and his review of medical literature concerning lead paint poisoning.” Appellee asserted that because Dr. Sundel is an expert in pediatrics, it was permissible for him “to testify that 4 N[orth] Stockton [ ] was, more likely than not, a source of [her] exposure to lead paint and consequent injuries.” Appellee maintained that there was a sufficient factual basis for Dr. Sundel’s opinions that lead exposure occurred at 4 North Stockton and substantially contributed to her injuries. As to the September 2nd and November 5th Reports, and White’s expert testimony, appellee contended that the reports “are reliable and fall within a hearsay exception, and [ ] White is qualified to render opinions within his realm of expertise: lead inspection and lead risk assessment.” According to appellee, White is Timothy Wilton’s “direct supervisor at A[rc] Environmental[,]” the Program Manager at Arc Environmental, and a Maryland licensed and accredited Lead Inspector/Risk Assessor “qualified to interpret, review and explain to the jury how [ ] Wilton tested [4 North Stockton] and the results of said testing.” Appellee argued that XRF testing is reliable and verifiable and has been used for years, and that the reports were not inadmissible hearsay as they are records of regularly conducted business activity. On May 13, 2011, appellant and Mankowitz filed a Reply Memorandum in Support of Motion for Summary Judgment, reiterating the arguments for exclusion of the September 2nd Report, the November 5th Report, and Dr. Sundel’s and White’s testimony. On May 23, 2011, the circuit court held a hearing on the motion to exclude and for summary judgment. On May 31, 2011, the circuit court issued an order denying the motion to exclude appellee’s experts “and/or exclude reports of Dr. Eric Sundel and Christopher White[,]” and the motion for summary judgment. *629(f) Appellant’s Motion in Limine On May 26, 2011, appellant and Mankowitz began filing numerous pretrial motions, including a “Motion in Limine to Exclude [Appelleej’s Expert Dr. Eric Sundel and/or Request for Frye-Reed Hearing.” Appellant and Mankowitz argued that Dr. Sundel lacked the qualifications necessary to offer an opinion as to the source of appellee’s lead exposure and the cause of appellee’s alleged injuries. On May 27, 2011, appellant and Mankowitz filed a “Motion in Limine to Exclude [Appelleej’s Expert Arc En[ Jvironmental Services and its Designee, [ ] White,” arguing that the results of the September 2nd Report and November 5th Report and any testimony related thereto be ruled inadmissible. On June 7, 2011, appellant and Mankowitz filed a Line withdrawing the previously filed pretrial motions, including the motions in limine to exclude Dr. Sundel’s and White’s testimony and the September 2nd Report and November 5th Report, indicating that the motions would be “re-filed at the appropriate time on or before” trial.6 On August 5, 2011, appellant re-filed the “Motion in Limine to Exclude [Appelleej’s Expert Arc En[ Jvironmental Services and its Designee, Christopher White” and “Motion in Limine to Exclude [Appelleej’s Expert Dr. Eric Sundel and/or Request for Frye-Reed Hearing.” On August 22, 2011, appellee filed an opposition to *630the motions in limine to exclude Dr. Sundel, White, and the Arc Environmental Reports, arguing, in part, that appellant and Mankowitz had filed “identical motions on April 8, 2011, couched as motions for summary judgment[,]” which had already been denied by the circuit court following a hearing. On August 24, 2011, the circuit court held a pretrial motions hearing. As to the motion in limine to exclude Dr. Sundel, the circuit court denied appellant’s request for a Frye-Reed hearing concerning Dr. Sundel’s testimony, and held the matter sub curia, ruling from the bench, in pertinent part, as follows: I will tell you at least as a preliminary matter that I’m not inclined to grant a Frye-Reed hearing because I’m not hearing any dispute consistent with Blackwell about an issue with the scientific evidence that [appellee] through [her] experts expect[s] to present. The theory, the process of addressing IQ loss measured against blood lead levels at particular times, at particular stages of life, the, the technique or the methodology of engaging in ... that exercise, that’s[] not new stuff that warrants a Frye-Reed, hearing .... It does appear to me that there’s a significant issue as to how Dr. Sundel[ ] himself in this case on the facts and on the published authorities applied the methodology ... and I remained concerned about Dr. Sundel[]’s rook[ie] status in applying or misapplying the methodology. I am as I said going to take the motion under advisement. I’m letting you know that I don’t contemplate a ... Frye-Reed hearing in the circumstances____In subpart 1 of 5-702, in making a determination about the admissibility of an expert’s testimony, I shall determine whether the witness is qualified as an expert by knowledge, skill, experience, training or education. It’s troubling that [Dr.] Sundelf] is without experience, pediatric treatment experience in a lead paint context. It’s troubling when ... the testimony out of his deposition is, is parsed and he doesn’t come off sounding or reading very, very well and I’m not of a mind to just pass off the deposition as being a rook[ie]’s combination of mistakes or misstatements. It’s a concern [to] me, but that *631word “or” in addressing his qualifications by knowledge, skill, experience, training or education and the more recent [ajppellate authorities give me great pause about striking rookie Sundel[ ] from testifying based on qualifications, but I’m going to take it under advisement and make sure that I get myself back up to speed[.J ... [A]s to the factual basis for his testimony, [ ] I’ll take that under advisement as well, but I’m not going to address causation issues i.e., the factual basis for causation and Sundel[ J’s prospective testimony about that until or unless I hear the trial testimony. I think it’s [ ] premature to make a decision on causation or causation related issues, linking exposure to lead at a particular address at a particular time and consequent injury and/or damages.... I am going to wait until I hear the factual premises and [ ] the reliance testimony by Dr. Sundel[ ] to revisit the motion[.J So, what you’ve got is ... that I’m denying the motion in pertinent part and have taken into, and taken under advisement, will call it the qualifications piece, 5-702 subpart 1 after I revisit current authorities. As to the motion in limine to exclude White’s testimony and the September 2nd Report and November 5th Report, the circuit court held the matters sub curia. (2) Trial Proceedings From August 26, 2011, to September 1, 2011, and September 6, 2011, to September 8, 2011, the circuit court conducted a civil jury trial. (a) Mankowitz’s Testimony As a witness for appellee, Mankowitz, the president of appellant, testified that appellant purchased 4 North Stockton in 1986, and that appellee’s mother signed a lease for the property on July 6, 1993. Mankowitz testified that he was certified to operate an XRF machine, which tests for the presence of lead-based paint. According to Mankowitz, in the 1990s, Scientific Testing, a company owned by an individual named Tony Smelgas, conducted testing for lead at appellant’s *632properties. Mankowitz testified that it was appellant’s practice to place test results in “a folder for that particular property.” According to Mankowtiz, if there was no document in a file of test results from Scientific Testing, then Scientific Testing did not conduct such testing. According to Mankowitz, appellant began participating in studies with the Kennedy Krieger Institute, and, at some point prior to 1993, appellant “tried to send all the children seven and under for their protection to Kennedy Krieger to have their blood drawn and see if they had any ... elevated lead in their blood.” Mankowitz testified that appellee was tested at Kennedy Krieger Institute on July 16, 1993, and, at that time, had a blood lead level of 16 |xg/dL. Mankowitz testified that, after appellant received the test results from Kennedy Krieger Institute, it did not inspect 4 North Stockton for lead hazards and did not move appellee or her family out of the property to remediate or repaint the house. Mankowitz testified that appellant depended on Kennedy Krieger Institute, “which was renowned in lead paint problems with young childrenf,] to give [them] the course of action.” (b) Appellee’s Testimony On her own behalf, appellee testified that she recalled the baseboards and areas around the windows and windowsills on the first and second floors at 4 North Stockton had “[c]racked up[,]” or chipping, paint. Appellee testified that she remembered her mother complaining that the house at 4 North Stockton needed to be painted and she recalled her mother painting in the house after scraping the walls. Appellee acknowledged that, at deposition, she testified that, as a child, she moved back and forth a couple of times between 4 North Stockton and 1606 Lemmon, where she resided for a couple of months at a time. (c) Dr. Sundel’s Voir Dire and Testimony As a witness for appellee, during voir dire, Dr. Sundel testified that he was currently employed at the Baltimore-Washington Medical Center and served as chairman of the *633Department of Pediatrics from 2004 until January 2011. Dr. Sundel testified that he is a board-certified pediatrician licensed to practice medicine in Maryland. Dr. Sundel described his medical training as follows: he attended Boston University School of Medicine for four years, and completed a pediatric internship and pediatric residency — a total of three years — at Bayview Hospital Columbia Presbyterian Medical Center in New York City. Dr. Sundel testified as follows as to the evaluation and treatment of a child with lead poisoning during his internship and residency: So we were, it is a large children’s, baby’s hospital so there would be cases where a child would have a very elevated lead level and he would require something called chelation. Which is, chelation is using a special medicine to try to remove some of the lead from the body, especially to try to remove it from the brain. So we would have children who would be admitted to the hospital for intravenous chelation. They would get an IV placed and then they would require several days of daily doses of a special medication to try to reduce the level of lead. Dr. Sundel testified that, after his internship and residency, he was an attending pediatrician for one year at Lincoln Hospital in New York City. After leaving Lincoln Hospital, Dr. Sundel completed a pediatric fellowship for two years at Sinai Hospital of Baltimore and Johns Hopkins Hospital in Baltimore. Dr. Sundel testified that the pediatric fellowship entailed teaching medical students and young doctors, and learning how to conduct clinical research. Dr. Sundel’s curriculum vitae listed publications, which Dr. Sundel acknowledged did not concern the topic of childhood lead poisoning. Dr. Sundel testified, however, that as a pediatrician, he keeps current with childhood lead poisoning issues because, working in the pediatric emergency department, he needs to be able to understand the “different things that can cause” illnesses he tries to treat. Dr. Sundel explained that, for example, lead poisoning or lead toxicity can cause seizures, encephalatrophy, acute mental status changes, and abdominal pain. Dr. Sundel testified that he is familiar *634with the Centers for Disease Control (the “CDC”) and its articles and documents concerning lead poisoning, including a 1991 article and a 2005 article, both entitled “Preventing Lead Poisoning in Young Children.” Dr. Sundel testified that he is familiar with the American Academy of Pediatrics (the “AAP”) and its statement concerning childhood lead poisoning. Appellee’s counsel asked what information, if any, the CDC and AAP publications contained concerning a pediatrician making an inquiry into a source of lead exposure, and Dr. Sundel responded as follows: So one of the things that’s recommended to pediatricians is to try to review with parents environmental risk factors for lead exposure which again, for most children in the United States, is basically a function of living in older homes when lead-based paint was still very widely used and if the paint is in proper condition or not, if there’s deterioration of paint and whether there’s any chipping, or flaking, or peeling of paint because that’s, that’s in the United States the main way that young children are exposed to lead-based paint with their, what little kids do, hand-mouth, they put everything in their mouth. Dr. Sundel testified that he is familiar with Nelson’s Textbook on Pediatrics, which covers the issue of childhood lead poisoning and discusses potential sources of exposure to children. Dr. Sundel testified that, based on his review of the literature, as well as his training and experience, pediatricians are trained to inquire about the potential sources of lead exposure as follows: So it’s a number of questions about where ... the children spend their time within the house, outside of the home, whether they engage in sort of mouthing behaviors. So most young children, of course, put everything in their mouth. Some young children put non-food particles in their mouth.... So that’s to be asked about and addressed. And then the ... condition [and] the age of the house. Appellee’s counsel asked Dr. Sundel if there was any significance to there being flaking and chipping paint in an older *635house with a child who may have a tendency to put non-food particles in their mouth. Dr. Sundel responded: So the older houses in the United States usually have lead-based paint. The overwhelming majority of them have lead-based paint in the interior of the home. If the paint is in, if it’s flaking, peeling, chipping, then it’s going to fall to the ground, it’s going to be in dust, it’s going to be in microscopic particles. It may not be visible, it might be visible. And then little kids, what they do is they explore their environment. They crawl and they start to walk around and they touch everything. And they put then-hands in their mouths and they put their toys in their mouths and food. Obviously when they eat there’s a possibility that some of that flaking, chipping, peeling paint is going to fall into areas where food is stored. Um, so that’s the main way that children are exposed to lead in the United States. Dr. Sundel acknowledged that he is not a certified lead risk assessor. Dr. Sundel testified that he has appeared and testified previously in court as an expert in a case involving child abuse, but conceded that he had never testified in court as an expert in a lead paint poisoning case. Thereafter, appellee’s counsel offered Dr. Sundel as an expert in the field of pediatrics, including childhood lead poisoning. During voir dire cross-examination, Dr. Sundel admitted that he was not a psychologist or neuropsychologist, and that he does not administer IQ or achievement tests. Dr. Sundel acknowledged that his one instance of involvement with chelation therapy occurred in the mid-1980s when he was a first or second year resident, and that, since that time, he could not recall being involved with any children receiving chelation therapy. Appellant’s counsel questioned Dr. Sundel regarding deposition testimony, in which he admitted that, after being asked by appellee’s counsel to testify as an expert, he went back to the literature to “bone up,” but, when questioned, could not recall the articles he had read or reviewed. Dr. Sundel agreed that he did not have any accreditations or certifications related to lead inspection or lead assessments, *636and that he had never been involved in any Baltimore City tests of drinking water and soil for lead nor involved in any Maryland Department of the Environment studies on lead in the soil. Dr. Sundel acknowledged that he was not involved with the lead testing of 4 North Stockton, and had never visited the property. Dr. Sundel agreed that he was not aware of any peer reviewed medical or scientific literature stating that an expert may opine as to a source of lead ingestion by reviewing records, and that he had not published any articles related to lead, been involved in any studies related to lead, or delivered lectures on the topic of lead or lead ingestion. When asked by appellant’s counsel whether, during the course of his career as a pediatrician, he had ever treated a child for symptoms or problems related to lead ingestion where he “determined that the child was injured or had some issue related in any way to lead[,]” Dr. Sundel responded: “Not that I recall.” Dr. Sundel conceded that he had not taken a medical or nutritional history of appellee. According to Dr. Sundel, a differential diagnosis is “sort of trying to consider the different possible causes of a chief complaint, the reason that someone is sick.” Dr. Sundel testified that he could not remember having performed a differential diagnosis on a pediatric patient in which he had determined that the symptoms were due to lead ingestion. After voir dire of Dr. Sundel, the jury was excused, and appellant’s counsel objected pursuant to Maryland Rule 5-702(1) and (3) to Dr. Sundel being accepted as an expert. The circuit court overruled the objection, ruling, in pertinent part, as follows: The [C]ourt [of Appeals] noted, and I’ll quote here, ... that “a witness is qualified to testify as an expert when he exhibits such a degree of knowledge as to make it appear that his opinion is of some value whether such knowledge has been gained from observation or from experience, standard books, maps, or recognized authority or any other reliable sources.” *637I listened attentively ... and observed while I was listening to Dr. Sundel’s testimony about his familiarity with the cited authorities and I find that the ... Radman case’s reminder about the fundamentals of what it takes for me to exercise my discretion under [ ] Rule 5-702,1 am reminded, for example, when Radman says, ... that a witness may be competent to express an expert opinion if he is reasonably familiar with the subject under investigation regardless of whether the special knowledge is based upon professional training, observation, actual experience, or any combination of these factors. I revisited the so-called classic formulation on these points of concern in Radman, I also am reminded of the starting point under the Rule, as well as the articulation or explication in Radman, reminding us that what we’re talking about is whether and how the expert, the proffered expert has such special knowledge on the subject on which he’s to testify that he can give the jury assistance in solving a problem for which their equipment or average knowledge, their equipment of average knowledge is inadequate. It is sufficient if the court is satisfied that the expert has in some way gained such experience in the matter as would entitle his evidence to credit. And of course ultimately, upon, even upon recognizing an expert for his opinion, the jury is ultimately going to be told that they can give such weight, or not, to the testimony of an expert. Give it as much value, or no value, as they in their experience determine appropriate. I am going to recognize, I am recognizing Dr. Sundel as an expert pediatrician, especially with the concentration or including the concentration on his research and experience in childhood lead paint because his testimony is reflective of his special knowledge derived not just, or not only, from his own experience but also from the experiments and reasoning of others, communicated by personal association or through books or other sources. That’s out of the Radman case and of course you’ve heard me read on a daily basis subpart (1) of Rule 5-702 and the use of the or, the *638disjunctive to inquire whether the witness is qualified as an expert by knowledge, skill, experience, training, or education. There are a couple of examples that were provided in Radman that I found useful to hark back on---- The witness was disqualified by the court because the witness could not qualify as an expert in the flooring trade as he had never previously laid a floor. A witness may qualify if he possesses special and sufficient knowledge regardless of whether such knowledge was obtained from study, observation or experience. A law professor ... may be an expert on trial procedure even though he has never tried a case.... That’s an example, frankly, that is repeated ofttimes by the appellate authorities.... Collectively, the cases and relying especially on Radman v. Harold, indicate that one doesn’t have to be a specialist or even have to have personal experience dealing with a particular type of injury or a medical treatment or a procedure in order to qualify as an expert under 5-702. It seems to me that it’s a broad standard for what [ ] constitutes “qualified” under 5-702. We are reminded of that by the Wantz case in particular as to whether and how I ought to be exercising my discretion. I believe that Dr. Sundel’s experience as a pediatric hospitalist along with his own training as he described it here today in lead poisoning, in his reading, in his reliance on the authorities that were cited, renders him qualified to testify on the causal relationship between ingestion of lead and [appelleej’s alleged injuries. After the ruling, Dr. Sundel’s testimony commenced. Dr. Sundel testified that he was provided records concerning appellee — including birth records, Kennedy Krieger Institute medical records, Baltimore City Health Department medical and environmental records, Maryland Department of Health and Mental Hygiene medical records, Maryland Department of the Environment medical records, school records, the Arc *639Environmental reports, a neuro-psychological report, the State Department of Assessment and Taxation records for the residences where appellee resided listing the year the homes were built, and appellee’s and her father’s deposition testimony — which he reviewed prior to issuing a written report on November 28, 2010. Dr. Sundel testified that he reviewed the various records regarding appellee’s blood lead levels, and that the levels remained elevated for several years. Dr. Sundel testified that his review of the records indicated that appellee resided at and visited 4 North Stockton frequently and that this was significant because: tilt’s well recognized that the main source of lead for young children almost always is the primary residence where they either live or visit often. And then more than, so the residence, when its an older home, so for example homes built before 1960 something like two-thirds of them or three-quarters of them have lead-based paint. So a big risk is older homes. And then if there’s deterioration of the paint, that’s where there’s chipping, flaking, peeling, that’s the way young children can get access to that lead-based paint and then unfortunately get into trouble by ingesting it and ending up with an elevated blood lead level and then o[f] course the blood goes everywhere [in the body]. So it’s very important to know where the children, when they’re young, in the first few years of life, where they spent the majority of their time. Where they lived, where they visited. Appellee’s counsel asked the basis for Dr. Sundel’s opinion as to where appellee may have been exposed to lead, thus resulting in elevated blood lead levels. Dr. Sundel responded that “the main source of exposure for the majority of children in the United States is the residence where they live or spend a lot of time[,]” and that “[t]he older the home is, the more likely that lead-based paint was used.” Dr. Sundel testified that a home built in 1900, like the residence at 4 North Stockton, would have a “higher risk” than a home built twenty, forty, or sixty years later. Dr. Sundel testified that “we know ... there was a lot of lead-based paint at 4 North *640Stockton [ ] because [of] the ARC study ... [and] that there are multiple areas [ ] where the interior of the home seems not to have been in a good condition shortly after [appellee] moved into 4 North Stockton [ ].” Dr. Sundel opined to a reasonable degree of medical probability that 4 North Stockton was the location where appellee was exposed to flaking and chipping lead-based paint. Dr. Sundel testified that he reviewed appellee’s school records and that appellee “academically [ ] had a lot of trouble.” Dr. Sundel explained that elevated blood lead levels “cause loss of IQ points” as well as behavioral problems, such as hyperactivity, attention deficit disorder with hyperactivity, or aggressiveness. Dr. Sundel testified that appellee’s IQ in verbal and non-verbal areas was “lower than one would wish.” Dr. Sundel offered the opinion that appellee sustained an IQ loss of seven to ten IQ points as a result of her elevated blood lead levels. When asked by appellee’s counsel why he provided a range of seven to ten IQ points, Dr. Sundel testified that “there are many studies that show loss of IQ points with lead[,]” with one study showing that children whose blood lead levels were less than ten micrograms per deciliter sustained an IQ loss of seven IQ points and another study showing that children with blood lead levels above ten micrograms per deciliter sustained an IQ loss of more IQ points, “somewhere around one [ ] to four, one to five, something in that range[,]” for each additional ten micrograms per deciliter. Dr. Sundel testified that, academically, appellee had difficulties with certain subjects and with other school performance issues, such as “with listening comprehension, with attending to task, with coping skills, with ability to handle frustration, ability to follow directions, [and] ability to follow classroom and school rules.” Dr. Sundel opined to a reasonable degree of medical probability that lead exposure at 4 North Stockton was a substantial contributing factor to injuries appellee sustained, which he described as “[cjognitively she sustained loss of IQ points. Behaviorally, she sustained damage in terms ... of aggressiveness, in terms of externalizing behaviors in terms of hyperactivity.” Dr. Sundel offered the opinion that *641lead exposure was a substantial contributing factor to appellee’s “brain impairment[.]” Dr. Sundel opined that “the permanent injuries” appellee sustained resulted from exposure to flaking, chipping, lead-based paint at 4 North Stockton. On cross-examination, Dr. Sundel testified that he was first contacted by appellee’s counsel by letter dated November 15, 2010, when he was asked to formulate opinions based on documents sent to him. Appellant’s counsel questioned Dr. Sundel as to how appellee’s counsel designated him as an expert and stated what his opinion would be in a letter dated April 12, 2010, months before he was contacted and received any records related to the case. Dr. Sundel responded that he did “[n]ot really” know how that occurred. Dr. Sundel admitted that appellee’s case was his first lead paint case and the first time he ever had his deposition taken. Dr. Sundel acknowledged that, prior to trial, he had no contact with appellee or her family, and had not examined appellee. Dr. Sundel agreed that he was not provided with a household questionnaire form completed by appellee’s family and that he never requested that appellee or her family complete such a questionnaire form. Dr. Sundel conceded that he never met with appellee to conduct a medical history nor conducted soil lead tests at 4 North Stockton. Dr. Sundel testified that he never met with appellee’s family to inspect the residences she visited or resided in or to ask questions as to whether appellee had access to or chewed on woodwork, furniture, and toys as a child. Dr. Sundel admitted he had never administered an IQ test, and acknowledged that, during his deposition, he testified that appellee has lost three to five IQ points or four to ten IQ points. Dr. Sundel acknowledged that he does not know how to score an IQ test, and responded that he did not know whether the standard of error of measurement of the Weschler IQ test was plus or minus three points. Appellant’s counsel asked Dr. Sundel whether he would agree that, as a doctor looking at the results of a neuropsychological testing of appellee without knowing the child’s history, he could not tell *642from the test performance whether the child had a history of having elevated blood lead levels. Dr. Sundel agreed. (d) White’s Yoir Dire and Testimony and Admission of Arc Environmental Reports As a witness for appellee, White testified that he is the program manager for the lead-based paint group at Arc Environmental, which he described as an environmental consulting firm that, among other things, conducts lead surveys, mold testing, asbestos sampling, and indoor air quality testing. White testified that he is a licensed lead-based paint assessor in Maryland and several other jurisdictions, and has received training on the operation of XRF machines. White described the XRF machine as follows: [T]he XRF is a handheld device that’s placed up against any painted component. There is a triggering mechanism that’s pulled which then emits gamma radiation into the particular component that we’re sampling. That gamma radiation excited the electrons and produces a numerical reading on the screen of the device, which is a concentration of lead on that particular component. Wliite testified that he has used the XRF machine previously in conducting several hundred lead surveys. Wfiiite testified that he prepares reports describing the lead surveys. Appellee’s counsel moved to have the circuit court accept White as an expert in lead risk assessment, and the parties voir dired White as to his qualifications. Out of the presence of the jury, appellant’s counsel argued that WTiite not be permitted to testify as an expert because he was not qualified to offer an opinion, did not conduct the testing, lead risk assessment or lead inspection of 4 North Stockton, was not present during the testing, and had no personal knowledge of the testing. The circuit court ruled from the bench: Mr. White’s perspective testimony is on a very thin edge as to whether his testimony about the presence in 2010 of lead-based paint in the house would assist the jury to understand the evidence or to determine whether in the 1990s there was a lead paint hazard. But we haven’t heard his substantive *643testimony on that subject____Right now I am compelled to find that [White] is qualified to offer an opinion as to lead risk assessment and/or lead inspection within the meaning of the CRF and/or HUD because ... White acknowledged his familiarity and his appreciation for what those regulations were, what they were intended to do and how they were normally expected to be applied or in what circumstances they were expected to be applied. He also testified on direct examination as to the certifications and licensures, his training, his supervisory responsibilities. I am prepared, and I do find that Mr. White is qualified as an expert in the field of lead risk assessment and/or lead inspection within the meaning of, and only within the meaning of, Rule 5-702(1). I have made no determination at this point in time whether the expert testimony that he’s engaged to offer is appropriate, and I have made no determination as to whether a sufficient factual basis exists to support his testimony. The jury returned, and the circuit court announced that White had been accepted as an expert in lead risk assessment and lead inspection. White testified that Wilton conducted lead testing at 4 North Stockton on two separate occasions. White explained that the September 2nd Report contained the lead test results from an exterior testing conducted on August 19, 2010. Appellee’s counsel asked White to explain how Wilton used the XRF machine and White responded: Sure, upon his arrival at the site, he would perform calibration checks with the machine to ensure that it is operating properly. He would take three readings from a known standard that we refer to that has a known concentration of lead. As long as those three readings fall within the acceptable range that’s been described for this machine, we can assume that the machine is operating properly. He would have then proceeded to test, again in this case since it was only the exterior, any exterior painted components that were accessible to him at that time. Upon *644completion of that testing he would again calibrate the machine in the same manner he did the first time. The following exchange occurred when appellee’s counsel asked White questions about the procedures Wilton used when conducting the August 19, 2010, lead test: [APPELLEE’S COUNSEL]: And then with regards to [Wilton’s] training, how does he record the information that the machine reads with regards to any surfaces? [WHITE]: We utilize what we refer to as a lead-based paint testing data sheet that is included with our report. The data sheet includes all of the essential information as to which component was tested and the reading itself. On each line, as Mr. Wilton performs the testing, he records that information. [APPELLEE’S COUNSEL]: And in Plaintiffs Exhibit No. 14 [the September 2nd Report] is the information that Mr. Wilton collected in the report? [WHITE]: Yes, it is. [APPELLEE’S COUNSEL]: And does Mr. Wilton also take photographs at the time[?] [WHITE]: Yes, he does ... to provide a current look of the property conditions while we’re there performing the testing. [APPELLEE’S COUNSEL]: Is the job or Mr. Wilton or ARC Environmental to determine whether there are any lead-based hazards present at the time of the testing in August of 2010? [WHITE]: Again, we would simply be looking for the presence or absence of lead-based paint. [APPELLEE’S COUNSEL]: And what happens then when Mr. Wilton returns to the office after conducting the test? [WHITE]: He would provide me with the photographs and the data sheet that he completed and then I would complete the report and it would be issued. [APPELLEE’S COUNSEL]: Do you review the information? *645[WHITE]: Ido. White testified that the Scitec MAP4 machine was used to conduct lead testing on August 19, 2010, and that he was familiar with the machine and had been trained on the use of the machine. White testified that Wilton used the Scitec MAP4 machine by placing it against the component he was testing, pulling the trigger on the machine, and waiting for the machine to provide a digital reading. According to White, at the time of the August 19, 2010, lead testing, a positive lead reading was anything greater than 0.7 milligrams per centimeter squared, and that three of the nine readings taken on August 19, 2010, were classified as positive — the basement door jamb, the first floor door jamb, and the first floor door casing. As to the November 5th Report, White testified that Wilton conducted lead testing of the interior and exterior of 4 North Stockton on November 2, 2010, using an RMD LPA-1 machine. According to White, Wilton took forty readings during the testing on November 2, 2010. White described the calibration procedure for the RMD LPA-1 machine, and testified that the calibration readings were described in the November 5th Report. White testified that, according to the November 5th Report, twenty-two surfaces were found to contain lead-based paint, including the kitchen door casing and jamb, the kitchen window sill, the stair stringer from the first floor to the second floor, and the second floor hallway baseboard. As to the presence of lead paint on surfaces at 4 North Stockton, appellee’s counsel asked White for his opinion in the following exchange: [APPELLEE’S COUNSEL]: Mr. White, based on your training, knowledge, and experience and your review of the two ARC reports of the testing that Mr. Wilton did at 4 North Stockton [ ], do you have an opinion within a reasonable degree of scientific probability as to whether 4 North Stockton [] had lead paint on its wood surfaces in 2010? [WHITE]: I would have the opinion to a reasonable degree of scientific probability that the components that we identi*646fied on the interior of the property contained lead-based paint from at least, from when we performed the testing in 2010, from at least 1966 when lead-based paint was banned for interior use in the City of Baltimore. In regards to the exterior components, I would again share the same opinion that, I would feel that lead-based paint was present on those components from at least 1978, when the use of lead-based paint was federally banned. The circuit court overruled appellant’s counsel’s objection and motion to strike White’s testimony regarding lead-based paint existing prior to 2010. White testified that, had additional readings been taken and tested negative, his opinion would remain unchanged “as it pertains to the components that we did find to be positive.” During cross-examination, appellant’s counsel requested that White set up the XRF machines — the Scitec MAP4 and the RMD LPA-1 — in the mode in which they were used when Wilton performed the testing at 4 North Stockton. Appellant’s counsel asked that White demonstrate how the Scitec MAP4 is calibrated, and that after calibrating the machine, he take a test reading of a courtroom wall. As to the Scitec MAP4 machine, appellant’s counsel asked whether the machine would detect lead “regardless of whether the lead is in the outermost layer of the paint or all the way down to the bottom layer of many layers of paint[.]” White responded “yes[,]” and testified “that’s the standard for any XRF.” White acknowledged that it is possible that the XRF could give a positive reading for lead of a door that had been painted with lead-based paint but subsequently painted with ten coats of unleaded paint. During the in-court demonstration, White had difficulty switching the Scitec MAP4 machine to the proper mode, stating: “I’m just trying to maneuver and it’s giving me a problem.” White testified that the RMD LPA-1 machine has different performance characteristics, although the calibration procedure is the same as that of the Scitec MAP4 machine. White performed three calibration testings with the RMD *647LPA-1 machine. With the jury excused, White was asked to perform a test reading of a courtroom wall using the RMD LPA-1 machine.7 At the beginning of the next day of trial, appellee’s counsel moved to admit Plaintiffs Exhibit Nos. 14 and 15, the September 2nd Report and the November 5th Report. The circuit court admitted the reports into evidence over appellant’s objection and ruled that White’s expert testimony was admissible, stating as follows: I’ve read both reports____The “overview” closed quote of each report can be read as inconsistent with Mr. White’s testimony even contradictory to cited standards whether it’s COMAR or in the CFR. Nevertheless, that observation goes to the weight of the evidence and not the admissibility of Mr. White’s opinions or the admissibility of the reports. [ ] I have [ ] referred to and focused on and will address [ ] why I have addressed [Maryland Rule] 5 — 702[ ], allowing Mr. White to testify on XRF testing procedures generally as an expert on the subject and [Maryland Rule] 5-703 allowing him to testify as to the testing procedures specific as to 4 N. Stockton [ ] especially as the testing procedures were record on the reports themselves. [D]rawing on 5-703(a), I believe and find that Mr. White as an expert witness may interpret and draw his conclusions from reports prepared by Mr. ... Wilton [] so long as the reliance on those reports is reasonable.... I’ve reviewed the authorities as to whether, why and how to permit Mr. White’s testimony to proceed in front of the jury based on those reports and relying on those reports[.] ... I also referred to and I will quote from Consolidated Mechanic [Mechanical ] Contractors v. Ball, ... 263 Md. 328 [283 A.2d 154] (1971) decision of the Court of Appeals and here’s the quote, “Although an expert witness must base his opinions on facts in evidence, those facts need not be ascertained by him through physical examination of a patient, but rather maybe facts contained in *648reports or examinations by third parties.” I find that it was reasonable and apt and appropriate for White to rely on the reports by Mr. Wilton in this case. “An expert may extrapolate from data and facts contained in other’s reports and studies in order to form his expert opinion just as with any other facts relied on by an expert in forming his opinion, the facts contained in third party reports or examinations must be legally sufficient to sustain the opinion of the expert.” That’s coming out of the Keene Corp. v. Hall decision that I already cited.... And, of course, in addition to referring to 5-703(a), I have referred to Maryland Rule 5-702. I’ve already quoted that rule at length and ... am now focusing on subparts 2 and 3, the appropriateness of White’s testimony and the [ ] sufficiency of the factual basis, namely the reports to support his expert testimony. As to the scope of White’s testimony concerning the XRF testimony — White regularly conducted XRF testing, testing and/or he is trained to do so as part of his job duties with ARC. 5-702 allows White to testify as to how the XRF testing is conducted generally and how an XRF machine is usually operated. That testimony is relevant and probative [] because a fact finder could infer that the XRF testing conducted at 4 N. Stockton was conducted in the usual [ ] manner. I’ve already found White to be qualified to testify on XRF testing by virtue of his training or experience. As to appropriateness of his testimony and his reliance on the reports, I find that the testimony indeed may be helpful to the jury because it would allow them to assess the strengths and weaknesses of XRF testing generally which is something not within the knowledge of lay people and the jury may also infer that the XRF testing conducted at 4 N. Stockton comported with the usual standards of XRF testing notwithstanding the doubts inflicted upon Mr. White’s testimony upon cross-examination. [R]eferring to the factual basis for Mr. White’s testimony, his experience with XRF testing provides that factual basis together with the reports. The ARC Reports generated, Exhibit Nos. 14 and 15 do contain a record of how the testing at 4 N. Stockton was *649conducted. Rule 5-703 allows Mr. White to disclose and explain what that record indicates. The reports can be disclosed to the jury under 5-703(b). I’m relying on Milton Company case as well Brown v. Daniel Realty at 409 Md. 565 [976 A.2d 300] (2009) decision by the Court of Appeals. I am admitting Exhibit Nos. 14 and 15 for reasons stated under both rules. At the conclusion of White’s testimony, appellant’s counsel moved to strike the testimony, arguing that White had never been trained or certified in the operation of the Scitec MAP4 machine, and could not operate the machine in court, and that White had received minimal manufacturer training on the RMD LPA-1 in 2010. Appellant’s counsel contended that the 40 shot surveys conducted by Arc Environmental do not constitute a lead risk assessment, and that the existence of lead paint is not violative of the city housing code or any state statute or regulation. Appellant’s counsel asserted that White’s testimony was not probative and that White was not qualified to testify. Appellant’s counsel maintained that the Arc Environmental Reports were unverifiable as White was unable to testify as to the location of the readings. The circuit court denied the motion to strike White’s testimony, ruling: In the wake of [ ] cross-examination, there may well be jurors who are less than enthusiastic and less than impressed with the recognition of the expert qualifications of Mr. White, but the problems with Mr. White’s testimony do go to the weight of the evidence as opposed to his qualifications and as opposed to the appropriateness of his testimony and addressing the existence in certain locations of lead or lead paint in the ... house and the outside of the house. His opinions were quite limited as to the presence of lead period and his qualifications make that determination unaffected by the reliability factors that have been pointed out by [appellant’s counsel]. Again, the issues that [appellant’s counsel] raises seem to me to relate to the weight of the evidence as opposed to his underlying qualifications. I will deny the motion to strike Mr. White’s testimony. *650(e) Patrick Connor’s Testimony As a witness for appellant, Patrick Connor, an environmental consultant and licensed lead risk assessor, testified that he is the president of a company known as Connor Environmental, which conducts environmental engineering and, specifically, forensic work in the area of lead-based paint. Connor testified that he is an accredited instructor for the State of Maryland for lead-based paint inspectors and a lead risk assessor. Connor was accepted as an expert in the field of lead risk assessment and identifying lead hazards. Connor testified that a full risk assessment consists of an “on-site investigation to determine the existence, nature, severity and location of lead-based paint hazards and the provision of a report by the individual or the firm conducting the risk assessment explaining the results of the investigation and options for reducing lead-based paint hazards.” Connor described the process of conducting a lead-based paint inspection, and testified that a lead-based paint inspection differs from a full risk assessment because the inspection does not identify lead-based paint hazards and “typically does not have [ ] the interview that would occur because you’re really just looking for the presence or absence of lead-based paint.” Connor testified that the Arc Environmental reports were lead-paint surveys, not inspections or full risk assessments. According to Connor, the Niton machine has a depth indicator and can detect which layer or depth of the layer of lead-based paint. Connor opined that the Arc Environmental reports were unreliable because of the “lack of proper calibration checking, the lack of quality control, and a lack of evaluating the quality of the XRF test data.” The following exchange occurred between appellee’s counsel and Connor: [APPELLEE’S COUNSEL]: In this beginning of this trial Mr. Mankowitz said he believed there was lead paint in this house in 1993, do you agree with that? ... Do you agree with the opinion that Mr. Mankowitz held ... that in 1993 *651this house, 4 North Stockton, contained lead-based paint, based on everything you’ve seen in this case? [CONNOR]: The only thing I recall — may I look at my notes? ... A prior — well, it’s close. December 29th, 1993, I have in my notes that there was a Kennedy Krieger Institute Inspection, but I have it as, “No inspector, no instrument, not calibration check,” and they — that report identified positive locations. So I don’t know if that was the foundation of [Mankowitz’s] knowledge. I mean — I don’t know what — I don’t know why he would have known, but I don’t know. (Emphasis added). Connor testified that he had “no reliable evidence of lead-based paint at 4 North Stockton.” (f) The December 29, 1993, Report At the conclusion of Connor’s testimony, appellee’s counsel requested a bench conference, and the following occurred: [APPELLEE’S COUNSEL]: During the testimony of Mr. Connor, he revealed that he might have a document that reflects positive lead tests back in 1993 of 4 North Stockton. He even made reference that there was a Kennedy Krieger record. I believe this would have — based on just on my knowledge and experience — and I think that came having to do with an agreement that Mr. Mankowitz had with Kennedy Krieger, so it appears to be a document of a lead test that hasn’t been produced. We weren’t aware of it. We would ask — we would ask that Mr. Connor be directed, obviously outside of the presence of the jury, I’m not asking that, to obtain that document and provide it to both counsel and the Court as soon as possible because it may be relevant to a future motion after the trial’s over. THE COURT: Do you have the documents that were provided — do you have counsel’s copies of the documents provided to this witness? [APPELLANT’S COUNSEL]: We may have counsel’s copies. I know that I was personally the person that gave *652everyone all of the records. Pat Connor — my recollection was that they were all subpoenaed records, but we might be able — I don’t [know] whether or not we still have a copy of that CD, but I can certainly check with the staff. THE COURT: All right. During what ever passes for a lunch break you can make a call to inquire. Pm going to rely on counsel to produce the information knowing that they can get in contact with this witness. I’m not going to order the witness to produce the document. Appellee’s counsel informed the circuit court that appellant’s counsel did not have a copy of the December 29, 1993, report-referenced by Connor, and appellee had been prejudiced by the failure to produce the document. The circuit court advised that it would appreciate appellant’s counsel’s “best efforts to get the materials to [appellee’s counsel] as quickly as possible[,]” and stated that “the motion for sanctions which remains open and under advisement is necessarily going to be the subject of briefing.” After the jury had begun deliberating but before a verdict was returned, the circuit court received a letter from Parler, appellant’s counsel, via facsimile, stating as follows: We have reviewed our files and have found the document referenced by Patrick Connor in testimony. This Kennedy Krieger Institute document was contained in a City Homes file. We have confirmed that it was not produced to [appellee] in response to [appellee]’s Request for Production of Documents to [ ] Mankowitz, although it appears that it was not formally requested. I have attached a copy of the subject document as well as a copy of Barry Mankowitz’s Response to Request for Production of Documents for your review. Both [appellant] and [appellee] were working with the universe of documents which had been produced in the Response to Request for Production of Documents as the case documents. While I was unaware that this record existed in my computer files, I believe this record would have helped [appellant] because it shows no peeling lead-*653based paint, with the exception of one area on a window jam (pg. 1, under the heading “Window”). I wish to meet with the [circuit c]ourt as soon as possible to discuss this matter. Attached to the letter, Parler provided an eleven-page report titled “Kennedy Krieger Institute Spectrum Analyzer” for 4 North Stockton dated December 29, 1993. The report indicates that lead was detected on multiple surfaces, labeled as being in an “intact” condition, throughout 4 North Stockton, including on door frames, windows, and baseboards. One window jamb that was “non-intact” tested positive for lead. On September 8, 2011, prior to the return of a verdict, the circuit court briefly addressed the facsimile, noting that the Kennedy Krieger report “appear[ed] to be a very thorough analysis room by room on December 29th, 1993, and there’s some suggestion in the face of Mr. Parler’s letter that this document wasn’t formally requested by [appellee]. I just can’t imagine ... any scenario where a study of ... 4 North Stockton and the identification of lead content in any of the rooms and windows and doors in December of 1993 would not have been a critically relevant document.” (g) Jury Verdict The jury returned a verdict in favor of appellee, answering “yes” to the following four questions: (l)“[D]o you find that there was flaking, loose, or peeling paint at 4 North Stockton [] at the beginning of [appellee’s mother’s] lease in July 1993[?]”; (2) “Do you find that flaking, loose, or peeling paint at the beginning of the lease in July 1993 at 4 North Stockton [] caused lead paint poisoning to [appellee]?”; (3) “Do you find that [appellant] was negligent as owner or operator of 4 North Stockton [ ] when [appellee] resided at or visited that address[?]”; and “(4) Do you find that [appellee] sustained injury caused by [appellant’s negligence at 4 North Stockton [ ] when she resided at or visited that address[?]” The jury awarded $5,100,000 in damages to appellee, including $900,000 in economic damages for lost earning capacity and $4,200,000 in non-economic damages. *654(3) Post-Trial Proceedings (a) Motion for New Trial or to Alter or Amend the Judgment On September 14, 2011, appellant filed a “Motion for a New Trial or in the Alternative, Motion to Alter or Amend the Judgment,” requesting a new trial because Dr. Sundel “was neither qualified nor had a factual basis for his testimony” as to the source of appellee’s lead exposure, and Dr. Sundel was not qualified to testify as to the source of appellee’s alleged injuries, ie. what caused appellee’s injuries. In addition, appellant argued that: (1) the non-economic damages award must be reduced from $4,200,000 to $350,000 pursuant to the applicable statutory cap on non-economic damages; (2) the economic damages award must be reduced from $900,000 to $461,934, as Dr. Lurito testified that the present value of appellee’s future lost earning capacity and appellee only sought future lost earning capacity in the amount of $461,934; and (3) its total liability as a charitable organization could not exceed $1,000,000, the limit of its liability insurance policy. On September 19, 2011, appellant filed a “Motion for New Trial — Supplemental Submission,” asserting that it was deprived of a fair trial because Juror Number Four was not qualified to serve on the jury as a result of prior criminal convictions. On September 21, 2011, appellant filed a “Second Supplemental Submission in Support of [Its] Motion for New Trial.” In a footnote in the second supplemental submission, appellant noted that it had “issued a subpoena to the [c]ircuit [c]ourt [ ] Jury Commissioner for the executed questionnaire[ ] for [J]uror [Number Four.]” On September 29, 2011, appellant filed a “Motion for New Trial — Third Supplemental Submission or, in the Alternative, Motion for New Trial Pursuant to Md. Rule 2 — 535(c),” alleging that: “Beyond [Juror Number Four]’s statutory lack of qualifications to serve as a juror, the nature of his convictions, all drug related, rendered him both disqualified and inherently biased to consider issues related to [appellee]’s impairment due to drug use or abuse.” *655On September 30, 2011, appellee filed an opposition to the motion for new trial. Appellee contended that the issue of Dr. Sundel’s testimony was not appropriately raised in a motion for new trial as the issue had been raised and decided in connection with pretrial motions for summary judgment and in limine. On the merits, appellee contended that Dr. Sundel was qualified to testify as an expert in pediatrics and childhood lead poisoning, and that there was a strong factual basis underpinning his opinions. On October 24, 2011, appellant filed a Reply in support of its motion for new trial. (b) Motion for Judgment Notwithstanding the Verdict On September 16, 2011, appellant filed Motion for Judgment Notwithstanding the Verdict, reiterating that Dr. Sundel was not qualified to testify as to the source of lead exposure or causation, and that he did not have an adequate factual basis for his testimony. Appellant argued that “[tjhere [was] no credible evidence that [appellee] ingested lead, or was injured due to lead, from 4 N[orth] Stockton [] or that [appellee] suffered any damages.” On October 4, 2011, appellee filed an opposition to the Motion for Judgment Notwithstanding the Verdict, arguing, in pertinent part: For the fourth time in this matter, [appellant] argues that [appelleejs medical expert, Eric Sundel, M.D., lacks both the qualifications and the factual basis to offer opinions about the cause of [appellee]’s elevated blood lead levels and resulting injuries. This court has previously denied [appellant’s Motion for Summary Judgment and Motion in Li-mine on this exact issue. [Appellant] has raised the identical argument in its Motion for New Trial, which is currently pending before this Court. [Appellant] has literally “cut- and-pasted” the same argument contained in those previous three Motions. There is not a single reference to Dr. Sundel’s trial testimony. Rather, [appellant] quotes from Dr. Sundel’s deposition testimony. There is simply no new ground broken here. This Court should not reconsider this issue for a fourth time. *656(c) Motion to Quash On September 21, 2011, appellant sent a Notice to Take Deposition Duces Tecum and Subpoena to Nancy Dennis of the Office of the Jury Commissioner for the Circuit Court for Baltimore City requesting a copy of the completed jury questionnaires for the six individuals who served on the jury, including Juror Number Four. On September 30, 2011, Jury Commissioner Nancy Dennis filed a Motion to Quash Subpoena and for Protective Order. On October 24, 2011, appellant filed a “Motion to Compel Discovery and Opposition to Jury Commissioner Dennis’s Motion to Quash Subpoena and for Protective Order.” In the motion to compel, appellant alleged that Juror Number Four “was in fact not qualified to serve as a juror as a result of a long history including multiple drug-related felony criminal convictions[,]” and that it was of “paramount” importance for it to discover whether Juror Number Four had disclosed his criminal history in his jury questionnaire. On October 27, 2011, the Jury Commissioner filed an opposition to the motion to compel and a reply to the opposition to the motion to quash. (d) Motion for Sanctions On September 29, 2011, appellee filed a Motion for Sanctions, requesting that the circuit court sanction Parler. Appellee argued that Parler engaged in repeated misconduct throughout the trial. As to the seventh day of trial, appellee alleged the following facts: On the last day of trial, during the testimony of the last Defense expert, Patrick Connor, Mr. Connor disclosed that he had made a note that one of the documents that he reviewed for his testimony at trial was a lead paint test conducted by Kennedy Kr[ie]ger Institute (KKI) of the subject property, 4 N. Stockton [], while [appellee] had been residing in the property. Throughout the trial it was made known that [appellant] had a relationship with KKI and would have its tenants tested for lead. It was obvious that Mr. Connor must have received the document from [Parler] long before the trial. Mr. Connor did not have a *657copy of the lead paint test with him at trial, and [Parler] claimed to not have a copy of it either. The document was not produced to the Court until after closing arguments and during the jury’s deliberations the next morning. Upon the discovery of the existence of the lead paint test, the Court ordered [Parler] to provide a copy to the Court and [appellee]’s counsel immediately. [Parler] faxed a copy to the Court on September 8, 2011. [Appellee]’s counsel had contacted [Parler’s] office on the morning of September 8th and was told that since the jury had announced that they had reached a verdict, they were not going to fax [ ] a copy that day. Rather, [Parler] placed [appellee]’s copy in the mail on September 8th and it was not received by [appellee]’s counsel until the next day, September 9, 2011. As to the December 29, 1993, lead report, appellee argued that Parler intentionally withheld the report, and that whether flaking and chipping lead based paint existed in 4 North Stockton was a contested issue. Appellee pointed out that Parler raised “the issue of insufficient factual bases of no lead paint hazard being present in 4 N. Stockton” in various pretrial and post-trial motions, despite knowing he had the 1993 lead report that was “contemporaneous with [appellee]’s tenancy reflecting deteriorated lead based paint.” Appellee contended that, had the 1993 lead report been provided, she would not have been required to pay Arc Environmental to conduct two separate tests of 4 North Stockton nor would she have been required to retain White as an expert. Appellee attached, as exhibits to the Motion for Sanctions, invoices detailing fees and costs related to Arc Environmental totaling $10,135.45 as follows: testing for the September 2nd Report— $510; testing for the November 5th Report — $905; hourly review of reports and deposition preparation of White— $1,056.25; transcript of White’s deposition testimony— $366.70; and trial preparation and trial appearance by White, including one day’s lost revenue — $7,297.50. Appellee argued that, had she known of the report, significantly less effort would have been needed to prove exposure of [appellee] to deteriorated lead based paint. *658The factual basis for the medical expert opinions would have been substantially stronger. Chances for a settlement and the avoidance of an 8-day trial would also have possibly increased and saved the Court a substantial amount of time and expense. Appellee requested the following sanctions: In addition to the monetary reimbursement for the unnecessary expenses related to lead paint testing that was unnecessary, [appellee] is also demanding that [Parler] be ordered to pay [appellee]’s counsel for the five (5) hours it has taken to prepare and file this Motion for Sanctions. Although [appellee]’s counsel is a contingency fee attorney, a Court in Montgomery County has previously ordered payment of attorney fees at a rate of $300.00 per hour. [Appellee]’s counsel also requests that this Court impose other sanction that it deems appropriate, including, but not limited to reporting the conduct of [Parler] with Bar Counsel. WHEREFORE, [appellee] respectfully requests that this Honorable Court grant this Motion for Sanctions and: 1. Order that [Parler] is to pay [appellee]’s counsel $10,135.45 as reimbursement for unnecessary expenses; and 2. Order that [Parler] pay [appellee]’s counsel $1,500.00 for attorneys fees related to preparing this Motion; and 3. Report [Parleras conduct with Bar Counsel; and 4. For such other relief as this Court shall deem appropriate. On October 19, 2011, Parler filed an Opposition to [the] Motion for Sanctions and a Request for Hearing. Parler argued that the motion for sanctions be denied because: (1) appellee failed to attach a copy of the relevant discovery request to the motion; (2) the discovery requests propounded by appellee did not create an obligation on the part of appellant to produce the 1993 report; and (3) the failure to produce the 1993 report was inadvertent. According to Parler, after Connor’s testimony regarding the 1993 report at trial, he *659conducted an investigation and located the 1993 report as a PDF file on his computer. Parler alleged he did not know how he obtained the 1993 test report, but “the most logical explanation is that [it] was among the documents obtained from [appellant] and it was scanned onto [his] computer, but it was inadvertently not included in the notebook [of documents produced to appellee].” Parler contended that the 1993 report was not intentionally withheld, and argued that the document could have been helpful to rebut testimony about the presence of flaking paint in 4 North Stockton. As to who conducted the 1993 test, Parler alleged that the test was not performed by appellant or Mankowitz, but rather was performed by Smelgus, “who was affiliated with an independent testing company.” Parler alleged that, had appellee deposed Connor, she could have obtained a copy of the 1993 report. (e) Post-Trial Motions Hearing and Orders On October 31, 2011, the circuit court held a post-trial motions hearing. As to the motion for judgment notwithstanding the verdict as to Dr. Sundel’s testimony, the circuit court denied the motion, ruling as follows: On reviewing my trial notes in the absence of a trial transcript, I did assume the truth of the credible evidence and all inferences reasonably deduced from Dr. Sundel’s testimony. I am reminded by a couple of appellate decisions and reiterate that if there is any competent evidence, however slight, to support [appellee]’s right to recovery in this case, the motion for judgment JNOV should be denied. I denied the motion for judgment. I denied the motion in limine held sub curia. I am about to deny the motion for JNOY as to Dr. Sundel’s qualifications and causation testimony. ... [O]ne doesn’t have to be a specialist or even have personal experience dealing with a particular type of injury or medical treatment or procedure in order to qualify as an expert under [Maryland Rule] 5-702. The broad standard for what constitutes “qualified” encompasses Dr. Sundel’s experience as a pediatric hospitalist, ... along with his own training *660and reading in the area of lead poisoning. All of that renders him qualified to testify on the causal relationship between the ingestion of lead and [appelleej’s alleged injuries. So, revisiting his trial testimony, revisiting his identification of qualifications, revisiting the evidentiary support upon which he relied to address causation issues, I will deny the motion for judgment notwithstanding the verdict as to Dr. Sundel’s testimony. It may be worth reiterating ..., but the inference is raised in the motion that ... in advance of the motion in limine ... a Frye-Reed hearing should have been held to address methodology, if not qualifications of Dr. Sundel to address methodology of measuring IQ loss. I will pause to note, based on his testimony, based on the authorities that he cites, including the American Association of Pediatrics, that his reference and his reliance on IQ loss methodology in the published literature is and was reliant on relevant scientific methodology and it was reliable given the state of the literature[.] As to the motion to quash and motion to compel discovery of the juror questionnaires, ruling from the bench, the circuit court granted the motion to quash and denied the motion to compel. As to the motion for new trial on the ground that Juror Number Four was disqualified, the circuit court denied the motion, ruling that appellant had an opportunity for voir dire and that, although appellant argued there was prejudice due to Juror Number Four’s drug-related convictions “[t]here is no further explanation that has been presented ... about the nature or extent of prejudice to [appellant].” As to the motion for a new trial or to alter and amend the judgment on the ground that the non-economic damages exceeded the statutory cap, the circuit court granted the motion to amend the judgment as to the non-economic damages, reducing the award of $4,200,000 to $850,000. Concerning the economic damages, the circuit court denied the motion to alter or amend the judgment. As to the motion for a new trial on *661the ground of charitable immunity, the circuit court denied the motion, “relying on ... Maryland Code, Courts and Judicial Proceedings Article, Section 5-406.” The circuit court observed that it found “no basis, looking at the answer, to construe or contrive a charitable immunity affirmative defense in the eircumstances[.]” As to the motion for sanctions, the circuit court found that the 1993 lead test report “was relevant and disclosable[.]” The circuit court commented on Parler’s conduct, stating as follows: I will tell you that [appellee’s counsel] is correct to remind us that I said that I was appalled at the nonproduction of the Kennedy Krieger test information in December of '93. It would also be correct to say how deeply disappointed I was in Mr. Parler’s repeated failures to attend to what I refer to as the “fundamentals of trial.” It wasn’t just a question of counsel taking liberties and engaging in sharp tactics. Mr. Parler’s conduct throughout the entirety of the case was more than disappointing. Indeed, it was way over the ethical line[.] The circuit court granted, in part, and denied, in part, the motion for sanctions, noting that it granted the motion for the reasons that appeared on the record, but that it would need to examine the record further to determine the amount of the sanctions. On November 2, 2011, appellee’s counsel sent a letter to the circuit court via facsimile to “inform [the court] of a misstatement” made during the October 31, 2011, hearing, stating, in pertinent part, as follows: You may recall that I informed the Court that I believed that the December 1993 lead paint test results of 4 North Stockton [ ] were performed by Kennedy Krieger Institute and that the Kennedy Krieger Institute had an agency relationship with [appellant]. I’ve come to learn from my colleagues in the lead paint bar that Mr. Barry Mankowitz has testified in other cases that [appellant] was the one who hired Mr. Smelgus to conduct lead paint testing of the *662properties. It was Mr. Smelgus who had placed the test results on a Kennedy Krieger Institute form. So, in fact, Mr. Smelgus was a direct contractor with [appellant]. This would be consistent with the reason why [appellant] had a copy of the lead paint test results since Mr. Smelgus was a direct contractor for [appellant]. On November 10, 2011, in a letter to the circuit court, counsel for Parler advised that, after the 1993 lead paint test “came to light[,]” Parler began investigating the test “to determine if the test was in his possession and if so, how it came into his possession and why it had not been produced.” Parler’s counsel stated as follows concerning the investigation: From this investigation, [Parler] discovered that the document was in the computer version of his file, but it was not in the paper version and that his filed reflected that prior to the trial this test had not been the subject of any discussion or any correspondence between anyone in his office and Mr. Mankowitz, [appellant’s] Insurer or any of the retained experts. This is confirmed by the attached affidavits of Patrick Connor [ ] and Mr. Mankowitz [ ] in which they both confirm that prior to the conclusion of the [ ] trial, neither of them discussed the 1993 test with any attorney, paralegal or staff of [Parler’s law firm].[8] Parler’s counsel argued that the “reason why the 1993 test was not produced was not a determination that it was not *663requested in the propounded discovery, but instead due to an inadvertent human error, it had been scanned into the computer file, but it had not been copied for the paper version of the file.” Parler’s counsel alleged that the 1993 test was performed on behalf of Kennedy Krieger Institute, not appellant, and that Mankowitz “confirmed he had no memory of requesting Mr. Smelgus on behalf of [appellant] test 4 N[orth] Stockton” and Smelgus confirmed “that he was hired and paid by [Kennedy Krieger Institute], not [appellant] to perform the 1993 test.” Parler’s counsel urged the circuit court to deny the motion for sanctions because appellee “could not establish that the discovery requests” required production of a document performed at the behest of Kennedy Krieger Institute. On December 2, 2011, the circuit court issued an order resolving the post-trial motions as follows: 1. William Parler, counsel of [appellant], must return all copies of jury lists to the Courtroom Clerk ... 2. Jury Commissioner Nancy Dennis’s Motion to Quash Subpoena and for Protective Order [ ], opposed by [appellant], is GRANTED; and [Appellant’s Motion to Compel Production of Juror Questionnaires [ ] is DENIED. 3. [Appellant’s Motion for New Trial — Supplemental Submission [], Second Supplemental Submission [], and Third Supplemental Submission [ ], opposed by [appellee], are DENIED with respect to any and all allegations of error related to juror disqualification (especially as to Jurors 2 and 4). 4. [Appellant’s Motion for Judgment Notwithstanding the Verdict [ ], opposed by [appellee], is DENIED. 5. [Appellant’s Motion for New Trial [ ], opposed by [appellee], is GRANTED IN PART and DENIED IN PART, and: a. Pursuant to Maryland Courts \u0026amp; Judicial Proceedings Article § 11-108, which applies to place a $350,000 cap on any non-economic damages awarded in this case, the Motion [] is GRANTED IN PART and Judgment *664entered for [appellee] and Against [appellant] is amended to $1,250,000. b. [Appellant’s Motion [] is DENIED in all other respects. On December 5, 2011, the circuit court issued a Post Trial Sanctions Opinion and Order. In the opinion, as to Parler’s trial tactics, the circuit court found as follows: As stated above, [appellee] had to prove there was flaking lead-based paint at 4 N. Stockton [ ] when she lived there in and following 1993. The 1993 inspection report, in [appellant’s] file for 4 N. Stockton [ ], was relevant and discoverable but [appellant and Mankowitz] did not disclose these inspection records during discovery. Thus, at trial, [appellee] relied on other evidence, including Arc Environmental’s testing results, to establish the presence of lead-based and flaking paint at the property. [Appellant and Mankowitz] had sought to strike or exclude Arc Environmental’s testing results and White’s testimony at every possible stage in this litigation. With the advantage of hindsight, Parler’s game plan comes into focus. Parler deprived [appellee] of the 1993 inspection records, and would seek to discredit or strike Arc Environmental’s testimony. Without the 1993 inspections records, [appellee] would have to rely only on the Arc report and testimony about flaking paint at 4 N. Stockton [] during the relevant time period. [Appellee]’s causation expert, Dr. Sundel, did not have and could not rely on the 1993 inspection records for his testimony. [Appellee] did not have and could not rely on the 1993 report to rebut Dr. Schuelein’s testimony challenging Dr. Sundel’s causation testimony. Parler would press for settlement and threaten mud-slinging impeachment of [appellee] and her father while withholding certain records, including a 2001 psychological assessment of [appellee]. The 1993 inspection records essentially provide the nexus between three facts [appellee] absolutely had to prove: 4 N. Stockton [ ] contained lead paint, the condition of that paint *665was deteriorated (chipping, peeling, or flaking), and these conditions existed during the relevant time period (in and after 1993) when [appellee] was injured upon her exposure to lead. Parler’s tactics would allow him to provoke settlement negotiations as [appellant] held greater advantage on the courthouse steps. No one would be the wiser about any-withheld documents, especially where [appellant’s Pre-Trial Statement [] typically did not list trial documents or -witnesses. On August 26, 2011 [appellee]’s counsel informed the Court that Parler made settlement-related threats to use documents in his possession that were “extremely damaging” to [appellee] and her father. When [appellee] moved to compel production of the “damaging” documents, this Court relied on Parler’s representation that any undisclosed documents were for impeachment, only. However, the Court instructed the parties promptly to exchange lists of trial exhibits and to make copies of exhibits available to counsel. The Court also read Rules 2-402(a) and 2-401(e) in open court both to admonish Parler and to provoke Parler’s supplemental production of any substantive, recently discovered documents. (Footnote omitted). The circuit court set forth the following as to Parler’s conduct and credibility: Parler argues, conveniently, that his failure to disclose the 1993 inspection reports was a mistake. He also offers variable but dissembling arguments to justify the nondisclosure. Parler’s arguments are not credible. This is especially apparent upon revisiting early trial proceedings, which reveal a pattern of concealment, half-truths, and bad-faith behavior. For example: • On August 26, 2011, Parler denied that there had been any document requests to [appellant], and claimed that document requests had been made only to Defendant Barry Mankowitz, individually, and not as a corporate designee. Parler was wrong. *666• On August 25, 2011, [Parler] pushed [appelleej’s counsel to settle in view of a number of damaging documents challenging [appelleej’s character and family history (her father’s criminal background; her mother’s abuse appearing in school records and psychological assessment; expulsion from cosmetology school for fighting). On August 26, Parler denied that those ‘damaging’ or recently discovered documents had been the subject of any requests for production. Parler was wrong. • On August 26, 2011, Parler exclaimed that some of the ‘damaging’ documents (referring to the school reeords/psychological assessment) were public [court] records and only recently discovered. The trial court invited and afforded Parler an opportunity to provide supplemental discovery responses. Parler did not do so. Parler urged, instead, that documents describing [appellee]’s expulsion from cosmetology school, and [appelleej’s upbringing as reflected in the Circuit Court paternity/family court file, need not be produced. Furthermore, Parler represented that “there are no more City Homes documents to produce,” stating that “I have quadruple checked the requests and [the 628 page notebook of scanned documents] are all the City Homes records and relevant documents produced to [appellee].” • The trial court instructed Parler to exchange document lists and provide copies of trial exhibits to [appelleej’s counsel. On August 29, 2011, Parler blamed power outages for not doing so, then insisted, “We sent them everything [even though] we got no requests for [appellant].” Parler was wrong. The trial court had quoted and cited Rules 2-402(a) and 2-401(e) to require [appellant’s supplemental disclosure of relevant documents, broadly defined, and taking it on faith that the documents of concern were only recently discovered. Parler’s “Motion for Reconsideration” on August 29 refused the invitation. • On August 29, Parler exclaimed that “we produced everything relevant in this case.” Parler repeated his *667representation made at the discovery deposition of Barry Mankowitz, that all documents that had been at the City Homes office had been scanned, copied into his 628 page notebook, and produced. Parler was wrong. • During his opening statement to the jury (on August 26, 2011), Parler acknowledged an “affiliation” between [appellant] and Kennedy Krieger. On August 29, 2011, [appellee]’s first trial witness was Barry Mankowitz, the founder of [appellant]. Mankowitz described [appellant’s] relationship with Kennedy Krieger. Mankowitz also testified that ‘we wanted to know where the lead was’ at leased properties, that ‘we used Smelgus of Scientific Testing’ to do so, and that ‘we didn’t test all the properties.’ He further testified that We keep documentation of lead paint tests; yes, every test we made, we kept a copy for that property,’ ‘If there is no copy of test document, there was no testing.’ We did not test at 4 N. Stockton [ ], to the best of my knowledge.’ Mankowitz’s testimony was wrong, and Parler made no move to correct and produce the 1993 inspection records. • Parler made no offer to disclose the 1993 inspection report during or after his experts[’] testi[mony], or before the close of the evidence at trial. Instead, when the jury was deliberating on the morning of September 8, 2011, Parler revealed his ultimate and arrogant disdain for court orders, rules and procedures. [He] faxed [a] letter to the Court, belatedly copied to [appellee]’s counsel, dated September 8, 2011[.] ... Parler did not alleviate the Court’s disappointment or mitigate his errors in the course of post-trial motions, scheduled briefing on [appellee]’s Motion for Sanctions, or in argument at hearing. Indeed, Parler compounds his errors. For example, Parler suggests that it was [appellee]’s error not to discover the 1993 inspections records ... because of [appellee]’s failure to depose defense experts Connor or Emmett____Parler ignores his obligations pursuant to Maryland Rule 2-402(g)(l)(A). The fact that Rule 2-402 permits expert depositions does not defeat or alter *668Parler’s mandatory responsibility to disclose ‘all reports, correspondence and curriculum vitae from any expert’ as sought in [appelleej’s document request [ ], or the substance of findings and opinions, and a summary of grounds for each expert opinion, all as required by this Court’s lead paint case Scheduling Orders and Rule 2 — 402(g)(1)(A). Parler’s opposition to sanctions, distilled to its essence, simply urges that “there was not intent to deceive or withhold any duly requested documents.” [] Parler is wrong. On successive occasions and without correction, Parler misled [appellee] and her counsel, and misled this Court. Parler, at best, shirked his responsibilities under applicable rules, and mocked his professional duties. The Court must now identify appropriate sanctions for Parler’s discovery failure. Although Parler’s non-disclosure did not necessarily affect the trial result, it likely affected the manner of [appellee]’s proof of her claim, the parties’ focused attention to trial preparation, their preparation for expert testimony, and any potential resolution of [appelleej’s claims by settlement in advance of trial. Parler’s lapses and misstatements to this Court certainly affected the fairness and quality of the trial of this case. The task of addressing sanctions for non-disclosure is complicated because [appellee]^ Motion for Sanctions reasonably addresses a succession of Parler’s additional unseemly defense errors and sleazy trial tactics. The Court undertakes this task with vivid recollection of having lambasted Parler for his failure to attend to certain “fundamentals” of trial and pretrial practice (e.g., Parler’s noncompliance with Rule 2-504.2). The Court also recalls chastising Parler after he attempted to display an enlargement of an inadmissible photo during his opening statement to the jury. (Parler expected to use a photograph of 1606 Lemmon Street to imply that [appelleej’s lead paint exposure at that address may have been the cause of her injuries). This trial judge is profoundly disappointed in Parler’s now-obvious pattern of misconduct, dissembling misstatements, repeated and false assurances, and general display of *669awful example to Ms associate at trial table and other members of the bar observing his trial and pretrial conduct. (Footnotes and citation omitted) (some alterations in original). As to the amount of the sanctions, the circuit court ruled: Here, Parler failed to disclose the 1993 inspection records in response to [appelleej’s discovery requests or his expert witness designations. Witness exclusion is not a viable sanction in this case, but a Rule 2-433(a) award of [appelleej’s expenses is appropriate in the circumstances. [Appelleej’s order of proof, trial strategy, and settlement discussions would have been affected by the discovery and use of the 1993 inspection records. Instead, [appellee] was obliged to rely on Arc Environmental to conduct lead testing of the property, during litigation, and testify about the results at trial. Representations by [appellee]’s counsel and Exhibit 3 to [appelleej’s Motion for Sanctions shows that [appellee] spent a total of $10,135.45 on these services. [Appellee]’s counsel also spent untold hours addressing Parler’s successive motions to strike, and other challenges to discredit the Arc evidence. This expense and effort would have been largely unnecessary had Parler seasonably disclosed the 1993 inspection records. The Arc fees of $10,135.45 constitute “reasonable expenses ... caused by [Parler’s] failure to disclose.” Maryland Rule 2-433(a). (Ellipses and some alterations in original). As to sanctions against Parler, the circuit court ruled: Maryland courts also possess an inherent power to sanction. The inherent sanction power is not abridged or suspended by the Maryland Rules. Maryland Rule l-201(c) (“These rules shall not be construed to extend or limit the jurisdiction of any court or, except as expressly provided, the venue of actions”). In this case, Parler did not appear to engage in spoliation. He did, however, fail to disclose critically relevant and requested documents to [appellee], despite disclosing those same documents to his own experts. Parler’s conduct deprived [appellee] from using the 1993 *670documents substantively at trial, and during settlement discussion, and adversely affected the conduct of a fair trial. Parler’s misconduct interfered with the goal of the Circuit Court for Baltimore City, “to provide meaningful access to the justice system by the timely, efficient and fair processing of all cases.” During trial and pretrial proceedings, and especially with respect to the availability and use of alternative dispute resolution procedures in this Court, Parler’s unprofessional conduct to withhold critical documents interfered with the goal of this Court’s Civil Division to “provide an orderly forum for the prompt resolution of disputes.” For these reasons, the Court must sanction Parler. This Court will exercise its discretion to sanction Parler for failing to produce critical documents responsive to discovery requests, and for failing to designate and disclose the substance of findings and opinions of defense expert(s) especially as they had referred or relied, for grounds, on undisclosed records of flaking lead paint in December 1993. In determining the appropriate sanction, this Court may also look to the federal judiciary for guidance. See Klupt [v. Krongard ], 126 Md.App. 179, 194-97[, 728 A.2d 727, cert. denied, 355 Md. 612, 735 A.2d 1107 (1999) ] (affirming a Circuit Court decision that relied on White v. Office of the Public Defender, 170 F.R.D. 138 (D.Md.1997)). In Malatea [Malautea ] v. Suzuki Motor Company, Ltd., 987 F.2d 1536 (11th Cir.1993), the defendants also abused the discovery process by failing to disclose information that was clearly discoverable. Id. at 1539. The District Court judge imposed several sanctions on the defendants, including fining each defendant $5,000 and each defense attorney of record $500. Id. at 1541-42. The judge imposed these fines because he found that “Defendants’ actions have caused not only unnecessary delay and increased cost of ... litigation for the parties, but also an increased burden on the Court.” Id. at 1542. The Circuit Court affirmed these fines as a valid exercise of the District Court’s inherent authority to sanction. Id. at 1545. The Circuit Court explained that “[tjhese fines justly punished the defendants and their *671attorneys and, hopefully, will deter other litigants from engaging in similar activity.” Id. at 1546. Similarly, Parler concealed critical, relevant, and discoverable information from [appellee] in order to gain an upper hand at trial and in settlement negotiations. His actions seriously undermined the Court’s attempts at efficient dispute resolution and to conduct a fair trial. The Court will impose a $10,000 fine on Parler. (Footnotes and some citations omitted) (omission and alteration in original). In the order attached to the Post Trial Sanctions Opinion, the circuit granted the motion for sanctions, in part, as follows: ORDERED that [appellant] and [appellant’s counsel William C. Parler, Jr., are SANCTIONED, as follows: (1) [Appellant] shall pay the sum of $10,135.45 to [appellee] to compensate her for the costs of the Arc Environmental, Inc. testing at 4 N. Stockton [], consequent reporting and testimony; (2) William C. Parler, Jr., is fined the sum of $10,000, payable to the Circuit Court for Baltimore City expressly for undertaking and administering its Alternative Dispute Resolution programs. On February 3, 2012, the circuit court issued a Supplemented Post Trial Sanctions Opinion. In a footnote in the supplemented opinion, the circuit court stated as follows concerning against whom sanctions may be imposed: “Parler’s discovery violations are attributable to [appellant] through its President, Barry Mankowitz, because Parler acted as agent. Additionally, the duty to preserve and produce relevant evidence extends not only to a party’s attorney, but the party himself.” (Citations and italics omitted). (f) Notices of Appeal On November 4, 2011, appellant filed a Notice of Appeal, stating, in pertinent part, “City Homes appeals the award of attorney’s fees or sanctions for any alleged discovery violations.” On December 8, 2011, following issuance of the circuit court’s orders, appellant filed an Amended Notice of Appeal, *672stating, inter alia, that “City Homes appeals the award of attorney’s fees or sanctions for any alleged discovery violations including both the ruling from the bench at the October 31, 2011 post-trial motions hearing, granting in part and denying in part [appelleej’s Motion for Sanctions, and the Post Trial Sanctions Opinion and Order entered on December 5, 2011.” Parler signed both notices of appeal on behalf of his law firm as “Counsel for Defendant City Homes, Inc.” (g) Motion to Reconsider On December 21, 2011, Parler filed a Motion to Reconsider the Court’s Post Trial Sanctions Order and Request for Hearing. In an accompanying memorandum, Parler argued that the sanctions against him and appellant were improper. On January 9, 2012, appellee filed a motion to strike the motion to reconsider or, in the alternative, an opposition to the motion to reconsider. Appellee pointed out that appellant had filed a notice of appeal and an amended notice of appeal, thereby terminating the circuit court’s jurisdiction over the matter. On February 1, 2012, the circuit court held a hearing on Parler’s motion to reconsider and appellant’s and Mankowitz’s memorandum in support. On February 3, 2012, the circuit court issued an order dismissing the motion to reconsider, stating: For reasons stated on the Record at hearing, in view of [appellantj’s amended Notice of Appeal on December 8, 2011, and consistent with Md.Code Cts. Jud. Proc. Art. § 12-308, this Court lacks jurisdiction to substantively alter or amend its Sanctions Order upon Reconsideration. The Court of Appeals has exclusive initial appellate jurisdiction over the Sanctions Order. DISCUSSION I. Dr. Sundel’s Testimony (1) Contentions Appellant contends that the circuit court erred and abused its discretion in failing to exclude Dr. Sundel’s testimony. *673Appellant argues that Dr. Sundel is a pediatrician who lacked the necessary knowledge, skill, experience, training or education required by Maryland Rule 5-702(1) to offer an opinion as to the source of appellee’s lead exposure because Dr Sundel: (1) never diagnosed or treated a patient with lead poisoning; (2) is not a certified lead risk assessor or lead paint inspector technician; (3) conducted no investigation to determine the environmental source of appellee’s alleged lead exposure; (4) has no training in the use of the XRF machine; and (5) has no experience in testing soil and drinking water for lead. Appellant asserts that appellee’s counsel designated Dr. Sundel as an expert months before Dr. Sundel reviewed materials related to the case and formulated an opinion. Appellant maintains that the opinion — that 4 North Stockton was the source of appellee’s lead exposure and injuries — was appellee’s counsel’s opinion and not Dr. Sundel’s. Appellant contends that the circuit court erred and abused its discretion in permitting Dr. Sundel to testify as to causation — i.e. that appellee incurred injuries as a result of lead exposure at 4 North Stockton — as he lacked the qualifications to do so. Appellant argues that Dr. Sundel opined that appellant has a “cognitive deficit resulting in a loss” of IQ points, but Dr. Sundel has never administered an IQ test, does not know how to score an IQ test, and is not qualified to interpret IQ test results. Appellant asserts that, in calculating appellee’s loss of IQ points allegedly resulting from lead exposure, Dr. Sundel engaged in impermissible speculation. Appellant asserts that Dr. Sundel was not qualified to render a differential diagnosis and opine that appellee’s alleged injuries were caused by lead exposure at 4 North Stockton. Appellant contends that the circuit court erred in permitting Dr. Sundel to testify because his testimony lacked a sufficient factual basis, as required by Maryland Rule 5-702(3). Appellant argues that Dr. Sundel relied solely on Arc Environmental reports concerning lead at 4 North Stockton and other general research, and failed to conduct independent investigation and research concerning the possibility of other sources of lead poisoning, appellee’s medical and social history, or other *674potential causes for a cognitive deficit. Appellant maintains that Dr. Sundel lacked an adequate factual basis upon which to conclude that appellee suffered injury due to lead exposure at 4 North Stockton “given that there were so many other potential sources” of lead exposure. Appellee responds that an expert’s knowledge may come from a variety of sources, and that an expert need not be a specialist in a particular field nor be personally involved in the activity for which he is testifying. Appellee contends that Dr. Sundel’s knowledge was derived from his experiences and observations as a medical student and pediatrician, as well as his review of medical journal articles concerning lead poisoning. Appellee argues that “Dr. Sundel’s experience, as demonstrated through his discovery deposition and curriculum vitae, as well as his review of [her] relevant medical records, created the requisite basis necessary for him to offer causation and injury opinions[.]” Appellee contends that Dr. Sundel based his opinions on blood lead level readings taken during the time she resided at 4 North Stockton, the age of the property, reports by other experts, lead testing conducted at 4 North Stockton, and appellee’s residence history. Specifically, appellee argues that Dr. Sundel’s testimony was supported by an adequate factual basis consisting of the following information: (1) appellee visited or resided in 4 North Stockton from 1990 to 2002; (2) appellee’s blood lead levels rose to 21 |xg/dL after residing in 4 North Stockton for one year and remained elevated through 1998; (3) 4 North Stockton was built during or before 1920, and was more likely to contain lead-based paint; (4) appellee visited or resided 4 North Stockton at times when there was flaking and chipping paint, as appellee’s father testified to during deposition; and (5) Arc Environmental lead testing revealed lead paint in both the interior and exterior of 4 North Stockton. Appellee contends that trial courts have routinely permitted experts, such as Dr. Sundel, to testify whether a property is more likely than not a source of lead exposure. Appellee argues that she was not required to prove a single source of lead exposure or a single cause for her injuries. *675In a reply brief, appellant contends that the objection to Dr. Sundel was not “that he is a pediatrician or that medical experts cannot be used in lead paint cases, but that Dr. Sundel was not qualified and did not have the requisite factual basis upon which to base his opinion.” Appellant reiterates that Dr. Sundel failed to consider that appellee lived at and visited other homes during the same time period that her blood lead levels were elevated, and that one of the other residences may have been a source of appellee’s lead exposure. Appellant asserts that Dr. Sundel failed to consider other environmental sources of lead, such as water and soil. Appellant maintains that Dr. Sundel provided no testimony that would have assisted the jury with “weighing the impact of [ajppellee’s exposure at 4 N. Stockton Street (if any) with other sources of lead exposure.” (2) Standard of Review In Taylor v. Fishkind, 207 Md.App. 121, 137, 51 A.3d 743 (2012), this Court explained the standard of review for the admissibility of expert testimony as follows: [T]he admissibility of expert testimony is a matter largely within the discretion of the trial court, and its action in admitting or excluding such testimony will seldom constitute a ground for reversal. Therefore, [w]e review these types of evidentiary rulings pursuant to the abuse of discretion standard, reversing only when the court exercise[d] discretion in an arbitrary or capricious manner or ... act[ed] beyond the letter or reason of the law. (First alteration added) (omission in original) (citations and internal quotation marks omitted); see also Wantz v. Afzal, 197 Md.App. 675, 682, 14 A.3d 1244, cert. denied, 420 Md. 463, 23 A.3d 895 (2011) (“[I]t is well-settled that ‘the determination by the trial court of the experiential qualifications of a witness will only be disturbed on appeal if there has been a clear showing of abuse of the trial court’s discretion.’” (Citation omitted)); Brown v. Contemporary OB/GYN Assocs., 143 Md.App. 199, 252, 794 A.2d 669, cert. denied, 369 Md. 659, 802 A.2d 438 (2002) (“The trial court’s determination [to admit *676expert testimony] is reversible [only] if it is founded on an error of law or some serious mistake, or if the trial court clearly abused its discretion.” (Citation and internal quotation marks omitted) (second alteration in original)). (3) Law Maryland Rule 5-702, governing testimony by experts, provides: Expert testimony may be admitted, in the form of an opinion or otherwise, if the court determines that the testimony will assist the trier of fact to understand the evidence or to determine a fact in issue. In making that determination, the court shall determine (1) whether the witness is qualified as an expert by knowledge, skill, experience, training, or education, (2) the appropriateness of the expert testimony on the particular subject, and (3) whether a sufficient factual basis exists to support the expert testimony. In Giant Food, Inc. v. Booker, 152 Md.App. 166, 182, 831 A.2d 481, cert. denied, 378 Md. 614, 837 A.2d 926 (2003), this Court explained that Maryland Rule 5-702 “delineates three factors a court must evaluate for the admission of expert testimony: (1) an expert must be qualified (Rule 5-702(1)); [ (2) ] the expert testimony must be appropriate for the particular subject (Rule 5-702(2)); and (3) a sufficient factual basis must exist to support that testimony (Rule 5-702(3)).” In Radman v. Harold, 279 Md. 167, 167-68, 367 A.2d 472 (1977), a medical malpractice case, the Court of Appeals held that the trial court improperly refused to allow “an expert witness to express an opinion regarding the manner in which the defendant surgeon rendered his professional services.” In Radman, id. at 168, 367 A.2d 472, Radman, a gynecologist and surgeon, performed a total abdominal hysterectomy upon Harold, and while doing so, unintentionally knicked Harold’s bladder, causing her to undergo two additional procedures in order to repair the bladder. At trial, Harold proffered an internal medicine specialist as an expert witness qualified to testify as to the standard of care required of a surgeon *677performing a hysterectomy. Id. The trial court ruled that the internal medicine specialist lacked the necessary qualifications to testify. Id. In Radman, id. at 169, 367 A.2d 472, the Court of Appeals stated that case law stood for the proposition that “a witness may be competent to express an expert opinion if he is reasonably familiar with the subject under investigation, regardless of whether this special knowledge is based upon professional training, observation, actual experience, or any combination of these factors.” The Court of Appeals expressed the “classic formulation” concerning expert qualification as follows: It is a familiar rule of evidence that a witness, in order to qualify as an expert, should have such special knowledge of the subject on which he is to testify that he can give the jury assistance in solving a problem for which their equipment of average knowledge is inadequate. It is sufficient if the court is satisfied that the expert has in some way gained such experience in the matter as would entitle his evidence to credit. It is not a ground for excluding the testimony of an expert that he bases his statements in whole or in part upon what he has read, provided that his reading can be assumed to constitute part of his general knowledge adequate to enable him to form a reasonable opinion of his own. A witness is qualified to testify as an expert when he exhibits such a degree of knowledge as to make it appear that his opinion is of some value, whether such knowledge has been gained from observation or experience, standard books, maps of recognized authority, or any other reliable sources. The knowledge of an expert in any science or art would be extremely limited if it extended no further than inferences from happenings within his own experience. His testimony is admitted because it is based on his special knowledge derived not only from his own experience, but also from the experiments and reasoning of others, communicated by personal association or through books or other sources. *678Id. at 169-70, 367 A.2d 472 (citations omitted). The Court of Appeals observed that “the mere fact that a person offered as a witness has not been personally involved in the activity about which he is to testify does not, as such, destroy his competency as an expert.” Id. at 170, 367 A.2d 472. The Court of Appeals affirmed this Court’s reversal and remand of the case, observing that the trial court needed to determine whether Harold’s expert, based on his overall familiarity with the hysterectomy procedure, was qualified to testify as an expert. Id. at 176, 367 A.2d 472. In Giant Food, 152 Md.App. at 171, 831 A.2d 481, we held that “although [the] medical expert was qualified to render an opinion ... the expert’s testimony lacked a sufficient factual basis, and the opinion was not the product of reliable principles and methods.” As such, the circuit court erred in denying the defendants’ motions for judgment and for judgment notwithstanding the verdict. Id. at 169, 190, 831 A.2d 481. Booker was exposed to Freon gas while employed at Giant Food and approximately fourteen months later, was diagnosed with adult on-set asthma. Id. at 169, 831 A.2d 481. Booker filed a claim alleging that exposure to Freon caused his asthma. Id. at 169-70, 831 A.2d 481. At trial, Booker’s medical expert “conceded that he had never read about, nor knew of, asthma being caused by exposure to Freon[,]” yet the expert testified that the exposure to Freon caused Booker’s asthma. Id. at 176, 178, 831 A.2d 481. In Giant Food, id. at 182-83, 831 A.2d 481, in examining Maryland Rule 5-702(3) and the use of expert testimony, we explained: [S]imply because a witness has been tendered and qualified as an expert in a particular occupation or profession, it does not follow that the expert may render an unbridled opinion, which does not otherwise comport with Md. Rule 5-702. “No matter how highly qualified the expert may be in his field, his opinion has no probative force unless a sufficient factual basis to support a rational conclusion is shown.” An expert’s opinion testimony must be based on a[n] adequate factual basis so that it does not amount to “conjecture, *679speculation, or incompetent evidence.” Furthermore, the testimony must also reflect the use of reliable principles and methodology in support of the expert’s conclusions. (Citations omitted). After reviewing Booker’s expert’s testimony, we stated: “Despite having been qualified as an expert in pulmonary medicine, [the expert’s] testimony regarding the cause-and-effect relationship does not rise above the level of mere speculation or conjecture. A review of [the expert’s] deposition testimony highlights the absence of an adequate factual basis, as well as an unsupportable methodology for his conclusions[.]” Id. at 185, 831 A.2d 481. We noted that the expert had little factual information about the Freon incident, “did not rely on a single medical or scientific study suggesting a causal relationship between Freon exposure and asthmaf,]” had not reviewed Booker’s full medical records, and that it was “clear that [the expert] did not conduct an exhaustive medical textbook or journal review.” Id. at 174, 187, 189, 831 A.2d 481. As such, “a juror could not reasonably find that the [Freon] incident ... caused Booker’s adult on-set asthma when [the expert’s] theory provided no rational explanation for why that had occurred, other than simply coming to that conclusion.” Id. at 189-90, 831 A.2d 481. In Wantz, 197 Md.App. at 678, 14 A.3d 1244, this Court held that the trial court abused its discretion in precluding the plaintiffs witnesses from testifying as experts on the ground that the witnesses lacked qualifications and a factual basis. In Wantz, id. at 677-78, 14 A.3d 1244, the plaintiffs mother died after developing a staph infection at the site of spinal fusion surgery. Prior to trial, the defendants filed motions to exclude three experts designated by the plaintiff, arguing that none of the witnesses were qualified to express an opinion as to causation. Id. at 678, 14 A.3d 1244. The trial court granted the defendants’ motions, finding that the three experts were either unqualified, or lacked a sufficient factual basis, or both, to offer expert testimony and opinion pursuant to Maryland Rule 5-702. Id. *680In Wantz, as to Maryland Rule 5-702(1), concerning a witness’s qualifications to offer expert testimony, we quoted with approval from Radman that an expert’s special knowledge on a subject “may be derived from ‘observation or experience, standard books, maps of recognized authority, or any other reliable sources[.]’ ” Id. at 683, 14 A.3d 1244. We reiterated that a medical expert “ ‘need not be a specialist in order to be competent to testify on medical matters,’ and qualify under Rule 5-702.” Id. at 685, 14 A.3d 1244 (citation omitted). As to Maryland Rule 5-702(3)’s requirement that an expert have a sufficient factual basis for his or her testimony, we observed that “there is a broad range of sources capable of forming the requisite factual basis[,] ... such as facts obtained from the expert’s first-hand knowledge, facts obtained from the testimony of others, and facts related to an expert through the use of hypothetical questions.” Id. at 684, 14 A.3d 1244 (citation and internal quotation marks omitted). We stated that “ ‘an expert’s opinion must be based on a[n] adequate factual basis so that it does not amount to conjecture, speculation, or incompetent evidence.’ ” Id. at 691, 14 A.3d 1244 (quoting Giant Food, 152 Md.App. at 182-83, 831 A.2d 481) (alteration in original). Accordingly, based on our review of the plaintiffs expected evidence and in light of Maryland Rule 5-702, we held that the three experts were qualified and had, “by virtue of their background and knowledge of matters pertinent to th[e] case, a sufficient factual basis on which to opine on the issue of causation. The witnesses had substantial training and experience, over many years, and had reviewed materials pertinent to th[e] case.” Id. at 684, 14 A.3d 1244. In Taylor, 207 Md.App. at 123, 141-42, 51 A.3d 743, a lead paint case, we held that the trial court did not abuse its discretion when it excluded the plaintiffs medical expert’s testimony as the expert’s opinion that the subject property “contained lead-based paint [was] only supported by the age of the house and the presence of lead on one component of the exterior of the house.” We further held that “the only evidence that [the plaintiff] was exposed to lead [at the property] *681was her elevated blood lead level while living at that property.” Id. at 142, 51 A.3d 743. The plaintiff resided at one property for approximately two and one-half years before moving to the property at issue, where she lived for just over a year before moving to a third property, where she resided for ten years. Id. at 125, 51 A.3d 743. On three different occasions spanning five years, the plaintiffs blood lead levels were elevated when tested, two of which occurred while living in the property. Id. at 125-26, 51 A.3d 743. The plaintiff designated a doctor — a pediatrician — as one of her expert witnesses, stating that the doctor would opine that the plaintiff experienced permanent brain damage and a loss of IQ points as a result of lead exposure, and that the doctor’s opinions were based “upon her review of the medical, environmental and school records related to th[e] case[,] ... the numerous medical studies that link cognitive deficiencies and IQ loss to early childhood lead exposure!, and] her medical education, training and experience!.]” Id. at 126, 51 A.3d 743. A lead paint test conducted during discovery demonstrated that only an exterior window apron on the front of the property, with intact paint, tested positive for the presence of lead-based paint. Id. at 128-29, 51 A.3d 743. The doctor submitted a “causation report” offering the opinion that the plaintiff was exposed to lead at the first two properties she resided in, and basing her opinion on “the age of the dwellings, the described conditions of the [property], the detection of lead in an exterior window apron of this [property] and [the plaintiffj’s blood lead levels while living at each dwelling.” Id. at 129-30, 51 A.3d 743. The doctor further stated that the dwellings were located in an area “known to contain lead paint” and of an age “to most probably contain lead based paint.” Id. at 130, 51 A.3d 743. At her deposition, the doctor admitted that there was no blood lead level data for a period of a year and a half immediately preceding and following the time when the plaintiff moved into the property. Id. at 131, 51 A.3d 743. The doctor was unable to state whether the plaintiffs blood lead level rose while residing in the property, acknowledging that the “only thing *682[she] kn[e]w is that [the plaintiff] was living there when it was found to be up.” Id. at 132, 51 A.3d 743. The doctor agreed that the fact that the plaintiff had an elevated blood lead level while residing at the property was not proof that she was exposed to lead at the property as the lead could have been in her body “from some other source prior to the time that she moved in[.]” Id. at 133, 51 A.3d 743. Throughout the deposition, the doctor responded “I don’t know” when asked questions by the defendant’s counsel. Id. at 131-33, 51 A.3d 743. After the deposition, the defendant filed a motion for summary judgment, arguing that the doctor’s testimony was inadmissible because she lacked an adequate factual basis to support her opinion that the plaintiff was exposed to lead-based paint at the property. Id. at 133, 51 A.3d 743. After a hearing, the trial court granted the motion, ruling that the doctor lacked an adequate factual basis to say with “a reasonable degree of medical certainty that [the property] was a substantial factor in contributing to Plaintiffs injury, nor is there a basis to say that [the property] was a lead source.” Id. at 136, 51 A.3d 743. In Taylor, id. at 142, 51 A.3d 743, we agreed and concluded that the trial court properly found that the “circumstantial evidence” supporting the medical expert’s opinion “amounted to no more than a possibility that [the plaintiff] was exposed to lead-based paint” at the property. Of significance was the expert’s inability to rule out other sources of lead or to conclude that the plaintiffs blood lead level rose while living at the property. Id. Notably, the plaintiff had alleged that she was exposed to lead-based paint at two properties, and there was insufficient evidence to prove that the property at issue in the case was the only possible source, especially in light of the medical expert’s deposition testimony that the plaintiffs elevated blood lead level at the property “could have been the result of lead that was already in her body from a source prior to when she moved to” the property. Id. at 146, 51 A.3d 743. As to the age of the property, this Court stated that age alone is not enough to support a conclusion that a house contains lead-based paint as there is no presumption that old houses *683contain lead-based paint. Id. at 143, 51 A.3d 743 (citation omitted). Indeed, we noted: “ ‘[T]he mere fact that most old houses in Baltimore have lead-based paint does not mean that a particular old Baltimore house has a similar deficiency.’ ” Id. (quoting Davis v. Goodman, 117 Md.App. 378, 393, 700 A.2d 798 (1997)). Ultimately, we held as follows: In light of the facts before the circuit court, we cannot conclude that it abused its discretion when it ruled that [that doctor’s] testimony was inadmissible because she lacked an adequate factual basis to support her conclusion that [the plaintiff] was exposed to lead-based paint at [the property]. [The doctor] testified at her deposition that she did not know if [the plaintiff’s blood lead level rose while she lived at [the property], and that it was possible that [the plaintiff’s elevated blood lead level, when she moved to [the property], was the result of a prior exposure. In fact, [the plaintiff’s complaint alleges that she had a prior exposure to lead-based paint at [another property]. Additionally, [the plaintiff’s only evidence that [the property] contained lead-based paint was the age of the house and the presence of lead on one component of the exterior of the house. We conclude that, on the basis of [the doctor’s testimony and the facts before the circuit court, a reasonable person could find that [the plaintiff’s injuries could have been caused by exposure to lead-based paint at [the other property] rather than at [the property]. Therefore, the circuit court did not abuse its discretion in excluding [the doctor]’s testimony. Id. at 147-48, 51 A.3d 743. See also N.B.S., Inc. v. Harvey, 121 Md.App. 334, 339-41, 709 A.2d 162 (1998) (We held that the trial court did not abuse its discretion in excluding the defendant’s expert in a lead paint case where the expert had retired ten years prior to trial — during which “medical research in the field of lead poisoning had advanced substantially” — and “was unable to point to a single medical doctor currently practicing medicine or involved in such research who would agree with her view of the effects of lead poisoning.”); Pepper v. Johns Hopkins Hosp., 111 Md.App. 49, 77, 680 A.2d 532 (1996), aff'd, 346 Md. 679, 697 A.2d 1358 (1997) (We held *684that the trial court did not abuse its discretion in not allowing the plaintiffs expert to express an opinion as to a child’s life expectancy where the expert had never examined the child, had never managed a three-month-old child’s care after open-heart surgery, had never performed the surgery at issue, and had not handled pediatric cases in the past ten years.). (4) Analysis (a) Maryland Rule 5-702(1) — Qualified as an Expert Returning to the instant case, we conclude that the circuit court abused its discretion in failing to exclude Dr. Sundel’s testimony. For the reasons explained below, we agree with appellant that Dr. Sundel was not qualified to testify as an expert with a concentration in childhood lead poisoning, or to offer an opinion as to the source of appellee’s lead exposure or as to causation, i.e. that appellee incurred injuries as a result of lead exposure, and that there was an insufficient factual basis for the testimony. In an abuse of discretion, the circuit court found that Dr. Sundel was qualified to testify as an expert with a concentration in “childhood lead paint” by virtue of “his special knowledge derived not just, or not only, from his own experience but also from the experiments and reasoning of others, communicated by personal association or through books or other sources.” A review of the record, with respect to Dr. Sundel’s qualifications, however, reveals that, although he is a board-certified pediatrician licensed to practice medicine in Maryland, he has not received any specialized training nor does he have any experience in treating children with lead poisoning or in identifying the source of a child’s lead exposure. During voir dire, Dr. Sundel testified that his only experience in evaluating and treating children with lead poisoning occurred during his internship and residency. Although Dr. Sundel testified children suffering elevated blood lead levels would be treated with chelation therapy, in which a medication is administered intravenously to remove lead from the body, Dr. Sundel acknowledged that his only involvement with chelation *685therapy occurred during the mid-1980s when he was a resident. Dr. Sundel could not recall being involved with any children receiving chelation therapy since that time. Dr. Sundel acknowledged that he has not evaluated and diagnosed children with lead poisoning, or monitored the progress of children diagnosed with lead poisoning. Indeed, when asked whether he has ever treated a child for symptoms related to lead ingestion where he “determined that the child was injured or had some issues related in any way to lead[,]” Dr. Sundel responded: “Not that I recall.” Dr. Sundel has never testified as an expert in a lead paint poisoning case, has never been involved in any Baltimore City tests of drinking water and soil for lead nor involved in any Maryland Department of the Environment studies on lead in the soil, and acknowledged that he is not a certified lead risk assessor. In fact, Dr. Sundel testified that appellee’s case was his first lead paint case and the first time he ever had his deposition taken. Dr. Sundel acknowledged that he has not published any articles related to lead, been involved in any studies related to lead, or delivered lectures on the topic of lead or lead ingestion. Dr. Sundel testified that, as a pediatrician, he keeps current on childhood lead poisoning issues and is familiar with articles from the CDC and AAP as well as Nelson’s Textbook on Pediatrics. Significantly, though, during deposition, when asked for the names of the articles he had read or reviewed concerning lead poisoning, Dr. Sundel was unable to recall the names of any articles. Dr. Sundel testified that pediatricians are trained to inquire about the potential sources of lead exposure. Dr. Sundel failed, nonetheless, to identify a single instance in which he had determined the source of a child’s lead exposure. Dr. Sundel admitted that he could not recall having performed a differential diagnosis on a pediatric patient in which he had determined that the symptoms were due to lead ingestion. Most troubling are Dr. Sundel’s qualifications to render opinions concerning causation — for example, that appellee sus*686tained an IQ loss of seven to ten IQ points and that lead exposure was a substantial contributing factor to appellee’s “brain impairment[.]” Dr. Sundel admitted that he is not a board-certified psychologist or neuropsychologist, and that he does not administer IQ or achievement tests. Dr. Sundel conceded that he had not conducted a medical or nutritional history of appellee nor had he examined appellee. On cross-examination, Dr. Sundel admitted that, during deposition, he testified that appellee had lost three to five IQ points or four to ten IQ points. Dr. Sundel acknowledged that he does not know how to score an IQ test, and did not know the standard of error for the Weschler IQ test. Based on the record, it is patently clear that Dr. Sundel was simply not qualified to testify as to appellee’s IQ or the loss of IQ points resulting from lead exposure or any alleged “brain impairment.” From the record and Dr. Sundel’s testimony, we discern no basis on which to conclude that Dr. Sundel had specialized knowledge concerning childhood lead poisoning, and specifically, the determination of the source of a child’s lead exposure and causation. Rodman, 279 Md. at 169, 367 A.2d 472 (“[T]o qualify as an expert, [the witness] should have special knowledge of the subject on which he is to testify that he can given the jury assistance in solving a problem for which their equipment of average knowledge is inadequate.”). Nothing about Dr. Sundel’s work generally as a pediatrician leads to the conclusion that he was qualified to render the expert opinions he offered in this case on diminishment of IQ, causation, source of lead exposure, and brain impairment. We acknowledge that a witness need not be personally involved in the activity about which he or she is to testify, and that a witness may become qualified through “observation or experience, standard books, ... or any other reliable sources.” Id. at 170, 367 A.2d 472. The record fails to substantiate that Dr. Sundel possessed specialized knowledge about lead poisoning from either his own observation, or any experience or training — which was extremely bare and lacking as to lead poisoning. Indeed, other than reviewing the limited records provided to him by appellee’s counsel and stating that he was *687generally aware of certain publications — the names of which he could not recall when asked at deposition — Dr. Sundel did not identify any studies, publications, or sources that he relied upon in forming his opinions. As such, Dr. Sundel had no greater basis than any person would have had to determine the nature and extent of appellee’s alleged lead exposure at 4 North Stockton. The circuit court abused its discretion in admitting Dr. Sundel as “an expert pediatrician, especially with the concentration or including the concentration on his research and experience in childhood lead paint because his testimony is reflective of his special knowledge!.]” Simply put, the record does not support this finding. (b) Maryland Rule 5-702(3) — Sufficient Factual Basis Similarly, we conclude that the circuit court abused its discretion in permitting Dr. Sundel to testify because the record demonstrates that he lacked a sufficient factual basis for his opinions, as required by Maryland Rule 5-702(3). In Wantz, 197 Md.App. at 684, 14 A.3d 1244, this Court observed that “there is a broad range of sources capable of forming the requisite factual basis!,] ... such as facts obtained from the expert’s first-hand knowledge, facts obtained from the testimony of others, and facts related to an expert through the use of hypothetical questions.” (Citations and internal quotation marks omitted). The question before us is whether Dr. Sundel had an adequate factual basis to testify that: the property at 4 North Stockton was the source of appellee’s lead exposure, appellee sustained an IQ loss of seven to ten IQ points based on exposure to lead, and lead exposure at 4 North Stockton was a substantial contributing factor to injuries appellee sustained, such as IQ loss, aggressiveness, hyperactivity, and brain impairment. We conclude that Dr. Sundel lacked the requisite factual basis for this testimony and explain. Dr. Sundel was not a treating physician, but rather was retained to review records and provide an opinion as to source and causation. Dr. Sundel had limited knowledge of appellee’s medical history, appellee’s current medical condition, or appel*688lee’s potential exposure to lead from other sources. Dr. Sundel indicated that he had not seen or questioned appellee or her family, and thus, his factual basis in the case boils down to his review of the records provided to him by appellee’s counsel, appellee’s trial testimony, and his knowledge obtained from his experience and training. Dr. Sundel opined that, based on the Arc Environmental reports, 4 North Stockton was a source of appellee’s lead exposure.9 Dr. Sundel failed entirely, however, to consider the other properties where appellee visited and resided during her childhood, failing to rule out those other properties as well as environmental *689sources of lead such as the water and soil at 4 North Stockton or elsewhere as sources of lead exposure. A significant fact, not lost on this Court, is that Dr. Sundel acknowledged at trial that his opinion was disclosed in an expert designation letter of April 12, 2010, months before he received any materials related to the case or had an opportunity to formulate any opinion. As such, it is readily apparent that Dr. Sundel proceeded from the beginning on the assumption that 4 North Stockton was a source of appellee’s lead exposure, rather than proceeding from the position that appellee was exposed to lead and searching for sources, ruling out possible alternatives as he went along. In this case, appellee amended the complaint to identify other sources of lead exposure, including 6 North Stockton and 1606 Lemmon.10 Appellee contended she “visited the property located at 6 N. Stockton [owned by appellant] from approximately 1990 to approximately 1998.” No information was provided to Dr. Sundel about lead at the property. As in Taylor, 207 Md.App. at 146, 51 A.3d 743, appellee’s elevated blood lead levels “could have been the result of lead that was already in her body from a source prior to when she moved to” 4 North Stockton. Dr. Sundel failed to investigate other potential sources — ie. to determine whether lead had been found in other residences in which appellee had lived or visited — to gain insight into whether 4 North Stockton was a source of appellee’s lead exposure. Dr. Sundel lacked an adequate factual basis to offer opinions concerning appellee’s alleged loss of IQ points, aggressiveness, hyperactivity, and brain impairment. As to the loss of IQ points, although Dr. Sundel testified that he arrived at his opinion — that appellee sustained a loss of seven to ten IQ points as a result of lead exposure — based on his review of documents, including an IQ test report completed by a different doctor, and his knowledge and training, it is evident that Dr. Sundel’s testimony amounted to no more than speculation *690based on articles he read that correlated diminished IQ with lead exposure. When questioned as to how he arrived at the range of a loss of seven to ten IQ points, Dr. Sundel testified: So, the studies, there are many studies now that show loss of IQ points with lead. I think the exact number of points, there’s some variation____ So for every additional ten micrograms per deciliter of elevated blood lead level, the loss of IQ points is somewhere around one to, one to four, one to five, something in that range.... So it seems that [appellee’s] loss of IQ points would be somewhere, seven from the first ten micrograms per deciliter and then an additional few points above that, potentially even more, I’m, I feel I’m potentially being a little conservative and potentially there’s a loss of more than seven to ten IQ points. Thus, in addition to not being qualified to testify as to appellee’s alleged loss of IQ points, the above testimony demonstrates that Dr. Sundel lacked an adequate factual basis for the testimony, i.e. his opinion that appellee sustained a loss of seven to ten IQ points was pure conjecture based upon general literature. As to the aggressiveness, hyperactivity, and brain impairment that Dr. Sundel attributed to lead exposure, the record reflects that Dr. Sundel reviewed psychological assessments, indicating appellee has an impairment of the brain, and school reports conducted and prepared by others, which indicated that appellee had “general behavioral problems, social skills, picking on others, aggressiveness, and fighting with others.” Based on this information, Dr. Sundel opined that appellee had aggressiveness, hyperactivity, and a brain impairment, and that lead exposure at 4 North Stockton was a substantial contributing factor to the conditions. Significantly, Dr. Sundel failed to offer any basis for his opinion that lead exposure at 4 North Stockton was a substantial contributing factor to the conditions. For example, when asked whether he had an opinion “within a reasonable degree of medical probability as to whether the exposure at 4 North Stockton [] was a substantial contributing factor to [appellee’s] brain impairment[,]” Dr. Sundel responded “I do.” When asked what that *691opinion was, Dr. Sundel testified: “That it was a substantial, the lead exposure was a substantial contributing factor. From [ ] testing, again, there was significant, there was significant cognitive regarding IQ. There was, there were problems in areas involving auditory and visual memory.” In essence, when asked for his opinion, Dr. Sundel simply described the injuries and failed to provide any basis underlying the opinion — in other words, his testimony amounted to a “ ‘because I think so,’ or ‘because I say so,’ situation.” Giant Food, 152 Md.App. at 188, 831 A.2d 481. For all of the reasons discussed above, we conclude that the circuit court abused its discretion in permitting Dr. Sundel to testify as an expert as Dr. Sundel was not qualified and lacked a sufficient factual basis for his testimony as required under Maryland Rule 5-702(1) and (3). II. White’s Testimony In light of our conclusion as to Issue I, we need not address Issue II. We make the following observations, however, for guidance. Although we do not necessarily agree with appellant that White was not qualified to testify as an expert in the field of lead risk assessment and inspection, we note that there were troubling aspects concerning the admission of White’s testimony. We observe that, at trial, White’s expert testimony veered dangerously close to fact testimony — namely, White testified as to how Wilton used the XRF machine during lead testing at 4 North Stockton and how Wilton conducted lead testing, circumstances about which White would have no personal knowledge. Although White may have possessed knowledge about how an XRF machine is generally used during lead testing and how lead testing is generally conducted, as White was not present during the testing at 4 North Stockton and Wilton’s testing data contains no information about how the tests were performed, White was unable to testify about how Wilton actually performed the tests. White’s testimony as to *692how Wilton performed a testing impressed us as exceeding the permissible bounds of expert opinion and entering the arena of fact testimony. Had appellee sought to elicit information as to how the XRF machine was used at 4 North Stockton or how testing was performed at 4 North Stockton, Wilton or another witness with knowledge of those facts was required to testify. There is no dispute that an expert “may give an opinion based on facts contained in reports, studies or statements from third parties if the underlying material is shown to be of a type reasonably relied upon by the experts in the field.” Milton Co. v. Council of Unit Owners of Bentley Place Condo., 121 Md.App. 100, 120, 708 A.2d 1047 (1998), aff'd, 354 Md. 264, 729 A.2d 981 (1999); see also Keene Corp. v. Hall, 96 Md.App. 644, 660-61, 626 A.2d 997, cert. granted, 332 Md. 741, 633 A.2d 102 (1993) (“[Although an expert witness must base his opinion on facts in evidence, those facts need not be ascertained by him through physical examination of a patient but rather may be ‘facts contained in reports or examinations by third parties.’ An expert may therefore extrapolate from data and facts contained in others’ reports and studies in order to form his expert opinion.... ‘[T]he facts upon which an expert bases his opinion must permit reasonably accurate conclusions as distinguished from mere conjecture or guess.’ ” (Citations omitted)). That White was not present for testing at 4 North Stockton and, instead, relied upon testing data provided by Wilton in formulating his opinion does not present a problem. An expert’s creation of a factual basis for his testimony — i.e. White providing information about the manner in which Wilton performed testing — is, however, not permissible. VI. Post-Trial Sanctions against Appellant Appellant contends that the circuit court’s imposition of sanctions violated due process as it was “not on notice that it was subject to being sanctioned, and, as a result, [ ] did not have an opportunity to present a defense to the claim that *693sanctions against it [were] warranted.” Appellant argues that appellee sought sanctions against Parler only, and, therefore, it (appellant) did not file an opposition or present any argument at the hearing concerning the motion for sanctions. Appellant asserts that the circuit court may impose sanctions against a party only after the party is given notice and an opportunity to be heard, which did not occur. Appellee responds that the sanctions issued against appellant are not properly before this Court for appellate review. Appellee argues that the sanctions award, issued after the entry of judgment, was not included in the judgment. In support of this argument, appellee asserts that appellant filed a motion for reconsideration of the sanctions after it filed the notice of appeal, and that the circuit court improperly dismissed the motion for reconsideration. As to the merits, appellee concedes that she did not move for sanctions against appellant, but argues that reimbursement for her expenses for Arc Environmental’s services constitutes an appropriate sanction that should have been assessed against Parler, not appellant. We are satisfied that the circuit court abused its discretion as to the imposition of sanctions against appellant. On brief, appellee acknowledged that it never requested sanctions against appellant. At oral argument, appellee stated that it would leave the issue of the propriety of the entry of sanctions against appellant to this Court’s discretion. Sanctions were imposed against appellant for $10,135.45, the expenses appellee incurred in retaining Arc Environmental, when lead testing of 4 North Stockton had already been performed and documented in the December 29, 1993, report. Although, on brief, appellee argued the issue of sanctions against appellant is not properly before the Court, the matter has been fully briefed by the parties, and the parties agree that appellee did not request sanctions against appellant. In the circuit court, appellant had no notice that the court might impose sanctions. See Griffin v. Bierman, 403 Md. 186, 197, 941 A.2d 475 (2008) (“ ‘An elementary and fundamental requirement of due process in any proceeding which is to be accorded finality is *694notice reasonably calculated, under all the circumstances, to apprize interested parties of the pendency of the action and afford them an opportunity to present their objections.’” (Citation omitted)). It is pellucid that sanctions may not be imposed against a party without notice. We reverse the sanction of $10,135.45 against appellant. VII. Post-Trial Sanctions against Parler (1) Contentions Appellant contends that the circuit court improperly sanctioned Parler for an alleged discovery failure. Appellant argues that the circuit court does not have unlimited inherent authority “to issue punitive sanctions without following proper procedures.” Appellant asserts that the case law relied on by the circuit court in issuing sanctions against Parler “do[es] not stand for the proposition that it had the power to fine an attorney who engaged in a discovery violation in the absence of finding that the attorney was guilty of contempt following a hearing conducted pursuant” to the Maryland Rules governing contempt. According to appellant, the circuit court failed to provide Parler notice that it was “contemplating the extraordinary sanction of a fine in the amount of $10,000,” in violation of Parler’s due process rights. Appellant maintains that the circuit court had only two options: (1) issue a sanction pursuant to the rules governing discovery or (2) initiate contempt proceedings and hold a hearing providing Parler with an opportunity to be heard. Appellant contends that the circuit court’s sanction against Parler was, in essence, a finding that Parler was in direct criminal contempt. Appellant argues that the circuit court failed to follow the procedures governing contempt proceedings. Appellant asserts that Parler did not have notice that the circuit court intended to fine him and, therefore, did not present argument at the post-trial motions hearing regarding such a fine. *695Alternatively, appellant contends that the circuit court lacked authority to issue sanctions against Parler pursuant to Maryland Rule 1-341 because there was no “clear evidence” that Parler withheld the 1993 Kennedy Krieger Institute test in bad faith. According to appellant, the evidence presented in post-trial motions and at the post-trial motions hearing indicated only that the 1993 Kennedy Krieger Institute test was withheld inadvertently, not intentionally and in bad faith. Appellant argues that an explanation for the amount of the sanction levied against Parler — $10,000—is not contained in the record. Appellant asserts that the circuit court failed to set forth any specific findings detailing how the court arrived at the $10,000 figure, and that, as such, the sanction against Parler is unjustified. Appellee responds that the circuit court properly imposed sanctions against Parler. As an initial matter, appellee contends that Parler failed to properly appeal the sanction imposed against him as the notice of appeal filed by appellant did not clearly indicate that Parler was appealing too. As to the merits, appellee argues that the sanctions against Parler were “entirely appropriate” given his pattern of misconduct. (2) Standard of Review In Schneider v. Little, 206 Md.App. 414, 432-33, 49 A.3d 333, cert. granted, 429 Md. 303, 55 A.3d 906 (2012), this Court explained the standard of review governing the imposition of sanctions for discovery abuse, stating: We review a trial court’s finding of a discovery violation under the clearly erroneous standard. ‘When reviewing the circuit court’s imposition of sanctions for discovery abuse, we are bound to the court’s factual findings unless we find them to be clearly erroneous.” Klupt v. Krongard, 126 Md.App. 179, 193, 728 A.2d 727 (1999). “Our scope of review is narrow and our function is not to substitute our judgment for that of the fact finder, even if we might have reached a different result.” Id. Instead, we must “decide only whether there was sufficient evidence to support the trial court’s findings. In making this decision, we must *696assume the truth of all the evidence, and of all the favorable inferences fairly deducible therefrom, tending to support the factual conclusions of the lower court.” Id. (3) Law (a) Appeal of Sanctions by a Party’s Attorney In Newman v. Reilly, 314 Md. 364, 382-83, 386, 550 A.2d 959 (1988), the Court of Appeals held that a notice of appeal filed by the plaintiff, signed by his attorney, concerning imposition of sanctions against the plaintiff and the attorney, could be read as including review of the sanctions against the attorney. In the case, the trial court granted the defendant doctor’s request for sanctions, finding that the plaintiff and his attorney initiated a claim before the Health Claims Arbitration Board without “any investigation and/or in total disregard of the necessity to prove the applicable standard of care and/or a breach thereof or causation.” Id. at 374, 550 A.2d 959. The trial court agreed with the defendant doctor that the plaintiffs lawsuit should never have been filed. Id. at 375, 550 A.2d 959. Accordingly, the trial court awarded the defendant doctor $21,165.05 in attorney’s fees, which was reduced to judgments against the plaintiff in the amount of $10,583.53 and against the attorney in the amount of $10,583.52. Id. Within thirty days, a notice of appeal was filed signed by the attorney as “Attorney for Plaintiff,” stating: “Please enter an appeal on behalf of the Plaintiff to the Court of Special Appeals from the Judgment, in the above captioned matter, in favor of the Defendants, ... dated April 1, 1987 and entered on April 2, 1987.” Id. at 376, 550 A.2d 959. In Newman, id. at 383, 550 A.2d 959, the Court of Appeals initially observed that the Maryland Rules, unlike the Federal Rules, “do not regulate the content of an order for appeal to the Court of Special Appeals.” Conversely, the corresponding Federal Rule prescribed the content required in a notice of appeal, including that the notice of appeal specify “the party or parties taking the appeal[.]” Id. The Court of Appeals stated that had the attorney signed the notice of appeal, as *697attorney for the plaintiff, and had the notice of appeal only read “ ‘Please note an appeal to the Court of Special Appeals!,]’ ... the legal effect would have been to bring up for appellate review all appealable judgments in the case!,]” including the sanctions against the attorney. Id. Accordingly, the Court of Appeals held that the “order for appeal in the instant case does not operate to exclude [the attorney,]” and that Maryland appellate courts “have generally been quite liberal in construing timely orders for appeal.” Id. at 386, 550 A.2d 959. The Court of Appeals discussed several cases in which Maryland appellate courts have construed notices of appeal broadly to encompass the right of those not specifically named in the notices of appeal to appeal. Id. at 386-87, 550 A.2d 959. In addition, the Court of Appeals noted that, in response to the defendant doctor’s motion for sanctions, both the plaintiff and attorney “presented a common defense!,]” and that, after the imposition of sanctions against both, the attorney had the right to appeal as a “party.” Id. at 388, 550 A.2d 959. The Court of Appeals observed that there was no evidence contained within the record to demonstrate that the attorney waived his right to appeal or that the language he used in the notice of appeal was to serve as a “deliberate limitation.” Id. Thus, the notice of appeal was sufficient to include review of the sanctions imposed against the attorney. Id. (b) Maryland Rule 2-433 Maryland Rule 2-433, entitled “Sanctions,” provides, in pertinent part: (a) For certain failures of discovery. Upon a motion filed under Rule 2-432(a), the court, if it finds a failure of discovery, may enter such orders in regard to the failure as are just, including one or more of the following: (1) An order that the matters sought to be discovered, or any other designated facts shall be taken to be established for the purpose of the action in accordance with the claim of the party obtaining the order; *698(2) An order refusing to allow the failing party to support or oppose designated claims or defenses, or prohibiting that party from introducing designated matters in evidence; or (3) An order striking out pleadings or parts thereof, or staying further proceeding until the discovery is provided, or dismissing the action or any part thereof, or entering a judgment by default that includes a determination of liability and all relief sought by the moving party against the failing party if the court is satisfied that it has personal jurisdiction over that party.... Instead of any order or in addition thereto, the court, after opportunity for hearing, shall require the failing party or the attorney advising the failure to act or both of them to pay the reasonable expenses, including attorney’s fees, caused by the failure, unless the court finds that the failure was substantially justified or that other circumstances make an award of expenses unjust. (d) Award of expenses. If a motion filed under Rule 2-432 or under Rule 2-403 is granted, the court, after opportunity for hearing, shall require the party or deponent whose conduct necessitated the motion or the party or the attorney advising the conduct or both of them to pay to the moving party the reasonable expenses incurred in obtaining the order, including attorney’s fees, unless the court finds that the opposition to the motion was substantially justified or that other circumstances make an award of expenses unjust. This Court has stated that, “[implicit in [R]ule [2-433] is the requirement that the moving party[ ] include in the motion for sanctions a request for expenses ... and the amount of expenses requested supported by an itemization of those expenses[.]” Davis v. Davis, 97 Md.App. 1, 26, 627 A.2d 17 (1993), aff'd, 335 Md. 699, 646 A.2d 365 (1994) (emphasis omitted). *699(4) Analysis Returning to the instant case, as an initial matter, we agree with appellee that the notices of appeal filed by appellant failed to indicate that Parler appealed the imposition of sanctions against him individually. The record reflects that Parler did not file his own notice of appeal nor his own brief, and has not otherwise identified himself as an appellant before this Court. Thus, the case is in the odd posture of appellant, on behalf of its attorney, appealing imposition of sanctions against said attorney. We, nonetheless, construe the notices of appeal broadly given the Court of Appeals’s holding in Newman. Accordingly, although it may have been advisable for Parler to definitively indicate that he appealed the sanctions imposed against him either in appellant’s notice of appeal or by filing a separate notice of appeal, and to file his own brief setting forth his arguments as to why the imposition of sanctions against him was improper, we shall not interpret the notices of appeal to “operate to exclude” Parler. Newman, 314 Md. at 386, 550 A.2d 959. As to the merits, in the motion for sanctions, appellee requested that the circuit court: (1) order Parler to pay $10,135.45 as reimbursement for expenses and $1,500 in attorney’s fees for preparation of the motion for sanctions; (2) report Parler to Bar Counsel; and (3) grant “such other relief as this Court shall deem appropriate.” Although appellee asked that the circuit court grant “such other relief’ the court deemed appropriate, other than the request of expenses and attorney’s fees, appellee did not seek a specific monetary sanction against Parler. Given our reversal of the award of sanctions against appellant as stated in Section VI, supra, and Maryland Rule 2-433’s explicit authorization of sanctions in the form of expenses and attorney’s fees against attorneys whose conduct necessitated the motion for sanctions, and in light of appellee’s lack of a request that a separate monetary sanction — aside from expenses and attorney’s fees — be imposed, we reverse the circuit court’s imposition of sanctions against Parler and remand for additional consideration of the merits. *700In imposing sanctions against Parler, the circuit court stated that it had “inherent power to sanction” and, in determining the amount of the sanction, relied, in part, upon the case of Klupt v. Krongard, 126 Md.App. 179, 197, 728 A.2d 727, cert. denied, 355 Md. 612, 735 A.2d 1107 (1999), in which we held that trial courts “ ‘have the power to sanction the destruction of evidence, whether that authority is derived from [the discovery sanctions rule] or from their inherent powers.’ ” (Citation omitted) (alteration in original). The monetary sanctions requested by appellee — expenses and attorney’s fees — for Parler’s alleged discovery violations in this case may properly be resolved under Maryland Rule 2-433, which provides a vehicle for expenses and attorney’s fees as sanctions in circumstances involving the failure to disclose discoverable evidence, without resort to the circuit court’s inherent authority. We remand the case with instructions to the circuit court to determine whether sanctions pursuant to Maryland Rule 2-433 in the form of an award of expenses and/or attorney’s fees against Parler are appropriate. JUDGMENT OF THE CIRCUIT COURT FOR BALTIMORE CITY REVERSED. SANCTIONS AGAINST APPELLANT IN THE AMOUNT OF $10,135.45 AND AGAINST APPELLANT’S COUNSEL, WILLIAM C. PAR-LER, JR., IN THE AMOUNT OF $10,000 VACATED. CASE REMANDED FOR FURTHER PROCEEDINGS CONSISTENT WITH THIS OPINION. COSTS TO BE PAID 1/2 BY APPELLANT AND 1/2 BY APPELLEE. . Appellee’s blood-lead levels were reported as follows: 12 micrograms per deciliter (µg/dL) on October 8, 1992; 8 µg/dL on April 8, 1993; 16 µg/dL on July 16, 1993; 21 µg/dL on August 16, 1994; 14 g/dL on April 18, 1995; 11 µg/dL on July 17, 1995; and 11 µg/dL on November 3, 1998. . Later, in a memorandum in support of her opposition to appellant’s motion to exclude and for summary judgment, appellee alleged that from her birth through July 1993, she visited 4 North Stockton, where her grandparents resided, and that from July 1993 through 2000, she lived at 4 North Stockton. . At a deposition taken on August 4, 2010, appellee testified that she moved from 4 North Stockton to 1606 Lemmon on two occasions, staying at 1606 Lemmon for a “couple months” each occasion. . On September 30, 2010, Hunt filed an Answer to the amended complaint, generally denying liability and raising negative and affirmative defenses as well as additional defenses. On February 16, 2011, appellant and Mankowitz filed a Cross-Claim against Hunt seeking \"indemnification or contribution in whole or part, for any sums awarded to [appellee] against them[J\" On March 4, 2011, Hunt filed a Motion for Summary Judgment as to the claims alleged in the amended complaint and cross-claim, arguing that there was no information demonstrating that appellee’s injuries or damages were caused by exposure to lead at 1606 Lemmon. On March 21, 2011, appellee filed an opposition to the motion for summary judgment. On April 6, 2011, the circuit court issued an order granting Hunt’s motion for summary judgment as to the claims alleged in the amended complaint and the *623cross-claim and dismissing the cross-claim. Hunt is not a party to this appeal. . Appellant and Mankowitz asserted that a Niton machine should have been used for testing because the machine is able to distinguish between lead on the surface and lead below the surface. . On May 26, 2011, amidst the other various pretrial motions filed, appellant and Mankowitz filed a Motion for Summary Judgment as to Mankowitz, arguing that appellant is a charitable organization and that Mankowitz, as president of appellant, was “statutorily immune from liability.\" On June 13, 2011, appellee filed an opposition to the Motion for Summary Judgment as to Mankowitz, arguing that, under case law, Mankowitz is individually liable for her injuries because he was not only the president of appellant but also the day-to-day manager of the property at 4 North Stockton and that, by statute, officers of charitable organizations are indemnified, not immune, where the charitable organization fails to carry \"certain amounts of liability insurance coverage applicable to [her] claims.” On June 30, 2011, Mankowitz filed a reply memorandum in support of his motion for summary judgment, again arguing that he was entitled to statutory immunity. On July 1, 2011, the circuit court issued an order granting summary judgment as to Mankowitz. Mankowitz is not a party to this appeal. . The record does not disclose what the reading was, but indicates that appellee’s counsel agreed that White could conduct a test reading. . In the Affidavit of Patrick T. Connor, Connor averred that, although he reviewed the 1993 report during his trial preparation, the first time he discussed the report with anyone was after his trial testimony. Connor averred that there was no way to ascertain the identity of the inspector who performed the 1993 test, but that, based on his review, the testing was completed by Kennedy Krieger Institute. In an affidavit, Mankowitz averred that Kennedy Krieger Institute hired Smelgus from Scientific Labs to perform the 1993 test, and that he did not discuss the 1993 report with anyone until after the trial. Mankowitz averred that, although appellant has hired Smelgus and Scientific Labs to conduct XRF testing on its properties, when it does so, Smelgus used his own test report forms rather than Kennedy Krieger Institute test report forms. Smelgus averred in his affidavit that Scientific Labs performed the 1993 test for Kennedy Krieger Institute. . Appellant relies on Dixon v. Ford Motor Co., 206 Md.App. 180, 47 A.3d 1038 (2012), and Taylor, 207 Md.App. 121, 51 A.3d 743, for the contention that the circuit court abused its discretion in permitting Dr. Sundel to testify that blood lead levels under ten micrograms per deciliter were not necessarily safe and opine that 4 North Stockton was “a substantial contributing factor” to appellee’s injuries \"because it was an older home.” In Taylor, 207 Md.App. at 143, 51 A.3d 743, we stated: \" '[Njeither the Court of Appeals nor this Court has ever interpreted the statutes regarding lead-based paint to create ... a presumption [that old houses contain lead-based paint].’ ” (quoting Dow v. L \u0026amp; R Props., 144 Md.App. 67, 74, 796 A.2d 139 (2002)) (second alteration and omission in original). Thus, there is no evidentiary presumption that older homes contain lead. In Dixon, 206 Md.App. at 185-86, 202, 47 A.3d 1038, an asbestos case, we held that the plaintiff’s expert’s opinion that \"every exposure to asbestos[,]” even a single event, \"is a substantial contributing cause” to the development of mesothelioma, “lacked any information that would ‘assist the trier of fact to understand the evidence or to determine a fact in issue' as required by [Maryland] Rule 5-702.” In Dixon, id. at 197, 47 A.3d 1038, we held that such testimony was inadmissible absent quantitative epidemiological evidence supporting its conclusions. We conclude that Dr. Sundel’s testimony is akin to the situation in Dixon. Although Dr. Sundel did not explicitly testify that no blood lead level was safe or that every exposure to lead was a substantial contributing cause of appellee's injuries, when asked “so although the CDC set the action level at ten [micrograms per deciliter], that doesn't mean less than ten is safe necessarily, does it?[,]” Dr. Sundel agreed, “[n]o, it doesn't.” Dr. Sundel’s response demonstrated his belief that blood lead levels under ten micrograms per deciliter are unsafe. Dr. Sundel failed to provide, however, any explanation for his belief that blood lead levels under ten micrograms per deciliter were unsafe or to cite any study or report supporting his conclusion. Accordingly, as in Dixon, id. at 202, 47 A.3d 1038, such testimony “lacked any information that would 'assist the trier of fact to understand the evidence or to determine a fact in issue[,]’ ” and should have been excluded. . The circuit court granted summary judgment in favor of Hunt as to 1606 Lemmon.\n\n",
    "body_length": 172661,
    "citedas": [
      "210 Md. App. 615",
      "63 A.3d 713",
      "2013 WL 1187145",
      "2013 Md. App. LEXIS 39"
    ],
    "attorneys": "William C. Parler, Jr., (Kelly A. Grafton, J. Michael Buhite, Parler \u0026 Wobber, LLP, on the brief), Towson, MD, for Appellant., Bruce H. Powell, (Scott E. Nevin, George E. Swegman, Law Office of Peter T. Nicholl, John Amato, IV, Goodman, Meagher \u0026 Enoch, LLP, on the brief), Baltimore, MD, for Appellee.",
    "category": [],
    "judges": "Watts",
    "citation_count": 0
  }
}
