{
  "id": "8aJtR2YBTlTomsSBVzBM",
  "document": {
    "title": "20th Century Ins. Co. v. Garamendi",
    "full_title": "20TH CENTURY INSURANCE COMPANY ET AL. AND v. JOHN GARAMENDI, AS COMMISSIONER, ETC. AND . 20TH CENTURY INSURANCE COMPANY ET AL. AND V. JOHN GARAMENDI, AS COMMISSIONER, ETC. AND ; VOTER REVOLT, INTERVENER AND . HARTFORD STEAM BOILER INSPECTION AND INSURANCE COMPANY ET AL. AND V. JOHN GARAMENDI, AS COMMISSIONER, ETC. AND .",
    "jurisdiction": "California Supreme Court",
    "date": "1994-08-18T00:00:00.000Z",
    "docket": "No. S032502",
    "body": "MOSK, J.:\n\nAt the November 8, 1988, General Election, the voters approved an initiative statute that was designated on the ballot as Proposition 103. The measure made numerous fundamental changes in the regulation of automobile and other forms of insurance in California. Formerly, the so-called \"open competition\" system of regulation had obtained, under which \"rates [were] set by insurers without prior or subsequent approval by the Insurance Commissioner . . . .\" (King v. Meese (1987) 43 Cal. 3d 1217, 1221, 240 Cal. Rptr. 829, 743 P.2d 889.) Under that system, \"California had less regulation of insurance than any other state, and in California automobile liability insurance [was] less regulated than most other forms of insurance.\" (Id. at p. 1240 (conc. opn. of Broussard, J.).) The initiative contained, among others, provisions relating to the rollback of rates for insurance within its coverage for the period extending from November 8, 1988, through November 7, 1989. (For purposes here, a rate is the price or premium that an insurer charges its insureds for insurance.)\n\nIt scarcely needs mention that the regulation of the insurance industry is squarely within the state's police power. \"What [has been] said about the police power -- that it 'extends to all the great public needs' and may be utilized in aid of what the legislative judgment deems necessary to the public welfare, [citation] -- is peculiarly apt when the business of insurance is involved -- a business to which the government has long had a 'special relation.'\" (California Auto. Assn. v. Maloney (1951) 341 U.S. 105, 109, 95 L. Ed. 788, 71 S. Ct. 601.)\n\nIn Calfarm Ins. Co. v. Deukmejian (1989) 48 Cal. 3d 805, 258 Cal. Rptr. 161, 771 P.2d 1247 (hereafter sometimes Calfarm), we upheld, inter alia, Proposition 103's provision requiring rate rollbacks.\n\nIn this proceeding, we review the implementation of Proposition 103's rate rollback requirement provision by the Insurance Commissioner. The incumbent is John Garamendi, the first person elected to the office. His predecessor was Roxani M. Gillespie, who was appointed thereto.\n\nSpecifically, we decide appeals and cross-appeals from a judgment of the Los Angeles County Superior Court in three consolidated cases in Judicial Council Coordination Proceeding No. 2419, entitled \"Proposition 103 Implementation Cases.\" We transferred the cause, which was then pending in No. B074704 in the Court of Appeal, Second Appellate District, to ourselves because it \"presents issues of imperative public importance requiring prompt resolution\" by this court \"and justifying a departure from normal appellate processes.\" (Cal. Rules of Court, rule 27.5(b).) The cases are as follows.\n\n1. 20th Century Insurance Company et al. v. Garamendi (Super. Ct. S.F. County, 1991, No. 938470, trans., Super. Ct. L.A. County, 1992, No. BC046216) (hereafter 20th Century I). This action concerns, inter alia, the validity of rate regulations adopted by the Insurance Commissioner as to rollbacks both on their face and as applied. The regulations in question include regulations strictly so called: rules generally applicable to all insurers formulated by the commissioner in quasi-legislative proceedings in File No. RH--291. They include as well regulations incorporating \"generic determinations\": findings relating to all or at least several insurers made by the commissioner in consolidated hearings conducted in accordance with quasi-adjudicatory procedures and then adopted by him as regulations -- specifically, findings arising from (1) File No. RCD--1, concerning exposure basis, reserve strengthening, executive compensation, efficiency standards, etc.; and (2) File No. RCD--2, concerning rate of return, leverage factor, projected yield, etc. This action also concerns the constitutionality of Proposition 103's rate rollback requirement provision both on its face and as applied. The parties include 20th Century Insurance Company and 21st Century Casualty Company (hereafter collectively 20th Century) as plaintiffs (and, formerly, petitioners) and the commissioner in his official capacity as defendant (and, formerly, respondent).\n\n2. 20th Century Insurance Company et al. v. Garamendi (Super. Ct. L.A. County, 1992, No. BS016789) (hereafter 20th Century II). This action involves, among other issues, the validity of the rate regulations both on their face and as applied and also the validity of a rollback order issued by the Insurance Commissioner against 20th Century pursuant thereto. The parties include 20th Century as petitioners and the commissioner in his official capacity as respondent. By leave of court, Allstate Insurance Company (hereafter Allstate) and Voter Revolt, the proponent of Proposition 103, are interveners, the former on 20th Century's side, the latter on the commissioner's.\n\n3. Hartford Steam Boiler Inspection and Insurance Company et al. v. Garamendi (Super. Ct. L.A. County, 1991, No. BC023983). This action concerns, inter alia, the validity of the rate regulations incorporating generic determinations, both on their face and as applied, relating to the issue of \"leverage,\" i.e., the \"surplus\" or available capital that backs up premiums. It appears that the insurance industry's surplus is greatly represented by appreciating assets (such as stocks and bonds), as opposed to depreciating assets (such as plant and equipment). Over-leverage (or undercapitalization) threatens insolvency: there is insufficient surplus to back up premiums. By contrast, under-leverage (or overcapitalization) threatens undue profit: there is surplus beyond what is useful to back up premiums -- surplus surplus -- which inflates the insurer's capital base and any rate set thereon to the disadvantage of its insureds, while at the same time it produces investment income from appreciating assets. This action was bifurcated as to the leverage issue and consolidated with 20th Century I and 20th Century II with regard thereto. The parties include Hartford Steam Boiler Inspection and Insurance Company (hereafter Hartford) and the State Farm Insurance Companies (hereafter State Farm), together with scores of other insurers, as plaintiffs and petitioners and the commissioner in his official capacity as defendant and respondent.\n\nI. PROPOSITION 103 AND CALFARM\n\nAmong other things, Proposition 103 added the following sections to the Insurance Code.\n\nInsurance Code section 12900. This provision makes the Insurance Commissioner an elected official.\n\nInsurance Code section 1861.01.\n\nSubdivision (a) is the rate rollback requirement provision. \"For any coverage for a policy for automobile and any other [specified] form of insurance . . . issued or renewed on or after November 8, 1988, every insurer shall reduce its charges to levels which are at least 20% less than the charges for the same coverage which were in effect on November 8, 1987.\"\n\nSubdivision (b) defines the procedural mechanism for relief from the rate rollback requirement provision. \"Between November 8, 1988, and November 8, 1989, rates and premiums reduced pursuant to subdivision (a) may be only increased [sic: read, \"may be increased only\"] if the commissioner finds, after a hearing, that an insurer is substantially threatened with insolvency.\"\n\nSubdivision (c) institutes the \"prior approval\" system. \"Commencing November 8, 1989, insurance rates . . . must be approved by the commissioner prior to their use.\"\n\nInsurance Code section 1861.05.\n\nSubdivision (a) articulates the substantive standard of the \"prior approval\" system. \"No rate shall be approved or remain in effect which is excessive, inadequate, unfairly discriminatory or otherwise in violation of [specified law]. In considering whether a rate is excessive, inadequate or unfairly discriminatory, no consideration shall be given to the degree of competition and the commissioner shall consider whether the rate mathematically reflects the insurance company's investment income.\"\n\nSubdivision (b) defines the procedural mechanism for the \"prior approval\" system. \"Every insurer which desires to change any rate shall file a complete rate application with the commissioner. . . . The applicant shall have the burden of proving that the requested rate change is justified and meets the requirements of\" specified law.\n\nThe scheme for the regulation of rates thus established by Proposition 103 is as follows.\n\nFor the period extending from November 8, 1988, through November 7, 1989 (hereafter sometimes the rollback year or simply 1989), as a temporary regulatory regime of rate reduction and freeze evidently designed to allow the setting up of a permanent regulatory regime to follow, Proposition 103 itself sets a maximum rate for covered insurance at 80 percent of the rate for the same insurance in effect on November 8, 1987 (hereafter sometimes the 1987 rate).\n\nFor the period extending from November 8, 1989, into the future, Proposition 103 institutes a permanent regulatory regime comprising the \"prior approval\" system, under which, in the words of Insurance Code section 1861.05, subdivision (a), the Insurance Commissioner must approve a rate applied for by an insurer before its use, looking to whether the rate in question is \"excessive, inadequate, unfairly discriminatory or otherwise in violation of\" specified law -- considering the \"investment income\" of the individual insurer and not considering the \"degree of competition\" in the insurance industry generally.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nIn Calfarm, we reviewed Proposition 103 against challenges under the United States and California Constitutions, including a claim that the rate rollback requirement provision was on its face invalid as confiscatory and arbitrary, discriminatory, or demonstrably irrelevant to legitimate policy in violation of the takings clause of the Fifth Amendment and article I, section 19 and the due process clause of the Fourteenth Amendment and article I, sections 7 and 15.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e In the course of our analysis, we rejected the point. Our reasoning was as follows.\n\nProposition 103's rate rollback requirement provision, viz., Insurance Code section 1861.01, subdivision (a), which sets the maximum rate for the rollback year at 80 percent of the 1987 rate, would be facially invalid because confiscatory if rate adjustments necessary to avoid confiscation were not available for individual insurers. (Calfarm Ins. Co. v. Deukmejian, supra, 48 Cal. 3d at p. 820 [\"The risk that the rate set by the statute is confiscatory as to some insurers from its inception is high enough to require an adequate method for obtaining individualized relief.\"].)\n\nProposition 103's procedural mechanism for relief from the rate rollback requirement provision, viz., Insurance Code section 1861.01, subdivision (b), which allows an increase over the maximum rate for the rollback year of 80 percent of the 1987 rate only if the insurer is \"substantially threatened with insolvency,\" is facially invalid because it precludes rate adjustments necessary to avoid confiscation, and further cannot be sustained as a temporary or emergency measure. (Calfarm Ins. Co. v. Deukmejian, supra, 48 Cal. 3d at pp. 816-821.)\n\nInsurance Code section 1861.01, subdivision (b), however, is severable from the balance of Proposition 103. (Calfarm Ins. Co. v. Deukmejian, supra, 48 Cal. 3d at pp. 821-822.)\n\nInsurance Code section 1861.05 is the \"general standard for rate adjustment\" for most rates and Insurance Code section 1861.01, subdivision (b), is an \"exception\" for rates for the rollback year. (Calfarm Ins. Co. v. Deukmejian, supra, 48 Cal. 3d at p. 822.)\n\nThe invalidation of Insurance Code section 1861.01, subdivision (b), \"leaves untouched\" Insurance Code section 1861.05. (Calfarm Ins. Co. v. Deukmejian, supra, 48 Cal. 3d at p. 822.) In other words, the \"deletion\" of the \"exception\" allows the \"general standard\" to be applicable in all cases. (Id. at pp. 822, 825, fn. 17.) The \"general standard\" declares, in subdivision (a) of Insurance Code section 1861.05, that \"no rate shall . . . remain in effect which is excessive, inadequate, unfairly discriminatory or otherwise in violation of\" specified law. Hence, the \"general standard\" \"requires rates within that range which can be described as fair and reasonable . . . .\" (Calfarm Ins. Co. v. Deukmejian, supra, 48 Cal. 3d at pp. 822-823.) \"The terms 'fair and reasonable' and 'confiscatory' are antonyms . . . .\" (Id. at p. 816, fn. 5.) The range of fair and reasonable rates is defined in light of the insurer's legitimate interest in financial integrity and the insured's legitimate interest in freedom from exploitation. (See id. at p. 816 [implying that controls on rates must be \"'reasonably calculated to eliminate excessive'\" charges to consumers \"'and at the same time provide'\" producers \"'with a just and reasonable return on their property'\"].) A \"confiscatory rate is necessarily an 'inadequate' rate . . . .\" (Id. at p. 822.) Therefore, the \"general standard\" \"prohibits . . . maintenance of confiscatory rates.\" (Id. at p. 823.)\n\nIt follows that in subdivision (a) Insurance Code section 1861.05 \"provides a constitutionally valid standard for rate adjustment . . . .\" (Calfarm Ins. Co. v. Deukmejian, supra, 48 Cal. 3d at p. 823.)\n\nAccordingly, Insurance Code section 1861.01, subdivision (a) -- which sets the maximum rate for the rollback year at 80 percent of the 1987 rate -- is not facially invalid because confiscatory inasmuch as rate adjustments necessary to avoid confiscation are in fact available for individual insurers. (Calfarm Ins. Co. v. Deukmejian, supra, 48 Cal. 3d at pp. 816-826.)\n\nFurther, under Proposition 103 \"insurers will [not] be compelled to charge confiscatory rates pending administrative relief.\" (Calfarm Ins. Co. v. Deukmejian, supra, 48 Cal. 3d at p. 823.) There are \"no . . . barriers to efficient decision making\" in the initiative. (Id. at p. 824.) \"Much is necessarily left to the Insurance Commissioner, who has broad discretion to adopt rules and regulations as necessary to promote the public welfare.\" (Ibid.) The absence of \"barriers\" is evident. For example, \"no provision bars the commissioner from consolidating cases or issuing regulations of general applicability. Thus there is nothing here which prevents the commissioner from taking whatever steps are necessary to reduce the job to manageable size.\" (Ibid.) \"Moreover, the commissioner has the power to grant interim relief from plainly invalid rates. [His or her] powers are not limited to those expressly conferred by statute; 'rather, \"it is well settled in this state that [administrative] officials may exercise such additional powers as are necessary for the due and efficient administration of powers expressly granted by statute, or as may fairly be implied from the statute granting the powers.\"' [Citations.] The power to grant interim relief is necessary for the due and efficient administration of Proposition 103, and may fairly be implied from its command that 'no rate shall . . . remain in effect which is excessive, inadequate, unfairly discriminatory or otherwise in violation of [specified law].\" (Id. at pp. 824-825, italics in original.)\n\nIn Conclusion, under Proposition 103 \"any insurer who believes the rates set by [Insurance Code] section 1861.01, subdivision (a), are confiscatory may file an application with the Insurance Commissioner for approval of a higher rate. If that application is filed before November 8, 1989, the insurer may immediately begin charging that higher rate pending approval from the commissioner. After that date insurance rates subject to Proposition 103 must be approved by the commissioner prior to their use, but . . . the commissioner can approve an interim rate pending [his or] her final decision. If the commissioner finds the initiative's rate, or some other rate less than the insurer charged, is fair and reasonable, the insurer must refund excess premiums collected with interest. No insurer, however, will be compelled to charge the rates set by the initiative unless it either acquiesces in that rate or is unable to prove that a higher rate is constitutionally required.\" (Calfarm Ins. Co. v. Deukmejian, supra, 48 Cal. 3d at p. 825, fn. omitted.) \"Proposition 103 contemplates that any rate set by the commissioner will be subject to judicial review.\" (Id. at p. 825, fn. 18.) The initiative added section 1861.09 to the Insurance Code, which expressly provides for such review. Under Insurance Code section 1861.01, subdivision (a) -- to use the terms appearing in Insurance Code section 1861.05, subdivision (a) -- a rate is \"inadequate\" if confiscatory and \"excessive\" if more than minimally nonconfiscatory and above 80 percent of the 1987 rate.\n\nII. THE PRESENT LITIGATION\n\nProposition 103 did not find rest after largely surviving the challenge mounted in Calfarm. Quite the contrary.\n\nIn Fireman's Fund Ins. Co. v. Garamendi (N.D. Cal. 1992) 790 F. Supp. 938 (hereafter sometimes Fireman's Fund), the federal district court provided a greatly abbreviated summary: \"Insurers . . . filed over fifty lawsuits in California state courts, challenging many aspects of the Commissioner's effort to implement Proposition 103.\" (Id. at p. 942.) \"In December 1989, [the Chief Justice of California], in his capacity as Chairperson of the Judicial Council of California, assigned Sacramento Superior Court Judge Richard Park to determine whether the then four pending cases relating to the implementation of Proposition 103 should be coordinated pursuant to California Code of Civil Procedure section 404 et seq. and California Rules of Court, Rule 1501 et seq., under the special title 'Proposition 103 Implementation Cases.' In January 1990, Judge Park issued an order coordinating the actions, and recommended to the Judicial Council that the cases be transferred to Los Angeles Superior Court for efficiency and the convenience of the parties. The Judicial Council adopted Judge Park's recommendation, and the coordinated cases were reassigned to Judge Miriam Vogel. After Judge Vogel was elevated to the Court of Appeal in May, 1990, [the Chief Justice] issued an amended order reassigning the Proposition 103 Implementation Cases, then 22 in number, to Judge Dzintra Janavs. Cases filed subsequently have either been formally added-on to the coordinated actions pursuant to Rule 1544 of the California Rules of Court, or have otherwise made their way before Judge Janavs. Presently, every Superior Court case relating to the implementation of Proposition 103 is or has been heard before her\" -- including those here. (Id. at p. 953, fn. 13.)\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nTo quote the words of the superior court spoken through Judge Janavs: \"Proposition 103 [has] proved to be a problem child from its inception. It is doubtful whether any other initiative or legislative enactment has, in the span of just [a few] years, engendered more extensive administrative proceedings and as much litigation as Proposition 103.\"\n\nThe historical background is sketched in the Fireman's Fund court's opinion. (Fireman's Fund Ins. Co. v. Garamendi, supra, 790 F. Supp. at pp. 941-944.) Two aspects deserve mention.\n\nThe first concerns the validity of the rate regulations, as it were, in context.\n\nThe Insurance Commissioner's predecessor had issued what is commonly referred to as her \"Amended Decision.\" She subsequently adopted its substance as rate regulations -- which included regulations strictly so called and also generic determinations. Shortly after taking office, the present commissioner announced his intention to depart from the path charted in the Amended Decision and to strike out on a different one. Specifically, he gave notice that he proposed to repeal his predecessor's rate regulations and to adopt his own in their place. He did so. His action was validated in Safeco Ins. Co. v. Garamendi (1992) 16 Cal. App. 4th 1596, review granted March 25, 1993 (S030921), opinion ordered published pending review; and State Farm Mut. Auto. Ins. Co. v. Garamendi (1992) 17 Cal. App. 4th 1679, review granted March 25, 1993 (S030917), opinion ordered published pending review. In Safeco and State Farm, the Court of Appeal, Second Appellate District, Division Five, concluded in substance that the commissioner had proceeded lawfully: his predecessor's Amended Decision did not bind him because it was quasi-legislative and not quasi-adjudicative; her rate regulations could yield to his. These issues, however, are not raised in this proceeding.\n\nThe second aspect concerns the validity of the rate regulations, so to speak, in and of themselves.\n\nThe Office of Administrative Law (hereafter the OAL) has the authority to review and either approve or disapprove certain regulations. (See generally Gov. Code, § 11349 et seq.) Several times, the Insurance Commissioner submitted the rate regulations (in various forms) to the OAL. Several times, the OAL disapproved them, concluding, inter alia, that they are beyond the authority conferred on the commissioner by Proposition 103 (see Gov. Code, § 11349.1, subd. (a)(2)) and also inconsistent with the initiative's terms (see id., § 11349.1, subd. (a)(4)) because they impermissibly \"restrict an insurer's right to obtain relief from confiscatory rates.\"\n\nRegulations are generally subject to the OAL review requirement as a condition of validity. (See Gov. Code, § 11346.) But those, among others, that \"establish[] or fix[] rates, prices, or tariffs\" (id., § 11343, subd. (a)(1)) are excepted. (See id., § 11346.1, subd. (a).)\n\nThe Insurance Commissioner has taken the position that the rate regulations come within the rate-setting exception, hence fall outside the OAL review requirement, and therefore are not invalid because of OAL disapproval. He represents that he submitted the regulations in question to the OAL \"voluntarily\" \"in order to provide maximum opportunity for public participation, and in the hope of avoiding any litigation that might accompany his reliance on that\" exception.\n\nLet us return to the present proceeding. The focus of the superior court was the Insurance Commissioner's rate regulations as to rollbacks and his order determining 20th Century's rate rollback liability.\n\nA. The Rate Regulations\n\nThe rate regulations are codified as title 10, chapter 5, subchapter 4.8, articles 1 through 7, sections 2641.1 through 2647.1, of the California Code of Regulations. Insofar as they directly bear on rollbacks, they are included therein as title 10, chapter 5, subchapter 4.8, article 5, sections 2645.1 through 2645.9, and article 6, sections 2646.1 through 2646.5.\n\nAt the outset, three general comments are called for.\n\nFirst, insurance premiums and losses may be accounted for on a cash or accrual basis. Cash accounting speaks of \"premiums written\" and \"losses paid\": \"premiums written\" refers to dollars received; \"losses paid\" refers to dollars paid out. Accrual accounting, by contrast, speaks of \"premiums earned\" and \"losses incurred\": \"premiums earned\" refers to dollars distributed pro rata over the term of the policy; \"losses incurred\" refers to both actual pay-outs and reserves set aside for future pay-outs. The rate regulations generally require insurance premiums and losses to be accounted for on an accrual basis, as \"premiums earned\" and \"losses incurred.\" (See Cal. Code Regs., tit. 10, §§ 2643.3, 2644.4, 2644.5, 2644.6, 2644.7, 2645.4, 2645.9.)\n\nSecond, an insurer's capital may be measured in accordance with \"generally accepted accounting principles\" (hereafter sometimes GAAP) or \"statutory accounting principles\" (hereafter sometimes SAP). Statutory accounting principles are more conservative than generally accepted accounting principles. \"Statutory accounting principles . . . are rules that state insurance departments have developed to regulate . . . insurance companies; SAP mandate that conservative methods be employed in valuing the assets of such companies to guarantee their continuing solvency. [Citations.] This routine conservatism as reflected through use of SAP requires only that [sic: read, \"requires that only\"] certain types of assets be considered in calculating a company's financial condition, and that the value of such . . . assets be determined according to quite restrictive rules.\" (Meyers v. Moody (5th Cir. 1982) 693 F.2d 1196, 1218.) The rate regulations generally require an insurer's capital to be measured in accordance with statutory accounting principles rather than generally accepted accounting principles. (Cal. Code Regs., tit. 10, § 2643.5.)\n\nThird, insurance transactions may be subjected to \"direct\" or \"net\" \"ratemaking.\" To quote the Insurance Commissioner: \"'Direct ratemaking' measures the insurer's operations at the 'retail' level, counting all premiums the insurer receives from its policyholders and all losses paid to them. 'Net ratemaking' measures the same operations 'net' of reinsurance -- subtracting from premiums the insurer receives from policyholders that portion it passes on ('cedes') to reinsurers and subtracting from losses those amounts covered by ('ceded to') reinsurers.\" The rate regulations generally require insurance transactions to be subjected to \"direct ratemaking.\" (See Cal. Code Regs., tit. 10, § 2645.9.)\n\nCentral to this matter is what is commonly referred to as the \"ratemaking formula.\" (Cal. Code Regs., tit. 10, §§ 2644.2, 2644.3.)\n\nPermitted EP = losses + ALAE + fixed expenses -- ancil income\n\n1 -- var exp factor -- profit factor + invest inc factor\n\n\"Permitted EP\" stands for permitted earned premium. (Cal. Code Regs., tit. 10, §§ 2644.2, 2644.3.)\n\n\"Losses\" means incurred losses that are adjusted as specified. (Cal. Code Regs., tit. 10, §§ 2644.4, 2644.5, 2644.6, 2644.7, 2645.4.)\n\n\"ALAE\" stands for \"allocated loss adjustment expenses,\" which means the costs associated with the adjustment of specific claims. (Cal. Code Regs., tit. 10, § 2644.8, subd. (a).)\n\n\"Fixed expenses\" means expenses for acquisition (other than commission and brokerage), field supervision, and collection; plus general expenses; plus state and local taxes, licenses, and fees; minus state premium taxes; plus unallocated loss adjustment expenses -- all adjusted as specified. (Cal. Code Regs., tit. 10, § 2644.9.)\n\n\"Fixed expenses\" are subject to an \"efficiency standard\" -- a test of reasonableness -- for each covered line of insurance, as established from time to time by the Insurance Commissioner in a generic determination. (Cal. Code Regs., tit. 10, § 2644.12.) The generic determination applicable to rollbacks is incorporated. (Id., tit. 10, § 2645.5, subds. (b) \u0026 (c).)\n\n\"Fixed expenses\" do not include: (a) political contributions and lobbying; (b) executive compensation exceeding a reasonable amount, as found from time to time by the Insurance Commissioner in a generic determination -- the generic determination for rollbacks is incorporated (Cal. Code Regs., tit. 10, § 2645.5, subd. (a)); (c) bad faith judgments and associated allocated loss adjustment expenses; (d) costs attendant to the unsuccessful defense of discrimination claims; (e) fines and penalties; (f) institutional advertising expenses; and (g) payments to affiliates for goods or services exceeding their fair market value. (Id., tit. 10, § 2644.10.)\n\n\"Ancil income\" stands for \"ancillary income,\" which means net income not derived from operations directly related to covered insurance. (Cal. Code Regs., tit. 10, § 2644.13.)\n\n\"Var exp factor\" stands for \"variable expense factor,\" which means the sum of the commission rate and the state premium tax rate. (Cal. Code Regs., tit. 10, § 2644.14.)\n\n\"Profit factor\" means the \"permitted after-tax rate of return\" divided by the product of the \"leverage factor\" for each line of covered insurance multiplied by the \"federal income tax factor.\" (Cal. Code Regs., tit. 10, § 2644.15.) \"Permitted after-tax rate of return\" is the yield on investment as established from time to time by the Insurance Commissioner in a generic determination. (Id., tit. 10, § 2644.16.) The generic determination applicable to rollbacks is incorporated as 10 percent, \"corresponding to the lower boundary of the range of reasonable [rates of] return[] . . . .\" (Id., tit. 10, § 2645.6, subd. (a).) \"Leverage factor\" means the ratio of net written premiums to surplus for each line of covered insurance, as established from time to time by the commissioner in a generic determination. (Id., tit. 10, § 2644.17.) The generic determination of leverage ratios applicable to rollbacks is incorporated. (Id., tit. 10, § 2645.6, subd. (b).) If an insurer's actual leverage ratio or ratios for the rollback year under 1989 calendar year data is higher than the specified leverage ratio or ratios, it is used instead. (Id., tit. 10, § 2645.6, subd. (c).) \"Federal income tax factor\" means 1 minus the insurer's effective federal income tax rate. (Id., tit. 10, § 2644.18.)\n\n\"Invest inc factor\" stands for \"investment income factor,\" which means the insurer's yield multiplied by the sum of the \"reserves ratio\" plus the \"surplus ratio.\" (Cal. Code Regs., tit. 10, § 2644.19.) \"Reserves ratio\" means (a) the average of the last two years' loss reserves, plus loss adjustment expenses reserves, plus unearned premium reserves, (b) divided by the earned premium for the most recent year for which data are available. (Id., tit. 10, § 2644.21.) \"Surplus ratio\" means the reciprocal of the leverage factor. (Id., tit. 10, § 2644.22.)\n\nThe ratemaking formula is designed to yield a premium that the insurer should receive from its insureds in order to earn a sum amounting to (1) the reasonable cost of providing insurance and (2) the capital used and useful for providing insurance multiplied by a fair rate of return. This is consistent with the general rule that the rate set for a regulated firm is the sum of (1) its cost of service and (2) its capital base multiplied by a rate of return. (See, e.g., Jersey Cent. Power \u0026 Light Co. v. F.E.R.C. (D.C. Cir. 1987) 258 U.S. App. D.C. 189, 810 F.2d 1168, 1172 (en banc) (hereafter sometimes Jersey Central).)\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nThe ratemaking formula incorporates the accounting principle of \"matching.\" Matching involves, inter alia, the consistent treatment of related items of revenue and expense. Thus, for any given period, one must recognize, for example, an increase in taxes with an increase in premiums and a decrease in taxes with a decrease in premiums. So far as review of rates subject to the rate rollback is concerned, matching operates to take account of the expenses that would have been avoided had the insurer charged a rate no higher than the maximum rate set by Proposition 103 as construed in Calfarm -- i.e., the rate that is 80 percent of the 1987 rate or such rate greater than 80 percent of the 1987 rate as is minimally nonconfiscatory -- as well as the revenue that would have been forgone.\n\nThe ratemaking formula defines the values of many of its variables differently for the review of rates subject to the rate rollback and for the review of rates subject to the \"prior approval\" system.\n\nBecause the \"prior approval\" system concerns rates for the future, its orientation is necessarily prospective. Hence, for review of rates thereunder, the ratemaking formula relies much on projections. (See, e.g., Cal. Code Regs., tit. 10, §§ 2644.2, 2644.3, 2644.4, 2644.8, 2644.9, 2644.13, 2644.20.)\n\nBy contrast, because the rate rollback concerns rates for a period that has passed, its orientation is retrospective. Hence, for review of rates thereunder, the ratemaking formula relies much on actual historical data. (See, e.g., Cal. Code Regs., tit. 10, §§ 2645.2, subd. (d), 2645.4, 2645.8.) For convenience, such data is taken largely from the 1989 calendar year instead of the rollback year, which as noted extended from November 8, 1988, through November 7, 1989. (See, e.g., id., tit. 10, §§ 2645.4, 2645.6, subd. (c).)\n\nFurther, the ratemaking formula is used differently for the review of rates subject to the rate rollback and for the review of rates subject to the \"prior approval\" system.\n\nUnder the \"prior approval\" system, the insurer is effectively free to set for itself whatever rate it chooses, provided that (as relevant here) its rate is neither \"excessive\" nor \"inadequate.\"\n\nThe rate regulations define as \"excessive\" a rate that is \"expected to yield the reasonably efficient insurer a profit that exceeds a fair return on the investment used to provide the insurance\" in light of the \"competing interests of consumers in lower prices and of investors in prices that yield high returns\" and the \"fact that insurance is imbued with the public interest and is sometimes legally required.\" (Cal. Code Regs., tit. 10, § 2642.1.) They define as \"inadequate\" a rate \"under which a reasonably efficient insurer is not expected to have the opportunity to earn a fair return on the investment that is used to provide the insurance\" in light of the considerations identified above. (Id., tit. 10, § 2642.3.) Lastly, they define a \"fair return\" as the \"profit that an investor can reasonably expect to earn from an investment in a business other than insurance subject to regulation [thereunder] presenting investment risks comparable to the risks presented by insurance subject\" thereto. (Id., tit. 10, § 2642.2.)\n\nBy contrast, under the rate rollback, the insurer is not free to set for itself whatever rate it chooses between the \"excessive\" and the \"inadequate.\" Rather, it is required to charge a rate no higher than the maximum rate set by Proposition 103 as construed in Calfarm -- i.e., the rate that is 80 percent of the 1987 rate or such rate greater than 80 percent of the 1987 rate as is minimally nonconfiscatory, whichever is higher.\n\nIn this regard, the rate regulations set out, among others, the following findings by the Insurance Commissioner:\n\n\"Proposition 103 requires that all rates charged during the rollback period be reduced by 20% from their November 8, 1987, levels. Consumers are entitled to receive, and insurers are obligated to give, this reduction, except to the extent that it violates the insurers' constitutional rights.\" (Cal. Code Regs., tit. 10, § 2645.2, subd. (a).)\n\n\"Insurers are entitled to rates during the rollback period that are not confiscatory. Rates are confiscatory if and only if all the rates charged by\" the individual insurer \"are, taken as a whole, confiscatory.\" (Cal. Code Regs., tit. 10, § 2645.2, subd. (b).)\n\n\"To the extent that the rates specified by Proposition 103 for the rollback period are confiscatory, insurers are entitled to a rate above the level prescribed by the initiative, but not higher than necessary for the rates not to be confiscatory.\" (Cal. Code Regs., tit. 10, § 2645.2, subd. (c).)\n\nTo cover both the rate rollback and \"prior approval\" system, the ratemaking formula may be used to yield both a maximum permitted earned premium (when the profit factor variable takes as its value a maximum profit factor based on a maximum permitted after-tax rate of return (see Cal. Code Regs., tit. 10, §§ 2644.2, 2644.15)) and a minimum permitted earned premium (when the profit factor variable takes as its value a minimum profit factor based on a minimum permitted after-tax rate of return (see id., tit. 10, §§ 2644.3, 2644.15)).\n\nFor review of rates under the \"prior approval\" system, the Insurance Commissioner determines both the maximum and minimum permitted earned premium. That is because, as stated, the insurer is effectively free to set for itself whatever rate it chooses between the \"excessive\" and the \"inadequate.\" A rate is \"excessive\" if it is higher than the maximum permitted earned premium. (See Cal. Code Regs., tit. 10, § 2644.1.) It is \"inadequate\" if it is lower than the minimum permitted earned premium. (See ibid.) The commissioner must approve a rate that (as relevant here) falls between the \"excessive\" and the \"inadequate.\" (See ibid.)\n\nBy contrast, for review of rates under the rate rollback, the Insurance Commissioner proceeds otherwise. As stated, the insurer is not free during the rollback year to set for itself whatever rate it chooses between the \"excessive\" and the \"inadequate,\" but rather must charge a rate no higher than the maximum rate set by Proposition 103 as construed in Calfarm, i.e., the rate that is 80 percent of the 1987 rate or such rate greater than 80 percent of the 1987 rate as is minimally nonconfiscatory. For the rollback year, the commissioner determines only the minimum permitted earned premium, and does so only to define what is minimally above \"inadequate\" or minimally nonconfiscatory. The insurer must refund to each of its insureds, with simple interest calculated at 10 percent per annum computed from May 8, 1989, the midpoint of the rollback year, through the date of payment, an amount equal to the premiums paid for the rollback year multiplied by the \"refund percentage,\" which means the lesser of (1) the \"statutory percentage\" (i.e., the larger of (a) total 1989 direct earned premium [excluding surety, credit, and financial guaranty insurance] minus total 1989 direct earned premium [excluding surety, credit, and financial guaranty insurance] adjusted to the rate that is 80 percent of the 1987 rate divided by total 1989 direct earned premium [excluding surety, credit, and financial guaranty insurance], or (b) zero), and (2) the \"constitutional percentage\" (i.e., the larger of (a) total 1989 direct earned premium [including surety, credit, and financial guaranty insurance] minus the total minimum permitted earned premium [including surety, credit, and financial guaranty insurance] divided by total 1989 direct earned premium [excluding surety, credit, and financial guaranty insurance], or (b) zero). (Cal. Code Regs., tit. 10, § 2645.9.) In the refund calculation, the total minimum permitted earned premium is the sum of the minimum permitted earned premium for each of the covered lines of insurance written by the insurer -- the latter functioning only as an intermediate step in the calculation.\n\nCentral to this proceeding is not only the ratemaking formula itself, but also the nature and scope of the hearing at which the individual insurer's rates are reviewed.\n\nConcerning the nature of a hearing for review of rates. Such a hearing has two purposes. (Cal. Code Regs., tit. 10, § 2646.4, subd. (b).)\n\nOne is to determine whether the insurer has properly applied the relevant statutory and regulatory provisions, including generic determinations, in calculating the maximum or minimum permitted earned premium. (Cal. Code Regs., tit. 10, § 2646.4, subd. (b)(1).)\n\nThe other is to determine whether the resulting maximum or minimum permitted earned premium should be adjusted. (Cal. Code Regs., tit. 10, § 2646.4, subd. (b)(2).) A request for such an adjustment is referred to as a \"variance request.\" (Ibid.)\n\nThere are eight valid bases for a variance request. (Cal. Code Regs., tit. 10, § 2646.4, subd. (c).)\n\nOnly three are applicable to rates under the rate rollback. (Cal. Code Regs., tit. 10, § 2646.4, subd. (d).) They are:\n\nFirst, the \"one-line\" variance: \"The insurer should be authorized a rate of return\" other than 10 percent \"on the ground that the insurer writes in only one line and its mix of business presents investment risks different from the risks that are typical of the line as a whole.\" (Cal. Code Regs., tit. 10, § 2646.4, subd. (c)(4).)\n\nSecond, the \"entering-the-market\" variance: \"The insurer should be granted relief from operation of the efficiency standard for a line of insurance in which the insurer has never previously written over $1 million in earned premiums annually and in which the insurer has made or is making a substantial investment in order to enter the market. . . .\" (Cal. Code Regs., tit. 10, § 2646.4, subd. (c)(5).)\n\nAnd third, the \"insurer-insolvency\" variance: \"The insurer's financial condition is such that its maximum permitted earned premium should be increased in order to protect the insurer's solvency. . . .\" (Cal. Code Regs., tit. 10, § 2646.4, subd. (c)(8).)\n\nConcerning the scope of a hearing for review of rates. \"Relitigation in a hearing on an individual insurer's rates of a matter already determined either by these regulations or by a generic determination is out of order and shall not be permitted. However, the administrative law Judge shall admit evidence he or she finds relevant to the determination of whether the rate is excessive or inadequate (or, in the case of a proceeding [concerning a rate for the rollback year], relevant to the determination of the minimum nonconfiscatory rate), whether or not such evidence is expressly contemplated by these regulations, provided the evidence is not offered for the purpose of relitigating a matter already determined by these regulations or by a generic determination.\" (Cal. Code Regs., tit. 10, § 2646.4, subd. (e).) This is commonly referred to as the \"relitigation bar.\"\n\nB. The Insurance Commissioner's Determination of 20th Century's Rate Rollback Liability\n\nLet us now turn from the Insurance Commissioner's rate regulations to his determination of 20th Century's rate rollback liability.\n\nIt appears that a week after we handed down Calfarm, the Insurance Commissioner's predecessor gave public notice that insurers who wished to do so could file applications for approval of rates for the rollback year higher than the maximum rate of 80 percent of the 1987 rate (hereafter \"rollback-exemption\" applications), and could charge such higher rates pending approval.\n\nIt further appears that 20th Century filed seven \"rollback-exemption\" applications and proceeded to charge the indicated higher rates -- which seem to have been about 12.63 percent greater than the 1987 rate -- pending approval. The firm writes six lines of insurance.\n\nSubsequently, in File No. REB--5173 the Insurance Commissioner issued an order to show cause and notice of hearing in the matter of 20th Century's rate rollback liability. The commissioner indicated that 20th Century should refund to each insured an amount equal to the premiums paid for the rollback year multiplied by a refund percentage of 13.34 percent, with simple interest calculated at 10 percent per annum from May 8, 1989, to the date of payment.\n\nA hearing on the Insurance Commissioner's order to show cause was held before an administrative law Judge. The hearing was extensive. In her own words, the administrative law Judge considered \"hundreds of pages of prefiled testimony and detailed exhibits as well as several weeks of live testimony, posthearing briefs and oral argument . . . .\"\n\nThe administrative law Judge issued a proposed decision that fills 185 pages. Evidently for the purpose of subsequent judicial review, she effectively lifted the \"relitigation bar\" to allow 20th Century to introduce evidence to challenge the premises of the rate regulations, \"according it the opportunity to present evidence . . . on every issue that it contended was material.\" She also recognized a constitutionally mandated \"variance\" -- separate and independent from those established in the regulations in question -- which would be available to 20th Century on proof of confiscation, for which she allowed \"evidence and argument on whether the rollback formula . . . yielded unconstitutional and confiscatory results as applied to 20th Century\" and thereby \"justified or required departure from the regulations . . . .\" As pertinent here, her determinations were to the following effect.\n\nDuring 20th Century's rollback liability hearing, the rate regulations were in effect, notwithstanding the OAL's disapproval at various times.\n\nProposition 103 authorizes the Insurance Commissioner to adopt rate regulations to implement the rate rollback requirement provision. \"The regulations,\" explained the administrative law Judge, \"avoid the administrative gridlock that would result from readjudicating over and over hundreds of issues that affect multiple insurers in lengthy hearings that would yield inconsistent results -- if they ever yielded any result at all.\" (Italics added in place of underscoring in original.) \"The regulations employ generic determinations and a detailed formula designed to ensure manageability and consistent treatment of insurers and insureds.\" \"At the same time, the regulations incorporate multiple company-specific factors into the rollback formula, and then are applied in individual adjudicatory hearings. The company-specific hearings allow further tailoring to a company's situation . . . .\"\n\nSpecifically, Proposition 103 authorizes the Insurance Commissioner to adopt rate regulations to implement the rate rollback requirement provision with a view toward factors including the individual insurer's profits and not -- as 20th Century claims he must -- through the imposition of general \"price caps\" on the rates of insurers generally. 20th Century's rates for the rollback year might survive the imposition of such \"price caps\" because they were relatively low -- reflecting its relatively low costs: it is a direct writer of insurance, and therefore does not employ or utilize captive or independent agents; and it is very selective as to its insureds, choosing preferred risks. But, observed the administrative law Judge, 20th Century's argument for regulation by \"price caps\" rather than factors including profits is bottomed on \"policy\" rather than law -- specifically, a \"policy\" that \"would have us ignore Calfarm's emphasis on\" such factors as profits \"and Proposition 103's call for reduction of rates industry-wide,\" \"regardless of whether the rates were low or high by industry standards . . . .\" (Italics added in place of underscoring in original.) Confiscation requires at least \"deep financial hardship\" -- albeit \"deep financial hardship\" short of bankruptcy -- within the meaning of Jersey Central. (Jersey Cent. Power \u0026 Light Co. v. F.E.R.C., supra, 810 F.2d at p. 1181, fn. 3.) Moreover, it \"is an enterprise-wide issue, not one to be parsed on a line-by-line basis.\" Under the rate rollback requirement provision -- to use the terms appearing in Insurance Code section 1861.05, subdivision (a) -- a rate is \"inadequate\" if confiscatory and \"excessive\" if more than minimally nonconfiscatory and above 80 percent of the 1987 rate.\n\nProposition 103 authorizes the Insurance Commissioner to adopt a ratemaking formula to implement the rate rollback requirement provision. Specifically, it empowers him to frame a ratemaking formula to determine whether, for an individual insurer, a maximum rate for the rollback year higher than 80 percent of the 1987 rate is required to avoid confiscation and, if so, what such higher maximum rate is.\n\nSubstantively, the rate regulations are valid on their face as necessary and proper for the implementation of Proposition 103's rate rollback requirement provision.\n\nSpecifically, the rate regulations are sound insofar as they define 10 percent as the lower boundary of the range of reasonable rates of return in the ratemaking formula. The administrative law Judge stated that the 10 percent rate of return was based \"on the average historical rates of return actually achieved by the industry between 1980 and 1989, rather than theoretical investor expectations determined by econometric models.\" She noted that the \"industry earned an average 9.1% return . . . in 1989\" under statutory accounting principles, and that \"over the 10 years from 1980 to 1989 averaged a 10% return\" under both statutory accounting principles and generally accepted accounting principles. (Internal quotation marks omitted.) She concluded that \"use of actual historical rates of return rather than inherently speculative hypothetical projections of investor expectations is . . . reasonable . . ., particularly for a time period now already past.\" The ratemaking formula, it must be noted, does not purport to guarantee any individual insurer a rate covering its cost of service plus 10 percent of its capital base independent of the various adjustments, exclusions, etc., incorporated therein. There is no constitutional or other requirement than all reasonable expenses and prudent investments must be allowed.\n\nThe rate regulations are also sound insofar as they recognize investment income in the ratemaking formula. \"Unlike other businesses such as public utilities,\" observed the administrative law Judge, \"insurers need not transform their capital into physical assets like a power plant, but may keep them instead in liquid assets like stocks and bonds. Surplus may simultaneously support the insurance business and earn investment income.\"\n\nThe rate regulations are sound as well insofar as they concern the line of earthquake insurance, which is of particular interest because the Loma Prieta earthquake struck Northern California during the rollback year. They subject all insurers to consistent treatment, including direct ratemaking -- which is used to avoid a possible loophole since reinsurance is generally not regulated (Ins. Code, § 1851, subd. (a)). They yield generally supportable outcomes for individual insurers, although they disfavor those whose incurred losses are small and favor those whose incurred losses are large. In any event, they do not themselves determine the insurer's rate rollback liability. The minimum permitted earned premium for the earthquake line must not be viewed in isolation as an end result. Together with the minimum permitted earned premium for each of the insurer's other lines, it functions only as an intermediate step in the refund calculation.\n\nWith specific regard to direct ratemaking, the administrative law Judge observed: The Insurance Commissioner's adoption of \"direct ratemaking as a consistent basis for determining rollback obligations\" is a \"reasonable policy choice . . . .\" One of 20th Century's witnesses \"admitted that 20th Century, like the industry generally,\" uses direct ratemaking. He also \"agreed that as a matter of policy the Commissioner should adopt a consistent basis for all insurers and that direct ratemaking would greatly benefit companies with large reinsured losses like those who paid claims due to the Loma Prieta earthquake.\" He \"acknowledged\" that \"most insurers benefit from use of the direct basis since they had large losses ceded to reinsurers in 1989 due to the Loma Prieta earthquake . . ., and those recoveries from reinsurers are not recognized on a direct basis. Therefore, the uniform use of direct rather than net ratemaking was more favorable to the industry as a whole, while placing the higher rollback obligation on those with low losses and thus better able to pay it.\" \"Further, while 20th Century's argument that direct ratemaking is unfair because it ignores money actually paid to purchase reinsurance in 1989 has some appeal at first blush, it ignores the fact that any set of accounting rules necessarily includes conventions which in a sense deviate from actual expenditures. Indeed, 20th Century benefits from the regulations' recognition of 1989 reserves as if those amounts were actually paid, when in fact the claims covered by reserves were actually paid after 1989.\" Surely, \"losses are a major component\" in the rate regulations -- both generally and specifically as to rollbacks. But that is simply \"because the nature of the insurance business is to indemnify losses.\"\n\nThe rate regulations are also sound insofar as they require a uniform, maximum rate for the rollback year, and a uniform percentage refund of premiums overcharged and overpaid therein, without regard to claimed \"excessiveness\" or \"inadequacy\" in individual lines.\n\nFurther, the rate regulations are not impermissibly \"retroactive.\"\n\nProcedurally, the rate regulations are valid on their face as necessary and proper for the implementation of Proposition 103's rate rollback requirement provision. Specifically, they are sound insofar as they provide for a hearing on an individual insurer's rate rollback liability. They do not preclude an \"individualized\" hearing by reason of the nature or number of the potentially available variances, viz., the \"one-line,\" \"entering-the-market,\" and \"insurer-insolvency\" variances. Neither do they preclude an \"individualized\" hearing by reason of the \"relitigation bar.\"\n\nMoreover, substantively and procedurally, the rate regulations are valid as necessary and proper for the implementation of Proposition 103's rate rollback requirement provision as applied to 20th Century.\n\nThe operation of the ratemaking formula with its variables deriving their values from firm-specific data necessarily afforded 20th Century whatever rate adjustment was necessary to avoid confiscation. The hearing thereon was \"individualized\" and altogether full and fair.\n\nFurther, 10 percent as the lower boundary of the range of reasonable rates of return is not confiscatory as to 20th Century.\n\n20th Century introduced evidence in an attempt to establish its entitlement to a rate of return of at least 20 percent and perhaps as high as 99 percent. The evidence related to 20th Century's cost of capital.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e \"Cost of capital\" may be defined as the rate of return available in the marketplace on investments comparable in terms of risk and otherwise or, more practically, as the expected rate of return a hypothetical investor would require to take a position in the firm in question. Specifically, the evidence looked to 20th Century's cost of capital derived from various econometric models directed toward the \"optimal prospective rate of return based on hypothetical investor expectations.\"\n\n20th Century's cost-of-capital evidence was deemed immaterial by the administrative law Judge. The adjective \"optimal\" is inapt: Under Proposition 103 as construed in Calfarm, for the rollback year the Insurance Commissioner \"must select a rate at or near the bottom of the range of rates which are constitutional. Yet [20th Century] has ignored the lower end of the range, instead focusing exclusively on the highest rate of return that might conceivably be expected by investors in 1989.\" Also inapt is the adjective \"prospective\": \"While estimated returns are pertinent for prospective ratemaking [under the \"prior approval\" system], implementation of the rollback does not require prospective ratemaking but rather the determination of a minimum nonconfiscatory return for a period now past.\" (Internal quotation marks omitted.)\n\n20th Century's cost-of-capital evidence was also deemed unpersuasive by the administrative law Judge. One of 20th Century's main expert witnesses \"testified to a constitutionally required rate of return (ultimately 33 percent, earlier 41.5 percent, and even higher when he initially advocated more than doubling his figures) that exceeds 20th Century's actual rate of return\" of about 31.51 percent under statutory accounting principles and 32.52 percent under generally accepted accounting principles.\n\nNeither is any of the following confiscatory as to 20th Century: the treatment of the line of earthquake insurance, including direct ratemaking; the variable expense factor; the leverage factor; or the requirement of a uniform, maximum rate for covered insurance for the rollback year, and a uniform percentage refund of premiums overcharged and overpaid therein, without regard to claimed \"excessiveness\" or \"inadequacy\" in individual lines.\n\nAs to the treatment of the line of earthquake insurance, including direct ratemaking, the administrative law Judge observed: \"The component of the rollback calculation related to 20th Century's Earthquake line may appear somewhat harsh when it is viewed in isolation . . ., as if it were the final result rather than only an intermediate step in the calculation. However, 20th Century's rollback must be Judged on the issue of confiscation based on the overall result. [Citation.] From that perspective, the impact is not confiscatory. [Citation.] 20th Century is a multi-line insurer whose Earthquake line accounted for only 1.35 percent of its business ($8.7 million of $641.7 million) in the rollback year, and its unrecognized reinsurance premiums on Earthquake only accounted for 0.7 percent of its business ($4.5 million of $641.7 million). [Citation.] It admittedly suffered very low losses in its Earthquake line that year [because of its concentration in southern California, which did not experience the Loma Prieta earthquake] and its cost of writing that coverage was small (estimated . . . to be as low as five dollars per policy, [citation]), so it enjoyed a high profit in that line. In any case, calculation of the Earthquake component of the rollback is merely one of the many intermediate steps to the final rollback.\" (Fn. omitted.)\n\nAs to the leverage factor, the administrative law Judge observed: \"For rollback, the regulations use whichever is higher, the actual leverage ratio that the insurer had in the rollback year or a specified ratio.\" (For the \"prior approval\" system, by contrast, they use a specified leverage ratio, even if the actual ratio is higher.) 20th Century \"contends that for the rollback year it should be permitted to earn a profit on a higher level of surplus (i.e., lower leverage or premium-to-surplus ratio) than it actually had that year, because as a more highly leveraged company, it was riskier and therefore entitled to a higher rate of return.\" This \"contention boils down to an unjustifiable request to earn a profit on capital that it did not have.\" In addition, 20th Century \"omits the corollary to its argument that its stockholders deserve a higher return because of the greater risk entailed by [its] high leverage ratio: that policyholders who purchased its insurance for security and peace of mind shared in this higher risk, and probably did so involuntarily.\"\n\nImplicit in the administrative law Judge's observation is a recognition that the leverage factor is crucial to the determination of rates. As stated, the ratemaking formula is designed to yield a premium that the insurer should receive from its insureds in order to earn a sum amounting to (1) the reasonable cost of providing insurance and (2) the capital used and useful for providing insurance multiplied by a fair rate of return. The leverage factor directly contributes to the definition of the capital that is deemed used and useful for providing insurance by inverse relationship: the higher the leverage ratio, the smaller the used-and-useful capital; the lower the leverage ratio, the greater the used-and-useful capital. It follows that the leverage factor indirectly contributes to the setting of the rate itself by inverse relationship: the higher the leverage ratio, the smaller the used-and-useful capital and hence the smaller the rate; the lower the leverage ratio, the greater the used-and-useful capital and hence the greater the rate. Thus, so far as the determination of rates is concerned, the insurer generally favors a lower leverage ratio and its insureds generally favor a higher leverage ratio. The nonrecognition of capital that \"turns out not to be 'used and useful' is not confiscatory,\" observed the administrative law Judge, no matter the prudence of the underlying investment.\n\nThe administrative law Judge concluded: \"Nowhere in the hundreds of pages of testimony, exhibits and argument that 20th Century has proffered in support of its argument of confiscation has it claimed that its rollback would pose the type of deep financial hardship . . . that rises to the level of confiscation. At most, it has argued that it would not be able to expand as rapidly as it has in the past because its reduced surplus after a rollback would not support as large a growth in premiums written. [Citations.] Even assuming that this were true, 20th Century has cited no case holding that a slowdown in growth is confiscatory. The clear evidence that 20th Century has been able to expand rapidly largely through use of retained earnings, selling stock only once in the last six years while growing from a $500 million to a $1 billion company [citation], undercuts 20th Century's claim that it will not be able to raise new surplus if forced to rollback. Moreover, to the extent that 20th Century has already set aside reserves against its rollback liability, with a corresponding reduction in surplus, the impact of that reduction has already occurred. [Citation.] Yet 20th Century has continued to grow by more than 10 percent each year from 1989 through 1991.\" (Fn. omitted.)\n\nThe Insurance Commissioner adopted the administrative law Judge's proposed decision as his own. In accordance therewith, he ordered 20th Century to refund to each insured an amount equal to the premiums paid for the rollback year multiplied by a refund percentage of 12.203 percent, with simple interest calculated at 10 percent per annum from May 8, 1989, to the date of payment. In so doing, he effectively set 20th Century's maximum rate for the rollback year at about 98.89 percent of the 1987 rate to avoid confiscation, rather than at 80 percent of that rate, as required by Proposition 103 in the rate rollback requirement provision. Put differently, he reduced 20th Century's maximum rate for the rollback year to a point a mere 1.11 percent below the 1987 rate, rather than to a point 20 percent below that rate.\n\nThe Insurance Commissioner's decision on the rate rollback liability of 20th Century is the first and only final determination of this sort. The commissioner chose the 20th Century matter as a \"test case,\" in part because of its relative simplicity. It appears that more determinations of rate rollback liability will follow: The commissioner represents that about 460 insurers have filed over 4,000 \"rollback-exemption\" applications, and have proceeded to charge the indicated higher rates.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nC. The Superior Court's Decision\n\nAfter a bench trial, the superior court filed its statement of decision herein, which fills 85 pages. It limited its scope to the rate regulations as to rollbacks and the 20th Century rate rollback order. It found and concluded to the following effect.\n\nThe litigation is not moot. The rate regulations were in effect during 20th Century's rate rollback liability hearing and were applied to determine its rate rollback liability, as expressed in the rate rollback order. 20th Century has challenged both the regulations and the order. The latter stands. Whether or not the former are in effect -- or were in effect at times other than 20th Century's rollback hearing -- is of no consequence here. It was noted that the Insurance Commissioner had taken the position that the rate regulations come within the rate-setting exception, hence fall outside the OAL review requirement, and therefore are not invalid because of OAL disapproval. Whether his position was well taken was not resolved.\n\nVarious standards of review are applicable. At the threshold, whether Proposition 103 authorizes the Insurance Commissioner to adopt rate regulations to implement the initiative, specifically the rate rollback requirement provision, is examined independently. Next, whether the rate regulations actually adopted by the commissioner as to rollbacks are consistent with the measure is also examined independently. By contrast, whether the rate regulations actually adopted by the commissioner as to rollbacks are necessary and proper for the initiative's implementation is scrutinized for arbitrariness and/or capriciousness. Finally, in reviewing the 20th Century rate rollback order issued by the commissioner, the court is required to weigh the evidence in accordance with its independent judgment and then to sustain the decision if it finds adequate evidentiary support and to strike it down if it does not.\n\nUnder independent review, the rate regulations as to rollbacks are not invalid on their face as statutorily unsupported. Proposition 103 authorizes the Insurance Commissioner to adopt rate regulations to implement the rate rollback requirement provision. More particularly, it empowers him to define \"unreasonable or imprudent expenses [or investments],\" the relevant capital base, and a rate of return applicable thereto corresponding to the lower boundary of the range of reasonable rates of return.\n\nNevertheless, under independent review, the rate regulations as to rollbacks are invalid on their face with respect to the ratemaking formula. Proposition 103 does not authorize the Insurance Commissioner to adopt a ratemaking formula to implement the rate rollback requirement provision. To begin with, the initiative does not empower the commissioner to frame any ratemaking formula whatsoever. It does not permit him to set rates himself. Rather, as a general matter, it allows him merely to approve or disapprove rates proposed by individual insurers, applying (as relevant here) the \"excessive\"\"inadequate\" standard. As to rollbacks specifically, it requires him to approve any proposed rate that is minimally above the \"inadequate\" and to disapprove any other, even if such other rate falls at some other point below the \"excessive.\" (Under the rate rollback requirement provision -- to use the terms appearing in Insurance Code section 1861.05, subdivision (a) -- a rate is \"inadequate\" if confiscatory and \"excessive\" if more than minimally nonconfiscatory and above 80 percent of the 1987 rate.) Further, it would not empower him to frame the ratemaking formula in question. That formula is \"recursive.\" It is also \"unique\" and without \"precedent\" among \"similar statutes containing the widely used\" \"excessive\"\"inadequate\" standard. In addition, it is internally inconsistent: through operation of the efficiency standards, the variable expense factor, and the leverage factor, it precludes a rate covering the individual insurer's cost of service plus 10 percent of its capital base -- a 10 percent rate of return on the capital base being defined as the lower boundary of the range of reasonable rates of return. Through such preclusion, the formula is also confiscatory. Confiscation does not require \"deep financial hardship\" within the meaning of Jersey Central. Rather, it arises whenever a rate does not \"produce[] a profit which an investor could reasonably expect to earn in other businesses with comparable investment risks and which is sufficient to attract capital.\"\n\nIn view of the foregoing, the rate regulations as to rollbacks are invalid in relevant part and the 20th Century rate rollback order, issued pursuant thereto, is void.\n\nIn the event an appellate court might disagree, the superior court resolved other significant issues as follows.\n\nUnder the arbitrary-or-capricious standard, the rate regulations as to rollbacks are not invalid on their face insofar as they require that an insurer's capital be measured in accordance with statutory accounting principles or SAP, which apparently operate to limit the capital base to capital used and useful for providing insurance. In this regard, they are necessary and proper for the implementation of Proposition 103's rate rollback requirement provision. The superior court stated that the Insurance Commissioner could reasonably have concluded that insureds \"need not provide a return on capital which is not required for insurance business.\" It implied that he could reasonably have concluded as well that insureds need not provide a return on capital that is not actually employed for that purpose.\n\nUnder the arbitrary-or-capricious standard, the rate regulations as to rollbacks are not invalid on their face insofar as they define 10 percent as the lower boundary of the range of reasonable rates of return. In this regard, they are necessary and proper for the implementation of Proposition 103's rate rollback requirement provision. The superior court observed: \"It is really rather obvious from the record herein that all [econometric] models can be manipulated/applied to produce a great range of rates of return.\"\n\nUnder (apparently) independent review, the rate regulations as to rollbacks are invalid on their face insofar as they treat the line of earthquake insurance as they do. Proposition 103 does not authorize the Insurance Commissioner to adopt regulations of this sort to implement the rate rollback requirement provision. The regulations in question are unsound in that they subject insurers to direct ratemaking, which does not recognize a firm's expenses for reinsurance, even if reasonable. In this regard -- the superior court implied -- they offend the United States and California Constitutions, specifically, their respective takings and due process clauses. The regulations in question are also unsound in that they depend in substantial part on the individual insurer's incurred losses for the rollback year. In this regard -- the superior court implied -- they violate the initiative's proscription of \"inadequate\" rates in Insurance Code section 1861.05, subdivision (a): calculations are based on loss data from a single year; calculations for the earthquake line, however, should be based on loss data from more than one year, because this line (along with others) is one with losses of \"low-frequency\" but \"high-severity\"; calculations for the earthquake line, if based on loss data from a single year with relatively small losses, are skewed to the confiscatory.\n\nUnder (apparently) independent review, the rate regulations as to rollbacks are invalid on their face insofar as they incorporate the leverage factor. Proposition 103 does not authorize the Insurance Commissioner to adopt regulations of this sort to implement the rate rollback requirement provision. Indeed -- the superior court effectively declared -- the United States and California Constitutions stand in prohibition, specifically, their respective takings and due process clauses: \"Leverage reflects risk. The Commissioner recognizes this as to prospective rates by allowing more highly leveraged insurers to use [a lower] 'normative leverage factor' rather than [their] actual [higher] leverage. The result is a higher allowed rate of return to compensate such insurers for [their] greater risk.[\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e] No such normative factor applies to rollbacks. . . . [Hence,] a significant amount of actual 'proper' 1989 surplus\" is \"disallowed or disregarded . . . . This result is confiscatory on its face.\"\n\nUnder (apparently) independent review, the rate regulations as to rollbacks are invalid on their face insofar as they preclude an \"individualized\" hearing on an individual insurer's rate rollback liability. Proposition 103 does not authorize the Insurance Commissioner to adopt regulations of this sort to implement the rate rollback requirement provision. Indeed -- the superior court effectively declared -- the United States and California Constitutions stand in prohibition, specifically, their respective takings and due process clauses. The regulations in question are \"preclusive\" in the following two respects. First, the regulations do not allow a variance or variances sufficient for rate adjustments necessary to avoid confiscation: the only potentially available variances are inadequate, each separately and all together -- the \"one-line\" variance is too narrow; the \"entering-the-market\" variance is the same; and the \"insurer-insolvency\" variance is too demanding. Second, the regulations impose the \"relitigation bar,\" which assertedly operates to prevent proof of confiscation in and of itself (including the lower boundary of the range of reasonable rates of return), even if there were a sufficient variance or variances. As stated, confiscation does not require \"deep financial hardship\" within the meaning of Jersey Central.\n\nUnder independent review, the rate regulations as to rollbacks are not invalid on their face insofar as they require a uniform, maximum rate for the rollback year, and a uniform percentage refund of premiums overcharged and overpaid therein, without regard to claimed \"excessiveness\" or \"inadequacy\" in individual lines. Proposition 103 authorizes the Insurance Commissioner to adopt rate regulations of this sort to implement the rate rollback requirement provision.\n\nUnder independent review, the rate regulations as to rollbacks are not invalid on their face insofar as they require the insurer to pay interest on the dollar amount of premiums overcharged and overpaid for the rollback year. Proposition 103 authorizes the Insurance Commissioner to adopt rate regulations of this sort to implement the rate rollback requirement provision. Indeed, as construed in Calfarm, it enjoins him to demand payment of interest: \"insurers must refund excess premiums collected [for the rollback year] with interest.\" (Calfarm Ins. Co. v. Deukmejian, supra, 48 Cal. 3d at p. 825, italics added.) Also, under the arbitrary-or-capricious standard, the rate regulations as to rollbacks are not invalid on their face insofar as they fix the rate of interest at 10 percent per annum, uncompounded. In this regard, they are necessary and proper for the initiative's implementation: \"It is not unreasonable or arbitrary\" -- according to the superior court -- \"for the Commissioner to choose the same rate for rollbacks\" that the Legislature chose for unearned premiums in Insurance Code section 481.5; he is not constrained by article XV, section 1 of the California Constitution, which in relevant part provides for a maximum rate of interest on a judgment of 10 percent, if set at that level by the Legislature, or 7 percent, in the absence of action by the Legislature; the constitutional provision \"is inapplicable to the insurer's obligation to pay interest on rollbacks because that obligation can hardly be viewed as a 'judgment'\"; furthermore, in Code of Civil Procedure section 685.010 the Legislature has in fact set the rate of interest on a judgment at 10 percent. Finally, under the arbitrary-or-capricious standard, the rate regulations as to rollbacks are not invalid on their face insofar as they set the accrual date at May 8, 1988, the midpoint of the rollback year. In this regard too, they are necessary and proper for the initiative's implementation: \"Arguably\" -- according to the superior court -- \"the Commissioner could have chosen the beginning of the rollback year as the accrual date. The choice of the midpoint is certainly fair to all.\"\n\nUnder the independent-judgment-on-the-evidence standard, the rate regulations as to rollbacks are invalid as applied to 20th Century, and the 20th Century rate rollback order issued pursuant thereto is void, in the following six particulars. First is the ratemaking formula itself. Second is 10 percent as the lower boundary of the range of reasonable rates of return: at least 20 percent is the appropriate figure for 20th Century. Third is the treatment of the line of earthquake insurance: 20th Century is subjected to direct ratemaking, which does not recognize the firm's reasonable expenses for reinsurance for the rollback year; moreover, the firm experiences an insupportable outcome, inasmuch as it is treated unfavorably because its incurred losses for the rollback year were small. Fourth is the variable expense factor. Fifth is the leverage factor. Sixth is the preclusion of an \"individualized\" hearing on rate rollback liability -- included therein is a finding of fundamental unfairness in the conduct of the hearing. It appears that the foregoing determinations have constitutional and statutory bases, involving as to the latter offense to Proposition 103 and as to the former confiscation and arbitrariness, discrimination, and demonstrable irrelevance to legitimate policy. At the same time, the rate regulations as to rollbacks are not invalid as applied, and the order issued pursuant thereto is not void, as to the requirement of a uniform, maximum rate for the rollback year, and a uniform percentage refund of premiums overcharged and overpaid therein, without regard to claimed \"excessiveness\" or \"inadequacy\" in individual lines. It appears that the foregoing determination was made under constitutional and statutory principles, implying a finding of no offense to Proposition 103 and no confiscation or arbitrariness, discrimination, or demonstrable irrelevance to legitimate policy.\n\nIn accordance with its statement of decision, the superior court rendered judgment in favor of 20th Century, Allstate, Hartford, State Farm, et al., and against the Insurance Commissioner and Voter Revolt. Specifically, it ordered, adJudged, and decreed that: (1) certain of the rate regulations as to rollbacks are invalid, viz., the ratemaking formula as such and many of its individual components (Cal. Code Regs., tit. 10, §§ 2644.3, 2644.12, 2644.15, 2645.3, subd. (a), 2645.5, subds. (b) \u0026 (c), 2645.6, subds. (b) \u0026 (c)), the \"relitigation bar\" (id., tit. 10, § 2646.4, subd. (e)), and the \"insurer-insolvency\" variance (id., tit. 10, § 2646.4, subd. (c)(8)); and (2) a peremptory writ of mandate should issue commanding the commissioner to (a) set aside the 20th Century rate rollback order, (b) reconsider the matter in light of the superior court's decision, and (c) refrain from enforcing the regulations referred to above or any order made pursuant thereto. The superior court also caused issuance of the described peremptory writ of mandate.\n\nThe Insurance Commissioner and Voter Revolt filed separate notices of appeal. 20th Century, Allstate, and Hartford together with other insurers including State Farm, filed separate notices of cross-appeal. The appeals and cross-appeals were docketed in the Court of Appeal, Second Appellate District, in No. B074704.\n\nThereupon, the Insurance Commissioner and Voter Revolt filed separate petitions requesting predecision transfer to this court. 20th Century, Allstate, Hartford, and State Farm filed separate answers, supporting (20th Century, Hartford, and State Farm) or at least not opposing (Allstate) the requests. The commissioner also submitted a petition for writ of supersedeas. Allstate, Hartford, and State Farm submitted separate answers in opposition. Concluding that it was premature to consider supersedeas unless and until we ordered transfer, we declined to file any of these pleadings.\n\nSubsequently, we ordered transfer. At the same time, effectively filing the relevant petition and answers, we denied supersedeas.\n\nIII. DISCUSSION\n\nIn their appeal, the Insurance Commissioner and Voter Revolt and amici curiae supporting their position (hereafter collectively the Insurance Commissioner or the commissioner) raise numerous claims of error regarding the decision of the superior court. In their cross-appeal, 20th Century, Allstate, and Hartford together with other insurers and amici curiae supporting their position (hereafter collectively the insurers) raise numerous claims of their own.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nA. Mootness\n\nAt the threshold, the superior court determined that the litigation is not moot. Neither the Insurance Commissioner nor the insurers contend that there was error in this regard. Rightly so.\n\nWe agree with the superior court that the rate regulations as to rollbacks were in effect at the time of 20th Century's rate rollback hearing and were applied to determine its rate rollback liability, as expressed in the rate rollback order, and that 20th Century has challenged both the regulations and the order.\n\nWe go beyond the superior court, however, in the following regard. We believe that the Insurance Commissioner's position, as noted above, is well taken. The rate regulations -- both generally and specifically as to rollbacks -- do indeed come within the rate-setting exception, hence fall outside the OAL review requirement, and therefore are not invalid because of OAL disapproval. (Cf. State Comp. Ins. Fund v. McConnell (1956) 46 Cal. 2d 330, 343, 294 P.2d 440 [arriving at a similar Conclusion under a similar, predecessor legislative scheme (see, e.g., former Gov. Code, § 11380, subd. (a)(1), Stats. 1953, ch. 1362, § 1, p. 2933; former Gov. Code, § 11421, subd. (a), Stats. 1953, ch. 515, § 1, p. 1755) as to certain \"regulations\" adopted by the Insurance Commissioner \"fixing and establishing insurance premium rates\" for workers' compensation insurance]; see also California Assn. of Nursing Homes etc., Inc. v. Williams (1970) 4 Cal. App. 3d 800, 821, 84 Cal. Rptr. 590 [effectively distinguishing McConnell with regard to a regulation adopted by the Director of Health Care Services providing for reimbursement to nursing and convalescent homes for medical assistance rendered to persons covered by the Medi-Cal program].)\n\nB. Standards of Review\n\nBefore we undertake to review the substance of the superior court's decision, we must determine what standard of review is appropriate. We may summarize the governing principles thus.\n\n\"Questions of fact concern the establishment of historical or physical facts; their resolution is reviewed under the substantial-evidence test. Questions of law relate to the selection of a rule; their resolution is reviewed independently. Mixed questions of law and fact concern the application of the rule to the facts and the consequent determination whether the rule is satisfied. If the pertinent inquiry requires application of experience with human affairs, the question is predominantly factual and its determination is reviewed under the substantial-evidence test. If, by contrast, the inquiry requires a critical consideration, in a factual context, of legal principles and their underlying values, the question is predominantly legal and its determination is reviewed independently.\" (Crocker National Bank v. City and County of San Francisco (1989) 49 Cal. 3d 881, 888, 264 Cal. Rptr. 139, 782 P.2d 278.)\n\nIt is plain that the decision of the superior court is subject to independent review. Considered as a whole, it amounts to the resolution of a congeries of questions of law and mixed questions of law and fact that are predominantly legal, including of course that of confiscation. De novo scrutiny is proper. In its parts, it embraces the resolution of questions of law and mixed questions of law and fact that are predominantly legal. Again, de novo scrutiny is proper.\n\nAfter independent review, we believe that the superior court's determination of the standards of review appropriate to its task was correct.\n\nThat is to say, whether Proposition 103 authorizes the Insurance Commissioner to adopt rate regulations to implement the initiative is indeed examined independently. (See, e.g., California Assn. of Psychology Providers v. Rank (1990) 51 Cal. 3d 1, 11-12, 270 Cal. Rptr. 796, 793 P.2d 2; Association for Retarded Citizens v. Department of Developmental Services (1985) 38 Cal. 3d 384, 390-391, 211 Cal. Rptr. 758, 696 P.2d 150.)\n\nWhether the rate regulations actually adopted, including the incorporated generic determinations, are consistent with Proposition 103 -- and with the law generally -- is also examined independently. (See, e.g., California Assn. of Psychology Providers v. Rank, supra, 51 Cal. 3d at pp. 11-12; Association for Retarded Citizens v. Department of Developmental Services, supra, 38 Cal. 3d at pp. 390-391.)\n\nBut whether the rate regulations actually adopted by the Insurance Commissioner, including the incorporated generic determinations, are necessary and proper for the implementation of Proposition 103 is scrutinized for arbitrariness and/or capriciousness. (E.g., California Assn. of Psychology Providers v. Rank, supra, 51 Cal. 3d at pp. 11-12; see id. at p. 11, fn. 5 [noting that \"Government Code section 11350, subdivision (b), . . . also permits a court to declare a regulation invalid if 'the agency's determination that the regulation is reasonably necessary to effectuate the purpose of the statute, court decision, or other provision of law which is being implemented, interpreted, or made specific by the regulation is not supported by substantial evidence[]'\"].)\n\nLastly, in reviewing the 20th Century rate rollback order issued by the Insurance Commissioner, the superior court is required to weigh the evidence in accordance with its independent judgment and then to sustain the order if it finds adequate evidentiary support and to strike it down if it does not. Insurance Code section 1861.08, which was added by Proposition 103, provides for hearings by the commissioner on the rates of individual insurers. Insurance Code section 1861.09, which also was added by the initiative, provides for judicial review of the commissioner's decisions relative thereto. It specifies that \"judicial review shall be in accordance with\" Insurance Code section 1858.6, which antedates the initiative: \"Any finding, determination, rule, ruling or order made by the commissioner\" on rates \"shall be subject to review by the courts of the State . . . . In such proceedings on review, the court is authorized and directed to exercise its independent judgment on the evidence and unless the weight of the evidence supports the findings, determination, rule, ruling or order of the commissioner, the same shall be annulled. . . .\"\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e In reviewing the superior court's findings, the appellate court considers whether they are supported by substantial evidence. (E.g., Bixby v. Pierno (1971) 4 Cal. 3d 130, 143, fn. 10, 93 Cal. Rptr. 234, 481 P.2d 242.)\n\nThe insurers contend that the superior court erred by determining that the arbitrary-or-capricious standard of review, as opposed to the independent-judgment-on-the-evidence test, is applicable to the question whether the rate regulations actually adopted by the Insurance Commissioner, including the incorporated generic determinations, are necessary and proper for the implementation of Proposition 103.\n\nWe reject the claim. The arbitrary-or-capricious standard of review is the rule as to whether regulations are necessary and proper for the implementation of a statute. There is no reason to create an exception here. Our explanation follows.\n\nAs incorporated in Proposition 103 indirectly through Insurance Code section 1861.08 and directly through Insurance Code section 1861.09, Insurance Code section 1858.6 applies the independent-judgment-on-the-evidence standard of review to decisions by the Insurance Commissioner on the rates of individual insurers. The provision does not extend the test to the commissioner's adoption of rate regulations. That causes no surprise. Such authority as the commissioner may have under the initiative to promulgate regulations of this sort is implied and not express. We cannot find in the initiative, either in Insurance Code section 1861.09 or elsewhere, what the insurers purport to discern, i.e., an intent to require all determinations by the commissioner bearing on rates to be subject to the independent-judgment-on-the-evidence test.\n\nInsofar as it may be said to operate outside Proposition 103, Insurance Code section 1858.6 functions similarly. That is to say, it applies the independent-judgment-on-the-evidence standard of review to various decisions by the Insurance Commissioner on the rates of individual insurers and related matters -- specifically, \"any rate charged, rating plan, rating system, or underwriting rule followed or adopted by [any] insurer or rating organization\" (Ins. Code, § 1858, subd. (a)). But it does not extend the test to the commissioner's adoption of rate regulations. The fact that it contains the term \"rules,\" which is sometimes synonymous with regulations, and the terms \"findings\" and \"determinations,\" which are always implicated in regulations, might be of consequence only if statutory construction indulged in hypertechnical parsing. It does not.\n\nThat Insurance Code section 1858.6 so functions is supported by its legislative history. It was added (Stats. 1947, ch. 805, § 1, p. 1906) and amended (Stats. 1949, ch. 174, § 1, p. 406) as part of the former \"open competition\" system of regulation. That system did not provide for the adoption of rate regulations.\n\nOn the matter of legislative history, the insurers direct our attention to the McBride-Grunsky Insurance Regulatory Act of 1947 (hereafter the McBride-Grunsky Act), which established the \"open competition\" system of regulation and added Insurance Code section 1858.6. They also direct our attention to the source of the McBride-Grunsky Act, which was certain \"model rate regulatory legislation recommended by the National Association of Insurance Commissioners . . . .\" (Weinstock \u0026 Maloney, Historical Preface, History and Development of Insurance Law in California, 42 West's Ann. Ins. Code (1972 ed.) p. lxvii.)\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e The model legislation embodied a kind of \"prior approval\" system, under which the adoption of rate regulations would not be inappropriate. Departing therefrom, the McBride-Grunsky Act set up the \"open competition\" system, under which the opposite was true. (See Weinstock \u0026 Maloney, supra, p. lxvii [stating the McBride-Grunsky Act's \"enforcement approach is the hindsight method and the principal instrumentality of such enforcement is the power of examination which the statute vests in the Commissioner\"].) As the superior court correctly concluded, the McBride-Grunsky Act \"clearly did not contemplate adoption of rate regulations, but was concerned with rating plans and underwriting rules . . . .\" To identify the intent that underlies Insurance Code section 1858.6, the insurers seek to go behind the McBride-Grunsky Act to the model legislation. This they may not do. The intent that controls is that of the Legislature that enacted the McBride-Grunsky Act with its \"open competition\" system. It is not that of the National Association of Insurance Commissioners that recommended the model legislation with its kind of \"prior approval\" system.\n\nThe insurers may then be understood to argue that, for standard-of-review purposes, the rate regulations as to rollbacks should not be deemed regulations. The adoption of regulations by an administrative agency is an action that is, in nature, quasi-legislative rather than quasi-adjudicative. (See, e.g., Gov. Code, § 11346 [implying that the \"adoption . . . of . . . regulations\" is an \"exercise of quasi-legislative power\"]; see also id., § 11342, subd. (b) [defining \"regulation\" in pertinent part as \"every rule, regulation, order, or standard of general application\"].) The sense of the argument seems to be that the regulations in question are quasi-adjudicative rather than quasi-legislative, or at least more the former than the latter.\n\nAs a general matter, an \"administrative action is quasi-legislative\" when the \"administrative agency is creating a new rule for future application . . . .\" (Dominey v. Department of Personnel Administration (1988) 205 Cal. App. 3d 729, 737, fn. 4, 252 Cal. Rptr. 620; accord, Strumsky v. San Diego County Employees Retirement Assn. (1974) 11 Cal. 3d 28, 35, fn. 2, 112 Cal. Rptr. 805, 520 P.2d 29 [stating that, \"generally speaking, a legislative action is the formulation of a rule to be applied to all future cases\"]; Wilson v. Hidden Valley Mun. Water Dist. (1967) 256 Cal. App. 2d 271, 280, 63 Cal. Rptr. 889 [to similar effect: \"quasi-legislative action . . . 'prescribes what the law shall be in future cases arising under it'\"].)\n\nBy contrast, an \"administrative action is . . . quasi-adjudicative\" when the \"administrative agency . . . is applying an existing rule to existing facts.\" (Dominey v. Department of Personnel Administration, supra, 205 Cal. App. 3d at p. 737, fn. 4; accord, Strumsky v. San Diego County Employees Retirement Assn., supra, 11 Cal. 3d at p. 35, fn. 2 [stating that, \"generally speaking, . . . an adjudicatory act involves the actual application of . . . a rule to a specific set of existing facts\"]; Wilson v. Hidden Valley Mun. Water Dist., supra, 256 Cal. App. 2d at pp. 279-280 [to similar effect: \"quasi-judicial . . . action . . . 'determines what the law is, and what the rights of parties are, with reference to transactions already had'\"].)\n\nThe classification of administrative action as quasi-legislative or quasi-adjudicative \"contemplates the function performed . . . .\" (Pitts v. Perluss (1962) 58 Cal. 2d 824, 834, 27 Cal. Rptr. 19, 377 P.2d 83.) And, we think, only the function performed.\n\nUnder these principles, we believe that, for standard-of-review purposes, the rate regulations as to rollbacks must surely be deemed regulations. They are quasi-legislative and not quasi-adjudicative.\n\nAs noted, the rate regulations as to rollbacks include: (1) regulations strictly so called, viz., rules generally applicable to all insurers formulated in quasi-legislative proceedings; and (2) regulations incorporating generic determinations, viz., findings relating to all or at least several insurers made in consolidated hearings conducted in accordance with quasi-adjudicatory procedures and then adopted as regulations.\n\nIn whole and in part, the adoption of the rate regulations as to rollbacks constitutes the creation of \"new rules for future application . . . .\" (Dominey v. Department of Personnel Administration, supra, 205 Cal. App. 3d at p. 737, fn. 4; accord, Strumsky v. San Diego County Employees Retirement Assn., supra, 11 Cal. 3d at p. 35, fn. 2; Wilson v. Hidden Valley Mun. Water Dist., supra, 256 Cal. App. 2d at p. 280.) It does not amount simply to the application of \"existing rules to existing facts.\" (Dominey v. Department of Personnel Administration, supra, 205 Cal. App. 3d at p. 737, fn. 4; accord, Strumsky v. San Diego County Employees Retirement Assn., supra, 11 Cal. 3d at p. 35, fn. 2; Wilson v. Hidden Valley Mun. Water Dist., supra, 256 Cal. App. 2d at pp. 279-280.)\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nOur Conclusion that the rate regulations as to rollbacks are quasi-legislative is unremarkable. When performed by an administrative agency, ratemaking has uniformly been considered a quasi-legislative action. (See, e.g., California Hotel \u0026 Motel Assn. v. Industrial Welfare Com. (1979) 25 Cal. 3d 200, 211, 157 Cal. Rptr. 840, 599 P.2d 31 [implying that an administrative agency \"exercises a legislative function\" when it \"adopts orders, rules, regulations, and policies to fix\" rates].) That is because \"ratemaking is an essentially legislative act . . . .\" (New Orleans Pub. Serv., Inc. v. New Orleans (1989) 491 U.S. 350, 371, 105 L. Ed. 2d 298, 109 S. Ct. 2506.)\n\nThat is self-evidently true so far as the creation of general rules is concerned. (See, e.g., California Hotel \u0026 Motel Assn. v. Industrial Welfare Com., supra, 25 Cal. 3d at p. 211 [implying that an administrative agency \"exercises a legislative function\" when it \"adopts . . . rules, regulations, and policies to fix\" rates].)\n\nBut it is true as well so far as the application of such rules in individual cases is involved. (See, e.g., Prentis v. Atlantic Coast Line (1908) 211 U.S. 210, 226, 53 L. Ed. 150, 29 S. Ct. 67 [stating that the \"establishment of a rate . . . is an act legislative not judicial in kind\"]; Wood v. Public Utilities Commission (1971) 4 Cal. 3d 288, 292, 93 Cal. Rptr. 455, 481 P.2d 823 [stating that \"in fixing rates, a regulatory commission exercises legislative functions . . . and does not, in so doing, adjudicate vested interests or render quasi-judicial decisions\"].) That Insurance Code section 1861.08, which provides for hearings by the Insurance Commissioner on the rates of individual insurers, requires the use of quasi-adjudicatory procedures (Ins. Code, § 1861.08 [\"Hearings shall be conducted pursuant to Sections 11500 through 11528 of the Government Code,\" which relate to administrative adjudication]) is not inconsistent. The \"presence of certain elements usually characteristic of the judicial process\" does not \"mean that the\" commissioner's \"action\" is quasi-adjudicative. (Wilson v. Hidden Valley Mun. Water Dist., supra, 256 Cal. App. 2d at p. 279; accord, City of Santa Cruz v. Local Agency Formation Com. (1978) 76 Cal. App. 3d 381, 388, 142 Cal. Rptr. 873; see Pacifica Corp. v. City of Camarillo (1983) 149 Cal. App. 3d 168, 176, 196 Cal. Rptr. 670; Patterson v. Central Coast Regional Com. (1976) 58 Cal. App. 3d 833, 841, 130 Cal. Rptr. 169.)\n\nThe insurers argue to the effect that ratemaking is ultimately a judicial function, at least when the question of confiscation is present. Of course, confiscation is always implicated, at least potentially, whenever rates are set. In spite of that fact, it is established beyond peradventure that ratemaking is not a judicial function. (E.g., Prentis v. Atlantic Coast Line, supra, 211 U.S. at p. 226.) The analysis the insurers employ is inapt. That the determination of what compensation is just after a taking has been effected belongs to the courts says nothing about ratemaking, which seeks among other goals to set prices to avoid effecting a taking in the first place. Obviously, ratemaking is subject to judicial review. But that is another matter. Further, the approach the insurers take is no longer current. To a greater or lesser degree, their Discussion is animated by Lochner v. New York (1905) 198 U.S. 45, 49 L. Ed. 937, 25 S. Ct. 539, and its ancestors and progeny. That line, however, is long since dead. Contrary to what appears to be their belief, \"the day is gone when\" courts could \"use[] the Due Process Clause of the Fourteenth Amendment\" -- or any other provision of the United States Constitution -- \"to strike down state laws, regulatory of business and industrial conditions, because they may be unwise, improvident, or out of harmony with a particular school of thought.\" (Williamson v. Lee Optical Co. (1955) 348 U.S. 483, 488, 99 L. Ed. 563, 75 S. Ct. 461.)\n\nTo conclude that the rate regulations as to rollbacks are quasi-legislative is not to deny that their adoption involved the \"finding\" of \"facts,\" both in the formulation of the regulations strictly so called and perhaps especially in the making of the generic determinations.\n\nBut the \"finding\" of such \"facts\" does indeed belong to the quasi-legislative function. That is the case when, as here, the administrative agency's task \"was to receive and consider economic and social data, as well as opinion and argument, covering large numbers of people and wide sectors of the economy; to select a series of positions aimed at the statutory objectives but shaped by discretion and policy; finally, to express its selection in rules regulating the future conduct of relatively broad classes of persons.\" (Rivera v. Division of Industrial Welfare (1968) 265 Cal. App. 2d 576, 586, 71 Cal. Rptr. 739.)\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nSimilarly, to conclude that the rate regulations as to rollbacks are quasi-legislative is not to deny that their adoption entailed the use of quasi-adjudicatory procedures in the making of the generic determinations.\n\nBut the fact that regulations are formulated under quasi-adjudicative procedures does not undermine their quasi-legislative nature. As stated, the \"presence of certain elements usually characteristic of the judicial process\" does not \"mean that the\" Insurance Commissioner's \"action\" is quasi-adjudicative. (Wilson v. Hidden Valley Mun. Water Dist., supra, 256 Cal. App. 2d at p. 279.) \"Administrators exercising quasi-legislative powers commonly resort to the [judicial] hearing procedure to uncover, at least in part, the facts necessary to arrive at a sound and fair legislative decision. . . . Hence the presence of certain characteristics common to the judicial process does not change the basically quasi-legislative nature of . . . proceedings\" of that type. (Ibid., citations and fn. omitted; accord, City of Santa Cruz v. Local Agency Formation Com., supra, 76 Cal. App. 3d at p. 388.) True, \"to hold hearings, take evidence and make findings creates characteristics shared by adjudicatory proceedings . . . .\" (Rivera v. Division of Industrial Welfare, supra, 265 Cal. App. 2d at p. 587.) Nonetheless, it \"does not stamp the function with an adjudicative character.\" (Ibid.)\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nC. The General Validity of the Rate Regulations as to Rollbacks\n\nThe superior court determined that the rate regulations as to rollbacks are not invalid on their face as statutorily unsupported.\n\nIn our review, we must briefly address a threshold issue.\n\nThe insurers contend in this proceeding as they contended in Calfarm that Proposition 103's rate rollback requirement provision, viz., Insurance Code section 1861.01, subdivision (a), which sets the maximum rate for the rollback year at 80 percent of the 1987 rate, is facially invalid as confiscatory. Their arguments were weighed and found wanting in Calfarm. There is simply no reason to revisit the issue here.\n\nWithout question, the rate regulations as to rollbacks are not invalid as statutorily unsupported insofar as they relate to procedure. In Calfarm, we determined the Insurance Commissioner's authority in this sphere. There, we held that the commissioner \"has broad discretion to adopt rules and regulations as necessary to promote the public welfare\" in this regard. (Calfarm Ins. Co. v. Deukmejian, supra, 48 Cal. 3d at p. 824.)\n\nNeither are the rate regulations as to rollbacks invalid as statutorily unsupported insofar as they relate to substance. In Calfarm, we did not determine the Insurance Commissioner's authority in this sphere. We do so here. In Calfarm, we held that if an insurer \"believes the rates set by [Insurance Code] section 1861.01, subdivision (a), are confiscatory\" and \"files an application . . . for approval of a higher rate,\" the commissioner must determine whether \"the initiative's rate, or some other rate less than the insurer charged, is fair and reasonable . . . .\" (Calfarm Ins. Co. v. Deukmejian, supra, 48 Cal. 3d at p. 825.) To do so, the commissioner must establish rules to resolve various interstitial legal, policy, and technical issues. An administrative official may frame rules deliberately in quasi-legislative proceedings to adopt regulations. Or he may develop rules ad hoc in the course of quasi-adjudicatory review. We believe that Proposition 103 authorizes the commissioner to take the former path. As we made plain in Calfarm, the commissioner \"may exercise such . . . powers . . . as may fairly be implied\" from the initiative. (Id. at p. 824, internal quotation marks and italics omitted.) In our view, the adoption of substantive regulations is one of these powers. As construed in Calfarm, Proposition 103 effectively requires the commissioner to establish rules. It implicitly empowers him to proceed by regulation. Certainly, it does not bar him from doing so. Included, of course, are regulations strictly so called, i.e., rules generally applicable to all insurers formulated by the commissioner in quasi-legislative proceedings. Included as well are regulations incorporating generic determinations, i.e., findings relating to all or at least several insurers made by the commissioner in consolidated hearings conducted in accordance with quasi-adjudicatory procedures and then adopted by him as regulations. This follows from our implication in Calfarm that the commissioner could \"consolidate cases\" and generally \"take whatever steps are necessary to reduce the job to manageable size.\" (Ibid.) There is, without doubt, nothing novel in the adoption of regulations incorporating generic determinations. (Cf., e.g., Cal. Code Regs., tit. 22, § 51536 et seq. [setting rates for reimbursement for hospital inpatient services provided to Medi-Cal program beneficiaries]; see especially id., § 51536, subd. (g)(3) [defining a \"market basket classification\"].)\n\nThe insurers argue that the rate regulations as to rollbacks are indeed invalid as statutorily unsupported insofar as they relate to substance. They do not persuade. For the reasons stated, we believe that, as construed in Calfarm, Proposition 103 does indeed authorize the Insurance Commissioner to adopt substantive rate regulations to implement the rate rollback requirement provision. The insurers' assertion -- viz., that in Insurance Code section 1861.08, the initiative requires the commissioner to conduct hearings on the rates of individual insurers by means of quasi-adjudicatory procedures -- is correct. The inference that they attempt to draw -- viz., that the commissioner cannot do anything else relative to rates by any other means -- is unsound. We cannot find in the initiative, either in Insurance Code section 1861.08 or elsewhere, what the insurers purport to discern, i.e., an intent to require all determinations by the commissioner bearing on rates to be made in quasi-adjudicatory proceedings on the rates of individual insurers.\n\nThe insurers then argue that the rate regulations as to rollbacks are invalid as statutorily unsupported insofar as they relate to substance because they are impermissibly \"retroactive.\"\n\nIt is unclear whether and to what extent the superior court made any determination in accordance with the insurers' argument. Insofar as it did, it erred.\n\nThe rate regulations as to rollbacks may properly be considered prospective. The \"fixing of a rate and the reducing of that rate are prospective in application . . . .\" (Consumers Lobby Against Monopolies v. Public Utilities Com., supra, 25 Cal. 3d at p. 909 (lead opn. by Mosk, J.); accord, id. at p. 916 (conc. \u0026 dis. opn. of Richardson, J.).) The ordering of a refund of rates is \"akin to a reduction in rates,\" when, as here, the rates in question were charged \"pending a determination of [their] legality . . . .\" (Id. at p. 910 (lead opn. by Mosk, J.); accord, id. at p. 916 (conc. \u0026 dis. opn. of Richardson, J.).) It follows that the ordering of a refund of rates is itself prospective. Since the regulations in question serve such a refund, they may soundly be viewed to share its character.\n\nBut even if the rate regulations as to rollbacks might be deemed \"retroactive,\" they cannot be deemed impermissibly so. \"'Primary' retroactivity\" -- to coin a phrase -- obtains when regulations \"alter[] the past legal consequences of past actions.\" (American Min. Congress v. U.S.E.P.A. (9th Cir. 1992) 965 F.2d 759, 769, italics in original; see National Medical Enterprises, Inc. v. Sullivan (9th Cir. 1992) 957 F.2d 664, 671.) That is not present here. \"'Secondary' retroactivity\" occurs when regulations \"affect[] the future legal consequences of past transactions . . . .\" (National Medical Enterprises, Inc. v. Sullivan, supra, 957 F.2d at p. 671, italics in original.) That is indeed present. \"But such '\"secondary\" retroactivity' is an entirely lawful consequence of much agency rulemaking and does not by itself render a rule invalid.\" (Ibid.) That it is an \"entirely lawful consequence\" means just that: it does not itself offend any law, including the United States and California Constitutions and their respective due process clauses.\n\nIn making their argument for the impermissible \"retroactivity\" of the rate regulations as to rollbacks, the insurers rely on Bowen v. Georgetown University Hospital (1988) 488 U.S. 204, 102 L. Ed. 2d 493, 109 S. Ct. 468. That decision is distinguishable, concerning as it does certain Medicare cost-limit regulations \"altering the past legal consequences of past actions\" under predecessor regulations. (Id. at p. 219, italics in original (conc. opn. of Scalia, J.).)\n\nWe may observe in passing that the rate regulations as to rollbacks were not adopted until after the rollback year. That fact cannot itself render them impermissibly \"retroactive.\" For about a year prior to the approval of Proposition 103, insurers were on actual notice of the rate rollback requirement provision itself.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nD. The Validity of the Rate Regulations as to Rollbacks With Respect to the Ratemaking Formula\n\nThe superior court determined that the rate regulations as to rollbacks are invalid on their face with respect to the ratemaking formula.\n\nBefore we proceed further, we would do well to make two observations.\n\nOne is relatively narrow, and concerns matters of accounting. In his separate opinion in the landmark decision of Power Comm'n v. Hope Gas Co. (1944) 320 U.S. 591, 88 L. Ed. 333, 64 S. Ct. 281 (hereafter sometimes Hope), Justice Jackson commented: \"To make a fetish of mere accounting is to shield from examination the deeper causes, forces, movements, and conditions which should govern rates. . . . Bookkeeping is hardly an exact science. As a representation of the condition and trend of a business, it uses symbols of certainty to express values that actually are in constant flux. It may be said that in commercial or investment banking or any business extending credit success depends on knowing what not to believe in accounting. Few concerns go into bankruptcy or reorganization whose books do not show them solvent and often even profitable. . . . However, our quest for certitude is so ardent that we pay an irrational reverence to a technique that uses symbols of certainty, even though experience again and again warns us that they are delusive.\" (Id. at pp. 643-644, fn. 40 (opn. of Jackson, J.).) We shall pay no such reverence.\n\nThe other observation is relatively broad, and concerns matters of policy.\n\nUnder Proposition 103 as construed in Calfarm, insurers were allowed to file \"rollback-exemption\" applications. An insurer that filed such an application should not be \"penalized\" for having charged, pending approval and subject to refund, a rate for the rollback year higher than the maximum rate of 80 percent of the 1987 rate. That appears obvious. But neither should it be \"rewarded\" for having done so. That seems less obvious. It is nonetheless true. As stated, the ratemaking formula is designed to yield a premium that the insurer should receive from its insureds in order to earn a sum amounting to (1) the reasonable cost of providing insurance and (2) the capital used and useful for providing insurance multiplied by a fair rate of return. By charging a higher rate for the rollback year, the insurer \"increased\" its cost of providing insurance, for example, by incurring liability for added commissions, state premium tax, and federal income tax on the added premiums. It also \"increased\" its capital multiplied by a rate of return, specifically by \"increasing\" its capital base, for example, by triggering added surplus to back up the added premiums. Such \"increases\" would inflate the premium yielded by the ratemaking formula. They cannot be recognized. If they were, a higher rate would be self-justifying: the fact that the insurer charged such a rate would grant it a right to have done so. That cannot be. There is surely no unfairness in nonrecognition. Insurers were on notice that, in charging a higher rate, they were proceeding at their own risk: they had to establish their entitlement to that rate; it did not carry its entitlement within itself.\n\nFor illustration, let us consider the following example. Insurer A and Insurer B are similarly situated. The 1987 rate for each was $1,000. A maximum rate for the rollback year of 80 percent of the 1987 rate, viz., $800, is nonconfiscatory and otherwise lawful for each under the rate rollback requirement provision of Proposition 103. Not disputing the matter, Insurer A reduces its rate to $800. Filing a \"rollback-exemption application,\" Insurer B takes the opposite path and increases its rate to $1,200. In so doing, Insurer B \"increases\" its cost of providing insurance by incurring liability for: (1) added commissions at, say, the customary rate of 20 percent on the added premium of $400, equaling $80; (2) added state premium tax at, say, the established rate of 2.37 percent on the added premium of $400, equaling $9.48; and (3) added federal income tax at, say, the marginal rate of 34 percent on the added premium of $400, equaling $136 -- to the total of $225.48. Insurer B also \"increases\" its capital multiplied by a rate of return. It does so, specifically, by \"increasing\" its capital base, by triggering added surplus at, say, the simplest leverage ratio of 1:1, to back up the added premium of $400, in the amount of $400. Let us assume a rate of return of 10 percent. Insurer B thereby \"increases\" its capital multiplied by a rate of return to the total of $40. Insurer B's \"increases,\" if they were recognized, would inflate the premium yielded by the ratemaking formula by $265.48 -- $225.48 for the \"cost\" component plus $40 for the \"capital\" component. In other words, Insurer B's \"increases,\" if they were recognized, would \"increase\" its maximum rate for the rollback year from $800 to $1,065.48. They cannot be recognized. Insurer B has charged $400 too much: it must refund that amount. It should suffer no \"penalty\" for its overcharge. That means that it must refund only $400 (exclusive of interest). But neither should it be given a \"reward\" for its overcharge. That means that it must indeed refund $400 (exclusive of interest). Otherwise, inequity would result. There would be unfairness between Insurer A and Insurer B, which would be treated dissimilarly as subjects of the rate rollback requirement provision, Insurer A with a maximum rate of $800 and Insurer B with a maximum rate of $1,065.48. There would also be unfairness between Insurer B and its insureds; the former overcharging the latter and the latter overpaying the former in the amount of $265.48. Lastly, there would be unfairness between the insureds of Insurer A and the insureds of Insurer B, who would be treated dissimilarly as beneficiaries of the rate rollback requirement provision, the former receiving the mandated decrease in rates equaling $200 and the latter receiving a prohibited increase in rates equaling $265.48.\n\nThe first of two major bases on which the superior court rested its determination that the rate regulations as to rollbacks are invalid with respect to the ratemaking formula was its Conclusion to the following effect: Proposition 103 does not authorize the Insurance Commissioner to adopt any ratemaking formula whatsoever to implement the rate rollback requirement provision; it does not permit him to set rates himself; as a general matter, it allows him merely to approve or disapprove rates proposed by individual insurers, applying (as relevant here) the \"excessive\"\"inadequate\" standard; as to rollbacks specifically, it requires him to approve any proposed rate that is minimally above the \"inadequate\" and to disapprove any other, even if such other rate falls at some other point below the \"excessive.\"\n\nThe superior court's Conclusion in this regard is substantially erroneous.\n\nAt the outset, we must make the following observation. Through the ratemaking formula, the Insurance Commissioner does not himself \"set\" rates for insurers. Rather, he simply determines the rate or rates that the individual insurer may itself set within the constraints of Proposition 103 as construed in Calfarm. For the \"prior approval\" system, the ratemaking formula is used to fix for the individual insurer the range of rates within the bounds of the \"excessive\" and the \"inadequate.\" For the rate rollback, with which we are here concerned, it is used to fix for the individual insurer its maximum rate under Proposition 103 as construed in Calfarm -- i.e., the rate that is 80 percent of the 1987 rate or such rate greater than 80 percent of the 1987 rate as is minimally nonconfiscatory.\n\nIn Calfarm, we stated that under Proposition 103 \"any insurer who believes the rates set by [Insurance Code] section 1861.01, subdivision (a), are confiscatory may file an application with the Insurance Commissioner for approval of a higher rate. If that application is filed before November 8, 1989, the insurer may immediately begin charging that higher rate pending approval from the commissioner. After that date insurance rates subject to Proposition 103 must be approved by the commissioner prior to their use, but . . . the commissioner can approve an interim rate pending [his or] her final decision. If the commissioner finds the initiative's rate, or some other rate less than the insurer charged, is fair and reasonable, the insurer must refund excess premiums collected with interest. No insurer, however, will be compelled to charge the rates set by the initiative unless it either acquiesces in that rate or is unable to prove that a higher rate is constitutionally required.\" (Calfarm Ins. Co. v. Deukmejian, supra, 48 Cal. 3d at p. 825, italics added and fn. omitted.)\n\nAs construed in Calfarm, Proposition 103 does in fact authorize the Insurance Commissioner to adopt a ratemaking formula to implement the rate rollback requirement provision -- specifically, to determine whether, for an individual insurer, a maximum rate for the rollback year higher than 80 percent of the 1987 rate is required to avoid confiscation and, if so, what such higher maximum rate is.\n\nBy its very terms, Proposition 103 sets a maximum rate for the rollback year.\n\nAs construed in Calfarm, Proposition 103 requires the Insurance Commissioner, if he finds the initiative's maximum rate confiscatory for an individual insurer, to determine a higher maximum rate that is minimally nonconfiscatory. To do so, he must, as it were, \"make\" a rate. And to do that, we believe, he may proceed by formula rather than case by case. Indeed, it is arguable that he should proceed in that fashion. One of the purposes of Proposition 103 is \"to protect consumers from arbitrary insurance rates . . . .\" (Prop. 103, Gen. Elec. (Nov. 8, 1988), § 2, reprinted in Ballot Pamp., Proposed Stats. and Amends. to Cal. Const. with arguments to voters, Gen. Elec. (Nov. 8, 1988) p. 99.) Formulaic ratemaking furthers that goal. Case-by-case ratemaking does the opposite. (Cf. 1 Davis \u0026 Pierce, Administrative Law Treatise (3d ed. 1994) § 6.7, p. 261 [\"Over the years, commentators, Judges, and Justices have shown near unanimity in extolling the virtues of the rulemaking process over the process of making 'rules' through case-by-case adjudication.\"].) There is, without doubt, nothing novel in the use of formulas of all sorts. (Cf., e.g., Cal. Code Regs., tit. 22, § 51536 et seq. [setting rates for reimbursement for hospital inpatient services provided to Medi-Cal program beneficiaries]; see especially id., § 51549 [establishing a \"reimbursement formula\"].)\n\nIt goes without saying that when the Insurance Commissioner determines that a maximum rate higher than Proposition 103's is minimally nonconfiscatory for an individual insurer, he does not \"set\" a rate. This point bears emphasis because it was inexplicably ignored by the superior court: For the rollback year, strictly speaking, each and every insurer set its own rates; the Insurance Commissioner set not a one.\n\nIn concluding to the contrary, the superior court read Proposition 103 as construed in Calfarm to preclude the Insurance Commissioner from setting rates himself and to allow him merely to approve or disapprove rates proposed by individual insurers, applying (as relevant here) the \"excessive\"\"inadequate\" standard. This was a misreading.\n\nProposition 103 as construed in Calfarm requires the Insurance Commissioner, if he finds the initiative's maximum rate confiscatory for an individual insurer, to determine a higher maximum rate that is minimally nonconfiscatory. He does not \"set\" a rate in so doing.\n\nFurther, it is not the case that Proposition 103 as construed in Calfarm allows the Insurance Commissioner merely to approve or disapprove insurer-proposed rates under the \"excessive\"\"inadequate\" standard. That standard belongs to the \"prior approval\" system, which governs rates from November 8, 1989, into the future. It does not extend to the rate rollback, which obtained for rates from November 8, 1988, through November 7, 1989. Even if it did, it would matter not. The superior court effectively recognized that an individual insurer's maximum rate for the rollback year, if above 80 percent of the 1987 rate, must be that which is minimally nonconfiscatory: Under the rate rollback requirement provision -- to use the terms appearing in Insurance Code section 1861.05, subdivision (a) -- a rate is \"inadequate\" if confiscatory and \"excessive\" if more than minimally nonconfiscatory and above 80 percent of the 1987 rate. It would exalt form over substance, and entail the needless expense of time and money, to hold that the commissioner could only disapprove a perhaps numberless succession of insurer-proposed rates fixed above the minimally nonconfiscatory until finally he was required to approve such a rate that happened to hit the proper level -- instead of simply determining the minimally nonconfiscatory rate at the outset. Proposition 103 as construed in Calfarm does not require the commissioner to take a passive role when an active one is not barred.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nIn supporting the superior court's Conclusion to the effect that Proposition 103 does not authorize the Insurance Commissioner to adopt any ratemaking formula whatsoever to implement the rate rollback requirement provision, the insurers take the same fatal misstep. That is to say, they misread Proposition 103 as construed in Calfarm. Their misreading, however, appears even more profound. They would apparently abrogate the rate rollback requirement provision in its entirety by requiring the commissioner to proceed as under the \"prior approval\" system, i.e., to approve any proposed rate that is below the \"excessive\" and above the \"inadequate.\" The commissioner may not do so. As stated, under the rate rollback requirement provision -- to use the terms appearing in Insurance Code section 1861.05, subdivision (a) -- a rate is \"inadequate\" if confiscatory and \"excessive\" if more than minimally nonconfiscatory and above 80 percent of the 1987 rate. At the heart of the insurers' argument is an assertion to the effect that Calfarm invalidated the rate rollback requirement provision and substituted in its place the substantive standard of the \"prior approval\" system. The assertion is unsupported. Calfarm invalidated the procedural mechanism for relief from the rate rollback requirement provision and not the rate rollback requirement provision itself. It substituted the procedural mechanism for the \"prior approval\" system and not the substantive standard of the \"prior approval\" system.\n\nThe second of the two major bases on which the superior court rested its determination that the rate regulations as to rollbacks are invalid with respect to the ratemaking formula was its Conclusion to the following effect: Proposition 103 does not authorize the Insurance Commissioner to adopt the ratemaking formula in question to implement the rate rollback requirement provision; that formula is \"recursive\"; \"unique\" and without \"precedent\" among \"similar statutes containing the widely used\" \"excessive\"\"inadequate\" standard; and internally inconsistent: through operation of the efficiency standards, the variable expense factor, and the leverage factor, it precludes a return covering the insurer's cost of service plus 10 percent of its capital base -- a 10 percent rate of return on the capital base being defined as the lower boundary of the range of reasonable rates of return; through such preclusion, the formula is also confiscatory; confiscation does not require \"deep financial hardship\" within the meaning of Jersey Central.\n\nIn this regard too, the superior court's Conclusion is substantially erroneous.\n\nTo be sure, the ratemaking formula is indeed \"recursive.\" But contrary to the superior court's evident belief and the insurers' vigorously urged position, that is no vice. The adjective is not pejorative. It is merely descriptive. Simply put, it means in this context that the value solved for figures in the solution itself. For example, an insurer desires to determine the rate it must charge its insureds to net $100 after paying a 20 percent commission to its agents. It uses the following \"recursive\" formula, in which \"r\" refers to the rate to be charged: r = $100 + 0.2 r; r -- 0.2 r = $100; 0.8 r = $100; r = $125. In and of itself, \"recursiveness\" is not objectionable. To the extent that the complaint goes beyond \"recursiveness\" to mere complexity, it fails. Although complicated, the ratemaking formula is not unduly so. (Cf., e.g., Cal. Code Regs., tit. 22, § 51536 et seq. [setting rates for reimbursement for hospital inpatient services provided to Medi-Cal program beneficiaries]; see especially id., § 51549 [establishing a \"reimbursement formula\"].)\n\nSimilarly, the ratemaking formula is apparently \"unique\" and without \"precedent\" among \"similar statutes containing the widely used\" \"excessive\"\"inadequate\" standard. But again contrary to the superior court's evident belief and the insurers' vigorously urged position, that is no vice. The reason is short and simple: So far as the ratemaking formula functions in the rate rollback, the temporary regulatory regime that operated from November 8, 1988, through November 7, 1989, it has nothing to do with the \"prior approval\" system, the permanent regulatory regime that obtains from November 8, 1989, into the future. That the two regimes are distinct is apparent in Proposition 103. It remains such in our construction of the initiative in Calfarm.\n\nIn any event, we must observe that the \"excessive\"\"inadequate\" standard as defined in Proposition 103 is itself apparently \"unique\" and without \"precedent\" among \"similar statutes . . . .\" In subdivision (a) of Insurance Code section 1861.05, it shows itself to be distinguishable from the others: \"In considering whether a rate is excessive, inadequate or unfairly discriminatory, no consideration shall be given to the degree of competition and the commissioner shall consider whether the rate mathematically reflects the insurance company's investment income.\" The insurers direct our attention to what purports to be a campaign statement made prior to the November 8, 1988, General Election by Voter Revolt, the proponent of Proposition 103, to the effect that the \"prior approval\" system in the initiative is \"based on [a] tested system in effect in 19 states.\" The statement says only that the initiative's \"prior approval\" system is based on similar systems. It does not say that it is identical to any one. The insurers argue in substance that the \"excessive\"\"inadequate\" standard as defined in the initiative should be interpreted in accordance with the insurance industry's or the actuarial profession's understanding of its operative terms. We believe that subdivision (a) of Insurance Code section 1861.05, as quoted above, stands in the way.\n\nFurther, the ratemaking formula is not internally inconsistent. Contrary to the superior court's evident assumption, the ratemaking formula does not purport to guarantee the individual insurer a rate covering its cost of service plus 10 percent of its capital base independent of the various adjustments, exclusions, etc., incorporated therein.\n\nWe do not think it improper -- constitutionally or otherwise -- for the rate regulations as to rollbacks to recognize as the insurer's cost of service only the reasonable cost of providing insurance. It is not objectionable that the ratemaking formula's efficiency standards operate to define the reasonable cost of providing insurance after subjecting the insurer's \"expenses . . . to downward normative pressure.\" (Massachusetts Auto. Rating \u0026 Accident Prevention Bureau v. Commissioner of Ins. (1980) 381 Mass. 592, 602, 411 N.E.2d 762.) The insurers charge that such devices are unprecedented outside the monopoly or public utility setting. That does not appear to be the case. (See id. at pp. 602-603.) It is also not objectionable that the ratemaking formula's variable expense factor excludes from the reasonable cost of providing insurance such commissions and state premium taxes as would have been avoided had the insurer charged a rate for the rollback year no higher than the maximum rate set by Proposition 103 as construed in Calfarm -- i.e., the rate that is 80 percent of the 1987 rate or such rate greater than 80 percent of the 1987 rate as is minimally nonconfiscatory. \"It surely cannot be reasonable for an investor to assume that each and every expenditure . . . will be allowed by regulatory authorities.\" (Jersey Cent. Power \u0026 Light Co. v. F.E.R.C., supra, 810 F.2d at p. 1193 (conc. opn. of Starr, J.).)\n\nNeither do we think it improper for the rate regulations as to rollbacks to recognize as the insurer's capital base only the capital used and useful for providing insurance. (See Jersey Cent. Power \u0026 Light Co. v. F.E.R.C., supra, 810 F.2d at p. 1175 [holding that the \"used and useful\" rule is a \"permissible\" \"tool[] of ratemaking\" under the takings clause].) On this point, the superior court is in accord, expressly acknowledging that insureds \"need not provide a return on capital which is not required for insurance business\" and impliedly acknowledging that insureds need not provide a return on capital that is not actually employed for that purpose. As stated above, it appears that the insurance industry's surplus (i.e., its available capital backing up premiums) is greatly represented by appreciating assets, as opposed to depreciating assets. At one and the same time, surplus surplus -- that is, surplus beyond what is useful to back up premiums -- inflates the insurer's capital base and any rate set thereon to the disadvantage of its insureds and also produces investment income from appreciating assets. \"It surely cannot be reasonable for an investor to assume that each and every [investment] . . . will be [recognized] by regulatory authorities.\" (Jersey Cent. Power \u0026 Light Co. v. F.E.R.C., supra, 810 F.2d at p. 1193 (conc. opn. of Starr, J.).)\n\nIn addition, we do not think it improper for the rate regulations as to rollbacks to take account of investment income on capital used and useful for providing insurance. The observation by the administrative law Judge is sound. \"Unlike other businesses such as public utilities, insurers need not transform their capital into physical assets like a power plant, but may keep them instead in liquid assets like stocks and bonds. Surplus may simultaneously support the insurance business and earn investment income.\" Certainly, under the \"prior approval\" system, in the words of Insurance Code section 1861.05, subdivision (a), Proposition 103 expressly requires that the Insurance Commissioner \"shall consider whether the rate mathematically reflects the insurance company's investment income.\" The initiative thereby impliedly requires that the commissioner shall offset the latter against the former. We note that, to the benefit of insurers, the regulations in question take no account of investment income on capital not used and useful for providing insurance. They thereby effectively prohibit the commissioner from considering any of such investment income in carrying out the mandate of Calfarm, i.e., in determining whether, for the individual insurer, a maximum rate for the rollback year higher than 80 percent of the 1987 rate is required to avoid confiscation and, if so, what such higher maximum rate is. In other words, they prevent a portion of investment income that would otherwise reduce an insurer's maximum rate for the rollback year from doing so.\n\nIt bears emphasis that the 10 percent rate of return on the individual insurer's capital base, which is defined as the lower boundary of the range of reasonable rates of return, is not an entitlement conferred by the rate regulations as to rollbacks. It is simply a component of the ratemaking formula. (Fireman's Fund Ins. Co. v. Garamendi, supra, 790 F. Supp. at p. 948.) Of course, any given rate of return can operate to generate a rate that is much too high or much too low. The result depends directly on how the insurer's capital base is determined and indirectly on how its cost of service is specified. If the capital base is overstated, the defined rate of return will produce a return that is unduly high; if the opposite, the same rate of return will produce a return that is unduly low. Similarly, if the cost of service is inflated, the covering of \"expenses\" will itself generate a profit without regard to the defined rate of return; if the opposite, the \"covering\" of expenses will not avoid a loss unless the same rate of return generates an offsetting profit.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nNot only is the ratemaking formula not internally inconsistent, it is also not confiscatory or arbitrary, discriminatory, or demonstrably irrelevant to legitimate policy.\n\nAt this point, we would do well to rehearse, and elaborate on, the principles set out in Calfarm.\n\nThe Fourteenth Amendment to the United States Constitution provides in relevant part that \"[no] state [shall] deprive any person of . . . property, without due process of law . . . .\"\n\n\"The standard for determining whether a state price-control regulation is constitutional under the Due Process Clause is well established: 'Price control is \"unconstitutional . . . if arbitrary, discriminatory, or demonstrably irrelevant to the policy the legislature is free to adopt . . . .\"'\" (Pennell v. San Jose (1988) 485 U.S. 1, 11, 99 L. Ed. 2d 1, 108 S. Ct. 849.) A \"legitimate and rational goal of price or rate regulation is the protection of consumer welfare.\" (Id. at p. 13.)\n\nSuch regulation is presumptively constitutional under the due process clause. (See, e.g., Tenoco Oil Co. v. Dept. of Consumer Affairs (1st Cir. 1989) 876 F.2d 1013, 1022, fn. 15.) \"The burden of proving\" otherwise \"rests on the party asserting the violation . . . .\" (Ibid.) It \"is not easily met. For the last half-century, courts have upheld challenged governmental acts unless no reasonably conceivable set of facts could establish a rational relationship between the regulation and the government's legitimate ends.\" (Ibid., italics in original.) \"It is enough that there is an evil at hand for correction, and that it might be thought that the particular . . . measure was a rational way to correct it.\" (Williamson v. Lee Optical Co., supra, 348 U.S. at p. 488 [speaking generally of state regulation of \"business and industrial conditions\"].)\n\nThe Fifth Amendment to the United States Constitution declares as pertinent here that \"private property [shall not] be taken for public use without just compensation.\" This prohibition binds the states through the mandate of the Fourteenth Amendment, quoted above, that \"[no] state [shall] deprive any person of . . . property, without due process of law . . . .\" (Chicago, Burlington \u0026c. R'D v. Chicago (1897) 166 U.S. 226, 235-241, 41 L. Ed. 979, 17 S. Ct. 581.) In other words, the Fifth Amendment's takings clause is enforceable against the states through the Fourteenth Amendment's due process clause.\n\nThe takings clause limits the power of the states to regulate, control, or fix prices that producers charge consumers for goods or services. (See, e.g., Duquesne Light Co. v. Barasch (1989) 488 U.S. 299, 307-308, 102 L. Ed. 2d 646, 109 S. Ct. 609.)\n\n\"Rate-making is indeed but one species of price-fixing. [Citation.] The fixing of prices, like other applications of the police power, may reduce the value of the property which is being regulated. But the fact that the value is reduced does not mean that the regulation is invalid.\" (Power Comm'n v. Hope Gas Co., supra, 320 U.S. at p. 601.)\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nThe crucial question under the takings clause is whether the rate set is just and reasonable. (See, e.g., Duquesne Light Co. v. Barasch, supra, 488 U.S. at pp. 307-308.) If it is not just and reasonable, it is confiscatory. (Ibid.) If it is confiscatory, it is invalid. (Ibid.) \"It is the result reached not the method employed which is controlling.\" (Power Comm'n v. Hope Gas Co., supra, 320 U.S. at p. 602; see Duquesne Light Co. v. Barasch, supra, 488 U.S. at p. 310.) The method may of course be traditional, and may involve case-by-case ratemaking using data reflecting the condition and performance of the regulated firm as an individual entity. But it may also be novel (see Duquesne Light Co. v. Barasch, supra, 488 U.S. at p. 316 [stating that the \"designation of a single theory of ratemaking as a constitutional requirement would unnecessarily foreclose alternatives which could benefit both consumers and investors\"]), and may implicate formulaic ratemaking (see Permian Basin Area Rate Cases (1968) 390 U.S. 747, 768-770, 20 L. Ed. 2d 312, 88 S. Ct. 1344) using data reflecting the condition and performance of a group of regulated firms (see id. at pp. 766-790; Giles Lowery Stockyards v. Dept. of Agriculture (5th Cir. 1977) 565 F.2d 321, 327 [\"The 'just and reasonable' principle does not require 'that the cost of each company be ascertained and its rates fixed with respect to its own costs. [Citation.] It is permissible for an agency to use average costs rather than the costs of individual\" regulated firms.]). It is not subject to piecemeal examination: \"The economic judgments required in rate proceedings are often hopelessly complex and do not admit of a single correct result. The Constitution is not designed to arbitrate these economic niceties.\" (Duquesne Light Co. v. Barasch, supra, 488 U.S. at p. 314.) And, of course, courts are not equipped to carry out such a task. (See, e.g., Harris v. Capital Growth Investors XIV (1991) 52 Cal. 3d 1142, 1166, 278 Cal. Rptr. 614, 805 P.2d 873 [stating that \"we are ill equipped to make\" \"microeconomic decisions\"].) \"So long as rates as a whole afford [the regulated firm] just compensation for [its] over-all services to the public,\" they are not confiscatory. (B. \u0026 O. R. Co. v. United States (1953) 345 U.S. 146, 150, 73 S. Ct. 592, 97 L. Ed. 912.) That a particular rate may not cover the cost of a particular good or service does not work confiscation in and of itself. (See id. at pp. 147-150.) In other words, confiscation is Judged with an eye toward the regulated firm as an enterprise.\n\nThe answer to the question whether the rate set is just and reasonable depends on a balancing of the interests of the producers of the goods or services under regulation and the interests of the consumers of such goods or services.\n\nIn Power Comm'n v. Hope Gas Co., supra, 320 U.S. 591, the court spoke through Justice Douglas.\n\nThe Hope court made plain that the consumer has a legitimate interest in freedom from exploitation. (See Power Comm'n v. Hope Gas Co., supra, 320 U.S. at p. 610 [recognizing that \"exploitation\" of consumers \"at the hands of natural gas companies\" was an \"evil[]\"]; see generally Power Comm'n v. Pipeline Co. (1942) 315 U.S. 575, 606-608, 86 L. Ed. 1037, 62 S. Ct. 736 (conc. opn. of Black, Douglas, and Murphy, JJ.).)\n\nThe Hope court also made plain that, for its part, the producer \"has a legitimate concern with [its own] financial integrity . . . . From the investor or company point of view it is important that there be enough revenue not only for operating expenses but also for the capital costs of the business. These include service on the debt and dividends on the stock. [Citation.] By that standard the return to the equity owner should be commensurate with returns on investments in other enterprises having corresponding risks. That return, moreover, should be sufficient to assure confidence in the financial integrity of the enterprise, so as to maintain its credit and to attract capital.\" (Power Comm'n v. Hope Gas Co., supra, 320 U.S. at p. 603.)\n\nIt must be emphasized that the foregoing describes an interest that the producer may pursue and not a right that it can demand. That interest is \"only one of the variables in the constitutional calculus of reasonableness.\" (Permian Basin Area Rate Cases, supra, 390 U.S. at p. 769.) \"A regulated [firm] has no constitutional right to a profit . . . .\" (Jersey Cent. Power \u0026 Light Co. v. F.E.R.C., supra, 810 F.2d at pp. 1180-1181; accord, Power Comm'n v. Pipeline Co., supra, 315 U.S. at p. 590 [\"regulation does not insure that the business shall produce net revenues\"]; Power Comm'n v. Hope Gas Co., supra, 320 U.S. at p. 603, quoting Power Comm'n v. Pipeline Co., supra, 315 U.S. at p. 590.) Indeed, such a firm has no constitutional right even against a loss. (See Market Street R. Co. v. Comm'n (1945) 324 U.S. 548, 564, 89 L. Ed. 1171, 65 S. Ct. 770 [holding that a rate is not necessarily \"confiscatory\" even if it \"compels\" a regulated firm \"to operate at a loss\"].)\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nIn balancing the relevant producer and consumer interests for a just and reasonable rate, one is concerned with a \"broad zone of reasonableness\" and not with any particular point therein. (Permian Basin Area Rate Cases, supra, 390 U.S. at p. 770.) So long as the rate set is within that zone, \"there can be no constitutional objection . . . .\" (Ibid.)\n\nIn attempting to balance producer and consumer interests, one may of course arrive at a rate that disappoints one or even both parties. But a striking of the balance to the producer's detriment does not necessarily work confiscation. Indeed, it can threaten confiscation only when it prevents the producer from \"operating successfully\" -- as that phrase is impliedly defined in prior opinions and is expressly used in this, viz., operating successfully during the period of the rate and subject to then-existing market conditions.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nThe Hope court itself expressly held that \"rates which enable the company to operate successfully, to maintain its financial integrity, to attract capital, and to compensate its investors for the risks assumed certainly cannot be condemned as invalid, even though they might produce only a meager return . . . .\" (Power Comm'n v. Hope Gas Co., supra, 320 U.S. at p. 605.) A year later, the court restated this holding in even simpler terms in a unanimous opinion by Justice Jackson: \"a company [cannot] complain if the return which was allowed made it possible for the company to operate successfully.\" (Market Street R. Co. v. Comm'n, supra, 324 U.S. at p. 566.)\n\nThe Hope court's holding is indisputably vital. Just five years ago, in Duquesne Light Co. v. Barasch, supra, 488 U.S. 299, the court, in an opinion by Chief Justice Rehnquist, undertook to \"review[] 90 years of\" its own \"cases concerning . . . rate regulation\" (2 Rotunda \u0026 Nowak, Treatise on Constitutional Law (2d ed. 1992) § 15.12, p. 504) and then went on to \"reaffirm the[] teachings\" of Hope, quoting in the process the holding set out above (Duquesne Light Co. v. Barasch, supra, 488 U.S. at p. 310). Consistently with Hope, it effectively defined a \"confiscatory\" rate thus: \"A rate is too low if it is 'so unjust as to destroy the value of [the] property for all the purposes for which it was acquired,' and in so doing 'practically deprives the owner of property without due process of law[.]'\" (Id. at pp. 307-308, quoting Covington \u0026c. Turnpike Co. v. Sandford (1896) 164 U.S. 578, 597, 41 L. Ed. 560, 17 S. Ct. 198.)\n\nThus, a producer may complain of confiscation only if the rate in question does not allow it to operate successfully. This Conclusion follows from the Hope court's holding that it cannot complain if it enables it to operate successfully. (See Tribe, American Constitutional Law (2d ed. 1988) p. 593, fn. 3 [characterizing Hope as a \"standard that only the most egregiously confiscatory rate structure would have difficulty meeting\"].) In a word, the inability to operate successfully is a necessary -- but not sufficient -- condition of confiscation.\n\nIn Jersey Central, the United States Court of Appeals for the District of Columbia Circuit, sitting in bank, and speaking through Judge Bork, explained: \"Under Hope, . . . the only circumstances under which there is a possibility of a taking of investors' property by virtue of rate regulation is when a [regulated firm] is in the sort of financial difficulty described in Justice Douglas' opinion,\" viz., \"deep financial hardship.\" (Jersey Cent. Power \u0026 Light Co. v. F.E.R.C., supra, 810 F.2d at p. 1181, fn. 3.) The firm may experience such hardship when it does not earn enough revenue for both \"operating expenses\" and \"the capital costs of the business,\" including \"service on the debt and dividends on the stock,\" of a magnitude that would allow a \"return to the equity owner\" that is \"commensurate with returns on investments in other enterprises having corresponding risks\" and \"sufficient to assure confidence in the financial integrity of the enterprise, so as to maintain its credit and to attract capital.\" (Power Comm'n v. Hope Gas Co., supra, 320 U.S. at p. 603.) \"But absent the sort of deep financial hardship described in Hope,\" concluded the Jersey Central court, \"there is no taking . . . .\" (Jersey Cent. Power \u0026 Light Co. v. F.E.R.C., supra, 810 F.2d at p. 1181, fn. 3.) This follows from the fact that, under Hope, a regulated firm may claim that a rate is confiscatory only if the rate does not allow it to operate successfully. In such circumstances, the firm is not inaptly characterized as experiencing \"deep financial hardship\" as a result of the rate.\n\nAlthough Jersey Central was not unanimous, on this point at least the Dissenters were in accord with the majority. \"In Hope,\" stated Judge Mikva, \"the Court faced an assertion by the [regulated firm] that the rates fixed by the [regulator] were so low as to be unjust and unreasonable. In testing this challenge, the Court essentially questioned whether the [regulated firm's] shareholders had anything to complain about. The Court examined what was 'important' 'from the investor or company point of view' and found that the rate at issue fully satisfied any legitimate investor interest. [Citation.] Accordingly, the Court held that the rate could not be condemned from the investor viewpoint. [Citation.] One year later, Justice Jackson, speaking for a unanimous court [in Market Street R. Co. v. Comm'n, supra, 324 U.S. at page 566, restated] . . . the Court's holding in Hope: 'All that was held was that a company could not complain if the return which was allowed made it possible for the company to operate successfully.'\" (Jersey Cent. Power \u0026 Light Co. v. F.E.R.C., supra, 810 F.2d at p. 1211 (dis. opn. of Mikva, J.).)\n\nWhen, as here, the question arises whether a regulation is violative of the takings clause on its face, the question is whether its terms preclude the setting of a rate that is just and reasonable as to the regulated firm, and hence nonconfiscatory. (Cf. Calfarm Ins. Co. v. Deukmejian, supra, 48 Cal. 3d at p. 816 [speaking of a statute]; but see Fireman's Fund Ins. Co. v. Garamendi, supra, 790 F. Supp. at p. 948 [implying that a regulation is not properly subject to a facial takings challenge either in whole or in part].)\n\nFinally, the law under the due process clause of article I, sections 7 and 15 of the California Constitution and the takings clause of article I, section 19 of that same instrument is in accord with the foregoing principles.\n\nAgainst this background, the ratemaking formula cannot be deemed arbitrary, discriminatory, or demonstrably irrelevant to legitimate policy. It is demonstrably relevant to the policy of protection of consumer welfare -- a policy that the voters were free to adopt, and did in fact adopt, in approving Proposition 103. Further, it is not arbitrary, taking an approach to rates that is a reasonable one, although not the only such approach. Lastly, it is not discriminatory. To the extent that it may be said to disfavor insurers and favor their insureds, it does so well within the limits marked out by due process jurisprudence since at least the late 1930's.\n\nNeither can the ratemaking formula be deemed confiscatory. Its terms do not themselves preclude the setting of a rate that is just and reasonable. Put differently, they do not themselves impose a rate, to quote Jersey Central, that inflicts on insurers \"the sort of deep financial hardship described in Hope . . . .\" (Jersey Cent. Power \u0026 Light Co. v. F.E.R.C., supra, 810 F.2d at p. 1181, fn. 3.)\n\nThis point is crucial. It deserves special emphasis. The superior court committed fundamental error. At least in the general case, such as this, confiscation does indeed require \"deep financial hardship\" within the meaning of Jersey Central, i.e., the inability of the regulated firm to operate successfully--meaning, again, the inability of the regulated firm to operate successfully during the period of the rate and subject to then-existing market conditions. (Accord, Rural Telephone Coalition v. F.C.C. (D.C. Cir. 1988) 267 U.S. App. D.C. 357, 838 F.2d 1307, 1313 [following Jersey Central to hold that \"absent 'deep financial hardship . . . there is no taking'\"].) Hence, it does not arise, as the superior court erroneously believed, whenever a rate simply does not \"produce[] a profit which an investor could reasonably expect to earn in other businesses with comparable investment risks and which is sufficient to attract capital.\" Profit of that magnitude is, of course, an interest that the producer may pursue. But it is not a right that it can demand. It is \"only one of the variables in the constitutional calculus of reasonableness.\" (Permian Basin Area Rate Cases, supra, 390 U.S. at p. 769.) In FERC v. Pennzoil Producing Co. (1979) 439 U.S. 508, 518, 58 L. Ed. 2d 773, 99 S. Ct. 765, the court declared, with a quotation from Hope, that the \"notion that [a regulator] is required to maintain, or even allowed to maintain to the exclusion of other considerations, the profit margin of any particular [regulated firm] is incompatible . . . with a basic precept of rate regulation. 'The fixing of prices, like other applications of the police power, may reduce the value of the property which is being regulated. But the fact that the value is reduced does not mean that the regulation is invalid.'\"\n\nIn concluding that the ratemaking formula cannot be deemed confiscatory on the ground that its terms themselves preclude the setting of a rate that is just and reasonable, we have given special attention to the definition of 10 percent as the lower boundary of the range of reasonable rates of return. The Fireman's Fund court considered an argument by insurers, including those here, \"that the 10% rate of return set by the Commissioner is the constitutional minimum, and that any improperly disallowed expenses, or improper decreases in the capital base to which the rate of return is applied, have the effect of lowering the rate below the constitutional minimum.\" (Fireman's Fund Ins. Co. v. Garamendi, supra, 790 F. Supp. at p. 948.) The court rejected the point. \"[The insurers] assume that the Commissioner selected the 10% figure in a vacuum. By itself, the figure has no constitutional dimension. And it is not res judicata on the issue of what constitutes the minimum nonconfiscatory rate. As the Commissioner points out, 'the 10 percent is not the \"end result\" of the regulations but merely a component.\"' It is the end result that counts.\" (Ibid.) We are in accord.\n\nIt must be remembered that the rate regulations as to rollbacks expressly provide for variances as the final mechanism for rate adjustments necessary to avoid confiscation. We believe that if confiscation nonetheless results, it is properly charged against the variances. We shall turn to that question below. (See pt. III.I., post.)\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nIn supporting the superior court's Conclusion that Proposition 103 does not authorize the Insurance Commissioner to adopt the ratemaking formula in question to implement the rate rollback requirement provision, the insurers make a number of arguments. Most have been anticipated and answered in the preceding Discussion. Their ultimate constitutional premise is unsound. To repeat: At least in the general case, such as this, confiscation does indeed require \"deep financial hardship\" within the meaning of Jersey Central. Hence, it does not arise, as the superior court erroneously believed, whenever a rate does not \"produce[] a profit which an investor could reasonably expect to earn in other businesses with comparable investment risks and which is sufficient to attract capital.\" Profit of that magnitude is, of course, an interest that the producer may pursue. But it is not a right that it can demand. It is \"only one of the variables in the constitutional calculus of reasonableness.\" (Permian Basin Area Rate Cases, supra, 390 U.S. at p. 769.)\n\nThe insurers also argue against the ratemaking formula on what appears to be the ground that the United States and/or California Constitutions prohibit the use of such a formula, at least when constitutional rights are implicated. More than 50 years of regulatory jurisprudence in this court and the United States Supreme Court refute the assertion.\n\nThe insurers further argue against the ratemaking formula with what appears to be an assertion that the formula may prove to be even more \"confiscatory\" than the rate rollback requirement provision of Proposition 103 itself. The former offers a possibility of relief from the latter's maximum rate. It simply cannot reduce that rate further.\n\nIn addition, the insurers argue against the ratemaking formula thus: the formula improperly looks toward factors including the individual insurer's profits; a proper formula--at least according to 20th Century--would impose general \"price caps\" on the rates of insurers generally.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nWe do not think the ratemaking formula improper for looking toward factors including the individual insurer's profits. The insurers say that such an orientation would be proper only in the monopoly or public utility setting, which assertedly does not include the insurance industry. They do not persuade.\n\nThe insurers press their position. The gist of their argument is that the voter's approval of Proposition 103 and their disapproval of other insurance-related measures on the same ballot, especially Proposition 100, reveals an intent to establish a system of regulation that turns out to be remarkably similar to that of \"open competition.\"\n\nThe point is urged strongly. But it falls of its own weight.\n\nIf nothing else is clear, this is: Proposition 103 was intended to do away with the \"open competition\" system. The initiative provides for control of rates by means of regulation--initially through the rate rollback, the temporary regulatory regime that operated from November 8, 1988, through November 7, 1989, and then through the \"prior approval\" system, the permanent regulatory regime that obtains from November 8, 1989, into the future. Such control of rates as may be said to have existed under the \"open competition\" system was essentially through market forces alone. That the initiative seeks, as it were, to open competition by \"repealing laws that . . . bar banks from selling insurance\" (Calfarm Ins. Co. v. Deukmejian, supra, 48 Cal. 3d at p. 841 [referring to Prop. 103, Gen. Elec. (Nov. 8, 1988), § 7, reprinted in Ballot Pamp., Proposed Stats. and Amends. to Cal. Const. with arguments to voters, Gen. Elec. (Nov. 8, 1988) p. 141]) does not preserve the \"open competition\" system. That one of the initiative's purposes is \"to encourage a competitive insurance marketplace\" (Prop. 103, Gen. Elec. (Nov. 8, 1988), § 2, reprinted in Ballot Pamp., Proposed Stats. and Amends. to Cal. Const. with arguments to voters, Gen. Elec. (Nov. 8, 1988) p. 99) does not deny that another of its purposes is to subject that marketplace to rate regulation. Similarly, that one of the initiative's intermediate goals is the encouragement of a \"competitive insurance marketplace\" does not deny that its ultimate goal is the guaranty that \"insurance is fair, available, and affordable for all Californians.\" (Ibid.)\n\nWe agree with the insurers that a ratemaking formula that looks toward factors including the individual insurer's profits would have fit quite easily within the context of Proposition 100. (See Prop. 100, Gen. Elec. (Nov. 8, 1988), § 8, reprinted in Ballot Pamp., Proposed Stats. and Amends. to Cal. Const. with arguments to voters, Gen. Elec. (Nov. 8, 1988) pp. 131-132.)\n\nBut we disagree that a ratemaking formula of this sort is out of place in the setting of Proposition 103.\n\nMost broadly stated, the insurers' argument seems to be that under the rate rollback, Proposition 103 requires that rates must be determined, as it were, in the abstract, without consideration in a ratemaking formula or elsewhere of the individual insurer's performance and condition, as revealed in cost of service, capital base, rate of return, etc. That cannot be. As approved by the voters, the initiative in subdivision (b) of Insurance Code section 1861.01 made relief from the rate rollback requirement provision dependent on a substantial threat of \"insolvency.\" \"Insolvency\" implicates the individual insurer's performance and condition. As construed in Calfarm, the initiative makes relief dependent on \"confiscation.\" (Calfarm Ins. Co. v. Deukmejian, supra, 48 Cal. 3d at pp. 816-826.) \"Confiscation\" also implicates the individual insurer's performance and condition.\n\nAs to 20th Century's argument for regulation by \"price caps\" rather than factors including profits, we find persuasive the administrative law Judge's response. An argument of this sort is bottomed on \"policy\" rather than law--specifically, a \"policy\" that \"would have us ignore Calfarm's emphasis on\" such factors as profits \"and Proposition 103's call for reduction of rates industry-wide,\" \"regardless of whether the rates were low or high by industry standards . . . .\" (Italics added in place of underscoring in original.) Under the rate rollback requirement provision--to use the terms appearing in Insurance Code section 1861.05, subdivision (a)--a rate is \"inadequate\" if confiscatory and \"excessive\" if more than minimally nonconfiscatory and above 80 percent of the 1987 rate.\n\nE. The Validity of the Rate Regulations as to Rollbacks With Respect to the Measurement of Insurer Capital\n\nThe superior court determined that the rate regulations as to rollbacks are not invalid on their face insofar as they require that an insurer's capital be measured in accordance with statutory accounting principles or SAP, which apparently operate to limit the capital base to capital used and useful for providing insurance, instead of generally accepted accounting principles or GAAP.\n\nWe agree.\n\nThe use of statutory accounting principles, which are more conservative than generally accepted accounting principles, to measure an insurer's capital is altogether appropriate. As stated, statutory accounting principles are \"rules that state insurance departments have developed to regulate . . . insurance companies . . . to guarantee their continuing solvency.\" (Meyers v. Moody, supra, 693 F.2d at p. 1218.) To this end, they \"mandate\" the employment of \"conservative methods\" in considering and valuing assets \"in calculating a company's financial condition . . . .\" (Ibid.)\n\nThat statutory accounting principles apparently operate to limit the insurer's capital base to capital used and useful for providing insurance is unexceptionable. As noted, an insurer's surplus is its available capital backing up premiums. The superior court was right in stating that the Insurance Commissioner could reasonably have concluded that insureds \"need not provide a return on capital which is not required for insurance business.\" The commissioner's underlying position is sound: insureds do not have to pay for what does not give them marginal benefit. Surplus surplus--i.e., surplus beyond what is useful to back up premiums--inflates the insurer's capital base and any rate set thereon to the disadvantage of its insureds, while at the same time it produces investment income from appreciating assets. The superior court was also right in implying that the commissioner could reasonably have concluded that insureds need not provide a return on capital that is not actually employed for insurance business. The commissioner's underlying position is sound here as well: insureds do not have to pay for what does not give them any benefit whatsoever.\n\nThere is certainly nothing confiscatory in the requirement that an insurer's capital be measured in accordance with statutory accounting principles instead of generally accepted accounting principles. (See also Fireman's Fund Ins. Co. v. Garamendi, supra, 790 F. Supp. at p. 948 [implying that a regulation is not properly subject to a facial takings challenge either in whole or in part].) Neither is there anything arbitrary, discriminatory, or demonstrably irrelevant to the legitimate policy of the protection of consumer welfare.\n\nF. The Validity of the Rate Regulations as to Rollbacks With Respect to 10 Percent as a Reasonable Rate of Return\n\nThe superior court determined that the rate regulations as to rollbacks are not invalid on their face insofar as they define 10 percent as the lower boundary of the range of reasonable rates of return.\n\nAt this point, it may be profitable to call to mind the pertinent findings and Conclusions of the administrative law Judge: 10 percent as the lower boundary of the range of reasonable rates of return was based \"on the average historical rates of return actually achieved by the industry between 1980 and 1989, rather than theoretical investor expectations determined by econometric models\"; the \"industry earned an average 9.1% return . . . in 1989\" under statutory accounting principles, and \"over the 10 years from 1980 to 1989 averaged a 10% return\" under both statutory accounting principles and generally accepted accounting principles (internal quotation marks omitted); \"use of actual historical rates of return rather than inherently speculative hypothetical projections of investor expectations is . . . reasonable . . ., particularly for a time period now already past.\"\n\nIn making its determination, the superior court applied the appropriate standard of review and proceeded to arrive at the proper Conclusion thereunder. Its Discussion deserves to be quoted at length.\n\n\"The scope of review of the [generic] determinations\"--one of which is 10 percent as the lower boundary of the range of reasonable rates of return--\"is the arbitrary/capricious standard.\"\n\n\"Determining rates of return is not an exact science, and indeed requires exercise of judgment. The different rates of return found to be reasonable by Commissioner Gillespie and Commissioner Garamendi for the rollback year are an example of how reasonable minds can arrive at different results and how evidence is available to serve as [a] basis for varying Conclusions.\n\n\". . . Commissioner Garamendi, after 'considering all the evidence presented,' found that [a] . . . rate of return of 10% . . . corresponds to the lower boundary of the range of reasonable returns, and that such a 'rate of return is nonconfiscatory.' [Citation.]\n\n\"Evidence supporting the Commissioner's determinations included the testimony of Dr. Andrew Safir, . . . that, in his opinion, 10.3% rate of return . . . was the lower boundary reasonable rate of return. This opinion was based on the individual performance between 1985 and 1989 of a sample of insurers doing business in California\" and on a view that \"investors' expectations are shaped largely by historic profit levels of the companies making up the industry.\"\n\n\"The validity of Dr. Safir's 10.3% rate of return as at the lower boundary reasonable rate of return was confirmed by other evidence. Thus, his figure was above the level characterized as 'accepted norm' for profitability by A.M. Best Co. [Citation.]\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Furthermore, during the ten years when the industry average had been 10% return on equity, the surplus grew substantially, and even at that low level the industry had been able to meet debt obligations and pay dividends. [Citations.]\n\n\"Dr. Safir looked at a number of companies that earned up to one percent less than his recommended rate of return (between 9.3% and 10.3% . . .), and found that out of 48 such companies, 45 had surplus growth, adding a net $1 billion during the year in which they fell below 10.3%. [Citation.]\n\n\"Some of the above was confirmed by 20th Century witness, Dr. Timothy Crichfield. For example, Dr. Crichfield confirmed that most of the surplus growth was from retention of earnings, not attraction of new capital [citations] and that a number of low-earning companies were able not only to retain earnings, but attract capital. [Citations.]\n\n\"Further, evidence in the record showed that in 1989 the insurance industry earned an average return of 9.1% on statutory equity or 9.6% on GAAP [citations]. Over the ten years 1980-1989, the industry averaged 10% return on both SAP and GAAP. Nevertheless, the industry's accumulated capital grew significantly.\" (Underscoring omitted.)\n\n\"The insurers criticize the whole approach of relying on [the] industry's historical average and industry average for 1989 to determine cost of capital for the rollback year . . . .\n\n\"There are indeed limitations to the historic average approach. As the insurers point out, the fact that an industry or firm has had low profits for five years or ten years does not necessarily mean that it is a low-risk enterprise or can attract capital even with low rates of return. Similarly, the number of years chosen to include in the average affects the result considerably. Thus, . . . the five-year average is 10.4%, the four-year average 12.4%, and the three-year average 11.8%. Commissioner Garamendi chose a ten-year average in his Conclusion. (Commissioner Gillespie previously had used a 15-year average.) Certainly, a rate of return determined on this basis has to be viewed with caution and in the context of other evidence . . . .\n\n\"The insurers presented testimony of economists, Dr. [David] Appel and Dr. [James H.] Vander Weide, regarding two theoretical models for estimating investor profit expectations and determination of the return necessary to attract capital: the discounted cash flow model ('DCF') and capital assets pricing model ('CAPM'). These models produced 16.98% and 16.6% rates of return. [Citations.] Depending on assumptions, these rates, too, could vary substantially. [Citation.] Dr. Vander Weide also estimated capital cost based on the risk premium method, arriving at a similar (15.5%) result.\" \"Dr. Vander Weide's range of reasonable returns, based on the DCF model, was between 13.8% and 20.3% [citation]. It is really rather obvious from the record herein that all models can be manipulated/applied to produce a great range of rates of return.\"\n\n\"The insurers also argued that although utilities are less risky, Pacific Gas and Electric and Southern California Edison were allowed a 13% rate of return in 1989 by the Public Utilities Commission.\n\n\"The Commissioner responds that the utilities, unlike insurance companies, hold depreciating assets, and the Public Utilities Commission, unlike the Commissioner, was not looking for a rate at the lower boundary of reasonable rates of return for purposes of determining a one-time rollback.\n\n\"In coming to his determination, the Commissioner considered that unlike utilities, insurers do not generally raise capital by attracting investors or borrowing, but primarily by internal growth [citations], and that therefore, such capital acquisition is free of the transactional costs associated with securities markets. In evaluating all of the evidence presented, the Commissioner considered also that unlike utilities, where heavy stock and bond issuances provide market data on cost of capital, only poor market data was available as to insurer cost of capital and, therefore, less credence could be placed on such data by the regulator.\n\n\"In concluding that unrealized capital gains must be taken into account in the ratemaking process to 'avoid setting rates higher than appropriate,' the Commissioner again considered the distinction between utilities and insurers. Thus, the Commissioner found that the insurers have been able to attract capital despite returns that lag behind other industries because, unlike other industries, much of their investment value is in appreciating investments. [Citations.] Thus, in 1989, while the property-casualty insurance industry reported a return of 9.6%, its surplus grew 13.1%; while reporting income of $11.2 billion, the insurance companies were increasing in value by $15.5 billion. [Citation.]\n\n\"The Commissioner also stressed that the rollback is a one-time event, unlike utilities where the rate of return applies for the indefinite future. A one-year rate of return at the lower end of reasonable rates, he reasoned, is not likely to affect investor expectation so that attracting capital plays a diminished role in the fair rate of return calculus.\n\n\"According to the Commissioner, while utility ratemaking is prospective, Proposition 103 rollbacks 'present a rare instance where the financial conditions for the relevant period are known. . . .' [Citation.] His determination to rely on available annual historical industry-wide data, and not rely exclusively on analysts' hypothetical projections on what rates should have been, is not arbitrary and capricious. . . .\n\n\"Use of past data, along with other factors, in determining a reasonable rate of return for a past limited period (one year in the case of the rollbacks) is not improper. . . .\n\n\"The insurers have pointed to serious flaws in the evidence supporting the Commissioner's determination of 10% as the lower boundary reasonable rate of return. . . .\n\n\"Under the arbitrary/capricious standard, however, this court cannot reweigh the evidence and substitute its own judgment for that of the Commissioner.\n\n\"The Commissioner considered not only Dr. Safir's opinion testimony, but other evidence in the record as well. He further considered a number of factors which distinguish the insurance business from other businesses, and utilities in particular.\n\n\"The court considers all of the factors relied on by the Commissioner\"--both \"evidence in the record\" of File No. RCD-2 and \"matters not included\" therein under the rubric of \"'legislative facts'\"--\"relevant and proper considerations in setting the lower boundary reasonable rate of return on the range of reasonable rates of return in determining rollbacks. Of particular significance is the fact that the rollback is a one-time event, applicable to a past period and is, thus, less likely to affect future expectations of investors than if all future rates were to be limited by the same 10% lower boundary rate of return.\n\n\"Constrained by the narrow scope of its review, this court concludes that there is substantial evidence in the record to support the 10% lower boundary reasonable rate determination for the rollback year, and such determination is not arbitrary or capricious.\"\n\nThe insurers contend that the superior court erred by determining that the rate regulations as to rollbacks are not invalid on their face insofar as they define 10 percent as the lower boundary of the range of reasonable rates of return. They also contend that the superior court erred at the threshold by applying the arbitrary-or-capricious standard of review instead of the independent-judgment-on-the-evidence test.\n\nWe reject the latter claim. Our analysis above demonstrates that the arbitrary-or-capricious standard of review is indeed applicable. (See pt. III.B., ante.)\n\nWe reject the former claim as well. To our mind, the superior court's Discussion is persuasive. It establishes that the Insurance Commissioner could properly have defined 10 percent as the lower boundary of the range of reasonable rates of return. The insurers mount an attack based on both the law and the facts. But they simply cannot show that the commissioner acted unreasonably. We note, for example, their strenuous objection to what the superior court called the commissioner's \"historic average approach.\" They maintain in substance that this \"approach\" cannot determine a reasonable rate of return but only an actual rate of return. The \"historic averages\" in question, however, derive from a period during which the insurance industry was largely unregulated as to rates. Because they do, they reflect a rate of return that the market, at least, would apparently have considered \"reasonable.\" It is true that the \"10% return\" that \"the industry . . . averaged\" \"over the 10 years from 1980 to 1989\" (internal quotation marks omitted) was apparently calculated on its entire capital during that period. Evidently, the insurers would assert, and the commissioner would deny, that all that capital was used and useful for providing insurance. To the extent that the insurers may be understood to complain of the defined rate of return because it is applied to a capital base comprising not their entire capital during the rollback year but only that part that the leverage factor operates to define as used and useful for providing insurance, their complaint is not with the rate of return but actually with the leverage factor. That will be addressed in due course. (See pt. III.H., post.) There is certainly nothing confiscatory in the definition of 10 percent as the lower boundary of the range of reasonable rates of return. (See also Fireman's Fund Ins. Co. v. Garamendi, supra, 790 F. Supp. at p. 948 [implying that a regulation is not properly subject to a facial takings challenge either in whole or in part].) Neither is there anything arbitrary, discriminatory, or demonstrably irrelevant to the legitimate policy of the protection of consumer welfare.\n\nG. The Validity of the Rate Regulations as to Rollbacks With Respect to the Earthquake Line of Insurance\n\nThe superior court determined that the rate regulations as to rollbacks are invalid on their face insofar as they treat the line of earthquake insurance as they do.\n\nWe disagree.\n\nWe do not share the superior court's view that the rate regulations as to rollbacks are unsound in that they subject insurers to direct ratemaking.\n\nAs the administrative law Judge observed, direct ratemaking is an accounting convention; it is used by insurers generally, including 20th Century; and it guarantees consistent treatment of all insurers.\n\nTrue, direct ratemaking does not recognize an insurer's expenses for reinsurance in the form of premiums ceded to a reinsurer. But neither does it recognize the insurer's revenue from reinsurance in the form of losses ceded to that same reinsurer. The superior court implied that the nonrecognition of reinsurance expenses offends the takings and due process clauses of the United States and California Constitutions. It appears to have assumed that the insurer must be permitted to recover its entire cost of service--at least insofar as it is reasonable--by operation of one or both of these guaranties. That is not so. A regulated firm may be disallowed an element of its cost of service--even one that is reasonable--without suffering a taking or a denial of due process. The United States Supreme Court has so concluded under the federal charter. (B. \u0026 O. R. Co. v. United States, supra, 345 U.S. at pp. 147-150.) We come to the same Conclusion under that of the state. Any suggestion by the superior court that either organic law controls the choice of accounting conventions must be rejected out of hand.\n\nNeither do we share the superior court's view that the rate regulations as to rollbacks are unsound in that they depend in substantial part on the individual insurer's incurred losses for the rollback year.\n\nRecall that, in this regard, the superior court implied that the rate regulations as to rollbacks violate Proposition 103's proscription of \"inadequate\" rates in Insurance Code section 1861.05, subdivision (a): calculations are based on the insurer's loss data from a single year; calculations for the earthquake line, however, should be based on loss data from more than one year, because this line (along with others) is one with losses of \"low-frequency\" but \"high-severity\"; calculations for the earthquake line, if based on loss data from a single year with relatively small losses, are skewed to the confiscatory.\n\nWe broadly agree with the administrative law Judge: The rate regulations as to rollbacks yield generally supportable outcomes for individual insurers, although they disfavor those whose incurred losses are small and favor those whose incurred losses are large; in any event, they do not themselves determine the insurer's rate rollback liability; the minimum permitted earned premium for the earthquake line must not be viewed in isolation as an end result; together with the minimum permitted earned premium for each of the insurer's other lines, it functions only as an intermediate step in the refund calculation.\n\nNevertheless, we cannot dismiss the concerns of the superior court. Calculations for the earthquake line, if based on loss data from a single year with relatively small incurred losses, do indeed verge toward the low end for any given insurer.\n\nBut as stated above, confiscation is Judged with an eye toward the regulated firm as an enterprise. That is to say, it depends in this context on the condition of the insurer as a whole--and not on the fortunes of any one or more of its lines, including earthquake.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Confiscation may perhaps turn on an insurer's earthquake line if the insurer writes that line alone. But it appears that few insurers, if any, satisfy this condition.\n\nBe that as it may, we state again what we have already stated. The rate regulations as to rollbacks expressly provide for variances as the final mechanism for rate adjustments necessary to avoid confiscation. If confiscation nonetheless results, it is properly charged against the variances. (See pt. III.I., post.)\n\nSubject to the foregoing, there is nothing confiscatory in the treatment of the line of earthquake insurance. (See also Fireman's Fund Ins. Co. v. Garamendi, supra, 790 F. Supp. at p. 948 [implying that a regulation is not properly subject to a facial takings challenge either in whole or in part].) Neither is there anything arbitrary, discriminatory, or demonstrably irrelevant to the legitimate policy of the protection of consumer welfare.\n\nH. The Validity of the Rate Regulations as to Rollbacks With Respect to the Leverage Factor\n\nThe superior court determined that the rate regulations as to rollbacks are invalid on their face insofar as they incorporate the leverage factor.\n\nAs stated, the leverage factor is crucial to the determination of rates. The ratemaking formula is designed to yield a premium that the insurer should receive from its insureds in order to earn a sum amounting to (1) the reasonable cost of providing insurance and (2) the capital used and useful for providing insurance multiplied by a fair rate of return. The leverage factor directly contributes to the definition of the capital that is deemed used and useful for providing insurance by inverse relationship: the higher the leverage ratio, the smaller the used-and-useful capital; the lower the leverage ratio, the greater the used-and-useful capital. It follows that the leverage factor indirectly contributes to the setting of the rate itself by inverse relationship: the higher the leverage ratio, the smaller the used-and-useful capital and hence the smaller the rate; the lower the leverage ratio, the greater the used-and-useful capital and hence the greater the rate. Thus, so far as the determination of rates is concerned, the insurer generally favors a lower leverage ratio and its insureds generally favor a higher leverage ratio.\n\nExpressly and in major part, the superior court's determination of invalidity rests on a finding that the leverage factor is confiscatory.\n\nConfiscation, however, does not appear. The leverage factor functions as an application of the \"used and useful\" rule. That rule is a \"permissible\" \"tool[] of ratemaking\" under the takings clause. (Jersey Cent. Power \u0026 Light Co. v. F.E.R.C., supra, 810 F.2d at p. 1175.) The superior court itself acknowledged explicitly that insureds \"need not provide a return on capital which is not required for insurance business.\" It further acknowledged implicitly that insureds need not provide a return on capital that is not actually employed for that purpose. As explained, to the extent that the leverage factor excludes from recognition capital not used and useful, it also excludes from recognition investment income derived therefrom. (See pt. III.D., ante.) The former exclusion is to the insurer's detriment. The latter is to its benefit: it prevents a portion of investment income that would otherwise reduce its maximum rate for the rollback year from doing so.\n\nNevertheless, in finding the leverage factor confiscatory, the superior court reasoned to this effect: Under the \"prior approval\" system, the rate regulations \"allow[] more highly leveraged insurers to use [a lower] 'normative leverage factor' rather than [their] actual [higher] leverage [factor]\" in order to obtain a \"higher . . . rate of return [sic: read, \"higher return\"] to compensate such insurers for [their] greater risk.\" They should have done the same under the rate rollback. Because they did not, they \"disallow[] or disregard[] a significant amount of actual 'proper' 1989 surplus . . . .\"\n\nThe Insurance Commissioner's response is sufficient: \"In prior approval the regulations impute to the insurer the amount of surplus the leverage factors specified in the regulations imply. [Citation.] To the extent that the insurer is more highly leveraged, it will be able to retain extra profit. This provides the insurer with the salutary incentive to write more insurance than it otherwise might, albeit at the cost of somewhat higher risk of insolvency. The Commissioner's decision to use\" the specified, rather than the actual, leverage ratio \"in prior approval reflects his judgment that the risk is small, particularly when coupled with effective solvency regulation . . . . However, neither the incentive to write more insurance nor the risk of insolvency [is] any longer relevant to 1988-1989 policies, so, for the rollback period, the regulations provide\" for the use of \"the insurer's actual leverage ratio, as long as the insurer's actual leverage ratio is no less than the leverage ratio adopted in the regulations. If the actual leverage ratio is less, that means that the insurer had more capital than was reasonably necessary to support the insurance, and the insurer is not permitted to extract a profit on the extra surplus from its California policyholders.\" (Fn. omitted.) Therefore, what the superior court found to be \"actual 'proper' 1989 surplus\" that is \"disallowed or disregarded\" is not in fact \"actual 'proper' 1989 surplus.\" It was not \"useful\" as well as \"used.\"\n\nIn any event, the rate regulations as to rollbacks expressly provide for variances as the final mechanism for rate adjustments necessary to avoid confiscation. If confiscation nonetheless results, it is properly charged against the variances. (See pt. III.I., post.)\n\nImpliedly and in minor part, the superior court's determination of invalidity rests on a finding that the leverage factor is arbitrary, discriminatory, or demonstrably irrelevant to the legitimate policy of the protection of consumer welfare. Such does not appear. The leverage factor functions as an application of the \"used and useful\" rule. That rule is permissible under the takings clause. In our view, it is permissible generally. To be sure, the leverage factor may be said to favor the insured over the insurer. But not unreasonably so.\n\nI. The Validity of the Rate Regulations as to Rollbacks With Respect to Hearings\n\nThe superior court determined that the rate regulations as to rollbacks are invalid on their face insofar as they preclude an \"individualized\" hearing on an individual insurer's rate rollback liability: they are \"preclusive\" (1) because they do not allow a variance or variances sufficient for rate adjustments necessary to avoid confiscation and (2) because they impose the \"relitigation bar,\" which assertedly operates to prevent proof of confiscation in and of itself, even if there were a sufficient variance or variances.\n\nTo the extent that the superior court's determination of invalidity is based on the \"relitigation bar,\" it is unsound.\n\nThe \"relitigation bar,\" as noted above, is this: \"Relitigation in a hearing on an individual insurer's rates of a matter already determined either by these regulations or by a generic determination is out of order and shall not be permitted. However, the administrative law Judge shall admit evidence he or she finds relevant to the determination of whether the rate is excessive or inadequate (or, in the case of a proceeding [concerning a rate for the rollback year], relevant to the determination of the minimum nonconfiscatory rate), whether or not such evidence is expressly contemplated by these regulations, provided the evidence is not offered for the purpose of relitigating a matter already determined by these regulations or by a generic determination.\" (Cal. Code Regs., tit. 10, § 2646.4, subd. (e).)\n\nThere is nothing \"preclusive\" in the \"relitigation bar.\"\n\nThat is not to say that the \"relitigation bar\" is without effect. Its words are plain: \"Relitigation in a hearing on an individual insurer's rates of a matter already determined either by these regulations or by a generic determination is out of order and shall not be permitted. . . .\" (Cal. Code Regs., tit. 10, § 2646.4, subd. (e), italics added.)\n\nRather, the effect of the \"relitigation bar\" is unobjectionable. In adjudication, the Judge applies declared law; he does not entertain the question whether its underlying premises are sound. That is as it should be. Otherwise, standardless, ad hoc decisionmaking would result. Similarly, in quasi-adjudicatory proceedings, the administrative law Judge applies adopted regulations; he does not entertain the question whether their underlying premises are sound. That is also as it should be, and for the same reason. The effect of the \"relitigation bar\" is simply to assure that, in determining an individual insurer's rate rollback liability, the administrative law Judge does not entertain the question whether the premises underlying the rate regulations as to rollbacks are sound. There is, without doubt, nothing novel about such a prohibition. (Cf., e.g., Cal. Code Regs., tit. 22, § 51536 et seq. [setting rates for reimbursement for hospital inpatient services provided to Medi-Cal program beneficiaries]; see especially id., § 51550, subd. (b)(8) [in an administrative adjustment proceeding to challenge certain rate limitations, a provider may not attack the \"methodology used to calculate the interim rate\"].)\n\nIt must be emphasized that in Calfarm, we held that Proposition 103's rate rollback requirement provision \"is not invalid on its face, but the rates thereby established are necessarily subject to the right of an insurer to demonstrate that a particular rate is, as applied to it, a confiscatory rate.\" (Calfarm Ins. Co. v. Deukmejian, supra, 48 Cal. 3d at p. 826.) Note the right we declared therein: the \"right . . . to demonstrate that a particular rate is, as applied . . ., a confiscatory rate\"--not a right to do anything else.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nThe \"relitigation bar\" does not prevent proof of confiscation--it does not, in Calfarm's words, deny the insurer its \"right . . . to demonstrate that a particular rate is, as applied to it, a confiscatory rate.\" (Calfarm Ins. Co. v. Deukmejian, supra, 48 Cal. 3d at p. 826.) By its very terms, \"in the case of a proceeding\" concerning a rate for the rollback year, it requires admission of evidence found \"relevant to the determination of the minimum nonconfiscatory rate . . . .\" (Cal. Code Regs., tit. 10, § 2646.4, subd. (e).)\n\nThe question is not whether the \"relitigation bar\" prevents proof of confiscation. It does not. Rather, the question is whether there is a variance or variances sufficient to accommodate such proof. More on this immediately below.\n\nTo the extent that the superior court's determination of invalidity is based on the variances, it is also unsound.\n\nThere is nothing \"preclusive\" in the variances.\n\nIt is true that, out of eight variances, only three are applicable to rates under the rate rollback: (1) the \"one-line\" variance; (2) the \"entering-the-market\" variance; and (3) the \"insurer-insolvency\" variance. It is also true that the first and second are each of limited availability and the third is demanding.\n\nBut the three applicable variances should not be considered, as it were, each in isolation, but rather all together within their full context. There is the ratemaking formula itself. It is designed to yield a nonconfiscatory rate for the individual insurer even before any variance might come into play. Because it has \"safety\" built in, it does not appear to need \"safety valves\" different from those provided by the variances. Be that as it may, there is also a separate and independent constitutionally mandated \"variance,\" which was properly recognized by the administrative law Judge. It would be available to the individual insurer on proof of confiscation, that is to say, on proof that the regulations in question would otherwise be confiscatory as applied.\n\nIn view of the foregoing, the variances must be deemed sufficient for rate adjustments necessary to avoid confiscation.\n\nJ. The Validity of the Rate Regulations as to Rollbacks With Respect to Uniform Maximum Rates and Uniform Percentage Refunds\n\nThe superior court determined that the rate regulations as to rollbacks are not invalid on their face insofar as they require a uniform, maximum rate for the rollback year, and a uniform percentage refund of premiums overcharged and overpaid therein, without regard to claimed \"excessiveness\" or \"inadequacy\" in individual lines.\n\nWe agree.\n\nAs construed in Calfarm, Proposition 103 expressly requires a uniform, maximum rate for the rollback year--i.e., 80 percent of the 1987 rate or such percentage of the 1987 rate greater than 80 percent as is minimally nonconfiscatory.\n\nContrary to the insurers' claim, any \"discrimination\" between lines with \"excessive\" and \"inadequate\" rates--Judged apparently against the minimum permitted earned premiums that are determined only as intermediate steps in the refund calculation--cannot be deemed \"unfair.\" Such \"discrimination\" was evidently intended by Proposition 103. It is in fact a kind of nondiscrimination: the maximum rate is, uniformly, 80 percent of the 1987 rate or such percentage of the 1987 rate greater than 80 percent as is minimally nonconfiscatory. Be that as it may, any \"discrimination\" between lines can hardly be complained of by the insurers. It is they who set the underlying \"excessive\" and \"inadequate\" rates. The initiative merely imposes a reduction and freeze on rates it found in place. Any \"discrimination\" between lines must therefore be attributed to those rates and ultimately to those that set them--the insurers themselves.\n\nAs also construed in Calfarm, Proposition 103 impliedly requires a uniform percentage refund of premiums charged and paid over the uniform, maximum rate for the rollback year. Otherwise, an insurer might fully refund the overcharged and overpaid premiums by returning to one insured more than had been extracted from him and to another less. This would be an unreasonable result. It would frustrate one of the purposes of the initiative, which is \"to protect consumers from arbitrary insurance rates and practices.\" (Prop. 103, Gen. Elec. (Nov. 8, 1988), § 2, reprinted in Ballot Pamp., Proposed Stats. and Amends. to Cal. Const. with arguments to voters, Gen. Elec. (Nov. 8, 1988) p. 99.) As explained above, whether rates in individual lines could be said to be \"excessive\" or \"inadequate\" does not matter. Again contrary to the insurers' claim, any \"discrimination\" between lines with \"excessive\" and \"inadequate\" rates cannot be deemed \"unfair.\"\n\nThere is certainly nothing confiscatory in the requirement of a uniform, maximum rate for the rollback year, and a uniform percentage refund of premiums overcharged and overpaid therein. (See also Fireman's Fund Ins. Co. v. Garamendi, supra, 790 F. Supp. at p. 948 [implying that a regulation is not properly subject to a facial takings challenge either in whole or in part].) Neither is there anything arbitrary, discriminatory, or demonstrably irrelevant to the legitimate policy of the protection of consumer welfare.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nK. The Validity of the Rate Regulations as to Rollbacks With Respect to Interest\n\nThe superior court determined that the rate regulations as to rollbacks are not invalid on their face insofar as they: (1) require the insurer to pay interest on the dollar amount of premiums overcharged and overpaid for the rollback year; (2) fix the rate of interest at 10 percent per annum, uncompounded; and (3) set the accrual date at May 8, 1988, the midpoint of the rollback year.\n\nWe agree with the superior court as to the requirement of interest. Neither the Insurance Commissioner nor the insurers contend otherwise. They could not. In Calfarm, we expressly held that \"insurers must refund excess premiums collected [for the rollback year] with interest.\" (Calfarm Ins. Co. v. Deukmejian, supra, 48 Cal. 3d at p. 825, italics added.)\n\nWe also agree with the superior court as to the fixing of the rate of interest. The superior court was of the view that the Insurance Commissioner could reasonably have chosen 10 percent as the rate for premiums overcharged and overpaid for the rollback year because the Legislature had chosen the same rate for unearned premiums in Insurance Code section 481.5. We are in accord. To be sure, overcharged and overpaid premiums are not identical to unearned premiums. But they are indeed similar. Unearned premiums are dollars distributed pro rata beyond what has effectively become the term of a policy, as by reason of cancellation. Overcharged and overpaid premiums are, as it were, dollars beyond the policy itself, being in excess of what the insurer could properly have demanded. Further, the superior court was of the view that the commissioner is not constrained by article XV, section 1 of the California Constitution. On this point, too, we are in accord. In relevant part, the constitutional provision purports to cover only the maximum rate of interest on a judgment--10 percent if set at that level by the Legislature, as it has been in Code of Civil Procedure section 685.010; or 7 percent in the absence of such action by the Legislature. There is no judgment here, but rather a statutory obligation to refund overcharged and overpaid premiums.\n\nThe insurers argue to the contrary. They claim that the superior court erred at the threshold by applying the arbitrary-or-capricious standard of review instead of the independent-judgment-on-the-evidence test to the fixing of the rate of interest by the Insurance Commissioner at 10 percent. Our analysis above disposes of the point. (See pt. III.B., ante.) They then claim that the superior court erred on the merits by upholding the commissioner in fixing the rate of interest as he did. They do indeed show that imposition of interest at some market rate--the rates they suggest happen to be lower than 10 percent--would have been reasonable. But they do not show that imposition of interest at 10 percent was in fact unreasonable. Without such a demonstration, the point fails. We do not find 10 percent to be an impermissible \"penalty\" for insurers or an impermissible \"windfall\" for their insureds.\n\nFinally, we agree with the superior court as to the setting of the accrual date. As with the requirement of interest, neither the Insurance Commissioner nor the insurers contend otherwise. Like the superior court, we believe that the \"choice of the midpoint [of the rollback year] is . . . fair to all.\"\n\nThere is nothing confiscatory with respect to the matter of interest. (See also Fireman's Fund Ins. Co. v. Garamendi, supra, 790 F. Supp. at p. 948 [implying that a regulation is not properly subject to a facial takings challenge either in whole or in part].) Neither is there anything arbitrary, discriminatory, or demonstrably irrelevant to the legitimate policy of the protection of consumer welfare.\n\nL. The Validity of the Rate Regulations as to Rollbacks Against Asserted Impermissible \"Retroactivity\"\n\nIt is unclear whether and to what extent the superior court determined that the rate regulations as to rollbacks are invalid on their face as impermissibly \"retroactive.\" Insofar as it made any such determination, it erred. Our analysis above controls. (See pt. III.C., ante.) \"'Primary' retroactivity\" does not obtain. \"'Secondary' retroactivity\" does, but it is an entirely lawful consequence of rulemaking and hence does not itself offend any law, including the United States and California Constitutions and their respective due process clauses.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nM. The Validity of the Rate Regulations as to Rollbacks as Applied to 20th Century and the Effectiveness of the 20th Century Rate Rollback Order\n\nThe superior court determined that the rate regulations as to rollbacks are invalid as applied to 20th Century, and that the 20th Century rate rollback order issued pursuant thereto is void, in the following six particulars: (1) the ratemaking formula itself; (2) 10 percent as the lower boundary of the range of reasonable rates of return; (3) the treatment of the line of earthquake insurance; (4) the variable expense factor; (5) the leverage factor; and (6) the preclusion of an \"individualized\" hearing on rate rollback liability. It appears that the foregoing determinations have constitutional bases relating to confiscation and arbitrariness, discrimination, and demonstrable irrelevance to legitimate policy and also statutory bases relating, of course, to Proposition 103.\n\nAt the same time, the superior court determined that the rate regulations as to rollbacks are not invalid as applied to 20th Century, and that the 20th Century rate rollback order issued pursuant thereto is not void, as to the requirement of a uniform, maximum rate for the rollback year, and a uniform percentage refund of premiums overcharged and overpaid therein, without regard to claimed \"excessiveness\" or \"inadequacy\" in individual lines. It appears that the foregoing determination was made on the constitutional and statutory bases identified above.\n\nBefore proceeding further, let us state the governing rules. We derive them from the Discussion set out above. (See pt. III.D., ante.)\n\nWhen a regulation is challenged as violative of the due process clause as applied, the question is whether, in the particular case, it is arbitrary, discriminatory, or demonstrably irrelevant to legitimate policy.\n\nThe same analysis is called for when a rate order itself is challenged as violative of the due process clause.\n\nWhen a regulation is challenged as violative of the takings clause as applied, the question is whether, in the particular case, its terms set a rate that is unjust and unreasonable and hence confiscatory.\n\nWhen a rate order itself is challenged as violative of the takings clause, \"the question is whether that order 'viewed in its entirety' meets the [relevant] requirements . . . . Under the . . . standard of 'just and reasonable' it is the result reached not the method employed which is controlling. [Citations.] It is not theory but the impact of the rate order which counts.\" (Power Comm'n v. Hope Gas Co., supra, 320 U.S. at p. 602; accord, Duquesne Light Co. v. Barasch, supra, 488 U.S. at p. 310.) The regulator is not bound \"to the service of any single formula or combination of formulas.\" (Power Comm'n v. Pipeline Co., supra, 315 U.S. at p. 586; accord, Power Comm'n v. Hope Gas Co., supra, 320 U.S. at p. 602.) It is \"free . . . to make the pragmatic adjustments which may be called for by particular circumstances.\" (Power Comm'n v. Pipeline Co., supra, 315 U.S. at p. 586; accord, Power Comm'n v. Hope Gas Co., supra, 320 U.S. at p. 602.)\n\nJudicial inquiry as to whether or not a rate is just and reasonable is necessarily difficult. More than 25 years ago, in Permian Basin Area Rate Cases, supra, 390 U.S. 747, 790, the court declared: \"Neither law nor economics has yet devised generally accepted standards for the evaluation of rate-making orders . . . .\" The declaration was valid then. It remains valid now. (See Duquesne Light Co. v. Barasch, supra, 488 U.S. at p. 308, citing and quoting Permian Basin Area Rate Cases, supra, 390 U.S. at p. 790.)\n\nJudicial inquiry as to whether or not a rate is just and reasonable is also limited. Indeed, it \"is at an end\" \"if the total effect of the rate order cannot be said to be unjust and unreasonable . . . . The fact that the method employed to reach that result may contain infirmities is not then important.\" (Power Comm'n v. Hope Gas Co., supra, 320 U.S. at p. 602; accord, Duquesne Light Co. v. Barasch, supra, 488 U.S. at p. 310.) \"He who would upset the rate order . . . carries the heavy burden of making a convincing showing that it is invalid because it is unjust and unreasonable in its consequences.\" (Power Comm'n v. Hope Gas Co., supra, 320 U.S. at p. 602.)\n\nThe Hope court identified one situation in which \"he who would upset the rate order\" could not bear that \"heavy burden.\" \"Rates which enable the company to operate successfully, to maintain its financial integrity, to attract capital, and to compensate its investors for the risks assumed certainly cannot be condemned as invalid, even though they might produce only a meager return . . . .\" (Power Comm'n v. Hope Gas Co., supra, 320 U.S. at p. 605; accord, Duquesne Light Co. v. Barasch, supra, 488 U.S. at p. 310.) More simply, \"a company [cannot] complain if the return which was allowed made it possible for the company to operate successfully.\" (Market Street R. Co. v. Comm'n, supra, 324 U.S. at p. 566.)\n\nWe believe principles substantially similar to the foregoing control when a regulation is challenged as violative of Proposition 103 as applied, and when a rate order itself is challenged as offensive to the initiative.\n\nLet us turn to the task at hand.\n\nOn one matter alone, the superior court accepted the position of the Insurance Commissioner. As stated, it determined that the rate regulations as to rollbacks are not invalid as applied to 20th Century, and that the 20th Century rate rollback order issued pursuant thereto is not void, as to the requirement of a uniform, maximum rate for the rollback year, and a uniform percentage refund of premiums overcharged and overpaid therein, without regard to claimed \"excessiveness\" or \"inadequacy\" in individual lines. This is sound. The analysis supporting our Conclusion concerning the facial validity of the regulations in this regard is applicable here as well. (See pt. III.J., ante.) 20th Century's situation does not require an exception.\n\nOn the other matters, the superior court rejected the position of the Insurance Commissioner. We shall consider the points seriatim.\n\nThe superior court determined that the rate regulations as to rollbacks are invalid as applied to 20th Century, and that the 20th Century rate rollback order issued pursuant thereto is void, with respect to the ratemaking formula itself.\n\nThis is error.\n\nThe determination is based on the belief that confiscation does not require \"deep financial hardship\" within the meaning of Jersey Central. It does, at least in the general case, such as this. This erroneous belief fatally taints the Conclusion in question--directly, insofar as it rests on the constitutional ground of confiscation; and indirectly, insofar as it rests on the constitutional ground of arbitrariness, discrimination, and demonstrable irrelevance to legitimate policy and also on the statutory grounds.\n\nIn addition, the determination depends on the facial invalidity of the rate regulations as to rollbacks with respect to the ratemaking formula. In this regard, however, the regulations in question are facially valid. (See pt. III.D., ante.) 20th Century's situation does not require an exception.\n\nThe superior court also determined that the rate regulations as to rollbacks are invalid as applied to 20th Century, and that the 20th Century rate rollback order issued pursuant thereto is void, with respect to 10 percent as the lower boundary of the range of reasonable rates of return.\n\nThis too is error.\n\nThe determination is fatally tainted by the erroneous belief that confiscation does not require \"deep financial hardship\" within the meaning of Jersey Central, not even in the general case, such as this.\n\nMoreover, the determination is unsound in and of itself.\n\nThe underlying reasoning appears to be that the lower boundary of the range of reasonable rates of return for a regulated firm is its cost of capital--which for 20th Century was found to be at least 20 percent.\n\nOne assumption seems to be that a regulated firm is entitled to its cost of capital. Although such a firm has an interest in this matter, it has no right. (See Permian Basin Area Rate Cases, supra, 390 U.S. at p. 769 [stating that \"regulation may, consistently with the [United States] Constitution, limit stringently the return recovered on investment, for investors' interests provide only one of the variables in the constitutional calculus of reasonableness\"]; id. at p. 791 [implying that, accordingly, the regulator \"cannot confine its inquiries . . . to conjectures about the prospective responses of the capital market\"].)\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e The United States and California Constitutions make the point plain. As stated, a regulated firm has no constitutional right even against a loss. Manifestly, Proposition 103 is not to the contrary.\n\nAnother assumption seems to be that cost of capital is dispositive as to the issue here, which concerns rate rollback liability. Although cost of capital, to quote the administrative law Judge, may be \"pertinent for prospective ratemaking\" under the \"prior approval\" system, \"implementation of the rollback does not require prospective ratemaking but rather the determination of a minimum nonconfiscatory return for a period now past.\" (Internal quotation marks omitted.)\n\nIt must be emphasized that the evidence of 20th Century's cost of capital appears to derive from a period during which 20th Century, like other insurers, was largely unregulated as to rates. To accord such evidence compelling weight would effectively exempt 20th Century from rate regulation. A result of this sort is barred by Proposition 103. It is not commanded by any other provision of law, including the United States and California Constitutions. (See FERC v. Pennzoil Producing Co., supra, 439 U.S. at p. 518 [declaring, with a quotation from Hope, that: The \"notion that [a regulator] is required to maintain, or even allowed to maintain to the exclusion of other considerations, the profit margin of any particular [regulated firm] is incompatible . . . with a basic precept of rate regulation. 'The fixing of prices, like other applications of the police power, may reduce the value of the property which is being regulated. But the fact that the value is reduced does not mean that the regulation is invalid.'\"].)\n\nThe superior court was of the view that the rate regulations as to rollbacks as applied to 20th Century, and the 20th Century rate rollback order issued pursuant thereto, improperly preclude a rate covering 20th Century's cost of service plus 10 percent of its capital base, in spite of the definition of 10 percent as the lower boundary of the range of reasonable rates of return. Contrary to its evident assumption, any such preclusion is not improper in and of itself: the ratemaking formula does not purport to guarantee the individual insurer a rate covering its cost of service plus 10 percent of its capital base independent of the various adjustments, exclusions, etc., incorporated therein. (See Fireman's Fund Ins. Co. v. Garamendi, supra, 790 F. Supp. at p. 948.)\n\nThe superior court determined as well that the rate regulations as to rollbacks are invalid as applied to 20th Century, and that the 20th Century rate rollback order issued pursuant thereto is void, with respect to the treatment of the line of earthquake insurance.\n\nThis too is error.\n\nThe determination is fatally tainted by the erroneous belief about confiscation.\n\nMoreover, the determination depends on the facial invalidity of the rate regulations as to rollbacks with respect to the treatment of the line of earthquake insurance. In this regard, however, the regulations in question are facially valid. (See pt. III.G., ante.) 20th Century's situation does not require an exception. That applies to the fact that the regulations subject 20th Century to direct ratemaking. It also applies to the fact the regulations depend in substantial part on 20th Century's incurred losses for the rollback year, which were relatively small. To our mind, the regulations yield a generally supportable outcome for 20th Century, although treating it unfavorably because its incurred losses for the rollback year were relatively small. In any event, they do not themselves determine 20th Century's rate rollback liability. The minimum permitted earned premium for the earthquake line must not be viewed in isolation as an end result. Together with the minimum permitted earned premium for each of 20th Century's five other lines, it functions only as an intermediate step in the refund calculation.\n\nFurther, the determination falls insofar as it rests on the constitutional basis of confiscation. The assumption appears to be that confiscation can be effected within 20th Century's line of earthquake insurance in and of itself. Not so. As stated above, confiscation is Judged with an eye toward the regulated firm as an enterprise. In this context, it depends on the condition of the insurer as a whole--and not on the fortunes of any one or more of its lines, including earthquake. That confiscation may perhaps turn on an insurer's earthquake line if the insurer writes that line alone is of purely theoretical interest. The fact is, 20th Century does not satisfy the condition, since it writes five lines in addition to earthquake. We recognize that calculations for 20th Century's earthquake line, since they are based on loss data from a single year with relatively small incurred losses, do indeed verge toward the low end. But that is not enough.\n\nThe observation of the administrative law Judge bears repeating: \"The component of the rollback calculation related to 20th Century's Earthquake line may appear somewhat harsh when it is viewed in isolation . . ., as if it were the final result rather than only an intermediate step in the calculation. However, 20th Century's rollback must be Judged on the issue of confiscation based on the overall result. [Citation.] From that perspective, the impact is not confiscatory. [Citation.] 20th Century is a multi-line insurer whose Earthquake line accounted for only 1.35 percent of its business ($8.7 million of $641.7 million) in the rollback year, and its unrecognized reinsurance premiums on Earthquake only accounted for 0.7 percent of its business ($4.5 million of $641.7 million). [Citation.] It admittedly suffered very low losses in its Earthquake line that year and its cost of writing that coverage was small (estimated . . . to be as low as five dollars per policy, [citation]), so it enjoyed a high profit in that line. In any case, calculation of the Earthquake component of the rollback is merely one of the many intermediate steps to the final rollback.\" (Fn. omitted.) So far as the earthquake line is concerned, the \"final rollback\" amounts to 12.203 percent of $8.7 million or $1.06 million.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nThe superior court also determined that the rate regulations as to rollbacks are invalid as applied to 20th Century, and that the 20th Century rate rollback order issued pursuant thereto is void, with respect to the variable expense factor.\n\nThis too is error.\n\nThe determination is fatally tainted by the erroneous belief about confiscation.\n\nMoreover, the determination is unsound in and of itself. The variable expense factor is the sum of the commission rate and the state premium tax rate. Within the ratemaking formula, it functions to recognize only such amount of commissions and state premium taxes as are attributable to the maximum rate for the rollback year set by Proposition 103 as construed in Calfarm. The superior court thought this objectionable. It is not. Otherwise, a rate above the maximum would tend to justify itself--surely an untenable result. It is not unreasonable to fail to recognize that amount of commissions and state premium taxes that would have been avoided had 20th Century charged a rate at or below the maximum for the rollback year.\n\nThe superior court determined as well that the rate regulations as to rollbacks are invalid as applied to 20th Century, and that the 20th Century rate rollback order issued pursuant thereto is void, with respect to the leverage factor.\n\nThis too is error.\n\nThe determination is fatally tainted by the erroneous belief about confiscation.\n\nMoreover, the determination depends on the facial invalidity of the rate regulations as to rollbacks with respect to the leverage factor. In this regard, however, the regulations are facially valid. (See pt. III.H., ante.) 20th Century's situation, which appears to involve high leverage, does not require an exception. The leverage factor apparently excluded from recognition about $12 million of 20th Century's capital. It also apparently excluded from recognition about $1 million of the firm's investment income derived therefrom. It thereby apparently prevented that portion of the firm's investment income that would otherwise have reduced its maximum rate for the rollback year from doing so. As a result, the firm apparently experienced a net benefit.\n\nThe superior court also determined that the rate regulations as to rollbacks are invalid as applied to 20th Century, and that the 20th Century rate rollback order issued pursuant thereto is void, with respect to the preclusion of an \"individualized\" hearing on the firm's rate rollback liability.\n\nThis too is error.\n\nAt the threshold, we observe that in making its determination the superior court concluded that the administrative law Judge erred by holding that confiscation requires \"deep financial hardship\" within the meaning of Jersey Central. It is rather the superior court that erred. Confiscation does indeed so require, at least in the general case, such as this.\n\nIn part, the determination depends on the facial invalidity of the rate regulations as to rollbacks with respect to the \"relitigation bar.\" In this regard, however, the regulations are facially valid. (See pt. III.I., ante.) 20th Century's situation does not require an exception. All the same, what we stated previously bears repeating now: the administrative law Judge effectively lifted the \"relitigation bar\" to allow 20th Century to introduce evidence to challenge the premises of the regulations in question.\n\nIn other part, the determination depends on the facial invalidity of the rate regulations as to rollbacks with respect to the absence of a variance or variances sufficient for rate adjustments necessary to avoid confiscation. In this regard, too, the regulations are facially valid. (See pt. III.I., ante.)\n\nAs noted, included in the superior court's determination concerning the preclusion of an \"individualized\" hearing on 20th Century's rate rollback liability is a finding of fundamental unfairness in the conduct of the hearing. To the extent that this finding is based on the superior court's Conclusion that the administrative law Judge erred by holding that confiscation requires \"deep financial hardship\" within the meaning of Jersey Central--this seems the ultimate if not sole ground--it fails. Again, it is the superior court that erred and not the administrative law Judge. To the extent that this finding is based on anything other than that Conclusion, it fails as well. We have examined the conduct of the hearing, and have decided that it was fundamentally fair and otherwise in accordance with law.\n\nIt is unclear whether and to what extent the superior court determined that the rate regulations as to rollbacks are invalid as applied to 20th Century as impermissibly \"retroactive.\" Insofar as it made any such determination, it erred. Our analysis above controls. (See pt. III.C., ante.) \"'Primary' retroactivity\" does not obtain. \"'Secondary' retroactivity\" does, but it is an entirely lawful consequence of rulemaking and hence does not itself offend any law, including the United States and California Constitutions and their respective due process clauses.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nImplicit in the superior court's decision is its ultimate determination that the 20th Century rate rollback order is unjust and unreasonable in its consequences and therefore confiscatory.\n\nThis is the superior court's ultimate error. Indeed, it is this determination that is most fatally tainted by its erroneous belief that confiscation does not require \"deep financial hardship\" within the meaning of Jersey Central, not even in the general case, such as this.\n\nThe analysis set out above establishes that the question whether the 20th Century rate rollback order is unjust and unreasonable in its consequences and therefore confiscatory depends on a balancing of the interests of 20th Century and its insureds. (See pt. III.D., ante.)\n\nThe interest of 20th Century's insureds, simply put, is in freedom from exploitation.\n\nBy contrast, the interest of 20th Century itself is in having enough revenue for both \"operating expenses\" and \"the capital costs of the business,\" including \"service on the debt and dividends on the stock,\" of a magnitude that would allow a \"return to the equity owner\" that is \"commensurate with returns on investments in other enterprises having corresponding risks\" and \"sufficient to assure confidence in the financial integrity of the enterprise, so as to maintain its credit and to attract capital.\" (Power Comm'n v. Hope Gas Co., supra, 320 U.S. at p. 603.)\n\n20th Century's interest, however, is just that: it is an interest, not a right. It is \"only one of the variables in the constitutional calculus of reasonableness.\" (Permian Basin Area Rate Cases, supra, 390 U.S. at p. 769.) 20th Century \"has no constitutional right to a profit . . . .\" (Jersey Cent. Power \u0026 Light Co. v. F.E.R.C., supra, 810 F.2d at pp. 1180-1181.) Indeed, it has no constitutional right even against a loss.\n\nIt is apparently at this point that the superior court veered onto its path of error, mistaking what is an interest that 20th Century may pursue for a right that it can demand.\n\nTo determine whether the 20th Century rate rollback order is unjust and unreasonable in its consequences and therefore confiscatory, the superior court should have asked \"whether that order 'viewed in its entirety' meets the requirements\" of the balancing of interests identified above. (Power Comm'n v. Hope Gas Co., supra, 320 U.S. at p. 602.) \"Under the . . . standard of 'just and reasonable' it is the result reached not the method employed which is controlling. [Citations.] It is not theory but the impact of the rate order which counts. If the total effect of the rate order cannot be said to be unjust and unreasonable, judicial inquiry . . . is at an end. The fact that the method employed to reach that result may contain infirmities is not then important.\" (Ibid.)\n\nAnd in determining whether the 20th Century rate rollback order is unjust and unreasonable in its consequences and therefore confiscatory, the superior court should of course have focused on its consequences. Those are these: 20th Century was ordered to refund to each insured an amount equal to the premiums paid for the rollback year multiplied by a refund percentage of 12.203 percent, with simple interest calculated at 10 percent per annum from May 8, 1989, to the date of payment. 20th Century's maximum rate for the rollback year was effectively set at about 98.89 percent of the 1987 rate to avoid confiscation, rather than at 80 percent of that rate, as required by Proposition 103 in the rate rollback requirement provision. Put differently, 20th Century's maximum rate for the rollback year was reduced to a point a mere 1.11 percent below its 1987 rate, rather than to a point 20 percent below that rate.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nIn view of the foregoing, it cannot be said that 20th Century \"carried [its] heavy burden of making a convincing showing that [its rate rollback order] is invalid because it is unjust and unreasonable in its consequences.\" (Power Comm'n v. Hope Gas Co., supra, 320 U.S. at p. 602.)\n\nThat is because such a showing is precluded when, as here, the \"return which was allowed made it possible for the company to operate successfully.\" (Market Street R. Co. v. Comm'n, supra, 324 U.S. at p. 566; accord, Power Comm'n v. Hope Gas Co., supra, 320 U.S. at p. 605.)\n\n20th Century did indeed operate successfully during the rollback year. It practically admits as much. It asserts that its \"rate of growth throughout the years since it was founded in 1958\"--including the period extending from November 8, 1988, through November 7, 1989-has been \"phenomenal.\"\n\nFrom all that appears, 20th Century would have operated successfully during the rollback year under, and in spite of, the rate rollback. Its growth would surely have been slowed down. But as the administrative law Judge stated, it \"has cited no case holding that a slowdown in growth is confiscatory.\" Put otherwise, its business would have been \"less prosperous as a result of\" the rate rollback. (California Auto. Assn. v. Maloney, supra, 341 U.S. at p. 111.) Such a \"diminution in value, however, has never mounted to the dignity of\" confiscation. (Ibid.)\n\nSince the \"total effect\" of the 20th Century rate rollback order \"cannot be said to be unjust and unreasonable,\" our \"inquiry . . . is at an end.\" (Power Comm'n v. Hope Gas Co., supra, 320 U.S. at p. 602.) To go further would lead us to \"micromanage the rate regulation process . . . .\" (Jersey Cent. Power \u0026 Light Co. v. F.E.R.C., supra, 810 F.2d at p. 1191 (conc. opn. of Starr, J.).) That is not our function. (Ibid.) It is clear beyond peradventure that \"we are not obliged to examine each detail of the [Insurance Commissioner's] decision . . . .\" (Permian Basis Area Rate Cases, supra, 390 U.S. at p. 767.) We will not do so.\n\nTo prove confiscation, 20th Century frames an argument that compares the amount of the refund of premiums required by its rate rollback order, which the superior court found to be about $78 million (plus interest), with the amount of its after-tax revenue for 1989, which the superior court found to be about $76 million.\n\nAt first glance, the argument appears substantial. The comparison between about $76 million coming in and about $78 million going out seems to show a loss of about $2 million.\n\nOn closer consideration, however, the argument turns out to be specious. With matching, an appropriate comparison would account for both the revenue \"forgone\" by 20th Century, i.e., the amount of the refund of premiums required by its rate rollback order, which the superior court found to be about $78 million, and the expenses \"avoided\" by 20th Century, including federal income tax, state premium tax, and commissions, which appear to be about $29 million. Under such a comparison, there is a profit of about $27 million--representing a rate of return of about 11 percent on what 20th Century declared to be a capital base of about $243 million (equaling its mean 1989 surplus calculated in accordance with statutory accounting principles). With a profit and rate of return of this magnitude, confiscation does not appear.\n\nIn effect, 20th Century objects that it must \"really\" \"forgo\" revenue in the amount of $78 million but that it does not \"really\" \"avoid\" expenses in the amount of $29 million. This seems an effort to defeat matching by accepting accounting conventions that are favorable and rejecting those that are not. More fundamentally, it seems an effort to obtain a \"reward\" for having charged a rate for the rollback year higher than the Proposition 103's maximum rate of 80 percent of the 1987 rate. (See pt. III.D., ante.) In any event, let us recall that 20th Century, in attempting to upset its rate rollback order, \"carries the heavy burden of making a convincing showing that it is invalid because it is unjust and unreasonable in its consequences.\" (Power Comm'n v. Hope Gas Co., supra, 320 U.S. at p. 602.) In the context of its objection, 20th Century would apparently have to prove that it could not recover the expenses in question, i.e., federal income tax, state premium tax, and commissions. It fails to do so. Indeed, all indications in the record are to the contrary.\n\nWe may observe in passing that 20th Century does not make an argument for confiscation based solely on the fact that its rate rollback order requires it to refund premiums and to pay interest thereon. The reason is manifest. It is called equity. The refund puts 20th Century and its insureds into the situation they would each have occupied had the former not overcharged the latter and the latter not overpaid the former. (See pt. III.D., ante.) Similarly with respect to the payment of interest.\n\nIt follows from what has preceded that there is nothing in the 20th Century rate rollback order that is arbitrary, discriminatory, or demonstrably irrelevant to the legitimate policy of the protection of consumer welfare.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nIV. DISPOSITION\n\nFor the reasons stated above, we conclude that we must reverse the judgment of the superior court and direct that court to render judgment in favor of the Insurance Commissioner and Voter Revolt and against 20th Century, Hartford, State Farm, et al.\n\nIt is so ordered.\n\nLUCAS, C.J., KENNARD, J., ARABIAN, J., BAXTER, J., GEORGE, J., and WERDEGAR, J., Concurring.\n\nMOSK, J., Concurring:\n\nI concur, of course, in the opinion that I have prepared for the court. Specifically, I concur in its Conclusion that neither Proposition 103's rate rollback requirement provision nor the rate regulations as to rollbacks are facially confiscatory under the takings clause of the Fifth Amendment to the United States Constitution.\n\nI write separately to address the following question:\n\nCan any individual insurer, through either the operation of Proposition 103's rate rollback requirement provision or the rate regulations as to rollbacks, suffer confiscation under the takings clause of the Fifth Amendment?\n\nEvidently, No.\n\n\"It is well established that the Takings Clause of the Fifth Amendment applies to so-called 'regulatory takings[]'\" effected by government price regulation. (Garelick v. Sullivan (2d Cir. 1993) 987 F.2d 913, 916.)\n\n\"It is\" equally \"well established that government price regulation does not constitute a taking of property where the regulated group is not required to participate in the regulated industry. See, e.g., Bowles v. Willingham, 321 U.S. 503, 517-18, 88 L. Ed. 892, 64 S. Ct. 641 . . . (1944) (rent controls do not constitute prohibited taking because statute does not require landlords to offer their apartments for rent); Minnesota Ass'n of Health Care Facilities, Inc. [v. Minnesota Department of Public Welfare], 742 F.2d [442,] 446 [(8th Cir.1984)] (state statute limiting fees nursing homes participating in Medicaid Program may charge to non-Medicaid patients is not taking within meaning of the Fifth Amendment because 'the state does not require that nursing homes admit medical assistance residents and participate in the Medicaid Program').\" (Whitney v. Heckler (11th Cir. 1986) 780 F.2d 963, 972, parallel citations omitted.)\n\n\"A property owner must be legally compelled to engage in price-regulated activity for regulations to give rise to a taking. See Bowles v. Willingham, 321 U.S. 503, 517-18, 88 L. Ed. 892, 64 S. Ct. 641 . . . (1944); Whitney v. Heckler, 780 F.2d 963, 972 (11th Cir.), cert. denied, 479 U.S. 813 . . . (1986); Minnesota Ass'n of Health Care Facilities v. Minnesota Dep't of Pub. Welfare, 742 F.2d 442, 446 (8th Cir.1984), cert. denied, 469 U.S. 1215, 84 L. Ed. 2d 337, 105 S. Ct. 1191 . . . (1985). For example, public utilities are under a state statutory duty to serve the public, and must furnish 'service on demand to all applicants' at government-determined rates. W. Pond, The Law Governing the Fixing of Public Utility Rates: A Response to Recent Judicial and Academic Misconceptions, 41 Admin.L.Rev. 1, 5 (1989) (hereinafter 'Pond'); see also Duquesne Light Co. v. Barasch, 488 U.S. 299, 307, 102 L. Ed. 2d 646, 109 S. Ct. 609 . . . (1989). Because utilities generally are compelled to employ their property to provide services to the public, the Fifth Amendment requires regulators to provide utilities with reasonable compensation for their services. See Minnesota Ass'n, 742 F.2d at 446; see also Pond, supra, at 5.\n\n\"By contrast, where a service provider voluntarily participates in a price-regulated program or activity, there is no legal compulsion to provide service and thus there can be no taking. See Bowles, 321 U.S. at 517-18 . . .; Burditt v. United States Dep't of Health and Human Servs., 934 F.2d 1362, 1376 (5th Cir.1991); Whitney, 780 F.2d at 972; Minnesota Ass'n, 742 F.2d at 446; Texaco Puerto Rico, Inc. v. Ocasio Rodriguez, 749 F. Supp. 348, 359 (D.P.R.1990); Anco, Inc. v. State Health and Human Servs. Fin. Comm., 300 S.C. 432, 441-42, 388 S.E.2d 780 . . . (1989). Thus, in Bowles v. Willingham, the Supreme Court sustained a rent regulation ordinance because the statute did not require that plaintiff landlords remain in the business of renting apartments. The landlords were free to keep their buildings vacant and/or to dispose of their properties on the market (albeit at prices depressed by the rent regulations) without being subject to government price regulations. Consequently, the statute at issue did not give rise to a regulatory taking. See 321 U.S. at 517-18 . . .; see also St. Francis Hosp. Ctr. v. Heckler, 714 F.2d 872, 884 (7th Cir.1983) (per curiam) (diminishment of market value resulting from regulation will not give rise to taking where property owner retains 'full rights and control over . . . net investment'), cert. denied, 465 U.S. 1022, 79 L. Ed. 2d 679, 104 S. Ct. 1274 . . . .\" (Garelick v. Sullivan, supra, 987 F.2d at p. 916, parallel citations omitted.)\n\nA \"service provider\" may be said to \"voluntarily participate in a price-regulated program or activity\" (Garelick v. Sullivan, supra, 987 F.2d at p. 916) when it has the \"right to withdraw\" therefrom (Texaco Puerto Rico, Inc. v. Ocasio Rodriguez (D.P.R. 1990) 749 F. Supp. 348, 372, italics and initial capitalization omitted; accord, id. at p. 359). Such a right exists even when, \"as a practical and financial matter, withdrawal would be enormously costly . . . . Permian [Basin Area Rate Cases (1968) 390 U.S. 747, 20 L. Ed. 2d 312, 88 S. Ct. 1344] teaches that [government price regulation] may so stringently limit profits that individual providers, even those with major capital investment for whom abandonment may be costly, may be forced to choose abandonment rather than remain in the regulated industry.\" (Texaco Puerto Rico, Inc. v. Ocasio Rodriguez, supra, 749 F. Supp. at pp. 372-373.) Of course, government price regulation is valid even if it is arguably \"irresponsible.\" (Id. at p. 372.) \"The wisdom of . . . policy decisions . . . is a matter for the polling place, not the bench.\" (Id. at pp. 372-373, italics in original.)\n\nTurning to the present question, I cannot avoid concluding that no insurer, through the operation of Proposition 103's rate rollback requirement provision, can suffer confiscation under the takings clause of the Fifth Amendment. As explained, \"where a service provider voluntarily participates in a price-regulated program or activity, there is no legal compulsion to provide service and thus there can be no taking.\" (Garelick v. Sullivan, supra, 987 F.2d at p. 916.) As also explained, a \"service provider\" may be said to \"voluntarily participate in a price-regulated program or activity\" when it has the \"right to withdraw\" therefrom (Texaco Puerto Rico, Inc. v. Ocasio Rodriguez, supra, 749 F. Supp. at p. 372, italics and initial capitalization omitted; accord, id. at p. 359). Insurers are obviously \"service providers.\" Before the passage of Proposition 103, each and every insurer had the \"right to withdraw\"; after its passage, they continue to have that same right. (See Travelers Indemnity Co. v. Gillespie (1990) 50 Cal. 3d 82, 92-98, 266 Cal. Rptr. 117, 785 P.2d 500.) \"In the normal case the withdrawal process is . . . [nothing] other than simple and expeditious.\" (Id. at p. 92.) In the face of Proposition 103, some insurers chose to exercise their \"right to withdraw.\" (Id. at pp. 87-92.) Others chose not to. (See ibid.) The latter thereby voluntarily subjected themselves to Proposition 103's rate rollback requirement provision. As a result, they could not have suffered confiscation as a matter of law. That withdrawal might have been \"enormously costly\" to them matters not. (Texaco Puerto Rico, Inc. v. Ocasio Rodriguez, supra, 749 F. Supp. at p. 372.) Neither does the \"wisdom\" of Proposition 103. (Ibid.)\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nFor the reasons stated above, I concur in the Conclusion that neither Proposition 103's rate rollback requirement provision nor the rate regulations as to rollbacks are facially confiscatory under the takings clause of the Fifth Amendment.\n\n\u003cspan class=\"fn\"\u003e1. Other systems include \"file and use,\" which \"in theory at least . . . opens up somewhat greater competition\" in rates among insurers, and \"open competition,\" which \"in theory encourages far greater competition in rates by permitting a company to establish new rates freely and to place them in effect promptly.\" (Keeton \u0026 Widiss, Insurance Law (1988) § 8.4(a)(3)(iii), p. 963.) As noted, the latter system, in its fullest form, obtained in this state before Proposition 103.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. In Calfarm, we used such phrases as the \"due process clause\" and \"due process\" to refer, of course, to the due process clause and its protection but also, more broadly, to the takings clause and its protection.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Insurers have mounted their attack not only in state court but also in federal. (See Fireman's Fund Ins. Co. v. Garamendi, supra, 790 F. Supp. at p. 964 [\"Insurers doing business in California certainly have a right to challenge any unconstitutional aspects of the rate making process which have been forced on them by the initiative. But the multiple and overlapping assertions of these challenges in state court, before the Commissioner, and in this court causes this court to question those tactics. Numerous insurers are involved in these multiple challenges, some represented by the same law firms. Some challenges are filed in state court and some are filed in federal. The challenges are at the same time identical, separate and overlapping. Some of that appears to be coordinated and calculated (for example, the filing of the two complaints in these actions minutes apart). And most of the significant issues in these two cases are already pending in state court. The net result is to bring this court into an already complex and protracted process of litigation. Is that forum-shopping, or deliberate complexity, or merely the difficulty of the issues?\"].) In federal court, it may be noted, the attack has been turned away, at least for the present. (See id. at p. 966 [entering a judgment of dismissal in favor of the Insurance Commissioner and against certain insurers and related parties in two actions brought by the latter against the former on the ground that the underlying claims were not ripe].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The \"used and useful\" rule has traditionally been applied in defining the capital base of regulated firms. So too the \"prudent investment\" rule. \"Requiring an investment to be prudent when made is one safeguard imposed by regulatory authorities upon the regulated business for benefit of ratepayers. . . . The 'used and useful' rule is but another safeguard. The prudence rule looks to the time of investment, whereas the 'used and useful' rule looks toward a later time. The two principles are designed to assure that the ratepayers, whose property might otherwise of course be 'taken' by regulatory authorities, will not necessarily be saddled with the results of management's defalcations or mistakes, or as a matter of simple Justice, be required to pay for that which provides the ratepayers with no discernible benefit.\" (Jersey Cent. Power \u0026 Light Co. v. F.E.R.C., supra, 810 F.2d at p. 1190 (conc. opn. of Starr, J.).) \"The 'used and useful' rule operates as a restraining principle, reminding . . . managers that they must assume the risk of economic forces working against an investment which is prudent at the time it is made.\" (Id. at p. 1190, fn. 1 (conc. opn. of Starr, J.).)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. 20th Century is a \"stock insurance company,\" i.e., a \"private corporation that engages in the insurance business. As is generally true of private corporations, an insurer which is organized in this way is owned by investors (usually described as shareholders) who receive the profits, if any, through dividends.\" (Keeton \u0026 Widiss, Insurance Law, supra, § 2.1(a)(2), p. 33.) As a stock insurance company, 20th Century is apparently an exception among insurers.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. In Fireman's Fund Ins. Co. v. Garamendi, supra, 790 F. Supp. at page 941, the court put the number of insurers at 460 and the number of \"rollback-exemption\" applications at 4,089.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. \"The result,\" to be accurate, is not a \"higher allowed rate of return,\" but rather a \"higher allowed return.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Consumers Union, appearing as amicus curiae supporting the Insurance Commissioner's position, has requested us to take judicial notice of the contents of certain \"flyers\" purportedly distributed during the Proposition 103 campaign, one allegedly by Voter Revolt, the other allegedly by the California State Automobile Association. There is no opposition. Nevertheless, we decline the request. Consumers Union has failed to persuade us that the contents of either of these documents must, or even may, be judicially noticed. (See Evid. Code, §§ 450, 451, 452.) We note in passing, however, that the matters embraced therein are in fact reflected in the record. Hence, we consider them in our analysis. State Farm, in conjunction with a brief amicus curiae supporting the insurers' position, has requested us to take judicial notice of the contents of certain excerpts from Best's Aggregates \u0026 Averages, Property-Casualty (51st ed. 1990), and Best's Insurance Reports, Property-Casualty (1992). We may, of course, \"take judicial notice of\" (Evid. Code, § 459, subd. (a)) \"facts and propositions that are not reasonably subject to dispute and are capable of immediate and accurate determination by resort to sources of reasonably indisputable accuracy\" (id., § 452, subd. (h)). There is no opposition. We grant the request. The contents of both of these documents constitute facts of the kind required. (Cf. Redevelopment Agency v. Gilmore (1985) 38 Cal. 3d 790, 806, 214 Cal. Rptr. 904, 700 P.2d 794 [holding in substance that the contents of such documents as Moody's Investors Service and the Federal Reserve Bulletin \"are subject to judicial notice\" under Evid. Code, § 452, subd. (h)].) We accept State Farm's representation that \"participants in the [insurance] industry . . . commonly rely on Best's as an accurate factual source and it is well accepted as an accurate and authoritative source of insurance data.\" After the completion of briefing and before the holding of oral argument, Allstate and related insurers requested us to dismiss them as parties to this proceeding on the ground that they had reached a settlement with the Insurance Commissioner. We granted the request.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. It should be noted in passing that Insurance Code section 1858.6 does not purport to authorize the superior court to independently review a rate rollback order itself and to substitute its own views in place of the Insurance Commissioner's if it disagrees, but only to independently review the evidence underlying the order.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In Karlin v. Zalta (1984) 154 Cal. App. 3d 953, 201 Cal. Rptr. 379, the court set out the background of the McBride-Grunsky Act. \"The United States Supreme Court in Paul v. Virginia (1868) 75 U.S. (8 Wall.) 168, 183, 19 L. Ed. 357 held that '[issuing] a policy of insurance is not a transaction of commerce' and that the conduct of the business of insurance does not constitute interstate commerce. This left the states free to regulate such business beyond the reach of federal law. [Citation.] Seventy-six years later, the question was reviewed in U.S. v. South-Eastern Underwriters Assn. (1944) 322 U.S. 533, 88 L. Ed. 1440, 64 S. Ct. 1162 (hereafter South-Eastern). To the consternation of the insurance industry, the court concluded that the insurance business was indeed engaged in interstate commerce subject to federal regulation under the commerce clause of the United States Constitution and that the Sherman Antitrust Act was applicable to its operation. Responding to the shock waves produced by this decision, Congress passed the McCarran-Ferguson Act (hereafter McCarran Act) in 1945 expressly declaring that it was in the public interest for the business of insurance to continue under state regulation and specifically exempted such business from the operation of federal antitrust laws to the extent that it was regulated by state law. A moratorium was provided until January 1, 1948, (and extended until June 30, 1948) to enable the states to exercise their regulatory authority.\" (Karlin v. Zalta, supra, 154 Cal. App. 3d at pp. 966-967, fn. omitted.) \"In 1907, California had adopted the Cartwright Act, an antitrust law which was [formerly believed to be] patterned after the Sherman Act and had been relatively dormant until about the time the McCarran Act was enacted. [Citation.] In 1946, two years after the landmark decision in the South-Eastern case, our Supreme Court rendered its decision in Speegle v. Board of Fire Underwriters (1946) 29 Cal. 2d 34, 172 P.2d 867. . . . [It] held that [the Cartwright Act] was applicable to the business of insurance. . . . \" (Karlin v. Zalta, supra, 154 Cal. App. 3d at pp. 967-968, fn. omitted.) \"In 1947, shortly prior to the expiration of the moratorium on the application of federal antitrust laws to the business of insurance in the absence of state regulation, California enacted\" the McBride-Grunsky Act. (Karlin v. Zalta, supra, 154 Cal. App. 3d 953 at p. 968, 201 Cal. Rptr. 379.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. In Fireman's Fund Ins. Co. v. Garamendi, supra, 790 F. Supp. 938, the court opined, albeit in a context different from the present, that the rate regulations as to rollbacks are quasi-adjudicative and not quasi-legislative. (Id. at pp. 947, fn. 10, 956-958.) It misstepped. In part, the Fireman's Fund court characterized the rate regulations as to rollbacks as quasi-adjudicative on the ground that they do not amount to \"new rules for future application\" (Dominey v. Department of Personnel Administration, supra, 205 Cal. App. 3d at p. 737, fn. 4, italics added) because they implement existing law in the form of Proposition 103 as construed in Calfarm. (See Fireman's Fund Ins. Co. v. Garamendi, supra, 790 F. Supp. at p. 957 [\"The determination of the insurers' rollback obligations is not 'the making of a rule for the future.' In Calfarm, the California Supreme Court delegated to the Commissioner the task of determining the insurers' rollback obligations under existing law; that is, Proposition 103, as modified by the Calfarm decision.\" (Italics in original.)] Under such reasoning, all regulations would be deemed quasi-adjudicative since all are supported by existing law, at least to some extent. That cannot be. To our mind, the regulations in question are indeed \"new rules.\" They may not change the general lines of the initiative. But they do fill in its gaps. In part, the Fireman's Fund court characterized the rate regulations as to rollbacks as quasi-adjudicative on the ground that the Insurance Commissioner's \"ultimate job is to determine how much each insurer must refund . . . .\" (Fireman's Fund Ins. Co. v. Garamendi, supra, 790 F. Supp. at p. 957.) That may be. But it is not determinative. In Consumers Lobby Against Monopolies v. Public Utilities Com. (1979) 25 Cal. 3d 891, 160 Cal. Rptr. 124, 603 P.2d 41, we held that the \"fixing of a rate and the reducing of that rate are prospective in application and quasi-legislative in character.\" (Id. at p. 909 (lead opn. by Mosk, J.); accord, id. at p. 916 (conc. \u0026 dis. opn. of Richardson, J.).) We further held that the ordering of a refund of rates is \"akin to a reduction in rates,\" when the rates in question were charged \"pending a determination of [their] legality . . . .\" (Id. at p. 910 (lead opn. by Mosk, J.); accord, id. at p. 916 (conc. \u0026 dis. opn. of Richardson, J.).) Under these holdings, the rate regulations as to rollbacks are indeed quasi-legislative. The Fireman's Fund court should not have misstepped. It recognized that the rate regulations \"as to future rates . . . are quasi-legislative.\" (Fireman's Fund Ins. Co. v. Garamendi, supra, 790 F. Supp. at pp. 956-957.) It should have recognized that the rate regulations \"as to rollback obligations\" are the same. (Id. at p. 956.) In both the former and the latter applications, the rate regulations are similar in form and substance. That in the latter application they happen to be brought to bear after the rates in question were charged \"pending a determination of [their] legality\" (Consumers Lobby Against Monopolies v. Public Utilities Com., supra, 25 Cal. 3d at p. 910 (lead opn. by Mosk, J.)) does not render them quasi-adjudicative instead of quasi-legislative.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Not only does the \"finding\" of such \"facts\" belong to the quasi-legislative function. The \"facts\" \"found\" must themselves be viewed as quasi-legislative in nature. All are informed with legal, policy, and technical considerations, including those implicated in the generic determinations concerning the efficiency standards, rate of return, leverage factor, etc. Consequently, none is similar to the sort of \"historical or physical facts\" (Crocker National Bank v. City and County of San Francisco, supra, 49 Cal. 3d at p. 888) typically found in the course of administrative adjudication. Any similarity, however, would not defeat their quasi-legislative nature. (See Prentis v. Atlantic Coast Line, supra, 211 U.S. at p. 227 [implying that the fact that \"questions considered [in the legislative process] might be the same that would arise in the trial of a case\" does not transform a legislative act into a judicial act].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The insurers may be understood to argue that the independent-judgment-on-the-evidence standard is applicable to the question whether the rate regulations actually adopted by the Insurance Commissioner, including the incorporated generic determinations, are necessary and proper for the implementation of Proposition 103, on the ground that the regulations in question implicate the United States and/or California Constitutions. An argument of this sort would allow the rule of arbitrary-or-capricious review to be swallowed up by a purported \"exception.\" That is because all regulations involve the federal and/or state charters, at least to some degree. We are not persuaded that we must, or even should, pursue such a course. Bixby v. Pierno, supra, 4 Cal. 3d 130, which is relied on by the insurers together with similar decisions, is not to the contrary. Its reasoning applies to actions that are quasi-adjudicative and not to those that are quasi-legislative. (See Strumsky v. San Diego County Employees Retirement Assn., supra, 11 Cal. 3d at pp. 34-35 \u0026 fn. 2.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The insurers appear to argue that the rate regulations as to rollbacks are invalid as constitutionally prohibited insofar as they relate to substance. We find no such bar in the United States or California Constitution. To the extent that this point may depend on the assertion that ratemaking is ultimately a judicial function, at least when the question of confiscation is present, it must be rejected. (See pt. III.B., ante.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Cf. Trans Alaska Pipeline Rate Cases (1978) 436 U.S. 631, 653, 56 L. Ed. 2d 591, 98 S. Ct. 2053 (\"Petitioners do not apparently disagree that the [Interstate Commerce] Commission can suspend a tariff because it falls on the wrong side of the line of reasonableness, but they would prevent the Commission in suspending a tariff from stating, as it did here, where the tentative dividing line lies. . . . But this is untenable: No principle of law requires the Commission to engage in a pointless charade in which [regulated firms] desiring to exercise their . . . rights [under the Interstate Commerce Act] are required to submit and resubmit tariffs until one finally goes below an undisclosed maximum point of reasonableness and is allowed to take effect. The administrative process, after all, is not modeled on 'The Price is Right.' What the Commission did here, therefore, far from being condemnable, is an intelligible and practical exercise of its suspension power . . . .\") It may be noted in passing that former section 1850 of the Insurance Code effectively denied the Insurance Commissioner the \"power to fix and determine\" rates. (Stats. 1947, ch. 805, § 1, p. 1896.) That provision, however, was repealed by Proposition 103. (Prop. 103, Gen. Elec. (Nov. 8, 1988), § 7, reprinted in Ballot Pamp., Proposed Stats. and Amends. to Cal. Const. with arguments to voters, Gen. Elec. (Nov. 8, 1988) p. 141.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The insurers complain of what they call the ratemaking formula's \"rigidity.\" Their objection seems to be that, in actuality, the formula treats dissimilarly situated insurers similarly. It does not, at least to Judge from the orders to show cause issued by the Insurance Commissioner to 14 insurers, including 20th Century, in the matter of their rate rollback liability. It is the insurers themselves that have directed our attention to these orders to show cause.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Power Comm'n v. Hope Gas Co., supra, 320 U.S. 591, which defined the \"standards\" of the Natural Gas Act of 1938 (52 Stat. 821, 15 U.S.C § 717 et seq.), effectively delimited the scope of the \"requirements\" of the United States Constitution: \"There are no constitutional requirements more exacting than the standards of the Act . . . .\" (Power Comm'n v. Hope Gas Co., supra, 320 U.S. at p. 607.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. In Guaranty Nat. Ins. Co. v. Gates (9th Cir. 1990) 916 F.2d 508, 515, there is language that may be read to erroneously state that the producer is constitutionally \"guaranteed\" a \"'fair and reasonable return[,]'\" and that such a return must necessarily be above the \"break even\" level. We will not indulge in such a reading.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Otherwise, the producer could be deemed to be \"operating successfully\" whenever, for example, it was merely in the position to create a \"healthy\" cash flow by imprudently liquidating assets amassed in the past or by unreasonably borrowing funds anticipated against the future. That cannot be.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. To the extent the superior court determined that the ratemaking formula is confiscatory simply because it is apparently \"unique\" and without \"precedent\" among \"similar statutes containing the widely used\" \"excessive\"\"inadequate\" standard, it erred. Our Discussion in the text disposes of the point. \"It is the result reached not the method employed which is controlling.\" (Power Comm'n v. Hope Gas Co., supra, 320 U.S. at p. 602.) Indeed, the method may be novel (see Duquesne Light Co. v. Barasch, supra, 488 U.S. at p. 316) and implicate formulaic ratemaking (see Permian Basin Area Rate Cases, supra, 390 U.S. at pp. 768-770) using data reflecting the condition and performance of a group of regulated firms (see id. at pp. 766-790).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Of course, it must be noted, the ratemaking formula effectively imposes individual \"price caps\" of a sort on the rates of insurers individually.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Dr. Safir testified in part as follows: \". . . I consulted the 1990 [A..M.] Best Key Rating Guide for Property-Casualty Insurance, in order to determine what that company used as an 'accepted norm' for return to policyholders' surplus. The specific rate of return ratio I calculated for rollback purposes, net income after taxes as a percent of average policyholders' surplus, is not used by [A.M.] Best for evaluation purposes. However, it is very close to the test I employed: net income after taxes to prior-year-end policyholders' surplus. [P] According to [Best's] Key Rating Guide, the acceptable range for this rate-of-return is currently from 3% to 10% . . . .\" As the insurers themselves acknowledge through State Farm's representation (see fn. 8, ante), \"participants in the [insurance] industry . . . commonly rely on Best's as an accurate factual source and it is well accepted as an accurate and authoritative source of insurance data.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. In Calfarm, we recognized that a court might subsequently be presented with a claim that Proposition 103's maximum rate for the rollback year \"is confiscatory as to a particular insurer and line of insurance.\" (Calfarm Ins. Co. v. Deukmejian, supra, 48 Cal. 3d at p. 825, fn. 18, italics added.) Our recognition was factual: it concerns the nature of the complaint that an insurer might make. It was not normative: it does not mean that confiscation is Judged other than with an eye toward the insurer as a whole.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. In Fireman's Fund Ins. Co. v. Garamendi, supra, 790 F. Supp. at page 950, footnote 11, the court effectively found the \"relitigation bar\" \"preclusive.\" For the reasons stated in the text, it erred.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The insurers may be understood to argue that the rate regulations as to rollbacks may operate to reduce an insurer's maximum rate for the rollback year to a point more than 20 percent below its 1987 rate, at least in some lines. They treat the minimum permitted earned premium for each line as though it were the maximum rate. As explained in the text, that is not the case. The minimum permitted earned premium for each line functions only as an intermediate step in the refund calculation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The insurers may be understood to argue that the United States and/or California Constitutions require us to subject the rate regulations as to rollbacks on their face to independent review with regard to method as well as result. The federal charter imposes no such obligation. It \"is not designed to arbitrate [such] economic niceties\" (Duquesne Light Co. v. Barasch, supra, 488 U.S. at p. 314): \"it is the result reached not the method employed which is controlling\" (Power Comm'n v. Hope Gas Co., supra, 320 U.S. at p. 602). The same is true of the state charter. There can be little doubt that courts \"are ill equipped to make\" the \"multitude of microeconomic decisions\" that would be demanded. (Harris v. Capital Growth Investors XIV, supra, 52 Cal. 3d at p. 1166.) It makes no difference that the regulations in question implicate federal and state constitutional provisions. All regulations do, at least potentially. It may be that in reviewing a rate order, a court \"must examine the manner in which the [regulator] has employed the methods of regulation which it has itself selected, and must decide whether each of the order's essential elements is supported by substantial evidence.\" (Permian Basis Area Rate Cases, supra, 390 U.S. at p. 792.) But we are not yet reviewing a rate order. (See pt. III.M. \u0026 fn. 31, post.) Our review of the superior court's determinations concerning the facial validity vel non of the rate regulations as to rollbacks persuades us of the general soundness of the regulations. We concluded above that the rate regulations--both generally and specifically as to rollbacks--come within the rate-setting exception, hence fall outside the OAL review requirement, and therefore are not invalid because of OAL disapproval. (See pt. III.A., ante.) But proceeding to the merits, for the reasons stated in the text we disagree with the OAL's Conclusion that the rate regulations generally are beyond the authority conferred on the Insurance Commissioner by Proposition 103 as construed in Calfarm (see Gov. Code, § 11349.1, subd. (a)(2)) and are inconsistent with the initiative's terms (see id., § 11349.1, subd. (a)(4)) on the ground that they impermissibly \"restrict an insurer's right to obtain relief from confiscatory rates.\" We reject an attempt by the insurers to mount a broad, facial challenge to the rate regulations as to rollbacks based on orders to show cause issued by the commissioner to 14 insurers, including 20th Century, in the matter of their rate rollback liability. To quote the commissioner: \"An order to show cause functions like an accusation [citation], containing the agency's preliminary assessment of the insurer's rollback liability and ordering the insurer either to refund that amount or to prove otherwise . . . .\" It cannot support the weight placed on it by the insurers.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Tennessee Gas Pipeline Co. v. F.E.R.C. (D.C. Cir. 1991) 288 U.S. App. D.C. 333, 926 F.2d 1206, on which 20th Century and the other insurers rely, is not to the contrary. That the Federal Energy Regulatory Commission might \"endeavor[] to set a utility's rate of return on equity at its cost of equity capital\" as a matter of policy (id. at p. 1208) does not mean that another regulator must do the same under constitutional compulsion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. In this court, 20th Century attempts to incorporate into the analysis of the treatment of its earthquake line the treatment of its \"other liability\" and \"inland marine\" lines. Such incorporation does not affect the result.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The insurers may be understood to argue that the United States and/or California Constitutions require us to subject the rate regulations as to rollbacks as applied to independent review with regard to method as well as result. Neither the federal charter nor that of the state imposes such obligation. (See also fn. 26, ante.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. 20th Century may be understood to claim that its maximum rate for the rollback year was reduced to a point more than 20 percent below its 1987 rate (at least in some lines), contrary to the rate rollback requirement provision of Proposition 103. Such an assertion must be dismissed as baseless.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Our review of the superior court's determinations concerning the validity vel non of the rate regulations as to rollbacks as applied to 20th Century persuades us that they are generally sound. In reviewing the 20th Century rate rollback order, although \"not obliged to examine each detail\" (Permian Basis Area Rate Cases, supra, 390 U.S. at p. 767) we have in fact \"examined the manner in which the [Insurance Commissioner] has employed the methods of regulation which [he] has [himself] selected, and [have] decided [that] each of the order's essential elements is supported by substantial evidence\" (id. at p. 792). We note that the superior court denied \"as moot\" a motion made by 20th Century in 20th Century II \"to admit expert rebuttal testimony and/or [take] judicial notice [of such testimony]\"(capitalization deleted) relating to its cost of capital. (We should also note that the superior court expressed its view that \"as far as the judicial notice is concerned, it does seem to me that this is really not the type of matter that is properly judicially noticed . . . .\") There is no need to remand the cause for redetermination. The \"testimony\" in question was essentially cumulative in substance if not in form. It was without marginal significance. Indeed, it should probably have been excluded under Evidence Code section 352 on the ground that its admission would have \"necessitated undue consumption of time . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Uniquely to the contrary is the decision in The Aetna Casualty \u0026 Surety Co. v. Commissioner of Insurance (1970) 358 Mass. 272, 281, 263 N.E.2d 698: \"Insurers are not required to either submit to confiscatory rates or go out of business.\" This is \"substantive\" due process, pure and simple. It has been dead since at least the late 1930's. Indeed, in Bowles v. Willingham (1944) 321 U.S. 503, 88 L. Ed. 892, 64 S. Ct. 641, the United States Supreme Court--declaring flatly that \"we are not dealing here with a situation which involves a 'taking' of property\" (id. at p. 517)--validated a certain governmental price regulation that effectively required residential landlords \"to either submit to [assertedly] confiscatory rates or go out of business.\"\u003c/span\u003e\n\n",
    "body_length": 262544,
    "citedas": [
      "8 Cal.4th 216",
      "8 Cal.4th 440D",
      "878 P.2d 566",
      "32 Cal.Rptr.2d 807"
    ],
    "attorneys": "Strumwasser \u0026 Woocher, Michael J. Strumwasser, Fredric D. Woocher and Susan L. Durbin for Defendant and Appellant. Joseph Lawrence, Acting City Attorney (Santa Monica), Martin T. Tachiki, Barry A. Rosenbaum and Kimery A. Shelton, Deputy City Attorneys, as Amici Curiae on behalf of Defendant and Appellant. Karl M. Manheim, Hall \u0026 Phillips, Hall \u0026 Associates, John R. Phillips, Edward P. Howard and Leon Dayan for Intervener and Appellant. Norma P. Garcia as Amicus Curiae on behalf of Intervener and Appellant and Defendant and Appellant. John R. Bollington, Thelen, Marrin, Johnson \u0026 Bridges, Gary L. Fontana, Curtis A. Cole, Wynne S. Carvill, Hilary N. Rowen, John L. Kortum, Morrison \u0026 Foerster, Marc P. Fairman, Michael M. Carlson, Latham \u0026 Watkins, Mark S. Pulliam, Katherine A. Lauer, Barger \u0026 Wolen, Kent R. Keller, Robert W. Hogeboom, Steven H. Weinstein, John C. Holmes and Lawrence F. Krutchik for Plaintiffs and Respondents. Judith K. Mintel, Heller, Ehrman, White \u0026 McAuliffe, Paul Alexander, Vanessa Wells, Munger, Tolles \u0026 Olson, Allen M. Katz, Craig Berrington, David Snyder, Nancy Siegel, Thomas Aceituno, Nielsen, Merksamer, Parrinello, Mueller \u0026 Naylor, Steven A. Merksamer and John E. Mueller as Amici Curiae on behalf of Plaintiffs and Respondents.",
    "category": [],
    "judges": "Mosk, J.; Lucas, C.J., Kennard, J., Arabian, J., Baxter, J., George, J., and Werdegar, J., Concurring. Mosk, J., Concurring separately.",
    "citation_count": 82
  }
}
