{
  "id": "qIZXP2YBTlTomsSBT1RV",
  "document": {
    "title": "United States v. McPartlin",
    "full_title": "UNITED STATES OF AMERICA v. ROBERT MCPARTLIN, ET AL. .",
    "jurisdiction": "Seventh Circuit",
    "date": "1979-03-26T00:00:00.000Z",
    "docket": "Nos. 77-2258, 77-2259, 77-2274, 77-2275, 77-2280",
    "body": "The appellants were convicted, in a nine-week jury trial, of conspiring to violate the wire and travel fraud statutes and of substantive violations of those statutes.\n\nThe indictment charged that defendant Frederick B. Ingram,\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e chairman of the board of the Louisiana-based Ingram Corporation, had paid defendant Robert F. McPartlin, an Illinois legislator, defendant Valentine Janicki, a trustee for the Metropolitan Sanitary District, and others more than $900,000 to secure for the Ingram Corporation a multi-million dollar sludge-hauling contract with the District. Defendants Franklin H. Weber, a businessman, and Edwin T. Bull, president of a towing company, were alleged to be intermediaries through whom many of the payments were made. William J. Benton, vice president of Ingram Corporation, was an unindicted co-conspirator who played a major role in the conspiracy and testified as a witness for the prosecution. The defendants were convicted of numerous violations of the Travel Act, 18 U.S.C. ยง 1952, and the Wire, Radio, Television Fraud Act, 18 U.S.C. ยง 1343, and of conspiring to violate those acts in violation of 18 U.S.C. ยง 371. The jury acquitted three other defendants, E. Bronson Ingram, brother of Frederick B. Ingram and an officer of Ingram Corporation, Chester Majewski, a Metropolitan Sanitary District trustee, and Bart T. Lynam, General Supervisor of the Sanitary District.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nThe defendants urge as grounds for reversal the district court's denial of motions for severance, a ruling on the alleged withholding by the prosecution of evidence favorable to the defendants until the beginning of the trial, rulings admitting and excluding evidence, certain instructions to the jury, and other alleged trial errors. In this portion of the opinion the facts are stated and the issues arising from the denial of severance are decided. Judge Pell and Judge Sprecher have written, and I concur in, the portions of the opinion dealing with the other issues.\n\nThe Facts\n\nThe Sanitary District is a municipal corporation with primary responsibility for disposing of sewage from Chicago and surrounding areas. The District's business is governed by an elected Board of Trustees\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e and managed by a professional staff, which from time to time makes recommendations to the Board concerning major undertakings of the District.\n\nThe Sanitary District operates a sewage treatment plant in Stickney, Illinois. Until 1971 the sludge produced as a by-product was disposed of by pumping it into nearby lagoons. Early that year, because the lagoons were rapidly being filled and efforts to clean them had failed, the District announced plans to have the sludge transported to Fulton County, Illinois, about 160 miles southwest of Stickney, and solicited bids on the project, which were due on March 19, 1971.\n\nViewed in the light most favorable to the prosecution, the evidence showed that Benton, acting with the knowledge and complicity of Frederick Ingram and through intermediaries Bull and Weber, bribed McPartlin and Janicki to cause the sludge-hauling contract to be awarded to Ingram Corporation and one of its subsidiaries, and later bribed the same officials to secure favorable treatment under the contract and modifications of the contract. The details were as follows:\n\nWhen the District solicited bids on the sludge-hauling project, defendant Bull assisted Frank Oberle, an employee of Ingram Contractors, Inc., a wholly owned subsidiary of Ingram Corporation, in investigating the new proposal. During the week before the bids were to be submitted, Bull visited Robert Howson, a vice president of Ingram Contractors, Inc., in New Orleans, Louisiana, and told Howson that if Ingram Corporation expected to secure the contract, it would have to make a \"political contribution.\" Howson responded that he was not in that sort of business, but then took Bull to meet William J. Benton, vice president of Ingram Corporation and president of Ingram Contractors, Inc.\n\nIngram Corporation, Burlington Northern, Inc., and the Atchison, Topeka and Santa Fe Railway Company were the leading contenders among those submitting bids on March 19, 1971. To negotiate with these three bidders, the Sanitary District established a committee, which met with representatives of the bidders for the first time on March 23, 1971.\n\nThat evening Bull, Oberle, and Benton met in Benton's hotel room, where they were later joined by defendant Weber. After Bull had introduced Weber to Benton, Bull and Oberle left the room. Weber then told Benton that if Ingram Corporation wanted the sludge-hauling contract, it would have to make a $250,000 \"political contribution.\" Benton replied that he would have to get approval from his superiors. After agreeing to meet Benton the next day, Weber left.\n\nBenton then telephoned defendant Frederick Ingram to inform him of Weber's \"political contribution\" proposal. Ingram agreed, provided that the contribution could be added to the cost of the contract.\n\nOn March 24, 1971, Benton again met with Bull, who expressed his belief that if the Ingram Corporation accepted Weber's proposal, it would get the contract. Bull also told Benton that if the corporation did get the contract, he wanted $100,000 in addition to anything it paid Weber. At another meeting later in the day, Weber asked Benton to open an account at a Chicago bank to demonstrate Ingram Corporation's \"good faith.\" That same day, Benton opened an account at the First National Bank of Chicago.\n\nThe following week, Weber called Benton and told him that Burlington Northern, Inc. had offered to make a $295,000 political contribution. According to Weber, it was therefore necessary for Ingram Corporation to raise its contribution to $450,000, including a $150,000 cash payment before the contract was awarded. Again Benton consulted Frederick Ingram, who again agreed on condition that the contribution could be added to the contract price. Benton communicated Ingram Corporation's approval to Weber, but said that the corporation could not raise $150,000 in cash on such short notice. Weber replied that some of the $150,000 had to be paid by April 3, 1971.\n\nOn April 3, 1971, Weber and McPartlin went to Benton's Chicago hotel room, where Weber introduced McPartlin to Benton as the man who handled all political contributions for the Democratic Party in Illinois. McPartlin assured Benton that Ingram Corporation would receive at least $21,500,000 in total revenue from the sludge-hauling contract. Benton gave McPartlin $75,000 in cash, including several one thousand dollar bills. On April 6, 1971, Weber deposited nine one thousand dollar bills in the account of one of his defunct corporations, Illinois Southern Materials.\n\nOn April 6, 1971, Weber telephoned Benton, asking for $25,000 in cash immediately to secure the cooperation of three Sanitary District staff members. When Benton protested that he could not deliver $25,000 cash on such short notice, Weber suggested that Ingram Corporation issue a check in that amount to Bull Towing Company, which Benton caused to be done the next day. On April 8, 1971, Edwin Bull deposited the Ingram check in the account of Bull Towing Company and, at the same time, withdrew $25,000 in cash from the account.\n\nThe Sanitary District requested the three bidders on the sludge-hauling contract to submit new bids by April 15, 1971. Santa Fe declined. Burlington Northern submitted a revised bid of $18,300,000. Oberle submitted Ingram Corporation's revised bid of $16,990,000, after which he returned to his hotel room, where he received a telephone call from either Benton or Weber. The caller instructed him to go to the bar at the Continental Plaza Hotel to meet defendant Janicki, which Oberle did.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e At the meeting in the bar Janicki told Oberle to raise Ingram's revised bid to $17,990,000. Oberle then returned to his hotel room and telephoned Benton for advise. Benton instructed Oberle to attend the Sanitary District negotiating committee meeting scheduled for that afternoon. While attending the meeting, Oberle received telephone instructions from Benton to raise the Ingram bid by $1,000,000 to $17,990,000. Oberle did so.\n\nOn April 22, 1971, the Sanitary District Board of Trustees voted to award the contract to Ingram Corporation. Between that date and May 12, 1971, a contract was drafted by members of the Sanitary District staff and Ingram Corporation representatives, including John Donnelly, president of Ingram Barge Company, the Ingram Corporation subsidiary that would transport the sludge under the contract. The staff insisted on a liquidated damages clause authorizing the District to prescribe the amount of sludge to be transported in any 24-hour period and providing that Ingram Corporation would be assessed a penalty for each ton of sludge not transported, as prescribed, in any 24-hour period. Donnelly, after initially refusing to agree to the provision, discussed it with Benton, who told him to agree to it. Only after talking with Frederick Ingram, however, did Donnelly accede to inclusion of the liquidated damages clause.\n\nThe contract provided that Ingram Corporation would construct additions to the treatment facilities at Stickney and an unloading dock and pump station in Fulton County, for which work the Sanitary District was to pay $733,000. Ingram Corporation was also to construct a pipeline over property not owned by the District, for which construction the District agreed to pay $68,000 per month for 36 months, a total of $2,448,000. The contract also provided that Ingram Corporation would receive $1.802 per ton of sludge hauled from Stickney to Fulton County. The parties estimated that over the life of the contract 8,000,000 tons of sludge would be transported.\n\nOn May 19, 1971, Weber and Benton met in New Orleans to discuss ways of increasing Ingram Corporation's total revenue under the contract to the $21,500,000 that McPartlin had assured Benton would be forthcoming. Weber told Benton that Janicki and he thought that the corporation could receive an additional $2,100,000 by billing the Sanitary District a second time for the construction of the pipeline and the construction in Fulton County.\n\nOn June 26, 1971, Weber told Benton that Janicki needed $21,250 to pay off three District staff members. Ingram issued a check for that amount to Southwest Expressway, another of Weber's defunct corporations.\n\nOn July 27, 1971, Weber issued a $20,000 check to Bull Towing Company. Edwin Bull deposited the check and, at the same time, withdrew $20,000. The next day, the Illinois Commerce Commission granted Ingram Corporation's request for a certificate of convenience and necessity.\n\nOn August 14, 1971, Edwin Bull negotiated two contracts with Ingram Corporation. In one of them Ingram Corporation agreed to rent barges from Bull Towing Company to transport sludge from the Lemont Bridge over the Illinois River to Fulton County. Donnelly signed this contract but refused to sign the other contract, under which Ingram Corporation would agree to pay Bull $.17 per ton for transporting sludge from Stickney to the Lemont Bridge. Ten cents per ton were intended as payment for actual towing services; the other seven cents per ton were intended as payment for consulting services and engineering and feasibility studies that Bull had allegedly performed for Ingram Corporation. The second contract also provided for payment to Bull of a $76,000 \"finder's fee.\"\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Donnelly objected to the \"finder's fee,\" questioned whether any consulting services or studies that Bull provided to Ingram Corporation were worth $560,000, and questioned Bull's competence as a barge operator. Out of Bull's presence, Benton told Donnelly that if Bull did not participate in the sludge-hauling contract, there would be no contract. Donnelly still refused to sign the second Ingram-Bull contract, but permitted Benton to sign it on behalf of Ingram Barge Corporation as well as Ingram Corporation.\n\nOn August 15, 1971, Benton, Weber, and McPartlin met in Chicago to discuss further payments. Benton agreed to provide.$146,000 in two installments. On August 18, 1971, Oscar Hardison, comptroller of Ingram Corporation, delivered $30,000 in cash to Weber at O'Hare Airport in Chicago. On August 28, 1971, another Ingram executive, G. Glen Martin, gave Weber $116,000, which consisted of $46,000 in cash and $70,000 in checks payable to Weber's defunct corporations.\n\nIngram Barge Corporation began transporting sludge six days later than the date it was required to do so under the sludge-hauling contract; whereupon the Sanitary District assessed liquidated damages of $30,000 under the liquidated damages clause. In early October, 1971, Benton, Weber, and Janicki held a meeting in Chicago to discuss this matter, following which the Sanitary District withdrew the assessment. After the meeting, Weber told Benton that Janicki wanted $100,000 by the end of 1971. When informed by Benton of this request, however, Frederick Ingram refused, saying that no more payments would be made until the Sanitary District began making payments on the pipeline, as Weber had promised it would.\n\nOn December 15, 1971, Weber telephoned Benton to tell him that the Sanitary District would issue a check to Ingram Corporation for $1,000,000, as partial payment on the pipeline. When Benton arrived at Janicki's office the following day, however, Janicki disclaimed any knowledge of the $1,000,000 check. Benton threatened to \"jerk the rug\" from under everyone in Chicago.\n\nUpon learning of Benton's threat, Weber informed Oberle of it and asked Oberle to do whatever he could about Benton. Oberle telephoned defendant Frederick Ingram to tell him of Benton's threat. Ingram expressed no surprise, simply thanked Oberle for the information and hung up, and later in the day met with Benton to discuss the matter. At the meeting they agreed that Benton would continue to represent Ingram's interest in dealing with the Chicago officials.\n\nOn December 21, 1971, Weber, Janicki, and Benton met in Benton's hotel room in Chicago. Benton apologized for his threat. He then gave Weber two checks payable to Weber's defunct corporations in the amount of $50,070. This payment brought Ingram's total contribution to.$317,320, leaving a balance of $132,680 on the $450,000 commitment.\n\nIn February, 1972, Weber told Benton that because of the difficulties in getting the Sanitary District to pay the additional $2,100,000 for the pipeline, Ingram Corporation would have to increase its contribution to $620,000. On February 17, 1972, Weber asked Benton for $100,000 in cash immediately. When Benton told defendant Ingram of the request, Ingram responded that he would investigate ways of raising the money. On February 28, 1972, Benton delivered $100,000 to Mrs. Valentine Janicki.\n\nAt trial, defendant Frederick Ingram contended that he did not learn until this February, 1972 meeting with Benton that his company had secured a multi-million dollar contract by paying more than $300,000 to Chicago officials.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Ingram testified that he protested against paying the bribes, but reluctantly agreed when Benton informed him that if he refused to pay, the Sanitary District would not pay the additional $2,100,000 for the pipeline and would use the liquidated damages clause to penalize Ingram Corporation.\n\nOn March 10, 1972, Weber told Benton that if Ingram Corporation could deliver $100,000 before the end of the month, the Sanitary District Board of Trustees would approve the purchase of the pipeline. One-fourth of this amount was delivered, but the balance was not, and the trustees failed to approve the purchase. At a July 6, 1972 meeting between Benton, Janicki, and Weber, however, Janicki promised that the trustees would take some action on the pipeline in the month of July. As promised, the board of trustees authorized the staff to negotiate with Ingram for the purchase of the pipeline on July 20, 1972.\n\nOn August 23, 1972, Benton gave McPartlin $80,000 in cash. McPartlin told Benton that the trustees would approve the purchase of the pipeline in September, but Ingram would have to pay the balance of its contribution, about $95,000, in September also.\n\nBetween August and November, 1972, Ingram Corporation and the Chicago officials negotiated a new agreement. Ingram would pay $750,000 over a three year period, and the Sanitary District would purchase the pipeline, modify the liquidated damages clause, and extend the sludge-hauling contract for three years at a higher price per ton.\n\nOn December 28, 1972, representatives of the Ingram companies and the District signed an agreement covering the pipeline purchase that was to be effective only if the parties also signed two other agreements: a retroactive modification of the liquidated damages clause and a three year extension of the sludge-hauling contract. On January 26, 1973, the additional agreements were signed.\n\nAfter the signing, Benton returned to his hotel room and telephoned Janicki to tell him that his money was ready. Janicki sent his secretary to pick up a package containing $50,000 in cash. Benton then telephoned Weber to tell him to come and pick up the balance of the money due. When Weber arrived, Benton gave him $95,000 in cash and nine letters of credit drawn on a Swiss bank in the amount of $70,000 each.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nOne of the letters of credit matured in June, 1973, and each of the others matured sequentially at six-month intervals. Weber admitted negotiating the first four letters at the Swiss bank in July, 1973, December, 1973, June, 1974, and December, 1974. On each occasion, he purchased his plane ticket to Europe with cash, arranged for his trip to Switzerland only after he arrived in Europe, and stopped in Toronto, Canada, on the way back to the United States. On his last two trips, Weber telephoned Janicki from Europe.\n\nSometime before the fall of 1974 a federal grand jury commenced an investigation of the events surrounding the sludge-hauling contract. In May, 1975, the government granted immunity to Benton.\n\nIn November, 1975, Weber sent his brother, Henry Weber, to Europe to negotiate the fifth and sixth letters of credit, which matured in June, 1975, and December, 1975.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Following his brother's instructions, Henry Weber did not proceed directly to the drawee Swiss bank but went to a bank in Vaduz, Liechtenstein, to have that bank present the letters to the Swiss bank.\n\nOn November 26, 1975, two weeks after his return from Liechtenstein, Henry Weber appeared before the grand jury and testified that he had only visited Frankfurt and Munich. On December 3, 1975, the government called Henry Weber to appear a second time before the grand jury, this time asking Weber to bring his travel records. During his second appearance, Henry Weber testified that he had been mistaken when he said that he had only visited Frankfurt and Munich and that he had also visited Vaduz.\n\nOn December 9, 1975, Franklin Weber's attorney telephoned one of the government's attorneys in this case and informed him of what the government attorney already had reason to suspect, namely, that Franklin Weber had possession of the remaining letters of credit.\n\nAdditional details and procedural matters necessary to an understanding of the various issues to be decided will be stated at appropriate places in the opinion.\n\nI.\n\nSeverance\n\nBefore discussing the specific attacks on the district court's denial of severance, some general principles should be noted. The question of whether charges that have been properly joined ought to be severed for trial is for the discretion of the trial judge, whose decision will be reversed only upon a showing of clear abuse. United States v. Tanner, 471 F.2d 128, 137 (7th Cir.), Cert. denied, 409 U.S. 949, 93 S. Ct. 269, 34 L. Ed. 2d 220 (1972). The defendant has the burden of showing prejudice, which is a difficult one. Id. A denial of severance will rarely be reversed on review, Tillman v. United States, 406 F.2d 930, 935 (5th Cir.), Cert. denied, 395 U.S. 830, 89 S. Ct. 2143, 23 L. Ed. 2d 742 (1969), and then only for the most \"cogent reasons,\" United States v. Kahn, 381 F.2d 824, 838 (7th Cir.), Cert. denied, 389 U.S. 1015, 88 S. Ct. 591, 19 L. Ed. 2d 661 (1967). There is, moreover, a strong policy in favor of joint trial \"where the charge against all the defendants may be proved by the same evidence and results from the same series of acts.\" United States v. Cohen, 124 F.2d 164, 165 (2d Cir.), Cert. denied sub nom. Bernstein v. United States, 315 U.S. 811, 62 S. Ct. 796, 86 L. Ed. 1210 (1942). See also United States v. Echeles, 352 F.2d 892, 896 (7th Cir. 1965) recently quoted in United States v. Harris, 542 F.2d 1283, 1312 (7th Cir.), Cert. denied, 430 U.S. 934, 97 S. Ct. 1558, 51 L. Ed. 2d 779 (1976).\n\nIn the case at bar all appellants assert error in the denial of their motions for severance. Frederick Ingram argues that the denial deprived him of evidence that would otherwise have been available. The other appellants, whom we shall call the Illinois defendants, argue that they were prejudiced by the denial because Ingram and his brother (whom the jury acquitted) defended on a ground antagonistic to the defenses of their co-defendants and because of curtailment of cross-examination and the spillover effect of evidence admitted only against Frederick Ingram. We turn first to the argument of the Illinois defendants.\n\nA. The Illinois Defendants\n\n1. Antagonistic Defenses\n\nThe Ingrams contended that the payments were made only because the Sanitary District threatened to take action that would have resulted in financial disaster to Ingram Corporation, and therefore neither of them had the \"intent (to influence the performance of an official act) required by the Illinois bribery statute.\" United States v. Peskin, 527 F.2d 71, 84 (7th Cir. 1975), Cert. denied, 429 U.S. 818, 97 S. Ct. 63, 50 L. Ed. 2d 79 (1976). It was not necessary to this defense that the Illinois defendants were guilty of extortion or received bribes, because it was possible that Benton, through whom the corporation's communications with, and payments to, the Illinois defendants were carried out, did not pass any of the money on but kept it all himself.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Thus the Ingram defense was not necessarily antagonistic to the defenses of others, although it was possible, on the Ingrams' theory, that they were innocent even if the others were guilty.\n\nEven if the defenses were to a degree antagonistic, however, it does not follow that there should have been two or more trials. One has no right to any tactical advantage that would result if evidence that is admissible against him in either a joint or separate trial might be unavailable in a separate trial. Cf. Brady v. Maryland, 373 U.S. 83, 90-91, 83 S. Ct. 1194, 10 L. Ed. 2d 215 (1963).\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e It is therefore the settled rule that a defendant is not entitled to a severance merely because it would give him a better chance of acquittal. See United States v. Tanner, supra, 471 F.2d at 137. Thus antagonistic defenses do not require the granting of severance, United States v. Hutul, 416 F.2d 607, 620 (7th Cir.), Cert. denied, 396 U.S. 1012, 90 S. Ct. 573, 24 L. Ed. 2d 504 (1970), even when one defendant takes the stand and blames his co-defendant for the crime, United States v. Joyce, 499 F.2d 9, 21 (7th Cir.), Cert. denied, 419 U.S. 1031, 95 S. Ct. 512, 42 L. Ed. 2d 306 (1974). Even when the defendant who testified he was the victim of extortion had dealt directly with the defendant alleged to have extorted the bribe, we sustained the denial of severance. United States v. George, 477 F.2d 508 (7th Cir.), Cert. denied, 414 U.S. 827, 94 S. Ct. 49, 38 L. Ed. 2d 61 (1973).\n\nThere may be cases, as we recognized in George, in which the conflict among defendants is of such a nature that the \"jury will unjustifiably infer that this conflict alone demonstrates that both are guilty.\" 477 F.2d at 515. This is not such a case. The joinder did not result in the exclusion or admission of any evidence of consequence that would not have been excludable or admissible in separate trials. Nor was any argument made that could not properly have been made in such a separate trial. There was no cognizable prejudice arising from antagonistic defenses.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\n2. Curtailment of Cross-Examination\n\nJanicki complains that cross-examination was curtailed because of the joinder when, during cross-examination of Benton, the trial judge delivered a general admonition against repetitious cross-examination. Neither Janicki nor the other Illinois defendants, who adopt by reference his arguments on severance, show any prejudice resulting from the admonition or point to any specific ruling curtailing their cross-examination. It was, moreover, entirely proper for the judge to attempt to forestall repetition.\n\n3. Spillover Effect of Evidence Offered Against Frederick Ingram\n\nJanicki also asserts that he was prejudiced by evidence offered against Frederick Ingram showing that Ingram Corporation had bribed a Brazilian corporate official between 1969 and 1971, because the conduct of the Brazilian was similar to that with which Janicki was charged. The trial court instructed the jury to consider the evidence of the earlier bribe only as to Frederick Ingram's state of mind, but Janicki asserts that this instruction was ineffective. We see no substantial risk that the jury would believe that because a Brazilian corporate officer took a bribe from Ingram Corporation, Janicki did also, and therefore we conclude that Janicki was not prejudiced by the admission of this evidence. Its admissibility as to Frederick Ingram and the effectiveness of the limiting instruction are discussed below.\n\nThe Illinois defendants were not deprived of a fair trial by the joinder.\n\nB. Frederick Ingram\n\nFrederick Ingram's attack on the joinder is based on the district court's exclusion of three items of evidence offered to support his extortion defense, which Ingram argues occurred because he was tried with the men he allegedly bribed.\n\n1. The McPartlin Statements and the Attorney-Client Privilege Among Co-defendants and Their Counsel\n\nThroughout the period covered by the indictment, Benton kept diaries, or appointment calendars, in which he made notes concerning meetings and telephone conversations, naming the persons involved and often recording the substance of the conversations. The Benton diaries figured prominently in the government's case, for they corroborated much of his testimony.\n\nDestroying Benton's credibility was important to Ingram, as it was to the other defendants, even though Ingram's defense was based, in part, on the argument that he had made the payments in response to the threats Benton had reported to him, because Ingram's account of events in issue differed materially from Benton's, and because the government's case hinged largely on Benton's testimony. Since Benton's diaries corroborated so much of his testimony, it was imperative from the standpoint of all defendants that an effort be made to discredit them.\n\nSuch an effort was made, and Frederick Ingram and McPartlin cooperated in that effort. In a brief supporting a pretrial \"Motion for Additional Time to Conduct Document Analysis,\" Ingram's counsel stated, with reference to contemplated tests on the Benton diaries,\n\n(T)he defendant Frederic B. Ingram is not the only defendant who may be affected by the results of these tests. Besides the general effect of the doubts that may be raised as to Benton's veracity and the credibility of the diary entries, the case against at least one other defendant Robert F. McPartlin may be substantially affected by the results of the tests. From the results of the tests conducted so far, it appears that at least two of the suspicious diary entries relate to alleged payments of money to Mr. McPartlin.\n\nAn investigator acting for Frederick Ingram's counsel twice interviewed McPartlin with the consent of the latter's counsel\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e for the purpose of determining whether there was a basis for challenging the truth of some of the diary entries. In the second of these interviews McPartlin made certain statements, which Ingram argues tend to support his defense. At trial, when Ingram offered evidence of these statements, McPartlin's counsel objected on the ground, Inter alia, of the attorney-client privilege, and the court, after an In camera hearing, sustained the objection on this and another ground.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nThe exclusion of the McPartlin statements would not be reversible error even if he had not been entitled to claim the privilege. We are satisfied from our examination of the transcript of the In camera hearing, which was sealed and made a part of the record on appeal, that the statements merely corroborated facts which were admitted in evidence and which the jury obviously found to be true.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e We do not disclose the contents of the statements because they remain protected by the attorney-client privilege, on which we alternatively base our ruling on this point.\n\nMcPartlin was entitled to the protection of the attorney-client privilege, because his statements were made in confidence to an attorney for a co-defendant for a common purpose related to both defenses. They were made in connection with the project of attempting to discredit Benton, a project in which Ingram and McPartlin and their attorneys were jointly engaged for the benefit of both defendants. Ingram acknowledges that communications by a client to his own lawyer remain privileged when the lawyer subsequently shares them with co-defendants for purposes of a common defense. The common-defense rule, which is not as narrow as Ingram contends, has been recognized in cases spanning more than a century. Chahoon v. Commonwealth, 62 Va. (21 Gratt.) 822 (1871); Schmitt v. Emery, 211 Minn. 547, 2 N.W.2d 413 (1942); Continental Oil Co. v. United States, 330 F.2d 347 (1964); Hunydee v. United States, 355 F.2d 183 (9th Cir. 1965); Matter of Grand Jury Subpoena, 406 F. Supp. 381, 387-389 (S.D.N.Y.1975); See State v. Emmanuel, 42 Wash.2d 799, 259 P.2d 845, 854-855 (1953); Note, \"Waiver of Attorney-Client Privilege on Inter-Attorney Exchange of Information,\" 63 Yale L.J. 1030 (1954); Note, \"The Attorney-Client Privilege in Multiple Party Situations,\" 8 Colum.J.L. \u0026 Soc.Prob. 179 (1972). Uninhibited communication among joint parties and their counsel about matters of common concern is often important to the protection of their interests. Note, Supra, 8 Colum.J.L. \u0026 Soc.Prob. at 179-180. In criminal cases it can be necessary to a fair opportunity to defend. Therefore, waiver is not to be inferred from the disclosure in confidence to a co-party's attorney for a common purpose.\n\nIn the case at bar, the judge found, as a preliminary question of fact, from the evidence adduced at the hearing held pursuant to Rule 404(a), Fed.R.Evid., that McPartlin had made the statements to the investigator in confidence. That finding is not clearly erroneous.\n\nIngram argues that the co-defendants' defenses must be in all respects compatible if the joint-defense privilege is to be applicable. The cases do not establish such a limitation,\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e and there is no reason to impose it. Rule 503(b)(3) of the proposed Federal Rules of Evidence, as approved by the Supreme Court, stated that the privilege applies to communications by a client \"to a lawyer representing another in a matter of common interest.\" See 2 J. Weinstein, Evidence 503-52 (1977). The Advisory Committee's Note to proposed Rule 503(b) makes it clear that the joint-interest privilege is not limited to situations in which the positions of the parties are compatible in all respects:\n\nThe third type of communication occurs in the \"joint defense\" or \"pooled information\" situation, where different lawyers represent clients who have Some interests in common. . . . The rule does not apply to situations where there is No common interest to be promoted by a joint consultation, and the parties meet on a purely adversary basis.\n\nQuoted in 2 J. Weinstein, Supra, at 503-6 to 503-7. (Emphasis supplied and citations omitted.) Although the Congress, in its revision of the Federal Rules of Evidence, deleted the detailed privilege rules and left the subject of privilege in federal question cases to \"be governed by the principles of common law as they may be interpreted by the courts of the United States,\" R. 501 Fed.R.Evid., the recommendations of the Advisory Committee, approved by the Supreme Court, are a useful guide to the federal courts in their development of a common law of evidence. 2 J. Weinstein, Supra, at 501-20.4 to 501-20.5. In this instance we follow the recommendation. The privilege protects pooling of information for any defense purpose common to the participating defendants. Cooperation between defendants in such circumstances is often not only in their own best interests but serves to expedite the trial or, as in the case at bar, the trial preparation.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nIngram also seems to argue that the communication was not privileged because it was made to an investigator rather than an attorney. The investigator was an agent for Ingram's attorney, however, so it is as if the communication was to the attorney himself. \"It has never been questioned that the privilege protects communications to the attorney's . . . agents . . . for rendering his services.\" 8 Wigmore, Evidence ยง 2301 at 583 (McNaughton rev. 1961); Cf. United States v. Kovel, 296 F.2d 918, 921-922 (2d Cir. 1961) (client's communications to an accountant employed by his attorney).\n\nNor was it, as Ingram contends, fatal to the privilege that McPartlin made the statement, in effect, to Ingram's attorney rather than his own. When the Ingram and McPartlin camps decided to join in an attempt to discredit Benton, the attorney for each represented both for purposes of that joint effort. The relationship was no different than it would have been if during the trial the Ingram and McPartlin attorneys had decided that Ingram's attorney would cross-examine Benton on behalf of both, and during cross-examination McPartlin passed Ingram's attorney a note containing information for use in the cross-examination. The attorney who thus undertakes to serve his client's co-defendant for a limited purpose becomes the co-defendant's attorney for that purpose. A claim of privilege was upheld in circumstances such as these where communications were made directly to the attorney for another party in In the Matter of Grand Jury Subpoena Duces Tecum, supra, 406 F. Supp. at 391. United States v. Friedman, 445 F.2d 1076, 1085 n.4 (9th Cir.), Cert. denied, 404 U.S. 958, 92 S. Ct. 326, 30 L. Ed. 2d 275 (1971), relied on by Ingram, is not to the contrary. In Friedman the court held its decision in Hunydee v. United States, supra, inapplicable, because no joint defense or common interest was alleged. The court went on to state, in the footnote relied upon, that even if Hunydee was applicable, there was no privilege since \"the facts of the conversation negate confidentiality.\" 445 F.2d at 1085 n.4.\n\nInasmuch as McPartlin was entitled to assert the privilege whether Ingram was tried jointly or separately, no prejudice would have resulted from the joint trial by reason of the exclusion of the McPartlin statements even if those statements had not been merely cumulative.\n\n2. Relevance of Threats Against Benton\n\nFrederick Ingram also argues that joinder caused specific prejudice through the trial court's exclusion, as prejudicial to other defendants, of evidence of threats of physical harm directed against Benton. The short answer is that prejudice to other defendants was not the only ground for the exclusion. The excluded evidence consisted of testimony by Ingram that in the fall of 1972 Benton expressed fear for his own physical well-being if Ingram refused to make the promised payments to the Chicago officials, and testimony by two other witnesses that Benton told them in October 1974 that someone had threatened him with physical harm. To begin with, both statements by Benton were said to have been made long after February 1972, when Ingram, by his own admission, authorized Benton to make payments to secure the contract. There is no indication in the record that the second, made long after all payments were made was ever communicated to Ingram. The alleged threats were directed at Benton, not Frederick Ingram, who had no dealings in the matter with anyone outside Ingram Corporation. Finally, Ingram's theory throughout the trial was economic, not physical, coercion.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e The evidence was properly excluded as irrelevant, and it would have been equally irrelevant if Ingram had been tried separately.\n\n3. Relevance of an Unrelated Payment by a Third-Party\n\nFrederick Ingram also contends that the joinder caused the exclusion of evidence that an attorney who represented Ingram Corporation before the Illinois Commerce Commission made a $5,000 contribution to McPartlin's reelection campaign fund, and that the payment was motivated in part by McPartlin's having recommended the attorney's firm to Ingram Corporation. There was no showing that the attorney was coerced. This evidence, offered first by the prosecution and then by the Ingrams, was rightly excluded on both occasions as irrelevant. In rejecting the Ingram offer the court said that it \"could be prejudicial to McPartlin without being probative of any issue as far as the Ingrams are concerned.\" Prejudice to McPartlin aside, the trial court was correct as to the probative value of the evidence.\n\nWe therefore conclude that the denial of the motions for severance was not error.\n\nSPRECHER, Circuit Judge:\n\nII.\n\nExtortion Defense Instruction\n\nAs noted earlier, defendant Ingram never denied making certain of the illicit personal payments to officials of the Sanitary District. Instead Ingram premised his defense to the counts relating to these payments on the theory that these payments were not intended as bribes but were extorted from him by threats that, unless these payments were made, the Sanitary District would, contrary to an alleged understanding, refuse to purchase the pipeline which Ingram had already constructed and would invoke the liquidated damages clause to further penalize Ingram Corporation.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e In relation to these arguments, the trial court gave the jury the following instructions on the defense of extortion:\n\nNow, I have just told you that willful conduct, which is required in each of the crimes charged in this indictment, must be voluntary.\n\nOne of the defenses raised by the Defendants Frederick B. Ingram and E. Bronson Ingram is that they authorized certain payments to be made only because they were told unless the payments were made, the pipeline would not be paid for and the liquidated damage provision would be used against Ingram Barge Company in an unreasonable and punitive manner. These defendants claim, therefore, that they did not commit bribery or conspire to commit bribery and lacked the intent to bribe.\n\nIn analyzing this defense, there are several things for you to consider. First, you should determine whether a defendant did in fact authorize payments because of a fear of economic loss. If you find that a defendant did authorize any of the payments in question, but that he did so solely to procure an economic advantage rather than out of fear of an economic loss, then this defense that the act was involuntary must fail.\n\nOn the other hand, if you do find that a defendant authorized payments because of his fear of economic loss, then you should proceed to a consideration of whether that fear of economic loss was such as to render his action involuntary within the meaning of the law.\n\nThere are several things to consider in this connection. First, did the defendant fear loss as a result of a withholding of something to which he believed Ingram Barge Company was already legally entitled? Specifically, did the defendant believe that the Metropolitan Sanitary District was already under a legal obligation to pay Ingram Barge for the pipeline? Did he believe that the threatened assessment of liquidated damages was legally unjustified?\n\nThe answers to these questions are important because there is a difference between paying a public official for something one is entitled to receive and paying a public official for something one is not entitled to receive.\n\nIf one does not believe he is legally entitled to receive the thing in question, then, no matter how much he needs it and no matter how great the economic loss one might suffer by not receiving it, there can be no legal justification for paying a public official to get it. Such a payment is bribery, pure and simple.\n\nHowever, if one is legally entitled to the thing in question or in good faith believes he is legally entitled to it, then the fear of economic harm from not receiving it may be sufficient to render the act of payment involuntary, depending upon three additional considerations: The seriousness of the economic harm perceived by the defendant, the effect that perception had on his ability to exercise free choice, and the defendant's awareness of reasonable alternatives to the making of the demanded payments.\n\nIf a defendant did not in fact fear serious economic harm or if his fear did not substantially impair his ability to exercise free choice or if he was aware of actions he might take to forestall the harm without making the payments and chose not to take those actions, then his conduct in authorizing the payment cannot be considered involuntary within the meaning of the law.\n\nIn order to prove, therefore, that a defendant acted willfully as opposed to involuntarily in authorizing a payment, the government must prove one of the following things: (a) that the defendant was not motivated by a fear of economic harm in authorizing the particular payment, or (b) the thing which the defendant sought to obtain by making the payment was not something he believed Ingram Barge Company was legally entitled to have without making the payment, or (c) the defendant did not perceive the threatened economic harm to be of serious magnitude, or (d) the defendant's fear was not such as to substantially impair his ability to exercise free choice, or (e) and finally, the defendant was aware of reasonable alternatives to making the payments and chose not to pursue those alternatives.\n\nDefendant Ingram urges that this instruction was prejudicial error in three respects. In considering these contentions we shall assume without deciding, that as the instruction states, under Illinois law, if one who pays a bribe is or believes himself to be \"legally entitled\" to have the official take the action induced by the bribe, \"then the fear of economic harm from not receiving it may be sufficient to render the act of payment involuntary.\" This court's decision in United States v. Peskin, 527 F.2d 71, 84 (7th Cir. 1975), Cert. denied, 429 U.S. 818, 97 S. Ct. 63, 50 L. Ed. 2d 79 (1976), in the following words, left open the question whether this is so but did establish the rule applicable in the case of a discretionary official decision:\n\n(A)t least in a case where a discretionary or legislative decision . . . has been requested, the withholding of such action until a money demand is met could not negate the intent (to influence the performance of an official act) required by the Illinois bribery statute.\n\nId. at 84.\n\nFirst, Ingram argues that the distinction between economic loss and gain was erroneous. The prejudice from this distinction allegedly arose from the fact that the jury was likely to define economic loss as the payment of money and economic gain as the receipt of money and therefore might have rejected the extortion defense out of hand on the ground that the admitted object of the payment was to complete the sludge-hauling project and thereby gain a profit. In response we note initially that Ingram here has too narrowly characterized his own defense. Ingram asserted throughout the trial and continues to assert before us that the payments were at least in part motivated by a desire to avoid assessment of liquidated damages. Even under the simplistic construction of the loss-gain distinction which Ingram alleges was most likely, this would constitute an economic \"loss\" thereby preventing the jury from rejecting the defense on the basis of the loss-gain distinction.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Moreover it is not clear that Ingram preserved this objection for appeal; the written objection to the instruction tendered at trial makes no mention of any error in this distinction.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Finally, we are not convinced that the jury would put such a simplistic construction on the loss-gain distinction. Certainly it requires no extraordinary economic acumen to realize that the receipt of money may not represent an economic gain if the amount received is less than an amount to which one was previously entitled. Conversely, an ordinary juror would certainly realize that a real economic gain accrues only when a person becomes entitled to something to which he had no prior entitlement, that is, when a discretionary official act is performed for his benefit. The district court followed this gain-loss instruction with a discussion of the concept of entitlement, explicitly denoting a \"loss\" as a failure to receive a benefit to which one was entitled, thereby further clarifying the interdependent relation between these two concepts.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nIngram advances a second attack on this instruction. He argues that the district court erred in instructing the jury that the extortion defense is unavailable if the defendant did not believe that he had a legal entitlement to the official action. Once again we must note that this objection appears not to have been properly preserved for appeal, since Ingram's objection to the trial court did not criticize the entitlement aspects of the instruction.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Even if this objection were properly preserved, it lacks merit. The district court's instruction is consistent with Peskin.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nIngram's final objection to the trial court instruction is that the instruction, by its emphasis on the voluntariness of the payments, implicitly disallowed the extortion defense and permitted only the narrower defense of duress. Assuming that the distinction drawn in United States v. Barash, 365 F.2d 395 (2d Cir. 1966), between the defenses of duress and extortion is correct,\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e the instruction could not have prejudiced Ingram since Ingram, before this court and the trial court, characterized his own conduct in such a way as to absolutely preclude the availability of the extortion defense, even assuming that the voluntariness of his conduct alone would not negate the extortion defense. Ingram, during the course of the trial, admitted that he had no legal entitlement to the benefits which his payments were designed to obtain.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Accordingly he is absolutely precluded from prevailing on an extortion defense under Peskin, which makes that defense unavailable where the defendant is seeking to obtain a benefit not owed and thus the emphasis of the instructions on involuntariness could not have harmed the defendant.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nIII.\n\nEvidence of Ingram's Bribes of Foreign Officials\n\nAt trial the government, seeking to rebut Ingram's testimony that he made the payments only as a victim of extortion, sought to demonstrate that in other instances Ingram had been willing to make such payments without the alleged incentive of extortion. The trial court carefully screened this proffer with an ex parte review of the evidence, an in camera meeting with all counsel, and a voir dire of the government witnesses. After this careful consideration, the court, although rejecting a substantial portion of the government's offer of proof,\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e permitted the government to introduce testimony that Ingram had made surreptitious payments to an employee of a semi-official Brazilian corporation in order to receive preferential treatment.\n\nThe government introduced at trial the testimony of Chris Daley, an official of the Ingram Corporation, to establish the government's account of Ingram's alleged prior bribe. Daley testified that in 1967 the Ingram Corporation became interested in engaging in an off-shore drilling project conducted by Petrobas, a Brazilian oil company owned jointly by the Brazilian government and private investors. Daley and Benton then met with Levindo Caniero, the Petrobas official with responsibility for procuring the contractor for the off-shore drilling. As a result of this meeting, Caniero agreed to provide inside information to Ingram Corporation to assure that it was low-bidder in exchange for a \"payoff or commission.\" Benton, Daley and Caniero agreed that these payments should be made into a Swiss bank account. The contract was then awarded to Ingram Corporation through a letter of intent. However, Caniero threatened to withdraw the letter of intent because of a delay in Ingram Corporation's establishment of a Swiss account for him. At this point Daley informed Ingram that the letter of intent was about to be lost because of the delay in making the payoffs. Ingram then put Daley in touch with an international banker at Lehmann Brothers to expedite the establishment of the account. Subsequently, between 1969 and 1973, $172,000 was paid into the account.\n\nWe hold that this evidence was properly admissible against Ingram in that it tended to refute Ingram's defense that he lacked the intent to bribe the Chicago defendants and made the payments only to satisfy extortionate demands. Rule 404(b) of the Federal Rules of Evidence permits proof of prior crimes or acts where it is used for such purposes \"as proof of motive, opportunity, intent, preparation, plan, knowledge, identity, or absence of mistake or accident.\" This provision has been interpreted as permitting admission of evidence of prior acts as long as it has a substantial relevance to an issue other than showing that the defendant has a criminal character and therefore possesses a propensity to commit criminal acts. See, e. g., United States v. Sigal, 572 F.2d 1320, 1323 (9th Cir. 1978). Or, as this court has held, such evidence is admissible \"if, entirely apart from the matter of \"propensity,' it has a tendency to make the existence of An element of the crime charged more probable than it would be without such evidence.\" United States v. Fairchild, 526 F.2d 185, 189 (7th Cir. 1975), Cert. denied, 425 U.S. 942, 96 S. Ct. 1682, 48 L. Ed. 2d 186 (1976) (emphasis added).\n\nIngram forwards three attacks on the admission of this evidence. First, he claims, the prior payments to Caniero were not sufficiently similar to the payments for which he was indicted to establish their relevance to his intent. Before examining the particular dissimilarities urged, we note that there is no requirement that the prior acts be virtually identical to the charged acts and that it is sufficient that the acts be similar enough and close enough in time to be relevant. The major thrust of Ingram's argument is that there is no showing that the Brazilian payments were either illegal or immoral since such payments are simply a way of doing business in Brazil. Initially we must note that we would be loathe to assume that surreptitious payments to governmental or private officials is a common and accepted practice in Brazil absent proof to that effect. Ingram admits that neither he nor the government offered proof on that matter, and thus this argument rests solely on Ingram's facile and unsupported characterizations of Brazilian practice. However, even were we to accept that such payments are a legal and accepted practice in Brazil,\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e we do not find that fact sufficient to differentiate the two transactions. In United States v. Baggett, 481 F.2d 114 (4th Cir.), Cert. denied, 414 U.S. 1116, 94 S. Ct. 850, 38 L. Ed. 2d 744 (1973), the government was permitted to introduce in a Travel Act bribery prosecution against a zoning official evidence showing a series of transactions wherein gifts were made to the official and favorable actions by him on behalf of the donor followed shortly thereafter. The defendant urged that since no showing of a Quid pro quo had been made by the government there was nothing to establish anything improper in these transactions. The court, however, admitted the evidence holding that regardless of the propriety of the individual's acts, the evidence demonstrated a course of conduct which indicated the defendant's \"preference for favors and gifts over his public duty.\" Id. at 115. Likewise here, whatever the moral and legal status of the Brazilian payoffs, they indicate that the defendant had knowingly circumvented ordinary business channels with \"facilitating payments.\" Admittedly the illegality of such payments to government officials in the United States would make such payments less likely than those not involving illegality; that, however, does not deny that one making such payments, legal or not, is more likely to have the intent to influence official action by similar payments in other instances than one who has never made such payments.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e The other differences urged by Ingram are even less substantial. The fact that the Brazilian official was an employee of a semi-public entity and that the indictment alleged payments to employees of a wholly public governmental entity is a completely negligible difference, unless of course one makes the irrational assumption that one who would knowingly cheat both the public and private investors would not knowingly cheat the public alone. Nor is it relevant that the Brazilian payoff was not initiated by Ingram: we can see no difference in active participation in making payments suggested by another and initiation of the suggestion itself, since one who is willing to perform the essential act of bribery that is, to dispense the bribe moneys themselves must be presumed to have also been willing to suggest the bribe. Finally, we reject Ingram's characterization of the Brazilian transaction as involving less harm that the Sanitary District bribes since the latter added the amount of the bribes onto the contract price. Nothing in this record suggests that the amounts charged to Brazil would not have decreased once the cost of the project was reduced by the amount of the bribes. Further, it is axiomatic that for a competitively-bid project, where no inside information was available, Ingram would have bid less and therefore charged less than where the project is guaranteed by virtue of a bribe and Ingram could set its own price. It is therefore completely disingenuous to suggest that the level of harm differed.\n\nIngram's second objection is that there was no clear and convincing proof that Ingram knew the purpose of the payments made to Caniero. We have held that there must be clear and convincing evidence of the prior act to justify its admissibility,\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e and we find that there is evidence in the record to meet that standard. Daley testified in camera as to Ingram's reaction when he learned of the payments and that Benton's delay in setting up the account might lead to a revocation of the letter of intent. Daley stated:\n\nBenton was to open it, which we wouldn't do. So that's when I called Fritz, and Fritz says, \"Jesus Christ. How did you get into that,\" or whatever. And he says, \"Okay, okay. We will go ahead and call him back and see what we can put together.\"\n\n(Tr. 5638). At trial, Daley testified as to Ingram's response to knowledge of the payments in the following terms: \"Mr. Ingram, in disgust, says \"Well, okay. I will see what I can do about it. . . .' \" (Tr. 5674). It is difficult to understand why Ingram would have responded \"in disgust\" or with queries as to how Daley became involved \"in that\" unless he knew that the payments were illicit payments made to procure unauthorized benefits or at least were improper in some respect. Furthermore, the government introduced a memorandum sent out by Daley to Ingram in which Daley stated that he knew after speaking with Petrobas personnel that Ingram would be the low bidder and that Caniero had assured Daley that \"we could count on him for any assistance we need.\" Considering all the evidence, particularly Ingram's reaction to Daley's statement and his knowledge that Ingram was assured to be the low bidder, there is a convincing portrait of Ingram's knowledge of the purpose of the Caniero payments.\n\nFinally, Ingram urges, relying on Rule 403 of the Federal Rules of Evidence, that the prejudicial impact of the evidence outweighed its relevance and therefore should have been excluded. Ingram must sustain a heavy burden to succeed on this argument since the careful balancing of the probative value of prior acts versus their possible unduly prejudicial effect is uniquely appropriate to the informed discretion of the trial judge. See United States v. Peskin, 527 F.2d 71, 84 (7th Cir. 1975), Cert. denied, 429 U.S. 818, 97 S. Ct. 63, 50 L. Ed. 2d 79 (1976); United States v. Sigal, 572 F.2d 1320, 1323 (9th Cir. 1978). More precisely, this balancing entails considering whether the probative value this evidence had in indicating that Ingram's intent was to bribe, not to satisfy extortionate demands, outweighs its possible prejudicial effect, that is, the possibility that the jury will take the evidence to be indicative of a criminal disposition.\n\nThe highly judgmental character of this test mandates that we not restrike the balance ourselves but instead examine only the manner in which the district court exercised its discretion. The record here shows that the trial court was meticulous and deliberate in its decision to admit the evidence. The trial court heard in camera evidence of a number of prior acts which the government had sought to introduce.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e After extensive discussion the court permitted proof only of the Petrobas transaction. Further, the court required the government to present its witness to the Petrobas transaction in camera to confirm the substance of the testimony. Finally, to minimize any prejudice the court preceded the presentation of this witness's testimony before the jury with an extensive limiting instruction emphasizing that Ingram was not \"on trial\" for this previous transaction, that the evidence was to be considered only as it concerned Ingram's intent in the Sanitary District transaction and that the court passed no judgment on the value of this evidence. Courts have often looked to these factors indicating due consideration to uphold the trial court's judgment. See, e. g., United States v. Carleo, 576 F.2d 846 (10th Cir. 1978). In particular the use of limiting instructions has been accorded great significance. See United States v. Sigal, 572 F.2d 1320, 1323 (9th Cir. 1978). We therefore decline to hold that the trial court abused its discretion.\n\nIV.\n\nGovernment's Compliance with Brady v. Maryland\n\nDuring his opening statement, counsel for the government revealed that the principal government witness, Benton, had embezzled and applied to his own benefit $375,000 of the money he obtained from Ingram in order to pay off the Chicago defendants. Although the government had turned over to the defendants both Benton's and Ingram Corporation's financial records, from which the government asserts the defalcations could have been discerned by the defendants, the government did not turn over to the defendants Benton's grand jury testimony in which he referred to the $375,000 as \"the amount of money I am responsible for keeping,\" nor did the government disclose that Benton had expressly admitted the embezzlements in interviews with government counsel. Defendants McPartlin and Janicki, relying on Brady v. Maryland, 373 U.S. 83, 83 S. Ct. 1194, 10 L. Ed. 2d 215 (1963), urge that this failure to disclose this information earlier violated their Due Process rights and mandates reversal of the convictions.\n\nWe note initially that Brady and its successor, United States v. Agurs, 427 U.S. 97, 96 S. Ct. 2392, 49 L. Ed. 2d 342 (1976), address a thoroughly different problem than the one before us. The concern of Agurs and Brady is whether the suppression of exculpatory material until after trial requires that a new trial be given so that this evidence may be considered. The Court in Agurs characterized the situations to which the Brady principles apply as those involving \"the discovery, After trial, of information which had been known to the prosecution but unknown to the defense.\" 427 U.S. at 103, 96 S. Ct. at 2397 (emphasis supplied). Indeed the standard developed in Agurs can only sensibly be applied to the suppression of evidence throughout the trial: \"if the Omitted evidence creates a reasonable doubt that did not otherwise exist, constitutional error has been committed. Id. at 112, 96 S. Ct. at 2402 (emphasis supplied).\n\nThe defendants here, however, do not complain of a total suppression of favorable evidence but merely attack the timing of the disclosure of such evidence. Here the prosecutor did not conceal or withhold evidence of Benton's defalcations but waited until early in the trial to reveal them.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e There is nothing in Brady or Agurs to require that such disclosures be made before trial, and we have explicitly held this in the past. United States v. Stone, 471 F.2d 170, 173-74 (7th Cir. 1972), Cert. denied, 411 U.S. 931, 93 S. Ct. 1898, 36 L. Ed. 2d 391 (1973). See also United States v. Lomprez, 472 F.2d 860 (7th Cir. 1972), Cert. denied, 411 U.S. 965, 93 S. Ct. 2144, 36 L. Ed. 2d 685 (1973). Thus, even though evidence might be material or might create a reasonable doubt as to guilt, Due Process, albeit requiring eventual disclosure, does not require that in all instances this disclosure must occur before trial.\n\nThe appropriate standard to be applied in a case such as this is whether the disclosure came so late as to prevent the defendant from receiving a fair trial. See United States v. Stone, 471 F.2d at 174. After considering the record and the claims of prejudice forwarded by the defendants, we cannot say that this disclosure came so late as to violate Due Process.\n\nThe defendants, apparently relying on their misinterpretation of Brady as a constitutional mandate for pretrial discovery, concentrated on the exculpatory nature of the evidence and barely developed before this court any specific ways in which they were prejudiced by this delay.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e McPartlin merely argues that, had the Benton embezzlements been revealed before trial, \"specific requests could have been directed toward more detailed information concerning these (embezzled) funds. . . . A thorough investigation into the disposition of those funds which he admittedly retained might have revealed that additional funds were similarly expended, deposited or hidden.\" Brief for Defendant McPartlin at 34-36. It is difficult for us to discern any undue prejudice on this basis. To begin with, there was nothing to preclude the defendants from having made additional investigations between the time of the disclosure and the close of the evidence almost two months later, and yet nothing in the record reveals that defendants directed any further inquiries to Benton. This omission is even more important given the statement of the trial court that it would reconsider the defendant's motion for a recess if it later became apparent that \"anyone has in fact been prejudiced by a late disclosure.\" Tr. at 250. Nor did the defendants subsequently renew their request for a continuance. Thus, given the failure of the defendants to pursue adequately any subsequent investigation and their subsequent failure to request additional time for any investigation thoroughly discredits their assertion that they were prejudiced by the timing of the disclosure.\n\nV.\n\nAdmission of Benton's Desk Calendars\n\nAt trial the government introduced as exhibits over the objections of the defendant, the desk calendar-appointment diaries of William J. Benton described above, Part I, B, 1. These diaries documented in some detail the dealings of Benton with the Chicago defendants. As a foundation for admission of the diaries, Benton testified that he had kept such business diaries since 1952 or 1953 and that he maintained these diaries during the period of his dealings with Metropolitan Sanitary District officials. Benton further testified that he kept these diaries and made entries in them as a regular part of his business activity as a vice-president of Ingram Corp., noting in them anticipated meetings, telephone calls, personnel matters and bids. These entries were characterized by Benton as \"things which I would need to look back on,\" to recall a bid or to prepare letters and memoranda, for example.\n\nIn admitting the diaries the trial court made the following findings:\n\nIt was the regular course of business for Mr. Benton to make entries in diaries about the things he did during the course of a business day, where he went, what people said to him, what commitments he made and what commitments were made to him in connection with that business. The entries that are contained in the diary, in the series of diaries, do pertain to Ingram's business.\n\nThe contents of the diaries further indicated their reliability to the district court:\n\nI find no indication of a motive to falsify. At the time these entries were made back in 1971 and 1972, there is not the slightest bit of evidence to suggest that Mr. Benton thought this scheme was going to be disclosed; that he thought that he would be caught. There is nothing self-serving about these entries. They implicate Mr. Benton in serious criminal misconduct. Indeed, if he were unavailable, I think these diaries might well be admissible as statements against penal interest, so incriminatory are they of Mr. Benton.\n\nSo I think they have the earmarks of reliability in that sense.\n\nWe agree with the district court that these diaries were admissible. These diaries clearly fulfilled all the requirements which justify the admission of business records under Federal Rule of Evidence 803(6). These records were kept as part of a business activity and the entries were made with regularity at or near the time of the described event. Most importantly these diaries satisfied the central rationale of the business records exception: since Benton had to rely on the entries made, there would be little reason for him to distort or falsify the entries.\n\nThe application of the business record exception to documents differing greatly from the classic \"shopbook\" or business ledger is well established. See, e. g., United States v. Reese, 568 F.2d 1246 (6th Cir. 1977) (scrapbook of press clippings compiled by public relations department); United States v. Yates, 553 F.2d 518 (6th Cir. 1977) (letter from bank to employees describing recent robbery); Magnus Petroleum Co. v. Skelly Oil Co., 446 F. Supp. 874 (E.D.Wis.1978) (corporate officer's personal notes of business negotiations); Aluminum Co. v. Sperry Products, Inc., 285 F.2d 911, 916 (6th Cir. 1960), Cert. denied, 368 U.S. 890, 82 S. Ct. 139, 7 L. Ed. 2d 87 (1961) (inventor's diary of progress on invention). Moreover, the business record exception has been applied to admit documents indistinguishable in kind from Benton's desk calendars. In United States v. Evans, 572 F.2d 455 (5th Cir. 1978), the court permitted the introduction of \"pocket-size appointment calendars known as \"daytimers.' \" Id. at 487. The court noted in support of its holding that these calendars were business records that \"(t)he entries purport on their face to list . . . business entertainment expenses . . . (and) such documents were used as a matter of company policy.\" Id. at 488. Likewise, the calendars here on their face describe business matters and, even if not mandated by Ingram policy, were kept in accord with the widespread practice of business executives to maintain such records.\n\nDefendants McPartlin and Weber have argued that several facts differentiate the records here from admissible business records. First, the defendants stress that some of the entries in the calendars were made out of sequence. The defendants' document expert testified that fifteen entries out of all those made over a two-year period were made out of sequence. We do not however agree with the defendants that nonsequential entries preclude admissibility as business records. Although there is no dispute that Benton's entries in a few cases did not proceed page by page in the book, the defendants' document examiner could not disprove Benton's statements that entries were made at or about the time of the described event.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e Indeed, it seems to us that insisting that entries proceed methodically from the first to last page is as pointless as insisting that ledger and account entries proceed in alphabetical order or from top to bottom. As long as the entries satisfy the contemporaneity and regularity requirements, their sequence is irrelevant. This point was made clear by the Tenth Circuit in United States v. Carranco, 551 F.2d 1197 (10th Cir. 1977). There the defendants attempted to block the admission of freight bills on the ground that some of the notations on the bills occurred after the document had been completed by the freight originator. The court rejected this argument noting:\n\nThe notations on the freight bill were explained by the witnesses, and this is probably more than is required by the business records exception to the hearsay rule. As pointed out by the appellee, a freight bill is not meant to be a static document nor is it used as such. As testified to by those familiar with the shipping business, a freight bill is used by many different people and it is their job to make notations on the freight bill so it will continue to be an accurate description of the shipment. It was adopted by ICX as its record, in the regular course of its business, when the ICX driver signed it as he picked up the interline shipment. He used it as an ICX record, verified the shipment, and made the notations on it. The notations as testified to by the witnesses were thus also made in the regular course of business of ICX. One of the freight bill copies went into the ICX terminal records, and one or more copies continued with the shipment. The requirements of Rule 803(6) of the Federal Rules of Evidence were met.\n\nId. at 1200. Similarly here there is no reason to require that an appointment calendar remain a \"static document\"; indeed as appointments and other matters change the calendar to be useful must be nonsequentially revised. The only requirement is that these revisions be contemporaneous and regular, and the defendant's proof of simple nonsequentiality does not rebut Benton's testimony that the entries were made regularly and contemporaneously. However, even if several of the entries were made non-contemporaneously, it remains within the district court's discretion to determine whether the few non-contemporaneous entries so undermine the reliability of the record as to preclude admissibility. Given that there were only fifteen non-sequential entries over a two year period, even if many of these were shown to be non-contemporaneous, we could not say that this discretion was abused.\n\nThe defendants also urge that these diaries could not be business records because they were relied on by no one other than Benton and in any event contained many entries of a purely private nature, Viz., the alleged extortion scheme engaged in by Benton which supposedly was not related to Ingram Corporation's official business. However, nothing in the text or comments to the Rule provides any indication that a necessary prerequisite to the reliability of a business record is verification by persons other than the one making the entry. Indeed, the Advisory Committee Notes appear to suggest otherwise:\n\nThe element of unusual reliability of business records is said variously to be supplied by systematic checking, by regularity and continuity which produce habits of precision, by actual experience of business in relying upon them, or by a duty to make an accurate record as part of a continuing job or occupation.\n\nCertainly the second and fourth, and possibly the first, indicia of reliability contemplate only the accuracy imposed by the record keeper on himself. Accordingly, admissibility has been upheld even in instances in which the records were made only for the benefit of the record keeper himself and not for the benefit of the entire business entity. See United States v. Prevatt, 526 F.2d 400, 403 (5th Cir. 1976); Aluminum Co. of America v. Sperry Products, Inc., 285 F.2d 911, 916 (6th Cir. 1960), Cert. denied, 368 U.S. 890, 82 S. Ct. 139, 7 L. Ed. 2d 87 (1961).\n\nNor do we consider it significant that the illegality of Benton's activities may have removed these actions in some technical sense from a narrow construction of his duties at Ingram. This argument proceeds on the false premise that because Benton's activities were not a part of Ingram Corporation's business, they could not be a business at all. United States v. Re, 336 F.2d 306 (2d Cir.), Cert. denied, 379 U.S. 904, 85 S. Ct. 188, 13 L. Ed. 2d 177 (1964), addressed, and rejected, such a contention. There the defendant after having gained control of a company, engaged in a fraudulent scheme for the distribution of that company's securities for his own personal benefit. The court was unpersuaded that records relating to that scheme, since they were not part of the company's business, could not constitute business records. The court pointed out that the defendant, \"while distributing a huge block of control stock to the investing public through a complex system of brokerage accounts and over-the-counter sales, was engaged in a \"business,' \" albeit a business of his own and not the company's. Id. at 313. The court further rejected the notion that business records would lose admissibility as such because of the illegality of the underlying business. We think that the same rationale applies here. Benton was engaged in systematically negotiating under-the-counter payments either for himself or the Chicago defendants in order to facilitate the award of business contracts. Although this is not a business of \"the usual orthodox nature\" (Id.), there is no question that this bribery scheme was as much a business as a fraudulent securities-marketing scheme.\n\nHowever, even if there were to be some question as to whether Benton's activities constituted an independent business, we believe that his activities can also be characterized as part of Ingram's business. As long as the recorded activities had become, properly or not, an integral part of Benton's business activities for Ingram, the records are not too personal to preclude admissibility under this exception. In this matter we are persuaded by United States v. Schiller, 187 F.2d 572 (2d Cir. 1951). There the defendant, a government employee in the Rent Control Program, maintained a diary which evidenced a bribe paid to him. The court, in refusing to consider a Fourth Amendment challenge to the admission of the diary premised on the personal, non-official nature of the papers, noted:\n\nWe think . . . there was a sufficient showing that the entries introduced in evidence dealt with official duties. Such matters as rent adjustments and recommendations regarding the same were within his general duties, Whether he performed them rightly or wrongly, at lunch or elsewhere. . . .\n\n187 F.2d at 575 (emphasis supplied). Certainly if such papers have sufficient business character to remove them from the personal paper protections of the Fourth Amendment, they have sufficient reliability to permit admissibility.\n\nDefendants finally rely heavily on Buckley v. Altheimer, 152 F.2d 502 (7th Cir. 1945) in support of their position. In Buckley, this circuit declined to permit, under the business record exception, the admission of a diary which contained entries documenting the amount of indebtedness between two parties, Frost and Altheimer. The court, in denying admission, noted that \"(t)he book did not contain any regular set of entries relating to any accounts between Frost and Altheimer.\" Id. at 507. It was argued that, although no claim was made that the entries in the diary occurred in the regular course of business and was \"informally kept,\" the diary should have been admitted because the entries were made \"precisely and meticulously.\" Id. The court rejected this argument, stating that \"private diaries as distinguished from account books or individual memoranda of particular transactions\" are inadmissible. Id. at 508. It is this latter statement upon which the defendants rely.\n\nWe believe however that the defendants' emphasis on the court's language concerning \"private diaries\" is misplaced. We do not believe that the court there intended to make any Per se rule precluding the admissibility of private diaries; instead it is clear that the decisive factor in that case was that no regular entries had been made documenting the relationship. The desk calendar before us is clearly a record of a different order: regular and frequent entries documenting the relation between Benton and Sanitary District officials were made systematically for the purpose of allowing Benton to rely on its accounts of the status of the relationship.\n\nWe note as a final matter that even if any of the defendant's arguments were sufficient grounds to prevent admission of these diaries under the business record exception, they would be admissible under two other exceptions. First, they would be admissible under the \"residual\" exception, Federal Rule of Evidence 803(24).\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e A number of factors combine to demonstrate the reliability of the entries: the highly self-incriminatory nature of the entries themselves, the regularity with which they were made, Benton's need to rely on the entries. Where evidence complies with the spirit, if not the latter, of several exceptions, admissibility is appropriate under the residual exception. See generally, United States v. Iaconetti, 406 F. Supp. 554 (E.D.N.Y.), Aff'd, 540 F.2d 574 (2d Cir. 1976), Cert. denied, 429 U.S. 1041, 97 S. Ct. 739, 50 L. Ed. 2d 752 (1977) (especially Judge Weinstein's opinion for the district court). Furthermore the degree of reliability necessary for admission is greatly reduced where, as here, the declarant is testifying and is available for cross-examination, thereby satisfying the central concern of the hearsay rule. Second, these calendars would also be admissible under Rule 801(d)(2)(E) as statements \"by a coconspirator of a party during the course and in furtherance of the conspiracy.\" Since these entries were made so that Benton could rely on them in carrying out his scheme, they aided and were \"in furtherance of\" the conspiracy. See United States v. Evans, 572 F.2d 455 (5th Cir. 1978).\n\nVI.\n\nWeber's Prior Consistent Statements\n\nThe government's evidence revealed that the first installment of the bribe money consisted of $75,000 given to McPartlin in Weber's presence. Some part of that amount consisted of thousand-dollar bills. The government further presented evidence to establish that three days after this cash payment, Weber deposited nine thousand-dollar bills in the bank account of one of the companies controlled by Weber. Weber, in an attempt to rebut the damaging inferences that could properly be drawn from such a cash deposit, testified that he obtained this money from a safe-deposit box maintained by himself and his mother. His mother testified that they indeed had such a joint safe-deposit box and that it did contain several thousand-dollar bills. As further corroboration, Weber sought to introduce the testimony of his accountant, as well as the accountant's copy of the bank statement recording the deposit. In an offer of proof Weber indicated that the accountant would testify that in 1973, two years after the deposit, Weber told him, in connection with his preparation of an IRS audit, that the funds were obtained from Weber's mother. The proffered bank statement contained the accountant's notation next to the sum: \"Overdraft covered and paid in cash from Mother (per FNW).\" The trial court refused the admission of the accountant's testimony and his copy of the bank statement. Defendants McPartlin\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e and Weber urge that this was error.\n\nTwo theories of admissibility are advanced. First, it is argued that the evidence was admissible under Federal Rule of Evidence 801(d)(1)(B) as a prior consistent statement.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e We do not believe, however, that these statements were admissible under this theory. Evidence offered under this theory must have some probative value in rebutting the implied charge of recent fabrication or improper motive. However, where a motive to falsify also existed at the time of the earlier statement, it possesses no such probative value. As Judge Weinstein correctly pointed out in his treatise on the Federal Rules:\n\nSubstantive use under Rule 801(d)(1)(B) is limited to situations where high probative value is most likely . . . . Evidence which merely shows that the witness said the same thing on other occasions when his motive was the same does not have much probative force \"for the simple reason that mere repetition does not imply veracity.\"\n\n4 J. Weinstein \u0026 M. Berger, Evidence P 801(d)(1)(B)(01) at 801-100 (1977). Obviously Weber would have had no more reason to tell the IRS that the proceeds were illegal bribes than he has a motive now to tell that to a jury in a criminal prosecution. Indeed, Weber would have even had a further reason not to tell the IRS that the $9,000 was part of a kickback: a bribe would be includable in Weber's gross income whereas an appropriation of jointly-held funds might not have been. Thus, we do not feel that these prior statements were admissible under 801(d)(1)(B).\n\nAs a second ground of admissibility, Weber and McPartlin urge that the bank statement was admissible as a business record under Federal Rule of Evidence 803(6). This argument creates a paradoxical tension with their arguments that Benton's desk calendars were not business records. The defendants assailed the diaries on the grounds that the entries were not made at or near the time of the event related (but recorded in advance as reminders of appointments) and that many of the entries were derived from \"second or third-hand information.\" Brief for Defendant Weber at 7. Yet the defendants urge that a single notation of a cash transaction made more than two years after the transaction and based solely on information supplied by someone other than the person making the entry constitutes a business record. We do not rely on these two grounds, however, to uphold the exclusion of the notation on the bank statement. Instead we find a more fundamental flaw in this evidence: this notation, unlike those in Benton's diaries, was not made for future reference and reliance but was made in anticipation of IRS litigation. The defendants appear to admit this fact, and the trial judge was informed of this. (Tr. 1363-69). As such prelitigation records, we hold that they lacked sufficient trustworthiness to permit admissibility. Indeed, this case is not significantly distinguishable from Hartzog v. United States, 217 F.2d 706 (4th Cir. 1954), which was cited by the Advisory Committee Notes to Rule 803(6) as an example of insufficient trustworthiness. In Hartzog the court held it was error to admit the worksheets of an IRS agent, deceased at the time of trial, that had been prepared from his examination of the defendant's records in preparation for a tax-evasion prosecution. The court explained the reasons for finding insufficient trustworthiness as follows:\n\nThese worksheets were made in preparation for this prosecution; they were Baynard's (the agent's) personal working papers, were the product of his judgment and discretion and not a product of any efficient clerical system. There was no opportunity for anyone . . . to tell when an error or misstatement had been made. These worksheets were not more than Baynard's unsworn, unchecked version of what he thought (the defendant) Hartzog's records contained.\n\nId. at 710. The records made by Weber's accountant are no more trustworthy than those prepared by the agent in Hartzog: they were prepared as a matter of his judgment and discretion; they were not produced as part of any regular system; there was no reliance on these notations by the accountant or others to guard against error or misstatement. If anything, the records in this case are less trustworthy since, unlike Hartzog where the agent examined records that the defendant had prepared for his own use, these notations were the product of Weber's own representations for the purposes of the audit, thereby furthering the possibility of misstatement. Accordingly, we hold that the trial court properly exercised its discretion to exclude these records.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\nPELL, Circuit Judge:\n\nVII.\n\nWeber's Political Acquaintances\n\nHenry Weber, brother of Franklin Weber, called as a Government witness, was permitted to testify on direct examination without objection that his brother Franklin was an acquaintance of Clyde Choate. He was then asked whether his brother was an acquaintance of Paul Powell to which he also responded in the affirmative. An objection was made, without any specificity, following the answer as to Powell. There was no motion to strike the answer and the \"objection\" as such was overruled. No effort was made at the time to demonstrate to the trial judge any particular basis for the objection.\n\nSubsequently during redirect examination Weber moved for a mistrial on the basis of the Powell matter because \"(i)t was highly prejudicial and has no relation whatsoever to this case.\" The court in denying the motion, properly from our examination of the record, observed that:\n\nthe reason I let that in is that you cross examined several witnesses about whether or not there was any reason to believe Mr. Weber had any political connections, whether it was credible to believe that he knew anybody, and there again, that is something you opened up.\n\nWithout specific reference to Powell, Weber again moved for a mistrial following final argument. He now says that which he didn't say to the court specifically that on the basis of Fed.R.Evid. 404(b) the testimony as to Powell was improper and prejudicial in the light of widely-circulated publicity of wrongdoing on the part of Powell when he was Secretary of State of Illinois. Certainly in any trial and particularly in a complex trial involving numerous defendants such as the present case, a lawyer should make clear to the trial judge the exact nature of the claimed prejudice, which was not done here. Even, however, if we assume what probably was a fact that the notoriety given to the Powell case some seven years earlier was such as to make it clear why Weber's attorney did not want his client linked with Powell, we agree here with the district court that the door had been opened. Weber, not the Government, portrayed political associations, which he sufficiently indicated he did not have, as a unique requirement for accomplishing that with which Weber is charged.\n\nFor the court to admit relevant evidence in rebuttal on the subject was well within its discretion. See United States v. Eliano, 522 F.2d 201 (2d Cir. 1975); United States v. Jones, 438 F.2d 461 (7th Cir. 1971). C. Wright and K. Graham, Federal Practice \u0026 Procedure ยง 5241. The purpose of Rule 404(b) is to prevent \"the use of alleged particular acts ranging over the entire period of the defendant's life (making) it impossible for him to be prepared to refute the charges, any or all of which may be mere fabrications.\" 2 J. Weinstein, Evidence P 405(04), at 405-39, Quoting Wigmore, Evidence ยง 194. The defendant focused the proof on this issue and cannot complain of surprise if evidence of his political associations was introduced.\n\nVIII.\n\nHenry Weber's Grand Jury Testimony\n\nFranklin Weber also objects to the admission of his brother Henry's grand jury testimony at trial. Henry Weber testified on direct examination that he went to Vaduz, Liechtenstein, to negotiate two letters of credit given to him by the defendant. During the course of the direct examination, the Government attempted to introduce Henry Weber's inconsistent grand jury testimony that he had never gone to Liechtenstein, testimony given two weeks after his return from that country at the first of his two appearances before the grand jury. The court would not admit the testimony on direct examination, however, on the basis that the trial jury might unfairly infer that the defendant had somehow been responsible for his brother's falsehoods. When cross-examined by the defendant, Henry explained that because he was by coincidence going to Europe, he negotiated the letters of credit as a favor to his brother. Henry also testified that the defendant had told him the letters \"covered sale commissions for oil or Arabian interest or something.\" The trial court then permitted the Government to introduce the grand jury testimony on redirect examination, and the defendant argues that the evidence still created the prejudical impression that Franklin Weber forced his brother to testify falsely.\n\nWeber's argument that the admission of this evidence was a prejudicial linking of the brothers Weber, however, shifts the focus from the basis on which the evidence was properly admitted. As the district court pointed out there need be no connection between Franklin Weber and the giving of the false testimony to the grand jury for that testimony to be admissible.\n\nThe trial court properly admitted the statement as nonhearsay, Fed.R.Evid. 801(c); See Anderson v. United States, 417 U.S. 211, 219-21, 94 S. Ct. 2253, 41 L. Ed. 2d 20 (1974), to rebut the theory of the defense raised by the defendant during cross-examination. During cross-examination, the defendant did not attempt to rebut the Government's showing on direct examination that Henry Weber negotiated the letters of credit. The defendant instead attempted to impose upon the transactions the appearance of innocence. Once the defendant, again opening a door, attempted to create this impression, the testimony became significant as rebuttal merely because it was given, and not for its truth.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e The grand jury testimony, viewed with other admissible evidence showing that it was false, tended to establish that Henry Weber was aware that he was involved in improper transactions. See id. at 220.\n\nIn his reply brief, Weber argues that the Government has resorted to mere rules of impeachment to justify the introduction of the grand jury testimony. It is true that as a secondary justification the Government, citing Fed.R.Evid. 607, argues that it could properly impeach its own witness, although Weber does not argue otherwise.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e Although the impeachment aspect is one which enters the present picture, this aspect appears neither to be the prime thrust of the Government's position nor the basis on which the trial court admitted the evidence. As the trial judge pointed out when the impeaching testimony was being discussed, the cross-examination by Franklin Weber was designed expressly to bring out that this was a routine transaction that the witness was conducting for his brother, nothing was wrong with it and there was no reason to suspect it. The judge then pointed out:\n\nYou didn't have to do that. I had earlier ruled that this (impeaching testimony) would not be admissible. Having opened it up, I think the Government is now entitled to show that two weeks after he returned from Liechtenstein and I hadn't realized that it was that soon that he appeared before the Grand Jury this witness said he had never been to Liechtenstein.\n\nWe agree with the district judge that the evidence was properly admissible through the open door.\n\nIX.\n\nDenial of Effective Assistance of Counsel\n\nA second aspect of the Swiss letters and Henry Weber's various connections therewith is the basis for a claim that Franklin Weber was denied effective assistance of counsel. The gist of the claim is that evidence pertaining to the Swiss letters in addition to that discussed in Part VIII of this opinion not only further linked Franklin Weber with his brother's first grand jury testimony but also constituted such a challenge to the integrity of Franklin Weber's trial lawyer as to deny the defendant effective assistance of counsel.\n\nSpecifically, the proof to which the objection is directed is the testimony, presented during the Government's rebuttal, of Assistant United States Attorney Michael O'Brien, who had conducted the preliminary grand jury investigation. The testimony described the following sequence of events: About a week after Henry Weber testified truthfully before the grand jury on December 3, 1975, his second appearance, that he carried the letters of credit to Liechtenstein, Franklin Weber's attorney had called Government counsel to report his client's possession of other letters of credit. During closing argument, the prosecutor suggested, \"Isn't it interesting that after Henry Weber has all this recollection, then everybody is calling up and telling the Government about it, after the cat is out of the bag.\" The defendant argues that this statement implied that defense counsel engaged in wrongdoing and therefore denied the defendant assistance of counsel. This argument is completely without merit. The cases cited by the defendant, United States v. Candelaria-Gonzalez, 547 F.2d 291 (5th Cir. 1977), and Zebouni v. United States, 226 F.2d 826 (5th Cir. 1955), concerned continuous derision of the defense attorney by the trial judge and are not in point. Furthermore, we have difficulty seeing how this testimony and final argument disparaged defense counsel. The Government's questioning and argument were obviously for the purpose of rebutting the defendant's exculpatory evidence that Franklin Weber had not learned of the grand jury investigation until \"very recently,\" and that he had been suspicious of the purpose behind the letters of credit, and that he therefore directed his attorney to notify the United States Attorney that he possessed more letters of credit.\n\nWe find no error in the admission of the rebuttal evidence. It was for the jury to draw such inferences as the evidence properly supported on the issues to be determined by the jury. The admission of this evidence properly bearing on what amounted to an assertion of a defense does not by any stretch of the imagination so impugn the defendant's attorney as to make his assistance ineffective to the prejudice of his client. We find no suggestion in the record that the attorney had the information with respect to the letters any sooner than he provided the information to the Government.\n\nX.\n\nJudge's Comment during Weber's Testimony\n\nFranklin Weber finally argues that a comment by the trial judge during his testimony constitutes reversible error. The defendant testified, \"I can swear that I did not see Mr. Benton give him anything . . . .\" The trial judge then said in the presence of the jury, \"that is what you are doing in everything you say. You understand that.\" Thereafter the matter was brought to the attention of the judge by way of a motion for a mistrial in which it was claimed that Weber's credibility was seriously depreciated in the eyes of the jury. The court immediately stated that the remark was not intended in any such way and offered to make that clear to the jury.\n\nThe judge did fully explain to the jury that in reflecting upon the matter he thought he should not have made the statement and that he in no way intended to reflect or comment on Weber's testimony or indicate any attitude whatsoever about the testimony. The judge also in final instructions made it clear that any comment by the court was not intended to invade the jury's province to decide the facts.\n\nWeber, while not challenging the completeness of the court's curative instruction, argues that it did nothing to heal an incurable situation, stating that \"A placebo cannot cure a terminal condition.\" In candor, we regard this hyperbolic characterization as a desperate bit of straw grabbing. In the first place we would have had difficulty even absent the curative instruction in reading this remark as any indication that the judge was expressing disbelief in the defendant's testimony. The judge, however, made it abundantly clear, if there had been any doubt, by his curative instruction that there was no reflection on the witness's credibility. In any event, this was an isolated incident in a long and complex trial. Weber testified for two full days during which the jury had ample opportunity to formulate its opinion of his credibility without regard to what was at most an oblique passing remark by the judge. Courts generally, and properly, decline to reverse in comparable situations. See, e. g., United States v. Cardall, 550 F.2d 604, 606 (10th Cir. 1976), Cert. denied, 434 U.S. 841, 98 S. Ct. 137, 54 L. Ed. 2d 105 (1978); Gordon v. United States, 438 F.2d 858, 862-63 (5th Cir.), Cert. denied, 404 U.S. 828, 92 S. Ct. 63, 30 L. Ed. 2d 56 (1971); United States v. Allen, 431 F.2d 712, 712-13 (9th Cir. 1970); United States v. Wilkins, 422 F. Supp. 1371 (E.D.Pa.1976), Aff'd sub nom. Appeal of Smith, 547 F.2d 1164 (3d Cir. 1976), 547 F.2d 1166 (3d Cir. 1976), 559 F.2d 1210 (3d Cir. 1977).\n\nAs the Supreme Court stated in United States v. Glasser, 315 U.S. 60, 83, 62 S. Ct. 457, 471, 86 L. Ed. 680 (1942):\n\n(An) examination of the record as a whole leads to the conclusion that the substantial rights of the petitioners were not affected. The trial was long and the incidents relied on by petitioners few. We must guard against the magnification on appeal of instances which were of little importance in their setting.\n\nXI.\n\nSufficiency of Evidence as to Edwin Bull\n\nThe defendant Edwin Bull argues that the evidence against him was insufficient to sustain a conviction for conspiracy because of an absence of evidence showing that he had knowledge of the illegal purposes of the conspiracy. He argues that the statements of co-conspirators connecting him to the conspiracy were improperly admitted against him, and that if these inadmissible statements had been excluded, his conviction could not stand.\n\nBull's theory of defense was that he was merely a \"friendly and accommodating\" businessman who earned a finder's fee and a subcontract by introducing the Ingrams to the contract opportunities available at the Sanitary District. Especially damaging to this defense, however, was testimony admitted at trial of conversations between Bull's alleged co-conspirators concerning Bull's role in the conspiracy. Benton testified, for example, that prior to receiving the contract, Ingram was having trouble generating sufficient cash to meet the demands of Sanitary District officials. When Weber learned of this problem, he instructed Benton to write a check for $25,000 (the amount then demanded) payable to \"Mr. Bull's company, Bull Towing Company, and that he and Mr. Bull would handle this check and convert it into cash and take care of the staff of the Sanitary District.\" Bull argues that without this statement the evidence merely shows that he deposited a check from Ingram for $25,000 in the No. 3 Bull Towing account and drew a countercheck for the same amount and received cash. Bull also declared this sum on his corporate and personal income tax returns and paid the necessary taxes. According to Bull's brief, \"(t)here is not a scintilla of evidence that any of these monies reached anyone else.\" We hold that the co-conspirators' statements connecting Bull to the conspiracy were admissible under Fed.R.Evid. 801(d)(2)(E) and that the evidence against Bull was adequate to sustain the conviction.\n\nRule 801(d)(2)(E) provides that statements of a co-conspirator made during the course of and in furtherance of a conspiracy are not hearsay. In United States v. Santiago, 582 F.2d 1128 (7th Cir. 1978), we held that the trial court alone should decide, as a question of competence under Rule 104(a), the preliminary question of whether the proponent has submitted sufficient proof that there was a conspiracy before admitting a co-conspirator's statement under Rule 801(d)(2) (E). For the statement to be admissible, we held that this preliminary showing must satisfy the preponderance of the evidence standard, and that the trial court's determination of admissibility is final as to admissibility.\n\nThe proceedings below, however, took place prior to our decision in Santiago, at a time when there were ambiguities in the law about who was to decide co-conspirator preliminary questions and by what standards. See generally, 1 J. Weinstein, Evidence P 104(05). In Santiago we noted that in this circuit the former standard for determining the admissibility of co-conspirators' statements committed the question to both judge and jury. The trial court would admit the statement if the proponent made a prima facie showing, on the basis of evidence other than the statement, that there had been a conspiracy. The jury, however, was instructed not to consider the statement against another defendant unless they found, beyond a reasonable doubt, that the evidence other than the statement showed that a conspiracy existed and that the other defendant was a member of the conspiracy. See also United States v. Rizzo, 418 F.2d 71 (7th Cir. 1969), Cert. denied, 397 U.S. 967, 90 S. Ct. 1006, 25 L. Ed. 2d 260 (1970); United States v. Santos, 385 F.2d 43 (7th Cir. 1967), Cert. denied, 390 U.S. 954, 88 S. Ct. 1048, 19 L. Ed. 2d 1148 (1968).\n\nThe trial court in this case proceeded substantially according to the prior standard, described in Santiago.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e Bull, however, relying on Santiago language, which, of course, was not available to the trial judge here, seizes upon a part of the court's instructions given during the course of the trial in connection with the admission of testimony of statements of alleged co-conspirators. It is true that the judge did say that the jury could consider such statements on the question of whether a conspiracy existed. Bull cites us to criticism in Santiago of \"the view that the existence of a conspiracy could be proved by the very hearsay statement for which admission is sought.\" 582 F.2d at 1133 n. 11. That was done here, he argues, and constituted \"bootstrapping\" proof which had been condemned by earlier cases.\n\nThis argument however, taking language of the instructions out of context, ignores the clear and explicit admonitions of the court during the course of the trial that as to any particular charged co-conspirator it was essential that he be proved a participant in the conspiracy by independent evidence before statements of others could be considered on the question of his liability.\n\nThus, on the first occasion during the trial that the subject was addressed, which was early in the trial, the judge instructed as follows:\n\nThere are two fundamental questions that you have to decide in regard to the conspiracy count of the indictment. The first of those questions is what is the conspiracy that is alleged by the indictment to have existed? Was there such a conspiracy? On that question you consider all of the evidence that I allow in and you make up your minds at the conclusion of the case as to whether a conspiracy, as alleged in the indictment, has been shown to exist as between somebody.\n\nThe second question is and it is eight separate questions here was this particular defendant shown to have been a member of that conspiracy. On that second question which you must answer in regard to each defendant, only those acts of that particular defendant should be considered to answer that question. You can't decide that Defendant B was a member of the conspiracy, if you find there has been a conspiracy, on the basis of something Defendant A said. It has to be on the basis of what you find Defendant B said and did.\n\nThose are the two questions, and let's just assume, generally speaking, that a jury in a hypothetical case finds Defendant B to have been a member of the conspiracy. All right, then and only then are the statements and actions of his alleged co-conspirators admissible against him. Provided they are acts and statements which the jury finds were committed in furtherance of the objectives of the conspiracy.\n\nSo, to recapitulate, question one, was there a conspiracy? Question two, was Defendant B a member of that conspiracy? Question three, as to any acts or statements of an alleged co-conspirator in considering whether you are going to consider that against Defendant B, was that act or statement committed in furtherance of the common conspiracy?\n\nOnly if you answer all three of those questions in the affirmative can you consider this act or statement of, say, Defendant A against Defendant B.\n\nOn analysis, all that the district court was really saying as to the establishment of a conspiracy was as follows: If there was testimony as to a conversation between B and C which reflected an agreement to violate the law, this testimony would be admissible as to B and C and would, if believed by the jury, tend to establish a conspiracy as to B and C. If during the course of the conversation either B or C had spoken of A's participation this would not have been proof of A's participation unless and until it had already been established by independent evidence, other than the statements of co-conspirators, that A was a participant.\n\nWhile the quoted portion of the instructions above was perhaps repetitive, and we note its substance as to the necessity for independent evidence as to any particular defendant becoming a conspiracy member was repeated thereafter, it is evident that the trial judge was attempting to make absolutely clear to the jury by repetitive emphasis that the statements of others could not be considered against a defendant for finding him to be a participant in a conspiracy unless his membership had been otherwise independently established. From the record we regard this attempt by the judge to have been successful.\n\nIn sum, we fail to see any prejudice to Bull. The instructions on conspiracy as in the case of all instructions must be considered in the whole complex of instructions, and it was made perfectly clear to the jury by those instructions that even though a conspiracy had been established by all of the evidence which the court had admitted, the jury could not find Bull guilty as a conspirator unless his membership in the conspiracy had been established by independent evidence other than the statements of co-conspirators.\n\nFurther, and in any event on the record in this case, we are firmly convinced that apart from any statements there was overwhelming independent evidence sufficient to show the existence of a conspiracy. If there had been any error in the instruction it would have been harmless. Fed.R.Evid. 103(a); Williams v. United States, 119 U.S.App.D.C. 190, 338 F.2d 530 (1964).\n\nBull disagrees that there was independent evidence linking him to the conspiracy and asserts that the co-conspirators' statements were therefore not admissible against him. As we have said the trial court instructed the jury that it must find beyond a reasonable doubt and on the basis of independent evidence that Bull was a member of the conspiracy before it could consider co-conspirator statements against Bull.\n\nIn reviewing the jury's determination of the sufficiency of the independent evidence linking Bull to the conspiracy, we do not weigh the evidence or determine the credibility of witnesses. We will affirm the jury's finding if there is substantial evidence, viewed in the light most favorable to the government, to support it, Glasser v. United States, 315 U.S. 60, 80, 62 S. Ct. 457, 86 L. Ed. 680 (1942); United States v. Buschman, 527 F.2d 1082, 1085 (7th Cir. 1976), and we therefore turn to an examination of that evidence.\n\nRobert Howson, an Ingram Contractors, Inc. Vice President, testified that Bull came to New Orleans in March 1971 and told him that for a southern contractor like Ingram to get the Sanitary District contract, a political contribution would be necessary. Benton testified that Bull brought Benton and Weber together for a meeting later that month, and that the day after this meeting, Bull told Benton that \"if (Benton) agreed with the discussion with Mr. Weber, he felt Ingram would get this contract, there would be no problem, and that he expected to receive $100,000 and Mr. Weber's group $200,000.\" There was evidence that Bull deposited a $25,000 check from Ingram, and withdrew the same amount in cash. Although Bull declared the amount on his taxes, there was also testimony that Bull insisted to Benton that his finder's fee from Ingram include reimbursement for the taxes he paid on the check drawn to his company. From this testimony, the jury certainly could infer that Bull did not keep the $25,000, and from Bull's insistence that Ingram be responsible for the taxes, the jury could infer that Bull's laundering of the check was a favor for Ingram, to whom Bull had earlier suggested the need for political contributions in exchange for a contract. The testimony also showed that Bull's involvement in the bribery scheme continued. When insisting on an increase in his subcontract rates, Bull was reminded by Benton in January 1975 \"that this contract extension was a similar situation with the original contract and that Ingram did not retain all of the increase that would be reflected between the various unit prices in the two agreements.\"\n\nWe have already found that the evidence that a conspiracy existed was overwhelming. In United States v. Robinson, 470 F.2d 121 (7th Cir. 1972), we noted that once the existence of a common scheme is established, very little may be required to show beyond a reasonable doubt that a particular defendant became a party. See also United States v. Harris, 542 F.2d 1283 (7th Cir. 1976), Cert. denied, 430 U.S. 934, 97 S. Ct. 1558, 51 L. Ed. 2d 779 (1977). From the evidence of Bull's independent acts and statements, the jury was entitled to find beyond a reasonable doubt that Bull was a member of this conspiracy, and the jury therefore was entitled to use the statements of other conspirators against him.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e The discriminating conclusions of guilt and innocence returned by the jury in this complex case demonstrate that the jury studied the evidence with great care. See United States v. Kaufman, 429 F.2d 240, 244 (2d Cir.), Cert. denied, 400 U.S. 925, 91 S. Ct. 185, 27 L. Ed. 2d 184 (1970). We decline to disturb their verdict, holding that the independent evidence of Bull's knowing participation in the conspiracy was sufficient to support the jury's use of the co-conspirators' statements against him, and that with such evidence there is no merit in his claim of insufficiency.\n\nXII.\n\nBull's Claim of Prosecutorial Misconduct\n\nEdwin Bull also argues that during its closing argument, the Government raised for the first time an unfounded inference that he bribed someone in the Illinois Commerce Commission to procure a Certificate of Public Necessity and Convenience for Ingram. Specifically, during closing arguments the Government attorney made the following statement:\n\nOn July 27, 1971, Frank Weber and Ed Bull went through another series of transactions to generate cash very similar to what they did in April, to generate the $25,000. This time the amount involved was $20,000.\n\nFrank Weber made out a Southwest Expressways' check for $20,000, payable to Bull Towing. Bull took it to the bank, deposited it into the Bull Towing Company account, and wrote a check in that amount made payable to himself and received $20,000 in cash.\n\nThis occurred on July 27, ladies and gentlemen, the day before Ingram received his Commerce Commission Certificate of Registration.\n\nDuring rebuttal argument, the Government added:\n\nWould you put up Government Exhibit 1-12(A).\n\nThat is a check from Southwest Expressways to No. 3 Bull Towing dated July 27, 1971, the same day as Government Exhibit 1-12(D) was issued. It is again a check to Ed Bull, and as the evidence indicates, Mr. Bull left the bank with $20,000. Benton had nothing to do with this transaction, but as you have seen from the notes that Mr. Weber wrote, there was apparently some sort of problem at the ICC, Illinois Commerce Commission.\n\nIt just so happens that the following day, Ingram is granted their Certificate of Convenience and Necessity by the Illinois Commerce Commission. Well, the bankers and those documents are not ghosts, and they begin to add up.\n\nBull argues that this suggestion constituted an unconstitutional amendment of the indictment and that it prejudiced unfairly the preparation of his defense. The defendant concedes that the evidence shows he converted a $20,000 check from Franklin Weber to cash on July 27, 1971, but argues that absolutely no evidence supports the implication in the Government argument that he bribed the Commerce Commission.\n\nAlthough the prosecution, of course, must never refer to matters with no basis in the evidence, United States v. Morris, 568 F.2d 396 (5th Cir. 1978); United States v. Meeker, 558 F.2d 387 (7th Cir. 1977), the prosecutor may in argument suggest reasonable inferences from the evidence already admitted. United States v. Jones, 157 U.S.App.D.C. 158, 482 F.2d 747 (1973). Because of the secret nature of the crime, conspiracy is especially subject to proof by circumstantial evidence. We decline to require the prosecutor to suggest to the jury only conclusions supported by direct evidence.\n\nDuring the trial there was evidence that the Certificate of Public Necessity and Convenience was granted to Ingram the day after Bull converted the check to cash. Government Exhibit 11-1, a memo made by Weber, also admitted in evidence, indicated that Weber had made payments to the Commerce Commission on behalf of Ingram. On direct examination, Weber testified that he gave Bull the $20,000 check as a payment for a dredge, and during cross-examination the Government confronted Weber with the connection between the memo, the laundered check, and the issuance of the Certificate. Bull did not object to this line of questioning.\n\nThese matters admitted in evidence were available to Bull in time to prepare his rebuttal. The conversion of the $20,000 check to cash was one of the overt acts charged in the conspiracy indictment. The documents connected with this line of proof were turned over to Bull's attorney ten months prior to the trial. Bull's argument that this closing statement unfairly prejudiced his defense must therefore fail.\n\nOur examination of the Government's argument and the evidence supporting it also leads us to conclude that the inference created was that Weber, not Bull, bribed the Commerce Commission. The Government therefore did not stray beyond the confines of the scheme alleged in the indictment, which describes Bull in paragraphs 21 and 27 as having been a knowing conduit for the bribery funds. Furthermore, paragraphs 21 and 27 of the indictment describe in broad language the objects of the bribery scheme as \"public officers and employees,\" so that proof of bribes to Illinois Commerce Commission officials was entirely within the scope of the scheme alleged. Bull's argument that any proof involving officials from agencies other than the Sanitary District amended the indictment is therefore without merit. See Stirone v. United States, 361 U.S. 212, 218-19, 80 S. Ct. 270, 4 L. Ed. 2d 252 (1960).\n\nXIII.\n\nClaimed Error of Instructions on Travel Act\n\nThe defendant Frederick Ingram challenges the portion of the court's instructions pertaining to the counts charging violations of 18 U.S.C. ยง 1952 (the \"Travel Act\") insofar as the jury was told that under the Travel Act a defendant need not know or reasonably foresee that the facilities of interstate commerce will be used or that someone will travel in interstate commerce in order to be guilty under the Travel Act. The authority in this circuit is that neither the language nor the purpose of the Travel Act compels this showing of knowledge on the part of each co-conspirator. United States v. Peskin, 527 F.2d 71 (7th Cir. 1975), Cert. denied, 429 U.S. 818, 97 S. Ct. 63, 50 L. Ed. 2d 79 (1976). See United States v. Feola, 420 U.S. 671, 95 S. Ct. 1255, 43 L. Ed. 2d 541 (1975). The defendant has offered no persuasive reason for a different rule. The use of interstate facilities merely provides the basis for federal jurisdiction. United States v. Peskin, 527 F.2d at 78; United States v. Bursten, 560 F.2d 779, 783-84 (7th Cir. 1977).\n\nWhat we have said herein no way indicates that there is not a necessity for interstate travel or the use of an interstate facility. The court did properly instruct the jury that the Government had to prove:\n\n(1) that someone traveled in interstate commerce, or used an interstate facility in furtherance of the bribery scheme; (2) that a person who caused the travel or use did so with intent to facilitate the bribery scheme; (3) that a member of the scheme thereafter performed or caused to be performed acts to promote the carrying on of the bribery scheme; and (4) that the particular defendant under consideration \"was a knowing and willful participant in the bribery scheme at the time of the interstate travel or use of the interstate facility and at the time the subsequent act or acts took place.\"\n\nThe fact that Frederick Ingram did not travel interstate or use interstate facilities or that he may not have known that others in the bribery scheme would do so is immaterial.\n\nThe judgments accordingly are affirmed.\n\nAFFIRMED.\n\n\u003cspan class=\"fn\"\u003e1. We use the spelling of Ingram's first name that appears in the indictment (Frederick) rather than the spelling that appears in his brief (Frederic).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The indictment also charged appellants McPartlin, Weber, and Janicki with filing false income tax returns in violation of 26 U.S.C. ยง 7206(1). The tax counts against McPartlin and Weber were dismissed before trial. Janicki was convicted of tax violations, but raises no issue on appeal with respect thereto.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. In 1975 the name was changed to \"Board of Commissioners.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Since Benton did not meet Janicki until a month later, the caller was probably Weber.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Benton testified that Bull had informed him that he needed money to pay income taxes on the money that he had laundered through Bull Towing Company. Part of the $76,000 was for this purpose, but the government concedes that part of the $76,000 finder's fee was legitimate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Benton testified that he informed Frederick Ingram of Weber's first proposal that Ingram Corporation make a political contribution immediately after Weber made it in March, 1971, and that Ingram authorized the payments then.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. It is not clear whether the $95,000 due in September on the first agreement was ever paid. Nor is it clear why Benton paid Janicki and Weber $775,000 on January 26, 1973, rather than the $750,000 agreed to.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. It is not clear how Weber expected his brother to cash the sixth letter of credit in November, 1975; it did not mature until December, 1975. Nevertheless, it is undisputed that Henry Weber did go to Vaduz, Liechtenstein carrying the two letters of credit with the intent to negotiate them.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Benton admitted siphoning off for his own use some of the funds that the Ingrams intended be paid to the Illinois defendants. See Part IV, Infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In Brady, which is famous for a holding irrelevant here (Viz., that the prosecution's suppression of evidence requested by the defense and material to punishment violated the due process clause of the Fourteenth Amendment), the Court also held that no federal right was violated by limiting a new trial to the issue of punishment where the suppressed evidence was inadmissible as to guilt, even though there might have been some spillover favorable to the defendant on the issue of guilt. At the first trial, in which a jury had convicted Brady of first degree murder and fixed penalty as death, the prosecution had failed to disclose a confession in which petitioner's accomplice admitted having actually strangled the victim. Concerning the petitioner's right to a new trial on both guilt and punishment, the Court said: A sporting theory of justice might assume that if the suppressed confession had been used at the first trial, the judge's ruling that it was not admissible on the issue of innocence or guilt might have been flouted by the jury . . . . But we cannot raise that trial strategy to the dignity of a constitutional right and say that the deprival of this defendant of that sporting chance through the use of a bifurcated trial . . . denies him due process or violates the Equal Protection Clause of the Fourteenth Amendment. 373 U.S. at 90-91, 83 S. Ct. at 1198 (footnote omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Although the Commentary to ยง 2.3(b) of the ABA Minimum Standards for Criminal Justice: Standards Relating to Joinder and Severance (Approved Draft 1968), contains a sentence which, standing alone, indicates that \"defenses . . . antagonistic to each other\" constitute a sufficient basis for granting a severance, the Commentary elsewhere states that this is only one of several factors to be considered and makes it clear that the appropriateness of severance depends upon the degree and kind of antagonism. See also the federal cases cited in the ALR Annotation referred to in the Commentary, 70 A.L.R. at 1184-1185; and see Annot., 82 A.L.R.3d 245, 250-251, 257-259 (1978). As the cases cited in the text of this opinion illustrate, the federal courts have held that an attempt by one defendant to place the guilt upon another does not require severance. See also 82 A.L.R.3d at 260-261.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. McPartlin's attorney advised McPartlin to meet with the investigator because it was in the interest of all the defendants to \"poke holes\" in the Benton diaries.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. In the alternative, the court ruled that McPartlin's statements were inadmissible hearsay not within the exception provided by Rule 804(b)(3), Fed.R.Evid. (declarations against penal interest). Since we agree that McPartlin's statements are protected by his attorney-client privilege, and in any event their exclusion was not prejudicial, we do not reach the alternative ground for exclusion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The trial judge remarked at one point that the evidence \"would be of great assistance to Ingram\" if admissible. With respect, we see no basis for that conclusion and believe that, if the judge had been given the opportunity we have had to lay the facts proved in other ways beside the proffered evidence and carefully compare the two, he would have reached the same conclusion we do.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. In Hunydee v. United States, supra, the attorney for Hunydee's co-defendant believed that the government would not prosecute the co-defendant if Hunydee pleaded guilty, and therefore their interests conflicted. Nevertheless, the Ninth Circuit held that statements made by Hunydee during a joint conference held for the purpose of discussing his willingness to plead guilty, a matter of common interest, which affected both attorneys' subsequent representation of their respective clients, were privileged. Similarly, in Schmitt, supra, the common interest of the co-defendants related to the exclusion of a specific item of evidence. See, Note, Supra, 63 Yale L.J. at 1035-1036.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Smale v. United States, 3 F.2d 101, 102 (7th Cir. 1924), relied on by Ingram, in which one defendant volunteered statements to another defendant and the latter's attorney and the requisite joint interest and confidentiality were both lacking, does not establish the compatible defense requirement for which Ingram argues.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. In United States v. McClure, 546 F.2d 670 (5th Cir. 1977), relied upon by Ingram, the court held it to have been reversible error to exclude as irrelevant \"evidence of a systematic campaign of threats and intimidation\" by an informer against persons other than the defendant, offered to corroborate the defendant's testimony that he had been threatened and coerced by the informer to commit the crime charged. The case is not authority for the proposition that evidence of threats of physical violence, made by some unnamed person, directed at a person other than the defendant, is relevant in a case in which the defendant does not contend that his criminal activity was motivated by threats of physical violence or that he even had knowledge of such threats at the time of his criminal activity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. It is to be noted that this defense is inapplicable to the counts under which Ingram was found guilty of participation in payments made prior to February, 1972. (Counts 3, 4, and 6.) As to these counts Ingram contended he did not know of the payments. The conspiracy count (Count 1) involved payments made before and after that date, but the verdicts on the three substantive counts tell us that the jury disbelieved Ingram's denial of knowledge of the earlier payments, so the extortion defense would not suffice under the conspiracy count.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Indeed Ingram seems to have admitted as much. In his brief defendant Ingram states: \"Alternatively, the jury might confusingly (Sic ) have reasoned that threatened liability under the liquidated damages clause was an \"economic loss'. . . .\" Brief for Defendant Ingram at 37.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Ingram made the following written objection to the instruction: Court's Instruction No. 2: The Ingram defendants have tendered several alternative charges dealing with the subject matter as Court's Instruction No. 2, each of which we submit correctly states the law with respect to the effect of economic coercion on the defendant's alleged intent to bribe. In support of the tendered charges, we referred to our memorandum on the \"extortion defense\" submitted to the Court in July 1977, which we incorporate by reference here. The instruction given by the Court treats the issue not as one of economic coercion bearing on intent, but as one of duress, contrary to the analysis in United States v. Barash, 365 F.2d 395 (2d Cir. 1966), and contrary to the pattern instruction in Devitt \u0026 Blackmar ยง 34.10. Accordingly, we object to the Court's charge in this respect and we object to the omission of any of the proposed instructions on this issue tendered by the Ingram defendants, or some modified version of those proposed instructions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Ingram attempts to bolster this argument by urging that decisions under the Hobbs Act have rejected any distinction between threats of economic loss and gain in extortion prosecutions. See, e. g., United States v. Hathaway, 534 F.2d 386 (1st Cir.), Cert. denied, 429 U.S. 819, 97 S. Ct. 64, 50 L. Ed. 2d 79 (1976). We do not see the relevance of such authority, however, since there is no reason that conduct giving rise to criminal liability for extortion should necessarily provide a criminal defense for the reciprocal party. Indeed it does not seem illogical to suggest that it may be reasonable to prosecute both the official who conditions discretionary benefits on bribes and the person who seeks to obtain such benefits. See United States v. Hall, 536 F.2d 313, 321 (10th Cir. 1976), Cert. denied, 429 U.S. 919, 97 S. Ct. 313, 50 L. Ed. 2d 285 (1977) (\"bribery and extortion are not to be considered mutually exclusive nor does the fact that the alleged victims of the extortion were also bribers nullify anything.\"); United States v. Gill, 490 F.2d 233 (7th Cir. 1973), Cert. denied, 417 U.S. 968, 94 S. Ct. 3171, 41 L. Ed. 2d 1139 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. See note 20 Supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. United States v. Peskin, 527 F.2d 71, 84 (7th Cir. 1975), Cert. denied, 429 U.S. 818, 97 S. Ct. 63, 50 L. Ed. 2d 79 (1976). See p. 25 Supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. As the court in Barash noted: Although the instruction that only a threat of death or serious bodily injury would make out the defense of duress appears correct enough . . . that was only part of the story since Barash had also requested instructions as to the bearing of threats of economic harm on the intent required for conviction. . . . We think that if a government officer threatens serious economic loss unless paid for giving a citizen his due, the latter is entitled to have the jury consider this, not as a complete defense like duress but as bearing on the specific intent required for the commission of bribery. 365 F.2d at 401-02.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The defendant clearly makes these admissions in his brief when he argues that the entitlement distinction was erroneous: This second element (of the instructions, that the extortion defense was not available if the defendant was seeking a benefit to which he was not entitled,) was tantamount to a judicial instruction to reject the extortion defense in light of the record that had already been made. Bronson Ingram had testified (as quoted at pp. 16-17, Supra ) that on February 21, 1972, during the meeting between the Ingram brothers and Benton, Benton had said, \"(W)e don't really have a legal position to get the rest of our money\" (Tr. 4075). Indeed, it was precisely because there was no legal recourse that, according to both Ingrams, they saw no option other than to capitulate to the demands. . . . . On any fair reading of the record, Mr. Ingram was in the position of ordinary applicants for zoning variances or for discretionary governmental action. He honestly and with substantial basis believed that it was right and proper for the MSD to exercise its discretion to purchase the pipeline and to refrain from punitive use of the liquidated damages clause. Whether he also believed that Ingram Corporation had a legal right under the existing contracts to obtain this result was completely irrelevant to the question of his intent to commit bribery. Brief for Defendant Ingram at 39-41 (emphasis supplied). Ingram's admission that he was in the same position as \"ordinary applicants for zoning variances\" is particularly damaging in that it was in precisely that context in Peskin that we explicitly held the extortion defense to be unavailable as a matter of law. 527 F.2d at 84. See also the cited quotation on p. 25 Supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Ingram also objects to the trial court's refusal to give a \"theory of defense\" instruction describing Ingram's view of the extortion. This is a somewhat surprising argument since the trial court's instruction gave more factual information as to the defendant's theory, albeit more concisely, than the defendant's proposed instructions. Ingram's factual theory of his defense is detailed in the following excerpts from the defendant's proposed instructions: If, on the other hand, the Ingram defendants had formed no purpose of offering any money or thing of value to any personnel of the Metropolitan Sanitary District, and acted only because of demands or threats communicated by Benton, and believed that the Metropolitan Sanitary District intended to carry out the threats not to pay for the pipeline and destroy the company on the barging operations unless their demands were satisfied, or if you have a reasonable doubt on this issue, then the essential element of intent is not present and you will find the defendants Frederic B. Ingram and E. Bronson Ingram not guilty of all charges. It is the position of the defendants Frederic B. Ingram and E. Bronson Ingram that they had no purpose of improperly offering or promising any money or thing of value to any official of the Metropolitan Sanitary District in connection with the sludge contract, and that they did not devise or intend to devise a scheme or artifice to defraud either the Metropolitan Sanitary District, its citizens, its officers and employees, or the Burlington Northern Railroad and other competitors. Indeed, it is the position of the defendants Frederic B. Ingram and E. Bronson Ingram that they acted only because of demands or threats communicated to them by William J. Benton and because they believed that those threats would be carried out unless the demands were satisfied. If you find that the defendants Frederic B. Ingram and E. Bronson Ingram did not act voluntarily, or had formed no purpose of offering any money or thing of value to the employees or officers of the Metropolitan Sanitary District, and acted only because of demands or threats communicated by William J. Benton, and that they believed that those threats would be carried out unless the demands for payment were satisfied, then the essential element of intent is not present and you must find the defendants Frederic B. Ingram and E. Bronson Ingram not guilty of the charges against them. In contrast to these generalized and repetitive instructions, the trial court instructions, set out on pages 23-25 Supra, concisely explained the defendant's theory that the alleged extortion scheme revolved around threats not to purchase the pipeline, as well as setting out defendant's additional factual theory that the scheme involved threats to assess liquidated damages in an unreasonable manner. Thus, the defendant Ingram's claim that the trial court erred in rejecting a \"theory of defense\" instruction is without merit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. The government offered to prove that Ingram had personal control of a cash box containing unreported funds from scrap sales which were distributed to Louisiana politicians. Additionally the government offered to prove that a joint-venture in which Ingram Corp. was a participant had paid a real-estate commission to a Louisiana state representative who gave part of that payment to another state representative and kicked back another part of it to Frederick Ingram personally. The government also offered to prove that Ingram Corp. made kickback payments to an Amoco employee who was potentially able to provide inside information and influence the level of payments by Amoco to Ingram. Finally, the government said it could prove that Ingram Corp. had made an interest-free, uncollateralized loan to an Indonesian military officer who was able to influence contracts for Ingram in Indonesia.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Ingram's assertion that such a practice is \"moral\" in Brazil tempts us to examine the philosophical underpinnings of an ethical system that varies with geographical or cultural boundaries. Even if morality varies with one's own culture, can it be said that an individual from a cultural and moral tradition that condemns a practice can morally engage in that practice once he simply steps \"across the river\" into a culture with different norms? See B. Pascal, Pensees 151 (\"Plaisante justice qu'une riviere borne! Verite au de ca des Pyrenees; erreur au dela.\" \"Curious justice that a river bounds! Truth on one side of the Pyrenees; error on the other.\")\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. See also United States v. Peskin, 527 F.2d 71, 84 (7th Cir. 1975), Cert. denied, 429 U.S. 818, 97 S. Ct. 63, 50 L. Ed. 2d 79 (1978) (upholding admission of evidence of subsequent bribes to public officials).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. United States v. Feinberg, 535 F.2d 1004, 1009 (7th Cir.), Cert. denied, 429 U.S. 929, 97 S. Ct. 337, 50 L. Ed. 2d 300 (1976). Compare the majority opinion in United States v. Beechum, 582 F.2d 898, 910, 912-913, (5th Cir. 1978) (en banc) with the dissent in that case, Id. 918, 922-923 (Goldberg, Godbold, Simpson, Morgan, and Roney, JJ., dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. See note 27 Supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Defendant Janicki also apparently claims that the government did not ultimately turn over all exculpatory material relating to specific instances of embezzlement: \"the Government may have secured information about particular instances of embezzlement about which the defendant was unaware. . . .\" Brief of Defendant Janicki at 32. However, a denial of Due Process cannot be premised on the defendant's mere conjecture that there might have been favorable evidence which was undisclosed. The existence of the evidence must be established, and here the defendants offered nothing to rebut the government's assertion that it had turned over to the defendants all its information on the embezzlement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. At trial the defendants made only generalized claims of prejudice without advancing any specific theories upon which a finding of prejudice might be based. Tr. at 230-31 (Janicki), 249-50 (McPartlin). Such specific theories were advanced for the first time in the briefs submitted to this court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. The defendants have also attacked the contemporaneity of the entries, arguing that the records were inadmissible because entries were made relating to appointments before the appointment took place. This is an overly narrow construction of \"at or near the time.\" Even though such entries were not made \"at or near the time\" of the meeting they were \"at or near the time\" the appointment was made. This seems to be sufficient contemporaneity to constitute a business record documenting the making of appointments.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Rule 803(24) provides: (24) Other exceptions. A statement not specifically covered by any of the foregoing exceptions but having equivalent circumstantial guarantees of trustworthiness, if the court determines that (A) the statement is offered as evidence of a material fact; (B) the statement is more probative on the point for which it is offered than any other evidence which the proponent can procure through reasonable efforts; and (C) the general purpose of these rules and the interests of justice will best be served by admission of the statement into evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. McPartlin argues that evidence denying Weber's participation in the first bribe installment would have inured to his benefit since the original installment was alleged to have been delivered to McPartlin in Weber's presence. Thus, presumably, any cash deposited by Weber, if not from innocuous sources, would have been obtained from McPartlin. We do not think, however, that any benefit from such evidence would have been sufficient to have made its exclusion a denial of a fair trial to McPartlin. The fact that Weber may not have received a cash rake-off from this first installment in no way detracts from the credibility of testimony that McPartlin received the money; at most such evidence would have only contributed to a demonstration of McPartlin's penuriousness.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Rule 801(d)(1)(B) provides that (d) A statement is not hearsay if . . . (B) consistent with his testimony and is offered to rebut an express or implied charge against him of recent fabrication or improper influence or motive . . ..\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Further support can also be found in this circuit's decision in United States v. Ware, 247 F.2d 698 (7th Cir. 1957), also cited by the Advisory Committee as a proper application of the untrustworthiness principle. In Ware this circuit held that records of drug purchases made by a drug agent were inadmissible in subsequent prosecutions, noting that \"such utility as . . . (these records) possess relates Primarily to prosecution of suspected law breakers and only Incidentally to the systematic conduct of the police business.\" Id. at 700 (emphasis supplied). Likewise, the notations here must be seen as relating primarily to the avoidance of additional tax liability or prosecution as a result of an audit and only incidentally to the conduct of Weber's business.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. The Government's theory of the case was that Henry Weber did go to Liechtenstein to negotiate the letters of credit. Henry's negotiation of the letters of credit in Liechtenstein formed the basis of Count 32 of the indictment. Because the Government was not trying to prove the truth of the out-of-court statement, the defendant was not prejudiced by lack of cross-examination at the time of the grand jury testimony. Anderson v. United States, 417 U.S. at 220-21, 94 S. Ct. 2253, 41 L. Ed. 2d 20 .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. The Government also points out that pursuant to Rule 613(b), the witness was permitted on recross-examination to explain the impeaching grand jury testimony by stating that he had been unfamiliar with the geography of Liechtenstein and because of that he had not understood the question at the time of his first grand jury appearance.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Although the record is not clear, we assume arguendo that the trial court, in letting in the statements, applied the lesser prima facie standard then used for determining the existence of a conspiracy for purposes of admission, rather than the stricter preponderance test prescribed in Santiago.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Although our decision in Santiago commits this admissibility question to the court in the future, we nevertheless apply the then current standards to evaluate the procedures at trial. The defendant has not challenged the submission of the admissibility issue to the jury. Furthermore, we fail to see how this \"added layer of fact-finding,\" although unnecessary, could prejudice the defendant. United States v. Santiago, 582 F.2d 1128, 1136 (7th Cir. 1978); United States v. Petrozziello, 548 F.2d 20, 23 (1st Cir. 1977). As we observed in Santiago, there is some danger of confusing the jury with the instruction because the judge essentially is telling the jury not to consider the evidence unless it has already found the defendant guilty. See Carbo v. United States, 377 U.S. 953, 314 F.2d 718, 736, 84 S. Ct. 1625, 12 L. Ed. 2d 498 (9th Cir. 1963), Cert. denied, 377 U.S. 953, 84 S. Ct. 1626, 12 L. Ed. 2d 498 (1964). We do not regard the instruction as prejudicial, however, because it at least cautioned the jury against the dangers of using this evidence for improper purposes. 1 J. Weinstein, Evidence P 104(05), at 104-45.\u003c/span\u003e\n\n",
    "body_length": 143858,
    "citedas": [
      "595 F.2d 1321"
    ],
    "attorneys": "Edward J. Calihan, Jr., William J. Harte, Chicago, Ill., Herbert J. Miller, Jr., Washington, D.C., Joseph A. Lamendella, Harvey M. Silets, John J. Jiganti, Chicago, Ill., for defendants-appellants. Gordon B. Nash, Joan B. Safford, Candace J. Fabri, Asst. U. S. Attys., Chicago, Ill., for plaintiff-appellee.",
    "category": [
      "75"
    ],
    "judges": "Before Pell, Sprecher and Tone, Circuit Judges.",
    "citation_count": 197
  }
}
