{
  "id": "c4H2PWYBTlTomsSBwn54",
  "document": {
    "title": "In re City of Philadelphia Litigation",
    "full_title": "IN RE: CITY OF PHILADELPHIA LITIGATION; RAMONA AFRICA v. CITY OF PHILADELPHIA; WILLIE GOODE; LEO A. BROOKS; GREGORE SAMBOR; WILLIAM C. RICHMOND; FRANK POWELL, LT.; WILLIAM KLEIN, OFFICER; MICHAEL TURSI, OFFICER; ALBERT REVEL, SGT.; EDWARD CONNOR, SGT.; MORRIS DEMSKO, CORPORAL; RICHARD REED, STATE TROOPER, INDIVIDUALLY AND IN THEIR PRESENT AND/OR FORMER OFFICIAL CAPACITIES, LEO A. BROOKS IN NO. 94-1277, RAMONA AFRICA IN NO. 94-1322, CITY OF PHILADELPHIA IN NOS. 94-1280 AND 94-1377, WILLIAM C. RICHMOND IN NO. 94-1279, GREGORE SAMBOR IN NO. 94-1278; IN RE: CITY OF PHILADELPHIA LITIGATION; ALFONSO LEAPHART, ADMINISTRATOR OF THE ESTATE OF VINCENT LOPEZ LEAPHART, A/K/A JOHN AFRICA V. CITY OF PHILADELPHIA; W. WILSON GOODE, MAYOR, CITY OF PHILADELPHIA; LEO A. BROOKS, FORMER MANAGING DIRECTOR, CITY OF PHILADELPHIA; GREGORE J. SAMBOR, FORMER POLICE COMMISSIONER, CITY OF PHILADELPHIA; WILLIAM C. RICHMOND, FIRE COMMISSIONER, CITY OF PHILADELPHIA; FRANK POWELL; WILLIAM KLEIN; MICHAEL TURSI; ALBERT REVEL; COMMONWEALTH OF PENNSYLVANIA; RICHARD THORNBURGH, FORMER GOVERNOR, COMMONWEALTH OF PENNSYLVANIA; JAY COCHRAN, COMMISSIONER OF STATE POLICE, COMMONWEALTH OF PENNSYLVANIA; RICHARD REED; MORRIS DEMSKO; E.I. DUPONT DE NEMOURS AND COMPANY, ALFONSO LEAPHART, ADMINISTRATOR OF THE ESTATE OF VINCENT LOPEZ LEAPHART, A/K/A JOHN AFRICA IN NO. 94-1321, CITY OF PHILADELPHIA IN NOS. 94-1378, 94-1233, AND 94-1272, WILLIAM C. RICHMOND IN NO. 94-1276; IN RE: CITY OF PHILADELPHIA LITIGATION; LOUISE JAMES V. FRANK POWELL; GREGORE J. SAMBOR; LEO BROOKS; WILLIAM C. RICHMOND; W. WILSON GOODE; CITY OF PHILADELPHIA; STATE OF PENNSYLVANIA; DU PONT DE NEMOURS, E.I. \u0026 COMPANY V. RAMONA JOHNSON AFRICA; ALPHONSO ROBBINS AFRICA, THIRD-PARTY LOUISE JAMES, ADMINISTRATRIX OF THE ESTATE OF FRANK JAMES IN NO. 94-1320, CITY OF PHILADELPHIA IN NOS. 94-1229 AND 94-1379, GREGORE SAMBOR IN NO. 94-1230, LEO A. BROOKS IN NO. 94-1231, WILLIAM C. RICHMOND IN NO. 94-1232",
    "jurisdiction": "Third Circuit",
    "date": "1995-03-06T00:00:00.000Z",
    "docket": "Nos. 94-1277, 94-1278, 94-1279, 94-1280, 94-1322, 94-1377, 94-1233, 94-1272, 94-1276, 94-1321, 94-1378, 94-1229, 94-1230, 94-1231, 94-1232, 94-1320, 94-1379",
    "body": "Opinion ANNOUNCING THE JUDGMENT OF THE COURT\n\nGREENBERG, Circuit Judge.\n\nThese consolidated appeals have been taken from judgments and orders in three civil actions against the City of Philadelphia and certain of its former officials and employees. The plaintiffs' claims arose out of an attempt by the Philadelphia Police Department on May 13, 1985, to execute search warrants and arrest warrants at a premises in Philadelphia occupied by a group known as MOVE. After hours of gunfire and failed attempts to inject tear gas into the residence in which the MOVE members had barricaded themselves, police officers dropped an explosive device on the roof of the house. The ensuing fire killed 11 persons, including five children, in the residence and destroyed dozens of homes in the vicinity.\n\nThe plaintiffs appeal from the district court's grant of summary judgment on qualified immunity grounds in favor of certain of the defendants with respect to claims arising from the dropping of the explosive device. Philadelphia Managing Director Leo A. Brooks, Police Commissioner Gregore Sambor, and Fire Commissioner William C. Richmond appeal from the district court's denial of their motions for summary judgment on qualified immunity grounds with respect to claims under 42 U.S.C. § 1983 arising from their alleged decisions to let the fire burn.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e They also appeal from the denial of their motions for summary judgment on state claims asserted against them. The city itself appeals from the denial of its motion for summary judgment.\n\nThe court is divided on the Disposition of various issues and on certain issues there are majorities consisting of each of the three possible combination of Judges. On other issues the court is unanimous. In this opinion I will set forth the ultimate Conclusions reached and also will set forth the majority view on some points and my own view on other points. Judges Scirica and Lewis are filing separate opinions. As a matter of convenience I largely will deliver this opinion in the first person.\n\nJudge Scirica and I conclude that all the individual defendants are immune because their actions on May 13, 1985, did not violate any clearly established constitutional rights of plaintiff Ramona Africa and decedents Frank James and Vincent Lopez Leaphart. Accordingly, we will affirm the grant of summary judgment to defendants Wilson Goode, the mayor of the city, and police officers Frank Powell and William Klein, and will reverse the denial of summary judgment on the section 1983 claims to defendants Brooks, Sambor, and Richmond. Judges Scirica and Lewis conclude that the City of Philadelphia is not entitled to summary judgment on the section 1983 claims and accordingly we will affirm the district court's denial of summary judgment to the city on those claims. Judge Lewis and I conclude that we do not have jurisdiction over the appeals from the district court's denial of summary judgment for Brooks, Sambor and Richmond on the state law claims based on letting the fire burn. Accordingly, we dismiss those appeals.\n\nThere also is a related property claim before us filed by Louise James seeking compensation for the destruction of the MOVE house. For the reasons we discuss below we all conclude that we do not have jurisdiction over the appeal from the dismissal of that claim. Consequently, we will dismiss for lack of jurisdiction James' appeal insofar as it relates to her property claim.\n\nI. FACTUAL BACKGROUND\n\nBecause the motions for summary judgment involved the individual defendants' claims of entitlement to qualified immunity, the district court indicated that its rulings were based on the \"plaintiff's well-documented version of the facts,\" as called for by Good v. Dauphin County Social Serv., 891 F.2d 1087, 1094-95 (3d Cir. 1989). This court since has clarified that such a determination should be based on the undisputed facts as revealed by the record and on the plaintiff's version of the facts where there are disputes. Melo v. Hafer, 13 F.3d 736, 745 (3d Cir. 1994) (\"If, after the summary judgment practice prescribed by that rule, the undisputed facts of record demonstrated entitlement to immunity, the Court would ignore the bare allegations of the complaint and grant summary judgment on grounds of immunity.\"); see also Brown v. Grabowski, 922 F.2d 1097, 1110-11 (3d Cir. 1990), cert. denied, 501 U.S. 1218, 111 S. Ct. 2827, 115 L. Ed. 2d 997 (1991). In this case, the extensive record includes the discovery and investigative reports from a state grand jury and a special commission which studied the incident. These materials are particularly significant because Ramona Africa, the only surviving witness from inside the premises who has testified for the plaintiffs as to the events that occurred on May 13, 1985, has limited knowledge of the facts because she was in the cellar with the children for most of that day and did not hear any of the announcements made by either police officers or MOVE members. See app. at 1362-65.\n\nThe material undisputed facts are as follows. In 1978, pursuant to a court order, the city attempted to evict MOVE members from a residence in Powelton Village. However, the MOVE members resisted and a gunfight broke out. As a result, one police officer was killed and several other police officers and fire fighters were wounded. Subsequently, nine MOVE members were convicted for the murder of this officer.\n\nIn the early 1980's MOVE members took up residence at 6221 Osage Avenue, Philadelphia. By any standard they were a disrupting neighborhood force. Some used loudspeakers to communicate threats and dissatisfaction to their neighbors. Furthermore, the Probable Cause Affidavit (the Affidavit) supporting the issuance of the warrants executed on May 13, 1985, states that a MOVE member had threatened Mayor Goode, calling him \"a nigger motherfucker\" and indicating that \"we have a bullet for [Mayor Goode] . . . to blow his motherfucking head off. If we have to, we will go down to City Hall and put six in his head.\" App. at 2294. The Affidavit also states that the same MOVE member announced, \"we will kill any motherfucking cop that comes to the front, back or our goddamned roof,\" and threatened two police officers that if they \"come back around here again, we'll kill you; put a bullet in your head.\" Id.\n\nThe Affidavit states further that several neighbors said that \"they heard MOVE members say over the loudspeakers that they have wired the entire block with explosives and that if any neighborhood resident speaks with the press, or if the police take action against MOVE, MOVE will blow up the entire block.\" App. at 2295. Neighborhood residents stated that they had seen a MOVE member on the roof with a weapon or a gun. App. at 2296. The Affidavit also notes that one of the MOVE members at 6221 Osage Avenue was on parole from a conviction for riot, terroristic threats, and possession of an instrument of crime. Id.\n\nThe Affidavit also states that in 1984, neighbors had observed MOVE members carrying sandbags into the Osage Avenue building. App. at 2301. The windows of the building had been blocked with wooden slats, and aerial photographs showed that a bunker had been constructed on its roof. App. at 1568, 2301.\n\nThe arrest and search warrants were issued on May 11, 1985, upon a judicial finding of probable cause. App. at 2291. After District Attorney Edward Rendell informed Mayor Goode that there was probable cause, the Mayor instructed Police Commissioner Sambor to develop a plan to execute the warrants. Goode testified that earlier that week, he attempted to negotiate with certain MOVE members but they rebuffed him with a message, \"Now we are ready. Tell them to come on.\" App. at 897-901.\n\nA few days prior to the confrontation, the Civil Affairs Unit of the Police Department received a hand-written letter signed with Ramona Africa's name.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e App. at 1739-53. The letter warned that any police raids on MOVE would fail, and threatened that \"if [police officers] succeed in coming thru the walls they are going to find smoke, gas, fire, and bullets. Before we let you mutha fuckas make an example of us we will burn this mutha fuckin house down and burn you up with us.\" App. at 1234, 1751.\n\nPolice Commissioner Sambor developed the initial plan to execute the warrants, which was to evacuate the neighborhood, request a peaceful surrender, and, if necessary, use tear gas to force the MOVE members from the house. App. at 1985-86. Because of the bunker on the roof, it was decided that the police would make holes in the sides of the house and insert tear gas through them rather than through the roof. App. at 1575-76, 1985. To provide cover for the \"insertion teams,\" i.e., the officers who were to enter the adjoining houses and create the holes, the plan provided for the fire department to aim water hoses at the bunker while the police fired smoke canisters around the house. App. at 1456-58, 1771, 1986. Rather than having the officers drill holes into the walls of the house, thereby exposing them to assault while they were drilling, the plan called for \"shape charges,\" or small explosives, to be used to create the holes. App. at 1416, 1570, 1986-87. Once they created the holes, it was expected that they would inject tear gas into the MOVE house and force out the occupants. App. at 1419, 1570, 1987.\n\nOn May 12, 1985, the city evacuated the neighborhood residents. App. at 2229. Beginning at approximately 3:00 a.m. the next morning, police officers and fire fighters took up their places around 6221 Osage Avenue. App. at 2230. At around 5:30 a.m., Police Commissioner Sambor announced over a bullhorn that the police had arrest warrants for four persons in the house and that they had 15 minutes to surrender. App. at 1609, 1764-69, 1856, 2036, 2230. MOVE members responded over the loudspeaker that they would not surrender, and one yelled:\n\nYou're going to be laying in the street, bleeding in the street. Come on in and get us. We're going to kill you where you stay, where you lay. We see you on the roof. We know you're in those houses.\n\nApp. at 1093, 1777, 1791-92, 2037, 2230. After the 15 minutes lapsed, the police began to fire tear gas and smoke projectiles at the house while the fire department began to squirt water onto the roof of the house to provide cover for the insertion teams. App. at 1043-44, 1778-79, 2230, 2037-38.\n\nA few minutes later, someone in the MOVE house fired shots at the police. App. at 2038, 2230. Muzzle flashes were seen from the bunker atop the roof. App. at 1780-85, 1791, 1797-98, 1826-29, 2038. A massive gun battle followed for at least an hour and a half. App. at 2041, 2230. Meanwhile, the insertion teams had set off several explosions on both sides of the house. App. at 2043-45, 2048-49, 2230. By mid-morning, the fronts of the MOVE house and adjoining houses were damaged heavily. App. at 1616-17, 2230-31. Yet, because they were under heavy gunfire and because the walls of the MOVE house were fortified, the teams could not create usable pathways through which tear gas could be introduced successfully. App. at 959-61, 1878-91, 2043-50, 2230-31. Consequently, the original plan was abandoned and the officers on the insertion teams retreated. As they did so they heard children's voices coming from the basement of the MOVE house. App. at 2051. Still, MOVE members had not given any indication that they would surrender. App. at 2231.\n\nAround 4:00 p.m. that afternoon, Sambor, Brooks, Richmond, and other city officials and police officers, discussed alternative ways to remove the bunker and to proceed against the MOVE members. App. at 971-75, 2060-61, 2231. They also discussed whether to let the situation stand overnight and continue their efforts to execute the warrants the next morning. App. at 977-80, 998, 1004-05. But they determined that they could not wait until morning because it would be too difficult to keep the neighborhood secure through the night due, among other factors, to the darkness and the exhaustion which likely would set in on the officers who had been on duty since the night before. Id. They also believed that MOVE members might escape through tunnels rumored to have been dug under the neighborhood. Id.; app. at 1410-11, 1504, 1666-67.\n\nAccordingly, the officials considered other means to execute the warrants but they rejected all as too dangerous. These included plans to use a crane to remove the bunker, to attack from above the roof, to attack from the front or the back of the house, and to place an explosive in the bunker. App. at 963, 2060-61. The officials then focused on a plan to drop a \"satchel charge\" onto the bunker from a helicopter to destroy or dislodge the bunker and create a hole in the roof. App. at 1131, 2061-62. The officials discussed the possibility that the explosive could start a fire but they were satisfied that the risk would be negligible. App. at 981, 1011, 1149, 1191, 2061-62. Managing Director Brooks then informed Mayor Goode of the plan to use the explosive, and Mayor Goode approved it.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e App. at 983-84, 1070, 2064-65, 2231. At about the same time, a group of neighbors used a bullhorn to plead with the MOVE members to surrender but received no response. App. at 966-68, 1852-54, 2231.\n\nThe plan to use the explosive went forward. App. at 2231. Klein constructed the device and Powell dropped it on the roof of the MOVE house from a helicopter operated by state troopers Richard Reed and Morris Demsko. App. at 2068, 2231. Rather than destroying the bunker, however, the satchel seems to have missed it entirely. App. at 1622-23, 2058.\n\nGoode watched the explosion on television in his City Hall office, Brooks and Sambor observed it from the balcony of a nearby building, and Richmond saw it from Osage Avenue. Id. at 1156, 2097. Brooks described his observations as follows:\n\nI observed an explosion that was from our [vantage point,] a dust ball, in other words a smoke ball. . . . It blew wood in all directions. Then it was very -- then the smoke rose. It was a very light gray smoke, as the smoke rose away from it, the helicopter was flying above it, and we could see nothing there but a hole in the roof.\n\nApp. at 987.\n\nShortly after the explosion, observers saw a fire on the roof. App. at 988. There is evidence that a detonation caused the fire by igniting combustible liquid vapor. App. at 2058, 2311. Commissioner Sambor, who now was on Osage Avenue with Commissioner Richmond, then asked Richmond, \"if we let the roof burn to get the bunker could we then subsequent to that control the fire?\" App. at 1072-73. Sambor testified:\n\nI wanted to get the bunker. I wanted to be able to somehow have tactical superiority without sacrificing any lives if it were at all possible. And in that vein I asked him -- I'm a police officer. I am not a fire fighter. I asked him for his concurrence, that if we let the roof burn to get the bunker, could we then control the fire. And whatever the response was, it was in the affirmative.\n\nApp. at 1073. Richmond's testimony corroborates this:\n\nI told him essentially that, that I thought we could contain the spread at that point. He said, 'Let's let the bunker burn to eliminate that high ground advantage and the tactical advantage of the bunker,' and I said, 'Okay' . . . . He made the recommendation, . . . and I concurred.\n\nApp. at 1163. Richmond also testified that he had prepared the fire fighters as soon as he knew of the fire. App. at 1157. But because he did not know the positions of the police officers, if any, around the area of the roof he first told an aide, \"get a hold of the police and see what they want to do about this fire on the roof.\" Id. Thus, the fire was allowed to burn until Goode and Brooks ordered that it be extinguished.\n\nThe fire fighters, however, encountered many problems. For example, there was a live electrical wire in the vicinity, the water itself caused visibility problems, and the water caused the fire to \"bank,\" or invert, downward into the house. Id. at 1158-59, 2117-20. The fire then went out of control killing 11 people and destroying 61 houses. Ramona Africa and a young boy were the only survivors from the house.\n\nII. PROCEDURAL HISTORY\n\nA. The Claims\n\nNumerous suits were filed by property owners from the neighborhood and on behalf of the occupants of 6221 Osage Avenue. The court consolidated these cases for discovery under number 85-2745, to be managed by a magistrate Judge.\n\nThe defendants' answers raised affirmative defenses, including immunity from liability. The individual defendants, sued also in their official capacity as officers or employees of the city (collectively, the city defendants), joined Ramona Africa as an additional defendant. Africa then moved to dismiss this third-party complaint but the court denied her motion. She then joined in this action against the city defendants and the City of Philadelphia, and her case was added to number 85-2745. During the ensuing four and a half years most of the claims were resolved. The remaining claims are Ramona Africa v. The City of Philadelphia, et al., number 87-2678, Alfonso Leaphart v. The City of Philadelphia, et al., number 87-2756, and Louise James v. The City of Philadelphia, et al., number 85-3528.\n\nRamona Africa sued the City of Philadelphia and Mayor Wilson Goode, Managing Director Leo Brooks, Police Commissioner Gregore Sambor, Fire Commissioner William Richmond, District Attorney Edward Rendell, City Police Lieutenant Frank Powell, City Police Officers William Klein and Michael Tursi, City Police Sergeants Albert Revel and Edward Connor, State Police Corporal Morris Demsko, and State Trooper Richard Reed, in their official capacities and individually. Africa claimed that: (1) the defendants, in violation of 42 U.S.C. § 1983, deprived her of her constitutional rights of freedom of religion, expression, and association, of due process, of equal treatment under the law, and of \"freedom from excessive force, assault and bodily injury,\" app. at 102; (2) the defendants, in violation of 42 U.S.C. § 1985(3), conspired to deprive her of these constitutional rights; and (3) the defendants violated state law in using unreasonable force in the arrest in violation of section 1983. Africa seeks compensatory and punitive damages. Her action against Rendell was, however, dismissed on qualified immunity grounds and she does not appeal from that dismissal.\n\nAlfonso Leaphart sued on behalf of John Africa a/k/a Vincent Lopez Leaphart, who perished in the fire. Leaphart initially sued the same defendants as Ramona Africa as well as certain others, but his suit was dismissed as to some of the defendants prior to entry of the orders now on appeal. Currently, the defendants in his case are the City of Philadelphia, Mayor Goode, Commissioner Richmond, Lieutenant Powell, and Officers Klein, Tursi, and Revel. Leaphart alleges that they violated his decedent's rights under the First, Fourth, and Fourteenth Amendments, in violation of 42 U.S.C. §§ 1983 and 1985(3).\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e He seeks compensatory and punitive damages as well as declaratory relief.\n\nLouise James sued on behalf of her son Frank Africa a/k/a Frank James, who perished in the fire, and on her own behalf as owner of 6221 Osage Avenue. James currently sues the City of Philadelphia, Mayor Goode, Commissioners Sambor and Richmond, Managing Director Brooks, and Lieutenant Powell, for compensatory and punitive damages. In her personal capacity, she asserts a claim under the Fifth Amendment for the uncompensated destruction of her property. On behalf of her son, she asserts a section 1983 claim and a section 1985(3) claim based on the alleged deprivation of her son's constitutional rights and state law claims. As is evident, some of the claims asserted by all three plaintiffs against certain defendants are identical. Accordingly, I will treat such similar claims together.\n\nB. The District Court Rulings\n\nIn a March 26, 1992 report and recommendation, the magistrate Judge recommended that the court deny the motions for summary judgment sought on qualified immunity grounds by Mayor Goode, Managing Director Brooks, Commissioner Sambor, Commissioner Richmond, Lieutenant Powell, Officer Klein, and State Police Officers Demsko and Reed. See Africa v. City of Philadelphia, 809 F. Supp. 375, 376-77 (E.D. Pa. 1992) (hereinafter Africa I). He also recommended that the court grant summary judgment in all three cases on qualified immunity grounds to Officers Tursi, Revel, and Connor because they were involved only with the attempted penetration of the sides of the house. Id. at 377 n.5. The district court approved and adopted the latter recommendations, and these orders have not been appealed. Id.\n\nBut the district court remanded the remaining matters to the magistrate Judge for consideration under the guidelines the Supreme Court set forth in Tennessee v. Garner, 471 U.S. 1, 105 S. Ct. 1694, 85 L. Ed. 2d 1 (1985), stating as follows:\n\nThe court must determine, on plaintiff's well-documented version of the facts, whether a reasonable officer in each defendant's position, to the extent that this defendant could be found to have some responsibility for the use of force in question, could have believed that the force employed was necessary to protect the safety of himself or others.\n\nAfrica I, 809 F. Supp. at 382 (citation omitted); In re City of Philadelphia Litig., 849 F. Supp. 331, 337 (E.D. Pa. 1994) (hereinafter Africa II).\n\nOn October 6, 1993, the magistrate Judge issued another report and recommendation. He analyzed the defendants' actions as involving two separate decisions: the plan to drop the explosive device onto the bunker and the decision to let the fire burn. He concluded as follows:\n\n[A] reasonable person in each of the defendant's positions could have believed that the use of an explosive device to remove the bunker from the roof and to provide access to the interior of the house for tear gas was necessary to 'prevent death or serious bodily injury' to the police officers on the scene or other persons. In addition, based on the information available to them regarding MOVE's threat of violence and MOVE's use of force in resisting arrest, they could have believed that the use of the bomb would be conduct that was consistent with the principles embodied in Section 508\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e [of the Pennsylvania Crimes Code] and Garner.\n\nAfrica II, 849 F. Supp. at 337, 357. Section 508 defines the circumstances in which a police officer may use force in making an arrest. Thus, the magistrate Judge recommended that all defendants be granted summary judgment in all three cases to the extent that the plaintiffs sought to impose liability based on the dropping of the explosive device.\n\nThe magistrate Judge concluded, however, that under the standards of Tennessee v. Garner and section 508 of the Pennsylvania Crimes Code it was unreasonable to let the fire burn after the bunker had been neutralized. 849 F. Supp. at 337, 359-61. He also determined that Commissioners Sambor and Richmond made the decision to let the fire burn but that the other city defendants were not involved at this stage. Id. at 337, 360. Therefore, he recommended that the court deny summary judgment on qualified immunity grounds for the two commissioners with respect to claims based on letting the fire burn. Id. They objected to this recommendation on the ground that the evidence demonstrated that they had intended to let the fire consume only the bunker, which they believed to pose a lingering threat. Id. at 339.\n\nThe magistrate Judge further found that while the defendants may be entitled to statutory immunity from state law liability for acts performed in the scope of their duties, they would not be entitled to immunity if they engaged in \"willful misconduct.\" Id. at 364. Accordingly, the magistrate Judge recommended that the court grant summary judgment on immunity grounds with respect to the state claims to those individual defendants involved only in the dropping of the explosive device. Id. In these instances, the grant of summary judgment on the federal claims demonstrated that the conduct of these defendants did not, as a matter of state law, constitute \"willful misconduct.\" Id. Conversely, he recommended that those defendants denied summary judgment on the federal claims also should be denied summary judgment for the state claims. Id.\n\nThe district court adopted the magistrate Judge's recommendation as to the claims based on the dropping of the explosive device. Id. at 338-39. In reviewing the recommendation, however, the court \"focused on the decision to let the fire burn at all.\" Id. The court stated:\n\nI cannot conclude that there is a demonstration which leads to the judgment as a matter of law that it was reasonable as a matter of necessity, at the point after the bomb was dropped and when a flame was first visible, for the law enforcement officials to permit flame [sic] to continue until it totally consumed what remained of a bunker . . . . That it might be convenient to have let the balance of the bunker be consumed by fire is perhaps a tenable view. That it was necessary, in Tennessee v. Garner terms, I can find no basis for concluding.\n\nId. at 340. Thus, the court concurred with the magistrate Judge's view that summary judgment should be denied to Commissioners Sambor and Richmond with respect to claims based on letting the fire burn. Id. at 342, 347.\n\nDuring oral argument the district court raised the question of \"whether there was not some basis in the record for concluding that conceivably Managing Director Brooks concurred for a time in the decision to let the fire burn.\" Id. at 342. Although Africa had not objected earlier to the magistrate Judge's finding that he had not concurred in that decision, she decided to do so then. Id. In a further interview, Commissioner Sambor indicated that when he explained to Brooks that they were letting the fire burn the bunker, Brooks said, \"only the bunker.\" Id. at 343. Sambor said further that Brooks subsequently told him to put the fire out. Attorneys for the city and for Brooks argued that the plaintiffs waived this issue and that no other evidence supports the allegation that Brooks was involved in the decision to let the fire burn. The district court rejected these arguments and denied the summary judgment which Brooks sought on qualified immunity grounds with respect to claims based on the decision to let the fire burn. Id. at 345, 347.\n\nWith regard to claims against the City of Philadelphia, the city first argued that only Mayor Goode and Managing Director Brooks had final decision-making authority and that it should not be held responsible for their subordinates' unapproved decisions. However, upon finding that Brooks could be denied qualified immunity, the city changed its position and argued that only Mayor Goode had final decision-making authority. Id. at 345. The court reviewed the city's charter and concluded that the suability of either Managing Director Brooks or the two commissioners would be sufficient to hold the city suable on the federal claim. Id. at 345-47.\n\nThe court also held, in accord with the magistrate Judge's recommendation, that all defendants were entitled to summary judgment based on lack of evidence with respect to the plaintiffs' claims under the First and Fourteenth Amendments and under section 1985(3). In addition, the court held that the city was entitled to summary judgment on the state law claims because a recent Pennsylvania Supreme Court opinion established that the city council did not have the authority to expand the scope of the Pennsylvania Political Subdivision Tort Claims Act. This Supreme Court ruling was critical as the viability of the plaintiffs' state law claims depended on this expansion.\n\nFinally, the court dismissed James' Fifth Amendment claim because she did not allege that she had pursued relief unsuccessfully under state law procedures such as those set forth by the Pennsylvania eminent domain code. In re City of Philadelphia (James v. City of Philadelphia), *14, No. 85-3528 (E.D. Pa. Feb. 1, 1994). James pointed out that she had brought a federal suit, number 88-3881, for recovery of her property losses under federal and state law. In that action she alleged that she was the only person whose property had been destroyed by the fire whom the city did not compensate and she asserted that such treatment was discriminatory. Id. In December 1988, the court dismissed number 88-3881 with prejudice as to the federal claims on the grounds that they were barred by the statute of limitations and it dismissed the state law claims without prejudice. Id. James did not appeal from that ruling. On January 3, 1994, one day before the district court rendered its bench opinion in the case currently before us, James filed a Motion for Reconsideration Nunc Pro Tunc of the 88-3881 decision under both docket numbers, 88-3881 and 85-3528. The district court denied this motion, reasoning that it had been five years since the 88-3881 case had been decided and James had offered no new evidence or reasons for reexamining that decision. Id. at 13.\n\nOn motion by the City, the district court certified as appealable under Fed. R. Civ. P. 54(b) the dismissal of all claims against Goode, Powell, Klein,\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Revel, Tursi, Connor, Demsko, and Reed. App. at 682, 803. In addition, the court certified for appeal under 28 U.S.C. § 1292(b) the issue \"of the suability of the City of Philadelphia, pursuant to 42 U.S.C. § 1983, on claims arising from the decision to let the . . . fire burn.\" Id.\n\nC. The Issues on Appeal\n\nRamona Africa appeals from the district court's final order granting summary judgment in favor of Mayor Goode and Officers Powell and Klein. Alfonso Leaphart appeals from the final judgment granting summary judgment in favor of Mayor Goode. Louise James appeals from the final judgment granting summary judgment in favor of Mayor Goode and Officer Powell\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e and in favor of the City of Philadelphia with respect to the Fifth Amendment property claim. James has appealed only from orders in the 85-3528 case.\n\nThe City of Philadelphia appeals from the order denying its motion for summary judgment with respect to the federal claims based on section 1983. Managing Director Brooks and Commissioners Sambor and Richmond appeal from the orders denying their motions for summary judgment on qualified immunity grounds with respect to the claims based on the decision to let the fire burn and from the orders denying them summary judgment on the state claims. We consolidated the appeals for briefing and argument.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nIII. JURISDICTION\n\nThe district court had jurisdiction over the federal civil rights claims pursuant to 28 U.S.C. § 1343 (civil rights action) and 28 U.S.C. § 1331 (federal question jurisdiction). The district court also had supplemental jurisdiction based upon 28 U.S.C. § 1367 over the related state law claims.\n\nA. Judgments Certified Under Rule 54(b)\n\nWe have jurisdiction pursuant to 28 U.S.C. § 1291 over the appeals from the grants of summary judgment which the district court certified as final judgments under Rule 54(b). Gerardi v. Pelullo, 16 F.3d 1363, 1368-69 (3d Cir. 1994). These final judgments include grants of summary judgment on qualified immunity grounds with respect to all claims against Goode, Powell, Klein,\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Tursi, Revel, Connor, Demsko, and Reed. As they are properly before us, I shall review Africa's appeal from the summary judgments in favor of Goode, Powell, and Klein; Leaphart's appeal from the summary judgment in favor of Goode; and James' appeal from the summary judgment in favor of Goode and Powell.\n\nB. Denial of Summary Judgment Certified Under 28 U.S.C. § 1292(b)\n\nIn orders dated January 31, 1994, and February 1, 1994, the district court stated as follows:\n\nIt is DECLARED to be the opinion of this court that, within the intendment of 28 U.S.C. § 1292(b), (1) the issue, determined adversely to the City of Philadelphia . . ., of the suability of the City of Philadelphia, pursuant to 42 U.S.C. § 1983, on claims arising from the decision to let the [MOVE] fire burn, is one which involves a controlling question of law as to which there is substantial ground for difference of opinion, and (2) that an immediate appeal from that aspect of the . . . order, taken in conjunction with anticipated appeals on related question of qualified immunity of certain individual defendants, may materially advance the ultimate termination of the litigation.\n\nApp. at 682, 802-03. This court then granted the city leave to appeal and thus we have jurisdiction over the city's appeal.\n\nC. Denial of Summary Judgment on Qualified Immunity Grounds with Respect to Federal Claims\n\nGenerally, this court does not have jurisdiction to review the denial of summary judgment because such decisions are not final as required by 28 U.S.C. § 1291. Giuffre v. Bissell, 31 F.3d 1241, 1245 (3d Cir. 1994). In Mitchell v. Forsyth, 472 U.S. 511, 530, 105 S. Ct. 2806, 2817, 86 L. Ed. 2d 411 (1985), however, the Supreme Court held that a denial of summary judgment on the ground of qualified immunity is appealable under the collateral order doctrine. \"[A] decision of a district court is appealable if it falls within 'that small class which finally determine claims of right separable from, and collateral to, rights asserted in the action, too important to be denied review and too independent of the cause itself to require that appellate consideration be deferred until the whole case is adjudicated.'\" Id. at 524-25, 105 S. Ct. at 2814 (quoting Cohen v. Beneficial Indus. Loan Corp., 337 U.S. 541, 546, 69 S. Ct. 1221, 1225, 93 L. Ed. 1528 (1949)).\n\nThe Court found that qualified immunity is \"an entitlement not to stand trial or face the other burdens of litigation\" which would be \"effectively lost if a case is erroneously permitted to go to trial.\" Id. at 526, 105 S. Ct. at 2815. Moreover, a district court's denial of qualified immunity would be \"effectively unreviewable on appeal from a final judgment.\" Id. at 527, 105 S. Ct. at 2816. The Court also found that this denial \"conclusively determined the disputed question\" of a defendant's right not to stand trial on the plaintiff's allegations, as required under Coopers \u0026 Lybrand v. Livesay, 437 U.S. 463, 468, 98 S. Ct. 2454, 2457, 57 L. Ed. 2d 351 (1978). Finally, the Court determined that \"a claim of immunity is conceptually distinct from the merits of the plaintiff's claim that his rights have been violated,\" thus satisfying the requirement of being \"collateral\" under Cohen. Mitchell v. Forsyth, 472 U.S. at 527-28, 105 S. Ct. at 2816.\n\nTherefore, we all agree that we have jurisdiction to consider the appeals taken by Brooks, Sambor, and Richmond from the district court's denial of summary judgment on qualified immunity grounds with respect to federal claims based on letting the fire burn. See Giuffre v. Bissell, 31 F.3d at 1245; Hynson v. City of Chester Legal Dept., 864 F.2d 1026, 1028-29 (3d Cir. 1988).\n\nD. Denial of Summary Judgment on Immunity Grounds with Respect to State Law Claims\n\nI now address the question of whether we have jurisdiction over the appeals from the district court's denial of summary judgment for Brooks, Sambor, and Richmond on the state law claims based on letting the fire burn. I conclude that we do not have such jurisdiction and, as Judge Lewis agrees, he joins in the determination dismissing this aspect of the appeals. The district court did not certify this order under either Rule 54(b) or section 1292(b).\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Nor, I think, is this issue so intertwined with those raised by the appeals properly before us that we should assert pendent appellate jurisdiction over it. See National Union Fire Ins. Co. v. City Savings, F.S.B., 28 F.3d 376, 382 n.4 (3d Cir. 1994); Kershner v. Mazurkiewicz, 670 F.2d 440, 449 (3d Cir. 1982).\n\nI therefore consider whether we may assert jurisdiction over these appeals under the collateral order doctrine. In this inquiry Brown v. Grabowski, 922 F.2d 1097, is instructive. In that case, the district court denied qualified immunity to the defendant police officers on plaintiff's pendent tort claims under New Jersey law. On appeal, this court noted that the determination of appellate jurisdiction over the state claims requires \"(1) a predicate inquiry into whether the federal law of qualified official immunity ultimately governs appealability in this instance; and (2) a subsequent inquiry into the nature of the qualified immunity that New Jersey law confers upon state officials.\" Id. at 1106.\n\nIn Brown this court concurred with the Courts of Appeals for the Fifth and Sixth Circuits that \"the parties . . . in a federal action such as this one involving pendent state claims, are bound by federal procedural rules governing appeals, including the collateral order doctrine.\" Id. (citing Sorey v. Kellett, 849 F.2d 960, 962 (5th Cir. 1988); Marrical v. Detroit News, Inc., 805 F.2d 169, 172 (6th Cir. 1986)). However, it is state law that provides the substantive doctrine of immunity. The court also concluded that \"the denial of a claim of qualified immunity premised upon state law is appealable only if the state has conferred an underlying substantive immunity from suits arising from the performance of official duties.\" 922 F.2d at 1106-07 (citing Marrical, 805 F.2d at 172; Sorey, 849 F.2d at 962). It is immunity from suits, rather than mere immunity from liability, that would make such an order appealable. Giuffre v. Bissell, 31 F.3d at 1248.\n\nIn Brown v. Grabowski this court looked at the New Jersey Tort Claims Act, New Jersey case law on immunity, and New Jersey's doctrinal and procedural rules concerning interlocutory appeals to determine the scope of the state immunity. 922 F.2d at 1107. Thus, here I look to the Pennsylvania law of official immunity to ascertain whether we have jurisdiction over the three officials' appeals from the denial of summary judgment on the state law claims arising from the decision to allow the fire to burn.\n\nIn this case, the district court did not elaborate on the state law claims but seemed to adopt the magistrate Judge's approach. The magistrate Judge stated that although Pennsylvania's Political Subdivision Tort Claims Act (PSTCA) grants immunity to the city's employees to the same extent that the city is immune, such immunity would not apply if \"it is judicially determined that the act of the employee caused the injury and that such act constituted a crime, actual fraud, actual malice or willful misconduct.\" Africa II, 849 F. Supp. at 364 (citing 42 Pa. Cons. Stat. Ann. §§ 8545 \u0026 8550 (1982)). Thus, the magistrate Judge recommended that those defendants who were to be granted summary judgment on claims based on dropping the explosive device and letting the fire burn should be entitled also to assert immunity under the PSTCA because \"they have demonstrated, as a matter of law, that their conduct did not constitute a crime, actual fraud, actual malice or willful misconduct.\" Id. As to those defendants whose motions for summary judgment were to be denied as to claims based on letting the fire burn, however, the magistrate Judge recommended that they be denied summary judgment on the state claims as well. This is because \"they cannot show as matter of law that their decision did not constitute willful misconduct.\" Id.\n\nAlthough I do not find guidance on the point in the opinions of the Pennsylvania Supreme Court, the Commonwealth Court of Pennsylvania has ruled that an order denying a summary judgment sought on statutory immunity grounds is not appealable immediately. Bollinger v. Obrecht, 122 Pa. Commw. 562, 552 A.2d 359 (Pa. Commw. Ct. 1989), appeal denied, 588 A.2d 511 (Pa. 1990). This ruling strongly implies that such immunity is only from liability, despite the fact that the court went on to say it need not reach the issue of whether Pennsylvania law confers immunity from suit rather than from liability. Id. at 363 \u0026 n.5. The Commonwealth Court noted that Pennsylvania courts have followed Cohen 's collateral order doctrine but ruled that Mitchell v. Forsyth was not controlling because it involved only federal immunity. Id. at 362-63. The court explained:\n\nIn Pennsylvania, immunity is governed by statute. The merits of a plaintiff's cause of action against government agencies and officers are likewise governed by the same statute. Thus, a trial court analyzing an immunity claim is actually deciding the same issues that will arise in the underlying action. Unlike matters of federal official immunity, the trial court's interlocutory order denying an immunity claim under Pennsylvania law, is not separate from and collateral to the main cause of action.\n\nId. at 363. But as Mitchell noted, when immunity from suit is involved, the opposite result should be reached.\n\nLater cases consistently have followed Bollinger v. Obrecht. See, e.g., Farber v. Pennsbury Sch. Dist., 131 Pa. Commw. 642, 571 A.2d 546 (Pa. Commw. Ct. 1990) (quashing appeal as interlocutory from denial of motion for summary judgment on grounds of governmental immunity); Brown v. Philadelphia, 126 Pa. Commw. 549, 560 A.2d 309 (Pa. Commw. Ct. 1989) (same), appeal denied, 600 A.2d 540 (Pa. 1991); McKinney v. Philadelphia, 123 Pa. Commw. 144, 552 A.2d 1169 (Pa. Commw. Ct. 1989) (same), aff'd, 569 A.2d 351 (Pa. 1990); Gwiszcz v. Philadelphia, 121 Pa. Commw. 376, 550 A.2d 880 (Pa. Commw. Ct. 1988) (same). Indeed, the language of the PSTCA supports the Commonwealth Court's reasoning as the act seems to be directed at liability, referring to immunity as only a defense to such liability rather than as a right to be free from suits.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThe fact that interlocutory orders may be appealable by permission of the appellate court, under the Pennsylvania Rules of Appellate Procedure, is irrelevant to my inquiry. See Wareham v. Jeffes, 129 Pa. Commw. 124, 564 A.2d 1314, 1318 n.8 (Pa. Commw. Ct. 1989) (noting that denial of summary judgment on grounds of sovereign immunity would be interlocutory and unappealable except by permission). See also Lancie v. Giles, 132 Pa. Commw. 255, 572 A.2d 827, 829 n.3 (Pa. Commw. Ct. 1990) (Commonwealth Court granted defendants permission to appeal from interlocutory order denying summary judgment on state statutory immunity grounds).\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e First, whereas Pennsylvania appellate courts may grant permission to appeal from interlocutory and otherwise unappealable orders, absent a certification by the district court under 28 U.S.C. § 1292(b), we cannot do so. In fact, the exercise of discretion to withhold such permission effectively will negate a claim of immunity from suit. Second, as we stated in Brown v. Grabowski, federal rules govern this federal action. 922 F.2d at 1106. Therefore, Bollinger v. Obrecht is dispositive here. To recap, under Brown v. Grabowski, the right to an interlocutory appeal \"can only exist where the state has extended an underlying substantive right to be free from the burdens of litigation,\" 922 F.2d at 1107 (quoting Marrical, 805 F.2d at 172). Bollinger demonstrates that Pennsylvania has not done that. Thus, because immunity is not a separate or collateral issue from the underlying claim under Pennsylvania law, we have no jurisdiction over the appeals by Brooks, Sambor, and Richmond from the district court's order denying them summary judgment on the state law claims. We therefore will dismiss their appeals from the district court's orders denying summary judgment as to the state law claims.\n\nE. Grant of Summary Judgment with Respect to James' Property Claims in Favor of the City\n\nJames appeals from the district court's grant of partial summary judgment in favor of the City of Philadelphia with respect to her claim based on the uncompensated destruction of property. James argues that in refusing to compensate her on the same basis as her neighbors, the city discriminated against her and has been enriched unjustly at her expense. We all agree, however, that James has not set forth any jurisdictional basis which permits us to consider her property arguments as there are claims remaining in the district court and thus her appeal is not from a final judgment.\n\nAs I indicated above, James brought a separate federal civil rights suit, number 88-3881, seeking damages for her property, the thrust of which was that her treatment, \"as allegedly the only person in the neighborhood of destroyed houses or damaged houses who was not offered to be compensated . . ., was discriminatory in terms that were unconstitutional.\" App. at 815. The court dismissed these federal claims with prejudice because they were barred by the statute of limitations and it dismissed the state claims without prejudice. James did not appeal from this judgment.\n\nIn the case now before us, number 85-3528, the magistrate Judge recommended that the court grant partial summary judgment as to the property issue in favor of the city because the takings claim could not stand \"without an appropriate allegation of unsuccessful resort to state procedures pursuant to Pennsylvania's eminent domain code.\" Id. James, however, asked the district court either to disregard the recommendation or to reopen the 1988 case, nunc pro tunc, because she believed the court had decided it erroneously. Id. The district court agreed with the magistrate Judge's recommendation and declined to reopen the 1988 case.\n\nJames' present appeal is from the decision rendered in number 85-3528 as her notice of appeal makes no mention of number 88-3881. Consequently, she cannot contest directly the court's refusal to reconsider the 1988 case. Nevertheless, what James argues now is strongly reminiscent of her allegations in the 1988 suit -- that the denial of compensation for her property is discriminatory and violates her equal protection and First Amendment rights and that the city has been enriched unjustly. James devotes a large part of her appellate effort to the allegations that she has been denied equal protection and has been the victim of unlawful discrimination. She asserts repeatedly that she is \"a member of the class of individuals, such class consisting of the victims of the Osage Avenue fire.\" James Br. at 37, 38. She directs this argument to the magistrate Judge's Conclusion that she neither has alleged nor shown that the city's action was \"based on any class-based invidiously discriminatory animus.\" See app. at 792-93.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e However, the magistrate Judge made this statement in explaining why the claims under section 1985(3) on behalf of James' deceased son must fail. Thus, his comments were not addressed to her property claim in case 85-3528. These misdirected arguments by James support the city's suggestion that she is attempting to incorporate the number 88-3881 case into the present one. To the extent that James is attempting now to appeal from that December 1988 dismissal, we must reject the attempt for lack of jurisdiction. See United States v. Rivera Const. Co., 863 F.2d 293, 298-99 (3d Cir. 1988) (\"where the order or judgment upon which the appellant seeks review is neither directly nor indirectly referred to in the notice of appeal, then the issue is not fairly raised and the Court of Appeals does not acquire jurisdiction\").\n\nFurthermore, we see no basis to exercise jurisdiction over James' appeal from the judgment in favor of the city in number 85-3528 on the uncompensated destruction of property claims. The collateral order doctrine has nothing to do with the claim and the district court did not enter a certification with respect to the order under either Rule 54(b) or 28 U.S.C. § 1292(b).\n\nF. Scope of Appellate Review\n\nWe exercise plenary review over all appeals properly before us because they are all from grants or denials of summary judgment. See Petruzzi's IGA Supermarkets, Inc. v. Darling-Delaware Co., 998 F.2d 1224, 1230 (3d Cir.), cert. denied, 114 S. Ct. 554 (1993) (grant of summary judgment); Giuffre v. Bissell, 31 F.3d at 1251 (denial of summary judgment on qualified immunity grounds); Acierno v. Cloutier, 40 F.3d 597, 609 (3d Cir. 1994) (in banc) (same). Moreover, we have plenary review over the grant or denial of qualified immunity because it is an issue of law. Giuffre v. Bissell, 31 F.3d at 1254. Thus, I will consider whether there are genuine issues as to material facts and whether the defendants are entitled to judgment as a matter of law. Fed. R. Civ. P. 56(c).\n\nIV. QUALIFIED IMMUNITY\n\nCourts determine whether a defendant is entitled to qualified immunity by balancing the important policy of compensating individuals for deprivation of their rights against \"the need to protect officials who are required to exercise their discretion and the related public interest in encouraging the vigorous exercise of official authority.\" Harlow v. Fitzgerald, 457 U.S. 800, 807, 102 S. Ct. 2727, 2732, 73 L. Ed. 2d 396 (1982) (quoting Butz v. Economou, 438 U.S. 478, 506, 98 S. Ct. 2894, 2910, 57 L. Ed. 2d 895 (1978)). In making this balance, courts recognize that officials often must \"act swiftly and firmly at the risk that action deferred will be futile or constitute virtual abdication of office.\" Scheuer v. Rhodes, 416 U.S. 232, 246, 94 S. Ct. 1683, 1691, 40 L. Ed. 2d 90 (1974). Thus, \"government officials performing discretionary functions generally are shielded from liability for civil damages insofar as their conduct does not violate clearly established statutory or constitutional rights of which a reasonable person would have known.\" Harlow v. Fitzgerald, 457 U.S. at 818, 102 S. Ct. at 2738.\n\nSiegert v. Gilley, 500 U.S. 226, 231, 111 S. Ct. 1789, 1793, 114 L. Ed. 2d 277 (1991), instructs that before a court addresses a claim of qualified immunity, it first should determine whether a plaintiff has alleged \"a violation of a constitutional right at all.\" See Acierno v. Cloutier, 40 F.3d at 606 n.7; D.R. by L.R. v. Middle Bucks Area Vocational Technical Sch., 972 F.2d 1364, 1368 (3d Cir. 1992) (in banc), cert. denied, 122 L. Ed. 2d 354, 113 S. Ct. 1045 (1993). Deciding \"this purely legal question permits courts expeditiously to weed out suits which fail the test without requiring a defendant who rightly claims qualified immunity to engage in expensive and time consuming preparation to defend the suit on its merits.\" Siegert v. Gilley, 500 U.S. at 232, 111 S. Ct. at 1793.\n\nFurthermore, for there to be liability, the right alleged to have been violated \"must have been 'clearly established' in a more particularized, and hence more relevant, sense.\" Anderson v. Creighton, 483 U.S. 635, 640, 107 S. Ct. 3034, 3039, 97 L. Ed. 2d 523 (1987). While the abstract right to be free from unreasonable seizure clearly is established, for qualified immunity purposes the right must be considered on a more specific level: \"the contours of the right must be sufficiently clear that a reasonable official would understand that what he is doing violates that right.\" Id.\n\nConsequently, I consider whether the particularized constitutional right asserted was \"'clearly established' at the time the defendants acted.\" Acierno v. Cloutier, 40 F.3d at 606 (citing Siegert v. Gilley, 500 U.S. at 232, 111 S. Ct. at 1793); Harlow v. Fitzgerald, 457 U.S. at 817-19, 102 S. Ct. at 2738. If the law is not established clearly when an official acts, he is entitled to qualified immunity because he \"could not reasonably be expected to anticipate subsequent legal developments, nor could he fairly be said to 'know' that the law forbade conduct not previously identified as unlawful.\" Id. On the other hand, if the law was established clearly, the official still may obtain qualified immunity if he claims \"extraordinary circumstances and can prove that he neither knew nor should have known of the relevant legal standard.\" Id. In other words, \"defendants will not be immune if, on an objective basis, it is obvious that no reasonably competent officer would have concluded that [the action was lawful]; but if officers of reasonable competence could disagree on this issue, immunity should be recognized.\"\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Malley v. Briggs, 475 U.S. 335, 341, 106 S. Ct. 1092, 1096, 89 L. Ed. 2d 271 (1986).\n\nA. Allegation of a Constitutional Violation\n\nIn Graham v. Connor, 490 U.S. 386, 395, 109 S. Ct. 1865, 1871, 104 L. Ed. 2d 443 (1989), the Court held \"that all claims that law enforcement officers have used excessive force -- deadly or not -- in the course of an arrest, investigation stop, or other 'seizure' of a free citizen should be analyzed under the Fourth Amendment and its 'reasonableness' standard, rather than under a 'substantive due process' approach.\" Thus, the general right central to this case is the right to be free from unreasonable seizure of the person under the Fourth Amendment, in particular seizure with unreasonable force.\n\nSiegert v. Gilley, however, demands more than conclusory allegations that defendants violated a certain constitutional right. For example, Siegert asserted that his rights under the Due Process Clause of the Fifth Amendment were violated when Gilley maliciously made unkind comments regarding his abilities to a prospective employer. Siegert v. Gilley, 500 U.S. at 232, 111 S. Ct. at 1793. Because defamation is not a constitutional deprivation, the Supreme Court concluded that Siegert failed not only to allege a violation of a clearly established constitutional right but failed to allege a \"violation of any constitutional right at all.\" Id. at 233-34, 111 S. Ct. at 1794. Similarly, in D.R. by L.R. v. Middle Bucks Area Vocational Technical Sch., two public school students sued because some of their classmates allegedly molested them. 972 F.2d at 1364. This court accepted the plaintiffs' statement that they had a \"liberty interest in their personal bodily integrity protected by the Fourteenth Amendment,\" but held that the school's alleged conduct did not amount to a constitutional violation. 972 F.2d at 1368.\n\nIn essence, here the plaintiffs allege that the defendants exerted excessive force in attempting to arrest plaintiff Africa and decedents Leaphart and James, by dropping the explosive on the roof of the MOVE residence and by letting the fire burn. On the face of the complaint, I believe plaintiffs have met the threshold required by Siegert v. Gilley by alleging a constitutional violation. Judges Scirica and Lewis agree with this Conclusion.\n\nB. Violation of a Constitutional Right\n\nI now consider on the undisputed facts, Melo v. Hafer, 13 F.3d at 745; Good v. Dauphin County Social Serv., 891 F.2d at 1094-95, whether the individual defendants are entitled to qualified immunity. In this section, \"B. Violation of a Constitutional Right,\" I write only for myself. First, I ask whether plaintiff Africa and decedents Leaphart and James possessed a \"clearly established\" constitutional right to be free from the forces allegedly exerted by the individual defendants under the circumstances that existed on May 13, 1985. As the defendants point out, they did not direct force at the person of any of the prospective arrestees. Rather, they directed the force at destruction of property so that police officers could inject tear gas into the house to effect a peaceful arrest -- one in which neither police officers nor MOVE members would be injured seriously. There is no evidence on the substantially developed record that anyone intended otherwise. In fact, there is evidence indicating that the defendants were concerned with not harming the people inside the house.\n\nThe district court, however, refused to consider the officials' argument that they intended only to destroy the bunker. See Africa II, 849 F. Supp. at 341-42. The court stated that Graham v. Connor, 490 U.S. 386, 109 S. Ct. 1865, 104 L. Ed. 2d 443, requires use of an \"objective legal reasonableness\" test in a Fourth Amendment excessive force case. While this formulation is accurate, I disagree with its application by the district court. In Graham v. Connor, the plaintiff allegedly sustained physical injuries when police officers grabbed and cuffed him, threw him on his companion's car, and threw him headfirst into the police car. Id. at 389-90, 109 S. Ct. at 1868. Thus, as is usually true in excessive force cases, the police officers' intent to apply force to the person of Graham was clear. The Supreme Court held that the court of appeals erred when it considered whether the officers \"acted in good faith or maliciously and sadistically for the very purpose of causing harm,\" as the case should have been analyzed under a Fourth Amendment \"objective reasonableness\" standard. Id. at 395-97, 109 S. Ct. at 1871-72 (internal quotation marks omitted). Therefore, although the Supreme Court did find the \"underlying intent or motivation\" irrelevant, this reference was to the officers' motivations for carrying out the direct application of the force to the arrestee's person. Graham v. Connor, 490 U.S. at 397, 109 S. Ct. at 1872. But here the issue before us concerns the more fundamental question of whether the officers applied force to the MOVE members at all.\n\nOn this point, another Supreme Court decision, Brower v. County of Inyo, 489 U.S. 593, 109 S. Ct. 1378, 103 L. Ed. 2d 628 (1989), is instructive. In that case, the plaintiffs brought a section 1983 action alleging that the police effected an unreasonable seizure of the decedent by putting up a roadblock into which the decedent fatally crashed the stolen car he was driving. Id. at 594, 109 S. Ct. at 1380. The Supreme Court explained:\n\n[A] Fourth Amendment seizure does not occur whenever there is a governmentally caused termination of an individual's freedom of movement . . ., nor even whenever there is a governmentally caused and governmentally desired termination of an individual's freedom of movement . . ., but only when there is a governmental termination of freedom of movement through means intentionally applied.\n\nId. at 596-97, 109 S. Ct. at 1381. In that case, the Court held that there was a Fourth Amendment seizure because the decedent was stopped by the blockade, \"the very instrumentality set in motion or put in place in order to achieve that result.\" Id. at 599, 109 S. Ct. at 1382.\n\nBut this case is different, as the officials did not intend to apply any force to the persons of the MOVE members when they dropped the explosive device and allowed the fire to burn. Thus, while their subjective thoughts as to the lawfulness of their conduct is irrelevant under Anderson v. Creighton, 483 U.S. at 641, 107 S. Ct. at 3040, what is not irrelevant is the officials' intention only to destroy the bunker and perhaps part of the roof so that they could inject tear gas into the house.\n\nIn my analysis, I ask whether it is enough for a Fourth Amendment seizure that the MOVE members were stopped by \"the very instrumentality set in motion or put in place [the destruction of the bunker] in order to achieve that result.\" Brower v. County of Inyo, 489 U.S. at 599, 109 S. Ct. at 1382. The Supreme Court cautioned that \"in determining whether the means that terminates the freedom of movement is the very means that the government intended we cannot draw too fine a line.\" Id. at 598, 109 S. Ct. 1382. In this sense, a court must look to the officials' intent of why they wanted to destroy the bunker and to create a hole in the roof to see whether the destruction of the bunker was set in motion \"in order to achieve\" the seizure.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e The destruction of the bunker was obviously a part of the officials' day-long effort to seize the MOVE members, but none of the officials intended it in itself to effectuate the seizure. Nor could they reasonably have intended the destruction of the bunker alone to be conclusive in any way, even though it may well have been reasonable to believe, as they did believe, that its destruction was an important objective.\n\nThus, this case differs from Brower because there the police set up the blockade to stop a motoring felon. Consequently, in Brower, the decedent \"was meant to be stopped by the physical obstacle of the roadblock -- and . . . he was so stopped.\" Id. at 599, 109 S. Ct. at 1382. But in this case, it cannot be said that the defendants intended to seize the MOVE members by destroying the bunker. Nor were they so seized. From the allegations and the evidence on record, we only can say that those who were alive immediately before 5:30 that afternoon were seized, i.e. killed, not by the explosive, nor by the burning of the bunker, but by the fire that continued despite efforts of the fire department. See Carroll v. Borough of State College, 854 F. Supp. 1184, 1190 (M.D. Pa. 1994) (holding that to constitute seizure, police action must be \"direct\" cause of injury), aff'd, 47 F.3d 1160 (3d Cir. 1995) (table).\n\nAccordingly, this is a case of \"a governmentally caused and [perhaps] governmentally desired termination of an individual's freedom of movement,\" but not \"through means intentionally applied.\" See 489 U.S. at 597, 109 S. Ct. at 1381 (emphasis omitted). Consequently, there was no Fourth Amendment seizure in this case. Thus, on this ground alone I am constrained to vote to reverse the district court's denial of qualified immunity to Brooks, Sambor, and Richmond, and to affirm the district court insofar as it granted the other defendants qualified immunity. In my view what it gets down to, after years of litigation, is uncomplicated: the plaintiffs have no federal case against any defendant by reason of any injury Ramona Africa may have suffered or by reason of the deaths of John and Frank Africa because there was no seizure. The determinative legal issue is as simple as that.\n\nIn reaching this result I take note of Fagan v. City of Vineland, 22 F.3d 1296, 1305 n.5. (3d Cir. 1994) (in banc), in which we considered a police pursuit case under the due process clause of the Fourteenth Amendment, and held that if there is not a seizure a substantive due process \"shocks the conscience\" claim may be asserted against the police. See also Carroll v. Borough of State College, 854 F. Supp. at 1192 n.8. In this case, however, I do not consider whether we could undertake a due process clause analysis as the plaintiffs present their cases as involving excessive force under the Fourth Amendment rather than as implicating substantive due process principles. Indeed, in her reply brief, Ramona Africa expressly contested the argument some of the defendants advanced that we should apply the \"shocks the conscience\" test we adopted in Fagan.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nNevertheless, Fagan is significant here for a different reason. Fagan involved a high speed chase resulting in death and injuries both to innocent third parties and to persons in the vehicle the police were pursuing when the pursued vehicle hit a truck. Thus, there can be no doubt that there was in Fagan, in the words of Brower v. County of Inyo, 489 U.S. at 596-97, 109 S. Ct. at 1381, a government caused and desired termination of an individual's freedom of movement. Yet not a single member of our sharply divided in banc court in Fagan suggested that the proper analysis in that case should have centered on the Fourth Amendment protection against unreasonable seizures. Rather, we divided on whether to recover under the substantive due process clause, the plaintiffs had to present proofs satisfying the \"shocks the conscience\" standard or whether \"reckless indifference\" was sufficient. In so defining the issue we were undoubtedly correct because Fagan did not involve, in the words of Brower, \"a governmental termination of freedom of movement through means intentionally applied.\" Id. That Fagan did not involve such a termination is obvious as the police did not intend that the fleeing driver stop his vehicle by colliding with another vehicle. Thus, Fagan differed from Brower because in Brower the police set up the blockade to stop the decedent and it did so. The difference between the cases was so clear that in Fagan we did not even discuss Brower.\n\nI point out the foregoing because if, as is the case, this court unanimously treated the situation in Fagan as not involving a seizure even though the collision was a direct product of the chase, then how could this case possibly involve a seizure? The answer is manifest: there was no seizure here. The city defendants no more intended to burn down the building than the Fagan defendants intended to cause a crash. If we were to hold otherwise we would have to conclude that every member of this court undertook an incomplete analysis in Fagan. While I recognize that the significance of Fagan is somewhat diminished by the circumstance that on appeal the plaintiffs there asserted only due process constitutional contentions, nevertheless we as a panel should give the greatest respect to our recent unanimous in banc analysis in Fagan.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nC. Excessive Force\n\nI will now assume that there was a Fourth Amendment seizure. I nevertheless conclude that the city defendants are entitled to qualified immunity as their acts were reasonable as a matter of law. Judge Scirica joins in this section, \"C. Excessive Force,\" but only for the limited purpose of agreeing that Tennessee v. Garner is inapplicable and that the appropriate inquiry is the reasonableness of the city defendants' acts. He thus disagrees with my Conclusion that the city defendants are not liable for a Fourth Amendment violation on the basis of their acts being reasonable as a matter of law. Nevertheless, I conclude that there was no Fourth Amendment violation and under Siegert v. Gilley, 500 U.S. at 231, 111 S. Ct. at 1793, the defendants are entitled to summary judgment on the federal claims.\n\nAs indicated, the magistrate Judge concluded and the district court agreed, that \"a reasonable person in each of the defendant's positions could have believed that the use of an explosive device . . . was necessary to 'prevent death or serious bodily injury' to the police officers on the scene or other person.\" Africa II, 849 F. Supp. at 337, 357 (citing Tennessee v. Garner). With regard to the fire, the magistrate Judge did not address explicitly the reasonableness of the decision to let the fire consume the bunker but found that \"after the fire had destroyed the roof-top bunker, there remained [no] reasonable basis for the police to believe that allowing the fire to burn was necessary to quell some perceived imminent peril.\" Africa II, 849 F. Supp. at 359. The defendants point out, however, that the record includes no evidence that the officials allowed the fire to burn after it had consumed the bunker. The district court held that letting the fire burn at all, regardless of whether it was intended only to destroy the bunker, as a matter of law, was not \"reasonable as a matter of necessity.\" Africa II, 849 F. Supp. at 340. The court drew this Conclusion from the facts that apparently no MOVE member had been using the bunker offensively after the police dropped the explosive, that Brooks saw no sign of life on the roof except a dog, and that the bunker, \"under Managing Director Brooks' perception, [was] substantially neutralized on the impact of the bomb.\" Id.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Thus, the court stated, \"that it might be convenient to have let the balance of the bunker be consumed by fire is perhaps a tenable view. That it was necessary, in Tennessee v. Garner terms, I can find no basis for concluding.\" Id.\n\nThe district court erred in applying Tennessee v. Garner to require that the use of force be necessary in this case. Just as an application of \"deadly force\" may not result in death, the fact that a seizure results in death does not necessarily mean that \"deadly force\" has been applied. See, e.g., Robinette v. Barnes, 854 F.2d 909, 912-13 (6th Cir. 1988) (holding that \"deadly force\" was not used when police dog attack resulted in death of suspected felon); Ryder v. City of Topeka, 814 F.2d 1412, 1416-17 \u0026 n.11 (10th Cir. 1987) (noting that gunshot which did not kill suspect constitutes \"deadly force\"). For example, the Model Penal Code defines \"deadly force\" as \"force which the actor uses with the purpose of causing or which he knows to create a substantial risk of causing death or serious bodily harm.\" Model Penal Code § 3.11(2) (1994); see also Matthews v. Jones, 35 F.3d 1046, 1050-51 (6th Cir. 1994) (applying Model Penal Code definition to find police dog attack not application of deadly force); Robinette v. Barnes, 854 F.2d at 912-13 (same). In dropping the explosive on the roof and letting the fire consume the bunker, the city defendants did not act with the \"purpose of causing . . . death or serious bodily harm\" to the MOVE members in the house but only with the purpose of destroying the bunker. Nor did they have reason to \"know\" that such actions would \"create a substantial risk of causing death or serious bodily harm.\" Therefore, the district court simply should have asked whether, in light of all the surrounding circumstances, the use of such force was reasonable.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nIn Brower v. County of Inyo, the Supreme Court stated that to have a claim under section 1983, plaintiffs must allege that the seizure was unreasonable, which they did in that case by alleging that the roadblock was set in a way likely to kill the decedent. Id. at 599, 109 S. Ct. at 1382-83. In instructing on how a court should consider the reasonableness of the seizure, the Court said:\n\nThis should be contrasted with the situation that would obtain if the sole claim of unreasonableness were that there was no probable cause for the stop. In that case, if [decedent] had had the opportunity to stop voluntarily at the roadblock, but had negligently or intentionally driven into it, then, because of lack of proximate causality, respondents, though responsible for depriving him of his freedom of movement, would not be liable for his death.\n\nId. (citations omitted).\n\nApplication of the reasonableness standard in a Fourth Amendment seizure case \"requires careful attention to the facts and circumstances of each particular case, including the severity of the crime at issue, whether the suspect poses an immediate threat to the safety of the officers or others, and whether he is actively resisting arrest or attempting to evade arrest by flight.\" Graham v. Connor, 490 U.S. at 396, 109 S. Ct. at 1872.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Moreover, the standard of reasonableness \"must be Judged from the perspective of a reasonable officer on the scene, rather than with the 20/20 vision of hindsight.\" Id. The various officers' and officials' intents and motives are irrelevant. Id. at 397, 109 S. Ct. at 1872. In reviewing the officers' actions, a court should bear in mind that \"great weight is given to his determination and the matter is to be Judged on the facts as they appeared then and not merely in the light of the event.\" Scheuer v. Rhodes, 416 U.S. at 248, 94 S. Ct. at 1692 (quoting Moyer v. Peabody, 212 U.S. 78, 85, 29 S. Ct. 235, 237, 53 L. Ed. 410 (1909)).\n\nI therefore examine first the information possessed by the various officials at the time of the events at issue to determine if their conduct was objectively reasonable. See Anderson v. Creighton, 483 U.S. at 641, 107 S. Ct. at 3040. In this objective reasonableness analysis, I primarily consider the case from the perspective of Brooks, Sambor, and Richmond as they were the supervisory officials on the site. It is fair to say that at the beginning of May 13, 1985, the defendants knew or reasonably believed the following: (1) MOVE had been involved in a prior episode of violence against the police which resulted in a death of a police officer; (2) at least one MOVE member had been seen earlier with a gun; (3) MOVE members had threatened police officers and neighbors with violence and use of guns and explosives; (4) MOVE members may have dug tunnels under their house; and (5) it was likely that MOVE members would resist arrest.\n\nFrom their experiences on the morning of May 13, 1985, it is fair to say that these same defendants knew or reasonably believed the following: (1) certain MOVE members expressed that they would not surrender peacefully and threatened to kill the police officers; (2) certain MOVE members were shooting at the police; (3) some of the gunfire seemed to have come from the bunker atop the roof; (4) efforts at creating holes on the sides of the MOVE house and injecting tear gas into the house were unsuccessful; (5) there were children in the basement of the MOVE house; and (6) MOVE members have made no signs that they were willing to surrender.\n\nIt is simply beyond argument that a reasonable officer on the scene possessing the above information would believe that there were armed and dangerous people inside the MOVE house who posed a serious threat to the life and safety of officers and neighbors, should they escape. Furthermore, although the plaintiffs contend that there had been no gunfire from the MOVE house for hours before the use of the explosive, I believe this fact, if true, would be irrelevant. No reasonable officer would think that the danger finally had subsided and that police officers could come to the house safely and arrest the occupants merely because the MOVE members had held their fire for several hours.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nOf course, it is irrelevant that only a few weapons were found in the rubble afterwards, that Ramona Africa never fired a gun, and that Ramona Africa was not involved in the 1978 confrontation. The first two allegations are not something that any of the officials or officers had any reason to know with any degree of certainty at the time and, in any event, a person with a single weapon can fire a fatal shot. Thus, this case would be no different even if the defendants believed all along that there were only a few weapons in the premises. The allegations regarding Africa's peaceful nature are also irrelevant because even if the defendants were aware of them, they would have been justified in believing that the other persons in the house were armed and dangerous.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e The presence of one peacefully inclined occupant could have in no way impacted on the overall situation.\n\nOnce it was clear that the insertion teams could not complete their mission, and that the MOVE members still were not cooperating, it cannot be said that it was anything but reasonable for the officials to develop alternative ways to proceed in their mission to arrest these dangerous people. Nor can it be said that it was unreasonable for the defendants to choose to attempt to conclude the stand-off, or at least destroy the bunker, by sundown given the higher risks they perceived to be coming with nightfall.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nThe record shows that the defendants had discussed various ways of neutralizing the bunker, which all perceived as a great danger to the officers below, and of effectively inserting tear gas into the house. And when they focused on the option of using a helicopter to drop an explosive on the bunker to neutralize it and to create a hole in the roof, they also discussed the potential for fire and for injury to the people in the house. They believed from their inquiries of Powell, an officer in the Bomb Squad, that these risks were very low. Was this belief reasonable given the fact that at least certain of the defendants had known that there was a possibility, or at least a threat by MOVE, that there was incendiary and/or explosive materials in the house? I cannot say that a reasonable officer could not have held such a belief that the risks were low. First, the defendants were entitled to rely on the statements of Officer Powell regarding the characteristics of the explosive. Second, explosives had been used on the sides of the house in the morning without causing any fires. And third, these officials believed that they had seen muzzle flashes on the roof, which could have led them to believe that a small spark may not be terribly dangerous, especially given the fact that the roof had been well doused with water all day. Thus, I do not think it unreasonable for them to have believed that explosives could be used to eliminate the bunker.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nI believe that the decision to let the fire consume the bunker was not an unreasonable use of force. Barna v. City of Perth Amboy, 42 F.3d 809, 820 (3d Cir. 1994). There is no question that the bunker still was standing after the explosive was deployed. In fact, the explosive missed it altogether. The only basis in the record for the district court's Conclusion that the bunker was \"substantially neutralized on the impact of the bomb,\" appears to derive from Brooks' testimony. Brooks testified that when he told Sambor to put the fire out, he said, \"You've accomplished your mission, put out the fire.\" App. at 1016. That the bunker substantially was neutralized was, as I read the record, solely Brooks' expectation of the effect of the explosive. Brooks testified:\n\nQ. Now, when you say the bomb would neutralize the bunker even if it didn't knock it off, what do you mean?\n\nA. It would be very difficult to stay up there.\n\nQ. Well, did you feel there was any Discussion that if there were any human being inside that bunker, he would be injured or killed to the point or injured to the point that he would not be able to take offensive action?\n\nA. I think so.\n\nApp. at 986. The district court incorrectly concluded from Brooks' statements that the explosion in fact neutralized the bunker.\n\nFurthermore, there is no evidence that either Sambor or Richmond believed the bunker had been neutralized when they agreed to let the fire burn it. Looking from each defendant's position, a court must assess the reasonableness of the actions of Brooks, Sambor, and Richmond based on the information and beliefs they each held at the time. A court must take care not to impute one official's beliefs and information to another official to hold his actions unreasonable in the circumstances. In this case, I see that although Brooks may have thought that the mission was accomplished by the explosion, Sambor and Richmond believed differently. In Brooks' case, then, it may be rational to go on to determine whether letting the fire burn down a seemingly neutralized bunker was reasonable. But a reasonable official in the position of the other officials surely did not have to have this state of mind. Both Sambor and Richmond were on the street when Brooks called them about the fire. They testified that they saw smoke, but no flames. And the bunker still was standing. From Sambor's and Richmond's point of view, the explosive did not neutralize the bunker, thus explaining the need to \"get the bunker.\" There may not have been anyone in the bunker after the explosion, but this was also the case before the explosion. Surely this fact cannot be taken as assurance that no one would emerge soon from inside the house and perhaps resume the offensive position taken in the morning. Indeed, the district court implicitly found, and I concur, that the absence of people on the roof or in the bunker did not render unreasonable the earlier decision to use the explosive to \"get the bunker.\" This same reasoning should apply after the explosion. The bunker, for these two officials, was still as justifiable a target as it was before the explosion.\n\nThus, the question for Sambor and Richmond becomes, if they each believed that the bomb failed to neutralize the bunker, whether it was reasonable for them to let the fire carry out that objective. Again, a court needs to approach this question from the separate position of these two individuals. From Sambor's point of view, he had a confirmation from an experienced fire fighter that the fire could be controlled. He knew that many fire fighters were at hand and ready to \"start the squirts.\" It seems clear that a reasonable police official in Sambor's position could have believed that a controlled fire was a reasonable means to destroy a bunker which still posed a threat.\n\nRichmond's point of view, although he also knew that he had plenty of fire fighters ready to put out the fire at his command, is more problematic.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e It is undisputed that photographs showing cans marked \"gasoline\" on the roof were passed around in a prior meeting of officials at which Richmond was present. However, there is no evidence that any official from either the police department or fire department knew that there was gasoline on the rooftop prior to the disaster on May 13, 1985. Furthermore, Richmond knew on May 13, 1985, that cans marked \"gasoline\" on another MOVE house in Chester, Pennsylvania, actually contained water. Richmond admits, however, that it would have been unreasonable to let the fire burn if he knew there was gasoline on the roof. Given the information possessed by Richmond at the time, including the fact that he was there not to fight any fires that he may see, as would be his normal duties, but to lend support to the police effort, we cannot say that this \"split-second judgment -- in circumstances that are tense, uncertain, and rapidly evolving --\" was not objectively reasonable under the Fourth Amendment. See Graham v. Connor, 490 U.S. at 397, 109 S. Ct. at 1872.\n\nI look at Brooks' situation based on plaintiffs' version of the facts and assume arguendo that he believed the bunker to have been effectively neutralized by the explosive and that he concurred, at least for a time, in the decision to let the fire burn the bunker. Nevertheless, I do not believe that this decision, even taken in this light, would be unreasonable. The objective, it must be remembered, was to destroy the bunker which still was standing and could be reoccupied.\n\nTo summarize, I find that the record does not indicate that there was a Fourth Amendment seizure of the MOVE members, a Conclusion which in itself in my view ends the federal aspects of the case. I further would hold that even if there was a Fourth Amendment seizure, the defendants' decisions to destroy the bunker by dropping the explosive and allowing the fire to burn were not objectively unreasonable under the Fourth Amendment. I thus conclude that the city defendants are entitled to summary judgment on the federal claims.\n\nD. Apparent Lawfulness of the Conduct\n\nI will assume, however, that the defendants did effect a Fourth Amendment seizure, and I will assume further that the seizure was unreasonable. I then inquire whether the city defendants still are entitled to qualified immunity on the basis that they reasonably could have considered their conduct would be lawful. I have no difficulty concluding that they are entitled to such immunity. Judge Scirica comes to the same Conclusion and thus he joins in this section \"D. Apparent Lawfulness of the Conduct,\" of the opinion.\n\nIn Harlow v. Fitzgerald, the Supreme Court held that \"government officials performing discretionary functions generally are shielded from liability for civil damages insofar as their conduct does not violate clearly established statutory or constitutional rights of which a reasonable person would have known.\" 457 U.S. at 818, 102 S. Ct. at 2738 (citations omitted). The Court later explained:\n\nThe contours of the right must be sufficiently clear that a reasonable official would understand that what he is doing violates that right. This is not to say that an official action is protected by qualified immunity unless the very action in question has previously been held unlawful, but it is to say that in the light of pre-existing law the unlawfulness must be apparent.\n\nAnderson v. Creighton, 483 U.S. at 640, 107 S. Ct. at 3039 (citations omitted).\n\nThus, the relevant question here is \"the objective (albeit fact-specific) question whether a reasonable officer could have believed\" the use of the explosive and of the fire to destroy the bunker, based on the information the defendants then possessed, to be reasonable under the Fourth Amendment, that is, \"to be lawful, in light of clearly established law\" as of May 13, 1985. See id.\n\nThis court has interpreted the standard of \"clearly established law\" to require \"some but not precise factual correspondence between relevant precedents and the conduct at issue,\" and that \"although officials need not predict the future course of constitutional law, they are required to relate established law to analogous factual settings.\" Ryan v. Burlington County, 860 F.2d 1199, 1208-09 (3d Cir. 1988), cert. denied, 490 U.S. 1020, 109 S. Ct. 1745, 104 L. Ed. 2d 182 (1989) (quoting People of Three Mile Island v. Nuclear Regulatory Comm'rs, 747 F.2d 139, 144 (3d Cir. 1984)).\n\nThe district court relied and the plaintiffs rely on Tennessee v. Garner, 471 U.S. 1, 105 S. Ct. 1694, 85 L. Ed. 2d 1, and section 508 of the Crimes Code as the \"clearly established law\" which should have been related by the defendants to the factual setting facing them. The defendants argue correctly that violation of state law is in itself not determinative in this section 1983 action. See Brown v. Grabowski, 922 F.2d at 1113. Yet I do not fault the district court for referring to Pennsylvania law, as the court cited that law to show that its violation could be considered in determining the scope of the clearly established constitutional right of an arrestee. Thus, the state law could help define the scope of federal law. And, indeed, the Supreme Court did cite section 508 in developing its constitutional standard.\n\nBut the defendants argue quite persuasively that the district court erred in relying on Tennessee v. Garner. In that case, decided less than two months prior to May 13, 1985, a police officer shot and killed an unarmed teenage burglary suspect to prevent his escape. Tennessee v. Garner, 471 U.S. at 3-4, 105 S. Ct. 1697. The Court held that \"the use of deadly force to prevent the escape of all felony suspects, whatever the circumstances, is constitutionally unreasonable.\" Id. at 11, 105 S. Ct. at 1701. However, \"where the officer has probable cause to believe that the suspect poses a threat of serious physical harm, either to the officer or to others, it is not constitutionally unreasonable to prevent escape by using deadly force.\" Id. The Court concluded that \"if the suspect threatens the officer with a weapon or there is probable cause to believe that he has committed a crime involving the infliction or threatened infliction of serious physical harm, deadly force may be used if necessary to prevent escape, and if, where feasible, some warning has been given.\" Id. at 11-12, 105 S. Ct. at 1701.\n\nI agree with the defendants that Tennessee v. Garner is far from an analogous case. We are concerned here with the use of the explosive and the burning of the bunker to provide a safe means to inject tear gas into a house to arrest the armed and dangerous occupants barricaded inside. There is only a very broad and vague similarity between Tennessee v. Garner and this case: there was use of great force in both in some aspect of the process of effectuating an arrest. As can be expected, extensive research has revealed no case that justly can be deemed analogous.\n\nThis court's cases do not support use of such an attenuated connection as the district court seemed to have done here with its use of Tennessee v. Garner. For example, in Ryan v. Burlington County, 860 F.2d at 1208-09, this court extended the clearly established law regarding rights of inmates to deny qualified immunity to defendants even though prior case did not involve officials in the precise positions held by the defendants. And in Good v. Dauphin County Social Serv., 891 F.2d at 1094-95, this court applied clearly established case law regarding warrantless searches to a case where the novelty was that the search was to prevent child abuse. In Sourbeer v. Robinson, 791 F.2d 1094, 1103-04 (3d Cir. 1986), cert. denied, 483 U.S. 1032, 107 S. Ct. 3276, 97 L. Ed. 2d 779 (1987), this court affirmed the district court's reliance on clearly established law regarding the due process rights of sentenced inmates to hold that defendants were on notice as to similar rights of an unsentenced inmate. In Bennis v. Gable, 823 F.2d 723, 733 (3d Cir. 1987), this court applied the clearly established law that prohibited dismissal of public employees in retaliation for political speech or association to a case where the employee was demoted. Similarly, in Burns v. County of Cambria, 971 F.2d 1015, 1024-25 (3d Cir. 1992), cert. denied, 113 S. Ct. 1049 (1993), this court applied that same law to the dismissal of deputy sheriffs in particular.\n\nAt the defendants' behest, both the district court and the magistrate Judge examined Ginter v. Stallcup, 641 F. Supp. 939 (E.D. Ark. 1986), as a possible factual precedent. That case involved an effort by local police officers and FBI agents to capture a fugitive charged with murder who was hiding in a residence and apparently was firing at the officers with automatic weapons. The officers introduced tear gas and diesel fuel into a vent on the roof of the house and set fire to it. The district court concluded that there was no \"clearly established law\" prior to the event that would hold that \"the use of fire to 'burn out' a fugitive would violate the constitutional rights of the fugitive.\" Id. at 953. On appeal, the Court of Appeals for the Sixth Circuit upheld the grant of qualified immunity to the two defendant officers with respect to the claim of unnecessary destruction of property, on the basis that unless the officers knew of the fugitive's death before the fire, they had not been shown to have acted unreasonably in setting the fire. Ginter v. Stallcup, 869 F.2d 384, 389 (8th Cir. 1989).\n\nBut Ginter v. Stallcup, as the district court in this case pointed out, was decided in 1986, though it involved an event that took place in June 1983, which was before the MOVE episode. In these circumstances, Ginter v. Stallcup could not possibly be used to demonstrate clearly established law as of May 13, 1985. Furthermore, as the magistrate Judge noted, Ginter v. Stallcup involved \"a handful of police officers [who] had to take immediate action against an armed murderer\" as opposed to the situation here, where \"the police presence . . . was on a massive and well-equipped scale.\" Id. at 360. While Ginter v. Stallcup is easily distinguishable, the fact that it is as factually close a case as anyone can find offers some insight for our inquiry as to whether the alleged unlawfulness here was \"apparent.\"\n\nNevertheless, I recognize that in certain instances the alleged act is so obviously wrongful that all reasonable officials would consider it unlawful, regardless of whether the act itself was addressed by case law. For example, in Stoneking v. Bradford Area Sch. Dist., 882 F.2d 720 (3d Cir. 1989), public schools officials were sued for allegedly condoning two teachers' acts of sexual misconduct against students. This court did not require that there be an analogous case in which sexual abuse of a student or the allowing of such abuse was held to have violated the student's constitutional rights. Rather, it \"seemed ludicrous to be obliged to consider whether it was 'clearly established' that it was impermissible for school teachers and staff to sexually molest students.\" Id. at 726-27. In other words, the alleged act of condoning sexual misconduct by teachers against students so clearly violated the student's constitutional rights that the unlawfulness of this act was apparent, even in the absence of an analogous case. The Stoneking approach sensibly precludes an official from obtaining summary judgment if he acts in a way that no other official has acted because other officials recognize the acts to be clearly unlawful. Of course, that approach has no place in this case.\n\nOverall, it is clear that even if somehow a court found that there was an unreasonable seizure in this case, it could not possibly say, in the words of Anderson v. Creighton, \"that in the light of pre-existing law the unlawfulness\" of either dropping the explosive or letting the fire burn should have been apparent. 483 U.S. at 640, 107 S. Ct. at 3039. The 1985 MOVE confrontation was unprecedented in the case law. The exceptional circumstances here constitute precisely the kind of situation that requires the firm and swift official action which must be shielded by qualified immunity. I conclude that there was no clearly established law as of May 13, 1985, which would have required the officials to choose an alternative approach to execute the warrants. Thus, as Judge Scirica joins in this section of the opinion the city defendants, meaning the individual defendants, are entitled to qualified immunity on the federal claims.\n\nV. LIABILITY OF THE CITY\n\nThe district court concluded that Brooks' concurrence in the decision to let the bunker burn means that the city is suable under section 1983. Alternatively, even if Brooks did not concur, the district court found that decisions made by Sambor or Richmond were sufficient so that the city could be held liable. Because I would hold that the city defendants are entitled to summary judgment on the federal claims on the grounds that their actions did not amount to constitutional violations, as there was no seizure at all, I would hold that the city also is entitled to summary judgment on the federal claims. Monell v. New York City Dept. of Social Servs., 436 U.S. 658, 691, 98 S. Ct. 2018, 2036, 56 L. Ed. 2d 611 (1978) (municipalities cannot be held liable under section 1983 \"unless action pursuant to official municipal policy of some nature caused a constitutional tort\"); Kentucky v. Graham, 473 U.S. 159, 171, 105 S. Ct. 3099, 3108, 87 L. Ed. 2d 114 (1985) (plaintiffs who did not prevail in official-capacity action was not \"entitled to look for relief, both on the merits and for fees, to the governmental entity\"). While this court indicated in Fagan v. City of Vineland, 22 F.3d 1283, 1291-94 (3d Cir. 1994), that in some circumstances a city may be liable even though its officers are not liable, I see no basis here to impose independent liability on the city. See City of Los Angeles v. Heller, 475 U.S. 796, 799, 106 S. Ct. 1571, 1573, 89 L. Ed. 2d 806 (1986). Judges Scirica and Lewis disagree with this Conclusion for the reasons they express and thus we will affirm the order denying the city summary judgment.\n\nVI. GRANT OF SUMMARY JUDGMENT IN FAVOR OF GOODE, POWELL, AND KLEIN AS TO THE STATE LAW CLAIMS\n\nIn light of the Conclusions Judge Scirica and I have reached with respect to qualified immunity and in light of the reasons Judge Scirica is setting forth separately, we will affirm the judgments in favor of Goode, Powell, and Klein on the state law claims. The magistrate Judge explained, and the district court summarily agreed, that as employees of the city, officials are entitled to statutory immunity unless \"it is judicially determined that the act of the employee caused the injury and that such act constituted a crime, actual fraud, actual malice or willful misconduct.\" 42 Pa. Cons. Stat. Ann. § 8550 (1982). I agree as well. Thus, in my view the finding that the dropping of the explosive was lawful establishes that Goode, Powell, and Klein did not lose their immunity under this section.\n\nVII. CONCLUSION\n\nI cannot conclude our opinion without an overview of the matter. In retrospect, there can be no doubt that the defendants' actions had tragic consequences. Yet there is not the slightest doubt that it was MOVE and not the defendants who put the forces in motion which created the tragedy for the MOVE members placed the defendants in an impossible situation. Because of their obvious contempt for the orderly implementation of the judicial process, they forced the defendants to undertake a military-type operation. In a country operating under an organized legal system the response of a person confronted with an arrest warrant must be to surrender. Unfortunately the occupants of the MOVE house did not recognize this obvious truth. Finally, I point out that the courts must recognize that in certain instances the civil authorities are required to take strong steps to enforce the law and maintain public order. The Constitution does not preclude these steps.\n\nIn view of the Conclusions I have set forth and in my view of the Conclusions set forth by Judge Scirica and Judge Lewis, the orders for summary judgment with respect to all claims in favor of defendants Goode, Powell, and Klein will be affirmed. The orders denying summary judgment with respect to all federal claims in favor of Brooks, Sambor, and Richmond, will be reversed and on remand the district court should enter summary judgment in their favor on those claims. The order denying the city summary judgment will be affirmed but on the further proceedings on remand the district court shall consider the claims against the city in accordance with the reasonableness standard Judge Scirica and I have adopted. We note that the district court granted the city partial summary judgment with respect to the dropping of the bomb and that no appeal from that order is pending. Nevertheless, the rationale adopted by Judge Scirica and Judge Lewis leads to the Conclusion that the city was not entitled to summary judgment on that point. Thus, while we do not disturb that unappealed summary judgment, we observe that the plaintiffs might want to seek relief from it in the district court under Fed. R. Civ. P. 54(b) or Fed. R. Civ. P. 60(b)(6). The appeals by Brooks, Sambor, and Richmond from the denial of summary judgment on immunity grounds on the state law claims will be dismissed for lack of jurisdiction as will James' appeal from the order of the district court granting the city summary judgment on her uncompensated property damage claim. We will remand the matter for further proceedings consistent with this opinion and for Disposition of the remaining claims. The parties will bear their own costs on this appeal.\n\nSCIRICA, Circuit Judge, Concurring and Dissenting.\n\nI agree with Judge Greenberg that all individual defendants are entitled to qualified immunity. Although I agree that the proper analysis on the use of excessive force in effecting an arrest is found in Graham v. Connor, 490 U.S. 386, 395, 104 L. Ed. 2d 443, 109 S. Ct. 1865 (1989), rather than in Tennessee v. Garner, 471 U.S. 1, 11, 85 L. Ed. 2d 1, 105 S. Ct. 1694 (1984),\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e I do not believe that as a matter of law no reasonable jury could conclude that the decision to employ the incendiary device was an excessive use of force.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Accordingly, with Judge Lewis, I hold that the federal claims asserting an unconstitutional seizure in violation of the Fourth Amendment against the City of Philadelphia survive summary judgment and may proceed to trial.\n\nFurthermore, I would hold that we may consider an interlocutory appeal of the denial of state immunity when the state immunity question is bound up with federal qualified immunity and that the individual defendants are entitled to summary judgment on the state claims because the officials' conduct did not rise to the level of willful misconduct.\n\nI.\n\nI believe there was a seizure under the Fourth Amendment. The Osage Avenue house was occupied by the subjects of the arrest warrant and the officials used force with the aim of gaining entry into the house or forcing the occupants out. The incendiary device was \"the very instrumentality set in motion or put in place in order to achieve that result.\" Brower v. County of Inyo, 489 U.S. 593, 599, 103 L. Ed. 2d 628, 109 S. Ct. 1378 (1989). In Brower, the Court noted that a Fourth Amendment seizure does not occur when the effect of seizure is purely fortuitous.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e But the Court cautioned that we cannot say there was not a seizure when an individual is \"stopped by the accidental discharge of a gun with which he was meant only to be bludgeoned, or by a bullet in the heart that was meant only for the leg.\" Id. at 598-99. Thus, our inquiry is not whether the officials intended all the consequences of their use of the incendiary device, but whether they intended to use force to arrest these individuals. I conclude that they did, and because the MOVE members were harmed by the fire caused by the incendiary device, \"the very instrumentality set in motion or put in place in order to\" arrest the occupants of the house, I find a Fourth Amendment seizure. Id. at 599.\n\nII.\n\nI do not believe that we can say, as a matter of law, that no reasonable jury could conclude that the decision to use the incendiary device was an excessive use of force. Both the reasonableness of the decision to end the confrontation before nightfall rather than allow the stand-off to continue and the reasonableness of the choice of means to end the stand-off -eliminating the bunker with an incendiary device -- are questions of fact.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Also, the reasonableness of the officials' views of the threat of the bunker after the incendiary device was dropped and the reasonableness of their decision to let the fire burn the bunker are questions of fact. Accordingly, I find summary judgment is inappropriate on the question of whether the plaintiffs' Fourth Amendment rights were violated by an unreasonably excessive use of force. Of course, as stated, I believe all individual defendants are entitled to qualified immunity.\n\nIII.\n\nBecause I cannot say, as a matter of law, that there has been no Fourth Amendment violation, Monell v. Department of Social Services, 436 U.S. 658, 691, 56 L. Ed. 2d 611, 98 S. Ct. 2018 (1978), does not relieve the city of liability. Under City of St. Louis v. Praprotnik, 485 U.S. 112, 127, 99 L. Ed. 2d 107, 108 S. Ct. 915 (1988), and Pembaur v. City of Cincinnati, 475 U.S. 469, 481, 89 L. Ed. 2d 452, 106 S. Ct. 1292 (1986), we must consider whether the acts of the municipal officers may be attributed to the city. I believe that their actions meet the standards outlined in those cases, and I hold the city responsible for the acts of these officials. Furthermore, under Owen v. City of Independence, 445 U.S. 622, 650, 63 L. Ed. 2d 673, 100 S. Ct. 1398 (1980), the city does not have qualified immunity from liability even if it can show that the officials themselves are entitled to immunity from personal liability under § 1983.\n\nIV.\n\nUnder the facts here, I believe we may consider an appeal of the district court's denial of a claim of state immunity. In Brown v. Grabowski, 922 F.2d 1097, 1109 (3d Cir. 1990), cert. denied, 501 U.S. 1218 (1991), we concluded that a denial of a claim of qualified immunity premised upon New Jersey state law was not appealable. But in Brown we conducted a three-step inquiry: First we looked to the statute, then we looked to interpretations of that statute by the state's courts, and finally we looked to see whether the state disfavored interlocutory appeals. In Brown, after reviewing the statute and case law, we believed the appealability issue could go either way. But because New Jersey had a policy strongly disfavoring interlocutory appeals, we dismissed for lack of jurisdiction. Applying the same analysis here, I would reach the opposite Conclusion.\n\nI agree that the language of Pennsylvania's Political Subdivision Tort Claims Act does not contemplate immunity from suit but only immunity from liability. But that is not necessarily dispositive. My reading of Brown is that when there are issues of federal immunity along with issues of state immunity, we are required to take a closer look at a state's approach to immunity. In Pennsylvania, that closer look embraces Lancie v. Giles, 132 Pa. Commw. 255, 572 A.2d 827, 829 n.3 (Pa. Commw. Ct. 1990). Lancie noted that the United States Supreme Court's emphasis on the appealability of summary judgments denying federal qualified immunity makes the issue of appealability of denials of state statutory immunity more difficult when cases also involve issues of federal immunity. The Pennsylvania Supreme Court has not addressed this question, but in the absence of guidance from the state supreme court, we should look to decisions from the lower state courts. See Wisniewski v. Johns-Manville Corp., 759 F.2d 271, 273-74 (3d Cir. 1985) (\"Although lower state court decisions are not controlling on an issue on which the highest court of the state has not spoken, federal courts must attribute significant weight to these decisions in the absence of any indication that the highest state court would rule otherwise.\"). I believe this signal from Lancie is strong enough to tip the balance in favor of hearing the interlocutory appeal of the denial of summary judgment on the state law immunity claims.\n\nI also would grant summary judgment on the state immunity question because, as a matter of law, the individual defendants' conduct did not rise to the level of willful misconduct.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e Pennsylvania's Political Subdivision Tort Claims Act denies immunity to an employee of a local agency when the employee's action constituted \"a crime, actual fraud, actual malice or willful misconduct.\" 42 Pa. Cons. Stat. § 8550 (1990). Pennsylvania courts have defined \"willful misconduct\" to mean \"conduct whereby the actor desired to bring about the result that followed or at least was aware that it was substantially certain to follow, so that such desire can be implied.\" King v. Breach, 115 Pa. Commw. 355, 540 A.2d 976, 981 (Pa. Commw. Ct. 1988) (citing Evans v. Philadelphia Transp. Co., 418 Pa. 567, 212 A.2d 440 (Pa. 1965)).\n\nRecently, in Renk v. City of Pittsburgh, 641 A.2d 289, 294 (Pa. 1994), the Pennsylvania Supreme Court rejected the City of Pittsburgh's exclusive reliance on a jury finding in a federal action that an officer was liable for using excessive force to establish willful misconduct. This indicates that the Pennsylvania Supreme Court requires a higher standard than excessive force for finding willful misconduct sufficient to defeat immunity under the Tort Claims Act. Furthermore, I believe the statement in Lancie about the difficulty created by differing state and federal standards on immunity signals that Pennsylvania will defer to the federal standard and deny immunity only where the actor had reason to know that his actions violated clearly established rights.\n\nV.\n\nExcept as otherwise noted, I join Judge Greenberg's holdings, even though I do not agree with every detail of his opinion.\n\nLEWIS, Circuit Judge, Concurring and Dissenting.\n\nI join in Parts II and III of Judge Greenberg's opinion and in Part I (Factual Background) insofar as it recounts the undisputed facts as revealed and supported by the record. For the reasons I discuss below, however, I do not join in Parts IV through VII of Judge Greenberg's opinion.\n\nI.\n\nI begin by setting forth my agreement with Judge Scirica that no distinction should be drawn between the decision to drop the incendiary device and the decision to let the fire burn. As Judge Scirica observes, both actions were undertaken to effect the same result, namely, to enable the police to insert tear gas into the house in order to force the MOVE occupants out. I also agree with Judge Scirica, for the reasons stated in his Concurring and Dissenting opinion, that the police effected a Fourth Amendment seizure in this case.\n\nFinally, I join Judge Scirica in holding that the federal claims asserting an unconstitutional seizure in violation of the Fourth Amendment against the City of Philadelphia survive summary judgment and may proceed to trial. However, I do not agree with either Judge Scirica or Judge Greenberg that Graham v. Connor, 490 U.S. 386, 104 L. Ed. 2d 443, 109 S. Ct. 1865 (1989), provides the proper analytic framework for assessing the constitutionality of the use of force in this case. Instead, it is plain to me that Tennessee v. Garner, 471 U.S. 1, 85 L. Ed. 2d 1, 105 S. Ct. 1694 (1985), provides the proper test.\n\nII.\n\nTHE MAJORITY'S ERRONEOUS CONCLUSION AS TO THE APPLICABLE STANDARD\n\nJudge Greenberg concludes that the city defendants' use of the incendiary device and ensuing fire to effect the seizure of the MOVE occupants did not constitute deadly force. While Judge Scirica acknowledges that deadly force may have been used against the MOVE members, he believes that Garner is limited by its facts and distinguishable from the confrontation here. See Judge Scirica's Concurring and Dissenting opinion Typescript at 1 n.1. Thus, the majority concludes that the district court erred in applying Garner, a case involving the use of deadly force, to assess the constitutionality of the use of force against MOVE. Instead, the majority holds that the district court should have applied the reasonableness test described in Graham, a case involving the use of non-deadly force, to test the constitutionality of the use of force in this case. In so holding, I believe Judge Greenberg misapprehends the nature of the force contained in the incendiary device and the ensuing roof-top fire, and I believe that Judge Scirica overly limits Garner 's reach.\n\nA.\n\nThe force embodied in the incendiary device and in the fire was, by any sensible standard, \"deadly\" force. It should not escape our attention that the destructive device in question was a bomb capable of blasting a hole in the roof of a city building. This lethal device could and did accomplish a degree of destruction well beyond that which even bullets fired from a high-powered weapon could achieve. To me, this constitutes deadly force, for I cannot imagine how anyone can conclude that a device such as this was not capable of taking human life -- which, in fact, it ultimately did. Contrary to the Conclusion drawn by the majority, I believe the city defendants, who were professional law enforcement and fire-fighting personnel, had every reason to know that their actions created a substantial risk of death or serious bodily injury to the MOVE members residing at 6221 Osage Avenue. See Model Penal Code § 3.11(2) (defining \"deadly force\" as \"force which the actor uses with the purpose of causing or which he [or she] knows to create a substantial risk of causing death or serious bodily harm\") (emphasis supplied).\n\nMoreover, I would conclude that the dropping of the explosive device would have constituted the use of deadly force even had no fire ensued as a result of this act. The intention of the defendant officials in dropping the explosive device was to blast the bunker from atop the roof. This intention must be considered in light of the fact that the defendant officials had no way of knowing whether the bunker was occupied at the time the explosive device was deployed. The only viable Conclusion, given the bomb's purpose and the reasonable (and unexplored) possibility that the bunker was occupied at the time the bomb was dropped, is that in dropping the explosive device, the defendant officials knew that they were creating a substantial risk of causing death or serious bodily harm. Had the defendant officials' objective to blast the bunker from the roof been fulfilled, and had the bunker been occupied at the moment of impact, the bunker's occupant or occupants would have been forcibly thrown from the roof of 6221 Osage to the street below. The substantiality of the risk of death or serious bodily injury from such a fall is self-evident and beyond debate.\n\nIn light of reason, experience and the applicable standard, I could not disagree more strenuously with Judge Greenberg's Conclusion that in dropping the explosive device onto the roof of an occupied building and in letting a fire spread upon that occupied building's roof, the city defendants did not use deadly force. In addition, and putting aside the fact that a fire ensued, I cannot accept Judge Greenberg's Conclusion that in dropping the device to blast the bunker off of the roof, city officials did not know they were creating a substantial risk of death or serious bodily harm.\n\nB.\n\nThe majority concludes that Garner is inapplicable and that \"the appropriate inquiry is the reasonableness of the city defendants' acts.\" Maj. Op. Typescript at 52. I am perplexed by this Conclusion, for in reaching its holding regarding the constitutionality of deadly force used in the course of an arrest, the Supreme Court in Garner applied and relied upon the reasonableness test embodied in the Fourth Amendment. See Garner, 471 U.S. at 7-12 (\"there can be no question that apprehension by the use of deadly force is a seizure subject to the reasonableness requirement of the Fourth Amendment\").\n\nThe majority implies that Garner and Graham are incompatible cases. In fact, Garner and Graham are complementary cases. As the district court noted, the Supreme Court in Garner for the first time analyzed within the reasonableness framework of the Fourth Amendment an excessive force claim arising in the context of an arrest. See Africa v. City of Philadelphia, 809 F. Supp. 375, 379 (E.D. Pa. 1992) (explaining that prior to Garner, excessive force claims were analyzed under the \"shocks the conscience\" standard). In doing so, the Court squarely addressed the very issue we confront here, namely, the constitutionality of the use of deadly force by law enforcement officials in the course of an arrest. In Graham, the Court merely \"made explicit what was implicit in Garner 's analysis,\" by holding that \"all claims that law enforcement officers have used excessive force -- deadly or not -- in the course of an arrest . . . should be analyzed under the Fourth Amendment and its 'reasonableness' standard . . . .\" Graham, 490 U.S. at 395 (emphasis in original). The Court then proceeded to apply the reasonableness test to the use of non-deadly force, as it had already done with regard to the use of deadly force in Garner.\n\nTaken together, then, Garner and Graham establish the following set of complementary principles: (1) the reasonableness test under the Fourth Amendment is to be used when assessing the constitutionality of police employment of force in the context of an arrest; (2) when the force employed constitutes \"deadly force,\" the constitutionality of its use is to be determined according to the reasonableness test set forth in Garner, and such force is deemed unreasonable unless it is \"necessary to prevent the [suspect's] escape and the officer has probable cause to believe that the suspect poses a significant threat of death or serious physical injury to the officer or others[,]\" Garner, 471 U.S. at 3; and (3) when the force employed is non-deadly, the constitutionality of its use is to be assessed according to the factors enumerated in Graham. Thus, while Garner and Graham do establish a complementary set of principles, Garner is appropriately applied to situations, such as this one, involving the use of deadly force, whereas Graham speaks to and controls situations involving the use of non-deadly force. They share a focus upon the use of excessive force, but it is the nature and degree of that excessive force which dictates their respective applications.\n\nAccordingly, while I agree with Judge Scirica that as a matter of law, a reasonable jury could, under Graham, conclude that the decision to employ the incendiary device was an excessive use of force, because I believe that this case involves the use of deadly force, and in light of my understanding of the relationship between Garner and Graham, I think the proper test for determining the constitutionality of the use of force in this case is found in Garner, and not in Graham.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nOur disagreement as to applicable test is not without considerable significance. As should be clear, if Graham is the appropriate standard by which to determine the constitutionality of the use of force here, then general reasonableness factors would guide a jury's determination as to whether excessive force was used. By stark contrast, Garner would not invite a jury to be guided by the more flexible general reasonableness standard. Garner imposes a stricter standard governing police conduct and the use of excessive force -- and with good reason, since the intrusiveness of deadly force is qualitatively distinct from all other forms of excessive force. Accordingly, Garner defines and explains the reasonableness of the excessive force to which it is addressed -- deadly force -- in narrower terms. In other words, while the reasonableness inquiry is a common component with regard to both standards, that inquiry is, and should be, more precise and exacting when deadly force has been used. Thus, if Garner were applied, a jury would be asked more pointedly to determine whether the deadly force employed was reasonable because it was necessary to prevent the escape of suspects believed to pose a significant threat of death or serious physical injury to the police or others. It is this test, and not the more lenient Graham standard, by which the propriety of the law enforcement officers' decisions in this case should be gauged. And, as I have already indicated, I believe that under Garner only one reasonable Conclusion can be reached here: the city defendants used excessive force.\n\nIII.\n\nTHE MAJORITY'S ERRONEOUS CONCLUSION AS TO THE APPLICABILITY OF QUALIFIED IMMUNITY\n\nThe majority states that it has no difficulty concluding that the individual defendants are entitled to qualified immunity because they reasonably could have considered their conduct to be lawful. Maj. Op. Typescript at 66. I disagree. I would hold that the individual defendants are not entitled to qualified immunity. Further, I believe that the source of the majority's error here flows directly from its misunderstanding and misapplication of our construction of the term \"clearly established law,\" in the wake of the Supreme Court's decision in Harlow v. Fitzgerald, 457 U.S. 800, 73 L. Ed. 2d 396, 102 S. Ct. 2727 (1981), which first articulated that standard.\n\nAs the majority correctly observes, the relevant question here is whether a reasonable officer, possessing the same information as did the defendants, could have believed that the use of the incendiary device and fire to destroy the bunker was reasonable under the Fourth Amendment, that is, \"lawful, in light of clearly established law\" as of May 13, 1985. See Anderson v. Creighton, 483 U.S. 635, 640, 97 L. Ed. 2d 523, 107 S. Ct. 3034 (1987). Accordingly, our task is to determine what the \"clearly established law\" governing the defendants' actions was on that date. The majority argues that there was no clearly-established law on the date in question which would have required the officials to choose an alternative approach to executing the warrants. Maj. Op. Typescript at 73. In failing to grasp the breadth of the \"clearly established law\" standard, and in thus failing, once again, to recognize the applicability of Tennessee v. Garner to the events in question, the majority has erred.\n\nAs I have already noted, in Garner, which admittedly was decided a mere 48 days prior to the events in question,\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e the Supreme Court held that where an arresting officer has probable cause to believe that the suspect poses a threat of death or serious physical harm, either to the officer or to others, it is not constitutionally unreasonable to prevent escape by using deadly force. Garner, 471 U.S. at 11.\n\nThus, if the suspect threatens the officer with a weapon or there is probable cause to believe that he [or she] has committed a crime involving the infliction or threatened infliction of serious physical harm, deadly force may be used if necessary to prevent escape, and if, where feasible, some warning has been given.\n\nGarner, 471 U.S. at 11-12.\n\nIn concluding that Garner bears an insufficient factual correspondence to be deemed the \"clearly established law\" applicable to this case, the majority runs counter to our traditional broad application of Harlow v. Fitzgerald 's \"clearly established law\" standard. See, e.g., People of Three Mile Island v. Nuclear Reg. Comm'rs, 747 F.2d 139, 144-45 (3d Cir. 1984); Stoneking v. Bradford Area School District, 882 F.2d 720, 726 (3d Cir. 1989). Although we have recognized that we cannot expect executive officials to anticipate the evolution of constitutional law, we do demand that they apply general, well-developed legal principles in analogous factual settings, i.e., in settings bearing some, but not necessarily precise, factual correlation to the applicable precedent. See People of Three Mile Island, 747 F.2d at 144.\n\nYet the situation we face here is identical to the situation the Supreme Court confronted in Garner : a case of police use of deadly force in carrying out a seizure of a person or persons actively resisting arrest. Even in their particulars, Garner and our case are compellingly analogous. Obviously, this case involves the use of deadly force against a group of armed and dangerous adults barricaded inside a house, while Garner involved the use of deadly force against an unarmed teenager who was running from the police. However, it bears emphasizing that in our case several hours had elapsed between the cessation of gunfire from within the MOVE dwelling and the dropping of the incendiary device by the police. Like Garner, the police simply were not facing a \"shoot or be shot\" (or a \"drop bomb or be shot\") situation at the moment the bomb was dropped. Indeed, this case is easier than Garner. In Garner, the Court determined that seizure by deadly force of a fleeing suspect was not worth the costs: it was better to let the suspect escape. Garner, 471 U.S. at 11. In our case, the suspects were not even fleeing. At the time the destructive device was deployed, the MOVE contingent (including several children) was not only barricaded inside a house, but was also surrounded and greatly outnumbered by well-equipped law enforcement personnel. Thus, unlike Garner, escape here was not even a reasonable or realistic possibility. As the Court in Garner recognized, \"if subsequent arrest [is] assured, no one would argue the use of deadly force was justified.\" Garner, 471 U.S. at 9 n.8.\n\nBased upon these considerations, I would hold that reasonable officials in the defendants' position at the relevant time could not have believed, in light of Garner, that their conduct would be lawful.\n\nEven where the officials in question should have been aware of the \"clearly established\" governing law, we have explained that executive officials are still entitled to qualified immunity \"if based on the information available to them they could have believed their conduct would be consistent\" with that clearly established law. See Good, 891 F.2d at 1092. However, I believe it would have been readily apparent to any reasonable official who possessed the same information as did the individual defendants on May 13, 1985, that at the time the explosive device was dropped, deadly force was not necessary to prevent the escape of the occupants of 6221 Osage Avenue.\n\nSupport for the counter-argument, so far as I can gather, is summed up by the majority in the following factors: (1) nightfall would render securing the neighborhood too difficult; (2) fatigue was setting in among the police personnel who had been on duty since the night before; and (3) certain members of the police appear to have believed that tunnels had been dug from the basement of the MOVE house. See Maj. Op. Typescript at 13. With respect to the nightfall factor, the entire block, including 6221 Osage Avenue, could have been illuminated artificially as are highway projects regularly. One can counter that these lights could then have been shot out by MOVE members. But I think a modicum of police ingenuity could have seen to it that the lights were placed at angles rendering them unsusceptible to gunfire. With respect to police fatigue, this, one presumes, could reasonably have been counteracted by the replacement of tired officers with fresh personnel.\n\nAnd finally, with regard to the rumored tunnels, support in the record for a reasonable belief in the existence of escape tunnels is flimsy at best. The majority suggests that the defendants believed that MOVE members might have eluded capture through escape tunnels rumored to have been dug under the neighborhood. I would agree that had the defendants reasonably believed that MOVE had constructed escape tunnels underneath the neighborhood, the dropping of an explosive device might reasonably have been perceived as necessary to prevent the escape of the MOVE members under cover of the coming night. However, the record as I read it does not support the view that the defendants actually believed that MOVE had constructed escape tunnels under the neighborhood; at most, it merely suggests a belief, based upon a statement that fifteen bushels of dirt had been deposited by MOVE members on a curb for disposal, that the MOVE members might have dug a tunnel to a neighboring house. First of all, digging an escape tunnel to a neighboring house is different from digging an escape tunnel \"under the neighborhood\" to some unknown outlet. But more importantly, even if the record supported the existence of such a belief, I would have no difficulty in concluding that it was unreasonable, indeed, far-fetched, in light of the evidence before us. It is fantasy to believe that fifteen bushels of dirt, even to a neighboring house, an escape tunnel makes.\n\nThus, I would hold that the individual defendants are not entitled to qualified immunity even when the factual information available to them on May 13, 1985, is taken into consideration.\n\nIV.\n\nSince I would hold that none of the individual defendants are entitled to qualified immunity in relation to the section 1983 claims against them, I would reverse the grant of summary judgment in favor of Goode, Powell and Klein as to the state law claims against these defendants.\n\nV.\n\nJudge Greenberg observes that in reaching my Conclusion that the individual defendants used excessive force, I offer \"no explanation of what alternatives were available,\" and am \"apparently . . . willing to have mandated an indefinite standoff.\" See Maj. Op. Typescript at 61 n.23. This is in part true and largely irrelevant. It is certainly true that I am willing to \"mandate\" that which is reasonable and lawful. An \"indefinite standoff,\" among other options, qualifies. But it is not our primary purpose here to provide alternatives to unlawful police action. Instead, we are to evaluate the lawfulness of what did occur on May 13, 1985. We should only countenance the lawful resolution of that unfortunate incident. Thus, the larger point here is that Judge Greenberg, and to a lesser extent, Judge Scirica and I simply disagree, based upon our understanding of the record and the law, as to whether the dropping of the incendiary device was lawful.\n\nIn concluding that the defendant officials in this case used excessive force, I do not mean to imply that situations law enforcement officers confront daily are not fraught with difficulty and do not frequently require split-second decisions involving matters of life and death. To the contrary, law enforcement officers are forced to digest a steady diet of some of the most impossible choices under some of the most pressing circumstances and unforgiving conditions. We should, of course, be concerned for and sensitive to their fundamental mission, which is to ensure the protection and preservation of society.\n\nBut this, too, must be said: it is hardly debatable in a civilized constitutional democracy that in the final analysis, the goal of the enforcement of law, and thus, the maintenance of public order, is not promoted through the use of deadly force in effecting seizures. As the Supreme Court has observed, the use of deadly force, in fact, frustrates the interest in enforcement of law through fair and objective judicial determination of guilt and punishment. Garner, 471 U.S. at 9. It is partly because the use of deadly force \"is a self-defeating way of apprehending a suspect and so setting the criminal Justice mechanism in motion\" that the Constitution, as interpreted by the Supreme Court, so narrowly circumscribes its use. See Garner, 471 U.S. at 10.\n\nThe majority in Part VII states that \"courts must recognize that in certain instances the civil authorities are required to take strong steps to enforce the law and maintain public order[,]\" and that \"the Constitution does not preclude these steps.\" Maj. Op. Typescript at 75. The danger inherent in this statement, which the majority appears to adopt as a precept of constitutional jurisprudence, lies in its breadth. I am deeply troubled by the necessary implication of the majority's statement, which is that the Constitution does not preclude that which is perceived as necessary or expedient to enforce the law and maintain public order. I hold a different view. I believe it to be beyond dispute that the Constitution precludes many acts which might, even reasonably, be deemed \"necessary\" for the enforcement of law and the maintenance of public order. In determining what it does and does not preclude, we cannot engraft upon the Constitution our own predilections as to what that document, as a matter of perceived social necessity, ought or ought not permit law enforcement officials to do in the name of law and order.\n\nConclusion\n\nFor the above reasons, I respectfully concur and Dissent.\n\n\u003cspan class=\"fn\"\u003e1. For simplicity and convenience, we will address these officials by the titles they held during the 1985 conflict even though they may no longer hold such titles. The Commonwealth of Pennsylvania and certain of its officials and employees also have been parties to this litigation but they are not involved in these appeals.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Ramona Africa denies having any knowledge of the letter, see app. at 1360, but she does not deny that the police received the letter prior to the day of confrontation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. There is a dispute as to whether Mayor Goode knew that the plan was to drop the explosive from a helicopter, but this is not germane to my Discussion because he knew and approved of dropping the explosive onto the bunker.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Leaphart also asserted a claim under the Fifth Amendment but I do not deal separately with that claim inasmuch as the Supreme Court indicated in Graham v. Connor, 490 U.S. 386, 109 S. Ct. 1865, 104 L. Ed. 2d 443 (1989), that excessive force claims should be considered under the Fourth Amendment. I discuss this point later.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The Supreme Court cited the Pennsylvania Crimes Code in Tennessee v. Garner, 471 U.S. at 17 n.18, 105 S. Ct. at 1704 n.18, in developing the Court's constitutional standard. Section 508 states, in relevant part: (1) A peace officer, or any person whom he has summoned or directed to assist him, need not retreat or desist from efforts to make a lawful arrest because of resistance or threatened resistance to the arrest. He is justified in the use of any force which he believes to be necessary to effect the arrest and of any force which he believes to be necessary to defend himself or another from bodily harm while making the arrest. However, he is justified in using deadly force only when he believes that such force is necessary to prevent death or serious bodily injury to himself or such other person, or when he believes both that: (i) such force is necessary to prevent the arrest from being defeated by resistance or escape; and (ii) the person to be arrested has committed or attempted a forcible felony or is attempting to escape and possesses a deadly weapon, or otherwise indicates that he will endanger human life or inflict serious bodily injury unless arrested without delay. 18 Pa. Cons. Stat. Ann. § 508(a) (1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Apparently, the district court has not certified as appealable under Rule 54(b) the grant of summary judgment in favor of Officer Klein in the suit brought by Alfonso Leaphart. This point is of no importance because no appeal has been taken from that order.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. James' notice of appeal also states that she would be appealing the grant of summary judgment in favor of Officer Klein. App. at 823. I believe this is a clerical error because Officer Klein was not a defendant in her action and because she does not mention Officer Klein in her brief.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The plaintiffs have not attempted to appeal from the district court's order granting summary judgment in favor of the city on the state claims. Nor have any of the plaintiffs challenged on appeal the grant of summary judgment, on grounds of insufficient evidence, for all defendants as to claims based on alleged violations of First and Fourteenth Amendment rights of the MOVE members.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. As I have noted above, the district court certified as appealable under Rule 54(b) its grant of summary judgment as to Ramona Africa's claims against Officer Klein, but not as to Alfonso Leaphart's claims. This decision, however, has not been appealed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. I am not suggesting that the court could have certified the denial of summary judgment under Rule 54(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The relevant sections of the PSTCA read as follows: § 8545. Official liability generally An employee of a local agency is liable for civil damages on account of any injury to a person or property caused by acts of the employee which are within the scope of his office or duties only to the same extent as his employing local agency and subject to the limitations imposed by this subchapter. § 8546. Defense of official immunity In any action brought against an employee of a local agency for damages on account of an injury to a person or property based upon claims arising from, or reasonably related to, the office or the performance of the duties of the employee, the employee may assert on his own behalf, or the local agency may assert on his behalf: (1) Defenses which are available at common law to the employee. (2) The defense that the conduct of the employee which gave rise to the claim was authorized or required by law, or that he in good faith reasonably believed the conduct was authorized or required by law. (3) The defense that the act of the employee which gave rise to the claim was within the policymaking discretion granted to the employee by law. For purposes of this subsection, all acts of members of the governing body of a local agency or of the chief executive officer thereof are deemed to be within the policymaking discretion granted to such person by law. § 8550. Willful misconduct In any action against a local agency or employee thereof for damages on account of an injury caused by the act of the employee in which it is judicially determined that the act of the employee caused the injury and that such act constituted a crime, actual fraud, actual malice or willful misconduct, the provisions of sections 8545 (relating to official liability generally), 8546 (relating to defense of official immunity), 8548 (relating to indemnity) and 8549 (relating to limitation on damages) shall not apply. 42 Pa. Cons. Stat. Ann. §§ 8545, 8546 \u0026 8550 (1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Because that case involved both federal qualified immunity and state statutory immunity, the court also noted in dictum that given Bollinger 's holding, \"where the motion is partially based on qualified immunity, the issue becomes more difficult in light of the U.S. Supreme Court's emphasis on the appealability of denials of summary judgment as a necessary part of fulfilling the purpose of qualified immunity.\" Lancie v. Giles, 572 A.2d at 829 n.3 (citing Mitchell v. Forsyth, 472 U.S. 511, 105 S. Ct. 2806, 86 L. Ed. 2d 411).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Actually it is difficult to see how there can be merit to this claim as all the other homeowners received compensation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Some of the decisions of this court may have rephrased this test in that they may be read to place a heavier burden on the official seeking immunity than is warranted by the Supreme Court's formulation of the issue. In Good v. Dauphin County Social Serv., this court accurately described the test as whether \"reasonable officials in the defendants' position at the relevant time could have believed, in light of what was in the decided case law, that their conduct would be lawful.\" 891 F.2d at 1092 (emphasis added). This court later misquoted Good, however, to say that \"qualified immunity does not apply if 'reasonable officials in the defendants' position at the relevant time could have believed, in light of what was in the decided case law, that their conduct would be unlawful.'\" Abdul-Akbar v. Watson, 4 F.3d 195, 202 (3d Cir. 1993) (emphasis added); Acierno v. Cloutier, 40 F.3d at 616 (quoting Abdul-Akbar v. Watson). My point is that reasonable officials could believe that a certain course of conduct is unlawful and they also might believe it is lawful. Thus, though unintended, these cases could support a rule that would deny immunity even when \"officers of reasonable competence could disagree on this issue,\" so long as a reasonable officer could believe that the conduct would be unlawful. See Malley v. Briggs, 475 U.S. at 341, 106 S. Ct. at 1096. This reading would place a greater burden on the officials to demonstrate that they have qualified immunity than is warranted. Of course, to the extent that such reading conflicts with Supreme Court precedents, it cannot be followed. Good properly states the law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. I also point out that the defendants' contention that they intended the fire to be localized would not necessarily be conclusive on the issue of what their intent really was. Thus, a court could find in a case in which a massive force was used to achieve a limited result that the officials' intent was to effectuate a seizure with the use of the force. In this case, however, there is no basis to conclude that the defendants' intent in dropping the explosive or allowing the fire to burn was other than to permit the introduction of the tear gas. Nor is this a case in which the police action was \"likely to cause injury to the occupants\" of the residence. Carroll v. Borough of State College, 854 F. Supp. 1184, 1190 (M.D. Pa. 1994), aff'd, 47 F.3d 1160 (3d Cir. 1995) (table); see typescript at 14-16 (officials reasonably believed risk of fire was negligible and fire, once started, could be contained); typescript at 60 (officials had no reason to know that fire could lead to serious injury). Therefore, we are not presented with a situation where the defendants' subjective intent is at odds with the objective likelihood that injury would result from their actions. I need not decide how I would consider the case if we were presented with such facts.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. In any event, in view of my Conclusions, with respect to the reasonableness of the defendants' activities, it is evident that I would conclude that the city defendants did not engage in conduct which \"shocks the conscience.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. In fact, the district court in Fagan explicitly held that \"no seizure occurred in this case,\" Fagan v. City of Vineland, 804 F. Supp. 591, 598 n.6 (D.N.J. 1992), and the plaintiffs did not appeal from the finding, which, after Brower, clearly was correct. See also Campbell v. White, 916 F.2d 421, 423, (7th Cir. 1990) cert. denied, 499 U.S. 922, 111 S. Ct. 1314, 113 L. Ed. 2d 248 (1991); Frye v. Town of Akron, 759 F. Supp. 1320, 1323 (N.D. Ind. 1991).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. In his opinion Judge Lewis indicates that the \"intention of the defendant officials in dropping the explosive device [and] to blast the bunker from atop the roof . . . must be considered in light of the fact that the defendant officials had no way of knowing whether the bunker was occupied at the time the explosive device was deployed.\" Typescript at 3. This statement is wrong for, as the district court explained, nothing in the record demonstrates that the bunker had been used at all for a substantial time before the dropping of the bomb. Africa II, 849 F. Supp. at 340. Obviously the defendants who had the premises under constant observation thought that the bunker was empty when Powell dropped the device and that was the fact.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Judge Lewis concludes that the individual defendants used deadly force and that therefore Tennessee v. Garner applies. But in reaching his Conclusion that the individual defendants had reason to know that their actions created a substantial risk of causing death or serious bodily harm, Judge Lewis relies more on his intuitive sense of what the police and firefighters \"must\" have known than on an analysis of what the record evidence shows in this case. See Judge Lewis' Dissent at 2 (\"the force embodied in the incendiary device and in the fire was, by any sensible standard, 'deadly' force\"; Dissent at 3 (\"To me, this constitutes deadly force, for I cannot imagine how anyone can conclude that a device such as this was not capable of taking human life -- which, in fact, it ultimately did.\"); Dissent at 3 (\"I believe the city defendants, who were professional law enforcement and fire-fighting personnel, had every reason to know that their actions created a substantial risk of death or serious bodily injury to the MOVE members . . . .\") Notwithstanding Judge Lewis' intuitions, the record in this case, as detailed in the text, indicates that quite the opposite is true: The police and firefighters had every reason to believe that their actions did not create a substantial risk of death or serious bodily injury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Although the Court decided Graham v. Connor four years after the MOVE confrontation, it still controls our determination of whether there was a Fourth Amendment violation. Only when we decide whether the law was established clearly do we need to limit our survey of the law to that which predates May 13, 1985.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. I thus find Judge Lewis' assertion that \"several hours had elapsed between the cessation of gunfire from within the MOVE dwelling and the dropping of the incendiary device by the police\" to be beside the point. Dissent at 10-11. The fact of the matter is that, in light of the massive gun battle earlier in the day, which in turn must be seen in light of MOVE members' consistent threatening conduct, the police had every reason to believe that the MOVE members could begin shooting again at any moment. It seems self-evident to me that the inquiry should focus on the police officers' reasonable belief about the threat of violence, not on the fortuitous fact that at the moment the bomb was dropped bullets were not descending from the building.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. In fact she was not inclined peacefully as, according to certain of the briefs, she was convicted of riot and conspiracy for her participation in this episode.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. While Judge Lewis concludes that the individual defendants used excessive force, he offers no explanation of what alternatives were available. Apparently he is willing to have mandated an indefinite standoff.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Nor am I persuaded to reach a different Conclusion by the fact that the satchel contained certain explosive materials generally used only by the military. Whatever was in the satchel was not enough to do much structural damage upon explosion since the bunker was still standing. To say that the explosive was \"military strength,\" I believe, is quite misleading.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The evidence shows, and the district court found, that Richmond played no part in the decision to drop the explosive on the bunker.\u003c/span\u003e\n\n",
    "body_length": 144710,
    "citedas": [
      "49 F.3d 945"
    ],
    "attorneys": "Andre L. Dennis (argued), Jeffrey M. Lindy, Raymond S. Wierciszewski, Stradley, Ronon, Stevens \u0026 Young, 2600 One Commerce Square, Philadelphia, PA 19103-7098, Attorneys for Appellant/Appellee Ramona Africa. Fincourt B. Shelton (argued), Fincourt B. Shelton and Associates, Six North 9th Street, Suite 201, Darby, Pennsylvania 19023, Attorneys for Appellant/Appellee Louise James. Rosemarie Rhodes (argued), Harper \u0026 Paul, 140 West Maplewood Avenue, Philadelphia, PA 19144, Attorneys for Appellant/Appellee Alfonso Leaphart. Joseph A. Dworetzky, Acting City Solicitor, Michael F. Eichert, Divisional Deputy City Solicitor, E. Jane Hix (argued), Deputy City Solicitor, City of Philadelphia, Law Department, 1600 Arch Street, 8th Floor, Philadelphia, PA 19103, Attorneys for Appellant City of Philadelphia. Nolan N. Atkinson, Jr. (argued), Frank E. Noyes, II, Duane, Morris \u0026 Heckscher, 4200 One Liberty Place, Philadelphia, PA 19103-7398, Attorneys for Appellee W. Wilson Goode. Steven R. Waxman (argued), Kleinbard, Bell \u0026 Brecker, 1900 Market Street, Suite 700, Philadelphia, PA 19103, Attorneys for Appellant Leo A. Brooks. John W. Morris (argued), One Penn Square West, Suite 1300, Pennsylvania, PA 19102-4813, Attorney for Appellant Gregore Sambor. Peter C. Kennedy (argued), James M. Marsh, Hecker Brown Sherry and Johnson, 1700 Two Logan Square, 18th and Arch Streets, Philadelphia, PA 19103, Attorneys for Appellant William C. Richmond. Richard D. Malmed, Two Penn Center Plaza, Suite 1920, 15th \u0026 JFK Boulevard, Philadelphia, PA 19102, Attorney for Appellee Frank Powell. E. Harris Baum, John R. O'Donnell, Zarwin \u0026 Baum, P.C. Suite 700, Four Penn Center Plaza, 1616 John F. Kennedy Boulevard, Philadelphia, PA 19103, Attorneys for Appellee William Klein.",
    "category": [],
    "judges": "Before: Greenberg, Scirica, and Lewis, Circuit Judges.",
    "citation_count": 98
  }
}
