{
  "id": "EIjYP2YBTlTomsSBgBKL",
  "document": {
    "title": "United States v. Tulare Lake Canal Co.",
    "full_title": "UNITED STATES OF AMERICA v. TULARE LAKE CANAL COMPANY, A CORPORATION TULARE LAKE BASIN WATER STORAGE DISTRICT AND SALYER LAND COMPANY, A CORPORATION, INTERVENORS-DEFENDANTS-APPELLEES",
    "jurisdiction": "Ninth Circuit",
    "date": "1976-04-05T00:00:00.000Z",
    "docket": "No. 72-2322",
    "body": "BROWNING, Circuit Judge:\n\nThis action was brought by the United States to determine two questions regarding the application of the reclamation laws, and particularly section 46 of the Omnibus Adjustment Act of 1926,\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e to private lands receiving irrigation benefits from the Pine Flat Dam, a multiple-purpose dam on the Kings River, which flows into the San Joaquin River Basin in the Central Valley of California.\n\nSection 46 of the 1926 Act bars delivery of reclamation project water to private land in excess of 160 acres in one ownership unless the owner executes a recordable contract with the Secretary of the Interior obligating him to sell the excess land at a price excluding incremental value resulting from the existence of the project. Section 46 also requires the United States to enter into contracts with irrigation districts organized under state law in the area to be served by the reclamation project. In exchange for the government's promise to supply water, the districts undertake to reimburse the United States for an allocated portion of the cost of constructing the project and to withhold water from excess lands within their boundaries for which recordable contracts have not been executed.\n\nThe requirement that the owner of private land within a reclamation project agree to dispose of any excess over 160 acres at ex-project prices was intended to serve much the same purposes as the historic restriction on the amount of public land an entryman may obtain from the United States under the homestead acts, the original reclamation act, and other public land laws. As explained in more detail in Part II of this opinion, these purposes are to open private land to settlement by farmers of modest means, to insure wide distribution of the benefits of the federal investment in the reclamation project, and to prevent private landowners from realizing a disproportionate windfall advantage from enhanced productivity and land values because of the project.\n\nConstruction of Pine Flat Dam was authorized by the Flood Control Act of 1944,\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e and substantially completed by 1954. Efforts to negotiate repayment contracts pursuant to section 46 for the portion of construction costs allocated to irrigation were unsuccessful. Private owners of excess lands contended that the Flood Control Act of 1944 exempted the Kings River project from the reclamation laws, including section 46. They also contended that even if those laws applied, owners of more than 160 acres of project land could avoid executing a recordable contract for the sale of their excess holdings and receive water for those lands if construction charges were repaid.\n\nOpposition to the acreage limitations came primarily from large landowners in the Tulare Lake Basin, a flat, low-lying region. The Basin contains about 20 percent of the one million acres in the Kings River service area -- the area supplied with Kings River water from Pine Flat Dam. It includes the bulk of the service area's more than 280,000 acres of excess holdings. More than 157,000 of the 188,000 acres within the boundaries of the Tulare Lake Basin Water Storage District, which covers most of the Basin, are held in tracts of more than 160 acres. These excess holdings average 2,600 acres each, including one tract of more than 60,000 acres owned by a single company.\n\nIn 1957, Elmer F. Bennett, Solicitor of the Department of the Interior, formally determined that the reclamation laws were applicable to lands served by Pine Flat Dam, rejecting the landowners' argument that the Flood Control Act of 1944 exempted Pine Flat from these laws. 65 I.D. 525, 147 P.2d 1009 (1957). Attorney General William P. Rogers rendered a formal opinion to the same effect in the following year. 41 Op. A.G. 377 (1958).\n\nBy 1957 Interior Department officials had negotiated a repayment contract with the Kings River Conservation District, a service-area-wide entity created to contract with the United States. On the advice of Solicitor Bennett, 64 I.D. 273 (1957), the Secretary of the Interior declined to sign the contract because it would have relieved individual landowners of the section 46 requirement that they execute recordable contracts to dispose of excess lands if they paid all construction costs allocated to their individual holdings.\n\nNegotiations were then resumed between the United States and the various irrigation and water storage districts and canal companies in the Kings River service area. Under contracts proposed in 1961, owners of excess land would have been relieved of the recordable contract requirement if the irrigation district or canal company through which they received project water exercised an option to repay the share of overall construction costs allocated to the landowners served by the district or company. Solicitor Barry concluded that the requirements of section 46 could not be avoided in that manner. 68 I.D. 372 (1961). His opinion on the repayment issue was submitted to the Department of Justice by the Secretary of the Interior and was formally approved by Attorney General Robert F. Kennedy in December 1961. As a result, the proposed contracts were not executed.\n\nThe United States and the landowners agreed to submit the disputed issues to the courts. Tulare Lake Canal Company entered into a repayment contract with the United States in which it agreed to withhold delivery of project water from all lands in excess of 160 acres in single ownership unless the owner had executed a recordable contract for the sale of the excess land. However, the repayment contract provided that the recordable contract requirement would be void if it were determined in the test case that the Kings River project is exempt from section 46, or that section 46 may be avoided by repayment of construction charges. To enable it to test the latter theory, the Canal Company paid its share of the total irrigation cost of the Pine Flat Dam. The other districts and canal companies in the Kings River service area agreed to be bound by the outcome of the test case.\n\nThe United States then brought this suit, seeking an injunction prohibiting defendant Tulare Lake Canal Company from delivering \"project water\"\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e to excess holdings unless the owners executed recordable contracts to sell such excess holdings in accordance with section 46.\n\nThe district court denied relief. The district court held that the reclamation laws do not apply to the Kings River project, and that, even if they did, owners of excess land receiving water from the Tulare Lake Canal Company were relieved of the recordable contract requirement of section 46 when the company repaid its share of construction charges allocated to irrigation. United States v. Tulare Lake Canal Co., 340 F. Supp. 1185 (E.D. Cal. 1972). We disagree with the district court on both issues.\n\nWe first consider the contention that the Kings River project is wholly exempt from the operation of section 46.\n\nI\n\nAppellees urge this court to hold that in passing the Flood Control Act of 1944 Congress intended to exclude Pine Flat Dam from the acreage limitations imposed by the reclamation laws. Such a holding (1) could not be reconciled with the holding in Turner v. Kings River Conservation District, 360 F.2d 184 (9th Cir. 1966), which binds this panel; and (2) would be contrary to the intent of Congress underlying the 1944 Act authorizing the construction of Pine Flat Dam.\n\nA.\n\nTurner v. Kings River Conservation District\n\nIn Turner this court held as follows (360 F.2d at 192):\n\nSection 8 of the Flood Control Act of 1944\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e authorizes the Secretary of the Interior to operate and maintain structures such as Pine Flat dam \"under the provisions of the Federal Reclamation Laws (Act of June 17, 1902, 32 Stat. 388 and Acts amendatory or supplementary thereto),\" thus making section 7 of the Reclamation Act of 1902, 32 Stat. 389, 43 U.S.C.A. ยง 421, applicable to the irrigation features of the Pine Flat project.\n\nThe strict holding of the court was that section 7 of the 1902 Act, authorizing the Secretary of the Interior to acquire by condemnation rights needed to carry out the reclamation laws, was applicable to the Pine Flat project. As is evident from the passage quoted, however, the premise for this holding was that section 8 of the Flood Control Act of 1944 authorized the Secretary to operate and maintain the Pine Flat project \"under the provisions of the Federal Reclamation laws,\" which include section 7 of the 1902 Act. Since the \"Federal Reclamation laws\" also include section 46 of the 1926 Act, the premise of Turner requires a holding that the recordable contract requirement of section 46 also applies to the Pine Flat project.\n\nAppellees seek to escape this conclusion by arguing that the quoted passage is not a holding but an assumption, made for the purposes of the decision but not essential to it. An examination of the structure of the Turner opinion and the proceedings relating to the disposition of the petition for rehearing in that case demonstrates that the court intended to and did hold that the reclamation laws apply to Pine Flat project.\n\nIn Turner, claimants of rights under state law to use Kings River water on riparian and overlying lands sought to enjoin officials of the Department of the Interior and the Corps of Engineers from operating Pine Flat Dam in such a way as to interfere with these rights. The district court dismissed the action as one against the sovereign without consent. This court concluded that the action could be maintained if the defendant government officers had exceeded their statutory authority. Plaintiffs argued that defendants had exceeded their authority because the 1944 Act, authorizing the construction of Pine Flat Dam, did not authorize the officials to interfere with plaintiffs' water rights. In answer to this argument we held, in the passage quoted, that the officials did have authority to interfere with plaintiffs' water rights in operating Pine Flat Dam because, under section 8 of the 1944 Act, Pine Flat Dam was to be operated pursuant to the reclamation laws, and those laws included the power to take private rights conferred by section 7 of the 1902 Act.We went on to hold that no other provision of the 1944 Act excepted Pine Flat Dam from the grant of eminent domain in section 7 of the 1902 Act.\n\nAppellees contend that this court merely assumed without deciding that section 8 of the 1944 Act applied to Pine Flat Dam. They point out that plaintiffs had alleged that section 8 applied and that certain provisions of reclamation law invoked by that section prohibited defendant officials from interfering with plaintiffs' water rights. Appellees argue that since this court was reviewing the dismissal of a complaint for failure to state a claim, it was required to accept these allegations of the complaint as true; and that it did no more. The obvious answer is that while allegations of fact are to be regarded as true, allegations of law are not. See 2A Moore's Federal Practice P 12.08, at 2267-69. Whether section 8 of the 1944 Act made the reclamation laws applicable to Pine Flat project was a question of law. The resolution of this question of law was essential to the decision of the case. If the defendant officers were not authorized to take plaintiffs' water rights, they were acting unlawfully and the suit to enjoin their unlawful conduct was not barred as a suit against the United States. This court found the necessary authority to condemn in section 7 of the 1902 Act, and the availability of section 7 of the 1902 Act required the holding that section 8 of the 1944 Act made the reclamation laws applicable to Pine Flat Dam.\n\nMoreover, the Turner court was specifically asked to modify its opinion to state that the applicability of the reclamation laws was not decided but only assumed, as appellees in this case now argue. The court refused to do so.\n\nAs the opinion in Turner was originally filed, the passage quoted above stated that section 8 of the 1944 Act made \"all of the provisions and limitations of the Reclamation law applicable to the irrigation features of the Pine Flat project.\" Slip opinion at 10. The Kings River Conservation District, among others, filed a \"Petition for Rehearing or, in the Alternative, for Modification or Clarification of the Court's Opinion.\" The petition requested the court to modify the passage quoted to indicate that the court was only assuming and not deciding that section 8 of the 1944 Act made reclamation law applicable to Pine Flat. The revision suggested by petitioners was as follows (Petition for Modification at 10-11):\n\nIf we assume that Section 8 of the Flood Control Act of 1944 authorizes the Secretary of the Interior to operate and maintain structures such as Pine Flat Dam \"under the provisions of the Federal Reclamation laws (Act of June 17, 1902, 32 Stat. 388 and Acts amendatory or supplementary thereto),\" and thus makes all of the provisions and limitations of the Reclamation law applicable to the irrigation features of the Pine Flat project, the appellee officials would nevertheless be authorized to interfere with appellants' rights in the manner alleged in the complaint.\n\nThe court did not adopt the suggested language. The revision the court did adopt, quoted earlier, necessarily involved rejection of the suggestion that the court restate, as an assumption rather than as a holding, the court's premise that section 8 of the 1944 Act made the reclamation laws applicable to Pine Flat.\n\nThe court did, however, narrow its conclusion to the precise necessities of the case by substituting \"section 7 of the Reclamation Act of 1902\" for the broader phrase, \"all of the provisions and limitations of the Reclamation law.\" The reason is clear. It is apparent that the Turner court had concluded that section 8 of the 1944 Act made all the provisions and limitations of the reclamation laws applicable to Pine Flat, for the opinion initially stated as much and the authorities cited were to that effect.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e The petition for modification of the Turner opinion also appeared to concede that if section 8 made the reclamation laws applicable to Pine Flat at all, it made those laws applicable in their entirety, including acreage limitations.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e However, the petition, in a footnote, did reserve the argument that even if reclamation laws were generally applicable to Pine Flat, the provisions regarding acreage limitation were not;\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e and argued that this narrow issue should not be definitely resolved until the court had the benefit of a fuller presentation that would be available in the present litigation, then only recently filed.It is apparent that the purpose of the modifications of the Turner opinion limiting the specific reference to section 7 of the 1902 Act was solely to preserve the opportunity for appellees in this case to make the promised demonstration that although section 8 applies to the Pine Flat Dam, the acreage limitation provisions of the reclamation laws do not. Appellees have not attempted to make this showing. Instead they have argued that the reclamation laws are entirely inapplicable to this project. This position was rejected in Turner.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nNonetheless, in view of the importance of the question, and the opportunity this case has given to examine it more fully, we have reconsidered the legislative history of the Flood Control Act of 1944 at some length. That re-examination reveals that section 8 was conceived and considered by Congress with the Pine Flat Dam and other nearby projects in the Sacramento-San Joaquin River Basin specifically in mind, and that the application of the excess land provisions to these projects was the principal issue in controversy. The legislative history leaves no doubt that the 160-acre limitation was intended to apply in the Kings River service area.\n\nB.\n\nLegislative History of Flood Control Act of 1944\n\nIn Ivanhoe Irrigation District v. McCracken, 357 U.S. 275, 2 L. Ed. 2d 1313, 78 S. Ct. 1174 (1958), the Supreme Court declined to imply an exception to the acreage limitation provision found in section 5 of the 1902 Act, substantially re-enacted in section 46 of the 1926 Act, stating, \"Significantly, where a particular project has been exempted because of its peculiar circumstances, the Congress has always made such exemption by express enactment.\" 357 U.S. at 292.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e There is no \"exemption by express enactment\" of the Kings River project from acreage limitations in the 1944 Act or any other statute. The argument for exemption rests instead upon indirect implications drawn from the text of the 1944 Act and scattered incidents in the legislative history. In light of Ivanhoe and the important public interests underlying the historical policy of acreage limitations in reclamation law, it is questionable whether it would be appropriate to base exemption upon such a foundation. In any event, the legislative history of the 1944 Act demonstrates that an implied exemption would be wholly unjustified.\n\nIt may be helpful to begin with a brief summary of the legislative history of the 1944 Act as it relates to the Kings River project.\n\nMention should be made at the outset of a significant factor in the historical context in which Congress considered the 1944 Act. A proposal to expressly exempt the Central Valley project from acreage limitations was under consideration by Congress at the time that Congress was considering the 1944 Act. The proposal for express exemption was defeated after vigorous congressional debate. See Ivanhoe Irrigation District v. McCracken, supra, 357 U.S. at 292-93.\n\nAn almost identical debate took place during consideration of the Flood Control Act regarding whether the reclamation laws, and especially acreage limitations, should be applicable to the Pine Flat Dam and other projects authorized for construction in the Sacramento-San Joaquin River Basin. These projects were to be adjacent to the Central Valley project; the Administration argued they should be integrated into it. Under these circumstances, it is highly unlikely that the same Congress that rejected an express exemption for the Central Valley project intended, sub silentio, to exclude the Pine Flat Dam from acreage limitations. The legislative history confirms that it did not.\n\nThe proceedings directly concerned with the 1944 Act were marked by a continuing controversy over two distinct issues: (1) whether Pine Flat Dam should be constructed by the Corps of Engineers or the Bureau of Reclamation; and (2) whether the acreage limitation should apply to the project once built. The controversy may fairly be characterized as a power struggle between Kings River water users and the Roosevelt Administration. The water users needed the dam for flood protection and a regulated water flow. They were willing to pay for irrigation benefits, but did not wish to become subject to the reclamation laws, especially acreage restrictions. The Administration, represented by President Roosevelt, Secretary of the Interior Ickes, and Commissioner Bashore of the Bureau of Reclamation, was equally insistent that the acreage restrictions should apply to the Kings River project. The Administration was not willing to accept reimbursement of the costs attributable to irrigation benefits as a substitute for those limitations. In the Administration's view, the interests of the United States were not merely financial. They included such social purposes as wide dispersion of the public subsidy, avoidance of speculation, and provision of family homes and farms, especially for soldiers who would soon be returning from the war.\n\nBoth sides of the controversy were exhaustively presented before congressional committees and on the floor of the House and the Senate. Neither side emerged wholly victorious. The California interests prevailed on the issue of which agency should construct Pine Flat Dam -- Congress decided that Pine Flat Dam should be built by the Corps of Engineers. They lost on the issue of whether acreage limitations should apply -- Congress decided that these limitations should apply to the Kings River project. The California interests emerged from the House with no more than a colorable argument on the latter issue, based upon equivocal statements in committee hearings and floor debate; but the proceedings in the Senate, particularly in the consideration of the conference report, make it clear beyond question that the struggle against acreage limitations was ultimately lost. What is now section 8 of the 1944 Act was redrafted in the Senate to conform to the wishes of the Secretary of the Interior, who was adamant in his insistence that the reclamation laws should apply to the Kings River project. The Senate rejected an amendment specifically designed to exempt dams in the Sacramento-San Joaquin River Basin, especially those on the Kings and Kern Rivers, from the operation of section 8. A colloquy between Senator Overton, floor manager of the bill, and Senator Hill, Acting Majority Leader, at the close of debate on the conference report, was intended to and did remove any doubt that section 8 was applicable to the California projects.\n\nSoon after the President signed the Flood Control Bill, California interests attempted to regain their position by securing an administrative determination that the Secretary of War was authorized to negotiate with water users for repayment without regard to reclamation law. Again they lost. The contemporaneous interpretation of the 1944 Act by the President, the Secretary of War, and the Secretary of the Interior was that irrigation uses of the Pine Flat Dam were subject to reclamation law. This has been the consistent interpretation of the 1944 Act by the Department of the Interior since 1944. It was confirmed in 1958 by a formal opinion of the Attorney General. 41 Op. A.G. 377 (1958).\n\nWe turn to a more detailed consideration of the legislation and administrative background of the 1944 Act.\n\nIn 1940 both the Corps of Engineers and the Bureau of Reclamation submitted reports to Congress recommending construction of a dam on the Kings River. Specifications for the dam were similar. Both proposals predicted that the flood control and irrigation benefits would be about equal.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e The proposals differed, however, as to who should build the dam and operate it. The Corps of Engineers proposed that the Corps build the dam and that local interests operate it under regulations prescribed by the Secretary of War. The Bureau of Reclamation proposed that the dam be built and operated by the Bureau.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e The recommended schedule for payment of allocable irrigation construction costs by water users also differed. The Bureau recommended annual installments to be paid over 40 years (the usual repayment period under reclamation law). The Corps recommended payment of a lump sum representing the discounted present value of the 40 annual installments.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nPresident Roosevelt concluded that the project was \"dominantly an irrigation undertaking and is suited to operation and maintenance under the reclamation law.\" He endorsed the Interior Department's proposals that the Bureau of Reclamation construct, operate, and maintain the Kings River project and that repayment be made in 40 annual installments under prevailing reclamation policy.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nHearings on the proposals were held before the House Flood Control Committee in 1940 and 1941. Local water users opposed the Bureau's proposal and endorsed that of the Corps of Engineers. The Kings River-Pine Flat Association was especially concerned that Bureau control over release of water might result in interference with their vested water rights.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Acreage limitations were not discussed.\n\nOut of deference to the President's position that the Kings River project should be built by the Bureau, this project was not included in the comprehensive flood control bill reported by the House Flood Control Committee in 1941. The committee issued a separate report recommending construction of the dam by the Corps of Engineers,\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e but no further action was taken.\n\nHearings before the House Flood Control Committee resumed in 1943 and continued in 1944. In 1944 President Roosevelt wrote to Congressman Whittington, chairman of the committee, modifying the Administration's earlier position. The President reaffirmed his view that the Kings River and Kern River projects were predominantly for irrigation and should therefore be built and operated by the Bureau of Reclamation -- a view that had been rejected by the committee in its 1941 report. However, the President added a new suggestion, namely, that Congress provide for multiple-agency administration of multiple-purpose projects. The President proposed that whatever agency constructed a multiplepurpose project, each agency having an interest in the project should be given responsibility for administering its interest in accordance with its own legislation and policies. \"For example,\" the President wrote, \"the Bureau of Reclamation in the Department of the Interior should administer, under the Reclamation laws and its general policies, those irrigation benefits and phases of projects built by the Corps of Engineers.\"\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nIt is important to note that this suggestion was directed specifically to Pine Flat Dam on the Kings River and to the adjacent Kern River project.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e It provided the basis for the compromise eventually reflected in section 8 of the 1944 Act.\n\nThus, the Administration sought to have the reclamation laws, and especially the excess land provisions, applied to the Kings River and Kern River projects in two ways: by having these projects built and operated by the Bureau of Reclamation or, failing that, by having use of these projects for irrigation administered by the Bureau under the reclamation laws. The Administration failed in its efforts to have Pine Flat Dam constructed by the Bureau; Congress ultimately concluded that the dam should be built by the Corps of Engineers. But it succeeded in its alternative position, securing in section 8 a provision that the irrigation uses of projects constructed by the Corps of Engineers should conform with reclamation law.\n\nCommissioner Bashore presented the Administration's position to the House Flood Control Committee in detailed testimony supplementing the President's letter. Commissioner Bashore's presentation was directed specifically to the Kings River and Kern River projects.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e He repeated the Administration's position that both projects should be built by the Bureau. He went on to urge, however, that if Congress should decide to authorize construction by the Corps of Engineers, the statute authorizing construction should provide that irrigation benefits of the two projects be administered by the Secretary of the Interior under the reclamation laws.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e The statutory language suggested by Commissioner Bashore appears in the margin.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nCommissioner Bashore made it explicitly clear that the purpose of the provision was to make the acreage limitations applicable to the Kings River and Kern River projects.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e He emphasized the social purposes intended to be accomplished by breaking up the large landholdings in the areas that would be served by these projects -- spreading the federal subsidy, preventing speculation, and making it possible for people of limited means to establish farms on irrigated lands on which families could be self-sustaining.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e He expressly rejected the notion that repayment by water users of the costs of construction allocated to irrigation would be an acceptable substitute for the advancement of these social purposes.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nAll of the objections now raised to application of acreage limitations to the Kings River project were also fully presented to the committee -- that all land to be served was in private hands, that local water users had appropriated most if not all Kings River water and had constructed extensive irrigation works in the area, and that no new lands would be brought under irrigation as a result of the project.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e In order to gain the benefits of federally subsidized flood control and irrigation without subjecting themselves to acreage limitations, the landowners urged the committee to adopt the dominant-interest test originally advocated by the Administration,\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e to recognize that the dominant purpose of the Kings River project was flood control, and to provide that it be constructed by the Corps of Engineers and be operated either by the Corps or, preferably, by the water users themselves.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nThe bill reported by the House committee authorized construction of the Pine Flat Dam by the Corps of Engineers,\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e but it also embodied the President's proposal for joint administration of multiple-purpose projects. Section 5 of the bill provided that the projects should be operated for navigation and flood control purposes in accordance with regulations prescribed by the Secretary of War. Section 6 provided that projects built by the Corps of Engineers should be utilized for reclamation purposes in accordance with regulations prescribed by the Secretary of the Interior.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nWith minor modifications, the language of section 6 followed that proposed to the committee by Commissioner Bashore for the avowed purpose of making acreage limitation provisions of reclamation law applicable to the irrigation features of the Kings River and Kern River projects in the event the committee should decide, as it did, that the construction of these dams should be assigned to the Corps of Engineers.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nIn the course of debate on the floor of the House, Congressman Curtis, a member of the committee, explained section 6 in essentially these terms.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e Committee Chairman Whittington also described section 6 as a broad grant of power to the Secretary of the Interior to regulate reclamation features of the authorized projects.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Each characterized the section as a concession to the Bureau of Reclamation and the Secretary of the Interior.\n\nThe Administration was still not entirely satisfied. Section 6 of the committee bill provided that water available for reclamation was to be distributed in accordance with regulations prescribed by the Secretary of the Interior, but it did not specifically state that such regulations should conform to reclamation law, as had Commissioner Bashore's proposal.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e On April 10, 1944, Secretary Ickes wrote the Director of the Bureau of the Budget expressing concern that the committee bill did not make reclamation law applicable to irrigation uses of water stored behind the dams authorized in the bill. He made it clear that his objection was motivated by a fear that the bill might permit large landowners on the Kings River and Kern River projects to avoid the acreage limitations.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e During the floor debates on May 9, 1944, Chairman Whittington offered a \"perfecting amendment\" on behalf of the Flood Control Committee, adding to section 6 the express requirement that the Secretary of the Interior regulate the use of irrigation waters \"under existing reclamation law.\" He stated that the amendment was proposed because \"some of the friends and spokesmen for reclamation were critical of the language in the bill.\"\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e The amendment was adopted. On May 20 the Acting Director of the Bureau of the Budget replied to Secretary Ickes' letter of April 10, calling attention to this amendment to section 6 and stating, \"This change would give the Department of the Interior all the authority necessary.\"\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nAs the bill left the House, therefore, the overwhelming evidence was that it represented a victory for the Administration's position that the irrigation uses of the Kings River project and other projects authorized by the bill were to conform to the reclamation laws, and specifically to acreage limitations, even though the projects were to be built by the Corps of Engineers.\n\nAll that can be garnered to lend possible support to appellees' contrary interpretation is language in the committee report and in Chairman Whittington's remarks on the floor that really consists of nothing more than sympathetic recitation of arguments advanced by water users against application of the reclamation laws to the Pine Flat project.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nSubsequent proceedings in the Senate removed any possible doubt as to Congress' intention to apply acreage limitations to the Kings River project.\n\nHearings before a subcommittee of the Senate Commerce Committee produced the same general conflict of views that had developed in hearings before the House Flood Control Committee. Again California interests were arrayed against the Administration, which was supported by organizations of labor and small farmers. Again the controversy centered upon the application of acreage limitations, particularly to projects in the Sacramento-San Joaquin River Basin, including Pine Flat Dam. Again proponents of acreage limitation pressed the historical purposes served by such provisions -- spreading the federal subsidy, avoiding speculation, creating family farms -- while opponents again pressed the features of the Kings River and Kern River projects that assertedly made application of acreage limitations inappropriate.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nAdministration spokesmen again sought to have these projects built by the Bureau, rather than the Corps of Engineers, and expressed their disappointment in the House decision to the contrary;\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e but they also reaffirmed the President's alternative suggestion that water made available for irrigation by projects built by the Corps of Engineers be utilized in accordance with the reclamation laws, including acreage limitations.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nThe issue was never in doubt. The subcommittee was obviously impressed with the experience and skill of the Corps of Engineers in building and operating dams for effective flood control.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e On the other hand, this same subcommittee had recently demonstrated its adherence to enforcement of acreage limitations in federally subsdized irrigation projects by rejecting the proposal that the Central Valley project be exempted from such limitations.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e Moreover, on the earlier occasion this same subcommittee had advanced as a solution to the apparent dilemma the very approach that was reflected in section 6 of the House bill -- that is, that the Corps of Engineers be authorized to construct these multiple-purpose projects, but that irrigation features of such projects be utilized in conformity with the reclamation laws.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e It was inevitable that members of the subcommittee would suggest that the same approach be adopted in connection with Pine Flat and other nearby projects.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\n\nBoth Secretary Ickes and Commissioner Bashore appeared before the subcommittee. Both made it clear that at the heart of the conflict were the efforts of owners of large tracts of land in California projects, including the Kings River project, to escape the acreage limitation and antispeculation provisions of the reclamation laws. Both urged the subcommittee to reject these efforts.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e Both accepted section 6 of the House bill as intended to make the reclamation laws, including acreage limitations, applicable to irrigation uses of projects authorized by the Act, but both suggested modification of the language to accomplish this purpose more effectively.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\n\nDuring the hearings Secretary Ickes had written to the chairman of the Senate Commerce Committee:\n\nI regard section 6 of the bill as intended to provide for the application of the Federal reclamation laws to projects having irrigation possibilities. . . . However, the provisions of this section are not entirely apt in their relation to the various technical features of the Federal reclamation laws.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\n\nSecretary Ickes amplified these views in his testimony before the Senate committee:\n\n[Section 6] as it now stands provides for the application of the Federal reclamation laws to the irrigation features of Army reservoir projects. However, it is not drafted in a way that ties in with the basic provisions of the reclamation laws in all pertinent respects. For example, it speaks of those laws as though they involved merely the imposition of regulations, whereas in truth they are largely designed to authorize a system of contractual relationships. It disregards the problem of allocating costs for multiple-purpose facilities serving other uses in addition to irrigation. And it overlooks the special laws relating to Indian irrigation developments. Hence, I believe that this section should be rephrased in a way that would eliminate possible future uncertainties with respect to its precise meaning and operation.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e\n\nThe Secretary's first concern, one particularly relevant here, is understandable. The mechanism adopted by section 46 of the 1926 Act for accomplishing the antimonopoly and antispeculation objectives of acreage limitations was to direct the Secretary of the Interior to include in repayment contracts with irrigation districts provisions under which the districts were required to withhold water from owners of excess lands who had not executed recordable contracts agreeing to sell that excess land at ex-project prices. This enforcement mechanism, based upon contractual relationships, replaced the prior method of enforcement through regulations governing water right applications.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e The regulatory scheme therefore did not apply to projects built after the passage of the 1926 Act. Yet section 6 of the House bill was couched entirely in terms of the Secretary's power to prescribe regulations, rather than the Secretary's power to enter into contracts. Though technical, the deficiency was obviously significant. The revision proposed by the Secretary met the problem by broadening the language of section 6 to provide that dams were to be utilized for irrigation purposes \"only in conformity with the provisions of this section,\" that is, \"under the provisions of the Federal reclamation laws (Act of June 17, 1902, 32 Stat. 388, and acts amendatory thereof or supplementary thereto)\" -- which of course included the 1926 Act.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e\n\nThe subcommittee adopted the essence of the Secretary's recommended modification of section 6; it is reflected in the language of section 8 as reported to the Senate,\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e and as finally enacted.\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e\n\nThere can be no doubt, on this record, that in proposing section 8 the Senate subcommittee intended to adopt the Administration's position that the reclamation laws, and specifically acreage limitations, should apply to irrigation uses of all projects authorized by the bill, including the Kings River project, even though the projects were to be built by the Corps of Engineers.\n\nOn the floor of the Senate a final attempt was made to bar application of acreage limitations to the California projects authorized by the 1944 Act, but it was turned back.\n\nThe President and Secretary Ickes persisted in their efforts to have projects in the general Central Valley area, including Pine Flat Dam, built by the Bureau of Reclamation rather than the Corps of Engineers, as the House bill provided. However, they welcomed the provision in section 8 making reclamation laws applicable to irrigation features of dams built by the Engineers. Each specifically mentioned the acreage limitations in connection with that section. Secretary Ickes warned that an effort would be made to amend or delete section 8 on the floor of the Senate.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e\n\nThe challenge anticipated by Secretary Ickes appeared in the form of two amendments proposed by Senator O'Mahoney of Wyoming. One sought to amend section 6 of the bill reported by the Senate committee to authorize the Secretary of War to contract for the storage of water for any beneficial use in any reservoir constructed by the War Department, \"on such terms and conditions as he may deem reasonable.\"\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e Objection was immediately raised that this would permit the Secretary of War to sell water for irrigation use on such terms and conditions as he chose, and thus would \"change the basis of the reclamation law.\"\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e Senator Hatch stated that the amendment would permit \"the Army Engineers . . . to supply water . . . entirely removed from . . . the acreage limitations and the other basic foundations of our irrigation law.\"\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e\n\nThe second O'Mahoney amendment sought to make two changes in section 8 as reported by the Senate committee. It would have deleted the provision in section 8 that dams and reservoirs under the jurisdiction of the Secretary of War could be utilized for irrigation only in conformity with section 8, and thus with the reclamation laws; and it would have made section 8 inapplicable \"to any dam or reservoir heretofore or hereafter constructed which supplements any existing locally operated irrigation system or other locally operated water facilities.\"\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e\n\nA letter from Secretary Ickes, in opposition to these proposals, pointed out the effect of the two amendments proposed by Senator O'Mahoney: \"The projects included in the bill for the great Central Valley area of California (Sacramento-San Joaquin River Basin, p. 31, H.R. 4485) would supplement some existing locally operated irrigation systems. Those projects, therefore, would be left subject only to section 6 which, as the Californians would have it amended, disregards the Federal reclamation laws while placing the Corps of Engineers in the irrigation field.\"\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e Senator Overton, chairman of the Senate subcommittee, also opposing the amendment, advised the Senate that section 8 had been included \"at the request of the Secretary of Interior, and at his very earnest insistence,\" and \"word for word as recommended by the Secretary of the Interior.\"\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e\n\nSenator Hayden moved that both amendments be referred to the Committee on Irrigation and Reclamation, on the ground that they would alter existing reclamation law and therefore should be considered by the committee with jurisdiction over that subject matter. The motion was adopted.\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e\n\nThe disposition of the O'Mahoney amendments reflects the Senate's understanding that, under section 8, the reclamation laws, and specifically acreage limitations, would apply to utilization of water for irrigation on projects authorized for construction by the Corps of Engineers in the Sacramento-San Joaquin River Basin, including Pine Flat Dam on the Kings River. If this had not been so the proposed amendments would have served no purpose. The amendments were rejected precisely because they would have changed reclamation law, which both sides assumed to be applicable to such projects as section 8 read.\n\nThis conclusion was reaffirmed the following day in the course of Senate consideration of a proposal by Senator Murray of Montana to transfer \"all functions, powers, duties, and projects\" of the Secretary of War with respect to water conservation reservoirs in the west to the Secretary of the Interior, thus completely ousting the Secretary of War from these activities.\u003cspan class=\"fnref\"\u003e60\u003c/span\u003e Senator Murray based his proposal in part upon a desire to assure \"that the Federal reclamation laws, with their various provisions for the development of family-size farms and the prevention of speculation in lands, should be made applicable to all reservoir projects in the west.\" Senator Murray continued, \"If the policy of the family-size farm . . . is to be accomplished, then these projects must be built, operated, and maintained by the Bureau of Reclamation under the reclamation laws.\"\u003cspan class=\"fnref\"\u003e61\u003c/span\u003e\n\nIn response, Senator Overton assured the Senate that Senator Murray's objectives with respect to the application of reclamation law to irrigation in projects authorized by the bill would be achieved under section 8, which would make reclamation law applicable to the irrigation features of projects constructed by the Engineers. Senator Overton made this point with specific reference to projects in the Sacramento-San Joaquin River Basin. After referring to the President's suggestion that the federal agency with the dominant interest in a particular project should construct it, Senator Overton continued:\n\nThe able junior Senator from Montana has made considerable comment in reference to the Sacramento and San Joaquin Rivers and the Central Valley, in California. The principle to which I have just referred was carried out in respect to the projects contained in the bill which were authorized for those streams. The testimony shows, I think rather conclusively, that the projects herein authorized to be constructed by the Army engineers are ones in which flood control predominates over irrigation. Of course, the Senate will understand that, insofar as irrigation is concerned, all surplus water which can be used for irrigation is turned over to the Department of the Interior, and the method of irrigation and the operation of the irrigation works are under the control of the Department of the Interior.\u003cspan class=\"fnref\"\u003e62\u003c/span\u003e\n\nSenator Overton also informed the Senate that the Corps of Engineers \"had absolutely no objection whatsoever to the irrigation and power amendments [sections 8 and 5] which were suggested by the Secretary of the Interior . . . and were subsequently incorporated in the pending bill. The engineers stated that they were perfectly willing . . . to turn over to the Bureau of Reclamation the distribution of all surplus water held back by the dams constructed by them, the distribution of which would come under the reclamation law, or would follow whatever method Congress might determine upon.\"\u003cspan class=\"fnref\"\u003e63\u003c/span\u003e Senator Murray's amendment was then rejected.\n\nThe Senate adopted the committee's proposed substitution of the present section 8 for section 6 of the House bill. The Senate version was accepted by the conference committee, and enacted into law with minor modifications not pertinent here. During the brief Senate debate on the conference report, Senator Overton, the flood manager of the bill, and Senator Hill, the Acting Majority Leader, engaged in the following colloquy for the express purpose of removing any possible doubt as to the applicability of section 8 to the Kings River project:\n\nMr. HILL. There still seems to be confusion on the part of some Senators with reference to the application of reclamation laws in regard to some of these projects.\n\nI heard the distinguished senior Senator from Louisiana, when the bill was under consideration, and I think he made it very clear. However, I wish to ask this question: Is it not a fact that section 8 of this bill, as agreed to in conference, makes some reclamation laws applicable to the handling of irrigation water of any of the projects, including California projects, where it is found that irrigation may be carried out? I ask the Senator in charge of the bill whether it is not a fact that the President wanted the California projects in this bill constructed under the Bureau of Reclamation so that the water policies would conform to reclamation laws ?\n\nMr. OVERTON. The Senator is correct with respect to the projects in the so-called Central Valley of California. The President wrote me and the chairman of the subcommittee in this regard. However, in view of the fact that the Senate amendment made not only the California projects but all such projects subject to irrigation laws, and in view of the fact that the House concurred in this action by agreeing to section 8 of the Senate bill, I am sure that the President will feel that we have met the problem that he raised. Section 8 of the bill clearly places reclamation uses of water from these projects under the Secretary of the Interior and under the applicable reclamation laws. No project in this bill which may include irrigation features is exempted from the reclamation laws.\n\nMr. HILL. I thank the Senator.\n\nMr. OVERTON. The Senate amendment made not only the California projects, but all such projects subject to the irrigation law. In view of the fact that the House concurred in that action by agreeing to section 8 of the bill, I am sure the Senator from Alabama will feel that we have met the question which he has raised. As I stated a while ago, section 8 of the bill clearly places reclamation uses of waters from all projects authorized in this bill under the Secretary of the Interior, and under the applicable reclamation laws.\u003cspan class=\"fnref\"\u003e64\u003c/span\u003e\n\nThe report of the House conferees, though in general terms, also made it clear that section 8 reflected the wishes of the Secretary of the Interior with respect to the application of reclamation law to utilization of multiple-purpose projects for irrigation.\u003cspan class=\"fnref\"\u003e65\u003c/span\u003e There is nothing in the brief House debate on the conference report to contradict this interpretation or the more explicitly expressed views of Senators Hill and Overton.\u003cspan class=\"fnref\"\u003e66\u003c/span\u003e\n\nAppellees' general response to this overwhelming evidence of congressional purpose contrary to their position is to ignore it. In a variety of ways appellees press the argument that Congress did not intend that reclamation law, and particularly acreage limitations, would apply to the Kings River project because the dominant need for Pine Flat Dam was flood control, a matter within the special expertise of the Corps of Engineers; because private irrigation facilities were already in existence in the project area and no additional irrigation facilities were to be constructed; because the water of the Kings River had been completely appropriated and no additional water would be made available by the project; and because the project would bring no additional arid land under irrigation. The obvious difficulty with this argument is that it is contrary to the whole tenor of the legislative history. As has been seen, the legislative struggle was waged on precisely this ground. The very considerations appellees now advance were pressed upon Congress. Congress deliberately decided that while the Corps of Engineers should build Pine Flat Dam on the Kings River and control its operation for flood control, Pine Flat and all other multiple-purpose dams thereafter constructed should be utilized for irrigation under the provisions of the reclamation laws. This was the very purpose of section 8; it was adopted with the Kings River project and other nearby projects specifically, and primarily, in mind.\n\nViewing the conflict in the broader perspective of the reclamation program as a whole, any other outcome would have been surprising. The reclamation program is not primarily one of bringing arid lands under irrigation for the first time. Congress was advised as early as 1924 that one of the first projects approved under the 1902 Act, if not the first, was the Salt River project in Arizona, in which nearly all of the land was privately owned and under irrigation through a system of private canals.The function of the federally financed reclamation reservoir was to furnish water storage needed to conserve and regulate the existing water supply. Six other similar projects were also called to Congress' attention.\u003cspan class=\"fnref\"\u003e67\u003c/span\u003e At this early date, Congress was warned, \"It seems certain that the aid of the Government will be sought in the future to rescue meritorious but distressed private projects . . ..\"\u003cspan class=\"fnref\"\u003e68\u003c/span\u003e The forecast was accurate. The number of instances in which the federal project supplemented existing irrigation steadily increased.In 1961 it was estimated that 60 percent of the total reclamation acreage fell in this category.\u003cspan class=\"fnref\"\u003e69\u003c/span\u003e In the Madera Irrigation District, one of the projects involved in the Ivanhoe Irrigation District litigation, 85,000 of a total of 112,000 acres had been developed for irrigation before the federal project was authorized.\u003cspan class=\"fnref\"\u003e70\u003c/span\u003e The opinion in Ivanhoe takes note of the fact that there was widespread pre-project reclamation and irrigation development before lands were brought within the Central Valley project. 357 U.S. at 283. So general is this phenomenon that a recent commentator has stated, \"reclamation today generally supplies only supplemental water.\"\u003cspan class=\"fnref\"\u003e71\u003c/span\u003e In most of the respects in which appellees seek to distinguish the Kings River project from other projects Congress has made subject to the reclamation laws, therefore, the Kings River project is not an exception, it is the rule.\n\nAppellees assert, however, that the Kings River project is unique in the respect that all of the water of the Kings River had been appropriated, and the project therefore would produce no \"new\" or \"surplus\" water.\u003cspan class=\"fnref\"\u003e72\u003c/span\u003e Appellees' factual premise is questionable, but if it were not, it would not follow that the project does not confer substantial benefits justifying imposition of acreage limitations. The Corps of Engineers and the Bureau of Reclamation agreed that approximately half of the costs of Pine Flat Dam were allocable to irrigation benefits, resulting principally from regulation of the river flow.\u003cspan class=\"fnref\"\u003e73\u003c/span\u003e There would be no inherent unfairness in applying acreage limitations in these circumstances. The federally financed reservoir confers substantial economic benefits upon the landowners by making water available when it otherwise would not be. The price at which excess lands must be sold will include the whole of any value attributable to preexisting irrigation facilities and water rights; only the increase in value attributable to the federal project itself will be excluded.\u003cspan class=\"fnref\"\u003e74\u003c/span\u003e If in the case of the Kings River project the increment is small, as appellees contend, the price appellees will receive for their excess lands will be only slightly below full market price; if it is large the difference will, and should be, concomitantly substantial.In any event, as with all of the other distinguishing features relied upon by appellees, Congress was fully apprised of the almost complete appropriation of Kings River water under existing agreements,\u003cspan class=\"fnref\"\u003e75\u003c/span\u003e and was urged not to authorize construction and operation of Pine Flat Dam by the Bureau under the reclamation laws for this reason, among others.\u003cspan class=\"fnref\"\u003e76\u003c/span\u003e Nevertheless, Congress decided that acreage limitations should apply.\n\nAppellees go so far as to suggest that application of acreage limitation provisions to the Kings River project would be impractical, even absurd, and Congress cannot be thought to have intended this result. The President of the United States, the Secretary of the Interior, and the Commissioner of the Bureau of Reclamation repeatedly urged Congress to provide that the Kings River project and those adjacent to it should be built, maintained, and operated by the Bureau of Reclamation in full compliance with the reclamation laws, including acreage limitations. It is unlikely that a position so insistently pressed by the persons most knowledgeable and in highest authority in the executive branch would be as questionable as appellees suggest. At the very least, Congress could reasonably conclude that what these men urged as required by the public interest and the historical reclamation policy was not illogical or absurd. And of course it was not.\u003cspan class=\"fnref\"\u003e77\u003c/span\u003e\n\nAppellees discuss only Tulare Lake Basin -- which, they say, has no dwellings or economic source of domestic water, is subject to periodic flooding involving economic risks too great for small farmers to bear, and still has an erratic water supply. Assuming all of this, Tulare Lake Basin is not the Kings River project. The Basin includes just over 200,000 acres; the Kings River project contains 1,065,000 acres. No one suggests that it would be impracticable to apply acreage limitation provisions to the project land outside the Basin. Indeed, more than 80 percent of this land is now in individual ownerships in tracts of 160 acres or less. Presumably Congress rested its decision upon the feasibility of acreage limitation in the project as a whole, not the Basin alone, and properly so.\n\nBut even as to the Tulare Lake Basin, appellees' argument is unsound. The lack of on-site housing and domestic water supply is irrelevant. Since 1910 Bureau regulations have provided that the statutory residence requirement is satisfied if the owner lives within 50 miles of his land;\u003cspan class=\"fnref\"\u003e78\u003c/span\u003e a glance at a map will reveal the presence of many communities within this distance of Tulare Lake Basin.\u003cspan class=\"fnref\"\u003e79\u003c/span\u003e Only a small part of Tulare Lake Basin is still subject to frequent flooding.\u003cspan class=\"fnref\"\u003e80\u003c/span\u003e If events were to establish that small individual operations were not practicable on land subject to this residual flood risk, or as to which the water supply may still be too erratic, leasing or consolidation of ownerships would no doubt follow.\u003cspan class=\"fnref\"\u003e81\u003c/span\u003e Congress may well have recognized that even if these adjustments occurred, substantial public interests would have been served by initial breakup of excess holdings at nonspeculative prices. The value of the increased productivity of the land and the substantial nonreimbursable flood control subsidy would have been widely distributed rather than accruing to the few who happened to own large tracts of land when the dam was built. An opportunity would have been afforded for persons of modest means to purchase a small tract of land and establish a farm under the improved water conditions. Even if this should prove infeasible, the changes that did occur would at least reflect the benefits provided by the project; the agricultural economy that emerged would not be dictated by a landownership pattern that existed prior to the substantial public investment.\n\nAppellees argue that section 8 is inapplicable to the Kings River project because section 10 of the Act authorized this project \"substantially in accordance with the plans contained in House Document Numbered 630,\" the report submitted by the Corps of Engineers. Appellees point out that this report recites the various characteristics of the Kings River service area and its water rights along the lines set out above, and, further, that the report says nothing to indicate that acreage limitations were to be imposed.\u003cspan class=\"fnref\"\u003e82\u003c/span\u003e But it is also true that there is nothing in the legislative history to support appellees' premise that if Pine Flat Dam were built on Kings River by the Corps of Engineers in accordance with its plan, section 8 would not apply to the project. The legislative history is precisely to the contrary.\u003cspan class=\"fnref\"\u003e83\u003c/span\u003e\n\nAppellees also contend that the language of section 8 itself excludes the Kings River project.\u003cspan class=\"fnref\"\u003e84\u003c/span\u003e They argue that the third sentence of section 8 (on which the United States' argument for application of reclamation law to the Kings River project rests) is modified by the first two sentences of section 8; and, therefore, that reclamation law applies to dams operated under the direction of the Secretary of War only if the conditions of the first two sentences are satisfied, including the condition that additional works be constructed by the government for irrigation purposes. No such works were built on the Kings River project; ergo, section 8 does not apply. This interpretation would make the third sentence wholly redundant. As the legislative history demonstrates, this sentence was intended to convey a great deal of meaning. Its message is clear from a careful reading of all three sentences, even without resort to the legislative history. The whole of section 8 applies, of course, only to projects that are being operated under the direction of the Secretary of War. The first two sentences deal with situations in which additional works are required to realize the irrigation potential of such a project. In these cases a feasibility determination must be made by the Secretary of War, and authorization for construction of the additional works must be obtained from Congress. Such additional works are then to be constructed, operated, and maintained by the Secretary of the Interior under the reclamation laws. The third sentence is general in coverage; it provides that all dams operated under the direction of the Secretary of War are to be utilized for irrigation only in conformity with the section, i.e., under the reclamation laws; thus bringing under those laws dams for which no additional irrigation facilities are required.\n\nThe legislative history verifies the correctness of this interpretation. In Judge Stone's succinct analysis before the Senate subcommittee, section 8 prescribes \"that where there are irrigation benefits in a flood control reservoir, or if there are other facilities to be constructed by the Reclamation Bureau, to make use of the water stored for irrigation, then there must be compliance fully with the reclamation law.\"\u003cspan class=\"fnref\"\u003e85\u003c/span\u003e Congress was repeatedly advised that a well developed private irrigation system already existed on the Kings River, yet section 8 was adopted with the Kings River project and adjacent projects primarily in mind, for the specific purpose of making the reclamation laws, including acreage limitations, applicable. Moreover, the Senate refused to adopt the O'Mahoney amendment that would have exempted from section 8 \"any dam . . . which supplements any existing locally operated irrigation system.\"\u003cspan class=\"fnref\"\u003e86\u003c/span\u003e To read section 8 as appellees suggest would be to include by implication the substance of the O'Mahoney amendment that Congress expressly declined to adopt\u003cspan class=\"fnref\"\u003e87\u003c/span\u003e -- an amendment specifically directed at the Pine Flat Dam, among others.\n\nEnough has been said to dispose of appellees' related argument that section 8 was intended to apply only to the reclamation of \"arid\" lands (meaning, in appellees' argument, lands not already under irrigation) because section 6 of the House bill used this adjective and section 8 was intended to accomplish only \"technical\" changes in the House version. Only a brief exposure to reclamation jargon is required to learn that all of the land area of the United States west of the 98th meridian is commonly referred to as \"arid or semi-arid.\" The only support for appellees' argument is a self-serving statement by the water master for the Kings River Water Association in the course of the Senate committee hearings that section 6 of the House bill \"will not affect us because we have no arid lands. Our irrigation systems are complete. . . . Consequently, that section should not apply to us.\"\u003cspan class=\"fnref\"\u003e88\u003c/span\u003e No member of the Senate subcommittee commented on the water master's statement. No further mention was made of this notion by either side during the hotly contested effort on the floor of the Senate to exclude the Kings River project and similar projects from section 8.\n\nSome reliance is placed upon incidents occurring after the 1944 Act was passed. They appear to be both trivial and irrelevant. For example, Secretary Ickes claimed a \"sweeping defeat of the California interests,\"\u003cspan class=\"fnref\"\u003e89\u003c/span\u003e and drafted a presidential press release in much this tenor. President Roosevelt instead issued a moderate and restrained announcement. This is hardly a significant indication of the meaning of the statute, especially since there is no evidence that the President disagreed with the Secretary's conclusion. A second example: The Chief of Engineers initially took the position that under section 10 the Secretary of War rather than the Secretary of the Interior was to negotiate repayment contracts with water users on the Kings River and Kern River projects.\u003cspan class=\"fnref\"\u003e90\u003c/span\u003e Eventually, albeit after some pressure from the White House, the Chief of Engineers joined with the Commissioner of Reclamation in a public announcement acknowledging that the Department of the Interior was to be the contracting agency and that the repayment contract was to be negotiated under reclamation law.\u003cspan class=\"fnref\"\u003e91\u003c/span\u003e Whatever the merits of the controversy over which agency should negotiate the contract, it is clear from the legislative history as a whole that the terms negotiated were to be in conformity with the reclamation laws, and particularly with acreage limitation provisions. This was the conclusion reached by the Attorney General in his 1958 opinion. 41 Op. A.G. 377 (1958).\n\nIn sum, the Flood Control Act of 1944 made the provisions of section 46 of the Omnibus Adjustment Act of 1926 applicable to the Pine Flat project.\n\nII\n\nWe consider next whether, by repaying construction charges, owners of excess lands may avoid the obligation under section 46 to execute recordable contracts with the Secretary of the Interior providing for the sale of their excess lands at ex-project prices.\u003cspan class=\"fnref\"\u003e92\u003c/span\u003e This is the more far-reaching of the two grounds for the district court's decision since it affects all federal reclamation projects subject to section 46 of the 1926 Act, not just those authorized in the Flood Control Act of 1944.\u003cspan class=\"fnref\"\u003e93\u003c/span\u003e\n\nIt will be demonstrated in the discussion that follows that appellees' \"payout\" theory is not supported by the language of section 46, the purpose and legislative history of the section, or the administrative practice of the Department of the Interior.\n\nA.\n\nThe Statutory Language\n\nNothing in section 46 suggests that owners of excess lands may at their option prepay construction charges in lieu of agreeing to sell their excess lands at nonspeculative prices. The language of the section is unequivocal and unqualified: (1) \"No water shall be delivered\" from any new project until the Secretary of the Interior has contracted with an irrigation district or districts for payment of costs of construction; (2) such contracts \"shall . . . provide that all irrigable land held in private ownership by any one owner in excess of one hundred and sixty acres shall be appraised . . . and the sale prices thereof fixed by the Secretary on the basis of its actual bona fide value . . . without reference to the proposed construction of the irrigation works\"; and (3) \"no such excess lands so held shall receive water from any project . . . if the owners thereof shall refuse to execute valid recordable contracts for the sale of such lands . . . at prices not to exceed those fixed by the Secretary . . ..\"\u003cspan class=\"fnref\"\u003e94\u003c/span\u003e\n\nThe language attaches no significance to repayment of construction charges. If owners of excess land were to receive project water but escape the obligation to contract to sell excess holdings at ex-project prices by repayment of construction costs, this means of avoiding the apparently absolute condition imposed by section 46 would have to be implied.\n\nFor reasons which follow, implying such an exception to the mandate of section 46 would be unwarranted. As will be shown, such an exception would frustrate the purpose of Congress to secure the division and redistribution on a nonspeculative basis of large private landholdings receiving the subsidy of government financed irrigation benefits. It would be inconsistent with the legislative and regulatory antecedents of section 46 of the 1926 Act, and particularly with section 12 of the Reclamation Extension Act of 1914.\u003cspan class=\"fnref\"\u003e95\u003c/span\u003e It would be contrary to interpretive conduct of the Department of the Interior in administering the reclamation laws, beginning shortly after the adoption of the Reclamation Act of 1902\u003cspan class=\"fnref\"\u003e96\u003c/span\u003e and continuing to date, with a relatively brief hiatus during the 1950's founded upon an obviously mistaken and soon repudiated ruling.\n\nB.\n\nThe Congressional Purpose\n\nIt is a basic goal of the reclamation laws to create family-sized farms in areas irrigated by federal projects. It is also a basic goal of the reclamation laws to secure the wide distribution of the substantial subsidy involved in reclamation projects and limit private speculative gains resulting from the existence of such projects. Public lands on reclamation projects are made subject to entry under the homestead laws in tracts of 160 acres or less in order to preserve the public domain for actual settlers.\u003cspan class=\"fnref\"\u003e97\u003c/span\u003e Similarly, the 160-acre limitation and the requirement in section 46 of the 1926 Act that excess lands be sold at prices excluding enhancement of value from the existence of the project were intended to effect the breakup of large tracts of private lands on reclamation projects and assure the redistribution of such lands in small tracts at nonspeculative prices.\u003cspan class=\"fnref\"\u003e98\u003c/span\u003e\n\nIn Ivanhoe Irrigation District v. McCracken, supra, 357 U.S. at 292, the Supreme Court recognized the vital role acreage limitation provisions play in accomplishing the historic purposes of the reclamation laws:\n\nFrom the beginning of the federal reclamation program in 1902, the policy as declared by the Congress has been one requiring that the benefits therefrom be made available to the largest number of people, consistent, of course, with the public good. This policy has been accomplished by limiting the quantity of land in a single ownership to which project water might be supplied. It has been applied to public land opened up for entry under the reclamation law as well as privately owned lands, which might receive project water.\n\nAnd at 297:\n\n[The 160-acre limitation] is a reasonable classification to limit the amount of project water available to each individual in order that benefits may be distributed in accordance with the greatest good to the greatest number of individuals. The limitation insures that this enormous expenditure will not go in disproportionate share to a few individuals with large land holdings. Moreover, it prevents the use of the federal reclamation service for speculative purposes. In short, the excess acreage provision acts as a ceiling, imposed equally upon all participants, on the federal subsidy that is being bestowed.\n\nAny means of avoiding the acreage limitation and recordable contract requirements of section 46, including the \"payout\" theory advanced by appellees, would necessarily threaten the realization of these purposes.\n\nUnder appellees' theory, the very persons against whom the requirements of section 46 are directed, the owners of excess lands, could avoid these requirements at their option by repaying the costs of construction allocated to irrigation. It is probable that they would elect to do so.The benefits bestowed by a reclamation project often exceed the costs landowners are required to repay.\u003cspan class=\"fnref\"\u003e99\u003c/span\u003e Users of project water for irrigation are not charged with project costs attributable to navigation, flood control, salinity prevention, production of hydroelectric power, storage of water for industrial and municipal uses, and other uses not directly related to irrigation.\u003cspan class=\"fnref\"\u003e100\u003c/span\u003e They may, however, receive substantial benefits from such nonreimbursable expenditures. Over half the cost of the Kings River project, for example, was allocated to flood control and was not charged to irrigators.\u003cspan class=\"fnref\"\u003e101\u003c/span\u003e Yet the benefit of flood control accrued almost entirely to irrigators through elimination of flood damage to soil, crops, and livestock in the Tulare Lake Basin\u003cspan class=\"fnref\"\u003e102\u003c/span\u003e -- a portion of the Kings River service area in which excess holdings predominate. Obviously, it would be to the advantage of the owners of excess land to pay off construction costs allocated to irrigation and retain their excess lands, enhanced in value by this substantial additional subsidy, or sell them at prices reflecting the subsidy.\u003cspan class=\"fnref\"\u003e103\u003c/span\u003e Moreover, the value attributable to improved productivity of the land when irrigated may exceed the cost of irrigation facilities, even aside from the element of subsidy. Congress anticipated that this would be true, and was aware of the consequent serious potential for speculation.\u003cspan class=\"fnref\"\u003e104\u003c/span\u003e It was the purpose of the requirement of section 46 that excess lands be sold at ex-project prices to eliminate this windfall advantage.\u003cspan class=\"fnref\"\u003e105\u003c/span\u003e Thus, because of subsidy and increased productivity, the charges to be repaid by irrigators normally represent only a part of the enhancement in value resulting from the project. By paying off the allocated costs, large landowners would secure this enhanced value for themselves at a fraction of its worth.\n\nPerhaps such a result might be justified if the provision in section 46 for a contract to sell excess lands at ex-project prices were nothing more than a device to induce immediate repayment of the government's investment. But obviously it is not.\u003cspan class=\"fnref\"\u003e106\u003c/span\u003e It is the means adopted by Congress to achieve broader antimonopoly and antispeculation purposes conceived by Congress to be of importance to society as a whole. Section 46 was intended to accomplish the redistribution of large privately owned tracts at prices substantially below the actual value of such lands at the time of sale.It is irrational to suppose that Congress would have given an option to the owners of such excess lands to prevent the accomplishment of the purposes Congress sought to achieve -- an option their self-interest would often compel them to exercise. They would be free to convert the product of large public investment to personal gain either by farming their entire holdings under the improved water supply or by selling or leasing all or a portion of those holdings at prices capitalizing the full benefits of the project. Congress' intention to secure the breakup and redistribution of such private holdings at ex-project prices by means of the requirements of section 46 would be frustrated, and the subsidy-distribution and antispeculation purposes of Congress would not be accomplished.\u003cspan class=\"fnref\"\u003e107\u003c/span\u003e\n\nThe record in this case illustrates the consequences of an implied \"payout\" exception to section 46. The Tulare Lake Canal Company has already paid the construction charges allocated to a substantial portion of project land. The circumstances surrounding this litigation strongly suggest that others would follow suit if it were determined that by doing so the landowners would be relieved of the obligation to sell their excess land at ex-project prices. The result would be to leave as much as 30 percent of the service area in holdings of more than 160 acres. Over 157,000 acres in the Tulare Lake Basin Water Storage District alone would remain in excess holdings averaging 2,600 acres each. There would be no distribution of the flood control subsidy realized by irrigators, no limitation on windfall gains resulting from construction of Pine Flat Dam, no opportunity for others to acquire small landholdings at reasonable prices and attempt to establish family-sized farms in the Tulare Lake Basin and elsewhere in the Kings River service area.\n\nC.\n\nThe Statutes and Regulations\n\nIt would be inconsistent with reclamation law as developed by statute and regulation over nearly 75 years to now imply a \"payout\" exception to the requirement of section 46 of the 1926 Act.\n\nIt is important to define the issue clearly. The question presented in this case is whether, by payment of construction charges, the initial breakup of excess landholdings in single ownership can be avoided -- in other words, whether owners of excess lands may, by paying construction costs, retain those lands and secure the right to the use of project water on them. The question is not whether a person who has disposed of his excess holdings, or irrevocably committed himself in a recordable contract to do so, may therefter acquire additional project lands when construction costs allocated to his 160-acre tract have been paid and other conditions precedent to the full vesting of the right to receive project water for that tract have been satisfied.\n\nThe two questions are quite different. If payout could relieve owners of excess land of the obligation to contract to sell such land, the acreage limitation could be lifted even before it was implemented, and the social purposes of the limitation could be totally frustrated. However, once excess lands have been sold or irrevocably committed to sale in tracts of no more than 160 acres at prices that do not reflect the existence of the project, the purposes of the acreage limitation have been realized to a substantial extent. An opportunity has been afforded for wide distribution of irrigation subsidy and windfall gain and for the establishment of family farms and small individual holdings. This will remain true even if individual owners thereafter expand their holdings beyond 160 acres by purchasing additional land with appurtenant fully vested water rights.\n\nMoreover, when full payment has been made and a claim to use of project water on a 160-acre tract has ripened into a vested water right, another recognized policy of the law becomes relevant. It is an established principle of homestead law that \"When the patent issued, the full legal title passed to the patentee. He could do with the land that which he saw fit, sell or give it away . . . .\" Hartman v. Butterfield Lumber Co., 199 U.S. 335, 337, 50 L. Ed. 217, 26 S. Ct. 63 (1905). The same rule may govern a fully vested water right. Once complete legal title to such a right has been acquired, it can be argued that the right should be freely alienable; that no restraint should be imposed upon subsequent purchase or sale, including any limitation on the amount of land having appurtenant vested water rights that may be acquired.\u003cspan class=\"fnref\"\u003e108\u003c/span\u003e\n\nWhatever the merits of this proposition,\u003cspan class=\"fnref\"\u003e109\u003c/span\u003e it is not the issue here. Our question is whether the initial breakup of excess holdings may be avoided by \"payout.\"\n\nWith this distinction in mind, certain relevant conclusions may be drawn from the background of reclamation statutes and regulations in effect prior to passage of the 1926 Act. These will be summarized briefly in the paragraph that follows and discussed thereafter in greater detail.\n\nFor the policy reasons stated earlier, Congress has consistently sought to limit initial holdings of public and private lands eligible to receive reclamation project water to 160 acres. Grants of public land were expressly so limited in the original Reclamation Act of 1902. In the 1902 Act, Congress sought to achieve the breakup of large holdings of private land by limiting water delivery to 160 acres. In administering this statute the Department of the Interior sought to secure commitments to sell excess lands prior to delivering water, and, in most cases, prior to undertaking construction of a project.Under the complex regulatory scheme adopted by the Department, it would have been impossible to avoid this initial breakup of excess holdings by paying construction costs. Building on this administrative practice, Congress included provisions in the Reclamation Extension Act of 1914 and later in section 46 of the 1926 Act expressly requiring owners of private land to agree to sell excess holdings. There is no provision in any of these statutes authorizing avoidance of acreage limitations by payment of construction costs. There is no mention of such a theory in the legislative history of any of these statutes. Each statute evinces a continuing purpose to limit initial private holdings to 160 acres and compel the redistribution of larger estates. In adopting the recordable contract requirement in section 46 of the 1926 Act, Congress intended to strengthen the excess land limitation, not to weaken it. Accordingly, it would be inconsistent with the statutory and regulatory antecedents of section 46, as well as the immediate legislative history of that section, to imply an option to purchase immunity from initial breakup by means of \"payout.\"\n\n(1) 1902-1912\n\nCongress effectively restricted the size of individual holdings of public land on reclamation projects by providing in sections 3 and 4 of the Reclamation Act of 1902 that homestead entries on such projects would be limited to a farm unit of from 40 to 160 acres as the Secretary might determine to be required to support a family.\u003cspan class=\"fnref\"\u003e110\u003c/span\u003e Persons who entered a tract of 160 acres of project land under the homestead laws before the Secretary made this determination were required to relinquish or dispose of the portion of the original 160-acre entry in excess of one farm unit.\u003cspan class=\"fnref\"\u003e111\u003c/span\u003e\n\nCongress sought to limit private land holdings on reclamation projects to 160 acres and bring about the division and redistribution of larger tracts by providing in section 5 of the 1902 Act that project water should not be sold for a tract in excess of 160 acres to any one landowner.\u003cspan class=\"fnref\"\u003e112\u003c/span\u003e Section 5 also required the owner of private land to reside on or in the neighborhood of the 160-acre tract receiving project water.\u003cspan class=\"fnref\"\u003e113\u003c/span\u003e The purpose of these provisions, as the House Committee on Irrigation of Arid Lands explained, was to \"compel the breaking up of any large tracts now held for which water rights from Government works are to be obtained by limiting the area of lands the property of any one landowner for which a water right may be acquired to 160 acres and requiring residence or occupancy of the land by the owner. \"\u003cspan class=\"fnref\"\u003e114\u003c/span\u003e\n\nThe provisions of the 1902 Act imposing acreage limitations on public land entries in reclamation projects accomplished Congress' purpose and remain the law today. Clearly these provisions cannot be avoided by paying irrigation construction charges. The legislative history of the 1902 Act establishes that Congress intended the limitations imposed upon owners of private land in reclamation projects to accomplish precisely the same purposes in essentially the same way as the limitation imposed upon public lands in such projects.\u003cspan class=\"fnref\"\u003e115\u003c/span\u003e The reasons for rejecting a \"payout\" exception to these limitations with respect to public lands, rooted in the congressional purposes, apply equally to private lands.\n\nFor example, no one contends that an entryman has ever been permitted to obtain a patent from the United States for more than 160 acres of public land and a right to water to irrigate that land simply by paying the nominal fee for the land, satisfying residency and cultivation requirements, and repaying irrigation construction costs allocated to the larger tract. Yet appellees' payout principle would permit just such a circumvention of the quantitative limitation imposed upon water rights granted by the government to private landowners. We can think of no reason why the result should be different because the private owner obtains water rather than land, especially since the right to reclamation project water generally constitutes a much more substantial benefit than a patent to arid land.\u003cspan class=\"fnref\"\u003e116\u003c/span\u003e\n\nNor does anyone suggest that if an entry on public land had been within the 160-acre limitation but exceeded the acreage later determined by the Secretary to constitute a farm unit capable of supporting a family, the entryman could have paid the construction charges on the entire entry and avoided the requirement that he relinquish or sell that portion in excess of a farm unit. The Department's regulations would have foreclosed such a possibility.\u003cspan class=\"fnref\"\u003e117\u003c/span\u003e Again, the substantial reasons for denying public land entrymen the option to retain excess land and water by paying nominal land fees and the cost of constructing irrigation facilities also require denial to private landowners of the option to retain the right to receive project water for excess land.\n\nFinally, the strength of the policy favoring distribution of reclamation benefits to actual settlers is reflected in the fact that entrymen on public land in reclamation projects have never been permitted to commute even the statutory residence and cultivation requirements by early payment, as other homestead entrymen do.\u003cspan class=\"fnref\"\u003e118\u003c/span\u003e The stricter limitations imposed on entrymen on public lands in reclamation projects by the 1902 Act were intended \"to prevent the possibility of speculative holdings or the accumulation of large tracts in single ownerships.\"\u003cspan class=\"fnref\"\u003e119\u003c/span\u003e The same policy considerations argue against allowing private landowners to commute by early payment the requirement that they dispose of excess lands as a condition to receiving project water.\n\nSteps taken by the Department of the Interior in administering the 1902 Act reflect the view that private lands on reclamation projects, like public lands, were to be made available for settlement in tracts of 160 acres or less, and that prepayment of construction costs would not have been an acceptable alternative to the accomplishment of this objective. The Department moved expeditiously to secure the initial breakup of excess private holdings. Retention of excess acreage and receipt of project water for that acreage after full payment of charges would have been incompatible with the means the Department adopted.\n\nThe feasibility of projects containing private lands often depended on bringing such lands under irrigation so that the costs of the project could be spread and the repayment obligation could be kept within practicable limits. Since under section 5 of the 1902 Act water could not be furnished to more than 160 acres in single ownership, it was necessary to insure, prior to construction, that large private holdings would be broken up and redistributed in tracts of this size.\n\nThe Department formed and utilized water users' associations to accomplish this purpose.\u003cspan class=\"fnref\"\u003e120\u003c/span\u003e These associations became \"an integral part of the project and directly associated with the Government in carrying out the details thereof,\"\u003cspan class=\"fnref\"\u003e121\u003c/span\u003e including acreage limitations.\u003cspan class=\"fnref\"\u003e122\u003c/span\u003e The associations were required to enter into contracts with the United States guaranteeing repayment of each member's share of the project's construction charges,\u003cspan class=\"fnref\"\u003e123\u003c/span\u003e and the government in turn promised to deliver water only to association members.\u003cspan class=\"fnref\"\u003e124\u003c/span\u003e To bring about the redistribution of excess private holdings, the Department approved a form of agreement between the association and its members requiring the latter to sell holdings in excess of 160 acres or to execute a trust deed empowering the association or a designee of the Secretary of the Interior to sell them.\u003cspan class=\"fnref\"\u003e125\u003c/span\u003e Since these agreements were entered into before the project was built, as a means of insuring the project's feasibility,\u003cspan class=\"fnref\"\u003e126\u003c/span\u003e they were executed before construction costs could be estimated, much less repaid.\u003cspan class=\"fnref\"\u003e127\u003c/span\u003e\n\nThe effect of these agreements was reinforced by departmental regulations. The Department required the filing of a water right application as a condition to receiving project water. An application for more than 160 acres would not be accepted from any one person.\u003cspan class=\"fnref\"\u003e128\u003c/span\u003e The limitation was absolute; there was no provision for an exception if construction charges were paid. Further, the applicant was required to belong to the water users' association,\u003cspan class=\"fnref\"\u003e129\u003c/span\u003e which, as we have seen, would also require him to sell his excess land or execute a trust deed for its sale.\u003cspan class=\"fnref\"\u003e130\u003c/span\u003e Thus, the tender of full payment, either at the time of application or at some later date, would have come too late to avoid the initial breakup of excess holdings.\n\nAt least as early as April of 1912, a water right application would not be accepted unless it included all the applicant's land.\u003cspan class=\"fnref\"\u003e131\u003c/span\u003e This provision, coupled with the overall limit of 160 acres to an application, also had the effect of requiring the applicant to dispose of holdings in excess of 160 acres before he could apply for project water.\u003cspan class=\"fnref\"\u003e132\u003c/span\u003e\n\nAll of these regulations are still in effect.\u003cspan class=\"fnref\"\u003e133\u003c/span\u003e Their language is as unqualified as that of the statutes they seek to implement. None accords any significance to the prepayment of construction charges.\n\n(2) 1912-1914\n\nDespite this elaborate system of controls through water users' associations, trust deeds, water rights applications, and administrative regulations, Congress was disappointed in its expectation that the provision of the 1902 Act for withholding project water from excess lands would lead to the prompt breakup of large tracts of private land. In 1914 Congress adopted a more direct and effective means to accomplish this objective.\n\nBefore turning to the 1914 Act however, mention must be made of the Act of August 9, 1912,\u003cspan class=\"fnref\"\u003e134\u003c/span\u003e for an inference drawn from a phrase in a proviso to a section of this Act was the principal basis for the Department's recognition of a \"payout\" exception to acreage limitation requirements for a period in the 1950's -- indeed, as will be seen, it is the foundation upon which the entire \"payout\" argument ultimately rests.\u003cspan class=\"fnref\"\u003e135\u003c/span\u003e\n\nThe 1912 Act was not directed to the acreage limitation problem. Its purpose was to enable entrymen and private landowners on reclamation projects to obtain title before final payment to use as security for loans needed to develop their farms.\u003cspan class=\"fnref\"\u003e136\u003c/span\u003e To that end, section 1 of the 1912 Act provided that a patent to public land or a water right certificate for private land would issue upon proof of residence, reclamation, and cultivation, and payment of construction charge installments then due. Section 2 gave the United States a lien for construction charges not yet due.\u003cspan class=\"fnref\"\u003e137\u003c/span\u003e Section 3 provided that a certificate evidencing satisfaction of the lien was to issue upon full repayment of construction charges. The proviso in question then appears, reciting, in substance, that no person shall \"acquire, own or hold\" more than 160 acres of land \"for which entry or water-right application shall have been made . . . before final payment in full of all installments of buildings and betterment charges shall have been made.\"\u003cspan class=\"fnref\"\u003e138\u003c/span\u003e Proponents of the \"payout\" theory have inferred from the last quoted phrase that after construction charges have been paid the acreage limitation is no longer applicable, and, therefore, excess private holdings may be retained in the first place simply by paying construction costs.\n\nThe initial inference may be justified,\u003cspan class=\"fnref\"\u003e139\u003c/span\u003e although it is irrelevant to this case. But the final conclusion is clearly wrong. The essential distinction is that drawn at the outset of this section between the unqualified obligation to comply with the acreage limitation as a condition to first securing a right to project water, and the ability to buy and sell a right to such water once that right has vested. Section 3 speaks only to the latter point; it does not purport to address the question of initial breakup of excess holdings.\n\nOn its face, the proviso contemplates that it will apply to private lands \"for which . . . water right application shall have been made.\" As has been shown, under administrative practice and regulations in effect in 1912 an applicant was required to sell his excess lands or irrevocably commit them to sale before his water right application could be accepted. There is not a word in the legislative history of the 1912 Act intimating an intention to abrogate these regulations and administrative practices; the regulations were reissued in more explicit form in 1916, and, indeed, remain in effect today.\u003cspan class=\"fnref\"\u003e140\u003c/span\u003e Thus, the proviso to section 3 applies by its terms only to a person who has never owned more than 160 acres or who had already reduced his holdings to that size by selling the excess or executing a trust deed for its sale. The proviso deals with the problem of subsequent acquisition of additional project land by such a person; it does not apply to the initial retention of excess lands.\n\nSections 1 and 2 of the 1912 Act advanced the time at which a patent or water right certificate could issue. Under principles of homestead law referred to earlier, this might also have advanced the time at which project lands and water rights could be purchased and sold free of acreage limitations.\u003cspan class=\"fnref\"\u003e141\u003c/span\u003e The apparent purpose of the proviso to section 3 was to delay freedom to alienate and accumulate lands with vested project water rights until all construction charges had been repaid, even though a patent or water right certificate had issued.\u003cspan class=\"fnref\"\u003e142\u003c/span\u003e This was the contemporaneous construction of the statute by the Secretary of the Interior, who, in recommending to the President that he sign the bill, stated that the purpose of the proviso was \"to prevent the consolidation of holdings until such time as full and final payment of the building charges shall have been made. \"\u003cspan class=\"fnref\"\u003e143\u003c/span\u003e\n\nInterpretative instructions -- commonly known as the King Instructions -- issued two years later by Will R. King, Chief Counsel of the Reclamation Service, construed the proviso to section 3 in this same way.\u003cspan class=\"fnref\"\u003e144\u003c/span\u003e The King Instructions treat the proviso as dealing only with the acquisition or purchase of project lands after the acquiring landowner has complied with acreage limitations and other conditions to obtaining a vested water right. Two previous departmental opinions had intimated that the proviso in section 3 of the 1912 Act limited to 160 acres the area for which a person could hold project water rights \"even after he has discharged all his obligations to the Government, except for operation and maintenance\" charges -- i.e., that a project landowner was forever prohibited from expanding his holdings. Chief Counsel King read the proviso in light of the public land law principle supporting free alienability of rights that have vested \"after having complied in full with the provisions of the law in order to acquire the title.\"\u003cspan class=\"fnref\"\u003e145\u003c/span\u003e He concluded that additional lands could be acquired by a person holding a tract of 160 acres or less if he first paid all charges on his own tract or if the charges on the tract to be acquired had already been paid by the previous owner.\n\nThe King Instructions did not address the question of initial compliance with acreage limitations. Such compliance necessarily preceded any possible application of the King Instructions. In order to have \"discharged all his obligations to the Government\" or to have \"complied in full with the provisions of the law in order to acquire\" a project water right and thereby invoke the public law principle of free alienability relied upon by the Chief Counsel, the purchasing and selling landowners would first have had to reduce their holdings to 160 acres as required by the regulations then in effect. Thus, the King Instructions, like the proviso to section 3 of the 1912 Act they construed, are relevant only to the subsequent acquisition of additional lands by persons who have never owned more than 160 acres of project land or have already reduced their holdings to that figure, or agreed to do so, in order to come into initial compliance with the acreage limitations.\u003cspan class=\"fnref\"\u003e146\u003c/span\u003e Excess landowners in the Kings River service area do not fall into any of these categories.\n\nIf there could be any lingering doubt, the Reclamation Extension Act of 1914\u003cspan class=\"fnref\"\u003e147\u003c/span\u003e made it absolutely clear that no inference of congressional approval of a \"payout\" theory based on the 1912 Act could possibly apply to the purchase of immunity from the requirement that initial excess holdings of private lands must be broken up as a condition to receiving project water.\n\nFor a variety of reasons, the Department's regulatory scheme to implement the mandate of section 5 of the 1902 Act was not as effectively enforced as it might have been.Large tracts of private land remained in sigle ownership in reclamation projects.\u003cspan class=\"fnref\"\u003e148\u003c/span\u003e Moreover, lands sold pursuant to the trust deeds or directly by the original owners often commanded extraordinary prices from the actual settler, bestowing a windfall profit on the original owner and imposing an added burden on the settler.\n\nSection 12 of the 1914 Act was designed to eliminate these problems on future projects. This provision gave the force of positive statutory law to the requirement that private landowners must agree at the outset to dispose of their excess holdings as a condition to receiving project water. Also, for the first time, it imposed controls on the price at which excess lands could be sold. Section 12 reads as follows:\n\nThat before any contract is let or work begun for the construction of any reclamation project hereafter adopted the Secretary of the Interior shall require the owners of private lands thereunder to agree to dispose of all lands in excess of the area which he shall deem sufficient for the support of a family upon the land in question, upon such terms and at not to exceed such price as the Secretary of the Interior may designate; and if any landowner shall refuse to agree to the requirements fixed by the Secretary of the Interior, his land shall not be included within the projects if adopted for construction.\u003cspan class=\"fnref\"\u003e149\u003c/span\u003e\n\nIt is patent on the face of this provision that Congress did not intend to permit private landowners to avoid the necessity of agreeing to sell their excess land by prepaying construction charges. The section required landowners to agree to sell excess lands \" before any contract [was] let or work begun for the construction\" of the project. Under section 4 of the 1902 Act, the Department could not compute estimated costs of construction until after contracts had been let.\u003cspan class=\"fnref\"\u003e150\u003c/span\u003e Indeed, Congress had been advised that because final costs of construction so often exceeded original estimates, it was the Department's policy not to announce construction charges until a reclamation project was completed.\u003cspan class=\"fnref\"\u003e151\u003c/span\u003e Payout of construction charges at either time would have come too late to avoid the requirement that the owner of excess land agree to sell the excess at prices fixed by the Secretary.\n\nTo have permitted owners of excess land to avoid the requirements of section 12 by \"payout\" would also have been contrary to the repeatedly stated congressional purpose to break up and redistribute large private landholdings at nonspeculative prices.\u003cspan class=\"fnref\"\u003e152\u003c/span\u003e\n\nIn contrast, there is nothing to support the notion that the breakup of excess holdings at nonspeculative prices under section 12 of the 1914 Act could be avoided by paying construction costs, either in the legislative history\u003cspan class=\"fnref\"\u003e153\u003c/span\u003e or in any other provision of the 1914 Act.\u003cspan class=\"fnref\"\u003e154\u003c/span\u003e Moreover, as noted earlier, the pre-1914 regulatory scheme, incompatible with an option to retain excess acreage by paying construction charges, remained in effect after the passage of the 1914 Act.\u003cspan class=\"fnref\"\u003e155\u003c/span\u003e\n\n(3) 1914-1926\n\nSection 46 of the 1926 Act was derived from section 12 of the 1914 Act.\u003cspan class=\"fnref\"\u003e156\u003c/span\u003e It was designed to achieve the antimonopoly and antispeculation policies of the earlier statute more effectively by closing loopholes disclosed by the 1924 report of a special committee appointed by the Secretary of the Interior known as the Fact Finders.\u003cspan class=\"fnref\"\u003e157\u003c/span\u003e It is evident from the Fact Finders' report, relevant congressional proceedings, and the provisions of section 46 that Congress intended to continue its policy of securing the initial breakup of excess holdings of private land and did not intend to allow this objective to be frustrated at the option of owners of excess land.\n\nThe Fact Finders' report emphasized that the central purposes of the reclamation law were to encourage family farms, distribute the reclamation subsidy widely, and avoid speculation. It pointed out that large tracts of private land remained in private ownership and that speculation had not been eliminated; it noted that the reclamation law had been amended to require holders of excess lands to sell their surplus, but that the law had not fully accomplished its antimonopoly and antispeculation purposes.\u003cspan class=\"fnref\"\u003e158\u003c/span\u003e\n\nTo meet these problems the report recommended \"that no reclamation project should hereafter be authorized until all privately owned land in excess of a single homestead unit for each owner shall have been acquired by the United States or by contract placed under control of the Bureau of Reclamation for subdivision and sale to settlers at a price approved by the Secretary.\"\u003cspan class=\"fnref\"\u003e159\u003c/span\u003e A draft of proposed legislation attached to the report provided that as a general rule excess lands should be acquired by the United States and should then be made subject to disposition under the reclamation laws in the same manner as other public lands.The draft legislation provided that the alternative of requiring contracts to sell at prices approved by the Secretary -- the model for the recordable contract requirement in section 46 of the 1926 Act -- was to be utilized in connection with the large tracts held by federal land grantees, such as railroads.\u003cspan class=\"fnref\"\u003e160\u003c/span\u003e It was thought that intermediate acquisition by the United States of such large holdings would cause an unacceptable drain on the reclamation fund.\u003cspan class=\"fnref\"\u003e161\u003c/span\u003e\n\nBoth alternatives proposed by the Fact Finders were incompatible with a \"payout\" theory. It could not have been thought that by paying construction charges after the project had been completed and those charges had been determined, the original owner of excess lands could compel the government to terminate the interest of any intervening settler on the excess land and relinquish the government's fee title to such land, or surrender the government's vested contract right to sell the excess land of federal grantees at prices fixed by the Secretary.\n\nThe differences between section 46 of the 1926 Act and the recommendations of the Fact Finders are minor. They reflect no weakening of the congressional will to require the breakup of excess holdings, and no approval of avoidance by payout.\n\nAs finally passed, section 46 adopted the Fact Finders' alternative of requiring owners of excess land to contract to sell such land at prices fixed by the Secretary and extended this procedure to all owners of excess land, rather than confining it to federal grantees. The Fact Finders' report does not suggest that this alternative was to be any less absolute than the alternative of outright acquisition by the United States. The reason for the choice was concern that acquisition by the United States would prove costly and productive of delay no matter who owned the excess land.\u003cspan class=\"fnref\"\u003e162\u003c/span\u003e The congressional committee was told that any alternative that would assure sale of excess lands directly to actual settlers at nonspeculative prices would serve Congress' purposes just as well.\u003cspan class=\"fnref\"\u003e163\u003c/span\u003e The committee was advised, in effect, that the alternatives of intermediate acquisition by the United States and direct sale to actual settlers pursuant to a contract placed under the control of the Department were equivalents,\u003cspan class=\"fnref\"\u003e164\u003c/span\u003e and proceeded on that assumption.\u003cspan class=\"fnref\"\u003e165\u003c/span\u003e\n\nUnder the Fact Finders' proposal, construction could not have begun until all owners of excess lands transferred such land to the United States or contracted to sell it at government-fixed prices, just as under section 12 of the 1914 Act. As we have shown, subsequent \"payout\" could not have avoided disposal. Section 46 as passed allows construction to proceed, but bars delivery of project water to excess land until a recordable contract for its sale is executed. The reasons for the change are clear, and reflect no diminution of Congress' determination to break up excess landholdings. In the course of committee hearings, it was pointed out that under the Fact Finders' proposals, construction of a project might be prevented or delayed if even one owner refused to transfer or contract to sell excess land;\u003cspan class=\"fnref\"\u003e166\u003c/span\u003e Congress obviously thought it necessary to avoid such an impasse.\u003cspan class=\"fnref\"\u003e167\u003c/span\u003e In addition, Congress thought it would be difficult to negotiate contracts requiring sale of excess holdings at nonspeculative prices until the government evidenced its good faith by affirmative action. Congress was assured that its purpose would be achieved as readily by conditioning the delivery of water, rather than the commencement of construction, upon the execution of the desired contracts.\u003cspan class=\"fnref\"\u003e168\u003c/span\u003e\n\nThus, neither respect in which section 46 of the 1926 Act differs from the Fact Finders' recommendations reflects a purpose to soften the impact of acreage limitations.\n\nSection 46 was adopted to meet two problems that had developed in the administration of the 1914 Act.\u003cspan class=\"fnref\"\u003e169\u003c/span\u003e Ironically, the means adopted by Congress to close one of the loopholes in the 1914 Act is seized upon to support the theory that acreage and price controls may be avoided completely by \"payout.\" It is argued that the clause following the recordable contract provision in section 46\u003cspan class=\"fnref\"\u003e170\u003c/span\u003e permits an owner of excess land to free himself of the requirement that the Secretary approve the price at which such lands are sold by paying half of the construction charges attributable to them, and thereby recognizes at least a partial \"payout\" theory. This is a patent misconstruction of the meaning and purpose of the clause in question. Its purpose and effect was to strengthen the Secretary's hand in dealing with speculative sales, not to weaken it by permitting avoidance of price controls by partial \"payout.\"\n\nThe portion of section 46 preceding the clause in question restates the absolute requirement, drawn from the 1914 Act, that to obtain project water, initial owners of excess land must agree to sell such land at prices fixed by the Secretary. The purpose of this provision, as we have seen, is to compel the initial sale of excess lands at prices excluding enhancement from the presence of the project. The 1914 Act did not, however, give the Secretary authority to control the price at which the excess lands were thereafter resold by the purchaser. As a consequence, the landowners avoided the price limitation on the sale of excess lands by selling such lands to middlemen who then resold them at unregulated prices, often on the original owner's behalf.\u003cspan class=\"fnref\"\u003e171\u003c/span\u003e The clause in question was included in section 46 to meet this problem, at least in part, by enabling the Secretary to control the price at which some resales were made.\u003cspan class=\"fnref\"\u003e172\u003c/span\u003e\n\nThe construction of the clause suggested by \"payout\" proponents would permit the owner of excess land to sell that land at speculative prices by paying half the construction costs. In many if not most instances, as we have seen, owners of land would exercise this option, even at twice the price. Thus the construction suggested by appellees, though not affecting the requirement that excess land be sold, would effectively negate the bar against sale of excess land at speculative prices. Why Congress would wish such a result is not suggested.It would conflict directly with Congress' intent to place additional curbs on speculation and windfall gain. When the clause in question is confined to sales subsequent to the initial sale of excess lands, as intended, it does not embody a partial \"payout\" principle as appellees argue.\n\nIn sum, the historical background of section 46 of the 1926 Act leaves no room for an implied option to avoid initial breakup of excess landholdings by paying construction costs. Admittedly, no such option is available as to public lands, and the same purposes were intended to be served by the application of the acreage limitation to private lands. The regulations formulated by the Department of the Interior before 1926 contemplated the initial breakup of excess private holdings, and were incompatible with avoidance of that requirement by a \"payout\" of construction costs. The Act of 1912 is not to the contrary; it is concerned with acquisitions after rights have vested, not with the breaking up of initial holdings -- a condition to the vesting of rights in the first instance. The Act of 1914 in effect adopted the procedure reflected in the Department's administrative practices and regulations. On its face, the 1914 Act is inconsistent with the notion that initial breakup of excess lands could be avoided by paying construction costs. Section 46 of the 1926 Act is based upon the 1914 Act. The 1926 Act was intended to make the acreage limitation and antispeculative provisions more effective, not less. The Fact Finders' report and relevant legislative hearings reflect that the means adopted in section 46 was considered to be equivalent, for these purposes, of outright acquisition of excess lands by the government at the outset -- an arrangement that would have made avoidance by \"payout\" impossible.\n\nD.\n\nAdministrative Interpretation\n\nIt is argued, however, that the conduct of the Department of the Interior in administering the statute indicates that the Department inferred an exception to section 46 if construction costs were paid. Except for a relatively brief period in the 1950's, the administrative interpretation is either inferentially or expressly to the contrary.\n\nAs has been shown, the regulations adopted before 1926 were premised upon initial breakup of excess holdings and were incompatible with avoidance of that requirement by paying construction charges. This is not to imply that the regulations were deliberately designed to this end. The suggestion that disposition of initial excess acreage could be avoided by paying construction charges does not appear to have occurred either to Congress or to the Department of the Interior during this period. There is no evidence of a single instance between 1902 and 1926 in which the Department agreed that repayment of construction charges would permit the original owner of excess lands to receive project water for such lands without first selling or agreeing to sell them.\u003cspan class=\"fnref\"\u003e173\u003c/span\u003e\n\nFrom 1926 to the middle 1940's the case for administrative recognition of a payout exception to section 46 rests primarily upon passages culled from less than a score of letters and internal memoranda prepared in the course of over 15 years of the Department's daily operations. This material was selected from the Department's files in 1955 in response to a congressional inquiry into the legitimacy of a proposed \"payout\" option in contracts affecting owners of excess lands in the Kings River project. The showing is hardly impressive. The volume of material is strikingly meager for so extensive a program. More important, nearly all of the material in the collection appears on its face to be irrelevant to appellees' \"payout\" theory. Almost all of the excerpts are generalized statements derived from section 3 of the 1912 Act and the King Instructions. They do not concern the initial breakup of excess holdings, but the subsequent purchase, sale, or consolidation of vested rights by water users who had already reduced their holdings to 160 acres or committed themselves to do so.\u003cspan class=\"fnref\"\u003e174\u003c/span\u003e\n\nSince the middle of 1940's, the history of the acreage limitation has been to a large extent a reflection of the unsuccessful struggle of owners of large tracts of land in California, including the Kings River area, \"to obtain the Federal irrigation investment without accepting the acreage limitations.\"\u003cspan class=\"fnref\"\u003e175\u003c/span\u003e\n\nAn effort to obtain legislative exemption from acreage limitations, of the Central Valley project was defeated in 1944.\u003cspan class=\"fnref\"\u003e176\u003c/span\u003e In the same year landowners in the Kings River service area, especially those in the Tulare Lake Basin, also sought a legislative exemption from acreage limitations for the Kings River project and other nearby projects during consideration of the Flood Control Act. Appellees argue here that the Flood Control Act did in fact include both a total exemption and a \"payout\" option. The reasons for rejecting the argument that Congress granted landowners on the Kings River project a total exemption in the Flood Control Act were set out in Part I of this opinion. The fallacies in the somewhat inconsistent argument that Congress in the same statute also authorized the landowners to escape section 46 of the 1926 Act by \"payout\" are summarized in the margin.\u003cspan class=\"fnref\"\u003e177\u003c/span\u003e In 1947 a proposal to exempt projects in California, Colorado, and Texas died in committee after extensive hearings.\u003cspan class=\"fnref\"\u003e178\u003c/span\u003e In 1950 and 1951 bills were introduced to relieve Kings River landowners of acreage limitations in return for a lump sum payment of construction costs; neither passed.\u003cspan class=\"fnref\"\u003e179\u003c/span\u003e\n\nFollowing this series of defeats in Congress, Kings River water users turned to the Department of the Interior for relief. These efforts also ultimately failed, but only after a highly controversial period of several years, begining in late 1953, during which the Department authorized and conducted negotiations with Kings River water users on the premise that lump sum prepayment would relieve them of acreage limitations.\u003cspan class=\"fnref\"\u003e180\u003c/span\u003e Only during this relatively brief period, more than 25 years after passage of the last comprehensive acreage limitation statute, did the Department officially adopt appellees' \"payout\" principle.\n\nProponents and opponents alike attributed the origins of the theory of \"payout\" as an alternative to contracting to sell excess lands solely to a memorandum prepared in 1947 by Felix S. Cohen, Associate Solicitor of the Department of the Interior.\u003cspan class=\"fnref\"\u003e181\u003c/span\u003e The Cohen opinion was thought to have established that payment of construction charges by an irrigation district released its constituent owners of excess land from the obligation to execute recordable contracts as a condition precedent to receiving project water for that land.\n\nThe reasoning of the Cohen opinion is as follows: (1) Under the proviso to section 3 of the 1912 Act as interpreted in the King Instructions, payment of construction charges frees the land from acreage limitations; (2) section 3 of the 1912 Act and section 46 of the 1926 Act are integral parts of a comprehensive land-limitation plan; (3) the same rule should therefore apply to section 46 of the 1926 Act. That is the whole of the argument.\n\nThe obvious error in this reasoning is that it ignores the distinction between the initial breakup of excess holdings and the subsequent purchase, sale, and consolidation of water rights once they have been acquired. As we have seen, section 3 of the 1912 Act and the King Instructions apply only to the latter and not to the former. They recognize a right to sell and acquire vested water rights without regard to the 160-acre limitation. They assume compliance with the conditions precedent to obtaining such vested water rights, including the requirement that initial excess holdings be disposed of -- imposed by regulation prior to 1914 and thereafter by the express provision of section 12 of the 1914 Act and section 46 of the 1926 Act.\n\nWith this error corrected, nothing remains. The Cohen opinion does not discuss the unqualified requirement of initial breakup in section 12 of the 1914 Act, essentially re-enacted as section 46 of the 1926 Act. It does not explore the legislative history of the acreage limitation provisions in the 1902, 1912, 1914, or 1926 acts, or Congress' purpose in enacting any of them. It does not discuss the Department's regulations or administrative practices. It gives no consideration to the consequences of the rule it announces.\n\nThe surprising superficiality of the Cohen opinion may be explained by the political context in which it was issued. It appears to have been a hastily contrived means to achieve an end thought to be of overriding importance to the Department. For whatever reasons, the Bureau of Reclamation had not moved as decisively or uniformly as it might have to enforce acreage limitations.\u003cspan class=\"fnref\"\u003e182\u003c/span\u003e A survey of reclamation projects completed in 1946 and a conference of key Bureau personnel in early 1947 revealed substantial noncompliance with the acreage limitations on many projects.\u003cspan class=\"fnref\"\u003e183\u003c/span\u003e Senator Downey of California and others were marshaling support for a renewed attempt to entirely exempt projects in California, Colorado, and Texas from acreage limitations.\u003cspan class=\"fnref\"\u003e184\u003c/span\u003e Department and Bureau officials wished to present a record of enforcement to Congress as part of an overall defense of acreage limitation provisions.\u003cspan class=\"fnref\"\u003e185\u003c/span\u003e It was considered impracticable at that late date to secure the individual recordable contracts the Bureau had failed to require as a precondition to delivering project water when projects were first opened. The Cohen opinion was prepared as a part of a program to meet this problem. It was transmitted to field offices to provide a means for achieving rapid \"compliance\" with acreage limitations which could then be reported to Congress, albeit \"compliance\" by avoidance through payment of construction charges.\u003cspan class=\"fnref\"\u003e186\u003c/span\u003e Secretary of the Interior Oscar Chapman and Commissioner of Reclamation Michael Straus both regarded this procedure as a remedial measure to be applied to then-existing projects, as to which there had been a history of substantial, long standing nonenforcement. It was not regarded as a policy of general applicability permitting all landowners to avoid the acreage limitation as a matter of course.\u003cspan class=\"fnref\"\u003e187\u003c/span\u003e\n\nCommissioner Straus later changed his position, offering the Cohen opinion as justification for acceptance of lump sum prepayment from Kings River water users.\u003cspan class=\"fnref\"\u003e188\u003c/span\u003e Secretary Chapman disagreed, insisting that the Cohen opinion and the administrative letter transmitting it to the field had not established a general policy applicable to new projects, especially Pine Flat Dam.\u003cspan class=\"fnref\"\u003e189\u003c/span\u003e In December 1952, Secretary Chapman challenged the authority of the Cohen opinion for any purpose, pointing out that it had not been submitted to the Secretary for approval.\u003cspan class=\"fnref\"\u003e190\u003c/span\u003e The Secretary instructed Commissioner Straus that the Bureau was not to accept full payment of construction charges as an alternative to compliance with acreage limitations, and, specifically, that no such contract was to be negotiated with the Kings River Water Association.\u003cspan class=\"fnref\"\u003e191\u003c/span\u003e\n\nAfter the change of Administration in 1953, the Bureau was authorized to negotiate a Kings River repayment contract embodying the lump sum prepayment principle. Sole reliance was placed on the Cohen opinion.\n\nLate in 1955, subordinate Bureau officials completed negotiation of a contract with the Kings River Conservation District, a service-area-wide entity created for the purpose of contracting with the United States for Pine Flat repayment. The contract included a provision allowing individual landowners to avoid sale of their excess lands at nonspeculative prices by paying that portion of the total construction charges that could be fairly allocated to their individual holdings.\u003cspan class=\"fnref\"\u003e192\u003c/span\u003e Protests followed. The Department advised correspondents that questions of law and policy underlying the contract were being reviewed.\u003cspan class=\"fnref\"\u003e193\u003c/span\u003e In mid-1957, Solicitor Elmer F. Bennett issued an opinion concluding that \"Congress has not authorized accelerated payments by individual landowners of their aliquot part of the district liability as a means of evading excess land limitations.\"\u003cspan class=\"fnref\"\u003e194\u003c/span\u003e Acting upon this opinion, the Secretary disapproved the proposed contract, stating that to permit individual prepayment to have the suggested consequence \"would reduce the statutory limitations to a mere shadow. This would make the test, not one of public policy, but solely one of the financial capability of each landowner to purchase immunity from the statutory restrictions.\"\u003cspan class=\"fnref\"\u003e195\u003c/span\u003e\n\nNegotiations were resumed, but with a view toward executing separate repayment contracts with the various canal companies and irrigation and water storage districts in the service area. Proposed contracts were again agreed upon. They include a provision that upon payment of all construction charges by the contracting district or company its constituent landowners would be relieved of the requirement that they sell excess lands at nonproject prices.\u003cspan class=\"fnref\"\u003e196\u003c/span\u003e Secretary of the Interior Fred A. Seaton declined to execute the contracts.Because of the considerable opposition to the Department's position, the widespread public interest in the question, and its \"transcendent importance in the administration of the Federal reclamation laws,\" he requested an opinion of the Attorney General on the basis of which the \"payout\" issue might \"definitely be set at rest within the Executive Branch.\"\u003cspan class=\"fnref\"\u003e197\u003c/span\u003e The effect of the Secretary's request, transmitted one day before he left office, was to defer the final decision on \"payout\" to the incoming administration.\u003cspan class=\"fnref\"\u003e198\u003c/span\u003e The incoming Attorney General returned the proposed contracts to the Department of the Interior for initial consideration. In December 1961 Solicitor Barry issued an opinion concluding that the \"payout\" provision in the proposed contracts was unlawful. In striking contrast to the Cohen opinion, Solicitor Barry's memorandum fully exposed and explored all aspects of the problem, including the purposes of the excess land limitations, the terms and legislative history of each of the relevant statutes, the regulations issued by the Department, the administrative practices of the Department over the years, and the consequences of the alternative solution. On the basis of this examination, Solicitor Barry concluded that \"payout is not relevant to the recordable contract requirement of Section 46 of the 1926 Act,\" but only to subsequent consolidation of vested water rights first acquired in accordance with the law.\u003cspan class=\"fnref\"\u003e199\u003c/span\u003e Attorney General Robert F. Kennedy concurred in Solicitor Barry's conclusions.\u003cspan class=\"fnref\"\u003e200\u003c/span\u003e The doctrine thus established, rejecting payout as an alternative to compliance with section 46 of the 1926 Act, has remained Department policy to the present.\u003cspan class=\"fnref\"\u003e201\u003c/span\u003e\n\nIn sum, except for a period of a half dozen years, the administrative practice of the Department has been either inferentially or expressly contrary to appellees' theory of \"payout\" as an alternative to initial redistribution of excess lands. The theory's sole claim to legitimacy was the 1947 Cohen opinion. That opinion was invoked beyond its intended purposes. In any event, it was patently wrong. Its authority was soon challenged; it remained hotly contested throughout; and it was soon overruled. The substance of the Department's construction of section 46 during this brief interlude must be rejected in view of the repeatedly endorsed public policies involved in limiting initial holdings of private lands receiving water from federal reclamation projects, the compelling legislative history of each successive excess land statute, the unambiguous regulations and early administrative practice on which the 1926 Act was built, and the general scheme of enforcement of the acreage limitations since 1902.\n\nThere is no basis for implying an exception to the absolute language of section 46 that would permit excess landowners to escape the obligation of that provision by payment of construction charges.\n\nThe Kings River project is subject to the reclamation laws. Landowners in that project must execute recordable contracts to sell their excess land at ex-project prices in compliance with section 46 in order to receive project water for their excess lands, even if the irrigation district or other contracting agency through which they receive project water repays its share of the irrigation costs of the Pine Flat Dam.\n\nReversed.\n\nDisposition\n\nReversed.\n\n\u003cspan class=\"fn\"\u003e1. Act of May 25, 1926, ch. 383, 44 Stat. 636. The pertinent portions of ยง 46 are set out in full in note 94.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Act of Dec. 22, 1944, ch. 665, 58 Stat. 887.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Substantially all of the water of the Kings River had been appropriated before the Pine Flat Dam was built, and most was being delivered to private lands through an elaborate private irrigation system. Turner v. Kings River Conservation Dist., 360 F.2d 184, 191, 195 (9th Cir. 1966). The irrigation benefits of the Kings River project result from regulation of the flow of the river by storage of water during periods of heavy runoff and release during dry periods. The repayment contracts involved here define \"project water\" -- the water that must be withheld from excess lands not covered by a recordable contract -- as only such water as is released at times when it would not have been available but for storage in the Pine Flat reservoir.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Section 8 of the 1944 Act reads as follows: Hereafter, whenever the Secretary of War determines, upon recommendation by the Secretary of the Interior that any dam and reservoir project operated under the direction of the Secretary of War may be utilized for irrigation purposes, the Secretary of the Interior is authorized to construct, operate, and maintain, under the provisions of the Federal reclamation laws (Act of June 17, 1902, 32 Stat. 388, and Acts amendatory thereof or supplementary thereto), such additional works in connection therewith as he may deem necessary for irrigation purposes. Such irrigation works may be undertaken only after a report and findings thereon have been made by the Secretary of the Interior as provided in said Federal reclamation laws and after subsequent specific authorization of the Congress by an authorization Act; and, within the limits of the water users' repayment ability such report may be predicated on the allocation to irrigation of an appropriate portion of the cost of the structures and facilities used for irrigation and other purposes. Dams and reservoirs operated under the direction of the Secretary of War may be utilized hereafter for irrigation purposes only in conformity with the provisions of this section, but the foregoing requirement shall not prejudice lawful uses now existing; Provided, That this section shall not apply to any dam or reservoir heretofore constructed in whole or in part by the Army Engineers, which provides conservation storage of water for irrigation purposes. 58 Stat. 891, 43 U.S.C. ยง 390.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. All of the authorities cited in this portion of the Turner opinion, both as initially filed and as modified, dealt with whether the reclamation laws as such are applicable to the Pine Flat Dam. Indeed, they discuss acreage limitations, but do not discuss the power to condemn. The citations were: 41 Op. A.G. 377; Inter-University Case Program Committee on Public Administration Cases, The Kings River Project in the Basin of the Great Central Valley 44-47 (1949); A. Maass, Administering the CVP, 38 Calif. L. Rev. 666, 688 (1950); P. Taylor, Excess Land Law on the Kern ?, 46 Calif. L. Rev. 153, 166-70 (1958); see also L. Graham, The Central Valley Project: Resource Development of a Natural Basin, 38 Calif. L. Rev. 588, 629-30 (1950).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. See Petition for Modification at 5, 7. The petition for modification was supported in amici curiae briefs submitted by irrigation districts on the nearby Kern and Kaweah River projects. The Kaweah Delta Water Conservation District appeared to concede that if reclamation law was applicable to the irrigation features of the Pine Flat Dam, it was applicable in its entirety, Brief at 7, and the other amici did not argue to the contrary.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. \"There is certainly room for argument that even if Section 8 applies to the Pine Flat Dam, the acreage limitation provisions of Reclamation law do not apply, either as a matter of statutory construction or constitutional authority.\" Petition for Modification at 7 n.6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Finally, appellees rely on the holding in Turner that plaintiffs in that case had no standing to raise the specific issue of whether acreage limitations as such applied to the Kings River project.360 F.2d at 198. The point, however, is that plaintiffs in Turner could contend, and this court could and did decide, that ยง 8 of the 1944 Act made the reclamation laws applicable to the Kings River project. The present case must be decided on that legal premise.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Projects expressly exempted from the acreage limitations and an explanation of the reasons thought to justify the exemptions are listed in Acreage Limitation Policy, Study Prepared by the Department of the Interior for the Senate Committee on Interior and Insular Affairs, 88th Cong., 2d Sess. 25-30, 51-77, 79 (Comm. Print 1964).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. H.R. Doc. No. 630, 76th Cong., 3d Sess. 4 (1940) (Corps of Engineers); H.R. Doc. No. 631, 76th Cong., 3d Sess. 29 (1940) (Bureau of Reclamation).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. H.R. Doc. No. 630 at 5; H.R. Doc. No. 631 at V.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. H.R. Doc. No. 630 at 4-5; H.R. Doc. No. 631 at IV-V.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Letter from Franklin D. Roosevelt to the Secretary of the Interior, May 29, 1940, H.R. Doc. No. 631 (Part II) at 5. The President conveyed his position to the Chairman of the House Flood Control Committee considering the Kings River proposals. He also suggested: A good rule for the Congress to apply in considering these water projects, in my opinion, would be that the dominant interest should determine which agency should build and which should operate the project. Projects in which flood control or navigation clearly dominate are those in which the interest of the Corps of Engineers is superior and projects in which irrigation and related conservation uses dominate fall into the legitimate field of the Bureau of Reclamation. Letter from Franklin D. Roosevelt to William M. Whittington, May 5, 1941, Hearings on H.R. 4485 before the House Flood Control Committee (Part II), 78th Cong., 2d Sess. 616, 617 (1944).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Kings River-Pine Flat Ass'n, Outline of Verbal Report of Engineering Board of Review Made to Directors of the Ass'n, Mar. 9, 1940, at 9-10. For the reason stated in the text, and because the Association opposed the Bureau's plans for public development of hydroelectric power in conjunction with the dam, the Association voted to endorse the proposal of the Corps of Engineers. Resolution of Kings River-Pine Flat Ass'n, Mar. 9, 1940; Hearings on H.R. 9640 before the House Flood Control Committee, 76th Cong., 3d Sess. 522-54 (1940). Indeed, water users represented by the Association later took the position that they would prefer to have no dam at all rather than one built by the Bureau. Hearings on H.R. 4911 before the House Flood Control Committee, 77th Cong., 1st Sess. 181 (1941).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. H.R. Rep. No. 1174, 77th Cong., 1st Sess. (1941).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Letter from Franklin D. Roosevelt to William M. Whittington, Feb. 7, 1944, 1944 House Hearings, supra note 13, at 615, 616. The pertinent paragraph reads in full as follows: In my letter of May 5, 1941, I suggested that a sound policy in connection with these water projects would consist of selecting the construction agency by determining the dominant interest.Projects in which navigation or flood control clearly dominate are those in which the interest of the Corps of Engineers is superior and should be so recognized. On the other hand, projects in which irrigation and related conservation dominate are those in which the interest of the Bureau of Reclamation in the Department of the Interior is paramount and should be so recognized. No matter which agency builds a multiple-purpose structure involving in even a minor way the interests of the other, the agency with the responsibility for that particular interest should administer it in accordance with its authorizing legislation and general policies. For example, the Bureau of Reclamation in the Department of the Interior should administer, under the Reclamation laws and its general policies, those irrigation benefits and phases of projects built by the Corps of Engineers. These suggestions are, to my mind, even more pertinent today. For today we gird for peace. Confusion over jurisdiction ought not to be allowed to disrupt the great preparations now being made for postwar construction of vital public works.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The President's letter referred to these two projects by name, and no others. As noted later in the text, Commissioner Bashore specifically suggested language to implement the President's proposal during his testimony before the House Flood Control Committee regarding the Kings River and Kern River projects.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. 1944 House Hearings, supra note 13, at 627 et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The suggestion was initially stated in terms of the Kern River project alone, Id. at 638, but only because it was the Bureau's position that the Bureau had already been authorized to construct the Kings River project. Id. at 628. There is no basis for distinguishing the two projects. Discussion of the Kings River and Kern River projects, and only those two, was intertwined throughout Commissioner Bashore's appearance before the committee. Id. at 623-53, 671-88. Commissioner Bashore made it clear that the suggestion applied to any project constructed by the Corps of Engineers that had irrigation as one of its purposes, Id. at 638, 640, 641, 645, 646, 682-83, 683-84, and in later testimony he applied the suggestion specifically to the Kings River project. Id. at 645, 681-84. The relevant characteristics of the two projects are similar, and appellees concede that the same rule must govern both.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. In the case of any reclamation project coming within the scope of the definition of the term \"project\" in the Reclamation Project Act of 1939 or any project authorized under the act of August 11, 1939 (53 Stat. 1418), as amended in connection with which there have been nonreimbursable allocations to flood control or navigation purposes made by the Secretary of the Interior after consultation with the Secretary of War, it shall be the duty of the Secretary of War, after consultation with the Secretary of the Interior, to prescribe regulations consistent with such allocations with respect to the operation for these purposes; and the operation of any such project shall be in accordance with such regulations. In connection with dams or other works herein or hereafter authorized for construction, and constructed under the direction of the Secretary of War and supervision of the Chief of Engineers and which the Secretary of the Interior determines, with the concurrence of the Secretary of War, may be utilized in part for irrigation, power, municipal water supply or other miscellaneous purposes, the operation of said dam or other works for such purposes shall be in accordance with regulations prescribed by the Secretary of the Interior pursuant to the Federal reclamation laws, act of June 17, 1902 (32 Stat. 388), and acts amendatory thereof or supplementary thereto; and in connection with said dams or other works the Secretary of the Interior is authorized to construct, operate, and maintain under the provisions of the said Federal reclamation laws such additional works as he may deem necessary for irrigation, power, municipal water supply, or other miscellaneous purposes. Such additional works may be undertaken only if authorized under said Federal reclamation laws; and within the limits of feasibility under said Federal reclamation laws, there may be allocated to irrigation, power, municipal or other miscellaneous purposes, appropriate returnable shares of the cost of multiple-purpose features serving said purposes. Id. at 639.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Id. at 681-84.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Id. at 642-44, 672, 677-82, 685.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Mr. BASHORE. I think you are judging the dominance of the interest by the amount of money allocated to flood control and the amount of money that is expected to be directly reimbursable. I do not think you can properly judge it from that standpoint. The Government did not go into the business of reclamation with the view of making any money out of it. It provided very liberal terms; no interest. But the Government expected that money to be returned; and it expected more than that -- it expected that the country would be developed. That is what we are concerned with. The point I am trying to make is that it goes far beyond the reimbursable and nonreimbursable features of the project to determine whether it is dominantly this or dominantly that. Id. at 679-80.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Id. at 741-44, 766-68. See also id. at 642-43, 645, 672, 675, 677-78.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. See note 13.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. 1944 House Hearings, supra note 13, at 742-43, 766-68.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. 90 Cong. Rec. 4206 (1944). The language of the committee bill was identical to that contained in ยง 10 of the Act as finally passed. Section 10 reads: The project for flood control and other purposes for the Kings River and Tulare Lake Basin, California, is hereby authorized substantially in accordance with the plans contained in House Document Numbered 630, Seventy-Sixth Congress, third session, with such modifications thereof as in the discretion of the Secretary of War and the Chief of Engineers may be advisable at an estimated cost of $19,700,000: Provided, That the conditions of local cooperation specified in said document shall not apply: Provided further, That the Secretary of War shall make arrangements for payment to the United States by the State of other responsible agency, either in lump sum or annual installments, for conservation storage when used: Provided further, That the division of costs between flood control, and irrigation and other water uses shall be determined by the Secretary of War on the basis of continuing studies by the Bureau of Reclamation, the War Department, and the local organizations. 58 Stat. 901.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. The subject matter of Commissioner Bashore's proposal, supra note 20, was divided between ยงยง 5 and 6 of the House committee bill. Section 6 read: Hereafter, whenever in the opinion of the Secretary of War and the Chief of Engineers any dam and reservoir project operated under the direction of the Secretary of War can be consistently used for reclamation of arid lands, it shall be the duty of the Secretary of the Interior to prescribe regulations for the use of the storage available for such purpose, and the operation of any such project shall be in accordance with such regulations. Such rates, as the Secretary of the Interior may deem reasonable, shall be charged for the use of said stored water; the moneys received to be deposited into the Treasury to the credit of miscellaneous receipts. 90 Cong. Rec. 4204 (1944). See also H.R. Rep. No. 1309, 78th Cong., 2d Sess. 8 (1944).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. See note 20.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Representative Curtis stated: This bill provides that whenever any reservoir is being operated by the War Department, it is found that there is available water for irrigating farm lands, that the Bureau of Reclamation, through the Secretary of the Interior, shall prescribe the rules and regulations for the operation of that part of the storage that is available for irrigation. In other words, it gives the Bureau of Reclamation jurisdiction over the irrigation features of the reservoirs and the distribution systems. I think that is sound and advisable. I am told by individuals in the Bureau of Reclamation that it is a definite gain for them and a step forward. 90 Cong. Rec. 4130. In any reservoir where there is storage space available for irrigating farm lands . . . the regulation of that shall be turned over to the Bureau of Reclamation, which is a concession on the part of the Army. Id. at 4134.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Describing ยงยง 5 and 6, Chairman Whittington said: Section 5 gives supervision of operation for flood control and navigation to the Chief of Engineers. Section 6 speaks for itself in an effort to lean over backward, and gives to the Secretary of the Interior power of handling reclamation and the disposal of reclamation waters provided by the projects authorized in this bill.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. See note 20.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Letter from Harold L. Ickes to Harold D. Smith, Apr. 10, 1944.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. 90 Cong. Rec. 4204.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Letter from Paul H. Appleby to the Secretary of the Interior, May 20, 1944, Hearings on H.R. 4485 before a Subcommittee of the Senate Commerce Committee, 78th Cong., 2d Sess. 13, 14 (1944).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Thus, the committee report states: The committee has heard extensive testimony from local interests and has questioned the Chief of Engineers and the Commissioner of Reclamation at length in hearings in 1941, 1943, and 1944. Local interests have all impressed the committee with the seriousness of the flood hazard and their desire that the proposed works be constructed as soon as possible. They are practically unanimous in their statements that the dominant interest in the project is flood control with irrigation of secondary consideration. Such irrigation benefits as would result would accrue to land now already developed without bringing into production additional arid land. Local interests are so strongly in opposition to a project built under reclamation law that they have stated that rather than have the project built by the Bureau of Reclamation they prefer no Federal project at all. But the report continued: After very careful consideration of the reports, the communications of the President which are printed in the hearings, and the testimony and written statements in the hearings, the committee is convinced that the project should be authorized by Congress as a flood-control project with adequate safeguards for the interests of the Bureau of Reclamation. The committee believes that these safeguards are fully covered in the language contained in the bill. The committee therefore recommends authorization of the project as proposed in the bill at an estimated cost of $19,700,000. H.R. Rep. No. 1309, 78th Cong., 2d Sess. 43 (1944) (emphasis added). The \"adequate safeguards\" mentioned by the committee can only have referred to the provisions of ยง 6. Chairman Whittington's remarks, similar to those in the first paragraph quoted from the committee report, are found at 90 Cong. Rec. 4123-24, 4209.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. See generally 1944 Senate Hearings, supra note 35, at 213-65, 278-86, 298-320, 363, 452-65, 527-33, 634-37.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. In a change of strategy, the Bureau stressed the need to integrate construction and operation of the Kings River and Kern River projects with the massive Central Valley project, rather than relying principally on the argument that irrigation benefits of the projects standing alone outweighed their flood control purposes. Id. at 213-14, 217-18, 220, 222-23, 252, 255-58, 459-60.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Id. at 457-61, 527-33.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. Id. at 242, 260-61.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. S. Rep. No. 903, 78th Cong., 2d Sess. 4 (1944).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. 1944 Senate Hearings, supra note 35, at 222, 261-62, 458, 561-62.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. Id. at 221-22, 239-43, 260-63.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. Secretary Ickes testified: In considering what this flood-control bill would actually do for the Central Valley of California, as in the case of the river and harbor bill before it, you will need no supersleuth to discover that there are strong local interests from that area which seek to avoid application of the Federal reclamation laws to themselves. In the river and harbor bill the attempt was to secure the direct repeal of certain provisions obnoxious to these interests. In the present bill the attempt is to circumvent the application of these provisions by having the works built by an agency other than the Bureau of Reclamation. Naturally large landed interests have been conspicuous in this slightly disguised effort to escape the provisions of the Federal reclamation laws which seek to distribute widely the benefits of conserved water. Other local interests at the same time, among whom family-size farmers are conspicuous, have been equally insistent that the antimonopoly and antispeculation features of the Federal reclamation laws shall be maintained without alteration in principle. If my opinion is worth anything, the national interest clearly lies on the side of the family-size farm families. It is very pleasant news to learn that your committee had struck from the river and harbor bill the section which purported to make inapplicable to the Central Valley project the excess-land provisions of the Federal reclamation laws. Certainly the amendment that sought to do this, regardless of whatever merit it might have, had no place as an eleventh-hour-and-fifty-ninth-second hitch-higher [sic] to the river and harbor bill. As corroborating the wisdom of your action, I would like to call your attention to the fact that the Senate Committee on Appropriations has recently been called upon to consider an identical issue, and has decided it in a similar manner. In reporting to the Senate an appropriation for preliminary work on the Kings River project by the Bureau of Reclamation, the committee squarely stated that \"the Kings River project should be constructed as now authorized under the reclamation law.\" I urge you to adopt and apply this same principle in connection with all multiplepurpose reservoirs in the Sacramento and San Joaquin Basins. Id. at 460-61. In earlier testimony Commissioner Bashore had called the subcommittee's attention to the details of the action by the Senate Committee on Appropriations, quoting at length from a committee report. The report stated that the proposed transfer of responsibility for construction of the Kings River project from the Reclamation Service to the Corps of Engineers would permit Kings River landowners to escape the provisions of ยง 46 of the 1926 Act. The report quoted ยง 46 and relevant portions of the Fact Finders' report on which it was based, and concluded: Under existing law, as above quoted, reclamation project water is available to any landowner regardless of the size of his holdings provided that he agrees to sell any irrigable land in excess of 160 acres when and if an opportunity occurs at a price not in excess of its fair appraisal value. This law has been in effect for 18 years on more than 60 reclamation projects and there is excellent proof that it operates in a reasonable and equitable manner and is achieving the purpose for which it was intended. It does not require sudden or precipitate breaking up of real-estate holdings but, in an orderly and gradual way, it prevents land monopoly and speculation in benefits created by the expenditure of Federal funds. Most of all, it assures that there will be opportunities for men to secure farms and make homes and livelihood for themselves and their families without incurring a ruinous debt because of the wild gambling of land speculators. Under these circumstances the committee is of the opinion that the Kings River project should be constructed as now authorized under the reclamation law. S. Rep. No. 899, 78th Cong., 2d Sess. 4 (1944), quoted in 1944 Senate Hearings at 215.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. 1944 Senate Hearings, supra note 35, at 458, 532-33.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Letter from Harold L. Ickes to Josiah W. Bailey, June 2, 1944, id. at 310, 313.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. Id. at 458 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. See pages 1118, 1126-1127 \u0026 n. 133.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. The full text of Secretary Ickes' proposed revision of ยง 6 of the House bill was included in his letter to Chairman Bailey. See note 46.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. Senator Millikin of Colorado offered a substitute for ยง 6 of the House bill that was essentially the same as that proposed by the Secretary. 1944 Senate Hearings, supra note 35, at 548-49. The subcommittee adopted the substitute with minor changes. See 90 Cong. Rec. 8233; 41 Op. A.G. at 389-90. The committee report recites that the committee redrafted the section to make it acceptable to the Secretary of the Interior with respect to the \"various technical features of the Federal reclamation laws\" mentioned in the text: During the hearings and also by letter the Secretary of the Interior expressed to the committee his views with regard to the utilization of multiple purpose projects under the control of the War Department where irrigation may be involved and he expressed the view that the language in H.R. 4485, if modified, would provide for more effective administration in relation to the various technical features of the Federal reclamation laws. The committee therefore recommends the adoption of amendment No. 10 which is generally in accord with existing law and the expressed views of the Secretary of the Interior. S. Rep. No. 1030, 78th Cong., 2d Sess. 4 (1944).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. See note 4.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. The President wrote: It may well be that testimony before your committee in favor of the construction of these projects by the Corps of Engineers was a reflection of the desire of certain large land interests in California to obtain irrigation and other benefits without being subjected to the repayment requirements and to the other public safeguards that are a part of the reclamation law, but I do not believe that this should be allowed to obscure the fundamental objectives of that law. In this connection, I was pleased by the inclusion of the irrigation amendment. But this amendment will not assure that the planning, design, construction, and operation of these reservoirs shall be such as to fulfill the primary need for conservation and beneficial consumptive use of water. I hope, therefore, that the Congress will see fit to place in the Bureau of Reclamation the authority and the responsibility for accomplishment of the great objectives that the Federal Government should achieve in California. Letter from Franklin D. Roosevelt to Senator John H. Overton, Aug. 7, 1944, 90 Cong. Rec. 8623 (emphasis added). Secretary Ickes took a similar position: Section 8 of the bill, as reported, wisely invokes the reclamation laws in the use of projects for irrigation purposes. However, the bill as it passed the House contained no such provision, and in the Senate, it is understood, an attempt will be made to amend or delete section 8. The reclamation policies of this country, in effect for more than 40 years, are designed to encourage family-type farms and to discourage speculation. They should not be changed or set aside in the course of a hurried consideration of a flood-control bill authorizing projects at some indefinite future date. . . . The Central Valley project, as authorized by Congress, is operated by the Bureau of Reclamation; the Bureau has built dams and irrigation works, and markets the surplus power. The present bill changes the pattern. It puts two different agencies, in two different departments, at work on a multiple-purpose project where the utmost coordination is essential. Thus the effect of this section is harmful to good administration. Furthermore, it would be extremely harmful were section 8 deleted and sound reclamation policies disregarded as they were in the bill as it passed the House. Memorandum attached to Letter from Harold L. Ickes to Senator Alben W. Barkley, Nov. 22, 1944, 90 Cong. Rec. 8315, 8316 (emphasis added). See also Letter from Harold L. Ickes to the Vice President, Nov. 21, 1944, 90 Cong. Rec. 8624-25.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. 90 Cong. Rec. at 8548.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. 90 Cong. Rec. at 8548 (Senator Hayden).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. 90 Cong. Rec. at 8549.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. 90 Cong. Rec. at 8550.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. Letter from Harold L. Ickes to Senator Lister Hill, Nov. 29, 1944, 90 Cong. Rec. 8545, 8546. See also Letter from Harold L. Ickes to the Vice President, Nov. 21, 1944, 90 Cong. Rec. 8624-25.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. 90 Cong. Rec. at 8550.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. 90 Cong. Rec. at 8550.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. 90 Cong. Rec. at 8616.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. 90 Cong. Rec. at 8622.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. 90 Cong. Rec. at 8625 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. 90 Cong. Rec. at 8626 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. 90 Cong. Rec. at 9264 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. H.R. Rep. No. 2051, 78th Cong., 2d Sess. 7 (1944).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. 90 Cong. Rec. at 9277-87.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. Federal Reclamation by Irrigation, S. Doc. No. 92, 68th Cong., 1st Sess. 131 (1924).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. Id. at 133.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. Acreage Limitation Policy, supra note 9, at 82-83.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. See Madera Irrigation Dist. v. All Persons, 47 Cal.2d 681, 686, 306 P.2d 886, 889 (1957).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71. 2 Waters \u0026 Water Rights ยง 120.2, at 215 (R. Clark ed. 1967). The statement was made in discussing the very issue involved here: Another ground for departing from the statutory acreage limitation is that the project is merely providing supplemental water to an already developed area. This fact in itself is hardly a justification, because reclamation today generally supplies only supplemental water. See also J. Sax, Selling Reclamation Water Rights: A Case Study in Federal Subsidy Policy, 64 Mich. L. Rev. 13, 33 (1965).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72. Contrary to appellees' contention, application of acreage limitations to a project intended primarily to improve vested water rights would not appear to be unique. See, e.g., Middle Rio Grande Water Users Ass'n v. Middle Rio Grande Conservancy Dist., 57 N.M. 287, 258 P.2d 391 (1953); Application of Frenchman Valley Irrigation Dist., 167 Neb. 78, 91 N.W. 2d 415 (1958); Hearings on H.R. 13921 before the House Committee on Irrigation of Arid Lands (Part II), 63d Cong., 2d Sess. 3-11 (1914).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73. See page 1100 \u0026 note 10.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74. Cf. Ivanhoe Irrigation Dist. v. McCracken, 357 U.S. 275, 285, 2 L. Ed. 2d 1313, 78 S. Ct. 1174 (1958); Solicitor's Opinion M-36011, Sept. 23, 1949, cited in Acreage Limitation Policy, supra note 9, at 22. Section 46 of the 1926 Act provides that excess land shall be appraised in a manner prescribed by the Secretary of the Interior and the sale price fixed by the Secretary \"on the basis of its actual bona fide value at the date of appraisal without reference to the proposed construction of the irrigation works.\" The repayment contract between the United States and the Tulare Lake Canal Company echoes the language of section 46, providing for an appraisal \"on the basis of the actual bona fide value of such lands at the date of the appraisal without reference to the irrigation benefits of the Project.\" Under the contract, any given tract of excess land will be appraised only after the owner of the tract executes a recordable contract agreeing to have his land appraised without reference to project benefits and committing himself to dispose of his excess land at this appraised value. The recordable contracts have not yet been executed, pending the outcome of this case. Thus, the sale price of excess land will be established on the basis of the ex-project market value of the land on or after the date at which the landowner agrees to sell it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e75. H.R. Doc. No. 630, 76th Cong., 3d Sess. 7 (1940); H.R. Doc. No. 631, 76th Cong., 3d Sess. 10-12 (1940).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e76. See, e.g., 1944 House Hearings, supra note 13, at 741-42, 762, 767; 1944 Senate Hearings, supra note 35, at 284-86, 300-02. Finally, references to \"surplus\" water in the legislative history relied upon by appellees appear to have nothing to do with whether the water was previously appropriated. For example, Senator Overton's use of the word \"surplus\" during the Senate hearings was in connection with a provision in the Rivers \u0026 Harbors Bill similar to ยง 8. The water referred to was that which would not be necessary to maintain the water level for the primary navigation purposes of the projects authorized in that bill. 1944 Senate Hearings, supra, at 222.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e77. Opposition to application of the reclamation laws to the Kings River project during the 1944 hearings was not premised on the argument that family farms could not succeed, and there is no indication that either Congress or the Department of the Interior believed this to be true. The objections were based upon the pre-existence of irrigation facilities, the complete appropriation of existing water, and the absence of public or additional arid lands to be reclaimed. When the Kings River project was under consideration, Commissioner Bashore emphasized to the House Flood Control Committee the importance of creating homes, especially for soldiers returning from the war. 1944 House Hearings, supra note 13, at 643, 644, 672, 678. The need to create homes was also mentioned in connection with the Kings River project during the Senate hearings. 1944 Senate Hearings, supra note 35, at 215, 460. Several times during the 1944 House hearings the Department of the Interior indicated that a modification of the excess land laws might be recommended for the Kings River project, not because it thought smaller farms were not feasible, but because it might be inequitable to impose rigid acreage limitations upon an already established economy. 1944 House Hearings, supra, at 642-43, 678. No modification was in fact proposed. Appellees rely in part on a Bureau of Reclamation study and related memoranda prepared in 1947, three years after the Flood Control Act was passed. See Bureau of Reclamation Report on Possible Changes in Types of Farming in the Tulare Lake Area in California (1947); Memorandum from Regional Supervisor of Operation \u0026 Maintenance to L. O. Graham et al., Sept. 2, 1947, and attached Draft Memorandum; Memorandum from Paul H. Johnstone, Chief Economics \u0026 Statistics Div., Sacramento Regional Office, Bureau of Reclamation, to the Regional Director, Sept. 12, 1947. The 1947 study and memoranda concluded that acreage limitations should be modified or eliminated on the Kings River project, primarily in the Tulare Lake Basin. These documents were drafted in support of the position that Congress should create an exemption from the acreage restrictions for that project. There was no assumption that the limitations did not then apply. The conclusions reached in the 1947 study and memoranda were not adopted by the Department of the Interior; the Department has never recommended exempting legislation, and none has been enacted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e78. 38 I.D. 620, 637 224 P. 427 (1924); 43 C.F.R. ยง 230.65 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e79. The United States National Water Commission reports, \"In California, the Commission was told many reclamation farmers as well as nonreclamation farmers tend to live in town and commute to the farms.\" National Water Comm'n, Water Policies for the Future 147 (Final Report 1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e80. There was expert testimony at trial that if flood control dams had been in operation, flooding would have affected as much as 20,000 acres of the Basin in only 11 of the previous 122 years, and that floods as severe as those in 1969, when 89,000 acres were under water, would have occurred only four times during this period of a century and a quarter.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e81. In the Central Valley project, where almost complete compliance with the excess land laws has been attained, many individual landowners have leased their lands to individual or corporate operators. H. Hogan, Acreage Limitation in the Federal Reclamation Program 119-21, 127-28 (Study prepared for the National Water Commission 1972) (Distributed by National Technical Information Service, U.S. Dep't of Commerce). It has been said that farming of a number of separately owned tracts by a single operator may become \"the Reclamation equivalent of the condominium in apartment house ownership operation.\" Id. at 127.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e82. This is equally true of the Bureau of Reclamation Report proposing construction of the Kings River project. H.R. Doc. No. 631, 76th Cong., 3d Sess. (1940).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e83. Appellees also rely upon the provision in ยง 10 that the Secretary of War was to make arrangements for payment for conservation storage in the Kings River project. See note 27. They point to nothing in the legislative history to support the theory that the agency selected to negotiate repayment affected the application of ยง 8.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e84. Section 8 is reproduced in note 4.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e85. 1944 Senate Hearings, supra note 35, at 561-62 (emphasis added). Judge Stone continued: We see no reason why in the West where reclamation is practiced there should be any difference in the use of water for irrigation, from a reservoir constructed by the Corps of Army Engineers and a reservoir constructed by the Bureau of Reclamation. Judge Stone's remarks were addressed to ยง 6 as proposed by Senator Millikin, which was also the Secretary of the Interior's proposal that eventually became ยง 8.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e86. See text at notes 52-59.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e87. Senator Millikin stated that the two O'Mahoney amendments have the combined purpose of not subjecting all of the detail of the reclamation law to projects where the Army engineers have a reservoir in the middle of an existing privately owned irrigation system, where those who have that private irrigation system are in independent position to take the water and therefore should not be required to go through all the incidents of a reclamation project started from grass roots. 90 Cong. Rec. 8549. This was an apparent reference to the requirement for initial breakup of excess holdings imposed by ยง 46 of the 1926 Act. The House of Representatives did not directly reject a similar proposal, but when ยง 6 of the bill reported by the House Flood Control Committee was amended on the floor of the House to make it inapplicable in situtations in which the federal project supplemented a locally operated irrigation system, that amendment was limited to dams that were already in existence in 1944, and therefore would not have applied to Pine Flat Dam. 90 Cong. Rec. 4204. It has also been argued that the Senate recognized that additional works would be necessary to make ยง 8 applicable to any given flood control project because the Senate rejected an amendment offered by Senator Murray of Montana to modify the third sentence of ยง 8 to read: \"Dam[s] and works authorized by this act may be utilized for irrigation purposes only in conformity with the provisions of said Federal reclamation laws and this paragraph.\" See 90 Cong. Rec. 8618. The short and complete answer is that Senator Murray offered no such amendment, and apparently refrained from doing so because, as pointed out by Senator Overton, its substance was incorporated in the present language of ยง 8. While discussing his separate and much broader proposal to transfer all civilian dam-building functions to the Bureau of Reclamation, see text at notes 60-63, Senator Murray simply referred to an amendment, of which the quoted passage was part, that he had proposed during the hearings before the House Flood Control Committee. At that time, the bill read as it had been introduced in the House. It did not include the present ยง 8. See 90 Cong. Rec. 8618; 1944 House Hearings, supra note 13, at 935. In response Senator Overton said: [Senator Murray] did appear before the House Committee on Flood Control, and he filed with that committee, without reading, a written statement. In that written statement he did propose the amendments to which he has referred. Substantially, however, those amendments have been incorporated in the present bill. They are not word for word as suggested by [Senator Murray], but they are substantially the same. They relate to irrigation and electric power. It is my understanding that both those amendments meet with the approval of the Department of the Interior and the Bureau of Reclamation. 90 Cong. Rec. 8625 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e88. 1944 Senate Hearings, supra note 35, at 302-03. The lands were not \"arid\" in appellees' sense because they were receiving water through the existing locally operated irrigation system. As we have shown, the existence of a private irrigation system is not relevant to the application of ยง 8.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e89. In a letter recommending that the President sign the 1944 Act, Secretary Ickes wrote: Were H.R. 4485 to be approved, the situation of the California projects would be as described below. The Corps of Engineers would be authorized to build a number of projects in the Central Valley area of California, including the Kings River Project and the Kern River Project. . . . Under section 8 of the bill, the use of water from those projects for irrigation purposes would be subject to the jurisdiction of the Secretary of the Interior and would be governed by the Federal reclamation laws. . . . Hence these projects can and will be integrated into the Central Valley Project. I believe that the undertaking of physical construction by the Corps of Engineers, instead of by the Bureau of Reclamation, if that ultimately becomes necessary, is a price worth paying for the sweeping defeat of the California interests who oppose the power policies and the land policies of the Administration. Letter from Harold L. Ickes to Harold D. Smith, Director, Bureau of the Budget, Dec. 20, 1944.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e90. See Letter and Enclosure from E. Reybold, Chief of Engineers, to Harry W. Bashore, Sept. 4, 1945; Letter from the Secretary of War to the Secretary of the Interior, Feb. 15, 1946; Letter from R. A. Wheeler, Chief of Engineers, to Senator Carl Hayden, Mar. 8, 1946, Hearings on H.R. 5400 before a Subcommittee of the Senate Appropriations Committee, 79th Cong., 2d Sess. 523-25 (1946).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e91. The statement read, in part, \"the Corps of Engineers will start construction after costs are allocated with the concurrence of the Secretary of the Interior, and after required payments are insured by contract, under the Reclamation Law, between the water users who are beneficiaries of the development and the Secretary of the Interior.\" Joint Statement of R. A. Wheeler, Chief of Engineers, and Michael W. Straus, Commissioner of Reclamation, June 24, 1946, H.R. Doc. No. 136, 80th Cong., 1st Sess. 49-50 (1947) (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e92. The recordable contracts to be signed by owners of more than 160 acres of land in the Kings River project authorize the Secretary of the Interior to sell their excess holdings at ex-project prices if the owners have not done so within 10 years. The Department has utilized this procedure to implement ยง 46 since the 1926 Act was passed. See U.S. Bureau of Reclamation, Landownership Survey on Federal Reclamation Projects 46-47 (1946).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e93. Section 46 of the 1926 Act is, with few exceptions, applicable to all projects built after 1926. These projects contain the vast majority of lands receiving water from federal reclamation projects. In 1924 only about 1,300,000 acres were under irrigation in federal reclamation projects. Federal Reclamation by Irrigation, S. Doc. No. 92, 68th Cong., 1st Sess. 60 (1924). By 1970 almost 8,570,000 acres were receiving either full or supplemental water service from federal projects, and 10,198,000 irrigable acres were available for service. Hogan, supra note 81, at 1. Private lands included in the 7 million acres brought under irrigation since 1924 are covered by ยง 46 of the 1926 Act unless the particular project is expressly exempted. Private lands have always predominated in federal reclamation projects, especially in more recent projects. See, e.g., Acreage Limitation Policy, supra note 9, at 82-83.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e94. Section 46 provides in pertinent part: No water shall be delivered upon the completion of any new project or new division of a project initiated after May 25, 1926, until a contract or contracts in form approved by the Secretary of the Interior shall have been made with an irrigation district or irrigation districts organized under State law providing for payment by the district or districts of the cost of constructing, operating, and maintaining the works during the time they are in control of the United States, such cost of constructing to be repaid within such terms of years as the Secretary may find to be necessary, in any event not more than forty years from the date of public notice hereinafter referred to, and the execution of said contract or contracts shall have been confirmed by a decree of a court of competent jurisdiction. . . . Such contract or contracts with irrigation districts hereinbefore referred to shall further provide that all irrigable land held in private ownership by any one owner in excess of one hundred and sixty irrigable acres shall be appraised in a manner to be prescribed by the Secretary of the Interior and the sale prices thereof fixed by the Secretary on the basis of its actual bona fide value at the date of appraisal without reference to the proposed construction of the irrigation works; and that no such excess lands so held shall receive water from any project or division if the owners thereof shall refuse to execute valid recordable contracts for the sale of such lands under terms and conditions satisfactory to the Secretary of the Interior and at prices not to exceed those fixed by the Secretary of the Interior; and that until one-half the construction charges against said lands shall have been fully paid no sale of any such lands shall carry the right to receive water unless and until the purchase price involved in such sale is approved by the Secretary of the Interior and that upon proof of fraudulent representation as to the true consideration involved in such sales the Secretary of the Interior is authorized tocancel the water right attaching to the land involved in such fraudulent sales . . .. 44 Stat. 649-50, as amended, 43 U.S.C. ยง 423e.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e95. Section 12, Act of Aug. 13, 1914, ch. 247, 38 Stat. 686, 689, 43 U.S.C. ยง 418.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e96. Act of June 17, 1902, ch. 1093, 32 Stat. 388.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e97. Section 3, Act of June 17, 1902, 32 Stat. 388, 43 U.S.C. ยงยง 416, 434. See H.R. Rep. No. 1468, 57th Cong., 1st Sess. 8 (1902); S. Rep. No. 254, 57th Cong., 1st Sess. 2 (1902).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e98. See pages 1130-1135 \u0026 n. 156. See also Barry Opinion, 68 I.D. at 384-88, 391-95.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e99. During the first 10 years after passage of the 1902 Act the average price of reclamation land increased by 750%, nearly seven times the general rise in land prices. Sax, supra note 71, at 17, citing 33 U.S. Bureau of Reclamation, The Reclamation Era 178-79 (1947). See also U.S. Reclamation Service, 13th Annual Report 26-28 (1915); U.S. Reclamation Service, 11th Annual Report 7-8 (1912); U.S. Dep't of the Interior, Annual Reports, Admin. Reports, Vol. 1, p. 88 (1908). In 1916 the Department of the Interior reported that the \"material value\" created by construction of irrigation works had been far greater than the cost of the project and in some cases several times greater. U.S. Dep't of the Interior, Annual Reports, Admin. Reports, Vol. 1, p. 44 (1916). It is likely that the incremental value to irrigators still exceeds the cost of irrigation projects by a substantial margin. See, e.g., P. Taylor, Excess Land Law: Secretary's Decision?, 9 U.C.L.A. L. Rev. 1, 6-7 (1962); P. Taylor, Excess Land Law on the Kern?, 46 Calif. L. Rev. 153, 161-63 (1958); P. Taylor, Destruction of Federal Reclamation Policy? The Ivanhoe Case, 10 Stan. L. Rev. 76, 92-93 (1957); Hogan, supra note 81, at 256-62.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e100. See generally 2 Waters \u0026 Water Rights, supra note 71, ยงยง 112.3(B), 123.2(A).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e101. H.R. Doc. No. 136, 80th Cong., 1st Sess. 2-3 (1947).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e102. H.R. Doc. No. 630, 76th Cong., 3d Sess. 2, 7-8 (1940); H.R. Doc. No. 631, 76th Cong., 3d Sess. V, VII, 25 (1940).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e103. There are other substantial elements of subsidy in the reclamation program, such as liberal terms and conditions of use and repayment, and the crediting of income from the sale of hydroelectric power and project water for industrial and community purposes to reduce construction costs otherwise payable by users of irrigation water. See generally Water Policies for the Future, supra note 79, at 145; Acreage Limitation Policy, supra note 9, at IX; Hogan, supra note 81, at 230-68; Ivanhoe Irrigation Dist. v. McCracken, 357 U.S. 275, 283, 295-96, 2 L. Ed. 2d 1313, 78 S. Ct. 1174 (1958). Many of these elements of subsidy are foregone by payout. However, the persistence of others argues in favor of Professor Taylor's thesis that the 160-acre limitation should be treated as perpetual. P. Taylor, Excess Land Law: Calculated Circumvention, 52 Calif. L. Rev. 978, 979 (1964); P. Taylor, The Excess Land Law: Execution of a Public Policy, 64 Yale L.J. 477, 481-89, 495-501 (1955). See note 109.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e104. S. Rep. No. 254, 57th Cong., 1st Sess. 3 (1902). See also Summary of Costs and Benefits, id. at 4.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e105. Acreage Limitation Policy, supra note 9, at 7-8; U.S. Reclamation Service, 14th Annual Report 5-6 (1915).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e106. See P. Taylor, The Excess Land Law: Execution of a Public Policy, 64 Yale L.J. 477, 512-14 (1955).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e107. Section 46 applies only to private lands, and the neutralization of this provision would not impede the accomplishment of Congress' antimonopoly, antispeculation, and homebuilding objectives with respect to the public lands on reclamation projects. But reclamation projects consist principally of private, not public, lands. In 1961, for example, it was estimated that \"approximately 60% of the total reclamation acreage consisted of service to projects originally developed with private capital and initiation, but later brought under the reclamation program . . . .\" Acreage Limitation Policy, supra note 9, at 82. Congress was aware of the predominance of private lands when ยง 46 was enacted. Two years earlier, in 1924, Congress had received the report of a Committee of Special Advisors on Reclamation appointed by the Secretary of the Interior, commonly known as the Fact Finders, pointing out that two thirds of the land in reclamation projects was privately owned.As the committee informed Congress, \"the principal activity of the [Reclamation] act has been to improve conditions on private land.\" Federal Reclamation by Irrigation, S. Doc. No. 92, 68th Cong., 1st Sess. 133 (1924). The Reclamation Service had recognized as early as 1905 that private lands would play an important role in the reclamation program. Its observations then are worthy of note: Lands in private ownership are frequently more important or more valuable than the public lands. The great and important safeguard in this connection is the restriction of ownership of water for these lands to 160 acres. By carefully guarding this provision and insisting upon compliance with the letter and spirit of the law it will be possible to bring about the subdivision of private lands into relatively small holdings and the intensive cultivation of the soil. U.S. Reclamation Service, 3d Annual Report 31 (1905).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e108. This is the crux of the King Instructions, 43 I.D. 339 (1914), discussed below. See pages 1129-1130.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e109. Professor Paul Taylor has argued that the 160-acre limitation continues to apply as long as project water is furnished, even though full payment has been made. See, e.g., P. Taylor, The Excess Land Law: Execution of a Public Policy, 64 Yale L.J. 477, 481-501 (1955). Solicitor Barry, in his 1961 opinion, concluded that private holdings may be expanded beyond 160 acres after \"payout\" only if a general pattern of family-sized farms has been established on the project by that time, thereby fulfilling a central purpose of the acreage limitation. 68 I.D. at 405.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e110. Sections 3 and 4, Act of June 17, 1902, 32 Stat. 388, 389, 43 U.S.C. ยงยง 416, 419, 432, 434.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e111. Prior to 1910, excess public land returned to the government and was open to entry by others. 33 I.D. 158, 159-60 (1904); 38 I.D. 620, 634-35 (1910). In 1910 Congress provided that an entryman could assign his entry, in whole or in part, after making proof \"of residence, improvement, and cultivation for the five years required by law.\" Act of June 23, 1910, ch. 357, 36 Stat. 592, 43 U.S.C. ยง 441. The purpose of the Act was \"to enable entrymen whose entries were cut down in area by the Secretary of the Interior in prescribing farm units to dispose of their surplus to others who would be able to hold it, fulfill conditions and secure a patent, and avoid a relinquishment or cancellation of the surplus which had been the consequence before the act.\" Irwin v. Wright, 258 U.S. 219, 231-32, 66 L. Ed. 573, 42 S. Ct. 293 (1922).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e112. Section 5 reads in pertinent part: No right to the use of water for land in private ownership shall be sold for a tract exceeding one hundred and sixty acres to any one landowner, and no such sale shall be made to any landowner unless he be an actual bona fide resident on such land, or an occupant thereof residing in the neighborhood of said land, and no such right shall permanently attach until all payments therefor are made. 32 Stat. 389, 43 U.S.C. ยง 431.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e113. The private landowner was also required by regulation to reclaim at least half of the irrigable land in his tract. 37 I.D. 468 (1909).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e114. H.R. Rep. No. 1468, 57th Cong., 1st Sess. 8 (1902). See also 35 Cong. Rec. 6677, 6678, 6680 (1902) (remarks of Rep. Mondell); U.S. Reclamation Service, 3d Annual Report 31 (1905), quoted in note 107.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e115. See, e.g., H.R. Rep. No. 1468, 57th Cong., 1st Sess. 8 (1902); 35 Cong. Rec. 6673-74, 6677, 6678, 6758, 6759 (1902). The effect of the various limitations imposed upon owners of private land on reclamation projects was \"virtually to require the private landowner to homestead a water right.\" B. P. King, The Excess Land Provisions of the Federal Reclamation Laws 58 (1941).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e116. See U.S. Dep't of Interior, Annual Reports, Admin. Reports, Vol. 1, p. 88 (1908); U.S. Dep't of Interior, Annual Reports 30 (1928); U.S. Reclamation Service, 11th Annual Report 7-8 (1912); U.S. Reclamation Service, 13th Annual Report 27 (1915). See also pages 1120-1121 \u0026 nn. 99, 104.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e117. The regulations provided, \"The entire building charge . . . may be paid at any time after the entry has been conformed to a farm unit. . . .\" 38 I.D. 620, 633 (para. 25) (1910); 40 I.D. 641, 662 (P 42) (1912) (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e118. Section 5 of the Reclamation Act of 1902, 32 Stat. 389, 43 U.S.C. ยง 439, required the entryman to reside on the land for five years and reclaim one half of the irrigable land on his entry before a patent would issue. The residency requirement was later reduced to three years. Act of June 6, 1912, ch. 153, 37 Stat. 123. Section 3 of the 1902 Act, 32 Stat. 388, 43 U.S.C. ยง 432, expressly provided that a public land entryman under the reclamation laws could not commute these residency and cultivation requirements by paying construction costs allocable to his land after 14 months' residence and cultivation, as an entryman under the homestead laws was permitted to do. See 43 U.S.C. ยง 173.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e119. H.R. Rep. No. 1468, 57th Cong., 1st Sess. 8 (1902). See also S. Rep. No. 254, 57th Cong., 1st Sess. 2 (1902).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e120. 34 I.D. 544 (1906); 33 I.D. 202, 203-04 (1904); Hearings on H.R. 8836 and 9611 before the House Committee on Irrigation \u0026 Reclamation, 68th Cong., 1st Sess. 203 (1924); U.S. Reclamation Service, 3d Annual Report 54-56 (1905). See also Acreage Limitation Policy, supra note 9, at 11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e121. 34 I.D. 544 (1906).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e122. See generally King, supra note 115, at 28-41; U.S. Reclamation Service, 2d Annual Report 48 (1904).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e123. 34 I.D. 544 (1906); U.S. Reclamation Service, 3d Annual Report 54-55 (1905); King, supra note 115, at 29. The Salt River Valley Water Users' Association was the first such organization, and later associations were patterned after it. Third Annual Report, supra, at 55. The contract between the United States and the Salt River Valley association, id. at 130-33, may therefore be regarded as typical.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e124. King, supra note 115, at 50. See, e.g., Contract between the United States and the Salt River Valley Water Users' Association, supra note 123 at P 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e125. 33 I.D. 202 (1904); King, supra note 115, at 37-41; Acreage Limitation Policy, supra note 9, at 11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e126. See, e.g., In re Goshen Irrigation Dist., 42 Wyo. 229, 293 P. 373 (1930) (condition of commencing construction was execution of trust deeds to insure that 95% -- later reduced to 90% -- of private lands would be included in the project in tracts of 160 acres or less).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e127. Section 4 of the Reclamation Act of 1902, 32 Stat. 389, 43 U.S.C. ยง 461, required the Secretary to establish construction charges for individual tracts with a view of returning the entire estimated cost of construction to the reclamation fund. So that the calculation might be more accurate, charges were not to be assessed to individual water users until after the Secretary had entered into contracts for construction of the project. Yuma County Water Users' Ass'n v. Schlecht, 262 U.S. 138, 144 (1923).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e128. 34 I.D. 544, 545 (1906); 40 I.D. 641, 667 (P 65) (1912); 45 I.D. 385, 404 (P 76), 407-08 (P 91), 409 (P 99) (1916). See also 43 C.F.R. ยง 230.65. Moreover, the application form approved by the Secretary in 1911 provided that final evidence of ownership of a water right would be issued only to an applicant \"whose aggregate water rights under the said Reclamation Act shall not exceed one hundred and sixty acres . . . at the time when final payment . . . is due.\" 39 I.D. 532, 534 (1911). A private landowner thus could not aggregate holdings in excess of 160 acres during the time between application and final payment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e129. 34 I.D. 544, 545 (1906); 38 I.D. 620, 640 (P 55e) (1910); 40 I.D. 641, 670 (P 77I) (1912). See also 43 C.F.R. ยง 230.80 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e130. Construction might proceed though some private land was not covered by trust deeds. See, e.g., In re Goshen Irrigation Dist., supra note 126. However, it would not have been possible for those few landowners who avoided executing trust deeds at the outset to later submit applications and receive water without first committing their excess lands to sale. To obtain water, owners of such lands had to become members of the water users' association (see notes 124 \u0026 129 and accompanying text), and to become members of such associations they had to execute trust deeds for the sale of excess lands. King, supra note 115, at 37; Landownership Survey, supra note 92, at 34.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e131. 40 I.D. 641, 669 (P 76 III) (1912). See also 45 I.D. 385, 407 (P 91); 43 C.F.R. ยง 230.80 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e132. Acreage Limitation Policy, supra note 9, at 11-12; King, supra note 115, at 52. The 1916 regulations made explicit the necessary consequences of these provisions: \"Holders of more than 160 acres of irrigable land . . . must sell or dispose of all in excess of that area before water-right application will be accepted from such holders.\" 45 I.D. at 404 (P 76). This regulation, in similarly unqualified language, is still in effect. 43 C.F.R. ยง 230.65 (1974). The 1912 regulations were to the same effect, requiring holders of more than 160 acres of irrigable land to dispose of the excess before they could receive project water. 40 I.D. at 665 (P 54). From an early date, the regulations also took cognizance of the prevalent trust deed practice and accepted it as an alternative to outright disposal of excess lands: If the holder of a greater area desires, he can subscribe for stock in the local water users' association (if there be one) for his entire holding, executing a trust deed, giving the association power to ultimately sell the excess area to actual settlers who are qualified to comply with the reclamation act, unless the land has been sold by the owner when the Government is ready to furnish water thereon. 40 I.D. at 665 P (54) (1912). This same regulation was substantially repromulgated in 1916, 45 I.D. at 404 (P 76), and remains in effect today. 43 C.F.R. ยง 230.65 (1974). However, since water users' associations were not organized on new projects after about 1910 or 1912, King, supra note 115, at 33 n.9, the current regulations permit the owner of excess land, as an alternative to executing a trust deed empowering a water users' association to sell the land, to \"provide for the disposal of such excess holdings in some manner approved by an authorized officer of the Department of the Interior.\" 43 C.F.R. ยง 230.65. The 1916 regulations contained a similar option. 45 I.D. at 404 (P 76). The practice of requiring owners of over 160 acres of project land to execute trust deeds for the sale of excess holdings continued after water users' organizations were no longer organized. See, e.g., In re Goshen Irrigation Dist., supra note 126. See also note 155. The recordable contract provision of ยง 46 of the 1926 Act, empowering the Secretary of the Interior to sell excess lands if the owner does not do so within a stipulated period of time, see note 92, is remarkably similar to the trust deed device, King, supra note 115, at 40-41, and was no doubtpatterned after it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e133. Notes 128-29, 131-32. Water users have not been required to submit water right applications on projects constructed after 1926. Instead, the Department depends on irrigation districts to enforce the acreage limitations by withholding project water from excess lands for which recordable contracts have not been executed, as contemplated by ยง 46 of the 1926 Act. Acreage Limitation Policy, supra note 9, at 15-16; Landownership Survey, supra note 92, at 44-45.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e134. Ch. 278, 37 Stat. 265.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e135. 2 Waters \u0026 Water Rights, supra note 71, ยง 120.10, at 226.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e136. S. Rep. No. 608, 62d Cong., 2d Sess. (1912).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e137. Sections 1 and 2, 37 Stat. 265, 266, 43 U.S.C. ยงยง 541, 542.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e138. 37 Stat. 266, 43 U.S.C. ยง 544 (emphasis added). The entire proviso of ยง 3 of the 1912 Act reads: Provided That no person shall at any one time or in any manner, except as hereinafter otherwise provided, acquire, own, or hold irrigable land for which entry or water-right application shall have been made under the said reclamation act of June seventeenth, nineteen hundred and two, and acts supplementary thereto and amendatory thereof, before final payment in full of all installments of building and betterment charges shall have been made on account of such land in excess of one farm unit as fixed by the Secretary of the Interior, as the limit of area per entry of public land or per single ownership of private land for which a water right may be purchased respectively, nor in any case in excess of one hundred and sixty acres, nor shall water be furnished under said Acts nor a water right sold or recognized for such excess; but any such excess land acquired at any time in good faith by descent, by will, or by foreclosure of any lien may be held for two years and no longer after its acquisition; and every excess holding prohibited as aforesaid shall be forfeited to the United States by proceedings instituted by the Attorney General for that purpose in any court of competent jurisdiction; and this proviso shall be recited in every patent and water-right certificate issued by the United States under the provisions of this Act. (emphasis added)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e139. But see note 109, and especially Taylor, 64 Yale L.J. at 487-501.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e140. See notes 128-33, and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e141. See pp. 1122-1123.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e142. U.S. Dep't of the Interior, Excess Land Provisions of the Federal Reclamation Laws and the Payment of Charges, Part I, 14-15 (1956). Cf. 48 Cong. Rec. 9083 (1912) (remarks of Rep. Raker).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e143. Letter from Warren L. Fisher to the President, Aug. 6, 1912, at 4 (emphasis added). Secretary Fisher continued, \" By that time it is believed that the land will be in the hands of permanent settlers and speculative holdings eliminated.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e144. 43 I.D. 339 (1914).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e145. The entire passage, in which the Chief Counsel expresses disapproval of a perpetual acreage limitation, reads: Such a limitation is a radical departure from all the public land laws, as apparently there never has been any intent by Congress to limit the amount of land which a man may own after having complied in full with the provisions of the law in order to acquire the title, and as the water right becomes on final payment an appurtenance to the land the same rule governs. Id. at 340 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e146. The current regulations embody the holding of the King Instructions in the words: \"The Secretary has decided that the area which may be held by any one landowner after the construction charges have been fully paid may exceed 160 acres.\" 43 C.F.R. ยง 230.65 (1974). Obviously, this sentence does not permit a landowner to hold more than 160 acres before construction charges are paid in full. The quoted passage is included in the same regulation that provides that \"holders of more than 160 acres of irrigable land . . . must sell or dispose of all in excess of that area before water-right application will be accepted from such holders.\" See note 132.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e147. Act of Aug. 3, 1914, ch. 247, 38 Stat. 686.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e148. See generally Acreage Limitation Policy, supra note 9, at 6; King, supra note 115, at 97; Hearings on H.R. 13921 before the House Committee on Irrigation of Arid Lands (Part I), 63d Cong., 2d Sess. 22 (1914). U.S. Reclamation Service, 14th Annual Report 5-6 (1915).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e149. 38 Stat. 689, 43 U.S.C. ยง 418. The report of the House committee stated: Another very important provision of the bill preventing speculation may be found in section 12, which provides that before the Secretary of the Interior shall hereafter undertake any new project he shall require the owner of private lands thereunder to dispose of all his lands in excess of the area deemed sufficient to support a family, upon such terms and at such price as the Secretary of the Interior may designate.If this provision shall be adopted speculation in lands under reclamation projects will be reduced to a minimum, and the burdens of the real farmer who undertakes to reclaim and cultivate the lands, and for whose benefit the reclamation law was enacted primarily, can be kept normal. H.R. Rep. No. 350, 63d Cong., 2d Sess. 3 (1914).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e150. See note 127.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e151. Hearings on H.R. 13921, supra note 148, at 13.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e152. See, e.g., 51 Cong. Rec. 5028, 12225, 12232, 12241, 12952, 13362 (1914). It is a fair conclusion from the legislative history that \"Section 12 of the 1914 act was designed specifically to cope with the special problem of initially breaking up these excess holdings and preventing the owners from capitalizing on the benefits of Federal construction in the form of high prices charged to purchasers of their lands.\" Acreage Limitation Policy, supra note 9, at 7 (emphasis added). See also 2 Waters \u0026 Water Rights, supra note 71, ยง 120.1, at 211-12. Payout would of course negate both of these essential purposes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e153. As Solicitor Barry stated, \"The legislative history of the Extension Act of 1914 is devoid of even the remotest suggestion that the restriction of Section 12 could be lifted or its purpose frustrated by immediate or early payout.\" 68 I.D. at 388.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e154. Section 1 of the 1914 Act provides that the landowner or entryman must pay 5% of the construction charges fixed for his land \"at the time of making water-right application or entry, as the case may be,\" and that he must pay the balance in 15 annual installments beginning five years later. The section further provides that \"any water-right applicant or entryman may, if he so elects, pay the while or any part of the construction charges owing by him within any shorter period.\" 38 Stat. 686, 43 U.S.C. ยง 471. It has been argued that the option of lump sum payment implies an option to avoid the sale of excess holdings. But the lump sum payment option is offered to public land entrymen as well as to owners of private lands, and no one contends that prepayment would permit an entryman to retain excess public land. See pages 1124-1125. Moreover, as pointed out in the text, the obligation imposed by ยง 12 of the 1914 Act to agree to sell excess land arose before construction began or was contracted for, and therefore before construction charges could be repaid. See text at footnotes 149-51. Section 1 itself provides that the initial payment is to be made when the charge per acre is established. There is no legislative history to explain the purpose of the lump sum provision, but in some circumstances lump sum \"payout\" might be desirable even though it did not avoid the requirement that large holdings be divided in the first instance. Under the King Instructions, it would have permitted the owner either to dispose of his land more readily or acquire additional acreage. Section 13 of the 1914 Act closes with the proviso \"that no person shall hold by assignment more than one farm unit prior to final payment of all charges for all of the land held by him subject to the reclamation law . . .\" 38 Stat. 690, 43 U.S.C. ยง 443 (emphasis added). This proviso cannot be used to support a \"payout\" exception to the requirement that excess private land be disposed of. In the first place, ยง 13 as a whole applies only to \"entries under reclamation projects,\" 38 Stat. 690, 43 U.S.C. ยง 435, that is, to public land; and of course the proviso does not imply that excess public lands might be retained by paying construction charges. See pages 1124-1125. In the second place, this proviso, like the proviso in ยง 3 of the 1912 Act, relates only to obtaining lands \"by assignment,\" that is, to the acquisition of additional lands, and not to retention of excess lands held at the outset. See pages 1127-1129; Barry Opinion, 68 I.D. at 386 n.35.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e155. See notes 128-33 and related text. In implementing the 1914 Act, the Department required owners of excess land to convey that excess to a trustee, who would undertake to convey the land to a person designated by the original owner at a price approved by the Secretary. If the original owner did not arrange for the sale within a given period of time after public notice was given that water was available, the trustee was empowered to sell the land. See, e.g., In re Goshen Irrigation Dist., supra note 126. See also Acreage Limitation Policy, supra note 9, at 17; King, supra note 115, at 102. Conveyance to the trustee occurred before construction began, but under ยง 1 of the 1914 Act, landowners did not submit water right applications and pay construction charges until after water was available from the project.38 Stat. 686, 43 U.S.C. ยงยง 471, 472. Full repayment of construction charges would have come too late to avoid the trustee arrangement, just as it would have when a water users' association was designated as the trustee. See pages 1125-1126.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e156. Hearings on H.R. 8836 and H.R. 9611, supra note 120, at 350-51. Barry Opinion, 68 I.D. at 393 n.59. As the Department reported to Congress after a re-examination of the legislative history and antecedents of ยง 46 of the 1926 Act: \"It is readily observable that the genesis of section 46 [of the 1926 Act] is to be found in section 12 of the 1914 act which had attempted to effect the sale of excess lands but had . . . failed for a number of reasons. . . . Thus there can be no question that the requirement of section 46 that the excess landowner contractually agree to the disposition of excess lands as a condition to receiving project water for such excess lands was deliberately enacted by the Congress in further pursuance of its policy designed to secure the breakup of preexisting excess holdings benefiting from the expenditure of Federal funds, and to prevent the owners of such holdings from reaping unearned profit at the expense of purchasers. It is this congressionally expressed policy, as enacted into law in section 46 of the 1926 Act, which today provides the basis for administration of the acreage limitation provisions of reclamation law.\" Acreage Limitation Policy, supra note 9, at 8. See also King, supra note 115, at 128.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e157. Federal Reclamation by Irrigation, S. Doc. No. 92, 68th Cong., 1st Sess. (1924).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e158. Id. at 36-39, 114, 133-34.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e159. Id. at 4 (emphasis added). See also id. at 124.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e160. Id. at 204, 205.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e161. Hearings on H.R. 8836 and H.R. 9611, supra note 120, at 52.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e162. Id. at 46-49, 323-30.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e163. Id. at 49.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e164. Id. at 323.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e165. Id. at 325-26, 329-30, 345.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e166. Id. at 46-49, 327.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e167. In administering the 1926 Act the Department of the Interior has required, to the extent practicable short of impasse, that individual commitments to sell be obtained before construction is begun. The Bureau has stated that the \"administration under section 46 may be illustrated by the procedure followed in the case of the Vale project.\" Landownership Survey, supra note 92, at 46. That project is described in more detail in King, supra note 115, at 129-33. In the Vale project, it was made a prerequisite to construction that individual contracts to sell be executed with the United States covering 75% of the excess lands. On certain other projects, individual contracts to sell excess lands were secured during construction or just before water was ready for delivery.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e168. A similar change was made in the time at which a joint liability repayment contract must be executed with the irrigation district. It was originally provided that this contract must be executed before construction commenced. The Senate Committee on Irrigation and Reclamation recommended that the provision be changed to require execution of the contract before project water was delivered to the district, and represented that the change would not diminish the effectiveness of the provision: 8. On page 33, lines 11, 12, and 13, strike out the following words, \"No part of any sum hereafter appropriated for any new project or new division of a project shall be expended for construction purposes,\" and insert in lieu thereof the following: \"No water shall be delivered upon the completion of any new project or division of a project.\" This section, as approved by the House, would prevent appropriations by Congress for new projects or new divisions until proper contracts had been made by the United States with an irrigation district or irrigation districts. It is thought, however, that contracts could not be successfully negotiated until after some action involving an appropriation had been taken by the Federal Government, and that the language recommended by your committee will amply protect the United States in the desired manner. S. Rep. No. 831, 69th Cong., 1st Sess. 3 (1926) (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e169. The first problem was that control of the terms of the initial sale of excess lands did not prevent introduction of a middleman who could turn a rapid and substantial profit and resell to a settler at a burdensome price. U.S. Reclamation Service, 14th Annual Report 6 (1915). The second problem arose out of the fact that ยง 11 of the 1914 Act, 38 Stat. 689, 43 U.S.C. ยง 465, was interpreted to permit project water to be furnished to excess lands until the Department gave official public notice of the construction charges allocated to each tract. Trust deeds normally did not require that excess lands be sold until this notice was given. The notice was often delayed, excess lands were supplied with water for a considerable period of time, and the redistribution of such lands was delayed indefinitely. See Landownership Survey, supra note 92, at 42. Section 46 of the 1926 Act attacked both problems. The problem of uncontrolled sales by middlemen was minimized by imposing controls on at least some subsequent sales of excess lands, see text at footnotes 170-172; the problem of indefinite delay in sale of excess lands under trust deeds was addressed by the provision that no project water was to be delivered until a repayment contract embodying the recordable contract requirements had been executed by the irrigation district. See note 94. In addition to closing specific loopholes in the 1914 Act, ยง 46 of the 1926 Act strengthened the Secretary's hand in other ways. The Secretary was directed to require a \"recordable contract\" to dispose of excess lands rather than the generalized agreement authorized by the 1914 Act. The Secretary was required to contract with irrigation districts rather than individual water users for repayment of construction charges. The irrigation districts could assess owners of excess lands for the district's repayment obligation under the joint liability contract even though those lands were denied water, thus providing a powerful economic incentive to execute contracts for the sale of excess lands. See, e.g., Shoshone Irrigation Dist. v. Lincoln Land Co., 51 F.2d 128, 129 (D. Wyo. 1930); Nampa \u0026 Meridian Irrigation Dist. v. Petrie, 28 Idaho 227, 236-37, 153 P. 425, 429-30 (1915); Klamath County v. Colonial Realty Co., 139 Ore. 311, 317-18, 7 P.2d 976, 978-79 (1932); In re Goshen Irrigation Dist., 42 Wyo. 229, 293 P. 373, 378-79 (1930). See Landownership Survey, supra note 92, at 44-45; King, supra note 115, at 116-21. In 1922, Congress first authorized the Secretary to contract with irrigation districts and to release government liens in prior water right applications covering land that was brought into a contracting irrigation district. Act of May 15, 1922, ch. 190, 42 Stat. 541. One inducement for passing the act was the belief that assessment by the irrigation district would lead to the breakup of excess holdings. 62 Cong. Rec. 3588 (1922); Landownership Survey, supra, at 43.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e170. The two concluding clauses of ยง 46 are repeated below for convenient reference: that no such excess lands so held shall receive water from any project or division if the owners thereof shall refuse to execute valid recordable contracts for the sale of such lands under terms and conditions satisfactory to the Secretary of the Interior and at prices not to exceed those fixed by the Secretary of the Interior; and that until one-half the construction charges against said lands shall have been fully paid no sale of any such lands shall carry the right to receive water unless and until the purchase price involved in such sale is approved by the Secretary of the Interior and that upon proof of fraudulent representation as to the true consideration involved in such sales the Secretary of the Interior is authorized to cancel the water right attaching to the land involved in such fraudulent sales . . . . 44 Stat. 649-50, as amended 43 U.S.C. ยง 423e.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e171. See note 169. See also King, supra note 115, at 102-03 \u0026 n.46; Hearings on H.R. 8836 and H.R. 9611, supra note 120, at 49.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e172. The clause is described as applying to \"subsequent\" sales in King, supra note 115, at 129. See also Landownership Survey, supra note 92, at 46; Sax, supra note 71, at 20-28. By imposing restrictions on subsequent sales of excess land only until one half of the construction charges had been repaid, Congress reached an accommodation between competing policies of eliminating the middleman and allowing the purchasing settler to alienate his land freely and realize some of its enhanced value, which might be attributable in part to the settler's efforts in reclaiming the land and preparing it for cultivation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e173. Appellees find support for pre-1926 recognition of their \"payout\" theory in the King Instructions issued July 1, 1914, and in four letters written by Interior Department officials to water users over a four-year period from 1919 to 1924. As we have seen, the King Instructions were concerned with purchase, sale, and consolidation of vested water rights, not with avoidance of the initial breakup of excess holdings. See footnotes 144-46 and related text. Three of the four letters relied upon were addressed to the Salt River Valley Water Users' Association. See 1956 Study, supra note 142, Part I, Exhs. 4, 5, \u0026 7. This was one of the first associations to use trust deeds to secure the breakup of excess holdings. The Department had approved the use of the trust deed procedure by this association some 15 years before the earliest of these letters was written. 33 I.D. 202 (1904). See notes 123-24.In all probability, therefore, the initial breakup of excess holdings had been accomplished, and the letters referred to the inapplicability of acreage limitations to the subsequent alienation and consolidation of rights that had vested by payment of construction charges. The two more detailed letters specifically rely upon ยง 3 of the 1912 Act and the King Instructions. Exhs. 5, 7. The fourth letter is a notice mailed to the water users on the Yuma project in Arizona on July 27, 1924, 1956 Study, supra, Part I, Exh. 8. It expressly informed landowners that an application for project water would be accepted only from an individual \"who, at the time of making the application, can show that he has the record title to the land not exceeding 160 irrigable acres . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e174. Appellees rely upon four documents in particular from this 15-year span: a letter written in 1928 to the president of an irrigation district by Commissioner of Reclamation Elwood Mead, a letter written in 1930 by Secretary of the Interior Ray Lyman Wilbur to an insurance company that had foreclosed on mortgages and obtained more than 160 acres of project land, and two notices sent in October 1939 to Yakima and Boise project water users. The Mead letter (Letter from Elwood Mead, Commissioner of Reclamation, to C. C. Lewis, President, Enterprise Irrigation Dist., Jan. 27, 1928, 1956 Study, supra note 142, Part I, Exh. 20) was written in response to suggestions that Congress be asked to enact clarifying legislation to aid in the disposition of pending litigation involving the Klamath project. See Letter from J. H. Carnahan to R. J. Coffey, District Counsel. Reclamation Service, Dec. 8, 1927, id., Exh. 18; Memorandum from District Counsel Richard J. Coffey to the Commissioner of Reclamation, Dec. 10, 1927, id., Exh. 17. The inquiry and response are business letters, not legal documents. Understandably, the language is general and lacking in precision. Nonetheless, it is clear from the background of the litigation that neither the inquiry nor the response was concerned with the initial breakup of excess project lands. One landowner involved in the litigation had 160 acres under irrigation in the Klamath project and excess acreage in the Enterprise Irrigation District, which was outside the Klamath project. The Enterprise Irrigation District received surplus project water under the Warren Act, Act of Feb. 21, 1911, ch. 141, 36 Stat. 925, 43 U.S.C. ยงยง 523-25. See Enterprise Irrigation Dist. v. Enterprise Land \u0026 Inv. Co., 137 Ore. 468, 300 P. 507 (1931); U.S. Bureau of Reclamation, Reclamation Repayments \u0026 Payout Schedules 166 (1965). Since the Department's regulations directed at initial breakup were applicable only to project land (40 I.D. 641, 665 (P 54), 669 (P 76) (1912); 45 I.D. 385, 404 (P 76), 407 (P 91), 409 (P 99) (1916)), it was not necessary for the landowner to dispose of the lands in the Enterprise Irrigation District to make application for water for the 160 acres in the Klamath project, even assuming the landowner owned both pieces of land when the application was submitted. Thus, no question of initial breakup was presented. The other property involved in the Klamath litigation was within the project boundaries, but the landowner in question was not the original owner.The landowner had acquired its more than 700 acres long after the particular section of the Klamath project had been developed, from persons who presumably had complied with the Department's regulations and the association's trust deed procedures for disposing of excess land. Klamath County v. Colonial Realty Co., 139 Ore. 311, 313, 7 P. 2d 976, 977 (1932). Again, no question of initial breakup was involved. The second piece of correspondence relied upon by appellees, a letter from Ray Lyman Wilbur, Secretary of the Interior, to Edw. O. Clark, Associate General Solicitor, Prudential Insurance Co., Feb. 27, 1930, 1956 Study, supra, Part I, Exh. 9, involves only subsequently acquired lands. The notice to the water users on the Boise and Yakima projects does not support appellees' \"payout\" theory. The first portion of the notice informs landowners in unqualified language that they must execute recordable contracts for the sale of excess lands to receive project water for those lands. The second portion informs landowners that before water is furnished each year they will be required to satisfy the Bureau that they own no more than 160 acres on which construction charges have not been paid. The obvious purpose of this portion of the notice was to insure that landowners who had complied with initial breakup requirements had not acquired any nonqualifying land during the precedingyear. See Landownership Survey, supra note 92, at 47. There is no suggestion that by paying construction charges persons who initially held more than 160 acres could avoid the recordable contract provision stated in the preceding portion of the notice.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e175. Hogan, supra note 81, at 108.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e176. The defeated proposal was a rider to the Rivers \u0026 Harbors Bill, H.R. 3961, 78th Cong., 2d Sess. (1944), proposed by Congressman Elliott of California. See Ivanhoe Irrigation Dist. v. McCracken, 357 U.S. at 292-93.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e177. Appellees argue that two passages in the testimony of witnesses from the Department of the Interior before congressional committees reflect the view that acreage limitations would not survive \"payout\" of construction charges. The first is an answer given by Commissioner Bashore to a question put to him in the House hearings by Representative Curtis. Commissioner Bashore was asked if the Bureau wanted \"the distributing system to have jurisdiction\" over irrigation water \"until the Federal Government\" is paid.Commissioner Bashore answered, \"Yes, sir.\" 1944 House Hearings, supra note 13, at 646. Whatever this passage may mean, it is clear from the context that it cannot be read as an endorsement of the position that landowners should be granted an option to avoid the initial breakup of excess holdings.Immediately before this exchange Commissioner Bashore had argued that removal of the 160-acre limitation \"would permit speculation in lands where the owners are recipients of Government benefits.\" Id. at 643. He continued: We are concerned with the little people, Mr. Elliott, in the Western States of the United States. We are charged with the responsibility of making homes for more of the soldiers coming back from the war. We want as many farms as possible for those little people, and we do not want to eliminate all control over the size of holdings of all lands owned by people that come to the Federal Government to get money to provide supplemental works to perfect their water rights. Id. The second bit of testimony relied upon by appellees was not given at hearings concerned with the Flood Control Act of 1944, but in Senate hearings on the Elliott Rider, later defeated, that would have exempted the Central Valley project from the acreage limitations. See note 176. In any event, it does not support appellees' \"payout\" theory. Assistant Commissioner of Reclamation William E. Warne was told \"That a farm boy should have the right . . . to acquire more than 160 acres if his efforts justify it . . .;\" and was accused of \"denying them the right to be anything except 160-acre farmers.\" Mr. Warne responded, \"I think you misconstrue this, because nowhere does this limitation apply after the project is paid for, and in most instances it is after the project is half paid for.\" Another witness rejoined, \"Well, that, of couse, for your time and mine, is entirely meaningless. That means 40 years, . . .\" (emphasis added). Hearings on H.R. 3961 before a Subcommittee of the Senate Commerce Committee, 78th Cong., 2d Sess. 702-03 (1944). Obviously this exchange related to the ability of a landowner to expand his holdings after charges had been paid, the problem dealt with in the King Instructions. It had nothing to do with avoiding, by \"payout,\" the requirement that excess holdings be broken up at the outset. Appellees cite nothing further from the legislative history of the 1944 Act in support of their argument that Congress recognized and approved the \"payout\" theory. We have found nothing. It is unlikely that application of acreage limitations to the Kings River project and other projects nearby would have generated the controversy it did if the limitation could have been so readily avoided. It is even less likely that such an option would have gone unmentioned in the hundreds of pages of committee hearings and congressional debate. Appellees argue, however, that the \"payout\" option is incorporated in a proviso to the portion of ยง 10 of the Act that authorizes construction of the Pine Flat Dam. The proviso reads: \"That the Secretary of War shall make arrangements for payment to the United States by the . . . responsible agency, either in lump sum or annual installments, for conservation storage when used.\" 58 Stat. 901 (emphasis added). See note 27. An intention to apply appellees' \"payout\" theory to the Pine Flat project can hardly be inferred from this simple reference to lump sum payment. There is no evidence that Congress had any knowledge of such a theory. The proviso had another purpose. The Department of the Interior had recommended that Kings River project water users repay construction costs in 40 annual installments, as authorized under reclamation law, H.R. Doc. No. 631, 76th Cong., 3d Sess. IV, VIII (1940); the Corps of Engineers had proposed a discounted lump sum payment. H.R. Doc. No. 630, 76th Cong., 3d Sess. 4-5 (1940). Congress authorized construction of the Kings River project according to the specifications in the report of the Corps of Engineers, but it did not then approve the method and amount of repayment proposed for the project in that report. Instead, a new formula was to be developed in negotiations between the water users and the United States. 58 Stat. 901. See note 27. The obvious reason for the reference to \"lump sum or annual installments\" in the authorization for the Pine Flat Dam was to avoid any intimation in subsequent negotiations that Congress preferred one method of repayment over the other. Appellees assert that a letter written by Secretary of the Interior Oscar Chapman to Congressman Whittington on Nov. 2, 1950, reflects an interpretation of the lump sum payment proviso of ยง 10 of the 1944 Act as an option to avoid initial sale of excess lands.The letter was written during the period in which the Department followed the view of the Cohen opinion that by paying construction charges landowners could avoid the requirement that they dispose of excess lands. Given this premise, it would follow, of course, that lump sum repayment pursuant to the proviso in ยง 10 of the 1944 Act would allow retention of excess holdings. As demonstrated in the text, however, the Cohen opinion, and hence the premise of Secretary Chapman's letter, was in error and was later repudiated. See pages 1139-1143.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e178. Hearings on S. 912 before a Subcommittee of the Senate Committee on Public Lands, 80th Cong., 1st Sess. (1947).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e179. H.R. 7915, 81st Cong., 2d Sess. (1950); H.R. 413, 82d Cong., 1st Sess. (1951).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e180. See Letter from Douglas McKay, Secretary of the Interior, to Congressman Clair Engle, Mar. 2, 1954, at 3, 1956 Study, supra note 142, Part I, Exh. 59.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e181. Memorandum M-35004 from Felix S. Cohen, Associate Solicitor, Dep't of the Interior, to the Commissioner of Reclamation, Oct. 22, 1947, 1956 Study, supra note 142, Part I, Exh. 27. Reliance is also placed upon Administrative Letter No. 303 from Michael W. Straus, Commissioner of Reclamation, to the Regional and Branch Directors, Bureau of Reclamation, Dec. 16, 1947, id. Exh. 26, which transmitted and explained Solicitor Cohen's opinion to the Bureau's field offices. For example, in letters defending his authorization of negotiations on a \"payout\" theory, Secretary Douglas McKay relied only on the Cohen opinion, Administrative Letter No. 303, and ยง 3 of the 1912 Act. See Letters from Douglas McKay to Congressman Clair Engle; Rev. Donald McDonnell; George Sehlmeyer, Master, California State Grange; and C. J. Haggerty, Secretary-Treasurer, California State Federation of Labor, Mar. 2, 1954, 1956 Study, supra, Part I, Exhs. 59-62. See also Exhs. 36, 39, 40, 42, 46-54, 66, 68. See generally Barry Opinion, 68 I.D. at 399-402. Until 1955 the Department did not attempt to justify its position on any other basis. In that year the House Committee on Government Operations requested a comprehensive review of contract negotiations on the Kings River project. See Letter from Congressman William L. Dawson to Douglas McKay, Secretary of the Interior, Dec. 7, 1955, 1956 Study, supra, Part I, at V. In 1956 the Department furnished the committee with a two-volume study of the history of the \"payout\" principle and of the negotiations on the Kings River project. See Letter from Clarence A. Davis, Under Secretary of the Interior, to Congressman Earl Chudoff, May 25, 1956, id. at i. As we have shown, the correspondence collected in this post hoc defense of the \"payout\" principle is both meager and unpersuasive; most of it simply restates the holding of the King Instructions. See notes 173 and 174.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e182. See Landownership Survey, supra note 92, at 44-45; King, supra note 115, at 196-201.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e183. Landownership Survey, supra note 92, at 3-26.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e184. See Hearings on S. 912, supra note 178.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e185. Administrative Letter No. 303, supra note 181, at 3; P. Taylor, The Excess Land Law: Execution of a Public Policy, 64 Yale L.J. 477, 492-93 (1955); A. Davis, The Excess Land Law in the Central Valley of California, 1962 (Doctoral Dissertation in the Library of the University of California at Berkeley) at 83, 95 n.259. During the 1947 conference Bureau personnel also expressed the need to present Congress with a record of enforcement. See text at note 183.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e186. Administrative Letter No. 303, supra note 181.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e187. In a memorandum authorizing the Regional Director to accept a lump sum payment of the balance of charges owed by the Klamath Drainage District with the understanding that the acreage limitation would be lifted, Commissioner Straus stated: This, however, should not be construed as a precedent for other projects. An offer of prepayment of construction charges at the time of the organization of a district, or in the early years of the contract, obviously would create an altogether different situation. Memorandum from Michael Straus, Commissioner of Reclamation, to the Director, Sacramento Region, Bureau of Reclamation, Jan. 27, 1948. Administrative Letter No. 303, written by Commissioner Straus, is by its own terms (at page 1) confined to \"existing projects.\" See note 181. For Secretary Chapman's position, see note 189.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e188. See, e.g., Memorandum from Michael Straus to the Secretary of the Interior, Jan. 18, 1952, 1956 Study, supra note 142, Part I, Exh. 36. Commissioner Straus and the Secretary of the Interior sharply disagreed on the applicability of the Cohen opinion to the Pine Flat project. Id., Exhs. 35, 36, 41, 42, 43.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e189. In March 1951 Secretary Chapman wrote to a number of Congressmen explaining the origins of the Cohen opinion and Administrative Letter No. 303, which transmitted the Cohen opinion to the Bureau's field offices. The letter included the following paragraphs: You will be interested to know that in the entire State of California no situation exists on a Federal Reclamation project where Administrative Letter 303 has been applied or is being considered. While the previous degree of non-compliance on the older projects was a serious problem, we are more keenly concerned with the effectiveness of the acreage limitation provisions on the irrigation projects that are now coming into operation and are presently under construction. The great Central Valley Project in your State, for example, and similarly the Columbia Basin Project in Washington, are outstanding opportunities for maintenance of the family size farm. On these, and other new projects, of course, the purposes of Administrative Letter 303 are not relevant because they have been authorized subsequent to the Act of 1926 and are subject to the existing legal requirements for recordable contracts. Letter from Oscar L. Chapman to Congressman John Shelley, Mar. 29, 1951, at p. 2, 1956 Study, supra note 142, Part I, Exh. 29. The Secretary was not alone in this view. See, e.g., Memorandum from Richard L. Boke, Director, Sacramento Region, Bureau of Reclamation, to the Commissioner of Reclamation, Oct. 31, 1951, at pp. 2-3, id., Exh. 31. In June 1952, Secretary Chapman also concluded that because Administrative Letter 303 and the Cohen opinion applied only to old projects on which the acreage limitation provisions had not been enforced, it did not apply to the Pine Flat project. In explaining his position in response to an inquiry, the Secretary stated: Administrative Letter No. 303, to which you refer, was promulgated in order to achieve, with respect to certain lands on older projects, the principles then and since laid down by the Congress with respect to acreage limitations on lands benefited by Federal projects. . . . We have no situation on a Federal reclamation project in the State of California where Administrative Letter No. 303 has been applied or is considered for application. Concerning the Kings River Project, I have stated previously and wish to assure you that negotiations will proceed only on the basis of compliance with the provisions of the reclamation laws prescribing limitations on the acreage of land which may be benefited, and the conditions under which those lands may be benefited under Federal reclamation. Letter from Oscar L. Chapman to Professor Correll M. Julian, June 23, 1952, id., Exh. 44.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e190. Memorandum from Oscar L. Chapman to the Commissioner of Reclamation, Dec. 23, 1952, id., Exh. 47.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e191. Id. See also Letter from Oscar L. Chapman to Senator Paul H. Douglas, Jan. 17, 1953, id., Exh. 50. There is a conflict in the Department's files as to whether Secretary Chapman withdrew his order of Dec. 23 in the closing days of the Administration. Contrast Memorandum for the Record from Michael W. Straus, Commissioner of Reclamation, Feb. 6, 1953, id., Exh. 54, with Memorandum for the Files from Fred A. Clarenbach, Program Staff, Bureau of Reclamation, Feb. 3, 1953, id., Exh. 55.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e192. See Articles 3(b) and 6, Draft Contract between the United States of America and the Kings River Conservation District, Oct. 27, 1955, id., Part II, Exh. 52.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e193. Id., Part I, Exhs. 84-100. Secretary of the Interior McKay left office in the spring of 1956 without signing the proposed contract. P. Taylor, The Excess Land Law: Pressure vs. Principle, 47 Calif. L. Rev. 499, 520 (1959); Barry Opinion, 68 I.D. at 401.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e194. 64 I.D. 273, 278-79 (1957).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e195. Letter from Fred A. Seaton, Secretary of the Interior, to Philip A. Gordon, President, Board of Directors, Kings River Conservation District, July 12, 1957, at p. 3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e196. Barry Opinion, 68 I.D. at 374-75.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e197. Letter from Fred A. Seaton to Attorney General William P. Rogers, Jan. 19, 1961.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e198. P. Taylor, Excess Land Law: Secretary's Decision ?, 9 U.C.L.A.L. Rev. 1, 5 (1962).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e199. 68 I.D. at 404-05. 200 Letter from Robert F. Kennedy to the Secretary of the Interior, Dec. 29, 1961, 68 I.D. 370. 201 Appellees have sought support for their payout argument by citing provisions in a number of contracts negotiated with water users' organizations after 1947, some of which were submitted to and approved by Congress pursuant to ยง 7 of the Reclamation Project Act of 1939. Section 7, Act of Aug. 4, 1939, ch. 418, 53 Stat. 1187, 1192, 43 U.S.C. ยง 485f. For the most part, the contract clauses relied upon are general in terms and consistent with the holding of the King Instructions that lands initially in compliance with the acreage limitation may be consolidated into larger tracts after payout. A few do contemplate avoidance of the requirement of initial breakup of excess holdings. However, these were drafted during the period when the Cohen opinion prevailed as Department policy. They have no significance independent of that opinion, since repudiated. Barry Opinion, 68 I.D. at 401. See 1956 Study, supra note 142, Part I, at 54; Letter from Douglas McKay, Secretary of the Interior, to Congressman Clair Engle, Mar. 2, 1954, at p. 2, 1956 Study, Part I, Exh. 59. Appellees can derive no additional support from congressional approval of these contracts. The contracts were submitted for the purpose of obtaining approval of provisions having nothing to do with acreage limitations. Letter from Douglas McKay to Clair Engle, supra, at 2; 1956 Study, supra, Part I, at 54; P. Taylor, The Excess Land Law: Pressure vs. Principle, 47 Calif. L. Rev. 499, 521-22 (1959). There is no indication that Congress ever gave consideration either to these provisions, or to appellees' \"payout\" theory.\u003c/span\u003e\n\n",
    "body_length": 231802,
    "citedas": [
      "535 F.2d 1093"
    ],
    "attorneys": "Douglas King, Atty. (argued), Land and Natural Resources Division, U.S. Dept. of Justice, Washington, D.C. for Appellant USA. Alvin J. Rockwell, Esq. (argued) of Brobeck, Phleger \u0026 Harrison, San Francisco, California for Appellee Tulare Lake Canal Co. J. Thomas Crowe, Esq. (argued) of Crowe, Mitchell \u0026 Crowe, Visalia, California, for Amicus.",
    "category": [
      "251",
      "252",
      "213"
    ],
    "judges": "Browning, Duniway, and Wallace, Circuit Judges.",
    "citation_count": 12
  }
}
