{
  "id": "6qFRR2YBTlTomsSBJdbp",
  "document": {
    "title": "People v. Smith",
    "full_title": "THE PEOPLE AND v. C. ARNHOLT SMITH AND",
    "jurisdiction": "California Court of Appeal",
    "date": "1984-05-17T00:00:00.000Z",
    "docket": "Crim. No. 11314",
    "body": "C. Arnholt Smith (defendant) appeals his conviction in May 1979, after a 118-day trial\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e of two counts of tax fraud for the year 1971 (counts 1 and 2; Rev. \u0026 Tax. Code, §§ 19405 and 19406, respectively), two counts of tax fraud for the year 1973 (counts 3 and 4; Rev. \u0026 Tax. Code, §§ 19405 and 19406, respectively) and one count of theft in 1973 (count 5; Pen. Code, § 487, subd. 1). This already lengthy opinion will not be protracted by stating the facts twice; the relevant facts are presented below in connection with the arguments involving them.\n\nFirst, the law regarding the defense of discriminatory prosecution is considered with particular attention to the proper standard of proof. Second, we consider what type of theft it may be when the beneficial owner of a corporation obtains payment from the corporation in exchange for assets which are never delivered to the corporation. Finally, we address the state tax crimes.\n\nI\n\nDiscriminatory Prosecution\n\nNo finding of discriminatory prosecution has ever barred a conviction in a California criminal proceeding,\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e although claims of discriminatory prosecution\n\nhave led to grants of discovery motions to support the defense.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The success that has been achieved by raising this defense, other than by obtaining discovery, post- Murgia, has occurred in People v. Serna (1977) 71 Cal. App. 3d 229 [139 Cal. Rptr. 426], and People v. Hertz (1980) 103 Cal. App. 3d 770 [163 Cal. Rptr. 233]. In Serna, the convictions of defendants for a criminal violation of the Education Code for wilfully refusing to send their children to public schools were reversed because the trial court failed to grant requested discovery as to how many other violators there were in the school district (71 Cal. App. 3d at pp. 233-235). In Hertz, a Penal Code section 995 motion was granted, in part, because the magistrate at the preliminary hearing had denied a defendant the opportunity to develop evidence of discriminatory enforcement by cross-examination of police officer witnesses (103 Cal. App. 3d at pp. 775-777). More important to that ruling as to that defendant and the others involved in Hertz appears to be the holding 995 motions were granted properly because the magistrate conducted an extension in camera review of documents to determine whether they were privileged from discovery under Evidence Code section 1040 without creating a reviewable record of the in camera proceedings (103 Cal. App. 3d at pp. 777-780).\n\nIn our case, the trial court, pursuant to Murgia, supra, 15 Cal. 3d 286, as interpreted by Bortin, supra, 64 Cal. App. 3d 873 (then the most recent governing case), heard arguments and evidence on a pretrial motion to dismiss the prosecution on the basis of discriminatory enforcement over the course of 10 days between March 1 and March 16, 1977. Defendant does not contend he was denied an opportunity to conduct sufficient discovery, but he does disagree with the court's finding of no discriminatory prosecution and contends the finding followed from imposition of the wrong burden of proof.\n\nBurden of Proof\n\n\"It is presumed that official duty has been regularly performed.\" (Evid. Code,\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e § 664.) This rebuttable presumption affects the burden of proof\n\n(§ 660). \"The effect of a presumption affecting the burden of proof is to impose upon the party against whom it operates the burden of proof as to the nonexistence of the presumed fact.\" (§ 606.)\n\nThis presumption is employed in assessing the defense of discriminatory prosecution to impose the burden of proof on the defendant. (Murgia, supra, 15 Cal. 3d 286, 305; Hartway, supra, 19 Cal. 3d 338, 348; Sperl, supra, 54 Cal. App. 3d 640, 657; Street, supra, 89 Cal. App. 3d 739, 748; see In re Elizabeth G., supra, 53 Cal. App. 3d 725, 733; Lyons, supra, 75 Cal. App. 3d 829, 844; Battin, supra, 77 Cal. App. 3d 635, 666.) People v. Gray (1967) 254 Cal. App. 2d 256, at page 265 [63 Cal. Rptr. 211], appears to have been the first case to observe the impact of section 664 on establishing the defense of discriminatory prosecution and it has been cited as imposing the burden of proof on the defendant. (Murgia, supra, 15 Cal. 3d at p. 305; Hartway, supra, 19 Cal. 3d at p. 348; Sperl, supra, 54 Cal. App. 3d at p. 657; Lyons, supra, 75 Cal. App. 3d at p. 844; Street, supra, 89 Cal. App. 3d at p. 748.)\n\nInterestingly, none of the cases which followed Gray (254 Cal. App. 2d 256) in evaluating a discriminatory prosecution claim in light of section 664 have elaborated on what is the standard of proof. Perhaps this is because the defense should be raised on a pretrial motion to dismiss (Murgia, supra, 15 Cal. 3d 286, 293-294, fn. 4; Hartway, supra, 19 Cal. 3d 338, 348; Sperl, supra, 54 Cal. App. 3d 640, 656-657; cf. Hertz, supra, 103 Cal. App. 3d 770, 774), and the trial court need not instruct itself on the law to be applied. The burden has been characterized as a \"heavy\" one. (Battin, supra, 77 Cal. App. 3d 635, 668; Milano, supra, 89 Cal. App. 3d 153, 156.) We assume this characterization is employed only because the defense has been a difficult one to establish (see Gray, supra, 254 Cal. App. 2d 256, 265-266).\n\nGray, supra, 254 Cal. App. 2d 256, at pages 265 to 267, established the standard of proof is not the high one of \"clear and convincing,\" but the lesser one of proof \"by a preponderance of the evidence.\" We have no hesitation in reaffirming that analysis for the reasons given there and for other reasons. The Attorney General argues Gray was wrong and the higher standard is applicable in order to effectuate the policy behind section 664. It is true the presumption of official regularity has been \"established to implement some public policy other than to facilitate the determination of the particular action in which the presumption is applied\" (§ 605). Similarly, it is true the policy served is to relieve governmental officials from having to justify their conduct whenever it is called into question. The Attorney General seems to assume that unless a very high standard of proof is imposed, it will be too easy to show the governmental officials are not doing their jobs properly. This contention is without merit, particularly\n\nwhen the policy served by section 664 is weighed against the constitutional concern for equal protection which has given rise to the defense of discriminatory prosecution. (See Gray, supra, 254 Cal. App. 2d 256, 266.)\n\nSection 115 explains: \"'Burden of proof' means the obligation of a party to establish by evidence a requisite degree of belief concerning a fact in the mind of the trier of fact or the court. The burden of proof may require a party to raise a reasonable doubt concerning the existence or nonexistence of a fact or that he establish the existence or nonexistence of a fact by a preponderance of the evidence, by clear and convincing proof, or by proof beyond a reasonable doubt.\n\n\"Except as otherwise provided by law, the burden of proof requires proof by a preponderance of the evidence.\"\n\nThe Attorney General contends section 115 does not apply at all, because section 664 creates a rebuttable presumption affecting the burden of proof. Our understanding, however, is if there is a preponderance of evidence demonstrating the nonexistence of official regularity, the presumption of section 664 is rebutted. The Assembly Committee comment on section 606 explains: \"In the ordinary case, the party against whom it is invoked will have the burden of proving the nonexistence of the presumed fact by a preponderance of the evidence. Certain presumptions affecting the burden of proof may be overcome only by clear and convincing proof.\" The presumption created by section 662 is an example of a presumption which is rebutted only by a clear and convincing showing, while section 664 is not (Gray, supra, 254 Cal. App. 2d 256, 266, fn. 12).\n\nAccepting this standard of proof for the defense of discriminatory prosecution, the next question is whether the trial court imposed the wrong burden. Apparently pursuant to an agreement among the court and the parties, the trial court ruled orally at the conclusion of the many pretrial motions on the understanding that the rulings would be memorialized later. Thus, the court ruled orally on March 16, 1977, denying the motion to dismiss for discriminatory prosecution, while the written ruling followed on May 30, 1978.\n\nThe written ruling states pertinently: \"The burden the defendant bears in making such claim is not made clear by the cases, but the court holds it must be a relatively substantial showing, perhaps a showing by clear and convincing evidence.\" The oral ruling was not as specific in identifying the standard of proof. The court stated: \"Now, I'm not just sure what standard of proof there is on this motion by the defendants to dismiss, but it seems\n\nto me . . . we're talking about a relatively substantial showing or a showing which produces a substantial amount of comfort in the finder of fact.\"\n\nDefendant relies on the recital in the court's minutes of March 16, 1977, that the motion was denied due to the court \"finding no clear and convincing evidence of invidious prosecution.\" There is a conflict between the reporter's and clerk's transcripts which we resolve in favor of the reporter's transcript. (See People v. Smith (1983) 33 Cal. 3d 596, 599 [189 Cal. Rptr. 862, 659 P.2d 1152]; People v. Ritchie (1971) 17 Cal. App. 3d 1098, 1103-1104 [95 Cal. Rptr. 462].) The reporter's transcript shows the trial court did refer to a burden of clear and convincing evidence in the course of the oral ruling, but it was in the context that this was the burden on a plaintiff to show \"several,\" presumably intended to be \"civil,\" fraud. The court suggested the burden on defendant here was analogous, not identical. While the burden imposed by the trial court is not clearly identified, the indications are it was erroneously high.\n\nEffect of Error in Imposing Burden of Proof\n\nNot every trial court error justifies reversal of a conviction. The California Constitution article VI, section 13, states: \"No judgment shall be set aside, or new trial granted, in any cause, on the ground of misdirection of the jury, or of the improper admission or rejection of evidence, or for any error as to any matter of pleading, or for any error as to any matter of procedure, unless, after an examination of the entire cause, including the evidence, the court shall be of the opinion that the error complained of has resulted in a miscarriage of justice.\"\n\nAs recently reiterated in People v. Taylor (1982) 31 Cal. 3d 488, at page 499 [183 Cal. Rptr. 64, 645 P.2d 115]: \"The traditional test of harmless error is whether it is 'reasonably probable that a result more favorable to the appealing party would have been reached in the absence of the error.' (People v. Watson (1956) 46 Cal. 2d 818, 836 . . . .) . . . Some constitutional rights are deemed so basic to a fair trial that their violation requires automatic reversal. [Citations.] However, not all constitutional errors amounting to a violation of due process necessitate reversal per se. [Citations.] Where federal constitutional error is involved, the test to be applied is that laid down by the Supreme Court in Chapman v. California (1967) 386 U.S. 18 . . . . Chapman requires that 'before a federal constitutional error can be held harmless, the court must be able to declare a belief that it was harmless beyond a reasonable doubt.' (Chapman, supra, 386 U.S. at p. 24 . . . .)\"\n\nNo California case has addressed whether imposing the wrong standard of proof on a defendant seeking to establish a discriminatory prosecution\n\nclaim is a federal constitutional error. The error involved here is not like that in Serna, supra, 71 Cal. App. 3d 229. There, the trial court improperly limited discovery intended to support a discriminatory prosecution defense. In that situation, the remedy might be a remand to permit additional discovery. (See People v. Coyer (1983) 142 Cal. App. 3d 839, 843-845 [191 Cal. Rptr. 376].)\n\nNeither party argues that the imposition of the wrong burden of proof is a federal constitutional error. It may be complete nonrecognition of this defense would be a federal constitutional error because it does emanate from the equal protection clause of the federal Constitution (e.g., Murgia, supra, 15 Cal. 3d 286, 290). But to measure the defense by the wrong standard is not the same sort of error. Gray, supra, 254 Cal. App. 2d 256, at page 266, does suggest equal protection concerns are better served by utilizing the burden of proof of a preponderance of the evidence. But the reasoning above shows the burden of proof chosen by Gray derives from section 115, as well as the relative disability of the defendant to gather evidence \"buried in the consciences and files of the law enforcement agencies\" (ibid.). Federal courts have not imposed the same burden of proof on defendants attempting to show discriminatory enforcement prohibited by the federal equal protection clause. For example, in United States v. Falk (7th Cir. 1973) 479 F.2d 616 (one of the federal cases which Murgia, supra, 15 Cal. 3d 286, 300, at fn. 9, recognized as considering this defense), the court stated (at pp. 620-621): \"The presumption is always that a prosecution for violation of a criminal law is undertaken in good faith and in nondiscriminatory fashion for the purpose of fulfilling a duty to bring violators to justice. However, when a defendant alleges intentional purposeful discrimination and presents facts sufficient to raise a reasonable doubt about the prosecutor's purpose, we think a different question is raised.\" The court went on to hold that upon such a showing, the burden of proof shifts to the government to show nondiscriminatory enforcement (at p. 621). The error of imposing the wrong standard of proof on the defendant in a discriminatory prosecution motion must be measured by the harmless error test of People v. Watson (1956) 46 Cal. 2d 818 [299 P.2d 243]. (See People v. Jiminez (1978) 21 Cal. 3d 595, 609 [147 Cal. Rptr. 172, 580 P.2d 672].)\n\nThe Attorney General invites us to review the evidence and determine the trial court's ruling was correct, although it employed the wrong standard of proof. Defendant contends we cannot, for the reasons given in Gray, supra, 254 Cal. App. 2d 256, at pages 267 to 268. Gray does not explain its conclusion in terms of finding prejudicial error, although the court stated it declined to independently review the evidence (ibid.). Defendant argues if the trial court had employed the proper standard of proof, it would have resolved conflicts in the evidence in favor of a finding of\n\ndiscriminatory prosecution. Implicit in this argument is the assumption that if the proper standard of proof were applied, an otherwise close call would have resulted in the finding of discriminatory prosecution.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nIf the evidence may be reasonably characterized as supporting such a finding under the proper standard of proof, it is not our role to resolve conflicts in the evidence or evaluate the credibility of the witnesses. It would be an abdication of our constitutional duty under California Constitution article VI, section 13, to not examine the evidence to determine whether the trial court's ruling was right for the wrong reason. It is certainly possible for an appellate court to determine that the preponderance of the evidence points to a different conclusion than that drawn by the trial court (e.g., People v. Belton (1979) 23 Cal. 3d 516, 523-527 [153 Cal. Rptr. 195, 591 P.2d 485]). We are not disabled from examining the evidence because the trial court may have weighed it improperly. Even the Gray court was able to review the evidence to determine whether as a matter of law discriminatory prosecution was shown (254 Cal. App. 2d 256, 268-270).\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nElements of Defense of Discriminatory Prosecution\n\nMurgia, supra, 15 Cal. 3d 286, stated the elements of the defense of discriminatory prosecution in several ways (at pp. 290, 298). Hartway, supra, 19 Cal. 3d 338, at page 348 helpfully paraphrased Murgia : \"To establish the defense, the defendant must prove: (1) 'that he has been deliberately singled out for prosecution on the basis of some invidious criterion;' and (2) that 'the prosecution would not have been pursued except for the discriminatory design of the prosecuting authorities.'\" In other words, a criminal prosecution which results from the prosecutor's intent to punish a defendant for belonging to a class or exercising rights protected by the equal protection clause cannot be sustained.\n\nCausality\n\nAs one element of the defense, the defendant must show \"except for\" the discrimination there would be no prosecution (Murgia, supra, 15 Cal. 3d 286, 290, 298). This element appears to be unique to California\n\namong those states recognizing this defense (Annot., 95 A.L.R.3d 280, 287). Despite the linguistic similarity, we do not think the causal connection intended by Murgia is the \"but for\" test discussed in negligence law.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e (E.g., Johnson v. Union Furniture Co. (1939) 31 Cal. App. 2d 234, 237-238 [87 P.2d 917]; Godwin v. LaTurco (1969) 272 Cal. App. 2d 475, 479 [77 Cal. Rptr. 305].) That is, there must be somewhat more of a connection to establish the defense than that a prosecutor is improperly biased. The bias must be operating in the instant prosecution as an important factor in order to support a finding of causality. On the other hand, the defendant need not establish that the only reason for the prosecution is an improper one. Typically, there will also be evidence of the defendant's wrongdoing, which the prosecution will argue is its basis for pursuing the proceedings (cf. Hartway, supra, 19 Cal. 3d 338, 351). In short, the prosecutorial bias must be an important cause of the proceedings, but not the only one, in order to make out the required causal connection (Murgia, supra, 15 Cal. 3d at p. 298, fn. 6).\n\nImproper Selectivity\n\nMurgia, supra, 15 Cal. 3d 286, appears to make the \"singling out\" of a defendant an element of the defense of discriminatory prosecution. It is not every exercise of prosecutorial selectivity which violates the equal protection clauses, however, but only that selectivity founded on an invidious basis (pp. 296-297, 299-300). Thus, the fact not every violator of the same law is prosecuted by itself only suggests, but does not establish, improper selectivity. (Hartway, supra, 19 Cal. 3d 338, 349-351; Serrata, supra, 62 Cal. App. 3d 9, 24-25; Garner, supra, 72 Cal. App. 3d 214, 217-218; Lyons, supra, 75 Cal. App. 3d 829, 844-845; Battin, supra, 77 Cal. App. 3d 635, 667; Ala Carte Catering Co., supra, 98 Cal. App. 3d Supp. 1, 10.) Serrata, supra, 62 Cal. App. 3d 9, at pages 24 to 25, and Milano, supra, 89 Cal. App. 3d 153, at page 163, dramatically illustrate the defense is not established by a showing the penal statute has not been enforced against anyone else. This result is obviously correct, or the first violator of a law could always claim discriminatory enforcement.\n\nOn the other hand, if the basis of prosecutorial selection is improper, it should not matter in establishing discriminatory prosecution that other violators of the same law are also prosecuted. This implication may be drawn from Murgia, supra, 15 Cal. 3d 286, 291, at footnote 2, where the defendants were charged with a variety of minor offenses, some as common as reckless driving and malicious mischief. While at one point the court stated\n\n(p. 290), \"the issue here is whether the prosecution is constitutionally free to select only these defendants and prosecute them only because they are members of a certain class,\" there does not appear to have been an argument in that case that no other reckless drivers were being prosecuted. The defense may be established so long as it can be said an important factor in the selection of the defendant for prosecution is the invidious one, regardless of whether other violators from other classes are also prosecuted. Therefore, the fact of statistical uniqueness of a prosecution alone will rarely establish discriminatory prosecution, though it may suggest it. (See Griffin, supra, 20 Cal. 3d 300, 307-308.)\n\nInvidious Basis\n\nAt the heart of the defense of discriminatory prosecution is a showing that the main reason, or at least an important reason, for the prosecution is an \"invidious\" one. Murgia, supra, 15 Cal. 3d 286, offered a variety of definitions and synonyms and illustrations to clarify this term. \"Unjustifiable\" was one synonym (p. 300). \"Arbitrary\" appears to be another one (p. 302). One definition is it bears \"no rational relationship to legitimate law enforcement interests\" (p. 302). Illustrations of an unjustifiably arbitrary standard for prosecution given in Murgia were race (pp. 290, 294-296) and religion (pp. 290, 300, fn. 8). Murgia also held the exercise of a worker's right to associate with others in a union was an invidious basis to select him for prosecution (pp. 290, 302).\n\nMurgia did not attempt to circumscribe (p. 302) \"the entire range of classifications that may be 'arbitrary' in this context.\" Sex is another invidious basis (Hartway, supra, 19 Cal. 3d 338, 348). Garner, supra, 72 Cal. App. 3d 214, at page 217, elaborated somewhat on Murgia in recognizing that federal cases have held the exercise of free speech and other First Amendment rights is also an invidious basis for a criminal prosecution. Perakis, supra, 99 Cal. App. 3d 730, at page 734, suggests in dictum that perhaps even the class of neighborhood bars might be protected. Halford v. Alexis (1981) 126 Cal. App. 3d 1022, at pages 1030 to 1032 [179 Cal. Rptr. 486], contains a detailed examination of when legislation has been characterized as invidious or a violation of equal protection.\n\nIt is not appropriate to recite here the entire range of classifications which have been found to be protected from unequal enforcement of the laws. (See Annots., 95 A.L.R.3d 280, § 8, pp. 302-308; 45 A.L.R. Fed. 732, § 7, pp. 746-750.) A criminal prosecution should not, of course, be initiated because the defendant belongs to a particular political party or is active in that party.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e This is implicit in Murgia, supra, (15 Cal. 3d 286, 302), Bortin,\n\nsupra, (64 Cal. App. 3d 873, 875-876), Battin, supra, (77 Cal. App. 3d 635, 667-668) and Hertz, supra, (103 Cal. App. 3d 770, 776). A defendant's social prominence, however, should not insulate him from prosecutorial interest (United States v. Ojala (8th Cir. 1976) 544 F.2d 940, 944-945). Indeed, prosecutions which involve prominent individuals arguably have the biggest deterrent impact on others who contemplate similar violations of the law.\n\nIt must be remembered the purpose of recognizing this defense of discriminatory prosecution is to ensure that penal laws fair on their faces are not transformed by their enforcers into unconstitutionally discriminatory laws (Murgia, supra, 15 Cal. 3d 286, 294-297). An approach to evaluating a defense is to rewrite the law as it is applied and to ask if it now denies equal protection to its subjects. Courts have been able to recognize statutes which violate equal protection principles, and when enforcement of a penal statute rewrites its terms, a court will not hesitate to determine whether the enforcement has an invidious basis.\n\nImproper Intent\n\nMurgia also requires there be a \"deliberate\" character to the discrimination before the defense is established (15 Cal. 3d 286, 290, 297-298, 300). Synonyms are \"purposeful\" or \"intentional\" (id., at p. 300). The opinion repeatedly indicates it is the deliberate singling out on an invidious basis which is impermissible. If it is helpful, this emphasis appears to be made in Murgia in order to ensure the defense of discriminatory enforcement succeeds only when the prosecutor has the proscribed \"specific,\" rather than \"general,\" intent. (See, e.g., People v. Daniels (1975) 14 Cal. 3d 857, 860-862 [122 Cal. Rptr. 872, 537 P.2d 1232].) It would not be enough to show, for example, that more women than men were being arrested for prostitution (see Hartway, supra, 19 Cal. 3d 338; In re Elizabeth G., supra, 53 Cal. App. 3d 725; Street, supra, 89 Cal. App. 3d 739). When the consequences of law enforcement produce a pattern of unequal treatment of similarly situated classes, the defense of discriminatory enforcement is not established. The requisite intent is that the prosecutor desired those consequences. The defense is established only when it appears an important factor in the prosecutor's selection of the defendant is the prosecutor wants to punish the defendant for membership in a protected class or exercise of protected rights.\n\nEvidence of Discriminatory Prosecution\n\nIn light of the above discussion of the elements of the defense of discriminatory prosecution, it is difficult to review the evidence produced\n\nat the motion to dismiss based on this defense and imagine how the trial court could have come to a different conclusion, even applying the proper standard of proof. Defendant was able to establish the district attorney took a personal interest in his prosecution, perhaps even an unusual amount of interest for the unusual case that it was. The district attorney initiated the investigation of defendant by personally calling the Franchise Tax Board on the day he learned through a newspaper article that the federal Justice Department had declined to pursue an Internal Revenue Service (IRS) recommendation that defendant be criminally prosecuted for tax fraud. The IRS investigation of defendant had been initiated some three years earlier and had continued, resulting in a jeopardy assessment against defendant as well as the recommendation for criminal prosecution.\n\nAbout two weeks after the phone call, there was a meeting among high officials of the Franchise Tax Board and the district attorney's office in which he personally participated. The district attorney promised to prosecute if violations were uncovered and promised staff support for the investigation. Almost a year later, defendant received a sentence in a federal court matter which the district attorney felt was \"manifestly unjust,\" and which reaffirmed his interest in prosecuting defendant. He personally appeared before the indicting grand jury as a witness. Other evidence need not be recited which indicates the district attorney was personally interested in having defendant prosecuted.\n\nThe fatal flaw in defendant's presentation is there is virtually no evidence the district attorney's interest had an invidious basis. He argues he was a prosecutorial target based on his membership in the Republican Party, while the district attorney was a Democrat. The only evidence supporting this contention is that some four years before making the phone call to the Franchise Tax Board, one of the major issues in his successful campaign to become district attorney was he would break defendant's stranglehold on San Diego politics. Defendant was a financial backer of his opponent in that campaign, although he also contributed to the district attorney. Defendant apparently was a prominent Republican fund-raiser. Juxtaposed to this is evidence an investigator for the district attorney recommended investigation of defendant in the same year the district attorney took office, which the district attorney declined. There is no other evidence showing the district attorney had a dislike for defendant because he was a Republican. There is no evidence, for example, the district attorney prosecuted a disproportionate number of Republicans compared to members of other political parties (cf. Battin, supra, 77 Cal. App. 3d 635, 667). In fact, there was evidence the district attorney attended a luncheon with defendant and two other persons after taking office, defendant attended a fund-raiser for the district attorney,\n\nand defendant consulted him for some legal advice. It is hard to detect in this conduct antipathy for Republicans in general or defendant in particular.\n\nDefendant argues alternatively it is enough to sustain this defense that the prosecution is founded on the prosecutor's bad feelings for the defendant. Indeed, Battin, supra, 77 Cal. App. 3d 635, at page 668, appears to indicate the equal protection clause is a shield from prosecutorial bad faith or vindictiveness. (See also United States v. Bourque (1st Cir. 1976) 541 F.2d 290, 293.)\n\nThere are two responses to this contention. One is that it is the due process clause which protects a criminal defendant against a prosecutor's improper personal involvement in a prosecution (People v. Superior Court (Greer) (1977) 19 Cal. 3d 255, 266-268 [137 Cal. Rptr. 476, 561 P.2d 1164]; Twiggs v. Superior Court (1983) 34 Cal. 3d 360, 374, fn. 6 [194 Cal. Rptr. 152, 667 P.2d 1165]). The other is that we cannot conclude it is reasonably probable the trial court would have found this was the basis for the prosecution if it had applied the proper standard of proof. Preceding the district attorney's instigation of the investigation of defendant was an IRS investigation for tax fraud which recommended his criminal prosecution, a jeopardy assessment, the collapse of his bank, United States National Bank of San Diego, a federal investigation of the bank failure and all the attendant publicity. If the district attorney had never been aware of defendant prior to these occurrences, certainly his curiosity would have been aroused by them. Moreover, it appears the newspaper article which prompted his call implied the federal prosecution for tax fraud had been declined for reasons other than the merits of the case. Whether this was accurate or not, we cannot say it is reasonably probable the trial court would have concluded the prosecution had an invidious basis if it had applied the proper standard of proof to defendant's evidence of discriminatory prosecution. The error was harmless.\n\nII\n\nTheft\n\nDefendant's theft conviction under Penal Code section 487, subdivision 1, is based on a July 17, 1973, transaction whereby he received a check from Sovereign State Capital (Sovereign) for $8,930,867 in exchange for unfulfilled promises. The promises were that Sovereign would receive San Diego Padres' surplus certificates worth $4.12 million, a promissory note worth $4.75 million and interest on the note in the amount of $60,867. Sovereign never received any benefit by payment or otherwise on these obligations. Instead, in February 1974, the San Diego Padres were sold for\n\napproximately $12 million, with the proceeds going to various creditors of defendant and his other corporations, but not to Sovereign. As stated in defendant's opening brief: \"While Mr. Smith was not formally complete owner of the Padres, it is probably more accurate to view him as such. One of his corporations advanced to Emil (Buzzy) Bavasi and Mr. Smith's daughter, Carol Smith Shannon, the funds which represented their ownership interest. These advances were not repaid; Mr. Smith was responsible for all additional financing; Mrs. Shannon and Mr. Bavasi appear to have regarded Mr. Smith as the real owner of the Padres. \" Sovereign was also created, capitalized and controlled by defendant, although at the time of this transaction it appears his daughter-in-law, Myra Jean Smith, was nominally the principal shareholder, a member of the board of directors and an officer of the corporation.\n\nEmbezzlement\n\nIn closing argument, the prosecution characterized this transaction as embezzlement. (See fn. 9.) Defendant makes three arguments why it cannot be embezzlement.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\n1) A person cannot embezzle from himself.\n\nDefendant contends he could not have embezzled from himself and Sovereign was just another facet of himself, his alter ego. The argument is Sovereign's separateness was a legal fiction, on which a criminal prosecution cannot be based. \"[A] person can no more be guilty of embezzlement from a corporation which is his alter ego than he can embezzle from himself without the separate persona of a corporation.\"\n\nThe Penal Code provides, in relevant part: \"Embezzlement is the fraudulent appropriation of property by a person to whom it has been intrusted.\" (§ 503.)\n\n\"Every . . . trustee . . . or agent of any . . . corporation (public or private), who fraudulently appropriates to any use or purpose not in the due and lawful execution of his trust, any property which he has in his possession or under his control by virtue of his trust, or secretes it with a fraudulent intent to appropriate it to such use or purpose, is guilty of embezzlement.\" (§ 504.)\n\n\"Every trustee, . . . agent . . . or person otherwise intrusted with or having in his control property for the use of any other person, who fraudulently appropriates it to any use or purpose not in the due and lawful execution of his trust, or secretes it with a fraudulent intent to appropriate it to such use or purpose . . . is guilty of embezzlement . . . .\" (§ 506.)\n\nDefendant does not contend that in every case where the beneficial owner of a corporation employs its funds or property for his own purposes, there can be no embezzlement. People v. Schmidt (1956) 147 Cal. App. 2d 222, states at page 229 [305 P.2d 215]: \"'. . . Any diversion of funds held in trust constitutes embezzlement whether there is direct personal benefit or not as long as the owner is deprived of his money . . . .' In respect to the showing of theft from the corporation, it is sufficient that the appellant took the money of the corporation for personal use without authorization.\" There, the court upheld a theft conviction on a theory of embezzlement against the principal, if not sole, stockholder and president of a corporation, where corporate funds were expended for his residence, yacht, and a race horse, among other things.\n\nIn People v. Applegate (1949) 91 Cal. App. 2d 163, pages 165 to 173 [204 P.2d 689], the defendant was convicted of grand theft by embezzlement from a corporation which he created and for which he furnished some equipment. He was never a corporate officer, although he was to receive one-third of the stock which was never issued. He received money to be paid to the new corporation and deposited it in an account of another corporation which he wholly owned and used the money for other purposes, without ever fully paying it over to the new corporation.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nDefendant's argument seems to be there is an alter ego defense to an embezzlement charge when the defendant is involved in transactions with\n\nhis wholly or beneficially owned corporation. Defendant relies on Applegate, supra, 91 Cal. App. 2d 163, page 174, where the court held since the evidence did not show the corporate entity should be disregarded, it was not erroneous to refuse to instruct that the defendant could not be guilty of embezzling from his alter ego.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Implicit in this is that on different facts it might be an error to fail to instruct the jury a defendant cannot embezzle from his alter ego corporation. An alter ego claim was rejected in Schmidt, supra, 147 Cal. App. 2d 222, the court stating (at p. 229): \"In respect to the claim that the Corporation was defendant's alter ego, the jury had ample evidence from which they could, and did determine that there was a distinct, formal corporate existence. However, even where the circumstances indicate that all of the capital stock of a corporation is owned or controlled by one person, this does not necessarily destroy its separate existence.\"\n\nA similar argument was more resoundingly rejected in Harris, supra, 147 Conn. 589 [164 A.2d 399] (which provoked the Annotation Criminal Responsibility for Embezzlement from Corporation by Stockholder Owning Entire Beneficial Interest, 83 A.L.R.2d 791). There, a defendant convicted of embezzlement claimed error by the court's refusal to give a jury instruction to the effect that a person cannot embezzle funds from a corporation which he wholly owns. The court held there was no error, explaining (164 A.2d 399, 402): \"The defendant chose to, and did, organize the two corporations, and he conducted his affairs through them, thereby enjoying the benefits and protection of corporate operation of his business. He cannot\n\nnow, when it suits his purpose, brush aside the corporate entity and claim that the corporate funds are his own funds to do with as he pleases.\"\n\nIn a different context, Aladdin Oil Corp. v. Perluss (1964) 230 Cal. App. 2d 603 [41 Cal. Rptr. 239], made a pertinent observation (at p. 614): \"Parties who determine to avail themselves of the right to do business by means of the establishment of a corporate entity must assume the burdens thereof as well as the privileges. The alter ego doctrine is applied to avoid inequitable results not to eliminate the consequences of corporate operations.\"\n\nIt would be a perversion of the equitable origin of the doctrine of alter ego to employ it as a defense to embezzlement, as a means of promoting fraud. As observed in People v. Jones (1950) 36 Cal. 2d 373, at page 382 [224 P.2d 353], in a different context: \"Defendant, having perpetrated a fraud through the device of a partnership, cannot escape criminal liability by reason of that same device . . . .\"\n\nAs a separate basis for rejecting this defense, it is established that a person who acts as an agent of a corporation is estopped to deny its separate corporate status (Wynn v. Treasure Co. (1956) 146 Cal. App. 2d 69, 76 [303 P.2d 1067]; see People v. Leonard (1895) 106 Cal. 302, 310 [39 P. 617]).\n\nIt is worth noting the requested instruction in Applegate, supra, 91 Cal. App. 2d 163, at page 174, was based on the doctrine a partner could not embezzle partnership money. That doctrine has subsequently been repudiated in California (People v. Sobiek (1973) 30 Cal. App. 3d 458, 463-469 [106 Cal. Rptr. 519, 82 A.L.R.3d 804], cert. den. 414 U.S. 855 [38 L.Ed.2d 104, 94 S.Ct. 155]; People v. Pedersen (1978) 86 Cal. App. 3d 987, 992-993 [150 Cal. Rptr. 577]; see Annot., Embezzlement, Larceny, False Pretenses, or Allied Criminal Fraud by a Partner, 82 A.L.R.3d 822). While the beneficial ownership of a corporation may well be relevant in an embezzlement prosecution to a defense of good faith (see Harris, supra, 164 A.2d 399, 401), it does not give the owner a license to steal from the separate entity which he created.\n\n2) Embezzlement cannot be found in this sale transaction.\n\nIn general, because a breach of trust is essential to finding embezzlement, when money or property is received under a contract of sale without restrictions as to its use, title passes to the recipient and there can be no embezzlement in such a transaction (People v. Goodrich (1903) 138 Cal. 472, 474-475 [71 P. 509]; People v. Holder (1921) 53 Cal. App. 45, 48-51 [199 P. 832]; People v. Bullock (1928) 92 Cal. App. 785, 789 [268 P.\n\n1059]; People v. Petrin (1954) 122 Cal. App. 2d 578, 584 [265 P.2d 149]; People v. Gould (1954) 125 Cal. App. 2d 447, 449 [270 P.2d 551]).\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e The prosecution does not contend a trust arose on our facts by virtue of a sale agreement. The prosecution's theory is there was no sale and the trust arose by virtue of the preexisting relationship between defendant and Sovereign. The jury apparently agreed the sale was a sham. The key question thus is whether in criminal law the equitable owner of a corporation is always regarded as an agent in a trust relationship with the corporation, regardless of the form of the transaction between them.\n\nThe type of relationship essential to finding embezzlement has been variously characterized. The property or money must be received by the defendant as an agent or bailee of the true owner (People v. Borchers (1926) 199 Cal. 52, 56 [247 P. 1084]). There must be a fiduciary relationship between the parties (People v. Gordon (1901) 133 Cal. 328, 329 [65 P. 746]). The statute names several common trust relationships, but the list is not exclusive. (See Sobiek, supra, 30 Cal. App. 3d 458, 464.) However, as illustrated by the sale cases above, as well as People v. Darling (1964) 230 Cal. App. 2d 615, at page 621 [41 Cal. Rptr. 219], the mere receipt of property or money from another does not give rise to a trust relationship. My concern is where in this sham sale a trust arose.\n\nIn civil law it is established that a controlling stockholder is a fiduciary in relation to his corporation (Remillard Brick Co. v. Remillard-Dandini (1952) 109 Cal. App. 2d 405, 420 [241 P.2d 66]; Jones v. H. F. Ahmanson \u0026 Co. (1969) 1 Cal. 3d 93, 108-112 [81 Cal. Rptr. 592, 460 P.2d 464]). The burden in civil law is on the controlling stockholder to show his dealings with his corporation are made in good faith and are fair (Jones v. H. F. Ahmanson \u0026 Co., supra, 1 Cal. 3d at pp. 108-112).\n\nThere are several problems with carrying this civil law notion over into a criminal context. Most importantly, Penal Code section 6 means \"there are no common law crimes in California.\" (Keeler v. Superior Court (1970) 2 Cal. 3d 619, 631 [87 Cal. Rptr. 481, 470 P.2d 617, 40 A.L.R.3d 420].) \"'Constructive crimes -- crimes built up by courts with the aid of inference, implication, and strained interpretation -- are repugnant to the\n\nspirit and letter of English and American criminal law.'\" (Id., at p. 632.) This court will not strain to impose criminal liability upon a breach of trust described by the Attorney General as \"an implied fiduciary duty . . . to act in the best interests of the company\" (referring to Sovereign).\n\nThe closest parallels in interpretation of the embezzlement statutes are Schmidt, supra, 147 Cal. App. 2d 222, and Applegate, supra, 91 Cal. App. 2d 163. In Schmidt, at pages 229 to 230, the only count clearly discussed in terms of embezzlement involved the defendant's personal use of funds deposited in the corporation's account subject to a written trust agreement between the corporation and the lender. The court noted (p. 229): \"The agreement between Southwest and the defendant contained a trust clause specifying that the funds received in trust were to pay contractors, materialmen and laborers.\" In Applegate, supra, at pages 166 to 167 and 172, the embezzlement was the defendant's personal use of funds given to him to be paid over to a new association when it incorporated. While the trust agreement appears to have been oral, there was evidence at least some of the money was deposited in a trustee account. Neither of these cases supports the proposition that the controlling stockholder or beneficial owner of a corporation is regarded in criminal law as a fiduciary in all dealings with his corporation.\n\nThe Attorney General invites consideration of Leonard, supra, 106 Cal. 302, and Talbot, supra, 220 Cal. 3. In both, corporate officers took corporate funds and made personal use of them. Talbot states the rule (at p. 14): \"'\"An officer or agent of a corporation cannot take money of the corporation which is entrusted to him, or which comes into his possession by virtue of his office or agency, and use it even temporarily for his personal benefit and avoid criminal responsibility by calling it a loan. The law calls such a transaction a wrongful conversion, from which a fraudulent intent can be inferred.\"' [Citations.]\"\n\nIn both cases, the trust relation arose by virtue of the offices held by the defendant, although in Leonard, supra, 106 Cal. 302, at pages 310 to 312, the defendant was arguably only a de facto officer of a de facto corporation. The court there held Penal Code section 504 applies as well to de facto officers (p. 312). In neither case was an express trust agreement shown, but the trust arose by virtue of the official agency relationship between the defendants and their corporations. It requires no strained reading of the embezzlement statutes (particularly Pen. Code, § 504) to find embezzlement on the facts of either Leonard or Talbot. Similarly, in our case, if defendant had simply caused Sovereign to issue him a check for $8.9 million as its officer or agent and then used the funds for his personal benefit, then such transaction could be an embezzlement.\n\nThe problem in our case is the relationship between defendant and his corporation is not one recognized in the Penal Code sections on embezzlement as inherently a trust relationship. We are invited to designate him as a de facto agent (cf. Leonard, supra, 106 Cal. 302, 312) or perhaps as a person entrusted with the corporation's property (cf. Sobiek, supra, 30 Cal. App. 3d 458, 464) by virtue of the fact he was the equitable owner of the corporation. The embezzlement statutes cannot be read so broadly, because such a construction, along the lines of the civil law, would subject any bad deal between a corporation and its beneficial owner to a charge of embezzlement. (See fn. 13.) A trust relationship might be in evidence if the corporation had entrusted defendant with its money, but a sale does not give rise to a trust.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e There is evidence Sovereign expressly entrusted defendant with the $8.9 million. There is no evidence of an implicit agreement that defendant was to be holding the money for Sovereign's benefit. We require some evidence of \"intrusting\" before we can say a trust was breached.\n\nOther Theories of Theft\n\nLanguage in many cases indicates a theft conviction will be sustained when challenged for insufficiency of the evidence so long as any one of the several types of theft is shown.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e (E.g., People v. Ashley (1954) 42 Cal. 2d 246, 258 [267 P.2d 271] [cert. den. 348 U.S. 900 (99 L.Ed. 707, 75 S.Ct. 222)]; People v. Corenevsky (1954) 124 Cal. App. 2d 19, 24 [267 P.2d 1048]; People v. Kagan (1968) 264 Cal. App. 2d 648, 658 [70 Cal. Rptr. 732], cert. den. 394 U.S. 911 [22 L.Ed.2d 224, 89 S.Ct. 1027].) Presumably this rule is limited to a consideration of the theft theories which were presented to the jury (see People v. Lafka (1959) 174 Cal. App. 2d 312, 316 [344 P.2d 619]). It would deprive the defendant of his right to a jury trial if an appellate court could find a theft on a theory not presented to the jury (see People v. Abbott (1933) 132 Cal. App. 109, 114 [22 P.2d 566]).\n\nFalse Pretenses\n\nThe jury was also instructed as to the theory of theft by false pretenses. The Penal Code provides, in relevant part: \"Every person who knowingly and designedly, by any false or fraudulent representation or pretense, defrauds any other person of money . . . is punishable in the same manner and to the same extent as for larceny of the money . . . so obtained.\" (§ 532.)\n\n\"Upon a trial for having, with an intent to cheat or defraud another designedly, by any false pretense, obtained the signature of any person to a written instrument, or having obtained from any person any . . . money . . . or valuable thing, the defendant cannot be convicted if the false pretense was expressed in language unaccompanied by a false token or writing, unless the pretense, or some note or memorandum thereof is in writing, subscribed by or in the handwriting of the defendant, or unless the pretense is proven by the testimony of two witnesses, or that of one witness and corroborating circumstances . . . .\" (§ 1110.)\n\nPeople v. Tomlinson (1894) 102 Cal. 19 [36 P. 506], explains at page 23 (italics in original): \"On the facts there must often be a very narrow margin between cases of larceny, obtaining money by false pretenses, and embezzlement, because the character of the crime depends upon the secret intention of the parties, which is often difficult to ascertain; but, so far as the law is concerned, the principles . . . are plain and . . . well settled . . . . Where one honestly receives the possession of goods upon a trust, and after receiving them fraudulently converts them to his own use, it is a case of embezzlement. If the possession has been obtained by fraud, trick, or device, and the owner of it intends to part with his title when he gives up possession, the offense, if any, is obtaining money by false pretenses.\n\n\"To support a conviction of theft for obtaining property by false pretenses, it must be shown: (1) that the defendant made a false pretense or representation, (2) that the representation was made with intent to defraud the owner of his property, and (3) that the owner was in fact defrauded in that he parted with his property in reliance upon the representation.\" (Perry v. Superior Court (1962) 57 Cal. 2d 276, 282-283 [19 Cal. Rptr. 1, 368 P.2d 529].)\n\nCorroboration of the false pretense in the form prescribed by Penal Code section 1110 is essential to support a conviction of theft by false pretenses (People v. Edwards (1933) 133 Cal. App. 335, 340 [24 P.2d 183]; People v. Mason (1973) 34 Cal. App. 3d 281, 288 [109 Cal. Rptr. 867]). The false pretense need not be an express oral statement, but may be\n\nimplied from statements in conjunction with conduct intended to deceive (People v. Mace (1925) 71 Cal. App. 10, 21 [234 P. 841]; People v. Randono (1973) 32 Cal. App. 3d 164, 174 [108 Cal. Rptr. 326]). \"'. . . The rule is, moreover, that it is not necessary that the false representations be made to the person defrauded in order to convict one of obtaining money or property by false pretenses. A false representation to an agent or clerk has been held a false pretense to the principal.'\" (People v. Pugh (1955) 137 Cal. App. 2d 226, 234 [289 P.2d 826], app. dism. 352 U.S. 885 [1 L.Ed.2d 83, 77 S.Ct. 141].) Indeed, since a corporation acts only through agents, a theft by false pretenses from a corporation could only be committed as described by the rule just quoted (e.g., People v. Coggan (1957) 155 Cal. App. 2d 42, 44 [317 P.2d 67]). The false pretense may be made through an agent who is clearly authorized by the principal to make it (People v. Green (1913) 22 Cal. App. 45, 50 [133 P. 334], criticized on other grounds in Ashley, supra, 42 Cal. 2d 246, 262; People v. Moore (1927) 82 Cal. App. 739, 747-748 [256 P. 266]; People v. Robinson (1930) 107 Cal. App. 211, 227-228 [290 P. 470]).\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nHere, there is a false written token. (See People v. Fleshman (1915) 26 Cal. App. 788, 791-792 [148 P. 805]; People v. Pearson (1924) 69 Cal. App. 524, 531 [231 P. 612]; People v. Beilfuss (1943) 59 Cal. App. 2d 83, 96 [138 P.2d 332]; People v. Allen (1962) 203 Cal. App. 2d 659, 662 [21 Cal. Rptr. 789].) There was a written memorandum dated July 9, 1973, from defendant to Mr. Toft who undeniably was his agent and righthand man, which set in motion the July 17, 1973, transaction. Defendant accepted Toft's suggestion that Sovereign pick up the Padres' obligations from himself and instructed that with the proceeds he would pay interest owed Sovereign, and further instructed: \"We can then write to the Padre organization and tell them I have sold these notes to Sovereign State Capital and endorse them over so they can change their records accordingly.\"\n\nThe memo was presented by Toft to Schroeder, who was an officer and director of Sovereign, as well as comptroller or accountant for many of defendant's other corporations. Based on the memorandum and other instructions from Toft, Schroeder worked out the form of the transaction and caused Sovereign's check to issue to defendant through a voucher request. Based on instructions from Schroeder, Mrs. Kurz, an officer and director of Sovereign, as well as a bookkeeper for defendant, recorded the transaction as a sale to Sovereign by defendant of the Padres' obligations on various ledgers for Sovereign. Arguably, the records of Sovereign are also false tokens, but this need not be determined. There was also corroborating testimony\n\nfrom Schroeder, who made notes on a conversation with Toft which clarified defendant's intent to sell the surplus certificates to Sovereign. Through the memorandum and through Toft's statements, defendant represented to officers of Sovereign that he would deliver to it the proceeds of the surplus certificates and a promissory note. Corroboration of the false pretense required by Penal Code section 1110 can be found in the memorandum, in Toft's statements as an agent of defendant to Schroeder, in Schroeder's instructions as an agent of defendant to Mrs. Kurz, and in the records of Sovereign recording the transaction.\n\nThe fraudulent intent of the defendant has been described as the essence of the offense of obtaining money or property by false pretenses (Ashley, supra, 42 Cal. 2d 246, 265). \"It is well established that criminal intent may be inferred from the general circumstances surrounding the transactions, and that other similar transactions carried on by a defendant are sufficient to prove guilty knowledge and criminal intent.\" (People v. Ingles (1931) 117 Cal. App. 22, 27 [3 P.2d 341]; accord, Robinson, supra 107 Cal. App. 211, 224; People v. Weitz (1954) 42 Cal. 2d 338, 347 [267 Cal. Rptr. 295], cert. den. 347 U.S. 993 [98 L.Ed. 1126, 74 S.Ct. 859].)\n\nSome evidence of defendant's fraudulent intent here is that in fact the promises were never performed, i.e., Sovereign never received the proceeds of the sale of the Padres. By itself this is not sufficient evidence to sustain a finding of fraudulent intent, but it is some evidence of it\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e (Ashley, supra, 42 Cal. 2d 246, 264; People v. Otterman (1957) 154 Cal. App. 2d 193, 204 [316 P.2d 85]). There was also evidence of a similar transaction in June 1971, which underlies the tax fraud convictions for that year. As more fully discussed in connection with those counts, defendant sold Sovereign some shares of his bank stock in United States National Bank of San Diego for $5,313,264. He used some of this payment, as in the July 1973, transaction, to pay off some of his obligations to Sovereign. He never delivered ownership of the stock to Sovereign, and indeed never owned some of the shares sold. This evidence is sufficient to support a finding of defendant's fraudulent intent.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nThe third element of the crime is the false pretense caused the owner to part with title to the property or money (People v. Bryant (1898)\n\n119 Cal. 595, 598-599 [51 P. 960]; People v. Haskins (1920) 49 Cal. App. 640, 643-644 [194 P. 43]; People v. Whiteside (1922) 58 Cal. App. 33, 40 [208 P. 132]). If the owner did not rely on the false pretense in parting with his property, then a conviction cannot be sustained (e.g., People v. Daniels (1923) 64 Cal. App. 514, 517-518 [222 P. 387]; People v. Frankfort (1952) 114 Cal. App. 2d 680, 699 [251 P.2d 401]). The false pretense need not be the sole cause of the owner's parting with his property (Whiteside, supra, 58 Cal. App. at p. 40), but it must have materially influenced him to do so (Ashley, supra, 42 Cal. 2d 246, 259).\n\nThe express testimony of the owner is not essential to prove he relied on the false pretense, but his reliance may be inferred (People v. Hong Quin Moon (1891) 92 Cal. 41, 42 [27 P. 1096]; Schmidt, supra, 147 Cal. App. 2d 222, 228). When it is a corporation which is the victim of false pretenses, the reliance may be found in the conduct of an officer who parts with corporate property or money under his control (e.g., People v. Cordish (1930) 110 Cal. App. 486, 495 [294 P. 456]; Coggan, supra, 155 Cal. App. 2d 42, 44).\n\nThe prosecutor may not have determined here whether Schroeder relied on the promise of receiving the Padres' obligations when he requested the check for $8.9 million issue to defendant. Defendant has repeatedly argued that no victim has claimed to be defrauded. Indeed, given the undisputed evidence of defendant's control over Sovereign, it would be remarkable if an agent of Sovereign had done so. But for the same reasons given above in rejecting the alter ego defense to embezzlement, Sovereign must be treated as a separate entity capable of relying on defendant's false pretense. A person cannot create a corporation and treat it as a separate entity when it suits his purposes, and then deny it could have relied on a promise made by him. If that person is making promises to himself alone, then there could be a problem in showing corporate reliance. But when other officers of the corporation are induced to part with its money or property, even by the beneficial owner of the corporation, then their reliance may suffice to support a conviction of theft by false pretenses. It may be inferred here the responsible officers of Sovereign were materially influenced to issue the check to defendant because he promised to deliver the Padres' obligations to Sovereign.\n\nConclusion\n\nIt does appear there was sufficient evidence to support a conviction of theft by false pretenses in July 1973, although that transaction could not be an embezzlement. It has been held a superfluous instruction on embezzlement is not a prejudicial error when a case of false pretenses is made out\n\n(People v. Gordon (1945) 71 Cal. App. 2d 606, 635 [163 P.2d 110]; People v. Shalhoob (1957) 147 Cal. App. 2d 455, 459 [305 P.2d 264]). Unfortunately, our case is different. In Gordon, the court observed (at p. 635): \"The indictment alleged only false pretense, and all of the evidence offered established that the offense came within the category of that crime.\" In Shalhoob, the court noted (at p. 459): \"We find upon examination of the reporter's transcript that the People made no attempt to prove the offense of embezzlement.\"\n\nAt the close of the prosecution's case, defendant moved for a directed judgment of acquittal under Penal Code section 1118.1. The prosecutor in response to this motion stated his theory as to the July 1973, transaction was \"primarily embezzlement; but also, I think we have the argument of obtaining by false pretenses.\" The court then questioned where the evidence to support each theory was and asked to point out the corroboration required by Penal Code section 1110. At the conclusion of this discussion, the prosecutor indicated he may not even argue false pretenses as to the July 1973, transaction, but only embezzlement, but that he would consider the matter further.\n\nIt is conceded by the Attorney General on appeal that \"the prosecution did not rely on a false pretense theory as to counts 1-5 and expressly made this clear to the jury,\" although the brief continues to argue in a cursory fashion that there was evidence of false pretenses. While it is not crystal clear from the prosecutor's closing argument,\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e it does appear the only theory emphasized in the closing argument as to the July 1973, transaction was embezzlement. When the prosecutor was explaining his theories of theft on each count, he stated: \"In June of 1971 and July of 1973, the prosecution alleges that Mr. Smith embezzled monies from Sovereign State Capital in connection with these fraudulent sham transactions.\" In describing another count, the prosecutor emphasized: \"Here we encounter the form of theft known as obtaining by false pretenses.\" In laying out the facts as to that count, the prosecutor emphasized the elements of false pretenses, which he did not do in connection with count five. There are other statements which confirm the prosecutor's theory on count five was simply embezzlement.\n\nThis is one of those cases of which it must be said: \"[When] the prosecution presents its case to the jury on alternate theories, some of which are legally correct and others legally incorrect, and the reviewing court cannot determine from the record on which theory the ensuing general verdict\n\nof guilt rested, the conviction cannot stand.\" Green, supra, 27 Cal. 3d 1, 69.) In actuality, as to count five, it is fairly clear the only theory presented to the jury was legally incorrect. Despite the instructions of the court both before and after closing arguments that theft could be established on theories of embezzlement or false pretenses, the prosecutor's closing argument in this case limited the jury to a consideration whether the July 1973, transaction was an embezzlement. The prosecutor relied on an embezzlement theory which cannot be sustained as a matter of law. As discussed above, the heart of the theory was the implicit trust relationship arising between a corporation and its beneficial owner. While this theory is well-grounded in civil law, it is an overextension of the criminal statutes defining embezzlement. I would hold the conviction of theft under count five on this theory must be reversed.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nIII\n\nState Tax Offenses\n\nDefendant was convicted of two counts of tax fraud for his 1971 tax return and two counts of tax fraud for his 1973 return, under each of the following\n\nsections of the Revenue and Taxation Code:\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e \"(a) Any person who willfully makes and subscribes any return, statement, or other document, which contains or is verified by a written declaration that it is made under penalties of perjury, and which he does not believe to be true and correct as to every material matter, shall be guilty of a felony, and, upon conviction thereof, shall be fined not more than two thousand dollars ($2,000) or imprisoned in the state prison, or both.\n\n\"(b) The fact that an individual's name is signed to a return, statement, or other document filed shall be prima facie evidence for all purposes that the return, statement, or other document was actually signed by him.\" (§ 19405.)\n\n\"Any person who, within the time required by or under the provisions of this part, willfully fails to file any return or to supply any information with intent to evade any tax imposed by this part, or who, willfully and with like intent, makes, renders, signs or verifies any false or fraudulent return or statement or supplies any false or fraudulent information, is punishable by imprisonment in the county jail not to exceed one year, or in the state prison, or by fine of not more than five thousand dollars ($5,000), or by both such fine and imprisonment, at the discretion of the court.\" (§ 19406.)\n\nElements of Offenses -- Is Revenue and Taxation Code Section 19405 Necessarily Included in Section 19406 ?\n\nThe California tax fraud statutes have not received much attention from the appellate courts. The only cases applying them are People v. Rapoport (1956) 140 Cal. App. 2d 848 [295 P.2d 910], People v. Kuhn (1963) 216 Cal. App. 2d 695 [31 Cal. Rptr. 253], People v. Pedersen (1978) 86 Cal. App. 3d 987 [150 Cal. Rptr. 577], and the recent cases of People v. Roper (1983) 144 Cal. App. 3d 1033 [193 Cal. Rptr. 15], and Jones, supra, 149 Cal. App. 3d Supp. 41. Kuhn, Roper and Jones involve a complete failure to file a return, which is not our case. Rapoport involves the only\n\nconviction under Revenue and Taxation Code section 19405, but the opinion is completely unilluminating since the court refused to address any contention on appeal except to hold there was sufficient evidence to support a conviction when a taxpayer grossly underreported receipts, expenses and profits in connection with a business (140 Cal. App. 2d at p. 851).\n\nPenal Code section 654 states, in part: \"An act or omission which is made punishable in different ways by different provisions of this code may be punished under either of such provisions, but in no case can it be punished under more than one.\" This section applies to penal provisions of other codes, despite its apparent limitation to \"this\" Penal Code (People v. Brown (1958) 49 Cal. 2d 577, 591, fn. 4 [320 P.2d 5]; In re Hayes (1969) 70 Cal. 2d 604, 605 [75 Cal. Rptr. 790, 451 P.2d 430]). This section must be distinguished in its application from the constitutional double jeopardy doctrine implemented by Penal Code section 1023 (People v. Tideman (1962) 57 Cal. 2d 574, 578, 581, fn. 6, 584-587 [21 Cal. Rptr. 207, 370 P.2d 1007]). The double jeopardy doctrine bars a subsequent prosecution after the defendant has been placed in jeopardy on the same offense or a necessarily included offense (e.g., People v. Greer (1947) 30 Cal. 2d 589, 596-601 [184 P.2d 512]; see Tideman, supra, 57 Cal. 2d at pp. 582-583). It is Penal Code section 654 which bars multiplying punishment, if not conviction, on both greater and necessarily included lesser offenses in the same prosecution (see Tideman, supra, at pp. 581-582).\n\nIt is often stated a defendant cannot be convicted of both an offense and another necessarily included offense (e.g., People v. Pater (1968) 267 Cal. App. 2d 921, 924-926 [73 Cal. Rptr. 823]; People v. Johnson (1978) 81 Cal. App. 3d 380, 387-388 [146 Cal. Rptr. 476]).\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e If defendant has sustained a conviction of a greater offense and a necessarily included lesser offense and the evidence supports the verdict as to the greater offense, the conviction of the included offense should be reversed (People v. Moran (1970) 1 Cal. 3d 755, 763 [83 Cal. Rptr. 411, 463 P.2d 763]) or vacated (People v. Cole (1982) 31 Cal. 3d 568, 582 [183 Cal. Rptr. 350, 645 P.2d 1182]).\n\nIf one offense cannot be committed without committing another, the latter is a necessarily included offense (Greer, supra, 30 Cal. 2d 589, 596-597). Defendant here does not contend in the abstract Revenue and Taxation Code section 19406 cannot be violated without violating section 19405. The former section can be violated by a complete failure to file a\n\nreturn, while the latter requires a filing. Apart from comparison of the statutes defining the offenses, however, one offense is necessarily included in another when the crime as charged in the accusatory pleading contains all the elements of the included offense (People v. Marshall (1957) 48 Cal. 2d 394, 405 [309 P.2d 456]).\n\nWhen a false return is filed, both sections 19405 and 19406 of Revenue and Taxation Code may be violated. The section 19406 violations as charged here state that defendant \"did wilfully make and sign a false and fraudulent California . . . return . . . with the intent thereby to evade the California individual income tax.\" The section 19405 violations as charged here state that defendant \"did wilfully make and subscribe a California . . . return . . . which . . . contained a written declaration it was made under penalties of perjury and which . . . [defendant] did not believe to be true and correct as to every material matter therein.\"\n\nIt is clear the only distinguishing element of the charged Revenue and Taxation Code section 19405 violation is the return contained a written declaration it was made under penalties of perjury. Defendant argues this is a false distinction because the return filed in fact was signed under penalty of perjury. He recognizes under Revenue and Taxation Code section 18431\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e the Franchise Tax Board may provide that a return or other document need not be verified by a written declaration under penalty of perjury. He notes when sections 19405 and 19406 were enacted in 1951 and 1953, respectively, section 18431 required such returns contain this declaration. It was a 1967 amendment to section 18431 which made this declaration optional within the Franchise Tax Board's discretion.\n\nWe may learn from the interpretation of similar federal statutes by federal courts how to properly evaluate this argument (Rihn v. Franchise Tax Board (1955) 31 Cal. App. 2d 356, 360 [280 P.2d 893]). Revenue and Taxation Code section 19405 is virtually identical to 26 United States Code section 7206(1), which makes it a felony when a person \"willfully makes and subscribes any return, statement, or other document, which contains or is verified by a written declaration that it is made under penalties of perjury, and\n\nwhich he does not believe to be true and correct as to every material matter.\" Section 19406 does not have as close a parallel in the federal tax law. Insofar as it punishes the wilful failure to file a return or to supply any information, section 19406 parallels 26 United States Code section 7203,\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e except section 19406 also requires an intent to evade taxation. Insofar as it punishes the wilful supplying of false or fraudulent information, section 19406 parallels 26 United States Code section 7207,\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e with the above noted exception that section 19406 requires an intent to evade taxation. (26 U.S.C. § 7207 could also be violated without the person signing the return, but that is not our case.) Federal returns need not be signed under penalty of perjury under 26 United States Code section 6065,\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e except as the Secretary provides, just as state returns need not be signed under penalty of perjury under Revenue and Taxation Code section 18431, except as the Franchise Tax Board provides.\n\nThe argument has come up in a reverse order in several federal cases which addressed whether 26 United States Code section 7207 was an included offense in section 7206(1). The former is subject to lesser penalties under federal law. The parallel in our situation would be that Revenue and Taxation Code section 19406 is claimed to be a lesser included offense of section 19405 (which would disregard that § 19406 requires an intent to evade taxation). Federal courts have concluded on the facts proved a 26 United States Code section 7207 violation was included in a charged section 7206(1) violation (Escobar v. United States (5th Cir. 1967) 388 F.2d 661, 666, cert. den. 390 U.S. 1024 [20 L.Ed.2d 282, 88 S.Ct. 1411]; United States v. Gaines (11th Cir. 1982) 690 F.2d 849, 856; see United States v. Tsanas (2d Cir. 1978) 572 F.2d 340, 347, cert. den. 435 U.S. 995 [56 L.Ed.2d 84, 98 S.Ct. 1647]).\n\nOn the other hand, United States v. Bishop (1973) 412 U.S. 346 [36 L.Ed.2d 941, 93 S.Ct. 2008], indicates that 26 United States Code section 7207 is not a necessarily included lesser offense of a 7206(1) violation. The\n\nopinion settled a difference among the circuits concerning how the word \"willfully\" should be interpreted as used in the various definitions of federal tax crimes. The court concluded it identified the same element in both section 7206(1) and 7207 violations (id. at pp. 359-360 [36 L.Ed.2d at p. 951]), as well as in other violations. The taxpayer claimed he was entitled to a lesser included offense instruction as to 7207. The court indicated one difference between the offenses was section 7206(1) only applies where the document is signed under penalty of perjury (id. at p. 357 [36 L.Ed.2d at p. 949]). The taxpayer responded, since all federal tax returns contained such a provision, the offenses were equalized. The court rejected this argument equating the offenses for several reasons, one of which was \"the Secretary or his delegate has the power under § 6065(a) to provide that no perjury declaration is required. If he does so provide, then § 7207 immediately becomes operative in the area theretofore covered by § 7206(1).\" (Id. at pp. 357-358 [36 L.Ed.2d at p. 950].) Because of the differences between the elements of sections 7206(1) and 7207, the court concluded they did not cover the same ground, although \"willfully\" had the same meaning in each statute.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nNeither Revenue and Taxation Code section 19406 nor the charged violations of that section in this case required the prosecutor to prove the return here was signed under penalties of perjury. One offense is not necessarily included in another when proof of the former involves different elements than proof of the latter (e.g., People v. Francis (1969) 71 Cal. 2d 66, 73-74 [75 Cal. Rptr. 199, 450 P.2d 591]; see Tideman, supra, 57 Cal. 2d 574, 585-586). Defendant's argument the section 19405 violation was necessarily included in the section 19406 violation requires the court to read into the accusatory pleading that the return contained a written declaration it was made under penalties of perjury. This type of expanded test for identifying necessarily included offenses has been rejected in People v. Lohbauer (1981) 29 Cal. 3d 364, at pages 369 to 372 [173 Cal. Rptr. 453, 627 P.2d 183], where the People argued evidence offered at the preliminary hearing could supplement the accusatory pleading so as to put defendant there on notice of additional necessarily included defenses. The court reasoned the proposed new test would be unworkable and unfair, and disapproved several cases which had adopted it. In our case, if the act proved to be a 19406 violation is the same act proved to be a violation of 19405, then defendant is entitled to the protection afforded by Penal Code section 654 (see Tideman, supra, 57 Cal. 2d 574, 584-587), but neither the statutes nor the accusatory pleading here compels the conclusion the section 19405 violation was a necessarily included offense of the 19406 violation.\n\nAs charged, both violations of sections 19405 and 19406 have the common elements: (1) the defendant made and signed a return (2) wilfully, (3) which return was false.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e The section 19405 violation additionally contains the elements: (4) the return contains a written declaration it is made under the penalties of perjury and (5) defendant believes it to be materially false or at least is unaware of its material accuracy. The section 19406 violation contains an additional alternative element: (4) defendant acted with an intent to evade taxation.\n\nThe \"wilful\" element of both violations means defendant voluntarily and intentionally violated a known legal duty (Bishop, supra, 412 U.S. 346, 360 [36 L.Ed.2d 941, 951]; United States v. Pomponio (1976) 429 U.S. 10, 12 [50 L.Ed.2d 12, 97 S.Ct. 22], rehg. den. 429 U.S. 987 [50 L.Ed.2d 600, 97 S.Ct. 510]). Under this interpretation, the mental component of wilfulness in a Revenue and Taxation Code section 19406 violation comes close to the \"intent to evade\" also required. To avoid reading this specific intent out of the statute, section 19406 violations must involve proof the defendant had an intent to evade taxation when he submitted a false return. The wilfulness adds to the intent to evade that defendant achieved this intent voluntarily and intentionally. These elements together comprise the mental state involved in a section 19406 violation.\n\nThe mental state involved in a Revenue and Taxation Code section 19405 violation, in contrast, does not require the specific intent to evade taxation, although it does require the intentional and voluntary violation of a known legal duty. For example, a 19405 violation may exist when the defendant knows he should fully report his income and refuses to do so, for some other reason than a desire to evade taxation. \"Intent may be established where a taxpayer 'chooses to keep himself uninformed as to the full extent that [the return] is insufficient.'\" (United States v. Drape (1st Cir. 1982) 668 F.2d 22, 26.)\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\n\"The test of materiality is whether a particular item must be reported in order that the taxpayer estimate and compute his tax correctly.\" (United States v. Null (4th Cir. 1969) 415 F.2d 1178, 1181; cf. United States v. Miller (9th Cir. 1976) 545 F.2d 1204, 1211-1212, fns. 8, 10, cert. den. 430 U.S. 930 [51 L.Ed.2d 774, 97 S.Ct. 1549].) Obviously, where income is underreported, there may be a violation of section 19405 (e.g.,\n\nUnited States v. Fontenot (5th Cir. 1980) 628 F.2d 921, 923, cert. den. 452 U.S. 905 [69 L.Ed.2d 406, 101 S.Ct. 3030]).\n\nIt is worth noting, neither section 19405 nor 19406 require the prosecution to prove additionally the unreported or underreported income derived from any particular crime, such as theft. For tax fraud purposes, it is the falsity of the return which is important, and not whether the income was generated by legal or illegal means.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e (Cohen v. United States (9th Cir. 1962) 297 F.2d 760, 768, cert. den. 369 U.S. 865 [8 L.Ed.2d 84, 82 S.Ct. 1029]; see Miller, supra, 545 F.2d 1204, 1213.) The prosecutor so argued in his closing argument.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nMethod of Proof -- Specific Items Approach\n\nThe prosecution here set about to show the defendant failed to report several specific items of income in 1971 and one specific item of income in 1973. This approach is sometimes called the specific items approach, which is but one way in which to demonstrate unreported income. (See, e.g., United States v. Scott (7th Cir. 1981) 660 F.2d 1145, cert. den. 455 U.S. 907 [71 L.Ed.2d 445, 102 S.Ct. 1252]), discussing specific items approach and alternative method of proving net worth and expenditures.) As explained in United States v. Horton (5th Cir. 1976) 526 F.2d 884, at page 886 (cert. den. 429 U.S. 820 [50 L.Ed.2d 81, 97 S.Ct. 67]): \"To be contrasted with the specific item method of proof, the net worth method hinges on a proven increase in the taxpayer's net worth during the period in question in an amount greater than that reported to the IRS with the consequent implication of unreported income. See, e.g., United States v. Meriwether, 440 F.2d 753 (5th Cir. 1971), cert. denied, 417 U.S. 948, 94 S.Ct. 3074, 41 L.Ed.2d 668 (1974). The net worth method generates a circumstantial case laden with possibilities for error and is, in turn, circumscribed in its\n\nuse by a number of limiting rules. See Holland v. United States, 348 U.S. 121, 75 S.Ct. 127, 99 L.Ed. 150 (1954); Merritt v. United States, 327 F.2d 820 (5th Cir. 1964). For example, the Government must establish opening net worth with reasonable certainty and must investigate and show false leads furnished by the taxpayer. E.g., Holland v. United States, 348 U.S. at 135-36, 75 S.Ct. at 135; Agoranos v. United States, 409 F.2d 833, 835 (5th Cir. 1969); Merritt v. United States, supra, at 822-23.\n\n\"The specific item method is, however, direct in its operation. The usual strategy with the latter method is for the Government to produce evidence of the receipt of specific items of reportable income by the defendant that do not appear on his income tax return or appear in diminished amount. United States v. Goldstein, 56 F.R.D. 52, 55, n. 8 (D.Del. 1972); see Azcona v. United States, 257 F.2d 462 (5th Cir. 1958); Lloyd v. United States, 226 F.2d 9 (5th Cir. 1955).\"\n\nThe use of this method of proof has given rise to two related contentions on appeal. Defendant contends the trial court allowed the prosecution to introduce irrelevant, or at least prejudicial, evidence of net worth. Defendant also argues the trial court erred in failing to give sua sponte instructions on the limitations involved in proving a net worth case.\n\nDefendant points to an objection he made before trial to a chart which the prosecution sought to introduce on the basis it emphasized defendant's net worth had increased. The record reflects the court sustained his objection insofar as the chart had that emphasis and required the prosecution to produce the evidence in a different form. Defendant points out what he contends to be an improper emphasis in the prosecution's opening argument on the information as presented in its different form. The record reflects there was no emphasis inconsistent with the court's ruling.\n\nThe defendant otherwise objects on appeal to the prosecutor's questioning of one witness, Mr. Johnston, an accountant who prepared the 1971 tax return. The questioning asked the witness to reconcile the facts the returns showed more deductible expenses than income, while several financial statements showed an increase in net worth. Defendant also objects to a portion of the closing argument wherein the prosecutor argued the only way to reconcile such an inconsistency was to conclude the net worth could grow if defendant was not accurately reporting his income.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nOf course, one of the problems involved in employing the net worth method is it invites such \"assumptions, among which is the equation of unexplained increases in net worth with unreported taxable income. Obviously such an assumption has many weaknesses. It may be that gifts, inheritances, loans and the like account for the newly acquired wealth.\" (Holland v. United States (1954) 348 U.S. 121, 127 [99 L.Ed. 150, 160, 75 S.Ct. 127].)\n\nDefendant's thesis appears to be that in a specific items prosecution, no evidence of the taxpayer's net worth should be admitted. A similar argument was rejected in Horton, supra, 526 F.2d 884. The court held the prosecution could employ evidence of the taxpayer's total bank deposits for several years in order to corroborate testimony his clients had paid him amounts in excess of his reported gross receipts (id. at pp. 886-887; see also United States v. Kaatz (10th Cir. 1983) 705 F.2d 1237, 1244-1245). In our case, net worth statements were properly admitted to show defendant claimed to own shares of stock in fact owned by others. On the other hand, the limited admissibility of evidence of net worth should not be abused by a prosecutor \"piggybacking\" a net worth theory into a specific items case. This did not occur in our case to any significant degree.\n\nDefendant argues the evidence should have been excluded as prejudicial under Evidence Code section 352. Evidence Code section 353, however, provides: \"A verdict or finding shall not be set aside, nor shall the judgment or decision based thereon be reversed, by reason of the erroneous admission of evidence unless:\n\n\"(a) There appears of record an objection to or a motion to exclude or to strike the evidence that was timely made and so stated as to make clear the specific ground of the objection or motion; and\n\n\"(b) The court which passes upon the effect of the error or errors is of the opinion that the admitted evidence should have been excluded on the ground stated and that the error or errors complained of resulted in a miscarriage of justice.\"\n\nAs the Attorney General points out, it does not appear defendant objected on the ground of prejudice during the questioning of Mr. Johnston, although he did object on the ground of relevancy. Defendant responds that having already more than once objected to such evidence on the ground of its prejudicial value, he is not required to renew his objection when similar evidence is introduced (People v. Antick (1975) 15 Cal. 3d 79, 95 [123 Cal. Rptr. 475, 539 P.2d 43]). Defendant also complains the trial court did not weigh on the record the balance of the probative value against the danger of prejudice (People v. Green (1980) 27 Cal. 3d 1, 24-25 [164 Cal. Rptr. 1,\n\n609 P.2d 468]). However, one cannot expect the trial court to sua sponte evaluate the prejudicial effect of evidence to which defendant only has a continuing objection, unless it is renewed when the particular evidence is introduced. The court must make its determination on the record when the objection is initially made, as it did here in sustaining defendant's objection to the form of a chart.\n\nAssuming his objections did preserve the question on appeal, there was no error in admitting the financial statements for the purposes stated above. The danger in employing some evidence of net worth in a specific items case arises when the jury is asked to infer the unexplained increases in net worth are attributable to unreported taxable income. When the prosecution takes the opportunity to so argue, as was done in a limited way in our case, the question is more one of prosecutorial misconduct than the admissibility or prejudicial value of the evidence. We note defendant did not object to this portion of the prosecutor's closing argument\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e People v. Steelik (1921) 187 Cal. 361, 377-378 [203 P. 78]; Green, supra, 27 Cal. 3d 1, 27-35).\n\nIt does not appear from the record the prosecution here did introduce a prejudicial amount of net worth evidence so as to transform a specific items case into a net worth case without the limiting instructions required by Holland, supra, 348 U.S. 121, at page 129 [99 L.Ed. 150, at page 161]. Defendant has cited no case where net worth instructions must be given sua sponte in a specific items case.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e United States v. Hall (9th Cir. 1981) 650 F.2d 994, is the most persuasive authority on this point. There, the prosecution sought to establish tax evasion on both a net worth method and another method called the bank deposits method. (The latter method is described in the opinion at pp. 996-997, fn. 4.) No instructions were either requested or given. The court held it was reversible error for the trial court to fail to instruct on the assumptions involved in the net worth method, notwithstanding the taxpayers' failure to request instructions (id. at pp. 997-999). The prosecution there argued that since the net worth method was used only for corroboration of the bank deposits method, net worth instructions were not required. The court rejected this argument on two grounds: \"Although the net worth method may have been used for corroboration, the results of the net worth analysis were thoroughly presented to the jury by the Government's expert. We cannot speculate on the role which the Government's net worth analysis played in the minds of the jury, Beck v. United\n\nStates, 298 F.2d 622, 631 (9th Cir. 1962), but it may have been substantial. If the jury had disbelieved the Government's net worth result, it may very well have cast doubt on the bank deposits result as well, inasmuch as both analyses yielded the same figures. But we need not rest our decision on our estimation of the role played by the net worth method, for we believe that explanatory instructions are similarly required when the bank deposits method of proof is used.\" (Hall, supra, 650 F.2d 994, 999.) The court went on to find the bank deposits method rested on some of the same shaky assumptions as involved in the net worth method (Hall, supra, 650 F.2d 994, 999).\n\nFrom the court's comments in Hall, it appears the net worth analysis there played an important part in showing tax evasion. That is not our case. Also, the alternative method of proof used in Hall was a circumstantial one and required some cautionary instructions. That is not the situation in a specific items case. A case might be found ostensibly proceeding on a specific items approach which transforms through the weight of evidence and argument into a net worth case requiring cautionary instructions. The record does not support this interpretation of our case. While defendant might have been entitled to a cautionary limiting instruction upon request as to the admissibility of the financial statements, there was no error in failing to give one absent a request (Evid. Code, § 355;\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e cf. Horton, supra, 526 F.2d 884, 887).\n\nThe 1973 Counts\n\nDefendant on appeal does not contend the facts are other than as proved by the prosecution, but that they do not support a criminal conviction. The 1973 transaction will be described first because it is more straightforward and some its details have already been set forth in the theft discussion above.\n\nMr. O'Sullivan, a tax attorney, an accountant and former IRS agent, prepared defendant's 1973 tax return in October 1974. The reported adjusted gross income was $599,519, which included interest income of $239,168. The prosecution contended the specific item of unreported income was the $8,930,867 received in the July 1973, transaction described above wherein defendant promised to provide Sovereign with ownership or at least the proceeds of surplus certificates and a promissory note owed him by the Padres. Although it was not reflected on the tax return, it appeared from O'Sullivan's work papers that part of the reported interest income was $60,867 received by defendant from Sovereign in connection with its purchase\n\nof the Padres' note. (The prosecution accordingly subtracted this amount from its claim of unreported income at trial.)\n\nIt appears O'Sullivan prepared the return from papers and information submitted him specifically to assist in preparing tax returns by defendant and Mr. Toft. He was aware in general from several sources prior to preparing the return that defendant still professed ownership of obligations due from the Padres, but O'Sullivan apparently did not correlate this claim with the information that certain obligations had been sold to Sovereign, nor did he question what the possible tax implications were. He was not provided with the records of Sovereign which reflected the transaction.\n\nThe 1971 Counts\n\nDefendant's 1971 tax return was prepared by the partnership of Johnston and Rundlett in June 1972. The reported adjusted gross income was $430,851. The prosecution identified four separate transactions as generating unreported income.\n\nAs alluded to above in the theft discussion, on June 18, 1971, there was a transaction whereby Sovereign issued three checks totaling $5,313.264 to defendant in exchange for 161,008 shares of United States National Bank (USNB) stock in lots of 67,500, 64,500 and 29,008. The books of Sovereign reflect an acquisition of those shares, but they were never transferred into Sovereign's name. The largest lot of shares was pledged to the Annuity Board of the Southern Baptist Convention as collateral for a loan to defendant and was retained for litigation after USNB failed in October 1973. This loan was extended in September 1973. The next largest lot was pledged to Bankers Life and Insurance Company of Nebraska as collateral for a loan to defendant, which likewise was retained for litigation after USNB failed with the loan unpaid. Most of the smallest lot of shares was pledged to Crocker Citizens National Bank as collateral for a loan to defendant.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e The loan was repaid in December 1971, and the shares were returned to defendant. They were then pledged to Bank of California on another loan to defendant. Defendant made a variety of representations to these institutions and others in writing that he owned these shares, even after the June 18, 1971, transaction. Of the 161,008 shares, 60,008 were owned by other corporations, including 26,000 shares which were already owned by Sovereign. In June 1972, shortly after the tax return was prepared, a written \"bailment\" agreement was prepared to reflect that on June 18, 1971, Sovereign lent back to defendant 156,008 of the shares it had just purchased.\n\nThe sale of the shares to Sovereign was reported on the 1971 tax return as generating a long-term capital gain to defendant of somewhat over $900,000. Mr. Rundlett determined there was no gain on the 60,008 shares which defendant did not own at that time because it had been determined he acquired those shares at the same cost at which he had sold them. The nature of his acquisition of those shares and the determination of the cost was made in May and June 1972. Further details will be provided below after summarizing the other transactions charged as income to defendant.\n\nThe prosecution also charged as unreported items of income three transactions whereby defendant had issued in his name USNB shares previously standing in the name of other corporations. It is not necessary to detail the nature of his interest in these corporations except to say, like Sovereign, defendant controlled them and employed their officers. On June 25, 1971, defendant had 80,000 shares issued into his name, of which at least 37,230 were in the name of National Marine Terminal and of which another 10,000 were in the name of Missouri Western Realty Company, although they may have belonged to National Marine Terminal. The certificates representing those shares in the corporation's names were simultaneously canceled. On September 8, 1971, defendant had 5,250 shares issued into his name, with corresponding cancellation of certificates representing 4,000 shares in the name of Sovereign and 1,250 shares in the name of Westward Realty Company. On September 22, 1971, defendant had 5,000 shares issued into his name, with corresponding cancellation of certificates representing 3,496 shares in the name of Sovereign and 1,504 shares in the name of British Columbia Investment Company. Each occasion on which defendant obtained USNB shares from one of these corporations came to be represented by a written \"bailment\" agreement, prepared in June 1972, and ultimately signed by the appropriate corporate officers.\n\nThe bailment agreements came about as the result of work done by Mr. Rundlett initiated by defendant's request in September 1971. Rundlett was assigned to trace how defendant had come by the various USNB shares in his name and what the cost basis was of these acquisitions. Apparently over the years defendant had directed the USNB stock transfer agent, Mr. Tenney, to cancel certain certificates in the name of various controlled corporations and to issue them in his name. Some of these transactions were reflected as sales of stock to defendant. Rundlett was able to trace a number of the shares while working with Tenney, but was unable to account for others, as he reported back to Mr. Toft. Schroeder was directed by Toft to fill in the gaps. As comptroller of a number of the corporations involved, Schroeder had access to the books. In a number of instances where USNB stock had been issued in defendant's name, there was no record of the transfer of the shares in the books of the corporation which previously\n\nowned them. Schroeder turned his information over to Rundlett in April 1972. Schroeder had a listing of shares of \"disputed ownership.\" Schroeder suggested to Rundlett that at least some of these shares had been borrowed by defendant from the corporations. Schroeder was unable to identify the cost basis for some of the shares.\n\nRundlett was not satisfied with the information provided by Schroeder, and he discussed the matter with Johnston. Johnston discussed it with Toft, and Toft suggested they put their questions in writing. The resulting 20 questions were the topic of a meeting on May 19, 1972, involving defendant, Johnston, Toft and possibly Schroeder.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e The tracing work had not uncovered the June 17, 1971, transaction with Sovereign, but it became the 21st question after Toft informed Johnston of it at the meeting. At the meeting, it was determined in a number of cases defendant had borrowed USNB stock from the various corporations, and defendant confirmed he had loan agreements with several of them. It was also determined such loan agreements should be put into writing.\n\nAfter the meeting, Johnston reported it to Rundlett and Rundlett returned to his tracing work, receiving material from several of defendant's employees. With the material generated from his tracing work and additional material supplied by defendant specifically to assist Rundlett in preparing the tax return, he was able to prepare it by mid-June 1972. The tracing of the June 17, 1971, transaction had revealed defendant did not own 60,008 of the shares he sold Sovereign. Rundlett and Johnston proposed to treat this as a borrowing or bailment of those shares from the corporations which did own them, which converted into a purchase by defendant when he himself sold them to Sovereign. Before preparation of the tax return, Rundlett proposed to the appropriate corporate officers their books should be adjusted to reflect these transactions. This was eventually done, although Schroeder did not do so for about one year. Defendant was also informed by Johnston and Rundlett at the time of signing his tax return, and more specifically over a week later, in order to complete the transactions he would have to write some checks to the corporations whose borrowed stock he had sold.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nSoon after the tax returns were prepared, Johnston and Rundlett had some part in preparing the bailment agreements from models provided by defendant. As indicated above, the bailment agreements were signed by defendant and the appropriate corporate officers in June or later of 1972, although some of them referred back to transactions which had occurred three and\n\nfour years earlier. There was no evidence defendant in fact at the time had ever negotiated with any of the corporate officers to borrow the stock.\n\nIt does not appear Johnston or Rundlett contacted defendant in making their determination on how to report the sale of 161,008 shares on June 17, 1971. They discussed it between themselves and recognized they had the option not even to report the sale of 60,008 shares since they had determined defendant acquired them at the same cost at which he sold them. They reported them anyway because it seemed most consistent with the corporate records involved.\n\nCalifornia's Tax Law Is Not Unconstitutionally Vague and Economic Benefit May Be Taxed as Income\n\nDefendant raises related arguments (1) that economic benefit is not taxable income under California law, or if economic benefit is taxable either (2) the statutes are unconstitutionally vague or (3) defendant could not have had the necessary criminal intent.\n\nWith unintentional irony, defendant relies on cases involving federal tax crimes to argue the state tax crime law either does not reach the transactions involved here or, if it does, it is unconstitutionally vague. We agree with the abstract proposition advanced, namely, when the taxability of a transaction is uncertain, it may be legally impossible to have the requisite criminal intent to evade taxation by failing to report the transaction properly. James v. United States, supra, 366 U.S. 213 [6 L.Ed.2d 246, 81 S.Ct. 1052], in a split of opinions gives support to this proposition. There, the court overruled Commissioner of Internal Revenue v. Wilcox, supra, 327 U.S. 404 [90 L.Ed. 752, 66 S.Ct. 546] (at 366 U.S., p. 222 [at 6 L.Ed.2d, p. 255]). In James, the court held embezzled funds were income just as other illegal gains were (366 U.S. at pp. 218-219 [6 L.Ed.2d at p. 253]). Three justices went on to conclude (at pp. 221-222 [6 L.Ed.2d at p. 255]): \"We believe that the element of willfulness could not be proven in a criminal prosecution for failing to include embezzled funds in gross income in the year of misappropriation so long as the statute contained the gloss placed upon it by Wilcox at the time the alleged crime was committed. Therefore, we feel that petitioner's conviction may not stand and that the indictment against him must be dismissed.\"\n\nTwo other justices dissented from this \"prospective\" overruling of Wilcox contending if it was wrong then James was guilty (366 U.S. at pp. 223-225 [6 L.Ed.2d at pp. 255-257]). A third justice agreed with this dissent in his own opinion (366 U.S. at p. 241 [6 L.Ed.2d at p. 266]). Yet two other justices agreed if James had in fact relied on Wilcox, he could\n\nnot be convicted, but such a factual determination should be made in a new trial (366 U.S. at pp. 242-245 [6 L.Ed.2d at pp. 266-269]). In the fifth opinion of the court, the ninth justice concurred in the judgment reversing conviction, apparently because he agreed with Wilcox (366 U.S. at p. 249 [6 L.Ed.2d at pp. 270-271]).\n\nIn James, supra, 366 U.S. 213, there does appear to be a bare majority to support the proposition that if a taxpayer took a valid position under existing tax law in not treating a transaction as generating reportable income, then he could not have the wilfulness required to support a conviction of tax evasion. Defendant here also relies on United States v. Critzer (4th Cir. 1974) 498 F.2d 1160, and United States v. Garber (5th Cir. 1979) 607 F.2d 92. Critzer states (at p. 1162): \"As a matter of law, defendant cannot be guilty of willfully evading and defeating income taxes on income, the taxability of which is so uncertain that even co-ordinate branches of the United States Government plausibly reach directly opposing conclusions. As a matter of law, the requisite intent to evade and defeat income taxes is missing. The obligation to pay is so problematical that defendant's actual intent is irrelevant. Even if she had consulted the law and sought to guide herself accordingly, she could have had no certainty as to what the law required.\n\n\"It is settled that when the law is vague or highly debatable, a defendant -- actually or imputedly -- lacks the requisite intent to violate it.\" Critzer further states (at p. 1163) \"pioneering interpretations of the tax law should not be sought or rendered in criminal prosecutions under § 7201, but rather in civil suits.\" Garber quotes the language first quoted above from Critzer (607 F.2d 92, at p. 98) and paraphrases the language quoted second above (p. 100).\n\nIn Critzer, supra, 498 F.2d 1160, the defendant was charged with underreporting business income. The income derived from property held in trust by the government and allotted to her as a Cherokee Indian. It appeared the Department of the Interior took the position, supported by some case law, that rental and business income from such property was not taxable as defendant had been advised (id. at pp. 1161-1162).\n\nIn Garber, supra, 607 F.2d 92, the defendant was charged with not reporting her income derived from selling blood plasma to blood banks and clinical laboratories. It appeared there would not be income if the value of the blood plasma were deemed equal to the price paid (id. at p. 97).\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e The question of the treatment of such a transaction was a new one in tax law.\n\nDefendant supports his argument the California tax law is uncertain or vague by pointing to the paucity of reported convictions of tax crimes. One of the most recent, Roper, supra, 144 Cal. App. 3d 1033, at pages 1040 to 1042, rejected a vagueness challenge which only in part contended \"income\" is vague and uncertain. That court found the California statutes sufficiently clear without reference to parallel federal statutes. An additional answer to this contention is, we may look to federal law to determine how to interpret similar state tax statutes (Rihn, supra, 131 Cal. App. 2d 356, 360; see Calhoun v. Franchise Tax Bd. (1978) 20 Cal. 3d 881, 884-886 [143 Cal. Rptr. 692, 574 P.2d 763]).\n\nIndeed, defendant looks to federal cases to argue \"economic benefit\" is not taxable. We will adopt the suggestion of Critzer, supra, 498 F.2d 1160, 1163, and Garber, supra, 607 F.2d 92, 100, and not rely on civil tax proceedings in order to establish whether the transactions at issue here are taxable.\n\nAs indicated in Miller, supra, 545 F.2d 1204, at pages 1212 to 1215, a court involved in a criminal tax proceeding should not become overly preoccupied with precisely how a transaction should have been reported and what amount of tax should have been paid. As Miller states (at p. 1214): \"In civil tax cases the purpose is tax collection and the key issue is the establishment of the amount of tax owed by the taxpayer. In a criminal tax proceeding the concern is not over the type or the specific amount of the tax which the defendant has evaded, but whether he has willfully attempted to evade the payment or assessment of a tax . . . . [ para. ] Where the taxpayer has sought to conceal income by filing a false return, he has violated the tax evasion statutes. It does not matter that that amount could have somehow been made nontaxable if the taxpayer had proceeded on a different course.\"\n\nIt may be the general rule a corporation's distribution of its stock to a shareholder is not treated as gross income to the shareholder (Rev. \u0026 Tax. Code § 17335; 26 U.S.C. § 305(a)).\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e It may further be the case that a bailment of stock to a corporation is not necessarily regarded as a capital contribution (Stahl v. United States (D.C.Cir. 1970) 441 F.2d 999, 1002-1005). Whether a transaction is truly a loan or income to the defendant is a question for the jury, however (United States v. Pomponio (4th Cir. 1977) 563 F.2d 659, 662-663, cert. den. 435 U.S. 942 [55 L.Ed.2d 538, 98 S.Ct. 1521]). \"The test is whether the taxpayer acquired things of\n\nvalue 'without the consensual recognition, express or implied, of an obligation to repay and without restriction as to their disposition.'\" (United States v. Rosenthal (2d Cir. 1972) 470 F.2d 837, 842, cert. den. 412 U.S. 909 [36 L.Ed.2d 975, 93 S.Ct. 2298]; United States v. Swallow (10th Cir. 1975) 511 F.2d 514, 519, cert. den. 423 U.S. 845 [46 L.Ed.2d 66, 96 S.Ct. 82].)\n\nEven where there is some evidence of an express recognition of an intent to repay, the jury may conclude otherwise (Rosenthal, supra, 470 F.2d 837, 842). \"When a taxpayer holds stock in his own name, he cannot complain if he is later unable to convince a jury that he was only a nominee for somebody else.\" (United States v. Garguilo (2d Cir. 1977) 554 F.2d 59, 62.) O'Rourke v. United States (9th Cir. 1965) 347 F.2d 124, at pages 127 to 128, says the same thing about a defendant who characterized himself as a trustee of his corporation. Indeed, stock need not even stand in a taxpayer's name in order for it to be treated as income to him, depending on the circumstances (United States v. Catalano (2d Cir. 1974) 491 F.2d 268, 272-273, cert. den. 419 U.S. 825 [42 L.Ed.2d 48, 95 S.Ct. 42]).\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e A receipt of stock in payment is ordinarily taxable when received (Garguilo, supra, 554 F.2d 59, 62; United States v. Isaacs (7th Cir. 1974) 493 F.2d 1124, 1161, cert. den. sub nom. Kerner v. United States, 417 U.S. 976 [41 L.Ed.2d 1146, 94 S.Ct. 3183]). Thus, a sham bailment of stock may result in income to the bailee where in fact the bailee does not recognize any restriction on its use and does not intend to return it, but instead treats it as his own property.\n\nSimilarly, a jury could conclude, a sale reported as generating a capital gain was a sham and the taxpayer had unreported ordinary income (United States v. Wenger (2d Cir. 1972) 455 F.2d 308, 310, cert. den. 407 U.S. 920 [32 L.Ed.2d 805, 92 S.Ct. 2458]; United States v. Parr (5th Cir. 1975) 509 F.2d 1381, 1384.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e A diversion of funds from a corporation\n\nto the taxpayer's personal use also may be regarded as income to the taxpayer (O'Rourke, supra, 347 F.2d 124, 128; Miller, supra, 545 F.2d 1204, 1215-1216).\n\nSince these transactions were clearly taxable if viewed as characterized by the prosecution, we need not be drawn into an abstract discussion whether \"economic benefit\" is taxable. We agree with defendant insofar as he is asserting the prosecution had to convince the jury the bailments and the sales were sham transactions in order to establish the defendant received more income than reported. As noted, the sales were both reported, the one in June 1971, as generating capital gains, and the one in July 1973, as generating interest. The sales should have been reported differently if defendant never intended to part with what he promised in exchange for the payments received. We disagree with defendant insofar as he is asserting the prosecution had to prove any particular form of theft (see fn. 28 above and related text).\n\nDefendant argues the definition of income given by the court and elaborated on by the prosecutor in closing argument is so broad as to sweep in nontaxable transactions such as gifts, inheritances and interest-free loans. Out of context, that may be so, but there is no evidence any of the transactions at issue in our case was such a nontaxable transaction. Like the court in Miller, supra, 545 F.2d 1204, 1215 to 1216, we will not permit the taxpayer to recharacterize the transactions differently than the way he chose to at the time in order to make an argument that they are nontaxable. There, the taxpayer argued sham loan repayments to him from his corporation in fact were a return of capital.\n\nPart of defendant's argument is this definition of income would make a true bailment taxable. The jury was properly instructed on this area of the tax law (see fn. 40 above). Defendant to some extent is trying to persuade this court the transactions were not sham. A portion of Pomponio, supra, 563 F.2d 659, at page 663 (not cited by the Attorney General), answers this argument. \"We realize that a course of self-dealing between individuals and their closely-held corporations must be considered from both sides. On one hand, the need to examine closely the substance of the transactions, as well as the form in which they are couched, is especially acute; thus, the fact that the advances were formally treated as loans on the corporate books is not controlling. [Citation.] On the other hand, the possibility exists that bona fide loan transactions may be carried out in the informal manner presented here within closely held corporations. But these are circumstances for the jury to have weighed and have less force on appeal where our reviewing role as to factual matters is limited to ascertaining whether the\n\njury's verdict is supported by substantial evidence, viewed in the light most favorable to the government.\"\n\nThus, viewing the transactions at issue as portrayed by the prosecution, they were clearly taxable, without undertaking a pioneering interpretation of the tax law to reach this conclusion. We cannot say it was so highly debatable whether these transactions should have been reported differently that defendant's actual intent is irrelevant.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e As applied here, the California tax statutes are not unconstitutionally vague.\n\nDefendant Received Taxable Income\n\nDefendant contends that even if \"economic benefit\" is taxable, on the facts he personally did not receive any income. Defendant wisely does not attempt to explain how the receipt of $5.3 or $8.9 million in exchange for nothing is not income. Defendant does not specifically address this argument to the June 25, 1971, acquisition of stock either. It appears he pledged the entire 80,000 shares of USNB stock, including the 47,230 he \"borrowed,\" as security for a loan to him of $1.5 million from Union Bank.\n\nDefendant focuses on the September 1971, stock acquisitions in arguing he did not receive any personal benefit. Apparently the 10,250 shares of USNB stock he \"borrowed\" then were pledged as additional security for a $3 million loan from Valley National Bank to United States Holding Company, another one of defendant's corporations. He argues it was his \"family\" of corporations which benefited.\n\nIt is a question for the jury whether defendant has received income (O'Rourke, supra, 347 F.2d 124, 127-128; Catalano, supra, 491 F.2d 268, 273). Receipt of valuable stock by itself may be income (Catalano, supra, 491 F.2d at pp. 272-273; Garguilo, supra, 554 F.2d 59, 62). What a taxpayer does with money or property after receiving it does not necessarily change its nature as income upon receipt (e.g., United States v. Milder (8th Cir. 1972) 459 F.2d 801, 804, cert. den. 409 U.S. 851 [34 L.Ed.2d 93, 93 S.Ct. 60]; United States v. Lawhon (5th Cir. 1974) 499 F.2d 352, 355-356, cert. den. 419 U.S. 1121 [42 L.Ed.2d 820, 95 S.Ct. 804]; see Geiger's Estate v. Commissioner (8th Cir. 1965) 352 F.2d 221, 231-232, cert. den. 382 U.S. 1012 [15 L.Ed.2d 527, 86 S.Ct. 620]). The evidence supports the jury's implicit conclusion defendant benefited and had income by receiving\n\nstock, and whether he personally benefited from his use of that stock is not the issue.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\n\nWas the Defense of Reliance Established as a Matter of Law ?\n\n\"It is a valid defense to a charge of filing a false return if a defendant provides full information regarding his taxable income and expenses to an accountant qualified to prepare . . . tax returns, and that the defendant adopts and files the return as prepared without having reason to believe that it is incorrect.\" (United States v. Whyte (7th Cir. 1983) 699 F.2d 375, 379; see Annot., Reliance on Advice of Attorney, Accountant, or Tax Expert as Defense in Criminal Prosecution for Attempt to Evade Federal Income Tax Under § 7201 of the Internal Revenue Code of 1954 (26 U.S.C. § 7201) (1970) 3 A.L.R.Fed. 665.) If not a complete defense, it at least tends to establish the defendant lacked the requisite wilfulness to commit tax fraud (United States v. Conforte (9th Cir. 1980) 624 F.2d 869, 876, cert. den. 449 U.S. 1012 [66 L.Ed.2d 470, 101 S.Ct. 568]). Instructions on this defense should be given when supported by the evidence. (Bursten v. United States (5th Cir. 1968) 395 F.2d 976, 981, 3 A.L.R.Fed. 644, cert. den. 409 U.S. 843 [34 L.Ed.2d 83, 93 S.Ct. 44]; United States v. Mitchell (4th Cir. 1974) 495 F.2d 285, 288-289; see United States v. Williams (5th Cir. 1978) 573 F.2d 284, 291-292; United States v. Vannelli (8th Cir. 1979) 595 F.2d 402, 404-405; and Whyte, supra, 699 F.2d 375, 379-380, for approval of instructions given therein.)\n\nThe defense of reliance is undermined and will fail if it appears the defendant did not fully disclose relevant tax information but withheld it instead. (United States v. Cox (6th Cir. 1965) 348 F.2d 294, 296; United States v. Scher (7th Cir. 1973) 476 F.2d 319, 321; United States v. Garavaglia (6th Cir. 1977) 566 F.2d 1056, 1060; Conforte, supra, 624 F.2d 869, 876-878; United States v. Samara (10th Cir. 1981) 643 F.2d 701, 703, cert. den. 454 U.S. 829 [70 L.Ed.2d 104, 102 S.Ct. 122]; United States v. Thetford (5th Cir. 1982) 676 F.2d 170, 177-178, cert. den. 459 U.S. 1148 [74 L.Ed.2d 996, 103 S.Ct. 790]; Whyte, supra, 699 F.2d 375, 380.)\n\nIt is more difficult to establish a defendant's reliance on a tax expert when the defendant does not testify (see Williams, supra, 573 F.2d 284, 291), but in a tax prosecution the burden is not on the defendant to prove his lack of wilfulness, but on the prosecution to prove the requisite\n\nmental element (United States v. Phillips (7th Cir. 1954) 217 F.2d 435, 439-441).\n\nWhether the facts establish defendant's reliance on a tax return preparer is a question for the jury. (United States v. Baldwin (7th Cir. 1962) 307 F.2d 577, 579, cert. den. 371 U.S. 947 [9 L.Ed.2d 497, 83 S.Ct. 501]; United States v. Stone (5th Cir. 1970) 431 F.2d 1286, 1288-1289, cert. den. 401 U.S. 912 [27 L.Ed.2d 811, 91 S.Ct. 879]; United States v. Dowell (10th Cir. 1971) 446 F.2d 145, 148, cert. den. 404 U.S. 984 [30 L.Ed.2d 368, 92 S.Ct. 448]; Pomponio, supra, 563 F.2d 659, 662-663; Vannelli, supra, 595 F.2d 402, 404.) The defense appears to have succeeded only once on appeal, not in any of the cases cited above but in United States v. Pechenik (3d Cir. 1956) 236 F.2d 844. Defendant naturally asserts our case is \"very much like\" that one. There, the prosecution contended corporate tax returns improperly reflected capital expenditures as operating expenses (id., at p. 845). The evidence showed, while the defendant was the president of the corporation, he left it up to the corporation's bookkeeper how to record the expenses in the corporate records (id., at pp. 845-846). A certified public accountant prepared the corporate tax returns from the corporate records, without independently verifying how expenses were characterized (ibid.) The court further noted (at p. 846): \"There is no evidence that the defendant interfered with either of them or with the books . . . . The bookkeeper testified that the defendant did not give him directions to charge an expense to one item of account rather than another. The accountant prepared the corporation's tax returns from the books of the corporation, and defendant caused them to be filed. He did not attribute the errors to the defendant or to any directions or information given by the defendant.\" It appeared to the court there that at most the defendant was mistaken but he did not have the requisite wilfulness (id, at p. 847).\n\nIt does seem to be the case, as narrated above, at least as to the 1971 tax return, defendant here essentially made available to Rundlett and Johnston all the relevant information. Indeed, it was Rundlett's stock tracing work, with Schroeder's help in summarizing the corporate books, which underlay the prosecution's case here. The stock tracing work uncovered the fact there were a number (apparently 17) stock acquisitions by defendant which came to be represented by different written bailment agreements. These acquisitions were from various corporations and took place between 1965 and 1971. Moreover, the tracing did not uncover the June 17, 1971, transaction, but defendant had the accountants informed about it through Mr. Toft. It was Johnston's impression the defendant was unaware of all the details of how he came into ownership of all his USNB stock.\n\nIt also seems to be the case Rundlett and Johnston determined how to report the June 17, 1971, transaction without specific guidance from defendant.\n\nThey worked up the theory as to \"borrowed\" stock which he had sold, that (1) he had to buy it from the bailor and (2) the purchase and sale would be a wash, involving the same cost basis. Indeed, the involvement of these accountants in 1971 and their knowledge of the relevant facts stands in contrast to that of O'Sullivan in preparing the 1973 return.\n\nO'Sullivan reiterated he prepared the 1973 return almost exclusively from information submitted to him by defendant to assist in preparation of the return. He acknowledged only a general awareness of the July 17, 1971, transaction, but did not relate it to preparing the return. He was like the expert on whom the taxpayers unsuccessfully asserted reliance in Conforte, supra, 624 F.2d 869, at page 877, in that it seems he did not know and did not want to know too much about defendant's affairs.\n\nThe prosecution's theory below and the Attorney General's theory on appeal in part is the tax preparers were unreliable because they did not conduct a thoroughgoing and independent audit of defendant's financial dealings before preparing his tax returns. This argument has a dubious factual predicate as to Rundlett and Johnston. (See fn. 44.) That is not the burden placed on a tax preparer before it can be said a taxpayer relied on him in any event.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\nNevertheless, it cannot be said there was reliance as a matter of law, even on Rundlett and Johnston. None of them considered the transactions, either the sales or the bailments, to be sham. Again the answer is in Pomponio, supra, 563 F.2d 659, at page 662: \"[That] loans which are not actually such are income, is beyond argument. If the Pomponios intended to repay the advances, the sums advanced to them did not constitute reportable income, as the jury was instructed. While there may be instances in which an accountant's interpretation of the tax laws can justifiably be relied upon by a taxpayer, even if erroneous, see United States v. Pechenik, 236 F.2d 844 (3d Cir. 1956), certainly these cannot include cases where the only real question bearing on the correctness of the returns, as here, is one of the taxpayer's own intent.\n\n\"The Pomponios knew, at the time they signed their tax returns, whether they had received funds from their corporations with the intention of repaying them. On the question of their own state of mind, a matter of fact, they can hardly claim reliance on their accountant, for it was incumbent upon them to inform Bates that the advances were not loans if they had no intention of repayment.\"\n\nSimilarly, in our case, Rundlett and Johnston accepted defendant's statements the transactions were genuine and reported them accordingly. If defendant did not intend them to be genuine sales and bailments, as the jury implicitly found, then he could only claim reliance on the tax return preparer if he had told them the transactions were sham. There is no evidence he did so.\n\nWas Defendant's Lack of Wilfulness Established as a Matter of Law ?\n\nOf course, whether defendant had the requisite wilfulness to sustain a conviction of tax fraud is a question for the jury (United States v. Lisowski (7th Cir. 1974) 504 F.2d 1268, 1272; United States v. Walsh (7th Cir. 1980) 627 F.2d 88, 91-92). The required mental state has been described above in the discussion of the elements of the offenses.\n\n\"[Proof] of willfulness is most often made through circumstantial evidence\" (Walsh, supra, 627 F.2d at p. 92). Wilfulness: \"may be inferred\n\nfrom conduct such as keeping a double set of books, making false entries or alterations, or false invoices or documents, destruction of books or records, concealment of assets or covering up sources of income, handling of one's affairs to avoid making the records usual in transactions of the kind, and any conduct, the likely effect of which would be to mislead or to conceal.\" (Spies v. United States (1943) 317 U.S. 492, 499 [87 L.Ed. 418, 423, 63 S.Ct. 364].)\n\nAdmittedly, ours is not a case where the taxpayer dealt in cash rather than checks, kept incomplete records and destroyed other records.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e (Cf. Stone, supra, 431 F.2d 1286, 1288.) The prosecution was able to take a specific items approach because defendant's records were so complete. Arguably, at least as to 1971, this is not a case where an inference may be drawn from concealment of information from the tax return preparer. (Cf. Thetford, supra, 676 F.2d 170, 177-178.) As just explained, about all defendant concealed from Rundlett and Johnston in the way of material essential to prepare his returns was an intent to feign the sales and bailments. Some evidence that the June 1971, sale was not a sham was that Sovereign thereafter made payments on the obligations which were secured by the stock which it had acquired from defendant.\n\nDefendant argues his lack of wilfulness is indicated by the maintaining of complete business records. Unless this information is accurately reflected on a tax return, however, the accuracy of business records does not prove much by itself. Defendant did report the sales of June 1971, and July 1973, as sales and did not report the stock bailments of June and September 1971. His treatment of the transactions for tax purposes was consistent with their authenticity.\n\nOther evidence undermines the assertion the sales and bailments were genuine. The backdating of documents is some evidence of wilfulness (Drape, supra, 668 F.2d 22, 26; see United States v. Hecht (8th Cir. 1983) 705 F.2d 976, 977-978). The placement of assets in the names of controlled corporations is also some evidence of wilfulness (United States v. Holovachka (7th Cir. 1963) 314 F.2d 345, 358, cert. den. 374 U.S. 809 [10 L.Ed.2d 1033, 83 S.Ct. 1695]).\n\nMost tellingly, as to the sales, the buyer, Sovereign, never received what it purchased in either June 1971, or July 1973. Defendant, even according to his own view of the transaction, immediately borrowed back from Sovereign\n\nalmost all the stock it acquired from him in June 1971. The bailment agreements all provided defendant would return the stock to the bailors by December 31, 1973. Whether defendant intended to or not became a moot question when USNB was declared insolvent in October 1973. The bailments were of USNB stock. But the bailments also provided for extensions and were subordinate to the claims of defendant's creditors.\n\nAs to the bailments, there was also evidence that virtually no one outside defendant's corporations, except for the tax authorities, heard about them. To a variety of lenders and others, defendant continued to represent he owned the stock. If the bailments and sales were shams, except as reported on tax returns (or not reported in the case of the bailments), this would be sufficient evidence to support a finding of wilfulness.\n\nDefendant contends he relied on a limited investigation by the California Franchise Tax Board into his 1965 return in reporting the June 1971, sale. Apparently in December 1965, defendant had sold United States Holding Company 50,000 shares of USNB stock for $1.85 million. As in June 1971, the shares were never transferred into the name of the buyer. They subsequently were subject to a bailment agreement drawn up in June 1972. The Franchise Tax Board inquired about what generated the interest deduction which defendant took, after taking the proceeds of that sale to pay on an obligation he owed to United States Holding Company. The tax board was informed of the nature of the debt owed to the company and that the payment had come from the sale of stock. It was not informed the stock was sold to the same company to which the debt was owed. He cannot rely on an inconclusive civil audit as approval of his method of reporting on his tax returns (see Hecht, supra, 705 F.2d 976, 979).\n\nDefendant also tries to assert some reliance on the fact that after extensive investigation by the Internal Revenue Service, a criminal tax prosecution, after being recommended, was ultimately declined in June 1974. Obviously, he could not have had this in mind in June 1972, in reporting his 1971 return. His implication from this is there was no tax fraud. However, there is no evidence why prosecution was declined. Even if our state income tax law may be modeled on the federal income tax law to some extent, this does not mean federal revenue agents or the Justice Department does the thinking for those responsible for implementing our state statutes.\n\nThe evidence is short of establishing as a matter of law that defendant did not have the requisite wilfulness. It does appear the number of stock acquisitions determined by defendant to be bailments may have resulted from negligent recordkeeping. There is more stupidity than criminality in selling 5,000 shares of stock on March 31, 1971, and selling it again on\n\nJune 17, 1971, as defendant did. It appears defendant considered the corporations in his \"family\" almost as pockets from which he might draw out stock certificates. There is some artificiality in the argument defendant lied to the corporations he controlled and to their officers which he employed in order to obtain payments in exchange for assets he did not intend to deliver.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e It may not seem \"overwhelming,\" but the evidence does support the jury's determination as to defendant's wilfulness.\n\nWas Evidence of Returns from Uncharged Years Prejudicial ?\n\nHolland, supra, 348 U.S. 121, 139 [99 L.Ed. 150, 166], stated: \"[Willfulness] 'involves a specific intent which must be proven by independent evidence and which cannot be inferred from the mere understatement of income.' . . . Here, however, there was evidence of a consistent pattern of underreporting large amounts of income, and of the failure on petitioners' part to include all of their income in their books and records. Since, on proper submission, the jury could have found that these acts supported an inference of willfulness, their verdict must stand.\"\n\nThis passage has been echoed in a variety of federal tax prosecutions since. Some simply say a consistent pattern of underreporting large amounts of income is evidence of wilfulness (e.g., Vannelli, supra, 595 F.2d 402, 405). There are three limitations on its application to our case. One is, Holland involved a tax prosecution under the statutory precursor of 26 United States Code section 7201. As explained above, California's Revenue and Taxation Code section 19405 is virtually identical to 26 United States Code section 7206(1). Our section 19406 is similar to other federal tax crime definitions, but is not particularly like 26 United States Code section 7201.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e\n\nAt least one court has observed the independent evidence requirement is not applicable to a violation of 26 United States Code section 7206(1) (United States v. Vacca (E.D.Pa. 1977) 431 F.Supp. 807, 810, affd. 571 F.2d 573). Second, Holland was applying a definition of wilfulness given by Spies, supra, 317 U.S. 492. It was in part the definition of wilfulness given in Spies which the court modified in Bishop, supra, 412 U.S. 346, and Pomponio, supra, 429 U.S. 10. The latter cases clarify not as much need be proved in order to show wilfulness as the earlier cases seemed to require. Third is that Holland was a net worth case.\n\nDefendant was charged with tax fraud in 1971, 1973 and 1974. Not only were the tax returns for those years in evidence, but the prosecution also introduced the returns for the years 1965, 1968, 1969, 1970 and 1972, and summarized on charts the information from them. Defendant objected at the outset of the case both as to their relevancy and prejudicial effect, but the objection was overruled. The other returns were employed during the trial, among other ways, in the prosecutor's attempts to impeach defendant's tax return preparers, insinuating either they should have known more about the prior returns than they did or that, knowing about them, should have seen the pattern of tax fraud. Defendant's objections again were overruled, although the jury was instructed during trial and at the end about this limited relevance.\n\nIn his closing argument, the prosecutor used the 1965 return to contend there was tax fraud in 1965 by virtue of the December 1965, sham sale. He argued the sale resulted in an interest deduction which offset income, as occurred to some extent in June 1971, and more significantly in July 1973. He utilized the returns of 1968 through 1973 on a chart to show a consistent pattern of defendant having more expenses than income and most of those expenses coming from interest deductions. The returns of 1968 through 1973 were also shown on another chart which was used to compare the reported income with advances from Sovereign to defendant. The prosecutor's suggestion was the advances were not really loans (although defendant did pay large sums to Sovereign in June 1971, and July 1973, in repayment).\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e Further exploiting this evidence, on appeal the Attorney General argues at one point the defendant's reported 1968 income was \"ridiculously low.\"\n\nEvidence Code section 352 provides: \"The court in its discretion may exclude evidence if its probative value is substantially outweighed by the probability that its admission will (a) necessitate undue consumption of time or (b) create substantial danger of undue prejudice, of confusing the issues, or of misleading the jury.\"\n\nEvidence Code section 353 provides the test for an appellate court in reviewing the damage done by the admission of evidence. We have already applied that test in connection with the evidence of net worth.\n\nIn net worth prosecutions, prior tax returns have been held admissible to establish the taxpayer's starting net worth (United States v. Mackey (7th\n\nCir. 1965) 345 F.2d 499, 504-505, cert. den. 382 U.S. 824 [15 L.Ed.2d 69, 86 S.Ct. 54]) or to corroborate the taxpayer's net worth (United States v. Tunnell (5th Cir. 1973) 481 F.2d 149, 151, cert. den. 415 U.S. 948 [39 L.Ed.2d 563, 94 S.Ct. 1469]). In a specific items prosecution, prior tax returns were held admissible to rebut a taxpayer's contention certain income was unreported because he was unaware of how to complete the return and report it (United States v. Falk (7th Cir. 1979) 605 F.2d 1005, 1010, cert. den. 445 U.S. 903 [63 L.Ed.2d 319, 100 S.Ct. 1079]).\n\nIn a net worth case (Hamman v. United States (9th Cir. 1965) 340 F.2d 145, 149, cert. den. 380 U.S. 977 [14 L.Ed.2d 271, 85 S.Ct. 1339]) and in a specific items case (United States v. Coblentz (2d Cir. 1972) 453 F.2d 503, 505, cert. den. 406 U.S. 917 [32 L.Ed.2d 116, 92 S.Ct. 1766]), prior returns were held admissible to show the defendant's wilfulness. Both Hamman and Tunnell noted proper limiting instructions were given. In none of these cases was the prejudicial impact of the prior returns expressly weighed. In Coblentz, the prior returns showed the defendant had misstated his married status and his address in order to obtain tax advantages. Only in Hamman were the prior returns used to show a consistent pattern of underreporting of income. Other cases could be cited to indicate in general such a pattern is relevant to show wilfulness.\n\nThe question here is not whether they are probative, however, but whether they \"prove too much\" (cf. United States v. Waller (5th Cir. 1972) 468 F.2d 327, 328-329, cert. den. 410 U.S. 927 [35 L.Ed.2d 588, 93 S.Ct. 1358]). In two net worth cases which did consider the prejudicial impact of prior returns, the use of those returns resulted in reversible error. In United States v. Logan (6th Cir. 1969) 414 F.2d 230, when the taxpayer was prosecuted for filing false returns in 1961 and 1962, the government showed he had not filed any returns from 1946 through 1955. The court gave the jury a limiting instruction indicating this could show his intent. The appellate court reversed, nevertheless, stating (at p. 232): \"The likely effect of such evidence was to prejudice the jury against Appellant rather than to prove that he committed the crimes named in the indictment. We do not believe, moreover, that the Court's instruction to the jury to disregard this evidence was sufficient to take it out of the case. Evidence of prior wrongdoing is 'of a sort most likely to remain firmly lodged in the memory of the jury and to excite a prejudice which would preclude a fair and dispassionate consideration of the [case].'\"\n\nIn United States v. Colacurcio (9th Cir. 1975) 514 F.2d 1, when the taxpayer was prosecuted for filing false returns in 1967 and 1969, the government showed he had underreported income for 1965. The court concluded there was inadequate evidence he had received the income claimed in\n\n1965 (pp. 4-7) and then concluded because the government had relied heavily on the 1965 underreporting, it was prejudicial (pp. 7-8). See also United States v. Wilkins (4th Cir. 1967) 385 F.2d 465, at pages 468 to 471 (cert. den. 390 U.S. 951 [19 L.Ed.2d 1144, 88 S.Ct. 1043]), holding the government cannot charge deficiencies for prior years against income in present year, and questioning relevance of prior years where it is not a net worth case.\n\nReading other cases alone will not determine the prejudicial impact of evidence in any other case. As explained above in connection with the defense of discriminatory prosecution, the ultimate question (under Cal. Const., art. VI, § 13, as well as Evid. Code, § 353) is whether it is reasonably probable a result more favorable to the appealing party would have been reached absent admission of the evidence. The case law shows evidence of tax returns from uncharged years has a tendency to prejudice the jury and confuse the issues. The prosecution's closing argument did emphasize figures from the returns of uncharged years and suggested defendant committed tax fraud every year, not just in the years charged. Defendant was portrayed as a tax criminal, not a person on trial for committing particular tax crimes. Defendant moved for a mistrial after this closing argument and, while denying the motion, the trial court noted it may have been an error initially to admit the prior returns, but they were so \"interwoven\" in the case the prosecutor could not be faulted for relying on them.\n\nIn this lengthy case, however, it is no exaggeration to say that thousands of documents were brought to the jury's attention. Tax returns for uncharged years may be particularly important when a tax fraud case is being prosecuted, but we cannot say they tipped the balance and produced a verdict of guilt where there otherwise would have been an acquittal. In light of the evidence already recited above, we cannot say, absent the tax returns for prior years, a result more favorable to the defendant probably would have been reached. There was sufficient other evidence of the requisite specific intent. For example, despite advice from his tax preparers in 1971 that he would have to write checks in order to conclude the sale of stocks he had borrowed, it does not appear he ever did so. Also, the fiction of the bailments appears to have been adopted in order to avoid tax consequences.\n\nThis conclusion applies only to the circumstances of this particular case. The Attorney General argues on appeal the prior returns could be used to rebut an assertion the defendant was merely sloppy in his record-keeping or had inadvertently failed to report his income in the charged years. Falk, supra, 605 F.2d 1005, at page 1010, did permit prior returns to be used in the manner last mentioned. Ours was not a case where the taxpayer claimed\n\ninadvertence or ignorance of proper tax reporting procedure, however. Such evidence may more appropriately be confined to rebuttal, rather than prominently featured in the prosecution's opening presentation to the jury.\n\nThe Prosecutor Improperly Appealed to the Jury's Pecuniary Interest\n\nIn closing argument, the prosecutor described our tax reporting system as one of self-assessment, where the federal and state governments rely on the taxpayer to report on himself. He stated: \"Because of this self-assessment system, each one of us depends upon each other to fairly and honestly report his tax liability because to the extent that a person lies or cheats or otherwise does not report his true tax liability, that just increases the burden that you and I have as far as meeting the expenses of the Government.\"\n\nBy a strange coincidence, this argument was made on April 16, 1979, the day that year by which tax returns ordinarily should have been filed. Even apart from such timing, such an appeal to the jury's pecuniary interest is recognized as improper and prejudicial (United States v. D'Anna (2d Cir. 1971) 450 F.2d 1201, 1205-1206; Falk, supra, 605 F.2d 1005, 1012). In neither of these cases did the improper argument constitute reversible error, however. As in D'Anna, defendant did not object directly to this argument, although he did object to the following statement in the argument. We are required to ascertain whether a timely objection and admonition would have cured the harm (Green, supra, 27 Cal. 3d 1, 34). It is not easy to frame an instruction which might have \"unrung\" this bell. The prosecutor merely underscored what presumably at least some of the jury were already aware of, namely, a wealthy man had been able to pay less taxes than some of them had just paid. The next question is whether on the whole record the improper argument caused a miscarriage of justice (Green, supra, 27 Cal. 3d 1, 34). Again, we cannot say in light of the other evidence this is the case. As just noted, the prosecutor's argument was probably redundant coming on the day it did.\n\nThe Trial Court Failed to Instruct on a Lesser Included Offense\n\nRevenue and Taxation Code section 19401 is set out above (in fn. 20). It implicitly was recognized to define a necessarily lesser included offense of section 19406 in Kuhn, supra, 216 Cal. App. 2d 695, 696. A comparison of the statutes demonstrates this is the case. The difference is section 19406 requires action \"wilfully\" and \"with intent to evade any tax,\" while section 19401 speaks of action \"with or without intent to evade any requirement of this part or any lawful requirement of the Franchise Tax Board.\" Where a return is filed, section 19401 is violated where (1) defendant\n\nmakes a return (2) which is false. Intent is not an element of the offense (Kuhn, supra, 216 Cal. App. 2d 695, 698; Jones, supra, 149 Cal. App. 3d Supp. 41, 45).\n\nIt was well established at the time the instructions were given in this case that a trial court was obliged to instruct on lesser included offenses even where the defendant does not request such an instruction, unless defendant expressly objects as a matter of trial tactics (People v. Graham (1969) 71 Cal. 2d 303, 318-320 [78 Cal. Rptr. 217, 455 P.2d 153]; People v. Sedeno (1974) 10 Cal. 3d 703, 715-717 [112 Cal. Rptr. 1, 518 P.2d 913], disapproved on other grounds in People v. Flannel (1979) 25 Cal. 3d 668, 684-685, fn. 12 [160 Cal. Rptr. 84, 603 P.2d 1]). Indeed, the court stated: \"Counsel did advise me of case law requiring the Court, sua sponte, to instruct on lesser included offenses where applicable, without reference to the posture of Defense counsel as to tactics, applicability or otherwise, of any lesser included offense; and so I am conscious of the responsibility to give a properly applicable lesser offense instruction, regardless of the attitude taken by either the People or the defendant.\" Yet the court did not instruct the jury regarding the misdemeanor described by Revenue and Taxation Code section 19401.\n\nThe Attorney General makes several arguments why the failure to instruct on this lesser included offense was not an error or at least was not prejudicial. The trial court's reason for not giving the instruction was section 19401 made no sense, because it permitted a violation in a case where the defendant had no intent to evade but nevertheless signed a fraudulent return. The trial court apparently disregarded the possibility a return could be false without involving any criminal intent on the maker's part.\n\nThe Attorney General contends the issues which the instruction would have brought before the jury were in fact resolved under other instructions, so there was no prejudice to the defendant (see Sedeno, supra, 10 Cal. 3d 703, 721). More specifically, the conviction of theft for the 1973 transaction is inconsistent with a lack of intent to evade the tax law. Assuming defendant did have the fraudulent intent to steal by false pretenses Sovereign's assets in 1973, this hardly precludes a finding that in 1972, when the 1971 tax return was signed, the defendant did not intend to evade taxation. Moreover, it is possible defendant intended theft in 1973, but in 1974 did not intend to evade taxation on the theft. He could have reported the theft as income, and indeed did report the transaction as a sale generating interest income to him. It does not appear the theft conviction would have been inconsistent with a misdemeanor tax offense.\n\nThe Attorney General also argues defendant invited the error by a deliberate tactical objection to the instruction (see Graham, supra, 71 Cal. 2d 303, 318-320;\n\nPeople v. Wickersham (1982) 32 Cal. 3d 307, 330-335 [185 Cal. Rptr. 436, 650 P.2d 311]). Defense counsel stated their position was \"ambivalent\" regarding giving an instruction on Revenue and Taxation Code section 19401. He also stated the wording of the section \"leads only to confusion and contradiction.\" The trial court's statement just quoted tends to dispel the contention it was defense counsel's argument which dissuaded the court from instructing on section 19401. Defense counsel in our case certainly went further than did counsel in People v. Barraza (1979) 23 Cal. 3d 675, at pages 683 to 684 [153 Cal. Rptr. 459, 591 P.2d 947], where an erroneous instruction was held not to be invited by a failure to object to it, with counsel stating it was \"immaterial\" to him whether the instruction was given. However, it is arguable, counsel went further in People v. Newton (1970) 8 Cal. App. 3d 359, at pages 379 to 381 [87 Cal. Rptr. 394], where no invited error was found in the failure to give an instruction although defense counsel had dropped his request it be given. The court in Newton emphasized it did not appear the request for instructions had been withdrawn due to a \"deliberate tactical purpose.\" (Cf. People v. Finney (1980) 110 Cal. App. 3d 705, 711 [168 Cal. Rptr. 80].) In our case, it seems fairly clear from the trial court's statement it was the court's own determination to not give the instruction, although defense counsel certainly acquiesced in this course of action. The error was not invited within the limits of Graham, supra, 71 Cal. 2d 303, at pages 318 to 320.\n\nFinally, the Attorney General contends instructions on the lesser included offense were not required because there was no evidence the offense was less than that charged (e.g., People v. Osuna (1969) 70 Cal. 2d 759, 767 [76 Cal. Rptr. 462, 452 P.2d 678]). At the time the instructions were given in this case, it appeared the trial court had a duty to instruct on a lesser included offense unless there was no evidence to support a conviction on the lesser charge (e.g., Sedeno, supra, 10 Cal. 3d 703, 715, 720). Subsequently, the duty has been modified so an instruction is required only when the evidence supporting conviction of the lesser included offense is substantial enough that a jury reasonably could have convicted on the lesser charge (Wickersham, supra, 32 Cal. 3d 307, 324-325).\n\nThe Attorney General points out the defendant did not himself testify on his state of mind in engaging in the various charged transactions, the sales, bailments, or signing of the tax returns. The defense strategy was to establish through other witnesses the transactions were proper, not sham, and properly reported on the tax returns. It did develop from the testimony of some of the tax preparers, however, the transactions might have been reported differently. There was some evidence the transactions were characterized in a way which would reduce the tax consequences, but it also appears at least the sales were reported in some form. Thus, there is some\n\nevidence indicating defendant did not intend to entirely conceal them from the taxing authorities. While the returns were false if the sales were a sham, it does not necessarily follow from the fact the defendant intended to generate income by a sham sale that defendant further intended to conceal that income on his return. There was substantial evidence to warrant consideration by a jury that while defendant had filed false returns, he did not have the requisite wilfulness to sustain a felony conviction. \"The state has no interest in a defendant obtaining an acquittal where he is innocent of the primary offense charged but guilty of a necessarily included offense. Nor has the state any legitimate interest in obtaining a conviction of the offense charged where the jury entertains a reasonable doubt of guilt of the charged offense but returns a verdict of guilty of that offense solely because the jury is unwilling to acquit where it is satisfied that the defendant has been guilty of wrongful conduct constituting a necessarily included offense. Likewise, a defendant has no legitimate interest in compelling the jury to adopt an all or nothing approach to the issue of guilt. Our courts are not gambling halls but forums for the discovery of truth.\" (People v. St. Martin (1970) 1 Cal. 3d 524, 533 [83 Cal. Rptr. 166, 463 P.2d 390); People v. Geiger (1984) 35 Cal. 3d 510, 519-520 [199 Cal. Rptr. 45, 674 P.2d 1303].)\n\nThe jury deliberated for eight days before agreeing on a conviction of count one. They reported an impasse on the remaining counts. After being instructed to deliberate more, a guilty verdict on count two was rendered on the ninth day of deliberations, and guilty verdicts on the remaining counts were returned on the tenth day. It is certainly reasonably probable that had the jury been given another option on the tax fraud charges, namely, that provided by Revenue and Taxation Code section 19401, these protracted deliberations might have been shortcut. The Attorney General argues \"this was an all or nothing proposition.\" It was, doubtless, under the instructions given, but it should not have been. The defendant has a constitutional right to have the jury determine every material issue presented by the evidence (People v. Modesto (1963) 59 Cal. 2d 722, 730 [31 Cal. Rptr. 225, 382 P.2d 33], disapproved on other grounds in Flannel, supra, 25 Cal. 3d 668, 684-685, fn. 12; Geiger, supra, 35 Cal. 3d 510, 519).\n\nWas There a Failure to Instruct on Jury Unanimity Regarding the Several Charged 1971 Transactions ?\n\nDefendant contends because the prosecution contended there were several transactions which generated income to defendant in 1971, the trial court should have instructed the jury they had to agree unanimously on at least one of those transactions (e.g., People v. Diedrich (1982) 31 Cal. 3d 263, 280-283 [182 Cal. Rptr. 354, 643 P.2d 971]). People v. Madden (1981) 116 Cal. App. 3d 212, at pages 216 to 219 [171 Cal. Rptr. 897], adequately\n\nreviews the cases discussing the rule that requires jury unanimity when the defendant is charged in one count with several acts, any one of which could support a conviction. Defendant is unable to point out any California case factually similar to ours.\n\nThe case most similar factually to our own cited by defendant is United States v. O'Neill (E.D.Pa. 1979) 463 F.Supp. 1200. The defendant there was charged with making false statements in loan applications to a federal insured bank. He contended because he was charged with making two false statements in an application, he was actually charged with two offenses in the same count (pp. 1201-1202). While the court rejected this contention that two offenses were being charged, it did indicate it would charge the jury, before defendant could be convicted of such a count, it had to agree unanimously on at least one of the alleged misrepresentations (p. 1205).\n\nThe parallel to our case does not aid defendant, however. O'Neill, supra, 463 F.Supp. 1200, 1203-1204, also indicates the pair of representations was made in the course of a single fraudulent transaction which was the target of the federal statute. It is clear the making of a number of false statements to a lending institution in a single document constitutes only one criminal violation (United States v. Mangieri (D.C.Cir. 1982) 694 F.2d 1270, 1281).\n\nDefendant misses the point that it is not the receipt of income which is the target of our tax fraud statutes. Instead, it is the failure to report the income which constitutes the violation. The receipt of the income in our case is not a separately chargeable offense, but only a method of proving an element of the offense, namely, the underreporting of income. (Cf. People v. Kent (1981) 125 Cal. App. 3d 207, 213 [178 Cal. Rptr. 28].)\n\nThe prosecution is not required to establish exactly how much income was not reported (United States v. Marcus (2d Cir. 1968) 401 F.2d 563, 565, cert. den. 393 U.S. 1023 [21 L.Ed.2d 567, 89 S.Ct. 633]; United States v. Wilson (3d Cir. 1979) 601 F.2d 95, 99). The prosecution is not required to prove each act of tax evasion alleged, so long as there is one act proved to violate the statute (United States v. Mackey (7th Cir. 1978) 571 F.2d 376, 387). In United States v. Shelton (9th Cir. 1978) 588 F.2d 1242, defendant contended the jury should have been required to determine which of six items constituted income to him. The court rejected this contention, holding so long as the jury agreed a substantial amount of income was unreported, that was enough (p. 1251).\n\nThe act which violated our tax fraud statutes was the signing of a tax return which was false with the requisite intent described above. There was only one act of signing, and the jury need not have agreed in which way\n\nthe return was false, any more than it would have had to find the exact amount of income unreported. In any event, there is no question in our case the 1971 transactions took place; the issue at trial was how they should be characterized.\n\nOther Contentions\n\nIn addition to the other instances of claimed prosecutorial misconduct already discussed above (e.g., in fn. 44), defendant has identified at least 20 more instances of alleged misconduct. The industry of counsel is apparent and admirable. It would, however, unduly protract this already lengthy opinion beyond any reasonable, readable limits to even summarize, let alone discuss, each of them. Some of them are cases in which defendant successfully objected. In others, no objection was made (Green, supra, 27 Cal. 3d 1, 34). The ultimate question as to each and all of them is whether the questions and argument by the prosecutor caused a miscarriage of justice (ibid.). None of them strike us as having that consequence.\n\nDefendant makes an argument he was denied due process of law or at least the trial court abused its discretion in allowing the prosecution to attempt to prove there was \"theft income\" from the \"sham\" transactions in 1971. The argument is based on the trial court's comments made in the course of denying defendant's Penal Code section 995 motion regarding the 1971 counts. The trial court indicated there did not appear to be probable cause to find \"theft income\" in 1971, although there may have been an \"economic benefit.\" Since there would have been no collateral estoppel effect if these counts had been dismissed on this basis, the court's statements in not dismissing them did not preclude the prosecution from introducing other evidence at trial that was not before the grand jury or the court upon the Penal Code section 995 motion (People v. Patrick (1981) 126 Cal. App. 3d 952, 969 [179 Cal. Rptr. 276]).\n\nIV\n\nI would reverse Smith's conviction of theft (count five) because it was based on a legally incorrect theory. As noted below, however, that result is not shared by the other members of the panel. With the concurrence of my colleagues, we conclude the jury should have been instructed on the possibility of finding defendant guilty of a tax misdemeanor for the years 1971 and 1973, instead of facing as the only alternative conviction of tax felonies or acquittal under counts one to four.\n\nAccordingly, Smith's convictions of tax fraud are affirmed as misdemeanor violations of Revenue and Taxation Code section 19401 for the years 1971 and 1973 and the cause is remanded for resentencing unless within 30 days of the issuance of the remittitur the People file a written demand for a new trial on these counts. If such demand is filed, a new trial shall take place.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e\n\nDisposition\n\nAccordingly, Smith's convictions of tax fraud are affirmed as misdemeanor violations of Revenue and Taxation Code section 19401 for the years 1971 and 1973 and the cause is remanded for resentencing unless within 30 days of the issuance of the remittitur the People file a written demand for a new trial on these counts. If such demand is filed, a new trial shall take place.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e\n\nWORK, J., Concurring and Dissenting. We concur in the results reached in sections I and III of the lead opinion for the reasons generally expressed by our colleague but cannot accept the rationale or result found in section II, that portion discussing Smith's theft conviction. For the following reasons, we find substantial evidence supports that verdict and affirm the theft conviction.\n\n(See fn. 1.) Embezzlement, as the jury was instructed, is defined in Penal Code section 506 essentially as follows: Every person entrusted with or having in his control property for the use of another person, who fraudulently appropriates it to any use or purpose not in the due and lawful execution of his trust is guilty of embezzlement.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nSmith argues on appeal, the July 17, 1973, transaction between himself and Sovereign was a sale and payment of the $8.9 million to Smith was the sales price, and his conviction must be overturned because, even though Sovereign may not have received the property it purchased, the theft (if any) was by false pretenses, not embezzlement.\n\nThe prosecution relied solely on an embezzlement theory and argued the evidence proved beyond a reasonable doubt that no sale was intended and Smith directed the disbursement of the $8.9 million to himself with the specific intent to defraud Sovereign, and steal the money. However, the prosecution gave the jurors an alternative: should they find the July 17, 1973, transaction to be a sale, then Smith, in control of Sovereign assets,\n\nwould be Sovereign's fiduciary as to the Padre debts evidenced by the surplus certificates and unsecured advances. Thus, when he received partial payment on those debts in February 1974, Smith would have embezzled those funds by breaching that fiduciary relationship and using them as his own. The jury was instructed it could find Smith guilty of either the 1973 or the 1974 theft, but not both.\n\nThe jury resolved these alternatives by finding \"no sale,\" and convicted Smith for the July 1973 embezzlement. The lead opinion concedes it was a sham sale. Substantial evidence supports that conclusion and the conviction.\n\nSmith's state of mind at the time he ordered Sovereign to give him $8.9 million was a fact question for the jury. It found his intent was to steal, not sell, and unless the record read as a whole lacks substantial evidence to allow a reasonable person to so find beyond a reasonable doubt, it is conclusive on appeal. (People v. Green (1980) 27 Cal. 3d 1, 55 [164 Cal. Rptr. 1, 609 P.2d 468]; People v. Norris (1950) 99 Cal. App. 2d 658, 661-662 [222 P.2d 283].)\n\nIt is conceded by the defense, and corroborated by overwhelming evidence, that Smith totally controlled, directed and managed all Sovereign activities directly, or through figureheads, mainly Phillip Toft. Neither Smith nor Toft was a director, shareholder, officer or employee of Sovereign, thus further obscuring their role as far as the public record would appear.\n\nIn reviewing the relevant evidence supporting the jury finding that Smith never intended to sell his Padre receivables to Sovereign, we look to the relevant history of similar Smith transactions presented by the evidence, and to evidence of the \"Smith connection\" with each business entity involved.\n\nThe myriad of Smith-owned and controlled entities were structured in a tier system, with several corporations nominally controlling numerous subsidiary entities, and others primarily holding assets. From at least 1963 through May 1973, (when Smith and each entity entwined in his labyrinthine business empire were prohibited from further dealings in USNB stock) the expansion and maintenance of Smith's business domain required massive infusions of borrowed monies.\n\nBecause Smith was the controlling shareholder in USNB, and also controlled its lending activities, he was prohibited from personally borrowing from the bank. However, as the holder of a substantial amount of USNB stock and in control of substantial blocks of shares held by his family and\n\nother entities, Smith was able to borrow millions of dollars from third party lending institutions, pledging these shares as collateral. At the same time he also borrowed monies from corporations he secretly controlled, after they had borrowed the monies from third parties. These included funds borrowed directly from USNB or from third party lenders leveraged by USNB letters of credit guaranteeing repayment. Smith's loans were duly listed on the books of the lending entity, bore interest and, from time to time, were repaid. Thus, to the casual auditor, these were arm's-length transactions between Smith and facially independent lenders.\n\nStructuring his business entities in this tier system gave Smith certain advantages. First, he could hide his identity as the person actually controlling subsidiary entities by listing his agents and employees as directors and officers. In this manner Smith passed borrowed funds through supposedly independent corporations into Sovereign and other Smith-controlled entities, which then were distributed to him personally in the form of loans. These flow-through monies were obtained in large part by borrowing from USNB, which Smith and his family could not do directly. Further, because of banking regulations, USNB could not loan any single entity more than 10 percent of USNB's unimpaired capital. (A corporation and all its subsidiaries are treated as single entity for this purpose.) However, Smith maneuvered USNB loans directly to individual subsidiary corporations without disclosing its parent, so that each subsidiary was able to obtain loans up to that single limit. (Thus, theoretically, a corporation having 20 subsidiaries could obtain funds totaling 200 percent of USNB's legal lending limit.) Smith, directly managing USNB, thus skirted banking regulations. To avoid detection he ordered funds be transferred between subsidiary, parent corporation, himself and lenders in a manner to disguise the fact it was the same money being moved.\n\nAccording to Sovereign's comptroller (Schroeder), Smith and Toft made all decisions for Sovereign. In 1971, Sovereign listed 15 to 20 subsidiary companies. By 1973, it had divested itself of all but one and was primarily an asset-holding corporation through which millions of dollars borrowed by other Smith-controlled subsidiaries were funneled for distribution.\n\nIn context of the background stated above, we address the specifics of the embezzlement scheme: By 1965 Smith needed cash, but his personal ability to borrow -- through arm's-length transactions -- was essentially foreclosed because all USNB stock he controlled was pledged to secure outstanding loans. He devised a simple embezzlement scenario which proved so successful he employed at least three times thereafter, including the July 1973 theft of which he stands convicted: Smith ordered the comptrollers of corporations he owned to disburse millions of dollars to him under the guise\n\nof fictitious sales. These disbursements were listed on the books of the disbursing corporation as the purchase price for blocks of USNB stock (usually at a value considerably in excess of its actual worth). However, the shares supposedly \"purchased\" were never transferred to the disbursing corporation, and were either totally pledged to third parties as security for Smith's loans which were still outstanding, or consisted of shares which Smith did not own. (One transaction involved a supposed \"purchase\" of shares the \"purchaser\" already owned.) Thus:\n\nIn December 1965, Smith obtained $1.85 million from one of his secretly controlled corporations, United States Holding Company of California.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e U.S. Holding recorded the transaction as a purchase of 50,000 USNB shares. No shares were delivered and Smith continued to treat them as his own, pledging them to secure additional personal debts once the obligations for which they were secured at the time he obtained the money from U.S. Holding, were paid. (In fact he transferred ownership of 8,500 of these shares to other entities in 1971.) Smith used the U.S. Holding money to repay his outstanding loan to it, including a $104,000 interest payment for which he took a tax deduction, reducing his tax liability. This transaction was not reported to the comptroller of currency as would have been necessary had there been an actual sale of USNB shares.\n\nIn March 1971, Smith engaged in a similar scam by obtaining $2.3 million through a corporation known as Missouri Western which he secretly controlled.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e (On March 3, 1971, Smith had written a letter to a firm of attorneys certifying neither he nor his family had any \"ownership interest or control, directly or indirectly\" in Missouri Western. However, one month later Smith told a Chemical Bank representative that Missouri Western was one of his companies and he wished to borrow $2 million in Missouri Western's name rather than his own, which he would collateralize personally with USNB stock.)\n\nIn any event, in March 1971, Smith facially agreed (with himself) to sell 79,000 shares of USNB stock to Missouri Western in exchange for the $2.3 million. Although he received the $2.3 million, which was funneled through\n\nMissouri Western from Sovereign (Sovereign listed the transaction on its books), no shares were ever transferred. Again, 13,000 of these shares were not even owned by Smith and most or all were pledged to secure other Smith loans or those of entities controlled by him. Smith used the money to repay a personal loan and interest, this time to Sovereign, again taking a tax deduction on the interest paid.\n\nIn June 1971, Sovereign (at Smith's direction) disbursed $5.3 million to Smith and recorded the disbursement as the purchase price for 161,000 shares of his USNB stock having a market value of $25 to $26 per share. (The purported \"sale\" price to Sovereign was an inflated $33 per share, a price Smith arbitrarily set and ordered Sovereign to disburse in order to obtain enough cash to satisfy his immediate need.) Smith used $2.59 million to reduce his outstanding loan obligation to Sovereign and pay interest for which he took a tax deduction. Again the transaction was not reported to the comptroller of currency, no shares were transferred and Smith continued to deal with them as his own. (For instance, 24,000 shares were already pledged to Crocker Bank and, when that loan was paid in December 1971, Smith used them to collateralize his personal loan with the Bank of California. In 1973 when the Bank of California was paid, Smith pledged them to the Franklin National Bank for another personal loan.)\n\nIn July 1973, Smith needed another tax deduction and owed Sovereign $9 million on various loans, but now the May 1973 cease and desist order precluded him from dealing with USNB stock. Having had remarkable success with the sham-sale ploy (more than $9 million of unreported income to date) Smith retained the same script but turned to the Padres, his only other large unencumbered asset to \"sell.\"\n\nSmith was the sole beneficial owner of the San Diego Padres Baseball Team and had advanced millions of dollars to the franchise. Some loans were evidenced by six documents entitled \"surplus certificates\" and others were unsecured shareholder advances. Those debts evidenced by the surplus certificates could only be paid from the net equity of the Padres after liquidating all other secured and unsecured debts. Although subordinate to all other creditors, the surplus certificates had priority over all shareholder equity. From at least 1969 through 1972 the Padres had a very questionable net worth and, according to their terms, no debts evidenced by the surplus certificates legally could have been paid.\n\nThe total advances covered by six certificates was approximately $7.9 million. Smith, although a director of the Padres, was not its officer or employee, however, his total control is reflected in the corporate resolutions and minutes of November 13, 1972, when Smith told the Padres' directors\n\nthat he had previously obtained repayment of $3,775,000 to retire some of the surplus certificates. Although these payments violated the Padres' promise to subordinate its obligations to Smith to those it owed to all other creditors, the directors \"ratified\" this already accomplished act.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nAs of July 1973 the Padres owed Smith $4.12 million \"secured\" by the surplus certificates and another $4.75 million in shareholder advances. Smith's chances of obtaining payment from the Padres of more than one-half of this debt was nil because he had agreed to sell the Padres for a total of $12 million subject to priority claims of $3,204,417 to Chemical Bank, $345,000 on the baseball sale accounts and $3.75 million of other obligations which had to be assumed by the buyer. Thus, Smith knew at best a future Padre sale could only generate slightly over $4 million to himself. As chairman of the board of directors, vice president, treasurer and assistant secretary of the Padres, Toft also knew this fact.\n\nUndeterred, consistent with his course of dealings though the years, Smith ordered Toft to have Sovereign issue Smith a check for an amount equal to the total Padres' indebtedness to him, plus interest. At Toft's direction, Schroeder issued a check to Smith for $8.9 million. Neither Smith nor Toft discussed the transaction with Schroeder\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e or any director, officer, shareholder or representative of Sovereign. Although Smith's memorandum to Toft dated July 9, 1973, stated: \"We can then write to the Padre organization and tell them I have sold these notes to Sovereign State Capital and endorse them over so they can change the records accordingly,\" this was never done. Smith never transferred the surplus certificates or his interest in the Padre advances to Sovereign.\n\nTherefore, on July 17, 1973, Sovereign started the day with assets of more than $18 million; at least $8.9 million cash, and receivables from Smith in excess of $9 million. When it gave $8.9 million to Smith it reduced its cash by that amount but still held $9 million in his accounts receivable. Later that same day, Smith gave Sovereign his personal checks for $8.9 million, reducing Sovereign's accounts receivable from him accordingly. Thus, by the end of the day Sovereign was in the same cash position as when the day began, but now held only Smith's alleged promise to deliver paper receivables from the Padres. Smith obtained a sizeable tax deduction\n\nbecause of the interest payment to Sovereign which he used to offset a substantial tax liability, and he reduced his real indebtedness by $8.9 million without showing any income or having to borrow.\n\nThat Smith never intended to sell or transfer his interest in the surplus certificates or other indebtednesses owed him by the Padres is evident. On June 22, 1973, he wrote City Bank (ex. 3-42) stating he would receive $9 million from the sale of the Padres which he would use to satisfy his personal indebtedness to that bank. On July 3, 1973, one of Smith's representatives (Woltman) wrote First National Bank of New Jersey to the same effect, except accurately stating Smith would get only $4 to 5 million (ex. 15-12). On August 21, 1973, a month after taking Sovereign's $8.9 million, Smith told the Bank of Wichita he was selling the Padres and would use the proceeds to satisfy his obligation to that bank (ex. 17-121). On August 20, 1973, Smith made the same promise to the Valley National Bank (ex. 16- 115), and on December 8, 1973, he told Massachusetts Mutual he would use these funds to pay his account with it (ex. 5-10). Further, on February 9, 1974, Smith signed an agreement with the Internal Revenue Service, the Padres and others certifying he still owned the Padre obligations \"secured\" by the surplus certificates as well as those incurred through shareholder advances. Based upon this certification, Smith was credited with the monies received from the sale of the Padres, and they were used to satisfy his personal obligations.\n\nIn sum, substantial evidence shows Smith never intended to sell his interest in the surplus certificates or other Padres receivables he held. The letters both immediately before and after July 17, 1973, state his clear intent to retain them and to use the monies received for his personal obligations, and he ultimately did just that. Further, the jury was entitled to consider the two 1971 transactions and the 1965 transaction, where he obtained money through similar sham sales without exchanging anything for the monies received, as competent evidence of his common scheme and intent. (Evid. Code, § 1101, subd. (b).) It is apparent he did not intend to sell the Padres receivables to Sovereign. No person testified Smith intended to sell the Padre obligations to Sovereign or that Sovereign intended to buy them. On appeal, as at trial, Smith points only to entries in Sovereign's accounting books stating a sale occurred or was intended. On these facts, we are understating when we hold the jury could reasonably find beyond reasonable doubt these entries did not reflect the truth.\n\nThe Trial Court Correctly Instructed the Jury on Elements of Embezzlement\n\nSmith meritlessly argues the trial court failed to tell the jury \"there is a difference between a mere violation of a trust and the fraudulent appropriation\n\nwhich constitutes embezzlement.\" The court instructed: \"The theft which is known as embezzlement consists of the fraudulent appropriation of money or other property by a person to whom it has been entrusted.\n\n\"The law says that every trustee or agent or other person who may be entrusted with the property of another, or such person who may have in his control property of another, who fraudulently appropriates it to any use or purpose not in the due and lawful execution of his trust is guilty of theft by embezzlement.\n\n\". . . .\n\n\"Theft known as embezzlement consists of the fraudulent appropriation of money or other property by a person to whom it has been entrusted.\n\n\"The law prescribes that every trustee or agent or other person entrusted with the property of another, or having in his control the property of another, who fraudulently appropriates it to any use or purpose not in the due and lawful execution of the trust is guilty of theft by embezzlement. [The foregoing points were stated twice because the court wanted to be sure the jurors had sufficient opportunity to take notes.]\n\n\"The essential elements of embezzlement are:\n\n\"The fiduciary relation -- Well, fiduciary relation arising where one person entrusts his property to another -- and, parenthetically, now, you remember, I said 'person' and 'corporation,' I was going to use as meaning the same thing -- and the fraudulent appropriation of the property by the latter. Those are the essential elements.\n\n\"In this instance, we define fraud as any act that involves a breach of duty or breach of trust or breach of confidence, and which is injurious to another.\n\n\"Such a breach of trust and injury to another person occurs in a case in which an officer of a corporation, or an agent of a corporation who is entrusted with the money and property of that corporation uses the money or property knowingly and intentionally for his own purposes, in violation of that trust.\n\n\"Any such fraudulent appropriation of funds or property held in trust constitutes embezzlement, whether there is a direct personal benefit or not, as long as the owner is wrongfully deprived of his money or property.\n\n\". . . .\n\n\"To constitute embezzlement, it is not necessary to show actual physical possession of the money or the property. It is sufficient to show that while the defendant was not in actual possession of the money, it was under his control in the sense that it was under his direction and management.\n\n\"One of the essential elements of embezzlement that I spoke to you about two or three minutes ago is fraudulent intent.\n\n\"Evidence of secrecy or concealment may be considered evidence of fraudulent intent. Lack of secrecy or concealment may be considered to tending to negate any fraudulent intent. However, there may be embezzlement where the appropriation is openly made and, consequently, without concealment.\" (Italics added.)\n\nEarlier the court had advised the jurors: \"in count five, for instance, the charge is that on or about July 17, 1973, C. Arnholt Smith did unlawfully take and steal personal property of Sovereign State Capital . . . .\" This hammers home that the gist of the charge is stealing Sovereign's property, requiring an appropriation, not just an injury in a civil sense.\n\nWhen the embezzlement instructions were read to the jurors, they were specifically related to the theft charges. The court dealt separately with the tax counts and identified those instructions relating to those counts. The court later again separately instructed the jurors regarding the theft charges as follows: \"Count five charges a theft from Sovereign State Capital in 1973; . . .\n\n\"So, count five charges the 1973 theft from Sovereign State Capital . . . .\" (Italics added.)\n\nWhile instructing the jury solely in relation to the theft charges, the court discussed specific intent. After giving the general CALJIC preamble, the court stated, \"In the crime of theft by embezzlement, the necessary specific intent that we have talked about is the intent fraudulently to appropriate property of another in violation of the trust.\" Thus, the trial court scrupulously avoided any instructional overlapping between the type of trustee breach of trust which might result in some noncriminal obligation to the beneficiary, and that which subjects a fiduciary to criminal sanctions. The trial court repeatedly stated there had to be a theft of property and that Smith was charged with stealing Sovereign's money. The term fraudulent appropriation was used in that context. The jurors could not have been misled as happened in the case Smith cites, People v. Whitney (1953) 121 Cal. App. 2d 515, 521\n\n[263 P.2d 449], where this court found error in instructions which implied that any conversion of trust property would establish a criminal embezzlement, language carefully avoided by the trial court here.\n\nThe Evidence Does Not Support a Jury Instruction That Smith's Good Faith When Personally Dealing With His Controlled Corporations Was a Defense to Theft\n\nSmith argues the trial court was obligated to instruct the jury it could not find him guilty of embezzlement if he acted in good faith. He did not request such an instruction relating to the theft counts and, insofar as the tax convictions are predicated on income be generated through theft, the jury was instructed that his good faith belief he had paid all the income taxes owed would be a defense to tax fraud.\n\nOn the theft counts, the trial court had no sua sponte duty to instruct on defenses not raised by the defense or supported by substantial evidence. (People v. Sedeno (1974) 10 Cal. 3d 703, 716 [112 Cal. Rptr. 1, 518 P.2d 913].) Smith did not defend the 1973 Sovereign embezzlement charge on the ground he acted in good faith. Unlike the defendant in People v. Stewart (1976) 16 Cal. 3d 133 [127 Cal. Rptr. 117, 544 P.2d 1317], no one testified to any fact which would imply Smith acted in good faith if the transaction was found not to be a sale. His sole defense was that it was a sale.\n\nFurther, there is no substantial evidence in the record to support a defense of good faith. We reject Smith's claim that evidence he had the ability to control, manage and direct the flow of assets into and from Sovereign implies that when he openly withdrew funds he acted in good faith. In spite of his efforts to equate his conduct with the acts committed by the defendant charged with embezzlement in People v. Stewart, supra, he cannot do so. In Stewart, the Supreme Court held that one who testified he withdrew his employer's funds for his personal use from time to time because he had been told by his employer he was permitted to do so, and made no attempt to conceal these withdrawals and that they were for his personal use, put the trial court on notice of facts sufficient to trigger its duty to instruct on the good faith defense, even in the absence of a request. Here, no evidence suggests Smith ever believed he had permission to withdraw Sovereign assets for his personal use, nor does he claim such authority. He, in fact, denies he did so. To the contrary, he carefully orchestrated each disbursement to insure that a cursory auditor would believe the transactions were legitimate sales. Unlike Mr. Stewart, C. Arnholt Smith took great pains to make the transaction appear to be a sale rather than a withdrawal for personal use. He was not entitled to an instruction on the defense of good faith.\n\nWe affirm the conviction for theft as charged in count five concurring with the lead opinion as to the manner of treatment of the tax fraud convictions.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nDisposition FOOTNOTES\n\n49 As recently stated in People v. Alexander (1983) 140 Cal. App. 3d 647, at page 666 [189 Cal. Rptr. 906]: \"An appellate court is not restricted to the remedies of affirming or reversing a judgment. Where the prejudicial error goes only to the degree of the offense for which the defendant was convicted, the appellate court may reduce the conviction to a lesser degree and affirm the judgment as modified, thereby obviating the necessity for a retrial. (See Pen. Code, § 1260; People v. Harris (1968) 266 Cal. App. 2d 426, 434-435 [72 Cal. Rptr. 423.] Such a modification of judgment is appropriate where there was error in failing to instruct on lesser included offenses but the evidence clearly establishes guilt of a lesser degree of the offense for which he was convicted. (People v. Bailey (1974) 38 Cal. App. 3d 693, 700 [113 Cal. Rptr. 514].)\"\n\n\u003cspan class=\"fn\"\u003e1. The transcript of the trial alone amounts to almost 15,000 pages. Remarkably, these marathon proceedings involved presentation only of the prosecution's case-in-chief. Defendant's complex business world was explored in elaborate detail. This trial has led to over 200 pages of appellate briefing on each side. We regret not reaching every argument made, but it simply is not necessary.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. People v. Superior Court (Hartway) (1977) 19 Cal. 3d 338, 347-354 [138 Cal. Rptr. 66, 562 P.2d 1315]; In re Elizabeth G. (1975) 53 Cal. App. 3d 725, 730-733 [126 Cal. Rptr. 818]; People v. Sperl (1976) 54 Cal. App. 3d 640, 656-657 [126 Cal. Rptr. 907], cert. den. 429 U.S. 832 [50 L.Ed.2d 97, 97 S.Ct. 95]; People v. Serrata (1976) 62 Cal. App. 3d 9, 24-25 [133 Cal. Rptr. 144, 84 A.L.R.3d 952]; People v. Garner (1977) 72 Cal. App. 3d 214, 216-218 [139 Cal. Rptr. 838]; Lyons v. Municipal Court (1977) 75 Cal. App. 3d 829, 843-845 [142 Cal. Rptr. 449]; People v. Battin (1978) 77 Cal. App. 3d 635, 666-670 [143 Cal. Rptr. 731, 95 A.L.R.3d 248], cert. den. 439 U.S. 862 [58 L.Ed.2d 171, 99 S.Ct. 183]; People v. Milano (1979) 89 Cal. App. 3d 153, 163-165 [152 Cal. Rptr. 318]; People v. Blend (1981) 121 Cal. App. 3d 215, 229-230 [175 Cal. Rptr. 263]; People v. Smith (1981) 122 Cal. App. 3d 581, 593 [176 Cal. Rptr. 73]; People v. Ala Carte Catering Co. (1979 98 Cal. App. 3d Supp. 1, 10 [159 Cal. Rptr. 479]; People v. Jones (1983) 149 Cal. App. 3d Supp. 41, 47-48 [197 Cal. Rptr. 273] [the only income tax prosecution involving this defense]. Even those cases which recognized the availability of this defense, pre- Murgia (Murgia v. Municipal Court (1975) 15 Cal. 3d 286, 301, fn. 10 [124 Cal. Rptr. 204, 540 P.2d 44]), did not sustain a finding of discriminatory prosecution. (See Annot., What Constitutes Such Discriminatory Prosecution or Enforcement of Laws as to Provide Valid Defense in State Criminal Proceedings, 95 A.L.R.3d 280, § 2(a), pp. 288-289; see also Annot., What Constitutes Such Discriminatory Prosecution or Enforcement of Laws as to Provide Valid Defense in Federal Criminal Proceedings, 45 A.L.R. Fed. 732, § 2(a), p. 738; Annot., Comment Note -- Preconviction Procedure for Raising Contention That Enforcement of Penal Statute or Law is Unconstitutionally Discriminatory, 4 A.L.R.3d 404.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Murgia, supra, 15 Cal. 3d 286; Griffin v. Municipal Court (1977) 20 Cal. 3d 300 [142 Cal. Rptr. 286, 571 P.2d 997]; Bortin v. Superior Court (1976) 64 Cal. App. 3d 873 [135 Cal. Rptr. 30]; People v. Municipal Court (Street) (1979) 89 Cal. App. 3d 739 [153 Cal. Rptr. 69], cf. People v. Superior Court (Lyons-Buick-Opel-GMC, Inc.) (1977) 70 Cal. App. 3d 341 [138 Cal. Rptr. 791]; Robinson v. Superior Court (1978) 76 Cal. App. 3d 968, 981-983 [143 Cal. Rptr. 328]; Perakis v. Superior Court (1979) 99 Cal. App. 3d 730 [160 Cal. Rptr. 445].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. All statutory references are to the Evidence Code unless otherwise specified.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The burden of proof related errors in People v. Serrato (1973) 9 Cal. 3d 753, 766- 767 [109 Cal. Rptr. 65, 512 P.2d 289], disapproved on other grounds in People v. Fosselman (1983) 33 Cal. 3d 572, 583, footnote 1 [189 Cal. Rptr. 855, 659 P.2d 1144], and People v. Takencareof (1981) 119 Cal. App. 3d 492, 497-500 [174 Cal. Rptr. 112], are sufficiently different that they need not be further examined in our determination of whether the error involved in our case is reversible.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. In numerous other cases, appellate courts have reviewed the evidence to find a defense of discriminatory prosecution was not made out. See footnote 2 above.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Hartway, supra, 19 Cal. 3d 338, 351, does contain unfortunate implications to the contrary, but only in the context of an alternative holding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. This should be qualified by noting a political party which engages in criminal activity is not immunized from prosecution (Murgia, supra, 15 Cal. 3d 286, 303, fn. 14).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The third argument made by defendant (actually the first in his brief) is basically a series of attacks on the verdict, suggesting it is not supported by the evidence. One point made is the defendant could not have embezzled through documented transactions. But People v. Talbot (1934) 220 Cal. 3 [28 P.2d 1057], observed (at p. 13): \"While secrecy or concealment is evidence of a criminal or felonious intent, nevertheless there may be embezzlement where the appropriation is openly made and consequently without concealment.\" Another point made is defendant did not personally benefit from the transactions, but his \"family\" of corporations did. In People v. Pierce (1952) 110 Cal. App. 2d 598, at page 609 [243 P.2d 585], a similar argument was rejected: \"Any diversion of funds held in trust constitutes embezzlement whether there is direct personal benefit or not as long as the owner is deprived of his money.\" Another point made is the assets of the corporation were all his own in reality. This is discussed below under the heading \"A person cannot embezzle from himself.\" Another point is all the transactions were authorized or ratified by officers of the corporation. Moreover, the Internal Revenue Service approved of the disposition of the proceeds of the sale of the Padres, and arguably was aware Sovereign should have received some of them. This branch of the evidence goes to the defense of good faith provided by Penal Code section 511 (e.g., People v. Stewart (1976) 16 Cal. 3d 133, 139-142 [127 Cal. Rptr. 117, 544 P.2d 1317]). The establishment of this defense is a question for the trier of facts (People v. Proctor (1959) 169 Cal. App. 2d 269, 276 [337 P.2d 93]).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. See Annotation, Conversion by Promoter of Money Paid for a Preincorporation Subscription for Stock Shares as Embezzlement, 84 A.L.R.2d 1100.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Defendant also cites in support of this argument United States v. Goldberg (3d Cir. 1964) 330 F.2d 30, 39 (cert. den. 377 U.S. 953 [12 L.Ed.2d 497, 84 S.Ct. 1630]), and Davis v. United States (6th Cir. 1955) 226 F.2d 331, 335 (cert. den. 350 U.S. 965 [100 L.Ed. 838, 76 S.Ct. 432]). Both cases indeed indicate an individual's taking of funds from his wholly owned corporation is not embezzlement, relying on Kann v. Commissioner of Internal Revenue (3d Cir. 1953) 210 F.2d 247 (cert. den. 347 U.S. 967 [98 L.Ed. 1109, 74 S.Ct. 778]), and United States v. Augustine (3d Cir. 1951) 188 F.2d 359 (cert. den. 342 U.S. 815 [96 L.Ed. 616, 72 S.Ct. 29]). Neither Kann nor Augustine so states, and in fact Kann indicates that under applicable state law, \"it would seem to be possible for the proprietor of a one-man corporation to be guilty of embezzlement if he diverted corporate monies to his own pocket without the formality of declaring dividends\" (210 F.2d 247, 251). Reliance on any of these cases is ill-founded for a more important reason. None of them involved embezzlement prosecutions. Augustine, Davis and Goldberg were federal tax evasion prosecutions, and Kann was a civil tax fraud case. In each of them, the taxpayer argued he had embezzled because Commissioner of Internal Revenue v. Wilcox, (1946) 327 U.S. 404 [90 L.Ed. 752, 66 S.Ct. 546], had established embezzled funds were not income. Wilcox was overruled by James v. United States (1961) 366 U.S. 213, 222 [6 L.Ed.2d 246, 255, 81 S.Ct. 1052], as noted in Goldberg, supra, 330 F.2d 30, 39. In Goldberg, the only post- James case, the statement about embezzlement is preceded by the observation: \"[It] is not this Court's province to differentiate legal issues between the appellant and his corporations, yet even so, it has been held that a defendant cannot be guilty of embezzlement of funds from his wholly owned corporations.\" As appears from the discussion above, more relevant authority says otherwise. Davis and similar cases were distinguished on this basis in State v. Harris (1960) 147 Conn. 589 [164 A.2d 399, 402].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. This is not to say the law cannot see through a sham exchange. For example, in Leonard, supra, 106 Cal. 302, 313-314, when defendant claimed he had obtained corporate funds in exchange for his promissory note, the court found embezzlement when he knew the note which he gave was worthless. In People v. Fronk (1927) 82 Cal. App. 465, 472 [255 P. 777], when a bank officer issued a cashier's check in exchange for personal checks which he knew to be worthless, embezzlement was found. The difference from our case is the defendant here did not receive the check as an officer or agent, as the discussion explains. Moreover, the Padres' obligations were not worthless, although not perhaps worth the price paid.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. This is not to say there was no embezzlement on our facts. Indeed, the prosecution in its closing argument pinpointed the embezzlement in several ways, including, \"it wasn't Sovereign that got the monies that were paid on the surplus certificates and the advances; the monies went to the benefit of C. Arnolt Smith.\" Under the apparent contract of sale, defendant promised to deliver the proceeds of these securities to Sovereign. So long as he held them, he held them in trust (see Pen. Code, §§ 504a, 506a). This embezzlement took place in February 1974, when he diverted the proceeds of the sale of the Padres to his creditors. This was charged in the alternative as count 7, on which defendant was acquitted. A theft conviction will not be affirmed by an appellate court on a theory at variance with that suggested to the jury as a basis for conviction (see People v. Abbott (1932) 132 Cal. App. 109, 112-114 [22 P.2d 566]).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. This language must be reconciled with the rule that reversal will ensue when the jury may have been misled by the presentation of an erroneous alternate theory (see People v. Green (1980) 27 Cal. 3d 1, 69-71 [164 Cal. Rptr. 1, 609 P.2d 468], and see following conclusion).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. See Annotation, Criminal Liability of Corporation for Extortion, False Pretenses, or Similar Offenses, 49 A.L.R.3d 820.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. See Annotation, Modern Status of Rule that Crime of False Pretenses Cannot Be Predicated Upon Present Intention Not to Comply With Promise or Statement as to Future Act, 19 A.L.R.4th 959.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. See Annotation, Admissibility to Establish Fraudulent Purpose or Intent, in Prosecution for Obtaining or Attempting to Obtain Money or Property by False Pretenses, of Evidence of Similar Attempts on Other Occasions, 80 A.L.R. 1306, supplemented at 78 A.L.R.2d 1359.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. At one point in closing argument, the prosecutor did ask the jury keep in mind whether defendant stole from the different corporations in 1971, 1973 and 1974, \"either by embezzlement or through false pretense.\" In laying out the facts of the transaction, the prosecutor characterized it as a fraud or sham.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. This conclusion obviates the need to fully consider a variety of other contentions defendant has raised on appeal concerning instructional error as to theft. One of these is that the court should have told the jury a false pretenses theory did not apply to the 1971 and 1973 charges. As appears above, the evidence supported a false pretenses theory as to the 1973 theft charge. As appears below (see fn. 29 and related text in tax fraud discussion), no theft theory had to be proved in support of the 1971 or 1973 charges of tax fraud. Another contention is the court's definition of embezzlement left out the most important element of fraudulent intent, as in People v. Whitney (1953) 121 Cal. App. 2d 515, 520-521 [263 P.2d 449]. Unlike Whitney, however, the court here did not repeatedly define embezzlement without mention of the required fraudulent intent. In fact, the court here instructed \"the necessary specific intent [for embezzlement] is an intent fraudulently to appropriate property of another in violation of the trust.\" Defendant complains this instruction was infected by another which defined \"fraud as any act that involves a breach of duty or breach of trust or breach of confidence, and which is injurious to another.\" Defendant further complains the court gave a misleading illustration of fraud. In the first place, both this definition and the illustration were taken practically verbatim from Talbot, supra, 220 Cal. 3, at page 15. In the second place, these instructions were not given so close in time that the jury would naturally connect the definition of \"fraud\" with the requisite specific fraudulent intent. There was no error in this respect. Defendant also claims the trial court erred in failing to instruct the jury sua sponte on the defense of good faith available under Penal Code section 511, as occurred in Stewart, supra, 16 Cal. 3d 133, at pages 139 to 142, which was so prejudicial as to require reversal of the entire judgment. Unlike Stewart, our defendant did not testify at all, let alone to the effect he was in fact authorized or believed he was authorized to do what he did. Assuming nonetheless this defense may be raised through the testimony of other witnesses, we need not search for substantial evidence supportive of this defense in the record in view of our conclusions as to the theft conviction. As to the claim any such error infected the entire judgment, as just noted, the prosecution was not required to prove theft in order to establish tax fraud in 1971 or 1973. Since the tax convictions rest on different elements, any error in failing to instruct on the good faith defense to an embezzlement charge cannot be regarded as prejudicial. The jury might have concluded there was no theft, but that defendant still had unreported income.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The following section should also be quoted here, because it becomes relevant in the following discussion. \"Any person who, with or without intent to evade any requirement of this part or any lawful requirement of the Franchise Tax Board under this part, fails to file any return or to supply any information required under this part, or who, with or without such intent, makes, renders, signs, or verifies any false or fraudulent return or statement, or supplies any false or fraudulent information, is liable to a penalty of not more than one thousand dollars ($1,000). The penalty shall be recovered by the Attorney General or the counsel for the Franchise Tax Board in the name of the people by action in any court of competent jurisdiction. \"The person is also guilty of a misdemeanor and shall upon conviction be fined not to exceed one thousand dollars ($1,000) or be imprisoned not to exceed one year, or both, at the discretion of the court.\" (Rev. \u0026 Tax. Code, § 19401.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Greer, supra, 30 Cal. 2d 589, is often cited, as it is in Johnson and by defendant here, as barring double conviction of an offense and necessarily included offenses. Dictum therein may support this proposition (p. 599). But as noted in Tideman, supra, 57 Cal. 2d 574, 588, this dictum issued in the course of an application of Penal Code section 1023, not 654.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Except as otherwise provided by the Franchise Tax Board, any return, declaration, statement or other document required to be made under any provision of this part or regulations shall contain, or be verified by, a written declaration that it is made under the penalties of perjury. Such returns, and all other returns, declarations, statements or other documents or copies thereof required by this part, shall be in such form as the Franchise Tax Board may from time to time prescribe, and shall be filed with the Franchise Tax Board. The Franchise Tax Board shall prepare blank forms for the returns, declarations, statements or other documents and shall distribute them throughout the state and furnish them upon application. Failure to receive or secure the form does not relieve any taxpayer from making any return, declaration, statement or other document required.\" (§ 18431.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. 26 United States Code section 7203 provides, in pertinent part: \"Any person required under this title . . . to make a return . . . or supply any information, who willfully fails to . . . make such return, . . . or supply such information, at the time or times required by law or regulations, shall, in addition to other penalties provided by law, be guilty of a misdemeanor.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. 26 United States Code section 7207 provides, in pertinent part: \"Any person who willfully delivers or discloses to the Secretary any . . . return, . . . statement, or other document, known by him to be fraudulent or to be false as to any material matter, shall be fined not more than $10,000 . . . or imprisoned not more than 1 year, or both.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. 26 United States Code section 6065 states: \"Except as otherwise provided by the Secretary, any return, declaration, statement, or other document required to be made under any provision of the internal revenue laws or regulations shall contain or be verified by a written declaration that it is made under the penalties of perjury.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. See Annotation, What Constitutes Lesser Offenses \"Necessarily Included\" in Offense Charged, Under Rule 31(c) of Federal Rules of Criminal Procedure (1972) 11 A.L.R.Fed. 173, sections 20 to 22.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Technically, section 19405 could be violated if a taxpayer filed an accurate return which he believed to be inaccurate, but one doubts such behavior will be a subject of prosecution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Care should be taken in referring to pre- Bishop cases for guidance on the required mental element for violations of federal tax statutes, because Bishop resolved a conflict among the circuits about whether some crimes involved more in the way of wilfulness than others.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. A number of defendant's contentions on appeal lose force in light of this point. Defendant raises every argument made in connection with the 1973 theft conviction against the prosecution's theory the defendant embezzled money and property in 1971. Although this court might reach the same conclusions as it has above if there were a 1971 theft conviction, the arguments simply miss the mark in response to tax fraud convictions. Whether or not there was a theft by embezzlement or other means in 1971 or in 1973 is not critical to showing there was income.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. For example, the prosecutor argued: \"[Defense counsel] went on to say as to Count Five, the specific charge of theft dealing with the July 17, 1973 transactions: 'If you can't find theft, then the tax counts go.' No, that is not correct. Even if you do not find embezzlement on Count Five, the evidence is such that you would be called upon to deliberate and determine whether or not he had income in the amount of 8.9 million dollars from the transaction in July of '73; and if he had income, then a further determination as to whether or not he failed to report it knowingly, intentionally, intending to evade his income taxes, which would be the thrust or the basis for Counts Three and Four, which charge income tax evasion for the year 1973.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Counsel for defendant appears to have rebutted this argument to a certain extent in his own closing argument, stating, \"here is a transaction whereby the taxpayer got a gain in his wealth . . . . Is it income? And it is . . . if coming off that transaction the taxpayer with that gain does not recognize -- there is no obligation to repay, then it may be income. If it is a gift, no obligation to repay, of course, then it is not income. You have got a gain in wealth; you have no obligation to repay; you do not recognize an obligation to repay; not income -- okay -- a gift. So we are not saying that every gain in wealth constitutes income because we all know that it does not.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Defendant did raise the objection as part of a motion for mistrial made after the prosecutor's initial closing argument.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. United States v. O'Connor (2d Cir. 1956) 237 F.2d 466, and United States v. Tolbert (7th Cir. 1966) 367 F.2d 778, are both net worth cases, and in Tolbert both sides requested net worth instructions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Evidence Code section 355 states: \"When evidence is admissible as to one party or for one purpose and is inadmissible as to another party or for another purpose, the court upon request shall restrict the evidence to its proper scope and instruct the jury accordingly.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Defendant caused loan repayments after the \"sale\" to be made by Sovereign through a cashier's check in order not \"to disturb the signatures that the life insurance companies recognize.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Schroeder denied being present, although admitting he was in contact with Johnston and Rundlett around that time. Johnston recalled Schroeder was there.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. It does not appear defendant ever did complete these transactions by writing checks, although the records of the corporations did reflect his liability for them.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Garber has been criticized in United States v. Ingredient Technology Corp. (2d Cir. 1983) 698 F.2d 88, 97, insofar as it holds it is for the jury to decide whether the tax law is sufficiently uncertain to negate defendant's intent in the absence of evidence that defendant actually relied on one view.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Revenue and Taxation Code section 17335 states: \"Except as otherwise provided in Section 17336, gross income does not include the amount of any distribution of the stock of a corporation made by such corporation to its shareholders with respect to its stock.\" 26 United States Code § 305(a) is virtually identical.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. The jury was properly instructed: \"Now, we have evidence in this case of property acquired through loans. Such property is free of income tax consequences not because legal ownership remains in a person other than the taxpayer, but because there is a consensual recognition of a legal obligation to return the property at some time in the future to the owner. And the taxpayer must have an intent to repay the loan, whether money or property. The mere label of a transaction as a loan, however, does not prevent the Government from seeking to impose an income tax on a borrower for his gain or addition to wealth. If it can be shown that there was no legal obligation to return the property and that the borrower, in fact, did not intend to repay or return, then the acquisition will be subject to the income tax whether the acquisition or retention was lawful or unlawful. Such gains and additions are subject to tax in the year during which they are realized.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Although this was not the prosecution's theory, a jury might conclude as to the June 17, 1971, transaction that the sale of stock which defendant was not authorized to sell would generate ordinary income rather than capital gains (United States v. Burrell (5th Cir. 1974) 505 F.2d 904, 910).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Although the defendant argues at one point the law is so vague that his actual intent was irrelevant, he also argues as a matter of law the facts show he did not have the requisite intent. This argument will be separately discussed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. The court need not be drawn into making the fine distinctions involved in the question, important in some civil tax proceedings, whether a benefit received by a corporate officer was primarily personal or business. (Cf. Crosby v. United States (5th Cir. 1974) 496 F.2d 1384, 1390; Loftin and Woodard, Inc. v. United States (5th Cir. 1978) 577 F.2d 1206, 1215-1216; Ireland v. United States (5th Cir. 1980) 621 F.2d 731, 735.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. Defendant claims a number of other errors in the way his defense of reliance on his tax preparers was treated in the trial court. The major complaint is the trial court allowed the prosecution to question the competence and expertise of the tax preparers on the basis it was an issue when the taxpayer's reliance on them was asserted as a defense. Defendant contends both that this resulted in admission of prejudicial evidence and the prosecutor's questions and closing argument on this topic amounted to misconduct in a number of instances. It does appear the prosecution went far afield, particularly in examination of Rundlett and Johnston. For example, they were questioned about an uncharged 1971 transaction as to how it should have been reported under tax law about transactions between \"related parties.\" It is possible, at times, the jury was distracted from the issue whether the taxpayer truly and honestly relied on the tax preparer (Cox, supra, 348 F.2d 294, 296). It is not clear from the authorities cited above as to what extent, if any, the tax preparer's competence is chargeable to the taxpayer. A taxpayer may have relied on a tax preparer who appeared competent to him, even though he might strike others as incompetent (see Busten, supra, 395 F.2d 976, 981-982). It would be a sign of wilfulness, on the other hand, if the taxpayer withheld information from a tax preparer whom he believed to be competent and honest, or if the taxpayer sought out a preparer who would participate in a plan to dishonestly conceal income. It is the taxpayer's relationship with the tax preparer that is important to this defense, and the tax preparer's competence is only relevant insofar as there is evidence of what it meant to the taxpayer. Some of the questions should have had the objections to them sustained on the ground they consumed an undue amount of time (Evid. Code, § 352). However, we cannot say any evidence elicited by them was prejudicial under Evidence Code section 353. Defendant points out some of the prosecution's experts praised the work done by Rundlett and Johnston and indicated they were competent. As to the numerous claims made on appeal that the very questioning of the tax preparers was prosecutorial misconduct and the closing argument's characterization of them as \"economically beholden\" to the defendant was other misconduct, it appears no objection was made to several of the questions and statements complained of (Green, supra, 27 Cal. 3d 1, 34). Moreover, it does not appear they resulted in a miscarriage of justice (ibid.). The prosecution's closing argument did, at times, suggest the tax preparers' complicity in defendant's tax fraud scheme. The jury was properly instructed on the defense of reliance, however, and was admonished that the arguments of counsel were not evidence. Other admonitions might have been warranted if defendant had made specific objections at the time which would have remedied the harm now claimed to be done (ibid.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. There was some evidence, in connection with an uncharged transaction, defendant had instructed Schroeder to destroy a memorandum when it had served its purpose. This does suggest some other information was deleted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. An alternative theory of income might be to disregard the corporations (e.g., Thetford, supra, 676 F.2d 170, 177).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. 26 United States Code section 7201 states, in part: \"Any person who willfully attempts in any manner to evade or defeat any tax imposed by this title or the payment thereof shall, in addition to other penalties provided by law, be guilty of a felony . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. The prosecutor followed his argument from these charts with his argument questioning how defendant's net worth could continue to increase. See footnote 30 above and related text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. As recently stated in People v. Alexander (1983) 140 Cal. App. 3d 647, at page 666 [189 Cal. Rptr. 906]: \"An appellate court is not restricted to the remedies of affirming or reversing a judgment. Where the prejudicial error goes only to the degree of the offense for which the defendant was convicted, the appellate court may reduce the conviction to a lesser degree and affirm the judgment as modified, thereby obviating the necessity for a retrial. (See Pen. Code, § 1260; People v. Harris (1968) 266 Cal. App. 2d 426, 434-435 [72 Cal. Rptr. 423.] Such a modification of judgment is appropriate where there was error in failing to instruct on lesser included offenses but the evidence clearly establishes guilt of a lesser degree of the offense for which he was convicted. (People v. Bailey (1974) 38 Cal. App. 3d 693, 700 [113 Cal. Rptr. 514].)\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. To constitute embezzlement, one need not have physical possession or custody of another's property; the right to manage or direct the disposition of those assets is all that is required. (People v. Knott (1940) 15 Cal. 2d 628, 631 [104 P.2d 33, 128 A.L.R. 1367].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. United States Holding Company of California later changed its name to Sovereign State's Capital. This is a separate entity from United States Holding Company of Delaware of which Smith and his family were record owners.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The listed \"owner\" of Missouri Western was one M.J. Coen who later admitted he had no idea he was listed as an owner on that date nor that the corporation was supposedly purchasing any shares of USNB stock from Smith. When the Security Exchange Commission subpoenaed Coen later during an investigation of Smith's suspicious USNB stock dealings, Coen wrote to Smith asking he advise him on such basic questions as \"who is running the company, where are the books, etc.\" He concluded this SOS letter with \"destroy.\" \"Personal and Confidential. Destroy when it has served its purposes.\" (Ex. 37-23.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. This is not surprising in that all directors and officers of the Padres were Smith's family and employees. For instance, Toft, Smith's figurehead in various enterprises, was chairman of the Padres' board of directors, vice president, treasurer and assistant secretary. In an apparent freudian slip, the November 13, 1972, minutes signed by Toft as chairman, refer to \"Chairman Smith.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Schroeder was not only Sovereign's comptroller at this time, but a vice president and director as well.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Smith claims the probation order must be set aside on several grounds: first, because it was improper to impose three consecutive one-year jail terms as conditions of felony probation. We do not address this contention because our disposition of the tax fraud convictions eliminates, for the present at least, the issue of whether consecutive terms in jail may be imposed for any reason other than as a \"sentence\" for misdemeanor convictions. If the People allow the tax fraud counts to remain misdemeanors, resentencing will be required and the trial court will be free to deny probation on those counts, or to grant probation on other terms. In the event the People retry those counts, the issue is moot. For the same reasons, we need not address his claim there was any need for the trial court to state reasons for imposing probation jail terms. Second, Smith claims the entire probation order is void because the trial court failed to orally state its reasons for granting probation. (Cal. Rules of Court, rule 405(f), Pen. Code, § 1170, subd. (c).) Assuming there is such a duty, Smith shows no prejudice. He argued for probation. The alternative is denial of probation and a prison sentence. Third, Smith claims the trial court abused its discretion because a jail term was not reasonably related to the crimes he committed. Facially, it is absurd to contend a one-year jail term is an unreasonable condition to impose for stealing $8.9 million, or for that matter, for each of the tax frauds. However, Smith states these terms, imposed five years ago, amounted to a \"death\" sentence because he was then eighty years of age and in poor health. These factors and others cited by defendant were considered by the trial court and no abuse of discretion is shown on this record. Smith is free to submit current life-threatening medical factors to the trial court by way of a motion to modify probation, if appropriate. Finally, we note the trial court's general condition of probation requiring Smith to pay a $681,000 reparation on account of the liability to the State of California for taxes he failed to pay in 1971, is not a proper condition to be attached to the probation granted on the theft conviction. At this time it is unnecessary to decide whether it is a reasonable condition to be imposed on the tax fraud counts.\u003c/span\u003e\n\n",
    "body_length": 213432,
    "citedas": [
      "203 Cal. Rptr. 196",
      "155 Cal. App. 3d 1103"
    ],
    "attorneys": "Simon \u0026 Sheridan, Thomas R. Sheridan, Douglas A. Simon, Horvitz \u0026 Greines, Horvitz \u0026 Levy, Ellis J. Horvitz, Greines, Martin, Stein \u0026 Richland, Alan G. Martin and Kent L. Richland for Defendant and Appellant. George Deukmejian and John K. Van de Kamp, Attorneys General, John W. Carney, Lillian L. Quon and Jay M. Bloom, Deputy Attorneys General, for Plaintiff and Respondent.",
    "category": [
      "242",
      "36",
      "75"
    ],
    "judges": "Per Work, J., with Cologne, Acting P. J., concurring.",
    "citation_count": 0
  }
}
