{
  "id": "DH-JPWYBTlTomsSBxv_a",
  "document": {
    "title": "Jennings v. Jones",
    "full_title": "ADAM JENNINGS v. KENNETH JONES .",
    "jurisdiction": "First Circuit",
    "date": "2007-03-07T00:00:00.000Z",
    "docket": "No. 05-2522",
    "body": "Before Torruella, Lynch and Lipez, Circuit Judges.\n\nAppellant Adam Jennings, a member of the Narragansett Indian Tribe, worked at a \"smoke shop\" operated by the tribe and located on Indian tribal land in Charlestown, Rhode Island. The smoke shop sold an array of cigarettes to members of the tribe and the general public. During a search of the smoke shop by the Rhode Island State Police, Jennings was arrested for disorderly conduct. Jennings initially resisted the arrest, requiring the use of force by state police officials to subdue him. As a result of that confrontation, appellee Kenneth Jones used an \"ankle turn control technique\" which broke Jennings' ankle. Jennings brought suit under 42 U.S.C. § 1983 against Jones and other officers, claiming that they had violated his Fourth Amendment rights by using excessive force to restrain him. Jennings also brought a claim under state law for battery.\n\nAlthough a jury found in favor of most of the defendants, it ruled for Jennings on his excessive force and battery claims against Jones and awarded compensatory damages of $301,100. The district court then granted Jones' post-verdict motion for judgment as a matter of law, ruling for Jones on all three prongs of the qualified immunity inquiry. It first held that there was no constitutional violation because there was no evidence from which a reasonable jury could have concluded that the force used to subdue Jennings was excessive. It then concluded that, even if there had been a constitutional violation, Jones was entitled to qualified immunity because the relevant law was not clearly established and a reasonable officer would not have believed that the force was excessive and thus in violation of the Fourth Amendment. The court also granted judgment as a matter of law for Jones on the battery claim. Along with his motion for judgment as a matter of law, Jones filed motions for a new trial and a remittitur. In contravention of Federal Rule of Civil Procedure 50, the district court did not rule on these motions.\n\nOn appeal, Jennings challenges the court's determinations on his Fourth Amendment claim. After careful review, we conclude that the court erred in granting qualified immunity to Jones. First, viewing the evidence in the light most favorable to the jury verdict, we conclude that the record establishes that Jones violated Jennings' constitutional right to be free of excessive force. Second, we find that this right was clearly established at the time of Jennings' injury. Third, we conclude that a reasonable officer in Jones' position would have believed that his actions violated Jennings' constitutional right. Finally, because Jones failed to obtain a conditional ruling on his motions for a new trial and a remittitur before the district court and failed to raise these motions on appeal, we find that he has abandoned these motions. Consequently, we vacate the judgment of the district court and order reinstatement of the jury award.\n\nI.\n\nA. Factual Background\n\nIn reviewing a grant of judgment as a matter of law following a jury verdict, \"[w]e examine the record as a whole, reading the evidence in the light most favorable to the jury verdict.\" Cruz-Vargas v. R.J. Reynolds Tobacco Co., 348 F.3d 271, 275 (1st Cir. 2003).\n\nOn July 14, 2003, Jennings was at work in a trailer referred to as the \"smoke shop\" owned and operated by the Narragansett tribe and located on tribal land in Charlestown, Rhode Island. The tribe and the State of Rhode Island were engaged in an ongoing dispute about whether the tribe could sell cigarettes tax-free.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Pursuant to this dispute, the Rhode Island State Police had obtained a warrant to seize the cigarettes at the smoke shop, and several plain clothes officers were stationed inside the shop. After uniformed officers arrived in marked cars in the parking lot, the undercover officers inside the shop instructed Jennings to take a seat behind the sales counter. Jennings initially grabbed onto the counter, but then complied and seated himself behind the counter. He also complied when the state police asked him to move to a different seat.\n\nJennings testified that he was \"upset\" during these events. He complained loudly that the Rhode Island police had no right to be on his property, and he expressed concern over their treatment of his mother, who was also in the shop. He repeatedly used profanity in his comments.\n\nEventually, Officer Ken Bell asked Jennings to leave the shop without informing him that he was under arrest for disorderly conduct. A video taken by the state police shows that as Jennings was leaving the shop, an officer issued an order to handcuff him, and Jennings responded, \"I'm not getting arrested.\" The video also shows that Jennings resisted handcuffing and that several officers subsequently wrestled him to the floor. Jones was one of the officers involved in subduing Jennings. He used an ankle restraint technique called the \"ankle turn control technique\" to control Jennings' leg.\n\nDuring this conflict, the officers repeatedly instructed Jennings to stop resisting and to show them both of his hands because they were concerned that he might have a weapon. Jennings was initially unable to produce his left hand for handcuffing because it was trapped underneath his body. Officer Hill, one of the officers who was attempting to subdue Jennings, testified that he pulled Jennings' left arm out from under his body. The video shows that Hill then got up and walked away.\n\nJennings testified that he had ceased resisting before his arm was pulled out from underneath his body. About sixteen months prior to the smoke shop confrontation, Jennings had broken the ankle that Jones was restraining and had surgery performed on it. The officer's use of the \"ankle turn control technique\" caused Jennings considerable pain. Jennings informed Jones that the force Jones was using was hurting his previously injured ankle. Jones then increased the amount of force he was using and broke Jennings' ankle.\n\nOn the video, several seconds elapse from the time that Hill got up and left to the time that Jennings yelled in pain as his ankle was broken.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Within seconds after Jennings' injury, the officers brought Jennings to his feet, already handcuffed, and escorted him outside the smoke shop.\n\nB. Procedural History\n\nJennings brought this action against Jones and several other police officers seeking damages under 42 U.S.C. § 1983 for excessive use of force and for battery under state law.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The officers moved for judgment as a matter of law after the close of Jennings' evidence, raising the qualified immunity defense for the first time.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The court denied the motion with respect to Jennings' excessive force claim against Jones,\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e noting:\n\nThere was testimony as to Trooper Jones that he continued twisting the ankle of Mr. Jennings even after Mr. Jennings had been subdued and even after Mr. Jennings says that he told him that he'd had a previous injury to the ankle and he was breaking the ankle. So as to Detective Jones, there's enough evidence from which a jury at this point could conclude that the force was excessive.\n\nThe court did not explicitly address the issue of qualified immunity. After the close of all the evidence, defendants renewed their motion for judgment as a matter of law, but did not specifically renew their qualified immunity argument. The court again denied the motion with respect to Jennings' excessive force claim against Jones,\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e explaining:\n\n[W]e have very different versions as to what happened. According to Mr. Jennings, Trooper Jones grabbed his ankle, he wasn't kicking, he wasn't doing anything that would warrant it. Trooper Jones grabbed his ankle, twisted his ankle, he told him that he had had previous surgery on the ankle, and that the ankle, he was in the process of breaking his ankle. And according to Mr. Jennings, Trooper Jones actually increased the pressure on the ankle and broke his ankle. . . . If the jury accepts Mr. Jennings' version, it might very well find that Trooper Jones used excessive force.\n\nAgain, the court did not explicitly address the issue of qualified immunity.\n\nThe case was submitted to the jury, which awarded Jennings $301,100 in compensatory damages for his claims against Jones. Following the verdict, Jones moved for judgment as a matter of law pursuant to Federal Rule of Civil Procedure 50(b) on the ground that he was shielded from liability by the doctrine of qualified immunity. Jones also moved for a new trial, or, in the alternative, to amend the judgment by granting a remittitur.\n\nThe district court granted Jones' motion for judgment as a matter of law, concluding that it had erred in submitting the case to the jury to determine whether excessive force was used and ruling for Jones on all three prongs of the qualified immunity inquiry. It first held that there was no constitutional violation because there was no evidence from which a reasonable jury could have concluded that the force used to subdue Jennings was excessive. It then concluded that, even if there had been a constitutional violation, Jones was entitled to qualified immunity because the relevant law was not clearly established and a reasonable officer would not have believed that the force was excessive and thus in violation of the Fourth Amendment. In granting judgment as a matter of law, the court also held that the remaining motions for a new trial and for a remittitur had become moot.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e This appeal ensued.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nII.\n\nThe issue before us is whether the district court properly found appellee Jones entitled to qualified immunity from damages. When a defense of qualified immunity is pressed after a jury verdict, we have determined that \"the evidence must be construed in the light most hospitable to the party that prevailed at trial.\" Iacobucci v. Boulter, 193 F.3d 14, 23 (1st Cir. 1999); see also Borges Colón v. Rom n-Abreu, 438 F.3d 1, 18 (1st Cir. 2006) (citing Iacobucci). In such an analysis, \"deference should be accorded to the jury's discernible resolution of disputed factual issues.\" Iacobucci, 193 F.3d at 23. Thus, where the jury has issued a general verdict, as it did here, we \"view[] the facts in the light most favorable to the verdict.\" Whitfield v. Meléndez-Rivera, 431 F.3d at 8. This view of the facts persists throughout the three prongs of the qualified immunity analysis. See Borges Colón, 438 F.3d at 19 (rejecting, on the third prong of the qualified immunity analysis, a factual scenario proposed by defendants on the ground that \"a jury easily could have found that this was not so\").\n\nIn this case, we must take this approach with respect to a critical factual dispute: whether Jones increased the force he applied after Jennings already had ceased resisting for several seconds. Jennings' claim of excessive force does not rest on the allegation that Jones merely used the ankle turn control technique, but rather that Jones increased the amount of force he applied after Jennings had stopped resisting and stated that Jones was hurting his previously injured ankle. Indeed, this theme of increased force by Jones without justification was the core of Jennings' case.\n\nJennings' opening statement immediately described this version of events to the jury. His attorney stated: \"[O]ther witnesses will say that [Jennings] was warning [Jones] that he was breaking his leg. The evidence will show that . . . the way [Jones] responded to that information was to twist harder, even though there was no reason to be twisting at all.\" At trial, three witnesses testified about Jones' restraint of Jennings. Jennings himself testified: \"It was almost, not just incremental . . . I'm telling the guy, look, you're going to break my ankle and so forth, and he twisted it more.\" Similarly, Domingo Monroe, who was seated across the room when the struggle occurred, testified: \"Adam Jennings said, you're hurting my ankle, it was already injured at one point in time . . . and then the officer said, well . . . if you wouldn't resist, then your ankle . . . wouldn't be hurting, and then as he said that, he cranked down harder on the ankle.\" Finally, Daniel Piccoli testified that he observed the struggle through the open door of the smoke shop:\n\nQ: Mr. Piccoli, could you describe the movements, if any, of the person who was on the floor?\n\nA: There weren't any.\n\n...\n\nQ: Did there come a point in time when you heard the person on the floor say something?\n\nA: Yes.\n\nQ: What did you hear him say?\n\nA: He said something in regard to, \"let go, you're going to break my ankle.\"\n\nQ: And what, if anything, did the officer who was holding onto his ankle do?\n\nA: Just twisted more. Jennings' attorney emphasized this increased use of force in his closing argument:\n\nNow, Adam Jennings himself has testified that he was on the floor, he was saying to somebody . . . you're breaking my ankle or I just had surgery. And you heard testimony that the immediate response was [] a greater application of force than there already had been, you heard that from Dan Piccoli.\n\nNear the end of the closing argument, Jennings' attorney returned to this theme:\n\n[Jones] never increased his force, he said, never decreased it. Now you tell me, if you've got constant force on somebody's ankle and their foot, why at some point does it break? . . . [D]id Trooper Jones who had Adam Jennings totally under control, lose it and just decide that because this guy was still complaining, that he was going to teach him a little bit of a lesson and put a little bit more pressure on.\n\nAs highlighted by the arguments of counsel,\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e the consistent testimony from Jennings and two eye-witnesses would allow a reasonable jury to conclude that Jones increased the force he used to restrain Jennings after Jennings had already ceased resisting. This version of events correctly construes the facts \"in the light most favorable to the verdict.\" Whitfield, 431 F.3d at 8.\n\nThe district court failed to view the facts in this light. In its written decision granting judgment as a matter of law to Jones on the basis of qualified immunity, the district court stated that the testimony of the police officers was more credible than the contrary testimony of Jennings, Piccoli and Monroe. Therefore, it did not believe that \"Jones continued to twist Jennings' ankle after Jennings had stopped resisting and was under control.\" (Emphasis in original.) However, the district court also correctly noted that it could not grant judgment as a matter of law on that basis. See 9A Charles Alan Wright \u0026 Arthur R. Miller, Federal Practice and Procedure § 2524 (2d ed. 1995)(explaining that, in granting judgment as a matter of law, a court \"is not free to weigh the parties' evidence or to pass on the credibility of witnesses or to substitute its judgment of the facts for that of the jury.\")(internal footnotes omitted). Instead, the court granted judgment as a matter of law on the basis of qualified immunity, finding that Jennings had not presented evidence from which the jury could conclude that the force used to subdue Jennings was excessive, and that, in any case, Jones was entitled to qualified immunity because the relevant law was not clearly established and a reasonable officer would not have believed that the force was excessive and thus in violation of the Fourth Amendment.\n\nWe reserve discussion of the court's ultimate ground for granting judgment as a matter of law for our qualified immunity analysis in the next section of this opinion. Here, we wish only to emphasize an important inconsistency in the district court's analysis of the evidence. The court acknowledged that it could not supplant the jury's view of the facts with its own. Assessing credibility was the jury's role, and, as the court also acknowledged, the evidence permitted a reasonable finding by the jury that Jones increased the force he used after Jennings had ceased resisting. Yet the district court's qualified immunity analysis incorporated its skepticism about the jury's fact- finding on the critical issue of whether Jones increased his use of force. At one point, the court stated in its decision that \"the jury determined that Jones' use of the ankle turn control technique amounted to excessive force.\" (Emphasis added.) Later, it referred to Jones \"maintaining\" the ankle hold after Jennings ceased resisting. Given the witness testimony discussed above, the district court's characterization is incomplete. Jennings and his two witnesses testified that Jones increased his force after Jennings ceased resisting, and we adopt this view of the evidence in accordance with the principle that we take facts in the light most favorable to the verdict.\n\nThe dissent intimates that the jury's fact-finding role may be different in a case involving qualified immunity, noting our prior statement that \"the Supreme Court has not clearly indicated whether the judge may act as fact-finder when there is a factual dispute underlying the qualified immunity defense or whether this function must be fulfilled by a jury.\" Kelley v. LaForce, 288 F.3d 1, 7 n.2 (1st Cir. 2002). The dissent also claims that, by taking the facts in the light most favorable to the jury verdict, we engage in \"a bit of legal fiction.\" It argues that we have no way of knowing what facts the jury found, and lists the various factual scenarios that the jury might have found in a lengthy footnote.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Finally, it suggests that the jury may have reached a compromise verdict.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThe dissent's speculations ignore the fundamental principle that, in civil actions, our federal judicial system \"distributes trial functions between judge and jury and, under the influence - if not the command - of the Seventh Amendment, assigns the decisions of disputed questions of fact to the jury.\" Gasperini v. Ctr. for Humanities, Inc., 518 U.S. 415, 432 (1996)(citation omitted). Indeed, we acknowledged this principle in Kelley by stating that \"when facts are in dispute, `we doubt the Supreme Court intended this dispute to be resolved from the bench by fiat.'\" Kelley, 288 F.3d at 7 n.2 (quoting Prokey v. Watkins, 942 F.2d 67, 72 (1st Cir 1991)). Consistent with this principle, other courts have taken the facts in the light most favorable to the jury verdict in reviewing a district court's grant of judgment as a matter of law in cases involving qualified immunity. See, e.g., Settlegoode v. Portland Pub. Schs., 371 F.3d 503, 503 (9th Cir 2004)(\"Many facts were hotly disputed at trial. We state them here consistent with the verdict.\"); Tamez v. City of San Marcos, 118 F.3d 1085, 1091 (5th Cir. 1997)(\"[W]e consider all of the evidence in the light most favorable to the nonmoving party.\"); Henderson v. DeRobertis, 940 F.2d 1055, 1057 (7th Cir. 1991)(\"We must view all the evidence and inferences in the light most favorable to [plaintiffs], who prevailed with the jury; any conflicts in the evidence must be resolved in favor of those [plaintiffs] and every permissible inference must be drawn in their favor.\").\n\nIn this case, the only view of the evidence consistent with the principle that we take the facts in the light most favorable to the jury verdict is that Jones increased the force he used to restrain Jennings after Jennings had ceased to resist and after Jennings had announced his prior ankle injury. That increased use of force broke Jennings' ankle. Our acceptance of these facts is no legal fiction. It is an acknowledgment of the deference that we must give to juries in the performance of their fact-finding role.\n\nWith this controlling legal principle in mind, and the view of the evidence required by that principle, we turn to the legal question of Jones' entitlement to qualified immunity. Our review is de novo. Whitfield, 431 F.3d at 6.\n\nIII.\n\nThe Supreme Court explained the process for determining qualified immunity in Saucier v. Katz, 533 U.S. 194 (2001). Saucier held that a court first must determine whether \"the facts alleged show the officer's conduct violated a constitutional right.\" Id. at 201. Second, the court must determine whether the right was \"clearly established\" so that \"it would be clear to a reasonable officer that his conduct was unlawful in the situation he confronted.\" Id. at 201-02. The Supreme Court emphasized that the constitutional question must be decided before determining whether the right was clearly established to facilitate the elaboration of the law. See id. at 201.\n\nWe have typically applied Saucier using a three-part test in which we inquire:\n\n(1) whether the claimant has alleged the deprivation of an actual constitutional right; (2) whether the right was clearly established at the time of the alleged action or inaction; and (3) if both of these questions are answered in the affirmative, whether an objectively reasonable official would have believed that the action taken violated that clearly established constitutional right.\n\nStarlight Sugar, Inc. v. Soto, 253 F.3d 137, 141 (1st Cir. 2001); see also Wilson v. City of Boston, 421 F.3d 45, 52 (1st Cir. 2005). Although this inquiry subdivides the second prong of the Saucier analysis into two separate questions, it is functionally identical to that analysis. Thus, we turn to this three-pronged inquiry, mindful of our obligation to evaluate any disputed evidence in the light most favorable to the jury verdict. Specifically, as we have already explained, we must take the view that Jones increased the pressure on Jennings' ankle after Jennings stopped resisting the officers and stated that the force used was hurting his previously injured ankle.\n\nA. Prong One: The Constitutional Violation\n\nIn granting Jones' motion for judgment as a matter of law, the district court indicated that Jennings had not presented sufficient evidence for a reasonable jury to find that Jones had used excessive force in violation of the Constitution.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e To explore this question, we must first examine what constitutes excessive force under the Fourth Amendment, and then determine whether the evidence presented here was sufficient to support the jury verdict.\n\nTo establish a Fourth Amendment violation based on excessive force, a plaintiff must show that the defendant officer employed force that was unreasonable under the circumstances. See Graham v. Connor, 490 U.S. 386, 397 (1989). Whether the force used to effect a particular seizure is reasonable \"must be judged from the perspective of a reasonable officer on the scene, rather than with the 20/20 vision of hindsight.\" Id. at 396. The reasonableness inquiry is objective, to be determined \"in light of the facts and circumstances confronting [the officers], without regard to their underlying intent or motivation.\" Id. at 397. There must be \"careful attention to the facts and circumstances of each particular case, including the severity of the crime at issue, whether the suspect poses an immediate threat to the safety of the officers or others, and whether he is actively resisting arrest or attempting to evade arrest by flight.\" Id. at 396.\n\nWe recognize the difficult situation confronting the police. It is undisputed that Jennings was challenging authority and resisting arrest. For much of the struggle, the police could not see Jennings' hands, and they reasonably could have believed that he might have a weapon. In making an arrest, a police officer has \"the right to use some degree of physical coercion or threat thereof to effect it.\" Id. The fact that Jennings' ankle was broken does not, in itself, prove a constitutional violation: \"[T]he use of force is an expected, necessary part of a law enforcement officer's task of subduing and securing individuals suspected of committing crimes.\" Lee v. Ferraro, 284 F.3d 1188, 1200 (11th Cir. 2002).\n\nHowever, the focus of Jennings' excessive force claim was not merely Jones' use of force, but rather Jones' increased use of physical force after Jennings had ceased resisting for several seconds and stated that the force Jones was using was hurting his previously injured ankle. Jennings used one of Jones' own witnesses to help establish that such force was unreasonable. Defendants initially called Officer Delaney, an instructor at the Rhode Island State Police Training Academy, to provide testimony about the training of officers and the use of various restraint techniques. During Jennings' cross-examination the parties agreed to treat Delaney as an expert witness.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Delaney testified that the ankle turn control technique is taught to police officers as \"a compliance technique and a restraint technique devised to control somebody from kicking.\" These techniques are taught in conjunction with the \"Use of Force Continuum,\" a chart explaining that the degree of force that an officer uses should correlate with the degree of resistance offered by the arrestee. On cross-examination, Delaney testified that it was appropriate for an officer to continue to apply the ankle turn control technique after a suspect stops kicking:\n\nQ: [If] Adam Jennings is not kicking and his hands have been put behind his back and officers are attempting to put the flex cuffs on him . . . would it be appropriate for an officer in the position of Trooper Jones to still be twisting his ankle?\n\nA: It would be appropriate for him to maintain that control over the leg.\n\n(Emphasis added.)\n\nHowever, Delaney's testimony about the continuum of force also supports the view that it would be unreasonable for an officer to increase his use of force when an arrestee has ceased to resist. Delaney testified during cross-examination that the continuum of force was a \"two way street,\" meaning that, if the level of resistance changes, the level of force should be adjusted upward or downward correspondingly:\n\nQ: [E]ven if an officer feels at one point in time that one level of force is appropriate, he is supposed to adjust the amount of force he uses in response to a lessening of the arrestee; isn't that true?\n\nA: Yes. That would be the Trooper's own assessment of where that lies, yes, sir.\n\nStill on cross-examination, Delaney testified further:\n\nQ: You don't get stuck at any level, an officer has to be cognizant of what's going on during the arrest and adjust his use of force accordingly, right?\n\nA: Correct.\n\nThe district court's jury instructions noted that a factor in determining excessive force is whether \"the degree of force used and also whether the degree of force was proportional to what was appropriate under the circumstances.\" Moreover, Jennings' closing argument specifically connected the content of Delaney's testimony to Jones' increased use of force:\n\nNow, the Judge is going to instruct you that, as does the Use of Force Continuum . . . what goes up can come down and should come down if there's no need any longer to be applying that kind of force. Now, Adam Jennings himself has testified that he was on the floor, he was saying to somebody . . . you're breaking my ankle or I just had surgery. And you heard testimony that the immediate response was [] a greater application of force than there already had been . . . .\n\nThus, guided by the court's instructions on proportional force, the jury could conclude from Delaney's testimony that it would have been unreasonable for an officer to increase the pressure on Jennings' ankle several seconds after Jennings stopped resisting arrest and, moreover, stated that the pressure already applied was hurting his previously injured ankle.\n\nThe district court considered Delaney's testimony. It noted that \"Delaney did acknowledge that the continuum of force was a 'two-way street,' meaning that, if the level of resistance changes, the level of force used should be adjusted upward or downward to correspond to what is appropriate at the level of resistance.\" Critically, though, the court failed to relate Delaney's testimony to the view of the evidence that we must take in light of the jury verdict. It explained that \"Delaney testified that it would have been appropriate for Jones to maintain the ankle turn control technique even if Jennings was not kicking and the officers were 'just trying to get the flex cuffs on him.'\" (Emphasis added.) However, Jones did not simply maintain the ankle turn control technique after Jennings gave up resistance; rather, he increased pressure to the point that he broke Jennings' ankle.\n\nIn finding that a reasonable jury could not have concluded that Jones used excessive force, the district court relied on our decision in Isom v. Town of Warren, 360 F.3d 7 (1st Cir. 2004). In that case, the police used pepper spray on Robert Isom, a \"distraught, seemingly suicidal man, who had briefly held two hostages and was refusing to comply with continuous officer requests that he put down an axe.\" Id. at 11. After the spray stopped, Isom \"responded not by dropping to the ground, as the officer had hoped, but by raising the axe and running toward two officers.\" Id. at 8. The officers then shot and killed Isom. Id.\n\nAt trial, the representative of Isom's estate argued that the use of pepper spray in that situation was \"a colossal misjudgment, resulting in a needless and wrongful death,\" and that no reasonable officer would have used pepper spray under such circumstances. Id. However, we found this argument inadequately supported because \"[i]n the presence of such danger, the plaintiffs could not prevail at trial without providing evidence that would bring into question the officers' judgment call to use pepper spray.\" Id. at 11. Because the plaintiff did not present any such evidence, we found that \"[t]here was no evidence from which the jury could rationally draw the conclusion that the officers' actions were objectively unreasonable.\" Id. at 12.\n\nThe district court held that this case is \"markedly similar to Isom,\" quoting Isom's explanation for finding that the plaintiff had not presented sufficient evidence:\n\nNo expert testified that, under the circumstances faced by Detective Clancy, no reasonable officer would have used pepper spray; in fact, the plaintiffs did not produce any expert testimony at all. Nor did the plaintiff produce any written policy or text stating that the use of pepper spray in circumstances such as those faced by Clancy was not reasonable.\n\nId. The district court also emphasized Isom's holding that, \"[f]or the jurors to have been given an opportunity to exercise their common sense on the ultimate question of whether no objectively reasonable officer would have used pepper spray, there must have been some basis in the evidence on which to ground that determination.\" Id. Relying on these propositions from Isom, the district court found that\n\nthere was an absence of any evidence that 'no objectively reasonable officer' would have used the level of force used by Jones and, therefore, the jury unfairly was put in the untenable position of trying to decide that question without sufficient evidence of the applicable standard for measuring the lawfulness of Jones' conduct.\n\nAs a result, the district court concluded that in this case, as in Isom, there was no basis in the evidence to support a jury finding of excessive force.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nContrary to the district court's assessment, this case differs from Isom in two important respects. First, in contrast to the plaintiff in Isom, Jennings did provide expert testimony about the use of force. He directed the jury to the testimony of Officer Delaney on the Use of Force Continuum, a concept relevant to the court's own instructions about the proportionality of force under the circumstances. As described above, Jennings' closing argument emphasized that \"the Judge is going to instruct you that, as does the Use of Force Continuum, like I said, what goes up can come down and should come down if there's no need any longer to be applying that kind of force.\" Thus, unlike the plaintiff in Isom, Jennings explicitly directed the jury to expert testimony in the record that could assist the jury in determining that no reasonable officer under the circumstances Jones confronted would have applied more pressure to Jennings' ankle.\n\nWe acknowledge that the expert testimony in this case was not precisely the sort described in Isom. As the district court noted, \"[n]o expert testified that, under the circumstances faced by [Jones], no reasonable officer would have\" acted as Jones did. Isom, 360 F.3d at 12. In fact, Delaney testified to the contrary on redirect examination by the government:\n\nQ. Did Officer Ken Jones use force that you would consider reasonable under the circumstances?\n\nA. Yes.\n\nHowever, Officer Delaney's testimony in response to the next few questions makes clear that he did not make his assessment with the relevant factual circumstances in mind. When asked what factors informed his finding of reasonableness, Delaney explained:\n\nThe fact that, you know, the suspect did not comply with the order of arrest, that he was assaultive, he was trying to kick the Trooper and he was offering enhanced defiance by bringing his arms in, at that point the appropriate application of force, which was the technique employed by Trooper Jones.\n\n(Emphasis added.) The factors Delaney lists all occurred prior to the time that Jennings ceased to resist, and Delaney's testimony thus indicates only that the use of force was reasonable \"at that point\" in time. Given that, viewing the evidence in the light most favorable to the verdict, Jones increased the force he used after Jennings ceased resisting, Delaney's expert testimony about the Use of Force Continuum actually supports a finding that the force Jones used was excessive.\n\nSecond, although this case happened to include expert testimony by Officer Delaney, we do not read Isom to require such testimony to support a finding that an officer's use of force was unreasonable.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Isom requires only that \"there must have been some basis in the evidence on which to ground\" a finding of excessive force, leaving open the possibility that some cases may be susceptible to a common sense determination by the jury. Isom itself involved pepper spray, a substance whose use may be unfamiliar to many jurors, and consequently the question of whether it is reasonable to use pepper spray in an attempt to subdue a distraught but threatening suspect may have been best addressed through expert testimony. By contrast, this case involves the common sense proposition that it is not reasonable for police officers to increase their use of physical force after an arrestee who has been resisting arrest stops resisting for several seconds and warns the officers that they are hurting his previously injured ankle. Although Officer Delaney did not offer expert testimony that no reasonable officer would have acted as Jones did under the circumstances, he did offer expert testimony that gave the jury a useful framework for thinking about the excessive force issue. Thus informed, the jurors were in a better position to apply their common sense to the facts of this case.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nOther courts have recognized that some factual scenarios permit common sense determinations by the jury as to whether the police used excessive force. In Kopf v. Skyrm, 993 F.2d 374, 379 (4th Cir. 1993), the Fourth Circuit noted:\n\n[A] blanket rule that expert testimony is generally admissible in excessive force cases would be just as wrong as a blanket rule that it is not. The facts of every case will determine whether expert testimony would assist the jury. Where force is reduced to its most primitive form - the bare hands - expert testimony might not be helpful.\n\nSee also Adewale v. Whalen, 21 F.Supp.2d 1006, 1014 (D.Minn. 1998) (\"If plaintiff's version of the facts is believed, the jury could conclude without expert testimony that [defendant] used excessive force, and that his actions caused plaintiff's broken arm.\"). This case, involving force applied with bare hands, did not require expert testimony to establish whether the force used was reasonable.\n\nIn keeping with our decision in Isom, a reasonable jury could have exercised its common sense, informed by Officer Delaney's expert testimony, to find that Jones used excessive force by increasing pressure on Jennings' ankle after Jennings stopped resisting for several seconds and stated that Jones was using force that hurt his previously injured ankle. Consequently, we conclude that Jones violated Jennings' Fourth Amendment right to be free from an unreasonable seizure.\n\nB. Prong Two: Whether the Law Was Clearly Established\n\nThe second prong of the qualified immunity analysis asks \"whether the constitutional right . . . was 'clearly established' at the time of the incident such that it would 'be clear to a reasonable officer that his conduct was unlawful in the situation he confronted.'\" Riverdale Mills Corp. v. Pimpare, 392 F.3d 55, 65 (1st Cir. 2004) (quoting Saucier, 533 U.S. at 202). We consider whether existing case law gave the defendants \"fair warning that their conduct violated the plaintiff's constitutional rights.\" Suboh v. Dist. Attorney's Office of Suffolk, 298 F.3d 81, 93 (1st Cir. 2002). In other words, the law is clearly established either if courts have previously ruled that materially similar conduct was unconstitutional, or if \"a general constitutional rule already identified in the decisional law [applies] with obvious clarity to the specific conduct\" at issue. United States v. Lanier, 520 U.S. 259, 271 (1997). We therefore consider whether materially similar cases or general Fourth Amendment principles gave Jones fair warning that it was unconstitutional for police officers to increase their use of physical force after an arrestee who has been resisting arrest stops resisting for several seconds and warns them that they are hurting his previously injured ankle.\n\nWe conclude that Jones had such notice. In Smith v. Mattox, 127 F.3d 1416 (11th Cir. 1997), the Eleventh Circuit denied qualified immunity to a police officer accused of breaking the plaintiff's arm while putting on handcuffs.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e According to the plaintiff, he was at his mother's house when a uniformed police officer, acting on a tip from an informant, entered the yard. The plaintiff then \"raised [a] baseball bat in a threatening posture\" and ignored the officer's order to drop it. Id. at 1418. When the officer threatened to shoot, the plaintiff fled. He soon encountered the police officer again, and then plaintiff \"docilely submitted to arrest upon [the officer's] request for him to 'get down.'\" Id. In the process of putting on handcuffs, the officer bent the plaintiff's arm in a way that caused discomfort. Id. When the plaintiff complained, the police officer, \"with a grunt and a blow - but no sign of anger,\" broke his arm so severely that it required surgery for multiple fractures. Id. The court concluded that such use of force would be excessive and that the officer was not entitled to qualified immunity. Id.\n\nAlthough Smith helps to demonstrate that the law protecting Jennings from Jones' increased use of force was clearly established, our conclusion does not depend on this strikingly similar case. Instead, Smith emphasizes the obvious unconstitutionality of increasing the force used on an arrestee to such a degree that a broken ankle results, after the arrestee has ceased resisting for several seconds and stated that the force already used is hurting his previously injured ankle. The Supreme Court has explained that\n\ngeneral statements of the law are not inherently incapable of giving fair and clear warning, and in other instances a general constitutional rule already identified in the decisional law may apply with obvious clarity to the specific conduct in question, even though 'the very action in question has [not] previously been held unlawful.'\n\nLanier, 520 U.S. at 271 (1997)(citation omitted). Accordingly, we conclude that Jones' conduct was such an obvious violation of the Fourth Amendment's general prohibition on unreasonable force that a reasonable officer would not have required prior case law on point to be on notice that his conduct was unlawful. Indeed, even in Smith, which was decided six years before the incident at issue here, the court concluded that the law was clearly established against the use of increased force on a suspect no longer offering resistance because \"the unlawfulness of the conduct is readily apparent even without clarifying caselaw.\" 127 F.3d at 1420.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nOther circuits have rejected qualified immunity without a prior case exactly on point. In Rice v. Burks, 999 F.2d 1172 (7th Cir. 1993), the Seventh Circuit noted that a plaintiff can defeat a qualified immunity defense\n\nwithout identifying a closely analogous case if he show[s] that the force used was so plainly excessive that the police officers should have been on notice that they were violating the Fourth Amendment. Indeed, police officers should not be shielded from liability just because their excessive use of force happens to be original.\n\nId. at 1174 (internal citations omitted). Similarly, other courts have found that case law is not required where the constitutional violation is obvious. See, e.g., Gray ex rel. Alexander v. Bostic, 458 F.3d 1295, 1306 (11th Cir. 2006)(rejecting qualified immunity for handcuffing compliant nine-year-old girl because \"[e]ven in the absence of factually similar case law, an official can have fair warning that his conduct is unconstitutional when the constitutional violation is obvious\"); Smith, 127 F.3d at 1419 (stating that law is clearly established when \"the official's conduct lies so obviously at the very core of what the Fourth Amendment prohibits that the unlawfulness of the conduct was readily apparent to the official, notwithstanding the lack of case law\"); Casteel v. Pieschek, 3 F.3d 1050, 1053 (7th Cir. 1993) (stating that plaintiffs may show that the violation was clearly established using \"either a closely analogous case or evidence that the defendants' conduct is so patently violative of the constitutional right that reasonable officials would know without guidance from the courts\").\n\nAlthough the dissent professes to accept, arguendo, that Jones increased the force he used to restrain Jennings after Jennings had ceased resisting for several seconds, it continues to describe a different version of events with the cases it cites to show that the law was not clearly established. Some of these cases involve the use, rather than the increase, of force.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Others are inapplicable because the arrestee was still resistant.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Critically, these cases do not address the key conduct at issue here: the increased use of force on a previously resisting but now non-resisting arrestee.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e The dissent's reliance on such cases demonstrates its refusal to acknowledge that Jones' increased use of force was integral to Jennings' excessive force claim and that, consistent with our obligation to take the facts in the light most favorable to the jury verdict, we must accept this version of the facts in evaluating qualified immunity.\n\nWhen an individual has been forcibly restrained by several officers, has ceased resisting arrest for several seconds, and has advised the officers that the force they are already using is hurting a previously injured ankle, we cannot think of any basis for increasing the force used to such a degree that a broken ankle results. At the time of Jones' action, both existing caselaw and general Fourth Amendment principles had clearly established that this use of force was excessive in violation of the Constitution.\n\nC. Prong Three: Whether a Reasonable Officer Would Have Believed a Violation Occurred\n\nThe final prong of the qualified immunity analysis is \"whether an objectively reasonable official would have believed that the action taken violated that clearly established constitutional right.\" Starlight, 253 F.3d at 141. As we have previously explained, \"[i]t is not always evident at the time an official takes an action that a clearly established right is involved. For example, the factual situation might be ambiguous or the application of the legal standard to the precise facts at issue might be difficult.\" Riverdale Mills, 392 F.3d at 61. Thus, even if an officer's conduct violated clearly established Fourth Amendment law, he may still be eligible for qualified immunity if he was reasonably mistaken as to the degree of force he should have used.\n\nAt first glance, this inquiry appears indistinguishable from that in the first prong. Both involve the reasonableness of the officer's conduct. However, the key distinction is that prong one deals with whether the officer's conduct was objectively unreasonable, whereas prong three deals with whether an objectively reasonable officer would have believed the conduct was unreasonable. See Saucier, 533 U.S. at 204-05 (explaining that \"claims of excessive force in the context of arrests . . . should be analyzed under the Fourth Amendment's 'objective reasonableness standard'\" but that \"[i]f the officer's mistake as to what the law requires is reasonable . . . the officer is entitled to the immunity defense\" (internal citation omitted)).\n\nThe third prong analysis seems nonsensical at first blush because, in effect, officers receive protection if they acted reasonably in exercising unreasonable force. In Anderson v. Creighton, 483 U.S. 635, 643 (1987), the Supreme Court acknowledged the argument made by the appellant in that case that \"[i]t is not possible . . . to say that one `reasonably' acted unreasonably.\" However, the Court excused this apparent contradiction as merely linguistic, explaining:\n\nWe have frequently observed, and our many cases on the point amply demonstrate, the difficulty of determining whether particular searches or seizures comport with the Fourth Amendment. Law enforcement officers whose judgments in making these difficult determinations are objectively legally reasonable should no more be held personally liable in damages than should officials making analogous determinations in other areas of law.\n\nId. at 644 (internal citation omitted). Thus, qualified immunity affords protection to officers who reasonably, yet mistakenly, employ excessive force in violation of the Fourth Amendment.\n\nAgain, we are sympathetic to the situation that Jones confronted. Jennings had to be subdued while he was resisting arrest, and the chaos caused by his struggle may have made it difficult for Jones to gauge the appropriate level of force. These circumstances would arguably allow a reasonable officer in Jones' circumstances to believe that it was lawful to maintain the level of force he used even after Jones ceased resisting.\n\nHowever, we reiterate that we must take the facts in the light most favorable to the jury verdict. See, e.g., Iacobucci v. Boulter, 193 F.3d 14, 23 (1st Cir. 1999). Thus, we accept that Jones increased, rather than merely maintained, the force he applied to Jennings' ankle, even after Jennings had ceased resisting and stated that Jones was hurting his previously injured ankle.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nUnder such circumstances, even the \"added measure of protection\" provided by the third prong of the qualified immunity analysis does not insulate Jones from damages. Cox v. Haney, 391 F.3d 25 (1st Cir. 2004). We find that an objectively reasonable officer in Jones' circumstances would not have believed that it was lawful to increase the amount of force that he used after Jennings ceased resisting and stated that Jones was hurting him.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nBecause the first and third prongs of the qualified immunity analysis are so closely related in these Fourth Amendment excessive force cases, the evidence that supports our conclusion on the first prong, that a reasonable jury could have found that the force Jones used was unreasonable, is likewise relevant here, on the third prong, to demonstrate that an objectively reasonable officer in Jones' position would have believed that the force used was unreasonable. More specifically, Officer Delaney's testimony about the training that officers receive and the Use of Force Continuum is relevant both to the prong one question of whether there was a violation at all and to the prong three question, which we address here, of whether a reasonable officer in Jones' circumstances would have believed that his conduct violated the Constitution.\n\nOfficer Delaney's testimony about the training that officers undergo and the Use of Force Continuum made clear that officers should adjust their force in a manner proportional to the resistance offered by the arrestee. Instead, Jones adjusted his force inversely, increasing the force he used after Jennings stopped resisting and stated that the restraint was causing him pain. Under such circumstances, a reasonable officer would have believed that increasing his use of force would violate Jennings' constitutional right to be free from excessive force.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nThe district court concluded that Jones was entitled to qualified immunity because a reasonable officer in his position would not have believed that his conduct violated Jennings' constitutional rights. However, this conclusion again indicates that the court did not construe the facts in the light most favorable to the jury verdict. In discussing the third prong of the qualified immunity analysis, the court stated that \"the evidence clearly demonstrates that, even if he was mistaken, Jones reasonably could have believed that his utilization of the ankle turn control technique was lawful.\" (Emphasis added.) As we have repeatedly emphasized, the conduct at issue was not the mere utilization of the technique, but rather the increase of force after Jennings ceased resisting. It is this increased force that an objectively reasonable officer would not have believed was lawful.\n\nThe dissent once again avoids the central issue - Jones' use of increased force on a nonresisting arrestee - by describing Jones' conduct and Delaney's testimony in sanitized terms. It states that \"Jones testified that he tried to secure Jennings' ankle,\" emphasizes Delaney's testimony that \"it was appropriate for Jones to continue using the same compliance technique,\" and refers repeatedly to the \"use\" of the ankle turn control technique. (Emphases added.) These characterizations ignore the view of the facts we must take in light of the jury verdict and, consequently, result in a misapplication of the qualified immunity analysis.\n\nIn light of the circumstances, we hold that a reasonable officer in Jones' position would have believed that increasing the force with which he restrained Jennings was a violation of Jennings' constitutional right to be free from excessive force. Thus, Jones is not entitled to qualified immunity.\n\nIV.\n\nAt the close of trial, Jones filed a motion for judgment as a matter of law and alternative motions for a new trial and a remittitur. After granting his motion for judgment as a matter of law, the district court held that the alternative motions were moot. This holding was error. Federal Rule of Civil Procedure 50(c)(1) requires the district court to rule conditionally on such motions in the event that the grant of judgment as a matter of law is overruled on appeal. However, Jones made no request that the district court rule on the motions after it said they were moot. Critically, on appeal, Jones has not raised any argument for a new trial or a remittitur, and, indeed, has not even mentioned that he filed these motions before the district court.\n\nAs a supplement to the basic rule that parties must raise their arguments on appeal to preserve them, Rule 50 alerts parties who have received a favorable grant of judgment as a matter of law (but whose alternative motion for a new trial has been conditionally denied) that, on appeal, they should raise arguments for a new trial to protect themselves in case the appellate court reverses. In light of Jones' failure to obtain a conditional ruling on his motions for a new trial and a remittitur from the district court and his complete silence on appeal as to these motions, we follow the approach adopted by four of the five courts of appeals that have considered this situation and find that Jones has abandoned these motions.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nA. Rule 50\n\nAs noted, the district court erred in failing to dispose of the motions for a new trial and a remittitur.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Rule 50 explains that, \"[i]f the renewed motion for judgment as a matter of law is granted, the court shall also rule on the motion for a new trial, if any, by determining whether it should be granted if the judgment is thereafter vacated or reversed.\" Fed. R. Civ. P. 50(c)(1). The court similarly erred in failing to dispose of the motion for a remittitur, which, pursuant to Rule 59(e), is inextricably linked to a motion for a new trial. In ruling on these related motions,\n\nthe court may condition a denial of the motion for a new trial upon the filing by the plaintiff of a remittitur in a stated amount. In this way the plaintiff is given the option of either submitting to a new trial or of accepting the amount of damages that the court considers justified.\n\n11 Charles Alan Wright, Arthur R. Miller \u0026 Mary Kay Kane, Federal Practice and Procedure § 2815 (2d ed. 1995). Thus, the principles applicable to a motion for a new trial logically govern a motion for remittitur.\n\nAlthough Rule 50 does not explain the consequences of a district court's failure to issue a conditional grant or denial of a motion for a new trial, this silence is not surprising: \"[r]ules seldom contemplate what will happen if they are disregarded.\" Mays v. Pioneer Lumber Corp., 502 F.2d 106, 110 (4th Cir. 1974). However, by its explicit terms, Rule 50 alerts a party who has received judgment as a matter of law that he should protect himself on appeal by raising his arguments for a new trial. Rule 50(c)(1), which discusses situations in which a renewed motion for judgment as a matter of law is granted, states that, \"[i]n case the motion for a new trial has been conditionally denied, the appellee on appeal may assert error in that denial.\" This language describes a situation closely analogous to that in which Jones found himself. Like the Rule 50(c)(1) appellee, Jones won judgment as a matter of law from the court. Like the Rule 50(c)(1) appellee, Jones did not receive a favorable ruling on his new trial motion from the district court. Thus, Rule 50(c)(1) provides for a party who has prevailed on a motion for judgment as a matter of law but who has not received a favorable ruling on a motion for a new trial to \"assert error\" by arguing in the alternative that the district court should have granted his motion for a new trial, in the event that the grant of judgment as a matter of law is reversed on appeal.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nThe dissent argues that because the district court held Jones' motion for a new trial moot rather than denying the motion, Jones had no responsibility to raise the new trial issue on appeal. However, Rule 50(c)(1) clearly contemplates that, whether a motion for a new trial is conditionally granted or denied, that conditional ruling will come before the court of appeals along with the favorable ruling of the trial court on the defendant's motion for judgment as a matter of law. If the trial court conditionally grants the defendant's motion for a new trial in conjunction with granting the defendant's motion for judgment as a matter of law, the plaintiff will include that conditional ruling on the new trial motion in its appeal.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e If the trial court denies the defendant's motion for a new trial in conjunction with granting the defendant's motion for judgment as a matter of law, the defendant, as appellee, should challenge that ruling on appeal.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e The position of the dissent - that the district court's erroneous mootness \"ruling\" on Jones' motion for a new trial absolved Jones of any responsibility to raise the new trial motion on appeal - contravenes the objective of Rule 50(c)(1): to allow the court of appeals to address the rulings on the motions for judgment as a matter of law and a new trial at the same time.\n\nThat objective is unmistakable from the language of Rule 50(c)(1), and that language gave Jones notice that, as a Rule 50(c)(1) appellee, he should have protected himself on appeal despite the trial court's erroneous mootness ruling on his new trial motion.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e Moreover, even cursory research reveals many cases in which a party who received a favorable grant of judgment as a matter of law raised, on appeal, the fact that the district court failed to rule conditionally on its motion for a new trial. See, e.g., Guile v. United States, 422 F.3d 221, 231 n.14 (5th Cir. 2005); Freund v. Nycomed Amersham, 347 F.3d 752, 765 (9th Cir. 2003); Selph v. Farmer Bros., 56 Fed. Appx. 399, 399 (9th Cir. 2003)(unpublished disposition). Coupled with the strong background presumption that parties must raise arguments on appeal to preserve them, the provisions of Rule 50 gave Jones more than adequate notice that he should preserve his arguments for a new trial and a remittitur by at least raising these motions on appeal even if he did not pursue them in the district court. Jones said nothing about these motions throughout the appellate process.\n\nB. Relevant Precedents\n\nOur review of the precedents also establishes that Jones has abandoned his motions. Although the Supreme Court has not considered the precise situation we now confront, its most relevant decision is consistent with our holding. Moreover, our holding is identical to that of four of the five circuits that have confronted a situation in which a party who has been granted judgment as a matter of law fails to obtain a conditional ruling on its motion for a new trial before the district court and fails to argue for a new trial on appeal.\n\nIn Neely v. Martin K. Eby Construction Co., 386 U.S. 317, 319- 20 (1967), the Supreme Court held that, where the plaintiff won a jury verdict, the district court denied defendant's motions for judgment as a matter of law and for a new trial, and the plaintiff did not raise grounds for a new trial on appeal, the appellate court did not err in reversing the district court's denial of judgment as a matter of law and ordering judgment for defendant. Neely supports the result we reach here because it held that an appellate court has the authority to order a district court to enter final judgment following a reversal of the district court's ruling on judgment as a matter of law. Id. at 330. Importantly, Neely also emphasizes that a party who has received a favorable ruling on a motion for judgment as a matter of law (which in Neely was the trial court's denial of defendant's motion for judgment as a matter of law) can and should raise grounds for a new trial on appeal to protect itself in the event that the ruling on the motion for judgment as a matter of law is reversed on appeal. The Court explained that \"it should not be an undue burden [for appellee] to indicate in his brief why he is entitled to a new trial,\" id. at 328, and that \"Rule 50(d) makes express and adequate provision for the opportunity - which [appellee] had without this rule - to present his grounds for a new trial in the event his verdict is set aside by the court of appeals,\" id.\n\nAlthough Neely dealt with the application of Rule 50(d) to a plaintiff who loses his jury verdict on appeal (whereas here the jury verdict of the plaintiff is being reinstated), the dissent claims that Neely precludes the result we reach here. It bases this conclusion on Neely's statement that \"an appellate court may not order judgment . . . where the record reveals a new trial issue which has not been resolved.\" Id. at 325.\n\nThe dissent's reliance on this single statement is misguided because it wrests the quoted language from its context. Indeed, the complete statement of the Supreme Court is the following: \"[A]n appellate court may not order judgment where the verdict loser has failed strictly to comply with the procedural requirements of Rule [50(b)], or where the record reveals a new trial issue which has not been resolved.\" Id. Immediately prior to this quote, the Court describes four of its previous cases relating to the appellate review of a district court's ruling on a motion for judgment as a matter of law or a new trial. Id. at 324-25. Three of these cases dealt with the requirement, later captured in Rule 50(b), that a party must move for judgment as a matter of law at specified times during proceedings before the trial court. Id. Those cases are irrelevant to the proceedings here.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e In the fourth case, Weade v. Dichmann, Wright \u0026 Pugh, Inc., 337 U.S. 801, 804, 808-09 (1949), the plaintiff won a jury verdict, the trial court denied judgment as a matter of law, and the appellate court reversed and ordered judgment for the defendant. Finding \"suggestions in the complaint and evidence of alleged liability\" under an alternate theory, the Supreme Court ordered the decision modified so as to eliminate the direction to enter judgment, thereby giving the plaintiff who lost its jury verdict on appeal the opportunity to pursue a new trial. Id. at 809.\n\nIn light of this context, Neely's language instructing courts of appeals not to order judgment \"where the record reveals a new trial issue which has not been resolved\" is addressed to a situation where the plaintiff-appellee won a jury verdict and succeeded, before the district court, in resisting the motions of the defendant-appellant to deprive him of his verdict. As the Supreme Court makes clear in Neely, such a plaintiff-appellee, even prior to Rule 50(d), and now in light of the explicit terms of Rule 50(d), can raise on appeal an argument that he should get a new trial in the event that the appellate court decides that the trial court erred in denying the defendants-appellant's motion for judgment as a matter of law. Although this Rule 50(d) plaintiff- appellee never filed a motion for a new trial before the trial court because of his success in winning a jury verdict, the opportunity of the plaintiff-appellee to raise arguments for a new trial on appeal is justified by the importance of \"protect[ing] the rights of the party whose jury verdict has been set aside on appeal.\" Id. at 325. As the Court explains in Neely, \"[a] plaintiff whose jury verdict is set aside by the trial court on defendant's motion for judgment n.o.v. may ask the trial judge to grant a voluntary non-suit to give plaintiff another chance to fill a gap in his proof.\" Id. at 328. The Court then explains that a \"plaintiff-appellee should have this same opportunity when his verdict is set aside on appeal.\" Id. These statements demonstrate the Court's concern for the party who has received a jury verdict in his favor and who, if possible, should have his case resolved by a jury. It is in this particular context that the Court in Neely instructs that an appellate court may not order a judgment \"where the record reveals a new trial issue which has not been resolved.\" Id. at 325.\n\nThese special circumstances, however, are inapplicable to the situation we now consider under Rule 50(c)(1). Unlike the plaintiff in the Rule 50(d) situation, Jones as defendant filed a motion for a new trial in conjunction with his motion for judgment as a matter of law. Because Jones succeeded in his motion for judgment as a matter of law, the trial court took from Jennings the jury verdict that he had won. On appeal, with our decision that the trial court erred in taking Jennings' jury verdict from him, we are reinstating the jury verdict. Hence the concern of the Supreme Court in Neely for a plaintiff who is deprived of his jury verdict is not present here. Moreover, the failure of a plaintiff in the Neely scenario to press before the appellate court a new trial motion which the plaintiff never even made in the trial court is more understandable than the failure of Jones to press before us a new trial motion which he did make in the trial court. Even in the Neely scenario, however, where the Court affirmed the decision of the court of appeals to order entry of judgment for the defendant-appellant instead of awarding a new trial to the plaintiff-appellee, the Court emphasized the plaintiff-appellee's failure to raise any argument in favor of a new trial on appeal despite Rule 50(d)'s express provision of an opportunity to do so. See id. at 329-30.\n\nSubsequent to Neely, the Second, Fifth, Seventh, and Eleventh Circuits have held a motion for a new trial abandoned when the moving party fails to request that the district court rule conditionally on the motions and that party fails to raise the motions on appeal. We emphasize that Jones' failure to raise any argument for a new trial or a remittitur on appeal distinguishes his situation from the cases that the dissent cites in support of its proposition, in which the parties raised their arguments on appeal. See Bisbal-Ramos v. City of Mayaguez, 467 F.3d 16, 26 (1st Cir. 2006)(\"[Plaintiff] contends that the district court erred in reducing the jury's damages awards.\"); Systemized of New England, Inc. v. SCM, Inc., 732 F.2d 1030, 1037 (1st Cir. 1984)(\"On appeal, defendant presses three grounds for a new trial that were included in its original motion to the district court.\").\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nIn Oberman v. Dun \u0026 Bradstreet, Inc., 507 F.2d 349, 353 (7th Cir. 1974), the Seventh Circuit considered a case in which the trial court granted judgment as a matter of law but did not rule on an alternative motion for a new trial. The appellate panel noted that \"the defendant acquiesced in the trial court's actions, and here only urges that we affirm the grant of judgment n.o.v.\" Id. The court held that \"the motion for a new trial is abandoned if not pressed on the trial court after the grant of judgment n.o.v.,\" id., and has since reiterated this holding in the qualified immunity context, see Henderson v. DeRobertis, 940 F.2d 1055, 1057 n.1 (7th Cir. 1991).\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nThe Eleventh Circuit, in Edwards v. Board of Regents of the University of Georgia, 2 F.3d 382, 384 n.6 (11th Cir. 1993), likewise held that, where the \"[a]ppellee failed to pursue its motion for a new trial with the district court after the grant of j.n.o.v. and failed to argue for a ruling on that motion on this appeal[,] [w]e are not obliged to remand for such a ruling, and we deem that motion abandoned.\" See also Christopher v. Florida, 449 F.3d 1360, 1365 n.3 (11th Cir. 2006)(\"Where a Defendant fails to pursue his motion for a new trial with the district court after the court grants JMOL without making the alternative ruling required by Fed. R. Civ. P. 50(c)(1), and the Defendant fails to argue for a new trial ruling on appeal, this Court has treated the issue as abandoned.\" (Emphasis in original.)).\n\nThe Fifth Circuit also followed this approach in Arenson v. Southern University Law Center, 43 F.3d 194, 196 (5th Cir. 1995), a case which aptly demonstrates \"the delay and waste of judicial resources that can occur if parties are allowed to resuscitate dormant motions for new trial after the appeals court has once considered a judgment.\" There, after the plaintiff prevailed before a jury, the district court granted defendants' motion for judgment as a matter of law but did not rule on their alternative motion for a new trial. Id. at 195. On appeal, the court reversed the judgment of the district court and reinstated the jury's verdict. Id. Defendants then sought a ruling from the district court on their motion for a new trial. Id. at 196. The court granted the motion, and the defendants prevailed at the second trial. Id. On appeal for the second time, the Fifth Circuit held that the district court erred in granting defendants' motion for a new trial, explaining that \"when the defendants failed to seek a ruling from the district court on their motion for new trial and failed to mention the new trial motion on appeal, they had abandoned the motion.\" Id. (citing Johnstone v. Am. Oil Co., 7 F.3d at 1217, 1224 (5th Cir. 1993)). The court concluded that Rule 50 \"effectively set up a 'use-it-or-lose-it' system,\" requiring the party moving for a new trial to \"obtain a ruling for the benefit of the appellate court in case the judgment as a matter of law is reversed, or otherwise lose the right to the new trial.\" Id. at 198.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nThe Second Circuit reached the same result in Grant v. Hazelett Strip-Casting Corp., 880 F.2d 1564, 1571 (2d Cir. 1989), holding that it need not remand for decision on a motion for a new trial. The court held that \"[u]nder the circumstances of the case, including the fact that [defendant] fails to raise any reason for a new trial on appeal, we see no reason to deprive [plaintiff] of the benefit of the jury's verdict.\" Id. (internal citation omitted). While the court did not explicitly hold the new trial motion abandoned under such circumstances, it also made no attempt to decide on the merits whether a new trial was warranted. Consequently, its conclusion was the functional equivalent of deeming the motion abandoned.\n\nOnly one court has taken an opposite approach to these procedural circumstances. In Rhone Poulenc Rorer Pharmaceuticals Inc. v. Newman Glass Works, 112 F.3d 695, 698-99 (3d Cir. 1997), the Third Circuit held that \"prudence militates in favor of a remand so that the district court may consider\" the undecided motions because the appellate court was \"left with no record and, indeed, no guidance from the parties' briefs on appeal as to the merits of Defendant's new trial motion.\" However, the Third Circuit did not acknowledge, and consequently did not explain, its deviation from the previous cases of the Second, Fifth, Seventh, and Eleventh Circuits indicating that a motion for a new trial is abandoned under such procedural circumstances. We respectfully disagree with its unique perspective.\n\nIn support of its position, the dissent cites precedents from other circuits that are inapposite because, unlike Jones, the parties raised the new trial issue on appeal. In Freund v. Nycomed Amersham, 347 F.3d 752, 765 (9th Cir. 2003), the Ninth Circuit \"reject[ed] [plaintiff's] contention that [defendant] has waived its right to a new trial motion.\" Critically, however, the court noted that the defendant \"raised the issue at the first appropriate point in its appellate briefs.\" Id. The Freund defendant's articulation of grounds for a new trial on appeal contrasts starkly with Jones' silence, and consequently Freund is inapplicable here. Similarly, decisions from the Fourth and Eighth Circuits do not reveal whether the appellants raised their motions for new trial on appeal, and we therefore do not know whether those courts faced the situation confronting us or the situation in Freund. See Nodak Oil Co. v. Mobil Oil Corp., 526 F.2d 798, 798 (8th Cir. 1975); Mays v. Pioneer Lumber Corp., 502 F.2d 106, 109 (4th Cir. 1974).\n\nC. Other Considerations\n\nWe are mindful of the important considerations of judicial economy underlying Rule 50, which \"was adopted for the purpose of speeding litigation and preventing unnecessary retrials.\" Montgomery Ward \u0026 Co. v. Duncan, 311 U.S. 243, 250 (1940). If Jones had done what he should have done in the district court and on appeal with respect to the motions for a new trial and a remittitur, we could have addressed these motions as part of this appeal, the precise scenario contemplated by Rule 50. Remanding to the district court now to consider the motions for a new trial and a remittitur would result in \"exactly the type of piecemeal litigation that the framers of Rule 50(c)(1) sought to avoid,\" and we cannot condone \"the delay and waste of judicial resources\" that would ensue from such a decision. Arenson, 43 F.3d at 196.\n\nThe dissent sees the matter differently. Despite the trial court's failure to make a conditional ruling on Jones' motion for a new trial, as required by Rule 50(c)(1), and despite Jones' failures to obtain such a ruling from the trial court and to raise the new trial motion on appeal, also as contemplated by Rule 50(c)(1), and now after the exhaustive attention given by this panel to the trial court's erroneous decision to undo the jury verdict won by Jennings, the dissent insists that Jones should be permitted to go back to the trial court, tell the trial court that the new trial motion is no longer moot, and get the new trial that the dissent says the trial court is likely to grant.\n\nThere are multiple problems with this approach, beginning with the evident premise of the dissent that the question of whether or not there should now be a new trial is solely the business of the trial court and the court of appeals has no voice on the matter. That premise is directly contrary to Rule 50, which contemplates that an appellate court should deal with the district court's disposition of a motion for judgment as a matter of law and a motion for a new trial at the same time. If Jones had raised the new trial issue on appeal as he should have, we could have considered the merits of the new trial issue in the context of this appeal, at the same time as we addressed the trial court's ruling on the motion for judgment as a matter of law. In that circumstance, there would be no basis for the dissent's assumption that Jones is virtually entitled to a new trial. We might have agreed that there should be a new trial. We might have concluded that there should not be a new trial. We might have remanded the new trial issue to the trial court with guidance. But whatever the disposition of that new trial issue on appeal, our engagement with that issue on the basis of a record already before us, far from usurping the trial court's authority, would have been exactly the engagement contemplated by Rule 50.\n\nNow, despite the mistakes of Jones, the dissent says that we should leave the new trial issue to the trial court and virtually assure Jones a new trial. By excluding the appeals court from considering the new trial motion, that approach places Jones in a more favorable position than he would be in if he had complied with Rule 50. Such an approach sanctions the very piecemeal litigation that Rule 50 is designed to avoid, creating the possibility of multiple appeals from repetitive trials which may or may not have been justified. Moreover, the only circuit court decision to address the scenario described by the dissent held that such an approach was error. In Arenson, after the Fifth Circuit reversed the district court's grant of judgment as a matter of law for the defendant and reinstated the plaintiff's jury verdict, the defendant sought and received a favorable ruling from the district court on his previously undecided motion for a new trial. 43 F.3d at 195-96. After the defendant prevailed at the second trial, the plaintiff appealed the second judgment, and the Fifth Circuit held that the district court erred in granting a new trial. Id. at 195. As the Arenson court explained, the district court's error resulted in \"exactly the type of piecemeal litigation that the framers of Rule 50(c)(1) sought to avoid.\" Id. at 196. Although the dissent sees no problem with such piecemeal litigation, we view it as contrary both to the purpose of Rule 50 and to Arenson's explicit holding.\n\nBasic considerations of fairness also weigh against remanding to allow the district court to rule on the undecided motions when Jones alone is responsible for his failure to raise the motions on appeal. As we have discussed, Rule 50 provides notice to a party who has received a favorable grant of judgment as a matter of law that the possibility of a different outcome on appeal justifies addressing the alternative motions for a new trial and a remittitur both in the district court and on appeal.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e It would be manifestly unfair to Jennings, who has already won a jury verdict and secured a favorable ruling on appeal reinstating that verdict, if we were to allow the possibility of another trial despite Jones' failure to preserve his arguments for a new trial at any stage of the process.\n\nFinally, the dissent protests that we have addressed the motions for a new trial and a remittitur sua sponte. However, if we had overlooked the new trial and remittitur motions when we issued our decision (a real possibility given the failure of Jones to raise or even mention those motions on appeal), and Jones brought them to our attention for the first time in a petition for rehearing, we would undoubtedly hold, consistent with innumerable precedents, that he had missed his opportunity to request a remand so that the district court could rule on the motions. See, e.g., Johnson v. Mahoney, 424 F.3d 83, 96 (1st Cir. 2005)(\"'[A] party may not raise new and additional matters for the first time in a petition for rehearing.'\"(quoting United States v. Bongiorno, 110 F.3d 132, 133 (1st Cir. 1997))).\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Jones should not be able to gain an advantage from our recognition of an issue that he failed to raise.\n\nAll of these considerations persuade us that the four circuits that have deemed motions abandoned under these circumstances were correct. Consequently, we join these circuits in holding that, when a party fails to obtain a conditional ruling on his motions from the district court in compliance with Rule 50(c) and further fails to raise his motions for a new trial and a remittitur on appeal, he has abandoned his motions.\n\nV.\n\nWe conclude that the district court erred in granting judgment as a matter of law to appellee Jones based on qualified immunity. Jones' use of increased force after Jennings ceased resisting violated the Fourth Amendment, the law was clearly established, and a reasonable officer in Jones' circumstances would have believed that his conduct was a violation. Finally, Jones failed to obtain a conditional ruling from the district court on his motions for a new trial and a remittitur and has failed to raise these motions on appeal; consequently, we find these motions abandoned. Accordingly, the judgment of the district court is vacated and the jury verdict is hereby reinstated. All costs shall be awarded to the appellant.\n\nSo ordered.\n\n- Dissenting Opinion Follows -\n\nLYNCH, Circuit Judge, dissenting. With respect, I dissent. The majority opinion, in two holdings, adopts new rules for this circuit which, I believe, are wrongly decided and inconsistent with Supreme Court and circuit precedent.\n\nThe majority opinion holds that a trial court, to whom the ultimate decision on qualified immunity is granted, erred in granting qualified immunity; it committed error, the majority says, because a jury found by a general verdict that Officer Jones had used excessive force.\n\nThe majority opinion also adopts a new rule, a \"deemed abandonment\" theory, enters judgment itself against Officer Jones, and prohibits the district court from considering whether to grant Officer Jones' motion for new trial, which the district court previously had deemed moot. In situations where a defendant wins judgment as a matter of law (JMOL), but the trial judge erroneously determines that the defendant's accompanying motion for new trial is moot, the majority opinion holds that a defendant will be deemed to have abandoned the new trial motion where he did not ask the district court to reconsider its mootness ruling and, having failed to do so, he did not, as appellee, request on appeal that the new trial issue be remanded. Jennings, the appellant, has never briefed the new trial issue or asserted that Jones has either abandoned or waived his new trial motion. The majority sua sponte has now precluded Jones from returning to the district court to ask it to reconsider his motion for a new trial, a motion the court would likely grant.\n\nI. Relevant History\n\nIt is worth explaining how this situation, which arose from two mistakes by the trial judge (one of which the judge later acknowledged), came to pass.\n\nThe plaintiffs were permitted to amend their complaint shortly before the deadline for filing pretrial motions to give names to the John Doe state trooper defendants, including Officer Jones, and bring suit against them in their individual capacities. By the time of the pre-trial conference, the district court had apparently indicated a disinclination to resolve the matters of defense by summary judgment, noting that light would be shed on the facts at trial.\n\nAt the close of the plaintiff's evidence at trial, the officers moved for a ruling on their defenses, including the qualified immunity defense under Rule 50. The district court granted JMOL to defendants on a number of claims but, apparently overlooking the immunity issue, said the remaining claims stated an issue for the jury. At the close of all the evidence, but before the verdict, the remaining defendants renewed their motion for JMOL. The court granted judgment to all but three defendants, including Jones. After the verdict, the court ruled that it had erred in not granting the Rule 50 JMOL motion with respect to the § 1983 excessive force claim and the state law battery claim against Jones. Jennings v. Pare, No. 03-572-T, 2005 WL 2043945, at *5 (D.R.I. Aug. 24, 2005).\n\nThe jury returned a verdict against Jones on the excessive force claim under the Fourth Amendment and awarded damages of $301,100. The jury verdict simply stated, \"As to the claims by Adam Jennings against Kenneth Jones, Fourth Amendment claim for excessive force, the jury finds for the plaintiff, Adam Jennings.\" There were no special interrogatories which the jury answered to make specific findings of fact.\n\nAfter the jury verdict, Jones filed three motions: for remittitur under Rule 59(e); for JMOL under Rule 50(b); and for a new trial under Rule 59. The trial court allowed Jones' motion for JMOL and decided that the other two motions were, accordingly, moot. Id. at *1. Judgment was entered for Jones simultaneously with the court's ruling on the three motions. In light of the requirements of Rule 50(c)(1), the court erred in holding the new trial motion was moot; it should have ruled on the merits of the new trial motion.\n\nIn granting JMOL, the court held that despite the jury verdict Officer Jones was nonetheless entitled to immunity. Id. The district court found that, accepting that the force used was unreasonable and excessive, the officer was entitled to immunity under the second and third prongs of the analysis because (1) clearly established law did not fairly warn the officer his actions were unconstitutional, and (2) even if the law was clearly established so as to give the officer fair notice that his actions were unconstitutional, the court still concluded that \"Jones reasonably could have believed that his utilization of the ankle turn control technique was lawful.\" Id. at *10-11.\n\nII. Qualified Immunity\n\nAppellate review of the immunity conclusion is de novo. Whalen v. Mass. Trial Court, 397 F.3d 19, 23 (1st Cir. 2005).\n\nTwo particular rules apply in this situation. Under Hunter v. Bryant, 502 U.S. 224 (1991), the question of immunity is an issue for the trial court, not the jury, to determine. Id. at 228. The Supreme Court has not yet addressed the question of what role jury findings play in the judicial immunity determination, nor has this circuit. See, e.g., Kelley v. LaForce, 288 F.3d 1, 7 n.2 (1st Cir. 2002) (\"[T]he Supreme Court has not clearly indicated whether the judge may act as fact-finder when there is a factual dispute underlying the qualified immunity defense or whether this function must be fulfilled by a jury.\"); Ringuette v. City of Fall River, 146 F.3d 1, 6 (1st Cir. 1998) (\"Something of a 'black hole' exists in the law as to how to resolve factual disputes pertaining to qualified immunity when they cannot be resolved on summary judgment prior to trial.\"). No clear answer has emerged from the circuits. Gasperini v. Center for Humanities, Inc., 518 U.S. 415 (1996), cited by the majority, is not an immunity case and does not resolve this question, which we have recognized as being open in the years since Gasperini was decided.\n\nSecondly, the merits inquiry about whether an officer used excessive force does not resolve the immunity inquiry. Saucier v. Katz, 533 U.S. 194, 204-06 (2001). A holding on the merits is not dispositive of the issue of qualified immunity. Cookish v. Powell, 945 F.2d 441, 443 (1st Cir. 1991). Thus, whatever deference is owed to the jury findings on prong one of immunity, the court was free to grant immunity, as it did, on prongs two and three. The officer here could both have applied excessive force and, at the same time, be entitled to immunity: an officer in Jones' position could have reasonably believed he was not violating constitutional rights. Saucier, 533 U.S. at 206. The district court recognized this, and there is no inconsistency between its conclusion that Jones is entitled to immunity and the jury verdict.\n\nThe district court summarized its reasons for granting immunity\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nFirst, Jennings failed to present any evidence that Jones' actions deviated from the standard of conduct that should have been expected from an objectively reasonable police officer under the circumstances. Second, even if Jones' use of the \"ankle turn control technique\" is viewed as amounting to excessive force it did not violate any \"clearly established\" constitutional prohibition. Finally, the undisputed evidence demonstrates that it was \"objectively reasonable\" for Jones to believe that he was acting lawfully.\n\nJennings, 2005 WL 2043945, at *5.\n\nIn reviewing the district court's grant of immunity on JMOL, I assume arguendo that the evidence is taken in the light most favorable to the jury verdict.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\nA. Effect of the Jury's Verdict\n\nTwo thoughts should be removed from the picture at the outset. First, Jones did not break Jennings' ankle with reckless or callous indifference to Jennings' federal rights. Second, he did not knowingly violate the law. The jury verdict cannot, as a matter of law, be taken to establish these points because they were not elements of the claim that went to the jury. There was no basis for punitive damages here. See Smith v. Wade, 461 U.S. 30, 56 (1983) (punitive damages under § 1983 available only \"when the defendant's conduct . . . involves reckless or callous indifference to the federally protected rights of others\"). Indeed, the law of this case is that the evidence was insufficient to support such a finding. See Mandel v. Boston Phoenix, Inc., 456 F.3d 198, 210 (1st Cir. 2006). Although the amended complaint sought punitive damages, the district court held that there was no basis in the evidence to instruct the jury on the issue. Further, plaintiff did not object to the lack of jury instructions on punitive damages, and he does not challenge the omission of such instructions on appeal. Moreover, on the evidence it is clear that Jones was not \"plainly incompetent,\" and he did not \"knowingly violate the law.\" Malley v. Briggs, 475 U.S. 335, 341 (1986). So denial of immunity cannot rest on those grounds.\n\nIn my view, the majority's reversal of the trial judge's grant of immunity undercuts the interests protected by the immunity doctrine. The purposes of granting qualified immunity include: avoiding \"excessive disruption of government,\" Harlow v. Fitzgerald, 457 U.S. 800, 818 (1982); giving \"a fairly wide zone of protection in close cases,\" Roy v. Inhabitants of Lewiston, 42 F.3d 691, 695 (1st Cir. 1994); allowing officers \"reasonably [to] anticipate when their conduct may give rise to liability for damages,\" Davis v. Scherer, 468 U.S. 183, 195 (1984); providing \"ample room for mistaken judgments,\" Malley, 475 U.S. at 343; shielding officers from liability when the law did not clearly proscribe the actions they took, Mitchell v. Forsyth, 472 U.S. 511, 528 (1985); and protecting \"all but the plainly incompetent or those who knowingly violate the law,\" Malley, 475 U.S. at 341. The common theme of protecting reasonable judgment calls by officers, such as this one, exists throughout qualified immunity law.\n\nIt is not inconsistent for an officer to have violated constitutional rights, as the jury found here, but still be entitled to immunity on the various prongs (described below) of the immunity test. See Sallier v. Brooks, 343 F.3d 868, 871-72, 879-80 (6th Cir. 2003) (holding that prison clerks were entitled to immunity despite jury verdict against them because it was not clearly established at the time that mail from the courts was protected \"legal mail\"); Figg v. Schroeder, 312 F.3d 625, 636-37 (4th Cir. 2002) (holding that officers were entitled to qualified immunity on first prong of test despite jury verdict because evidence at trial did not establish unreasonableness of seizures under the Fourth Amendment); Clue v. Johnson, 179 F.3d 57, 60, 61-62 (2d Cir. 1999) (holding that transit authority director was entitled to immunity despite jury verdict for plaintiffs because law was not clearly established at the time that plaintiffs' activities were constitutionally protected from employer retaliation); Warlick v. Cross, 969 F.2d 303, 310 (7th Cir. 1992) (holding that, although jury found officer not to have had probable cause for arrest, officer was entitled to immunity because law was not clearly established as to circumstances in which officer found himself).\n\nThe majority reasons that the jury, by its general verdict, necessarily found that (1) Jennings had stopped resisting and had announced his prior ankle injury, and (2) Jones nonetheless increased the twisting pressure on Jennings' ankle and broke it. The majority's reasoning entails a bit of legal fiction, since we do not know what the jury found and these facts certainly were not necessary to the verdict.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e On this record, there is considerable ambiguity and no certainty about what underlying factual conclusions motivated the general verdict.\n\nThis is an important issue. It is true that where the question is whether there is sufficient evidence to support a jury verdict (the usual question on a motion for JMOL), the appellate court will take all facts in favor of the verdict. But there is no attack on the sufficiency of the jury verdict, as to at least the second and third prongs of the immunity analysis. The attack is on the trial judge's separate conclusion, a determination assigned to the judge and not the jury, that Jones is entitled to immunity. This raises the question of how the judge, in evaluating immunity, is required to treat a general jury verdict, and that is precisely the type of black hole in the law we discussed in Ringuette, 146 F.3d at 6, and in Kelley, 288 F.3d at 7 n.2.\n\nFurther, as a matter of logic, it does not necessarily follow from a rule that a general verdict will be upheld by taking facts in favor of the verdict when a number of theories could support the verdict, that the jury has found a particular combination of facts, or that the judge, on the immunity issue, must deem the jury to have found particular facts. Indeed, the majority acknowledges that the trial judge here thought the jury verdict was based on a different theory and facts other than the two facts the majority now insists were found.\n\nThese are important issues on which it would be helpful to have guidance from the Supreme Court. But ultimately this case need not resolve those issues because I believe the majority is wrong, even within its own set of assumptions. Even if we assume, arguendo,\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e that the rule that facts must be taken in support of the verdict permits the majority to assume its two facts, the district court's finding of qualified immunity must nonetheless stand. I will assume arguendo that Jennings met the first prong. Even so, the officer is nonetheless entitled to immunity on the next two prongs.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\n\nB. Second Prong: Clearly Established Law\n\nOfficer Jones was undisputably acting within the scope of his authority and his discretion. The burden then is on plaintiff to demonstrate the existence of clearly established constitutional law which the officer is said to have violated. Davis, 468 U.S. at 197; Horta v. Sullivan, 4 F.3d 2, 13 (1st Cir. 1993).\n\nThe second prong of the qualified immunity test asks whether the constitutional right in question was \"'clearly established at the time of the alleged violation' such that a reasonable officer would 'be on notice that [his] conduct [was] unlawful.'\" Riverdale Mills Corp. v. Pimpare, 392 F.3d 55, 61 (1st Cir. 2004) (alterations in original) (quoting Suboh v. Dist. Attorney's Office, 298 F.3d 81, 90 (1st Cir. 2002)); see also Saucier, 533 U.S. at 202. This inquiry is a specific one, in which it is necessary to consider the particular circumstances faced by the officer. See Saucier, 533 U.S. at 201 (\"This inquiry [under the second prong] . . . must be undertaken in light of the specific context of the case, not as a broad general proposition.\"); see also Brosseau v. Haugen, 543 U.S. 194, 199-200 (2004); Suboh, 298 F.3d at 90. Although the facts of prior cases need not be \"exactly on all fours with the facts of this case\" in order to conclude that a right was clearly established, Suboh, 298 F.3d at 94, \"the prior case law must give the officer reasonable notice that the specific conduct [he] is alleged to have committed in this litigation is unlawful,\" Riverdale Mills, 392 F.3d at 66. Again, the burden is on the plaintiff to make this showing, and the district court correctly held that plaintiff had failed.\n\nIn the end, the majority's holding that the law was so clearly established as to put the officer on clear notice that his overall use of force, even increasing force, when the detainee had stopped struggling (regardless of other circumstances) was unconstitutional rests on two propositions. The first is that clear notice is established by a single case from the Eleventh Circuit which is said to be so close to this case as to have put Jones on appropriate notice. The second is that there is no need for particularized notice because notice of general principles is enough. Indeed, the majority goes so far as to reason that it should have been perfectly obvious to Jones that his use of force was excessive, despite the fact that the only expert testimony was directly to the contrary and the district court, which heard the case, concluded otherwise. The jury verdict made no conclusion on this issue, nor could it have.\n\n1. Lack of Prior Case Law\n\nThere is no First Circuit case which gave Jones appropriate notice, nor is there a clear consensus of other persuasive authority giving such notice.\n\nTo start, a single opinion from another circuit is not, as a matter of law, sufficient to meet the plaintiff's burden of showing the law is clearly established. In Wilson v. Layne, 526 U.S. 603 (1999), the Supreme Court concluded that the law on a particular issue was not clearly established, and stated:\n\n[Plaintiffs] have not brought to our attention any cases of controlling authority in their jurisdiction at the time of the incident which clearly established the rule on which they seek to rely, nor have they identified a consensus of cases of persuasive authority such that a reasonable officer could not have believed that his actions were lawful.\n\nId. at 617 (emphases added). Wilson rejected reliance on one case as sufficient. Id. at 616-17. The case there, parenthetically, was a summary judgment case, id. at 608, like Smith v. Mattox, 127 F.3d 1416 (11th Cir. 1997), on which the majority relies.\n\nIn Brady v. Dill, 187 F.3d 104 (1st Cir. 1999), we expressly adopted Wilson's holding in concluding that the law was not clearly established at the time of the defendants' conduct. Id. at 116. We also applied the Wilson rule without dispute in Savard v. Rhode Island, 338 F.3d 23, 28 (1st Cir. 2003) (equally divided en banc court). The majority thus cannot rely on the single decision of Smith v. Mattox to give fair notice.\n\nFurther, Smith does not provide such fair notice to the officer, but supports the view that immunity was correctly granted. Smith merely affirmed the district court's denial of summary judgment on qualified immunity grounds because inferences, just barely, could be drawn that the force used was obviously and patently excessive. Id. at 1419. In Smith, the plaintiff had earlier threatened the officer with a baseball bat, but had then dropped the bat, run through a backyard, down a driveway, and into another street, and then returned to the driveway of his mother's house, where the officer found him. Smith said he then docilely submitted to arrest, got down on the ground as requested, and offered no resistance. Nonetheless, the officer struck him a blow which broke his arm in multiple places. Id. at 1418. Notably, Smith held that other inferences would permit a finder of fact to conclude that the officer had behaved reasonably. That was because\n\neven if Smith was not actively resisting arrest at the very moment the force was applied, he was before that moment; [the officer] could reasonably have believed that without some force restraining Smith, he would have resumed either his attacks or his flight. Thus, it was not unreasonable for [the officer] to think that he was entitled to use some force to put Smith into cuffing posture.\n\nId. Smith does not help Jennings; it helps Jones. The majority also argues that Jones offered no contrary precedent to Smith. That is not true, and the majority confuses who has the burden to show clear notice.\n\nOther court of appeals cases, in addition to Smith, tend to support the constitutionality of Jones' actions and so undercut plaintiff's claims that Jones was on clear notice from prior case law that his particular application of force was unreasonable. Many of these cases involve situations, as here, where officers were attempting to handcuff an individual who had been resistant. See Rodriguez v. Farrell, 294 F.3d 1276, 1278-79 (11th Cir. 2002) (finding no excessive force, and noting that an officer need not credit an arrestee's claims of pain, especially when the arrestee is in the process of being handcuffed); Jackson v. City of Bremerton, 268 F.3d 646, 650-53 (9th Cir. 2001) (finding no excessive force where plaintiff suffered a fractured finger after officer pushed plaintiff to the ground for purpose of handcuffing her despite being told of pre-existing back and shoulder injuries, and where plaintiff had earlier posed a threat to officers' safety and ability to control a crowd); Huang v. Harris County, No. 00-20806, 2001 WL 822534, at *10 (5th Cir. June 22, 2001) (holding that force was reasonable where officer broke resisting arrestee's thumb by twisting her wrist, in an effort to \"prevent her from kicking him . . . and place her in handcuffs\"); Brownell v. Figel, 950 F.2d 1285, 1288, 1293 (7th Cir. 1991) (finding no constitutional deprivation where officers employed two different pain techniques, application of pressure on the plaintiff's knuckles and on a nerve behind his jaw); Eberle v. City of Anaheim, 901 F.2d 814, 820 (9th Cir. 1990) (upholding the use of a \"finger control hold\" to remove a belligerent spectator from a sports arena). Under these cases, an officer in Jones' position could reasonably have concluded that his conduct was not unconstitutional.\n\n2. Need for Particularity and Obviousness\n\nFor a variety of Fourth Amendment claims involving reasonableness and judgment calls, this circuit has required that plaintiff refer to particularized prior cases with similar facts. E.g., Buchanan v. Maine, 469 F.3d 158, 168-69 (1st Cir. 2006); Riverdale Mills, 392 F.3d at 65-66; Napier v. Town of Windham, 187 F.3d 177, 189 (1st Cir. 1999). That is because the Fourth Amendment's touchstone of reasonableness generally requires careful consideration of the totality of the circumstances. \"[F]or the most part per se rules are inappropriate in the Fourth Amendment context,\" and consideration of the \"totality of the circumstances\" is required. United States v. Drayton, 536 U.S. 194, 201, 207 (2002).\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nIn excessive force cases, our rule is that there is an even greater emphasis on the requirement of particularity, where officers act under pressure and must make very quick judgments. See Wilson, 526 U.S. at 615 (\"[T]he right allegedly violated must be defined at the appropriate level of specificity before a court can determine if it was clearly established.\"); Priester v. City of Riviera Beach, 208 F.3d 919, 926 (11th Cir. 2000) (observing that \"generally no bright line exists for identifying when force is excessive\").\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e The test for excessive force \"does not always give a clear answer as to whether a particular application of force will be deemed excessive by the courts. This is the nature of a test which must accommodate limitless factual circumstances.\" Saucier, 533 U.S. at 205. \"[T]he Supreme Court has cautioned that in many cases the generalized holdings of [Tennessee v. Garner, 471 U.S. 1 (1985),] and [Graham v. Connor, 490 U.S. 386 (1989),] will not provide sufficient notice to police officers\" as to what constitutes excessive force. Whitfield v. Mel*ndez-Rivera, 431 F.3d 1, 8 (1st Cir. 2005). As reasoned above, Jennings has not provided any such particularized prior case.\n\nThere is an exception to the need for particularized prior law where the police conduct is so excessive and lies so obviously at the core of what the Fourth Amendment prohibits that the unlawfulness of the conduct would have been readily apparent to an officer. See United States v. Lanier, 520 U.S. 259, 270-71 (1997); Brady, 187 F.3d at 116. The majority tries to fit within this exception. It reasons that it was so obvious that the use of force was excessive that Jones was clearly on notice for purposes of the second prong. The majority attempts to justify its obviousness conclusion by saying there is a clear and obvious dividing line between use of force and increased use of force. It cites no cases for that point, and the case law, described earlier, goes the other way. The majority's conclusion is not supported by the facts or by the case law.\n\nAs the district court pointed out, there are no cases holding that the use of the ankle turn control technique, which itself involves the use of varying degrees of force, is unconstitutional. Jennings, 2005 WL 2043945, at *9. Indeed, the use of pain, even when an individual complains of pain, is an established technique to bring an arrestee under control and to prevent possible injury to an officer. Case law has clearly established that the use of similar application-of- pressure techniques, even those involving increasing amounts of pain, does not amount to excessive force. There certainly are cases in which an officer's use of force is so obviously excessive that the officer is on clear notice; this is not one of them.\n\nC. Third Prong: Whether an Objectively Reasonable Officer Could Have Concluded that Jones' Actions Were Lawful\n\nThe third prong of our qualified immunity test asks \"whether a reasonable officer could have concluded that his actions did not violate [the] plaintiff['s] constitutional rights.\" Tremblay v. McClellan, 350 F.3d 195, 199 (1st Cir. 2003). This inquiry acknowledges that \"law enforcement officials will in some cases reasonably but mistakenly conclude that [their conduct] is . . . lawful.\" Anderson v. Creighton, 483 U.S. 635, 641 (1987). In Saucier, the Supreme Court explained how the third prong applies in excessive force cases:\n\nIt is sometimes difficult for an officer to determine how the relevant legal doctrine, here excessive force, will apply to the factual situation the officer confronts. An officer might correctly perceive all of the relevant facts but have a mistaken understanding as to whether a particular amount of force is legal in those circumstances. If the officer's mistake as to what the law requires is reasonable, however, the officer is entitled to the immunity defense.\n\n533 U.S. at 205.\n\nUnder the third prong, an officer who makes \"a reasonable judgment call\" is entitled to qualified immunity. Buchanan, 469 F.3d at 170. \"The calculus of reasonableness must embody allowance for the fact that police officers are often forced to make split-second judgments -- in circumstances that are tense, uncertain, and rapidly evolving -- about the amount of force that is necessary in a particular situation.\" Graham, 490 U.S. at 396-97. On these facts, an objectively reasonable officer could have believed that Jones' use of force -- and its degree - - was lawful.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\nThere are a number of reasons for this. First, this was an instance of quick judgment by an officer in a chaotic situation. The district court stated that the entire series of these events took place in a chaotic scene over the course of about one minute. The key events, from when Officer Hill got up from the floor to when Jennings shouted in pain, took place within \"several seconds.\" Jennings has represented the time in question to last anywhere from twelve to eighteen seconds. In this short time frame, a reasonable officer easily could have made mistakes as to Jennings' degree of resistance, the degree of risk Jennings posed to the officers, and the appropriate level of force to employ.\n\nConcern over the safety of the officers and others was entirely reasonable. Jones testified he tried to secure Jennings' ankle both for his own safety, to prevent Jennings from kicking him while he was kneeling next to Jennings, and to lessen Jennings' resistance to arrest. He was also concerned that Jennings might have a weapon because he could not see Jennings' hands. Jennings himself acknowledged that at least one of his hands was not visible for a time. There is no doubt Jennings was resisting the officers earlier in the encounter. That was shown in the videotape.\n\nEven if Jennings had just stopped kicking and flailing, the undisputed evidence demonstrates that (1) Jennings was not totally secured at the time his ankle was broken, (2) Jennings had posed a threat to the safety of the officers and others just seconds before, (3) the officers were having a difficult time getting the flex cuffs on Jennings, and (4) Jones' overall use of force was, in the opinion of the expert, reasonable under the circumstances.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e Lt. Delaney, the only expert witness on use of force, testified that until Jennings was \"totally cuffed up and secured,\"\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e it was appropriate for Jones to continue using the same compliance technique as he had, and alternative compliance techniques were not acceptable. Not even Jennings asserts that he was secured in handcuffs at the time his ankle was broken. Nor did any of his witnesses. Jennings asserted only that he had stopped moving and was not resisting arrest. And Officer Hill was clear that Jennings was not in cuffs when Hill stood up. Indeed, Hill got out of the way because other officers were having trouble cuffing Jennings.\n\nThe majority says it is irrelevant that Jennings was not handcuffed; the only important consideration is that Jennings had stopped struggling. Not so. Jennings had just been subdued by Hill; Hill then got up and Jennings could, until he was cuffed, have started up again at any time. An officer could reasonably view this as a time of great risk, and even greater risk than when Hill had subdued Jennings. The majority claims that expert testimony supports its view that any increase in force once Jones stopped struggling was unreasonable. The expert said just the opposite. Delaney testified that the degree of force was a judgment call, and that resistance was one factor and risk was another. Even if Jones were wrong about the degree of risk, his judgment was not unreasonable.\n\nJennings' argument is that regardless of whether he was cuffed, and even if the ankle turn control technique is acceptable, Jones applied the technique with too much force. But that is precisely in the area of judgment calls which are protected by qualified immunity. The district court directly addressed the degree of force or tension which Jones applied to the ankle, concluding that\n\n[t]he ambiguity of the factual situation confronting Jones; the \"split second\" nature of the decision that he was required to make; the existence of established departmental policy permitting use of the ankle control technique under such circumstances; and the absence of any case law prohibiting its use, virtually compel the conclusion that it was objectively reasonable for Jones to believe that he acted lawfully.\n\nJennings, 2005 WL 2043945, at *11.\n\nUnder our case law, the district court committed no error in finding qualified immunity on the basis that this was a protected judgment call. See Buchanan, 469 F.3d at 170; Cox v. Hainey, 391 F.3d 25, 31-32 (1st Cir. 2004); Vargas-Badillo v. Diaz-Torres, 114 F.3d 3, 7 (1st Cir. 1997).\n\nIII. Motion for a New Trial\n\nEven if the majority were correct to reverse the district court's grant of JMOL, the appropriate remedy would be to remand to the district court for reconsideration of the defendant's motion for a new trial.\n\nThe majority sua sponte holds that a defendant who files both a JMOL motion on which he prevails on immunity grounds and a new trial motion that is found to be moot will be deemed to have abandoned his new trial motion if he does not move the trial court to reconsider its mootness ruling on the new trial motion, and he then does not as appellee raise the new trial motion on appellant's appeal from the grant of JMOL, even though appellant never raises the issue on appeal.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e The majority says its new rule depends upon a combination of both of these circumstances. Jennings did not raise the issue or seek this relief, and the issue has never been briefed or argued to us.\n\nThis sua sponte \"deemed abandoned\" holding, I believe, is wrong on the merits, is contrary to controlling circuit and Supreme Court precedent, misapplies both the judicially crafted doctrine of abandonment and the precedent on which the majority purportedly rests, and is inconsistent with the plain language of Federal Rule of Civil Procedure 50.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e Under the Supreme Court's decision in Neely v. Martin K. Eby Construction Co., 386 U.S. 317 (1967), and our circuit precedent, we must remand to the district court so that it can decide the substantial new trial question.\n\nThe majority's analysis is flawed for a number of different reasons. Under controlling First Circuit law, there is no abandonment here at either the trial or appellate level by Jones. The deemed abandonment doctrine as articulated in the cases on which the majority relies has no application where a defendant does not abandon an issue, but does obtain a ruling in the trial court on a new trial motion, as here. That doctrine, even on its own terms (which involve a failure by a trial court to take action on a new trial motion), has been rejected by a number of circuits and has never been accepted by this court. The defendant has not abandoned his new trial motion by not mentioning it in his brief as appellee, particularly where appellant has not mentioned the issue. Further, Federal Rule of Civil Procedure 50 by its plain language, which does not create such an abandonment doctrine, establishes that the majority's position is in error.\n\nThe majority also errs in that its ruling is flatly contrary to an important constraint on appellate power. While this court does have a constrained authority, when it reverses a grant of JMOL, to decide whether to remand a new trial motion to the district court, it must exercise that authority in such a way as not to usurp the trial court's role. Here, it is evident that the trial court is likely to grant the new trial motion, not deny it, and the appellate court cannot exercise its appellate power to deny the motion by deeming it abandoned. On the merits of the motion, apart from the deemed abandonment, no appellate court could find that a grant of a new trial was an abuse of discretion.\n\nAn appeals court may in certain circumstances consider the merits of a new trial motion. Rule 50 provides for such a situation; but, as I discuss below, Rule 50 does not authorize such review here. Much more importantly, the Supreme Court has held that the authority of an appellate court to rule on a new trial motion is constrained, and that where the new trial motion has merit, the court of appeals may not itself deny the motion. Neely, 386 U.S. at 325. That is also our circuit law as set forth in Systemized of New England, Inc. v. SCM, Inc., 732 F.2d 1030, 1036-37 (1st Cir. 1984).\n\nFurthermore, the majority is incorrect that the only circuit court decision to address the situation before us has held that a remand was error. In Rhone Poulenc Rorer Pharmaceuticals Inc. v. Newman Glass Works, 112 F.3d 695 (3d Cir. 1997), the Third Circuit was faced with this situation, and it held that a remand for consideration of the merits of the new trial motion was the only appropriate course. Id. at 698-99. Moreover, as I discuss in detail below, the approach taken by the Fifth Circuit in Arenson v. Southern University Law Center, 43 F.3d 194 (5th Cir. 1995), on which the dissent so heavily relies, has been rejected by a majority of circuits and has never been adopted by this circuit. Indeed, such an approach is entirely inconsistent with our decision in Systemized.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e See 732 F.2d at 1036-37.\n\nI explain my disagreement with the majority in more detail below.\n\nA. There Was No Abandonment\n\nThe majority confuses the judicially crafted abandonment rule, applies it where it is inapplicable, and radically extends the rule in a way that conflicts with the Federal Rules of Civil Procedure. It is black letter law that an issue can be abandoned in the trial court. See, e.g., Simon v. Navon, 71 F.3d 9, 13 (1st Cir. 1995) (\"The district court rejected the [defendants'] post-trial motion for judgment as a matter of law because they failed to make that request at the close of all evidence, thus forfeiting the right to such a determination. Once abandoned, a claim . . . may not be revived on appeal except upon a showing of plain error resulting in a manifest miscarriage of justice.\" (citations omitted)); accord Watkins v. J \u0026 S Oil Co., 164 F.3d 55, 58 (1st Cir. 1998); Martinez Moll v. Levitt \u0026 Sons of P.R., Inc., 583 F.2d 565, 570 (1st Cir. 1978).\n\nAn issue can also be abandoned on appeal. See, e.g., Martinez v. Colon, 54 F.3d 980, 990 (1st Cir. 1995); accord Ryan v. Royal Ins. Co. of Am., 916 F.2d 731, 734 (1st Cir. 1990); United States v. Zannino, 895 F.2d 1, 17 (1st Cir. 1990). The majority deems the new trial issue to have been abandoned by Jones at both levels. I will discuss these separately.\n\n1. Abandonment in the Trial Court\n\nThere clearly was no abandonment in the trial court. Jones pressed his motion for a new trial and received a ruling on it. That ruling (of mootness) was incorrect. The incorrectness of the ruling cannot mean the party abandoned the motion.\n\nThe majority's deemed abandonment rule rests on the mistaken premise that this situation is the equivalent of Jones' not pressing the new trial issue below and so not obtaining a ruling. A minority of circuits have viewed the failure of a party to press a new trial motion in the trial court to obtain a ruling and then subsequent failure to discuss the issue on appeal as a deemed abandonment; the majority of circuits have not, as discussed below.\n\nThis circuit has never adopted such a deemed abandonment rule, and the majority's new rule is contrary to circuit precedent. Indeed, we have not deemed a motion for new trial to be abandoned by a party when a trial judge erroneously ruled that the grant of a judgment notwithstanding the verdict mooted the need for a ruling on a new trial motion. See Systemized, 732 F.2d at 1036-37. Rather, this court held that because of the possible merit of the new trial motion, it was required to remand the new trial motion to the trial court for its determination. See id.\n\nSystemized established that the correct framing of the question in such circumstances is not one of abandonment, but of whether there was possible merit to a new trial motion, and if so, then a remand to the trial court was required. See id. at 1037 (\"Our only course is to remand to the district court for a determination of whether to grant a new trial or order a remittitur on plaintiff's verdict.\"). We followed the same course in United States v. Moran, 312 F.3d 480 (1st Cir. 2002), in which we reversed a judgment of acquittal, reinstated the jury verdict, and remanded to the district court to consider an alternative motion for a new trial that had not yet been ruled upon. See id. at 494.\n\nWhen we have reversed entry by the trial court of a directed verdict or JNOV, we routinely have remanded to the district court to decide the new trial issue. Indeed, we have sometimes decided that inherent in the trial court's reasons for granting such a directed verdict or JNOV, despite reversal of the verdict on appeal, are reasons why a new trial must be granted, and we have remanded and ordered a new trial.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e See, e.g., Jodoin v. Toyota Motor Corp., 284 F.3d 272, 280-81 (1st Cir. 2002); Decato v. Travelers Ins. Co., 379 F.2d 796, 799 (1st Cir. 1967); Gebhard v. Royce Aluminum Corp., 296 F.2d 17, 19 (1st Cir. 1961). Here, the trial court in its reasoning signaled, but did not hold, that it would grant a new trial.\n\nFurther, this circuit has no rule requiring parties to move for reconsideration of erroneous rulings on motions or be deemed to have abandoned the motion. Nor do we require a party for whom judgment has entered to file a post-judgment motion to reconsider the court's decision on a different motion not embodied in the judgment. For instance, when a district court fails to properly follow remittitur rules, we do not require that the aggrieved party move for reconsideration before the district court or be deemed to have abandoned the issue. Rather, we remand to the district court to properly apply the rules by giving the party a choice between a reduced award and a new trial. See, e.g., Bisbal-Ramos v. City of Mayaguez, 467 F.3d 16, 26-27 (1st Cir. 2006).\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e The majority cannot evade the law of this circuit by looking to law from other circuits.\n\nEven were law from other circuits germane, the deemed abandonment discussion only comes up when the party has failed to press the motion in the trial court. That did not happen here, so there is no basis to even consider applying such a rule. The majority attempts to avoid this obvious conclusion by arguing, in effect, that because the trial court erred in saying the new trial motion was moot, that is the equivalent of the situation in which the trial court simply fails to address an issue at all. That is self-evidently not so.\n\nIndeed, the deemed abandonment cases from the Fifth, Seventh, and Eleventh Circuits cited by the majority (and rejected by a greater number of other circuits) defeat, not support, application of the majority's deemed abandonment rule on the facts of this case. In Oberman v. Dun \u0026 Bradstreet, Inc., 507 F.2d 349 (7th Cir. 1974), the Seventh Circuit held that alternative motions for new trial not pressed on the district court after grant of JMOL are abandoned. Id. at 353. Moreover, the Seventh Circuit has not always applied even this rule. In a later case, Isaksen v. Vt. Castings, Inc., 825 F.2d 1158 (7th Cir. 1987), the court, after reversing a grant of JMOL, remanded an undecided new trial motion to the district court for consideration.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e Id. at 1165.\n\nThe Fifth Circuit, citing the Oberman decision, in Johnstone v. American Oil Co., 7 F.3d 1217, 1224 (5th Cir. 1993), mandate recalled, 17 F.3d 728 (5th Cir. 1994), and Arenson v. Southern University Law Center, 43 F.3d 194, 196 (5th Cir. 1995), has held that \"when the defendants failed to seek a ruling from the district court on their motion for new trial and failed to mention the new trial motion on appeal, they abandoned the motion,\" id. at 196. In discussing its rule, the Fifth Circuit suggested that its concern lay primarily with the defendant's failure to alert the trial court to its procedural error. Id. Here there was no procedural error of overlooking the motion and not ruling on it; rather the court committed substantive error in holding the motion moot.\n\nThe Eleventh Circuit in Edwards v. Board of Regents of the University of Georgia, 2 F.3d 382 (11th Cir. 1993), appeared to adopt the deemed abandonment rule when it held that a party had abandoned a new trial motion on which the district court had not ruled and which the appellee had not raised on appeal. Id. at 384 n.6. More recently, the Eleventh Circuit has stressed that its rule has two parts and said it would not apply the rule unless the movant had abandoned the new trial motion by failing to obtain a ruling on it in the trial court and had waived the motion by failing to raise it on appeal. See Christopher v. Florida, 449 F.3d 1360, 1365 n.3 (11th Cir. 2006). In Christopher, the movant had not obtained a ruling in the trial court but did request that the appellate court grant it a new trial on appeal. The Christopher court, far from considering the motion abandoned, accepted that on the facts of the case the trial judge would have conditionally granted the motion, reviewed that grant of a new trial for abuse of discretion considering the arguments presented by both sides on appeal, and agreed that a new trial was proper. Id. at 1365 \u0026 n.3.\n\nIn all of those cases, the courts of appeals noted that the district court had failed to rule at all on the alternative motion for a new trial. Arenson, 43 F.3d at 195; Johnstone, 7 F.3d at 1224; Edwards, 2 F.3d at 383 n.4; Oberman, 507 F.2d at 353. Because the movants had not brought this oversight to the attention of the district courts, the motions were deemed abandoned in the district court. Arenson, 43 F.3d at 196; Johnstone, 7 F.3d at 1224; Edwards, 2 F.3d at 384 n.6; Oberman, 507 F.2d at 353. By contrast, the district court did rule on Jones' motion for a new trial; it ruled that the motion was moot. There was no failure by the trial court to rule on a pending motion at all.\n\nBut even this deemed abandonment rule has been rejected as unsound in at least five of our sister circuits, whose law is more consistent with the law of this circuit. The Third Circuit has explicitly rejected the deemed abandonment rule. In Rhone Poulenc, the Third Circuit reversed the district court's grant of JMOL and then considered how to treat a motion for a new trial on which no conditional ruling had been granted and which had been dismissed as moot. Id. at 698-99. The court concluded that \"[b]ased on the grounds raised in the new trial motion and [the] lack of any trial record or argument before [it] on the issue, . . . prudence militate[d] in favor of a remand.\" Id. at 699.\n\nThe Ninth Circuit also has explicitly rejected the rule that failure to secure a conditional ruling on an alternative new trial motion may be deemed abandonment of that motion in the trial court. In Freund v. Nycomed Amersham, 347 F.3d 752 (9th Cir. 2003),\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e the Ninth Circuit stated:\n\nWhen a district court fails to enter a Rule 50(c) conditional order on a new trial motion, \"we have discretion to either remand to the district court to let it decide the new trial motion or to decide the new trial motion ourselves.\" . . . We . . . reject [plaintiff]'s contention that [defendant] waived its right to a new trial by not drawing the district court's attention to its failure to make a conditional ruling as required by Rule 50(c).\n\nId. at 764 (quoting Acosta v. City \u0026 County of S.F., 83 F.3d 1143, 1149 (9th Cir. 1996)). The court \"decline[d]\" to follow a rule that \"a litigant who fails to secure a Rule 50(c) conditional ruling in the district court loses the right to a new trial if the judgment as a matter of law is reversed.\" Id. at 765. It clearly rejected any argument that a defendant waives his new trial motion if he does \"not draw the district court's attention to its failure to make a conditional ruling as required by Rule 50(c).\" Id. The court further noted that in ruling the new trial motion moot the district court had not failed to rule, and held that there was no waiver. Id.\n\nThe Second and Fourth Circuits have impliedly rejected the majority's rule. The majority cites, in supposed support of its new rule, Grant v. Hazelett Strip-Casting Corp., 880 F.2d 1564 (2d Cir. 1989). In Grant, the Second Circuit was concerned with the different problem of the remedial powers of the federal appellate courts. It held that courts of appeal may decide themselves whether the circumstances of a particular case warrant their deciding the new trial issue rather than remanding to the district court for such a determination. It stated: \"[I]f the court of appeals may reverse the grant of a new trial and order entry of judgment on the verdict, and it seems settled that we may do so, it would seem absurd to hold that the remedy is circumscribed by the failure of the district judge to follow the command of rule 50(c) to rule on the motion for a new trial.\" Id. at 1571 (second emphasis added) (quoting Mays v. Pioneer Lumber Corp., 502 F.2d 106, 110 (4th Cir. 1974)) (internal quotation marks omitted). The court then determined for itself that in that case there was no basis for a new trial. Id. (\"Under the circumstances of this case, including the fact that HSCC fails to raise any reason for a new trial on appeal, we see no reason to deprive Grant of the benefit of the jury's verdict.\" (citation omitted) (citing Oberman, 507 F.2d at 353)).\n\nSimilarly, in Mays v. Pioneer Lumber Corp., 502 F.2d 106, the Fourth Circuit necessarily rejected the majority's conception of abandonment in the trial court when it determined that an appellate court may itself consider on the merits whether a new trial is appropriate. See id. at 110. The court then determined, based on the facts of the case, including the fact that the case already had been tried twice, that a new trial was not warranted and so there was no point in a remand. Id. The court never stated, nor even suggested, that the new trial motion had been abandoned in the trial court, saying only that it thought that \"no useful purpose would be served by remanding to the district judge to entertain and decide a renewed motion for a new trial.\" Id.\n\nAt most, Grant and Mays adopt the sensible rule, which is utterly contrary to the majority's position, that an appellate court may decide on the merits that there is no point in remanding for consideration of a new trial motion when it is clear that a new trial cannot be granted. If there had been abandonment of the new trial motion, the Second and Fourth Circuits would not have considered the merits of the remedies of remand or new trial at all; yet the appellate courts did consider on the merits whether they should remand.\n\nFinally, the Eighth Circuit, in Nodak Oil Co. v. Mobil Oil Corp., 526 F.2d 798 (8th Cir. 1975), when confronted with a new trial motion on which the district court had failed to rule, did not hold the motion abandoned. Id. at 798-99. Instead, the court retained jurisdiction over the appeal and remanded the case to the district court for the purpose of ruling on the new trial motion, instructing the district court to certify its ruling to the court. Id. at 799. The Nodak Oil court did not even consider the possibility that the new trial motion had been abandoned by the movant's failure to obtain a conditional ruling.\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e\n\n2. Abandonment on Appeal\n\nTo the extent the majority opinion is based on its view that Jones independently abandoned the issue by not raising it as appellee in these circumstances, its rule is wrong. Again, the majority's new deemed abandonment rule is a radical reworking of the otherwise sound principle that an argument may be abandoned on appeal. That reworking is prohibited by the law.\n\nThe cases on which the majority relies all involve the purported abandonment of an issue at the trial court level followed by a failure to mention the issue on appeal. None of those cases supports the majority's new rule that because Jones, as appellee, did not mention the issue in his brief in response to Jennings's appeal he has nonetheless abandoned the issue.\n\nNormally, on appeal, the abandonment rule is applied to an appellant who does not raise an issue in his initial brief on appeal. See generally 16A C. Wright et al., Federal Practice \u0026 Procedure § 3974.1, at 501 \u0026 n.12 (3d ed. 1999); see also Frazier v. Bailey, 957 F.2d 920, 932 n.4 (1st Cir. 1992) (using language of waiver); accord Piazza v. Aponte Roque, 909 F.2d 35, 37 (1st Cir. 1990). Even this abandonment rule for appellants is subject to exception. See United States v. Tracy, 989 F.2d 1279 (1st Cir. 1993).\n\nHere, Jones is not the appellant, but the appellee. It is black letter law that a party may appeal only judgments adverse to him. In re Shkolnikov, 470 F.3d 22, 24 (1st Cir. 2006); see also Lindheimer v. Ill. Bell Tel. Co., 292 U.S. 151, 176 (1934); W.W. Windle Co. v. Comm'r, 550 F.2d 43, 45 (1st Cir. 1977). Here, the district court issued no judgment against Jones. Like the appellant in Shkolnikov, Jones prevailed below. \"It is an abecedarian rule that a party cannot prosecute an appeal from a judgment in its favor.\" Shkolnikov, 470 F.3d at 24. Adoption of a rule requiring Jones to appeal or cross-appeal from the district court's mootness ruling on his new trial motion, which was not a judgment against Jones, is flatly barred by Shkolnikov.\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e Circuit precedent thus dictates that Jones can be only an appellee in this case. Since Jones was not required to appeal or cross-appeal the mootness ruling, he cannot have abandoned it on appeal.\n\nFurther, this circuit does not require appellees to brief issues or have them deemed abandoned when those issues are not raised by the appellant. Rather, it is appellant who waives those issues not adequately raised in his brief. Playboy Enters., Inc. v. Pub. Serv. Comm'n of P.R., 906 F.2d 25, 40 (1st Cir. 1990) (\"An appellant waives any issue which it does not adequately raise in its initial brief, because in 'preparing briefs and arguments, an appellee is entitled to rely on the content of an appellant's brief for the scope of the issues appealed.'\" (quoting Pignons S.A. de Mecanique v. Polaroid Corp., 701 F.2d 1, 3 (1st Cir. 1983))); cf. Zannino, 895 F.2d at 17 (\"[I]ssues adverted to in a perfunctory manner, unaccompanied by some effort at developed argumentation, are deemed waived.\"). Jennings did not raise this issue, and it cannot be that Jones was required to raise the issue himself or be deemed to have abandoned it.\n\nThe majority points out that Jones could have raised the issue of his new trial motion in his brief, even if Jennings did not. That is not the question. Perhaps Jones' brief, instead of simply asking for affirmance of the qualified immunity ruling in his favor, might have added another line saying that if the court of appeals reversed judgment in favor of Jones on qualified immunity, it should remand the issue of a new trial to the district court for a ruling on the merits of the new trial motion. The majority holds, contrary to law, that the lack of such a statement, which is not required, constitutes abandonment on appeal. It does not.\n\nThe majority's response is that Rule 50 required Jones to somehow raise the issue or abandon it. The flaws in that reasoning are described next.\n\nB. Federal Rule of Civil Procedure 50\n\nThe majority's deemed abandonment rule not only is not supported, but also is refuted, by the plain language of Federal Rule of Civil Procedure 50, which governs motions for JMOL and alternative motions for a new trial. The portion of Rule 50 that is pertinent is Rule 50(c)(1), which provides:\n\nIf the renewed motion for judgment as a matter of law is granted, the court shall also rule on the motion for a new trial, if any, by determining whether it should be granted if the judgment is thereafter vacated or reversed, and shall specify the grounds for granting or denying the motion for the new trial. If the motion for a new trial is thus conditionally granted, the order thereon does not affect the finality of the judgment. In case the motion for a new trial has been conditionally granted and the judgment is reversed on appeal, the new trial shall proceed unless the appellate court has otherwise ordered. In case the motion for a new trial has been conditionally denied, the appellee on appeal may assert error in that denial; and if the judgment is reversed on appeal, subsequent proceedings shall be in accordance with the order of the appellate court.\n\nRule 50(c)(1) has two pertinent parts. It imposes an obligation on a trial judge to issue a conditional ruling on an alternative motion for new trial. It does not, however, authorize the majority's deemed abandonment rule, which penalizes a party when a district court erroneously holds the new trial motion is moot. Rule 50(c)(1) contains no requirement that a party who prevails on a motion for JMOL request that the district court reconsider its ruling that the alternative new trial motion is moot, nor that such a party raise the motion on appeal, in order to preserve the motion for a new trial.\n\nRule 50(c)(1) also provides for the situations in which the court issues a conditional order granting a new trial and when it issues a conditional order denying a new trial. It does not set rules for when the district court does neither. Rule 50(c)(1) says that ordinarily when a conditional new trial motion has been granted, the court of appeals should remand for a new trial. If, however, the conditional order denies the new trial motion, the appellee may assert error to the appellate court in that denial. In both cases, the appellate court will have the benefit of the trial court's reasoning on the new trial issue. Here, there is no such denial and no such reasoning to review.\n\nThe majority argues that the situation before us is the functional equivalent of that contemplated by Rule 50(c)(1), and that the rule therefore supports its position. It argues that Jones, like the Rule 50(c)(1) appellee, having failed to obtain a favorable ruling on the new trial motion, could have protected himself by arguing to this court that in the event the appellate court overturned the district court's grant of JMOL, the appellate court should grant a new trial. The majority is incorrect to assert that Jones is in the same position as the Rule 50(c)(1) appellee, whose new trial motion has been denied. At the most basic level, an appellee such as Jones has made a motion for a new trial in the district court, the merits of which remain to be considered if the grant of JMOL is reversed. The Rule 50(c)(1) appellee, by contrast, has had his new trial motion denied. It is particularly inappropriate for the majority to attempt to analogize since the trial court's reasoning strongly implies that it would grant, not deny, a motion for a new trial.\n\nMoreover, the text of Rule 50(c)(1) is incompatible with any such functional analysis. The plain language of Rule 50(c)(1) itself makes clear that a party whose new trial motion is deemed moot is not required to raise his new trial motion on appeal. The majority's attempt to impose any such requirement on appellees such as Jones simply is not permissible. See Pavelic \u0026 LeFlore v. Marvel Entm't Group, 493 U.S. 120, 123 (1989).\n\nBy contrast to Rule 50(c), Rule 50(d) states that \"[i]f the motion for JMOL is denied, the party who prevailed on that motion may, as appellee, assert grounds entitling the party to a new trial in the event the appellate court concludes that the trial court erred in denying the motion for judgment\" (emphases added). The Rule gives permission to the party who obtained a denial of another party's motion for JMOL to assert on appeal grounds for why a new trial should be granted in the event the appellate court finds that the trial court erred in denying the JMOL. The permission Rule 50(d) gives does not apply where, as here, the appellate court finds the trial court erred in granting the motion for JMOL.\n\nIf Rule 50 were meant to require anything, on pain of abandonment, of parties whose new trial motions are deemed moot because they have prevailed on a motion for judgment as a matter of law, it would have said so. Cf. Miss. Band of Choctaw Indians v. Holyfield, 490 U.S. 30, 47 n.22 (1989) (\"[H]ad Congress intended a state-law definition of domicile, it would have said so. Where Congress did intend that [the Act's] terms be defined by reference to other than federal law, it stated this explicitly.\"). This court is bound to apply the Rules as they are written; we have no freedom to stretch the text of Rule 50 to create requirements that the drafters specifically declined to impose. Pavelic \u0026 LeFlore, 493 U.S. at 123 (\"We give the Federal Rules of Civil Procedure their plain meaning.\"); cf. Unitherm Food Sys., Inc. v. Swift- Eckrich, Inc., 126 S.Ct. 980, 985-87 (2006) (reversing a court of appeals' grant of a new trial to a party who had not moved for a new trial in the district court, and holding that \"a party is not entitled to pursue a new trial on appeal unless that party makes an appropriate post-verdict motion in the district court\" in compliance with Rule 50).\n\nC. Conflict with Supreme Court Precedent\n\nThe Supreme Court's decision in Neely does not support the majority; rather, it establishes that the majority has exceeded its appellate authority. In Neely, the question was whether the court of appeals, after reversing denial of a defendant's Rule 50(b) motion for JNOV, where plaintiff's evidence was insufficient to get to the jury, may itself order dismissal or direct entry of judgment for defendant when the district court had denied the defendant's motion for a new trial as well. 386 U.S. at 319-20. The Court held that Rule 50(d) was applicable because the trial court had denied the JNOV. Id. at 323. It also noted that Rule 50(c)(1) operated in the manner described earlier in this opinion. Id. at 322-23. For these reasons, Neely offers no help to the majority.\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e\n\nNeely stresses that the remedial power of the courts of appeals to address the new trial issue is limited, and the court of appeals may not usurp the role of the trial court. The Supreme Court held that an appellate court may not order entry of judgment \"where the record reveals a new trial issue which has not been resolved.\" Id. at 325. Neely emphasizes the need usually to defer to the trial judge's perspective on new trial matters. See id.\n\nThe Supreme Court more recently characterized Neely as \"reiterat[ing] the value of the district court's input, [and] cautioning the courts of appeals to be '\"constantly alert\" to \"the trial judge's first-hand knowledge of witnesses, testimony, and issues.\"'\" Unitherm Food Sys., Inc., 126 S.Ct. at 986 n.3 (quoting Weisgram v. Marley Co., 528 U.S. 440, 443 (2000) (quoting Neely, 386 U.S. at 325)). The trial judge's first-hand knowledge is directly at stake in Jones' new trial motion, and the majority should have deferred to the trial court here.\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e See Iacurci, 387 U.S. at 88 (holding that where the meaning of the jury's verdict was not clear in light of the trial court's jury instructions, \"the Court of Appeals erred in directing entry of judgment for respondent; the case should have been remanded to the Trial Judge, who was in the best position to pass upon the question of a new trial in light of the evidence, his charge to the jury, and the jury's verdict\").\n\nThis panel is not at liberty to adopt a rule that is at odds with our own precedent, with Rule 50, and with Neely. Regrettably, in my view the majority has done precisely that.\n\nIV.\n\nFor the reasons stated above, I respectfully dissent as to both of the majority's holdings.\n\n\u003cspan class=\"fn\"\u003e1. This court addressed other issues arising out of this dispute in Narragansett Indian Tribe v. Rhode Island, 449 F.3d 16 (1st Cir. 2006)(en banc), which provides further background on the events that precipitated the search of the smoke shop.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. There is some uncertainty as to the precise length of time that elapsed between the time that Hill got up and the time that Jennings yelled in pain. In his closing argument to the jury, Jennings' attorney described the interval as \"twelve seconds at least,\" while Jennings' appellate brief describes the interval as eighteen seconds, citing only to the videotape of the incident. Although the videotape was played for the jury several times at trial and the jury also viewed the videotape during its deliberations, no one actually testified to the length of time that elapsed. Jones' appellate brief describes the time as \"12-15 seconds\" without citation. Consequently, we will describe the length of time as \"several seconds.\" Dictionaries typically define \"several\" as \"being more than two but fewer than many in number or kind.\" See Random House Dictionary of the English Language 1754 (2d ed. 1987). While this definition is necessarily inexact, we can do no better with this record.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. This case originally was brought by Jennings, his mother Paulla Dove Jennings, and Keith Huertas, another employee of the smoke shop. The plaintiffs alleged a wide array of claims against various defendants, including excessive force under the Fourth Amendment, violation of equal protection under the Fourteenth Amendment, negligent infliction of emotional distress, intentional infliction of emotional distress, false imprisonment, and assault and battery. Aside from Jennings' excessive force and battery claims against Jones, all the claims were resolved in defendants' favor, either by the court on defendants' motions for judgment as a matter of law or by the jury in its verdict. No other plaintiffs or defendants are involved in this appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The government explains that it did not file a pretrial motion raising the qualified immunity issue because Jones and other officers were not named in their individual capacities until shortly before the deadline for filing motions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. At this juncture, the court granted judgment as a matter of law on various other claims that have no bearing on this appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. At this juncture, the court again granted judgment as a matter of law on various other claims that have no bearing on this appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. As we shall explain, this ruling of mootness was incorrect. See infra Section IV.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. On appeal, Jennings does not contest the district court's grant of judgment as a matter of law with respect to his state law battery claim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Our conclusion that a reasonable jury could have found that Jones increased the force he used after Jennings had already ceased resisting is based on the principle that we must view the evidence in the light most favorable to the jury verdict. This conclusion does not depend on the substance of the opening statements and closing arguments. However, the opening statements and closing arguments emphasize that this principle is consistent with the way that the case was argued to the jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. To buttress this criticism, the dissent relies on an idiosyncratic and distinguishable case. In Iacurci v. Lummus Co., 387 U.S. 86, 86-87 (1967), the jury was instructed that, if it found that a \"hoist\" was negligently designed, it should indicate which of five specified design aspects was found unsafe by answering \"yes\" or \"no\" to five questions on a special interrogatory form. The jury found negligent design, but answered only one question in the affirmative, leaving the other four blank. Id. at 87. From this lack of response, the appellate court concluded that the jury would have answered the other four questions in the negative. Id. The Supreme Court stated that it did not \"share the Court of Appeals' confidence as to the meaning\" of the jury verdict, explaining that \"[p]erhaps the jury intended to resolve these questions in respondent's favor; but the jury might have been unable to agree on these issues, or it simply might not have passed upon them because it concluded that respondent had negligently designed the hoist in another respect.\" Id. at 87-88. In Iacurci, the jury's lack of response to a set of specific instructions made it impossible either to \"take the facts in the light most favorable to the verdict,\" Whitfield, 431 F.3d at 8, or to extract the jury's \"discernible resolution of disputed factual issues,\" Iacobucci, 193 F.3d at 23. Such circumstances are not present here, where the jury issued a general verdict in favor of Jennings and we are bound, by numerous precedents, to take the facts in the light most favorable to that verdict.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The jury found for defendants on five other claims, indicating that it carried out its responsibilities carefully. Any judgment beyond that is pure speculation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Appropriately, the jury was not asked to address the qualified immunity issue. Nevertheless, in delivering the general verdict on Jennings' claim of excessive force under the Fourth Amendment, the jury essentially was addressing the first prong of the qualified immunity inquiry. Because we now address the question of qualified immunity after this jury verdict for the plaintiff, our task on the first prong of the qualified immunity analysis is to \"inquire whether the evidence at trial, viewed in the light most favorable to the verdict, is legally sufficient to support the jury's verdict that the plaintiff was deprived of a constitutional right.\" Wilson, 421 F.3d at 54.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. During the government's direct examination of Delaney, Jennings' attorney objected to certain questions because Delaney had not been qualified as an expert. The record does not disclose why the government had not qualified Delaney as an expert, but the court sustained Jennings' objections on these grounds. However, on cross-examination Jennings' attorney also attempted to ask Delaney questions that would ordinarily require expert qualifications. When the government objected, Jennings' attorney indicated that he now wanted Delaney to be qualified as an expert. The court stated that if Jennings wanted to use Delaney as an expert, the government would also have the opportunity, on redirect, to ask the questions requiring expert qualifications to which Jennings had originally objected. The parties agreed to this arrangement, and the court subsequently allowed both parties to use Delaney as an expert.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The dissent claims that we do a \"disservice\" to the district court by stating that the district court would have reached a different conclusion from the jury on the excessive force issue. However, the district court explicitly included in its qualified immunity analysis the conclusion that \"Jennings failed to present any evidence that Jones' actions deviated from the standard of conduct that should have been expected from an objectively reasonable police officer under the circumstances.\" This statement is equivalent to a holding that there was no excessive force.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Jennings argues that the district court erred in requiring expert testimony to prove excessive force. However, the district court did not actually impose this requirement. Instead, it noted that the jury had to have \"sufficient evidence of the applicable standard for measuring the lawfulness of Jones' conduct.\" We read this as a requirement that Jennings produce some evidence, whether in the form of expert testimony, lay testimony, or other evidence, from which the jury could evaluate the reasonableness of Jones' conduct.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. We are not suggesting that Officer Delaney's expert testimony was or was not essential to the submission of the excessive force issue to the jury. We are simply explaining how that testimony might have been useful to the jury in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Since the court's ruling was made in the context of summary judgment, it took the facts in the light most favorable to the plaintiff. 127 F.3d at 1417. The point seemingly made by the dissent about this case (that a jury might not ultimately find those facts) does not undermine the value of the case as indicative of clearly established law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The dissent misconstrues the Supreme Court's precedents relating to qualified immunity when it states that \"[t]he very fact- intensive nature of the test for excessive force itself requires particularized prior case law.\" It is true that the \"right allegedly violated must be defined at the appropriate level of specificity before a court can determine if it is clearly established,\" Wilson v. Layne, 526 U.S. 603, 615 (1999)(emphasis added), but this requirement does not imply that the relevant case law must be particularized to address the alleged violation. Rather, once the right allegedly violated has been defined, the court must examine whether \"the unlawfulness of particular conduct will be apparent ex ante to reasonable public officials.\" See Brady v. Dill, 187 F.3d 104 (1st Cir. 1999)(citing Wilson, 526 F.3d at 613).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Rodriguez v. Farrell, 294 F.3d 1276, 1278-79 (11th Cir. 2002); Jackson v. City of Bremerton, 268 F.3d 646, 650-53 (9th Cir. 2001); Eberle v. City of Anaheim, 901 F.2d 814, 820 (9th Cir. 1990).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Huang v. Harris County, No. 00-20806, 2001 WL 822534 (5th Cir. June 22, 2001)(unpublished disposition); Brownell v. Figel, 950 F.2d 1285, 1288, 1293 (7th Cir. 1991).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Indeed, the dissent's insistence on \"particularized prior cases with similar facts,\" see supra note 18, is inconsistent with its use of these cases, which, for the reasons already stated, differ significantly from the circumstances present here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. See supra Section II for a description of the evidence on this point.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The dissent argues that Jones' use of force was justified because Jennings was not totally secured at the time his ankle was broken and the officers were having a difficult time getting the flex cuffs on Jennings. The more important point, however, is that Jennings had ceased resisting before Officer Hill got up and walked away, and, as shown on the video, several seconds elapsed between the time that Officer Hill left and the time that Jennings yelled in pain as his ankle was broken. Thus, any difficulty or delay that the officers experienced in handcuffing Jennings was not due to resistance on Jennings' part, and does not alter our conclusion that an objectively reasonable officer in Jones' circumstances would not have believed that it was lawful to increase force after Jennings ceased resisting and stated that the restraint was hurting his previously injured ankle. Relatedly, the dissent's statement that \"Hill got out of the way because other officers were having trouble cuffing Jennings\" incorrectly suggests that Jennings was still resisting when Hill got up and walked away.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. In our discussion of prong one, we were careful to point out that we were not suggesting that Delaney's testimony was or was not essential to the jury's determination that the force used by Jones was excessive. We simply explained how that testimony could have been helpful to the jury in reaching its excessive force verdict. We make a similar point here. The Delaney testimony is certainly relevant to the prong three determination that was to be made by the court: whether a reasonable official would have believed that the force being used was excessive. However, we are not suggesting that this testimony was or was not essential to that legal determination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. We emphasize that it is the combination of a party's failure to obtain a conditional ruling before the district court and failure to mention, let alone brief, the new trial motion on appeal that warrants a finding of abandonment. Our discussion does not reach the consequences of failing to obtain a conditional ruling from the trial court but raising the new trial issue on appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Courts have held that an undecided motion for a new trial, while error, does not preclude appellate jurisdiction over the appeal. E.g., Kusens v. Pascal Co., 448 F.3d 349, 356-58 (6th Cir. 2006); Vollrath Co. v. Sammi Corp., 9 F.3d 1455, 1458-59 (9th Cir. 1993).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. The dissent incorrectly states that \"[t]he majority's rule is refuted by the plain language of\" Rule 50. In fact, Rule 50 is silent as to the consequences of a district court's failure to rule conditionally on a motion for a new trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Rule 50(c)(1) explains: \"If the renewed motion for judgment as a matter of law is granted, the court shall also rule on the motion for a new trial . . . . If the motion for a new trial has been conditionally granted, the order thereon does not affect the finality of the judgment. In case the motion for a new trial has been conditionally granted and the judgment is reversed on appeal, the new trial shall proceed unless the appellate court has otherwise ordered.\" By explicitly stating that the conditional ruling does not affect the finality of the judgment, Rule 50(c)(1) indicates that the appellate court may review the new trial motion, which would otherwise be unreviewable because the judgment was not final. See Allied Chem. Corp. v. Daiflon, Inc., 449 U.S. 33, 34 (1980)(explaining that \"[a]n order granting a new trial is interlocutory in nature and therefore not immediately appealable\"). Thus, Rule 50(c)(1) indicates that the parties may brief, and the appellate court will consider, the new trial motion on appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. As previously noted, Rule 50(c)(1) goes on to explain: \"In case the motion for a new trial has been conditionally denied, the appellee on appeal may assert error in that denial; and if the judgment is reversed on appeal, subsequent proceedings shall be in accordance with the order of the appellate court.\" Again, this provision clearly contemplates that the appellee will assert arguments for a new trial for the appellate court to consider.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The dissent's argument that \"a party may appeal only judgments adverse to him\" is unavailing in light of the provisions of Rule 50. We do not hold that Jones had to prosecute a cross-appeal, but rather that Rule 50 contemplates that an appellee such as Jones may preserve his motions for a new trial and a remittitur by raising them on appeal. In addition to Rule 50(c)(1), which authorizes an appellee to assert error in the conditional denial of a motion for a new trial, Rule 50(d) states that, \"[i]f the motion for judgment as a matter of law is denied, the party who prevailed on that motion may, as appellee, assert grounds entitling the party to a new trial in the event the appellate court concludes that the trial court erred in denying the motion for judgment.\" (Emphasis added.) The advisory committee notes reinforce this principle, stating that a party who has prevailed on a motion for judgment as a matter of law \"may, as appellee, besides seeking to uphold that judgment, also urge on the appellate court that the trial court committed error in conditionally denying the new trial. The appellee may assert this error in his brief, without taking a cross-appeal.\" Fed. R. Civ. P. 50(c) advisory committee's note (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. See Cone v. W. Va. Pulp \u0026 Paper Co., 330 U.S. 212 (1947), Globe Liquor Co. v. San Roman, 332 U.S. 571 (1948); Johnson v. N.Y, N.H. \u0026 H.R. Co., 344 U.S. 48 (1952).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The dissent also cites United States v. Moran, 312 F.3d 480, 496 (1st Cir. 2002)(Boudin, C.J., concurring). That decision - distinguishable because it is a criminal case - does not reveal whether the parties raised arguments in favor of a new trial on appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The dissent's citation to Isaksen v. Vermont Castings, Inc., 825 F.2d 1158 (1987) is inapposite. Isaksen does not reveal whether the appellee attempted to obtain a conditional ruling from the district court on its new trial motion, nor does it reveal whether the appellee raised the motion on appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. The dissent attempts to distinguish the precedents we have discussed from the Fifth, Seventh, and Eleventh Circuits on the ground that those courts noted that the district court had failed to rule on the alternative motion for a new trial, while the district court in this case ruled that the motion was moot. However, the district court's \"ruling\" consisted, in its entirety, of the statement that \"[Jones'] motion for judgment as a matter of law is granted and the remaining motions become moot.\" The district court thus did not \"rule\" on the motions in the sense contemplated by Rule 50(c)(1), and, moreover, this \"ruling\" leaves unaddressed the critical failure of appellee to raise this erroneous ruling on appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. The dissent's suggestion that Jennings, as appellant, has waived his right to object to consideration on appeal of the motion for a new trial is unfounded. If Jones, as appellee, had raised his arguments for a new trial and a remittitur in his appellate brief, as he should have pursuant to Rule 50(c)(1), Jennings could have responded to them in a reply brief, but \"[i]t is the burden of the party seeking the benefit to raise the legal arguments justifying the benefit,\" Arenson, 43 F.3d at 197. Jennings cannot be charged with a waiver when it was never his obligation in the first instance to raise on appeal the mootness ruling of the trial court on Jones' motion for a new trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. As the dissent observes, the Supreme Court in Neely held that \"the appellee can choose for his own convenience when to make his case for a new trial\" and suggested that, \"in suitable situations,\" the appellee might do so on a petition for rehearing. The Court made this statement, however, in a Rule 50(d) situation, where the district court both denied defendant-appellant's motions for judgment as a matter of law and for a new trial, and, consequently, the plaintiff-appellee had never filed a motion a for new trial before the district court. The Court's concern thus has no bearing on Jones' circumstances here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Those reasons did not include the fact that the trial court would itself have reached a different conclusion from the jury on the excessive force issue. The district court, based on its own assessments of the credibility of the witnesses and the weight of the evidence, expressed its view that Jones had not used excessive force. Jennings, 2005 WL 2043945, at *6. Nonetheless, the district court expressly stated this was not the basis for its immunity holding, acknowledging that a motion for JMOL does not permit a court to make its own assessment regarding the weight of the evidence. Id. at *7. The majority, however, states that \"the district court's qualified immunity analysis incorporated its skepticism about the jury's fact-finding on the critical issue of whether Jones increased his use of force.\" The majority does a disservice to the district court by suggesting it did something it expressly said it did not do.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Where we are reviewing a denial of qualified immunity by a judge which is consistent with a jury verdict, we have said that \"the evidence must be construed in the light most hospitable to the party that prevailed at trial.\" Iacobucci v. Boulter, 193 F.3d 14, 23 (1st Cir. 1999); see also Borges Col*n v. Rom*n-Abreu, 438 F.3d 1, 18 (1st Cir. 2006); Whitfield v. Mel*ndez-Rivera, 431 F.3d 1, 6 (1st Cir. 2005). We have held that there is no prohibition on a judge's reasonably accepting the jury's findings as his or her own for purposes of qualified immunity. See Iacobucci, 193 F.3d at 23. We have never explicitly discussed the reverse situation, where the judge awards immunity in the face of a jury finding that there was a constitutional violation. Jones has not made an argument as to this point, so I bypass it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. The Supreme Court noted in Iacurci v. Lummus Co., 387 U.S. 86 (1967), reversing a court of appeals for entering JMOL, \"We do not share the Court of Appeals' confidence as to the meaning [of the jury verdict] in light of the trial court's instructions . . . .\" Id. at 87. Nothing in the jury instructions here required that the jury necessarily base its verdict on the majority's proposed factual findings. The district court quite properly did not instruct that the theory of plaintiff's case required these two findings. The jury was instructed that in determining whether Jones used excessive force it could consider whether Jennings posed a threat to the safety of others; whether the threat was immediate and serious; whether Jennings was disrupting the search of the smoke shop; whether Jennings was actively resisting arrest; the degree of force used; the seriousness of the offense for which Jennings was being arrested; and whether the degree of force was proportional to what was appropriate under the circumstances. Iacurci cannot be written off as idiosyncratic, nor is it easily distinguishable. Further, the facts themselves provide alternatives, and it is far from obvious on what subsidiary facts the verdict rested. The jury could have found that the seriousness of the injury, a broken ankle, was not justified by the charges Jennings was arrested on -- disorderly conduct. This theory was argued by plaintiff's counsel at closing, and was consistent with the jury instructions. Or the jury could have concluded that the application of force sufficient to break Jennings' ankle was itself excessive, whether or not Jennings had continued to resist, and whether or not Jones increased the amount of force. The jury could have concluded that it was unreasonable for Jones to maintain the same force once Jennings said something about his ankle. Or it could have concluded that Jones maintained the same level of force when, in its view, that level was excessive to begin with. It may also be, as the district court noted, that the jury concluded that Jones \"continued to twist Jennings' ankle after Jennings had stopped resisting.\" Jennings, 2005 WL 2043945, at *6. That is not a conclusion that Jones \"increased\" the pressure, and again shows that the jury did not necessarily find the facts as the majority assumes. There is another reason not to conclude that the verdict against Jones necessarily entailed the majority's two factual findings. At the start of trial, there were seven individual defendants. There were also three plaintiffs, including Jennings' mother. These plaintiffs asserted twenty-one different claims. On the six claims that went to the jury, the jury ruled against plaintiffs on all claims except for the excessive force claim against Jones. Jurors sometimes reach compromise verdicts.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. In my view, the majority's focus on its two facts as necessary findings does not represent \"the jury's discernible resolution of factual issues,\" Iacobucci, 193 F.3d at 23, but for these purposes I will assume Iacobucci is satisfied.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. The district court held, on the first prong, that the jury verdict that there had been excessive force was not supported by any evidence that no objectively reasonable officer would have applied the ankle turn control technique as Jones did. Jennings, 2005 WL 2043945, at *7. It is not necessary to discuss this finding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Other circuits have taken a similar approach to particularity in the context of Fourth Amendment reasonableness inquiries, especially in excessive force cases. See Walker v. City of Orem, 451 F.3d 1139, 1151 (10th Cir. 2006) (noting in a Fourth Amendment unreasonable detention case that \"allegations of constitutional violations that require courts to balance competing interests may make it more difficult to find the law 'clearly established' when assessing claims of qualified immunity\" (quoting Medina v. City \u0026 County of Denver, 960 F.2d 1493, 1498 (10th Cir. 1992)) (internal quotation marks omitted)); Williams v. Kaufman County, 352 F.3d 994, 1012 (5th Cir. 2003) (holding that prolonged detention was unlawful, but affirming qualified immunity because applicable Supreme Court law, which \"allow[ed] a seizure without probable cause when the proper balance [was] struck between law enforcement and personal security interests,\" failed to put officer on notice); Priester v. City of Riviera Beach, 208 F.3d 919, 926 (11th Cir. 2000) (\"In the context of . . . excessive force claims, we have noted that generally no bright line exists . . .; we have therefore concluded that unless a controlling and materially similar case declares the official's conduct unconstitutional, a defendant is usually entitled to qualified immunity.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. As one commentator has noted in light of the chaotic circumstances surrounding most excessive force claims, while \"there may be cases . . . where the law was so clearly settled that the finding of a constitutional violation would mean that the defendant loses on qualified immunity as well[, such cases] will be relatively rare in the Fourth Amendment . . . excessive force setting because of the very fact-specific nature of these issues.\" 2 S. Nahmod, Civil Rights and Civil Liberties Litigation: The Law of Section 1983 § 8:19.50, at 103 (4th ed. 2006).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. The district court reached its conclusion based on the following factual findings, which have ample support in the record. Jones did not know why Jennings was being arrested or whether he was armed. Nor could Jones have known, with any certainty, why Jennings failed to heed orders to show his hands. Moreover, even if Jennings had stopped actively resisting, Jones had no way of knowing whether Jennings would resume kicking or resisting if Jones released his ankle hold. In addition, . . . Jones and other troopers at the Academy were taught that the ankle control technique is appropriate to subdue an arrestee who is actively resisting; to protect against the possibility that an arrestee who previously engaged in assaultive behavior might resume that behavior and/or to induce compliance by an arrestee who is passively resisting. Furthermore, Delaney, the only expert witness who testified, indicated that Jones acted properly and in accordance with departmental policy regarding use of the ankle turn control technique. Jennings, 2005 WL 2043945, at *11. The district court's conclusion rests on subsidiary factual findings, which are not clearly erroneous.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. The majority argues that Lt. Delaney's assessment of the reasonableness of Jones' actions did not keep \"the relevant factual circumstances in mind\" because the factors listed by Delaney to support his view \"all occurred prior to the time that Jennings ceased to resist.\" The majority's argument is misguided. Delaney listed a number of factors he considered relevant to his opinion, including Jennings' noncompliance and assaultive behavior, but these were not the only circumstances he had in mind. The trial transcript makes clear that Delaney's opinion was based on the same videotape the majority says demonstrates that Officer Hill walked away after pulling Jennings' left arm out from under his body. Further, the majority fails in its attempt to distinguish \"use of force\" from \"increase in force\" as a matter of evidence. The transcript is clear that the expert was asked about the reasonableness of Jones' use of force overall, not about the reasonableness of the use of the ankle turn control technique without an increase in force. Even if the central issue in the case is the increase in force on Jennings' ankle, Delaney's testimony directly addresses the reasonableness of Jones' overall conduct.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Delaney testified specifically about the period when officers were trying to get Jennings \"cuffed up and secured.\" He explained that flex cuffs, which are made of plastic, are more difficult to apply than metal cuffs, and that it is very hard to get them on someone who does not want to be handcuffed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. The question here is not whether Jones could have asked this court to find that a new trial was warranted based on the district court's reasoning, and to remand to the district court for a new trial. There are obvious reasons for Jones to think that the trial court is better situated to resolve the new trial motion. The question is whether Jones somehow has abandoned his new trial motion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. In my view, it also is unfair to the defendant to decide the question without having put him on notice that it was even at issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. The majority contends that remanding to the trial court to consider the new trial motion would \"place[] Jones in a more favorable position than he would be in if he had complied with Rule 50.\" Jones has not failed to comply with Rule 50, and the majority's statement is not true. The majority does not pass on the merits of the new trial motion itself. Rather its rule prevents any court from reaching the merits of the motion, which is contrary to the approach taken in a majority of circuits.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. Let me stress what is not and cannot be at issue. The majority does not rule that it would be senseless to remand to the district court because it is plain that a new trial motion must be denied. No appellate court could possibly reach that conclusion here. The district court's opinion implicitly found that the grounds for a new trial had been met when it concluded that the verdict was contrary to the weight of the evidence and its own assessment of the credibility of the evidence. See Jennings, 2005 WL 2043945, at *6-7. We certainly cannot say that it is likely, given the trial court's reasoning on the JMOL, that the trial court would not allow a motion for a new trial. Nor can we say on the record before us that it would be a clear abuse of discretion if the trial court decided on remand to allow the motion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. The majority's effort to distinguish Bisbal-Ramos on the grounds that the plaintiff raised the error on appeal misses the point. Bisbal-Ramos established that there was no abandonment in the trial court, the issue at hand. Further, as to what is required on appeal to prevent abandonment, the district court's error in Bisbal-Ramos adversely affected the amount of damages awarded to the plaintiff, and the plaintiff specifically appealed the judgment. 467 F.3d at 19-20. That is not our situation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. The majority states that Isaksen is inapposite because the majority believes it is not clear whether the appellee attempted to obtain a conditional ruling or whether he raised the issue on appeal. That the appellate court noted that the trial court had \"remarked in passing on the excessiveness of the damages,\" 825 F.2d at 1125, but did not mention any motion for reconsideration by the appellee suggests that there was no such motion. Moreover, the Seventh Circuit's purported rule is not a combination rule -- a new trial motion not pressed in the trial court supposedly is abandoned, whether or not the issue is raised on appeal. Thus, whether or not the appellee brought the issue to the attention of the appeals court is irrelevant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. Again, the majority's attempt to distinguish Freund (and Mays v. Pioneer Lumber, 502 F.2d 106 (4th Cir. 1974), discussed below) because the appellee raised (or, in the case of Mays, may have raised) the error on appeal is unsuccessful. See supra note 51.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. The majority incorrectly states that it is not clear whether the Nodak Oil appellee raised its new trial motion on appeal. The Nodak Oil court stated that \"[t]he record reveal[ed] that . . . [t]he district court . . . granted the motion . . . for a judgment notwithstanding the verdict but did not specifically rule on the alternative motion for a new trial.\" 526 F.2d at 798 (emphasis added). The court made no mention of the appellee's having raised the issue. Rather, the court set a schedule for the submission of briefs on the new trial issue following the conditional ruling by the district court. Id. at 799.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. The majority argues that Shkolnikov is no bar because Rules 50(c)(1) and 50(d) contemplate a prevailing party asserting on appeal grounds entitling him to a new trial in the event the appellate court reaches an outcome unfavorable to him on its review of a district court's ruling on a motion for JMOL. Rule 50(c)(1) does not apply to a party whose motion for a new trial has not been denied. Rule 50(d) does not apply to a movant who has prevailed on a motion for JMOL. Neither permits adoption of the majority's rule or excuses its failure to comply with Shkolnikov.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. The majority's purported reliance on Neely is difficult to understand. Neely held only that courts of appeals may enter judgment as a matter of law in appropriate cases. 386 U.S. at 330. This is not such a case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. Further, the court of appeals may not usurp the choices available to defense counsel in this situation. As Neely notes, the appellee can choose for his own convenience when to make his case for a new trial: he may bring his grounds for new trial to the trial judge's attention when defendant first makes an n.o.v. motion, he may argue this question in his brief to the court of appeals, or he may in suitable situations seek rehearing from the court of appeals after his judgment has been reversed. 386 U.S. at 328-29. Similarly, the appellee cannot be forced to make his new trial arguments in the appellate court on pain of deemed abandonment when the trial court was reversed on the JMOL issue and there are meritorious arguments for a new trial.\u003c/span\u003e\n\n",
    "body_length": 176110,
    "citedas": [
      "479 F.3d 110"
    ],
    "attorneys": "Michael Bradley for appellant. Rebecca Tedford Partington, Deputy Chief, Civil Division, Rhode Island Attorney General's Office, for appellee.",
    "category": [
      "36",
      "75"
    ],
    "judges": "Before Torruella, Lynch and Lipez, Circuit Judges.",
    "citation_count": 4
  }
}
