{
  "id": "vYC6PWYBTlTomsSBuqqD",
  "document": {
    "title": "United States v. Dhinsa",
    "full_title": "UNITED STATES OF AMERICA v. GURMEET SINGH DHINSA .",
    "jurisdiction": "Second Circuit",
    "date": "2001-03-21T00:00:00.000Z",
    "docket": "Docket No. 99-1682",
    "body": "Argued: September 8, 2000\n\nAppeal from a judgment of the United States District Court for the Eastern District of New York, Korman, C.J., entered on November 5, 1999, following a jury trial convicting defendant-appellant Gurmeet Singh Dhinsa of, inter alia, racketeering and racketeering conspiracy and numerous related offenses including murder, conspiracy to commit murder, threatening to commit murder, kidnapping, mail fraud and firearms violations and principally sentencing him to multiple terms of life imprisonment for the racketeering, murder and kidnapping convictions. On appeal, Dhinsa raises numerous challenges to various evidentiary rulings made by the district court during the trial and the sufficiency of the evidence supporting a number of his convictions. Dhinsa also challenges the Grand Jury's amendment of the indictment following the close of the government's case-in-chief.\n\nAffirmed in part; vacated and remanded in part. Judge Calabresi concurs in a separate opinion.\n\nThis appeal arises out of the prosecution of appellant Gurmeet Singh Dhinsa (Dhinsa) \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e in connection with his role as leader of the Singh Enterprise, a racketeering organization centered around a chain of gasoline stations owned and operated by Dhinsa throughout the New York City area. At trial, in which the government sought the death penalty, the government presented voluminous evidence, including nearly 100 witnesses and hundreds of exhibits. In total, the trial spanned nearly four months from jury selection to the penalty phase. The jury convicted Dhinsa of racketeering and racketeering conspiracy, in violation of 18 U.S.C. § 1962(c), (d) (counts 1 and 2); \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e three counts of conspiracy to commit murder in aid of racketeering, in violation of 18 U.S.C. § 1959(a)(5) (counts 3, 7 and 14); two counts of murder in aid of racketeering, in violation of 18 U.S.C. § 1959(a)(1) (counts 4 and 8); two counts of obstruction of justice murder, in violation of 18 U.S.C. § 1512(a)(1)(C) (counts 5 and 9); one count of using and carrying a firearm during a crime of violence, in violation of 18 U.S.C. § 924(c) (count 10); one count of threatening to commit murder, in violation of 18 U.S.C. § 1959(a)(4) (count 11); one count of being a felon in possession of firearms, in violation of 18 U.S.C. § 922(g)(1) (count 15); one count of mail fraud conspiracy and six counts of mail fraud, in violation of 18 U.S.C. §§ 371 and 1341 (counts 16 through 22); one count of conspiracy to commit interstate kidnapping, in violation of 18 U.S.C. § 1201(c) (count 23); and one count of interstate kidnapping, in violation of 18 U.S.C. § 1201(a)(1) (count 24). In all, the jury found Dhinsa guilty of twenty-one of the twenty-nine counts charged in the superseding indictment. After the jury decided against imposition of the death penalty, the United States District Court for the Eastern District of New York, Korman, C.J., sentenced Dhinsa to multiple terms of life imprisonment for the racketeering, murder and kidnapping convictions.\n\nOn appeal, Dhinsa raises the following challenges to his convictions: (1) the district court erred by admitting the hearsay statements of two murder victims pursuant to United States v. Mastrangelo, 693 F.2d 269 (2d Cir. 1982), and its progeny, and Fed. R. Evid. 804(b)(6); (2) there was insufficient evidence to establish that Dhinsa acted \"for the purpose of . . . maintaining or increasing [his] position\" as provided in 18 U.S.C. § 1959(a); (3) the district court erred by admitting the testimony of Julie Uberoi, the girlfriend of Satinderjit Singh, one of the murder victims; (4) following Dhinsa's motion for judgment of acquittal pursuant to Fed. R. Crim. P. 29 and at the sua sponte suggestion of the district court, the indictment was improperly amended by the Grand Jury to include charges of interstate kidnapping in place of kidnapping in aid of racketeering; (5) there was insufficient evidence to support the jury's convictions for interstate kidnapping; (6) a new trial is warranted on the racketeering counts because Dhinsa's convictions on a number of the predicate crimes are invalid; (7) there was insufficient evidence to support a conviction for coercion in the first degree, in violation of N.Y. Penal Law § 135.65; (8) there was insufficient evidence to support a conviction on the felon-in-possession of a firearm charge; and (9) the district court erred by admitting the evidence obtained from the search of Dhinsa's car following his July 7, 1997 arrest.\n\nIn a prior decision, we reversed the district court's orders granting Dhinsa's motion to suppress evidence obtained: (1) in connection with a stop and subsequent search of Dhinsa's car on July 1, 1997; and (2) during an inventory search of Dhinsa's car following his arrest on July 7, 1997. See United States v. Dhinsa, 171 F.3d 721, 724-27 (2d Cir. 1999). We did not consider the merits of Dhinsa's claims regarding the legality of the July 7, 1997 search, but instead ruled that the fruits of that search be admitted based on the district court's prior findings of fact and legal conclusions. See id. at 727-28. To the extent relevant, those facts are reproduced below.\n\nBACKGROUND\n\nBecause Dhinsa appeals his convictions following a jury trial, \"our statement of the facts views the evidence in the light most favorable to the government, crediting any inferences that the jury might have drawn in its favor.\" United States v. Salameh, 152 F.3d 88, 107 n.1 (2d Cir. 1998) (per curiam), cert. denied, 525 U.S. 1112 (1999); see also United States v. Mussaleen, 35 F.3d 692, 697 (2d Cir. 1994) (denial of a motion to suppress evidence).\n\nI. The Singh Enterprise\n\nDhinsa was the self-professed leader of the \"Singh Enterprise,\" a vast racketeering organization built around a chain of fifty-one gasoline stations that Dhinsa owned and operated throughout the New York City metropolitan area under the name \"Citygas.\" The enterprise was funded by a pump-rigging scheme that overcharged Citygas customers through the use of an elaborate electronic device located beneath the gasoline pumps at the various Citygas stations. Operated via remote control, the rigging mechanism overcharged each customer by about six to seven percent on each purchase. During the enterprise's ten year existence, the pump-rigging scheme generated tens of millions of dollars, which were used, inter alia, to bribe public officials, purchase weapons and carry out crimes of violence aimed at protecting the enterprise's operations and its profits.\n\nAs the leader of the Singh Enterprise, Dhinsa maintained an \"inner management circle\" consisting of his cousin Gulzar Singh (Gulzar), his brother Gogi Singh (Gogi) and Citygas employee Babu Singh (Babu). Gulzar and Gogi supervised and trained the Citygas employees on the pump-rigging scheme, and, along with Babu, collected proceeds from the various Citygas stations and assisted Dhinsa in carrying out his violent criminal activities. Equally vital to the enterprise's operations were Antonio and Otilio Galvan, the designers of the pump-rigging mechanism and Marvin Dodson (Dodson), Walter \"Jazz\" Samuels (Samuels) and Evans Alonzo Powell (Powell), the group of hitmen employed by Dhinsa in connection with the murders of former Citygas employees Manmohan Singh (Manmohan) and Satinderjit Singh (Satinderjit).\n\nManmohan and Satinderjit were both murdered on Dhinsa's orders. Prior to his death, Manmohan made numerous inquiries, and confronted various members of the Singh Enterprise, about the July 1995 disappearance of his brother Kulwant, a Citygas employee. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Dhinsa ordered Satinderjit murdered after learning that he was cooperating with police regarding, inter alia, Kulwant's disappearance, Manmohan's murder, and the enterprise's pump-rigging scheme. Dhinsa also employed Dodson, Samuels and Powell in an unsuccessful plot to kill Sarvjeet Singh (Sarvjeet), who witnessed a murder allegedly committed by Dhinsa's brother Gogi in 1991.\n\nIn an effort to conceal his pump-rigging scheme from the Department of Consumer Affairs (DCA) (the city agency responsible for oversight of gasoline stations), Dhinsa regularly bribed DCA inspector Lawrence Woods (Woods), who tipped off Dhinsa about DCA enforcement activities targeting the Citygas stations and provided him with special DCA inspection seals and stickers. The Singh Enterprise's ten year existence ended following the arrests of Dhinsa and other key members of the Singh Enterprise.\n\nII. Crimes Charged at Trial\n\nA. The Murders of Manmohan and Satinderjit and the Plot to Kill Sarvjeet\n\nDhinsa was convicted for his role in the murders of Manmohan and Satinderjit and the plot to kill Sarvjeet. Each was targeted by Dhinsa because of his active or potential cooperation with the police. Although their stories differ, they share a common theme -- each posed a threat to the continued operation of the Singh Enterprise and the millions of dollars of profits generated each year by the enterprise's criminal activities.\n\nThe events leading up to Manmohan's murder began with the disappearance of his brother Kulwant in July 1995, when Kulwant was observed getting into a Citygas truck with Dhinsa's cousin Gulzar and Gulzar's brother Gurdial Singh (Gurdial). In March 1997, Manmohan was marked for death after he confronted Dhinsa and other key members of the Singh Enterprise about their involvement in Kulwant's disappearance. Around that same time, Dhinsa arranged to meet with Dodson across from the gas station where Manmohan worked and instructed Dodson to kill Manmohan. Operating on Gulzar's identification, Dodson returned to Manmohan's gas station armed with a gun supplied by Dhinsa and in a Citygas truck driven by Powell. After accompanying Manmohan to an office area at the station under the pretext that he needed a can of oil, Dodson ordered Manmohan to kneel down near a bench and proceeded to fire two shots into the back of Manmohan's head, killing him. Dodson and Powell then drove to Dodson's apartment, where Dodson changed his clothes and telephoned Dhinsa to inform him of the murder. Dhinsa paid Dodson $4,000 for the murder and instructed him to take the Citygas truck to a body shop located at one of Dhinsa's gas stations in order to have it repainted.\n\nAt Manmohan's funeral, the police initiated contact with Satinderjit, who offered to cooperate with police about Manmohan's murder, Kulwant's disappearance and the Citygas pump-rigging scheme. Satinderjit also made efforts to contact Dhinsa's brother Gogi, who was a suspect in a 1991 homicide. Satinderjit persuaded Sarvjeet, a witness to that homicide, to cooperate with the police. Apparently aware of Satinderjit's involvement with the police, Dhinsa (identifying himself as \"Gurmeet Singh\") made two threatening telephone calls to Julie Uberoi (Uberoi), Satinderjit's girlfriend, stating that he would kill Satinderjit and Uberoi if Satinderjit continued to inquire into his business or cooperate with the police.\n\nIn May 1997, Satinderjit informed the police that Gogi would be at the Citygas corporate offices in Brooklyn, New York. Based on that information, Satinderjit and Sarvjeet accompanied the police to the Brooklyn offices, presumably to identify Gogi. After Gogi arrived and was identified by Sarvjeet, police entered the Citygas offices and arrested Gogi. Also present were Dhinsa's cousin Gulzar and Babu, a Citygas employee, both of whom were arrested on weapons charges relating to guns found inside the building. During a sweep of the Brooklyn offices, police uncovered two handguns and a bullet proof vest inside a Citygas armored van. A trace of one of the handguns revealed that it was part of a shipment of handguns stolen in 1996. Dhinsa arrived a short time later and was also arrested on weapons charges. Following his arrest, Dodson testified that Dhinsa purchased firearms from him on two previous occasions.\n\nAfter posting bail, Dhinsa contacted Dodson and ordered that Satinderjit, who he believed was a cooperating witness against Gogi, be killed. Dhinsa provided Dodson with photographs of Satinderjit and his car and a printout of Satinderjit's license plate and home address. On Dhinsa's order that Satinderjit be killed as soon as possible, Dodson maintained surveillance outside Satinderjit's home for an opportunity to commit the murder. During that time, Dodson regularly reported his progress to Dhinsa.\n\nSatinderjit was not the only current threat to Dhinsa and the Singh Enterprise. About the same time, Dhinsa also arranged with Samuels and Powell to kill Sarvjeet, who Dhinsa believed witnessed the 1991 murder allegedly committed by Gogi. After securing Sarvjeet's address, Dhinsa dispatched two Citygas employees to rent an apartment across from Sarvjeet's residence, presumably to monitor his movements. Dhinsa then took Samuels and Powell to Sarvjeet's home, at which time he pointed out the apartment he rented across from Sarvjeet's home, and instructed them on the manner in which Sarvjeet should be killed. Dhinsa also made numerous inquiries regarding Sarvjeet's whereabouts.\n\nGrowing impatient with Dodson in light of court proceedings pending against Gogi, Dhinsa instructed Dodson to kill Satinderjit within a few days. On June 18, 1997, Dhinsa telephoned Dodson from Satinderjit's neighborhood and arranged for Dodson, Samuels and Powell to meet him across from Satinderjit's home. By early afternoon, the trio arrived at Satinderjit's home and met Dhinsa. Dhinsa supplied them with a Citygas van and instructed Samuels and Powell to go to a nearby Citygas station to have the van's license plates changed. Earlier, Dhinsa telephoned Santokh Singh (Santokh), a Citygas mechanic, instructing him to change the van's license plates. When Samuels and Powell arrived, Santokh replaced the van's New York license plate with a Pennsylvania license plate. When Samuels and Powell returned, they noticed Dhinsa in his car, and Dodson and another person in a separate car, both parked across the street from Satinderjit's home.\n\nDhinsa's plan was set into action when Satinderjit and his cousin Kirpal Singh emerged from Satinderjit's home and entered Satinderjit's livery cab. Dodson positioned himself around the corner of Satinderjit's home, armed with a handgun purchased by Dhinsa a few days earlier. When Satinderjit attempted to drive away, Powell (Samuels had exited the van a few minutes earlier) drove the Citygas van alongside Satinderjit in order to block his exit and to provide Dodson sufficient time to get into position. Dhinsa, also present at the scene and driving a black Lexus sedan, apparently blocked Satinderjit's car from behind. As Satinderjit pulled around the Citygas van and turned the corner, Dodson approached Satinderjit, who was seated in the driver's seat. Dodson fired multiple shots at Satinderjit, killing him on the scene. Kirpal, crouched below the dashboard, was not killed.\n\nAfter the shooting, Dhinsa instructed Dodson and Powell to follow him to a nearby Citygas station, where they were later joined by Samuels. When Dodson and Powell arrived in the Citygas van, Dhinsa instructed Santokh to replace the van's license plate. Dhinsa later met up with Dodson, Samuels and Powell at Dodson's residence, at which time he congratulated them on their success and paid them each $5,000.\n\nB. The Kidnapping of Muchtir Ghuman\n\nDhinsa was also convicted for his role in the kidnapping of Muchtir Ghuman (Ghuman). Ghuman was an investor in a local Indian restaurant. Following an internal dispute between Ghuman and the other investors in the restaurant, Chandi, one of the investors, solicited the help of \"Steve\" and \"Allen,\" alleged members of organized crime, to threaten Ghuman. Steve and Allen warned Ghuman that they would kill him if he did not relinquish his interest in the restaurant. In November 1995, Ghuman approached Gogi about his problems with Steve and Allen. A few days later, Dhinsa offered to \"help\" Ghuman by arranging a meeting between Steve, Allen, Ghuman and his restaurant partners. During that meeting, Dhinsa punched Ghuman in the face, causing him to bleed. Believing that his problems would not be resolved at that time, Ghuman left the restaurant and decided to go home.\n\nWhen Ghuman exited the restaurant, he noticed Gogi, who was seated in an armored Citygas van outside the restaurant. Ghuman approached Gogi to inform him about the events inside the restaurant. On Gogi's demand, Ghuman entered the van. Ghuman was joined in the van by Babu, who was seated in the driver's seat, and an unidentified third person. Gogi pointed a gun directly at Ghuman and threatened to kill him unless he kept quiet. After briefly entering the restaurant, Gogi returned to the van and the three men, along with Ghuman, drove to a Citygas truck stop in New Jersey. During the trip, Gogi refused Ghuman's pleas to be released.\n\nAfter arriving at the New Jersey truck stop, Gogi questioned Ghuman at gunpoint, telling him that he had lied and insulted Dhinsa. After Ghuman pleaded with Gogi to spare his life, Gogi informed Ghuman that he would not be killed, but that he had to leave New York and would be killed if he returned or reported the incident to anyone. Ghuman, Gogi and the others drove back to a Citygas station in New York City where Dhinsa was present. Dhinsa told Ghuman that Steve and Allen wanted to kill him, but that he \"fixed\" the problem. After warning Ghuman that he and other members of the Singh Enterprise killed many people in the same spot in New Jersey where he had just driven from, Dhinsa also warned Ghuman to leave New York. Following his release, Ghuman abandoned his investment in the restaurant and, along with his family, fled New York. Although Ghuman eventually returned to New York, he did not return to his restaurant or confront Dhinsa or other members of the Singh Enterprise.\n\nC. The Threat to Kill Balwant and the July 1, 1997 Stop of Dhinsa's Car\n\nFollowing Satinderjit's murder in June 1997, police increased their protection of Sarvjeet, making it difficult for Dhinsa to reach him. In an effort to locate Sarvjeet, Dhinsa dispatched Surander Parmar (Parmar), one of his associates, to Satinderjit's funeral in order to make contact with Balwant, a known friend of Sarvjeet. During a heated exchange, Parmar conveyed a message from Dhinsa requesting that Balwant take Parmar to Sarvjeet. After Balwant refused, Parmar informed him that Dhinsa would have him killed. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e A few days later, Dhinsa, driving a green Lincoln, pulled up alongside Balwant's van as he drove to work. In fear for his life, Balwant drove home and reported the incident to the police. Later that evening, detectives Brian Quinn and Louis Pia were dispatched to Balwant's home to investigate the death threats made by Dhinsa. The events surrounding the detectives' July 1, 1997 visit to Balwant's home, which led to the stop and search of Dhinsa's car and the first of two suppression motions decided by the district court, are set out in detail in our earlier decision in this matter, see Dhinsa, 171 F.3d at 722-24, familiarity with which is assumed. A few days later, the police arrested Dodson, who was plotting with Dhinsa to kidnap Balwant by having Dodson and Samuels pose as police officers driving cars purchased by Dhinsa a few days earlier.\n\nD. The July 7, 1997 Arrest of Dhinsa and Subsequent Inventory Search of His Car\n\nThe events surrounding Dhinsa's arrest and the subsequent inventory search of his car, which were the subject of the district court's second suppression order, are briefly set out in our earlier decision in this matter. See at 723-24. We expand on those facts relevant to this appeal.\n\nOn July 7, 1997, the police arrested Dhinsa at one of his Citygas stations in Brooklyn, New York. That same day, detectives seized Dhinsa's black Lexus, which they believed was used in connection with Satinderjit's murder. The detectives were supplied with information describing Dhinsa's role in ordering Satinderjit's murder and his presence at the murder scene. In seizing Dhinsa's car, detectives relied on information that Dhinsa aided Dodson and the other hitmen in carrying out Satinderjit's murder by positioning his black Lexus behind Satinderjit's car and blocking him in from the rear. The detectives then transported Dhinsa and the black Lexus to their precinct, and detectives Rakesh Verma (Verma) and Jim Tampellini (Tampellini) were instructed by Sergeant Conroy to conduct an inventory search of the contents of Dhinsa's car. Verma, however, mistakenly believed that he could also perform an investigatory search of the car because it was allegedly used during the commission of a crime. To that end, Verma testified that the purpose of the search was to safeguard the car and its contents, as well as to look for evidence of an investigatory or evidentiary value.\n\nVerma and Tampellini conducted a search of the car's passenger area, glove compartment, console, trunk and \"stash\" or \"trap\" compartment (a hollow area that initially contained an airbag). The detectives were permitted to search these areas pursuant to New York City Police Department procedures governing inventory searches. During the course of the search, Verma discovered the following items: a piece of paper bearing the name of a detective with whom Verma worked and the voucher number for the vehicle taken from Dodson at the time of his arrest; a piece of paper bearing Dodson's name; a life insurance policy issued to Gurdial Singh, a former Citygas employee whose murder was the subject of a pending police investigation; a piece of paper with Sarvjeet's address; a piece of paper bearing Balwant's name and the names of his friends and family; and DCA and New York City Consumer Affairs inspection stickers and seals. Verma also retrieved a wallet, numerous business cards, two telephone books, a cellular telephone bill addressed to DCA Inspector Woods, a briefcase containing an electronic diary and a blank fire department inspection report. After briefly examining the loose papers and business cards found inside the car, Verma brought most, if not all, of the materials and papers into the precinct, presumably to catalog the items. Verma made copies of the written materials and the credit cards found in Dhinsa's wallet. At some point after Verma began to catalog the items taken from the car, Verma was assigned to another task and, thus, did not complete an inventory list. The items were turned over to other officers and the inventory list was completed by FBI agent James Glynn, the case agent for the investigation.\n\nIII. The District Court's Suppression Rulings and Our Prior Decision on Appeal\n\nIn pretrial motions, Dhinsa moved, inter alia, to suppress the fruits of both the July 1, 1997 car stop and search and the July 7, 1997 inventory search. After conducting hearings, the district court granted both motions, albeit for differing reasons. The district court suppressed the fruits of the July 1, 1997 stop and search because both detectives testified that, although they observed Dhinsa commit a traffic violation, it was not the basis of their decision to stop him. See Dhinsa, 171 F.3d at 722. With regard to the events on July 7, 1997, the district court held that the seizure of Dhinsa's car was \"entirely appropriate\" because the police had \"probable cause to believe that [the car] was used in the commission of a murder or an attempted murder,\" and \"not seizing the car gives the defendant or those associated with him an opportunity to destroy evidence.\" Although the district court stated that the detectives did not have probable cause to search Dhinsa's car for evidence of the murder when they commenced their search, it noted that \"there was arguably probable cause to believe that a weapon might be found in the car\" given that Dhinsa was arrested based on his involvement in Satinderjit's murder.\n\nThe district court found that the search of Dhinsa's car was lawful because \"(1) Conroy directed Verma to conduct an inventory search; (2) Verma erroneously believed he could conduct an investigatory search; and (3) regardless of Verma's intent or belief, the scope of the search he conducted did not exceed the permissible bounds of an inventory search until items he observed in plain view supplied him with probable cause to conduct a more extensive search.\" Dhinsa, 171 F.3d at 724. Despite express findings of fact and law that supported a denial of Dhinsa's suppression motion, the district court nevertheless suppressed the fruits of the July 7, 1997 search, stating that it presented a \"close question of law,\" and reasoning that by placing the issue in an \"appealable posture\" Dhinsa would not have to wait until the end of the trial in order to seek appellate review of the district court's denial of the suppression motion.\n\nOn appeal, we reversed both suppression orders. With respect to the July 1, 1997 stop, we held that \"an observed traffic violation legitimates a stop even if the detectives do not rely on the traffic violation\" as a basis for the stop. Dhinsa, 171 F.3d at 725 (footnote omitted). We went on to hold that the Supreme Court's decision in Whren v. United States, 517 U.S. 806 (1996), \"and other Fourth Amendment cases require that we judge the reasonableness of an officer's actions based on the objective circumstances surrounding her actions and not on her subjective intent.\" Id. (citing Whren, 517 U.S. at 814). Accordingly, because Dhinsa's traffic violation was \"an objective circumstance that justifie[d] a traffic stop,\" we held that the stop was lawful notwithstanding the officers' subjective intent. Id. Next, we summarily reversed the July 7, 1997 suppression order because it \"directly contradict[ed] [the district court's] findings of fact and conclusions of law,\" but permitted Dhinsa to challenge the admission of the evidence of the July 7 search in his post-trial appeal. Id. at 728. Accordingly, we left Dhinsa's challenge to the constitutionality of that search to any post-trial appeal. That appeal is currently before us.\n\nDISCUSSION\n\nI. Standards of Review\n\nDhinsa's challenges to the sufficiency of the evidence supporting a number of his convictions and to various evidentiary rulings made by the district court require us to apply varying standards on appeal. For convenience, we detail those standards here.\n\nA defendant challenging a conviction based on a claim of insufficiency of the evidence bears a heavy burden. See United States v. Walsh, 194 F.3d 37, 51 (2d Cir. 1999). The evidence presented at trial should be viewed \"in the light most favorable to the government, crediting every inference that the jury might have drawn in favor of the government.\" United States v. Walker, 191 F.3d 326, 333 (2d Cir. 1999) (quotation marks omitted), cert. denied, 120 S.Ct. 1702 (2000). We consider the evidence presented at trial \"in its totality, not in isolation,\" but \"may not substitute our own determinations of credibility or relative weight of the evidence for that of the jury.\" United States v. Autuori, 212 F.3d 105, 114 (2d Cir. 2000). \"We defer to the jury's determination of the weight of the evidence and the credibility of the witnesses, and to the jury's choice of the competing inferences that can be drawn from the evidence.\" United States v. Morrison, 153 F.3d 34, 49 (2d Cir. 1998). Accordingly, we will not disturb a conviction on grounds of legal insufficiency of the evidence at trial if \"any rational trier of fact could have found the essential elements of the crime beyond a reasonable doubt.\" Jackson v. Virginia, 443 U.S. 307, 319 (1979); see also United States v. Naiman, 211 F.3d 40, 46 (2d Cir. 2000).\n\nEvidentiary rulings are reviewed for abuse of discretion, see Naiman, 211 F.3d at 51, and the district court's application of constitutional standards is reviewed de novo. See United States v. Moskowitz, 215 F.3d 265, 268 (2d Cir.) (per curiam), cert. denied, 121 S.Ct. 571 (2000). \"To find such an abuse we must be persuaded that the trial judge ruled in an arbitrary and irrational fashion.\" United States v. Pipola, 83 F.3d 556, 566 (2d Cir. 1996). In reviewing a suppression order, we review the district court's factual findings for clear error and its legal conclusions de novo. See United States v. Miller, 148 F.3d 207, 213 (2d Cir. 1998), cert. denied, 525 U.S. 1072 (1999). Under the clear error standard, we reverse \"only if left with the definite and firm conviction that a mistake has been committed.\" Moskowitz, 215 F.3d at 272 (internal quotation marks omitted). \"Where there are two permissible views of the evidence, the factfinder's choice between them cannot be clearly erroneous.\" Anderson v. Bessemer City, 470 U.S. 564, 574 (1985). The district court is afforded \"greater deference\" when its findings are based on the credibility of the witnesses. Id. at 575; see also United States v. Milbrand, 58 F.3d 841, 844 (2d Cir. 1995) (\"Assessment of the credibility of witnesses is peculiarly within the province of the trier of fact and is entitled to considerable deference.\"). Accordingly, \"when a trial judge's finding is based on his decision to credit the testimony of one of two or more witnesses, each of whom has told a coherent and facially plausible story that is not contradicted by extrinsic evidence, that finding, if not internally inconsistent, can virtually never be clear error.\" Anderson, 470 U.S. at 575.\n\nThe erroneous admission of evidence may nonetheless be harmless if \"the appellate court can conclude with fair assurance that th[e] evidence did not substantially influence the jury,\" United States v. Jean-Baptiste, 166 F.3d 102, 108 (2d Cir. 1999) (citing Kotteakos v. United States, 328 U.S. 750, 764-65 (1946)), and \"only if `it is highly probable that the error did not contribute to the verdict.'\" Id. (quoting United States v. Colombo, 909 F.2d 711, 713 (2d Cir. 1990)); see also United States v. Smith, 987 F.2d 888, 892 (2d Cir. 1993). \"That standard is met when the court possesses a sure conviction that the error did not prejudice the defendant.\" United States v. Saada, 212 F.3d 210, 222 (3d Cir. 2000) (internal quotation marks omitted). Thus, in order for an error to be deemed harmless, the reviewing court must conclude beyond a reasonable doubt that a rational jury would have rendered a verdict of guilty absent the alleged error. See Neder v. United States, 527 U.S. 1, 18 (1999); Chapman v. California, 386 U.S. 18, 24 (1967) (\"[B]efore a federal constitutional error can be held harmless, the court must be able to declare a belief that it was harmless beyond a reasonable doubt.\"); United States v. Jackson, 196 F.3d 383, 385 (2d Cir. 1999), cert. denied, 120 S.Ct. 2731 (2000).\n\nIn undertaking this inquiry, courts weigh various factors to determine whether an alleged constitutional error is harmless. For example, in evaluating whether the erroneous admission of evidence constitutes harmless error, we consider principally\n\nwhether the government's case against the defendant was strong; whether the evidence in question bears on an issue that is plainly critical to the jury's decision, such as the defendant's credibility when h[is] veracity is central to h[is] defense; whether the evidence was emphasized in the government's presentation of its case and in its arguments to the jury; and whether the case was close. Jean-Baptiste, 166 F.3d at 108-09 (internal quotation marks and citations omitted); see also Delaware v. Van Arsdall, 475 U.S. 673, 684 (1986) (in applying the harmless error doctrine in the context of Confrontation Clause violations, the reviewing court should consider a \"host of factors\" that include \"the importance of the witness' testimony in the prosecution's case, whether the testimony was cumulative, the presence or absence of evidence corroborating or contradicting the testimony of the witness on material points, the extent of cross-examination otherwise permitted, and, of course, the overall strength of the prosecution's case\"). \"The strength of the government's case against the defendant is probably the most critical factor in determining whether an error affected the verdict.\" Colombo, 909 F.2d at 714; see also Wray v. Johnson, 202 F.3d 515, 526 (2d Cir. 2000) (applying harmless error analysis in review of habeas petition); cf. Neder, 527 U.S. at 17 (court's failure to instruct on an element of the charged offense deemed harmless in light of the \"overwhelming evidence\" supporting the jury's verdict).\n\nAccordingly, a reviewing court may find that the admission of evidence was harmless \"where there is sufficient corroborating evidence to support the conviction.\" Colombo, 909 F.2d at 714. The beneficiary of the alleged error bears the burden of establishing that such error was harmless. See Chapman, 386 U.S. at 24.\n\nWith these standards in mind, we turn to the arguments raised by Dhinsa on appeal.\n\nII. Evidentiary Issues\n\nA. Fed. R. Evid. 804(b)(6) and the Admission of Mastrangelo Evidence\n\nDhinsa argues that the district court erred by admitting out-of-court statements of Manmohan and Satinderjit, offered through numerous prosecution witnesses, as proof of Dhinsa's involvement in the murders of the declarants. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e The gravamen of Dhinsa's objection is that the admission of hearsay statements introduced as proof of the declarants' murders rather than about past events or offenses Dhinsa allegedly committed violated Fed. R. Evid. 403 and Fed. R. Evid. 802, and, more importantly, his right to confront the witnesses against him as guaranteed by the Sixth Amendment. Thus, Dhinsa raises three related arguments under Mastrangelo and Fed. R. Evid. 804(b)(6) on appeal: (1) Rule 804(b)(6), which codifies the Mastrangelo rationale, limits the admission of hearsay statements to past events or offenses committed by the defendant about which the declarant could testify, and not as proof of the declarant's murder; (2) the district court failed to assess independently the reliability of the declarants' statements in accordance with Lilly v. Virginia, 527 U.S. 116 (1999) (plurality opinion); and (3) the district court failed to find, as required under Fed. R. Evid. 804(b)(6), that Dhinsa intended to procure the unavailability of Manmohan and Satinderjit. Further, Dhinsa argues that the court's admission of Mastrangelo evidence under the circumstances of this case \"cannot be deemed harmless error.\" We consider the merits of these arguments seriatim.\n\n1. The Confrontation Clause and the Waiver-By-Misconduct Doctrine\n\nWe begin with a brief overview of the Confrontation Clause of the Sixth Amendment and the evolution of the waiver-by-misconduct doctrine. The Sixth Amendment provides that \"[i]n all criminal prosecutions, the accused shall enjoy the right . . . to be confronted with the witnesses against him.\" The right enjoyed by a criminal defendant to confront the witnesses against him is a \"fundamental right essential to a fair trial in a criminal prosecution,\" Pointer v. Texas, 380 U.S. 400, 404 (1965), and is designed to secure for the defendant the opportunity of cross-examination. See Van Arsdall, 475 U.S. at 678 (\"[T]he main and essential purpose of confrontation is to secure for the opponent the opportunity of cross-examination.\" (quotation marks omitted)); Douglas v. Alabama, 380 U.S. 415, 418 (1965) (\"[A] primary interest secured by [the Confrontation Clause] is the right of cross-examination.\"); United States v. Laljie, 184 F.3d 180, 192 (2d Cir. 1999).\n\nAlthough the confrontation right is of constitutional dimension, it is not absolute, see Maryland v. Craig, 497 U.S. 836, 847-48 (1990) (\"[W]e have repeatedly held that the Clause permits, where necessary, the admission of certain hearsay statements against a defendant despite the defendant's inability to confront the declarant at trial.\"), and may be waived by a defendant through a \"knowing and intentional relinquishment.\" United States v. Houlihan, 92 F.3d 1271, 1279 (1st Cir. 1996); cf. Brookhart v. Janis, 384 U.S. 1, 4 (1966) (\"There is a presumption against the waiver of constitutional rights, and for a waiver to be effective it must be clearly established that there was an intentional relinquishment or abandonment of a known right or privilege.\") (internal quotation marks and citations omitted). For example, a defendant who enters a plea of guilty waives his rights under the Confrontation Clause. See Boykin v. Alabama, 395 U.S. 238, 243 (1969). The Supreme Court has similarly held that a defendant's intentional misconduct can constitute a waiver of his rights under the Confrontation Clause. See, e.g., Illinois v. Allen, 397 U.S. 337, 343 (1970) (defendant waives his confrontation rights and his right to be present at his trial if he engages in disruptive and disrespectful behavior requiring his removal from the courtroom); Snyder v. Massachusetts, 291 U.S. 97, 106 (1934) (\"No doubt the privilege [to confront one's accusers and cross-examine them] may be lost by consent or at times even by misconduct.\"), overruled on other grounds by Malloy v. Hogan, 378 U.S. 1 (1964); see also Mastrangelo, 693 F.2d at 272 (collecting cases). These cases recognize that although the right of confrontation is an essential trial right, it may be waived by the defendant's misconduct.\n\nConsistent with that principle, this Court, as well as a majority of our sister circuits, have also applied the waiver-by-misconduct rule in cases where the defendant has wrongfully procured the witnesses' silence through threats, actual violence or murder. See, e.g., United States v. Cherry, 217 F.3d 811, 814-15 (10th Cir. 2000) (murder); United States v. Emery, 186 F.3d 921, 926 (8th Cir. 1999) (murder); United States v. White, 116 F.3d 903, 911 (D.C. Cir. 1997) (per curiam) (murder); United States v. Miller, 116 F.3d 641, 667-68 (2d Cir. 1997) (murder); Houlihan, 92 F.3d at 1278-79 (murder); United States v. Thai, 29 F.3d 785, 814 (2d Cir. 1994) (murder); United States v. Aguiar, 975 F.2d 45, 47 (2d Cir. 1992) (written and verbal threats); Steele v. Taylor, 684 F.2d 1193, 1199 (6th Cir. 1982) (\"witness was under the control of the defendants who had procured her refusal to testify\"); United States v. Carlson, 547 F.2d 1346, 1358-60 (8th Cir. 1976) (threats). Recognizing that \"[s]imple equity\" and \"common sense\" justifies a defendant's forfeiture of his confrontation rights under circumstances where he wrongfully procures the witnesses' absence, the D.C. Circuit held:\n\nIt is hard to imagine a form of misconduct more extreme than the murder of a potential witness. Simple equity supports a forfeiture principle, as does a common sense attention to the need for fit incentives. The defendant who has removed an adverse witness is in a weak position to complain about losing the chance to cross-examine him. And where a defendant has silenced a witness through the use of threats, violence or murder, admission of the victim's prior statements at least partially offsets the perpetrator's rewards for his misconduct. We have no hesitation in finding, in league with all circuits to have considered the matter, that a defendant who wrongfully procures the absence of a witness or potential witness may not assert confrontation rights as to that witness. White, 116 F.3d at 911.\n\nRelying on the maxim that \"the law [will not] allow a person to take advantage of his own wrong,\" Mastrangelo, 693 F.2d at 272 (quoting Diaz v. United States, 223 U.S. 442, 458 (1912)), in Mastrangelo and cases following, we have reaffirmed the principle that, where a defendant wrongfully procures the silence of a witness or potential witness, he will be deemed to have \"waived his sixth amendment rights and, a fortiori, his hearsay objection\" to the admission of the declarant's statements.\" Id. at 272; see also Miller, 116 F.3d at 668; Thai, 29 F.3d at 814; Aguiar, 975 F.2d at 47; accord White, 116 F.3d at 912; Houlihan, 92 F.3d at 1282. We extended that principle to situations where \"there was [no] ongoing proceeding in which the declarant was scheduled to testify.\" Miller, 116 F.3d at 668; see also Houlihan, 92 F.3d at 1279-80. The application of Mastrangelo under these circumstances is both logical and fair since a contrary rule \"would serve as a prod to the unscrupulous to accelerate the timetable and murder suspected snitches sooner rather than later.\" Houlihan, 92 F.3d at 1280.\n\n2. Whether Mastrangelo and Fed. R. Evid. 804(b)(6) Contain a Subject Matter Limitation\n\nFed. R. Evid. 804(b)(6), made effective December 1997, codified the waiver-by-misconduct doctrine as an exception to the hearsay rules by permitting the admission of hearsay statements \"offered against a party that has engaged or acquiesced in wrongdoing that was intended to, and did, procure the unavailability of the declarant as a witness.\" Fed. R. Evid. 804(b)(6); see also United States v. Ochoa, 229 F.3d 631, 639 (7th Cir. 2000). Under Rule 804(b)(6), \"a party forfeits the right to object on hearsay grounds to the admission of a declarant's prior statement when the party's deliberate wrongdoing or acquiescence therein procured the unavailability of the declarant as a witness.\" Fed. R. Evid. 804(b)(6) advisory committee's note to subdivision (b)(6); cf. Miller, 116 F.3d at 668 (holding that neither the existence of an ongoing proceeding nor a finding that the defendant's intention was to prevent the declarant from testifying is required to admit the declarant's out-of-court statement).\n\nBy its plain terms, Rule 804(b)(6) refers to the intent of a party to procure the unavailability of the witness, and does not, as Dhinsa contends, limit the subject matter of the witness' testimony to past events or offenses the witness would have testified about had he been available. See Emery, 186 F.3d at 926 (\"[Rule 804(b)(6)] contains no limitation on the subject matter of the statements that it exempts from the prohibition on hearsay evidence.\"). This interpretation is supported by the underlying purpose of the waiver-by-misconduct doctrine -- \"that a defendant may not benefit from his or her wrongful prevention of future testimony from a witness or potential witness.\" Id.; see also Cherry, 217 F.3d at 815 (\"To permit the defendant to profit from [wrongful] conduct would be contrary to public policy, common sense and the underlying purpose of the confrontation clause.\") (quotation marks omitted); White, 116 F.3d at 911 (\"[W]here a defendant has silenced a witness through the use of threats, violence or murder, admission of the victim's prior statements at least partially offsets the perpetrator's rewards for his misconduct.\"); Mastrangelo, 693 F.2d at 272-73; Steele, 684 F.2d at 1202 (\"A defendant cannot prefer the law's preference and profit from it, . . . while repudiating that preference by creating the condition that prevents it.\") (footnote omitted). Adoption of Dhinsa's proposed limitation would limit the proof against him -- the very result that the waiver-by-misconduct doctrine seeks to remedy. See Emery, 186 F.3d at 926. Further, we have declined to read in such a limitation in our pre-Rule 804(b)(6) decisions dealing with Mastrangelo evidence, permitting statements made by the declarant to be admitted where the murder of the declarant was one of the charged offenses. See, e.g., Miller, 116 F.3d at 667-69 (hearsay statement of murdered drug supplier made to his wife); Thai, 29 F.3d at 814-15 (hearsay statement of murdered store owner made to police); cf. Houlihan, 92 F.3d at 1279 (\"[A] defendant who wrongfully procures a witness's absence for the purpose of denying the government that witness's testimony waives his right under the Confrontation Clause to object to the admission of the absent witness's hearsay statements.\"); Aguiar, 975 F.2d at 47 (\"A defendant who procures a witness's absence waives the right of confrontation for all purposes with regard to that witness.\") (emphasis added). Because Rule 804(b)(6) was intended to codify the waiver-by-misconduct rule as it was applied by the courts at that time, see Ochoa, 229 F.3d at 639; Cherry, 217 F.3d at 815; White, 116 F.3d at 913, it is reasonable to conclude that Rule 804(b)(6) did not intend to create a subject matter limitation where one did not previously exist. See Cherry, 217 F.3d at 816 (\"We . . . read the plain language of Rule 804(b)(6) to permit the admission of those hearsay statements that would be admissible under the constitutional doctrine of waiver by misconduct.\"); cf. Estate of Gloeckner v. C.I.R., 152 F.3d 208, 214 (2d Cir. 1998); Smith v. Arkansas Dep't of Correction, 103 F.3d 637, 647 (8th Cir. 1996).\n\nIn sum, based on the plain language of Rule 804(b)(6) and the strong policy reasons favoring application of the waiver-by-misconduct doctrine to prevent a party from profiting from his wrongdoing, we hold that Rule 804(b)(6) places no limitation on the subject matter of the declarant's statements that can be offered against the defendant at trial to prove that the defendant murdered the declarant.\n\n3. The Requirements Under Mastrangelo in Light of Rule 804(b)(6)\n\nBy its plain terms, Rule 804(b)(6) requires a finding that the defendant acted with the intention of making the declarant unavailable as a witness. This conclusion is not disputed by the parties. A number of cases decided after Rule 804(b)(6) became effective have also read in an intent requirement. See, e.g., United States v. Johnson, 219 F.3d 349, 355-56 (4th Cir. 2000) (\"[Defendant] murdered [the witness] at least in part to procure the unavailability of the only witness to his murder.\"); Emery, 186 F.3d at 926 (\"[Rule 804(b)(6)] establishes the general proposition that a defendant may not benefit from his or her wrongful prevention of future testimony from a witness or potential witness.\"). Thus, consistent with our pre-Fed. R. Evid. 804(b)(6) precedent, we now hold that, prior to finding that a defendant waived his confrontation rights with respect to an out-of-court statement by an actual or potential witness admitted pursuant to Rule 804(b)(6), the district court must hold an evidentiary hearing outside the presence of the jury in which the government has the burden of proving by a preponderance of the evidence that (1) the defendant (or party against whom the out-of-court statement is offered) was involved in, or responsible for, procuring the unavailability of the declarant \"through knowledge, complicity, planning or in any other way,\" Miller, 116 F.3d at 668; and (2) the defendant (or party against whom the out-of-court statement is offered) acted with the intent of procuring the declarant's unavailability as an actual or potential witness. See Fed. R. Evid. 804(b)(6) advisory committee note to subdivision (b)(6) (adopting the preponderance of the evidence standard required under Fed. R. Evid. 104(a) \"in light of the behavior the new Rule 804(b)(6) seeks to discourage.\"); accord Houlihan, 92 F.3d at 1280 (\"We . . . hold that when a person who eventually emerges as a defendant (1) causes a potential witness's unavailability (2) by a wrongful act (3) undertaken with the intention of preventing the potential witness from testifying at a future trial, then the defendant waives his right to object on confrontation grounds to the admission of the unavailable declarant's out-of-court statements at trial.\"). But see Emery, 186 F.3d at 926 (holding that a trial court is not required to hold a 804(b)(6) hearing outside the presence of the jury but, instead, can admit the hearsay evidence \"at trial in the presence of the jury contingent upon proof of the underlying murder by a preponderance of the evidence\"). The government need not, however, show that the defendant's sole motivation was to procure the declarant's absence; rather, it need only show that the defendant \"was motivated in part by a desire to silence the witness.\" Houlihan, 92 F.3d at 1279; see also Johnson, 219 F.3d at 356. As Rule 804(b)(6) and our prior precedents do not require such a finding of sole motivation, we decline to read one into the rule. \"Further, in order to avoid the admission of facially unreliable hearsay, the district court should undertake a balancing of probative value against prejudicial effect in accordance with Fed. R. Evid. 403.\" Miller, 116 F.3d at 668 (internal quotation marks omitted). \"The district court's findings after a hearing will not be disturbed unless they are clearly erroneous, and we are particularly hesitant to disturb the court's determinations when they are based on its evaluation of the credibility of witnesses.\" Thai, 29 F.3d at 814.\n\n4. Lilly v. Virginia\n\nDhinsa argues that the application of the waiver-by-misconduct rule to allow the admission of hearsay statements of a declarant as evidence of that declarant's murder by the defendant is inconsistent with the Supreme Court's recent decision in Lilly v. Virginia, 527 U.S. 116 (1999) (plurality opinion). In response, the government argues that Dhinsa waived his confrontation rights by murdering the declarants and, therefore, the Mastrangelo evidence is not subject to the Lilly test.\n\nWe find the government's argument persuasive. Although the Supreme Court has recognized that the hearsay rules and the Confrontation Clause \"are generally designed to protect similar values,\" Idaho v. Wright, 497 U.S. 805, 814 (1990), it never has equated the two to suggest that \"the Confrontation Clause is nothing more or less than a codification of the rules of hearsay and their exceptions.\" California v. Green, 399 U.S. 149, 155 (1970); see also Dutton v. Evans, 400 U.S. 74, 86 (1970) (plurality opinion). As such, the Confrontation Clause may \"bar[] the admission of some evidence that would otherwise be admissible under an exception to the hearsay rule.\" Wright, 497 U.S. at 814; see also Green, 399 U.S. at 155-56; United States v. Torrez-Ortega, 184 F.3d 1128, 1132 n.2 (10th Cir. 1999). Because \"[t]he central concern of the Confrontation Clause is to ensure the reliability of the evidence against a criminal defendant by subjecting it to rigorous testing in the context of an adversary proceeding before the trier of fact,\" Lilly, 527 U.S. at 123-24 (quotation marks omitted), the determination of whether an out-of-court statement violates the Confrontation Clause is \"linked to an evaluation of trustworthiness.\" United States v. Bryce, 208 F.3d 346, 351 (2d Cir. 2000).\n\nIn Lilly, a four justice plurality of the Supreme Court reaffirmed the rule summarized roughly twenty years earlier in Ohio v. Roberts, 448 U.S. 56, 66 (1980), that \"the veracity of hearsay statements is sufficiently dependable to allow the untested admission of such statements against an accused when (1) the evidence falls within a firmly rooted hearsay exception or (2) it contains particularized guarantees of trustworthiness such that adversarial testing would be expected to add little, if anything, to the statements' reliability.\" 527 U.S. at 124-25 (plurality opinion of Stevens, Souter, Ginsburg and Breyer, JJ.) (internal quotation marks omitted). The concurring opinion of Justice Thomas and the concurring opinion of Chief Justice Rehnquist, joined by Justices O'Connor and Kennedy, also referenced the Roberts dual inquiries. See id. at 144, 148-49; see also Moskowitz, 215 F.3d at 269. In determining whether a statement contains a \"particularized guarantee of trustworthiness\" sufficient to permit its admission without violating the defendant's confrontation rights, the trial court should consider the totality of those circumstances \"that surround the making of the statement and that render the declarant particularly worthy of belief.\" Wright, 497 U.S. at 819; see also Bryce, 208 F.3d at 351; Mingo v. Artuz, 174 F.3d 73, 77 (2d Cir. 1999) (requiring a court to \"carefully examine each instance of incriminating hearsay in the light of all the circumstances\").\n\nImplicit in the application of the Lilly test is a presumption that the defendant has not waived his confrontation rights with respect to the declarant's statements. However, \"[o]nce the confrontation right is lifted from the scales by operation of the accused's waiver of that right,\" Houlihan, 92 F.3d at 1281, the district court is not required to assess independently the reliability of those statements under the rubric set forth in Lilly. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e See White, 116 F.3d at 913 (rejecting defendants' claim that the trial court \"should have looked for the sort of indicia of trustworthiness that often support an exception to the confrontation or hearsay rules\" where the defendants forfeited their right under the hearsay rule); Houlihan, 92 F.3d at 1281 (\"[Defendants'] misconduct waived not only their confrontation rights but also their hearsay objections, thus rendering a special finding of reliability superfluous.\").\n\nThis does not, however, mean that the declarant's statements will be admitted automatically. As discussed supra, after the district court finds by a preponderance of the evidence that the hearsay statement is admissible under Fed. R. Evid. 804(b)(6), it must still perform the balancing test required under Fed. R. Evid. 403 \"in order to avoid the admission of facially unreliable hearsay.\" Thai, 29 F.3d at 814 (internal quotation marks omitted); see also Miller, 116 F.3d at 668; Aguiar, 975 F.2d at 47; accord White, 116 F.3d at 913 (\"[D]efendants were free to move for exclusion under Rule 403 based upon the lack of reliability of the agents who relayed [the declarant's] testimony.\"); Houlihan, 92 F.3d at 1282 n.6 (\"[Where a defendant waives his confrontation rights], a district court still should exclude relevant but highly inflammatory evidence, misconduct notwithstanding, if the danger of unfair prejudice substantially outweighs the evidence's probative value.\"). Thus, while a finding that a statement may be admitted under Rule 804(b)(6) -- resulting in a waiver of the defendant's confrontation rights and hearsay objections -- renders the Lilly test inapplicable, the district court must still balance the probative value of the evidence against its prejudicial effect in accordance with Rule 403.\n\n5. Application of Harmless Error Analysis to Violations of the Confrontation Clause and the Present Case\n\nDhinsa argues that the district court's failure to make a finding that he intended to \"eliminate the declarant[s] as . . . witness[es]\" prior to the admission of the Mastrangelo statements was not harmless error. Dhinsa further argues that the admission of such evidence was not harmless under the present circumstances. We disagree.\n\nA violation of a defendant's confrontation rights does not, standing alone, require reversal of a judgment of conviction. Rather, the Supreme Court has held that violations of the Confrontation Clause are subject to harmless error analysis. See Arizona v. Fulminante, 499 U.S. 279, 306-07 (1991) (noting that the harmless error analysis has been applied to a wide range of constitutional errors); Van Arsdall, 475 U.S. at 684; see also Lilly, 527 U.S. at 143 (Scalia, J., concurring in part and concurring in the judgment). We have similarly applied a harmless error analysis in evaluating violations of the Confrontation Clause, see, e.g., Moskowitz, 215 F.3d at 270; United States v. Gallego, 191 F.3d 156, 168 (2d Cir. 1999) (\"Even were we to conclude that the district court erred by admitting [the] plea allocution into evidence, the record before us makes clear that any such error would have been harmless.\"), cert. denied, 120 S.Ct. 2220 (2000); United States v. Aulicino, 44 F.3d 1102, 1109 (2d Cir. 1995); United States v. Williams, 927 F.2d 95, 99 (2d Cir. 1991), and, specifically, we have applied harmless error analysis where the trial court failed to hold a Mastrangelo hearing. See Miller, 116 F.3d at 669; see also Emery, 186 F.3d at 927. Thus, notwithstanding the requirement that the trial court hold an evidentiary hearing prior to the admission of the challenged witness statements, the failure to do so may constitute harmless error if the evidence presented at trial sufficiently establishes that the defendant was involved in, and intended to procure, the unavailability of the declarants as witnesses.\n\nIn the present case, the parties acknowledge that the district court made the requisite finding under Mastrangelo that Dhinsa was responsible for the murders of Manmohan and Satinderjit. The parties also agree that Rule 804(b)(6) requires a finding by the trial court that the defendant intended to cause the unavailability of the declarants as witnesses (although they disagree on the definition of the term \"witness\" under that Rule), but that Dhinsa failed to object to the introduction of the Mastrangelo evidence under Fed. R. Evid. 804(b)(6). The parties part ways, however, on the effect of Dhinsa's failure to raise Rule 804(b)(6) and, specifically, his failure to object to the admission of that evidence on the ground that the government had the burden of showing that Dhinsa committed the murders for the purpose of procuring the unavailability of the declarants as witnesses. Because we find that any error by the district court in failing to make such a finding was harmless in light of the substantial evidence supporting that conclusion, we need not decide whether Dhinsa waived his objection to the admission of the Mastrangelo evidence under Rule 804(b)(6) for the purposes of the instant appeal.\n\nAs an initial matter, Dhinsa cannot credibly maintain that his involvement in organizing and facilitating the murders of Manmohan and Satinderjit does not establish that he \"engaged or acquiesced in wrongdoing\" within the meaning of Rule 804(b)(6). See Cherry, 217 F.3d at 816. Significantly, Dhinsa does not argue that the hearsay statements were unreliable or inherently untrustworthy. On the contrary, Dhinsa acknowledges that these statements were \"undeniably powerful proof\" that he was responsible for Manmohan and Satinderjit's murders. We agree. The record amply demonstrates that Dhinsa murdered Manmohan and Satinderjit to \"depriv[e] the government of . . . potential witness[es].\" Houlihan, 92 F.3d at 1280; see also Thai, 29 F.3d at 815.\n\nWith respect to Manmohan, Dhinsa feared that Manmohan would go to the police regarding Dhinsa's involvement in Kulwant's disappearance. This fear was well founded in light of Manmohan's repeated confrontations with Dhinsa and other members of the Singh Enterprise in which he accused them of being responsible for his brother's disappearance. Dodson also testified that Dhinsa ordered Manmohan murdered because he had \"seen [Dhinsa] and Gogi shoot somebody, and the police [were] getting close to the guy.\" Thus, Dhinsa believed that Manmohan posed a threat to the Singh Enterprise and to Dhinsa and Gogi personally by his cooperation with the police. See, e.g., Houlihan, 92 F.3d at 1280-81; Thai, 29 F.3d at 815 (defendant motivated by declarant's cooperation with police).\n\nWith respect to Satinderjit, the evidence presented at trial established that Satinderjit was in fact cooperating with the police at the time Dhinsa ordered Dodson to kill him, providing police with information regarding Manmohan's murder, Kulwant's disappearance and the Citygas pump-rigging scheme. Satinderjit's active involvement with the police is evidenced by his presence at the May 1997 raid of the Citygas offices in Brooklyn, New York during which Dhinsa, Gogi and other members of the Singh Enterprise were arrested. Dodson testified that Dhinsa ordered Satinderjit murdered because he was \"a witness against his brother.\" Dodson also testified that Dhinsa was upset that he was taking too long to murder Satinderjit and ordered Dodson to act quickly since Satinderjit was \"supposed to go to see the [g]rand [j]ury.\" Powell and Samuels, the other members of the group of hitmen hired by Dhinsa, similarly testified that Dhinsa wanted Satinderjit murdered quickly to prevent him from testifying against Gogi and himself. Dhinsa also made threatening calls to Manmohan warning him to cease his efforts to locate his brother and similar calls to Uberoi, Satinderjit's girlfriend, warning her that they would both be shot \"if [Satinderjit] did not stop messing around with his case and did not stay out of his business.\" Thus, there was sufficient support in the record to establish that Dhinsa murdered Manmohan and Satinderjit because he believed that they both had knowledge concerning his criminal activities, as well as those of other members of the Singh Enterprise, and, therefore, could cooperate in a police investigation targeting Dhinsa and the Singh Enterprise. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e See Thai, 29 F.3d at 815. We also find that the admission of these statements under Rule 403 did not constitute an abuse of discretion. See United States v. Gelzer, 50 F.3d 1133, 1139 (2d Cir. 1995). Further, in light of Dodson's testimony corroborating the fact that Dhinsa ordered the murders to prevent Manmohan and Satinderjit from testifying against him, his brother Gogi and other key members of the Singh Enterprise, and the cellular telephone records establishing Dhinsa's contact with Dodson on the day of the murders, we conclude that \"it is unlikely that [Dhinsa] would have prevailed at trial\" absent admission of Manmohan and Satinderjit's hearsay statements. Gallego, 191 F.3d at 165; cf. Van Arsdall, 475 U.S. at 684 (\"The correct inquiry is whether, assuming that the damaging potential of the cross-examination were fully realized, a reviewing court might nonetheless say that the error was harmless beyond a reasonable doubt.\"); Jean-Baptiste, 166 F.3d at 108. Accordingly, the district court's admission of the Mastrangelo evidence relating to statements made by Manmohan and Satinderjit should not be disturbed.\n\nB. Testimony of Julie Uberoi\n\nDhinsa argues that the district court improperly admitted the testimony of Uberoi, Satinderjit's girlfriend, regarding threatening telephone calls she received from an individual identifying himself as \"Gurmeet Singh.\" We find that there was a sufficient basis for the district court to conclude that the telephone calls were adequately authenticated under Fed. R. Evid. 901 and, therefore, the district court did not abuse its discretion in admitting that testimony.\n\nDhinsa objected to the admission of Uberoi's testimony, arguing that the telephone calls were not properly authenticated. This prompted the district court to hold a hearing outside the presence of the jury, during which Uberoi testified about the two telephone calls she allegedly received from Dhinsa. In the first call, Uberoi testified that an individual, speaking in a mix of Punjabi and English, identified himself as \"Gurmeet Singh\" and asked Uberoi if she would convey a message to Satinderjit, whom he referred to as \"Ladu.\" The caller stated that he would have Satinderjit and Uberoi shot if Satinderjit did not \"stay out of his business and not mess around with the case.\" Uberoi agreed to relay the message to Satinderjit, and did so later that day. A few days later, Uberoi received a second telephone call from an individual again identifying himself as Gurmeet Singh. The caller inquired about whether Uberoi conveyed his earlier message. Uberoi indicated that she had conveyed the message, but that Satinderjit \"didn't have much to say about it.\" The caller then asked Uberoi if \"[she] told [Satinderjit] that he would have us shot if [Satinderjit] didn't stop messing around and to stay out of his business.\" After Uberoi informed Satinderjit about the second call, he instructed her not to take similar calls in the future.\n\nRule 901(a) of the Federal Rules of Evidence provides that \"[t]he requirement of authentication or identification as a condition precedent to admissibility is satisfied by evidence sufficient to support a finding that the matter in question is what its proponent claims.\" See also Ricketts v. City of Hartford, 74 F.3d 1397, 1409 (2d Cir. 1996); United States v. Sliker, 751 F.2d 477, 496-500 (2d Cir. 1984) (discussing the interaction between Fed. R. Evid. 104 and 901). Rule 901 \"does not erect a particularly high hurdle,\" United States v. Ortiz, 966 F.2d 707, 716 (1st Cir. 1992), and the proponent of the evidence is not required \"to rule out all possibilities inconsistent with authenticity, or to prove beyond any doubt that the evidence is what it purports to be.\" United States v. Pluta, 176 F.3d 43, 49 (2d Cir.) (internal quotation marks omitted), cert. denied, 120 S.Ct. 248 (1999). The requirement under Rule 901 is satisfied \"if sufficient proof has been introduced so that a reasonable juror could find in favor of authenticity or identification.\" United States v. Ruggiero, 928 F.2d 1289, 1303 (2d Cir. 1991) (quotation marks omitted); see also Pluta, 176 F.3d at 49 (\"[T]he standard for authentication, and hence for admissibility, is one of reasonable likelihood.\") (quotation marks omitted); Ortiz, 966 F.2d at 716 (\"If in the court's judgment it seems reasonably probable that the evidence is what it purports to be, the command of Rule 901(a) is satisfied, and the evidence's persuasive force is left to the jury.\") (quotation marks omitted). The trial court has broad discretion in determining whether an item of evidence has been properly authenticated, and we review its ruling only for abuse of discretion. See Pluta, 176 F.3d at 49; see also Ruggiero, 928 F.2d at 1303.\n\n\"A telephone conversation is admissible in evidence if the identity of the speaker is satisfactorily established.\" United States v. Albergo, 539 F.2d 860, 863-64 (2d Cir. 1976). \"While a mere assertion of identity by a person talking on the telephone is not in itself sufficient to authenticate that person's identity, some additional evidence, which `need not fall in[to] any set pattern,' may provide the necessary foundation.\" United States v. Khan, 53 F.3d 507, 516 (2d Cir. 1995) (quoting Fed. R. Evid. 901(b)(6) advisory committee notes, ex. 6); cf. Fed. R. Evid. 901(b) (providing a non-exhaustive list of examples that satisfy the authentication requirement); Fed. R. Evid. 901 advisory committee note to subdivision (b) (\"The examples [in Rule 901(b)] are not intended as an exclusive enumeration of allowable methods but are meant to guide and suggest, leaving room for growth and development in this area of the law.\"). For example, \"[t]he authentication may be established by circumstantial evidence such as the similarity between what was discussed by the speakers and what each subsequently did.\" United States v. Puerta Restrepo, 814 F.2d 1236, 1239 (7th Cir. 1987); see also United States v. Garrison, 168 F.3d 1089, 1093 (8th Cir. 1999) (\"[A] `telephone conversation may be shown to have emanated from a particular person by virtue of its disclosing knowledge of facts known peculiarly to him.'\") (quoting Fed. R. Evid. 901(b)(6) advisory committee notes, ex. 4); United States v. Ingraham, 832 F.2d 229, 236 (1st Cir. 1987) (\"[I]t is a well-settled proposition that someone familiar with the speaker's voice need not identify it before evidence of a call can be admitted.\"). We apply these standards in determining whether the district court abused its discretion in finding that the evidence \"adequately established that [Dhinsa] was more likely than not the caller.\" Khan, 53 F.3d at 516.\n\nFollowing a hearing during which Uberoi testified, the district court ruled that there was sufficient evidence for a jury to conclude that Dhinsa, or someone acting on his behalf, made the threatening telephone calls to Uberoi. Specifically, the district court concluded that the telephone calls were adequately authenticated based on, inter alia, (1) the fact that the caller identified himself as the defendant; and (2) the need for Dhinsa to identify himself in order to receive the \"benefit\" of the threat. Because we are not persuaded that the district court abused its discretion in admitting Uberoi's testimony regarding the threatening telephone conversations, we reject Dhinsa's challenge. See Morrison, 153 F.3d at 56; Khan, 53 F.3d at 516.\n\nC. July 7, 1997 Inventory Search of Dhinsa's Car\n\nDhinsa argues that the district court erred by admitting certain evidence discovered during a search of his car conducted after Dhinsa was arrested in connection with Satinderjit's murder. On appeal, Dhinsa asks that we examine the legality of both the warrantless seizure and search of his car, a task we did not undertake in our prior decision, and reverse his convictions for racketeering and mail fraud, the murders of Manmohan and Satinderjit, conspiring to murder Sarvjeet and threatening to murder Balwant. Because we now conclude beyond a reasonable doubt that the jury verdict on these counts would have been the same absent the alleged error, we need not opine on whether the district court erred by admitting the evidence obtained during the July 7, 1997 search of Dhinsa's car. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e See, e.g., Pluta, 176 F.3d at 51.\n\nIt is beyond cavil that most constitutional errors occurring during trial may be deemed harmless and, thus, not require automatic reversal of a conviction. See Neder, 527 U.S. at 8; Fulminante, 499 U.S. at 306. Categorized as \"trial errors,\" these errors typically arise \"during the presentation of the case to the jury,\" Fulminante, 499 U.S. at 307, and are suited for harmless error analysis because such errors can be \"quantitatively assessed in the context of other evidence presented in order to determine whether [their] admission was harmless beyond a reasonable doubt.\" Id. at 308; cf. United States v. Feliciano, 223 F.3d 102, 110-11 (2d Cir. 2000) (distinguishing between \"trial errors\" and \"structural errors,\" which require automatic reversal). Courts have applied harmless error analysis in considering claims that evidence was erroneously admitted at trial. See, e.g., Chambers v. Maroney, 399 U.S. 42, 52-53 (1970) (evidence obtained during a search in violation of the Fourth Amendment); United States v. Tubol, 191 F.3d 88, 96 (2d Cir. 1999); Colombo, 909 F.2d at 713-14.\n\nIn analyzing this class of constitutional errors, we must apply the harmless error standard set forth in Fed. R. Crim. P. 52(a), and \"must disregar[d] errors that are harmless beyond a reasonable doubt.\" Neder, 527 U.S. at 7 (internal quotation marks omitted). Thus, \"[w]here a reviewing court can find that the record developed at trial establishes guilt beyond a reasonable doubt . . . the judgment should be affirmed.\" Rose v. Clark, 478 U.S. 570, 579 (1986). Having determined that evidentiary errors are properly subject to harmless error analysis, we must proceed to the question of whether the admission of the evidence obtained from the search of Dhinsa's car was harmless under the present circumstances. We consider each of Dhinsa's convictions separately for purposes of our harmless error analysis. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e See Tubol, 191 F.3d at 97.\n\n1. Murders of Manmohan and Satinderjit\n\nAssuming arguendo that the district court erred in admitting the items discovered during the search of Dhinsa's car, we conclude that such error was harmless beyond a reasonable doubt in light of the \"direct and overwhelming evidence,\" Moskowitz, 215 F.3d at 270, of Dhinsa's participation in the murders of Manmohan and Satinderjit. We analyze the evidence presented by the government with respect to these murders separately.\n\nNumerous witnesses testified that Manmohan was actively investigating his brother Kulwant's disappearance from a Citygas station on or about July 1995. To that end, Manmohan confronted Gulzar and other members of the Singh Enterprise and planned to confront Gulzar and Dhinsa directly concerning their role in Kulwant's disappearance at the time he was murdered. Manmohan's attempts to meet with Gulzar were independently corroborated by telephone records of calls made to Gulzar's beeper from the gas station where Manmohan worked. Thus, a jury reasonably could infer that Manmohan's inquiries posed a threat to Dhinsa, Gulzar and other members of the Singh Enterprise, as well as to the continued operations of the Singh Enterprise.\n\nThe strongest evidence of Dhinsa's involvement in Manmohan's murder came from the testimony of Dodson and Powell, Dhinsa's co-conspirators in the murder of Manmohan, and the cellular telephone records that established Dhinsa's contact with Dodson and the other hitmen around the time and location of Manmohan's murder. Dodson testified that Dhinsa arranged to meet with him near the gas station where Manmohan worked a few days before Manmohan was murdered. During that meeting, Dhinsa instructed Dodson to kill Manmohan because he was cooperating with the police in a murder investigation involving his brother Gogi. After identifying Manmohan as one of the attendants working at the gas station where they met, Dhinsa told Dodson to check with Gulzar to confirm the victim's identity and directed Dodson to go to a nearby Citygas station to pick up the gun to be used for the murder. At Dhinsa's suggestion that he find someone to assist him in committing the murder, Dodson contacted Powell, a member of the trio of hitmen employed by Dhinsa. Payroll records seized at the Citygas headquarters in Brooklyn, New York a few months later confirm that Dodson was an employee of Citygas at that time, receiving a weekly salary of $700.\n\nPowell's testimony and cellular telephone and pager records corroborate Dodson's version of the events surrounding Manmohan's murder. The telephone records establish that Dodson made numerous attempts to contact Dhinsa and Gulzar during the period March 14 through March 16, 1997, the day Manmohan was murdered. These records also indicate that Dodson called Dhinsa and Gulzar within hours after Manmohan was murdered, presumably to inform them of his success. The government also presented evidence that the vehicle driven by Dodson during the murder was registered to a company owned by Dhinsa, and that Dhinsa arranged to have the truck repainted and re-registered following Manmohan's murder.\n\nThe evidence of Dhinsa's involvement in Satinderjit's murder is equally overwhelming. Numerous witnesses testified that Satinderjit was actively cooperating with police in an investigation of Dhinsa and the Singh Enterprise at the time he was murdered. Uberoi, Satinderjit's girlfriend, testified that Dhinsa contacted her twice, threatening to have her and Satinderjit shot if Satinderjit continued to assist the police in its investigation of Dhinsa. Dodson testified that Dhinsa ordered Satinderjit murdered shortly after the July 1997 police raid of his Citygas offices in Brooklyn, New York. Dodson further testified that Dhinsa drove him to Satinderjit's neighborhood and identified his apartment. A short time later, Dhinsa provided Dodson with a photograph of Satinderjit and a printout of the registration and license plate for Satinderjit's car. An employee of the insurance company testified that she ran the check on Satinderjit's car at the request of Antonio Galvan, an employee of Citygas.\n\nSimilar to Manmohan's murder, cellular telephone records corroborate Dodson's version of Satinderjit's murder. These records show that Dhinsa made in excess of thirty telephone calls to Dodson in the days and weeks before Satinderjit was murdered and establish a sequence of calls between Dhinsa, Samuels and Powell on June 18, 1997, the day Satinderjit was murdered. The telephone records confirm Dhinsa's presence in calling areas near the location where Satinderjit was murdered. The government also presented testimony from Samuels and Powell, who corroborated Dodson's version of Satinderjit's murder, and from Santokh, an employee at a Citygas station owned by Dhinsa, who testified that Dhinsa directed him to change the license plate on the van used by Dodson during Satinderjit's murder.\n\nViewing the trial record as a whole, we conclude that the items recovered during the search of Dhinsa's car relating to the murders of Manmohan and Satinderjit were at most only cumulative and corroborative evidence of Dhinsa's involvement in these murders. The government presented extensive evidence, including testimony from Dodson, Samuels and Powell, Dhinsa's co-conspirators in the murders, cellular telephone and site records and other documentary evidence, that \"provid[ed] ample independent basis for [Dhinsa's] convictions.\" Gallego, 191 F.3d at 169. The items obtained during the search that related to these murders -- a piece of paper bearing Dodson's name and a piece of paper bearing the name of the detective that arrested Dodson and the voucher number of the car Dodson was driving at the time of his arrest -- were only a minor part of the overwhelming evidence presented by the government establishing Dhinsa's guilt for these murders. See Neder, 527 U.S. at 17; Moskowitz, 215 F.3d at 270; United States v. Lyles, 593 F.2d 182, 196 (2d Cir. 1979); cf. Colombo, 909 F.2d at 714 (evidence of defendant's guilt passed the sufficiency of the evidence test by a \"hair's breadth\") (quotation marks omitted). Further, the government did not \"continuously and repeatedly impress[] [upon] the jury\" that Dhinsa should be found guilty on the basis of the items obtained during the search of Dhinsa's car. Chapman, 386 U.S. at 25, 26 (holding that a \"machine-gun repetition of a denial of constitutional rights\" was not harmless); see also Lyles, 593 F.2d at 196. Rather, the government argued that the jury consider that evidence as corroboration of the testimony of Dhinsa's co-conspirators and the cellular telephone records that clearly established Dhinsa's involvement in the murders of Manmohan and Satinderjit. Thus, even if we were to view the admission of the contents of the July 7 search as erroneous, it is clear beyond a reasonable doubt that \"the outcome would not have been altered.\" United States v. Joyner, 201 F.3d 61, 76 (2d Cir. 2000). \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\n2. Plot to Murder Sarvjeet\n\nThe decision to murder Sarvjeet was the result of Sarvjeet's cooperation with the police in an investigation of a homicide allegedly committed by Gogi in 1991. A few weeks after Gogi was arrested at Dhinsa's Citygas offices in Brooklyn based on Sarvjeet's identification, Gurdial, Dhinsa's cousin and a Citygas employee, rented an apartment directly across from where Sarvjeet lived. Notably, Dhinsa was listed as the guarantor on the lease for that apartment. Numerous witnesses, including the person living in Sarvjeet's home, testified that Dhinsa was actively looking for Sarvjeet around that same time. Further, Samuels and Powell testified that Dhinsa instructed them to kill Sarvjeet, taking them to Sarvjeet's home and directing their escape route following the murder. Samuels and Powell also testified as to the manner in which Dhinsa instructed them to carry out Sarvjeet's murder.\n\nEven excluding the piece of paper bearing Sarvjeet's address that was discovered during the search of Dhinsa's car, the evidence of Dhinsa's role in the plot to murder Sarvjeet was overwhelming. Similar to the items relating to the murders of Manmohan and Satinderjit, the piece of paper with Sarvjeet's address merely corroborated the testimony of Samuels and Powell, Dhinsa's co-conspirators in that murder plot, and numerous witnesses that testified regarding Dhinsa's efforts to locate Sarvjeet following Gogi's arrest in May 1997. Dhinsa's status as the guarantor on the lease for the apartment across from where Sarvjeet lived that was presumably used to monitor Sarvjeet's movements is further evidence of his involvement in the plot to murder Sarvjeet. Contrary to Dhinsa's description of the paper bearing Sarvjeet's address as a \"smoking gun,\" a careful reading of the record reveals that the piece of paper \"constituted but a small part of the government's proof.\" United States v. Langford, 990 F.2d 65, 70 (2d Cir. 1993); see also United States v. Nivica, 887 F.2d 1110, 1115 (1st Cir. 1989). Given the strength of the government's proof on Dhinsa's involvement in the plot to kill Sarvjeet, we conclude that any error resulting from the district court's admission of the evidence relating to that crime obtained during the search of Dhinsa's car amounted, at most, to harmless error.\n\n3. Pump-Rigging Scheme\n\nThe evidence presented by the government in connection with Dhinsa's pump-rigging scheme and the bribes made to corrupt DCA inspector Woods was equally overwhelming. Dozens of former Citygas employees and gasoline attendants testified as to the existence of the pump-rigging device and how it operated. In addition, former Citygas customers testified about being short-changed during gasoline purchases at Citygas stations. FBI agent Glynn and DCA inspectors testified that they recovered a pump-rigging apparatus at various Citygas stations and the DCA inspectors described how the device controlled the flow of gasoline purchased by consumers. The DCA inspectors further testified that gasoline purchases made by the DCA in an undercover vehicle revealed a shortfall at thirteen of the sixteen Citygas stations targeted by the DCA. The government also presented notebooks obtained during the search of the Citygas offices in Brooklyn, New York that contained accounting records of the pump-rigging scheme.\n\nDCA inspector Woods testified that he regularly received payments from Dhinsa in exchange for information regarding DCA investigations involving Citygas and future field visits scheduled at Citygas stations. Dhinsa's connection to Woods was established independently through bank records and records maintained at the Citygas offices in Brooklyn, New York showing that Dhinsa paid Woods' cellular telephone bills. The government also presented an audio tape of a conversation between Dhinsa and Gulzar during which they discussed payment of Woods' cellular telephone bill and a videotape of Antonio Galvan making a payment to Woods.\n\nThe evidence obtained from the search of Dhinsa's car related to the pump-rigging scheme and Dhinsa's arrangement with Woods consisted principally of DCA seals and stickers, a cellular telephone bill addressed to Woods and various papers bearing Woods' name. In light of the extensive evidence of the pump-rigging scheme and the bribes made by Dhinsa to Woods, we need not pause in concluding that any possible error in failing to suppress the challenged evidence was harmless as a matter of law.\n\nThe last issue that we must address concerns statements made by the district court in connection with its ruling on Dhinsa's suppression motion. Specifically, Dhinsa points to the district court's statement that a denial of his motion to suppress the fruits of the July 7, 1997 search of his car would not constitute harmless error.\n\nWe are unprepared to say that the government's attempts before the district court and this Court to introduce the items obtained during the search of Dhinsa's car leads to the conclusion that the government placed a \"heavy reliance\" on that evidence. As a matter of course, most suppression motions are decided early on during a criminal proceeding, before the parties have had the opportunity to present their case before the jury. Accordingly, assessments made at that time regarding the importance of evidence that is the subject of a suppression motion may vary when evaluated against the trial record as a whole. See United States v. Annigoni, 96 F.3d 1132, 1144 (9th Cir. 1996) (en banc) (noting that in conducting harmless error analysis, a court has the \"entire trial record as a frame of reference against which to compare the erroneously admitted [evidence]\"). That conclusion is reinforced in cases like the present where the trial record contains voluminous testimony and exhibits. On a similar note, surely the government's decision to appeal an adverse suppression ruling, which was contrary to the district court's express findings of fact and conclusions of law and made before the government presented its case-in-chief, does not automatically lead to the conclusion that admission of the evidence subject to the suppression order is not harmless as a matter of law. A contrary result would hamstring the government's ability to appeal an adverse suppression ruling made early on during the trial by forcing the government to forego such an appeal in order to avoid a later determination that the evidence subject to the suppression ruling was essential to its case and, thus, its admission could not be harmless.\n\nTo the extent the district court commented on the significance of the evidence obtained from that search, those comments represented the district court's preliminary assessment of that evidence in establishing Dhinsa's guilt for the crimes charged in the indictment. However, that assessment, like any other preliminary assessment, was subject to modification after the court had the opportunity to consider the totality of the government's case. This conclusion is reinforced by statements made by the district court after the jury returned its verdict. There, the district court stated that Dhinsa's guilt \"was a certainty . . . and it was the cell phone and the cell site records that made it a certainty.\" Accordingly, we reject Dhinsa's argument that the district court's comments foreclose a conclusion that, assuming arguendo that the district court erred in admitting the fruits of the July 7, 1997 search, such error could not be harmless.\n\nIII. Amendment of the Indictment\n\nDhinsa next argues that the district court impermissibly allowed the government to amend the indictment near the end of the trial to substitute federal kidnapping charges under the Lindbergh law, 18 U.S.C. § 1201(a)(1), in place of the kidnapping charges originally brought under the Violent Crime in Aid of Racketeering statute (VICAR), 18 U.S.C. § 1959(a)(1), (5), based on a violation of N.Y. Penal Law § 135.20 (kidnapping in the second degree). Specifically, Dhinsa argues that he was unfairly prejudiced by the amendment because it occurred after the government rested its case and Dhinsa moved for a judgment of acquittal on the VICAR kidnapping counts and after the district court suggested, sua sponte, that the government amend the indictment based on its view of the evidence presented at trial. In arguing that the amendment of the kidnapping charges was proper, the government relies on the fact that the amendment was made by the Grand Jury, rather than by itself or the district court, following extensive discussion before the district court during which Dhinsa was unable \"to explain how he would suffer any prejudice as a result of such an amendment.\" The government draws support for its position from statements made by defense counsel during the trial indicating that it did not intend to attack Ghuman's version of the events but, rather, would prove that the kidnapping was an elaborate ploy designed to benefit Ghuman in connection with his dispute with his business partners. Thus, as the government argues, the additional requirement under the federal kidnapping statute that the government prove that Ghuman traveled across state lines caused no increased burden on Dhinsa's defense. We agree with Dhinsa, but are careful to point out that our conclusion is limited to the narrow circumstances in this case. Because the chronology and the content of the discussions between the district court and the parties on this issue is critical to Dhinsa's claim on appeal, we reproduce the relevant portions of the trial transcript below.\n\nThe indictment, as originally filed, charged Dhinsa with kidnapping and conspiring to kidnap Ghuman in aid of racketeering under 18 U.S.C. § 1959. Near the close of the government's case-in-chief, the district court questioned two aspects of the government's proof with respect to the kidnapping charges relating to Ghuman: (1) how Ghuman's abandonment of his interest in his restaurant affected interstate commerce and (2) how the kidnapping of Ghuman helped Dhinsa maintain his interest in the Singh Enterprise. At that time, Dhinsa indicated that he intended to make a Rule 29 motion on these grounds. After a brief discussion, the district court noted that \"there is a Federal kidnapping statute,\" but it did not know whether a violation of that statute was alleged in the indictment. The government indicated that it chose to charge Dhinsa under the VICAR statute, arguing that the kidnapping was tied to the enterprise. At that point, the first of many similar exchanges took place between the district court, Mr. Shargel, Dhinsa's defense counsel, and AUSA Campbell about whether an amendment of the indictment to that effect could be properly made:\n\nTHE COURT: Again, but there is a Federal kidnapping statute.\n\nMR. SHARGEL: -- it violates the Lindbergh law.\n\nAUSA CAMPBELL: We didn't charge the . . . Federal kidnapping statute.\n\nTHE COURT: Why?\n\nAUSA CAMPBELL: Chose not.\n\nTHE COURT: I mean, do we -- it would have been too easy. I don't understand. Why isn't the Federal statute applicable here?\n\nMR. SHARGEL: The Federal kidnapping statute?\n\nTHE COURT: Yes.\n\nMR. SHARGEL: Because that's not the way it was charged. The underlying kidnapping is a State kidnapping.\n\nThe government did not move to amend the indictment at that time. Following a voir dire of Ghuman by the parties regarding Ghuman's abandonment of his interest in the restaurant, the district court ruled that the government could introduce evidence regarding Ghuman's fear of reporting the incident and that the \"interstate commerce issue\" could go to the jury.\n\nThe issue of amending the indictment arose a second time on the following day, absent any motion by the government seeking to amend the indictment:\n\nTHE COURT: The Grand Jury that returned the superseding indictment is still sitting?\n\nAUSA CAMPBELL: Yes.\n\nTHE COURT: Then it may not be too late to fix this kidnapping count. It only needs one additional element to make out a federal kidnapping violation.\n\nI don't know why you didn't indict it. My recollection is -- I haven't looked at the statute in a long time -- it's not just for ransom.\n\nMR. SHARGEL: That would be a novel approach.\n\nTHE COURT: I can't think of any reason why an indictment can't be amended, particularly, since the gist of what happened here is charged. I mean it's only a question of, you know, of revising what has essentially been charged and proven. So, you should think about it. I don't have to decide that now but I just think this charge, as it exists now, is sort of tenuous.\n\nMR. SHARGEL: I don't want my silence to suggest that I think this is a good idea or [a] constitutional process.\n\nTHE COURT: You've had -- the substance of this crime has been charged. . . . I'm not suggesting that in the middle of trial, they add a count that's totally out of the blue. You look at this count, the only thing that's really missing is that they moved him . . . across state lines.\n\nMR. SHARGEL: One [other] problem might be the Court's sua sponte suggestion --\n\nTHE COURT: I don't even know if the guys in his office have the courage to do it.\n\nAUSA CAMPBELL: I don't either.\n\nMR. SHARGEL: I'm entitled, I think, to go to trial on the indictment that the Grand Jury voted . . . to put the Government through the test of proving this by sufficient evidence and meet or survive a Rule 29 motion and by going back to the Grand Jury, I'm deprived of that process to which I am due.\n\nA few days later, after the government stated that it \"[c]ouldn't find a man of courage\" to amend the indictment, the district court again raised the issue of amending the indictment, and Dhinsa preserved his right to make a Rule 29 motion regarding, inter alia, the kidnapping counts related to Ghuman. Following a brief discussion regarding miscellaneous evidentiary matters, the government rested its case, and Dhinsa moved for a judgment of acquittal under Fed. R. Crim. P. 29(a) on all counts in the indictment. The district court reserved decision on Dhinsa's motion, and Dhinsa began his defense.\n\nAt the close of that day's proceedings, Dhinsa raised specific arguments in connection with his Rule 29 motion. In particular, Dhinsa argued that the government failed to establish that the Ghuman kidnapping charges were committed in furtherance of the racketeering enterprise. At that time, the issue of amending the indictment again arose:\n\nTHE COURT: You're going to leave [the indictment] the way it is, I take it?\n\nAUSA CAMPBELL: We need to take a look at the case that you gave us.\n\nTHE COURT: Well, if they amend it there's no problem at all.\n\nMR. SHARGEL: Well, you know already that I objected.\n\nTHE COURT: I know but the objection has no merit.\n\nRecognizing that the government's proof on this point was \"very tenuous,\" the district court again reserved decision on the matter. The following day, the district court inquired as to what the government intended to do about the kidnapping charges related to Ghuman. The government stated that it would decide the matter by the next day, and asked defense counsel to articulate the prejudice that Dhinsa potentially would suffer as a result of an amendment. The following exchange, similar to the prior exchanges on this issue, ensued between the district court and the parties:\n\nMR. SHARGEL: My point is very simple, that this does not accord with established criminal procedure. . . . [T]here is no authority or basis to amend the indictment by a Grand Jury of an open case.\n\nTHE COURT: [D]id you notice you didn't hear any prejudice?\n\nAUSA CAMPBELL: I was listening.\n\nMR. SHARGEL: I can't deal with that because if the indictment had been returned in a timely and proper fashion I would have had the opportunity to see whether or not there were motions addressed to that charge and to have to face new charges - -\n\nTHE COURT: Well, you can make all of those motions afterwards.\n\nMR. SHARGEL: The difference here is that . . . unlike [in United States v. McGrath, 558 F.2d 1102 (2d Cir. 1977)], in this case [there is] the introduction of a new charge containing different elements --\n\nTHE COURT: It's not a new charge. One element is different.\n\nMR. SHARGEL: [T]he [McGrath] case talks about a very, very slight change to the name of the entity [listed in the indictment].\n\nIf the Government is permitted to amend an indictment in the middle of a trial that would render [Fed. R. Crim. P.] 12 [a nullity] because that would deprive the defendant of his opportunity to make arguments prior to trial.\n\nThe district court rejected Dhinsa's arguments, noting that he failed to articulate the prejudice that would result from such an amendment. The following day the government informed the district court that it would request that the Grand Jury amend the indictment. On February 19, 1999, the following day, the government formally amended the indictment to charge kidnapping and conspiracy to kidnap under the federal kidnapping statute, 18 U.S.C. § 1201(a)(1). Dhinsa moved to dismiss counts 23 and 24, as amended, pursuant to Rule 29, which the district court denied.\n\nIt is well settled that \"[u]nder the Fifth Amendment, a criminal defendant has the right to be tried only on the charges contained in the indictment returned by a grand jury.\" Miller, 116 F.3d at 669 (quotation marks omitted); see also Russell v. United States, 369 U.S. 749, 770 (1962) (\"[A]n indictment may not be amended except by resubmission to the grand jury, unless the change is merely a matter of form.\"); Stirone v. United States, 361 U.S. 212, 218 (1960) (\"The very purpose of the requirement that a man be indicted by grand jury is to limit his jeopardy to offenses charged by a group of his fellow citizens acting independently of either prosecuting attorney or judge.\") (footnote omitted); McGrath, 558 F.2d at 1105 n.3 (\"The principal justification for barring amendment by the court or prosecutor is the possibility that the Grand Jury might have voted no bill on the amended facts. When the amendment is made by the Grand Jury, this danger does not exist.\"). \"The essential purpose of an indictment is to give the defendant notice of the charge so that he can defend or plead his case adequately.\" United States v. Neill, 166 F.3d 943, 947 (9th Cir. 1999) (internal quotation marks omitted); cf. United States v. Mollica, 849 F.2d 723, 728-29 (2d Cir. 1988) (discussing three types of variations between a Grand Jury indictment and the evidence presented at trial). In reviewing Dhinsa's challenge, we are mindful that cases involving the possible imposition of the death penalty necessitate \"special care and deliberation in decisions that may lead to the imposition of that sanction.\" Thompson v. Oklahoma, 487 U.S. 815, 856 (1988) (O'Connor, J., concurring in judgment); see also O'Dell v. Netherland, 521 U.S. 151, 171 n.3 (1997) (noting that \"the unique character of the death penalty mandates special scrutiny\" of trial and sentencing procedures in capital cases) (Stevens, J., joined by Souter, Ginsburg, Breyer, JJ., dissenting); Whitmore v. Arkansas, 495 U.S. 149, 167 (1990) (\"It is by now axiomatic . . . that the unique, irrevocable nature of the death penalty necessitates safeguards not required for other punishments.\") (Marshall, J., joined by Brennan, J., dissenting). The decision to grant a motion to amend the indictment is reviewed de novo. See Neill, 166 F.3d at 947.\n\nThe requirement that the Grand Jury amend the indictment is not absolute; the district court or the prosecutor may make \"ministerial change[s]\" to the indictment, such as to correct a misnomer or typographical errors. McGrath, 558 F.2d at 1105 (collecting cases); see also C. Wright, Federal Practice and Procedure: Crim.3d § 127 (1999); cf. United States v. Lorefice, 192 F.3d 647, 653 (7th Cir. 1999) (\"An indictment may be altered without resubmission to the grand jury as long as the alteration makes no material change and there is no prejudice to the defendant.\"), cert. denied, 120 S.Ct. 1246 (2000). Further, absent a showing of prejudice, \"`the erroneous amendment of one count does not destroy other counts of the indictment nor invalidate the judgment of conviction thereon.'\" United States v. Weinstein, 762 F.2d 1522, 1539 (11th Cir. 1985) (quoting C. Wright, Federal Practice and Procedure: Crim.2d § 127 n.16 and accompanying text). Thus, a reviewing court's decision to vacate the convictions for improperly amended counts does not automatically require reversal of the remaining convictions under the other counts in the indictment. See id.\n\nOur decision in McGrath, on which the district court placed significant reliance in permitting the government to amend the indictment, is distinguishable from the instant case. In McGrath, the defendant originally was charged \"with extorting payments in his capacity as an employee of the `Long Island State Parks and Recreation Commission.'\" 558 F.2d at 1104-05. However, prior to 1972, the official name of the defendant's employer was the \"Long Island State Park Commission.\" See id. at 1105. The defendant's duties were not, however, altered by the change in the employer's official name. See id. After the trial commenced, the defendant moved to dismiss the indictment because of the variation in the names of his employer. See id. The trial judge adjourned the trial, during which time the government was permitted to reconvene the Grand Jury and have the indictment amended to reflect the employer's correct official titles during the period of time charged in the indictment. See id. The trial resumed, and the defendant was convicted on, inter alia, a number of the extortion counts charged in the amended indictment. See id. at 1104.\n\nOn appeal, the defendant argued that the Grand Jury was not authorized to correct a misnomer in the indictment. We rejected the defendant's challenge on a number of grounds. First, we held that the change to the indictment was \"ministerial,\" which could \"certainly be made by the Grand Jury, as was done here.\" Id. at 1105. Second, we held that the defendant \"suffered no prejudice from the misnomer\" because the original indictment \"fully informed [the defendant] of the crime charged and the need to prepare a defense.\" Id. The timing of the amendment was also critical in our decision. Specifically, because the amendment was made after both sides made their opening statements but before any witnesses were called, we held that \"none of [the defendant's] rights [were] affected by the change, and the burden of his defense was not increased.\" Id. Finally, we held that the defendant's objection to the form of the indictment was untimely under Fed. R. Crim. P. 12(b)(2). See id. at 1105-06.\n\nWe find the facts of McGrath distinguishable from the present case on a number of grounds and hold, under the narrow circumstances in this case, and the requirement that \"capital proceedings be policed at all stages by an especially vigilant concern for procedural fairness,\" Strickland v. Washington, 466 U.S. 668, 704 (1984) (Brennan, J., concurring in part and dissenting in part), that the amendment to the indictment potentially prejudiced Dhinsa's defense with respect to the kidnapping counts related to Ghuman, and, thus, was improper.\n\nWe emphasize that our holding is limited by the highly unusual circumstances of the case, the first of which is the timing of the amendment. Because the amendment occurred late in the trial, after the government rested its case-in-chief, we cannot, and should not, speculate whether Dhinsa would have chosen a different trial strategy had he been aware that the government intended to charge him under the federal kidnapping statute rather than the VICAR statute. See, e.g., United States v. Wozniak, 126 F.3d 105, 110 (2d Cir. 1997) (vacating drug related convictions where government introduced evidence of drugs other than those alleged in the indictment and trial court instructed the jury that it could convict regardless of the controlled substance involved). By amending the indictment after all of the government's witnesses testified -- and Dhinsa's opportunity to cross-examine them had long passed -- Dhinsa was unable to challenge the testimony of the witnesses as it related to the interstate transportation aspect of Ghuman's kidnapping. Thus, distinct from McGrath where the amendment occurred early in the trial, here, the timing of the amendment potentially increased the burden on Dhinsa's defense with respect to the amended kidnapping charges. See McGrath, 558 F.2d at 1105. Moreover, here, the amendment could not be considered \"ministerial\" since it modified the federal statute under which Dhinsa was charged in connection with Ghuman's kidnapping. See id. (change in official title of defendant's employer was ministerial); see also United States v. Delano, 55 F.3d 720, 729-30 (2d Cir. 1995) (change from \"City of Buffalo Parks Department\" to the \"City of Buffalo\" did not materially alter the indictment). It does not follow, however, that an amendment to the indictment returned by the Grand Jury at various stages of the trial is per se invalid. See, e.g., McGrath, at 1105-06 (amendment by Grand Jury valid after jury was empaneled and both sides made their opening statements). We confine our holding to the specific facts and procedural posture of this case (i.e., capital proceedings).\n\nWe also take note of the context in which the government contends Dhinsa conceded the interstate element of the kidnapping. Specifically, Dhinsa's statement that he did not intend to challenge the accuracy of Ghuman's version of the kidnapping was made in connection with the government's attempt to introduce statements made by Ghuman following the kidnapping to establish his state of mind and, specifically, why Ghuman did not report the kidnapping to the police. Thus, Dhinsa did not dispute the interstate element during trial because he did not have to; the indictment charged that the kidnapping of Ghuman was in aid of the racketeering enterprise and, at that time, transportation in interstate commerce was not an element of the charged offense. Again, we will not speculate as to whether he would have made a similar concession had the government charged him under the federal kidnapping statute at that time.\n\nAlthough there was considerable discussion before the district court on this issue, much of it came at the district court's own prompting. Indeed, the government fervently defended its proof supporting the VICAR kidnapping charges related to Ghuman and sought the amended indictment only after the district court questioned, on numerous occasions, whether the kidnapping was sufficiently related to the alleged racketeering enterprise to support a conviction under section 1959(a), and indicated that the government could properly amend the indictment to charge Dhinsa under the federal kidnapping statute rather than under the VICAR statute. During these discussions, Dhinsa repeatedly objected to such an amendment and moved for a judgment of acquittal on, inter alia, the kidnapping charges related to Ghuman as they were presently charged in the indictment.\n\nFinally, because the amendment occurred after Dhinsa arguably had conceded an element of the federal kidnapping offense -- that he transported Ghuman across state lines -- we reject the government's contention that the amendment was harmless. See 18 U.S.C. § 1201(a)(1); cf. Powell v. Alabama, 287 U.S. 45, 59 (1932) (establishing that \"a defendant, charged with a serious crime, must not be stripped of his right to have sufficient time to advise with counsel and prepare his defense\"). Accordingly, we vacate the judgments of conviction and sentences on counts 23 and 24. Because we conclude that the convictions and sentences on these counts should be vacated based on an improper amendment to the indictment, it is not necessary to reach the merits of Dhinsa's sufficiency of the evidence claim relating to these counts.\n\nOur vacatur of Dhinsa's convictions on counts 23 and 24 gives rise to a second inquiry: whether Dhinsa's substantive RICO and RICO conspiracy convictions may stand notwithstanding that the kidnapping counts involving Ghuman are no longer valid predicate acts supporting the RICO convictions.\n\nThe kidnapping counts involving Ghuman were charged as predicate acts under RICO and found to be such by the jury. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e In addition to the kidnapping offenses, the jury's interrogatories found that four additional predicate acts were proved: two relating to the murders of Manmohan and Satinderjit, one related to the plot to murder Sarvjeet, and one relating to bribery of a public servant and numerous instances of mail fraud. Thus, excluding the kidnapping offenses, Dhinsa \"engaged in the conduct of a racketeering enterprise through a pattern of racketeering that included at least two predicate acts.\" Delano, 55 F.3d at 728; see also Diaz, 176 F.3d at 93 (citing 18 U.S.C. § 1961(5)). The question presently before us is whether the RICO convictions \"[are] amply supported by the jury's finding numerous other `legally sufficient' predicate acts\" sufficient to establish a pattern of racketeering activity. Brennan v. United States, 867 F.2d 111, 115 (2d Cir. 1989).\n\n\"In some circumstances, the jury's findings of two predicate acts, lawfully constituting a RICO pattern, and of the other elements of a RICO offense, will permit affirmance of a RICO conviction notwithstanding the invalidation of other predicate acts.\" United States v. Biaggi, 909 F.2d 662, 693 (2d Cir. 1990); see also United States v. Ruggiero, 726 F.2d 913, 921 (2d Cir. 1984). In the present case, excluding Racketeering Act 9, the jury's finding of four other legally sufficient predicate acts, \"which suffer no defects, are an ample basis for [Dhinsa's] convictions on the RICO counts.\" United States v. Paccione, 949 F.2d 1183, 1198 (2d Cir. 1991) (affirming RICO convictions after invalidating one predicate act where the jury found eight additional predicate acts); see also United States v. Coonan, 938 F.2d 1553, 1565 (2d Cir. 1991) (affirming RICO convictions after invalidating one predicate act where the jury found six additional predicate acts). Further, the kidnapping counts involving Ghuman did not \"dominate[] this prosecution.\" Biaggi, 909 F.2d at 693. The government's case centered around the vast pump-rigging scheme, which generated millions of dollars and supported the various crimes of violence committed by members of the Singh Enterprise, and the murders of Manmohan and Satinderjit. As such, the government's proof regarding Dhinsa's involvement in Ghuman's kidnapping \"could not rationally have been essential to the RICO conviction[s].\" Brennan, 867 F.2d at 115; cf. Delano, 55 F.3d at 728-29 (reversing RICO convictions where the seventeen invalidated predicate acts of larceny by extortion \"represented the bulk of th[e] RICO prosecution, eclipsing all else.\"); Biaggi, 909 F.2d at 693 (vacatur of federal bribery offenses required reversal of RICO convictions, notwithstanding the jury's finding of two other predicate acts of mail fraud). Indeed, Dhinsa concedes that the kidnapping of Ghuman \"had little or nothing to do with the RICO enterprise.\" Under these circumstances, we conclude that Dhinsa's substantive RICO and RICO conspiracy convictions may stand.\n\nV. Sufficiency of the Evidence Claims\n\nA. Position Related Motivation Requirement Under the VICAR Statute\n\nDhinsa was convicted by the jury of six counts under the VICAR statute, 18 U.S.C. § 1959. These included conspiracy to commit murder, see 18 U.S.C. § 1959(a)(5), murder, see id. at § 1959(a)(1), and threatening to commit murder, see id. at § 1959(a)(4). As discussed supra, Dhinsa originally was charged under VICAR in connection with the plot to kidnap Ghuman, see id. at § 1959(a)(1), (5), but those charges were amended by the Grand Jury during the trial to interstate kidnapping offenses under 18 U.S.C. § 1201. On appeal, Dhinsa challenges the sufficiency of the evidence establishing that he committed these crimes for the purpose of \"maintaining or increasing\" his position within the Singh Enterprise. 18 U.S.C. § 1959(a). Specifically, Dhinsa argues that, because he was the undisputed leader of the Singh Enterprise, these violent crimes could not have been performed with the intent of maintaining or increasing his position within the criminal enterprise. Thus, Dhinsa asks this Court to find that violent crimes committed by a defendant in his capacity as the leader of the criminal enterprise do not fall within the scope of conduct section 1959 intended to reach. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e We decline Dhinsa's request.\n\nSection 1959 provides in pertinent part that \"[w]hoever, . . . for the purpose of . . . maintaining or increasing position in an enterprise engaged in racketeering activity, murders, . . . or threatens to commit a crime of violence . . ., or conspires so to do, shall be punished.\" Although section 1959(a) does not define the phrase \"for the purpose of . . . maintaining or increasing position in an enterprise,\" we interpret that phrase by its plain terms, see United States v. Brady, 26 F.3d 282, 289 (2d Cir. 1994), giving the ordinary meaning to its terms. See United States v. Locascio, 6 F.3d 924, 940 (2d Cir. 1993); United States v. Concepcion, 983 F.2d 369, 381 (2d Cir. 1992). Webster's defines \"maintain\" as to \"preserve from failure or decline\" or \"to sustain against opposition or danger,\" WEBSTER'S THIRD NEW INTERNATIONAL DICTIONARY 1362 (1993), and increase as \"to become greater in some respect\" (listing as examples, size, value, power, authority, reputation and wealth). Id. at 1145. Thus, on its face, section 1959 encompasses violent crimes intended to preserve the defendant's position in the enterprise or to enhance his reputation and wealth within that enterprise.\n\nIn defining the scope of conduct satisfying the position-related motivation requirement under section 1959, we do not write on a blank slate. Our journey begins with Concepcion, where we broadly interpreted the motive requirement:\n\nWith respect to the motive element, the legislative history contains no indication that Congress meant to require proof that self-promotion was the defendant's only or primary concern. Rather, the history states that this phrase was included as a means of proscribing murder and other violent crimes committed as an integral aspect of membership in such enterprises. Given this explanation and given that Congress intended RICO, which § 1959 complements, to be liberally construed to effectuate its remedial purposes, we reject any suggestion that the \"for the purpose of\" element requires the government to prove that maintaining or increasing position in the RICO enterprise was the defendant's sole or principal motive. 983 F.2d at 381 (internal quotations marks and citations omitted).\n\nIn Concepcion, and cases following, we consistently have held that the motive requirement is satisfied if \"the jury could properly infer that the defendant committed his violent crime because he knew it was expected of him by reason of his membership in the enterprise or that he committed it in furtherance of that membership.\" Id.; see also United States v. Diaz, 176 F.3d 52, 94-95 (2d Cir. 1999); United States v. Polanco, 145 F.3d 536, 540 (2d Cir. 1998), cert. denied, 525 U.S. 1071 (1999); Thai, 29 F.3d at 817 (holding that the government must prove that \"the defendant's general purpose in committing the crime of violence was to maintain or increase his position in the enterprise.\"); Locascio, 6 F.3d at 940. Accordingly, we have affirmed convictions under section 1959(a) for violent crimes committed or sanctioned by high ranking leaders of the enterprise for the purpose of protecting the enterprise's operations and furthering its objectives or where the defendant, as a leader within the enterprise, was expected to act based on the threat posed to the enterprise and that failure to do so would have undermined his position within that enterprise. See Diaz, 176 F.3d at 95-96 (defendant sanctioned murder because \"it was expected of him as one of the highest ranking . . . leaders [of the organization] to protect the block's drug business\" and that \"failure to do so would have undermined his leadership position within the [organization].\"); United States v. Reyes, 157 F.3d 949, 955 (2d Cir. 1998) (defendant, head of a large drug distribution organization, murdered rival who was encroaching on his drug business); United States v. Rosa, 11 F.3d 315, 340-41 (2d Cir. 1993) (murder committed by \"one of [the organization's] leaders\" following a dispute over a narcotics distribution spot controlled by the defendant); Concepcion, 983 F.2d at 382-83 (defendant, a lieutenant in a narcotics enterprise, initiated gun battle in response to threat to the organization's drug business); see also United States v. Tse, 135 F.3d 200, 206 (1st Cir. 1998) (defendant, leader of a powerful crime organization, ordered murders of rival gang members because they \"threatened the security and supremacy of his leadership and of his enterprise.\"); United States v. Muyet, 994 F.Supp. 550, 556 (S.D.N.Y. 1998) (\"As [defendant] was the leader of the gang, a rational jury easily could conclude that [he] ordered and participated in this killing in order to maintain or increase his position in the [organization].\"). However, we have held that the motive requirement under section 1959(a) is not satisfied where the evidence demonstrated that the killing was \"purely mercenary,\" Thai, 29 F.3d at 818, or that the defendant was neither a member of the enterprise nor involved in its criminal activities. See Polanco, 145 F.3d at 540.\n\nViewing the evidence in the light most favorable to the government, a jury could infer beyond a reasonable doubt that Dhinsa committed the violent crimes charged under section 1959(a) to protect the operations of the Singh Enterprise and to thwart any potential criminal prosecution arising from crimes carried out in furtherance of the enterprise's goals and Dhinsa's membership in that enterprise. The evidence sufficiently demonstrated that Dhinsa conspired to murder and murdered Manmohan and Satinderjit and conspired to murder Sarvjeet because he suspected that they were cooperating with the police and, therefore, posed a potential threat to the enterprise's operations. See, e.g., Diaz, 176 F.3d at 95.\n\nSimilarly, Dhinsa threatened to murder Balwant after he refused to help Dhinsa in locating Sarvjeet. The jury also could have reasonably believed that Dhinsa's actions were motivated by an expectation that, as the leader of the Singh Enterprise, he would take action aimed at protecting the enterprise's operations and that a \"failure to do so would have undermined his leadership position\" within the Singh Enterprise. Id. at 96; see also United States v. Tipton, 90 F.3d 861, 891 (4th Cir. 1996) (\"[R]etaliatory action in behalf of fellow enterprise members was critical to the maintenance of one's position in the enterprise.\"); Thai, 29 F.3d at 817; Concepcion, 983 F.2d at 382-83. These crimes all shared a common objective: to eliminate threats to the Singh Enterprise and, thus, maintain and further Dhinsa's leadership position within that enterprise. Therefore, we find there was sufficient evidence from which the jury could have concluded beyond a reasonable doubt that Dhinsa participated in these violent crimes to maintain or increase his position in the Singh Enterprise and to further its pump-rigging operations.\n\nB. Balwant Murder Threat\n\nDhinsa next challenges his conviction on count 11 for threatening to commit murder in violation of 18 U.S.C. § 1959(a)(4). Specifically, that count alleged that Dhinsa knowingly and intentionally threatened to murder Balwant in violation of N.Y. Penal Law § 135.65, \"Coercion in the first degree.\"\n\nThe threat against Balwant arose out of Dhinsa's efforts to locate Sarvjeet, who he suspected was cooperating with the police. During Satinderjit's funeral service, Parmar, an associate of Dhinsa's, approached Balwant to request his assistance in locating Sarvjeet. Balwant apparently was a friend of Sarvjeet, and Dhinsa solicited his aid in arranging a meeting with Sarvjeet. After Balwant refused to help Dhinsa, Parmar told Balwant that Dhinsa would have him killed. Balwant again refused Dhinsa's request to locate Sarvjeet.\n\nThe gravamen of Dhinsa's challenge is that, because Balwant never gave in to Dhinsa's demand that he help locate Sarvjeet, the government failed to meet its burden of establishing that Balwant was compelled or induced to engage in conduct which he had a legal right to abstain from engaging in. See N.Y. Penal Law § 135.60. We agree. Dhinsa further argues that this Court may not affirm his conviction on count 11 based on the lesser offense of attempted coercion in the first degree because the jury was not asked to consider that offense. In response, the government argues that, assuming the elements of coercion in the first degree are not satisfied, Dhinsa may be properly convicted of an attempt of that offense; to wit, attempted coercion in the first degree, which it contends is sufficient to sustain a conviction under section 1959(a). See Fed. R. Crim. P. 31(c). Thus, the question before us is whether we may affirm Dhinsa's conviction on count 11 based on the lesser offense of attempted coercion in the first degree where there is sufficient evidence to sustain a conviction on the lesser offense, but where the district court failed to charge the jury on that offense. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e We answer that question in the negative and, accordingly, vacate the judgment of conviction and sentence as to count 11.\n\nBoth parties cite the decision of the Third Appellate Department of New York in People v. Wager, 199 A.D.2d 642, 604 N.Y.S.2d 1008 (3d Dep't 1993), appeal denied, 83 N.Y.2d 811, 611 N.Y.S.2d 147, 633 N.E.2d 502 (1994) (table), as support for their respective positions. In Wager, the defendant grabbed the victim and ordered that she get into her car. See id. at 642, 604 N.Y.S.2d at 1009. As the parties began to struggle, a second car pulled into the parking lot near the defendant and the victim, causing the defendant to release the victim. See id. The defendant was charged with, and convicted of, inter alia, coercion in the first degree. See id. In overturning that conviction, the Third Department held that the victim's failure to get into the defendant's car negated a finding that she was compelled to engage in conduct which she had a right to abstain from engaging in as required under the statute. See id. at 642-43, 604 N.Y.S.2d at 1009. The Third Department held, however, that the defendant's conduct met the statutory requirements of attempted coercion in the first degree and, thus, modified the judgment accordingly and remanded the matter for resentencing. See id. at 643, 604 N.Y.S.2d at 1009 (citing N.Y. Crim. Proc. Law § 470.15(2)(a) (\"Upon a determination that the trial evidence adduced in support of a verdict is not legally sufficient to establish the defendant's guilt of an offense of which he was convicted but is legally sufficient to establish his guilt of a lesser included offense, the court may modify the judgment by changing it to one of conviction for the lesser offense.\")).\n\nBecause Dhinsa's challenge involves an interpretation of New York state criminal law, the decision in Wager interpreting N.Y. Penal Law § 135.65 is controlling on our resolution of Dhinsa's challenge to his conviction on count 11. See Schad v. Arizona, 501 U.S. 624, 636 (1991); Brown v. Ohio, 432 U.S. 161, 167 (1977); Pahuta v. Massey-Ferguson, Inc., 170 F.3d 125, 134 (2d Cir. 1999) (\"We are bound, as was the district court, to apply the law as interpreted by New York's intermediate appellate courts . . . unless we find persuasive evidence that the New York Court of Appeals, which has not ruled on this issue, would reach a different conclusion.\"). The government acknowledges that Balwant never yielded to Dhinsa's demand that he arrange a meeting between Dhinsa and Sarvjeet. Accordingly, to the extent Dhinsa's conviction under section 1959(a) for threatening to kill Balwant is based on a violation of N.Y. Penal Law § 135.65, that conviction cannot stand. See Wager, 199 A.D.2d at 642-43, 604 N.Y.S.2d at 1009.\n\nRecognizing the possible infirmity in the jury's conviction for coercion in the first degree, the government argues that, under Wager, there is sufficient evidence to sustain a conviction for attempted coercion in the first degree, which it contends is a crime of violence under New York state law sufficient to sustain a conviction under 18 U.S.C. § 1959(a). The government further argues that, under Fed. R. Crim. P. 31(c) and established Second Circuit precedent, we may find Dhinsa guilty of the lesser offense of attempted coercion in the first degree and, thus, affirm Dhinsa's conviction under section 1959(a) based on that offense. See 18 U.S.C. § 1959(a) (\"Whoever . . . threatens to commit a crime of violence . . . in violation of the laws of any State . . . or attempts or conspires so to do, shall be punished.\"). We find the government's arguments unpersuasive.\n\nUnder Fed. R. Crim. P. 31(c), \"[t]he defendant may be found guilty of an offense necessarily included in the offense charged or of an attempt to commit either the offense charged or an offense necessarily included therein if the attempt is an offense.\" In practice, Rule 31(c) permits the defendant to request a lesser included offense instruction if, based on the evidence at trial, \"a jury could rationally find the defendant guilty of the lesser offense, yet acquit him of the greater.\" Schmuck v. United States, 489 U.S. 705, 716 n.8 (1989) (adopting the \"elements\" approach to determine when a lesser included offense instruction is permitted under Rule 31); see also Sansone v. United States, 380 U.S. 343, 349-50 (1965); cf. United States v. Cobb, 558 F.2d 486, 489 n.5 (8th Cir. 1977) (describing the decision to request a lesser included offense instruction as a \"tactical\" one). Although the rule generally is invoked by the defendant, it may work to either the prosecutor's or the defendant's benefit: \"to aid the prosecution when it has failed to prove all of the elements of the offense charged in the indictment\" or \"provide[] the jury with an alternative which may permit mitigation of punishment for the greater offense.\" United States v. Giampino, 680 F.2d 898, 900 n.1 (2d Cir. 1982) (internal quotation marks omitted). The indictment need not charge the defendant with the lesser offense in order for the trial court to submit that offense to the jury. See United States v. Martel, 792 F.2d 630, 638 (7th Cir. 1986); United States v. LoRusso, 695 F.2d 45, 52 n.3 (2d Cir. 1982)\n\nIf the jury finds the defendant guilty of the greater offense, the trial court may \"enter a judgment of conviction on a lesser-included offense when it finds that an element exclusive to the greater offense is not supported by evidence sufficient to sustain the jury's finding of guilt on the greater offense.\" Government of the Virgin Islands v. Josiah, 641 F.2d 1103, 1108 (3d Cir. 1981); see also LoRusso, 695 F.2d at 52. Similarly, a reviewing court may vacate the conviction and sentence for the greater offense and enter a judgment of conviction on the lesser offense (or, in the alternative, remand the matter to the trial court with instructions to enter a judgment of conviction on the lesser offense) \"[w]hen the evidence is insufficient to support the greater offense, but sufficient to support a conviction on the lesser-included offense.\" Josiah, 641 F.2d at 1108; see also Rutledge v. United States, 517 U.S. 292, 306 (1996); United States v. Dickinson, 706 F.2d 88, 93 (2d Cir. 1983); United States v. Lamartina, 584 F.2d 764, 767 (6th Cir. 1978) (per curiam); United States v. Swiderski, 548 F.2d 445, 452 (2d Cir. 1977). A reviewing court may exercise its authority in this manner when it is convinced that the defendant will not be prejudiced as a result. See Swiderski, 548 F.2d at 452; see also Rutledge, 517 U.S. at 306 (citing Morris v. Mathews, 475 U.S. 237, 246-47 (1986)); Allison v. United States, 409 F.2d 445, 450-51 (D.C. Cir. 1969) (per curiam). We apply these standards to Dhinsa's challenge to his conviction on count 11 for threatening to kill Balwant.\n\nWe begin with the principle that, \"[u]nder Fed. R. Crim. P. 31(c), a defendant may be found guilty of an attempt to commit a substantive offense, whether or not the attempt was charged in the indictment, provided an attempt is punishable.\" United States v. Marin, 513 F.2d 974, 976 (2d Cir. 1975); see also United States v. Remigio, 767 F.2d 730, 733 (10th Cir. 1985) (\"The crime of attempt is a lesser included offense of the substantive crime.\"). In cases where we vacated a conviction on the greater offense and instructed the trial court to enter a judgment of conviction on the lesser offense, we noted that the jury was instructed on the lesser offense and that there existed sufficient evidence to sustain a conviction on the lesser offense. See, e.g., United States v. Boissoneault, 926 F.2d 230, 235 (2d Cir. 1991); Dickinson, 706 F.2d at 92-93 (jury was \"properly charged\" on the lesser predicate offense). In cases where other circuits have similarly directed the entry of a judgment of conviction on a lesser offense, the lesser offense was previously considered by the jury. See, e.g., United States v. Silvers, 90 F.3d 95, 99 (4th Cir. 1996); United States v. Dinkane, 17 F.3d 1192, 1198 (9th Cir. 1994) (requiring, inter alia, that \"the jury [was] explicitly instructed that it could find the defendant guilty of the lesser-included offense and [was] properly instructed on the elements of that offense.\") (quotation marks omitted); United States v. Plenty Arrows, 946 F.2d 62, 66 n.2 (8th Cir. 1991); United States v. Figueroa, 666 F.2d 1375, 1377 (11th Cir. 1982); Josiah, 641 F.2d at 1107; Cobb, 558 F.2d at 488; cf. Morris, 475 U.S. at 241-43 (jury instructed on greater and lesser included offense and conviction reduced to lesser offense); Keeble v. United States, 412 U.S. 205, 212 (1973) (\"[I]f the prosecution has not established beyond a reasonable doubt every element of the offense charged, and if no lesser offense instruction is offered, the jury must, as a theoretical matter, return a verdict of acquittal.\"); LoRusso, 695 F.2d at 52-53 (holding that trial court's decision to charge the jury on a lesser offense \"was well within the court's authority and was properly designed to ensure the just determination of the charges brought against these defendants.\"); United States v. Pino, 608 F.2d 1001, 1003 (4th Cir. 1979) (\"[H]ad the government lacked evidence with which to convict Pino of distribution under 21 U.S.C. § 841(a)(1), while it did not seek to have the district judge do so, it would have been entitled to have the matter submitted to the jury on an attempt theory.\").\n\nHere, however, the district court never instructed the jury on the lesser crime of attempted coercion in the first degree. The government does not dispute that point. Indeed, the government does not directly address Dhinsa's contention that the jury must be instructed on the lesser offense as a prerequisite to any modification in a defendant's conviction and sentence. Thus, consistent with precedent, and the decisions of our sister circuits that have addressed the issue under similar (although not exact) circumstances, we cannot affirm Dhinsa's conviction on count 11 based on the lesser offense of attempted coercion in the first degree because the jury was not instructed on that offense.\n\nThe government's reliance on Wager to support its position that we may affirm Dhinsa's conviction based on the lesser offense of attempted coercion in the first degree is misplaced. In Wager, the Third Department of the Appellate Division reduced the defendant's conviction to attempted coercion in the first degree pursuant to the \"unique factual review power\" available to the New York state appellate courts. People v. Bleakley, 69 N.Y.2d 490, 494, 515 N.Y.S.2d 761, 762, 508 N.E.2d 672, 674 (1987); see also Preiser, Practice Commentaries, N.Y. C.P.L. § 470.15(2)(a), at 529 (describing the scope of intermediate appellate review under section 470.15 as \"broad\" and \"unique\"). Notably, this review power is provided for in the statutory section titled \"Proceedings After Judgment,\" indicating that the intermediate appellate court's authority to modify a judgment of conviction arises after the jury has rendered its verdict and the trial court has entered a judgment of conviction. In contrast, Fed. R. Crim. P. 31(c) applies to the jury instruction and verdict phase of the trial. Specifically, Rule 31(c) is invoked when a trial court must decide \"whether or not a lesser-included offense charge should be given in a particular case.\" Sansone, 380 U.S. at 349; see also Boissoneault, 926 F.2d at 235; LoRusso, 695 F.2d at 52. The fact that Rule 31 is titled \"Verdict\" reinforces the conclusion that it applies to the jury's -- rather than a reviewing court's -- finding of guilt on a lesser-included offense.\n\nThe government's argument that section 1959(a) covers criminal attempts and, therefore, provides a basis for affirming Dhinsa's conviction on count 11 fares no better. To the extent that section 1959(a) encompasses attempted violations of state law, that is only relevant to whether attempted coercion in the first degree -- if proven beyond a reasonable doubt -- constitutes a crime of violence under that section. However, because we find that the district court failed to instruct the jury that it could find Dhinsa guilty of the lesser offense of attempted coercion in the first degree (and properly instruct them on the elements of that offense), we do not reach the issue of whether the evidence presented at trial supported a conviction on that offense.\n\nAccordingly, we vacate the judgment of conviction and the sentence on count 11. Because we vacate Dhinsa's conviction on count 11 based on the district court's failure to instruct the jury on the lesser predicate offense of attempted coercion in the first degree, we express no view on the issue of whether that offense constitutes a \"crime of violence against [an] individual\" under the VICAR statute. 18 U.S.C. § 1959(a).\n\nC. Felon-In-Possession of a Firearm\n\nFinally, Dhinsa challenges the sufficiency of the evidence supporting his conviction for possession of weapons as a convicted felon under 18 U.S.C. § 922(g)(1) stemming from the May 1997 search of the Citygas business offices and warehouse in Brooklyn, New York. During that search, the police seized two guns found inside an armored Citygas van parked inside the warehouse and a shotgun located in another section of the warehouse. On appeal, Dhinsa argues that the government failed to prove that he \"possessed\" these weapons within the meaning of section 922(g). Specifically, Dhinsa argues that the government's proof of constructive possession rests solely on his ownership of the Citygas warehouse where the firearms were seized and his familiarity with other firearms. We reject Dhinsa's arguments, and affirm his conviction for weapons possession.\n\nTo sustain a conviction under section 922(g), the government need not prove that Dhinsa physically possessed the firearm; rather, proof of constructive possession is sufficient. See United States v. Payton, 159 F.3d 49, 56 (2d Cir. 1998); United States v. Rivera, 844 F.2d 916, 925 (2d Cir. 1988).\n\n\"Constructive possession exists when a person has the power and intention to exercise dominion and control over an object.\" Payton, 159 F.3d at 56; see also United States v. Walls, 225 F.3d 858, 864 (7th Cir. 2000); United States v. Moore, 212 F.3d 441, 445 (8th Cir. 2000). In making this determination, courts examine, inter alia, whether the defendant exercised dominion and control \"over the premises in which the firearms are located.\" United States v. Layne, 192 F.3d 556, 571 (6th Cir. 1999), cert. denied, 120 S.Ct. 1443 (2000); see also United States v. Adkins, 196 F.3d 1112, 1118 (10th Cir. 1999), cert. denied, 120 S.Ct. 1446 (2000); United States v. Wight, 968 F.2d 1393, 1398 (1st Cir. 1992) (collecting cases). It is of no moment that other individuals also may have exercised control over the weapons. See Payton, 159 F.3d at 56; United States v. Kitchen, 57 F.3d 516, 521 (7th Cir. 1995) (\"Constructive possession may be either sole or joint.\"). The government may establish constructive possession through direct or circumstantial evidence. See Payton, 159 F.3d at 56. The substance of the district court's instructions reflected these standards.\n\nViewing the totality of the evidence presented to the jury in the light most favorable to the government, we conclude that there was sufficient evidence for a reasonable juror to conclude beyond a reasonable doubt that Dhinsa constructively possessed the firearms seized from the Citygas warehouse in Brooklyn, New York. First, Dodson testified that he sold Dhinsa a gun, and arranged for Dhinsa to purchase additional weapons from one of his friends. Second, Dhinsa regularly supplied Dodson and others with guns that were used in connection with the enterprise's criminal activities. Specifically, Dodson testified that Dhinsa instructed him to \"pick up th[e] gun from [the] Guy Brewer [station]\" that would later be used in Manmohan's murder. Following the murder, Dodson complied with Dhinsa's request that he return the gun to him. Dodson also testified that Dhinsa selected the gun to be used in connection with Satinderjit's murder, and, in similar fashion, the gun was returned to Dhinsa upon his request following the murder. Third, Dhinsa does not dispute that he exercised control or dominion over the Citygas offices and warehouse in Brooklyn, New York where the firearms were found. See, e.g., Layne, 192 F.3d at 572; United States v. De Leon, 170 F.3d 494, 497 (5th Cir.), cert. denied, 120 S.Ct. 156 (1999); United States v. Craven, 478 F.2d 1329, 1333 (6th Cir. 1973). This factor, coupled with Dodson's testimony that Dhinsa directed him to a specific Citygas station where he could pick up the gun to be used in the murders of Manmohan and Satinderjit, could reasonably lead the jury to infer that Dhinsa exercised similar control over firearms located at other Citygas facilities. Dhinsa's position as the sole leader of the Singh Enterprise reinforces this point. See, e.g., Wight, 968 F.2d at 1398. The fact that other individuals had access to the warehouse and van does not negate a finding that Dhinsa had the \"power and the intention at a given time to exercise dominion and control over [these firearms], either directly or through others.\" United States v. Pelusio, 725 F.2d 161, 167 (2d Cir. 1983) (internal quotation marks omitted); see also Kitchen, 57 F.3d at 521. Fourth, the armored Citygas van in which the guns were found was regularly used to collect receipts from the various Citygas stations. From this fact, the jury could reasonably infer that Dhinsa was aware that the occupants of the van, who typically wore bulletproof vests, were armed during their pickups.\n\nThis conclusion is bolstered by the armored van's being parked outside Dhinsa's office daily. Moreover, in light of Dhinsa's specific instructions to Dodson regarding the firearms he used to murder Manmohan and Satinderjit, the jury could infer that Dhinsa similarly instructed the individuals in the van as to which weapons they should carry during their pickups. Thus, viewing the evidence in the aggregate, the jury could reasonably find constructive possession beyond a reasonable doubt. Accordingly, we affirm Dhinsa's conviction under 18 U.S.C. § 922(g)(1).\n\nCONCLUSION\n\nWe have conducted a thorough review of Dhinsa's remaining arguments on appeal and find no basis for reversal in any of them. For the foregoing reasons, we affirm the district court's judgment of conviction and sentence on all counts, except counts 11, 23 and 24. We vacate the judgment of conviction and sentence on count 11 (threat to murder Balwant) and counts 23 and 24 (interstate kidnapping of Ghuman), and remand these counts to the district court for a new trial should the government decide to reprosecute. We express no view about any potential defenses that might be raised as a bar to reprosecution.\n\nCALABRESI, Circuit Judge, concurring:\n\nI join in the Opinion of the Court in all particulars except as to Part IV(B) of the Discussion section (concerning Dhinsa's challenge to his conviction on count 11 for threatening to murder Balwant in violation of N.Y. Penal Law § 135.65 (Coercion in the First Degree)). With respect to this part of the opinion, I concur in the result only.\n\nThe VICAR statute can indeed be read as the majority reads it. It could also be read, however, to make it a federal crime to \"attempt[] or conspire[],\" in the relevant situation, to \"murder[], kidnap[], maim[], assault[] with a dangerous weapon, commit[] assault resulting in serious bodily injury, or threaten[] to commit a crime of violence against any individual in violation of the laws of any State or the United States.\" 18 U.S.C. § 1959(a). The government has not argued in favor of this reading, and, more important, the jury was not charged with respect to it. Under the circumstances, and without expressing any opinion on the merits of one interpretation over the other, I agree with the majority that the conviction on count 11 cannot stand.\n\n\u003cspan class=\"fn\"\u003e1. The majority of the people involved in this case share the same religious affiliation, which requires the men to adopt the last name \"Singh.\" To avoid confusion, we will refer to defendant-appellant as Dhinsa and other persons by their first name.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. In connection with these counts, the jury found that the government proved the following racketeering acts: (1) conspiracy to murder and murder of Satinderjit Singh (Racketeering Act 1); (2) conspiracy to murder and murder of Manmohan Singh (Racketeering Act 2); (3) conspiracy to murder Sarvjeet Singh (Racketeering Act 5); (4) bribery to influence a public servant and to reward official misconduct and numerous instances of mail fraud (Racketeering Act 8); and (5) conspiracy to kidnap and kidnapping of Muchtir Ghuman (Racketeering Act 9).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Dhinsa was acquitted on the kidnapping charges related to Kulwant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Dhinsa was convicted of threatening to murder Balwant (count 11), but acquitted of two counts charging that he conspired to murder Balwant (counts 12 and 13).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. At trial, the district court also admitted out-of-court statements of Kulwant, whom Dhinsa was charged with kidnapping and conspiring to kidnap. Because the jury acquitted Dhinsa of those charges, Kulwant's statements are not relevant to this appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Interestingly, although Dhinsa urges this Court to find the Mastrangelo evidence inadmissible under Lilly, he acknowledges that the testimony was \"undeniably powerful proof that [he] was responsible for Manmohan's death.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. As Dhinsa was acquitted of the kidnapping charges relating to Kulwant, we do not consider whether admission of Kulwant's hearsay statements was harmless.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. As discussed supra, we previously reversed the district court's order suppressing the fruits of the July 1, 1997 search of Dhinsa's Lexus. See Dhinsa, 171 F.3d at 726. Accordingly, the events relating to that search are not relevant to the instant appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Because we vacate Dhinsa's conviction for threatening to murder Balwant on other grounds, see supra IV-B, we need not consider whether the admission of items obtained during a search of Dhinsa's car relating to that offense was harmless.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In light of this conclusion, we need not decide whether Dhinsa waived his right on appeal to challenge the lawfulness of the seizure of his car.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The indictment charged four separate predicate acts under Racketeering Act 9 for the substantive RICO and RICO conspiracy counts. Two of the predicate acts related to the alleged extortion of Ghuman (which the jury found \"not proved\") and two related to the kidnapping of Ghuman (which the jury found \"proved\"). The combined effect of the jury's verdict and our vacatur of the kidnapping convictions involving Ghuman renders Racketeering Act 9 an invalid predicate for purposes of the RICO counts.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. In denying Dhinsa's Rule 29 motion raising similar challenges, the district court held that the language in section 1959 is \"certainly broad enough to cover killing somebody to prevent [him] from exposing [the defendant] and [his] organization [to] criminal prosecution.\" The district court further held that, \"there's a direct relationship here between maintaining [Dhinsa's] position and the crime.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. In his reply papers, Dhinsa apparently concedes that there was sufficient evidence to support a conviction on the lesser offense.\u003c/span\u003e\n\n",
    "body_length": 143631,
    "citedas": [
      "243 F.3d 635"
    ],
    "attorneys": "Alan M. Dershowitz, Cambridge, MA (VictoriaB. Eiger, Nathan Z. Dershowitz, Dershowitz,Eiger \u0026 Adelson, New York City, ofcounsel),for Appellant.Benton J. Campbell, Ronald White, AssistantUnited States Attorneys, Eastern Districtof New York, Brooklyn, NY (Loretta E.Lynch, United States Attorney, Peter A.Norling, David C. James, Assistant UnitedStates Attorneys, Eastern District of NewYork, Brooklyn, Ny, of counsel),for Appellee.",
    "category": [
      "243",
      "36",
      "253",
      "75"
    ],
    "judges": "Before: Meskill, Calabresi and Katzmann, Circuit Judges.",
    "citation_count": 233
  }
}
