{
  "id": "_oI_PmYBTlTomsSBUnn7",
  "document": {
    "title": "Gilliam v. Foster",
    "full_title": "DARRELL WAYLAND GILLIAM, JR.; PAMELA OWINGS; JAMES MATTHEW SWAIN -APPELLEES, v. JAMES LEE FOSTER, SHERIFF OF NEWBERRY COUNTY; CHARLES M. CONDON, ATTORNEY GENERAL FOR THE STATE OF SOUTH CAROLINA; JAMES W. JOHNSON, JR., CIRCUIT COURT JUDGE OF SOUTH CAROLINA -APPELLANTS.",
    "jurisdiction": "Fourth Circuit",
    "date": "1996-01-29T00:00:00.000Z",
    "docket": "No. 95-2434",
    "body": "WILKINS, Circuit Judge:\n\nPetitioners Darrell Wayland Gilliam, Jr., Pamela Owings, and James Matthew Swain brought this action pursuant to 28 U.S.C.A. ยง 2254 (West 1994). They maintain that because a state trial Judge granted a mistrial over their objection and in the absence of manifest necessity during their first trial, subjecting them to a second criminal prosecution would violate their rights under the Double Jeopardy Clause of the United States Constitution.\n\nThe principal issue presented is whether the state trial Judge exercised sound discretion in granting the prosecution's motion for a mistrial because the jury viewed certain photographs prior to their formal admission into evidence. These photographs had been authenticated properly, were relevant, were material, and were otherwise unobjectionable. Further, the witness who had authenticated the photographs was available to retake the witness stand to permit their formal introduction.\n\nThe district court granted the writ of habeas corpus.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e The State\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e appeals, claiming that the second prosecution would not violate Petitioners' double jeopardy rights, and that in any event the district court should have abstained from granting habeas corpus relief under Younger v. Harris, 401 U.S. 37, 27 L. Ed. 2d 669, 91 S. Ct. 746 (1971). For the reasons set forth more fully below, the judgment of the district court is affirmed.\n\nI. FACTS\n\nAlthough the facts underlying this appeal have been fully set forth in the decision of the district court, we include them here in some detail in order to facilitate a better understanding of our decision.\n\nA. Background\n\nThe incidents giving rise to the criminal charges against Petitioners began on the afternoon of January 5, 1993, when Hope Icard physically attacked Christie Gilliam, Petitioner Gilliam's sister. A short time later that afternoon, this altercation led to a confrontation between family members of the two women at the residence of Icard's sister and brother-in-law, the Silvers. Petitioners arrived outside the Silvers' mobile home in Petitioner Gilliam's truck. Although the subsequent events are subject to some dispute, it is uncontested that gunshots were ultimately exchanged. From inside the mobile home, Ernest Silvers and his stepson discharged firearms. Petitioner Gilliam, who was outside the mobile home, was injured by this gunfire in the lower leg. Petitioner Swain was charged with murdering Ernest Silvers by shooting him in the chest with a rifle as Silvers stood in the front doorway of the mobile home. Petitioners Gilliam and Owings, who were unarmed, were charged with aiding and abetting Swain. In addition, Petitioners were charged with lynching in connection with Silvers' death;\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Petitioner Swain was charged with assault with the intent to kill; and Petitioner Gilliam was charged with indecent exposure. This latter charge against Gilliam alleged that he had exposed himself to the occupants of the Silvers' mobile home while taunting them prior to the exchange of gunfire.\n\nB. Initial State Trial Proceedings\n\nPetitioners' trial began in state court in late 1994. On the third day of trial, the prosecution presented the testimony of Officer Counts, a former special agent with the South Carolina Law Enforcement Division (SLED). Officer Counts had been present at the scene soon after the altercation and could testify about the investigation and identify photographs of the scene.\n\nOn cross-examination, defense counsel asked Officer Counts whether he had found blood outside the Silvers' mobile home. Officer Counts stated that he would like to look at the photographs of the scene to refresh his memory. The photographs to which Officer Counts referred were ones that had been taken either by Officer Counts or in his presence by another SLED agent; copies of these photographs had been provided to the defense prior to trial. Defense counsel showed a group of seven photographs (Set 1) to one of the prosecuting attorneys and then handed them to Officer Counts. The prosecuting attorney--believing that the photographs were being offered into evidence--said, \"Without objection.\" The trial Judge then inquired whether defense counsel was offering the photographs into evidence at that time, and defense counsel responded that he was using them only to refresh the officer's recollection. The prosecuting attorney noted that he had spoken prematurely.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nAfter Officer Counts reviewed the photographs in Set 1, and defense counsel established that Officer Counts was familiar with the photographs because he was there when they were taken or actually had taken them, defense counsel inquired:\n\nQ. Looking at those photographs were you able to refresh your recollection as to whether or not any blood was found on the scene?\n\nA. Yes, sir. There was a red substance. I am not a serologist, but there was a red substance that appeared to be blood found at the scene.\n\nQ. And when blood is found on the scene, how[is it] typically marked in terms of when you find blood outside a trailer and it indicates blood, is it marked as part of your investigation? Do you mark the ground in some way to indicate that you found something?\n\nA. Yes, sir. We would circle the area, surround it with crime scene tape, we would [put] a cone out or anything to keep somebody from walking and disturbing that.\n\nQ. Based on those photographs that you had used to refresh your recollection, do you see such a photograph that would indicate that sighting of blood that was marked?\n\nA. Yes, sir. I could.\n\nQ. And if you could, hand us that. If you could, flip through and find the photograph or photographs that would indicate that.\n\nA. Basically all of these [are] the same area where the blood was found. Just overall views of it.\n\nQ. I hand you what has been marked as Defendant's exhibits 16, 8, 13, 12 and 14 [Photo Set 2]. Would it be your testimony that those [photographs] mark the finding of blood but just from different angles?\n\nA. Yes, sir. I can't tell you that that substance is in fact blood. I am not a serologist, but I can tell you that these were photographs that myself or Agent Gainey of SLED took, and the substance resembles blood, and these five photographs depict the same area adjacent to the trailer where we found [the] substance that resembled blood.\n\nJ.A. 61-62 (emphasis added). At this point in the examination, defense counsel asked Officer Counts to approach a diagram of the scene prepared by the prosecution and, using the photographs, to mark on an overlay the location where what appeared to be blood was found. Officer Counts then marked the three places where red spots were observed, testifying, \"This is basically where the blood was found, in this vicinity here to the left of the trailer, almost to the road way.\" J.A. 63. In response to defense counsel's follow-up questions concerning the distance from the area where blood was found to the mobile home and the roadway, Officer Counts referred to the notes made by the serologist on the scene and testified that \"there were three areas of blood in this location,\" that the distance between \"these portions of blood here\" was seven feet, and that the corner of the mobile home was 70 feet from the road with the blood depicted in the photographs being \"right off the roadway in this area.\" J.A. 64.\n\nDuring the remaining cross-examination of Officer Counts, two of the three groups of SLED photographs of the scene (Sets 2 and 3) were introduced into evidence by the defense without objection. The photographs referred to as Set 2 included Exhibits 8, 12, 13, 14, and 16. The photographs referred to as Set 1--Exhibits 9, 10, 11, 15, 17, 18, and 19--were not offered into evidence.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nA description of these photographs and a comparison of the photographs included in Set 1 vis-a-vis those in Set 2 is instructive. The photographs in Set 2, with the exception of Exhibit 16, are identical in every material aspect and show the area outside the Silvers' mobile home. Each of these photographs was taken from near Highway 32, the public roadway in front of the Silvers' mobile home, from the left-hand side of the mobile home and looking down the driveway toward it. The mobile home and the adjacent yard and driveway are shown in the background of these photographs, and all of them show the same three pieces of yellow tape in the foreground--the closest two pieces are circular in shape, one to the left and one to the right, and one strand of yellow tape is behind the two circular pieces and a few feet closer to the mobile home. The remaining photograph in Set 2, Exhibit 16, shows the same location, but reveals only the circular piece of tape to the right and one-half of the circular piece to the left. As noted above, these five photographs were admitted into evidence without objection from the prosecution and with no specific testimony by Officer Counts concerning the location depicted or the relevance of the scene they depicted.\n\nOf the seven photographs in Set 1, four of them, Exhibits 10, 17, 18, and 19, are close-ups of the three pieces of yellow tape: Exhibit 10 shows a close-up of the circular piece of tape on the left of the photographs in Set 2; Exhibit 17 is a close-up of the two circular pieces of tape shown in the photographs in Set 2; Exhibit 18 is a close-up of the strand of tape behind the two circles of yellow tape in the photographs in Set 2; and Exhibit 19 is a photograph of the circle of tape on the right in the photographs in Set 2. These photographs show red spots within or near the areas marked with the yellow tape more clearly than the photographs in Set 2. Exhibit 15 is virtually identical to those in Set 2, taken from the same camera angle and depicting all three pieces of yellow tape. The two remaining photographs in Set 1, Exhibits 9 and 11, reveal the same three pieces of tape, but were taken from approximately the opposite location from those in Set 2; in other words, they are taken from near the mobile home facing up the driveway and toward Highway 32. These latter two photographs depict more clearly the same tire tracks shown in the photographs in Set 2.\n\nFollowing Officer Counts' testimony, the state trial Judge recessed for lunch with instructions that all of the photographs and other evidence that had been published remain in the courtroom. During the lunch break, the court reporter discovered that the photographs in Set 1--which had not been admitted into evidence--had been placed on the jury rail in a stack along with the photographs in Sets 2 and 3--which had been properly introduced into evidence. Concerned that the jury may have viewed evidence that had not been properly admitted, the trial Judge conducted a bench conference during which he brought this to the attention of counsel and then provided the parties with an opportunity to evaluate the situation.\n\nWhen the trial proceedings resumed, the prosecution moved for a mistrial, blaming defense counsel for the error and stressing that the defense had \"placed something that is easily accessible, has been accessible by the jury, which is not in evidence . .. and that is improper.\" J.A. 87. The defense strenuously objected. It disagreed with the prosecuting attorney's suggestion that defense counsel had been responsible for placing the unadmitted photographs in Set 1 where the jury could view them. Defense counsel argued that a mistrial was completely unnecessary and offered to \"recall [Officer Counts] and move [the photographs] into evidence,\" explaining that Officer Counts had already identified the photographs and had testified about them. J.A. 88-89. Further, defense counsel emphasized that even if the jury actually saw the photographs, there was no prejudice to the prosecution because all of the Set 1 photographs depicted the same scene as other photographs that had already been admitted into evidence.\n\nThe state trial Judge called the foreman of the jury into the courtroom and asked him whether the jury had looked at all of the photographs that had been in the stack on the jury rail before lunch. Although the foreman was not given an opportunity to examine each photograph individually, he responded that as far as he knew all the photographs had been viewed by the jury. The defense requested that the trial Judge ask additional questions to ascertain whether the jury had in fact seen the unadmitted photographs, noting that it was entirely possible that the photographs had been placed in the stack on the railing during the lunch break since defense counsel recalled that the photographs had been left in the witness box when the court recessed. The state trial Judge, however, refused to do so and declared a mistrial over defense counsel's objection. The state trial Judge stated that he had no choice but to grant a mistrial because the photographs had not been admitted, were not identified, had not been testified to, and had been circulated to the jury. He further indicated that he had no way of knowing whether the photographs would later be offered and admitted into evidence.\n\nDefense counsel requested that the state trial Judge ask the court reporter to read back Officer Counts' testimony because he, in fact, had identified the photographs and testified using them. Again, however, the state trial Judge summarily declined to do so, noting that if he was incorrect the record would bear that out. At no point did the state trial Judge indicate that double jeopardy concerns were implicated by the grant of a mistrial. And, neither the prosecution nor the state trial Judge indicated that the photographs were in any way prejudicial to the prosecution or the defense.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nC. Post-trial State Proceedings\n\nIn March 1995, prior to the second trial, Petitioners filed a motion before the state trial Judge requesting dismissal of the charges against them on double jeopardy grounds, arguing that manifest necessity had not existed to justify the grant of the mistrial over their objections. The state trial Judge denied the request. Although the state trial Judge did not make a finding that the jury's having seen the photographs was prejudicial and did not offer any possible explanation of how the jury's viewing the unobjectionable photographs actually might have improperly biased or influenced the jury for or against either the prosecution or the defense, the state trial Judge did refer to the incident at one point as a \"prejudicial occurrence,\" J.A. 38, and opine that he was \"concerned about the origin of the prejudice,\" J.A. 39. He explained only that the mistrial had been necessary because he could not have foreseen whether the photographs would have been offered into evidence and, if so, whether they would have been admitted. The state trial Judge did not address the fact that the prosecuting attorney had offered no objection to the admission of the photographs when he believed that they were being offered into evidence or that the defense had offered to recall Officer Counts and formally move their introduction.\n\nPetitioners appealed this ruling to the South Carolina Supreme Court. That court, however, dismissed the appeal as interlocutory under South Carolina law.\n\nD. Federal Habeas Proceedings--District Court\n\nPetitioners then filed this action in district court pursuant to 28 U.S.C.A. ยง 2254 (West 1994),\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e claiming that the upcoming second trial violated their right not to be twice put in jeopardy for the same offense because no manifest necessity existed to support the grant of the mistrial in the first trial. The State responded that the mistrial was necessary to \"alleviate prejudice\" caused by the jury's consideration of unadmitted evidence; however, the State did not identify or in any way suggest what possible prejudice may have resulted. On June 29, 1995, Petitioners sought either a temporary injunction of the scheduled state criminal trial or expedited consideration of their habeas petition.\n\nOn July 7, 1995, a United States Magistrate Judge issued a report and recommendation concluding that a temporary stay of the scheduled state court proceedings was appropriate because: Petitioners would suffer irreparable harm if the temporary relief was not granted; the balance of harms tipped decidedly in favor of Petitioners; Petitioners had demonstrated serious and substantial questions that were fair ground for litigation on the merits of their double jeopardy claim; and the public interest favored the grant of temporary injunctive relief.\n\nOn July 10, 1995, the district court conducted an expedited, nonevidentiary hearing of the motion for a temporary restraining order and adopted the majority of these recommended findings of the magistrate Judge. The district court, however, determined that Petitioners had shown no likelihood of succeeding on their double jeopardy claim and therefore were not entitled to injunctive relief. The court reasoned that because questions of provocation and self-defense were being raised, the location of the parties when the gunshots were fired--i.e., whether on a public roadway or the Silvers' property--was relevant and that several of the photographs in Set 1, being close-ups of the ground showing what appeared to be blood, could be used to more clearly document their locations. This Conclusion was based only on purely speculative statements of the State's attorney, not on any evidence in the record. Significantly, although the district court concluded that the photographs could be used to demonstrate more clearly where the shooting had occurred, it did not find that the photographs were unduly prejudicial, as opposed to simply relevant.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nE. Federal Habeas Proceedings--Circuit Court--Stay Request\n\nAfter the district court denied their request for a temporary stay of the scheduled state criminal proceedings or expedited consideration of their habeas petition, Petitioners submitted to a panel of this court a request for emergency relief from the order of the district court. See Fed. R. App. P. 8. The panel heard oral arguments on Saturday, July 15, 1995. Questions during argument demonstrated that the panel was particularly concerned with whether the State had identified any prejudice to the prosecution or Petitioners resulting from the jury's having viewed the photographs in Set 1 without their formal admission into evidence. As the following colloquy reveals, the State's attorney conceded that the photographs in Set 1 were relevant, were not unduly prejudicial, and were, in fact, admissible:\n\nTHE COURT: All right. Is there any question in your mind, Mr. Zelenka, as an experienced attorney that, had the Defense said, \"Your Honor, we move [the Set 1 photographs] into evidence,\" and the State had said, \"No objection,\" that they would have been marked as an exhibit?\n\nSTATE'S ATTORNEY: At the time of that trial I do not see any reason why they would not have been introduced as an exhibit. That's right.\n\nTHE COURT: Today -- today, Mr. Zelenka, can you give this Court any reason why these photographs shown as[Set 1] are not relevant evidence and properly admissible either by the State or by the Defense?\n\nSTATE'S ATTORNEY: This evidence could have been admitted at the time of that particular trial.\n\nTHE COURT: That's not my question. . . . Is there any reason why these photographs in [Set 1] are not relevant evidence and properly admissible either offered by the State or by the Defense?\n\nSTATE'S ATTORNEY: No, sir.\n\nTHE COURT: All right, sir. . . . So, this is relevant evidence. There's no reason it should not have been before the jury, other than the fact [that] the Defendant didn't say, \"We move into evidence\"?\n\nSTATE'S ATTORNEY: That's correct.\n\nTHE COURT: Was there any reason other than the technical reason [that the defense failed to move the photographs into evidence], that these photographs should not have properly been shown to the jury, as [Set 2 and Set 3] were during the course of the trial?\n\nSTATE'S ATTORNEY: In my analysis of these photographs, these are not the type of photographs that the state court system would have excluded from evidence based upon a prejudicial factor.\n\nTHE COURT: So you offer no reason why it would have been improper for these photographs to have been admitted into evidence and shown to the jury?\n\nSTATE'S ATTORNEY: No reason at all once Mr. Counts authenticates the documentation.\n\nTranscript of July 15, 1995 Arguments at 28-31 (emphasis added). The State also conceded that there was no rule of law or procedure that prevented Officer Counts from being recalled to the stand so that the defense could move the admission of the photographs. In further questioning from the panel, the State opined that the photographs in Set 1 showed more clearly what appeared to be blood in or near the areas marked with yellow tape. Following a conference at the Conclusion of the hearing, the panel, by a vote of two to one, denied the requested relief.\n\nOn Monday, July 17, 1995, Petitioners sought en banc review of the order denying temporary relief. And, on July 20, 1995, a majority of the active circuit Judges voted in favor of granting temporary relief from the order of the district court. We remanded to the district court with instructions to rule on the merits of the habeas petition as expeditiously as possible. Gilliam v. Foster, 61 F.3d 1070 (4th Cir. 1995) (en banc).\n\nF. State Criminal Proceedings--Second Trial\n\nWhile the poll of the en banc court was proceeding, Petitioners' retrial began in state court on July 17. Prior to the second trial, the state Judge who presided over the first trial and who is a named respondent in this litigation, sua sponte recused himself before the retrial began. During the course of the retrial, the photographs in Set 1 were offered into evidence by the defense. The prosecuting attorney objected to their admission on the ground that the photographs were cumulative and confusing.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e The presiding state trial Judge overruled the objection and admitted the photographs into evidence. On Thursday, July 20, upon learning that this court had stayed the state criminal proceedings, the state trial Judge suspended the trial pending further notice.\n\nG. Federal Habeas--District Court on Remand\n\nOn July 21, immediately following our remand, the district court conducted a lengthy and thorough evidentiary hearing. Subsequently, it entered comprehensive findings of fact based upon the evidence and testimony presented and held that the retrial of Petitioners was, indeed, barred by the Double Jeopardy Clause.\n\nThe district court rejected the State's claim that manifest necessity for the mistrial existed because the jury's viewing the Set 1 photographs was unduly prejudicial, finding as a factual matter that the photographs in Set 1 had been \"authenticated by Officer Counts, were used by him to refresh his recollection as to whether there were blood stains on the ground, and were actually relied upon by him in fashioning a demonstrative exhibit showing the location of what appeared to him to be blood stains, tire tracks, and other evidentiary items.\" The court also found that because Officer Counts had already testified concerning the relative locations of the objects depicted in the Set 1 photographs, the disputed photographs were of \"no real significance to either party\" viewed in the context of the trial.\n\nFurther, the district court rejected the State's argument that the photographs would likely cause juror confusion because the location of the areas marked with yellow tape depicted in the photographs had not been explained sufficiently by Officer Counts and because the \"red spots\" that were more visible in the Set 1 photographs might lead the jury to conclude that the photographs showed Gilliam's blood. The court determined as a factual matter that during his testimony Officer Counts adequately identified the location of the three areas marked with yellow tape. In addition, the court concluded that the photographs did not present an undue risk of juror confusion concerning whether the \"red spots\" were blood because Officer Counts, the State's witness, and the investigating officer, had already testified that these areas were marked with yellow tape based on the investigators having discovered what appeared to be blood there, and the fact that a serologist had not tested the red spots would not have provided a basis for exclusion of the photographs,\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e nor was it necessary to lay a proper foundation for introduction of the photographs.\n\nAdditionally, the district court held that even assuming the photographs in Set 1 were somehow prejudicial, manifest necessity did not support the grant of the mistrial by the state trial Judge because obvious and adequate alternatives to the mistrial were available. For example, allowing Officer Counts to be recalled to the witness stand would have resolved any possible problem.\n\nFinally, the district court concluded that the state trial Judge acted improvidently and precipitately in granting the mistrial. The district court based this Conclusion on the facts that the state trial Judge had failed to evince any concern for the possible double jeopardy ramifications of his actions, had failed to permit the parties an opportunity to fully explain their positions, and had declined to permit further inquiry into whether the photographs had been authenticated during Officer Counts' testimony.\n\nAccordingly, the district court granted the writ of habeas corpus. By separate order, however, it declined to enlarge the Petitioners pending appeal.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nFrom the order of the district court granting the writ of habeas corpus, the State appeals.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e A majority of the members of the en banc court voted to grant en banc hearing of the State's appeal on an expedited basis.\n\nII. DOUBLE JEOPARDY\n\nThe Double Jeopardy Clause of the Fifth Amendment, made applicable to the states through the Fourteenth Amendment, provides that no one shall \"be subject for the same offence to be twice put in jeopardy of life or limb.\" U.S. Const. amend. V; Benton v. Maryland, 395 U.S. 784, 794, 23 L. Ed. 2d 707, 89 S. Ct. 2056 (1969). Among the protections provided by this Clause is the assurance that a criminal defendant will not be subjected to \"repeated prosecutions for the same offense.\" Oregon v. Kennedy, 456 U.S. 667, 671, 72 L. Ed. 2d 416, 102 S. Ct. 2083 (1982). This protection encompasses a right to have a particular tribunal decide guilt or innocence once jeopardy has attached.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Id. at 672-73.\n\nThe reasons why this \"valued right\" merits constitutional protection are worthy of repetition. Even if the first trial is not completed, a second prosecution may be grossly unfair. It increases the financial and emotional burden on the accused, prolongs the period in which he is stigmatized by an unresolved accusation of wrongdoing, and may even enhance the risk that an innocent defendant may be convicted. The danger of such unfairness to the defendant exists whenever a trial is aborted before it is completed.\n\nArizona v. Washington, 434 U.S. 497, 503-04, 54 L. Ed. 2d 717, 98 S. Ct. 824 (1978) (footnotes omitted). For these reasons, a prosecutor generally is permitted only one opportunity to compel a defendant to stand trial. Id. at 505.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Nevertheless, if a criminal proceeding is terminated by mistrial without a final resolution of guilt or innocence, a defendant may be retried in certain circumstances.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Id. When a defendant seeks or consents to the grant of a mistrial, there is no bar to his later retrial.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Kennedy, 456 U.S. at 672-73. But, when a defendant opposes the grant of a mistrial, he may not be retried unless there was a manifest necessity for the grant of the mistrial or the failure to grant the mistrial would have defeated the ends of Justice. United States v. Dinitz, 424 U.S. 600, 606-07, 47 L. Ed. 2d 267, 96 S. Ct. 1075 (1976); Wade v. Hunter, 336 U.S. 684, 690, 93 L. Ed. 974, 69 S. Ct. 834 (1949). This proposition of law was first recognized in United States v. Perez, 22 U.S. (9 Wheat.) 579, 580, 6 L. Ed. 165 (1824), where Mr. Justice Story wrote:\n\nWe think, that in all cases of this nature, the law has invested Courts of Justice with the authority to discharge a jury from giving any verdict, whenever, in their opinion, taking all the circumstances into consideration, there is a manifest necessity for the act, or the ends of public Justice would otherwise be defeated. They are to exercise a sound discretion on the subject; and it is impossible to define all the circumstances, which would render it proper to interfere. To be sure, the power ought to be used with the greatest caution, under urgent circumstances, and for very plain and obvious causes; and, in capital cases especially, Courts should be extremely careful how they interfere with any of the chances of life, in favour of the prisoner. But, after all, they have the right to order the discharge; and the security which the public have for the faithful, sound, and conscientious exercise of this discretion, rests, in this, as in other cases, upon the responsibility of the Judges, under their oaths of office.\n\nBased on this explication in Perez, the Supreme Court has consistently stressed the great deference to be accorded to the decision of the trial Judge to grant a mistrial. See, e.g. , Illinois v. Somerville, 410 U.S. 458, 461-66, 35 L. Ed. 2d 425, 93 S. Ct. 1066 (1973). A reviewing court must \"accord the highest degree of respect to the trial Judge's evaluation of the likelihood\" that the circumstances giving rise to the mistrial would have affected the impartiality of the deliberations of the jury. Arizona v. Washington, 434 U.S. at 511. Indeed, when some event creates the possibility that the jury may have been biased, the decision of the trial Judge who has had the opportunity to observe the sequence of events in the context of the trial is entitled to special respect.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Id. at 512-14. The trial Judge need not make an explicit finding of manifest necessity or articulate the factors that led to the exercise of his discretion, and his decision is not subject to attack on this basis when the record adequately discloses the basis for his ruling. Id. at 516-17.\n\nThe deference owed to the decision of the trial Judge to grant a mistrial, although great, is not unlimited. Id. at 514 (\"Our Conclusion that a trial Judge's decision to declare a mistrial based on his assessment of the prejudicial impact of improper argument is entitled to great deference does not, of course, end the inquiry.\"). The Supreme Court has made absolutely clear that \"in order to ensure that [the defendant's constitutionally protected interest in having a particular empaneled jury decide his guilt] is adequately protected, reviewing courts have an obligation to satisfy themselves that, in the words of Mr. Justice Story, the trial Judge exercised 'sound discretion' in declaring a mistrial.\" Id. at 514. If the grant of a mistrial by the trial Judge amounts to an irrational or irresponsible act, he must be found to have abused his discretion in finding that manifest necessity for the mistrial existed, for a trial Judge \"'must always temper the decision whether or not to abort the trial by considering the importance to the defendant of being able, once and for all, to conclude his confrontation with society through the verdict of a tribunal he might believe to be favorably disposed to his fate.'\" Id. (quoting United States v. Jorn, 400 U.S. 470, 486, 27 L. Ed. 2d 543, 91 S. Ct. 547 (1971) (Harlan, J.) (plurality opinion)).\n\nAlthough the Supreme Court has never explicitly articulated a test for a reviewing court to apply in analyzing whether the exercise of discretion by the trial Judge in granting a mistrial was sound as opposed to irrational or irresponsible, we are able to distill some factors that are relevant to this inquiry by looking to the considerations that have framed that Court's analysis of this issue. First, a reviewing court should look to whether a trial Judge rationally could conclude that the grant of the mistrial was compelled by manifest necessity or whether the ends of public Justice demanded that one be granted on the peculiar facts presented. See Arizona v. Washington, 434 U.S. at 514-16 (noting that the trial Judge had been presented with a situation in which the jury had been exposed to inadmissible and highly prejudicial material, creating manifest necessity to support the mistrial); Somerville, 410 U.S. at 468-71 (holding ends of public Justice supported the grant of a mistrial in first proceeding when \"defect was found to exist in the indictment that was, as a matter of Illinois law, not curable by amendment,\" rendering any conviction obtained subject to being \"upset at will\" on appeal or in collateral proceedings); Downum v. United States, 372 U.S. 734, 735-38, 10 L. Ed. 2d 100, 83 S. Ct. 1033 (1963) (examining facts to determine whether grant of mistrial supported by manifest necessity when based on absence of prosecution witness); Wade, 336 U.S. at 691-92 (concluding that record was sufficient to show that rapidly advancing army brought about tactical situation responsible for the withdrawal of charges from first court-martial and thus was supported by manifest necessity). In addition, a reviewing court may find relevant whether the trial Judge acted precipitately or whether the trial Judge expressed concern regarding the possible double jeopardy consequences of an erroneous declaration of a mistrial, heard extensive argument on the appropriateness of such a measure, and gave appropriate consideration to alternatives less drastic than granting a mistrial. See Arizona v. Washington, 434 U.S. at 514-16; see also Jorn, 400 U.S. at 486-87 (plurality opinion) (concluding that based on circumstances surrounding sua sponte grant of mistrial, trial Judge made no effort to exercise sound discretion). We turn to address the application of these factors.\n\nA. Did Manifest Necessity or the Ends of Public Justice Support the Grant of a Mistrial?\n\nWhether a grant of a mistrial is manifestly necessary is a question that turns on the facts presented to the trial court. Somerville, 410 U.S. at 464; Wade, 336 U.S. at 690-91. It is not a mechanically applied standard, but rather is a determination that must be made in the context of the specific difficulty facing the trial Judge. Arizona v. Washington, 434 U.S. at 506; see Somerville , 410 U.S. at 467 (rejecting application of rigid rules in which categories of errors support or fail to support manifest necessity for the grant of a mistrial). And, while manifest necessity for a mistrial does not require that a mistrial be \"necessary\" in the strictest sense of the word, it does require a high degree of necessity. Arizona v. Washington, 434 U.S. at 506. Perhaps the clearest example of a situation in which manifest necessity exists for a mistrial is when a jury is unable to reach a verdict. Id. at 509. At the other extreme are situations in which a prosecuting attorney seeks a mistrial in order to have additional time to marshal evidence to strengthen the case against the defendant. Id. at 508. Between these two extremes exists a spectrum of trial errors and other difficulties, some creating manifest necessity for a mistrial and others falling far short of justifying a mistrial. See id. at 510.\n\nThe State concedes, as it has previously to this court, that the photographs in Set 1 were relevant evidence and that assuming they had been offered into evidence after a proper foundation had been laid for their admission, the photographs would have been admitted into evidence. As pictures of the scene where the altercation occurred, the photographs in Set 1 were relevant evidence. See State v. Gilbert, 277 S.C. 53, 283 S.E.2d 179, 181 (S.C. 1981) (holding crime scene photographs properly admissible to show circumstances of the crime), cert. denied, 456 U.S. 984, 72 L. Ed. 2d 863, 102 S. Ct. 2258 (1982); State v. Wells, 426 S.E.2d 814, 818 (S.C. Ct. App. 1992) (noting that photographs of crime scene are admissible to corroborate other evidence). And, as the State also previously conceded, there is no basis for concluding that these photographs were subject to exclusion on the basis that they \"are unfairly prejudicial so as to outweigh the probative value.\" See State v. Franklin, 456 S.E.2d 357, 361 (S.C.) (holding that \"to constitute unfair prejudice, the photographs must create a 'tendency to suggest a decision on an improper basis, commonly, though not necessarily, an emotional one'\") (quoting State v. Alexander, 303 S.C. 377, 401 S.E.2d 146, 149 (S.C. 1991) (adopting unfair prejudice portion of Federal Rule of Evidence 403 as South Carolina law)), cert. denied, 116 S. Ct. 356 (1995); State v. Campbell, 259 S.C. 339, 191 S.E.2d 770, 773 (S.C. 1972) (noting that court should exclude photographs that \"are calculated to arouse the sympathy or prejudice of the jury,\" that \"are entirely irrelevant,\" or that are \"not necessary to substantiate facts\").\n\nWe also note that the State appears to concede that the mere fact that the photographs in Set 1 were relevant and material evidence does not support a finding that the jury was biased by viewing the photographs or that its deliberations were adversely affected. Undoubtedly, as counsel for Petitioners noted during oral argument, all relevant evidence by definition is prejudicial to some extent in that it is intended to support the proponent's case and prejudice the opponent's.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e But, the \"prejudice\" engendered simply by the jury's viewing of relevant evidence, when that evidence could not improperly bias the jury or adversely affect its deliberations, generally could not support a finding of manifest necessity for a mistrial.\n\nConsideration of the analysis leading the Supreme Court to conclude in Arizona v. Washington that the state trial Judge had not abused his discretion in granting the prosecution's motion for a mistrial over the defendant's objection is instructive. During the opening argument in Washington's state criminal trial, defense counsel informed the jury that the prosecution had intentionally withheld exculpatory evidence from the defense in a prior trial and that, as a result of the prosecution's misconduct, the state supreme court had ordered that Washington be given a new trial. Arizona v. Washington, 434 U.S. at 499. The Supreme Court found this information--that the prosecution had committed misconduct in the prior trial--to be immaterial, inadmissible, and highly inflammatory. See id. at 510-11. And, for this reason, the Supreme Court began its analysis of whether the trial court had abused its discretion in granting the mistrial on the premise that the improper argument \"may have affected the impartiality of the jury.\" Id. at 511. The type of bias the Supreme Court considered to be germane in evaluating the possibility that the jury's deliberations would be adversely affected, and thus to determining whether manifest necessity existed for a mistrial, was that arising from the exposure of the jury to inadmissible and inflammatory material. See id. at 514-15. Clearly, no fair reading of Arizona v. Washington can support a Conclusion that a jury's viewing of relevant, largely cumulative, and unobjectionable photographs could give rise to the type of adverse effect on the jury's deliberations sufficient to create a manifest necessity for a mistrial.\n\nRather, the State asserts that Officer Counts did not lay a proper foundation for the jury's consideration of the photographs in Set 1 because he did not identify the photographs in Set 1 by number in the presence of the jury and because he did not specifically explain to the jury either the location depicted in the photographs or their relevance. The State claims that in the absence of this proper identification and foundation testimony, the jury's viewing of the photographs unduly prejudiced the prosecution because the jury may have been confused. It asserts that without this proper foundation testimony, the jury may not have been able to determine that the different photographs depicted the same areas marked with yellow tape and, thus, may have been misled as to the location of these areas. Further, the State contends that in the absence of foundational proof of serological tests performed on the red spots shown in the photographs in Set 1, the jury could not properly have relied on photographs to conclude that the red spots were blood. We cannot agree.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e The State cites no authority for the proposition that before a jury may properly view photographs of a crime scene, the sponsoring wit ness must refer to each photograph by exhibit number, describe the location depicted in each photograph individually, or explain the relevance of each of the photographs individually. In other words, the State offers no support for its contention that this testimony is a necessary part of the foundation for admission of photographs into evidence in South Carolina state courts. This is not surprising because under South Carolina law, \"normally it is sufficient to justify admittance of photographs into evidence if a person familiar with the scene can say that the pictures truly represent the scene involved.\" Campbell, 191 S.E.2d at 773.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nThere is no dispute that Officer Counts was present at the scene when the photographs were taken, either by himself or another SLED agent, or that the photographs accurately represented the scene outside the Silvers' mobile home. As the district court found, these facts were adequately established during Officer Counts' testimony; so, a proper authentication was laid for the admission of the photographs.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e This finding is buttressed by the fact that the photographs in Set 2 were admitted into evidence with the same foundational testimony as those in Set 1--except for the fact that the Set 2 photographs were referred to by number--and without objection from the prosecuting attorney. Additionally, there is no requirement of South Carolina law that before crime scene photographs showing what appears to be blood may be admitted into evidence, the results of a serological test first must be introduced.\n\nMoreover, even if the State were correct that Officer Counts had not laid the proper foundation for admission of the photographs into evidence, there was no possibility that the jury could have been confused by seeing the photographs in Set 1 prior to having heard this testimony. Officer Counts had testified that yellow tape marked three areas on the ground outside the Silvers' mobile home where what appeared to be blood was located. In addition, he had testified that these areas were located to the left of the mobile home and just beside the roadway, and he had marked the location of these three areas on an overlay of a diagram of the crime scene prepared by the prosecution. Further, he testified that all of the photographs (Sets 1 and 2) showed the same scene but from different angles. Given this testimony, it strains credibility to suggest that the Set 1 photographs could have misled the jury into believing that there were a greater number of areas where blood was located or that the blood was discovered in a location other than the one indicated by Officer Counts. And, whether the photographs actually showed blood was a matter properly within the jury's discretion; no additional testimony or foundation was necessary to guide their discretion prior to viewing the photographs.\n\nFinally, in determining whether a high degree of necessity was shown for the mistrial, it is important to bear in mind that there is simply no rational argument that viewing the photographs in Set 1 somehow improperly biased the jury. Cf. Arizona v. Washington, 434 U.S. at 510-11 (beginning analysis of whether trial court exercised sound discretion with the premise that counsel's improper and highly inflammatory remarks to the jury during opening argument may have affected the jury's impartiality). As the State previously conceded, the only error was in the fact that the photographs had not been formally admitted into evidence. The State's own witness, Officer Counts, testified that what appeared to be blood had been located at the scene outside the Silvers' mobile home. And, the difference in perspective of the two sets of photographs did not add any information concerning the location of the blood spots or tire tracks because Officer Counts testified, and indicated on a diagram prepared by the State, where SLED investigators had located blood at the scene and the location of the tire tracks.\n\nParticularly revealing is the testimony of one of the prosecuting attorneys given before the district court: He testified that the prosecution did not actually want to move for a mistrial and that the reason the motion was made was because the state trial Judge sent a signal as big as \"I have ever seen\" that he desired the prosecution to so move.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e J.A. 428. In view of the state trial Judge's \"signal\" to the prosecution\n\nthat the court was seeking a motion for a mistrial, it is understandable why the motion was made. This admission is strong evidence that the prosecution did not actually believe that the jury had been biased or that its deliberations were somehow affected as a result of seeing the photographs in Set 1. Indeed, nowhere in the prosecuting attorney's testimony did he indicate that the prosecution was in some way prejudiced by the jury's viewing of the Set 1 photographs. And, the prosecution's lack of awareness of the serological test that had been performed and its decision not to conduct further serological testing to attempt to determine whose blood was found further illustrates the fact that the prosecution did not believe that the existence of drops of blood outside the mobile home was significant; it was undisputed that Gilliam bled from a gunshot wound to the lower leg and, therefore, that blood was present at the scene outside the mobile home.\n\nAlternatively, the State argues that even if the jury was not biased by viewing the Set 1 photographs, the state trial Judge nevertheless properly may have concluded that the ends of public Justice were served by the grant of a mistrial because the procedures for the proper admission of evidence for the jury's consideration had been violated through defense counsel's negligence. In fact, one of the prosecuting attorneys testified that this factor, rather than any perceived prejudice to the prosecution's case, motivated the decision to seek a mistrial. In our view, this question forms the true issue raised by this appeal: Does a trial Judge exercise sound discretion in concluding that a mistrial is supported by the ends of public Justice when defense counsel negligently permits the jury to view photographs that have not been admitted into evidence, but that undoubtedly could and would be admitted if so offered?\n\nIn examining some of the situations in which the ends of public Justice were held to support the grant of a mistrial, the Supreme Court has written:\n\nA trial Judge properly exercises his discretion to declare a mistrial if an impartial verdict cannot be reached, or if a verdict of conviction could be reached but would be reversed on appeal due to an obvious procedural error in the trial. If an error would make reversal on appeal a certainty, it would not serve \"the ends of public Justice\" to require that the Government proceed with its proof when, if it succeeded before the jury, it would automatically be stripped of that success by an appellate court.\n\nSomerville, 410 U.S. at 464.\n\nAs noted above, because these photographs could have been admitted into evidence, could not have caused the jury to have been confused or misled, and could not have biased or inflamed the jury, there is no basis upon which to conclude that the jury could not have reached an impartial verdict.\n\nAnd, any error in the jury's viewing of these photographs would not have amounted to reversible error under South Carolina law. First, because there was no reason why the photographs could not have been formally admitted by the defense, any technical error in the jury's viewing of the photographs could have been easily remedied before the case was submitted to the jury. Second, even if the technical error could not have been corrected, this error could not possibly have resulted in reversal of Petitioners' convictions because harmless error does not necessitate the reversal of a South Carolina criminal conviction. See State v. Gaskins, 284 S.C. 105, 326 S.E.2d 132, 141 (S.C. 1985), cert. denied, 471 U.S. 1120, 86 L. Ed. 2d 266, 105 S. Ct. 2368 (1985). The erroneous consideration of evidence is not a ground for reversal unless it results in prejudice. See State v. Knight, 258 S.C. 452, 189 S.E.2d 1 (S.C. 1972). And, when a jury considers a crime scene photograph, when other photographs of the same scene are already in evidence without objection, no prejudice can be inferred. See State v. Bellue, 260 S.C. 39, 194 S.E.2d 193, 194 (S.C. 1973). Moreover, a jury's exposure to evidence that is admissible, but not admitted, does not require reversal of a conviction. See Campbell, 191 S.E.2d at 772-73 (stating that display before the jury by the solicitor of an axe found at the crime scene did not warrant reversal of defendant's conviction, when although not admitted into evidence, the axe properly could have been admitted). Thus, there is no possibility that if the trial had resulted in a conviction of Petitioners, the verdicts would have been reversed on appeal because the jury viewed the Set 1 photographs.\n\nAlthough the circumstances presented to the state trial Judge created neither a risk that the jury would be unable to reach an impartial verdict nor a risk that a verdict of guilty would have been overturned on appeal or collateral review, an argument is made that the state trial Judge's grant of a mistrial under these circumstances nevertheless was supported by the ends of public Justice. A trial Judge must be permitted to ensure the integrity of the trial and its evidentiary procedures through the grant of a mistrial, the State maintains, and any rule that fails to recognize this institutional necessity would place unscrupulous defense counsel in a \"no lose\" situation: Unethical defense counsel will be undaunted from violating evidentiary procedures because, in the event a mistrial is granted, they obtain a real opportunity for a reviewing court to conclude that retrial is barred by the Double Jeopardy Clause or, in the event the trial Judge does not grant a mistrial, they obtain the benefit of having the jury consider unadmitted or improperly admitted evidence. This parade of horribles rings hollow.\n\nUndoubtedly a trial Judge possesses wide latitude to maintain control over the courtroom to ensure the integrity of the proceedings, but the traditionally broad discretion afforded in such matters necessarily accedes to the Constitution, requiring that the exercise of the discretion in favor of granting a mistrial over a defendant's objection and after the jury has been sworn be exercised only when a high degree of necessity or the ends of public Justice compel the act. We are unable to accept the State's argument that a trial court may deprive a defendant of his constitutionally protected right to have an empaneled and unbiased jury decide his guilt on the ground that his attorney committed a technical and harmless error.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e See Harris v. Young, 607 F.2d 1081, 1086 (4th Cir. 1979) (concluding that trial court did not exercise sound discretion in granting mistrial in part because \"there [was] no indication that the traditional remedies for attorney misconduct, including censure, reprimand, contempt, or recommendation of disciplinary proceedings were not available\"), cert. denied, 444 U.S. 1025 (1980). And, the State's argument is particularly unconvincing on the present facts because there has never been any allegation that all of the defense attorneys were responsible for the error. Thus, the Petitioners whose separate counsel were not responsible for the error were deprived of a constitutional right in the absence of even unintentional harmless error by their own attorney.\n\nOur Conclusion that the ends of public Justice do not support the grant of a mistrial under the present circumstances--i.e., when admissible and largely cumulative evidence that was not unduly prejudicial, that would not cause juror confusion, and that had been properly authenticated, was inadvertently placed where the jury could view it --does not signal that a trial Judge would be incorrect in concluding that the ends of Justice supported the grant of a mistrial in other circumstances. For example, when evidence that would not have been admitted, or that may have biased the jury in some way, was aired before the jury, a mistrial may very well be appropriate. Accordingly, unscrupulous defense counsel will find no encouragement in our opinion to evade the rules of evidence: If counsel were to air evidence that might tend to improperly bias the jury or adversely affect its impartiality, any reviewing court applying the teachings of Arizona v. Washington would conclude that the trial Judge acted within his discretion in granting a mistrial. And, if counsel seeks to improperly place only innocuous, admissible evidence before the jury, no advantage is gained, and a significant risk exists that counsel may find that they face sanctions for their conduct. All in all, we do not view this scenario as creating any real possibility for abuse.\n\nIn sum, we conclude that neither manifest necessity nor the ends of public Justice required a mistrial.\n\nB. Do Other Factors Indicate that the State Trial Judge Exercised Sound Discretion?\n\nThe other factors that the Supreme Court has indicated are relevant to a determination of whether a trial court exercised sound discretion in granting a mistrial also weigh against that finding here. First, as the district court found, the state trial Judge acted precipitately: He refused defense counsel's request to determine whether the jury had actually seen the photographs in question; he refused to determine whether Officer Counts had in fact authenticated the photographs during his testimony; he refused simply to look at the photographs and rule on their admissibility; and he refused to allow defense counsel's request to recall Officer Counts and formally move the admission of the photographs into evidence. The manner in which the state trial Judge examined the appropriateness of the grant of a mistrial furnishes no indication of the exercise of sound discretion.\n\nIn addition, the state trial Judge never evinced any awareness that the grant of a mistrial might implicate or deprive Petitioners of their constitutional right to have the empaneled jury decide their guilt. Indeed, at no point during the brief colloquy with counsel concerning the State's motion for a mistrial did the state trial Judge allude to the Fifth Amendment, the Double Jeopardy Clause, or the proposition that in order to retry a criminal defendant after a mistrial has been granted over his objection, manifest necessity or the ends of public Justice must require that it be granted.\n\nFinally, the state trial Judge ignored an obvious and adequate alternative to the grant of a mistrial. See United States v. Sloan, 36 F.3d 386, 400 \u0026 n.11 (4th Cir. 1994); United States v. Shafer, 987 F.2d 1054, 1057 (4th Cir. 1993) (\"If alternatives existed, then society's interest in fair trials designed to end in just judgments was not in conflict with the defendant's right to have the case submitted to the jury.\") (internal quotation marks \u0026 citation omitted); Harris, 607 F.2d at 1085 n.4 (\"If obvious and adequate alternatives to aborting the trial were disregarded, this suggests the trial Judge acted unjustifiably.\"). The State conceded in argument before this court that there was nothing to prevent the state trial Judge from simply allowing Officer Counts (who was under subpoena and available) to be recalled to the witness stand to have the photographs formally introduced, as defense counsel offered to do prior to the state trial Judge's ruling on the prosecution's motion for a mistrial.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Without question, this would have cured the technical, and only, error that had occurred. Thus, in the absence of any prejudicial error, the state trial Judge refused to consider or implement an obvious and completely adequate course of action to correct any possible error in the jury's having viewed cumulative photographs that had not been formally moved and received into evidence. This factor, then, also weighs in favor of a Conclusion that the state trial court acted irresponsibly in granting the mistrial.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nC. Summary\n\nIn sum, we agree with the district court that the state trial Judge did not exercise sound discretion in granting the mistrial. The record will not support a Conclusion that manifest necessity existed: The jury was not exposed to any inadmissible evidence; the photographs in Set 1 could not have adversely affected the impartiality of the jury; and in light of Officer Counts' testimony, the Set 1 photographs did not present any realistic potential for juror confusion. Additionally, the grant of the mistrial was not compelled by the ends of public Justice: There was no reason a just verdict could not have been reached by the jury; there was no error that could have resulted in reversal if the trial had ended in conviction; and there was no necessity for the state trial Judge to grant a mistrial to vindicate any institutional interest protecting the integrity of evidentiary procedures. Moreover, the state trial Judge acted precipitately and ignored an obvious and completely adequate alternative offered to remedy any error arising from the jury's consideration of the photographs.\n\nIn reaching this Conclusion, we consider it important to emphasize what we do not hold. We are not called upon to second guess a discretionary ruling on the admissibility of evidence by a state trial Judge in a criminal proceeding or a finding that the jury was potentially biased or prejudiced. The state trial Judge plainly refused to rule on the admissibility of the Set 1 photographs and made no finding that the impartiality of the jury had been, or may have been, affected by viewing the photographs in dispute. Nor are we faced with a situation in which the admissibility of evidence or the possibility of juror bias is subject to some doubt. Indeed, the State has repeatedly conceded that the Set 1 photographs were admissible and without question properly would have been admitted into evidence during the first trial if they had simply been moved into evidence when Officer Counts was on the stand; and, the testimony of Officer Counts foreclosed any possibility of juror confusion. As a result, we do not confront a situation in which a state trial Judge has exercised his discretion to choose a mistrial in lieu of some other measure designed to remedy juror bias or prejudice.\n\nIf the situation facing this state trial court could be found to support a Conclusion that manifest necessity or the ends of public Justice required the grant of a mistrial, those words have little meaning, and the standard for trial Judges to employ in deciding the appropriateness of the grant of a mistrial may as well be articulated in terms of whether a trial Judge in good faith deems the mistrial advisable. Moreover, if the circumstances surrounding the grant of this mistrial could be found to sustain a determination that the state trial Judge exercised sound discretion in granting a mistrial, there would be little point to providing any level of judicial review of such decisions. For better or worse, however, the Double Jeopardy Clause has been construed by the Supreme Court to permit the retrial of a defendant after a mistrial is granted over his objection only when manifest necessity or the ends of public Justice compelled that the mistrial be granted, and the Supreme Court has directed reviewing courts to examine the ruling of the trial Judge to determine whether sound discretion was exercised in granting the mistrial. Were we to hold otherwise, the protection afforded by the Double Jeopardy Clause would no longer safeguard a defendant's right to have a trial completed by an empaneled jury--a right long held to be encompassed within the protections afforded by the Clause--but would provide protection only against demonstrable prosecutorial or judicial misconduct. Further, the review for sound discretion reaffirmed in Arizona v. Washington would be relegated to a ministerial rubber stamp of a state trial Judge's decision to grant a mistrial irrespective of the irrationality of that decision. While we abhor the result--because, as in all cases in which the Double Jeopardy Clause bars reprosecution, the defendants will not be held to account for their alleged crimes--our application of the law as we understand it compels us to affirm the judgment of the district court.\n\nIII. Younger Abstention\n\nAlthough the State did not initially raise this issue,\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e it now asserts that the abstention doctrine of Younger v. Harris, 401 U.S. 37, 27 L. Ed. 2d 669, 91 S. Ct. 746 (1971), barred the district court from granting federal habeas corpus relief. It maintains that having concluded that there was no bad faith on the part of the prosecution in proceeding with the trial, the court should have declined further review.\n\nIn Younger, the Supreme Court plainly declared that federal court equitable interference with state criminal proceedings should not be undertaken except in the most narrow and extraordinary of circumstances. Basic tenets of equity jurisprudence dictate that a court \"'of equity should not act, and particularly should not act to restrain a criminal prosecution, when the moving party has an adequate remedy at law and will not suffer irreparable injury if denied equitable relief.'\" Kugler v. Helfant, 421 U.S. 117, 123, 44 L. Ed. 2d 15, 95 S. Ct. 1524 (1975) (quoting Younger, 401 U.S. at 43-44). And, concerns of comity and federalism justify additional caution when a federal court is petitioned to intervene in a pending state criminal action. Id. Consequently, federal courts may intervene in state criminal proceedings, either by way of declaratory relief or by injunction, only when there has been a \"showing of bad faith, harassment, or any other unusual circumstance that would call for equitable relief.\" Younger , 401 U.S. at 54 (emphasis added); Kugler, 421 U.S. at 123 (\"In the absence of exceptional circumstances creating a threat of irreparable injury both great and immediate, a federal court must not intervene by way of either injunction or declaratory judgment in a pending state criminal prosecution.\") (internal quotation marks omitted).\n\nIt is undisputed that the state proceeding against Petitioners was not undertaken in bad faith or for purposes of harassment. Moreover, there is no suggestion that the prosecutors who sought the mistrial on behalf of the State during the first trial or the Judge who granted it were acting in bad faith in doing so. Nevertheless, a federal court may provide equitable intervention in a state criminal proceeding \"'even in the absence of the usual prerequisites of bad faith and harassment'\" when \"'extraordinary circumstances in which the necessary irreparable injury can be shown'\" are present. Kugler , 421 U.S. at 124 (quoting Younger, 401 U.S. at 53).\n\nThe State argues that Petitioners have not shown extraordinary circumstances for federal court intervention in the state criminal proceedings because they have failed to show that they will suffer irreparable injury if they are forced to undergo the trial of their criminal charges and raise their double jeopardy claim on direct appeal if they are convicted. The State stresses that \"the cost, anxiety, and inconvenience of having to defend against a single criminal prosecution alone [does] not constitute 'irreparable injury.'\" Id. (quoting Younger, 401 U.S. at 46).\n\nThe State is correct that ordinarily irreparable harm cannot be shown simply because a defendant will be subject to a single criminal prosecution in which he must raise any constitutional claims he wishes as a defense to his conviction. \"The policy of equitable restraint expressed in Younger v. Harris. .. is founded on the premise that ordinarily a pending state prosecution provides the accused a fair and sufficient opportunity for vindication of federal constitutional rights.\" Id. However, because the Double Jeopardy Clause of the Fifth Amendment protects not only against multiple convictions but also \"against being twice put to trial for the same offense,\" Abney v. United States, 431 U.S. 651, 660-62, 52 L. Ed. 2d 651, 97 S. Ct. 2034 (1977), a portion of the constitutional protection it affords would be irreparably lost if Petitioners were forced to endure the second trial before seeking to vindicate their constitutional rights at the federal level,\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e see Justices of Boston Mun. Court v. Lydon, 466 U.S. 294, 303, 80 L. Ed. 2d 311, 104 S. Ct. 1805 (1984); Abney, 431 U.S. at 662. Thus, the irreparable deprivation of this Fifth Amendment Double Jeopardy right is an extraordinary circumstance warranting federal court equitable intervention in Petitioners' state criminal proceeding.\n\nOur Conclusion is in accord with the decisions of the other courts of appeals that have addressed this question. They have unanimously recognized that a colorable claim that a second trial will violate a defendant's double jeopardy right is a preeminent example of one of the very few extraordinary circumstances justifying federal court intervention in a pending state criminal proceeding. See Satter v. Leapley, 977 F.2d 1259, 1261 (8th Cir. 1992); Mannes v. Gillespie, 967 F.2d 1310, 1312 (9th Cir. 1992), cert. denied, 506 U.S. 1048, 122 L. Ed. 2d 121, 113 S. Ct. 964 (1993); Showery v. Samaniego, 814 F.2d 200, 201 n.5 (5th Cir. 1987); Doe v. Donovan, 747 F.2d 42, 44 (1st Cir. 1984) (per curiam); United States ex rel. Stevens v. Circuit Court of Milwaukee Co., Wis. Branch VIII, 675 F.2d 946, 947-48 (7th Cir. 1982); Gully v. Kunzman, 592 F.2d 283, 286-87 (6th Cir.), cert. denied, 442 U.S. 924, 61 L. Ed. 2d 292, 99 S. Ct. 2850 (1979); Drayton v. Hayes, 589 F.2d 117, 120-21 (2d Cir. 1979); United States ex rel. Webb v. Court of Common Pleas of Philadelphia County, 516 F.2d 1034, 1037-39 (3d Cir. 1975).\n\nMoreover, this Conclusion is buttressed by the fact that the Supreme Court has never refused on the basis of the Younger abstention doctrine to decide the merits of a double jeopardy claim raised in a ยง 2254 petition. Instead, the Supreme Court has on several occasions addressed whether a forthcoming second state criminal trial was barred on double jeopardy grounds. See Lydon, 466 U.S. at 304-13; Arizona v. Washington, 434 U.S. at 503-17. In Lydon, the Supreme Court specifically ruled that a state habeas corpus petitioner had satisfied the ยง 2254 custody and exhaustion requirements to permit federal habeas review of his double jeopardy claim prior to his retrial on state criminal charges. Discussing the exhaustion requirement, and without referring to Younger, the Court wrote that because the Double Jeopardy Clause \"protects interests wholly unrelated to the propriety of any subsequent conviction, a requirement that a defendant run the entire gamut of state procedures, including retrial, prior to consideration of his claim in federal court, would require him to sacrifice one of [its] protections.\" Lydon, 466 U.S. at 303 (internal quotation marks \u0026 citation omitted). See generally Winston v. Moore, 452 U.S. 944, 69 L. Ed. 2d 960, 101 S. Ct. 3092 (1981) (Rehnquist, J., Dissenting) (without indicating that Younger abstention principles applied, opining that Court should have granted certiorari to address the merits of the double jeopardy claim); Willhauck v. Flanagan, 448 U.S. 1323, 1325, 65 L. Ed. 2d 1147, 101 S. Ct. 10 (Brennan, Circuit Justice 1980) (noting that double jeopardy claims may present an exception to Younger abstention); Mincey v. Arizona, 434 U.S. 1343, 1344, 54 L. Ed. 2d 56, 98 S. Ct. 23 (Rehnquist, Circuit Justice 1977) (distinguishing claim that second state trial should be stayed based on alleged error in introduction of evidence from a claim that the second trial would violate double jeopardy and stating that the former should be raised through the normal state appellate channels).\n\nEquitable federal court interference with ongoing state criminal proceedings should be undertaken in only the most limited, narrow, and circumscribed situations. However, when the record demonstrates that a second state criminal trial will constitute a violation of the defendant's double jeopardy rights, federal court intervention is appropriate.\n\nIV. Conclusion\n\nOur decision that the Double Jeopardy Clause bars a retrial of Petitioners is an enormously difficult one. Frequently, when this court concludes either on direct appeal or on habeas corpus review that a trial Judge has committed an error during a criminal trial, we are able to determine that the error was a harmless one and does not require that the conviction be set aside. And, even when this court concludes that a ruling by a trial Judge in a criminal prosecution was erroneous and prejudicial, in the vast majority of cases the defendant may be retried. The unique constitutional protection afforded by the Double Jeopardy Clause, however, dictates that when a trial court abuses the ample discretion afforded to it in granting a mistrial in a criminal case over a defendant's objection, the defendant may not be retried. As a result of the error committed by the state trial Judge in Petitioners' first trial, the State of South Carolina may not retry them.\n\nIt is our duty to apply the law to uphold the convictions of those who are unable to demonstrate harmful error and to order appropriate relief for those who do. And, just as surely, it is our duty to apply to the best of our understanding the interpretation given to the Constitution by the Supreme Court even when that application prevents the retrial of criminal defendants.\n\nChief Judge Ervin, Judge Hall, Judge Murnaghan, Judge Hamilton, Judge Williams, Judge Michael, and Judge Motz join in this opinion.\n\nAFFIRMED\n\nDisposition\n\nAFFIRMED\n\nWILKINSON, Circuit Judge, Dissenting:\n\nI respectfully Dissent. When a mistrial is declared through no fault of the prosecution and indeed as the direct result of defense error, a federal court may not enjoin a subsequent state criminal trial while it is ongoing. The majority disregards this fundamental axiom, leaving two mainstays of our federal system, Younger v. Harris, 401 U.S. 37, 27 L. Ed. 2d 669, 91 S. Ct. 746 (1971), and Arizona v. Washington, 434 U.S. 497, 54 L. Ed. 2d 717, 98 S. Ct. 824 (1978), in a badly damaged state.\n\nI.\n\nI will first take up the damage to the Younger decision. That damage falls into two broad categories: (1) doctrinal damage to Younger ; and (2) the practical damage of disruption visited upon the relationship of state and federal courts. The damage is compounded by the fact that the pronouncements in this case are those of an en banc court.\n\nThe doctrinal damage to Younger stems from the majority's insistence on a duty on the part of federal courts to intervene in ongoing state criminal proceedings even when defense error causes the declaration of an earlier mistrial. The majority adopts a single standard for federal judicial intervention into ongoing state trials -- one which ignores the source of the earlier error in state court. In so doing, the majority also ignores two critical findings that the district court made in this very case: first, that \"there is nothing in the record to indicate that the prosecutors acted with bad faith or improper motive in moving for a mistrial,\" and, second, that the trial Judge found \"that it was defense counsel who erroneously placed Photo Set 1 on the jury rail,\" thus precipitating the mistrial.\n\nIntervention under these circumstances turns Younger on its head. Younger envisioned the federal courts as a last line of defense against gross abuses of prosecutorial power. See Younger , 401 U.S. at 47-53. It never envisioned episodic federal interventions into ongoing state proceedings whenever a federal habeas court thinks that the earlier grant of a mistrial by a state trial Judge was simply a mistake. See id. at 43-47. The language of Younger makes plain that the evil sought to be remedied by federal equitable intervention was that of prosecutorial malfeasance or bad faith. Id. at 53. The Court declared that the \"fundamental policy against federal interference with state criminal prosecutions,\" id. at 46, could only be abandoned in the face of \"bad faith, harassment, or any other unusual circumstances that would call for equitable relief.\" Id. at 54. As the Court elaborated in a companion case: \"Only in cases of proven harassment or prosecutions undertaken by state officials in bad faith without hope of obtaining a valid conviction and perhaps in other extraordinary circumstances where irreparable injury can be shown is federal injunctive relief against pending state prosecutions appropriate.\" Perez v. Ledesma, 401 U.S. 82, 85, 27 L. Ed. 2d 701, 91 S. Ct. 674 (1971). Over thirty years of litigation since Younger testify to the strength of its presumption against federal interference; in no case has the Supreme Court found the bad faith exception to apply. 17A\n\nCharles A. Wright, Arthur R. Miller \u0026 Edward H. Cooper, Federal Practice and Procedure, ยง 4255 at 254 (1988).\n\nThe majority asserts that double jeopardy claims are an \"extraordinary circumstance\" warranting a departure from Younger. Younger, 401 U.S. at 54; Perez, 401 U.S. at 85. Such claims are extraordinary,\n\nthe majority contends, because forcing a defendant to endure a second trial that violates the Double Jeopardy Clause constitutes irreparable injury. This effort ignores the warning of the Supreme Court that the exceptions to Younger are narrow. Huffman v. Pursue, Ltd., 420 U.S. 592, 611, 43 L. Ed. 2d 482, 95 S. Ct. 1200 (1975). None of the decisions invoked by the majority to support its proposition are applicable here. None of those courts enjoined, or even contemplated enjoining, an ongoing state criminal trial, let alone on the basis that an earlier mistrial provoked by defense error was not supported by \"manifest necessity.\" In fact, though they considered the claims presented by state petitioners, most of those courts did not grant relief on the merits. Satter v. Leapley, 977 F.2d 1259, 1260 (8th Cir. 1992); Showery v. Samaniego , 814 F.2d 200, 201 (5th Cir. 1987); Doe v. Donovan, 747 F.2d 42, 44 (1st Cir. 1984); United States ex rel. Stevens v. Circuit Court of Milwaukee, Wis. Branch VIII, 675 F.2d 946, 949 (7th Cir. 1982); Gully v. Kunzman, 592 F.2d 283, 289-90 (6th Cir.), cert. denied , 442 U.S. 924, 61 L. Ed. 2d 292, 99 S. Ct. 2850 (1979); Drayton v. Hayes, 589 F.2d 117, 118 (2d Cir. 1979). Pre-trial relief was granted in only a few cases. In one, Younger was not implicated because the petitioner had not requested an injunction against an ongoing criminal proceeding. United States ex rel. Webb v. Court of Common Pleas of Philadelphia County, 516 F.2d 1034, 1039 n.18 (3d Cir. 1975). In the others, the petitioner had been acquitted previously, the most compelling double jeopardy claim a defendant can advance. Mannes v. Gillespie, 967 F.2d 1310, 1316 (9th Cir. 1992), cert. denied, 506 U.S. 1048, 122 L. Ed. 2d 121, 113 S. Ct. 964 (1993) (judicial acquittal bars retrial); Davis v. Herring, 800 F.2d 513, 519 (5th Cir. 1986) (implicit jury acquittal bars retrial).\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThe majority creates a broad exception to Younger abstention whenever a petitioner on federal habeas raises a claim of double jeopardy. Assuming arguendo that double jeopardy claims do warrant a departure from the doctrine of Younger abstention, they should never occasion such a departure when, like here, there is not the slightest accusation of misconduct by the state. See Gilliam v. Foster, 61 F.3d 1070, 1089-90 (4th Cir. 1995) (Luttig, J., Dissenting). I cannot accept the majority's view that pre-trial habeas review is available irrespective of the nature of the double jeopardy claim. See Stevens, 675 F.2d at 948-49 (availability of pre-trial consideration of habeas depends on nature of double jeopardy claim). The principal evil to be avoided in the double jeopardy context is that the state may receive a second shot at a defendant as a result of its own failings or misconduct. For example, in Downum v. United States, 372 U.S. 734, 10 L. Ed. 2d 100, 83 S. Ct. 1033 (1963), the Supreme Court prohibited retrial when a mistrial was declared due to a prosecutor's inability to locate a critical witness of whose absence the prosecution was aware when it proceeded to trial. Id. at 735-38. In United States v. Shafer, 987 F.2d 1054 (4th Cir. 1993), this court prohibited retrial when a mistrial was declared due to the prosecution's failure to turn over discovery materials to the defense. Id. at 1056-59. The errors in Downum and Shafer suggested that the mistrial would allow the prosecution to \"buttress weaknesses in [its] evidence,\" Arizona, 434 U.S. at 507, only to be used to its advantage in a second prosecution.\n\nThis danger of prosecutorial overreaching is totally absent here. There is no suggestion that this prosecution was anything other than legitimate. \"There is nothing in the record,\" as the district court found, \"to indicate that the prosecutors acted with bad faith or improper motive in moving for a mistrial.\" There is no indication that the prosecution sought the mistrial to recover from a false start in its case. To the contrary, the state Judge declared the mistrial because he was obviously disturbed that the jury was exposed to close-up photographs of the crime scene that were never properly admitted into evidence. The majority, however, disregards both the source and the nature of the error occasioning the mistrial. In so doing, it fashions an exception to Younger so broad that federal court intrusion into state criminal trials will become an ordinary, rather than an extraordinary, event. See Hicks v. Miranda, 422 U.S. 332, 352, 45 L. Ed. 2d 223, 95 S. Ct. 2281 (1975).\n\nTo protest generally the dangers of federal intervention into pending state proceedings fails to adequately convey the specific harm visited by this court. Its intervention came at the worst possible moment in the state criminal proceedings -- when a trial was well underway. On July 15th, just two days before the start of the state trial, a panel of this court heard argument and affirmed the district court's initial ruling denying petitioners' request for injunctive relief. Then, on the fourth day of the state trial, July 20th, the en banc court reversed the panel's decision and halted the state trial in its tracks. Younger itself prohibits intervention in any pending state criminal proceeding. But here a criminal prosecution was far more than pending ; it had proceeded to trial, and almost as if the Judge, jury, witnesses, and parties were participants in some illicit gathering, the federal court ordered them dispersed.\n\nThe majority has, in short, cut Younger at its core. It sanctions disruption of an ongoing state criminal trial when there is no allegation whatsoever of misconduct by the state. It disregards the principles of comity and federalism that underpin the Younger decision; Younger is, after all, designed to \"permit state courts to try state cases free from interference by federal courts.\" Younger , 401 U.S. at 43 (emphasis added). The intervention countenanced here shows scant respect for the capacity of state courts to safeguard constitutional rights, Trainor v. Hernandez, 431 U.S. 434, 443, 52 L. Ed. 2d 486, 97 S. Ct. 1911 (1977), and thus creates unwarranted friction between state and federal courts at a time when state courts are, if anything, more responsible guardians of constitutional guarantees than at the time of Younger itself.\n\nBut to speak generally of the harm to comity and federalism is again to muffle the point. The damage is best calculated by canvassing what happened in this very case. This circuit's intervention forced the state to divert resources away from its ongoing prosecution to lengthy collateral proceedings and litigation of this habeas claim drove the state trial Judge to recuse himself. Attorneys argued repeatedly, and often simultaneously, before state and federal courts about the admissibility, relevance and prejudicial effect of crime scene photographs exposed to the jury in a state criminal trial. State criminal processes and federal habeas consideration -- erratic as it was -- proceeded on parallel tracks. The district court denied, and then after prodding from the en banc court, granted the writ of habeas corpus. Gilliam, 63 F.3d 287 (4th Cir. 1995); Gilliam, 61 F.3d 1070. The en banc court issued an emergency stay of an ongoing state criminal trial without hearing argument and without sufficient opportunity to view the disputed photographs. A state jury was sent home and a trial was placed in limbo as a result of the federal intervention. Now, finally, the majority finds a double jeopardy violation and forever bars a murder prosecution of state defendants based on its own view that the state trial Judge's response to an admitted evidentiary error at trial was improper.\n\nIncapacitating state criminal processes in this way is precisely what Younger sought to avoid. Any disruption of state criminal proceedings undermines a state's ability to enforce its own criminal laws and thus fails to show a \"proper respect for state functions.\" Younger, 401 at 44. And federal disruption is most debilitating when an ongoing trial is cut short; such a mid-course suspension destroys the very purpose of a trial, to require the state and defense to marshall their evidence before a jury in the course of one continuous proceeding.\n\nThe majority now attempts a belated exercise in damage control, suggesting that these sorts of disruptions will not happen very often. The events giving rise to the majority's decision, however, are not out of the ordinary. Mistrials occur in state courts with some regularity and for a variety of reasons. The majority's action invites the premature relitigation of all these decisions in federal court. Its opinion contains no limiting principle other than the general and subjective one of manifest necessity. That standard, however, was not developed with the disruption of ongoing trials in mind. It was never envisioned as a routine exception to the bar on federal equitable intervention in pending state proceedings. Moreover, even when the state ultimately wins, the state loses. It has been forced to suspend its own criminal proceedings while the litigants climb up and down the ladder of the federal system contesting the manifest necessity standard. This court has ignored the wisdom of the Younger doctrine. It will surely regret the immeasurable damage it has done to this constitutional canon of our federal system.\n\nII.\n\nI will next address the damage to Arizona v. Washington, 434 U.S. 497, 54 L. Ed. 2d 717, 98 S. Ct. 824 (1978).\n\nArizona reaffirmed that the Double Jeopardy Clause is not an absolute bar to reprosecution when a first trial ends in mistrial over the objection of the defendant. Id. at 505; see also Illinois v. Somerville,\n\n410 U.S. 458, 463-64, 35 L. Ed. 2d 425, 93 S. Ct. 1066 (1973); Gori v. United States, 367 U.S. 364, 367-68, 6 L. Ed. 2d 901, 81 S. Ct. 1523 (1961); United States v. Perez, 22 U.S. 579, 9 Wheat. 579, 580, 6 L. Ed. 165 (1824). Arizona emphasizes on at least five separate occasions that a trial court's judgment on the manifest necessity for a mistrial is entitled to \"the highest degree of respect.\" 434 U.S. at 511, 510-14; see also Somerville, 410 U.S. at 462; Gori, 367 U.S. at 368; Wade v. Hunter, 336 U.S. 684, 691-92, 93 L. Ed. 974, 69 S. Ct. 834 (1949). The Arizona Court examined the broad spectrum of reasons that give rise to mistrials, noting that some warranted more scrutiny than others. As in Younger , the principal concern of the Arizona Court was with prosecutorial overreaching or bad faith. On the one hand, \"the strictest scrutiny\" is to be applied \"when the basis for the mistrial is the unavailability of critical prosecution evidence, or when there is reason to believe that the prosecutor is using the superior resources of the State to harass or to achieve a tactical advantage over the accused.\" 434 U.S. at 508 (footnotes omitted). On the other hand, in a case like Arizona, where the defense attorney \"aired improper and highly prejudicial evidence before the jury,\" id. at 515, \"the trial Judge's determination is entitled to special respect.\" Id. at 510. The Court explained in detail why this deference was necessary: \"There are compelling institutional considerations militating in favor of appellate deference to the trial Judge's evaluation of the significance of possible juror bias. He has seen and heard the jurors during their voir dire examination. He is the Judge most familiar with the evidence and the background of the case on trial. He has listened to the tone of the argument as it was delivered and has observed the apparent reaction of the jurors.\" Id. at 513-14 (footnote omitted). It concluded: \"In short, he is far more 'conversant with the factors relevant to the determination' than any reviewing court can possibly be.\" Id. at 514 (quoting Wade, 336 U.S. at 689).\n\nThe Arizona lesson is completely lost on the court majority. The majority not only fails to accord deference to the state trial court's decision. It affirmatively takes its seat on the state trial bench. The majority makes a series of evidentiary decisions that are quintessentially within the discretion of a state trial Judge. First it finds that the disputed photographs were relevant, largely cumulative, and admissible. Then it weighs the effect of the photographs on the jury and deems any resulting prejudice insufficient to support a mistrial. Next it sifts through the admitted and unadmitted photo sets, dismissing the possibility that the jury could have been confused or misled by the close-up photographs, even though the jury viewed them without the benefit of explanatory testimony and even though the unadmitted photographs appear to depict blood spots that were not evident on the properly admitted photographs.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nThe majority's review of every item of evidence is exacting and meticulous. It describes twelve photographs, five that were admitted and the seven that were not, in great detail. For instance, the majority's abbreviated description of four of the five admitted photographs is as follows: They were \"taken from near Highway 32, the public roadway in front of the Silvers' mobile home, from the left-hand side of the mobile home . . . All of them show the same three pieces of yellow tape in the foreground -- the closest two pieces are circular in shape, one to the left and one to the right, and one strand of yellow tape is behind the two circular pieces and a few feet closer to the mobile home.\" The majority applies the same degree of scrutiny to the unadmitted pictures: \"four of [the photographs in Set 1], Exhibits 10, 17, 18 and 19, are close-ups of the three pieces of yellow tape: Exhibit 10 shows a close-up of the circular piece of tape on the left of the photographs in Set 2; Exhibit 17 is a close-up of the two circular pieces of tape shown in the photographs in Set 2; Exhibit 18 is a close-up of the strand of tape behind the two circles of yellow tape in the photographs in Set 2; and Exhibit 19 is a photograph of the circle of tape on the right in the photographs in Set 2. These photographs show red spots within or near the areas marked with the yellow tape more clearly than the photographs in Set 2.\" In addition, the majority dissects -- quoting at length and assessing its meaning -- the testimony of Officer Counts, the witness who used the unadmitted photographs to refresh his memory about the crime scene, which he then described for the jury. The state trial, in sum, is rerun in excruciating detail.\n\nThis conscientious review of the evidence in all its detail is the majority opinion's strength. Ironically, the very elaborateness of its review reveals a far more fundamental weakness -- namely, the complete transposition of appropriate judicial roles and functions. See Gilliam, 61 F.3d at 1089 (Luttig, J., Dissenting). That a federal habeas court would be reweighing the minutiae of state evidence in this en banc proceeding, devoting months of hindsight to a judgment a state trial court was required to make on the spot, is nothing short of astonishing.\n\nAnd the lack of deference does not end with the trial court's view of the matter of evidence. The majority finds further fault with the trial Judge's explanation of his mistrial decision and his consideration of alternatives to mistrial. Among its complaints, the majority notes that the trial Judge failed to grant defense counsel's request to ask further questions of the jurors, refused to determine if the photographs had been authenticated, refused to rule on the admissibility of the photographs, failed to exhibit proper sensitivity for double jeopardy concerns, and \"ignored an obvious and adequate alternative to the grant of a mistrial.\"\n\nThis exacting review of the state court's decision totally eviscerates Arizona. The majority applies strict scrutiny to a decision which Arizona emphasizes is \"entitled to great deference.\" 434 U.S. at 514; see also Gilliam, 61 F.3d at 1084-86 (Niemeyer, J., Dissenting). The trial Judge -- who observed the jury, the litigants, and the witnesses face-to-face -- was in a far better position than this court to assess the effects of the jury's exposure to unadmitted close-up crime scene photographs. Arizona, 434 U.S. at 510-16; United States v. Treas-Wilson, 3 F.3d 1406, 1410 (10th Cir. 1993), cert. denied, 114 S. Ct. 739 (1994) (evidentiary rulings regarding crime scene photographs rarely disturbed on appeal). The majority's demand that the trial Judge engage in extended debate with defense counsel and articulate reasons for rejecting alternatives to a mistrial is flatly contrary to the teachings of Arizona. There, the Supreme Court found that manifest necessity existed even though the mistrial was not \"necessary\" in a strict sense, the trial Judge did not make any finding of manifest necessity, and other trial Judges would not have declared a mistrial given the same factual circumstances. 434 U.S. at 511, 516-17; see also Abdi v. State of Georgia, 744 F.2d 1500, 1504 (11th Cir. 1984), cert. denied, 471 U.S. 1006, 85 L. Ed. 2d 164, 105 S. Ct. 1871 (1985); Cherry v. Director, State Board of Corrections, 635 F.2d 414, 418-19 (5th Cir.), cert. denied, 454 U.S. 840, 70 L. Ed. 2d 124, 102 S. Ct. 150 (1981).\n\nAlthough the majority second-guesses the state trial Judge no less than one dozen times, his mistrial declaration was fully justified. On the day the trial Judge was faced with what he viewed to be a serious breach of the evidentiary admissions process, he knew that the jury, \"because of the actions of defense counsel,\" had examined close-up crime scene photographs that were never offered or admitted into evidence. (Denial of Motion to Dismiss Indictment). The Judge also knew that some of the unadmitted pictures showed tire tracks and others showed possible blood spots that were not easily discernable in the admitted photographs. Because many of the unadmitted pictures were close-ups, moreover, it was difficult to determine the location of scenes depicted in the photographs. These photographs were shown to the jury in the early stages of a trial in which the location of the parties and the injuries they sustained promised to be sources of controversy -- the defendants evidently intended to raise the defenses of provocation or self-defense.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe majority mistakes the trial Judge's firm handling of this matter for precipitate action. The trial Judge was obviously concerned that the jury's exposure to unadmitted photographs of the murder scene constituted a threat to the integrity of the trial proceedings. See Gilliam, 61 F.3d at 1085 (Niemeyer, J., Dissenting). Forced to resolve what he termed a \"dilemma,\" the Judge invited argument from the litigants because, as he said, he \"wanted to hear everybody fully on this issue before I make a decision.\" Although the defendants claim that the trial Judge failed to consider their arguments, the record reflects otherwise. Defense counsel contested whether the jurors actually saw the photographs and suggested that they were properly identified. The Judge considered these assertions but, after he consulted his own \"detailed notes\" and heard the jury foreman twice confirm that the jurors had viewed the photographs, he disagreed with the defense.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e It is true that the Judge prevented defense counsel from interrupting the Judge's colloquy with the jury foreman, but this action was hardly unreasonable. Finally, once the Judge knew that the jury had reviewed the unadmitted photographs, it was within his discretion to conclude that the available remedies could not retrospectively correct the problem; recalling a witness or issuing a curative instruction always runs a risk, as the Judge noted, of compounding the difficulty by calling special attention to the earlier error or distorting the significance of particular items of evidence.\n\nThe trial Judge was also rightly concerned that defense counsel was responsible for the jury's exposure to these photographs. Although there is no \"mechanical formula by which to Judge the propriety of declaring a mistrial,\" Somerville, 410 U.S. at 462, many courts have recognized that a variety of defense errors that provoke a mistrial should not bar a retrial even though the defendant objects to the mistrial. United States v. Simonetti, 998 F.2d 39, 42 (1st Cir. 1993) (defense attorney's conflict of interest in representing defendant created manifest necessity for mistrial); Thomas v. Municipal Court of Antelope Valley J.D., 878 F.2d 285, 290 (9th Cir. 1989) (defendant's failure to waive conflict of interest created manifest necessity for mistrial); United States v. Shaw, 829 F.2d 714, 719-20 (9th Cir. 1987), cert. denied, 485 U.S. 1022, 99 L. Ed. 2d 892, 108 S. Ct. 1577 (1988) (defense counsel's opening remarks that potentially provoked juror bias created manifest necessity for mistrial); Abdi, 744 F.2d at 1502-04 (defense counsel's improper cross-examination of prosecution witness created manifest necessity for mistrial); United States v. Willis , 647 F.2d 54, 59 (9th Cir. 1981) (defendant's failure to appear for trial created manifest necessity for mistrial). The reason for treating defense error that provokes a mistrial in this manner is clear. In such situations, a trial Judge may understandably be concerned that the defense is seeking either to gain the benefit of the error, or to provoke the declaration of a mistrial in the hope of barring reprosecution. See Arizona, 434 U.S. at 512-13.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nAgain: the trial Judge was faced with nothing less than a threat to the integrity of trial proceedings. As he said: \"The twelve jurors had seen and touched physical evidence not properly admitted.\" The Judge's mistrial declaration responded to this breach of the evidentiary admissions process -- a process that ensures a proper foundation for the introduction of evidence and provides notice to all trial participants and appellate courts of what is appropriately before the ultimate trier of fact. And it was defense counsel that compromised the evidentiary process. The Judge here sought to do no more than gain control of his courtroom; a trial Judge should not be placed in the position of having to make a formal finding of attorney bad faith or initiate sanctions or contempt proceedings in order to have his decisions sustained. It was enough for the court not to countenance a trial where important evidence inexplicably made its way before the jury. It was sufficient to say what the trial Judge said here: it \"would be unfair, unjust and improper\" to \"reward defendants by granting their Motion to Dismiss\" the second prosecution.\n\nIt is no wonder that under these circumstances Chief Justice Rehnquist, considering the state's stay application as Circuit Justice, delivered what can only be described as a shot across our bow: \"the trial court's judgment about the necessity [for a mistrial] is entitled to great deference, never more so than when the judgment is based on an evaluation of such factors as the admissibility of evidence, any prejudice caused by the introduction of such evidence, and the court's familiarity with the jurors.\" Foster v. Gilliam, 132 L. Ed. 2d 883, 116 S. Ct. 1, 2 (1995) (Rehnquist, Circuit Justice) (citing Arizona, 434 U.S. at 513-14). With respect, I suggest that the majority has failed to heed what was plainly stated in the Arizona decision and plainly reinforced in the prior stay proceedings in this case.\n\nThis decision will reverberate far beyond the circumstances of this single case. The ability of state Judges to declare mistrials in response to trial errors will be undermined. The strict scrutiny applied to the trial Judge's decision here signals that habeas courts may appropriate for themselves the discretionary judgments normally reserved to state trial courts. The predictable result is that state Judges will be forced to tolerate errors in their own proceedings, particularly those caused by the defense. Arizona itself warned against the dangers of such a development: \"The interest in orderly, impartial procedure would be impaired if [the trial Judge] were deterred from exercising [the power to declare mistrials] by a concern that any time a reviewing court disagreed with his assessment of the trial situation a retrial would automatically be barred.\" 434 U.S. at 513. The state trial bench may not be willing to bear the costs now associated with the declaration of a mistrial: interruption of state criminal proceedings to permit months of collateral litigation on the propriety of the mistrial declaration; a stay of state proceedings; injunction of a state criminal trial; and, potentially, placing \"the accused irrevocably beyond the reach of further prosecution.\" United States v. Tateo, 377 U.S. 463, 466, 12 L. Ed. 2d 448, 84 S. Ct. 1587 (1964). It bears repeating that there is a larger public interest in these proceedings -- \"the public's interest in fair trials designed to end in just judgments,\" Wade, 336 U.S. at 689 -- one which is not served by windfall dismissals of a murder prosecution due to defense counsel's own mistake.\n\nIII.\n\nIt is no coincidence that Justice Hugo Black was at once a great advocate of incorporating the guarantees of the Bill of Rights against the states and the author of the Younger v. Harris decision. There is no contradiction in these dual positions. The state courts are obliged to respect federal constitutional guarantees, but the federal courts are equally obliged to respect state trial proceedings. For the reasons expressed above, I believe the majority has impaired the balance so essential to the proper functioning of our criminal Justice system. It was this balance that Justice Black referred to as Our Federalism.\n\nI would remand this case to the district court with directions to dismiss the petition.\n\nJudge Russell, Judge Widener, Judge Niemeyer, and Judge Luttig join in this Dissent.\n\nNIEMEYER, Circuit Judge, Dissenting:\n\nI share Judge Wilkinson's and Judge Luttig's concern that the majority today \"cut Younger at its core,\" supra at 55, by intervening in an ongoing criminal trial--where the state's interest in being free from federal intervention is at its zenith, see infra at 80 n.3 (describing \"debacle that has ensued since our initial intrusion into the affairs of South Carolina\"). As I expressed in my earlier Dissent in this case, the majority's decision is \"a bold affront to the principles of comity and federalism.\" Gilliam v. Foster, 61 F.3d 1070, 1084 (4th Cir. 1995) (en banc).\n\nAs important to my decision to Dissent, however, is my belief that the majority opinion, by mechanically applying judicial formulations, has distorted the Double Jeopardy Clause's historically recognized protections. I would hold that absent any indication of prosecutorial misconduct or judicial overreaching on behalf of the prosecution, the Double Jeopardy Clause permits the state one complete trial to convict those it accuses of crime. While I agree with Judges Wilkinson and Luttig that \"manifest necessity\" existed for the state trial Judge's decision to grant a mistrial, I do not agree with their suggestion that prejudice, to any extent, is required for finding \"manifest necessity.\"\n\nI\n\nIn this case, the state trial Judge aborted petitioners' murder trial on its third day after discovering that the jury had, through defense counsel's neglect, viewed several photographs that had been neither offered nor admitted into evidence. The mistrial was in no way attributed to any prosecutorial misconduct. Because he could not at the time guess whether either party would offer the photographs into evidence, the trial Judge felt compelled to declare a mistrial to ensure a \"fair and proper\" trial.\n\nAt the threshold of their retrial, however, petitioners moved to dismiss the charges against them on double jeopardy grounds. The state trial Judge denied petitioners' motion and the Supreme Court of South Carolina dismissed their appeal as interlocutory. On petition for the writ of habeas corpus, the federal district court refused to enjoin petitioners' second trial. But after a divided panel of this court affirmed, the full court, sitting en banc, directed the district court to grant an injunction and consider the merits of the habeas petition. See Gilliam, 61 F.3d at 1074. Reversing its field, the district court then granted the writ. This appeal followed.\n\nNow, on rehearing en banc, the majority have voted to affirm the district court, concluding that the state trial Judge abused his discretion in declaring the mistrial. By affirming the issuance of the habeas writ, the majority have (1) overruled the trial Judge's discretionary rulings on evidence and the conduct of trial; (2) denied the State of South Carolina one complete trial of petitioners notwithstanding the absence of any prosecutorial or judicial misconduct; and (3) ordered released into the public three individuals accused of murder. I cannot agree that the Double Jeopardy Clause dictates such unseemly results.\n\nII\n\nThe Supreme Court has recognized that the constitutional protection against being \"twice put in jeopardy of life or limb\" for \"the same offense,\" U.S. Const. amend. V, is \"rooted in history\" and \"is not an evolving concept.\" Gore v. United States, 357 U.S. 386, 392, 2 L. Ed. 2d 1405, 78 S. Ct. 1280 (1958). The Double Jeopardy Clause, as included in the Bill of Rights, was actually a redraft of James Madison's initial formulation-- \"No person shall be subject, except in cases of impeachment, to more than one punishment or one trial for the same offence . .. .\" Sources of Our Liberties 422 (Richard L. Perry \u0026 John C. Cooper eds. 1991). But its framers intended for the Clause only to declare the law as it stood at the time and to guarantee the protections established by the common law. See United States v. Jenkins, 490 F.2d 868, 873 (2d Cir. 1973), aff'd, 420 U.S. 358, 43 L. Ed. 2d 250, 95 S. Ct. 1006 (1975); Joseph Story, Commentaries on the Constitution of the United States ยง 930 (Roland D. Rotunda \u0026 John E. Nowak eds. 1987).\n\nThose common law protections were well known. According to Blackstone, they emanated from four pleas in bar: autrefois acquit (former acquittal), autrefois convict (former conviction), autrefois attaint (former attainder), and pardon. 4 Sir William Blackstone, Commentaries on the Laws of England ยงยง 377-81. The Double Jeopardy Clause, therefore, shields defendants from multiple trials and multiple punishments for the same criminal offense. As a corollary, however, the state is entitled, absent misconduct by the prosecution or the trial Judge on behalf of the prosecution, to one complete trial, and if the defendant is convicted, one punishment. Cf. Illinois v. Somerville, 410 U.S. 458, 463, 35 L. Ed. 2d 425, 93 S. Ct. 1066 (1973) (\"the interests of the public in seeing that a criminal prosecution proceed to verdict . . . need not be forsaken by the formulation or application of rigid[double jeopardy] rules\").\n\nThus understood, the Double Jeopardy Clause serves its important purpose: to prevent \"the State with all its resources and power [from] making repeated attempts to convict an individual for an alleged offense, thereby subjecting him to embarrassment, expense and ordeal and compelling him to live in a continued state of anxiety and insecurity, as well as enhancing the possibility that even though innocent he may be found guilty.\" United States v. DiFrancesco, 449 U.S. 117, 127-28, 66 L. Ed. 2d 328, 101 S. Ct. 426 (1980) (quoting Green v. United States , 355 U.S. 184, 187-88, 2 L. Ed. 2d 199, 78 S. Ct. 221 (1957)). But where defense counsel neglect precipitates a mistrial and there is no suggestion of prosecutorial misconduct or judicial overreaching in support of the prosecution's effort to convict, the concerns that underlie the Double Jeopardy Clause are not triggered.\n\nUnfortunately, without finding any such prosecutorial or judicial misconduct in this case, the majority deny the South Carolina prosecutors even one complete trial to bring petitioners to Justice. They do so by rigidly applying the \"manifest necessity\" principle and overlooking that principle's limitations. See United States v. Perez, 22 U.S. (9 Wheat.) 579, 580, 6 L. Ed. 165 (1824). In Perez, the defendant was subjected to a jury trial, but the jury was unable to agree on a verdict. In holding that the Double Jeopardy Clause did not bar a retrial, Justice Story stated, \"the prisoner has not been convicted or acquitted, and may again be put upon his defence.\" Id. He explained that courts may discharge juries from rendering verdicts when there is a \"manifest necessity\" for doing so \"or the ends of public Justice would otherwise be defeated.\" Id. And in allowing the defendant to be retried, the Perez Court deferred to the \"sound discretion\" of the trial Judge. Id. Yielding to trial Judges' discretion in determining when \"manifest necessity\" exists remains the double jeopardy jurisprudence. See Arizona v. Washington, 434 U.S. 497, 514, 54 L. Ed. 2d 717, 98 S. Ct. 824 (1978).\n\nIII\n\nThere is no allegation of misconduct by the prosecution or trial Judge in the case sub judice. Indeed, defense counsel was responsible for creating the situation that caused the state Judge to declare a mistrial in the interest of ensuring a \"fair and proper\" trial. Like a reprosecution after a hung jury, petitioners' retrial here would not implicate the interests that the Double Jeopardy Clause was historically designed to secure. I conclude, therefore, that the public interest demands and the Double Jeopardy Clause permits one complete trial for these three petitioners charged with murder.\n\nI am authorized to say that Judge Widener joins in this opinion.\n\nLUTTIG, Circuit Judge, Dissenting:\n\nThe Chief Justice, in denying the State's belated stay application filed in August, admonished our court in language whose import is unmistakable, that under Arizona v. Washington, 434 U.S. 497, 54 L. Ed. 2d 717, 98 S. Ct. 824 (1978), a trial court's determination of manifest necessity is never entitled to greater deference than where, as in this case, \"the judgment is based on an evaluation of such factors as the admissibility of evidence, any prejudice caused by the introduction of such evidence, and the trial court's familiarity with the jurors.\" Foster v. Gilliam, 132 L. Ed. 2d 883, 116 S. Ct. 1, 2 (1995) (Rehnquist, Circuit Justice). This admonition, of course, was merely a reaffirmation of Justice Stevens' observation on behalf of the full Court in Arizona, 434 U.S. at 513-14 \u0026 n.33 (1978) (quoting Wade v. Hunter, 336 U.S. 684, 687, 93 L. Ed. 974, 69 S. Ct. 834 (1949) (emphasis added)), that,\n\nthere are compelling institutional considerations militating in favor of appellate deference to the trial Judge's evaluation of the significance of possible juror bias. He has seen and heard the jurors during their voir dire examination. He is the Judge most familiar with the evidence and the background of the case on trial. He has listened to the tone of the argument as it was delivered and has observed the apparent reaction of the jurors. In short, he is far more 'conversant with the factors relevant to the determination' than any reviewing court possibly can be.\n\nThese considerations must be at least as weighty where a federal court, in considering a state prisoner's collateral challenge to his conviction on the ground that it violated the Double Jeopardy Clause, reviews the determination of a state trial Judge as to juror bias.\n\nSee Foster v. Gilliam, 116 S. Ct. at 2 (citing Arizona, 434 U.S. at 51-14).\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e In confident disregard of the Chief Justice and the Court -- indeed, without even a mention of the Chief Justice's admonition -- the majority today completes the wholesale substitution of its judgment for that of the state trial Judge, on what the Chief Justice pointedly explained is the quintessential discretionary matter of whether the jury was potentially prejudiced by viewing the unadmitted crime scene photographs placed before it by defense counsel.\n\nI.\n\nThe majority, as an appellate court in habeas , has literally sat down with some 26 individual photographs of the crime scene, compared them one with another, and without any familiarity with the evidence in the case, any understanding of the jurors, or any knowledge of either the prosecutorial or defense trial strategies, found as a matter of fact that the unadmitted photographs seen by the jury were not unduly prejudicial. This, despite a contrary finding by both the state trial Judge, who knew the jury and the evidence, and the federal district court (before it was instructed by the en banc court to find otherwise),\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e and despite the express and repeated concession of prejudice even by defense counsel. The extent to which the majority has completely usurped the role of the state trial court, see Arizona, 434 U.S. at 513-14, is apparent throughout its opinion, but perhaps is illustrated best in the following passages, which constitute the essential reasoning underlying its finding that no prejudice arose by virtue of the jury having seen the unadmitted crime scene photographs:\n\nThe photographs referred to as Set 2 included Exhibits 8, 12, 13, 14, and 16. The photographs referred to as Set 1-Exhibits 9, 10, 11, 15, 17, 18, and 19 -- were not offered into evidence.\n\nA description of these photographs and a comparison of the photographs included in Set 1 vis-a-vis those in Set 2 is instructive. The photographs in Set 2, with the exception of Exhibit 16, are identical in every material aspect and show the area outside the Silvers' mobile home. Each of these photographs was taken from near Highway 32, the public roadway in front of the Silvers' mobile home, from the lefthand side of the mobile home and looking down the driveway toward it. The mobile home and the adjacent yard and driveway are shown in the background of these photographs, and all of them show the same three pieces of yellow tape in the foreground -- the closest two pieces are circular in shape, one to the left and one to the right, and one strand of yellow tape is behind the two circular pieces and a few feet closer to the mobile home. The remaining photograph in Set 2, Exhibit 16, shows the same location, but reveals only the circular piece of tape to the right and one-half of the circular piece to the left.\n\nOf the seven photographs in Set 1, four of them, Exhibits 10, 17, 18, and 19, are close-ups of the three pieces of yellow tape: Exhibit 10 shows a close-up of the circular piece of tape on the left of the photographs in Set 2; Exhibit 17 is a close-up of the two circular pieces of tape shown in photographs in Set 2; Exhibit 18 is a close-up of the strand of tape behind the two circles of yellow tape in the photographs in Set 2; and Exhibit 19 is a photograph of the circle of tape on the right in the photographs in Set 2. These photographs show red spots within or near the areas marked with the yellow tape more clearly than the photographs in Set 2. Exhibit 15 is virtually identical to those in Set 2, taken from the same camera angle and depicting all three pieces of yellow tape. The two remaining photographs in Set 1, Exhibits 9 and 11, reveal the same three pieces of tape, but were taken from approximately the opposite location from those in Set 2; in other words, they are taken from near the mobile home facing up the driveway and toward Highway 32. These latter two photographs depict more clearly the same tire tracks shown in the photographs in Set 2.\n\nAnte at 7-8, 27-28, 32. From these passages, the substance and detail of which do not appear in any state or federal opinion other than ours, it is evident that the majority's utter disregard of Arizona (and Younger v. Harris, 401 U.S. 37, 27 L. Ed. 2d 669, 91 S. Ct. 746 (1971)), is no different from the Ninth Circuit's disregard of United States v. Perez, 22 U.S. (9 Wheat.) 579, 6 L. Ed. 165 (1824), in United States v. Sanford, 536 F.2d 871 (9th Cir.), rev'd per curiam, 429 U.S. 14 (1976). And the ultimate Disposition of this matter should be no different. The majority's error under Arizona and Younger is plain, and full review will reveal nothing more about the unadmitted photographs at issue and their potential to prejudice the jury than we know now. As in Arizona, the Conclusion is inescapable -- that only the trial court could possibly assess the potential impact of these photographs on the jury that sat in Newberry, South Carolina. Additionally, it would be difficult to imagine a case wherein the disruption to the state proceedings caused by a federal appellate court could be any greater.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nII.\n\nThere are only two assertions in the entire majority opinion that, if they were not demonstrably wrong, might at least suggest that the Disposition of this case is not directly controlled by Arizona.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nA.\n\nFirst, the majority states repeatedly that the trial court acted \"precipitately,\" making no findings that would possibly support a mistrial:\n\nAt no point did the state trial Judge indicate that double jeopardy concerns were implicated by the grant of a mistrial. And, neither [did] the state trial Judge indicate[] that the photographs were in any way prejudicial to the prosecution or the defense.\n\nThe state trial Judge did not make a finding of manifest necessity or a finding of prejudice. Indeed, he did not use the word \"prejudice\" during this proceeding. Further, the state trial Judge gave no hint of what prejudice might possibly exist such that a reviewing court could conclude that prejudice resulted from the jury's viewing the photographs in Set 1.\n\nThe state trial Judge . . . made no finding that the impartiality of the jury had been, or may have been, affected by viewing the photographs in dispute.\n\nAnte at 10 \u0026 n.6, 35. This assertion is possible only through artificially focusing upon the trial court's colloquy with counsel when the mistrial was granted, to the complete exclusion of the trial court's extensive explanation of the reasons it granted the mistrial, which appear in its subsequent opinion and order denying Defendants' Motion to Dismiss. See J.A. at 35-41.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nIn that opinion and order, which I include as an appendix because it reflects the seriousness and thoroughness with which the mistrial motion was addressed, the trial court explained what the majority concedes was the court's reasoning at the time it granted the mistrial, see ante at 34 n.25, that it had been \"gravely\" concerned about the \"prejudicial occurrence\" of the jury having reviewed unadmitted photographs of the murder scene. Id. at 30-31. The court identified the problem that it had confronted when it learned of this occurrence, namely, that it could not foresee whether the photographs, even if ultimately offered into evidence, would have been admitted under Fed. R. Evid. 403. J.A. at 36.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e It then reminded the parties that the court had been so concerned that it had \"brought[the dilemma] to the attention of the litigants for a hearing as to how best then to proceed,\" and \"allowed all counsel in the matter 'full opportunity to explain their positions'.\" Id. at 37-38. The court outlined the steps that it had taken to ensure that the jury had in fact reviewed the unadmitted crime scene photographs, including interrogating the jury foreman and the court reporter in open court. Id. at 37-38. And it emphasized that it had considered, as an alternative to a mistrial, a curative instruction, but concluded that such an instruction \"would simply highlight and compound the error already existent.\" Id. at 38. As the court observed, \"this was not merely an opening statement by an adversary that could have been cured by any instruction of the court.\" Id. at 39-40.\n\nThe court then noted that, although an explicit finding of manifest necessity is not required under Arizona, in the court's view an \"implicit finding of manifest necessity existed\" in the court's expression of grave concern over the \"origin of the prejudice as well as the extent of the publication [of the unadmitted photographs] to the jury.\" Id. at 39. Finally, the court pointed out that more than just \"manifest necessity\" had justified the mistrial, because to have granted the defendants' motion to dismiss would have been to \"reward\" them for their own negligent action in allowing the photographs to be seen by the jury. Id. at 40. In language that captures perfectly the rationale underlying the \"special respect\" that the Supreme Court has said must be accorded the trial courts in determinations such as these, the court concluded by saying that it would not \"second guess\" what \"it [had] observed, heard and felt at the time of its . . . ruling.\" Id. at 40-41.\n\nThe majority's holding notwithstanding, ante at 32-34, this deliberate consideration by the trial court, which again, as the majority concedes, ante at 34 n.25, mirrors the deliberate consideration by the trial court at the time the mistrial was granted, is not even arguably \"precipitous,\" \"irrational,\" or \"irresponsible,\" see Arizona, 434 U.S. at 514.\n\nB.\n\nThe majority's second assertion is that the State's only argument of prejudice is that the Set 1 photographs had not been formally admitted and properly authenticated. See ante at 24-28, 24 n.19. Like its first assertion, this, too, is flatly wrong. The State does argue that the unadmitted photographs were not properly authenticated, but that is not its only, or even its principal, argument. The State has explained throughout these proceedings that the unadmitted photographs differed from the admitted photographs and prejudiced the State in two significant ways.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nFirst, the unadmitted photographs are the only close-ups of the scene and the only photographs from which it is possible to discern the presence of blood or a blood-like substance.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e And, as both parties concede, the presence or absence of blood at this precise location is central to the case, given the defenses of provocation and self-defense. The defense counsel candidly admitted that it was for this reason that the photographs were important to the defense. Second, the State has consistently maintained that the unadmitted photographs show more clearly than the admitted photographs, the tire tracks that are believed to have been made by Gilliam's truck, thus confirming whether the truck was on or off decedent's property at the time of the crime.\n\nAt oral argument before the panel on the original motion to stay the state trial, the State argued as follows:\n\nTHE STATE: When I look at the [admitted] photographs I do not see the stain [that appears to be blood-- the unadmitted photographs did show this stain].\n\nTHE STATE: The presence of the stains might be relevant to the case because it would reveal the -- who shot first and where they shot, to the extent that Mr. Gilliam was injured at the scene and shooting from the victim's area. Where he was bleeding and where blood would be located and the amount of blood would be located would assist in making a determination whether Mr. Gilliam had a duty to retreat, to act in self-defense, join in the self-defense of Mr. Swain's action. He may have been coming to his defense. And whether the . . . victim was securing his property, whether he had the ability to defend his habitat at the time from intruders. Those are both factual questions that the jury may have been presented with . . . .\n\nTHE STATE: . . . You see the rust area . . . in the [admitted] photographs, but the red spots [that appear to be blood] do not appear to show up in any of the other photographs from my study of the photographs.\n\nTranscript of Oral Argument, July 15, 1995, at 9-10, 51.\n\nSimilarly, in its brief before the en banc court on the merits, the State argued,\n\n[a] review of the photographs reveals the existence of various \"red dots.\" The Petitioners now concede that whether the blurs represented blood was a critical fact, although the testimony of Officer Counts was essentially that he lacked the knowledge or expertise to state that the \"dots\" were blood. Although the defense concedes that at the time of the trial it had not subjected the photographs to such a test, it still asserts that it was relevant as representing Gilliam's blood. Under the evidence presented at the time of the trial, the location of Gilliam at the time of the shooting was in dispute with some witnesses placing him in the yard of the deceased and others placing him on the roadway. Similarly the questioned photographs showing tire tracks not represented in the admitted photographs touched uniquely (and possibly confusingly) on the location of [Gilliam's] truck.\n\nAppellants Br. at 34-35 (footnote omitted). And, at oral argument before the en banc court, the prosecution again explained the prejudice that resulted from the jury seeing the unadmitted photographs:\n\nTHE STATE: . . . [Defense] counsel Price in the testimony before the State, in the habeas corpus hearing, testified that these photographs could lead to jury confusion. Betty Strom, the prosecutor, testified that they could lead to jury confusion because they reveal the red dots which are not revealed in the admitted photographs.\n\nTHE COURT: What is the taint now?\n\nTHE STATE: The taint was that the jury got information that had never been revealed to them.\n\nTHE COURT: The photographs were little different, were they not?\n\nTHE STATE: Yes, sir. They were very different.\n\nTranscript of Oral Argument, September 26, 1995.\n\nIf there were any doubt about the potential prejudice of the unadmitted photographs, defense counsels ' repeated, candid concessions lay it to rest; in fact, throughout these proceedings, the defense has quite articulately described the prejudice to the State. At the hearing before the federal district court, defense counsel testified as follows:\n\nA. [Defense counsel] The question is what is useful about the unadmitted photographs which was helpful to the defense, is that it?\n\nQ. [The State, cross-examining] Yes, sir.\n\nA. [Defense counsel] . . . Part of photo set one [the unadmitted photographs] is a close-up that shows a red substance that would appear to be blood.\n\nQ. [The State] And it shows a number of spots, as you already conceded, that is not evident in any other photographs which were introduced; is that correct?\n\nA. [Defense counsel] There are some red spots that are hard to see in admitted exhibit 12 of photo 2. . . . Clearly they are easier to see in the unadmitted number 10.\n\nQ. [The State] If you didn't know [that the blood] was there . . . ?\n\nA. [Defense counsel] It would be difficult to see the blood. . . .\n\nA. [Defense counsel] I spent a lot of time with these getting ready for this trial. It could be argued that a jury would be confused if we had both sets. It could be argued that they would be confused if they had only one set.\n\nQ. [The State] Why would [unadmitted] defendant's exhibit 9 be of use to the defense in this case?\n\nA. [Defense counsel] Well, it would show for the purposes of the defense that there were tire tracks and why weren't they analyzed for purposes of argument.\n\nA. [Defense counsel] [Unadmitted exhibit 15 would be relevant because] it would depict the area of the driveway where the mud puddle is. There had been earlier testimony as to how close this truck had driven up to the trailer. We can see these two trees that become landmarks in the testimony in the development of the crime scene.\n\nQ. [The State] Why would that have been useful in the defense in this case . . . ?\n\nA. [Defense counsel] The state's position was that the defendants had been on the property of the decedent and it was necessary to show exactly where the truck had parked. The way that was to be done was the blood that was coming from defendant Gilliam would be located in the area where he got in the truck.\n\nA. [Defense counsel] . . . The location of the truck is relevant. My client was standing behind the truck. She got into the truck when the parties fled the scene.\n\nQ. [The State] . . . Your statements about [unadmitted] exhibits 17, 18 and 19 are that they reveal the blood droppings that are not represented or evident in the other photographs; is that correct?\n\nA. [Defense counsel] It shows them clearer and more precise than in the others.\n\nA. [Defense counsel] There are some admitted photographs that it would be very difficult to see the red dots within the circle of the yellow tape, yes.\n\nQ. [The State] Then you concede that the blood like substance, if it was able to be seen from any of the photographs was only able to be seen in the admitted photographs in one photograph; is that correct?\n\nA. [Defense counsel] On the copies that I am looking at, I have trouble finding it in other than one.\n\nJ.A. at 324-34. Likewise, at oral argument before the en banc court, defense counsel explained:\n\nTHE COURT: Then tell me how the introduction of those photographs were intended by you to influence the jury to acquit your defendants.\n\nDEFENSE COUNSEL: Those photographs were to corroborate the testimony of [Officer Counts] when he came down here and drew on this diagram in front of the jury and showed them where the blood was found. That's relevant as to where Mr. Gilliam was when he was shot.\n\nTHE COURT: Without the corroboration, your case was not as strong. The degree to which, we don't need to decide. It was not as strong.\n\nDEFENSE COUNSEL: Certainly, the corroboration strengthens our case.\n\nTHE COURT: And thereby prejudices to some extent the government's case.\n\nDEFENSE COUNSEL: If you're using prejudice in the sense of does it support one side or the other.\n\nTHE COURT: Well, of course.\n\nDEFENSE COUNSEL: Then all evidence is prejudicial to either side and in that sense I would say \"yes, it was prejudicial,\" just as the photographs in sets two and three were. Just as all the evidence that the state introduced against us theoretically prejudiced our case.\n\nTranscript of Oral Argument, September 26, 1995.\n\nIndeed, in my view, no one examining the unadmitted Set 1 photographs and the admitted Set 2 photographs could fail to appreciate the enormous significance (or, at the very least, the enormous potential significance) of the Set 1 photographs, given that the precise location of Gilliam's truck and of Gilliam himself when he was shot in the foot by the decedent are central to, if not dispositive of, the defendants' guilt. As the defense concedes, the Set 1 photographs all but confirm the existence of tire tracks at the location, whereas it is difficult (if not impossible) to confirm from the Set 2 photographs that the same markings are in fact tire tracks. Most important, the Set 1 photographs all but confirm the presence of a significant amount of blood (or a blood-like substance) at the location depicted in the photographs, whereas it is virtually impossible to infer even the presence of blood, much less a large quantity of blood, from the Set 2 photographs. In sum, the Set 1 photographs are not \"just\" close-ups of the same area depicted in the Set 2 photographs, as the majority would have one believe; they are the only photographs that depict the information that both parties agree is absolutely critical to the case.\n\nEven the federal district court that granted the writ of habeas corpus that we are now reviewing specifically found that, although the photographs were not \"unfairly prejudicial,\" they \"may have been 'prejudicial' to the State in the sense that they may have supported the Defendants' defenses of self-defense or provocation.\" J.A. at 505. As that court explained when it initially denied the writ, and before we effectively directed it to hold otherwise,\n\nit is now apparent that the disputed photographs were more important than might first appear. From the argument of counsel at the hearing, the court was able to determine that the murder victim in this case had himself fired shots at one of the Defendants shortly before or contemporaneously with the shot by which he was killed. Therefore, issues of provocation and self-defense are present in this case. One factor that is important in resolving these issues is whether one of the Defendants was on the decedent's property or on the public roadway at the time he fired his weapon. The disputed photographs are close up photographs of the ground which show blood stains. Because of this, they could be used to more clearly document where the shooting occurred.\n\nJ.A. at 211; see also supra note 2.\n\nTellingly, even the majority must acknowledge the potential prejudice that inhered in the unadmitted photographs: \"These photographs . . . were relevant [and] material. . . . These photographs show red spots within the areas marked with the yellow tape more clearly than the photographs in Set 2. . . . [The Set 1] . . . photographs [also] depict more clearly the same tire tracks shown in the photographs in Set 2.\" Ante at 2, 8. Under Arizona, this concession of prejudice is all but dispositive. For Arizona did not turn, as the majority mistakenly believes, see ante at 21, 24, 28, on the fact that the improper argument was \"highly prejudicial,\" as the Court characterized it at one point, see 434 U.S. at 515. Rather, Arizona turned on whether the error gave rise to \"possible juror bias,\" see id. at 512; see also id. at 502 n.10 (implying that \"the probability of juror prejudice\" is the relevant inquiry, not the \"certainty of prejudice\"); id. at 509 (\"significant risk that a verdict may result from pressures\"); id. at 511 (\"may have affected\") (\"possible bias\") (\"likelihood that the impartiality . . . may have been affected\"); id. at 512 (\"possibility of bias\") (\"it is possible\") (\"perhaps\") (\"possibility of bias\") (\"tends to frustrate\") (\"create a risk\"); id. at 513 (\"risk of bias\") (\"possible juror bias\").\n\nBecause the majority concedes prejudice, and thus a fortiori the possibility of jury bias, the only way it can avoid the Conclusion that the trial court unquestionably acted within its discretion is by holding (as it does) that the state trial Judge acted \"irrationally\" in not attempting to cure that prejudice. Ante at 32-34. In order to so hold, the majority creates out of whole cloth a distinction of per se legal significance between prejudice and \"unfair\" or \"undue\" prejudice (which it presumably imports from Fed. R. Evid. 403), ante at 12, 13, 16, 22, 23, 23 n.18, and then finds that the prejudice in this case was not \"unfair\" because the photographs, in its opinion, would have been admissible, ante at 2, 13-14, 22-28, 29-30, 32, 35-36.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Of course, whether or not, as a technical matter, the photographs would have been admissible or admitted, is ultimately irrelevant.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nThe relevant question is not whether the photographs would have been admissible, but rather, whether it was an abuse of discretion for the state trial court to decline to formally consider their admission after they had already been seen by the jury. Most assuredly, it was not.\n\nThe trial court had at least four obvious and sound reasons for declining to attempt this cure. First, the court was confronted with the distinct possibility that the jury had already formed impressions, if not drawn Conclusions, from the photographs -- not about some ancillary issue of little consequence, but about the critical issues of the precise locations where defendant Gilliam was shot and where his truck was parked. Given this distinct possibility, it was reasonable to decide that subsequent foundation testimony (itself an oxymoron) could not correct those unguided impressions, any more than a curative instruction could. Second, for reasons that will never be known, the defense apparently had made the tactical decision not to introduce the Set 1 photographs during Officer Counts' testimony, and the prosecution had no doubt relied upon that choice. Aware that the timing of the admission of evidence is critical to the force of that evidence, it was reasonable for the trial court to determine that it was an unacceptable alternative to require the admission of the photographs at a time when the defense had not intended to introduce them, and thereby to require the prosecution to respond to the photographs at a time when it would not otherwise have been required to respond. Third, it was reasonable for the trial court to conclude that recalling Officer Counts and considering the admission of the photographs after they had already been seen by the jury would only have highlighted their importance, increasing the potential for prejudice. J.A. at 36-37, 39-40, 93-94. But see ante at 33-34, 33 \u0026 n.19, 35. And fourth, it was clearly within the trial court's discretion to conclude that defense counsel's unauthorized placement of these crime scene photographs before the jury, together with the earlier incident of possible defense misconduct, see Discussion infra at 83 \u0026 n.14, had so far stripped the proceeding of any semblance of fairness that any attempted cure would have been meaningless.\n\nFor these reasons, the state trial court was no more required to attempt to cure the error by recalling Officer Counts and then ruling on the admissibility of the photographs (even though the majority might have done so if it were hearing the case), than the trial court in Arizona was required to give a curative instruction (even though other trial Judges might have done so if they were hearing the case). 434 U.S. at 511.\n\nIII.\n\nOnce the majority's two misconceptions about the trial court and the prosecution are corrected, it is apparent that this case is squarely controlled by Arizona and that the ultimate Disposition of the case should be a straightforward, unexceptionable application of that decision; indeed, the case for not disturbing the trial court is even stronger here.\n\nIn Arizona, there was no allegation of prosecutorial misconduct. Here, too, there was no such allegation, and in fact, the federal district court expressly found that there was no prosecutorial misconduct whatsoever, J.A. at 498, a fact that the majority ignores altogether.\n\nIn Arizona, the trial error was caused by defense counsel. 434 U.S. at 510. Here, too, and also ignored by the majority, defense counsel caused the error -- as the defense concedes and the state trial court expressly found. J.A. at 36, 89, 497.\n\nIn Arizona, the improper argument \"may have affected the impartiality of the jury.\" 434 U.S. at 511 (emphasis added). Here, too, the unadmitted crime scene photographs at the very least \"may have affected\" the jury's impartiality. See J.A. at 38.\n\nIn Arizona, the improper argument \"created a risk, often not present in the individual juror bias situation, that the entire panel may [have been] tainted.\" 434 U.S. at 512. Here, too, because the crime scene photographs were given to the entire jury, the risk was that the entire panel became biased by the photographs. J.A. at 38, 94.\n\nIn Arizona, the trial court heard argument from both sides before granting the mistrial. 434 U.S. at 515-16. Here, too, the trial court \"allowed all counsel in this matter 'full opportunity to explain their positions.'\"\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e J.A. at 38.\n\nIn Arizona, the trial court considered a curative instruction, but rejected such an instruction as inadequate to cure the improper comment. 434 U.S. at 511, 514 n.34. Here, too, the trial court considered a curative instruction, but concluded that such an instruction could not cure the effect of the jury having seen the unadmitted photographs. J.A. at 38.\n\nAnd in Arizona, the defendants did not \"attempt to demonstrate specific prejudice from the mistrial ruling, other than the harm which always accompanies retrial.\" 434 U.S. at 516 n. 35. Here, too, the only harm that the defendants allege is that \"which always accompanies retrial.\" See ante at 36.\n\nIn fact, the reasons for reversing the en banc court here (and affirming the state trial court's judgment) are even more compelling than they were in Arizona.\n\nIn Arizona, the trial court failed to articulate the reasons for declaring the mistrial. 434 U.S. at 516-17.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Here, the trial court did articulate its reasons for declaring the mistrial. J.A. at 35-41, 93-94.\n\nIn Arizona, there was no explicit finding of manifest necessity. 434 U.S. at 516. Here, the trial court found manifest necessity. J.A. at 39.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nIn Arizona, the trial court made no explicit finding of prejudice. 434 U.S. at 517 n.39. Here, the trial court made an express finding of prejudice. J.A. at 38, 39.\n\nIn Arizona, there is no suggestion that the defense acknowledged the prejudice to the government's case. Here, the defense has consistently admitted that introduction of the photographs did prejudice the government's case. See J.A. at 324-34; Transcript of Oral Argument, September 26, 1995.\n\nIn Arizona, the error was an improper opening statement. Here, as the trial Judge recognized, the jury had \"not merely [heard] an opening statement by an adversary that could have been cured by any instruction of this Court,\" it \"had seen and touched physical evidence not properly admitted.\" J.A. at 39-40.\n\nIn Arizona, defense counsel expressly argued for a curative instruction by the trial court. 434 U.S. at 514 n.34. Here, defense counsel never urged that a curative instruction be given, yet the trial court considered such an instruction sua sponte. J.A. at 87-94, 37-38.\n\nSignificantly, here, unlike in Arizona, there was evidence before the state trial court that permitted a Conclusion that defense counsel was engaged in a pattern of misconduct during this very trial.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nAnd finally, here, unlike in Arizona, the federal courts stopped an ongoing state murder trial -- literally with a witness on the stand -- on the basis of their assessment of the evidentiary significance of the crime scene photographs, in open defiance of the principles that lie at the core of Younger v. Harris.\n\nThat the state trial court in this case evidenced the grave concern that it did, J.A. at 36-40, 90-94, and in response, allowed counsel for both parties to argue their positions as to whether a mistrial should be granted, J.A. at 38-39, 90-91, 93, is probably alone sufficient to render the trial court's grant of a mistrial an exercise of \"sound discretion,\" as it was for the Supreme Court in Arizona :\n\nEvincing a concern for the possible double jeopardy consequences of an erroneous ruling, he gave both defense counsel and the prosecutor full opportunity to explain their positions on the propriety of a mistrial. We are therefore persuaded by the record that the trial Judge acted responsibly and deliberately . . . .\n\n434 U.S. at 515-16 (emphasis added).\n\nGiven the deliberate, conscientious manner in which the court in this case determined to grant the mistrial -- as evidenced by the attached detailed trial court opinion reciting the court's contemporaneous reasoning -- there can be no question that the state trial court's judgment is entitled at least to the same \"special respect\" accorded the state trial court's ruling in Arizona, which read in full :\n\nBased upon defense counsel's remarks in his opening statement concerning the Arizona Supreme Court opinion and its effect for the reasons for the new trial, the motion for mistrial will be granted.\n\nQuoted in Arizona v. Washington, 546 F.2d 829, 831 (9th Cir.), rev'd, 434 U.S. 497, 54 L. Ed. 2d 717, 98 S. Ct. 824 (1977); see also Joint Appendix, Arizona v. Washington, U.S. Supreme Court, No. 76-1168 at 271-72 (1977).\n\nArizona was written precisely to prevent our trial courts, who are \"far more 'conversant with the factors relevant to the determination' [of potential jury bias] than any reviewing court can possibly be,\" 434 U.S. at 514, from being second-guessed by appellate courts engaged in the kind of rank speculation that the majority engages in today. If Arizona means anything at all, it must mean that a federal appellate court in habeas should never find itself in the posture of comparing and contrasting individual crime scene photographs wrongfully placed before a jury by defense counsel and determining de novo whether those photographs might have been admitted and whether they might have somehow prejudiced the jury in a trial about which the appellate court knows little to nothing. As the majority so ironically, if not presciently, assures, \"if counsel were to air evidence that might tend to improperly bias the jury or adversely affect its impartiality, any reviewing court applying the teachings of Arizona v. Washington would conclude that the trial Judge acted within his discretion in granting a mistrial.\" Ante at 32.\n\nBecause, applying the teachings of Arizona, I believe that the majority is destined for reversal, if not summary reversal, I Dissent.\n\nJudges Russell, Widener, Wilkinson, and Niemeyer concur in this opinion.\n\nAPPENDIX\n\nSTATE OF SOUTH CAROLINA\n\nCOUNTY OF NEWBERRY\n\nTHE COURT OF GENERAL SESSIONS\n\nEIGHTH JUDICIAL CIRCUIT\n\nThe State, vs. James Swain, Wayland Gilliam, Jr. and Pamela Owings, Defendants.\n\nCASE NO.:\n\nAMENDED ORDER\n\nThis matter comes before me on the motion of attorneys for the three defendants captioned above, James Swain, Wayland Gilliam, Jr. and Pamela Owings. The Defendants have moved this Court pursuant to the prohibition against double jeopardy found in the Fifth Amendment to the United States Constitution and Article 1, Section 12, of the South Carolina Constitution, to dismiss the charges pressed against them in the General Sessions Court of Newberry County. All three defendants are charged with Murder and Lynching in the First Degree. Additionally, Defendant Swain, alone, is charged with Assault with Intent to Kill, and Defendant Gilliam, alone, is charged with Indecent Exposure. All of these indictments arise out of the same factual setting. Indictment 93-GS-36-70 charges Murder, Lynching and Assault with Intent to Kill and Indictment 93-GS-36-183 charges Indecent Exposure. This Court held a hearing on Tuesday, April 11, 1995, wherein counsel for the defendants and the state were present and argued their respective positions in this matter.\n\nIt must be noted at the outset that the State moved for a mistrial only after this Court brought certain matters to the attention of the parties. More specifically, this Court observed that certain physical items, namely photographs of the murder scene, had been taken by the jury and reviewed by each of the jurors without these photographs being admitted into evidence. The Defendants' argument notwithstanding, it is of no consequence whether the Defendants either inadvertently, intentionally or mistakenly allowed this activity to occur. The principle remains the same: Exhibits that had not been introduced into evidence were in fact given to the jury for their review without proper documentation and prior to being finally passed on by this Court before being admitted into evidence.\n\nThe South Carolina Supreme Court in State v. Alexander, 303 S.C. 377, 401 S.E.2d 146 (1991) adopted Federal Rule of Evidence 403 which provides \"Although relevant, evidence may be excluded if its probative value is substantially outweighed by . . . confusion of the issues, or misleading the jury, or by considerations of undue delay, waste of time or needless presentation of cumulative evidence.\" This Court was never given the opportunity to make a determination pursuant to Rule 403 on the admissibility of the questioned photographs because of the actions of defense counsel. Counsel for one of the three defendants has acknowledged that it was possibly his action that allowed such an occurrence. \"Now that was certainly sloppy housekeeping and I take responsibility for that, but that was certainly not a tactical move to put anything before the jury.\" (Transcript at Page 41). In the same way that a Motion In Limine does not ultimately decide the admissibility of evidence because of changed circumstances occurring during a trial, State v. Floyd, 295 S.C. 518, 369 S.E.2d 842 (1988), this Court could not foresee if the questioned photographs would have been offered and, if offered, then admitted into evidence. Contrast the Court's remarks on page 12 line 25 through page 13 line 4 with the Court's comments on page 46 lines 6-9 of the Transcript \"And I don't know of anyway at this point in time, even if they were later offered and admitted, at this point in time I have no way of guessing that\".\n\nThis Court is under an obligation to provide a fair and just trial for both the defendants and for the state. (See Transcript at page 46). This Court was left with the dilemma as to how to proceed after it was brought to its attention that evidence had been published to the jury that had not been properly admitted. It concerned this Court to the extent that it was brought to the attention of the litigants for a hearing as to how best then to proceed.\n\nThe Defendants argue that this Court did not consider any other reasonable alternative except to grant the State's Mistrial Motion after the publication to the jury of the questioned photographs. To the contrary, recognizing that the jury in this case had been empaneled for little over a day, the Court considered reasonable alternatives by calling out the jury foreman and inquiring with him in open court as to the extent of the publication of the questioned photographs. As noted on Transcript page 43 at line 9 the Court brought out the foreman of the jury, Mr. William C. Cunningham, and queried him as to what had been observed by himself as well as other members of the jury. Mr. Cunningham acknowledged that all the photographs had been circulated throughout the jury.\n\nMr. Cunningham: \"Yes Sir, to my knowledge they all had.\"\n\nThe Court: \"All right, Sir. To your knowledge, all of them had as far as you know?\"\n\nMr. Cunningham: \"Yes Sir. As far as I know.\"\n\nThe Court: \"All right, Sir. That is what I needed to know. You can step back into the jury room.\"\n\nTranscript page 44 lines 3 through 7.\n\nFurther, the Court then inquired of the court reporter whether or not the Court's understanding of the extent of the publicity was in fact accurate. (See Transcript at page 45). The court reporter confirmed by responding \"Yes Sir. It was a big stack. Those were included in the group that were over there.\" (Transcript page 45, lines 4-5). It was the Court's feeling that because of the nature of the exhibits and the extent of the publication to the jury that no curative instruction could be issued. This Court's concern about a curative instruction is implicitly reflected in the Transcript at page 46 lines 6-9. Unlike the Court in United States v. Sloan, 36 F.3d 386 (4th Cir. 1994) a case cited by the defendants as supporting their position, this Court did consider the alternative of a curative instruction. It was this Court's decision at the time, however, that a curative instruction would simply highlight and compound the error already existent.\n\nThe Court did not engage in any sua sponte determination of a mistrial, see State v. Prince, S.C. , 301 S.E.2d 401 (1983) but rather, allowed all counsel in this matter \"full opportunity to explain their positions\". (Transcript page 45, lines 9-11). It was of grave concern to this Court that this prejudicial occurrence had transpired and this Court wished to hear from each of defendants' counsel as to their feelings before ruling on the Motion for a Mistrial. See Transcript pages 39-41. At no time did any counsel for the defendants ask for more opportunity to be heard or to review other legal precedent prior to this Court's ruling.\n\n\"When a mistrial is declared over a criminal defendant's objection, retrial is permitted only when 'there is a manifest necessity for the act or the ends of public Justice would otherwise be defeated.'\" United States v. Perez, 22 U.S. (9 Wheat.) 579, 580, 6 L. Ed. 165 (1824) as cited in United States v. Sloan, supra . The Sloan court noted that this bedrock principle has been reiterated and followed consistently in the intervening 171 years. See, e.g., Arizona v. Washington, 434 U.S. 497, 54 L. Ed. 2d 717, 98 S. Ct. 824, Illinois v. Somerville, 410 U.S. 458, 35 L. Ed. 2d 425, 93 S. Ct. 1066 (1973) and United States v. Jorn, 400 U.S. 470, 27 L. Ed. 2d 543, 91 S. Ct. 547 (1971). As noted by the Somerville court, a trial Judge has \"broad discretion\" in determining whether manifest necessity requires declaration of a mistrial. While this Court \"need not make an explicit finding of manifest necessity\" Sloan, id. at 394, citing Arizona v. Washington, id ., the transcript adequately reflects that the court was so concerned with the origin of the prejudice as well as the extent of the publication to the jury that an implicit finding of manifest necessity exists. A \"manifest necessity\" standard cannot be \"applied mechanically\" Jorn, 400 U.S. at 487 and this Court declines to conclude that it acted \"irrationally or irresponsibly\", Arizona v Washington, 434 U.S. at 514, in making its decision to grant a mistrial. \"Each case must turn on its facts\", United States v. Sartori, 730 F.2d 973, 976 (4th Cir. 1984).\n\nThe twelve jurors had seen and touched physical evidence not properly admitted. While the defendants claim the photographs would have been introduced later, this is speculative and conjectural. This was not merely an opening statement by an adversary that could have been cured by any instruction of this Court as was the case in United States v. Sloan, id. Moreover, Defendants have not produced a case where a mistrial was declared improvidently granted when inadmissible evidence by the way of photographs had been published to the jury.\n\nMoreover, it is more than \"manifest necessity\" which requires the granting of a mistrial in this case. The public interest in and its right to a fair trial that is designed to end in a just judgment further requires that this Court deny the Defendants' Motion to Dismiss under the Fifth Amendment. It would be unfair, unjust and improper under these circumstances, which may have come about as a direct result of actions of defense counsel, to reward the defendants by granting their Motion to Dismiss. \"The interest of the public in seeing that a criminal prosecution proceed to verdict, either of acquittal or conviction, need not be forsaken by the formulation or application of rigid rules that necessarily preclude the vindication of that interest\" Illinois v. Somerville, 410 U.S. at 463, 93 S.C. at 1070. The Court's broad discretion was exercised under the facts existent and a mistrial was, of necessity, declared.\n\n\"Where for reasons deemed compelling by the trial Judge, who is best situated intelligently to make such a decision, the ends of substantial Justice cannot be obtained without discontinuing a trial, a mistrial may be declared without the defendant's consent and even over his objection, and he may be retried consistently with the Fifth Amendment.\" State v. Gamble, 275 S.C. 492, 272 S.E.2d 796 (1980) quoting Gori v. United States, 367 U.S. 364, 368, 81 S. Ct. 1523, 1526, 6 L. Ed. 2d 901 (1961). This Court will not second guess itself now, four months later, by what it observed, heard and felt at the time of its initial ruling. The Defendants' Motion to Dismiss the Indictments and to prosecution on the ground of double jeopardy is denied.\n\nAND IT IS SO ORDERED.\n\n/S/\n\nJames W. Johnson, Jr.\n\nJudge--Eighth Judicial Circuit\n\nLaurens, South Carolina\n\nMay 15, 1995\n\n\u003cspan class=\"fn\"\u003e1. Although the district court ordered that the writ issue, by separate order dated July 24, 1995, it refused to permit the release pending appeal of Gilliam--who, although initially released on bond, was later taken into physical custody for a violation of that bond--or the removal of the restrictions placed on Swain and Owings--both of whom had been released on bond pending trial in state court. See Fed. R. App. P. 23(c) (authorizing district court to continue custody in its discretion pending appeal). Petitioners have not sought review of this order of the district court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. We refer to Respondents--James Lee Foster, Sheriff of Newberry County, South Carolina; Charles M. Condon, Attorney General for the State of South Carolina; and James W. Johnson, Jr., Circuit Court Judge of South Carolina--as \"the State.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. South Carolina law defines lynching as an act of violence inflicted by a mob--an \"assemblage of two or more persons . . . for the premeditated purpose and with the premeditated intent of committing an act of violence upon the person of another\"--that results in death. S.C. Code Ann. ยงยง 16-3-210, 16-3-230 (Law. Co-op. 1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The pertinent colloquy when defense counsel began to show Officer Counts the photographs of the scene outside the mobile home to refresh his recollection was: PROSECUTING ATTORNEY: Do you mind if I see those? (Photographs were handed to the prosecuting attorney.) PROSECUTING ATTORNEY: Just one minute. (Pause) PROSECUTING ATTORNEY: Without objection. THE COURT: Were those being offered at this time? DEFENSE ATTORNEY: No, sir. We were just using these to refresh Mr. Counts' recollection. PROSECUTING ATTORNEY: I'm sorry. That was premature. J.A. 60-61.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. When defense counsel offered the Set 2 photographs into evidence, the following colloquy occurred: DEFENSE ATTORNEY: Mr. Counts, you have previously identified these photographs? OFFICER COUNTS: Yes, ma'am. DEFENSE ATTORNEY: Your Honor, I would move to introduce them into evidence. I believe they are numbers 16, 8, 13, 12 and 14. PROSECUTING ATTORNEY: Without objection. THE COURT: Without objection. J.A. 77.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The state trial Judge did not make a finding of manifest necessity or a finding of prejudice. Indeed, he did not use the word \"prejudice\" during this proceeding. Further, the state trial Judge gave no hint of what prejudice might possibly exist such that a reviewing court could conclude that prejudice resulted from the jury's viewing the photographs in Set 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. There is no question concerning the propriety of a federal court considering the habeas petition. Petitioners are in custody, either in actual custody or subject to bond restrictions, and have exhausted their state remedies. See Justices of Boston Mun. Court v. Lydon, 466 U.S. 294, 300-03, 80 L. Ed. 2d 311, 104 S. Ct. 1805 (1984). A federal habeas court is the only forum in which Petitioners may attempt to protect their double jeopardy right not to be tried twice for the same offense. See id. And, it should be noted that there is no suggestion that Petitioners have not proceeded in as timely a manner as possible in bringing this issue to a prompt resolution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The district court also accepted an argument raised by the State for the first time during oral argument on the motion. The State asserted that defense counsel may have been attempting to place this evidence before the jury improperly to allow them to make the last closing argument to the jury. Under a South Carolina procedural rule, the defense may make the last argument if it does not present evidence. The State argued that although the defense had introduced 28 exhibits into evidence during the prosecution's case in chief, some state court Judges might nevertheless have permitted the defense to have the last argument if it had not introduced evidence in its own case. This argument is baseless. First, it is well-settled law in South Carolina that if the defense introduces any evidence, whether in its own case or in the State's case, it loses the right to have the last argument. State v. Gellis, 158 S.C. 471, 155 S.E. 849, 855 (S.C. 1930); State v. Battle, 304 S.C. 191, 403 S.E.2d 331, 333 (S.C. Ct. App. 1991). And, it is undisputed that the defense previously had offered into evidence a series of exhibits that had been admitted without objection and therefore had already lost its right to make the last argument before the incident with the unadmitted photographs occurred. Second, and more fundamentally, the State's argument is logically flawed. If, as the State maintained, the defense had been motivated by a desire to place this evidence before the jury without losing its right to make the final argument, and, further, if some confusion among state trial Judges concerning the law may have permitted the defense to retain the right to make the last argument even though evidence was introduced by the defense during the prosecution's case, obviously the defense would have simply moved the introduction of the photographs in Set 1 during Officer Counts' testimony. Alternatively, if there was no dispute concerning whether the introduction of other evidence by the defense during the prosecution's case waived the right to final argument, then defense counsel would have already known it was waived. In either circumstance, there would have been no point in attempting to place the evidence before the jury without having it admitted first. The State has now abandoned this position.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. In my opinion for the en banc court granting Petitioners' request for a temporary stay of the state criminal proceedings, I noted that Petitioners had represented to us that during the second trial, the photographs were admitted without objection by the State and that subsequently the State objected to their admission. As the testimony before the district court made clear, this was not correct: Although defense counsel recalled that in a Discussion with opposing counsel off the record, the State had indicated that it would not have any objection to a number of photographs, including those that composed Set 1, the State did object to the introduction of the photographs prior to their admission. In any event, whether the State objected to the photographs during the second trial is irrelevant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. One of the prosecuting attorneys testified before the district court that so far as she knew no serological test had been conducted on the swabs of blood taken from the scene. Prior to oral argument before the en banc court, the parties informed us that, in fact, serological testing had been performed and that the results indicated that the spots were human blood.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. It appears that upon notification that the district court had granted the writ of habeas corpus, the state trial Judge released the jurors, but did not dismiss them or grant a mistrial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Following the decision of the district court granting the writ, the State sought relief from the order of the district court before this court in order to permit the resumption of Petitioners' criminal trial during the pendency of this appeal. This relief was denied. Gilliam v. Foster, 63 F.3d 287 (4th Cir. 1995) (en banc). The State also requested that this court prevent the enlargement of Petitioners; however, the district court had already stayed Petitioners' enlargement pending appeal, and Petitioners had not appealed from this ruling, so no relief from this court was necessary to ensure that Petitioners remained subject to the same custodial arrangements to which they had been subjected during the state criminal proceedings. After this court ruled, the State moved Chief Justice Rehnquist, sitting as the Circuit Justice for the Fourth Circuit, to grant temporary relief from the order of the district court pending appeal. Chief Justice Rehnquist refused to permit the State to proceed with the criminal prosecution pending appeal, but granted the State's application for a stay of enlargement. Foster v. Gilliam, 132 L. Ed. 2d 883, 116 S. Ct. 1 (Rehnquist, Circuit Justice 1995).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. It is well settled that jeopardy attaches in a jury trial when the jury is empaneled and sworn. Crist v. Bretz, 437 U.S. 28, 35, 57 L. Ed. 2d 24, 98 S. Ct. 2156 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Because the Supreme Court has made plain that the Double Jeopardy Clause affords protection against retrial even when the first trial has not been completed, we are not free to adopt the position advanced by one of the Dissenting members of this court that the Double Jeopardy Clause furnishes protection only when the first trial has been completed or the prosecution has acted in bad faith. See United States v. Schooner Peggy, 5 U.S. (1 Cranch) 103, 2 L. Ed. 49 (1801).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Of course, if a criminal prosecution has \"ended in an acquittal or conviction,\" the government is absolutely barred from prosecuting him further for the same offense. See Arizona v. Washington, 434 U.S. at 505.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. This proposition is subject to an exception when the defendant establishes that his request for the mistrial was motivated by prosecutorial or judicial misconduct that was intended to provoke the defendant into moving for a mistrial. Kennedy, 456 U.S. at 673-79.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. This level of deference falls on a spectrum between the strictest appellate scrutiny that applies when a trial Judge grants a mistrial in order to permit the prosecution an opportunity to garner more evidence against the accused and the highest level of appellate deference that applies when a trial Judge dismisses a hopelessly deadlocked jury. Arizona v. Washington, 434 U.S. at 507-10.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The Dissents attempt to make much of Petitioners' counsel's \"concession\" in argument before the court that the Set 1 photographs were \"prejudicial.\" This attempt is misdirected. Counsel acknowledged, as she must, that all relevant evidence is by definition \"prejudicial.\" However, Petitioners' counsel was careful to draw the distinction between evidence that is unduly or improperly prejudicial and evidence that is prejudicial only in the sense that it is relevant. Petitioners have consistently maintained that the Set 1 photographs were prejudicial only in the sense that they were relevant, not in the sense that they could have improperly biased the jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Not content with the arguments advanced by the State, one of the Dissenting members of the court contends that the majority is incorrect in concluding that the State's principal argument is that the potential for jury bias resulted from the jury's viewing of the Set 1 photographs without the authentication necessary for their formal admission. To the contrary, this has consistently been the State's position in its brief and at oral argument. In response to the repeated questions by various members of the en banc court during oral argument to the State's attorney concerning how the prosecution's case had been prejudiced by the jury's viewing of the Set 1 photographs, the State acknowledged that it previously had conceded that the photographs themselves were not prejudicial and maintained on at least six separate occasions that any prejudice to the prosecution resulted from the fact that the jury saw the Set 1 photographs before they were properly authenticated and formally admitted into evidence. Following these repeated assertions, the Dissenting Judge asked: On top of that, I asked you a specific question during a three-hour panel hearing in which you quite clearly argued that it . . . was significant that you could see clearly the spots[of blood] on the unadmitted photographs . . . . Defense counsel in response to my question specifically said that, \"Yes, it was prejudicial to the government's case.\" But, in response to [the court's] question today you say that it wasn't prejudicial except to the extent that in some technical sense they hadn't been authenticated. Do you have an argument that they were prejudicial? That's what we're interested in--a substantive argument of prejudice to the government's case. If not, then you've got to argue under Arizona that prejudice isn't required, which you just conceded . . . it is. STATE'S ATTORNEY: We don't argue that prejudice is not required. We submit that . . . prejudice under Arizona v. Washington, the way that I submit that Judge Wilkins is interested in prejudice, is required. COURT: O.K., then what is the prejudice . . . ? STATE'S ATTORNEY: The prejudice, I submit is, first off, the fact the photographs which were not . . . COURT: Other than that. The substantive case of[prejudice to] the prosecution. I assume there was no prejudice to the prosecution at this point in these proceedings. STATE'S ATTORNEY: Certainly, [they were] prejudicial to the prosecution because [the defense] never sought to introduce those photographs. In response to further questions from the members of the court to the State's attorney concerning the possibility that its case was prejudiced by the jury's viewing of the Set 1 photographs, the State reiterated that the failure to formally introduce the photographs into evidence may have led to juror confusion. In an apparent attempt to get to the bottom of the matter one final time, the Dissenting Judge again questioned the State's attorney concerning whether he was asserting that the fact that the photographs in Set 1 showed the blood more clearly was independently significant. Conceding that it was not, the State's attorney responded that Officer Counts had testified to the existence of blood at the scene. Having again reviewed the briefs and arguments before the court, we remain confident that the State has now abandoned any argument that the photographs themselves could have biased the jury. But, even if the Dissent were correct that the State had pursued this contention that the jury may have been biased as a result of viewing the Set 1 photographs because they disclosed information that was different from and more prejudicial than the photographs in Set 2, this claim would lack merit for the reasons discussed at length in the text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The Dissents complain that we are delving into South Carolina evidentiary law concerning matters that are quintessentially within the discretion of the trial Judge. As we have made plain, however, the state trial Judge refused to rule on the admissibility of the Set 1 photographs. So, we are not called upon to speculate over the correctness of a contemporaneous ruling. Instead, our examination ensues from the State's post hoc assertion that a proper foundation for admission was not laid.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Although the State does not assert that the district court erred in rendering this factual finding based on the evidence presented during the hearing, one of the Dissenting members of the court suggests that the district court improperly failed to defer to a contrary statement made by the state trial Judge. However, because Petitioners were not provided with a full, fair, or adequate hearing at the state level, to the limited extent that the state trial court resolved the facts, the district court was not bound by them. See 28 U.S.C.A. ยง 2254(d).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Theorizing why, in his opinion, the state trial Judge might have been motivated to invite a mistrial motion from the prosecution, this prosecuting attorney speculated that he thought the state trial Judge may have been influenced by an incident that occurred earlier in the trial in which one of the defense attorneys looked in a prosecution notebook. According to the undisputed evidence presented before the district court, this incident was brought to the attention of the state trial Judge, who raised the matter with defense counsel at a bench conference. Counsel denied wrongdoing, stating that she had inadvertently looked in the notebook while attempting to find her own. The state trial Judge made no finding of wrongdoing and did not reference this incident in granting the mistrial. Later, this incident was addressed in a footnote to the original order entered denying Petitioners' motion to dismiss their indictment on double jeopardy. After this order--which was prepared by the prosecution and signed by the state trial Judge without change--was entered, defense counsel moved the state trial Judge to amend the order and omit reference to the incident. The prosecution did not object to removal of this language, and the state trial Judge entered the amended order, which is included as an appendix to one of the Dissents. This record does not support a suggestion that the state trial Judge concluded that defense counsel engaged in a pattern of misconduct or that the state trial Judge based its decision to grant the mistrial on this basis.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The State asserted at oral argument that even if the photographs in Set 1 had been exact duplicates of photographs that had already been admitted into evidence, the state trial Judge would have been justified in concluding that a mistrial was manifestly necessary.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The State asserts that if the defense had been permitted to recall Officer Counts to the stand in order to formally move the introduction of the photographs, the jury might have placed too much emphasis on the Set 1 photographs. This argument obviously lacks merit. Litigants are always free to highlight evidence of their choosing by referring back to it several times during a witness' examination or by questioning multiple witnesses about the same evidence. Consequently, if the Set 1 photographs had been introduced into evidence during Officer Counts' testimony, nothing would have prevented defense counsel from emphasizing these photographs to the jury if it chose to do so. Accordingly, even if we assume that the introduction of the photographs would have to have occurred before the jury, recalling Officer Counts to the stand to do so would not have unduly prejudiced the prosecution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. One Dissent considers the order entered by the state trial Judge denying Petitioners' motion to dismiss their indictments as essential to a determination that the state trial Judge did not act precipitately and criticizes us for focusing on the circumstances surrounding the grant of the mistrial at the time it occurred rather than the later order. Our lack of focus on this order--which was filed some five months after the mistrial had been granted--results from our Conclusion that the order adds virtually nothing to the analysis of whether the state trial Judge acted precipitately in granting the mistrial. With the exception of the state trial Judge's statement that he considered giving a curative instruction, all of the substantive factual information to which the Dissent points is already reflected in the trial transcript and considered in the text of the majority opinion. To the extent that the order further discloses that the state trial Judge considered and rejected giving a curative instruction, it is irrelevant. We would not fault a state trial Judge for declining to pursue a remedy that might not have cured possible prejudice to the prosecution; indeed, we expressly note that a trial court acts well within the broad discretion afforded to it if it declines to impose a remedy that could fail to cure potential jury bias. The problem here is that the state trial Judge granted the mistrial in the absence of any circumstances that could have improperly biased the jury and failed to pursue a remedy that indisputably would have cured the potential bias, if any had been shown. Further, it is not surprising that the order discusses double jeopardy concerns, given that the Petitioners' motion that precipitated the order was based on the Double Jeopardy Clause. But, this Discussion cannot reasonably impute that concern back to the time the state trial Judge acted. And, in fact, the order does not purport to say that the state trial Judge actually considered the double jeopardy implications of its actions before granting the mistrial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Because the State did not rely upon the Younger abstention doctrine in opposing Petitioners' request for a temporary stay of the state criminal proceedings pending resolution of the merits of the ยง 2254 petition, we might be justified in refusing to consider this argument. See Swisher v. Brady, 438 U.S. 204, 213 n.11, 57 L. Ed. 2d 705, 98 S. Ct. 2699 (1978) (\"If the State voluntarily chooses to submit to a federal forum, principles of comity do not demand that the federal court force the case back into the State's own system.\") (internal quotation marks omitted). Nevertheless, because the State advances the abstention argument now, and because the issue is one of considerable importance, we will address it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Obviously, Petitioners already had been required to defend themselves in one criminal proceeding, and it was their second criminal trial from which they sought federal habeas relief.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The majority's attempt to invoke Supreme Court decisions to suggest that a double jeopardy claim like the one presented here is an exception to the dictates of Younger is unsuccessful. In no case cited by the majority did the Court enjoin an ongoing state criminal trial based on an improper declaration of a mistrial that resulted from a defense error. Abney v. United States, 431 U.S. 651, 52 L. Ed. 2d 651, 97 S. Ct. 2034 (1977), was a direct appeal, where Younger 's admonitions about federalism and comity are not relevant. In Justices of Boston Municipal Court v. Lydon, 466 U.S. 294, 80 L. Ed. 2d 311, 104 S. Ct. 1805 (1984), the Court considered a double jeopardy claim unlike the one presented here, and did not grant the requested pre-trial relief.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Officer Counts, the majority maintains, provided sufficient authentication and explanation of the photographs for the jury. The majority's hindsight judgment, however, conflicts directly with the Judge's determination at trial, namely, that the photographs were \"not in evidence, had not been testified to, [and] had not been identified.\" While Counts referred to the photographs to refresh his memory, there is no indication that the jury ever knew which photographs he relied upon to do so. Counts' testimony and diagram did provide a general overview of the crime scene, but this did not explain the significance of and exact location depicted in the disputed close-up photographs.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. It is not fair to claim that the unadmitted photographs were merely cumulative of other evidence or otherwise of little significance. In the second trial the defense vigorously fought to have these photographs admitted. Defense counsel also \"all but conceded\" in argument before a panel of this court that the photographs were prejudicial to the prosecution because they supported the defense's theories of self-defense or provocation. Gilliam, 61 F.3d at 1087 (Luttig, J., Dissenting). And in en banc argument before this court, defense counsel also acknowledged that the photographs, because they corroborated the defense's theory of the case, were prejudicial to the prosecution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The Judge asked the jury foreman: \"To your knowledge, had all of those photographs been circulated through the jury?\" The foreman replied, \"Yes, sir. To my knowledge they all had.\" The Judge then asked again whether the jurors had looked at all the photographs, and the foreman replied, \"Yes, sir. As far as I know.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. This is not to suggest, categorically, that prosecutorial overreaching that leads to a mistrial is the only time retrial will be barred. United States v. Jorn, 400 U.S. 470, 485-86, 27 L. Ed. 2d 543, 91 S. Ct. 547 (1971). But a reviewing court owes particular deference to a trial court's judgment on the necessity of a mistrial caused by defense error. Jorn does not suggest otherwise. There, defense counsel did not commit the error that led to the Judge's sua sponte declaration of a mistrial, id. ; rather, the decision \"dealt with action by a trial Judge that can fairly be described as erratic.\" Somerville, 410 U.S. at 469.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. As Justice Marshall explained in Holtzman v. Schlesinger, 414 U.S. 1304, 1313, 38 L. Ed. 2d 18, 94 S. Ct. 1 (1973), when a single Justice sits in his capacity as a Circuit Justice, he does not act alone, but rather \"as a surrogate for the entire Court, from whence [his] ultimate authority . . . derives.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The district court had no choice but to abandon its firmly-held views in light of our first en banc opinion, which reads as an undisguised mandate to the district court to reach the Conclusions that the en banc majority had reached on appeal: It cannot be seriously disputed that the ongoing state criminal proceedings violate Petitioner's constitutional right not to be placed twice in jeopardy for the same offense. . . . The undisputed facts demonstrate that the state trial Judge acted without any rational justification in granting a mistrial. .. . The federalism concerns expressed in Younger v. Harris. . . do not counsel against the grant of relief under these circumstances. Gilliam v. Foster, 61 F.3d 1070, 1074 (4th Cir. 1995) (en banc). Prior to our first en banc opinion, the federal district court had concluded that, the disputed photographs were more important than might first appear. . . . Issues of provocation and self-defense are present in this case. One factor that is important in resolving these issues is whether one of the Defendants was on the decedent's property or on the public roadway at the time he fired his weapon. The disputed photographs are close up photographs of the ground which show blood stains. Because of this, they could be used to more clearly document where the shooting occurred. The court . . . concludes that the Petitioners have virtually no likelihood of success on the merits of their double jeopardy claim . . . . J.A. at 211, 213 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. In the debacle that has ensued since our initial intrusion into the affairs of South Carolina, the original state trial Judge recused himself because he was named as a defendant in this matter, and the second state trial Judge was forced to halt the trial four days into it -- literally while a witness was on the stand. The chaos that we have created is exemplified in the revealing exchange before the district court that follows: THE COURT: Can you hold one second. I'm sorry. Let me say that during the last break I was faxed a new copy of an opinion by the Fourth Circuit. I don't want to give anybody heart attacks. A three/four Dissenting opinion written by three other minority members of the court. Three other separate opinions. I didn't know if you seen them. THE STATE: No, sir. THE COURT: I will have them copied for you so you will have them. Go ahead. This is the first time I ever had the Fourth Circuit law being made as we progressed. DEFENSE COUNSEL: I think this is a first for all of us, Judge. J.A. at 432-33 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. None of the majority's other asserted bases for invalidating the trial court's judgment even remotely supports the majority's Conclusion that the trial court abused its discretion. First, that Officer Counts had already laid an adequate foundation for admission of the unadmitted photographs, see ante at 26-27, 33, even if true, is irrelevant to the question of potential jury prejudice. Even assuming that a foundation already existed, the fact remains that Officer Counts' testimony was easily subject to impeachment based upon the Set 2 photographs alone; thus, as defense counsel has consistently argued, the Set 1 photographs were essential corroboration of Counts' testimony. To invoke the adage, the pictures were worth a thousand of Officer Counts' words. Second, that the prosecution originally said, \"no objection\" when it mistakenly thought the unadmitted photographs were being offered into evidence, see ante at 5 n.4, is of no moment, as the majority itself seems to acknowledge, because the prosecution immediately thereafter withdrew that statement as \"premature.\" J.A. at 60-61. Third, that the trial Judge chose not to inquire further whether the jury had seen the unadmitted photographs in particular, after he had already recalled the jury foreman and been told that \"all\" of the photographs (including the unadmitted ones) had been \"circulated through the jury,\" see J.A. at 38, 92-94, and confirmed this fact with the court reporter, J.A. at 93, was by no means irrational. Fourth, that the motion for mistrial may have been invited by the trial court, see ante at 28-29, is not supported by the record and is denied by defense counsel, J.A. at 87, 304; regardless, it is irrelevant because, as the federal district court observed, even if the mistrial was invited, \"the standard for judging the grant of mistrial remains the same.\" J.A. at 498. And fifth, the fact that an error might not result in reversal of a conviction, see ante at 30-31, is plainly not dispositive of whether that error was sufficiently prejudicial to support a mistrial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. See Grand Jury Proceedings Under Seal v. United States, 947 F.2d 1188, 1190 (4th Cir. 1991) (cited by the federal habeas court, J.A. at 491, as support for its authority to issue a subsequent written opinion explaining the reasons for its earlier grant of the writ of habeas corpus). Cf. Arizona 434 U.S. at 517 n.39 (\"The Court of Appeals was concerned that the trial Judge may [not] have . . . considered the possible impact of [the improper] comments on the impartiality of the jurors. We think this concern is unwarranted. . . . We are unwilling to assume that a Judge, who otherwise acted responsibly and deliberately, simply neglected to consider one of the central issues presented by the mistrial motion and argued by the parties when he made his ruling.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The State of South Carolina adopted Fed. R. Evid. 403 in State v. Alexander, 303 S.C. 377, 401 S.E.2d 146, 149 (S.C. 1991).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. To support the claim that the government conceded that the photographs had no \"prejudicial\" effect, the majority relies upon a statement by the prosecution made during argument before the panel on whether to stay the state court's order of retrial pending a further hearing before the federal district court. See ante at 14. But the majority omits the prosecution's later clarification during that argument in response to a followup question, that, by \"prejudice,\" the prosecution meant \"inflammatory\"; thus, the prosecution explained that the photographs are not like \"autopsy photographs,\" in that they were not likely to inflame the passions of the jury. The prosecution did not concede that their submission to the jury was not prejudicial, but rather, argued that they were \"inherently prejudicial.\" Transcript of Oral Argument, July 15, 1995, at 49-50.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. It is now known that a serological test had been performed on the dots. The test confirmed that the dots were human blood, but no determination was made as to whose blood it was, a failing that could be significant in light of the testimony that another violent incident had occurred at the same location between two other people earlier that same day, J.A. at 622-23. The prosecution has represented to us that it did not know at the time that any such test had been performed. Most important, though, neither party disputes that the state trial Judge did not know of the test. Of course, it is only the trial court's state of knowledge concerning the dots that is relevant to the question of whether it acted precipitously.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The majority's Conclusion that the photographs would have been admissible in the state trial is based in large part upon the forced speculation by the prosecution that, if the State had not objected to their admission, the photographs would have been admissible. Ante at 13-14, 22-23, 35-36. However, as the state trial Judge understood, J.A. 36-37, 93-94, admissibility of the photographs is irrelevant to the question of whether the trial Judge abused his broad discretion. The only possibly relevant inquiry would be whether the photographs would have been actually admitted. Neither party is in a position to know, much less to \"concede,\" this. The ultimate determination of whether particular evidence will be admitted rests with the trial Judge and must be made with knowledge of how the trial has unfolded and how the evidence is to be used at the moment when it is offered.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. In any event, that the Supreme Court in Arizona assumed from the inadmissibility of the statement there in question both that the statement was improper and that it may have affected the jury's impartiality, 434 U.S. at 511, does not mean, contrary to the majority's belief, ante at 22-23, 28, that if evidence is admissible, then ipso facto it could not affect the impartiality of the jury. The only error alleged in Arizona was that the statement was inadmissible as a matter of law, see 434 U.S. at 499-500; respondent's argument in defense of the statement was that the evidence \"was admissible as a matter of Arizona law, and therefore that the opening statement was proper.\" Id. at 511. Here, in contrast, there was a more fundamental and antecedent error -- that the entire process by which evidence is allowed before the jury was corrupted, depriving the court of the opportunity even to consider the admissibility of the evidence at the appropriate time.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. In Arizona, the trial court delayed granting the mistrial for a day to allow defense counsel the extra time it had requested to conduct legal research on the mistrial, 434 U.S. at 514 n.34. Here, \"at no time did any counsel for the defendants ask for more opportunity to be heard or to review other legal precedent prior to the Court's ruling.\" J.A. at 39. However, the Judge first conducted a bench conference about the matter and recessed court in order to give counsel for the parties an opportunity to conference and discuss the matter. J.A. at 90-91, 303. Thus, the majority's attempt to disparage the opportunity for counsel to be heard on the matter, ante at 27 n.21, rings hollow. See Sumner v. Mata, 449 U.S. 539, 546-48, 66 L. Ed. 2d 722, 101 S. Ct. 764 (1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The Ninth Circuit, which was reversed by the Supreme Court in Arizona, described the Arizona trial court as having made \"no findings whatsoever.\" 546 F.2d 829, 832 (9th Cir.), rev'd 434 U.S. 497 (1977). According to the court of appeals, the trial Judge, at no time . . . indicated the reason(s) why he granted the mistrial. Furthermore, his short order . . . is not susceptible to any inference that will fill this void. In the absence of any finding by the trial court or any indication that the court considered the efficacy of alternatives such as an appropriate curative instruction to the jury, we must conclude that neither of the tests of Perez. . . has been met.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. As the trial court noted, J.A. at 39, Arizona does not even require that it make an explicit finding of manifest necessity. 434 U.S. at 517. Indeed, a fundamental error of the majority is that it has fixed upon the mantra of \"manifest necessity\" while failing to realize that none of the concerns that underlie the actual constitutional prohibition against double jeopardy are implicated in this case. As the Supreme Court explained long before Arizona, \"the double jeopardy provision of the Fifth Amendment . . . does not mean that every time a defendant is put to trial before a competent tribunal he is entitled to go free if the trial fails to end in a final judgment. Such a rule would create an insuperable obstacle to the administration of Justice in many cases in which there is no semblance of the type of oppressive practices at which the double-jeopardy prohibition is aimed.\" Wade, 336 U.S. at 688-89 (emphasis added). Cf. Duckworth v. Eagan, 492 U.S. 195, 203, 106 L. Ed. 2d 166, 109 S. Ct. 2875 (1989) (\"The prophylactic Miranda warnings are 'not themselves rights protected by the Constitution but [are] instead measures to insure that the right against compulsory self-incrimination [is] protected.'\" (quoting Michigan v. Tucker, 417 U.S. 433, 444, 41 L. Ed. 2d 182, 94 S. Ct. 2357 (1974)); Stone v. Powell , 428 U.S. 465, 479, 481-82, 490-91, 49 L. Ed. 2d 1067, 96 S. Ct. 3037 (1976) ('\"The exclusion of illegally seized evidence [pursuant to Mapp v. Ohio, 367 U.S. 643, 6 L. Ed. 2d 1081, 81 S. Ct. 1684 (1961)] is simply a prophylactic device intended generally to deter Fourth Amendment violations by law enforcement officers.'\" (quoting Kaufman v. United States, 394 U.S. 217, 224, 22 L. Ed. 2d 227, 89 S. Ct. 1068 (1969)). The primary evil that \"manifest necessity\" was created to prevent -the threat of the State bringing its awesome power repeatedly to bear in an effort to convict a criminal defendant, see Arizona, 434 U.S. at 50-08 \u0026 n.23 -- is simply not present here. The mistrial was prompted solely by the negligence of the defense; there is no allegation either of prosecutorial misconduct or of pretext in the motion for mistrial. See generally Arizona, 434 U.S. at 506-10, 514-15 (describing the \"spectrum\" of scrutiny given declarations of mistrial and explaining that that scrutiny is far lower when there is no prosecutorial misconduct).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The prosecution explained as follows an event that occurred prior to defense counsel's placing the unadmitted photographs before the jury: Earlier in the trial an incident had occurred where it was brought to the court's attention at a bench conference that an officer, I believe it was Major Gonza Hunter, brought to my attention that he had seen [defense counsel] looking in our notebook during one of the breaks. As opposed to announcing that in open court, I simply brought that to the court's attention with counsel at the bench. My recollection of that conference was that I brought it to the court's attention. [Defense counsel] stated to the court that she had in fact looked in our notebook, that she had done it in an attempt to find her own notebook. I pointed out to the court that I felt that a little extreme concerning the notebook she looked into had a large gold South Carolina Law Enforcement Officers Association seal on it. That was one of the first incidents that we had. J.A. at 384-85. Before the federal district court, the prosecution stated that this incident was \"a motivating factor\" in its motion for mistrial, J.A. at 423-24, and, when asked for its views of why the mistrial was declared, explained that, it seems to me that the reason for that was[Judge Johnson's] concern for what had happened, vis-a-vis two incidents. The first one involving Ms. Goodwin. I don't know what was said at the bench conference. I did not go there. The second matter was the business about the impropriety of photographs being not just admitted to the jury but picked up and handled by every member of the jury. Those two things I think said to Judge Johnson that this was some sort of a pattern and his concern for what had happened had reached -- Before counsel could complete his thought, Ms. Goodwin interrupted him: Your Honor, I object to Mr. Delgado saying what was in Judge Johnson's mind, that it is not reflected in this record. I move to strike all of what he thinks Judge Johnson was thinking. J.A. at 428-29 (emphasis added). Because the witness \"moved on,\" there was no occasion for the court to rule on the motion to strike.\u003c/span\u003e\n\n",
    "body_length": 194933,
    "citedas": [
      "75 F.3d 881"
    ],
    "attorneys": "ARGUED: Donald John Zelenka, Assistant Deputy Attorney General, Columbia, South Carolina, for Appellants. Joy Scherffius Goodwin, LEVY \u0026 GOODWIN, Columbia, South Carolina, for Appellees. ON BRIEF: J. Christopher Mills, FAIREY, PARISE \u0026 MILLS, Columbia, South Carolina, for Appellee Gilliam; Samuel M. Price, Jr., Newberry, South Carolina, for Appellee Owings.",
    "category": [
      "243",
      "36",
      "75"
    ],
    "judges": "Before Ervin, Chief Judge, and Russell, Widener, Hall, Murnaghan, Wilkinson, Wilkins, Niemeyer, Hamilton, Luttig, Williams, Michael, and Motz, Circuit Judges. Judge Wilkinson wrote a Dissenting opinion in which Judges Russell, Widener, Niemeyer, and Luttig joined; Judge Niemeyer wrote a Dissenting opinion in which Judge Widener joined; and Judge Luttig wrote a Dissenting opinion in which Judges Russell, Widener, Wilkinson, and Niemeyer joined.",
    "citation_count": 422
  }
}
