{
  "id": "mrhrTmYBTlTomsSB3bOk",
  "document": {
    "title": "State v. Moore",
    "full_title": "STATE OF NEW JERSEY v. SAMUEL LEON MOORE",
    "jurisdiction": "Supreme Court of New Jersey",
    "date": "1991-01-23T00:00:00.000Z",
    "docket": "No. A-88",
    "body": "ruled that even though the statute imposed a burden of proof on the defendant to establish the diminished-capacity defense, the burden imposed was to show only the existence of the mental disease or defect, not that the disease or defect would negate a criminal mental state. That interpretation, we concluded, would pass constitutional muster because it imposed no burden on the defendant to disprove an essential element of the crime charged. In point of fact, even if this case had been tried after, and in accordance with, Breakiron, it would still contain a federal-constitutional flaw -- at least in the view of the Third Circuit. In Humanik v. Beyer, 871 F.2d 432, 443, cert. denied, U.S. , 110 S. Ct. 57, 107 L. Ed. 2d 25 (1989), the Third Circuit ruled that the Breakiron construction failed to meet federal due-process requirements because imposing any burden of proof on the defendant created a \"filter\" that impermissibly relieved the State of its obligation to prove the defendant guilty beyond a reasonable doubt of each and every element of a crime. The State petitioned the United States Supreme Court for review of the Humanik decision, but the Supreme Court denied relief. We administratively advised trial and appellate courts that in order to avoid a constitutional stalemate, we ought to conform the applications of the statute to the Humanik ruling. Having instructed trial and appellate judges to do so, we can do no less here. The Legislature has since amended the diminished-capacity law. L. 1990, c. 63 (amending N.J.S.A. 2C:4-2). Courts will no longer charge that defendants have asserted a statutory affirmative defense. Of course, juries will continue to be required to consider all evidence in a case, including any evidence of mental disease or defect proffered by a defendant, relevant to the state of mind that the State must prove. In addition, proposed legislation, passed in the State Assembly and now awaiting action in the State Senate, would require consideration of commitment for any defendant who is relieved of criminal culpability by virtue of a diminished-capacity defense. A. 760, 204th Leg., 1st Sess. (1990).\n\nThe defense is of particular significance here because defendant's state of mind is really the only issue. The evidence is overwhelming that defendant killed his wife and child. Whether in cold blood, rage or anger, or with callous indifference to the consequences of the brutal blows inflicted on them is undoubtedly all that remains for a jury to decide. Crucial to the jury's determination, in defendant's view, is that he suffered from a mental disease or defect of mind on the occasion of the killing to such an extent that he did not intend to kill or did not know that he was killing his victims. His counsel argues that the State should have had to prove that the killings were knowing and purposeful despite the evidence of his mental disease or defect. This is effectively what federal-constitutional law requires. Humanik v. Beyer, supra, 871 F.2d 432. It is close to the construction that we adopted in State v. Breakiron, supra, 108 N.J. 591, 532 A.2d 199.\n\nNot having the benefit of the later-announced decisions, the instructions to the jury here required, in violation of Breakiron/Humanik, that defendant prove that the mental disease or defect negated his knowledge or purpose to kill. The error in the charge is conceded. It is the fault of no one. The language of the statute was followed. The only question is whether the error is harmless. For the reasons to be set forth in detail in the opinion, we cannot find in the circumstances of this case that the constitutional error committed on so fundamental an issue in a murder trial of this type was harmless. Because this ruling requires reversal of the guilt phase of this capital-murder trial, it renders moot most of the other issues. As we have done in other cases, we shall discuss in detail only issues that are likely to recur in the retrial of this case and that are not clearly resolved by our other capital cases.\n\nI\n\nThe case involves a particularly shocking hammer killing of a young wife and her eighteen-month-old child as the denouement\n\nof a marital breakup. For purposes of this appeal we shall accept without necessarily endorsing in specific terms the general recital of the events set forth in the State's brief.\n\nThe murder took place on Sunday evening, June 29, 1986, at the couple's apartment at 207 South Harrison Street, East Orange, New Jersey, following a family outing that ended in an argument and the death of the wife and child at the hands of the husband and father.\n\nAt first a seemingly happy union, the marriage began to deteriorate in early 1986. The wife, Melva, complained of defendant's hours outside the home at work (he held a managerial position in an airline catering service at Newark Airport), while the husband complained of the wife's housekeeping. Despite the fact that she had become pregnant in early 1986, Melva told a friend in the spring of 1986 that she was thinking of leaving the defendant. Although he complained of his wife, defendant told a friend that he would not leave his home.\n\nThe situation worsened when Melva learned that defendant was having an affair with a co-worker, to whom we shall refer by her first name, Lizzette. Defendant and Lizzette planned to set up housekeeping together. It appears that defendant wanted Melva out of the family apartment so that he and Lizzette could occupy it. The plan was that Lizzette would move into defendant's apartment on Sunday, June 29, 1986.\n\nThat was the last day that any member of his family would occupy that apartment. That Sunday, Melva and Kory, her eighteen-month-old son, had not moved out. Defendant spent the day with Melva and Kory at a park. When they arrived home at about 9:00 p.m., defendant and Melva started arguing. The argument became a fight, an exchange of recriminations and hate-filled words. Defendant picked up a hammer and struck Melva repeatedly with it. According to the forensic pathologist, defendant struck more than twenty blows to her skull, spattering blood and brain throughout the apartment. In the course of killing Melva, defendant killed Kory. He claims\n\nthat it was an accident. Kory's body was found on the hallway floor about three feet to the right of his mother, whose body was lying in the bathroom doorway. Blood from the mother was found on the child's overalls. By approximately 9:30 p.m. both were dead.\n\nAbout this time a telephone in the apartment rang. It was Ennis White, a friend of Melva. When Ennis asked for Melva, defendant said he did not know where she was. Defendant then put his bloodstained shirt and shorts into a paper bag and wiped the blood off himself.\n\nHe then went to pick up Lizzette, who was planning to move into the South Harrison Street apartment. Defendant told her that he had to stop off at work. When they arrived at work, he took the paper bag with his clothes out of the trunk and hid them in the building. He told Lizzette that it would be better if they spent the night at a motel. After moving her into a motel, he drove back to his place of work, retrieved the bag of clothes, including the towel, and threw it into a barrel in an abandoned building. He also threw the hammer onto the roof of the abandoned building. After eating, defendant returned to the motel and remained overnight with Lizzette.\n\nOn the following morning, Monday, June 30, 1986, a worried friend of Melva gained access to the apartment with the help of a superintendent. At 8:15 a.m. the police were at the scene. They found no evidence of forced entry, burglary, or robbery. They found blood on the telephone and a bloody palm print in the bathroom. Defendant arrived at the apartment early Monday morning. He was soon identified as the husband. He told the police that he had been at the Royal Inn motel the night before with his girl friend. Defendant did not tell the police about the 9:30 p.m. phone call. He was taken to the police station where he denied involvement. Following an emotional confrontation with Lizzette, defendant told her that when Melva started yelling at him, he got mad and he beat her with a hammer. When Lizzette asked \"why Kory?\" (the baby), defendant\n\nbroke down and cried. He said that he did not know. He said that he wanted only to be with Lizzette. Defendant then gave the police a written confession admitting the facts outlined above. He contended that Kory had jumped on Melva to \"cover her\" and in the process Kory was struck by accident. He told the police how he had abandoned his clothes and the murder weapon. The police retrieved these items. The police identified the palm print as that of defendant.\n\nThe jury found defendant guilty of two counts of capital murder and two counts of weapons-related offenses.\n\nAt the sentencing proceeding, the State asserted two aggravating factors on each murder: (1) that the murder was outrageously or wantonly vile in that it involved torture, depravity of mind, or an aggravated assault, N.J.S.A. 2C:11-3c(4)(c) (in Kory's case the State agreed to limit the c(4)(c) factor to depravity); and (2) the murder was committed while defendant was engaged in the commission of another murder, N.J.S.A. 2C:11-3c(4)(g). Concerning Kory's murder, the State asserted as an alternative to depravity of mind that defendant had committed it to escape detection. N.J.S.A. 2C:11-3c(4)(f). The jury unanimously found the presence of the two aggravating factors, c(4)(c) and c(4)(g), as to both killings, and unanimously found as mitigating factors defendant's lack of a prior record, N.J.S.A. 2C:1-3c(5)(f), and the catchall mitigating factor, N.J.S.A. 2C:11-3c(5)(h). One juror found defendant had been under the influence of extreme emotional disturbance, N.J.S.A. 2C:11-3c(5)(a). The jury unanimously found beyond a reasonable doubt that the aggravating factors outweighed the mitigating factors. Consequently, the defendant was sentenced to death. The appeal to us is of right under R. 2:2-1(a)(3).\n\nII\n\nDiminished Capacity Issue\n\nDefendant contends that the trial court imposed on him the burden of proof of a diminished capacity and thereby violated\n\nhis due-process right to have the State prove each and every element of the crime charged beyond a reasonable doubt.\n\nN.J.S.A. 2C:4-2, which establishes the defense of diminished capacity, provided at the time of this trial:\n\nEvidence that the defendant suffered from a mental disease or defect is admissible whenever it is relevant to prove that the defendant did not have a state of mind which is an element of the offense. In the absence of such evidence, it may be presumed that the defendant had no mental disease or defect which would negate a state of mind which is an element of the offense. Mental disease or defect is an affirmative defense which must be proved by a preponderance of the evidence.\n\nAs we held in State v. Breakiron, supra, 108 N.J. 591, 532 A.2d 199, the statute does not shift the burden of proof to the defendant to disprove an essential element of the case. Rather, the defendant needs to do only what the statute says: to prove the existence of a mental disease or defect. We believed that this was constitutional.\n\nThe Third Circuit Court of Appeals, in Humanik v. Beyer, supra, 871 F.2d 432, ruled that an instruction that a defendant has the burden of proving the existence of a mental disease or defect by a preponderance of the evidence denies him or her due process of law. In its view, the imposition of such a burden on the defendant violates the due-process clause by acting as a \"filter\" that may bar the jury's consideration of that evidence when the time comes to decide whether the State has proved, beyond a reasonable doubt, the criminal state of mind that is an essential element of the crime. Id. at 443.\n\nBecause certiorari was denied by the United States Supreme Court from the Humanik decision, Chief Justice Wilentz, on behalf of this Court, issued a memorandum on December 8, 1989, instructing all courts to apply the Humanik decision in pending appeals in order to avoid an intolerable conflict between state and federal courts in the circuit. The memorandum provided: \"Of course, that fact does not require a reversal of every case presenting a diminished capacity issue. Other appellate principles may dictate a different result.\" See 124 N.J.L.J. 1562 (1989) (summarizing the memorandum).\n\nTherefore, we must resolve two issues in this case: (1) whether there is error in the charge, and, if so, (2) whether the error in the charge requires reversal.\n\nA.\n\nThe initial charge to the jury on diminished capacity seems clearly to have placed the burden on the defendant to disprove an essential element of the crime. The initial charge follows:\n\nThe defendant contends that he was suffering from a mental disease or defect which made him incapable of the state of mind required to be proved for a murder, aggravated manslaughter, manslaughter or possession of a weapon. That is, he says that he was not able to act purposely, knowingly or recklessly; that his mental disease or defect prevented him from acting with any of those states of mind.\n\nMental disease or defect which would negate the state of mind which is an element of the defense is never assumed. Indeed, as I told you, indeed, people are capable of forming the requisite intent.\n\nWhen the defendant contends that he does not have the requisite capability, he must prove by a preponderance of the evidence, that, (1) that he has the mental disease or defect, and (2) that it was of such a nature that it prevented him from acting purposely, knowingly or recklessly, depending on which state or states of mind are one of the elements of the offense that is under consideration.\n\nThe State does not have the burden of persuasion on this issue. The burden is on the defendant. And if you have found that the defendant did an act in question, then you must consider his state of mind accompanying the act or acts.\n\nIf the defendant has proved the mental disease or defect and that it negated his ability to form the state of mind, you must find him not guilty with respect to such crime. [Emphasis added.]\n\nIt is true that the charge in other respects conveyed to the jury the requirement that the burden of proof to establish each essential element of the crime always remained on the State. Early in its charge, the court instructed the jury that \"the burden of proof is upon the State to prove the elements of a crime, and it never shifts. It remains on the State throughout the whole trial of the case.\" In addition, in concluding its charge on the defense of diminished capacity, the court told the jury:\n\nAll evidence bearing on that, all circumstances, including mental condition, and state of mind, may be considered. In other words, even if a defendant has failed to prove that he was not able to have a particular state of mind by reason of a mental disease or defect, that does not relieve the State of its job to prove that, in fact, at the time in question, the defendant had the requisite mental state when he took the actions which are crimes, if done purposely or knowingly.\n\nHowever, the fact remains that the charge was contradictory. Contradictory and inconsistent charges are inherently inadequate as they \"create a reasonable likelihood that a juror understood the instructions in an unconstitutional manner * * *.\" Humanik v. Beyer, supra, 871 F.2d at 442 (quoting Francis v. Franklin, 471 U.S. 307, 323 n. 8, 105 S. Ct. 1965, 1975 n. 8, 85 L. Ed. 2d 344, 359 n. 8 (1985)). In responding to a jury request to explain the insanity and diminished-capacity defenses, the court recharged the jury:\n\nAs a part of his general denial of guilt, the defendant maintains he was not guilty of the crimes charged, either by reason of diminished capacity or lack of capacity, or by reason of legal insanity, or both. Those are separate concepts, but they have certain things in common, and we'll mention again the things in common.\n\nFirst of all, the law entertains no prejudices against the defenses of diminished capacity or insanity. On the contrary, if the defense -- if either defense is sufficiently established, the law allows the defendant the benefit of it by an acquittal of all criminal responsibility. * * *\n\nUnder our law, all persons are assumed to be sane, and are assumed to be capable of forming the requisite state of mind, and therefore, responsible for their conduct until the contrary is established by them. Insanity and diminished capacity are affirmative defenses, and the burden of proving them or either of them by a preponderance of the evidence is on the defendant who asserts the defense.\n\nAnd later:\n\nAnd therefore, if the evidence were to be in balance with respect to mental disease or defect, or its effect, then the defendant who has the burden of proof with respect thereto has not met the burden. [Emphasis added.]\n\nAnd:\n\nWhen a defendant contends that he does not have the capability, he must prove by a preponderance of the evidence; (1) that he had the mental disease or defect; and (2) that it was of such a nature that it prevented him from acting purposefully, knowingly or recklessly * * *.\n\nThe State does not have the burden of persuasion in this issue. The burden is on the defendant, as I've indicated. [Emphasis added.]\n\nThe combination of those instructions seems clearly to have conveyed to the jury that it was defendant's burden to prove that his mental condition negated the presumed culpability that attended his doing of the act. Although the court reinstructed the jury as well that the defendant's failure to disprove the requisite mental state did not relieve the State of its burden, we \"cannot say with any degree of confidence which interpretation [the] jury adopted.\" Mills v. Maryland, 486 U.S. 367, 383, 108 S. Ct. 1860, 1870, 100 L. Ed. 2d 384, 399 (1988).\n\nB.\n\nNotwithstanding the defect in the charge, the State argues that any error in the charge is harmless. The argument has support in a recent decision of the Appellate Division, State v. Carroll, 242 N.J. Super. 549, 577 A.2d 862 (1990), certif. denied, N.J. (1991). In that tragically similar factual circumstance, a stormy love relationship between a couple disintegrated, culminating in the crushing and stabbing murder of the thirteen-year-old daughter of the defendant's estranged wife.\n\nThe Appellate Division found the jury instruction in Carroll to be defective because it erroneously placed the burden of proving the existence of a diminished capacity on the defendant, contrary to Humanik. However, the error was harmless as the defendant had \"failed to present evidence of the kind of mental disease or defect which would negate the mental state required to convict him of murder.\" State v. Carroll, supra, 242 N.J. Super. at 557, 577 A.2d 862.\n\nThe Appellate Division relied on this Court's opinions in State v. Pitts, 116 N.J. 580, 562 A.2d 1320 (1989), and State v. Breakiron, supra, 108 N.J. 591, 532 A.2d 199. In State v. Pitts, the Court concluded that the psychiatric testimony presented by the defendant, which characterized the defendant's behavior as a loss of emotional control (\"rage reaction\") rather than a loss of cognitive faculties, was not the kind of evidence that required the diminished-capacity instruction to be\n\nsubmitted to the jury. 116 N.J. at 592, 562 A.2d 1320. In State v. Breakiron, we ruled that in order to qualify for the defense of diminished capacity, at a minimum the evidence must be shown to be capable of negating a mental element of the crime charged or otherwise to impair cognition. 108 N.J. at 619, 532 A.2d 199. Based on these two opinions, the Carroll court distinguished between a case presenting evidence of a mental disease or defect that impairs the cognitive state required to act knowingly or purposely and a case in which the evidence presented concerns a mental disease or defect \"which produces an emotive reaction such as rage or impassioned impulse * * *.\" State v. Carroll, supra, 242 N.J. Super. at 558, 577 A.2d 862. The former case requires the submission of the diminished-capacity defense to the jury whereas in the latter case the defense need not be submitted.\n\nReviewing the testimony, the Carroll court determined that the defendant had failed to present evidence that his mental condition so impaired his cognitive faculties as to prevent him from acting purposely or knowingly. While stating in conclusory terms that Carroll's mental condition at the time of the homicide prevented him from acting purposely or knowingly, one medical expert asserted that a combination of mental diseases (atypical psychosis, organic brain syndrome, and borderline or mixed personality disorder) and the consumption of alcohol (chronic substance abuse) caused Carroll to become enraged and to lose control of his impulses. The court continued:\n\nHowever, [the doctor] never stated that defendant suffered from an impairment of his faculties which prevented him from being cognizant of the fact that he was hitting his stepdaughter over the head with a scale and stabbing her in the throat with a knife and that it was practically certain his actions would cause death or serious bodily injury to the child. See N.J.S.A. 2C:11-3a(2). Therefore, [the doctor's] testimony did not mandate a jury instruction as to the defense of diminished capacity. [ Id. at 560-61, 577 A.2d 862.]\n\nAnother defense expert, a neurologist, concluded that Carroll had acted recklessly, not purposely or knowingly. He based his conclusion on the impression that a person who is indifferent to the consequences of his or her actions, one who does not care\n\nwhether the victim lives or dies, cannot be found to have acted knowingly or purposely. The neurologist believed that Carroll's intellectual impairment and consumption of alcohol caused him to lose \"impulse control\" and that he was \"acting in a fury, in a rage\" when he committed the murder. Id. at 561, 577 A.2d 862. The Appellate Division found that that testimony was not the kind of evidence that required the submission of a diminished-capacity defense to the jury.\n\nBecause \"the only possible consequence of the court's * * * instruction to the jury regarding the defense of diminished capacity would have been to improve defendant's chances of securing an acquittal,\" the Appellate Division found that the erroneous instruction had not prejudiced Carroll, and that any error was harmless beyond a reasonable doubt. Id. at 563, 577 A.2d 862.\n\nWe are unable to agree, however, that the evidence in this case can be analyzed in the same way as the psychiatric testimony in the Carroll case. In this case the psychiatric witness testified that the fact defendant killed Kory in the course of killing Melva \"indicates even more so and underscores the fact that he was not aware of what he was doing or not in control of what he was doing, because he certainly felt the opposite toward Kory [than he felt toward Melva].\" And later when asked specifically by the prosecutor about the striking of Kory, \"But [he] knew what he was doing?\" Answer: \"I think not. But there is always a continuum. He could have been subconsciously aware, minimally aware.\" As thin as the evidence was, it contained a diagnosis of a \"brief reactive psychosis\" that defendant suffered at the time of the murder as the result of stress.\n\nIn later cross-examination the prosecutor questioned whether defendant's consciousness of guilt, as shown by his concealment of the evidence, clearly established that he had consciously killed:\n\nQ. Someone who knows they were guilty would get rid of the evidence, wouldn't they?\n\nA. Shouldn't [one] who knows that he has killed two people, for whatever reasons. Guilty sounds like he did something deliberate, and my point is he has not.\n\nQ. You don't think he deliberately killed?\n\nA. That's right.\n\nAnother defense witness placed defendant's conduct closely into the rage pattern. He said that he interpreted \"this type of a homicide to be a rage reaction, out of control, emotionally murder -- or homicide, excuse me. I'm sorry.\" To which the prosecutor replied: \"I take it one of those emotions of the assailant could be hate as well, couldn't it, doctor?\" That kind of testimony indeed would not qualify for the diminished-capacity charge. It might be a mitigating factor in a capital-sentencing proceeding, but surely would not qualify for the diminished-capacity charge.\n\nNonetheless, the admissible testimony of at least one of defendant's expert witnesses purported to establish the presence of a mental disease in the form of a stress-induced psychosis that grew out of the borderline personality disorder, which was described in some detail in the evidence. According to defendant's expert psychiatric witness, that disease or defect affected Moore's cognitive faculties.\n\nGiven the qualitative difference between the evidence in this case and that in Pitts and Carroll, we are unable to agree that any error in the charge can be regarded as harmless. Defendant presented evidence from which a jury could have concluded that the State had failed to prove the requisite state of mind beyond a reasonable doubt.\n\nIII\n\nOther Issues\n\nA.\n\nPretrial Issues\n\n1. Grand Jury Selection\n\nDefendant challenges his conviction on the basis that his indictment and sentence at trial were returned by grand and\n\npetit juries that were unconstitutionally selected. The petit jury issue is mooted by our disposition. On the grand jury issue, defendant asks us to revisit our decision in State v. Ramseur, 106 N.J. 123, 524 A.2d 188 (1987). To repeat what we said there:\n\nAt this time, however, and on the showing made by defendant in this case, we cannot say that the inadequacies in the present system rise to constitutional dimensions. Given the marginal strength of the statistical showing in comparison to other cases, the fact that the mechanism by which jury lists are now constituted is facially neutral and objective, the failure to demonstrate underrepresentativeness over a sufficient period of time, and the State's efforts at reform, we hold that defendant has failed to make a prima facie showing that the Essex County grand and petit jury selection procedures violate either the sixth or fourteenth amendments. [ State v. Ramseur, supra, 106 N.J. at 227-28, 524 A.2d 188.]\n\nThe parties seem to agree that \"Essex County's jury selection procedures had not been altered since this Court's decision in Ramseur.\" They are not, however, referring to the method of selecting the grand-jury foreperson or any practice involving the balance of particular panels. Rather, defendant challenges the \"source list and qualified pool because their underrepresentative composition ignores the defendant's constitutional right to a grand and petit jury drawn from a fair cross-section of the community.\"\n\nWe issued a caveat in Ramseur stating that if a significant statistical disparity were to continue \"over a significant period of time,\" exclusive reliance on motor vehicle lists and voter registration data would become suspect. Id. at 227, 524 A.2d 188. Because defendant did not in this case attempt to demonstrate evidence concerning the caveat in Ramseur, we find that the grand-jury-selection procedures in this case were not unconstitutional.\n\n2. Confession\n\nDefendant contends that his oral and written confessions were obtained in violation of his constitutional rights.\n\nTwo critical issues have arisen with respect to the confessions: (1) were the confessions the tainted product of an illegal arrest?; and (2) did the questioning continue after defendant had requested the assistance of an attorney?\n\nConcerning both, the law is of course well settled. See Dunaway v. New York, 442 U.S. 200, 99 S. Ct. 2248, 60 L. Ed. 2d 824 (1979) (incriminating evidence given by defendant to police during an illegal detention inadmissible when no intervening event breaks the connection between defendant's illegal detention and the incriminating evidence); State v. [Richard] Johnson, 118 N.J. 639, 573 A.2d 909 (1990) (unlawful detention of defendant by police followed by refusal to allow defendant to see counsel necessitated exclusion of statements); Edwards v. Arizona, 451 U.S. 477, 101 S. Ct. 1880, 68 L. Ed. 2d 378 (1981) (police prohibited from initiating any interrogation of a defendant who has requested counsel); State v. McCloskey, 90 N.J. 18, 446 A.2d 1201 (1982) (interrogation of defendant fourteen hours after his request for counsel without inquiring whether he had spoken to counsel violated defendant's sixth-amendment rights requiring suppression of statements made during interrogation).\n\nEach side presents a vastly different version of what occurred at the station house. According to Moore, he was immediately arrested at the apartment on Monday morning, handcuffed, and literally chained for a period of seven hours before he confessed to the murder.\n\nAccording to the police, they requested that Moore come to the police station to assist in the investigation of the deaths in the family. Despite the fact that he had not been arrested, the police furnished defendant with Miranda warnings when they commenced questioning him in mid-morning of the Monday following the murder. Only gradually did the evidence begin to point inexorably at defendant. Defendant proffered the alibi that he had spent the Sunday evening with Lizzette at the Royal Inn motel. In addition, defendant offered the name of an\n\nindependent witness who could confirm that he was at the Royal Inn motel on the evening of the crime. The police left immediately to pick up Lizzette and run down his alibi.\n\nAs the police ran down each of the leads, they began to find holes in the story. By mid-morning the police had learned from Ennis White that she had called the Moores' apartment at 9:30 p.m. and that defendant had answered the phone, placing him at the scene of the crime at or near the time of death.\n\nThe police also interrupted the questioning to attend the autopsies of the victims. By mid-afternoon they had compiled the written statements from Lizzette and Ennis White and had become convinced that there were serious flaws in defendant's story. He had lied about his whereabouts on the night of the crime. He had a strong motive to end his relationship with his wife.\n\nAccording to the police, it was Moore who asked to see Lizzette. He was told that she was in the Police Captain's office. At about 3:30 p.m. she was brought into the room. The result was graphically described by the police witness: \"They jumped up and hugged each other and he said 'I did it for you,' and she started crying, hollering, and she passed out; I grabbed [her] baby.\" Within the hour defendant received renewed Miranda warnings and gave the oral and written confessions to the murders that he seeks to suppress.\n\nAt the suppression hearing both he and Lizzette insisted that he had repeatedly requested an attorney before he gave his impulsive confession to her in the presence of police or the more formal confessions. Ennis White also testified that she overheard defendant \"ask for a lawyer a few times.\" Were this true, the police could not have continued to interrogate him once he had invoked his sixth-amendment right to counsel. Critical to his case was the credibility of his and Lizzette's testimony and, even more so, the testimony of Ennis White, who might be seen as an impartial witness. The trial court\n\nresolved those credibility issues against defendant and his witnesses.\n\nOn the issue of illegal arrest, the trial court was satisfied, after considering all of the facts, that the State had established beyond a reasonable doubt that the defendant was not arrested on the morning of June 30, but rather had gone to the police station as a natural event in the routine investigation of the deaths in the family. The court noted that he had had quite a few hours to think about and prepare his defense in the case. He had taken the time to hide the bloody clothes and hammer. The court concluded that \"[h]e obviously knew that the police would want to speak to him and he obviously came to the police station with the frame of mind that he could talk his way out of his problems.\" The court noted that he had a good education and a high-level job. He had previous experience with the law and an admitted understanding of Miranda warnings and constitutional rights. He gave information that was helpful to the police and indeed intended to lead them to his alibi witnesses. As a result of that information, the questioning stopped until the various leads had been run down.\n\nOn the question of whether defendant had requested the assistance of counsel, the court was also convinced that that had not been the case. \"He claims that on six or so occasions he asked for a lawyer. I don't believe that testimony.\"\n\nIn support of its factual findings, the court pointed to several inconsistencies in the testimony at the suppression hearing. For example, a request for a lawyer would have been absolutely inconsistent with his purpose in being there, which was, as he himself admitted, to appear cooperative and to try to outsmart the police without in any way admitting any guilty knowledge or responsibility for the crime. Defendant also admitted that he had heard Ennis White's voice in another room at police headquarters, leading to the conclusion that he was not isolated from others since they were but ten or fifteen feet away.\n\nThe court discounted Lizzette's testimony on defendant's request for counsel because her statement to that effect was the product of repeated prodding by defendant's attorneys: \"they kept asking me if he asked for a lawyer.\" The clear inference drawn by the court was that the idea of asking for a lawyer had been placed in her mind by those asking the questions. She would have had to have been rather dull not to have concluded this might be helpful to defendant. Ennis White's testimony might have been viewed more favorably to defendant if she had not lived with a man who had had numerous confrontations with the investigating East Orange Police Department and not been friendly with defendant at work.\n\nIn short, the court concluded: \"Lest there be any question about the ability of Mr. Moore to lie, he has repeatedly admitted on the stand that he lied to the police officers in order to protect himself and that those were deliberate lies.\" It took little further to convince the court that Moore was lying when he said that he had invoked the right to counsel. After all, \"the last thing the defendant had in mind was indicating that he wanted a lawyer since that would interfere with his attempt to talk his way out of the situation, so I do not believe the testimony of Ennis White in that regard. I think she was simply trying to help this defendant.\"\n\nThe trial court was satisfied, after considering all of the facts, that the State had established beyond a reasonable doubt that the defendant had not been arrested on the morning of June 30; that he had come voluntarily to the police station; that he stayed there voluntarily; that he never asked to leave; that he wanted to remain there as the police were continuing their investigation; that he wanted to continue to \"play out his cards as long as he could\" to avoid having these charges leveled against him. The court was further satisfied that all Miranda warnings were given to him; that he was asked if he understood his rights, including the right to have counsel; that he was not actually under arrest when he made the admission to\n\nLizzette. The court therefore concluded that the evidence seized as a result of the confession, the hammer and the clothing, was admissible in the proceedings against him. We believe that those factual findings are well founded in the record, and we sustain those rulings.\n\n3. Voir Dire\n\nDefendant contends that the trial court improperly limited the scope of questioning during voir dire, and that \"the voir dire as a whole was woefully inadequate.\" Although that argument makes a broad-based challenge to the trial court's voir dire, defendant points specifically to three issues that he believes were improperly handled in the voir dire questioning: (1) whether the status of the victims would substantially impair a juror's ability to perform his or her duties; (2) whether jurors had biased attitudes toward mental-health and psychiatric defenses; and (3) whether jurors understood that a defendant is afforded the presumption of innocence until proven guilty. Defendant concludes that the trial court's limitations on these and other relevant questions during the voir dire process deprived him of his \"fundamental right to a fair trial by an impartial jury.\" The State counters that the voir dire was \"thorough in detecting juror bias,\" and that the trial court's \"rulings regarding other areas of questioning were fully in accord with State v. Manley, 54 N.J. 259 [255 A.2d 193] (1969).\"\n\nIn Manley the defense counsel sought to question prospective jurors about their ability to limit their consideration of his prior conviction to its appropriate purpose. The trial court refused to allow such questioning without some representation by defense counsel that defendant would take the stand during trial. On appeal, this Court upheld the trial court's decision to deny defendant's requested question to the voir dire panel. The Manley Court took that occasion to institute revised procedures for jury selection. In doing so, it stated that while \"supplementary questioning [during voir dire ] by counsel personally is not foreclosed entirely, * * * control over its scope\n\nand content is left to the experienced judgment and discretion of the trial judge * * *.\" Id. at 282, 255 A.2d 193.\n\nBefore making that conclusion, the Court also traced the history of voir dire. Under English common law, voir dire of a juror can be conducted only after a party has challenged that juror for cause and even then the voir dire must be conducted in support of that challenge. Id. at 272, 255 A.2d 193. Courts in the United States initially followed the English rule. However, over the last century, American courts moved toward allowing preliminary examination of prospective jurors. Id. at 272-73, 255 A.2d 193. The practice of voir dire evolved from a court-employed mechanism to insure fair and impartial jurors to a trial tactic intended to empanel a jury that is sympathetic to one side. Id. at 281, 255 A.2d 193. The Court gave the following tactics as examples of how attorneys had subverted the \"true purpose of juror examination\":\n\n[E]fforts to indoctrinate, to persuade, to instruct by favorable explanation of legal principles that may or may not be involved, to lecture on the law and the facts and the relation of one to the other, the lecture ending in a question for form's sake. It means also * * * [to ask] the hypothetical question intended and so framed as to commit or to pledge jurors to a point of view or a result before they have heard any evidence, argument of counsel or instructions of the court. [ Id. at 280-81, 255 A.2d 193.]\n\nTo restrict voir dire to its intended purpose, the Court declared that, to the extent feasible, trial judges should interrogate prospective jurors, and may allow supplemental interrogation by counsel at their discretion. Id. at 281, 255 A.2d 193; see also R. 1:8-3(a) (\"parties or their attorneys may supplement the court's interrogation in its discretion\"). The Court concluded:\n\nAdministration of this rule will require trial judges to exercise greater control over the voir dire questioning than has been exercised in our State in modern times. The burden necessarily assumed by them will be compensated for in substantial measure by a shortening of the time for empaneling a jury * * * and by avoidance of the tedium associated with prolix and repetitious questioning, much of which intrudes into the aspect of the trial which should be dealt with by the judge alone at the proper point in the proceedings. [ State v. Manley, supra, 54 N.J. at 282, 255 A.2d 193 (citation omitted).]\n\nIn this case the trial court relied heavily on Manley in limiting the scope of questioning during voir dire. At a pretrial\n\nconference, the court informed counsel that although it would allow questioning by each party, it would not permit any questioning that forced a juror to speculate on how a particular fact would influence his or her deliberations in the case. Rather, the court would permit the question of whether such facts \"would substantially interfere with their ability to follow the law.\"\n\nDefense counsel objected to that limitation repeatedly throughout the proceedings. Defense counsel wanted to ask more open-ended questions of individual jurors. His objection immediately after the voir dire of the first prospective juror more than adequately summarized his problem with the voir dire and the court's restriction: \"[What] we all know is that they will be able to respond [only] robot-like to a question if they will follow the law.\" Defense counsel argued that by not allowing the jurors to express their attitudes and feelings about the particularly troubling facts of the case, the court's limitation of questioning during the voir dire \"avoid[ed] receiving any information whatsoever about this juror.\"\n\nOne of the problems that we have in capital cases is that the constitutionally-limited Adams-Witt standard for disqualification of jurors in capital causes (would their personal views in the morality, utility, or efficiency of the death penalty \"substantially interfere\" with their ability nevertheless to follow and apply the State's death-penalty statute?) gets confused with the more general inquiry into juror predispositions or preferences that should mark the general jury-selection process. Adams v. Texas, 448 U.S. 38, 100 S. Ct. 521, 65 L. Ed. 2d 581 (1980) and Wainwright v. Witt, 469 U.S. 412, 105 S. Ct. 844, 83 L. Ed. 2d 841 (1985). For example, in a non-capital case, we almost invariably would permit questioning of jurors about whether they would be inclined to give more credence to law-enforcement witnesses than to others. However, we do not ask the jurors whether the fact that some witnesses are law-enforcement officers \"would substantially interfere with their ability to follow the law.\" Plain speaking is the best way to get\n\nat such predispositions. The meaning of the Norman-French expression voir dire (\"to speak the truth\") conveys this idea.\n\nIn a sense, voir dire acts as a discovery tool. It is like a conversation in which the parties are trying to reveal the source of any such attitudes without manipulation or delay of the trial. However, in order for that discovery procedure to be effective, potential jurors need to have some basic comprehension about what their legal duties as jurors will be. In that sense, voir dire can act as a teaching tool. When necessary, courts can use voir dire as a way of educating potential jurors to the \"legal requirements\" of their responsibilities as jurors. State v. Leisure, 749 S.W. 2d 366, 375 (Mo.1988).\n\nAlthough the voir dire issues have become moot because of the Breakiron/Humanik disposition, we believe the overall conduct of the voir dire in this case was sufficiently probing to assure that defendant received a fair trial by an impartial jury. We offer these comments for guidance in future capital trials.\n\na.\n\nDefendant's first argument involves the status of the victims, namely, the fact that Melva Moore was pregnant and Kory Moore was less than two years old at the time of their deaths. At the pretrial conference defense counsel offered the following question for voir dire consideration:\n\nIf it appeared from the evidence that Melva Moore was six months pregnant or Kory Moore was eighteen months old when he died, would that circumstance substantially interfere with your ability to perform your duties?\n\nThe trial court would not permit this question because it would be asking jurors to speculate \"on what they might do or how their verdict might be influenced by certain contingencies.\" In its view, that questioning would contravene the intended scope of voir dire as contemplated by this Court in Manley. An early colloquy between court and defense counsel highlights their differences over the scope of the questioning:\n\n[COUNSEL]: Your Honor, at this time, I'd like to note several things. First, our continuing objection to your Honor's precluding us from asking what we\n\nconsider to be extraordinarily significant questions pertaining to this particular case. I'm not going to reargue anything about that.\n\nThe most important [remaining] question, your Honor, deals with the child victim and the fact that Melva Moore was pregnant. Simply asking whether they have any feelings about the fact that a child was killed, which we are permitted to ask is not sufficient.\n\nTHE COURT: You want to ask them what the effect on them would be of the child being killed.\n\n[COUNSEL]: Whether they feel that a child was killed, first, that they would be more likely to convict -- whether they would be more likely to convict merely for that reason; and more importantly, whether if a conviction is rendered, whether they would be more likely to impose the death penalty. In other words, whether they would create their own aggravating factor.\n\nThe court resisted this line of questioning, in part, it said, because killing a child could in itself be an aggravating factor, but more, we think, because of what it perceived to be the strictures of Manley. That approach overreads the purpose of Manley, which was not to eliminate judicial inquiry into juror biases in the context of the case but rather \"to limit more stringently the conduct and scope of the voir dire.\" 54 N.J. at 280, 255 A.2d 193. For the Manley Court, this limitation of voir dire meant\n\neliminating the efforts to indoctrinate, to persuade, to instruct by favorable explanation of legal principles that may or may not be involved, to lecture on the law and the facts and the relation of one to the other, the lecture ending in a question for form's sake. It means also a prohibition of the hypothetical question intended and so framed as to commit or to pledge jurors to a point of view or a result before they have heard any evidence, argument of counsel or instructions of the court. [54 N.J. at 280-81, 255 A.2d 193.]\n\nYet, in spite of the trial court's early resistance to a more open voir dire, we believe that, as a whole, the voir dire was sufficiently probing in its attempt to weed out any prospective jurors who indicated through their answers that the facts of this case might impair their ability to decide defendant's guilt or innocence or decide the correct sentence.\n\nWe begin by noting that this voir dire, like others that we have seen, gradually took on a rhythm of its own as the jurors' attitudes became more apparent to court and counsel. In fact, the prosecutor almost invariably asked jurors if they had any\n\nattitudes about the status of the victims that would \"interfere with your ability to be fair and impartial.\" Sometimes defense counsel was permitted to ask without objection: \"Would the fact that one of the victims here was a child influence you so that it would be more likely that you would impose the death penalty?\" At other times the court resisted the question, ruling that counsel was trying to find \"jurors who are sympathetic to your cause,\" and stating that \"the fact that a person would be more likely to convict if it's a crippled person, a totally innocent person, a child, that's not bias. That's not bias at all.\"\n\nIf that is not grounds to excuse for cause, it surely shows a juror who could be excused peremptorily. See State v. Thompson, 142 N.J. Super. 274, 280, 361 A.2d 104 (App.Div.1976) (untruthful responses by juror infringe on \"a valuable incident of the trial process -- the exercise of a peremptory challenge\"). Still, the court was not inflexible. It permitted co-counsel for defendant to ask one juror an open-ended question about whether she had \"any strong feelings or biases or prejudices\" concerning the fact that there was a child victim. Yet, later it would not permit a juror to answer whether she would return a death penalty \"in all situations where the mother was pregnant at the time of the murder.\" The court thought this was asking for a view on the case. Yet, the prosecutor was permitted to ask another person whether, knowing the victims were a pregnant mother and a child, \"it would not be automatic, one way or the other.\"\n\nIn sum, there were occasions when the court seemed to feel that Manley would not permit questions about jurors' attitudes related to the type of case before it. Thus, when counsel asked a juror if the circumstances were such that \"it might be more difficult for you to be fair to Mr. Moore,\" the court sustained objection to the question, ruling: \"You are asking about the effect in a particular case.\" Of course he was. But that is the purpose of voir dire: to see if there are biases or predispositions in the \"particular case\" that is before the court.\n\nThe death-qualification process is \"important, delicate, and complex,\" and requires a \"thorough and searching\" inquiry into \"jurors' opinions and biases.\" State v. Williams, 113 N.J. 393, 413, 550 A.2d 1172 (1988) (Williams II). It is not enough just to ask jurors in a capital case whether the nature of the crimes would affect their ability to be fair in deliberating on a death sentence versus a term of years. The question is correct so far as it goes, but it really invites only one answer. Will many say that they will be unfair? Similar to the voir dire in Williams II, many of the jurors in this case gave rote responses to the question of whether the facts in this case would affect their ability to be fair to the defendant. It is also clear from the record that certain prospective jurors did have prejudices and biases pertaining to the facts of this case and the status of the victims.\n\nObviously, jury selection is not the place for opening statements or closing arguments. Under our single-jury capital-trial system, jury selection must, however, serve double duty as both a time to \"death-qualify\" jurors and a time to enable counsel to exercise the valuable constitutional prerogative of selecting a fair and impartial jury. The purposes of the inquiry are simply not the same, although they tend to overlap. State v. Zola, 112 N.J. 384, 397, 548 A.2d 1022 (1988), demonstrates the overlap and the proper method of dealing with it:\n\n[A]t this initial phase of the trial the jurors fully understood that they would be given specific factors to guide them in the sentencing phase of the trial. The jurors all knew that this was a case of alleged rape-murder; they knew that they would be exposed to photographs that might shock them; they knew that the victim was elderly; they knew that they would be hearing testimony about narcotics; they knew that the case would turn in good measure on expert psychiatric evidence. Each juror was asked if he or she could evaluate such matters fairly and without predisposition. Some immediately and candidly told the court that they could not be impartial where drugs or rape or a helpless victim were allegedly involved. These jurors, as well as all whose professed lack of prejudice wavered on questioning, were discharged for cause.\n\nWe agreed in Zola that it would have been appropriate for the court or for counsel to have asked additional open-ended questions directed to any specific feelings that the jurors might\n\nhave had about capital punishment in that case. We do not view such questioning as involving juror manipulation or juror indoctrination. As noted, an unintended consequence of the establishment of the Adams-Witt test of \"substantial interference\" with a juror's deliberations as the outer boundary for the State's excuse of jurors for cause in a capital case is that trial courts seem inadvertently to have converted that standard into the only inquiry into juror qualifications. That was never the intention of the Supreme Court nor of this Court. Juror voir dire was never intended by Manley to be frozen into a series of \"yes or no\" responses. Judges who choose to question jurors themselves should be open to the suggestions of counsel. In State v. Long, 119 N.J. 439, 480-82, 575 A.2d 435 (1990), our review of the trial court's voir dire suggested how such questioning may proceed:\n\nWhen the court renewed voir dire after the superseding indictment, it acknowledged the prosecutor's suggestion, based on the earlier jury selection, that \"it was most effective last time by letting the juror, to some degree, lead you to where you want to go\" -- in other words, there should be a flexible approach to the questioning rather than a reading of a set formula. The court used familiar examples for evaluating jurors, such as that one would not evaluate the jurors' attitudes in the same way as when they were \"mouthing off in John's bar after a softball game.\"\n\nThe court referred to one occasion on which it had to stop counsel from what it considered an extensive line of questioning, but on the whole it was tolerant of questioning. Indeed, it said that when it detected that attorneys were getting onto a sensitive line of questioning with a few jurors, \"I try to pick it up and ask it so that it doesn't look partisan. I also know that * * * what I mean, you don't want them to get irritated at you. I try to pick up on the line of questioning that you've asked even to the point of throwing in this idea you have asked * * *. To try to give it a balance and even-handedness.\" In short,\n\nthis trial court was quite open to considering the requests of counsel and indeed permitting them to examine witnesses themselves.\n\nTherefore, in accordance with our decisions in Williams II, Long, and Zola, voir dire should allow more open-ended questioning on the issue of the status of the victims as it relates to any prejudice or predisposition affecting the juror's ability to adjudge fairly in the guilt phase or the ability to consider mitigating evidence in any penalty phase. In order to be justified, the inquiry need not necessarily lead to the excusal of any juror for cause. The standard for excusal of a juror for cause does not exhaust the scope of reasonable inquiry that might lead to the exercise of a peremptory challenge.\n\nb.\n\nDefendant argues that the trial court improperly denied him the opportunity to ask prospective jurors about their attitudes toward insanity and mental-health defenses. The court based its decision on State v. Manley, supra, 54 N.J. 259, 255 A.2d 193, and State v. Kelly, 118 N.J. Super. 38, 285 A.2d 571 (App.Div.), certif. denied, 60 N.J. 350, 289 A.2d 795 (1972). Furthermore, the court expressed its belief that such questions would unduly prejudice defendant at that point in the proceedings, due to the fact that defendant had not yet admitted that he had committed the acts. Defense counsel disagreed, and argued that State v. Ramseur, supra, 106 N.J. at 247, 524 A.2d 188, and State v. Williams, 93 N.J. 39, 68, 459 A.2d 641 (1983) (Williams I), mandated a thorough, probing voir dire on any area of potential bias in capital cases.\n\nIn Kelly, defendant was charged with first-degree murder. During voir dire, defense counsel sought to inquire if the prospective jurors had any feelings about the defense of insanity and whether they would accept it if proven. The trial court did not allow that line of questioning, and the Appellate Division affirmed, concluding \"that the objectives of Manley * * * would not be well served by a rule which mandates inquiries of prospective jurors concerning their attitudes as to substantive\n\ndefenses, particularly insanity, or as to other rules of law which may become implicated in the trial or in the court's ultimate charge.\" State v. Kelly, supra, 118 N.J. Super. at 51, 285 A.2d 571.\n\nIntending to follow Kelly, the court waited until the jury-charge portions of both the guilt and penalty phases to address the issue of possible juror bias against the insanity defense and other mental-health defenses. During the guilt-phase charge to the jury, the court stated that the law \"entertains no prejudice against the defenses of diminished capacity or insanity,\" and at the penalty phase instructed the jurors to consider the evidence surrounding mental health with a \"fresh and open mind.\" The State contends that that was sufficient to insure that jurors would not be biased against defendant's mental-health defense, due to the fact that the jurors had sworn to follow and apply the laws of the State in their deliberations. Defendant argues on this appeal that those instructions were insufficient because they occurred too late in the process to permit detection of potential juror bias against the insanity or other mental-health defenses, and that the instructions did not adequately reveal any potential biases held by the jurors.\n\nIn support of that argument, defendant cites People v. Stack, 112 Ill. 2d 301, 97 Ill.Dec. 676, 493 N.E. 2d 339, cert. denied, 479 U.S. 870, 107 S. Ct. 236, 93 L. Ed. 2d 162 (1986), in which the Illinois Supreme Court ruled that an abuse of discretion occurs when a trial court refuses to probe, through voir dire, the jurors' attitudes concerning the insanity defense. The court stated:\n\nA defendant's right to an impartial jury is not, therefore, protected where the sole inquiry into whether jurors will abide by the law allowing that controversial defense is the far broader and all-embracing question which the State contends was propounded in this case, namely, whether the jurors would follow the court's instructions on the law. [ Id. at 313, 97 Ill.Dec. at 81, 493 N.E. 2d at 344.]\n\nThe Stack court also indicated that other jurisdictions had held that a defendant has a right to have questions asked during voir dire concerning prospective jurors' attitudes on the insanity\n\ndefense when that issue is involved in the case. Id. at 313, 97 Ill.Dec. at 82, 493 N.E. 2d at 345 (citing United States v. Allsup, 566 F.2d 68 (9th Cir.1977); Washington v. State, 371 So. 2d 1108 (Fla.App.1979); State v. Olson, 156 Mont. 339, 480 P. 2d 822 (1971); State v. Sanders, 161 W.Va. 399, 242 S.E. 2d 554 (1978), overruled on other grounds, State ex rel. White v. Mohn, 168 W.Va. 211, 283 S.E. 2d 914 (1981)).\n\nIn this case, the concept of mental disease was critical to defendant's case throughout the trial. He conceded at the guilt phase that he had caused the deaths of his wife and child; nonetheless, he argued that he lacked the necessary mens rea requirement of knowingly or purposefully killing Melva and Kory. At the guilt-phase portion of the trial, defendant offered expert psychiatric testimony in support of the mental-health defenses of insanity and diminished capacity, and at the penalty-phase portion defendant alleged two mitigating factors that related to his mental condition at the time of the killings.\n\nThe trial court believed that defense counsel's line of questioning was an attempt to get jurors who would accept an insanity defense if offered. However, our review of the record indicates that defense counsel was merely trying to establish, through his proposed set of questions, whether the prospective jurors could consider an insanity defense. \"Anyone moderately familiar with criminal trials and the public's reaction where juries acquit on murder charges by reason of defendant's insanity knows the strength of these concerns and the vulnerability of the justice system to extreme erosion of confidence. Sociological studies confirm this.\" In re Edward S., 118 N.J. 118, 139, 570 A.2d 917 (1990) (citing Hans, \"An Analysis of Public Attitudes Toward the Insanity Defense,\" 24 Criminology 393 (1986) (89.2% of those polled believed that the insanity defense allowed guilty persons to go free)). Whether that figure is entirely accurate is open to debate; nonetheless, it is well established that many laypersons have a great deal of difficulty in understanding the insanity defense, and many\n\npeople might not be able to consider it as a viable defense, particularly to such a heinous act as the killing of a wife and child. Although the trial court was correct that the intent of the voir dire process is not to solicit jurors who favor one side and, in this case, would accept an insanity defense, it is equally true that the voir dire process should screen out prospective jurors who could not consider an insanity defense due to their prejudices or biases against it. See State v. Jasuilewicz, 205 N.J. Super. 558, 569, 501 A.2d 583 (App.Div.1985) (\"searching\" judicial inquiry on juror attitudes toward insanity defense required in circumstances of the case), certif. denied, 103 N.J. 467, 511 A.2d 649 (1986).\n\nAgain, jury selection need not become a trial within a trial. In a recent non-capital case (involving homosexual murder with an insanity defense), the court submitted to all jurors a questionnaire that asked the jurors if they could fairly evaluate a psychiatric defense to such charges. (A copy of the questionnaire is attached as \"Exhibit A\" for guidance to courts.) Just as it asks for predispositions about law-enforcement testimony, the questionnaire asks whether a juror can judge the testimony of psychiatric witnesses by the same standard that he or she would apply to the testimony of any other witness. In another recent case, State v. Murray, 240 N.J. Super. 378, 392, 573 A.2d 488 (App.Div.1990), the trial court rejected several voir dire questions proposed by the defendant and instead asked its own questions, which \"probed whether the prospective jurors had read or studied about psychology, psychiatry, medicine, or related fields, and inquired about the jurors' views on those sciences and whether those views would hinder their ability to follow the law as instructed by the court.\" In asking its own questions, the trial court in Murray acted properly within its discretion and sufficiently determined any juror bias or prejudice.\n\nc.\n\nDefendant also argues that it was an abuse of the trial court's discretion not to allow defense counsel to question the\n\nprospective jurors about their understanding of burden of proof and the presumption of innocence. Again, the court believed that those issues contravened the intended scope of voir dire as contemplated in Manley, and instead issued its preferred question: \"Could [the juror] accept the law as charged by the court?\" When defense counsel renewed his objection to the court's limitation during the voir dire and claimed that the New Hampshire courts required such questioning, the court responded:\n\n[The] New Hampshire court held, and I disagree thoroughly with their holding, that because they're concerned that some jurors would not know the principle[ ] [of] law that one is presumed innocent and the burden of proof is on the State, because they had read some surveys that had been done by some company, that therefore you had to ask the jurors whether they could accept those particular principles of law.\n\nAll right. That is utterly inconsistent with State [v.] Manley, and I'm not going to do it. And I think it's utterly unnecessary, as long as the jurors indicate that there is nothing they know of about accepting the law of this State.\n\nAlthough Manley may be read as discouraging a requirement of such questioning, preferring instead to place the decision of allowing or prohibiting such questions within the discretion of the trial court, we have expressed our belief that capital cases require a \"thorough and searching inquiry\" in regard to voir dire. Williams II, supra, 113 N.J. at 413, 550 A.2d 1172. Other courts have held that voir dire questions concerning a juror's understanding that (1) a defendant is presumed innocent until proven guilty, and (2) the State has the burden of proving defendant's guilt in a criminal case are required. See, e.g., United States v. Blount, 479 F.2d 650 (6th Cir.1973); People v. Zehr, 103 Ill. 2d 472, 83 Ill.Dec. 128, 469 N.E. 2d 1062 (1984).\n\nThe question, however, is not only what the Constitution requires as either a threshold or limit on questioning, but also what plain inquiries may produce a fair and impartial jury. \"[C]ourt-conducted voir dire is not an end in itself but merely an efficient means to select an impartial jury.\" State v. Long, supra, 119 N.J. at 479, 575 A.2d 435. Would it not be anomalous in the extreme to allow extensive death-qualification of\n\njurors before trial to make sure that they can follow and apply the State's system of capital punishment, yet not to allow defendants a brief, if not cursory, inquiry into jurors' attitudes about other fundamentals of the system, such as the presumption of innocence? Perhaps the general orientation of a panel of jurors will suffice to convey the essentials, with jurors being asked if they have any reservations about their duties as jurors. In the alternative, courts can administer either a questionnaire or brief inquiry of jurors asking them if they can agree and accept the principles of law as the court will state them, including that a defendant is innocent until proven guilty and that the State has the defined burden of proving the defendant's guilt. For example, in a recent capital case, jurors were asked the following questions in a questionnaire:\n\nBecause this is a criminal case it is the law that [the defendant] is presumed innocent until proven guilty beyond a reasonable doubt. That presumption continues throughout the trial and even during deliberations unless and until the jury has reached its verdict. It is the State's burden to prove the guilt of the defendant beyond a reasonable doubt. Will you extend to [the defendant] the presumption of innocence and follow the law as I state it to you?\n\nIf you are selected as a juror, you must render your verdict, based solely on the evidence, and the law as given to you by the court, free of any passion, prejudice, sympathy, or bias, either for or against [the defendant] or the State. Can you be true to your oath or affirmation to do this?\n\n\"The mere fact some inquiry on voir dire may touch on instructions later to be given does not per se render such questions beyond the scope of voir dire.\" Brazel v. State, 296 Ark. 563, 566, 759 S.W. 2d 28, 30 (1988). We are confident that court and counsel can focus any such inquiry on this limited purpose without causing trial delay.\n\nd.\n\nAs a final matter with regard to the voir dire, defendant contends that two prospective jurors were improperly excluded for cause before it was ascertained by a \"clear showing\" that their views would substantially impair their ability to deliberate during the penalty-phase portion of the trial. The first prospective juror in question stated, \"I don't think that I'm\n\n* * * able to say someone has the right to have a death penalty,\" before she was excused. The other juror, while vacillating somewhat in her answers, did express that it was difficult for her to consider imposing the death penalty. Defendant maintains that neither of those prospective jurors indicated a \"clear showing\" of predisposition against the death penalty, and thus should not have been excluded.\n\nWe note that New Jersey has adopted the Adams v. Texas, 448 U.S. 38, 100 S. Ct. 2521, 65 L. Ed. 2d 581 (1980), and Wainwright v. Witt, 469 U.S. 412, 105 S. Ct. 844, 83 L. Ed. 2d 841 (1985), (Adams-Witt) test for excluding prospective jurors for cause. See State v. Ramseur, supra, 106 N.J. at 256, 524 A.2d 188. Basically, the test involves whether, in the trial court's discretion, the juror's beliefs or attitudes would substantially interfere with his or her duties. State v. Koedatich, 112 N.J. 225, 293, 548 A.2d 939 (1988), cert. denied, 488 U.S. 1017, 109 S. Ct. 813, 102 L. Ed. 2d 803 (1989). After reviewing the record, we find no abuse of discretion in the exclusion of these two jurors, based on their statements concerning their inability or unwillingness to impose the death penalty.\n\nB.\n\nTrial Issues\n\n1. Was the blood-spatter-analysis expert sufficiently qualified?\n\nDefendant argues that admission of New Jersey Police Detective Thomas McCormick's testimony on blood spattering violated Evidence Rule 19 and, consequently, defendant's right to due process. He contends that McCormick, who qualified at trial as an expert in crime-scene investigation, including blood spattering and fingerprint identification, should not have qualified as a blood-spatter analyst because he was no more than a technician in the field. His testimony was significant to prove that the killing of Kory was knowing or purposeful, rather than accidental as claimed. Defense counsel did not object to\n\nMcCormick's qualification at trial. Defendant now argues that it was plain error requiring reversal under Rule 2:10-2.\n\nUsing photographs of the scene, McCormick explained at trial that spatter patterns showed that stains of Melva's blood found on Kory's overalls did not come directly from Melva but were transferred by another person, like defendant, or an object, like the hammer. He testified that the location of the stains indicated that the blood was coming down at an angle, trailing off toward the ground, thus signifying that Kory was lying on the floor when the blood reached him. Moreover, based on blood spatters on the wall behind the hamper that was between the two bodies, McCormick testified that Kory was probably struck at least twice while in his final position. He testified that intersecting spatters appeared to come from three different directions. Although some blood might have come from Melva, either directly or via the hammer, he said that three distinct spatters of blood identified with Kory were consistent with the one upward and one downward motion necessary to strike the second blow while Kory lay on the floor.\n\nIn voir dire McCormick testified that he had been a member of the New Jersey State Police for eight years and a crime scene investigator for two years. His duties included photography, evidence collection, fingerprinting, and autopsy attendance. His six-week training course had included a one-day seminar in blood-spatter analysis, which had been supplemented by another day of in-service training. McCormick had investigated more than two hundred crime scenes, at least thirty of them homicides, and had previously testified as an expert in fingerprinting and crime-scene analysis, but had never before testified as a blood-spatter-analysis expert. The trial court found him qualified to testify as an expert in crime-scene investigation, including fingerprint and blood-spatter analysis.\n\nA witness qualifies as an expert under Evidence Rule 19 if there is evidence of the required \"experience, training or education.\" We recently explained that an expert must \"be suitably\n\nand possessed of sufficient specialized knowledge to be able to express [an expert opinion] and to explain the basis of that opinion.\" State v. Odom, 116 N.J. 65, 71, 560 A.2d 1198 (1989). The admission of expert testimony, and its competence, are discretionary judgments of the trial court. State v. Zola, supra, 112 N.J. at 414, 548 A.2d 1022.\n\nDefendant challenges not the scientific reliability of blood-spatter analysis but only the sufficiency of the witness's expertise. Cf. State v. Harvey, 121 N.J. 407, 428, 581 A.2d 483 (1990) (question of sufficiency of expertise not reached where methodology of shoe-print analysis not shown to be reliable); State v. [Walter] Johnson, 120 N.J. 263, 297, 576 A.2d 834 (1990) (question of sufficiency of expertise in blood-spatter analysis not reached where limited probative value of evidence outweighed by danger of undue prejudice); Windmere, Inc. v. International Ins. Co., 105 N.J. 373, 377, 522 A.2d 405 (1987) (reliability of scientific technique of voiceprint analysis at issue, not sufficiency of expert's qualifications). We have stressed that \"[t]he sufficiency of the qualifications of [experts is] primarily a matter for the trial court's discretion and will be reviewed only for manifest error and injustice.\" State v. Ravenell, 43 N.J. 171, 182, 203 A.2d 13 (1964), cert. denied, 379 U.S. 982, 85 S. Ct. 690, 13 L. Ed. 2d 572 (1965).\n\nWe find no error here. The trial court conducted voir dire on McCormick's qualifications. Cf. State v. Philbrick, 436 A.2d 844, 860-61 (Me.1981) (admission of \"expert\" testimony on blood spattering was error when trial court failed to consider and rule on reliability of such testimony and qualifications of witness, and prior testimony of autopsy pathologist called into question use of spatters to show sequence and directions of gunshots). He explained how he had reached his conclusions, and his reasoning was not counterintuitive; it would likely aid rather than bewilder the jury. See State v. Hall, 297 N.W. 2d 80, 86 (Iowa 1980) (blood-spatter analysis has sufficient scientific reliability to aid jury: \"[S]uch observations are largely\n\nbased on common sense, and in fact, lie close to the ken of an average layman.\"), cert. denied, 450 U.S. 927, 101 S. Ct. 1384, 67 L. Ed. 2d 359 (1981). Like comparisons of bullets, tire tracks, or handwriting, blood-spatter analysis submits all the basic data to the trier of fact for exercise of its judgment in evaluating the evidence. See also State v. Zola, supra, 112 N.J. at 415, 548 A.2d 1022 (serology expert's testimony suggesting reasons why blood components missing from sample not counterintuitive); Handler, \"The Judicial Pursuit of Knowledge,\" Part I, 121 N.J.L.J. 882, 883 (1988) (noting concerns that counterintuitive expert testimony may confuse jury). The defense highlighted the witness's lack of specific training and experience both on cross-examination and in summation, allowing the jury to assess the value of his testimony. Although McCormick's expertise may have been minimal, in context the admission of his testimony did not constitute plain error.\n\n8 2. Did the trial court breach a duty to inform defendant of the constitutional right to testify during the guilt phase?\n\nDefendant argues that the trial court violated his constitutional right to testify by failing to inform him of that right and by failing to obtain his knowing and voluntary waiver. We recently affirmed the constitutional right of a criminal defendant to testify on his own behalf. State v. Savage, 120 N.J. 594, 628, 577 A.2d 455 (1990). At the same time, however, we held that \"when a defendant is represented by counsel, the trial court is not required to inform defendant of his right to testify or explain the consequences of that choice.\" Id. at 630, 577 A.2d 455. Rather, it is counsel's obligation to inform defendant of that right as well as the right not to testify, and of the strategic advantages or disadvantages of each. Id. at 631, 577 A.2d 455. We have recommended that the trial court inquire whether counsel has so informed defendant. Ibid.\n\nHere, as in Savage, we find that the trial court breached no duty, because it had no duty to inform defendant of his right to\n\ntestify. On remand, the court should follow the Savage recommendation.\n\n3. Did prosecutorial misconduct lead to an unjust verdict?\n\nDefendant claims that a pattern of prosecutorial misconduct had the cumulative effect of depriving him of a fair trial. He asserts that in the guilt phase, during both cross-examination and summation, the prosecutor improperly attacked the expert testimony of Dr. Gould. See State v. Ramseur, supra, 106 N.J. at 321, 524 A.2d 188 (prosecutor may challenge expert's opinion, but may not pit his own credibility against expert's). At trial, defense counsel made no objection to the cross-examination of Dr. Gould, but the heated interplay between prosecutor and witness prompted the court to admonish both. The court called for a five-minute recess. It cautioned the prosecutor to \"continue on a rational basis,\" by asking clear questions rather than making statements, and cautioned Dr. Gould to answer questions without volunteering additional information. In summation, also unchallenged below, the prosecutor argued that Dr. Gould had \"lost sight of all objectivity\" because his diagnosis was not supported by the evidence, that he \"wanted to mislead\" the jury with his description of a borderline personality, and that the defense \"realiz[ed] that the defense of insanity is just totally false and without any merit whatsoever.\" In addition, defendant claims that the prosecutor committed error when he twice asked defendant on cross-examination if he claimed that other witnesses had lied. Although the court eventually reprimanded the prosecutor sua sponte, defendant contends that the failure to instruct the jury to disregard those questions and answers left the defendant unprotected from the consequent prejudice.\n\nDefendant asserts that in the penalty phase the prosecutor encouraged imposition of a death sentence by focusing on extraneous matters, namely, noting a general need to protect society, implying that justice mandated a death sentence for a double murder, and characterizing expert witness Diana Aviv\n\nas a \"professional bleeding heart who was indeed duped by the defendant.\" He argues that the emotional force of those comments had the potential to divert the jurors from their proper role in the penalty phase, the consideration of aggravating and mitigating factors. See State v. Rose, 112 N.J. 454, 521, 548 A.2d 1058 (1988); State v. Ramseur, supra, 106 N.J. at 322, 524 A.2d 188.\n\nBecause we are reversing on other grounds, we need not determine whether any alleged misconduct constituted reversible error. Williams II, supra, 113 N.J. at 446, 550 A.2d 1172. As we recently reaffirmed in State v. Pennington, 119 N.J. 547, 566, 575 A.2d 816 (1990), the test for evaluating prosecutorial misconduct is \"whether it was so egregious as to deny defendant a fair trial.\" We do not suggest that the prosecutor's comments cumulatively rose to that level. In the guilt phase, his challenges to Dr. Gould's testimony fell short of pitting his own expertise against that of the witness. On remand, however, we caution against comments such as the accusation that the defense realized that the defense of insanity was meritless, which was clearly an improper expression of the prosecutor's own conclusion, without support in the record that defense counsel (or perhaps defendant himself) did not credit the insanity defense. We similarly caution against comments such as those in the penalty phase that discredited the motivations of expert witness Aviv without support in the record, again apparently based only on the prosecutor's own opinion. See State v. Pennington, supra, 119 N.J. at 565-84, 575 A.2d 816, for extensive guidelines for avoidance of prosecutorial misconduct.\n\n4. Did the trial court err in admitting evidence of Melva Moore's pregnancy?\n\nDefendant argues that the fact of Melva's six-month pregnancy was irrelevant, and, if remotely relevant, unduly prejudicial, and that the error of its admission was compounded by the prosecutor's repeated references to it and by the trial\n\ncourt's failure to give a limiting instruction on its use. Defendant moved before trial to exclude that fact from both the guilt phase and the penalty phase. The court denied the motion.\n\nThe court agreed with the State's arguments that the six-month pregnancy was relevant to defendant's state of mind, revealing motive or intent in killing her based on awareness of her vulnerability. In addition it concluded that evidence of the pregnancy was relevant to the asserted defense of diminished capacity as well as the possible defenses of self-defense, imperfect self-defense (a then-plausible theory, see State v. Bowens, 108 N.J. 622, 532 A.2d 215 (1987)), or self-defense as a mitigating factor. The court also accepted the State's argument that defendant's willingness to cause the death of his unborn child was relevant to his state of mind in striking Kory, making an intentional killing more likely. It declined to rule on whether the pregnancy increased the likelihood that Melva had refused to move out, thus providing motive to kill, but noted that that argument alone would probably be insufficient to justify admission of the evidence.\n\nAlthough it rejected the proposition that killing a pregnant woman was in itself an act of depravity, or that a purposeful killing of a viable fetus constituted homicide, the court noted that many would tend to believe that it was murder or to find it morally repulsive. Under an Evidence Rule 4 analysis, it found that evidence of the pregnancy was highly inflammatory. But here defendant was also charged with murdering the infant Kory. The court found evidence of Melva's pregnancy less shocking because the aspect of child murder was already present in the case. It agreed to permit \"appropriate reference to the fact that the wife was six months pregnant at the time of her death,\" as long as the State did not suggest that there was a third victim.\n\nDuring his guilt-phase opening statement, the prosecutor repeatedly referred to Melva as defendant's \"pregnant wife,\" but did not point out the significance of the pregnancy on any\n\nissue. At trial several witnesses testified that Melva was pregnant, but in summation the State made no arguments based on the pregnancy.\n\nBefore the penalty phase defense counsel moved to discharge the jury and to empanel a new jury due to the guilt-phase jury's knowledge of prejudicial facts such as the pregnancy. The court refused, finding that the pregnancy was relevant circumstantial evidence of defendant's state of mind at the penalty phase as well, and indicated willingness to give a cautionary instruction. At the penalty phase the prosecutor made no mention of the pregnancy in his opening statement, but in summation again referred to Melva repeatedly as defendant's \"pregnant wife.\" In response to defendant's objection that the pregnancy was irrelevant at that stage, the prosecutor was permitted to argue that it was probative of defendant's intent to cause mental anguish, factor c(4)(c), as Melva would know that her baby would \"never breathe a breath of life.\" The court later instructed the jurors that pregnancy and its termination are not aggravating factors, and that they \"must not consider either pregnancy or the effect of the defendant's acts upon the fetus as an aggravating factor.\"\n\nWe agree with the trial court's carefully considered judgment that this evidence was admissible. It was potentially relevant to defendant's motive or intent, which was at issue in both phases of the trial, and we find no error in the court's exercise of its discretion not to exclude it under Evidence Rule 4 after weighing its probative and prejudicial value. Pregnancy is subject to the same balancing tests as other evidence. Compare People v. Manier, 184 Colo. 44, 54, 518 P. 2d 811, 817 (1974) (pregnancy of victim and death of fetus \"integral part of the circumstances surrounding the murder\"); State v. Thomas, 470 So. 2d 413, 420 (La.App.1985) (defendant claimed self-defense; victim's pregnancy relevant to \"her size and inability either to attack defendant or to defend herself\") and Givens v. State, 98 Nev. 573, 576, 655 P. 2d 533, 535 (1982) (where victim\n\nwas severely beaten, evidence of advanced pregnancy \"directly bore on * * * whether the physical force used * * * could have been calculated to cause death\") with State v. Watson, 99 Idaho 694, 698, 587 P. 2d 835, 839 (1978) (reference to rape victim's pregnancy at time of trial, not as result of rape, \"far-fetched and irrelevant\"); People v. Pendleton, 24 Ill.App. 3d 385, 392, 321 N.E. 2d 433, 438 (1974) (victim's pregnancy offered to explain futile escape attempt and identification of defendant in company of victim; both reasons \"untenable\" where defendant stipulated to identification); Jacobs v. State, 91 Nev. 155, 158, 532 P. 2d 1034, 1036 (1975) (evidence of pregnancy of woman killed by shotgun blast during grocery store robbery irrelevant but admission harmless) and Burrows v. State, 640 P. 2d 533, 538 (Okla.Crim.App.1982) (evidence of pregnancy irrelevant during guilt phase of capital trial), cert. denied, 460 U.S. 1011, 103 S. Ct. 1250, 75 L. Ed. 2d 480 (1983).\n\nHere, despite pretrial arguments, in the guilt phase the State did not present evidence connecting the pregnancy to defendant's actions. Nevertheless the prosecutor made repeated references to the pregnancy, and defendant did not request, nor did the court give sua sponte, a limiting instruction. The State similarly failed to establish the relevance of the pregnancy to defendant's state of mind at the penalty phase, although there, as noted, the court expressly limited use of the pregnancy as an aggravating factor per se. The liberty of the repeated references to defendant's \"pregnant wife,\" without corresponding establishment of relevance to defendant's state of mind with respect to either victim or to any defense, tended in effect to outweigh probative value with undue prejudice. On remand, both court and counsel shall insure that the evidence of pregnancy is properly limited to its probative purposes. We caution against unnecessarily dwelling on the pregnancy at retrial. Cf. State v. Harvey, supra, 121 N.J. at 425, 581 A.2d 483 (emphasis on victim's recent widowhood improper); State v. Pennington, supra, 119 N.J. at 567, 575 A.2d 816 (emphasis on character and\n\nbackground of victim and impact of death on her family clearly inappropriate).\n\n5. Did the trial court err in admitting photographs of the victims?\n\nThe State introduced into evidence thirty-nine 8\" by 10\" color photographs, twenty-nine from the crime scene and ten from the autopsies. Defendant challenges first, the use of color prints of the victims; second, admission in the guilt phase of two photographs of Melva's head; and third, admission of any photographs in the penalty phase.\n\nFirst, defendant does not dispute the use of color pictures of the crime scene that show no victim, but argues that black and white pictures of the victims, at the scene and at the autopsies, would have had as much probative value with reduced potential for prejudice. Color photographs, even of gruesome aspects of a crime, are not objectionable for their color alone. State v. [Edgar] Smith, 27 N.J. 433, 448-49, 142 A.2d 890 (1958). Moreover, they may have added evidentiary value. Annotation, \"Admissibility in Evidence of Colored Photographs,\" 53 A.L.R. 2d 1102, 1103 (1957). But, like any photographs, they may be excluded when their logical relevance is overwhelmed by their \"inherently prejudicial qualities.\" State v. [Edgar] Smith, supra, 27 N.J. at 449, 142 A.2d 890; see also State v. Polk, 164 N.J. Super. 457, 464-65, 397 A.2d 330 (App.Div.1977) (recommending that particularly gruesome photograph of featureless blood-covered face not be used on retrial absent clear need, and that if used, it be reproduced in black and white to reduce potential for prejudice), aff'd, 78 N.J. 539, 397 A.2d 327 (1979). Thus, color photographs are not per se more suspect than black and white photographs, but are subject to the same tests for admissibility as other evidence.\n\nDefendant conceded at trial that the photographs were not without probative value. We have said that \"the admission of photographs having some probative value, even where cumulative\n\nand somewhat inflammatory, rests within the discretion of the trial judge.\" State v. Belton, 60 N.J. 103, 109, 286 A.2d 78 (1972); see also State v. Thompson, 59 N.J. 396, 420, 283 A.2d 513 (1971) (exercise of trial court's discretion in admitting photographs will not be reversed absent a palpable abuse). Evidence Rule 4 allows the trial court discretion to exclude relevant evidence if the court \"finds that its probative value is substantially outweighed by the risk that its admission will * * * create substantial danger of undue prejudice.\" To demonstrate abuse of such discretion, the danger of undue prejudice must outweigh probative value so as to divert jurors \"from a reasonable and fair evaluation of the basic issue of guilt or innocence.\" State v. Sanchez, 224 N.J. Super. 231, 249-50, 540 A.2d 201 (App.Div.), certif. denied, 111 N.J. 653, 546 A.2d 561 (1988). We find that defendant's general objection to the use of color photographs fails to establish that the court abused its discretion in admitting color, rather than black and white, photographs.\n\nSecond, defendant specifically objects to the admission in the guilt phase of two photographs, S-7 and S-38. Both show Melva's head wounds. Defendant did not specifically object to the admission of S-7 at trial, but in response to defendant's general objection to the color photographs the trial court commented:\n\nS-7 is perhaps the most offensive. This is a shot of the head of the mother. However, in this case, the degree of savagery of the attack, the multiple blows are all evidential with respect to purpose, and therefore, the -- and the same is true with respect to S-8, which shows multiple wounds to the head.\n\nThese are photographs that demonstrate the scene as it was when the defendant was there, and when he left, and are all clearly relevant and admissible and any addition[al] stress that might be caused would not be sufficient to justify a Rule 4 keeping out the photographs, even black and white photograph substitutes.\n\nDefendant describes S-7 as a \"horrible depiction of blood and brain matter,\" unnecessary considering the other twenty-eight crime-scene photographs admitted, including the very similar S-8, and not relevant to defendant's state of mind.\n\nAt trial defendant objected to the admission of both autopsy photographs S-38 and S-39 as duplicative. After excluding S-41 (showing brain matter grasped in Melva's hand), the court admitted S-38, saying: \"S-38 I will allow in evidence as showing the nature of the wound, and what the man was looking at and as relating to the totality of the attack.\" After initially excluding S-39 as \"unduly gruesome,\" the court agreed to the admission of a cropped version to show only two wounds not shown in any other photograph, but excluded S-37 as repetitious. Defendant describes S-38 as \"particularly awful,\" focusing on \"the destroyed portion of Melva Moore's head.\" Although defendant did not dispute the relevance of any photographs at trial, he now asserts that S-38 is not relevant because he conceded killing Melva with a hammer.\n\nThe State responds that both S-7 and S-38 are relevant to intent to kill and probative of \"the nature of the attack and defendant's state of mind.\" Although photographs that tend to establish cause of death may be unnecessary where cause of death is undisputed, they may be admitted when relevant to \"the viciousness of the attack.\" State v. Sanchez, supra, 224 N.J. Super. at 250, 540 A.2d 201. Here the State sought to rebut defendant's position that he was unaware of the nature or quality of his acts in striking Melva. The trial court balanced the probative and prejudicial value of all photographs offered, excluded several, and made specific findings on S-7 and S-38. In admitting them the court did not abuse its discretion.\n\nFinally, defendant claims that none of the photographs was admissible at the penalty phase because none was relevant to any aggravating factor. The trial court admitted the photographs without discussion, but the State asserts that they are relevant to factors c(4)(c) and c(4)(g) concerning both victims. Defendant argues that admission of the photographs in the penalty phase, after their previous admission in the guilt phase, was repetitious and therefore more prejudicial; conversely, the\n\nState sees the second admission as harmless given the earlier exposure.\n\nIn State v. Bey, 112 N.J. 123, 548 A.2d 887 (1988) (Bey II), we noted that the general rule that logically relevant photographs are admissible at the discretion of the trial court applies as well to the penalty phase of a capital case. We stated that in light of the interpretation of the c(4)(c) factor announced in State v. Ramseur, supra, 106 N.J. at 211, 524 A.2d 188, \"[p]hotographs may be admissible on torture and aggravated battery as proof of intent to inflict severe pain or on depravity to show mutilation after death.\" State v. Bey II, supra, 112 N.J. at 183, 548 A.2d 887. More recently, we cautioned that \"the need to balance the ostensible relevance of [photographs] against the likelihood of jury prejudice is especially critical in the penalty phase of a capital case.\" State v. Pitts, supra, 116 N.J. at 638-39, 562 A.2d 1320.\n\nWe discuss elsewhere application of the c(4)(g) factor. See infra at 469-474, 585 A.2d at 889-891. We find no need to present these photographs as proofs to establish that factor, but they are clearly relevant to the c(4)(c) factor. See infra at 474-478, 585 A.2d 891-894. We therefore find no abuse of discretion in their admission in the penalty phase as well as the guilt phase.\n\n6. Did the trial court improperly allow application of aggravating factor c(4)(g) to both victims?\n\nDefendant challenges the dual application of aggravating factor N.J.S.A. 2C:11-3c(4)(g) (killing committed during commission of another killing) to both Melva's and Kory's murders, asserting that such reciprocal use unconstitutionally doubles the effect of what is actually only one aggravating factor. He claims that the use of each killing as an aggravating factor in the other artificially inflates the effect of the underlying facts. In addition, defendant suggests that the aggravating factor is inapplicable to the killing of Melva, because her killing was already in progress when he attacked\n\nKory, and could not have been committed \"while the defendant was engaged in the commission of, or an attempt to commit, or flight after committing or attempting to commit[,] murder * * *.\" N.J.S.A. 2C:11-3c(4)(g).\n\nThe Georgia Supreme Court, addressing that question, concluded that the \"doctrine of 'mutually supporting aggravating circumstances' precludes imposition of two death sentences where the sole statutory aggravating circumstance is that the defendant has committed a double murder.\" Putman v. State, 251 Ga. 605, 614, 308 S.E. 2d 145, 153 (1983), cert. denied, 466 U.S. 954, 104 S. Ct. 2161, 80 L. Ed. 2d 546 (1984). California has also rejected the double application of one of its statutory special circumstances, commission of a multiple murder, that triggers a capital hearing. People v. Harris, 36 Cal. 3d 36, 67, 679 P. 2d 433, 452, 201 Cal.Rptr. 782, 801, cert. denied, 469 U.S. 965, 105 S. Ct. 365, 83 L. Ed. 2d 301 (1984). The California Supreme Court explained:\n\nSince there must be more than one murder to allege this special circumstance at all, alleging two special circumstances for a double murder improperly inflates the risk that the jury will arbitrarily impose the death penalty, a result also inconsistent with the constitutional requirement that the capital sentencing procedure guide and focus the jury's objective consideration of the particularized circumstances of the offense and the individual offender. [Ibid.]\n\nIn New Jersey similarly we seek to provide particular standards to guide a jury in its consideration of the individual crime in order to avoid the risk of arbitrary and capricious imposition of the death penalty. The unnecessary and prejudicial inflation of aggravating circumstances by double-counting of a factor hinders the pursuit of that goal. State v. Rose, supra, 112 N.J. at 527, 548 A.2d 1058.\n\nIn this case, the State argues that no double-counting occurred, that defendant was engaged in the killing of Melva when he killed the baby, and that he was also engaged in the killing of the baby when he killed Melva.\n\nThe defendant counters that this is logically impossible. You either kill A in the course of killing B or kill B in the course of\n\nkilling A. That sounds correct in the abstract, but we have not taken an abstract approach to the capital-punishment law. Such a construction of the factor would assume the improbable, that a murderer would pause in the course of one killing, turn to kill another victim, and then return to finish off the first. There is no such logic or order to mass murder.\n\nNor is there a logical contradiction as in the case of submitting both depravity as to Kory (killing for no reason) and killing to escape detection (killing for a reason). The court told the jury that that was logically impossible. In contrast, we believe that the legislative factor here bespeaks a qualitative judgment that is consistent with logic and with human intuition or experience. Killing Melva is worse because Kory was killed at the same time; and killing Kory is worse when you kill his mother at the same time. There is no double-counting. Each murder is in reality worse.\n\nAnd on the score of logic, the \"killing in the course of killing another\" appears as part of the general \"felony-murder\" aggravating factor that applies to a murder committed \"while the defendant was engaged in the commission of, or * * * after committing or attempting to commit [a felony].\" N.J.S.A. 2C:11-3(c)(4)(g). (For convenience, we use the familiar word \"felony,\" although our Code refers instead to certain specific offenses.) Contrary to defendant's assertions, the statute does not rely on the temporal sequence of the murders to determine application of that aggravating factor. The factor applies to murders committed before, during, or after the commission of a felony, so that the time sequence of the murders is not dispositive of this factor's application.\n\nThus, the robbery or rape of the first of two murder victims would be admissible in determining death eligibility for the murder of the second victim. Would it not be illogical to allow the jury to consider the robbery or rape of the first victim but not allow it to consider the murder of the first victim in determining death eligibility for the murder of the second?\n\nWhy should the frames be frozen so that murder is the only felony that cannot apply reciprocally?\n\nThe argument may be made that the double-duty aspect of the factor in the joint trial of two killings produces the randomness that the United States Supreme Court condemned in Gregg v. Georgia, 428 U.S. 153, 189, 96 S. Ct. 2909, 2932, 49 L. Ed. 2d 859, 883 (1976) (discretion of jury to impose death sentence must be \"suitably directed and limited so as to minimize the risk of wholly arbitrary and capricious action\"). For example, if Moore had killed Melva first and then Kory a month later, the jury in Melva's case (if the cases were tried separately as they probably would be) would not hear evidence of the yet-unproven killing of Kory. If there were a conviction in Melva's case, Kory's jury would, however, hear the aggravating factor of the prior murder of Melva. The reason that Melva's jury does not consider Kory's killing is not that it is not relevant or logical to death-worthiness, but rather that it has not yet been proven. Parenthetically, were there a later retrial for Melva's murder, a jury would be permitted to consider the later-entered conviction of defendant for the killing of Kory. State v. Biegenwald, 110 N.J. 521, 542 A.2d 442 (1988) (Biegenwald II). Each jury would have considered the later murder, yet there would be no double-duty service by the factor. The same legislative policy that we upheld in Biegenwald II applies here. The jury should be permitted to consider the whole person of the killer before sentencing.\n\nNeither the Georgia nor California solution is particularly helpful. Georgia appears to permit the factor to be considered reciprocally by the sentencing jury, but then the court \"arbitrarily [that is the court's word] eliminate[s] the aggravating circumstance supporting the death penalty for the murder\" of one of the reciprocal victims. Waters v. State, 248 Ga. 355, 367, 283 S.E. 2d 238, 250 (1981), cert. denied, 463 U.S. 1213, 103 S. Ct. 3551, 77 L. Ed. 2d 1398 (1983). That is of doubtful comfort to a defendant awaiting execution on the remaining conviction. Moreover, where other aggravating circumstances are found,\n\nthe reciprocal use of this aggravating factor (killing in the course of killing) does not require reversal of either sentence. Blanks v. State, 254 Ga. 420, 330 S.E. 2d 575 (1985), cert. denied, 475 U.S. 1090, 106 S. Ct. 1479, 89 L. Ed. 2d 733 (1986).\n\nCalifornia seems to have focused on the duplicity of the \"special circumstance\" of a \"multiple murder\" that serves in California to trigger the eligibility for capital sentencing. The court in People v. Harris, supra, 36 Cal. 3d at 67, 679 P. 2d at 452, 201 Cal.Rptr. at 801, concluded that \"alleging this special circumstance with each murder count results in a finding of two special circumstances,\" which the court felt \"inflate[d] the risk that the jury will arbitrarily impose the death penalty.\" Of course it inflates the risk, but just why that occurs \"arbitrarily\" is not explained. After all, the jury in a California death-eligible cause will consider all \"the circumstances of the crime.\" Id. at 61, 679 P. 2d at 447, 201 Cal.Rptr. at 796. How it avoids considering the other murder is not at all clear.\n\nOf course, we do not allow aggravating factors to be totalled up as bean-counters would do, causing numbers to tip the scale. Capital sentencing is not a numbers game. Our juries are instructed that when the same evidence may support different statutory factors, it ought not be given automatically cumulative weight. State v. Hightower, 120 N.J. 378, 422, 577 A.2d 99 (1990); State v. Rose, supra, 112 N.J. at 527, 548 A.2d 1058. Had there been two children killed in the apartment, there would be only one statutory aggravating factor in Melva's case. A statutory factor such as c(4)(g) is given to the jury to guide and channel its discretion. The factor determines both death eligibility and deathworthiness. It is for the jury to decide what weight to give it on the basis of the evidence that supports it.\n\nIn sum, neither constitutional principle nor statutory intent forbids a jury to consider reciprocal double murders in determining deathworthiness in each. We cannot conceive that the Legislature would have intended the sentencing jury to parse\n\nout the murders to see if some were primary and others secondary. Would one such as Richard Speck be considered as though he had killed only once as to all but one of his victims? See People v. Speck, 41 Ill. 2d 177, 242 N.E. 2d 208 (1968) (in the course of one criminal episode, defendant murdered eight young women in Chicago town house).\n\n7. Did the trial court improperly allow application of aggravating factor c(4)(c) to both victims?\n\nPrior to the start of the penalty phase, the State represented that it would not produce any additional direct evidence in support of the aggravating factors alleged. Defense counsel then moved to have aggravating factor c(4)(c) (killing was outrageously or wantonly vile, horrible, or inhuman in that it involved torture, depravity of mind, or an aggravated assault to victim) dismissed with regard to both killings. N.J.S.A. 2C:11-3c(4)(c). The court denied that motion, and submitted factor c(4)(c) in respect to both victims, although limiting it in Kory's case to the depravity prong. The jury found the c(4)(c) factor to exist in relation to both victims -- aggravated assault on Melva and depravity of mind concerning Kory. Defendant now renews his challenge of the submission of the c(4)(c) factor to the jury, and further alleges that the jury's findings in relation to the c(4)(c) factor were against the weight of the evidence. Because of the facts of this case and the jury's findings, we must analyze separately defendant's argument with regard to each victim.\n\nAs to Melva, defense counsel argued pre-penalty phase that no evidence existed that defendant had intended to inflict physical or mental pain. However, the prosecutor alleged that defendant's hatred of his wife drove him not only to kill her, but to inflict as much pain as possible while doing so. In support of his claim, the prosecutor read the transcript testimony of psychiatrist Dr. Gould, in which he said that he believed defendant wished to punish and inflict pain on his wife. The prosecutor also referred to the autopsy report, which indicated\n\nthat the blows to Melva's head were painful and that she was conscious for at least one of the subsequent blows.\n\nIn State v. Ramseur, supra, we explained that the \"essence of the legislative concern [in regard to the c(4)(c) aggravated battery/torture factor] is the defendant's state of mind,\" and that \"[s]ociety's concern, the community's concern, [and] the Legislature's concern, is to punish most harshly those who intend to inflict pain, harm, and suffering -- in addition to intending death.\" 106 N.J. at 207-08, 524 A.2d 188. We described aggravated assault and torture as follows:\n\nthe class of murders in which defendant intended to, and did in fact, cause extreme physical or mental suffering -- in addition to death. The state of mind that we require corresponds to our Code's \"purposeful\" definition. Thus, the extreme physical or mental suffering must be precisely what defendant wanted to occur in addition to death. [ Id. at 208-09, 524 A.2d 188(footnotes omitted).]\n\nDefendant claims that his confession did not indicate an intent to inflict pain, but rather that his actions were the product of instantaneous rage. He compares his case to that of the defendant in State v. Rose, supra, where we found that a single, fatal shot fired from a shotgun at close range offered \"no proof that defendant's intention was to cause [the victim] to endure pain and suffering, rather than to kill him.\" 112 N.J. at 531, 548 A.2d 1058. Defendant also cites State v. Hunt, 115 N.J. 330, 389, 558 A.2d 1259 (1989), as stating our concern that the c(4)(c) factor might be overused by prosecutors in capital cases.\n\nThe State argues that there was sufficient evidence to permit a finding that defendant meant to inflict pain on Melva, stating in its brief that a \"qualitative examination of all the circumstantial evidence and the logical inferences it produces concerning defendant's state of mind\" supports the conclusion that \"[b]ased upon his hate for Melva and his desire to get her out of his life, he wanted her to suffer severe pain prior to death by beating her repeatedly in the head.\" The State cites the facts in State v. Gerald, 113 N.J. 40, 549 A.2d 792 (1988), as analogous to defendant's act against his wife. Recall that in Gerald the defendant had \"stomped\" and beaten his victim to death.\n\nThere we did not \"agree with defendant that [the] record [was] insufficient to sustain a finding that the defendant intended to and did cause\" severe physical or mental suffering prior to death. Id. at 66-67, 549 A.2d 792. The State maintains that in this case, as in Gerald, the record is sufficient to support a c(4)(c) aggravating factor with regard to Melva's death.\n\nThis case, then, falls between Rose and Gerald. The potential for pain in this case is vastly greater than in Gerald; the case approaches State v. McDougald, 120 N.J. 523, 577 A.2d 419 (1990), a blunt-instrument killing in which we allowed the c(4)(c) assault/torture factor to stand. In McDougald, the defendant's sadistic attack on his two victims accompanied by his vindictive statements to one and his return to kill the other clearly justified application of the c(4)(c) factor, based on his manifest intent to cause severe physical or mental suffering to his victims. 120 N.J. at 559, 577 A.2d 419. As we noted in State v. Matulewicz, 115 N.J. 191, 199-200, 557 A.2d 1001 (1989), the intent of the defendant to inflict torture or aggravated battery upon the victim may be inferred from the surrounding circumstances. For example, returning to a dying victim, inflicting wounds and suffering different in nature from the lethal injuries, or expressing an intent to torture could evidence an intent sufficient to support a charge on a c(4)(c) factor. Ibid.\n\nIn this case, it is certain that Melva suffered pain as a result of defendant's attack. The State pointed to Dr. Gould's testimony as evidence that defendant intended for her to suffer as she died. We conclude that the State did present sufficient evidence to submit that factor to the jury, and that the jury's verdict was not against the weight of the evidence. On remand, Dr. Gould's testimony will have to be weighed carefully by the jury, especially in light of defendant's contention that the prosecutor read the testimony out of context. The jury must consider whether defendant intended to torture or inflict on Melva \"pain, harm, and suffering -- in addition to intending\n\n[her] death,\" Ramseur, supra, 106 N.J. at 208, 524 A.2d 188, or whether the pain she suffered, although horrible, was caused by the act of killing.\n\nIn regard to Kory, defense counsel argued pre-penalty phase that \"depravity of mind\" required more than just a senseless act of killing, and that the \"ultimate issue was that it was done for the pleasure of the killing.\" The court refused to strike the factor on that basis. The State argued during its summation that defendant killed Kory \"because he was there.\" Furthermore, the prosecutor again referred to Dr. Gould's testimony, in which he concluded that the killing of Kory was a \"totally senseless act without any reasonable motivation.\" The State concluded that since \"[t]here was no reason [for the killing] * * * that's what makes this a depravity of mind.\"\n\nIn Ramseur we defined \"depravity of mind\" as follows:\n\nThese words mark society's concern to punish severely those who murder without purpose or meaning as distinguished from those who murder for a purpose (albeit a completely unjustified purpose). This term isolates conduct that causes the greatest abhorrence and terror within an ordered society, because citizens cannot either in fact or in perception protect themselves from these random acts of violence. The killer who does it because he likes it, perhaps even because it makes him feel better, who kills bystanders without reason, who kills children and others whose helplessness would indicate that there was no reason to murder, evinces what we define as depravity of mind. [106 N.J. at 209, 524 A.2d 188 (footnotes omitted).]\n\nThe Court clarified the last portion of that definition by saying that \"the helplessness of the victim\" was not enough to permit a finding of depravity, but rather that that fact \"usually demonstrates the senselessness of the killing.\" Id. at 209 n. 36, 524 A.2d 188.\n\nThe trial court relied heavily on that definition in ruling that the c(4)(c) aggravating factor could be applied to the killing of Kory. We did not, however, intend that the helplessness of the child, in itself, establish depravity under c(4)(c). But we note that, in addition, in response to defense counsel's assertion that Kory's killing did not meet the Ramseur definition of \"depravity of mind\" because defendant claimed that he did not\n\nknow why he killed Kory, the trial court referred to another section of Ramseur, in which the Court concluded that depravity of mind should apply to \"the defendant who killed * * * because the victim just happened to be in the area, or for no reason at all.\" Id. at 211, 524 A.2d 188.\n\nIt is a close question whether the randomness or senselessness discussed in Ramseur applies to this situation. The defendant argues that the record does not suggest that he killed Kory for pleasure or for the thrill of it, but that his attack on Kory resulted from a moment of instantaneous rage. Although it could be said that the act was senseless, we do not believe that it was analogous to the acts of mass murderers or those who kill strangers for pleasure. At the same time, the question is closer than that in State v. Matulewicz, supra, 115 N.J. at 198, 557 A.2d 1001, where the State made no claim that the depravity-of-mind element had been satisfied when the defendant struck his infant child's head and then shook her until she stopped breathing.\n\nOn balance, we cannot say that a jury should be precluded from returning a c(4)(c) depravity finding regarding Kory on the basis that defendant killed Kory for no reason at all. It may seem to us to have been rage, but there is enough for a jury to find otherwise.\n\n8. Did the trial court improperly exclude relevant mitigating evidence during the penalty phase?\n\nDefendant contends that exclusion of opinion testimony on his proper punishment violated his eighth- and fourteenth-amendment rights to offer as mitigating evidence \"any aspect of a defendant's character or record and any of the circumstances of the offense that the defendant proffers as a basis for a sentence less than death.\" Lockett v. Ohio, 438 U.S. 586, 604, 98 S. Ct. 2954, 2965, 57 L. Ed. 2d 973, 990 (1978). The trial court excluded as irrelevant opinions by friends and family that defendant's life should be spared and their pleas for mercy,\n\nalthough it allowed witnesses to testify to their love for him and his own love for his son, to his character, and to his troubled childhood. It also allowed defendant's mother to ask the jury \"not to give him the death penalty.\"\n\nThe United States Supreme Court, in Lockett v. Ohio, supra, 438 U.S. at 604 n. 12, 98 S. Ct. at 2965 n. 12, 57 L. Ed. 2d at 990 n. 12, expressly reserved the authority of the trial court to exclude \"as irrelevant, evidence not bearing on the defendant's character, prior record, or the circumstances of his offense.\" This Court considered the scope of such \"character\" evidence in State v. Davis, 96 N.J. 611, 477 A.2d 308 (1984), where we interpreted N.J.S.A. 2C:11-3c(5)(h) (including as mitigating factors evidence \"relevant to the defendant's character or record or to the circumstances of the offense\"). In Davis we said that \"'character' * * * can and should embrace those individual qualities that distinguish a particular person.\" 96 N.J. at 618, 477 A.2d 308. There we held admissible at the penalty phase of a capital trial statistical data that would aid in evaluating \"an individual defendant's potential for rehabilitation.\" Id. at 617, 477 A.2d 308.\n\nMore recently, in State v. Rose, 120 N.J. 61, 65, 576 A.2d 235 (1990), we emphasized the need for mitigating evidence to be specific to the defendant. There we held inadmissible testimony by clergymen on the religious propriety of the death penalty and by a sociologist on its deterrent effect, finding such testimony general, rather than particular to the defendant. Id. at 64-65, 576 A.2d 235. The testimony at issue here, although not statistical, is similarly nonspecific to defendant's character. A witness's opinion on what punishment is appropriate reveals only the witness's own state of mind. It cannot reveal defendant's character beyond whatever may be inferred from admitted testimony on the witness's love for him. We decline to extend the \"narrowly-defined right\" of allocution accorded the capital defendant, State v. Zola, supra, 112 N.J. at 431, 548 A.2d 1022, to allow witnesses to plead for mercy. We\n\naccordingly find that it was within the discretion of the trial court to exclude such testimony. However, it is uniquely natural and human for some witnesses, especially close family members, to wish to plead for mercy. Given the impermissible inferences that might arise if a close relative did not plead for mercy while testifying, it was within the trial court's discretion to permit the testimony of one such as defendant's mother, as long as it was not cumulative.\n\n9. Did the trial court improperly instruct the jury on mitigating factor c(5)(h)?\n\nDefendant contends that the trial court also violated his eighth- and fourteenth-amendment rights to admission of mitigating evidence, delineated in Lockett v. Ohio, supra, 438 U.S. at 604-05, 98 S. Ct. at 2964-65, 57 L. Ed. 2d at 990, by erroneously instructing the jury on mitigating factor N.J.S.A. 2C:11-3c(5)(h). The court instructed the jurors that they could \"consider [in mitigation] anything relating to or concerning defendant's life, his character, his characteristics and the circumstances of the crime under consideration.\" Defendant argues that that instruction was improperly limited because it failed to instruct expressly that any such factor could be given independent weight and failed to explain the kinds of factors that could be considered. He challenges this instruction for the first time on appeal.\n\nWe rejected a similar independent-weight argument in State v. Ramseur, supra, 106 N.J. at 295, 524 A.2d 188, where we held that the trial court \"did not inhibit the independent consideration of mitigating factors.\" There the court instructed: \"If any evidence has been presented with respect to a mitigating factor, you are bound by the law to consider it and weigh it against any aggravating factor or factors that you have found to be present.\" Id. at 296, 524 A.2d 188. Here the court instructed similarly:\n\nIf there is evidence of a mitigating factor, you must consider that evidence and give it such weight as you deem appropriate. In other words, if any\n\nevidence has been presented with respect to a mitigating factor, and you find the mitigating factor to be present, you are bound by the law to consider it, and weigh it against any aggravating factors you have found to be present.\n\nWe find that this instruction, like the one in Ramseur, satisfies the requirements of Lockett v. Ohio that the jury be free to give independent weight to mitigating facts.\n\nWe also reject defendant's claim that the court inadequately defined the scope of mitigating factors. Without specifying the kinds of factors to be considered under c(5)(h), the court described such factors expansively, instructing:\n\nAll mitigating evidence is to be considered by you, whether it appeared during the first part of the trial from witnesses called by the State, or from witnesses called by the defendant, or from the physical evidence which you will have in the jury room. Or if it appeared during this phase of the trial, from evidence produced by either side.\n\nThis satisfied the Lockett v. Ohio requirement \"that the sentencer * * * not be precluded from considering as a mitigating factor, any aspect of a defendant's character or record and any of the circumstances of the offense that the defendant proffers as a basis for a sentence less than death.\" 438 U.S. at 604, 98 S. Ct. at 2965, 57 L. Ed. 2d at 990. We have previously discussed the court's duty to explain mitigating factors, see State v. Pennington, supra, 119 N.J. at 596, 575 A.2d 816; State v. Bey II, supra, 112 N.J. at 168-69, 548 A.2d 887. There is no need to ask for separate jury verdicts on the basis of any evidence of the catchall factor found in any aspect of defendant's life or character. Jurors need not be unanimous with respect to mitigating factors. State v. Bey II, supra, 112 N.J. at 159, 548 A.2d 887. Hence, any juror may find the catchall c(5)(h) factor to be present on the basis of any one or all of the evidentiary bases submitted by the defendant. Such a juror would have to be convinced beyond a reasonable doubt that the aggravating factors unanimously found outweighed the mitigating factors, including the catchall factor as that juror had qualitatively found it.\n\n10. Did the trial judge improperly instruct the jury on the requirements for finding and weighing aggravating factors?\n\nDefendant asserts that the trial court erred by instructing the jury at the penalty phase that life imprisonment would result if it unanimously found no aggravating factors or unanimously found that the aggravating factors did not outweigh the mitigating factors. Defendant argues that those instructions gave the erroneous impression that life imprisonment would result only if those findings were unanimous. Clearly, unanimity is not required on negative findings of aggravating factors, although it is required on positive findings. N.J.S.A. 2C:11-3c(3)(a), construed in State v. Bey II, supra, 112 N.J. at 158-59, 548 A.2d 887. In fact, the statute requires that in a death-penalty case \"[t]he jury shall also be informed that a failure to reach a unanimous verdict shall result in sentencing by the court pursuant to subsection b [thirty-year imprisonment].\" N.J.S.A. 2C:11-3f; see also State v. Ramseur, supra, 106 N.J. at 312, 524 A.2d 188 (Legislature intended that juries be informed of, and free to exercise, their option to return non-unanimous verdict resulting in imprisonment).\n\nThe trial court charged the jury:\n\nEach juror who has found that a mitigating factor exists or that mitigating factors exist, must weigh the aggravating factor or factors against such mitigating factor or factors as that juror believes to be present.\n\nIf you unanimously find that the State has failed to prove beyond a reasonable doubt any aggravating factor as to a victim, the punishment shall be imprisonment as to that victim.\n\nIf you unanimously find that the State has proven one or more aggravating factors beyond a reasonable doubt, and that beyond a reasonable doubt such factor or factors outweigh the mitigating factor or factors, you have found to exist, then the punishment shall be death.\n\nIf you unanimously find that the State has failed to prove beyond a reasonable doubt that the aggravating factor or factors outweigh the mitigating factor or factors, then the punishment shall be imprisonment as to the victim under consideration. [Emphasis added.]\n\nOn their face the statements on unanimous findings of the State's failure to carry its burden of proof, although correct as\n\nfar as they went, could give the impression that unanimity is required for the result of life imprisonment. Subsequent instructions, however, made it clear to the jury that any lack of unanimity on capital punishment would block that result. The court further charged:\n\nIf, after a full discussion, you cannot reach a unanimous verdict on the question of punishment as to a murder, then in that case the sentence will be imprisonment for that crime for the term of years previously described and up to life.\n\nMoreover, the penalty-phase verdict sheet shows that the jurors not only understood that unanimity was not required to reject an aggravating factor, but also that unanimity was required to find it. They found no depravity of mind concerning Melva by a vote of ten in favor to two against.\n\nIn the context of the entire charge, which conveyed to the jury the requirement of unanimity on positive findings, we believe that the somewhat misleading charge caused no prejudice to defendant. To avoid confusion, however, on remand the trial court should take care to instruct the jury uniformly that unanimity is not required for a sentence of imprisonment. State v. Clausell, 121 N.J. 298, 346, 580 A.2d 221 (1990).\n\n11. Should the trial judge have informed the jury that it could return a life verdict regardless of the outcome of the weighing process?\n\nDefendant argues that although the jury unanimously found that aggravating factors outweighed mitigating factors, the absence of a further determination that death was the appropriate punishment violated state and federal guarantees against cruel and unusual punishment. We rejected that argument in State v. Ramseur, supra, 106 N.J. at 316 n. 80, 524 A.2d 188. There we explained that as long as the jury is fully aware of its responsibility for the sentencing verdict, a specific finding that \"death is an appropriate punishment\" is unnecessary. Ibid.; see State v. Zola, supra, 112 N.J. at 437, 548 A.2d 1022 (no\n\nincantation or specific finding required as long as instructions impart jury's obligation).\n\nWe find no error in the absence of any admonition to the jury that it could exercise discretion despite the result of its weighing of aggravating and mitigating factors.\n\n12. Should the trial judge have informed the jury that there is a presumption against the death penalty?\n\nDefendant argues that this Court's imperative that \"the State must prove beyond a reasonable doubt that the aggravating factors outweigh the mitigating factors,\" State v. Biegenwald, 106 N.J. 13, 67, 524 A.2d 130 (1987), constitutes a presumption against the death penalty analogous to the presumption of innocence. He further argues that an instruction on that presumption is constitutionally required. We ruled in State v. Rose, supra, 112 N.J. at 545, 548 A.2d 1058, however, that no principle of state or federal constitutional law requires an instruction on any such \"'presumption' against the death penalty.\"\n\nC.\n\nGerald Issue\n\nDefendant contends that he was denied the benefit of a charge in accordance with State v. Gerald, supra, 113 N.J. 40, 549 A.2d 792. In that case we ruled that in order to establish death eligibility, the jury must determine that the defendant had the knowledge or purpose to kill and not the knowledge or purpose merely to inflict serious bodily injury that happened to result in death. The jury's verdict must establish that the defendant had the knowledge or purpose to kill. In this case, the trial court foresaw the Gerald problem and charged the crime of capital murder only in terms of the defendant's having a knowledge or purpose to kill. The jury returned that verdict on the verdict sheet. Defendant did not object to the charge or ask for a separate charge on serious-bodily-injury (SBI) murder.\n\nDefendant did receive manslaughter charges. Because we must remand the matter, we need not resolve on this record whether it was plain error not to have charged SBI murder separately. State v. Long, supra, 119 N.J. at 464, 575 A.2d 435. We add these comments for guidance on remand.\n\nThis case falls on the spectrum of decisions somewhere between State v. Pitts, supra, 116 N.J. 580, 562 A.2d 1320; State v. Hunt, supra, 115 N.J. 330, 558 A.2d 1259; State v. Harvey, supra, 121 N.J. 407, 581 A.2d 483; and State v. McDougald, supra, 120 N.J. 523, 577 A.2d 419. (State v. Davis, 116 N.J. 341, 561 A.2d 1082 (1989), and State v. Jackson, 118 N.J. 484, 572 A.2d 607 (1990) were plea cases in which the defect was not in the charge but in the factual basis furnished for the plea). In Pitts, Hunt, Harvey, and McDougald, we concluded that the evidence was minimally adequate to require the trial court to charge the jury on SBI murder. In Pitts, we found the failure so to charge was harmless error, because the nature of the blows was so violent and defendant so trained in killing that no other jury verdict seemed possible, especially in light of the theory of the defense that it was a Vietnam-flashback killing. 116 N.J. at 619-20, 562 A.2d 1320. In Hunt, which was a multiple-stabbing case, we did not have to resolve the issue because of other matters in the case. 115 N.J. at 376, 558 A.2d 1259. In Harvey, because the defendant stated that he had struck one blow without an intention to kill -- a blow that might nonetheless have caused the death of the victim -- there was a factual basis to submit the issue to the jury and the error was not harmless. 121 N.J. at 414, 581 A.2d 483. In McDougald, where the evidence was inescapable that the defendant had but one purpose in mind -- to end the life of his victims as evidenced by his return to kill one and his boasting of having killed both -- we concluded that the absence of a Gerald charge was harmless in the circumstances. 120 N.J. at 558-60, 577 A.2d 419.\n\nOn the remand then, with respect to Melva, a court cannot foreclose the jury from considering a defense by Moore that he\n\ndid not intend to kill his wife but lost control of himself and struck her, causing her to die, without intending her death. Given the force and severity of the blows, it is not likely that a jury will credit this story, but it is for a jury to decide.\n\nIn the case of Kory, it seems much less likely that there would be any rational basis from which it could be inferred that repeated hammer blows to the baby's head could form the basis of an SBI murder charge. Moore's defense may be accident; in that event the crime could be manslaughter, not murder. However, assuming the jury finds the blows were intentional and not accidental, it hardly seems possible such an actor would not be practically certain that death would result, thereby satisfying the mental-state prerequisite to murder. In any event, we cannot now conjecture as to what the proofs will be in a new trial. The remand court must consider all the proofs, including any assertion by the defendant that he intended only serious bodily injury, to determine whether there is any actual basis to submit SBI charges to the jury.\n\nIV\n\nSummary and Conclusion\n\nFor completeness of the record, we note the points raised in defendant's brief that were decided in Ramseur, supra, 106 N.J. 123, 524 A.2d 188, and Biegenwald, supra, 106 N.J. 13, 524 A.2d 130, specifically, defendant's challenge to the constitutionality of the death penalty in New Jersey, both on its face and as applied. We have considered whether any departure should be made from our prior rulings on these issues and have concluded that no departure is justified.\n\nOur disposition of this case makes it unnecessary to undertake the proportionality review requested by defendant under N.J.S.A. 2C:11-3e. We note that the various County Prosecutors, in consultation with the Attorney General, have adopted guidelines for use throughout the State in determining the\n\nselection of capital cases. See State v. Koedatich, supra, 112 N.J. at 258, 548 A.2d 939.\n\nIn addition to the murder convictions, defendant was convicted of weapons offenses. Disposition of the weapons offenses will abide the retrial. State v. Long, 119 N.J. 439, 504-05, 575 A.2d 435 (1990).\n\nThe pivotal issue in this appeal is one of non-capital constitutional law. Until the United States Supreme Court rules otherwise, no burden may be imposed on a defendant to establish all or any part of an affirmative defense based on diminished mental capacity. Humanik v. Beyer, supra, 871 F.2d 432. In no event would we ever require a defendant to establish both the fact of mental disease and the fact that it negated the knowledge or purpose to kill. State v. Breakiron, supra, 108 N.J. 591, 532 A.2d 199. The jury in this case was not charged in accordance with those principles. This error was not harmless because it was, for all practical purposes, the only issue in the guilt phase of the trial and a factual basis for that defense was presented.\n\nAt times it is difficult to explain the reasons why a free society should elect to afford fair trial rights to even the seemingly most reprehensible of its members. Shortly after returning from Nuremberg, where he had prosecuted war criminals, Justice Jackson reflected on the significance to our society of the guarantees of our Constitution and Bill of Rights. He observed that these constitutional guarantees are \"a real peril\" to the solution of crime and thus present \"a real dilemma in a free society\" because \"the defendant is shielded by such safeguards as no system of law except the Anglo-American concedes to him.\" Moran v. Burbine, 475 U.S. 412, 436 n. 5, 106 S. Ct. 1135, 1149 n. 5, 89 L. Ed. 2d 410, 431 n. 5 (1986) (Stevens, J., dissenting) (quoting Watts v. Indiana, 338 U.S. 49, 59, 69 S. Ct. 1357, 1358-59, 93 L. Ed. 1801, 1808-09 (1949) (Jackson, J., concurring in result)).\n\nHe questioned then whether a society beset with the rising incidence of crime could continue to afford such safeguards to defendants: \"Is it a necessary price to pay for the fairness which we know as 'due process of law'?\" Watts, supra, 338 U.S. at 62, 69 S. Ct. at 1359, 93 L. Ed. at 1810 (Jackson, J., concurring in result). The question remains relevant today. We can only answer now as did that Court then, \"deeply mindful of the anguishing problems which the incidence of crime presents\" to society. Id. at 55, 69 S. Ct. at 1350, 93 L. Ed. at 1807. These constitutional guarantees, \"assuring appropriate procedure before liberty is curtailed or life is taken,\" ibid., are what distinguish our society from all others. Among those guarantees is the right to trial by jury. The right to trial by jury includes the right to have the State prove the guilt of a defendant beyond a reasonable doubt. That right was infringed here by requiring defendant to prove that he was innocent of murder by reason of the diminished-capacity defense. Accordingly, we reverse the convictions of murder and remand the matter to the Law Division for proceedings consistent with this opinion.\n\nEXHIBIT A\n\n[For convenience, the juror's handwritten answers have been typed in by us. Personal identifying information has been omitted.]\n\nJUROR QUESTIONNAIRE\n\n1. Name G G Juror No.\n\n2. Address\n\nA. Check one: Own X; Rent ; Live with parents\n\nB. Years lived at present address: 37\n\nC. Years lived in New Jersey: 40 yrs.\n\nD. Place of Birth: Smithfield, Va. Age: 65\n\n3. Marital Status: (check one) Married X; Divorced ;\n\nWidowed ; Separated ; Never Married\n\n4. Employment Data:\n\nA. What is your occupation: Home Maker\n\nB. Name of Employer:\n\nC. City where you work:\n\nD. If you supervise others at work, how many?\n\nE. Years at this job:\n\nF. Spouse's occupation: Expediter\n\nG. Spouse's employer:\n\n5. List your children's ages, and their occupations and employers, if any: 37 -- US Coast Guard\n\n6. Military Service:\n\nJuror: Yes ; No ; Branch ;\n\nYears\n\nSpouse: Yes X; No ; Branch US Air Force;\n\nYears 2 1/2\n\n7. What is the highest grade of school you completed (check one)\n\nless than high school community college graduate\n\nX high school graduate 4 year college graduate\n\nvocational/technical school other (please explain)\n\nsome college\n\n8. If married, spouse's highest grade of school 2 yrs High\n\n9. Have you ever served as a juror in a criminal case NO X YES\n\n10. Have you ever served as a Grand Juror NO YES X\n\n11. Have you ever been a witness in a criminal case NO X YES\n\n12. Have you, a relative, or a close friend ever been the victim of a crime NO YES\n\n13. Have you, a relative, or a close friend ever been convicted of a crime NO X YES\n\n14. Do you have any relatives or close friends who are or were police officers or any other type of law enforcement officers NO X YES\n\n15. Is there any reason why you could not judge the testimony of a police officer by the same standard as any other witness NO X YES\n\n16. Is there anything about the charges which would prevent you from being fair both to the state and to the defendant NO X YES\n\n17. Have you heard or read anything about this case NO X YES\n\n18. Have you or any of your close friends or relatives had any experience with psychiatry NO X YES\n\n19. If so, was there anything about that experience that still bothers or troubles you\n\n20. Have you ever studied psychiatry or psychology NO X YES\n\n21. If so, how long ago and for how long\n\n22. Have you ever read any articles about psychiatry and psychology NO X YES\n\n23. If so, how much have you read and have you formed any opinions?\n\n24. Have you or a close friend or relative ever sought the assistance of a psychiatrist or psychologist to help with a personal problem NO X YES\n\n25. If so, do you think this experience was helpful to you or your friend or relative? Why?\n\n26. Do you believe that everyone can overcome depression and/or other mental negative attitudes merely by becoming more positive in their outlook on life by setting their minds to it? No Why? Professional help is needed\n\n27. Have you read or heard anything about the use of psychiatrists or psychologists in criminal trials? No If so, what?\n\n28. Do you think mental illness can be as debilitating as a physical illness? don't know the meaning of the word [debilitating]\n\n29. Do you think that psychiatrists are any more likely to recognize and understand mental illness and behavior than are people with no such background? Yes\n\n30. Do you have any opinion about the use of psychiatric expert testimony in a criminal trial? No\n\n31. Would you be able to judge the testimony of a psychiatrist the same way as any other witness? No If not, why not? Not familiar with his method\n\n32. Would you automatically assume that a psychiatrist was correct in his evaluation or would you be able to reach your own conclusion based on all of the testimony? I would try to reach my own conclusion\n\n33. Is there any reason why you feel you would be unable to sit and decide a case in which one of the issues may involve evaluating psychiatric testimony? Yes. Because I've never come in contact with the evaluation of psychiatry\n\nHANDLER, J., concurring in part and dissenting in part.\n\nThe defendant, Samuel Leon Moore, was tried for the murders of his wife and son in June of 1987. Defendant admitted committing the killings, but relied on the affirmative defense of diminished capacity. The jury found him guilty of knowingly or purposefully killing both victims, and, further, that aggravating factors outweighed mitigating factors regarding each victim. Accordingly, the trial court sentenced defendant to death for each killing. The Court now reverses the convictions for capital murder and the death sentences.\n\nThe Court determines that in light of Humanik v. Beyer, 871 F.2d 432 (3rd Cir.), cert. denied, 493 U.S. 812, 110 S. Ct. 57, 107 L. Ed. 2d 25 (1989), the jury charge unconstitutionally shifted\n\nto defendant the State's burden of proof on defendant's state of mind as a component of his diminished-capacity defense under State v. Breakiron, 108 N.J. 591, 532 A.2d 199 (1987). Ante at 425-427, 430-437, 585 A.2d at 866-867, 869-872. The Court reverses the capital-murder convictions on this ground. I agree with this conclusion relating to the guilt-phase trial.\n\nThe Court also addresses other rulings and procedures surrounding the guilt-phase trial, finding several erroneous or problematic, but concludes nevertheless that they do not provide additional grounds for reversal of the murder convictions. In my opinion, however, some of those trial events warrant reversal. I believe the trial court improperly limited the scope of voir dire questioning. I believe on the authority of State v. Gerald, 113 N.J. 40, 549 A.2d 792 (1988), that there was a rational basis in the evidence to support a conviction of murder resulting from an intent only to inflict serious bodily injury on Melva Moore, a noncapital crime; hence, the trial court was obliged to submit that option, as well as manslaughter, to the jury, which it failed to do. In addition, I am of the view that the court improperly admitted certain expert testimony. Also, I conclude the trial court abused its discretion in denying defendant's motion to preclude or limit the extent of the disclosure of the fact that the victim, Melva Moore, was pregnant at the time of her death.\n\nThe Court invalidates the death sentences because defendant's capital-murder convictions are reversed. Hence, it does not determine whether other grounds would justify reversal of the death sentences, although it discusses a number of them. I believe additional reasons warrant reversals of the death sentences. I am of the view that aggravating factor c(4)(g) was applicable with respect to Melva Moore, but that the application of that factor to the murder of Kory Moore was erroneous. Further, although the trial court used the constitutionally-narrowed definition of aggravating factor c(4)(c), I believe that there was insufficient evidence to submit that factor to the jury\n\nin relation to the killing of Melva or Kory Moore. I find also that prosecutorial misconduct tainted the sentences. Finally, I conclude that the refusal to permit defense witnesses personally familiar with defendant to express their beliefs that he deserved mercy was unfair and prejudicial.\n\nI write separately on those several issues to explain more fully why their resolution requires reversals and to emphasize that the Court's failure to rely expressly on those additional grounds ought not to be misinterpreted, to signify that the underlying errors are somehow insignificant or tolerable in the prosecution of capital-murder causes. Further, in my view, there are cogent grounds for concluding that the State's capital-murder statute is unconstitutional, as enacted, construed and applied. See, e.g., State v. Ramseur, 106 N.J. 123, 343, 524 A.2d 188 (1987) (Handler, J., dissenting). I remain convinced that these reasons impugning capital-murder prosecutions are persuasive, if not unanswerable. In this case, however, I find it unnecessary to repeat the fundamental grounds that, in my opinion, serve to invalidate the capital-murder statute, stating only that such reasons remain relevant and applicable in light of the evolving nature of capital-murder jurisprudence. E.g., State v. Di Frisco, 118 N.J. 253, 283, 571 A.2d 914 (1990) (Handler, J., concurring in part and dissenting in part).\n\nI.\n\nWe have stressed that in a capital-murder prosecution, the death-qualification process is \"important, delicate, and complex,\" and requires a \"thorough and searching\" inquiry into \"jurors' opinions and biases.\" State v. Williams II, 113 N.J. 393, 413, 550 A.2d 1172 (1988). Significant errors in this case involve the adequacy of the jury voir dire relating to certain important subjects, which the Court identifies yet trivializes by concluding that in each instance questioning \"as a whole\" was adequate.\n\nOne of the subjects that was erroneously circumscribed in the jury voir dire related to the status or condition of the victims. Ante at 446-447, 585 A.2d at 877-878. Specifically, defendant claims that it was never discovered through adequate interrogation of individual jurors if the circumstances of Melva's pregnancy and Kory's infancy would interfere with a prospective juror's fair determination of guilt or would render it more likely that a juror would impose the death sentence on one murdering such victims. The trial court denied defendant's requests that such questions be posed because they impelled jurors to speculate \"on what they might do or how their verdict might be influenced by certain contingencies.\" The Court, agreeing with defendant, at least in principle and in part, acknowledges that \" voir dire should allow more open-ended questioning on the issue of the status of the victims as it relates to any prejudice or predisposition affecting the juror's ability to adjudge fairly in the guilt phase or the ability to consider mitigating evidence in any penalty phase.\" Ante at 451, 585 A.2d at 880.\n\nA review of the voir dire as a whole reveals that most prospective jurors were interrogated to some extent concerning the status of the victims as constituting a special circumstance relevant to potential juror bias. The court, however, did not permit counsel to interrogate many potential jurors at all with respect to how the status of the victim would affect their deliberations. Moreover, although several potential jurors were asked how the status of the victims would affect them in determining an appropriate sentence, many of those prospective jurors gave only a rote and unspecific response to the questioning. Many jurors were asked only an abstract question whether the nature of the crimes would affect their ability to be fair, the answer to which in no way revealed any subjective attitudes or feelings relating specifically to the status of the victim. Thus, it is not possible to know whether prospective jurors leaning in favor of capital punishment, and exposed only to those questions, would be able objectively and fairly to credit\n\nand weigh mitigating evidence; the questioning on death qualification simply did not probe sufficiently that important area.\n\nThat unsearching and abbreviated examination into juror feelings engendered by the pregnancy and infancy of the murder victims constitutes a serious deficiency in the juror-qualification process. It was tantamount to the failure to inquire sufficiently \"into whether any juror could consider the mitigation evidence . . ., [effectively denying] counsel and the trial court the tools with which to insure that the jury panel could fairly undertake its role [at the penalty phase] in this case.\" Williams II, 113 N.J. at 417, 550 A.2d 1172. That omission is particularly telling in view of the prominence that the status of the victims acquired in the course of the trial. Infra at 462-466, 585 A.2d at 886-887.\n\nIn addition to the status of the victims, the existence and effect of mental disease on the crimes charged and the appropriate sentence were also critical issues. Defendant offered expert psychiatric testimony in support of the mental-health defense of diminished capacity in causing the deaths of his wife and son. Furthermore, at the penalty phase, two of the proffered mitigating factors involved his mental condition. I believe that the trial court abused its discretion in foreclosing examination of the prospective jurors' attitudes toward the mental-health defenses and psychiatry, and that that error touches both phases of the proceeding.\n\nGenerally, courts appear reluctant to allow or encourage far-ranging voir dire covering attitudes toward mental disease or psychiatric testimony. Compare State v. Kelly, 118 N.J. Super. 38, 46, 285 A.2d 571 (App.Div.) (1972) (in first-degree murder case trial court did not allow voir dire about feelings toward insanity defense, reasoning that juror's attitude toward an unexplained legal principle \"difficult to differentiate from . . . many other rules of substantive or adjective law\"), certif. denied, 60 N.J. 350, 289 A.2d 795 with State v. Jasuilewicz, 205 N.J. Super. 558, 501 A.2d 583 (App.Div.1985) (immediacy of\n\nHinkley verdict of not guilty by reason of insanity made refusal to inquire regarding mental health defenses reversible error), certif denied, 103 N.J. 467, 511 A.2d 649. Nevertheless, whether that approach reflects current practice and conventional wisdom, it should not be followed in a capital-murder prosecution.\n\nWith respect to the jurors' abilities to credit the psychiatric evidence presented in support of the mitigating factors, the error in failing fully to explore juror attitudes and feelings is particularly serious. As noted, two of the mitigating factors presented at the penalty phase involved defendant's mental condition. As this Court explained in Williams II, supra, the sentencer has a constitutional obligation to consider theevidence presented in mitigation, and failure to ensure the capability to do so is error. 113 N.J. at 417, 550 A.2d 1172. As it turned out, the jury unanimously rejected one of these mitigating factors and voted eleven to one against the other. Thus, the shortcomings in the voir dire cannot be treated lightly. In the absence of a probing voir dire to explore the possible existence of juror antipathy toward psychiatric evidence, there can be no assurance that any juror's rejection of those mitigating factors was not the result of latent unexposed bias.\n\nThose errors are not candidates for harmless-error disposition. Defendant's constitutional right to a fair trial does not diminish in relation to the amount of evidence of guilt garnered by the State. \"Even in a case . . . where the evidence of guilt is compelling, the right to a fair trial must be diligently protected to insure that all defendants, regardless of the crime charged or the weight of the evidence produced, are tried by a fair and impartial jury.\" Williams II, supra, 113 N.J. at 409, 550 A.2d 1172. The errors, consisting of an insufficient exploration of the jurors' attitudes and feelings with respect to the status and condition of the victims and to mental disease as a defense and as a mitigating factor, are too serious to pass off. In my opinion, independently and jointly they warrant reversals of the convictions and the death sentences.\n\nII.\n\nThis case again betrays the laxity and ambivalence that the Court has manifested with respect to the admissibility of expert testimony in capital-murder prosecutions. As part of the State's case-in-chief, New Jersey State Police Detective Thomas McCormick testified as an expert in blood-spatter analysis. That testimony was offered to show that the killing of Kory Moore was knowing and purposeful rather than accidental, as defendant claimed. Without that significant -- and extremely problematic -- testimony, the jury's determination might have been markedly different.\n\nThe trial court found the detective to have sufficient qualifications to testify as an expert. The Court recounts Detective McCormick's qualifications: He had been a member of the state police for eight years and assigned to the Crime Scene Investigation Unit for two years at the time of his testimony; his duties consisted of crime-scene photography, evidence collection and fingerprinting, and autopsy attendance; he had attended a six-week course termed \"New Jersey State Police Forensic Science School,\" which included a one-day seminar in blood-spatter analysis. Additionally, he had attended another \"one day seminar\" given by a member of the crime-scene-investigation unit who in turn had received training by someone \"schooled\" in that area, and he \"continue[d] to get in-service training.\" McCormick had investigated over two hundred crime scenes, at least thirty of which were homicides, and had previously testified as an expert in fingerprinting and crime-scene analysis. The witness had never before testified as a blood-spatter-analysis expert. Ante at 458, 585 A.2d at 884.\n\nEvidence Rule 19 states that to testify as an expert, a witness must have the required \"experience, training, or education.\" A witness offered as an expert must \"be suitably qualified and possessed of sufficient specialized knowledge to be able to express such an opinion and to explain the basis of that opinion.\" State v. Odom, 116 N.J. 65, 71, 560 A.2d 1198\n\n(1989) (quoting State v. Kelly, 97 N.J. 178, 208, 478 A.2d 364 (1984)). \"[A]n expert may be qualified by study without practice or practice without study, but a mere observation without either is insufficient.\" State v. Smith, 21 N.J. 326, 334, 121 A.2d 729 (1956); cf. State v. Philbrick, 436 A.2d 844, 861 (Me.1981) (detective improperly permitted to testify to conclusions regarding sequence and directions of gunshots based on blood found in car because trial court conducted no voir dire prior to testimony to establish detective's qualification as expert, particularly in light of pathologist being unable to reach similar conclusions).\n\nWe recognize that \"[t]he sufficiency of the qualifications of the experts [is] primarily a matter for the trial court's discretion and will be reviewed only for manifest error and injustice.\" State v. Ravenell, 43 N.J. 171, 182, 203 A.2d 13 (1964), cert. denied, 379 U.S. 982, 85 S. Ct. 690, 13 L. Ed. 2d 572 (1965) (citations omitted). Nevertheless, the trial court abused its discretion in concluding that McCormick was sufficiently qualified as an expert to give and explain an opinion on the significance of spattered blood as bearing on the state of mind of a murderer. It may be that McCormick had training both in forensic evidence and in crime-scene investigation, but his training in blood-spatter analysis was patently meager. Moreover, he never before this case had qualified as an expert in this field, and his background does not reveal any or substantial actual investigative experience in making blood-spatter analyses. That lack of training and experience was highlighted by the defense both on cross-examination and in summation.\n\nThere was no evidence to establish that this subject constituted an acknowledged field of expertise, such as the witness's knowledge of the reasonable uniformity of results or the scientific basis for such studies. See State v. Zola, 112 N.J. 384, 446-48, 548 A.2d 1022 (1988) (Handler, J., concurring in part and dissenting in part), cert. denied, 489 U.S. 1022, 109 S. Ct. 1146, 103 L. Ed. 2d 205 (1989). There was no showing that this body of knowledge was generally accepted by the scientific\n\ncommunity. State v. Kelly, supra, 97 N.J. at 210, 478 A.2d 364. In the capital case of State v. Harvey, 121 N.J. 407, 426-27, 581 A.2d 483 (1990), the State sought to introduce the testimony of Dr. Claude Owen Lovejoy, who claimed to be able to estimate the stature of a person from the size of his or her shoes. The trial court held the testimony admissible. This Court reversed, noting that in a relatively new field of research, there are three ways to prove the evidence's \"general acceptance and thereby its reliability\":\n\n(1) by expert testimony as to the general acceptance, among those in the profession, of the premises on which the proffered expert witness bases his or her analysis; (2) by authoritative scientific and legal writings indicating that the scientific community accepts the premises underlying the proffered testimony; and (3) by judicial opinions that indicate the expert's premises have gained general acceptance. [ Id. at 427-28, 581 A.2d 483 (quoting Kelly, supra, 97 N.J. at 210, 478 A.2d 364).]\n\nThe Court held that the State had not satisfied either the first or second alternative as the State \"did not provide evidence that anyone in the scientific community other than Dr. Lovejoy himself vouches for his methods.\" The Court noted further that no judicial opinions indicated that his methods had gained general acceptance. Ibid.\n\nThis is not the first time the Court has had the opportunity to decide whether blood-spatter analysis is an area sufficiently scientific to justify expert testimony. In another capital-murder case, State v. Johnson, 120 N.J. 263, 576 A.2d 834 (1990), this Court expressly declined to decide the issue, holding instead that \"the limited probative value of that evidence with regard to the facts it was offered to prove is substantially outweighed by the risk that its admission will create substantial danger of undue prejudice.\" Id. at 297, 576 A.2d 834 (citing Evidence Rule 4). The same reasoning should apply here. The objective forensic evidence relating to the manner of the killing was abundant and the proffered expert testimony contributed little probative worth but added enormous prejudice.\n\nThe State offered no proofs that blood-spattering evidence is accepted by those in the profession. The trial court did not\n\nbother to ascertain whether judicial opinions indicate that blood-spattering analysis has gained general acceptance within the community of experts. Accordingly, the opinion testimony was patently incompetent and should not have been admitted.\n\nThere is yet another aspect to the error in the admission of the expert's testimony. It is essential that the expertise of the witness coincide with the opinion of the witness. See State v. Odom, supra, 116 N.J. 65, 560 A.2d 1198. If the expert's opinion goes beyond the foundation and limits of the underlying expertise, then that opinion cannot be credited. Ibid. In this case, it is not apparent how McCormick's rudimentary training enabled him to reach and explain his conclusion that Melva's blood had been indirectly transferred onto Kory's overalls, and that the angles and paths of the splatters on the wall indicated the position of Kory's body when he was killed. More importantly, that testimony clearly implied, as a matter of personal opinion, that the murder had been intentional and purposeful. However, nothing related concerning the witness's background, training, or experience suggests that there existed within the scientific community an acknowledged level of expertise that would produce valid and reliable conclusions that a killer's state of mind can be extrapolated from blood-spatter evidence, or, more important, that the witness in this case had this level of expertise and scientific sophistication. Hence, there was an insufficient foundation in terms of the witness's expertise to enable him impliedly to express and explain a conclusion with respect to the killer's state of mind at the time the mortal wounds were inflicted on the victims. See Nesmith v. Walsh Trucking Co., N.J. (1991) (slip op. at 2-3). It follows, also, that the expression of such a conclusion, one without an expert foundation or sufficient explanation, constitutes a \"net opinion.\" Ibid. In the context of this case, in which the witness was not sufficiently qualified as an expert, and his conclusion lacked a supporting explanation, his opinion implying that the homicide was intentional expressed a determination of a critical and ultimate fact that is tantamount to a determination\n\nof guilt of first-degree capital-murder. It thus transgresses the jury's sole responsibility to determine guilt or innocence. Cf. State v. Odom, supra, 116 N.J. 65, 560 A.2d 1198 (adequately qualified expert's fully-explained conclusion that drugs were held for sale did not constitute opinion that defendant was guilty of crime charged).\n\nIn Johnson, supra, 120 N.J. 263, 576 A.2d 834, in which a husband and wife were found murdered in their home, the State offered the blood-spatter testimony of police detective Reeves to show that the husband had lain prostrate when shot; that the wife had been struck more than once with a ceramic vase and had suffered a minimum of seven injuries; and that the wife had struggled with her attacker. The State also suggested that the blood-spatter testimony contradicted the defense theory that others had participated in the murder, because the testimony indicated that the attacker acted alone. Id. at 298, 576 A.2d 834.\n\nThis Court stated:\n\nThe record demonstrates that the medical examiner had already established the cause of death and the extent of the assault. Reeve's testimony was merely cumulative on those issues. Information about the parts of the house where the attack had taken place and the directionality of the blows, though startling, proves neither the intent nor the identity of the attacker. Although the testimony is not irrelevant, it is largely corroborative of other, essentially unchallenged testimony indicating the manner of death. Thus, it was only minimally probative of defendant's guilt.\n\nAlthough the blood-spatter testimony was of only limited probative value, its admission created a substantial danger of undue prejudice to defendant. Reeve's lengthy presentation exposed the jury to numerous crime-scene photographs depicting the victim's bodies, as well as forty-two slides depicting blood-spatter exemplars, which Reeves used to highlight his expertise in the area. Such testimony, extending over the course of an entire day at trial, could not help but focus the jury's attention on the gruesome details of the condition of the victims' bodies, rather than on defendant's guilt. [Ibid.]\n\nHere, the blood-spatter testimony was not simply corroborative of other evidence. It was offered to show \"that Kory was lying on the floor when the blood reached him,\" and that he was \"probably struck at least twice while in his final position.\" See ante at 458, 585 A.2d at 883. Although the medical\n\nexaminer testified that Kory had been killed by \"multiple blunt impact,\" and described in detail the lacerations of Kory's head and the comminuted fractures of the underlying bones, McCormick's blood-spatter testimony purported to describe the position of Kory and implied he had been intentionally killed. It was thus extremely prejudicial. As in Johnson, the presentation exposed the jury to numerous crime-scene photographs depicting the victims' battered bodies and the blood-spattered apartment.\n\nIn sum, McCormick's testimony on the critical issue of intent violated defendant's right to due process and a fair trial under the sixth and fourteenth amendments to the federal Constitution and the parallel provisions of the New Jersey Constitution, and the error was clearly capable of affecting the result of his case. Hence, I disagree with the Court's acceptance of that testimony based solely on the trial court's discretion.\n\nIII.\n\nDefendant contends that although the trial court determined that Melva Moore's pregnancy was relevant and admissible in both phases of the proceeding, error occurred through the prosecutor's excessive use of that evidence and the trial court's failure to give the jury clear, decisive, corrective, and limiting instructions on its use. The Court seemingly agrees, but it minimizes the severity of the prejudice. It simply expresses the admonition that \"[on remand] both court and counsel shall insure that the evidence of pregnancy is properly limited to its probative purposes\" and the additional \"caution against unnecessarily dwelling on the pregnancy at retrial.\" Ante at 465, 585 A.2d at 887. I differ.\n\nDuring his guilt-phase opening, the prosecutor made repeated references to Melva Moore as defendant's \"pregnant wife,\" without ever indicating that the pregnancy would be shown to have particular significance or relevance to any of the issues in the case. At trial, various witnesses testified to the fact that Melva was pregnant, including the medical examiner who autopsied\n\nher, although the prosecutor made no effort to tie the pregnancy to the murders.\n\nAfter the guilt-phase verdict and prior to the commencement of the penalty phase, defense counsel requested that the court discharge the jury and empanel a substitute, due to its exposure to irrelevant and prejudicial information, such as the pregnancy. The court refused, finding that the pregnancy was relevant circumstantial evidence of state of mind, even at the penalty phase, and indicating that a cautionary instruction would be given if desired. However, the evidence was patently abused by the prosecutor at the penalty phase. The prosecutor was permitted over defendant's objection to argue that the killing of pregnant Melva was probative of wanting to cause mental anguish because she would know \"that the child she carried would never, never breathe a breath of life.\" The prosecutor made repeated references to Melva's pregnancy.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e The claimed relevance of the references to Melva's pregnancy is clearly belied by the court's penalty-phase charge in which it instructed the jurors that the pregnancy and its termination \"are not aggravating factors under the law that you have sworn to uphold . . . [y]ou shall not, you must not consider either pregnancy or the effect of the defendant's acts upon the fetus as an aggravating factor.\"\n\nEven if the evidence by some stretch of the imagination could have been considered relevant, it should nonetheless have been excluded as an exercise of the trial court's discretion because its probative value \"is so significantly outweighed by [its] inherently inflammatory potential as to have a probable capacity to divert the minds of the jurors from a reasonable and fair evaluation\" of the issues in the case. State v. Thompson, 59 N.J. 396, 421, 283 A.2d 513 (1971). The \"more attenuated and the less probative the evidence, the more appropriate it is for a judge to exclude it under Evid.R. 4.\" State v. Medina, 201 N.J. Super. 565, 580, 493 A.2d 623 (App.Div.), certif. denied, 102 N.J. 298, 508 A.2d 185 (1985); State v. Mathis, 47 N.J. 455, 471, 221 A.2d 529 (1966) (evidence of defendant's financial need excluded absent some additional connection to motive).\n\nIn this case, the relevance was minimal, if present at all. One area of relevance anticipated by the trial court at the guilt phase was self-defense or Melva's initiation of the violence. That, however, never became an issue in this case. The trial court also noted that where intent is at issue, the scope of relevant proofs is broader, permitting any evidence that might be probative of defendant's intent. However, although the State argued on appeal that defendant wanted Melva to move out and she refused because she was pregnant, no such evidence was forthcoming. The suggestion that defendant felt the birth of a second child would further hamper his efforts to start a life with Lizzette, his paramour, is not supported by any evidence. The State itself advanced the theory that Melva and Kory simply stood in the way of defendant's plans. It did not at trial contend that the killing was related in any way to her pregnancy. Likewise, in attempting to prove that the killing of Kory had been intentional, the prosecutor simply relied on the evidence that he had been struck more than once, assertedly as he lay on the floor. Thus, the trial court's conclusion that the pregnancy would be probative of defendant's intent to kill each victim was never supported by evidence connecting the pregnancy to his actions.\n\nI conclude, therefore, that the trial court abused its discretion in failing to exclude the pregnancy testimony under Evidence Rule 4. In particular, the trial court failed wholly to consider and weigh the prejudicial effect of that evidence against not only its asserted relevance with respect to guilt but also its relevance, if any, with respect to whether defendant deserved to die. See State v. Long, 119 N.J. 439, 515-17, 575 A.2d 435 (1990) (Handler, J., dissenting and concurring); State v. Pennington, 119 N.J. 547, 605-09, 575 A.2d 816 (1990) (Handler, J., concurring in part and dissenting in part).\n\nIn addition, the trial court failed to do anything to correct or mitigate the effects of the erroneous admission of that evidence. Even though defendant did not request an Evidence Rule 6 instruction, it was error for the trial court not to have given one sua sponte. In my view, the application of that rule is not necessarily triggered or excused by whether a party seeks or resists its application. See State v. Rose, 112 N.J. 454, 550, 548 A.2d 1058 (1988) (Handler, J., dissenting).\n\nIt is not tenable to conclude that error in the admission and use of this evidence was harmless because there was overwhelming evidence of defendant's guilt, and the jurors could not possibly have reached any other result. Ante at 427, 585 A.2d at 867. That determination cannot be reached unless one ignores the fact that there was conflicting evidence offered on defendant's mental condition and also chooses to apply the Court's amorphous standard of appellate review with undue laxity. The inflammatory fact that an unborn child was killed had the greatest potential for wrongful use by the jury. One can reasonably conclude that absent that highly emotionally-charged evidence, the jury could have found that the killings had been committed only with diminished mental capacity.\n\nIV.\n\nFundamental error also contaminates the jury's determination that defendant deserved to die for each of the murders.\n\nThe State alleged two aggravating factors with respect to Melva: c(4)(c) (a killing with intent to cause mental or physical suffering or with depravity), and c(4)(g) (a killing committed during the commission of another killing, that of Kory). The State alleged three aggravating factors relating to Kory: c(4)(c) (a depraved killing), c(4)(f) (a killing to prevent defendant's detection for Melva's murder), and c(4)(g) (a killing committed during the commission of another killing, that of Melva). With respect to c(4)(g), the jury was unanimous in finding this factor present in both killings.\n\nA.\n\nDefense counsel challenges the constitutionality of aggravating factor c(4)(g) as applied to a double-murder situation, under the circumstances of this case. He argues that the reciprocal use of aggravating factor c(4)(g) here violated the eighth and fourteenth amendments to the federal Constitution, and article I, paragraph 12 of the New Jersey Constitution. In addition, defendant contends that the aggravating factor cannot be based on the killing of Melva and applied to aggravate the murder of Kory, stressing that the statutory language, when it speaks of a murder committed during the commission of another murder, \"suggests that one killing be complete or already in process when another homicide takes place.\" Defendant also states that the prosecutor in his case \"splintered what should have been a single aggravating factor into two\" by charging that each killing occurred in the course of the other, because, \"logically speaking, only one killing could take place during the course of another.\" Defendant further cites this Court's discussion in State v. Bey II, 112 N.J. 123, 174-76, 548 A.2d 887 (1988), of the hazards of artificially inflating aggravating factors, and contends that even if that which occurs when each killing is used to aggravate the other is permissible, such a situation clearly demands an explanation to the jury to protect against over-accumulation or extra-counting of evidence. The Court rejects these contentions. Ante at 469-474, 585 A.2d at 889-891.\n\nThe most fundamental argument, in my view, is that in order for a charged murder to be subject to an aggravating factor consisting of another murder, the charged murder must be one that arises during the course of and as a probable consequence of the commission of the other murder. That, I believe, reflects the clear legislative intent, which can be derived from the analogous legislative treatment of the substantive crime of felony murder.\n\nAggravating factor c(4)(g) as originally enacted provided:\n\nThe offense was committed while the defendant was engaged in the commission of, or an attempt to commit, or flight after committing or attempting to commit robbery, sexual assault, arson, burglary or kidnapping. [ N.J.S.A. 2C:11-3c(4)(g).]\n\nIt is reasonable to infer that the Legislature intended to incorporate elements of the felony-murder doctrine into the standards governing the aggravating factor of c(4)(g) as applicable to capital-murder. As originally enacted, c(4)(g) contemplated that if the charged murder otherwise qualified as a felony-murder, it served to aggravate the crime of capital-murder. That is evident from the language of c(4)(g), which refers to a murder committed \"while defendant was engaged in the commission of . . . [a felony].\" That standard is virtually identical to the statutory standard defining the substantive crime of felony murder. N.J.S.A. 2C:11-3a(3). It is, then, to be inferred that the Legislature, by the use of parallel language, intended that felony-murder qua aggravating factor be identical to felony-murder qua murder.\n\nThe language of factor c(4)(g) was amended in 1985, with murder added to the list of felonies. L. 1985, c. 178. The drafters of the amended bill explained:\n\nUnder the current law, a murder committed while committing or attempting to commit another crime, such as robbery or sexual assault, is an aggravating factor. As amended, Senate Bill No. 950 would include murder itself among those offenses, so that a murder committed during the commission of another murder would be an aggravating circumstance. [Senate Judiciary Committee Statement, No. 950, L. 1985, c. 178.]\n\nIt is reasonably evident that the legislators, by the addition of murder to the list of felonies that can enhance or aggravate a charged murder, intended that \"murder\" function as a predicate felony in terms of constituting the aggravating factor of c(4)(g).\n\nIn consequence, the felony-murder doctrine embraces the principles that define c(4)(g). In determining the elements of the substantive crime of felony murder, we have ruled that in order to constitute felony murder, a murder committed during the commission of a felony must be a probable consequence of the felony. State v. Martin, 119 N.J. 2, 27-28, 573 A.2d 1359 (1990). In Martin, we traced the evolution of the felony murder doctrine in New Jersey and determined that a court must charge the jury on causation in a felony-murder prosecution when causation is at issue. Id. at 33, 573 A.2d 1359. A jury must find that a sufficient nexus exists between a felony and resulting murder, that the resulting murder is not too remote, accidental, or improbable. Ibid. It follows that in adding murder to the felonies that can convert an accompanying murder into the \"felony-murder\" aggravating factor of c(4)(g), the Legislature presumably intended that the accompanying murder, the charged murder, occur while the defendant \"was engaged in the commission of . . . [another murder],\" and was the \"probable consequence\" of the commission of that murder.\n\nMoreover, even though the accompanying, charged murder is intentional or knowing, and independently renders the defendant death eligible as a matter of guilt, it must presumably still be shown to satisfy the requirements of the felony-murder standards in order to constitute the aggravating factor of c(4)(g). In other words, the accompanying murder must constitute a \"probable consequence\" of the initial, charged or predicate murder, in just the same way an accompanying murder would have to be connected or related to a predicate felony other than homicide to be considered a felony-murder.\n\nHere, regardless of defendant's state of mind in connection with the murder of Kory, the evidence was not focused on -- nor\n\nwas it argued by the State -- whether this killing was a probable consequence of the murder of Melva. Rather, it appears from the State's evidence and arguments that Kory's killing was separate, unconnected and independently intended by defendant. More significantly, the jury was not instructed to consider or asked to determine whether there was a sufficient causal nexus between the two murders.\n\nThe critical function of aggravating factors in a capital punishment scheme, as the label implies, is to identify those circumstances that distinguish the intentional killings society deems warrant the punishment of death from those that do not. See Lowenfield v. Phelps, 484 U.S. 231, 244, 108 S. Ct. 546, 554, 98 L. Ed. 2d 568, 581-82 (1988) (\"The use of 'aggravating circumstances' is . . . a means of genuinely narrowing the class of death-eligible persons and thereby channeling the jury's discretion.\"); Gregg v. Georgia, 428 U.S. 153, 197-98, 96 S. Ct. 2909, 2936-37, 49 L. Ed. 2d 859, 888 (1976) (the aggravating factors require the jury to consider \"the circumstances of the crime and the criminal before it recommends sentence\"); see Bey II, supra, 112 N.J. at 175, 548 A.2d 887. Like the felony-murder rule itself (where intent to commit the felony is transferred to the killing), commission of a felony is a harmful act condemned by society and justifiably subjects a defendant to greater penal consequences if the results include the commission of a murder. Thus, the language of the statute contemplates that the killing is aggravated because of defendant's greater fault; it occurred because the defendant was engaged in other criminal behavior that, under our law, generated a real risk that someone would be killed.\n\nThe aggravating factors of c(4)(g) entail something more than coincident dual murders. They require a connection between the charged murder and the aggravating murder, the same connection that is required between the murder and the predicate felony to constitute felony-murder. That standard is similar to California's felony-murder special circumstance that can increase the culpability of capital murder. The California felony-murder\n\nspecial circumstance provides that \"the murder was committed while defendant was engaged in . . .\" nine enumerated felonies, murder not among them. Cal.Penal Code  190.2(17). In People v. Green, 27 Cal. 3d 1, 609 P. 2d 468, 164 Cal.Rptr. 1 (1980), the defendant had taken his estranged wife to a secluded spot, killed her, and then departed with her clothes, jewelry, and purse. The prosecutor had effectively told the jury that the finding that a robbery had occurred would be tantamount to an affirmative finding of the special felony-murder circumstance. The court, however, found error, because \"it was not enough for the jury to find the defendant guilty of a murder and one of the listed crimes; the statute also required that the jury find the defendant committed the murder 'during the commission or attempted commission of' that crime.\" Id. at 59, 609 P. 2d at 504, 164 Cal.Rptr. at 37. The court explained:\n\nThe provision thus expressed a legislative belief that it was not unconstitutionally arbitrary to expose to the death penalty those defendants who killed in cold blood in order to advance an independent felonious purpose, e.g., who carried out an execution-style slaying of the victim of or witness to a holdup, a kidnapping, or a rape. [ Id. at 61, 609 P. 2d at 505, 164 Cal.Rptr. at 38.]\n\nThe court found that the proofs indicated the poor fit of that aggravating circumstance to the case, \"that it was not in fact a murder in the commission of a robbery but the exact opposite, a robbery in the commission of a murder.\" Id. at 60, 609 P. 2d at 505, 164 Cal.Rptr. at 38.\n\nHere, the Court ignores that fundamental distinction. It concludes that \"neither constitutional principle nor statutory intent forbids a jury to consider reciprocal double murders in determining death worthiness in each.\" Ante at 473, 585 A.2d at 891. The Court simply misperceives the statutory intent. As in Green, I believe the legislative intent underlying thisaggravating factor is not effected by charging only that the jury could find that Melva Moore was killed during the commission of the murder of Kory. Rather, this aggravating factor could be established only if the jury were able to conclude beyond a reasonable doubt that Kory's killing was a probable\n\nconsequence of Melva's. The instructions should parallel those applicable to felony murder. See State v. Martin, supra, 119 N.J. 2, 573 A.2d 1359.\n\nMoreover, both the State and defense accepted the fact that defendant's assault on Melva had occurred first. The State argued that defendant had then \"hunted down\" and killed his son as well. The court gave no indication to the jury that the murder of Kory had been committed to facilitate the murder of Melva or had occurred as a probable consequence of it. Accordingly, I believe that the c(4)(g) factor, relying on the separate and independent killing of Kory, was improperly presented and charged as an aggravating factor in the killing of Melva Moore.\n\nIn addition, the Legislature clearly did not anticipate that in the situation involving a double murder, each murder could constitute an aggravating factor of the other. As in felony murder, the felony aggravates the killing but the killing does not aggravate the felony. Other jurisdictions have foreclosed the dual use of each murder to aggravate the other. The Georgia Supreme Court has developed what it calls the doctrine of mutually supporting aggravating circumstances. That doctrine does not permit two death sentences to be imposed where the only aggravating factor alleged for each is the killing of the other.\n\n[T]he doctrine of \"mutually supporting aggravating circumstances\" precludes imposition of two death sentences where the sole statutory aggravating circumstances is that the defendant has committed a double murder. [ Putman v. State, 251 Ga. 605, 614, 308 S.E. 2d 145, 153 (1983) (citations omitted) (subsequent history omitted).]\n\nCalifornia's death-penalty statute also provides a \"multiple-murder\" special circumstance that can aggravate the capital-murder, which differs from the felony-murder special circumstance considered in People v. Green, supra, 27 Cal. 3d 1, 609 P. 2d 468, 164 Cal.Rptr. 1.\n\nThe California court considered the \"multiple murder\" special circumstance in People v. Harris, 36 Cal. 3d 36, 679 P. 2d 433, 201 Cal.Rptr. 782 (1984), cert. denied, 469 U.S. 965, 105 S. Ct.\n\n365, 83 L. Ed. 2d 301 (1984), a double murder situation in which defendant challenged the use of each victim to allege two \"multiple murder\" special circumstances. The court pointed out that \"there must be more than one murder to allege this special circumstance at all.\" 36 Cal. 3d at 67, 679 P. 2d at 452, 201 Cal.Rptr. at 801. Unlike its treatment of the felony-murder special circumstance, the court did not intimate that any connection between the multiple murders need be shown. Our own rule, in my opinion, is different.\n\nThe use of the dual murder in this case also implicates problems entailed in double-counting or exaggerating the weight of evidence of aggravating factors. This Court has previously approved \"double counting\" evidence in applying aggravating factors, that is, using the same evidence to establish more than one aggravating factor concerning one victim. See, e.g., State v. Rose, supra, 112 N.J. at 524-27, 548 A.2d 1058; State v. Bey II, supra, 112 N.J. at 174-76, 548 A.2d 887. Nevertheless, even under the Court's rule allowing such double-counting, the use of the same or identical evidence to establish separate aggravating factors is improper. The use of the same facts, namely, multiple murders, to establish an aggravating factor in respect of each killing, improperly embraces the same evidence, clearly inflating the risk that the death penalty will be imposed arbitrarily.\n\nThis point was clearly grasped by the California Supreme Court in the Harris case. The court there stated:\n\nIn this case, alleging this special circumstance with each murder count results in a finding of two special circumstances. Since there must be more than one murder to allege this special circumstance at all, alleging two special circumstances for a double murder improperly inflates the risk that the jury will arbitrarily impose the death penalty.\n\nIn our view, the appropriate charging papers would allege a \"multiple murder\" special circumstance separate from the individual murder counts. This procedure would properly guide the jury's objective consideration of the circumstances of the crime without hampering the prosecution's ability to seek\n\nwhat it considers to be the appropriate punishment. [ People v. Harris, supra, 36 Cal. 3d at 67, 679 P. 2d at 452, 201 Cal.Rptr. at 801.]\n\nThe constitutional issue that defendant raises is somewhat different from those presented by the double-counting situations in Bey and Rose, where the same evidence was factored twice into the penalty-phase verdict. Thus, in State v. Bey II, supra, 112 N.J. 123, 548 A.2d 887, the defendant brought a constitutional challenge to the use of the sexual assault of his victim as the factual predicate for two aggravating factors. The Court endorsed the practice, but explained that to ensure that the facts are not given undue weight, the trial court must make the jury aware that the same facts underlie numerous aggravating factors. Id. at 176, 548 A.2d 887. In State v. Rose, supra, 112 N.J. 454, 548 A.2d 1058, the defendant argued that such dual use of the same evidence makes the jury's deliberations unconstitutionally arbitrary. Citing the discussion in Bey II, the Court found that the absence of a clarifying instruction was sufficient error to require reversal of Rose's death sentence. Id. at 527, 548 A.2d 1058. Here, the evidence of the dual murders is being used twice by the jury in determining the punishment for each murder. I believe that at the very least, in the absence of a limiting instruction providing a careful explanation of the concerns entailed in using the same evidence, the double use of evidence to establish aggravating factor c(4)(g) was reversible error.\n\nIn addition, although multiple aggravating factors were alleged and found for each victim, if one or more factors are invalid, I do not believe the death sentence can endure on the basis of any remaining factors. See Rose, supra, 112 N.J. at 577, 548 A.2d 1058 (Handler, J., dissenting). We have heretofore declined independently to reweigh remaining factors, and instead require a new sentencing proceeding. But see Clemons v. Mississippi, 494 U.S. 738, 110 S. Ct. 1441, 108 L. Ed. 2d 725 (1990)(eighth amendment does not preclude appellate court from reweighing factors). The Georgia Supreme Court, in conducting the mandatory sentence review in cases involving\n\nthe murders of two persons where no other aggravating circumstances were present, seemingly recognized two death sentences in that situation as excessive. The relief granted by the Court was to strike the factor as to one victim. See Gregg v. State, 233 Ga. 117, 125-28, 210 S.E. 2d 659, 666-67 (1974) (subsequent history omitted). However, if there are other aggravating circumstances, apart from the dual murders, the Georgia Supreme Court \"arbitrarily\" strikes the factor in respect of one killing, and theoretically the other death sentence remains intact. See Waters v. State, 248 Ga. 355, 367, 283 S.E. 2d 238, 250 (1981) (\"[w]e arbitrarily eliminate the aggravating factor as to one of the victims\") (subsequent history omitted). I do not believe that avenue is open to use in this case because of the invalidity of the remaining aggravating factor c(4)(c). See discussion infra at 513-516, 585 A.2d at 912-913. Cf. Blanks v. State, 254 Ga. 420, 427, 330 S.E. 2d 575, 582 (1985) (despite the doctrine of mutually supporting aggravating circumstances, \"in view of the additional aggravating circumstances found here, the fact that each murder is a statutory circumstance supporting the death penalty for the other does not require the reversal of either sentence\") (subsequent history omitted).\n\nIn sum, the use of the double murders to sustain the aggravating factors of c(4)(g) concerning both murders was clearly error. It requires reversal of both death sentences.\n\nB.\n\nPrior to the start of the penalty phase, the State represented that it would produce no further direct evidence in support of the aggravating factors alleged. Defense counsel then moved to have aggravating factor c(4)(c) dismissed in respect of both Melva and Kory. The court denied that motion and submitted c(4)(c) as to both. The jury found aggravated assault regarding Melva and depravity of mind with respect to Kory. It unanimously rejected the depravity aspect of c(4)(c) regarding Melva.\n\nThe trial court distinguished aggravated assault and torture in its charge to the jury. It defined aggravated assault as intending to, and succeeding in, causing severe physical pain in addition to death. It defined torture as intending to, and succeeding in, causing severe psychological pain.\n\nIn State v. Ramseur, supra, this Court narrowed the acts encompassed by aggravating factor c(4)(c). The Court explained that the \"essence of the legislative concern is the defendant's state of mind.\" 106 N.J. at 207, 524 A.2d 188. \"Society's concern, the community's concern, the Legislature's concern, is to punish most harshly those who intend to inflict pain, harm, and suffering -- in addition to intending death. . . . [T]he extreme physical or mental suffering must be precisely what defendant wanted to occur in addition to death.\" Id. at 208-09, 524 A.2d 188.\n\nThe State argues that defendant's hatred of his wife and his desire to be rid of her support the inference that he intended to inflict pain on her. I believe that those facts are evidential of his motive to kill but are insufficient to raise the inference of intent to cause severe physical suffering in addition to death under c(4)(c). Dr. Gould's testimony was read to the jury out of context in this regard, as his description concerned defendant's general emotions toward his wife, not his mental state at the time of the crimes. Rather, the proofs that the State relied on showed that as the two had argued, defendant had picked up a hammer and repeatedly struck Melva in the head, intending her death; the blows were struck successively and quickly. Given the centrality of the actor's intent under c(4)(c), there was insufficient evidence to submit that factor to the jury. See State v. Hunt, 115 N.J. 330, 388-89, 558 A.2d 1259 (1989) (\"multiple stab wounds, when combined with other evidence of defendant's intent, could support the contention that defendant knew or intended that the victim would suffer or that defendant wanted the victim to know that he or she was about to be murdered\") (emphasis added).\n\nI do not believe that depravity as an element of c(4)(c) was appropriately charged or properly found regarding Kory. Defendant's version of the events portrayed a heated argument in which defendant got extremely angry to the point where he picked up the hammer and blacked out during the killings. The State relies only on defendant's indication that he did not know why he murdered Kory as proof that the killing had served no purpose. The trial court refused to strike the factor, explaining that the jury could conclude that the defendant murdered Kory for \"no point . . . at all.\" The court submitted alternative factors: either that Kory had been killed to escape apprehension and prosecution, c(4)(f), or with depravity of mind, c(4)(c). The Court finds no error. Ante at 478, 585 A.2d at 894. What is indisputable is defendant's actions are tied to strong emotional responses. I believe therefore that the State's reliance on defendant's claim that he did not know why he killed Kory is misplaced. Rational or normal people may be unable to fathom or divine any \"reasons\" for the killing but that does not make the killing \"senseless.\" It was not the type of sadistic or cold-blooded killing that generally marks a murder as totally devoid of any sense or reason in human experience. This killing arose out of an acute family crisis, and involved a spasmodic release of emotions. To the rational mind the killing may be inexplicable and senseless, but certainly there is no indication that defendant killed Kory randomly for \"pleasure.\" In Ramseur, supra, this Court defined depravity of mind as encompassing generally the killing of a helpless person \"for no reason at all, just to kill.\" 106 N.J. at 211, 524 A.2d 188. We further observed in State v. Matulewicz, 115 N.J. 191, 198, 557 A.2d 1001 (1989), that the killing there was not the sort of \"thrill killing or one that was bereft of anger or frustration or a recognizable human emotion\" that is the essence of depravity. In my view, the \"depravity\" requirement of c(4)(c) was not met with respect to Kory's killing.\n\nI do not believe there was sufficient evidence to support the aggravating factors of c(4)(c) with respect to each of these\n\nkillings. Thus, the two death sentences must be reversed and the State should be barred from re-presenting this aggravating factor. See State v. Biegenwald, 106 N.J. 13, 51, 524 A.2d 130 (1987).\n\nV.\n\nDefendant also contends that several instances of prosecutorial misconduct resulted in reversible prejudice. Two of those occurred in the State's opening statement, in which the prosecutor said that although the State does not \"seek vengeance\" for the murder committed by defendant, \"[i]t's the law which demands what your fellow citizens expect and deserve, that justice be done for those murders which occurred one year ago today.\" The prosecutor also asked the jury to consider defendant's mitigation evidence and \"see it for what it's worth when weighed against the\" harm done to Melva, Kory, and the \"harm done to society.' He explained, \"[y]ou will then clearly see what your responsibility is according to your oath, that . . . the ultimate penalty must be paid by [this] defendant so that there can indeed be justice.' (Emphasis added).\n\nIn summation, there were other instances of prosecutorial misconduct. The prosecutor stated: \"You, ladies and gentlemen, are not killers, as defense counsel would want you to believe. You are instruments of the law. If our law is to have any meaning, if the wishes and desires of your fellow citizens are to have any purpose, you as jurors must do what you promised to during that jury selection process.' (Emphasis added). The prosecutor also stressed \"that our society views [multiple killings] with such horror, that it does indeed consider that a factor upon which the penalty of death [can], and indeed, as in this case should[,] be imposed.' (Emphasis added).\n\nThis Court declared in State v. Ramseur, supra, 106 N.J. at 322, 524 A.2d 188, that the jury cannot be invited to impose death to protect society or for other extraneous reasons, because that entreaty distracts them from their legitimate role --\n\nevaluating and weighing the facts before them. In State v. Rose, supra, the Court concluded that the prosecutor had improperly emphasized the need to deter the defendant from committing future violent acts, and to send a message of \"law and order\" to the community; the remarks \"focused the jury's attention on matters extraneous to the aggravating and mitigating factors established by the Legislature to channel the jury's deliberations in the penalty phase of a capital case.\" 112 N.J. at 521, 548 A.2d 1058. In addition, the Court found that the \"emotional force\" of those arguments engendered a significant possibility that the jurors had in fact been diverted, and therefore that the defendant's rights had been prejudiced at the penalty phase. Ibid. The Court noted that such statements were both inaccurate and misleading, because the statute does not mandate death for capital murder but rather leaves the determination to the jury's weighing of aggravating and mitigating factors. Ibid.\n\nI strongly disagree with the Court's assessment of the prosecutorial conduct in this case. The prosecutor focused on extraneous matters and did in effect dilute the jury's sentencing responsibility. Although the prosecutor professed that the State was not seeking vengeance and that the aggravating factors are those things that the Legislature deemed relevant, he clearly implied that the death sentence would satisfy the demand for vengeance.\n\nIn Rose, the prosecutor also told the jurors that Rose should receive the death sentence \"because that's what the law says,\" and that anything short of death would be a vote \"against the law;\" as \"[t]he law cries out for a [death] verdict here.\" 112 N.J. at 523, 548 A.2d 1058. As in Rose, the prosecutor here strongly implied that the law required or expected a death sentence, although he couched the argument in terms of the demands of justice. He also argued indirectly that society should be protected from the future acts of this defendant by emphasizing that it was \"harmed\" when murders occur. Further, the comments in summation that the jurors must do what\n\nthey had \"promised to do during . . . jury selection\" clearly refers to imposing the ultimate penalty, death.\n\nWe acknowledged in Rose that such commentary could seriously and adversely influence the defendant's right to fairness at the penalty phase, and would thus warrant reversal of the death sentence. Id. at 524, 548 A.2d 1058. This case requires the same result.\n\nVI.\n\nDefendant presented the testimony of numerous friends and relatives at the penalty phase. The first of those witnesses was Anthony Brown, a college friend and Kory's godfather. Defense counsel sought to ask Brown if he had \"any feelings . . . about whether Leon Moore should be sentenced to death or sentenced to life,\" but the court sustained an objection to the question. At sidebar, defense counsel argued that what people who knew defendant thought the punishment should be was relevant mitigating evidence. The trial court disagreed.\n\nIn Woodson v. North Carolina, 428 U.S. 280, 96 S. Ct. 2978, 49 L. Ed. 2d 944 (1976), a plurality of the Supreme Court first explained that the eighth amendment mandated that the sentencer in a capital case be permitted to consider \"the character and record of the individual offender and the circumstances of the particular offense as a constitutionally indispensable part of the process of inflicting the penalty of death.\" Id. at 304, 96 S. Ct. at 2991, 49 L. Ed. 2d at 961. Indeed, the body determining sentence must have a means of expressing the impact that evidence has on its decision. Eddings v. Oklahoma, 455 U.S. 104, 102 S. Ct. 869, 71 L. Ed. 2d 1 (1982).\n\nIn Lockett v. Ohio, 438 U.S. 586, 98 S. Ct. 2954, 57 L. Ed. 2d 973 (1978), the Court reaffirmed the need for individualized penal decisions in capital cases, and declared that\n\nthe Eighth and Fourteenth Amendments require that the sentencer, in all but the rarest kind of capital case, not be precluded from considering as a mitigating factor any aspect of a defendant's character or record and any of\n\nthe circumstances of the offense that the defendant proffers as a basis for a sentence less than death. [ Id. at 604, 98 S. Ct. at 2964, 57 L. Ed. 2d at 990 (emphasis in original).]\n\nRecently in Penry v. Lynaugh, 492 U.S. 302, 109 S. Ct. 2934, 106 L. Ed. 2d 256 (1989), the Supreme Court considered whether the eighth amendment was violated by the application of Texas' capital statute to defendant Penry because the statute failed to provide a means for the jury to express the impact that the defendant's mental retardation and background of abuse had on their sentencing decision. The Court found that the statute operated unconstitutionally, explaining:\n\n\"In contrast to the carefully defined standards that must narrow a sentencer's discretion to impose the death sentence, the Constitution limits a State's ability to narrow a sentencer's discretion to consider relevant evidence that might cause it to decline to impose the death sentence.\" McCleskey v. Kemp, 481 U.S. 279, 304, 107 S. Ct. 1756 [1773], 95 L. Ed. 2d 262 (1987) (emphasis in original). Indeed, it is precisely because the punishment should be directly related to the personal culpability of the defendant that the jury must be allowed to consider and give effect to mitigating evidence relevant to a defendant's character or record or the circumstances of the offense. Rather than creating the risk of an unguided emotional response, full consideration of evidence that mitigates against the death penalty is essential if the jury is to give a \"'reasoned moral response to the defendant's background, character, and crime.'\" Franklin [v. Lynaugh], 487 U.S. at [184], 108 S. Ct. 2320 [at 2333, 101 L. Ed. 2d 155 (1988)] (opinion concurring in judgment) (quoting California v. Brown, 479 U.S. at 545, 93 L. Ed. 2d 934, 107 S. Ct. 837 [at 841 (1987)] (concurring opinion)). [492 U.S. at 327-28, 109 S. Ct. at 2951, 106 L. Ed. 2d at 284.]\n\nThis Court considered what was meant by \"character evidence\" in State v. Davis, 96 N.J. 611, 477 A.2d 308 (1984). The defendant had sought to offer statistical data regarding the rehabilitative potential of similarly-situated defendants in mitigation of his punishment. The Court concluded that such statistical information could be helpful to the jury in assessing the likelihood that Davis would be rehabilitated, and was therefore relevant and admissible. Id. at 617, 477 A.2d 308. Rather than relying on constitutional grounds, the Court rested its holding on \"state statutory grounds,\" finding that the term \"character\" contained in N.J.S.A. 2C:11-3c(5)(h) \"embrac[ed] those individual qualities that distinguish a particular person.\" Id. at 618, 477 A.2d 308. To the extent that the statistical data\n\ncould provide a frame of reference for the jury's consideration of defendant's character, the Court found it within the language of mitigating factor c(5)(h).\n\nThe Court went further, discussing the generally broad perception of relevance, and also \"acknowledged that in the sentencing phase of a capital proceeding -- a life or death contest -- a defendant is entitled to the use of all reliable, helpful information.\" Id. at 619, 477 A.2d 308. The Court drew an analogy to the sentencing function of the judge in noncapital cases, and the relaxation of evidentiary rules so that the court may exercise \"far-ranging discretion as to the sources and types of evidence used to assist him or her in determining the kind and extent of punishment to be imposed.\" Id. at 620, 477 A.2d 308 (citing Williams v. New York, 337 U.S. 241, 69 S. Ct. 1079, 93 L. Ed. 1337 (1949)). \"In short, the sentencing process should embrace an evidential inquiry 'broad in scope, largely unlimited either as to the kind of information that may be considered, or the source from which it may come.'\" Ibid. (citation omitted). The only limitation expressly placed on this wide-open evidentiary ruling occurred when the trial court found the proffered evidence \"in whole or in part, [is such that] its probative value is substantially outweighed by its unfounded or speculative character and the risk of confusion of the essential issues.\" Id. at 624, 477 A.2d 308. The Court \"ascribed\" to the Legislature full appreciation of the similarity of a capital jury's function, and held that \"'so long as the evidence [introduced at a capital sentencing hearing] . . . does not prejudice a defendant, it is preferable not to impose restrictions.'\" Ibid. (quoting Zant v. Stephens, 462 U.S. 862, 886-87, 103 S. Ct. 2733, 2747-48, 77 L. Ed. 2d 235, 256 (1983) (citation omitted)).\n\nIn this case, the Court has determined that the testimony was properly excluded. It \"decline[s] to extend the 'narrowly-defined right' of allocution accorded the capital defendant [citation omitted] to allow witnesses to plead for mercy.\" Ante at 478-480, 585 A.2d at 894. I strongly disagree. In one sense, testimony offered for this purpose should be seen as similar to\n\na defendant's own right of allocution, compelled by the need for the jury to make an individualized judgment. See State v. Zola, supra, 112 N.J. at 428-32, 548 A.2d 1022. In another, the opinions of those who know the defendant best regarding whether he or she should be put to death for his or her crimes is probative of a defendant's character. Such opinion evidence is either mandatory under Woodson and later cases, or admissible under the broad parameters of relevant evidence discussed in Davis.\n\nIn addition, a defendant confronting the death penalty should not for purposes of punishment be placed in a less advantageous position than a defendant convicted of a noncapital crime. See, e.g., State v. Kiett, 121 N.J. 483, 582 A.2d 630 (1990) (Handler, J., concurring in part and dissenting in part). In an ordinary criminal proceeding, we impose almost no limitations on the evidence and information that can be furnished to the sentencing judge, including pleas for leniency or mercy made on behalf of the defendant. It is a cruel irony that a defendant facing the prospect of the ultimate punishment that can be exacted by society is powerless to ask for mercy.\n\nIn sum, I believe that barring these witnesses' opinions on whether the defendant should be put to death violates the principle that the sentencer consider all mitigating evidence relevant to a defendant's character. In view of the broad range of evidentiary material necessary to make an individualized decision concerning punishment, such pleas for mercy are appropriate. They may even be helpful to the jury in assessing the credibility or bias of defendant's character witnesses. I do not see any potential harm to the competing principle of uniformity.\n\nVII.\n\nI concur in the judgment of the Court, which reverses the capital-murder convictions and the death sentences. I dissent in part for the reasons expressed in this and other opinions to\n\nthe extent that the Court continues to hold that a capital-murder prosecution under our statute is constitutional and that other grounds, present in this case, do not also require reversals.\n\n\u003cspan class=\"fn\"\u003e1. The prosecutor made these remarks: [D]efendant stands before you convicted of the purposeful murder of \"his pregnant wife\"; defendant's hate and self interest led him to murder his \"pregnant wife\" to move out; he murdered his \"pregnant wife\" because he wanted his girlfriend to move in; defendant is a man who murdered his \"pregnant wife\" and son for no reason; weigh mitigating evidence against the harm done to his \"pregnant wife\"; defendant hated his \"pregnant wife\"; he answered the phone while his son and \"pregnant wife\" lay dead; defendant sought to have \"his wife, pregnant, move out\"; defendant wanted to inflict pain on a pregnant woman; \"So here is this woman, trying to protect herself, pregnant . . .\"; defendant caused Melva mental pain because she knew her fetus would not survive; consider the harm done to that \"pregnant woman\".\u003c/span\u003e\n\n",
    "body_length": 204625,
    "citedas": [
      "585 A.2d 864",
      "122 N.J. 420"
    ],
    "attorneys": "Jacqueline E. Turner, Assistant Deputy Public Defender, and Matthew Astore, Deputy Public Defender II, argued the cause for appellant (Wilfredo Caraballo, Public Defender, attorney). Nancy A. Hulett, Deputy Attorney General, argued the cause for respondent (Robert J. Del Tufo, Attorney General of New Jersey, attorney).",
    "category": [
      "243",
      "75"
    ],
    "judges": "For reversal and remandment -- Chief Justice Wilentz, and Justices Clifford, Pollock, O'Hern, Garibaldi and Stein. Dissenting in part; concurring in part -- Justice Handler. The opinion of the Court was delivered by O'Hern, J. Handler, J., concurring in part and dissenting in part.",
    "citation_count": 93
  }
}
