{
  "id": "uqJ9R2YBTlTomsSBD2hB",
  "document": {
    "title": "Aguilar v. AVIS Rent-A-Car System Inc.",
    "full_title": "OSCAR AGUILAR, ET AL. AND v. AVIS RENT-A-CAR SYSTEM, INC., ET AL. AND .",
    "jurisdiction": "California Court of Appeal",
    "date": "1996-05-21T00:00:00.000Z",
    "docket": "No. A069353",
    "body": "KING, J.:\n\nI. INTRODUCTION\n\nIn this case we hold that an injunction prohibiting a manager's continued use of racist epithets in the workplace, where such use was sufficiently severe or pervasive to alter the conditions of the victims' employment and create an abusive work environment, does not violate the constitutional proscription against prior restraints, because the injunction targets conduct amounting to employment discrimination as a \"secondary effect\" of such speech within the meaning of R. A. V. v. St. Paul (1992) 505 U.S. 377, 120 L. Ed. 2d 305, 112 S. Ct. 2538, rather than targeting the expressive content of the speech, and thus is not content based.\n\nThe employer, Avis Rent-A-Car System, Inc., and the manager, John Lawrence, challenge the constitutionality of an injunction by which the trial court sought to remedy employment discrimination violating the Fair Employment and Housing Act (FEHA) (Gov. Code, § 12900 et seq.). The injunction prohibits Lawrence from \"using any derogatory racial or ethnic epithets directed at, or descriptive of, Hispanic/Latino employees,\" and also orders him to refrain from \"any uninvited intentional touching\" of those employees, as long as he is employed by Avis in California. It is not limited to the workplace.\n\nWe conclude that to the extent the injunction prohibits Lawrence from continuing to use racist epithets in the workplace it is constitutionally sound, but to the extent it reaches beyond the workplace it improperly exceeds the scope of the FEHA violation sought to be prevented and must be modified accordingly. We reverse the injunctive portion of the judgment and remand the cause for modification to narrow the injunction's scope and describe the prohibited conduct with further specificity.\n\nII. BACKGROUND\n\nAvis employed the 17 Hispanic/Latino plaintiffs in this case as drivers at its San Francisco airport location, responsible for moving automobiles between parking lots and check-in and service station areas. In 1993, they sued Avis and ten individual managers, alleging multiple causes of action including employment discrimination in violation of FEHA.\n\nAccording to the complaint, the individual defendants engaged in racially discriminatory harassment which created an abusive work environment. (Gov. Code, § 12940, subd. (h)(1); Kelly-Zurian v. Wohl Shoe Co. (1994) 22 Cal. App. 4th 397, 409.) The basis of an abusive work environment claim is \"'discriminatory intimidation, ridicule, and insult' . . . that is 'sufficiently severe or pervasive to alter the conditions of the victim's employment . . . .'\" ( Harris v. Forklift Systems, Inc. (1993) 510 U.S. 17 [126 L. Ed. 2d 295, 301, 114 S. Ct. 367], quoting Meritor Savings Bank v. Vinson (1986) 477 U.S. 57, 65, 67, 91 L. Ed. 2d 49, 106 S. Ct. 2399.) The complaint alleged that Lawrence in particular, who was the service station manager, routinely called the plaintiffs \"'motherfuckers' and other derogatory names, and continually demeaned them on the basis of their race, national origin and lack of English language skills.\"\n\nThe case went to a jury as to twelve of the plaintiffs, three of the individual defendants, and Avis, with mixed results. The jury found racial discrimination as to eight plaintiffs and awarded each of them damages for emotional distress in the sums of either $15,000 or $25,000, for a total monetary award of $135,000. As to three of these plaintiffs the discrimination was by Lawrence; as to the other five the discrimination was by an Avis employee named Kathy Black who no longer worked at the San Francisco airport location. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e As to a ninth plaintiff, the jury found discrimination by Lawrence but no emotional distress. The jury found no discrimination as to the remaining three plaintiffs, and no discrimination by Avis managers other than Lawrence and Black.\n\nAfter the verdicts, the eight prevailing plaintiffs requested injunctive relief limited to the San Francisco airport location, requiring among other things that Lawrence and Avis \"cease and desist from all harassment or discrimination of employees whose national origin is from Latin America . . . .\" The defense objected that this language was vague and overbroad. The Judge granted an injunction, but changed the proposed language to specify racial slurs and touchings \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e by Lawrence and to extend beyond the San Francisco airport location.\n\nThe injunction states in pertinent part: \"Defendant John Lawrence shall cease and desist from using any derogatory racial or ethnic epithets directed at, or descriptive of, Hispanic/Latino employees of Avis Rent-A-Car System, Inc., and shall further refrain from any uninvited intentional touching of said Hispanic/Latino employees, as long as he is employed by Avis Rent A Car System, Inc. in California.\" The injunction also orders Avis not to allow Lawrence to commit such acts \"under circumstances in which it knew or should have known of such acts . . . .\" \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe court rendered judgment incorporating the jury verdict and the injunction, and Avis and Lawrence (hereafter Avis) filed a timely notice of appeal expressly limited to the injunctive portion of the judgment.\n\nIII. DISCUSSION\n\nOur primary concern in this appeal is with the constitutional implications of government regulation of speech in the workplace. Avis contends the challenged injunction restricts Lawrence's speech solely on the basis of its content and thus violates the First Amendment as well as our state Constitution (Cal. Const., art. I, § 2, subd. (a)).\n\nA. The Factual Underpinnings\n\nThe evidentiary posture of this appeal is critical to resolution of the issues presented.\n\nThis is a partial appeal on a record lacking a reporter's transcript of the trial. Avis has not appealed the damages portions of the judgment, and has elected to proceed by appendix (Cal. Rules of Court, rule 5.1) without a trial transcript, designating for transcription only the oral arguments on the posttrial hearings on injunctive relief.\n\nThis course of action by Avis has two fundamental consequences. First, because the appeal is partial, the unappealed damages portions of the judgment \"'must be deemed final, being a final judgment of the facts and rights which they determine.'\" ( Gonzales v. R.J. Novick Constr. Co. (1978) 20 Cal. 3d 798, 805, 144 Cal. Rptr. 408, 575 P.2d 1190, quoting Whalen v. Smith (1912) 163 Cal. 360, 362-363, 125 P. 904.) This means that the factual underpinnings of the damages portions of the judgment have been finally determined and are no longer subject to dispute.\n\nSecond, because \"the record does not contain the evidence presented at the trial, it must be presumed conclusively that the findings are supported by the evidence.\" ( Robert S. Bryant, Inc. v. Taber (1962) 199 Cal. App. 2d 884, 885, 19 Cal. Rptr. 150; accord, e.g., Burns v. Brown (1946) 76 Cal. App. 2d 639, 643, 173 P.2d 716.) Avis's election to proceed without a trial transcript invokes this conclusive presumption not only as to the factual underpinnings for the damages portions of the judgment, but also as to the trial Judge's factual determinations on the injunctive portion. The Judge stated from the bench that \"there was evidence presented sufficient for the jury to find that . . . Lawrence had engaged in acts of harassment so continual and severe as to alter the working conditions for those people there,\" and \"the court is making a finding of fact based on evidence observed during the trial, that . . . there's a substantial likelihood based on his actions that he will do so in the future unless restrained.\" Because Avis chose not to give us the trial evidence, the factual underpinnings of the damages and injunctive portions of the judgment are conclusively presumed.\n\nIndeed, Avis concedes these factual underpinnings in its reply brief, which states, \"Here, appellants are not disputing the questions of fact that give rise to the injunction, which Respondents have had ample opportunity to plead and prove. On this appeal, Appellants are challenging the injunction as written, not because the underlying facts do not warrant the injunction, but because Appellants contend the language is impermissible on a constitutional basis.\" (Italics added.) This is an admission of the undisputed factual basis for the injunction, and we treat the admission as binding against Avis. ( Franklin v. Appel (1992) 8 Cal. App. 4th 875, 893, fn. 11; Mangini v. Aerojet-General Corp. (1991) 230 Cal. App. 3d 1125, 1152, 281 Cal. Rptr. 827.)\n\nThe factual underpinnings of the FEHA claim are thus conclusively established by the partial nature of the appeal, by the form of the appellate record, and by Avis's own admission. Those factual underpinnings are in the complaint's allegations that Lawrence \"continually demeaned [plaintiffs] on the basis of their race, national origin and lack of English language skills.\" Indeed, to prove the abusive work environment claim -- that is, that Lawrence's racist invective was sufficiently severe or pervasive to alter the conditions of the plaintiffs' employment ( Harris v. Forklift Systems, Inc., supra, U.S. at p. [126 L. Ed. 2d at p. 301]) -- the plaintiffs' goal was to show \"'a steady barrage of opprobrious racial comment.'\" ( Hicks v. Gates Rubber Co. (10th Cir. 1987) 833 F.2d 1406, 1412-1413, quoting Johnson v. Bunny Bread Co. (8th Cir. 1981) 646 F.2d 1250, 1257.) Given the peculiar appellate posture of this case, we must assume they made that showing. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nConsequently, on this appeal, the operative fact is that Lawrence subjected three plaintiffs not merely to occasional rude or impolite language, but to a continual barrage of opprobrious racist invective. He did not, as our Concurring and Dissenting colleague suggests, merely refer to his coworkers as \"motherfuckers.\" (Conc. \u0026 dis. opn., post, at pp. 982, 987, fns. 25, 30.) \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nB. The Law of Racist Speech in the Workplace\n\nThe question of how the law should respond to verbal abuse in the form of racial and ethnic slurs has perplexed the courts and legal scholars for years. Half a century ago, the United States Supreme Court declared that government may proscribe \"fighting words\" which \"by their very utterance inflict injury or tend to incite an immediate breach of the peace.\" ( Chaplinsky v. New Hampshire (1942) 315 U.S. 568, 572, 86 L. Ed. 1031, 62 S. Ct. 766.) Some legal scholars have argued that racial and ethnic slurs \"by their very utterance inflict injury\" (ibid.) through profound humiliation and the implicit threat of violence, causing psychological and emotional damage, and should not receive constitutional protection. (E.g., Delgado, Words That Wound: A Tort Action for Racial Insults, Epithets, and Name-Calling (1982) 17 Harv. C.R.-C.L. L.Rev. 133, 135-147; C. Lawrence, If He Hollers Let Him Go: Regulating Racist Speech On Campus (1990) 1990 Duke L.J. 431, 452, 461-462; Matsuda, Public Response to Racist Speech: Considering the Victim's Story (1989) 87 Mich L.Rev. 2320, 2335-2338, 2357.) Others disagree, advocating total constitutional protection or some sort of middle ground. (See Massaro, Equality and Freedom of Expression: The Hate Speech Dilemma (1991) 32 William \u0026 Mary L.Rev. 211.) \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nThe courts have restricted application of the fighting words doctrine to speech that presents an actual danger it will cause a breach of the peace. (See Collin v. Smith (N.D. Ill. 1978) 447 F. Supp. 676, 691.) The curious result is that the doctrine protects those who are likely to react with violence, but not those who are too fearful to fight back. (See F. Lawrence, Resolving the Hate Crimes/Hate Speech Paradox: Punishing Bias Crimes and Protecting Racist Speech (1993) 68 Notre Dame L.Rev. 673, 710-711; Shiffrin, Racist Speech, Outsider Jurisprudence, and the Meaning of America (1994) 80 Cornell L.Rev. 43, 80.) It excludes many victims of racial epithets, which commonly arise in an intimidating context \"evoking the ever-present specter of bias-motivated violence, and, with it, real fear in the recipient.\" (Stevens, The Freedom of Speech (1993) 102 Yale L.J. 1293, 1311.) Victims of racist speech are frequently too intimidated to react with violence -- especially where, as here, the speaker is a manager where they work. Thus, racist invective is often beyond the reach of the fighting words doctrine. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nOne venue where there has been no ambiguity, however, is the workplace. Title VII of the Civil Rights Act of 1964 makes it unlawful for an employer to discriminate because of \"race, color, religion, sex, or national origin.\" (42 U.S.C.S. § 2000e-2, subd. (a)(1).) This proscription encompasses racial harassment that is sufficiently severe or pervasive to alter the conditions of the victim's employment and create an abusive work environment. (Harris v. Forklift Systems, Inc., supra, U.S. at p. [126 L. Ed. 2d at p. 301].) The same rule applies under FEHA (Gov. Code, § 12940, subd. (h)(1); Kelly-Zurian v. Wohl Shoe Co., supra, 22 Cal. App. 4th at p. 409), where the definition of \"harassment\" includes \"verbal harassment, e.g., epithets, derogatory comments or slurs . . . .\" (Cal. Code Regs., tit. 2, § 7287.6, subd. (b)(1)(A).)\n\nFrequent or pervasive workplace use of racial slurs resulting in an abusive work environment has been held to constitute actionable racial harassment under Title VII. ( Daniels v. Essex Group, Inc. (7th Cir. 1991) 937 F.2d 1264, 1273-1274 [frequent racist taunts created subjectively and objectively abusive work environment].) Such conduct has also been enjoined under Title VII. ( E.E.O.C. v. Beverage Canners, Inc. (11th Cir. 1990) 897 F.2d 1067, 1070 [injunctive relief for frequent racist remarks made to or about black employees by manager and coworkers]; Snell v. Suffolk County (D.C.N.Y. 1985) 611 F. Supp. 521, 532 [injunction requiring employer to prohibit employees from using specified racial and ethnic epithets]; cf. Robinson v. Jacksonville Shipyards, Inc. (M.D.Fla. 1991) 760 F. Supp. 1486, 1534 [First Amendment \"does not impede the remedy of injunctive relief\" for sexual harassment]; E.E.O.C. v. Hacienda Hotel (9th Cir. 1989) 881 F.2d 1504, 1515, 1518-1519 [injunctive relief for sexual harassment consisting of persistent sexually offensive remarks].) Discriminatory harassment is also enjoinable under FEHA. (See Gov. Code, § 12920.5 [authorizing \"effective remedies that will both prevent and deter unlawful employment practices\"]; see Peralta Community College Dist. v. Fair Employment \u0026 Housing Com. (1990) 52 Cal. 3d 40, 53, 276 Cal. Rptr. 114, 801 P.2d 357 [Fair Employment and Housing Commission may order employer to cease and desist harassment].) \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nGiven the peculiar appellate posture of the present case, and the operative fact that Lawrence subjected three plaintiffs to a continual barrage of racist invective that altered the conditions of their employment, this case is squarely within the ambit of FEHA's proscription of racial harassment that creates an abusive work environment. We need not and do not decide whether this is a fighting words case.\n\nC. The Secondary Effects Rule\n\nThe key issue is whether employment discrimination law as applied to racist speech in the workplace is changed by R. A. V. v. St. Paul, supra, 505 U.S. 377. In R. A. V., the Supreme Court invalidated a city ordinance against cross burning, which was treated in that case as a form of fighting words, because the ordinance did not proscribe all fighting words but discriminated against a subclass of them based on race, color, creed, religion or gender -- i.e., because of their content. (505 U.S. 377 at p. 391.) The gist of R. A. V. is that \"while certain categories of speech and expressive conduct may be regulated, such regulation may not discriminate within that category on the basis of content.\" ( In re Steven S. (1994) 25 Cal. App. 4th 598, 610, original italics.) Avis contends the prohibition against Lawrence's use of racial slurs is content based and thus violates the rule set forth in R. A. V.\n\nBut R. A. V. enunciated several exceptions to the rule it announced, one of which allows the prohibition of expression because of its secondary effects rather than its content. The classic example, cited in R. A. V. (505 U.S. at p. 389), is the imposition of zoning restrictions on adult motion picture theaters in order to prevent urban blight, which is a secondary effect of such theaters. ( Renton v. Playtime Theatres, Inc. (1986) 475 U.S. 41, 47-48, 89 L. Ed. 2d 29, 106 S. Ct. 925.) The majority opinion in R. A. V. said that \"since words can in some circumstances violate laws directed not against speech but against conduct . . ., a particular content-based subcategory of a proscribable class of speech can be swept up incidentally within the reach of a statute directed at conduct rather than speech.\" [ 505 U.S. at p. 389.) The opinion then gave an example -- sexual harassment -- that is particularly germane to the present appeal: \"Thus, for example, sexually derogatory 'fighting words,' among other words, may produce a violation of Title VII's general prohibition against sexual discrimination in employment practices [citation].\" (Ibid..) The opinion concluded, \"Where the government does not target conduct on the basis of its expressive content, acts are not shielded from regulation merely because they express a discriminatory idea or philosophy.\" (505 U.S. at p. 390.)\n\nR. A. V.'s singling out of sexist epithets tells us that the law against severe or pervasive workplace use of racist epithets creating an abusive work environment is alive and well. Indeed, a Concurring opinion in that case pointed out that the majority's Discussion of the secondary effects rule was specifically intended to preserve abusive work environment claims. (505 U.S. at p. 409-410 (conc. opn. of White, J.).) If severe or pervasive use of sexist epithets may constitute proscribable employment discrimination and \"can be swept up incidentally within the reach of a statute directed at conduct rather than speech\" (505 U.S. at p. 389), then the same must be true of such use of racist epithets in the workplace. In both instances, the law targets conduct that alters the conditions of employment -- that is, employment discrimination -- rather than mere expression, and is not content based.\n\nThus, although racist epithets \"express a discriminatory idea or philosophy\" (ibid.), that of racial supremacy, their pervasive use in the workplace is not shielded from regulation under Title VII and FEHA because the target of the regulation is the secondary effect of such conduct -- employment discrimination -- not its expressive content.\n\nThis point is driven home in a post-R. A. V. case, Harris v. Forklift Systems, Inc., supra, U.S. [126 L. Ed. 2d 295, 114 S. Ct. 367], where the United States Supreme Court observed in the closely-related field of workplace sexual harassment, \"A discriminatorily abusive work environment, even one that does not seriously affect employees' psychological well-being, can and often will detract from employees' job performance, discourage employees from remaining on the job, or keep them from advancing in their careers.\" ( Id. at p. [126 L. Ed. 2d at p. 302].) Surely these are secondary effects of severe or pervasive sexist speech; that is what enables government regulation of such speech in the workplace. In FEHA, our Legislature has declared that employment discrimination \"foments domestic strife and unrest, deprives the state of the fullest utilization of its capacities for development and advance, and substantially and adversely affects the interests of employees, employers, and the public in general.\" (Gov. Code, § 12920.) Again, these various societal ills are secondary effects of a discriminatorily abusive work environment, as surely as urban blight is a secondary effect of adult motion picture theaters.\n\nAvis relies on R. A. V.'s observation that \"the emotive impact of speech on its audience is not a 'secondary effect.'\" ( R. A. V. v. St. Paul, supra, 505 U.S. at p. 394, quoting Boos v. Barry (1988) 485 U.S. 312, 334, 99 L. Ed. 2d 333, 108 S. Ct. 1157.) Our concern here, however, is not with the emotive impact of racist speech -- e.g., the hurt feelings or anger caused by a single racial slur -- but with employment discrimination resulting from an abusive work environment created by a continual barrage of racist invective. The key difference is that the employment discrimination claim, like a claim of sexual harassment, is founded on harassing speech that is so severe or pervasive as to alter the conditions of the victim's employment. (Harris v. Forklift Systems, Inc., supra, U.S. at p. [126 L. Ed. 2d at p. 301].) Such speech has more than an emotive impact. By altering the conditions of employment, as adult motion picture theaters alter the conditions of a neighborhood, such speech crosses the line between constitutionally protected expression and proscribable discriminatory conduct. (Cf. In re Steven S., supra, 25 Cal. App. 4th at p. 612 [\"fear and intimidation\" from cross burning aimed at specific victim \"crosses the line between emotive reaction and tangible injury\"].) \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nAvis also argues that R. A. V.'s exposition of the secondary effects rule is limited to categories of proscribable speech such as fighting words, libel and obscenity, into which Lawrence's speech does not fall -- i.e., that only such proscribable speech may be regulated based on the justification that the target is secondary effect rather than expressive content. Not so. The classic secondary effects case, involving zoning restrictions on adult motion picture theaters, concerned expression that enjoys First Amendment protection (though to a lesser magnitude than political debate). ( Renton v. Playtime Theaters, Inc., supra, 475 U.S. at pp. 49, fn. 2, 54.) And R. A. V. itself said that \"sexually derogatory 'fighting words,' among other words,\" may produce a violation of Title VII. ( R. A. V. v. St. Paul, supra, 505 U.S. at p. 389, italics added.) By including the phrase \"among other words,\" R. A. V. expanded its statement on the secondary effects rule beyond categories of proscribable speech to encompass any speech that creates an abusive work environment violating the law of employment discrimination.\n\nIn short, R. A. V. and Harris tell us in no uncertain terms that the workplace use of discriminatory epithets, whether racist or sexist, that is sufficiently severe or pervasive to alter the conditions of employment may be proscribed in order to prevent the secondary effects of an abusive work environment. We conclude that employment discrimination law as applied to such conduct -- authorizing injunctive relief under both Title VII and FEHA -- is not only unchanged, but expressly validated, by R. A. V.\n\nD. Prior Restraint\n\nAvis contends the present injunction is an invalid prior restraint under article I, section 2, subdivision (a) of the California Constitution, which provides, \"Every person may freely speak, write and publish his or her sentiments on all subjects, being responsible for the abuse of this right. A law may not restrain or abridge liberty of speech or press.\" This provision \"is more definitive and inclusive than its federal counterpart\" and protects speech \"from any prepublication sanctions, i.e., from all prior restraints.\" ( Pines v. Tomson (1984) 160 Cal. App. 3d 370, 393, 206 Cal. Rptr. 866.)\n\nWe have seen that the federal constitutional prohibition of prior restraints has not prevented courts from enjoining racial harassment under Title VII. (Ante, p. [typed opn. p. 9].) This is because \"potentially expressive activities that produce special harms distinct from their communicative impact . . . are entitled to no constitutional protection.\" ( Roberts v. United States Jaycees (1984) 468 U.S. 609, 628, 82 L. Ed. 2d 462, 104 S. Ct. 3244.) This is a manifestation of the secondary effects rule described in R. A. V., which permits, as content-neutral regulation, a prohibition of conduct that is not targeted on the basis of its expressive content. ( R. A. V. v. St. Paul, supra, 505 U.S. at p. 390.)\n\nProfessor Tribe explains that \"regulations with only indirect or minor effects on speech are really not prior restraints at all.\" (Tribe, American Constitutional Law (2d ed. 1988) p. 1051, fn. 37, italics added.) \"The [United States Supreme] Court has held, for example, that a restriction cannot be a prior restraint unless it is directed at expressive activities and substantially eliminates opportunities for such expression.\" (Id., italics added, citing Arcara v. Cloud Books, Inc. (1986) 478 U.S. 697, 707, 92 L. Ed. 2d 568, 106 S. Ct. 3172 [closure of adult bookstore because of prostitution on premises was permissible because sanction \"was directed at unlawful activity having nothing to do with books or other expressive activity\"].) Thus, under federal constitutional law, a prepublication sanction such as injunctive relief does not amount to a prior restraint on speech if the target of the sanction is the secondary effect of the speech rather than its expressive content -- that is, if the sanction is content neutral.\n\nIs California constitutional law any different in this respect? We think not. There is a paucity of law on point, beyond the basic notion that \"sentiments\" are protected \"from all prior restraints\" ( Pines v. Tomson, supra, 160 Cal. App. 3d at p. 393), but a recent decision would bring California constitutional law in line with the federal rule that a content-neutral prepublication sanction does not violate the rule against prior restraints. In Lopez v. Tulare Joint Union High School Dist. (1995) 34 Cal. App. 4th 1302, the court upheld a school board's decision to require a film arts class instructor to have his students delete profanity from a student-produced film. In concluding that the decision did not violate California's constitutional prohibition against prior restraints, the court said, \"The Board has not censored the students' expression of ideas; rather the Board has prohibited their expression of those ideas by the use of profane language. The Board's directive cannot be construed as the type of censorship which the California courts have deemed unconstitutional -- censorship based on a disagreement with the views presented, or to avoid criticism of Board policy, or to avoid Discussion of controversial issues. Rather, the Board's directive was content neutral and served a valid pedagogical objective.\" ( Id. at p. 1329, italics added.)\n\nIf, under California constitutional law as applied in Lopez, content neutrality takes a prepublication restriction beyond the purview of the California constitutional prohibition against prior restraints, then California law mirrors federal law in this respect. Under both constitutions, a prepublication sanction is not a prior restraint on speech if, by virtue of targeting the secondary effect of speech, it is content neutral. Such a sanction is not a regulation of speech but of nonexpressive conduct -- whether it targets urban blight in the case of adult motion picture theaters, or employment discrimination in the present case -- and for that reason does not violate California's prohibition against prior restraints because it is not a prior restraint of speech \"at all.\" (Tribe, American Constitutional Law, supra, at p. 1051, fn. 37.)\n\nE. The Injunction\n\n1. Scope\n\nThis brings us to the injunction at hand. It prohibits Lawrence from using racial or ethnic epithets \"directed at\" Hispanic/Latino employees. With regard to such use in the workplace, there is no constitutional problem. This prohibition is an acceptable FEHA remedy for employment discrimination, aimed at the secondary effects of conduct rather than the expressive content of speech.\n\nThe injunction also prohibits Lawrence from using racial or ethnic epithets \"descriptive of\" Hispanic/Latino employees, and thus goes beyond speech directed at the persons who are the subjects of the invective. Again, with regard to such use in the workplace, there is no constitutional infirmity. Avis argues that racist workplace speech that is neither spoken to nor heard by Hispanic/Latino employees will not affect their working conditions. (See Volokh, Freedom of Speech and Workplace Harassment (1992) 39 U.C.L.A. L.Rev.1791, 1871-1872 [proposing workplace harassment rule prohibiting \"offensive speech that is targeted at a particular employee\" but not \"undirected speech, such as overheard conversations between willing employees\"].) In the context of the present case, we disagree. Continual use of racist epithets poisons the atmosphere of the workplace, even when some of the invective is not directed at or even heard by the victims. If the Hispanic/Latino employees at Avis's San Francisco airport location know that Lawrence is free to continue voicing his on-the-job racist epithets behind their backs, it will remain a hostile place at which to work. Under the present circumstances, where there was direct racist invective, continued indirect invective would serve to maintain an abusive work environment, and thus both are properly enjoined.\n\nBut the injunction reaches beyond the workplace, and to that extent the court went astray. \"It is a familiar doctrine of equity that the scope of [an] injunction will be limited to the wrongful act sought to be prevented.\" ( Magill Bros. v. Bldg. Service etc. Union (1942) 20 Cal. 2d 506, 512, 127 P.2d 542.) Here, the wrongful act sought to be prevented is employment discrimination through racial harassment that creates an abusive work environment. Lawrence's use of racial or ethnic epithets outside the workplace has nothing to do with the fostering of an abusive work environment at Avis's San Francisco airport location, and thus is beyond the scope of the secondary effects rule as described in R. A. V. Such speech will not contribute to the employment discrimination at issue here. Thus, the inclusion of non-workplace speech (and, likewise, non-workplace uninvited intentional touching) within the scope of the injunction was error. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nWhat is the appropriate appellate remedy? Where part of an injunction is invalid, it is void in its entirety -- and reversal is required -- \"[if] a court cannot reasonably undertake to eliminate its invalid operation by severance or construction . . . .\" ( In re Berry (1968) 68 Cal. 2d 137, 156, 65 Cal. Rptr. 273, 436 P.2d 273.) Here, we could eliminate the injunction's invalid operation in a way similar to severance or construction -- by modifying the judgment and injunction to narrow their scope to the workplace. We are statutorily authorized to do so (Code Civ. Proc., § 43), and there is judicial precedent for doing so ( Demeter v. Annenson (1947) 80 Cal. App. 2d 48, 58, 180 P.2d 998 [injunction modified by appellate court to limit its duration]). We opt instead for reversal, however, so that the trial Judge may have an opportunity to ameliorate the injunction in another respect, which we address next.\n\n2. Vagueness\n\nAvis contends the injunction is vague and ambiguous in prohibiting \"derogatory racial or ethnic epithets directed at, or descriptive of,\" Hispanic/Latino employees, and any \"uninvited intentional touching.\" Avis's opening brief asks, \"What do these terms mean?\" Complaining that the injunction does not define its terms, Avis wonders how Lawrence will know what is derogatory, what is a racial or ethnic epithet, what it means to be directed at or descriptive of, and what it means for a touching to be uninvited and intentional.\n\nThe nine words at issue -- \"derogatory,\" \"racial,\" \"ethnic,\" \"epithets,\" \"directed,\" \"descriptive,\" \"uninvited,\" \"intentional\" and \"touching\" -- are not words of art, are not technical or arcane, and are hardly obscure. This is plain English. Indeed, Lawrence seems to know what is proscribed: as defense counsel pointed out in the posttrial hearings, Lawrence ceased his invective once this lawsuit was filed.\n\nIf these words are unconstitutionally vague, the same could be said of California's anti-harassment statutes and Judicial Council form restraining orders, which include the more expansive phrases \"harass,\" \"disturb the peace,\" \"annoy\" and \"alarm.\" (Code Civ. Proc., § 527.6 [person may obtain injunction against conduct \"which seriously alarms, annoys, or harasses the person\"]; Pen. Code, § 646.9 [stalker who \"repeatedly follows or harasses another person and who makes a credible threat\" is guilty of crime]; Pen. Code, § 11414 [person who \"intentionally harasses the child or ward of any other person because of that person's employment\" is guilty of misdemeanor]; Judicial Council of Cal., Form 1285.05 [marital cases; restrained person shall not \"disturb the peace\" of the other party]; Form 1296.10 [domestic violence cases; restrained person shall not \"disturb the peace of the person to be protected\"]; Form WH-140 [employee harassment cases; restrained person must not \"threaten, alarm, annoy, or harass employee\"].)\n\n\"It will always be true that the fertile legal 'imagination can conjure up hypothetical cases in which the meaning of [disputed] terms will be in nice question.\" ( Grayned v. City of Rockford (1972) 408 U.S. 104, 110, fn. 15, 33 L. Ed. 2d 222, 92 S. Ct. 2294, quoting American Communications Assn. v. Douds (1950) 339 U.S. 382, 412, 94 L. Ed. 925, 70 S. Ct. 674.) Avis has done so in its briefs, suggesting several unlikely \"scenarios\" where Lawrence might unwittingly run afoul of the injunction. Such sophistry is no basis for a finding of unconstitutional vagueness. \"Condemned to the use of words, we can never expect mathematical certainty from our language.\" ( Grayned, supra, at p. 110.)\n\nNevertheless, we acknowledge the difficulty in crafting an injunction that adequately apprises Lawrence and Avis what is prohibited. While we are confident that Lawrence and Avis are perceptive enough to understand what falls within the injunction's general prohibition against \"derogatory racial or ethnic epithets,\" it remains possible that, given cultural differences, words seemingly innocuous to Lawrence might be subjectively offensive to his Hispanic/Latino coworkers.\n\nOur preference is for the injunction to specify further an exemplary list of prohibited epithets, in the manner of the injunction in Snell v. Suffolk County, supra, 611 F. Supp. at page 532, which required a jail warden to \"forbid the use by correction officers on any County property and on all County business of: (1) epithets such as 'nigger,' 'polack,' 'kike,' 'spic,' 'guinea,' 'honky,' 'mick,' 'coon,' and 'black bitch' (all of which have been used on the job by correction officers in recent years) . . . .\" \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e A similar listing of prohibited words -- specifying epithets \"such as\" those actually used in the workplace by Lawrence -- would more precisely warn Lawrence and Avis what is forbidden.\n\nUnder normal circumstances, we might craft such a listing and modify the injunction accordingly (see ante, p. 950), but here we are hamstrung by the peculiar state of the appellate record, which does not contain the trial evidence and therefore does not tell us the specific \"derogatory racial or ethnic epithets\" Lawrence actually used. (See ante, p. 942, fn. 5.) We must therefore defer to the trial Judge in this respect, because he, unlike us, knows the words spoken by Lawrence.\n\nWe therefore decline to modify the injunction directly. Instead, we shall reverse the injunctive portion of the judgment and remand the cause with directions to the trial Judge to (1) redraft the injunction in a manner that (a) limits its scope to the workplace, and (b) adds an exemplary list of prohibited derogatory racial or ethnic epithets, specifying epithets such as those actually used in the workplace by Lawrence, and (2) render a new judgment for plaintiffs incorporating the injunction as redrafted.\n\n3. Need\n\nFinally, we address the question whether an injunction was necessary in this case. At the posttrial hearings on injunctive relief, defense counsel argued that no injunction was needed because the evidence \"was almost exclusively that the events took place in 1991 and 1992, not that it was ongoing at the present.\" The Judge responded by expressly finding, \"based on evidence observed during the trial, that based on the evidence showing harassment and discrimination . . . by Mr. Lawrence, there's a substantial likelihood based on his actions that he will do so in the future unless restrained. And if he hasn't done so since 1992 to the present, that may be because of the pending action. And I think that the fact that there's legal action against him has had a salutary effect on him. And I mean to keep it going by granting the prohibitory injunction.\" \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Later, the Judge concluded the injunction was necessary \"to avoid a multiplicity of torts.\"\n\nOnce again, the state of the appellate record is determinative. The Judge relied on the trial evidence to find a substantial likelihood of future harassment and the consequent need for an injunction to avoid multiple lawsuits. Because Avis has chosen not to include the trial evidence in the record, we must conclusively presume that this finding is supported by the evidence -- that is, by evidence of a two-year (1991-1992) period of continual harassment suspended only by the onset of litigation. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e \"An employer that takes curative actions only after it has been sued fails to provide sufficient assurances that it will not repeat the violation to justify denying an injunction.\" ( E.E.O.C. v. Goodyear Aerospace Corp. (9th Cir. 1987) 813 F.2d 1539, 1544.)\n\nIt is well settled that injunctive relief is appropriate to prevent a multiplicity of actions for damages. (Code Civ. Proc., § 526, subd. (a)(6); Mendelson v. McCabe (1904) 144 Cal. 230, 233, 77 P. 915.) The need for this injunction is indisputable. And, as limited to the workplace, the challenged provisions of the modified injunction will burden no more speech than necessary to serve the significant government interest in proscribing employment discrimination. ( Madsen v. Women's Health Center (1994) U.S. [129 L. Ed. 2d 593, 608, 114 S. Ct. 2516].) \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nF. Conclusion\n\nOur holding is this: racist workplace speech that is sufficiently severe or pervasive to alter the conditions of the victim's employment and create an abusive work environment is enjoinable under FEHA, without violating the constitutional proscription against prior restraints, because the injunction targets conduct amounting to employment discrimination, not free expression, and thus is not content based. The rule against prior restraints is not violated for the simple reason that there is no direct restraint of free expression, since the injunction is directed at conduct rather than expressive activity. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nOur Concurring and Dissenting colleague characterizes the result in this case as \"unprecedented.\" (Conc. \u0026 dis. opn., post, at p. 958.) To the extent he means this is a case of first impression, he is right. But we find ample precedent for our holding in the opinions of the United States Supreme Court crafting the secondary effects doctrine. In our Conclusion that racial harassment may have the secondary effect of creating an abusive work environment amounting to enjoinable employment discrimination, we are guided by the obvious analogy to sexual harassment in the workplace, which the Supreme Court tells us may likewise have the secondary effect of creating an abusive work environment. If workplace sexual harassment rooted in severe or pervasive sexist speech invokes the secondary effects doctrine and takes such conduct outside the scope of constitutional protection, then surely the same must be true for racial harassment.\n\nOur colleague eloquently invokes the right to freedom of speech, but fails to appreciate that Lawrence has not merely offended his Hispanic/Latino coworkers with what the opinion calls \"rude\" and \"impolite\" language (conc. \u0026 dis. opn. post, at pp. 960, 974, 979, 983, \u0026 fn. 19), but has created an abusive work environment by subjecting them to continuous racist invective-- that is, he has engaged in constitutionally unprotected conduct rather than protected expression. The factual basis for that Conclusion is undisputed and is conceded by Avis. This is much more than free expression in a rude or impolite manner. This is employment discrimination.\n\nOur colleague believes we are being \"culturally parochial\" by imposing \"an aesthetic standard of decorum\" on \"the vigorously physical, more frank and less euphemistic workaday world\" of automobile service workers. (Conc. \u0026 dis. opn., post, at p. 983.) We disagree. Common respect for one's coworkers, and freedom from workplace discrimination, are not, in his words, the exclusive reserve of \"middle-class manners, appropriate to a court or an office.\" (Ibid.) Title VII and FEHA protect all workers equally from racial and sexual harassment. Automobile service workers should not have to settle for less. To suggest that we are suppressing nothing more than \"impolite expressions of which we do not approve\" (conc. \u0026 dis. opn., post, p. [typed opn. p. 32]) trivializes the grievous harm caused by racial and sexual harassment in the workplace -- conduct which Congress and the California Legislature have made actionable and enjoinable.\n\nIf ever there was a case of secondary effects as envisioned by Supreme Court jurisprudence, this is it: employment discrimination created by a manager's severe or pervasive use of racist epithets. If the secondary effects doctrine does not apply here, it does not apply to like conduct amounting to sexual harassment, and it ultimately becomes meaningless, reduced to a clever theory with no practical application. Surely, in R. A. V. v. St. Paul, the United States Supreme Court meant to do more than pay lip service to an empty vessel.\n\nOur colleague defends the right to engage in \"uninhibited and robust Discussion\" without prior restraint -- even when it amounts to racial discrimination in the workplace -- as a bulwark against \"totalitarian government.\" (Conc. \u0026 dis. opn., post, at p. 960, fn. 6.) This is strangely ironic in light of the origins of modern totalitarianism in racism itself. (See generally Arendt, The Origins of Totalitarianism (1961).) Ultimately, our disagreement is the casualty of a difficult balancing act between two fundamental concerns of modern democracy: on the one hand, what he rightly extols as \"our national tradition . . . to protect the rights of our citizens to freely and fully speak their views\" (conc. \u0026 dis. opn., post, at p. 960, fn. 6), and, on the other hand, what we equally cherish as the effort of government to protect its citizens from racial and sexual discrimination. We believe that, through the secondary effects doctrine, the United States Supreme Court has shown us a path that permits us to uphold the latter without transgressing the former.\n\nFinally, putting aside the legalese, let's look at our colleague's view of this case from the perspective, for example, of a black laborer whose supervisor repeatedly calls him a \"nigger\" at work. What can the employee do? Our colleague would tell him: \"Yes, your boss is being rude and impolite, but don't be so middle class; remember that you are working in the vigorously physical, more frank and less euphemistic workaday world. But if you insist on being culturally parochial and doing something about it, short of punching him in the nose and getting yourself fired, you can sue him. After a few years of litigation and thousands of dollars in legal fees, you might recover some money. Just don't expect us to tell him he can't call you a nigger at work anymore. We can make him pay, but we can't make him stop. But don't worry: if he continues to call you a nigger, you can sue him again!\" How can this make sense to anyone?\n\nWe conclude this injunction, as modified, is not a prior restraint on freedom of expression, but lawfully precludes employment discrimination as a secondary effect of severe or persistent racist speech. Our colleague calls this \"overzealous political correctness.\" (Conc. \u0026 dis. opn., post, at p. 987). We call it the fulfillment of our Legislature's promise that the democratic ideals of equality, tolerance and pluralism will extend to the workplace.\n\nIV. DISPOSITION\n\nThe injunctive portion of the judgment is reversed and the cause is remanded for further proceedings as directed in this opinion. The parties shall bear their own costs on appeal.\n\nHANING, J., Concurring.\n\nPETERSON, P.J.:\n\nI concur in part and respectfully Dissent in part, for the reasons which follow.\n\nI. Overview: The Constitutional Free Speech Rights In Issue Here Cannot Be the Subject of Prior Restraint by an Unconstitutional and Overbroad Injunction\n\nI concur only with the majority's Conclusion that the injunction entered by the trial court is unconstitutionally overbroad and vague. That injunction violates the First Amendment to the federal Constitution and the free speech guarantee of article I, section 2 of the California Constitution. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Reversal is, thus, required; and the majority is correct in its actual holding, which reverses the injunction imposed by the trial court.\n\nI respectfully Dissent from the majority's remand, supported by an unprecedented creation on appeal of dicta apparently suggesting that prior restraints on speech are constitutional, even though the speech being suppressed does not constitute \"fighting words\" which might arguably be subject to such restraint. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Those statements in dicta are unnecessary and are wrong. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Prior restraints on speech such as the ones imposed by the trial court are unconstitutional and, on this record, unnecessary and futile.\n\nThe trial court's injunction in issue here was based upon a factual record which the majority now acknowledges is inadequate; and upon a showing that some years before the trial court's injunction issued, an employee criticized the job performance of four coworkers, out of seventeen who sought damages from him, and referred to them using the rude, but unfortunately increasingly common term, \"'motherfuckers.'\" The trial court did not, and could not, make the necessary findings of an ongoing pattern of wrongful conduct by Lawrence, which the record we do have belies, and which precedent requires for the issuance of an injunction. The speech in question had ended years before the trial court acted.\n\nThe trial court's injunction is facially unconstitutional because it would use prior restraint to suppress speech which is protected by the free speech guarantees of the federal and state Constitutions. The proper appellate remedy in these circumstances has long been established under California case law. We should simply vacate the unconstitutionally overbroad injunction in issue here.\n\nThe majority implicitly concedes that imposition of prior restraint on the speech at issue here is unprecedented. (P. 23.) No appellate court in the United States has heretofore upheld a court's injunctive order imposing prior restraint on free speech merely because the speech occurs in a place of employment. \"Indeed, the Supreme Court has never upheld a prior restraint, even faced with the competing interest of national security or the Sixth Amendment right to a fair trial.\" ( Procter \u0026 Gamble, supra, 78 F.3d at p. 227.) The majority's view, expressed in dicta, that speech which is allegedly \"'derogatory'\" to certain racial groups is always enjoinable in an employment setting simply because that speech produces a particular \"'secondary effect'\" of causing hurt feelings in some listeners (p. 1), is also contrary to the plain terms of the free speech guarantees in both the United States and California Constitutions. This court (Division Five) has previously observed in considering an ordinance restricting sales of adult publications that \"direct listener reaction to speech . . . is . . . content based,\" and that \"'Listeners' reactions to speech are not the type of \"secondary effects\"'\" the federal Supreme Court has proscribed. ( Sebago, Inc. v. City of Alameda (1989) 211 Cal. App. 3d 1372, 1383-1385, 259 Cal. Rptr. 918 (Sebago).)\n\nThe majority has undertaken a radical restructuring of existing First Amendment and California free speech jurisprudence. Its dicta are only supported by the proposal and view of a commentator on allegedly \"racist speech,\" who contends that all allegedly derogatory and demeaning speech in a place of employment is the equivalent of fighting words, \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e because it represents a social evil and causes a secondary effect, outside First Amendment protection, which courts should suppress by orders of prior restraint. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e The majority expresses such unprecedented dicta, as that commentator suggests (while disclaiming any reliance thereon (maj. opn., ante, at p. 942, fn. 6)), by \"stretching\" classic and limited definitions of \"fighting words\" and the distinction between speech content and conduct to include all allegedly derogatory or demeaning speech in the place of employment.\n\nThe United States and California Constitutions guarantee uncensored speech to our citizens, subject only to the speaker's responsibility for the abuse of that right after the fact. We, as an intermediate appellate court, are not empowered to so radically suggest alteration of existing constitutional free speech guarantees, or overturning governing precedents of the United States Supreme Court or the California Supreme Court. This case may raise important questions ultimately meriting review by those courts, but we are bound to follow existing precedents, rather than implement innovative schemes posited in law review articles. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nI would find, for the reasons which follow, that: (1) The trial court's injunction violated the First Amendment to the federal Constitution and article I, section 2, subdivision (a) of the California Constitution; (2) the majority's dicta supporting the suppression of free speech are unnecessary and wrong; and (3) no remand may be made of this cause to the trial court for reconsideration of its illegal injunction of prior restraint. In whatever way the injunction is recrafted, the record is clear (and respondents do not contrarily contend) that none of Lawrence's speech constituted fighting words. Hence, all this speech, however impolite, is entitled to constitutional protection against an order of prior restraint, even though such speech, after utterance, may subject Lawrence to damages, as this case demonstrates. The trial court on remand may not, years after trial, convert nonfighting words entitled to constitutional protection into fighting words lacking that protection, and thereby justify now a new injunctive order of prior restraint on free speech.\n\nII. The First Amendment Prevents the Prior Restraint on Speech Which Is Imposed by the Majority\n\nA. The Majority's Stretching of the Fighting Words and Content/Conduct Distinction in First Amendment Jurisprudence Is Without Precedent\n\nThe First Amendment of the federal Constitution provides: \"Congress shall make no law . . . abridging the freedom of speech . . . .\" The First Amendment is applicable to the states through the Fourteenth Amendment, and forbids prior restraints on speech. (See Hague v. C. I. O. (1939) 307 U.S. 496, 512, 83 L. Ed. 1423, 59 S. Ct. 954.)\n\nThis case raises an important constitutional issue under the First Amendment that has frequently simmered in academic circles but has never been discussed in depth in the appellate courts of the United States or California, although the question is sometimes commented upon. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nThe question is this: Is speech which does not have a direct tendency to lead to imminent violence, i.e., speech which does not constitute \"fighting words,\" deprived of all constitutional free speech protection against prior restraint, simply because it allegedly becomes proscribable conduct (and, therefore, enjoinable) as a result of (1) being uttered in a place of employment and (2) conveying a demeaning, derogatory, or allegedly racist message? The answer is no.\n\nIt is first clear that Lawrence's speech may not be suppressed as \"fighting words.\" Respondents made no such contention in their briefs or at the injunction hearing before the trial court. They essentially conceded at oral argument that the fighting words doctrine is not at issue here.\n\nThe majority concedes its decision is not based on the fighting words doctrine, which \"is not the basis of [its] judgment\" (p. 19, fn. 11), and states \"We need not and do not decide whether this is a fighting words case\" (p. 10). The majority recognizes that the fighting words exception to First Amendment protection only exists when an \"actual danger\" of breach of the peace is produced by their utterance (p. 8, italics in original), and that such breach of the peace which must be evoked as a predicate condition of determining if speech constitutes fighting words is an \"'immediate'\" one, not one which speculatively might occur in the future (id. at p. 7; Chaplinsky, supra, 315 U.S. at p. 572; R. A. V., supra, 505 U.S. at p. 408 (conc. opn. of White, J. [\"imminent violence\"]; accord, Hess v. Indiana (1973) 414 U.S. 105, 108-109, 38 L. Ed. 2d 303, 94 S. Ct. 326). The trial court, in imposing the initial injunction here, observed that Lawrence's speech had not led to any violence. The trial court rationalized its injunctive order solely on the erroneous ground that Lawrence's future speech could automatically be enjoined because it was subject by statute to punishment by imposition of damages after its utterance--a rationalization endorsed by respondents who labeled the injunctive order \"an authorized statutory remedy.\" (Italics added.) In view of the unanimous and compelling federal and state precedent that content of speech may not be suppressed, the majority has instead labeled Lawrence's speech as \"conduct,\" the secondary effects of which can be regulated in a \"workplace\" by the trial court's prior restraint injunction. (P. 13.)\n\nThe majority's analysis flies in the face of the federal Supreme Court's squarely contrary holding in R. A. V., supra, 505 U.S. at page 394, which rejected the claim that the act of burning crosses near people's homes could be banned because such burnings were conduct which would have the \"secondary effect\" of causing emotional upset to local residents: \"St. Paul argues that the ordinance comes within another of the specific exceptions we mentioned, the one that allows content discrimination aimed only at the 'secondary effects' of the speech, see Renton v. Playtime Theatres, Inc., 475 U.S. 41, 89 L. Ed. 2d 29, 106 S. Ct. 925 (1986). According to St. Paul, the ordinance is intended, 'not to impact on [sic] the right of free expression of the accused,' but rather to 'protect against the victimization of a person or persons who are particularly vulnerable because of their membership in a group that historically has been discriminated against.' [Citation.] Even assuming that an ordinance that completely proscribes, rather than merely regulates, a specified category of speech can ever be considered to be directed only to the secondary effects of such speech, it is clear that the St. Paul ordinance is not directed to secondary effects within the meaning of Renton. As we said in Boos v. Barry, 485 U.S. 312, 99 L. Ed. 2d 333, 108 S. Ct. 1157 (1988), 'Listeners' reactions to speech are not the type of \"secondary effects\" we referred to in Renton.' 485 U.S. at 321. 'The emotive impact of speech on its audience is not a \"secondary effect.\"' [Citations.]\" (Italics added.)\n\nAs the high court unanimously ruled in Hurley v. Irish-American Gay Group (1995) 515 U.S. [132 L. Ed. 2d 487, 504, 115 S. Ct. 2338, 2347-2348] (Hurley), the point of the First Amendment \"is simply the point of all speech protection, which is to shield just those choices of content that in someone's eyes are misguided, or even hurtful.\" Thus, the R. A. V. and Hurley decisions have held free speech guarantees protect speakers against the sort of censorship which would be imposed by the injunction the majority suggests the trial court enter on remand.\n\nHow then does the majority purport to find support for that proposed injunction? It does so by making two errors. First, it cites other cases which preceded R. A. V. and did not deal with prior restraint of free speech. Second, the majority misconstrues language from R. A. V. itself which dealt with the subject of \"fighting words\"--the very issue the majority claims it need not address here, since this case concededly does not concern fighting words.\n\nB. The Majority Opinion's Two Principal Errors\n\n1. Cases Cited for Propositions They Do Not Address\n\nThe first glaring error in the majority's analysis is its citation of several cases allegedly in support of an underlying premise that \"Frequent or pervasive workplace use of racial slurs resulting in an abusive work environment has been held to constitute . . . . conduct . . . enjoined under Title VII.\" \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e (P. 9, italics in original.) The majority proceeds from this premise to the Conclusion that such cases deprive nonfighting words of constitutional protection against prior restraint. No appellate decision cited by the majority, however, stands for the premise that free speech rights may be limited by injunctive order, or that the constitutional right to utter speech, free of prior restraint, is subordinate to the employment discrimination provisions of either Title VII or the FEHA. None of these cases even deals with the constitutional issue of prior restraint of speech.\n\nIn Daniels v. Essex Group, Inc. (7th Cir. 1991) 937 F.2d 1264, 1273-1274 (Daniels), no injunction was entered at all; therefore, the court could not have ordered anything \"enjoined\" and no First Amendment issues could have been raised concerning the propriety of any injunctions. In E.E.O.C. v. Beverage Canners, Inc. (11th Cir. 1990) 897 F.2d 1067, 1070, the court simply upheld factual findings that a company was responsible for the acts of its employees in subjecting minorities to racially discriminatory fighting words, and there was no Discussion of the First Amendment. In E.E.O.C. v. Goodyear Aerospace Corp. (9th Cir. 1987) 813 F.2d 1539, 1544, there was likewise no First Amendment issue, and the court simply enjoined the employer to grant an employee a promotion she had already received--an order which may have been futile, but which certainly did not burden any future free speech rights. In E.E.O.C. v. Hacienda Hotel (9th Cir. 1989) 881 F.2d 1504, 1518-1519 (Hacienda Hotel), there was also no First Amendment issue raised. In Snell v. Suffolk County (E.D.N.Y. 1985) 611 F. Supp. 521, 531 (Snell), the district court forbade the use of certain specified fighting words in a prison, while noting, \"Here no one has raised the [First Amendment] issue and it would be inappropriate for the court to address it on its own motion.\" (Italics added.) In Peralta Community College Dist. v. Fair Employment \u0026 Housing Com. (1990) 52 Cal. 3d 40, 53, 276 Cal. Rptr. 114, 801 P.2d 357, there was no injunction against speech and no First Amendment Discussion; the high court simply noted that conduct, which in that case included unwanted touching of the breasts and thighs and other indecencies, could be enjoined. No First Amendment issue was raised in the case. The only authority which the majority cites, with a \"cf.\" preceding it, which might arguably support an injunction against speech is an apparent dictum in a decision by a federal district Judge, Robinson v. Jacksonville Shipyards, Inc. (M.D.Fla. 1991) 760 F. Supp. 1486, 1534-1535 (Robinson). That case is inconsistent with the majority's rationale and has been unanimously criticized by legal scholars. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e None of the majority's cited cases actually held that an injunction against future speech such as the one in issue here is constitutionally permissible under the First Amendment, and none addressed the issue under the controlling federal Supreme Court authority of R. A. V., supra, which had not been decided in the Supreme Court when the majority's cases were handed down.\n\n2. The R. A. V. Case Cited for a Proposition It Rejects\n\nThe second error of the majority is found in its curious and erroneous effort to find support for its dicta in R. A. V. itself, based on select quotations which turn that decision on its head. The majority says: \"The key issue is whether employment discrimination law as applied to racist speech in the workplace is changed by R. A. V. . . .\" (p. 10, italics added), and erroneously concludes it has.\n\nThe holding of R. A. V. invalidated as facially unconstitutional a St. Paul ordinance prohibiting display of a symbol which the displayer knows or has reason to know \"'arouses anger, alarm or resentment in others on the basis of race, color, creed, religion or gender . . . .'\" (505 U.S. at p. 380.) The Supreme Court of Minnesota, reversing its trial court, had construed the reach of the ordinance to conduct that amounts to \"'fighting words'--conduct that itself inflicts injury or tends to incite immediate violence . . . .\" ( Matter of Welfare of R.A.V. (Minn. 1991) 464 N.W.2d 507, 510); and reinstated the charge of violating the ordinance against a juvenile for burning a cross on a Black family's lawn ( id. at p. 511).\n\nThe U.S. Supreme Court majority invalidated the ordinance, as thus construed by the Minnesota Supreme Court (which construction the U.S. Supreme Court accepted), because it imposed special prohibitions on speakers expressing views on disfavored subjects of race, color, creed, religion or gender while permitting displays of abusive invective not addressed to those subjects. ( R. A. V., supra, 505 U.S. at pp. 393-396.) R. A. V. involved no issue of prior restraint of speech in the workplace or elsewhere, but is nonetheless the principal rationale of the majority dicta through its erroneous analysis of another dictum.\n\nJustice Scalia, in his review of First Amendment principles in R. A. V., recognized that all speech produces some secondary effect; and that \"'Listeners' reactions to speech are not the type of \"secondary effects\" we referred to in Renton.' [Citation.] 'The emotive impact of speech on its audience is not a \"secondary effect.\"'\" (505 U.S. at p. 394.) The high court also reviewed the authorities which have \"permitted restrictions upon the content of speech in a few limited areas, . . . [i.e.,] traditional limitations,\" because the social value of such speech as a step to truth is clearly outweighed by the social interest in order and morality, citing Chaplinsky, (supra) (see fn. 4, ante), but cautioning that \"a limited categorical approach has remained an important part of our First Amendment jurisprudence.\" ( R. A. V., supra, 505 U.S. at pp. 382-383, italics added.)\n\nAs an example of the limited types of speech which the Supreme Court has thus categorically regulated, but with no Discussion of prior restraint of speech, Justice Scalia cited \"'fighting words'\" as defined by Chaplinsky, and discussed their \"'secondary effects'\" which deprive such fighting words of First Amendment protection, i.e., because they convey an overriding message of personal injury and imminent violence. ( R. A. V., supra, 505 U.S. at pp. 383-384, 388-389; see fn. 25, post.) In illustrating this principle, Justice Scalia said: \"Thus, for example, sexually derogatory 'fighting words,' among other words, may produce a violation of Title VII's general prohibition against sexual discrimination in employment practices [citation].\" ( R. A. V., supra, 505 U.S. at p. 389, italics added.)\n\nThe majority's purported reliance on R. A. V. to support its dicta is based on those emphasized words: \"By including the phrase 'among other words,' R. A. V. expanded its statement on the secondary effects rule beyond categories of proscribable speech to encompass any speech that creates an abusive work environment violating the law of employment discrimination.\" (Maj. opn., ante, at p. 947, italics in original.) This is patently incorrect.\n\nThis R. A. V. majority's dictum above quoted simply states a truism, that \"other words,\" i.e., words which are not \"'fighting words,'\" may produce a violation of the prohibition of Title VII against sexual discrimination in employment. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e I reemphasize that we do not deal in this case with liability for damages, but with suppression by prior restraint of free speech. Neither this dictum nor any of the R. A. V. opinions deals with issues of prior restraint of speech or in any way validate the majority's dicta. R. A. V. is a fighting words case that does not change or purport to extend the Supreme Court's traditional limitations on constitutional free speech protections. Nor does R. A. V. allow prior restraint of workplace speech which does not constitute fighting words. In fact, it held the opposite: Regardless of the site of the speech, the government may not regulate speech which does not constitute \"fighting words.\" (See Sebago, supra, 211 Cal. App. 3d at pp. 1382-1385; see also Thornhill v. Alabama (1940) 310 U.S. 88, 94-96, 104-105, 84 L. Ed. 1093, 60 S. Ct. 736 [The imposition of prior restraint on speech at a place of employment was constitutionally overbroad, even though the prior restraint was aimed at suppressing secondary effects such as industrial strife.]; Forsyth County v. Nationalist Movement (1992) 505 U.S. 123, 134, 120 L. Ed. 2d 101, 112 S. Ct. 2395 [The court overturned a prior restraint on racist speech, even though the restraint was \"aimed only at a secondary effect--the cost of maintaining public order.\"].)\n\nThe majority, thus, reaches its result by a fallacious route. First, the majority reasons that under the federal Constitution fighting words, including sexually or racially derogatory fighting words, may be suppressed. The majority also reasons that fighting words have the secondary effect of causing upset to some listeners. Therefore, the majority reasons inexplicably that any nonfighting words may be suppressed if they have a \"secondary effect\" of arousing reactions in the listeners which arguably create a discriminatory work environment.\n\nThe fallacy of this illogic is obvious. It accomplishes exactly what Professor Matsuda recommends, although she, unlike the majority, understood that her recommendation \"ultimately weakens\" First Amendment protection. (Matsuda, Racist Speech, supra, 87 Mich.L.Rev. at p. 2357; see fn. 5, ante.)\n\nThe majority dicta would \"stretch\" traditional limitations on First Amendment protection for fighting words to eliminate the same protection against prior restraint of nonfighting words. It further adopts Matsuda's recommended \"stretch\" of the \"'content/conduct'\" rationale of First Amendment jurisprudence by converting nonfighting words speech in a place of employment to conduct deprived of First Amendment protection and suppressible by a prior restraint order. (Matsuda, Racist Speech, supra, 87 Mich.L.Rev. at p. 2357; see fn. 5, ante.)\n\nThis view is founded in part on the error of the trial court (see section IV, post) which the majority perpetuates: that speech in a place of employment for which damages may be later imposed under statute is automatically enjoinable for that reason by an order of prior restraint.\n\nThis is a \"stretch\" too far.\n\nPunishment for and suppression of speech are two very different things. ( Kunz, supra, 340 U.S. at pp. 294-295.) Prior restraints on speech have been rejected routinely by courts of California and the U.S. Supreme Court as disfavored, offensive, and constitutionally proscribed. ( Pines v. Tomson (1984) 160 Cal. App. 3d 370, 395-398, 206 Cal. Rptr. 866 (Pines); Near v. Minnesota (1931) 283 U.S. 697, 713, 75 L. Ed. 1357, 51 S. Ct. 625; Collin v. Smith (N.D.Ill. 1978) 447 F. Supp. 676, 699, affd. (7th Cir. 1978) 578 F.2d 1197, cert. den. 439 U.S. 916, 58 L. Ed. 2d 264, 99 S. Ct. 291 (Collin).)\n\nThe R. A. V. majority's Discussion with approval of \"traditional limitations\" in a \"few limited areas\" on the protection of free speech (505 U.S. at p. 383), which preceded the \"other words\" dictum (160 Cal. App. 3d at p. 389) on which the majority here leans, demonstrates only that those traditional limitations remain in force. The R. A. V. majority certainly displayed no intention of departing from such \"few limited areas\" and depriving nonfighting words sub silentio of First Amendment protection against suppression of speech by prior restraint.\n\nFederal and state courts considering R. A. V. and its application to the workplace do not accord with the majority's Conclusion that Title VII (and by logical extension, the FEHA) overrules First Amendment rights in the workplace.\n\nAs Circuit Judge Edith H. Jones forthrightly put it, while striking down a somewhat similar order aimed at workplace speech which had been viewed as hostile to women and therefore as constituting harassment under Title VII: \"Where pure expression is involved, Title VII steers into the territory of the First Amendment. It is no use to deny or minimize this problem because, when Title VII is applied to sexual harassment claims founded solely on verbal insults, pictorial or literary matter, the statute imposes content-based, viewpoint-discriminatory restrictions on speech. [Citations.]\" ( DeAngelis v. El Paso Mun. Police Officers Ass'n (5th Cir. 1995) 51 F.3d 591, 596-597, fn. omitted, cert. den. U.S. [133 L. Ed. 2d 403, 116 S. Ct. 473] (DeAngelis).)\n\nEven more significantly, the Fifth Circuit in DeAngelis specifically rejected the rationale which the majority urges in the present case for suppressing free speech, when it has secondary effects in the working environment: \"The [federal Supreme] Court's pronouncement in R.A.V., that 'sexually derogatory \"fighting words,\" among other words, may produce a violation of Title VII's general prohibition against sexual discrimination in employment practices' does not mean that Title VII trumps First Amendment speech rights.\" (51 F.3d at p. 597, fn. 7, italics added.)\n\nFurther, as the Central District of California recently ruled, in striking down a similar workplace restriction on free speech rights which had been imposed in order to free the working environment of discriminatory \"'sex-role stereotyping'\": \"The defendants' effort to regulate the behavior of male fire fighters by regulating the material which they may read is categorically impermissible. It is a fundamental principle of First Amendment law that the government cannot regulate material in order to prevent the readers from developing certain ideas. See, e.g., American Booksellers Ass'n, [ Inc. v. Hudnut (7th Cir. 1985), 771 F.2d 323, affd., 475 U.S. 1001, 89 L. Ed. 2d 291, 106 S. Ct. 1172]. Such regulations are attempts at altering the reader's viewpoint, and as such are the most disfavored of all regulations touching upon the First Amendment. See R.A.V. [supra, 505 U.S. 377, 120 L. Ed. 2d 305, 112 S. Ct. 2538].\" ( Johnson v. County of Los Angeles Fire Dept. (C.D.Cal. 1994) 865 F. Supp. 1430, 1441.) \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThe majority also cannot justify restraining free speech merely because it wishes to combat discrimination against protected classes. \"While the law is free to promote all sorts of conduct in place of harmful behavior, it is not free to interfere with speech for no better reason than promoting an approved message or discouraging a disfavored one, however enlightened either purpose may strike the government.\" ( Hurley, supra, 132 L. Ed. 2d at p. 507, 115 S. Ct. at p. 2350.)\n\nC. The Injunction Is Facially Unconstitutional\n\nThe injunction the trial court has fashioned is invalid on the independent ground that it, like the St. Paul ordinance in R. A. V., is facially unconstitutional.\n\nR. A. V. held that the St. Paul ordinance was facially unconstitutional because it applied to displays amounting only to fighting words that insult or provoke violence on the basis of race, color, creed, religion, or gender, while displays amounting to fighting words containing other abusive invective, no matter how vicious or severe, are permissible unless addressed to one of those topics. (505 U.S. at p. 391.)\n\nHere the injunction suffers from the same facial unconstitutional deficiencies. It is aimed at suppressing a category of speech that insults respondents or affects their workplace on the basis of race--which the majority describes as \"racist epithets\" (p. 11)--that would not necessarily constitute fighting words and did not constitute them here.\n\nAs Justice White stated in Concurring in the R. A. V. judgment: \"Although the ordinance as construed [by the Minnesota Supreme Court] reaches categories of speech that are constitutionally unprotected, it also criminalizes a substantial amount of expression that--however repugnant--is shielded by the First Amendment.\" (505 U.S. at pp. 413-414.)\n\nAssuming, arguendo, that the trial court's injunction could be construed only to apply, as it constitutionally must, to fighting words which are also \"racist epithets,\" it would nonetheless be facially unconstitutional under both majority and minority opinions of R. A. V.\n\n\"The First Amendment does not permit [the court] to impose special prohibitions on those speakers who express views on disfavored subjects.\" ( R. A. V., supra, 505 U.S. at p. 391.)\n\nD. The Implications of the Majority Opinion's Censorship of Speech\n\nThe implications of the majority dicta are staggering. If the majority is correct, the millions of Californians who are daily employed in a \"workplace\" can be exposed to imprisonment for contempt if they violate a court order restraining them from uttering any speech that conveys to the recipient listener no overriding message of personal injury and imminent violence ( Chaplinsky, supra, 315 U.S. at p. 572), simply because their speech might produce an adverse \"emotive impact\" ( Boos v. Barry (1988) 485 U.S. 312, 321, 99 L. Ed. 2d 333, 108 S. Ct. 1157). First Amendment protection against prior restraint of speech which does not constitute fighting words is eliminated. The majority reaches that result by this means. It transforms and expands Justice Scalia's dictum, that Title VII may be violated by (other nonfighting) words which sexually harass, into a very different holding that nonfighting words which harass in a place of work may be controlled by an order of prior restraint. It then suggests that nonfighting words may be enjoined by an order of prior restraint, in a place of employment, in purported reliance on inapposite precedent.\n\nNeither of these positions withstands analysis, and the majority opinion candidly states the obvious policy it thereby pursues and reaches. As an intermediate appellate state court, it is indicating for the first time, albeit in dicta, that speech in a place of employment, offering no overriding threat or message of personal injury and imminent violence, is not entitled to First Amendment protection against suppression by a government order imposing prior restraint; and that this is so because the qualitatively different content of that speech converts it to conduct subject to prior restraint regulation under the narrow secondary effects doctrine of the United States Supreme Court's First Amendment jurisprudence. The Supreme Court has never so ruled. It is clear, moreover, under governing federal precedents that \"The government must abstain from regulating speech when the specific motivating ideology or the opinion or perspective of the speaker is the rationale for the restriction.\" ( Rosenberger v. Univ. of Virginia (1995) 515 U.S. [132 L. Ed. 2d 700, 715; 115 S. Ct. 2510, 2516.].)\n\nThe irony of the majority's dilemma is patent. It attempts to transform R. A. V., which gave First Amendment protection to racists expressing a morally offensive ideology by burning a cross on a Black family's lawn (conduct much more odious and offensive than the rude comments here at issue), into a holding that much milder, nonfighting words in a place of employment are entitled to no such protection.\n\nThe law review article by Professor Matsuda (see fn. 5, ante) appears to be the true source of the majority's analysis despite its contrary disclaimer (maj. opn., ante at p. 37, fn. 6). \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e The majority has further relied upon authorities citing this article. Daniels, supra, 937 F.2d at page 1273 is cited by the majority for the proposition that racially degrading speech is \"actionable\" (p. 9) even though there was no injunction entered in that case, so the First Amendment issues were not addressed, and the case does not stand for any relevant proposition. The Daniels case cites Matsuda's article in a footnote, but the court did not purport to enact her proposal for legal reform.\n\nLikewise, a law review article which consists of a speech given by Justice Stevens \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e (Stevens, The Freedom of Speech (1993) 102 Yale L.J. 1293, 1311-1312 (Stevens, Freedom of Speech)) also cites Matsuda's proposal for legal reform, and the majority cites the latter article as well (p. 8). Justice Stevens, however, did not indicate Matsuda's proposal embodies existing law or that it should be adopted. Rather, his ruminations only indicated that while we should be willing to consider the viewpoint of persons who hear \"intolerant\" speech they find offensive, such speech--as opposed to threatening conduct--should clearly remain protected by the First Amendment. (Stevens, Freedom of Speech, supra, at. p. 1313.)\n\nMany legal scholars have strongly disagreed with, and in some cases disparaged, Matsuda's far-reaching proposal for racially based suppression of free speech rights. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nThat proposal has never been adopted by any court before the majority opinion erroneously does so; and its statements in dicta, adopting Matsuda's theory of stretching classic First Amendment treatment of the fighting words and content/conduct doctrines, is wholly contrary to the main tradition of First Amendment authorities and scholarship. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nQuite recently, in Hurley, the United States Supreme Court reaffirmed, by a unanimous vote, the primacy of First Amendment rights when it overturned a state court injunction which burdened free speech by mandating that a parade include a certain group which sought inclusion under a state anti-discrimination law. \"We hold that such a mandate violates the First Amendment.\" ( Id., 132 L. Ed. 2d at p. 495, 115 S. Ct. at p. 2341.) Although a restriction on free speech might ostensibly serve a worthy governmental purpose (as Matsuda suggests), that is insufficient to support the restriction: \"While the law is free to promote all sorts of conduct in place of harmful behavior, it is not free to interfere with speech for no better reason than promoting an approved message or discouraging a disfavored one, however enlightened either purpose may strike the government.\" ( Id., 132 L. Ed. 2d at p. 507, 115 S. Ct. at p. 2350.)\n\nIII. California's Constitution Is Violated by the Trial Court's Injunction\n\nThe California free speech guarantee is even broader than the federal one. Article I, section 2, subdivision (a) of the California Constitution provides: \"Every person may freely speak, write and publish his or her sentiments on all subjects, being responsible for the abuse of this right. A law may not restrain or abridge liberty of speech or press.\" (Italics added.)\n\nThe trial court's order restraining free speech is inconsistent with the plain meaning of this free speech guarantee, and is inconsistent with the prior precedents of our state Supreme Court interpreting this guarantee. \"The wording of this section is terse and vigorous, and its meaning so plain that construction is not needed. The right of the citizen to freely speak, write, and publish his sentiments is unlimited, but he is responsible at the hands of the law for an abuse of that right. He shall have no censor over him to whom he must apply for permission to speak, write, or publish, but he shall be held accountable to the law for what he speaks, what he writes, and what he publishes.\" ( Dailey v. Superior Court (1896) 112 Cal. 94, 97, 44 P. 458 (Dailey), italics added.) Thus, the state free speech guarantee prevents a court from enjoining speech producing emotive impacts in others prior to utterance, although it does not preclude damage suits therefor, as this case where three damage verdicts were returned clearly illustrates. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nAs interpreted by our own high court and the federal Supreme Court, this state guarantee is even stronger and more definitive as a bar against prior restraints on speech than the federal guarantee. ( Robins v. Pruneyard Shopping Center (1979) 23 Cal. 3d 899, 908-910, 153 Cal. Rptr. 854, 592 P.2d 341, affd. (1980) 447 U.S. 74, 64 L. Ed. 2d 741, 100 S. Ct. 2035; accord, Wilson v. Superior Court (1975) 13 Cal. 3d 652, 658, 119 Cal. Rptr. 468, 532 P.2d 116 [\"A protective provision more definitive and inclusive than the First Amendment is contained in our state constitutional guarantee of the right of free speech and press.\"].) The state constitutional right of free speech does not allow the prior restraint on speech which is being applied here. (See Pines, supra, 160 Cal. App. 3d at pp. 395-398 [An injunction forbidding expression of sentiments, deemed discriminatory against non-Christians, was held invalid under the California Constitution.].) \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nNo California appellate court has ever held, in light of the express wording of the free speech guarantee of our state Constitution, that persons can be subjected to prior restraint on speech, and legally forbidden to speak on pain of fine or being sent to jail, for merely making rude or even immoral comments which might have bad effects on the listener. All existing authority under the California Constitution is to the contrary: \"No one's mouth may be closed in advance, as sought herein, for the purpose of preventing an utterance of his sentiments, however mischievous the prospective results of such utterance.\" ( People v. American Automobile Ins. Co. (1955) 132 Cal. App. 2d 317, 326, 282 P.2d 559.) The trial court, however, created, and the majority suggests it may recreate, an injunction which would send a person to jail for exercising the free speech rights guaranteed against exactly this sort of prior restraint by the California Constitution. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nMore recently, Division Three of this district recognized that a trial court order could not be issued which would constitute a prior restraint on rude personal comments, even though the speech in question was allegedly offensive to adult listeners and indirectly harmful to children. ( In re Marriage of Candiotti (1995) 34 Cal. App. 4th 718, 725-726 (Candiotti).) \"Such remarks by Debra may be rude and unkind. They may be motivated by hostility. To the extent they are libelous, they may be actionable. But they are too attenuated from conduct directly affecting the children to support a prior restraint on Debra's constitutional right to utter them.\" ( Id. at p. 726, fn. omitted.)\n\nThe majority does not, and I believe cannot, explain how the even stronger free speech guarantee of the California Constitution--which has no narrow exception for secondary effects as a result of the expression of \"sentiments,\" odious as they may be to the majority and myself--can allow such prior restraint. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e We know from Pines, supra, that no such exception for secondary effects from discrimination exists under California constitutional law. (160 Cal. App. 3d at pp. 395-398.) The present case is governed by the California Constitution, as well as the federal Constitution; and if either Constitution forbids entry of the injunction here, it must be vacated. California's Constitution does so.\n\nIV. Our Independent Review of the Record in Cases Implicating Free Speech Must Establish That the Injunction: (1) Is Narrowly Tailored to Preserve Free Speech Rights, and (2) Is Justified by Compelling Necessity; the Injunction at Issue Fails Both Tests\n\nA. Our Duty of Independent Review\n\nWhere free speech rights are at stake, we must independently review the trial court's findings and the record in order to ensure that any injunction is narrowly tailored and justified by compelling necessity. Proof of a violation of the FEHA does not automatically trigger the granting of injunctive relief as respondents urged below and the trial court appears to have believed. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e \"In the review of state [court] decisions where First Amendment rights are drawn into question, we of course make an examination of the evidence to ascertain independently whether the right has been violated.\" ( Feiner v. New York (1951) 340 U.S. 315, 316, 95 L. Ed. 295, 71 S. Ct. 303.) Our \"constitutional duty to conduct an independent examination of the record as a whole, without deference to the trial court\" ( Hurley, supra, 132 L. Ed. 2d at p. 499, 115 S. Ct. at p. 2344) is applicable to appellate review under the California Constitution's free speech provision as well ( Katzev v. County of Los Angeles (1959) 52 Cal. 2d 360, 365-366, 341 P.2d 310).\n\nSuch independent review is required even though the proposed restriction on speech might serve worthy governmental goals, such as the avoidance of hurtful and crude expressions, or the fostering of racial harmony. The relevant principles were lucidly stated by Justice Newsom of this district: \"Thus, although the governmental purpose be legitimate and substantial, such purpose may not be achieved 'by means that broadly stifle fundamental personal liberties when the end can be more narrowly achieved . . . .' [Citations.] . . . Regulations affecting protected First Amendment activities must be justified by something more than 'mere legislative preferences or beliefs respecting matters of public convenience' [citation] and are constitutionally permissible 'only if they are clearly and narrowly drawn to avoid arbitrary and unnecessary curtailment of freedom of speech . . . .' [Citation.] The burden of establishing whether the regulation in question is sufficiently narrowly drawn in serving a compelling state interest is placed upon the government seeking to impose the regulation. [Citations.] Moreover, when First Amendment rights are at issue, a reviewing court must make an independent examination of the whole record in order to determine whether that burden has been satisfactorily met.\" ( Sussli v. City of San Mateo (1981) 120 Cal. App. 3d 1, 9, 173 Cal. Rptr. 781, italics added (Sussli).) Here an injunctive order of prior restraint on the exercise of free speech was entered on a record of the injunctive hearing which is clearly insufficient to support the burden Sussli and its antecedents require.\n\nUnder the federal constitution, \"we are obliged to make a fresh examination of crucial facts.\" ( Hurley, supra, 132 L. Ed. 2d at p. 500, 115 S. Ct. at p. 2344.) In performing this independent constitutional duty to apply a heavy burden to those attempting to restrain speech, we must determine by independent examination of the trial court's findings \"whether that burden has been satisfactorily met.\" ( Sussli, supra, 120 Cal. App. 3d at p. 9.) This is required because respondents, not appellants, have the burden to justify an injunction constituting a prior restraint on free speech, even one which was content-neutral (unlike the present injunction), by showing that it was narrowly tailored to protect free speech rights. ( Madsen v. Women's Health Center (1994) 512 U.S. [129 L. Ed. 2d 593, 608; 114 S. Ct. 2516, 2524-2525] (Madsen).) Appellants are entitled to contend (as they do) and we to decide whether the trial court's injunction language, or that implicitly suggested by the majority's remand, is constitutionally permissible. This implicates, inter alia, issues of overbreadth, enforceability, vagueness, and imposition of prior restraint on speech.\n\nB. Respondents Have Not Carried Their Burden to Prove the Need for Injunctive Relief Suppressing Free Speech\n\nThe full record of the injunction hearing shows no trial court findings which would support the issuance of the injunction. The trial court never found that the words it was seeking to enjoin were \"fighting words\" which might constitutionally be subject to suppression, and respondents and the majority do not contend otherwise. The trial court never found any ongoing conduct necessitating an injunctive order, or that Lawrence's speech years before the injunctive hearing established the \"basic requisites of the issuance of equitable relief in these circumstances--the likelihood of substantial and immediate irreparable injury and the inadequacy of remedies at law,\" i.e., in damages. ( O'Shea v. Littleton (1974) 414 U.S. 488, 502, 38 L. Ed. 2d 674, 94 S. Ct. 669.) \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Rather, the trial court simply believed it automatically had the power to issue an injunction restraining free speech, merely because damages had been awarded to three of the seventeen plaintiffs for emotional distress; that the time for considering the First Amendment issue its injunction raised would have to wait the day when Lawrence was tried by a jury for \"indirect contempt\" for violating it; \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e and that the injunction was authorized to prevent \"repetitive\" or a \"multiplicity of\" torts. All of these premises are so patently erroneous that the majority makes no effort to defend or adopt them. The law is obviously to the contrary. (See Los Angeles v. Lyons (1983) 461 U.S. 95, 107, fn. 8, 75 L. Ed. 2d 675, 103 S. Ct. 1660 [An injunction barring possible future discrimination is improper: \"The emotional consequences of a prior act simply are not a sufficient basis for an injunction absent a real and immediate threat of future injury by the defendant.\"]; Harrisonville v. Dickey Clay Co. (1933) 289 U.S. 334, 337-338, 77 L. Ed. 1208, 53 S. Ct. 602 [\"An injunction is not a remedy which issues as of course.\"]; Kunz, supra, 340 U.S. at pp. 294-295 [Past disorder in religious meetings does not support a present order enjoining them: \"The court below [as did the trial court here] has mistakenly derived support for its Conclusion from the evidence produced at the trial that appellant's religious meetings had, in the past, caused some disorder. . . . We are here concerned with suppression--not punishment.\"].)\n\nThe majority first presumes the \"factual underpinnings\" of the \"injunctive portions\" of the trial court's judgment are \"conclusively\" established from the lack of a trial record and respondents' appellate argument. (Maj. opn., ante, at p. 36.) Thus, it reasons, we must further conclusively presume in support of the injunction that Lawrence delivered a \"steady barrage of opprobrious racial comment\" to three or four respondents, citing language which the court used in Johnson v. Bunny Bread Co. (8th Cir. 1981) 646 F.2d 1250, 1257 to describe Title VII violations meriting after-the-fact punishment. Harris v. Forklift Systems, Inc. (1993) 510 U.S. 17 [126 L. Ed. 2d 295, 301, 114 S. Ct. 367, 370] (Harris), cited by the majority in this connection, was not posited on, did not discuss, and is inapposite to the issue we face--First Amendment protection of nonfighting words speech from prior restraint. The Harris citation is consistent with the majority's repeated failure to clearly observe the distinction between those cases, including Harris, which deal with punishment or award of damages for speech after it is uttered and those authorities which proscribe restraint of that speech before it is uttered.\n\nHaving thus rationalized the existence of nonevidentiary \"underpinnings\" allegedly supporting the trial court's injunction, the majority then reverses the very injunction it said was supported by those presumed \"underpinnings.\" In sum, the record and \"underpinnings\" before us will simply never support suppression of free speech by injunction, because the speech in question was protected by the First Amendment.\n\nRespondents and the majority have not carried their burden of demonstrating that either the trial court's injunction, which the majority has discarded, or any other injunction framed in accord with the majority's dicta is narrowly drawn to serve a compelling state interest. The injunction is not narrowly tailored to target only the limited types of speech which can constitutionally be restrained. No injunction is justified here by a compelling necessity, in light of the fact that (1) there has been no finding of any illegal or objectionable speech for years; (2) there are other remedies at law available for verbal harassment; (3) and there has been no finding of any ongoing harassment of anyone. Even assuming, arguendo, that there could ever be a compelling state interest allowing the prior restraint of rude words or racially derogatory insults, it ended years previously and the injunction is improper. (See Madsen, supra, 129 L. Ed. 2d at p. 608, 114 S. Ct. at pp. 2524-2525.) \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nIn light of the protected constitutional status given to free speech rights as against prior restraints, the trial court certainly had no broader injunctive power in restraining speech here than it has under Code of Civil Procedure section 526 generally, proscribing the issuance of an injunction when there is no present demonstrated need for one. An applicant for a normal injunction, restraining for instance a trespass across the applicant's land, would be laughed out of court if the record disclosed the most recent trespass had occurred years previously, with no record of any recurrence. (See, e.g., Hannah v. Pogue (1944) 23 Cal. 2d 849, 858, 147 P.2d 572 [An injunction against taking dirt and branches from plaintiff's land was properly dissolved on appeal, where the record showed the takings had occurred on an occasional basis years previously and then ceased: \"There was evidence that on two occasions defendant Pogue took dirt and branches. There was no evidence that he intended to continue doing so.\"]; Gleaves v. Waters (1985) 175 Cal. App. 3d 413, 417, 220 Cal. Rptr. 621 [Injunctive relief against trespass across property in order to spray for infestations of \"Japanese beetle\" was properly denied, where there was no showing of a future danger of illegal conduct.].) Free speech rights are entitled to no less protection.\n\nC. The Injunction at Issue Here Was Not Narrowly Tailored to Preserve the Right of Free Speech\n\nAs this case demonstrates, our society is enlightened enough to provide for the recovery of damages for conduct amounting to racial or sexual discrimination, or harassment. However, the trial court did not grant an injunction only against the use of \"fighting words,\" not based upon hostility or favoritism toward the message Lawrence imparted.\n\nThe trial court and the majority, however, have ignored this concept, and neither has narrowly tailored its respective attempts at suppression so as to forbid only fighting words, without regard to the viewpoint or content expressed by those words. The federal Constitution may arguably allow prior restraint against fighting words, but does not allow a viewpoint-based discrimination which would allow the government to ban, for instance, only those fighting words which criticized the government, or expressed a particular viewpoint. (See R. A. V. supra, 505 U.S. at p. 386.) \"As with the sound truck, however, so also with fighting words: The government may not regulate use based on hostility--or favoritism--toward[] the underlying message expressed.\" (Ibid., italics added.) R. A. V., supra, proscribes a ban on fighting words as a subterfuge to ban only speech which is not politically correct: \"St. Paul has not singled out an especially offensive mode of expression--it has not, for example, selected for prohibition only those fighting words that communicate ideas in a threatening (as opposed to a merely obnoxious) manner. Rather, it has proscribed fighting words of whatever manner that communicate [only] messages of racial, gender, or religious intolerance. Selectivity of this sort creates the possibility that the city is seeking to handicap the expression of particular ideas. That possibility would alone be enough to render the ordinance presumptively invalid . . . .\" (Pp. 393-394.)\n\nIt is certainly not true, as the majority suggests, that racist speech must necessarily be tolerated if no injunction issues. Speech may be subject to sanctions after the fact, as it was here by damages awarded to three respondents, although it may not be suppressed by prior restraint. The law of slander is a good example. The First Amendment bars the suppression of speech by prior restraint, but does not bar the imposition of damages after the fact for slanderous statements causing damage. Likewise, certain conduct such as disturbing the peace by speech might be subject to criminal penalties after the fact, even though not subject to prior restraint.\n\nAlthough the majority admits its dicta supporting imposition of prior restraint on free speech are unprecedented, it nevertheless suggests the California Legislature is responsible therefor because the majority claims the Legislature supposedly desired the speech at issue here to be suppressed by enactment of the FEHA. (Maj. opn., ante, at p. 24.) The majority points to no enactment by the Legislature purporting to repeal or bypass the First Amendment to the Federal Constitution or article I, section 2, subdivision (a) of the California Constitution. The Legislature did not and could not do so. As Justice Mosk has noted, \"Constitutional questions are not determined by a consensus of current public opinion.\" ( Parr v. Municipal Court (1971) 3 Cal. 3d 861, 870, 92 Cal. Rptr. 153, 479 P.2d 353.) \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e The cases are legion in holding that no legislative enactment can violate or supersede any constitutional provisions, including suppression of free speech under the First Amendment or its broader California equivalent. (See, e.g., Sebago, supra, 211 Cal. App. 3d at pp. 1382-1385.)\n\n\"The very idea that a noncommercial speech restriction be used to produce thoughts and statements acceptable to some groups or, indeed, all people, grates on the First Amendment, for it amounts to nothing less than a proposal to limit speech in the service of orthodox expression. The Speech Clause has no more certain antithesis.\" ( Hurley, supra, 132 L. Ed. 2d at p. 507, 115 S. Ct. at p. 2350.) The injunction of the trial court and the majority's dicta clearly fail this legal test as well. (See DeAngelis, supra, 51 F.3d at p. 597, fn. 7.)\n\nV. The Trial Court's Erroneous Injunction Should Simply Be Vacated As Unconstitutional\n\nA. The Overbroad Language of the Trial Court's Injunction and the Majority's Dicta, Imposing Potential Vicarious Liability on an Employer for Not Suppressing an Employee's Speech, Are Both Ineffective as a Remedy and Unconstitutional\n\nNeither the injunction of the trial court nor the dicta of the majority's opinion prevents Lawrence from using only fighting words and, thus, they are unconstitutionally overbroad. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Moreover, the injunction is further unconstitutional in that it makes Avis, a corporation, punishable by contempt merely because one of its employees, Lawrence, does not follow the vague terms of the facially overbroad injunction. The injunction, thus, seeks to make one party vicariously liable for suppressing the free speech rights of another party. This is also an unprecedented departure from First Amendment standards, and this factor alone would require a vacating of the injunction. No appellate court has ever held under the First Amendment that an organization could be found in contempt simply because it was unable to suppress the speech or control the activities of one of its employees or members which were not authorized or ratified. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e The U.S. Supreme Court has repeatedly rejected similar schemes for speech suppression through vicarious liability as unconstitutional. (See NAACP v. Claiborne Hardware Co. (1982) 458 U.S. 886, 930-932, 73 L. Ed. 2d 1215, 102 S. Ct. 3409 [An organization could not be liable for the fiery rhetoric on racial matters of its employee and president, since imposition of such vicarious liability would violate the First Amendment.]; Carroll v. Princess Anne (1968) 393 U.S. 175, 183, 21 L. Ed. 2d 325, 89 S. Ct. 347 [An injunction banning future rallies by an organization whose members had made racist speeches was unconstitutional: \"An order issued in the area of First Amendment rights must be couched in the narrowest terms that will accomplish the pin-pointed objective permitted by constitutional mandate and the essential needs of the public order.\"].)\n\nCertainly one can wholeheartedly agree with the majority's view that offensive comments or rude epithets are socially undesirable and can evoke adverse emotions, without agreeing that the First Amendment allows the prior restraint of such comments when they are used by workers during on-the-job conversations: \"The point of the First Amendment is that majority preferences must be expressed in some fashion other than silencing speech on the basis of its content.\" ( R. A. V., supra, 505 U.S. at p. 392.) Further, offensiveness in language can be a subjectively perceived condition (see Cohen, supra, 403 U.S. at pp. 22-23); and mere offensiveness, however lamentable, and even offensiveness based upon a legally protected classification, is not necessarily unlawful harassment (see DeAngelis, supra, 51 F.3d at pp. 595-596 [The \"'mere utterance of an . . . epithet which engenders offensive feelings in an employee'\" does not violate the antidiscrimination laws by creating a hostile work environment.]).\n\nThe problem with the trial court's injunction and the majority's dicta is that, to the extent they try ineffectively to ban certain words, they are not only futile and censorious, they are culturally parochial. They would impose an aesthetic standard of decorum on automobile service workers. Further, when given mechanical application by management, these directives would export middle-class manners, appropriate to a court or an office, into the vigorously physical, more frank and less euphemistic workaday world. (See, e.g., Letter Carriers v. Austin (1974) 418 U.S. 264, 283, 41 L. Ed. 2d 745, 94 S. Ct. 2770 [In the context of a labor dispute, unions have license to use intemperate, abusive, or insulting language without restraint or penalty in the belief that such rhetoric effectively makes its point.]; cf. Collin, supra, 447 F. Supp. at p. 699 [No prior restraints on racially derogatory speech are constitutionally permissible.].) We are not granted the right to suppress free speech by issuing prior restraint orders against impolite expressions of which we do not approve. ( R. A. V., supra, 505 U.S. at p. 391.) \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nB. These Unconstitutional Prior Restraints on Free Speech Are Also Vaguely and Overbroadly Worded\n\nThe trial court's injunction and the majority's dicta seemingly require that an automobile service worker who addresses his coworkers on the job do so at his peril, unless he addresses them in some vaguely defined, politically correct manner. The majority suggests erroneously that other means of address, however innocuous or well intended, be proscribed, subjecting the speaker to contempt punishment and jail sentence if he does not strictly comply with such means of address. The majority, however, does not adequately define the vague and overbroad terms it uses in redefining the injunction, e.g., the term \"workplace\" which the majority proposes as a way to define its scope. (P. 16.) Does this mean any \"workplace\" or only one particular \"workplace\" which neither the majority nor the trial court specify? What are the boundaries of a \"workplace\" which the majority does not define? Can Lawrence carry a picket sign on the street in front of his place of employment, stating his views regarding his coworkers? The majority's dicta would perpetuate most of the same mistakes of overbreadth and unconstitutionality of the trial court, and disregard the principle that free speech guarantees protect everyone, even employers and supervisors who wish to express themselves to other workers on the job. However, \"It is clear that 'an employer's free speech right to communicate his views to his employees is firmly established and cannot be infringed . . . .'\" ( Holo-Krome Co. v. N.L.R.B. (2d Cir. 1990) 907 F.2d 1343, 1345, quoting NLRB v. Gissel Packing Co. (1969) 395 U.S. 575, 617, 23 L. Ed. 2d 547, 89 S. Ct. 1918.) I repeat, the majority's belief that prior restraints are constitutional if confined to the \"workplace\" is simply wrong. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nMoreover, entry of an injunction against nonfighting words speech would not prevent racially offensive statements on the job not specifically addressed to respondents. Lawrence remains free under the majority's dicta and the trial court's injunction to proclaim odious statements such as \"Mexicans go home\" so long as he does not specifically refer to respondents. The majority's dicta are therefore futile as well as unconstitutional.\n\nThe remainder of the trial court's injunction, to which the majority devotes scant attention (p. 22, fn. 14), is also troubling and demonstrates little consideration of the predicate conditions for injunctive relief. It vaguely bans \"any uninvited intentional touching\" (whatever that means) of \"Hispanic/Latino employees, as long as [Lawrence] is employed by Avis Rent A Car System, Inc. in California.\" First, there was no basis for any finding of an ongoing need for injunctive relief, because the court found Lawrence had \"popped\" an employee on the back in previous years, without a finding he thereby intended to harm anyone. Second, if there really were a problem here, the availability of damages would create an adequate remedy, and injunctive relief is therefore inappropriate. Third, the injunctive language is overbroad and vague, and cannot mean what it purports to say. If for instance Lawrence were physically attacked by a coworker, his right of self-defense could not be measured by the racial background of the attacker. (See Civ. Code, § 50.) The majority also does not explain whether such injunctive language bans handshakes, a Heimlich maneuver for a choking employee, the handing over of a pay check, the delivery of a medal for distinguished service, or other intentional uninvited \"touching\" which would normally be accorded to non-Hispanic employees. However \"touching\" is defined, the injunction unfortunately does not ban only discriminatory \"touching\" on the job which might arguably violate the FEHA; similarly, the injunction also bans \"investigations\" of Hispanic/Latino employees without defining the term \"investigations,\" and without limiting the injunction to conduct which violates the FEHA. The injunction therefore appears to violate, not vindicate, the principles of the FEHA, by according differential treatment to employees based upon their racial background in a manner which is not necessary to remedy any prior discrimination. (See Adarand Constructors, Inc. v. Pena (1995) 515 U.S. [132 L. Ed. 2d 158, 187, 115 S. Ct. 2097, 2117] [\"Strict scrutiny\" is to be applied to all race-based governmental action enacted as a remedy to the effects of past discrimination; such scrutiny requires any relief to be \"narrowly tailored\" to serve \"compelling governmental interests.\"].) Neither the trial court nor this court should be in the position of thus ordering a party to violate a law.\n\nThe terms of the injunction and the majority's failure to respond to reasonable questions as to its import do not aid us or the parties in determining what the majority means by its dicta. That failure simply mirrors the vagueness and overbreadth of both the reversed injunction and the majority's dicta, and highlights their joint violation of the First Amendment to the federal Constitution as well as article I, section 2 of the California Constitution.\n\nC. The Proper Appellate Remedy Is to Honor the Terms of the Federal and State Constitutions, and Vacate the Void and Unconstitutional Injunction\n\nThe proper resolution of the imposition of unconstitutional prior restraints in this case is the one specified by the California Supreme Court for workplace restrictions on free speech in the case of In re Berry (1968) 68 Cal. 2d 137, 156-157, 65 Cal. Rptr. 273, 436 P.2d 273: \"The combination of what we have termed the 'overbroad' and the 'vague' aspects of the [injunctive] order in question render it a model of overreaching and confusion. We therefore consider that the doctrine of severance cannot reasonably be applied. 'Where a provision encompasses both valid and invalid restrictions on free speech and its language is such that a court cannot reasonably undertake to eliminate its invalid operation by severance or construction, the provision is void in its entirety regardless of whether the particular conduct before the court could be constitutionally regulated and whether there is a severability clause applicable to the provision.' [Citations.] We hold that the order which petitioners are charged with disobeying is unconstitutionally overbroad in that it unnecessarily restricts the exercise of First Amendment rights; that the order is too vague and uncertain to satisfy requirements of notice and fair trial which are inherent in the due process clause of the Fourteenth Amendment; that the doctrine of severability is inapplicable; and that the order is therefore void in its entirety.\" (Italics added.)\n\nThese words are particularly applicable here. The majority's dicta endorsing creation of a new version of the injunction does not simply sever some severable portion of the trial court's injunction. The majority instead suggests a rewriting of a portion of the injunction with no factual record which would permit it to do so; without proper consideration of the implications of its vague language; \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e and therefore, without me. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e Further, I cannot find, as the majority implicitly does, that we should rely on the positing by one author, the late Hannah Arendt, that the sole source of contemporary totalitarianism (a subject of ancient and continued scholarly debate) is racial bias, to conclude that at the close of this century overzealous political correctness should trump and restrict constitutional rights of free speech developed over two centuries in our country. (Maj. opn., ante, at p. 956.) The clear and contrary holdings of our Supreme Court and that of the United States are legion.\n\nThe majority finally suggests that the First Amendment does not \"make sense to anyone[]\" when it bans prior restraint on speech that evokes no immediate breach of the peace, because the majority speculates repeated racial insults would thus be unabated and go unpunished. (P. 25.) The same argument can be made as to any offensive, insulting speech or slander for which the speaker and his employer, if the doctrine of respondeat superior applies, are subject to after-the-fact damages. The \"sense\" made of the decades long precedent of the federal and our Supreme Courts' proscribing prior restraints of speech under the majority's hypothetical \"is a theory deeply etched in our law: a free society prefers to punish the few who abuse rights of speech after they break the law than to throttle them and all others beforehand. It is always difficult to know in advance what an individual will say, and the line between legitimate and illegitimate speech is often so finely drawn that the risks of freewheeling censorship are formidable.\" ( Southeastern Promotions, supra, 420 U.S. at p. 559, italics in original.) This case demonstrates the accuracy of those words.\n\nThe primary purpose and function of all speech is the production of some secondary effect. I share the concern of my colleagues in eliminating racist remarks and attitudes in society, an ancient concern not isolated to the 20th century. However, the majority's expansion of nonfighting words speech into conduct as a rationale for an injunction proscribing such speech, if upheld, is not just a minor encroachment on the constitutional right of free speech. It is unprecedented, and the mischief it will generate in encouraging wholesale efforts to restrict free speech deemed politically incorrect is predictably wide.\n\nBy abandoning or ignoring the teachings of the federal Supreme Court and our high court defining the traditional restrictions in a few limited areas on the exercise of free speech, the majority paves the way to encourage solicitation and receipt of injunctive orders of prior restraint proscribing all speech that is contended to \"poison[] the atmosphere\" (p. 16) of schools, universities, places of employment, and a myriad of other places and organizations in this state, i.e., by thereby producing \"secondary effects\" allegedly constituting racism, sexism, ageism, homophobism, harassment, or the production of emotional distress. While I understand how a well intentioned desire to deal with such social issues may erroneously lead, as in the majority opinion, to schemes for the suppression of free speech, those concerns have historically never been, and may not now be, resolved by reducing First Amendment protection or the free speech guarantee of the California Constitution to a subordinate position in our society.\n\nThis case illustrates that such injunctive orders do and will give new life to overboard and unprecedented censorship of speech, long abhorred and rejected in the jurisprudence and tradition of this country and state. ( Dailey, supra, 112 Cal. at p. 97.) The politically correct camel now will have its nose under the First Amendment tent that has long sheltered our citizens from such censorship.\n\nFinally, to paraphrase R. A. V., supra, 505 U.S. at page 396: \"Let there be no mistake about our belief that [the use of racial epithets or racially derogatory speech in the workplace] is reprehensible. But [our society] has sufficient means at its disposal to prevent such behavior without adding the First Amendment to the fire.\" Neither should we put the torch to article I, section 2 of our own Constitution, which guarantees all Californians the right to \"freely speak\" our \"sentiments on all subjects.\" I would find the trial court's unconstitutional restraint on free speech to be entirely void and not subject to remand.\n\n\u003cspan class=\"fn\"\u003e1. Because the verdicts did not specify any particular cause of action, they imply findings in favor of the prevailing plaintiffs on all causes of action, including employment discrimination in violation of FEHA. ( Henderson v. Harnischfeger Corp. (1974) 12 Cal. 3d 663, 673, 527 P.2d 353, 117 Cal. Rptr. 1.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The Judge explained from the bench that one of the plaintiffs had complained that Lawrence \"would come along and pop these fellows on the back.\" Our Concurring and Dissenting colleague transforms this observation into a so-called finding that \"Lawrence had 'popped' an employee on the back in previous years\" (conc. \u0026 dis. opn., post, p. 985 [typed opn. p. 33], italics added), implying this happened only once. What the Judge actually said was that one plaintiff had complained that Lawrence \"would\" do this to \"these fellows\" -- i.e., there were multiple touchings, not a single incident.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The injunction further orders Avis to display, at the San Francisco airport location, posters and a policy statement concerning complaints of employment discrimination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. We recognize that in First Amendment cases there is a special rule of de novo appellate review of the record on questions of constitutional fact. ( Bose Corp. v. Consumers Union of U.S., Inc. (1984) 466 U.S. 485, 509, fn. 27, 80 L. Ed. 2d 502, 104 S. Ct. 1949.) But this rule merely displaces the substantial evidence doctrine ( McCoy v. Hearst Corp. (1986) 42 Cal. 3d 835, 846, fn. 7, 231 Cal. Rptr. 518, 727 P.2d 711), which is otherwise implicated in a challenge to the sufficiency of the evidence to support a judgment. The First Amendment exception to the substantial evidence rule cannot logically apply under the peculiar circumstances of the present case, where, because of Avis's choice of a partial appeal and partial record, it is conclusively established that the evidence is sufficient to support the judgment, and Avis does not challenge but concedes the sufficiency of the evidence. The First Amendment exception does not displace the rules applicable to a partial appeal on a record lacking a trial transcript. Indeed, in appeals without a reporter's transcript, respondents are precluded by court rules from designating the evidentiary record that the First Amendment exception would otherwise require. (Cal. Rules of Court, rules 5(f), 5.1(j).)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Although the state of the record prevents us from knowing what else Lawrence called the three plaintiffs in addition to \"motherfuckers,\" a newspaper article about this case may give a clue: it asserts he called them \"wetbacks\" and \"racial epithets in Spanish.\" (Holding, Key Test for Speech Limits, San Francisco Chronicle (Dec. 18, 1995) p. B5, col. 1.) Restricted as we are, however, to the record and admissions before us, without relying on or giving any dispositive weight to the newspaper article ( Rains v. Belshe (1995) 32 Cal. App. 4th 157, 183, fn. 6), we are limited to the operative fact that racist epithets were spoken, without knowing what they were.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOur Concurring and Dissenting colleague speculates that the word motherfucker \"was apparently used to express Lawrence's sentiments concerning what he perceived as the unacceptable job performance of coworkers.\" (Conc. \u0026 dis. opn., post, p. 982, 987, fns. 25, 30.) fn. 5 But, lacking an evidentiary record, we have no idea why Lawrence called the plaintiffs motherfuckers. The word has no special meaning pertaining to job performance; one dictionary defines it as \"a detestable person.\" (New Dict. of American Slang (1986) p. 283.) Nothing in the abbreviated record suggests that the plaintiffs' job performance was in fact \"unacceptable\" or that Lawrence called them motherfuckers for that reason. It is just as plausible this was nothing other than unprovoked abuse.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. We endorse neither view in this opinion. Nevertheless, our Concurring and Dissenting colleague discusses and criticizes the Matsuda law review article at great length. (Conc. \u0026 dis. opn., post, at pp. 967, 971-976 \u0026 fns. 5, 6, 12, 14 \u0026 15 [typed opn. pp. 12-13, 17-19, \u0026 fns. 5, 6, 12, 14, \u0026 15].) We do not rely on Matsuda's thought-provoking ideas, however, but simply note the existence of a vigorous debate on this subject. We have no hidden agenda. Our holding in this case would have been the same if the Matsuda article had never been written.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. As we reach the Conclusion of the 20th century, however, it has become increasingly difficult to know precisely what might amount to fighting words -- particularly, what sort of speech might \"tend to incite an immediate breach of the peace.\" ( Chaplinsky v. New Hampshire, supra, 315 U.S. at p. 572.) In this age when episodes of violence in the workplace are a regular feature of the news, racist epithets may well be taken as fighting words and elicit a violent response. The line between what is offensive but nonincendiary and what constitutes fighting words has become disturbingly blurred.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. In addition, under California law, workplace use of racist epithets may result in tort liability for intentional infliction of emotional distress. ( Agarwal v. Johnson (1979) 25 Cal. 3d 932, 947, 160 Cal. Rptr. 141, 603 P.2d 58; Alcorn v. Anbro Engineering, Inc. (1970) 2 Cal. 3d 493, 498-499, 86 Cal. Rptr. 88, 468 P.2d 216.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Thus, our colleague's citation of Sebago, Inc. v. City of Alameda (1989) 211 Cal. App. 3d 1372, 259 Cal. Rptr. 918, for the proposition that listener reactions to speech are not secondary effects (conc. \u0026 dis. opn., post, p. 959) is accurate in the abstract but meaningless here, where the secondary effect is employment discrimination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The plaintiffs contend Avis waived this point by failing to raise it below. But \"a litigant may raise for the first time on appeal a pure question of law which is presented by undisputed facts.\" ( Hale v. Morgan (1978) 22 Cal. 3d 388, 394, 149 Cal. Rptr. 375, 584 P.2d 512; see also Cabrera v. Plager (1987) 195 Cal. App. 3d 606, 611, 241 Cal. Rptr. 731.) That is the situation here. In addition, whether the general waiver rule should be applied \"'is largely a question of the appellate court's discretion.'\" ( Canaan v. Abdelnour (1985) 40 Cal. 3d 703, 722, fn. 17, 221 Cal. Rptr. 468, 710 P.2d 268, quoting Bayside Timber Co. v. Board of Supervisors (1971) 20 Cal. App. 3d 1, 5, 97 Cal. Rptr. 431.) Because the trial court did not announce its expansion of the injunctive language to extend beyond the San Francisco airport location until the last hearing on the injunction request, giving Avis scant opportunity to object, we deem it inappropriate to apply the waiver rule.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Are these fighting words, which our Concurring and Dissenting colleague grudgingly agrees might \"arguably\" be subject to prior restraint? (Conc. \u0026 dis. opn., post, pp. 957, 980.) We think it depends on context. \"Nigger\" hurled by a white manager at a black subordinate might not present an actual danger of a violent response by the intimidated subordinate (see ante, p. 943), but the same utterance to a black stranger on a street corner might produce a very different reaction. Our colleague seems to agree: he asserts that racists epithets would not \"necessarily\" constitute fighting words, implying they could in some instances (conc. \u0026 dis. opn., post, p. 969), and he says the epithets enjoined in the Snell decision were fighting words (id. at p. 987, fn. 30 [typed opn. p. 36, fn. 30]). But this propels him into a dilemma in his quest to conclude, unnecessarily, that Lawrence's invectives were not enjoinable as fighting words. Our colleague says the trial Judge \"could not find the words spoken by Lawrence to be fighting words, since they did not provoke or lead to any immediate violence.\" (Ibid.) But the trial Judge actually observed: \"Aren't these words such that one can expect them to lead to violence if used over and over again? But they haven't lead to violence, have they?\" Evidently the Judge thought the invective presented an actual danger of causing a breach of the peace, although it did not actually result in violence. Yet, only the actual danger of violence, not an ultimately violent result, is required by the fighting words doctrine. (See ante, p. 942-943.) The Judge's comments lead to the very Conclusion that our colleague finds so repugnant (and that we do not even reach) -- that Lawrence's invectives were enjoinable as fighting words. All this is beside the point, however, in light of our Conclusion that the utterances invoke the secondary effects rule. The fighting words doctrine is not the basis of our judgment and will not be at issue on remand.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The plaintiffs commenced this lawsuit close on the heels of Lawrence's continuing harassment. The first amended complaint was filed in April 1993. (The appellate record does not indicate when the original complaint was filed.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. This is the \"ongoing pattern of wrongful conduct\" that our Concurring and Dissenting colleague demands. (Conc. \u0026 dis. opn., post, p. 958.) The fact of such conduct is presumed because of, not as he claims \"belied\" by (ibid.), the abbreviated appellate record. (Ante, at pp. 940-941.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Three remaining points raised by Avis may be disposed of summarily. Avis contends the portion of the injunction ordering the company not to allow Lawrence to commit the proscribed acts will force the company to abridge Lawrence's speech rights. This argument fails because of our Conclusion that the injunction, as modified, will not violate Lawrence's speech rights. Avis contends this portion of the injunction is also vague to the extent it refers to acts which Avis \"knew or should have known of.\" Avis is estopped to assert this point because defense counsel herself proposed this very language. ( Mesecher v. County of San Diego (1992) 9 Cal. App. 4th 1677, 1685.) Avis claims another portion of the injunction, ordering the company not to make Hispanic/Latino employees the targets of investigations regarding breach of employment rules unless no employees other than Hispanics/Latinos are reasonably such targets, is improper because it enjoins conduct that does not violate FEHA. This provision arises from the verdict of discrimination by Kathy Black, who on one occasion targeted Hispanic/Latino drivers when investigating the disappearance of a customer's property from a returned rental car. As part of a pattern of harassment found by the jury, such conduct is indisputably a FEHA violation and thus is properly enjoined.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAs for our colleague's claim that \"no appellate court has ever held\" that an employer could be found in contempt for failing to suppress or control the unauthorized or unratified speech or conduct of employees (conc. \u0026 dis. opn., post, p. 982, he has failed to comprehend the significance of E.E.OC. v. Hacienda Hotel, supra, 881 F.2d at pages 1515-1519, which held an employer liable for its employees' persistent sexually offensive remarks of which it knew or should have known, and upheld an injunction against further such discrimination. Obviously, the employer could have been held in contempt for violating the injunction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The Concurring and Dissenting opinion repeatedly calls this holding a dictum. (Conc. \u0026 dis. opn., post, pp. 951-960, 966, 970, 981-986.) It is not. Our decision to reverse and remand for modification of the injunction to narrow its scope and prescribe the prohibited conduct with greater specificity still leaves pending the ultimate question whether the injunction as so modified would be an unconstitutional prior restraint. Our decision of the prior restraint issue is therefore necessary to a full decision on the merits and is binding precedent. ( Bunch v. Coachella Valley Water Dist. (1989) 214 Cal. App. 3d 203, 212, 262 Cal. Rptr. 513.) This is consistent with our legislative mandate, upon reversal with directions for further trial proceedings on remand, to \"pass upon and determine all questions of law involved in the case, presented upon such appeal, and necessary to the final determination of the case.\" (Code Civ. Proc., § 43.) Even our colleague says he would \"find\" -- which is just a loose euphemism for hold (see Dict. of Modern Legal Usage (2d ed. 1995) p. 358) -- that the challenged injunction is an unlawful prior restraint. (Conc. \u0026 dis. opn., post, p. 960.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 I agree with the majority that the portion of the lower court's judgment awarding damages against John Lawrence (Lawrence) to three of the seventeen plaintiffs suing him for inflicting emotional distress is not appealed from and not before us. (Maj. opn., ante, at p. 939.) Hence, our focus is not on issues of free speech, if any, which might arguably be implicated by those damage awards. (See Gooding v. Wilson (1972) 405 U.S. 518, 521-522, 31 L. Ed. 2d 408, 92 S. Ct. 1103.) \"We are here concerned with suppression--not punishment.\" ( Kunz v. New York (1951) 340 U.S. 290, 295, 95 L. Ed. 280, 71 S. Ct. 312 (Kunz).)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 I use the term \"arguably\" because the U.S. Supreme Court has never upheld an order of prior restraint of speech constituting \"fighting words\" or otherwise ( Procter \u0026 Gamble Co. v. Bankers Trust Co. (6th Cir. 1996) 78 F.3d 219, 227 (Procter \u0026 Gamble)); neither has the high court or any appellate court of California (see fn. 17, post).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 The majority attempts to label this obvious dicta as a \"holding.\" (P. 23, fn. 15.) However, the actual holding of this case, which we learn from the majority's Disposition paragraph, is simply that the trial court injunction is \"reversed\" because it is overbroad and vague. (P. 26.) I agree the majority's decision is precedent for the proposition that the trial court's injunction must be reversed; and its ratio decidendi for this decision, i.e., the injunction is overbroad and vague because it applies outside the workplace and does not specify particular offensive terms, also has the effect of precedent. The majority's general observations in dicta, however, concerning many possible other issues which might arise if the majority were attempting to uphold some differently worded injunction, obviously constitute dicta, not a holding. The authority cited by the majority makes this clear; in Bunch v. Coachella Valley Water Dist. (1989) 214 Cal. App. 3d 203, 212, 262 Cal. Rptr. 513, the court held similar \"'general observations, unnecessary to the decision'\" were dicta. Numerous decisions by our Supreme Court also analyze similar general observations unnecessary to the decision as dicta, and refuse to follow them. (See, e.g., Harris v. Capital Growth Investors XIV (1991) 52 Cal. 3d 1142, 1157, 278 Cal. Rptr. 614, 805 P.2d 873 [declining to follow prior dicta in a civil rights action]; Brown v. Kelly Broadcasting Co. (1989) 48 Cal. 3d 711, 734-735, 257 Cal. Rptr. 708, 771 P.2d 406 [declining to follow prior dicta on a First Amendment issue]; see also Security Pacific National Bank v. Wozab (1990) 51 Cal. 3d 991, 1003-1004, 275 Cal. Rptr. 201, 800 P.2d 557.) Even if the majority's dicta were a holding, however, the majority's statements would still be wrong.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 \"'Fighting' words\" are a class of speech not entitled to First Amendment protection because they have a \"direct tendency\" to \"provoke the person against whom [they are] directed to acts of violence,\" and because \"by their very utterance [they] inflict injury or tend to incite an immediate breach of the peace.\" ( Chaplinsky v. New Hampshire (1942) 315 U.S. 568, 574, fn. 8, \u0026 572, 86 L. Ed. 1031, 62 S. Ct. 766, italics added (Chaplinsky).) Thus, fighting words are limited to that narrow class of speech which \"conveys an overriding message of personal injury and imminent violence . . . .\" ( R. A. V. v. St. Paul (1992) 505 U.S. 377, 408, 120 L. Ed. 2d 305, 112 S. Ct. 2538 (conc. opn. of White, J.) italics added (R. A. V.).)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 This commentator the majority cites (p. 7) is Professor Mari J. Matsuda, Public Response to Racist Speech: Considering the Victim's Story (1989) 87 Michigan Law Review 2320, 2357-2358 (Matsuda, Racist Speech). The author argues that all racist speech is \"best treated as a sui generis [sic] category, . . . outside the realm of protected discourse,\" and that \"The alternative to recognizing racist speech as qualitatively different because of its content is to continue to stretch existing First Amendment exceptions, such as the 'fighting words' doctrine and the 'content/conduct' distinction.\" (Id. at p. 2357, italics added.) The majority has followed this suggestion, as I explain post, and \"stretched\" both doctrines to reach its result. The commentator, unlike the majority, freely concedes this \"stretching\" exercise \"ultimately weakens\" the First Amendment protection of speech. (Matsuda, Racist Speech, supra, 87 Mich.L.Rev. at p. 2357.) Her rationale for such action is this: \"Setting aside the worst forms of racist speech for special treatment [deprived of First Amendment protection] is a non-neutral, value-laden approach that will better preserve free speech.\" (Ibid.) In other words, free speech protection is preserved by the elimination of all such protection for the \"worst forms\" of any speech considered racist, a proposition indefensible under First Amendment jurisprudence and impossible to enforce in practical terms. How, for example, are the identity of the \"worst forms\" of racist speech not entitled to First Amendment protection established as distinguished from the other forms of allegedly racist speech which are entitled to that protection?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 The Matsuda comments have also been cited and carried to extreme limits by another commentator cited by the majority (p. 8), who suggests Matsuda's proposal \"that only racial or ethnic insults directed against members of groups that are historically oppressed because of their race, color, or national and ethnic origin should be subject to prohibition--has considerable merit. Racial or ethnic insults directed at non-Jewish white Americans simply do not have the capacity to cause the same type of harm as insults directed against subordinated groups.\" (Shiffrin, Racist Speech, Outsider Jurisprudence, and the Meaning of America (1994) 80 Cornell L.Rev. 43, 81.) No court to date has accepted these suggestions that \"considerable merit\" exists in selective, race-based application of constitutional free speech protection. The reason seems obvious: For two centuries, our national tradition has been to protect the rights of our citizens to freely and fully speak their views. That tradition of uninhibited and robust Discussion is a primary reason we have always been free of a totalitarian government. (See Southeastern Promotions, Ltd. v. Conrad (1975) 420 U.S. 546, 559, 43 L. Ed. 2d 448, 95 S. Ct. 1239 (Southeastern Promotions).)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7 One commentator states: \"The failure of courts to consider First Amendment principles in harassment cases is understandable, if for no other reason than that defendants seldom raise the issue. Even when courts address the issue, however, they have tended to dismiss it summarily. . . . . . . . . . None of [the Supreme Court's] precedents in this area supports the view that the speech at issue in harassment cases is entitled to diminished [First Amendment] protection [on the job].\" (Browne, Title VII As Censorship: Hostile-Environment Harassment and the First Amendment (1991) 52 Ohio St.L.J. 481, 512-513 (Browne, Title VII As Censorship).)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8 Title VII of the Civil Rights Act of 1964 (42 U.S.C.S. § 2000e et seq.) bars discrimination in employment, and is the federal counterpart to California's Fair Employment and Housing Act (the FEHA) (Gov. Code, § 12900 et seq.) under which this action was brought.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9 The majority, while citing several law review articles which seem to support an injunctive order, ignores the fact that more recent law review articles written in accord with the majority opinion in R. A. V., supra, have demolished the Robinson dictum. (See, e.g., Volokh, Freedom of Speech and Workplace Harassment (1992) 39 UCLA L.Rev. 1791, 1818 [\"Thus, in the recent case of [Robinson], the district court was wrong . . . .\"]; Browne, Title VII As Censorship, supra, 52 Ohio St.L.J. at p. 512, fn. 188 [\"Thus, the court in Robinson [citation] missed the point . . . .\"] \u0026 515, fn. 201 [\"The court in Robinson [citation] mistakenly asserted . . . .\"]; Karner, Political Speech, Sexual Harassment, and a Captive Workforce (1995) 83 Cal.L.Rev. 637, 665, fn. 168 [\"The Robinson court ignored basic [First Amendment] doctrine in reaching this Conclusion.\"].) Further, neither Robinson nor any of the other cases cited by the majority analyzed the issue in light of the free speech guarantee of the California Constitution, which is directly applicable here as I discuss, post. The case at bench is not a federal case governed by federal law. It is solely a state law case governed by state law, except to the extent the First Amendment to the federal Constitution also bars the prior restraint on speech crafted by the trial court and the dicta of the majority opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10 For example, the odious words, \"You will have to have sex with me to get that promotion,\" are not fighting words; but they certainly \"may produce\" a violation of Title VII. (See Karibian v. Columbia University (2d Cir. 1994) 14 F.3d 773, 778.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11 The majority's protestations that it is only attempting to regulate secondary effects, not suppress the content of the speech in question, do not withstand the most cursory analysis. If the trial court had banned expressions of racial harmony on the job because those expressions caused upset to Lawrence, such a suppression of speech due to its content and emotional effect could not pass constitutional muster. The trial court's injunction was intended to suppress certain speech. It was not concerned with secondary effects such as the avoidance of emotional upset. Even the majority's specific references to the fact that free speech can \"poison[] the atmosphere\" at work (p. 16) show that under the injunction, even as the majority has suggested it might be revised, Lawrence can cause upset to other workers by any means he desires, except by exercising his free speech rights in a way with which the majority disagrees. That is clearly unconstitutional. ( R. A. V., supra, 505 U.S. at pp. 393-394.) \"If this indeed is the point of applying the state law to expressive conduct, it is a decidedly fatal objective.\" ( Hurley, supra, 132 L. Ed. 2d at p. 507, 115 S. Ct. at p. 2350.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12 The article, inter alia, also proposed that courts should change their analysis of the First Amendment so that \"degrading\" speech by Whites could be banned, although verbal racial attacks by members of other groups directed at Whites would remain \"permissible\" (Matsuda, Racist Speech, supra, 87 Mich.L.Rev. at p. 2358); and that the existing interpretation of the First Amendment should be changed, so that it would protect \"Marxist speech\" but not racists (id. at pp. 2358-2359). This is not, however, presented as existing legal doctrine; rather, the author recognizes that she is proposing a radical restructuring of the existing understanding and application of First Amendment protections. The majority comments on my criticism of the views of Professor Matsuda, contending it has sidestepped them entirely by merely noting the existence of \"debate\" on the subject of whether the First Amendment protects free speech rights in places of employment. (Maj. opn., ante, at p. 942, fn. 6.) My criticism is focused on the plain fact that the majority's unprecedented stretching of traditional and long-standing exceptions to First Amendment protection of speech in this case has accomplished exactly what Professor Matsuda recommends.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13 Justice Stevens wrote separately in R. A. V., Concurring in the result. (505 U.S. at pp. 416-436.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14 See, e.g., Massaro, Equality and Freedom of Expression: The Hate Speech Dilemma (1991) 32 William \u0026 Mary Law Review 211, 242 (Massaro, Hate Speech) [\"In effect, the Matsuda approach makes the criminality of speech hinge on the race of the speaker and the victim.\"]; Browne, Title VII As Censorship, supra, 52 Ohio State Law Journal at page 534 [\"One highly unsatisfactory response to first amendment objections is simply to label racist speech sui generis and declare that normal rules do not apply. Mari Matsuda makes such an argument . . . . The flaws in her argument are manifest.\"]; Post, Racist Speech, Democracy, and the First Amendment (1991) 32 William \u0026 Mary Law Review 267, 308-309 [\"There is also a tendency in recent literature to move from the proposition that a fair determination cannot be made unless 'the victims of racist speech are heard,' to the very different proposition that such a determination ought to use 'the experience of victim-group members [as] a guide.' [Quoting Matsuda, Racist Speech.] The latter proposition seems to me plainly false.\"].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15 The majority's disclaimer (p. 8, fn. 6) of endorsement of the view of Matsuda and authors supporting her position seems belied by its result and its implicit criticism of the traditional fighting words jurisprudence of the U.S. Supreme Court. \"The curious result is that the [fighting words] doctrine protects those who are likely to react with violence, but not those who are too fearful to fight back. . . . Victims of racist speech are frequently too intimidated to react with violence . . . . Thus, racist invective is often beyond the reach of the fighting words doctrine.\" (Maj. opn., ante, at p. 943, fn. omitted.) If the words in question are not fighting words, however, they are protected by the First Amendment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The wording of article I, section 2, subdivision (a) of the California Constitution was chosen by the delegates to the Monterey Convention in 1849, and ultimately derives from Justice Blackstone's Commentaries. (See Dailey, supra, 112 Cal. at p. 98.) As Blackstone notes and the Dailey court held, this provision forbids prior restraint or censorship, even by Judges, because such a prior restraint would \"'subject all freedom of sentiment to the prejudices of one man, and make him the arbitrary and infallible Judge of all controverted points in learning, religion, and government. . . .'\" (Ibid.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. We have seen that the federal Supreme Court has previously stated fighting words are not protected by the First Amendment, as to after-the-fact punishment therefor. However, since this exception to the First Amendment was articulated in Chaplinsky, supra, no decision of the federal high court has ever upheld a prior restraint on speech, whether on the grounds that it constituted fighting words, or conduct. (See Procter \u0026 Gamble, supra, 78 F.3d at p. 227.) There is an even more serious question as to whether any speech may be subject to prior restraint under the broader free speech guarantee of the California Constitution. The Dailey case strongly suggests it may not. (See 112 Cal. at p. 97.) We need not decide the issue in this case, because the injunction is being reversed, and the words used were not fighting words in any event.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. By section 52.1, subdivision (k) of the Civil Code, the Legislature has clearly endorsed the principle that pure speech may not be the subject of prior restraint even through the speech is discriminatory. That subdivision provides that no such injunctive order \"shall restrict the content of any person's speech.\" (Ibid.) The trial court's injunction creates the same result the Legislature proscribed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The majority wrongly relies on Lopez v. Tulare Joint Union High School Dist. (1995) 34 Cal. App. 4th 1302, 1325 (Lopez), which held that high school authorities could remove the four letter words from a dramatic production, but could not censor the underlying ideas. First, as Lopez was careful to note, its holding applied only to a drama to be presented to minors, not adults, in light of the greater need for supervision of language aimed at minors. (Ibid.) Where the intended audience is composed of adults, such as the workers at Avis, the California courts have held that racial slurs or other objectionable material may not be censored by state authorities or the courts. (See Dailey, supra, 112 Cal. at pp. 96-97 [A dramatic production may not be suppressed, even though it refers to a scandalous ongoing murder case.]; DiBona v. Matthews (1990) 220 Cal. App. 3d 1329, 1335-1336, 1343, 1345-1348, 269 Cal. Rptr. 882 [School authorities could not censor racial slurs in a play presented to adult students at a college, even though some members of the \"'community'\" objected to this racially derogatory language.].) Further, Lopez also was careful to note that it was not censoring the underlying message, content, or viewpoint of the students, only their use of certain impolite words which other young students might find embarrassing, given their sexual and emotional inexperience. (34 Cal. App. 4th at p. 1325.) The same cannot be said for the injunction in issue here or the one the majority suggests the trial court may reissue, both of which necessarily would seek to ban any message, content, or viewpoint of which the state authorities disapprove, regardless of the specific language employed. Finally, the need to protect tender ears from impolite language is inapposite here, and is being seized upon simply as a pretext for censorship of the expression of unpopular views--a prior restraint which is not constitutionally permissible. ( Dailey, supra, 112 Cal. at p. 97; Candiotti, supra, 34 Cal. App. 4th at pp. 725-726 [The alleged need to protect minors may not be used to censor speech intended for adults.]; accord, Sebago, supra, 211 Cal. App. 3d at pp. 1382-1385.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The lower court apparently accepted respondents' argument that an injunctive order was \"an authorized statutory remedy\" pursuant to the FEHA, having observed that \"[Lawrence] is saying things which are prohibited by the statute . . . .\" In the injunctive hearing, respondents argued \"It's [Government Code section 12965, subdivision] (c) which gives the court the authority to grant that type of [injunctive] relief.\" The \"statutory remedies\" the FEHA sets forth are not descriptive of remedies applied by courts. When a case such as this is heard and decided by a court, the ordinary rules applicable to civil actions generally apply. (See Commodore Home Systems, Inc. v. Superior Court (1982) 32 Cal. 3d 211, 221, 185 Cal. Rptr. 270, 649 P.2d 912 [Trial courts in FEHA actions may provide \"all relief generally available in noncontractual actions . . . .\"].) Moreover, it was never intended that the FEHA should be applied so as to infringe free speech rights. (See Cal. Code of Regs., tit. 2, § 7287.6, subd. (b)(1)(E) [\"In applying this subsection [forbidding harassment], the rights of free speech and association shall be accommodated consistently with the intent of this subsection.\" Italics added.].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The trial court's statement--that if Lawrence had not harassed anyone from 1992 \"to the present, that may be because of the pending action\"--tacitly concedes an adequate remedy at law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. One will search the authorities in vain to find support for this unprecedented proposition: that an order of prior restraint on speech cannot be \"prematurely\" tested for constitutional error until the recipient of that order comes to trial accused of violating it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The majority's statement, that the paucity of our record compels us blindly to presume conclusively that the trial court's findings are supported by the evidence, is simply untrue. (P. 5.) The majority's presumption of the trial court's alleged reliance on the evidence at trial for entering an injunction on that basis does not preclude this court from examining de novo the need for the injunction from the same court's concessions and omissions on our record.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. It is especially troubling in this regard to find the majority relying on a quotation from a newspaper article, not the evidence in the record, in framing its dicta. (P. 6, fn. 5.) This court (Division Five) has strongly condemned the practice of relying on newspaper articles, rather than on the appellate record, for evidentiary purposes. ( Rains v. Belshe (1995) 32 Cal. App. 4th 157, 183, fn. 6.) Our Supreme Court has also condemned such practices. ( Mangini v. R. J. Reynolds Tobacco Co. (1994) 7 Cal. 4th 1057, 1063-1065, 875 P.2d 73.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The trial court implicitly noted that the injunction in issue here could not be based upon the regulation of fighting words, because there was no showing Lawrence had uttered any fighting words and there was no showing violence might result if his utterances were not enjoined. As the trial court conceded at the time it entered the injunction, \"But they [the words in question] haven't led to violence, have they? . . . . . . I hadn't given that any thought.\" Moreover, the lamentable word \"'motherfuckers'\" which Lawrence had apparently uttered is not a racial epithet and is, unfortunately, in relatively common use in today's society. (See, e.g., People v. Davison (1995) 32 Cal. App. 4th 206, 210 [Quoting a robbery victim who exclaimed to her assailants, \"'\"You goddamn motherfuckers, give me back my money.\"'\"].) The sporadic use of such a word to express anger or emotional upset does not justify the issuance of an unconstitutional prior restraint on speech. Respondents conceded at oral argument that \"'motherfuckers'\" is not a fighting word; and it was not used here in a threat or scheme to defraud, or in any other criminal way. It was apparently used to express Lawrence's sentiments concerning what he perceived as the unacceptable job performance of coworkers; in their complaint, respondents claim only that they were subjected to the derogatory epithet \"'motherfuckers'\" and were told they were not \"doing their jobs well.\" Those sentiments, whether rude, improper, inaccurate, or perceptive, cannot be the subject of prior restraints. (See Dailey, supra, 112 Cal. at p. 97; Cohen v. California (1971) 403 U.S. 15, 22-23, 29 L. Ed. 2d 284, 91 S. Ct. 1780 (Cohen) [The First Amendment protects the right to express the offensive sentiment, \"'Fuck the Draft.'\"].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. In Hacienda Hotel, supra, 881 F.2d at pages 1518-1519, wrongly relied upon by the majority, there was no First Amendment issue raised, and no contempt remedy was imposed against an employer merely because an employee violated an injunction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. As Professor Suzanna Sherry has observed, \"Many of the new progressive strategies--especially the suppression of free speech and the insistence that a radical vision is superior to that which the populace has developed over the years--are based on a profoundly antidemocratic mistrust of the people's choices.\" (Sherry, Progressive Regression (1995) 47 Stan.L.Rev. 1097, 1114-1115.) Professor Sherry describes these new attacks on free speech as \"authoritarian elitism.\" (Id. at p. 1115.) Be that as it may, while we need to accord a proper value to all diversity, this must also include diversity of viewpoint. We are unlikely to accord a proper value to diversity if we give preemptive value solely to racial diversity, and neglect the value of the diversity of viewpoints which the freedom of speech has historically allowed. (See Rorty, Contingency, irony, and solidarity (1989) pp. 51-52 [\"It is central to the idea of a liberal [sic] society that, in respect to words as opposed to deeds, persuasion as opposed to force, anything goes.\"]; see also Loving v. Virginia (1967) 388 U.S. 1, 13, 18 L. Ed. 2d 1010, 87 S. Ct. 1817 (conc. opn. of Stewart, J.) [\"'It is simply not possible for a state law to be valid under our Constitution which makes the criminality of an act depend upon the race of the actor.'\" (Quoting McLaughlin v. Florida (1964) 379 U.S. 184, 198, 13 L. Ed. 2d 222, 85 S. Ct. 283 (conc. opn. of Stewart, J.).)].) \"Moreover, to impose speech limitations based on a culturally contested theory seems especially wrong.\" (Massaro, Hate Speech, supra, 32 Wm. \u0026 Mary L.Rev. at p. 243, italics in original.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. I particularly question the majority's suggestion that its prior restraints on free speech \"'are really not prior restraints at all.'\" (P. 14, italics added by the majority.) This simply is a further effort to bolster its repeated and erroneous premise that nonfighting words in a workplace constitute conduct, not speech regulated because of content, and are thus outside First Amendment protection.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. While the majority's proposed modification to the injunction does, at least, limit the trial court's injunction so that it will no longer apply to a verbal interchange at a private home (maj. opn., ante, at pp. 949-950), this limitation on the scope of the injunction is itself inconsistent with the majority's overall standard of review, and its insistence that free speech may be banned whenever its \"secondary effects\" would evoke adverse reaction in a place of employment. The injunction also cannot be justified as a response to a violation of the FEHA, because the injunction bans much speech which does not violate the FEHA. It is not narrowly tailored to reach only derogatory fighting words in an employment setting which violate the FEHA.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The majority correctly reverses the injunction, but wrongly remands for entry of a new, less overbroad injunction specifying the exact \"racial or ethnic epithets\" used by Lawrence which are being enjoined. (Pp. 19-20.) This is futile. The only epithet shown by the record is \"'motherfuckers,'\" which is not a racial or ethnic epithet and is not a fighting word subject to suppression by prior restraint. The only authority cited is the district court's opinion in Snell, supra, which banned fighting words in a prison setting while noting that the court was not addressing the First Amendment implications of such a ruling, because (unlike here) the parties did not raise the issue. (611 F. Supp. at p. 531.) Further, while the words specified by the Snell court may have been, on the evidence adduced in that case, \"fighting words\" in the context of a prison, those words were not spoken here. The trial court here could not find the words spoken by Lawrence to be fighting words, since they did not provoke or lead to any immediate violence. Further, a proscription and prior restraint against certain words constitutes overbroad censorship, since it would ban the utterance of those words in any possible context, however innocuous; e.g., if Lawrence says, \"Some call them spics, but I think they are people just like us,\" then Lawrence risks unconstitutional punishment for his exercise of free speech.\u003c/span\u003e\n\n",
    "body_length": 155218,
    "citedas": [
      "45 Cal.App.4th 933",
      "50 Cal.App.4th 28",
      "53 Cal.Rptr.2d 599",
      "70 Fair Empl.Prac.Cas. (BNA) 1477",
      "71 Empl. Prac. Dec. P 44"
    ],
    "attorneys": "Edwin L. Currey, Jr., Albert P. Bedecarre and Mary Bossart Halfpenny, Bronson, Bronson \u0026 McKinnon, San Francisco, California for plaintiffs and respondents. Joanne Dellaverson, Joel P. Kelly and Donna M. Rutter, McKenna \u0026 Cuneo, San Francisco, California for defendants and appellants.",
    "category": [],
    "judges": "King, J.; Haning, J., Concurring. Peterson, P.j.; Concurring in part and Dissenting in part.",
    "citation_count": 2
  }
}
