{
  "id": "ZLOkTGYBTlTomsSBcVaj",
  "document": {
    "title": "Tichnell v. Maryland",
    "full_title": "RICHARD DANNY TICHNELL v. STATE OF MARYLAND",
    "jurisdiction": "Court of Appeals of Maryland",
    "date": "1983-11-03T00:00:00.000Z",
    "docket": "No. 3, September Term, 1982",
    "body": "On August 23, 1979, Richard Danny Tichnell was found guilty by a jury of the wilful, deliberate and premeditated first degree murder of Deputy Sheriff David Livengood. The State sought imposition of the death penalty under Maryland's capital punishment statute, Maryland Code (1957, 1982 Repl. Vol.), Article 27, §§ 412-414, inclusive. Tichnell waived his statutory right to have the jury determine whether the death penalty should be imposed upon him; he elected instead to have the trial judge decide the issue. The court sentenced him to death. On appeal, we affirmed the murder conviction but vacated the death sentence on the ground that it had been imposed under the influence of an \"arbitrary factor\" in violation of Art. 27, § 414 (e) (1). We remanded for a new sentencing hearing. Tichnell v. State, 287 Md. 695, 415 A.2d 830 (1980) (Tichnell I). Thereafter, Tichnell elected to have a jury determine whether the death penalty should be imposed upon him. The jury concluded that death was the appropriate penalty. On appeal, we again vacated the death sentence and remanded for a new sentencing hearing; we concluded that the trial judge had committed reversible error in admitting certain prior recorded trial testimony in evidence over Tichnell's objection. Tichnell v. State, 290 Md. 43, 427 A.2d 991 (1981) (Tichnell II). At his third capital sentencing hearing, Tichnell again elected to be sentenced by a jury. The jury imposed the death penalty and this appeal followed.\n\nI\n\nTichnell contends that he was denied due process of law at his capital sentencing hearing because the court-conducted\n\nvoir dire examination was too limited to expose bias on the part of the prospective jurors. He argues that the court erred in denying his motion to personally conduct the voir dire examination of the individual jurors. In support of this argument, Tichnell suggests that it was impossible \"to prepare in advance appropriate voir dire examination questions, subject to acceptance or rejection by the trial court, until counsel had an opportunity to observe and ascertain the decorum and atmosphere in the courtroom, to hear the nature and reach of the trial court's voir dire examination and inquiries, and to get a view of the prospective jurors and note their attitude and silence or responses to the initial voir dire examination.\"\n\nMaryland Rule 752 provides:\n\n\"The court may permit the parties to conduct an examination of prospective jurors or may itself conduct the examination. If the court conducts the examination, it shall permit the parties to supplement the examination by any further inquiry it deems proper or shall itself submit to the prospective jurors the additional questions proposed by the parties it deems proper.\"\n\nConsistent with the provisions of the rule, the trial judge (Bowen, J.) announced at the outset of the proceedings that he would conduct the voir dire questioning of prospective jurors and would permit Tichnell to submit additional questions to be propounded by the court to the jurors. The court thereafter asked a number of questions aimed at exposing juror bias or partiality. Tichnell submitted additional voir dire questions to the court, all of which the court asked the prospective jurors.\n\nThe jury selection process must, of course, satisfy the essential demands of fairness guaranteed by the fourteenth amendment in order to afford the accused his due process right to an impartial jury. See Ristaino v. Ross, 424 U.S. 589, 595 n. 6, 96 S. Ct. 1017, 47 L. Ed. 2d 258 (1976); Ham v. South Carolina, 409 U.S. 524, 93 S. Ct. 848, 35 L. Ed. 2d 46 (1973). The voir dire examination of prospective jurors protects this right by exposing the existence of grounds for\n\ndisqualification. See Couser v. State, 282 Md. 125, 383 A.2d 389, cert. denied, 439 U.S. 852 (1978); Langley v. State, 281 Md. 337, 378 A.2d 1338 (1977).\n\nMaryland Rule 752 permits, but does not require, individual voir dire examination of prospective jurors by counsel. The matter is committed to the sound discretion of the trial judge; there is no absolute right vested in counsel, constitutional or otherwise, to conduct individual voir dire. See, e.g., Langley v. State, 281 Md. 337, 378 A.2d 1338 (1977); Bryant v. State, 207 Md. 565, 115 A.2d 502 (1955); Handy v. State, 101 Md. 39, 60 A. 452 (1905); United States v. Duke, 409 F.2d 669 (4th Cir. 1969), cert. denied, 397 U.S. 1062 (1970) (defendant has no constitutional right to counsel-conducted voir dire); Turner v. Commonwealth, 221 Va. 513, 273 S.E.2d 36 (1980) (no constitutional right to individual jury voir dire). See also Irvin v. State, 617 P.2d 588 (Okla. Crim. App. 1980).\n\nTichnell has not identified any specific deficiencies or particular shortcomings in the court's voir dire examination of the prospective jurors. Instead, he generalizes that the court's \"attitude and disposition\" during voir dire were antithetical to fair and impartial jury selection. He complains that the court's questioning of prospective jurors was so brief, stiff and short as to have left him \"on a stormy sea without compass or rudder.\" Manifestly, these allegations are insufficient to demonstrate that the jury selection process failed to assure Tichnell of a fair and impartial jury. We conclude, therefore, that no error appears on the record in this case with respect to the trial judge's conduct of the voir dire examination in conformity with the dictates of Rule 752.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e See also Poole v. State, 295 Md. 167, 453 A.2d 1218 (1983).\n\nII\n\nTichnell contends that this third sentencing proceeding was null and void because the State failed to comply with the notice requirement of Art. 27, § 412 (b). That section provides, inter alia, that a person found guilty of first degree murder must be sentenced to life imprisonment unless\n\n\"the State notified the person in writing at least 30 days prior to trial that it intended to seek a sentence of death, and advised the person of each aggravating circumstance upon which it intended to rely . . . .\"\n\nTichnell timely received the requisite statutory notice before his original trial. He was advised that the State intended to prove the existence of two aggravating circumstances -- that Livengood was a law enforcement officer killed in the performance of his duties and that the murder was committed in furtherance of an escape or an attempt to escape from or evade lawful arrest by a law enforcement officer. Section 412 (b) does not require that the State give additional notice before commencing the capital sentencing proceeding. Plainly, the word \"trial,\" in the context of its usage in § 412 (b), does not encompass a resentencing proceeding.\n\nIII\n\nTichnell maintains that his third sentencing proceeding was barred by the Double Jeopardy Clause of the Fifth Amendment.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e He contends that the trial court's conduct in the second capital sentencing proceeding constituted \"judicial overreaching,\" which barred further resentencing because the trial judge \"intentionally and deliberately directed and required the reading of prior recorded trial testimony to the jury.\"\n\n\"Judicial overreaching\" is significant for purposes of double jeopardy when a mistrial is declared at the behest of the defendant. Generally, a defendant may be reprosecuted if the initial trial resulted in a mistrial on his motion, United States v. Jorn, 400 U.S. 470, 485, 91 S. Ct. 547, 557, 27 L. Ed. 2d 543, 556 (1971); Jourdan v. State, 275 Md. 495, 508, 341 A.2d 388, 396 (1975), the rationale being that the defendant has elected to terminate the \"right to have his trial completed by a particular tribunal.\" See Oregon v. Kennedy, 456 U.S. 667, 672-74, 102 S. Ct. 2083, 2087-88, 72 L. Ed. 2d 416, 422-23 (1982). Where the court engaged in misconduct with the intent to provoke the defendant's motion for a mistrial, retrial could be barred by the double jeopardy clause. Id. at 679, 102 S. Ct. at 2091, 72 L. Ed. 2d at 427. As the Supreme Court recently explained:\n\n\"In such a case, the defendant's valued right to complete his trial before the first jury would be a hollow shell if the inevitable motion for mistrial were held to prevent a later invocation of the bar of double jeopardy . . . .\"\n\nId. at 673, 102 S.Ct. at 2088, 72 L. Ed. 2d at 423.\n\nWhen a defendant's trial is completed and his conviction later reversed on appeal, different rules pertain. With some exceptions, the defendant who successfully challenges his conviction may be retried, under the rationale that \"the defendant wiped the slate clean and the parties may start anew.\" Jones v. State, 288 Md. 618, 625, 420 A.2d 1241, 1244 (1980), cert. denied, 449 U.S. 1115 (1981).\n\nTichnell's second capital sentencing proceeding did not end in a mistrial; rather, the proceeding was completed. While the sentence imposed was later vacated in Tichnell, II, supra, 290 Md. 43, the trial court's conduct did not amount to judicial overreaching. Rather, the trial judge was simply mistaken in his belief that it was essential that the transcript\n\nof testimony in Tichnell's original trial be introduced in evidence so as to permit the sentencing jury to have before it the identical testimony that was produced before the factfinder at the guilt or innocence stage of the proceeding. Manifestly, the court's action was not intended to provoke Tichnell to move for a mistrial. We conclude that nothing in the bar of double jeopardy prevented a third capital sentencing proceeding in Tichnell's case. See Tichnell, II, supra, 290 Md. at 64.\n\nIV\n\nTichnell next contends that the resentencing record in this case does not support the imposition of the death penalty. He argues that the evidence adduced at the resentencing hearing differs in material respects from that produced at his original trial; that it sustains his version of the killing of Deputy Livengood; and that the death sentence imposed upon him must therefore be vacated. Tichnell also maintains that the death sentence imposed upon him constitutes cruel and unusual punishment in violation of the Eighth and Fourteenth Amendments to the Federal Constitution and Article 25 of the Maryland Declaration of Rights. This is particularly so, he claims, because he has been made to suffer through three capital sentencing hearings, each of which resulted in the imposition of a death sentence. Proper consideration of Tichnell's arguments necessitates that we review the pertinent provisions of the Maryland capital sentencing statute, the governing law, and the evidence underlying Tichnell's conviction and sentence.\n\n(A)\n\nSection 412 (b) of the Maryland statute provides that a person found guilty of murder in the first degree must be sentenced to life imprisonment unless the State (1) notifies the accused in writing at least 30 days prior to trial that it intends to seek the death penalty, (2) advises the accused of each \"aggravating circumstance\" upon which it intends to rely and (3) obtains the death penalty in accordance with the provisions of § 413 of the statute. Where the State complies with these prerequisites, and the accused is found guilty of murder in the first degree, § 413 (a) requires that a separate\n\nsentencing hearing be held, either before a jury or before the court, if the defendant waives his right to a jury hearing. Section 413 (c) provides that the following type of evidence is admissible at the sentencing hearing:\n\n\"(i) Evidence relating to any mitigating circumstance listed in subsection (g);\n\n(ii) Evidence relating to any aggravating circumstance listed in subsection (d) of which the State had notified the defendant pursuant to § 412 (b);\n\n(iii) Evidence of any prior criminal convictions, pleas of guilty or nolo contendere, or the absence of such prior convictions or pleas, to the same extent admissible in other sentencing procedures;\n\n(iv) Any presentence investigation report. However, any recommendation as to sentence contained in the report is not admissible; and\n\n(v) Any other evidence that the court deems of probative value and relevant to sentence, provided the defendant is accorded a fair opportunity to rebut any statements.\"\n\nUnder § 413 (d) of the statute, the sentencing authority, either judge or jury, is first enjoined to consider whether, beyond a reasonable doubt, any of ten statutorily delineated aggravating circumstances exist.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e If the sentencing authority\n\ndoes not find, beyond a reasonable doubt, the existence of one or more of the aggravating circumstances, the sentence must be life imprisonment. § 413 (f). If, however, the sentencing authority finds beyond a reasonable doubt the existence of one or more aggravating factors, then it must determine whether, by a preponderance of the evidence, any of eight \"mitigating circumstances\" exist. § 413 (g).\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The\n\nstatute requires that a sentence of life imprisonment be imposed if, by a preponderance of the evidence, the sentencing authority finds that the mitigating circumstances outweigh the aggravating circumstances. § 413 (h) (1) and (3). If the sentencing authority concludes that the mitigating circumstances do not outweigh the aggravating circumstances by a preponderance of the evidence, a sentence of death must be imposed. § 413 (h) (2).\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nAt the conclusion of the evidence at the sentencing hearing, the trial judge is required by § 413 (c) (3) to instruct the jury \"as to the findings it must make in order to determine whether the sentence shall be death or imprisonment for life and the burden of proof applicable to these findings\" in accordance with the governing provisions of § 413.\n\nSection 413 (i) requires that the determination of the sentencing authority must be in writing and, if a jury, be unanimous and signed by the foreman. Section 413 (j) requires the sentencing authority to specify:\n\n\"(1) Which, if any, aggravating circumstances it finds to exist;\n\n(2) Which, if any, mitigating circumstances it finds to exist;\n\n(3) Whether any mitigating circumstances found under subsection (g) outweigh the aggravating circumstances found under subsection (d);\n\n(4) Whether the aggravating circumstances found under subsection (d) are not outweighed by mitigating circumstances under subsection (g); and\n\n(5) The sentence, determined in accordance with subsection (f) or (h).\"\n\nSection 413 (k) requires that the court impose the sentence determined by the jury under § 413 (f) or (h); it further specifies that the court dismiss the jury and impose a sentence of life imprisonment if the jury, within a reasonable time, is unable to agree as to the sentence to be imposed. Section 413 (l) authorizes this Court to adopt rules of procedure to govern the conduct of the capital sentencing proceeding, including any forms to be used by the sentencing authority in making its written findings and determination of sentence.\n\nSection 414 entitled \"Automatic review of death sentences\" requires in subsection (e) that this Court review the imposition of the death penalty on the record before the sentencing authority in order to determine:\n\n\"(1) Whether the sentence of death was imposed under the influence of passion, prejudice, or any other arbitrary factor;\n\n(2) Whether the evidence supports the jury's or court's finding of a statutory aggravating circumstance under § 413 (d);\n\n(3) Whether the evidence supports the jury's or court's finding that the aggravating circumstances are not outweighed by mitigating circumstances; and\n\n(4) Whether the sentence of death is excessive or disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant.\"\n\nWith respect to the \"similar cases\" proportionality review provision of § 414 (e) (4), § 414 (f) (2) requires that this Court \"include in its decision a reference to the similar cases which it considered.\"\n\nSection 414 (f) mandates that this Court either (1) affirm the death sentence, (2) set it aside and remand for a new\n\nsentencing proceeding, or (3) \"[s]et aside the sentence and remand for a modification of the sentence to imprisonment for life.\"\n\nMaryland Rule 772A, adopted by this Court pursuant to § 413 (l) of the statute, prescribes a verdict form for use by the sentencing authority in making its findings and determination. The form tracks the pertinent statutory language of § 413 and directs the sentencing authority to specify, by \"yes\" or \"no\" answer, whether the aggravating and/or mitigating circumstances were established by the evidence.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The verdict form guides the sentencing authority in its final determination of sentence within the formulation of § 413 of the statute. The rule requires that the verdict form be signed by each juror. It requires in subparagraph f that the trial judge complete a report, the detailed content of which the rule prescribes. The report calls for pertinent information pertaining to the accused and the crime, and requires the trial judge to describe the \"facts of offense\" and state his opinion as to whether the death sentence was justified.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e The rule requires that the trial judge send his report to counsel for the parties for comment as to its factual accuracy. Counsel's comments are required to be attached to the trial judge's report; the report must be promptly filed \"with the clerk of the trial court, and in the case of a life sentence with the Clerk of the Court of Appeals.\"\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\n(B)\n\nIn Tichnell I, supra, 287 Md. at 729, we held that Maryland's capital sentencing statute, enacted in 1978, \"on its face, . . . satisfies the requirements of the Eighth and Fourteenth Amendments to the federal constitution, and Art. 25 of the Maryland Declaration of Rights.\" We so concluded after reviewing a number of Supreme Court cases concerning the constitutionality of death penalty statutes, beginning with Furman v. Georgia, 408 U.S. 238, 92 S. Ct. 2726, 33 L. Ed. 2d 346 (1972), and including Gregg v. Georgia, 428 U.S. 153, 96 S. Ct. 2909, 49 L. Ed. 2d 859 (1976); Proffitt v. Florida, 428 U.S. 242, 96 S. Ct. 2960, 49 L. Ed. 2d 913 (1976); and Jurek v. Texas, 428 U.S. 262, 96 S. Ct. 2950, 49 L. Ed. 2d 929 (1976). We noted the holding in Furman, namely, that death sentences administered under statutes which vested trial courts of general jurisdiction with the discretion to sentence a person convicted of first degree murder to either life or death violated the Eighth and Fourteenth Amendments to the Federal Constitution. We further noted that some states, including Maryland, initially misread the holding in Furman to require that a death penalty statute, to be constitutional, had to automatically require imposition of the death penalty upon conviction of a specifically defined and narrowly drawn class of first degree murder. We also noted that in Woodson v. North Carolina, 428 U.S. 280, 96 S. Ct. 2978, 49 L. Ed. 2d 944 (1976), the Supreme Court held that mandatory death penalty statutes were unconstitutional for failure to require the sentencing authority to consider the character and record of the individual offender and the circumstances of the particular offense. Woodson declared that mandatory death penalty statutes impermissibly vested standardless sentencing discretion in juries. 428 U.S. at 302-03.\n\nWe observed in Tichnell I that in Gregg, Proffitt and Jurek, the Supreme Court upheld the death penalty statutes, respectively, of Georgia, Florida and Texas, all of which involved the constitutionality of so-called \"guided discretion\" death penalty statutes. In Gregg, the Court's\n\nplurality opinion upheld the constitutionality of such statutes against Eighth and Fourteenth Amendment attack. The Court there construed Furman as holding that the death penalty could not be imposed under sentencing procedures that created a substantial risk that the penalty would be inflicted in an arbitrary and capricious manner; it said:\n\n\"Furman mandates that where discretion is afforded a sentencing body on a matter so grave as the determination of whether a human life should be taken or spared, that discretion must be suitably directed and limited so as to minimize the risk of wholly arbitrary and capricious action.\" 428 U.S. at 189.\n\nWe further noted in Tichnell I, supra, 287 Md. at 723, that the death penalty statutes upheld in Gregg, Proffitt and Jurek each contained three provisions which guarded against the concerns raised in Furman. First, each of the new discretionary statutes provided for a bifurcated trial so that guilt and punishment would be separately determined. Second, imposition of the death penalty was restricted to cases in which certain aggravating circumstances were established. The sentencing authority was also required to consider the existence of mitigating circumstances. The Court stated in Jurek, 428 U.S. at 274, that this type of provision\n\n\"guides and focuses the [sentencing authority's] objective consideration of the particularized circumstances of the individual offense and the individual offender before it can impose a sentence of death.\"\n\nFinally, the statutes that were upheld provided for expedited appellate review of the death penalty statute as a check against the random or arbitrary imposition of the death penalty.\n\nThe Maryland statute complies with the three general methods of guiding the discretion vested in the sentencing authority, as required by the Supreme Court cases. We said in Tichnell I, supra, 287 Md. at 728-29:\n\n\"The [Maryland] statute provides a bifurcated trial procedure, and the imposition of the death penalty is limited to cases in which the sentencing authority finds at least one aggravating circumstance. The sentencing authority is required to consider the existence of mitigating circumstances. A sentence of death may be imposed only if the mitigating circumstances do not outweigh the aggravating circumstances. Although the sentencing authority still has discretion under the statute, it is guided by clear and objective standards. See Gregg v. Georgia, supra, 428 U.S. at 197-98.\n\n\"Moreover, the statutory scheme incorporates the third major safeguard against arbitrariness, i.e., the expedited automatic appeal of all death sentences to this Court. As indicated, we are enjoined by statute to review each sentence of death and determine whether it was arbitrarily imposed, whether the evidence supports the finding of the existence of an aggravating circumstance and whether it is not outweighed by mitigating circumstances and, finally, whether the sentence is disproportionate to sentences imposed in similar cases.\"\n\nMore recently, in Johnson v. State, 292 Md. 405, 437, 439 A.2d 542, 560 (1982), we observed that § 413 of Maryland's capital sentencing statute guides the discretion vested in the sentencing authority by setting forth clear and objective standards to insure that the death penalty is not inflicted in an arbitrary and capricious manner in violation of constitutional principles.\n\nV\n\nWe now proceed to consider the imposition of the death penalty in this case and to determine whether, under § 414 (e) of the statute, it was imposed (1) under the influence of passion, prejudice, or any other arbitrary factor; (2) whether\n\nthe evidence supports the jury's finding of a statutory aggravating circumstance; (3) whether the evidence supports the jury's finding that the aggravating circumstances were not outweighed by mitigating circumstances; and (4) whether the death sentence was \"excessive or disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant.\"\n\nThe record of the resentencing hearing discloses, as did the evidence at Tichnell's original trial, that on January 18, 1979, at approximately 5:25 a.m., Tichnell and a confederate, Oscar Recek, broke into Davidson's store in Oakland, Maryland, for the purpose of stealing handguns. The breaking triggered a silent alarm in the nearby sheriff's office and Deputy Sheriff David Livengood, accompanied by his 108-pound K-9 dog, promptly responded to the scene. The store, located between parallel Routes 219 and 4, had its entrance on Route 219; Route 4 was approximately 252 feet from the rear of the store. Sometime between 5:28 a.m. and 5:31 a.m., Livengood reported over his police radio that he was proceeding to investigate a suspect vehicle. At approximately 5:37 a.m., the police received a call from James Wolfe, who lived behind Davidson's store; he reported hearing shots. Shortly thereafter, the police arrived at the scene and discovered Livengood's body lying face down at the northern edge of Route 4. He had been shot seven times and was dead. His service revolver with three live and three spent cartridges was located beneath his body. A pair of handcuffs was found in the road about 23 feet from the deputy's body. Livengood's police cruiser was missing. His K-9 dog was found lying off of Route 4 about 26 feet from Livengood's body; the dog had been stabbed in the left shoulder region and died shortly after the arrival of the police. A car belonging to Tichnell was found in a snow-filled ditch partially off of Route 4; it was facing south and was about 40 feet from the deputy's body. Two bullet holes were observed in Tichnell's car, one at the left front door near the door lock and the other at the left front area of the doorpost. A 9 millimeter Browning semiautomatic revolver owned by\n\nTichnell and later identified as the homicide weapon was found in the front seat of Tichnell's abandoned vehicle. The gun contained seven empty shells and seven loaded cartridges; two of the spent cartridges were found on the floor of Tichnell's car behind the driver's seat. The other five casings were scattered about Route 4 in a cluster near the deputy's body.\n\nThe State's witness Wolfe testified that just prior to the shooting he observed a car facing north stopped on Route 4 with its headlights on. He also observed a dog pacing back and fourth in front of the car's headlights. Wolfe said the dog disappeared after about 10 seconds and that 15 seconds later he heard a burst of shots, followed by a split second pause, the sound of tires spinning and a simultaneous second burst of shots. Wolfe testified that he then saw a second car, without headlights, move about 20 to 30 feet in a southerly direction on Route 4, after which he heard a \"thump.\" Shortly thereafter, Wolfe noted the vehicle with the headlights leave the area.\n\nTichnell and Recek were arrested on the morning of the crime in West Virginia; they were driving a vehicle which Tichnell had commandeered after wrecking the deputy's cruiser in the course of their flight from the crime scene. In the vehicle was a bag containing the guns stolen from Davidson's store and a samurai sword with dog blood and hair on it. Also in the car was a shoulder holster capable of accommodating a Browning semiautomatic revolver; the holster was stained with blood of a type matching Tichnell's. Tichnell had a gun shot wound in his right shoulder, a laceration over his right eye and a crushed tooth. On the evening of his arrest, Tichnell gave the West Virginia state police authorities a statement admitting that he and Recek had broken into Davidson's store and stolen some guns. He said that they remained in the store about 3 to 5 minutes and were returning to their car when Recek said that he had lost the loaded .38 Smith and Wesson revolver which Tichnell had given him just before they broke into the store. Because this was the same gun that Tichnell had stolen 3 days earlier\n\nfrom Davidson's store, and because it contained his fingerprints, Tichnell directed Recek to retrace his steps and find the weapon. Rather than risk detection, Tichnell said that he drove around the Oakland area to give Recek time to find the lost gun. Tichnell told the police that he returned to Route 4, moving in a southerly direction, to pick up Recek when he saw a police cruiser facing north blocking his lane. At this moment, Tichnell said that his car headlights, which had been defective for some period of time, went out. He observed that an officer, gun in hand, had apprehended Recek and had him lying on the ground. Tichnell said he stopped his car about 15 to 20 feet from the police car and got out to repair his headlights. At this time, the officer pointed his weapon at him and told him to lie down on the road. Tichnell complied and he heard the deputy order his K-9 dog to watch him. The dog stood over Tichnell and as he looked up the dog bit him on the side of his eye and through the inside of his mouth. Tichnell said that he screamed out with pain, became hysterical, and started running around in a circle to avoid the dog. Believing that the dog had torn his eye out, Tichnell ran to his car to get a medical aid kit which he kept in the back seat. At this point Tichnell heard the deputy order the dog to watch Recek; the deputy then followed Tichnell to his car, spun him around and placed a gun in his face. At this time, the door on the driver's side of Tichnell's two-door vehicle was open. Tichnell said he moved the deputy's weapon from his face and requested that the officer permit him to tend to his wounded eye. Tichnell stated that the deputy then put his gun against his (Tichnell's) shoulder and shot him from a distance of about a foot and a half. Tichnell said that the shot knocked him into his car and that he grabbed the barrel of the deputy's gun as he fell. Tichnell said that the deputy then tried to bring his gun down for another shot. While still holding the deputy's gun, Tichnell said he reached for his own gun which he kept under the front seat of his car. As the scuffle continued, the deputy fired again, the bullet narrowly missing the top of Tichnell's head. Tichnell stated that because he thought the deputy was going to shoot him again, he fired\n\nfour to five shots at the deputy at point-blank range. He said that the first shot struck the deputy in the head, and he was certain that he was dead.\n\nTichnell acknowledged in his statement that he and Recek attempted to leave the scene in Tichnell's car. After moving about 30 or 40 feet, Tichnell said that the car slid on the ice and went off the road into a ditch. Realizing that his car was stuck, Tichnell decided to take the deputy's cruiser, but found the dog sitting in the front seat. As Recek attempted to get in the open door of the car, the dog lunged at him. Tichnell thereupon removed his samurai sword from his car and stabbed the dog behind its left shoulder; when he withdrew the sword, the dog rolled out of the car. Tichnell said that he and Recek then fled in the deputy's cruiser but subsequently wrecked it. Thereafter, he and Recek obtained another vehicle and continued their flight into West Virginia. Tichnell's statement was introduced in evidence before the sentencing jury.\n\nOther evidence adduced by the State showed that of the seven shots fired into the deputy's body two were fatal, one in the lower back and the other in the back of the head. No powder burns were found on the clothing or upon the wounds of Tichnell or Livengood. The State produced testimony that had the shots been fired at a range less than 3 feet, burned powder residue would have been found on the clothing or wounds of both the deputy and Tichnell. The expert witness concluded that the shots were fired at a distance greater than 3 feet. Evidence produced by the State that Tichnell's bloody shoulder holster was recovered at the time of his arrest was intended to establish that Tichnell was wearing the holster at the time he was shot in the shoulder and carried his Browning revolver in it when he broke into Davidson's store. There was evidence that Tichnell's blood type was found on broken glass fragments from the windshield of the deputy's car, suggesting that the lacerations over Tichnell's eye may have been received at the time Tichnell wrecked the deputy's cruiser. According to one of the arresting troopers, when Tichnell was first arrested he\n\nattributed the cut on his eye to the car accident and did not mention a dog bite. Evidence was also adduced to show that in view of the time involved between the break-in at the store, and the shooting of the deputy, Tichnell could not have traversed the 2.3 mile route around Oakland which he said he had taken.\n\nRecek, who was 32 years old at the time of the crime, testified on Tichnell's behalf. In the course of his testimony, he acknowledged entering Davidson's store with a loaded gun given to him by Tichnell. He said that Tichnell told him that because of the silent alarm at the store, it was critical that they be out of the store in less than 5 minutes. He acknowledged returning to the store at Tichnell's direction to look for the lost gun, after which he proceeded toward Route 4. He was in the middle of the field behind Davidson's store, he said, when he saw the taillights of Tichnell's car on Route 4, being followed by a police cruiser. Recek testified that the police car stopped when the officer saw him in the field; that it then turned around and that, as he did so, Tichnell circled the area in his vehicle. Recek said that he was about 10 feet from Route 4 when the deputy, accompanied by his K-9 dog, with his gun in hand and handcuffs out, told him he was under arrest and to lie on the ground. After obeying this command, Recek said he observed Tichnell's car on Route 4 with its headlights blinking on and off. He testified that he saw Tichnell approach the deputy and speak with him; that the deputy ordered Tichnell to lie on the ground and directed his K-9 dog to guard him; that shortly thereafter, Tichnell screamed out that the dog had bit him in the eye and that he was blind; that Tichnell shouted that he was going to his car to get a medical kit; and that at this point Livengood ordered the K-9 dog to leave Tichnell and to guard Recek. From his position on the ground, with the dog barking in his face, Recek said he caught only a \"glimpse\" of what next occurred; that Livengood and Tichnell left his sight and he next heard a burst of shots as the two men approached the side of Tichnell's car, after which he observed Livengood\n\n\"back tracking\" and fall on the ground. Recek said that immediately after the shooting Tichnell said that he \"outdrew\" the deputy; that it was \"He or me\"; that he had \"No choice\"; and that, in addition, he had to kill the dog \"or he would have got me.\"\n\nRecek acknowledged that he had been convicted of the first degree felony murder of Livengood in a separate trial and sentenced to life imprisonment. At the time of Tichnell's original trial and two subsequent sentencing hearings, Recek's case was pending and he did not testify in any of these proceedings.\n\nTichnell's testimony before the sentencing jury was generally consistent with his statement to the police on the evening of his arrest. Additionally, he testified that he knew that a silent alarm had been triggered when he broke into Davidson's store and also knew that an officer would be on his way to the scene within from 2 to 5 minutes. Tichnell testified that while he was unarmed at the time he entered the store, he had given Recek a loaded revolver to carry into the store. He testified that his shoulder holster was under the seat of his car at the time of the shooting; that after the shooting he put his Browning revolver in the holster with the intention of taking it with him in the deputy's car as he fled the scene; that the gun must have slipped out of the holster, remaining in Tichnell's abandoned car; that he nevertheless wore the holster without his gun after the shooting occurred. At another point, Tichnell testified that the muzzle of Livengood's gun was pressed against his shoulder when Livengood fired the first shot and that the deputy's other shots were fired from a distance of 6 to 8 inches.\n\nAt the time of the crime, Tichnell was 32 years of age. He was a high school graduate, a divorced father of one child, had no prior criminal record, had served in the Army for several years, had worked at a steel mill for a number of years but had been unemployed for over one year at the time of the crime.\n\nTo refute the State's expert testimony that the shots were fired at a distance greater than 3 feet, Tichnell produced an expert witness who said that he found a single grain of powder on the coat which Tichnell was wearing at the time of the shooting, indicating that the shots had been fired at point-blank range, as Tichnell had claimed.\n\nAt the conclusion of the evidence, Judge Bowen gave detailed instructions to the jury as required by § 413 (c) (3) of the statute. The jury concluded that the two aggravating circumstances upon which the State relied had been established and that the only mitigating circumstance was that Tichnell had not previously been convicted of a crime of violence. Tichnell was then sentenced to death in accordance with the provisions of the statute.\n\n(A)\n\nTichnell does not contend, nor do we find from the record, that the death sentence was imposed upon him under the influence of passion, prejudice or any other arbitrary factor in violation of § 414 (e) (1). Moreover, as required by § 414 (e) (2), we have considered, and conclude, that the evidence before the sentencing authority supports its finding of two statutory aggravating circumstances, i.e., that Livengood was a law enforcement officer who was murdered while in the performance of his duties, and that Tichnell committed the murder in furtherance of an escape or an attempt to evade lawful custody or arrest by a law enforcement officer. We further conclude from our review of the case, as required by § 414 (e) (3), that the aggravating circumstances are not outweighed by the single mitigating circumstance that Tichnell had not previously been convicted of a crime of violence, as defined in § 413 (g) (1).\n\n(B)\n\n(Proportionality Review)\n\nWe observed in Tichnell I, supra, 287 Md. at 738-39, that the language of § 414 (e) (4) of the Maryland statute is virtually identical to, and was patterned after, the proportionality review provisions of the Georgia death penalty statute. The Supreme Court in Gregg noted with approval that the Georgia provision functioned as a check against the arbitrary imposition of the death penalty. Gregg, supra, 428 U.S. at 206. As summarized in Gregg, the proportionality review provision of the Georgia statute:\n\n\"substantially eliminates the possibility that a person will be sentenced to die by the action of an aberrant jury. If a time comes when juries generally do not impose the death sentence in a certain kind of murder case, the appellate review procedures assure that no defendant convicted under such circumstances will suffer a sentence of death.\" Id. at 206.\n\nIt was argued in Gregg that the Georgia proportionality review provisions were inadequate because \"nonappealed capital convictions where a life sentence is imposed and cases involving homicides where a capital conviction is not obtained are not included in the group of cases which the Supreme Court of Georgia uses for comparative purposes.\" Id. at 204 n. 56. In answer to this contention, the Supreme Court simply noted that the Supreme Court of Georgia is authorized to consider such cases and does consider appealed murder cases where a life sentence has been imposed. It concluded: \"We do not think that the petitioner's argument establishes that the Georgia court's review process is ineffective.\" Id. at 204 n. 56.\n\nThe Supreme Court's decisions in Proffitt and Jurek indicate that the absence of a specific statutory provision for proportionality review will not render a death penalty statute constitutionally infirm. In Proffitt, the Court said:\n\n\"The statute provides for automatic review by the Supreme Court of Florida of all cases in which a death sentence has been imposed. . . . The law differs from that of Georgia in that it does not require the court to conduct any specific form of review. Since, however, the trial judge must justify the imposition of a death sentence with written findings, meaningful appellate review of each such sentence is made possible, and the Supreme Court of Florida, like its Georgia counterpart, considers its function to be to '[guarantee] that the [aggravating and mitigating] reasons present in one case will reach a similar result to that reached under similar circumstances in another case. . . . If a defendant is sentenced to die, this Court can review that case in light of the other decisions and determine whether or not the punishment is too great.' State v. Dixon, 283 So.2d 1, 10 (1973).\n\nOn their face these procedures, like those used in Georgia, appear to meet the constitutional deficiencies identified in Furman.\"\n\n428 U.S. at 250-51.\n\nThe review process was attacked on the ground that \"the role of the Supreme Court of Florida in reviewing death sentences is necessarily subjective and unpredictable.\" Id. at 258. Rejecting this contention, the Court stated:\n\n\"While it may be true that that court has not chosen to formulate a rigid objective test as its standard of review for all cases, it does not follow that the appellate review process is ineffective or arbitrary. In fact, it is apparent that the Florida court has undertaken responsibility to perform its function of death sentence review with a maximum of rationality and consistency. For example, it has several times compared the circumstances of a case under review with those of previous cases in which it has assessed the imposition of death sentences. {PA}\n\nPage 459} See, e.g., Alford v. State, 307 So.2d, at 445; Alvord v. State, 322 So.2d, at 540-541. By following this procedure the Florida court has in effect adopted the type of proportionality review mandated by the Georgia statute. Cf. Gregg v. Georgia, ante, at 204-206. And any suggestion that the Florida court engages in only cursory or rubber-stamp review of death penalty cases is totally controverted by the fact that it has vacated over one-third of the death sentences that have come before it.\" Id. at 258-59.\n\nThe petitioner also maintained that\n\n\"since the Florida Court does not review sentences of life imprisonment imposed in capital cases or sentences imposed in cases where a capital crime was charged but where the jury convicted of a lesser offense, it will have an unbalanced view of the way that the typical jury treats a murder case and it will affirm death sentences under circumstances where the vast majority of judges would have imposed a sentence of life imprisonment.\" Id. at 259 n. 16.\n\nThe Court also rejected this argument, stating:\n\n\"As we noted in Gregg v. Georgia, ante, at 204 n. 56, this problem is not sufficient to raise a serious risk that the state capital-sentencing system will result in arbitrary and capricious imposition of the death penalty.\" 428 U.S. at 259 n. 16.\n\nThe Texas statute upheld in Jurek provided for an automatic appeal, but also lacked an express provision for proportionality review. The Court nevertheless assumed that death sentences were subject to this type of review, stating:\n\n\"By providing prompt judicial review of the jury's decision in a court with statewide jurisdiction, Texas has provided a means to promote the evenhanded, rational, and consistent imposition of\n\ndeath sentences under law. Because this system serves to assure that sentences of death will not be 'wantonly' or 'freakishly' imposed, it does not violate the Constitution.\" 428 U.S. at 276.\n\nIt is thus clear that the essential principle underlying the varieties of proportionality review upheld in Gregg, Proffitt and Jurek is, in short, the guarantee that death sentences will be imposed in a reasonably consistent manner. Tichnell I, supra, 287 Md. at 741.\n\nWith these foundation principles in mind, the Court sua sponte asked the parties in this case to address themselves to a number of additional issues, the first of which was:\n\n\"Whether the Court of Appeals, in determining whether the imposition of the death sentence under . . . sec. 414 (e) (4) is 'excessive or disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant,' is (a) limited to considering only those first degree murder prosecutions where the prosecutor actually sought the imposition of the death penalty or (b) required to consider all first degree murder prosecutions eligible under sec. 413 for imposition of the death sentence, without regard to whether the prosecutor actually sought the imposition of the death penalty?\"\n\nAdopting arguments advanced by the Public Defender in three death penalty cases now pending before us,\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Tichnell maintains that the pool of cases under § 414 (e) (4) from which \"similar cases\" are to be selected for purposes of proportionality review was intended by the legislature to include all cases in which the prosecutor sought the death penalty, whether it was imposed or not. Also to be included, Tichnell maintains, are all other death-eligible murder\n\ncases in which the prosecutor could have, but did not seek the death penalty.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e To restrict the relevant inventory to cases in which the death penalty was actually sought, it is argued, would skew the proportionality review pool by excluding from it a number of truly similar cases and, conversely, by including in it cases which, in large urban jurisdictions like Baltimore City, would not have been prosecuted as capital offenses. Tichnell further suggests that even murders which cannot be punished capitally under § 413 may be similar to the death sentence under review and are, therefore, within the formulation of § 414 (e) (4).\n\nThe State maintains that the relevant inventory of cases under § 414 (e) (4) includes only those in which a capital sentencing proceeding was actually conducted, whether the sentence imposed was life or death. In this regard, the State submits that because the aim of proportionality review is to ascertain what other capital sentencing authorities have done with similar capital murder offenses, the only cases that could be deemed similar under § 414 (e) (4) are those in which imposition of the death penalty was properly before the sentencing authority for determination. The State urges that it is improper to use every first degree murder case as a basis for comparison because cases in which no qualifying aggravating circumstances under § 413 are present could not be prosecuted capitally and are, therefore, patently dissimilar. Moreover, the State argues that cases in which the death penalty was not sought, despite the presence of a qualifying aggravating factor under § 413, are not similar because the sentencing authority never considered whether the death sentence should be imposed.\n\nTwenty-five states have statutes or rules containing a proportionality review provision identical to or closely paralleling\n\n§ 414 (e) (4) of the Maryland statute.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Of these, three states limit their pool of cases for comparative review to capital offenses in which the death penalty was actually imposed. See Gall v. Com., 607 S.W.2d 97 (Ky. 1980); King v. State, 421 So.2d 1009 (Miss. 1982); State v. Copeland, S.C., 300 S.E.2d 63 (1982). Eight states by case law appear to restrict the universe of cases eligible for proportionality review to similar capital murder prosecutions, whether the penalty imposed was life or death. See Georgia: Horton v. State, 249 Ga. 871, 295 S.E.2d 281 (1982); Hill v. State, 250 Ga. 277, 295 S.E.2d 518 (1982); Ross v. State, 233 Ga. 361, 211 S.E.2d 356 (1974);\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Missouri: State v. Trimble, 638 S.W.2d 726 (1982); State v. Baker, 636 S.W.2d 912 (1982); State v. Bolder, 635 S.W.2d 673 (1982); State v. McIlvoy, 629 S.W.2d 333 (1982); State v. Mercer, 618 S.W.2d 1 (1981); Montana: State v. Coleman, 605 P.2d 1000 (1979), rehearing denied, 605 P.2d 1051; Nebraska: State v. Moore, 210 Neb. 457, 316 N.W.2d 33 (1982); State v. Williams, 205 Neb. 56, 287 N.W.2d 18 (1979); Nevada: Deutscher v. State, 95 Nev. 669, 601 P.2d 407 (1979); North Carolina: State v. Williams, 308 N.C. 47, 301 S.E.2d 335 (1983); State v. McDougall, 308 N.C. 1, 301 S.E.2d 308 (1983); Oklahoma: Parks v. State, 651 P.2d 686 (Crim. App. 1982); Jones v. State, 648 P.2d 1251 (Crim. App. 1982); Virginia: Clanton v. Com., 223 Va. 41, 286 S.E.2d 172 (1982); Whitley v. Com., 223 Va. 66, 286 S.E.2d 162 (1982); Stamper v. Com., 220 Va. 260, 257 S.E.2d 808 (1979); Coppola v. Com., 220 Va. 243, 257 S.E.2d 797 (1979). Washington, by statute, restricts its proportionality review to similar capital cases in which the sentencing authority considered the imposition of the death penalty.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Tennessee, by statute and rule, appears to\n\nfollow the same course.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e The interpretation of the proportionality review provisions of the Alabama and Louisiana statutes is unclear. See, e.g., Beck v. State, 396 So.2d 645 (Ala. 1981) and State v. Martin, 376 So.2d 300 (La. 1979). Ten other states having a provision like § 414 (e) (4) have no case law articulating the relevant universe of cases for purposes of proportionality review.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nThe comparative review provision of Delaware's statute differs from § 414 (e) (4) in that it provides for proportionality review to determine whether, in light of the totality of the aggravating and mitigating circumstances, and other factors, the death penalty was disproportionate to the penalty imposed \"in similar cases arising under this section.\"\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e (Emphasis supplied.) See State v. White, 395 A.2d 1082 (Del. 1978).\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nA number of states have death penalty statutes without an express proportionality review provision. These jurisdictions nevertheless engage in various modes of comparative review of death sentences. Arizona, Florida, Illinois and Indiana appear to limit their proportionality pool of similar cases to capital murder offenses, whether the sentence imposed was life or death. State v. Ortiz, 131 Ariz. 195, 639 P.2d 1020 (1981); State v. Richmond, 114 Ariz. 186, 560 P.2d 41 (1976); Brown v. Wainwright, 392 So.2d 1327 (Fla. 1981); McCaskill v. State, 344 So.2d 1276 (Fla. 1977); People v. Brownell, 79 Ill.2d 508, 404 N.E.2d 181 (1980); People v. Glecker, 82 Ill.2d 145, 411 N.E.2d 849 (1980); Williams v. State, 430 N.E.2d 759 (Ind. 1982); Judy v. State, 416 N.E.2d 95 (Ind. 1981). Arkansas restricts its inventory to cases in which the death penalty was actually imposed. See Sumlin v. State, 273 Ark. 185, 617 S.W.2d 372 (1981); Collins v. State, 261 Ark. 195, 548 S.W.2d 106 (1977). California's situation is more fluid; it studies various aspects of each death sentence to assure that it is imposed in an\n\neven-handed manner and that the crime is not punished more severely than more serious offenses. See People v. Jackson, 28 Cal.3rd 264, 168 Cal. Rptr. 603, 618 P.2d 149 (1980); People v. Frierson, 25 Cal.3rd 142, 158 Cal. Rptr. 281, 599 P.2d 587 (1979). See also Harris v. Pulley, 692 F.2d 1189 (9th Cir. 1982), cert. granted, U.S. (1983). Texas and Utah's proportionality review procedures appear to be similar to those followed in California. See Jurek v. Texas, supra; Roney v. State, 632 S.W.2d 598 (Tex. Cr. 1982); State v. Pierre, 572 P.2d 1338 (Utah, 1977).\n\nConsidering the purpose of proportionality review in death sentence cases, the language of § 414 (e) (4), the law in other jurisdictions with proportionality review provisions like our own, and the views expressed by legal commentators,\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e we conclude that the legislatively intended inventory of cases from which \"similar cases\" are to be culled encompasses only those first degree murder cases in which the State sought the death penalty under § 413, whether it was imposed or not. This interpretation of § 414 (e) (4) is consistent with the implementing provisions of Maryland Rule 772A which requires, for purposes of proportionality review, that trial judges file detailed informational reports only in such cases.\n\nThe focus of § 414 (e) (4) is upon capital cases in which the sentencing authority determined whether to impose a life or death sentence; the subsection aims to assure that upon consideration of both the crime and the defendant the\n\naggravating and mitigating circumstances present in one capital case will lead to a result similar to that reached under similar circumstances in another capital case, thus identifying the aberrant sentence and avoiding its ultimate imposition. This, of course, is the constitutional purpose of proportionality review as articulated in Gregg and Proffitt and as to which we think the General Assembly intended to subscribe in enacting § 414 (e) (4). No case is potentially similar within the contemplation of the statute, therefore, unless the death penalty was an authorized punishment. Thus, § 414 (e) (4) does not require a comparative review of capital cases in which the sentencing authority considered the imposition of the death penalty with non-capital cases in which it did not; indeed, such a comparison would not be of \"similar cases.\"\n\nAt our direction, the parties next considered the question whether the pool of cases available for proportionality review under § 414 (e) (4), as we have defined it, is so limited as to render that section violative of the state or federal constitutions. As we have already observed, the Supreme Court in Gregg and Proffitt indicated that the comparative review of death sentences required by the constitution need not include nonappealed capital cases where a life sentence was imposed, homicide cases where a capital conviction was not obtained, or those in which the defendant was convicted of a lesser offense. Implicit in these Supreme Court cases is the conclusion that to include in the relevant inventory of cases only those in which the death penalty was sought does not violate the due process or cruel and unusual punishment provisions of the federal constitution. The cases are generally in accord. See Gray v. Lucas, 677 F.2d 1086 (5th Cir. 1982); Ross v. State, 233 Ga. 361, 211 S.E.2d 356 (1974), cert. denied, 428 U.S. 910 (1976); Williams v. State, 430 N.E.2d 759 (Ind.), appeal dismissed, 103 S. Ct. 33 (1982); State v. Bolder, 635 S.W.2d 673 (Mo. 1982), cert. denied, 103 S. Ct. 770 (1983); State v. Williams, 205 Neb. 56, 287 N.W.2d 18 (1979), cert. denied, 449 U.S. 891 (1980); State v. Williams, 308 N.C. 47, 301 S.E.2d 335 (1983); State v. Page 466} Copeland, S.C. , 300 S.E.2d 63 (1982), cert. denied, 103 S. Ct. 1802 (1983); State v. Melson, 638 S.W.2d 342 (Tenn. 1982). Nothing in the Maryland Constitution requires a different result. In so concluding, we do not preclude any defendant whose death sentence is under appellate review from presenting argument, with relevant facts, that designated non-capital murder cases are similar to the case then under scrutiny and should be taken into account in the exercise of our proportionality review function.\n\nAlso at our direction the parties briefed and argued two other questions: Whether the relevant inventory of similar cases is (1) limited to those decided under constitutional death penalty statutes and (2) restricted to cases arising in Maryland. We conclude, as we intimated in Tichnell I, supra, 287 Md. at 742 and cases there cited, that the better rule is to restrict the comparative analysis to cases decided under constitutional death penalty statutes and to those decided under our own State law.\n\nFinally, we directed that the parties inform us as to the factors or criteria governing proportionality review in other jurisdictions having death penalty statutes. The question, the parties suggest, and we agree, does not admit of a definitive response. In general, the proportionality review function is conducted by other jurisdictions, as it will be in Maryland, in accordance with the fundamental constitutional principle of avoiding the arbitrary or capricious imposition of the death penalty by affording similar treatment to similar capital cases, considering both the crime and the defendant.\n\nVI\n\n(The Death Sentence In This Case)\n\nHaving exercised our constitutionally mandated proportionality review function, we conclude that the death sentence imposed upon Tichnell was neither excessive nor disproportionate to the penalty imposed in similar cases in Maryland, considering both the crime and the defendant.\n\nThe wilful, deliberate and premeditated murder of a police officer while in the performance of his duties has long been viewed as an especially grievous crime. In Roberts v. Louisiana, 431 U.S. 633, 636, 97 S. Ct. 1993, 52 L. Ed. 2d 637 (1977), the Supreme Court said: \"To be sure, the fact that a murder victim was a police officer performing his regular duties may be regarded as an aggravating circumstance [in death penalty statutes].\"\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Such a killing constitutes an assault on society itself for, as stated in Roberts, at 636, \"There is a special interest in affording protection to these public servants who regularly must risk their lives in order to guard the safety of other persons and property.\"\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nThat Tichnell had not previously been convicted of a crime of violence was a mitigating circumstance in his favor; indeed, it was the single mitigating factor found by the sentencing jury which concluded that it did not outweigh the two aggravating factors present in the case. Manifestly, the sentencing authority rejected Tichnell's self-defense version of the killing -- a version given little more than lukewarm support by the testimony of Recek. The evidence showed that Tichnell was a mature man, that he was armed when he came to the crime scene, and fully expected that the deputy would respond promptly to the silent alarm. From its findings, it is readily apparent that the sentencing jury believed that the killing of Deputy Livengood was intentional and in furtherance of Tichnell's purpose to avoid apprehension. That several of the fatal shots were fired into the deputy's back may have suggested to the jury that Tichnell ambushed the officer from behind while he was in the process of apprehending Recek.\n\nSince the enactment of Maryland's death penalty statute in 1978, to the present time, forty-eight capital sentencing proceedings have been conducted in seventeen of the State's twenty-four circuit courts, involving forty-one different defendants.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e See Appendix A. While some of the cases involved multiple aggravating circumstances, the primary aggravating factor in a number of cases was that the murder was committed in the course of a robbery. Other cases involved murders committed in the course of a rape or sexual offense in the first degree; one case involved murder committed in the performance of an arson. Two cases involved contract murders. The aggravating circumstance in still other cases was that the defendant committed more than one first degree murder arising out of the same incident. Four cases charged, as aggravating circumstances, that a police officer was murdered while in the performance of his duties and in furtherance of an escape, or attempt to escape from or evade the officer's lawful apprehension. In other cases, the aggravating circumstance was that the victim was a hostage taken in the course of a kidnapping.\n\nOf the sentencing proceedings in these cases, twenty-eight resulted in the imposition of a life sentence, either by determination of the sentencing authority, by a deadlocked jury, or because of the inability of the jury to agree on a verdict within a reasonable time. See § 413 (k). Twenty capital sentencing proceedings, involving fifteen different defendants, resulted in the imposition of the death penalty. Of these, the Court has vacated the death penalty in nine proceedings because of error committed either at the trial stage of the proceedings or because of errors committed in the capital sentencing hearing; these cases were remanded for a new sentencing hearing. Of the remaining eleven cases, one was terminated by the suicide of the defendant. In another case, the trial judge vacated the death sentence and ordered\n\na new sentencing hearing. In addition to Tichnell III, eight cases are now pending before us on appeal.\n\nIn the process of our proportionality review in this case, we reviewed the Rule 772A trial judge's report in each of the capital sentencing proceedings and have selected five which we deem to be \"similar\" within the contemplation of § 414 (e) (4).\n\nOscar Recek: Recek was charged with capital murder. The State relied upon the same two aggravating circumstances that were present in Tichnell's case. At his trial, Recek testified essentially as he did at Tichnell's third sentencing hearing. He also introduced Tichnell's trial testimony as well as Tichnell's confessions, all of which indicated that it was Tichnell, and not Recek, who shot and killed the deputy.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e The jury found Recek guilty of felony murder. At the sentencing hearing the jury found one aggravating circumstance to exist -- that the murder was of a police officer in the performance of his duties. § 413 (d) (1). It did not find that, as to Recek, the murder was committed in furtherance of an escape or attempt to escape or evade lawful custody or arrest by a police officer. § 413 (d) (3). The jury found one mitigating circumstance -- that Recek's act was not the sole proximate cause of the deputy's death. § 413 (g) (6). The jury imposed a life sentence.\n\nHarlow Sails: The defendant, age 21 at the time of the offense, was convicted of premeditated capital murder of an off duty police officer in the course of an armed robbery. The State relied upon three aggravating circumstances: that the murder was of a law enforcement officer in the performance of his duties; that it was committed in furtherance of an escape or attempt to escape from or evade the lawful apprehension of a police officer; and that the murder was committed in the course of a robbery. § 413 (d) (1), (3), and (10). The evidence indicated that the officer, who was not in\n\nuniform, attempted to apprehend Sails and several confederates in the course of an armed robbery, during which Sails shot the officer to death in an exchange of gunfire. The evidence indicated that Sails did not know that the victim was a police officer. The sentencing jury found that all three aggravating circumstances relied upon by the State had been established. By way of mitigating circumstances, it found that Sails had no previous record of committing a crime of violence; that the murder was committed while Sails' capacity to appreciate the criminality of his conduct or to conform his conduct to requirements of law was substantially impaired as a result of mental incapacity, mental disorder, emotional disturbance or intoxication; that it was unlikely that Sails would engage in further criminal activity that would constitute a continuing threat to society; and that other specified mitigating circumstances existed. § 413 (g) (1), (4), (7), and (8).\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e The jury imposed a life sentence.\n\nJames Calhoun: The defendant, age 28 at the time of the crime, was convicted of the premeditated first degree murder of a Montgomery County police officer who had responded to a security alarm at a mercantile establishment. The officer, in company with the assistant manager of the store, and a representative of the burglar alarm system, entered a room inside the store where Calhoun, and an accomplice, had concealed themselves. Calhoun pressed a gun against the officer's head and shot him to death. Calhoun's accomplice, Curtis Monroe, shot and killed the alarm system representative and wounded the assistant manager. Calhoun and Monroe fled after taking money from the store. The jury determined that the three aggravating circumstances charged by the State had been proved (the same aggravating circumstances as were relied upon in the Sails case). The jury found one mitigating circumstance under § 413 (g) (8), {PA}\n\nPage 471} i.e., that Calhoun's background was such that he was never integrated into society and was unable to conform with its norms and moral values. The jury imposed a death sentence.\n\nCurtis Monroe: The defendant, age 24 at the time of the offense, was convicted of the premeditated murder of the burglar alarm technician. The court, as the sentencing authority, found that the murder was committed in the course of a robbery. § 413 (d) (10). As mitigating circumstances, the court found it unlikely that the defendant would engage in further criminal activity that would constitute a continuing threat to society. § 413 (g) (7). The court also found as mitigating factors under § 413 (g) (8) that the defendant was employed, had a wife and two children, was attempting to further his education, and that his crime was not greater than that committed by other individuals who did not receive the death sentence. The court sentenced Monroe to life imprisonment.\n\nJackie Hughes: The defendant, almost 30 years old at the time of the crime, was convicted of the premeditated murder of a restaurant employee. The employee, who was armed, was walking to a bank to make a cash deposit when Hughes approached him from behind, spun him around and shot him. Thereafter, Hughes took the victim's money. In the course of their encounter, the employee fired several shots at Hughes but Hughes escaped. The victim subsequently died. The sentencing jury determined that the aggravating factor relied upon by the State (murder in the course of a robbery) was proved; it found, by way of mitigating circumstances, that Hughes had not previously been convicted of a crime of violence and that other unspecified mitigating factors existed under § 413 (g) (8). The jury imposed a life sentence.\n\nWe recognize that dissimilarities exist between Tichnell's case and those selected for comparative review. That these cases, as well as others in the inventory, are not more similar to Tichnell's case obviously does not mean that we cannot complete the comparative review process mandated by § 414 (e) (4); to so conclude would ascribe to the legislature an intention not to enact an effective or operative death penalty statute.\n\nOf the cases reviewed only Calhoun's crime resulted in a death sentence. The aggravating circumstances present in that case closely parallel those present in Tichnell's case; the single mitigating circumstance in Tichnell's case would appear to be marginally weightier than that found to exist in Calhoun's case. Monroe was not a principal in the first degree killing of the police officer; his life sentence was based on the virtually simultaneous murder of the technician in the course of the robbery. While the life of a police officer is no more precious than that of the alarm technician, Monroe's mitigating circumstances were different than those present in Tichnell's case and, arguably, more substantial. Only one aggravating circumstance was found to exist in Recek's case, and the mitigating circumstance was different than in Tichnell's case; moreover, the sentencing jury's verdict sheet makes clear that it did not believe that Recek was a first degree principal in the deputy's death. Hughes, the least similar of the cases reviewed, involved a sudden episode of premeditated murder of an unsuspecting victim by an individual without a prior record of a crime of violence, as in Tichnell's case. The mitigating circumstances found to exist in Sails' case were far weightier than those in any of the other cases, including Tichnell's. Moreover, although Sails' murder of the officer was premeditated, he did not know that the victim was a police officer.\n\nOur comparative review of these similar cases is, of course, designed to avoid caprice in the decision to inflict capital punishment. However, as pointed out in Gregg, 428 U.S. at 203, \"the isolated decision of a jury to afford mercy does not render unconstitutional death sentences imposed on defendants who were sentenced under a system that does not create a substantial risk of arbitrariness or caprice.\" Maryland's death penalty statute encompasses a well-defined subclass of first degree murders and, with one exception (contract murder), the death sentence may only be imposed on first degree principals. We think the Maryland statute meets the Gregg test in that its provisions do not create a substantial risk of arbitrariness or caprice in the capital sentencing process.\n\nThe death sentence in Tichnell's case being neither excessive nor disproportionate under § 414 (e) (4), it must be affirmed.\n\nJudgment affirmed, with costs.Page 474}\n\nDEATH PENALTY CASES - APPENDIX A\n\nDATE OF TRIAL\n\nDEFENDANT OFFENSE JURISDICTION\n\nWilliam Joseph Parker 8/28/78 St. Mary's Co.\n\nJames Thomas Porter 11/1/78 Anne Arundel Co.\n\nDwayne T. Mayers 1/9/79 Anne Arundel Co.\n\nLawrence Johnson 1/9/79 Harford Co.\n\nRoberto Oscar Recek 1/18/79 Washington Co.\n\nRichard Danny Tichnell (I) 1/18/79 Wicomico Co.\n\nRichard Danny Tichnell (II) 1/18/79 Wicomico Co.\n\nRichard Danny Tichnell (III) 1/18/79 Calvert Co.\n\nGlen Sturgis 1/25 \u0026 26/79 Wicomico Co.\n\nTheodore Scott Weiner 3/28/79 Baltimore Co.\n\nDaniel Lee Chadderton 8/29/79 Garrett Co.\n\nRobert Lee Myers 8/29/79 Carroll Co.\n\nBryan Keith Quickly 9/27/79 Harford Co.\n\nTimothy Clyde Poole (I) 10/22/79 Calvert Co.\n\nTimothy Clyde Poole (II) 10/22/79 Charles Co.\n\nTimothy Clyde Poole (III) 10/22/79 Charles Co.\n\nLawrence Johnson 2/23/80 Calvert Co.\n\nLawrence Johnson 2/23/80 Charles Co.\n\nElvis Horton 3/2/80 Baltimore City\n\nAnnette Louise Stebbing 4/9/80 Harford Co.\n\nEugene Sherman Colvin 9/9/80 Anne Arundel Co.\n\nDean Hugh Oliver 11/22/80 Howard Co.\n\nMartin Francis Scott 11/25/80 Baltimore City\n\nNathan Ray Thomas 1/10/81 Baltimore Co.\n\nDoris Ann Foster 1/29/81 Cecil Co.\n\nGary Allen Miller 2/25/81 Allegany Co.\n\nJackie Hughes 3/2/81 Montgomery Co.\n\nWillie Louis Green 3/20/81 Baltimore City\n\nRonald LeRoy Johnson 3/24/81 Baltimore Co.\n\nJames Arthur Calhoun 3/27/81 Montgomery Co.\n\nCurtis Wayne Monroe 3/27/81 Montgomery Co.\n\nVincent Tito Greco, Jr. 4/17/81 Baltimore Co.\n\nJohn Norman Huffington 5/25/81 Caroline Co.\n\nJames Russell Trimble 7/3/81 Baltimore Co.\n\nMarselle Jerome Bowers 7/8 (or 9) /81 Charles Co.\n\nJackie K. Harris 8/9/81 Baltimore Co.\n\nJackie K. Harris 8/9/81 Baltimore Co.\n\nDerrick Quinton White 8/14/81 Baltimore Co.\n\nDonald Thomas 10/2/81 Baltimore Co.\n\nClinton W. Ellison 10/25/81 Baltimore City\n\nMichael Spencer Allen 12/21/81 Anne Arundel Co.\n\nJames Alexander Fields, Jr. 12/31/81 Pr. George's Co.\n\nHarlow Brian Sails 2/8/82 Pr. George's Co.\n\nJohn Kevin Johnson 2/20/82 Pr. George's Co.\n\nJames S. Waltermeyer 3/29/82 Baltimore Co.\n\nJack R. Jones 4/3/82 Baltimore Co.\n\nRobert Lewis Brantner 9/9/82 Garrett Co.\n\nHarold (NMN) Hines 6/21/79 Prince George's Co.\n\nDEATH PENALTY CASES - APPENDIX A\n\nDATE OF SENTENCING SENTENCE\n\nDEFENDANT SENTENCE AUTHORITY IMPOSED\n\nWilliam Joseph Parker 5/15/79 Jury Life\n\nJames Thomas Porter 10/5/79 Jury Life (Jury deadlocked)\n\nDwayne T. Mayers 10/22/80 Jury Life\n\nLawrence Johnson 10/5/82 Jury Death (new sentencing\n\nhearing granted\n\nby trial judge)\n\nRoberto Oscar Recek 1/28/80 Jury Life\n\nRichard Danny Tichnell (I) 8/24/79 Judge Death\n\nRichard Danny Tichnell (II) 8/20/80 Jury Death\n\nRichard Danny Tichnell (III) 1/21/82 Jury Death\n\nGlen Sturgis 6/7/79 Jury Life (Jury deadlocked)\n\nTheodore Scott Weiner 3/17/80 Judge Life\n\nDaniel Lee Chadderton 5/11/82 Jury Life\n\nRobert Lee Myers 12/9/82 Judge Life\n\nBryan Keith Quickly 11/6/80 Judge Life\n\nTimothy Clyde Poole (I) 6/5/80 Jury Death\n\nTimothy Clyde Poole (II) 2/26/82 Jury Death\n\nTimothy Clyde Poole (III) 5/6/83 Jury Life (Jury deadlocked)\n\nLawrence Johnson 1/30/81 Jury Death\n\nLawrence Johnson 9/1/82 Judge Life\n\nElvis Horton 1/3/81 Jury Life (Jury deadlocked)\n\nAnnette Louise Stebbing 4/28/81 Judge Death\n\nEugene Sherman Colvin 8/20/81 Jury Death\n\nDean Hugh Oliver 6/23/81 Jury Life\n\nMartin Francis Scott 11/6/81 Jury Death\n\nNathan Ray Thomas 8/17/81 Jury Death\n\nDoris Ann Foster 2/8/82 Judge Death\n\nGary Allen Miller 11/16/81 Judge Life\n\nJackie Hughes 3/1/82 Jury Life\n\nWillie Louis Green 1/14/82 Judge Life\n\nRonald LeRoy Johnson 4/8/81 Judge Life\n\nJames Arthur Calhoun 11/6/81 Jury Death\n\nCurtis Wayne Monroe 9/20/82 Judge Life\n\nVincent Tito Greco, Jr. 5/14/82 Judge Life\n\nJohn Norman Huffington 12/2/81 Jury Death\n\nJames Russell Trimble 3/19/82 Judge Death\n\nMarselle Jerome Bowers 10/22/82 Jury Death\n\nJackie K. Harris 4/5/82 Judge Death\n\nJackie K. Harris 7/22/83 Jury Death\n\nDerrick Quinton White 2/26/82 Jury Death\n\nDonald Thomas 12/13/82 Judge Death\n\nClinton W. Ellison 1/19/83 Jury Life\n\nMichael Spencer Allen 2/3/83 Judge Life\n\nJames Alexander Fields, Jr. 10/8/82 Jury Life (Jury deadlocked)\n\nHarlow Brian Sails 3/31/83 Jury Life\n\nJohn Kevin Johnson 11/19/82 Jury Life (Jury deadlocked)\n\nJames S. Waltermeyer 3/4/83 Jury Life\n\nJack R. Jones 10/14/82 Jury Life\n\nRobert Lewis Brantner 5/3/83 Jury Life\n\nHarold (NMN) Hines 7/12/83 Jury Life\n\nDisposition\n\nJudgment affirmed, with costs.\n\nEldridge, J., concurring:\n\nI concur with the result in this case and with most of the Court's opinion.\n\nMaryland Code (1957, 1982 Repl. Vol.), Art. 27, § 414, relating to appeals in death sentence cases, provides in subsection (e) that, after reviewing the trial and sentencing hearing for errors, this Court shall consider the imposition of the death sentence and shall determine the following:\n\n\"(1) Whether the sentence of death was imposed under the influence of passion, prejudice, or any other arbitrary factor;\n\n(2) Whether the evidence supports the jury's or court's finding of a statutory aggravating circumstance under § 413 (d);\n\n(3) Whether the evidence supports the jury's or court's finding that the aggravating circumstances are not outweighed by mitigating circumstances; and\n\n(4) Whether the sentence of death is excessive or disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant.\"\n\nThe present appeal is the first to be decided, under this State's recently enacted death penalty statute, in which the Court has found no reversible error in the trial or sentencing hearing. Consequently, the Court's opinion is the first one under the statute which has reached a consideration of the death penalty.\n\nIn this case, I agree with those portions of the Court's opinion rejecting Tichnell's claims of error in his third sentencing hearing and rejecting his constitutional attack upon the sentence. I also agree with those parts of the Court's opinion holding that the sentence should not be set aside under the above-quoted paragraphs (1), (2) and (3) of § 414 (e). Although concurring in the result of the Court's proportionality review under paragraph (4), I disagree with\n\nthat portion of Part V (B) of Chief Judge Murphy's opinion which concludes \"that the legislatively intended inventory of cases from which 'similar cases' are to be culled encompasses only those first degree murder cases in which the State sought the death penalty . . . .\"\n\nThe General Assembly, by mandating in § 414 (e) (4) that we determine whether the death sentence is disproportionate to the penalty imposed in \"similar cases, considering both the crime and defendant,\" has specifically focused upon the two factors to be considered. They are the \"crime\" and the \"defendant.\" Nothing in the language of the statute supports the view that our consideration should be further limited to those cases in which the prosecutor has exercised his discretion to seek the death penalty. The crime and defendant in another case may be similar to the crime and defendant in the case under review even though the prosecuting attorney in the former case decided, for whatever reason, not to seek the death penalty.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nConsideration of cases in which the State did not seek the death penalty permits our proportionality review to serve as a check against the aberrant actions of a prosecutor. For example, if in a particular type of murder case the State's Attorneys throughout Maryland generally do not seek the death penalty, but if the State's Attorney in one county regularly does seek and obtain the death penalty in the same type of case, the result would be an arbitrary imposition of the death penalty. In appeals from that one county, we would be confronted with the imposition of the death penalty in a type of case in which the penalty is not generally imposed. Unless we were willing to consider similar cases from the other counties in which the death penalty was not sought, this aberration would not be cured by our proportionality review.\n\nIn Gregg v. Georgia, 428 U.S. 153, 96 S.Ct. 2909, 49 L.Ed.2d 859 (1976), plurality opinion of Justice Stewart, joined by Justices Powell and Stevens, pointed out that the decision to impose capital punishment must be \"guided by standards\" (428 U.S. at 199), and that appellate proportionality review \"serves as a check against the random or arbitrary imposition of the death penalty\" (id. at 206). The concurring opinion of Justice White, joined by the Chief Justice and Justice Rehnquist, in dealing with the petitioner's argument based upon the alleged standardless prosecutorial discretion in deciding to seek the death penalty, stated (id. at 225):\n\n\"Petitioner's argument that prosecutors behave in a standardless fashion in deciding which cases to try as capital felonies is unsupported by any facts. Petitioner simply asserts that since prosecutors have the power not to charge capital felonies they will exercise that power in a standardless fashion. This is untenable. Absent facts to the contrary it cannot be assumed that prosecutors will be motivated in their charging decision by factors other than the strength of their case and the likelihood that a jury would impose the death penalty if it convicts. * * * If the cases really were 'similar' in relevant respects it is unlikely that prosecutors would fail to prosecute them as capital cases; and I am unwilling to assume the contrary.\"\n\nIn Maryland, however, we now have facts demonstrating that prosecutors throughout the State do not employ common standards in deciding to seek the death penalty. Unlike Justice White in Gregg, we cannot assume that prosecutors generally seek the death penalty in cases which are similar. In Calhoun v. State, No. 129, September Term, 1981, and No. 5, September Term, 1982, which was consolidated with the instant case for reargument on the matter of proportionality review, and which has not yet been decided, the Public Defender's Office made a record which convincingly demonstrated that there are no common standards\n\nguiding the prosecutors in this State.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Anyone who reads Baltimore city newspapers or pays attention to Baltimore city news broadcasts is fully aware of the completely divergent policies concerning capital cases adhered to by different State's Attorneys Offices in the Baltimore metropolitan area.\n\nIn light of the known facts concerning the policies of Maryland State's Attorneys, proportionality review limited to those cases in which the death penalty is sought presents serious constitutional questions under the principles of Furman v. Georgia, 408 U.S. 238, 92 S.Ct. 2726, 33 L.Ed.2d 346 (1972), and its progeny. It is a settled principle in this State that a construction of an enactment, which does not cast doubt upon the statute's constitutionality, is preferred. E.g., Davis v. State, 294 Md. 370, 377, 451 A.2d 107 (1982); State v. Zitomer, 275 Md. 534, 544-545, 341 A.2d 789 (1975), cert. denied sub nom. Gasperich v. Church, 423 U.S. 1076, 96 S.Ct. 862, 47 L.Ed.2d 87 (1976); City of Gaithersburg v. Montgomery County, 271 Md. 505, 510, 318 A.2d 509 (1974); Md. St. Bd. of Barber Ex. v. Kuhn, 270 Md. 496, 505, 312 A.2d 216 (1973); District Land v. Wash. S. S. C., 266 Md. 301, 312, 292 A.2d 695 (1972); Baltimore County v. Mo. Realty, 219 Md. 155, 159, 148 A.2d 424 (1959).\n\nTherefore, I cannot agree with the Court's construction of § 414 (e) (4), limiting the phrase \"similar cases\" to encompass only those in which prosecuting attorneys sought the death penalty. I believe that the Legislature contemplated something more flexible, focusing upon murder cases in which the crime itself was similar and the circumstances surrounding the defendant were similar.\n\nNevertheless, the Court's opinion in this case, after setting forth its construction of § 414 (e) (4), goes on to state as follows:\n\n\"In so concluding, we do not preclude any defendant whose death sentence is under appellate review from presenting argument, with relevant facts, that designated noncapital murder cases are similar to the case then under scrutiny and should be taken into account in the exercise of our proportionality review function.\"\n\nAs I understand the above-quoted language, the Court is willing to consider murder cases in which the State did not seek the death penalty, and which are brought to the Court's attention by the defendant. Thus, my disagreement with the Court's construction of § 414 (e) (4) becomes academic and of little or no practical consequence. If it is asserted that the imposition of the death sentence in a particular case is an aberration, because prosecutors in Maryland generally do not seek the death penalty in that type of case, under the Court's opinion the defendant is entitled to rely upon the \"similar\" cases in which prosecutors did not ask for the death penalty. If, after considering those cases along with the ones in which we receive trial judge reports, we agree with the defendant's argument that the death sentence is not generally imposed in the type of case before us, the sentence will be set aside.\n\nFurthermore, I agree with the procedure requiring the defendant to bring to our attention other murder cases in which the death penalty was not sought and which the defendant wishes us to consider. Contrary to the view expressed in the dissent, I do not believe that this procedure is too burdensome for the defendant or that it is the Court's responsibility \"to assure that all death-eligible cases in which the death penalty has not been sought\" be included in the inventory. I know of no workable and valid procedure by which the Court itself could maintain an inventory of all murder cases which may have been \"death-eligible\" and could select from such inventory the sufficiently similar cases for consideration in our proportionality review. The defendant's attorney, with the resources of the State Office\n\nof Public Defender,\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e is in a much better position to determine which non-capital murder cases should be called to the Court's attention for purposes of proportionality review.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nFinally, I agree with Part VI of the Court's opinion concerning the death sentence in this case.\n\nCole, J., concurring:\n\nI concur with the judgment of the Court in this case. I feel compelled to write separately, however, in order to emphasize what I view as an important aspect of the Court's holding as to proportionality review.\n\nUnder legislative mandate, the Court must determine \"whether the sentence of death is excessive or disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant.\" Md. Code Art. 27, § 414 (e) (4). The Court is obliged, therefore, to compare each death case with other cases to ensure that there is a rational basis for distinguishing the few cases in which the death penalty is imposed from the many cases in which it is not. Tichnell v. State, 287 Md. 695, 415 A.2d 830 (1980).\n\nThe Court today concludes that the pool of cases from which \"similar cases\" are to be culled includes all cases in which the death penalty was sought, whether or not it was actually imposed. Simultaneously, the Court holds that:\n\nIn so concluding, we do not preclude any defendant whose death sentence is under appellate review from presenting argument, with relevant\n\nfacts, that designated non-capital murder cases are similar to the cases then under scrutiny, and should be taken into account in the exercise of our proportionality review function.\n\nI take this to mean that the Court, in fact, is not limiting its proportionality review to cases in which the death penalty is sought but places the onus on the defendant to expand the pool of similar cases to include cases in which the death penalty was not sought.\n\nIn my view, allowing the Court to review a pool of cases which includes cases where the prosecutor chose not to seek the death penalty, because of plea agreements or because of other tactical reasons, is essential to meaningful proportionality review and fundamental to the constitutional application of the statute. Whether the responsibility for marshalling this data imposes a constitutionally impermissible burden on the defendant is a question for another day. For the present, I am willing to assume that the various prosecutors will maintain such a data bank which they will readily make available to defense counsel, public or private.\n\nThe purpose of § 414 (e) (4) is to allow the Court to evaluate meaningfully the proportionality of a death sentence. This purpose is not served if § 414 (e) (4) is interpreted to restrict the availability of all information relevant to that inquiry, specifically the cases in which the death penalty is not sought. Only with a full range of information about the individual defendants potentially but not ultimately exposed to the death penalty can this Court make a sound proportionality decision and thereby be assured that it has given no quarter to disproportionality based solely on factors such as race, sex, or wealth.\n\nThe death penalty's disproportionate impact on racial minorities and the poor has been documented.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003ea In Furman Page 484} v. Georgia, 408 U.S. 238, 92 S.Ct. 2726, 33 L.Ed. 2d 346 (1972), two members of the Supreme Court concluded that the state statutes at issue were unconstitutional in part because race appeared to be the only basis for selecting which offenders would be sentenced to die. See id. at 249-52 (Douglas, J., concurring); id. at 364-66 (Marshall, J., concurring). Discrimination in any administrative setting, including discrimination in the prosecutorial decision to seek the death penalty, is difficult to prove. Adequate information is essential; by allowing a defendant to gather and to present to this Court information about cases in which the death penalty was not sought, an informed decision as to proportionality can be made.\n\nAlthough I assume that the State's Attorneys in the several jurisdictions of this State approach their duties conscientiously and fairly, this assumption is no substitute for this Court being able to assure itself independently that they adhere to nondiscriminatory standards in distinguishing the few cases in which the death penalty is sought from the many cases in which it is not sought. As Judge Davidson's dissenting opinion ably demonstrates, there is a wide variation among the several counties and Baltimore City in their respective administration of the death penalty due to the prosecutor's unlimited discretion. Without an evaluation of the cases in which the capital sanction is not sought, it will be virtually impossible for this Court to detect any untoward discrimination in prosecutorial discretion.\n\nI would prefer that the Court, by Rule, require each State's Attorney to maintain a file of those cases where the death penalty could have been sought, indicating the aggravating and mitigating factors present therein. This information could then be available to a defendant in a particular case. Although the Court today does not require such a procedure, it does allow a defendant to demonstrate that his sentence is disproportionate by presenting similar cases where the death penalty was not sought. How constitutionally meaningful this concession is will be left to counsel to demonstrate.\n\n{PA}\n\nPage 485} Davidson, J., dissenting:\n\nThe majority here determines that under Maryland Code (1957, 1982 Repl. Vol.), Art. 27, § 414 (e) (4) \"the legislatively intended inventory of cases from which 'similar cases' are to be culled encompasses only those first degree murder cases in which the State sought the death penalty under § 413, whether it was imposed or not.\" Moreover, the majority here concludes \"that the death sentence imposed upon Tichnell was neither excessive nor disproportionate to the penalty imposed in similar cases in Maryland, considering both the crime and the defendant.\" Consequently, the majority affirms the death sentence imposed. I do not agree. Accordingly, I respectfully dissent.\n\nI\n\nThe United States Supreme Court requires that \"capital punishment be imposed fairly, and with reasonable consistency, or not at all.\" Eddings v. Oklahoma, 455 U.S. 104, 112, 102 S.Ct. 869, 875 (1982). Indeed, the purpose of the Supreme Court's standards for imposition of the death penalty is to \"serve both goals of measured, consistent application and fairness to the accused.\" Eddings, 455 U.S. at 111, 102 S.Ct. at 874-75. Moreover, that Court has expressly recognized that the function of appellate review is to achieve these goals. In Jurek v. Texas, 428 U.S. 275, 276, 96 S.Ct. 2950, 2958 (1976), the Supreme Court stated:\n\n\"By providing prompt judicial review of the jury's decision in a court with statewide jurisdiction, Texas has provided a means to promote the evenhanded, rational, and consistent imposition of death sentences under law.\" (Emphasis added.)\n\nMore particularly, the Supreme Court has expressly recognized that proportionality review is designed to effectuate the consistent and fair application of the death penalty. Thus, in Gregg v. Georgia, 428 U.S. 153, 96 S.Ct. 2909 (1976), the Supreme Court acknowledged that the primary function of a state reviewing court in performing proportionality\n\nreview is to assure that the death penalty is not imposed unless it has generally been imposed in similar cases throughout the state. There the Supreme Court said:\n\n\"In performing its sentence-review function, the Georgia court has held that 'if the death penalty is only rarely imposed for an act or it is substantially out of line with sentences imposed for other acts it will be set aside as excessive.' Coley v. State, 231 Ga., at 834, 204 S.E.2d, at 616. The court on another occasion stated that 'we view it to be our duty under the similarity standard to assure that no death sentence is affirmed unless in similar cases throughout the state the death penalty has been imposed generally. . . .' Moore v. State, 233 Ga. 861, 864, 213 S.E.2d 829, 832 (1975). See also Jarrell v. State, supra, at 425, 216 S.E.2d, at 270 (standard is whether 'juries generally throughout the state have imposed the death penalty'); Smith v. State, 236 Ga. 12, 24, 222 S.E.2d 308, 318 (1976) (found 'a clear pattern' of jury behavior).\" Gregg, 428 U.S. at 204-05, 96 S.Ct. at 2940 (emphasis added).\n\nIn holding the Georgia capital-sentencing system constitutional on its face, the Supreme Court concluded:\n\n\"The provision for appellate review in the Georgia capital-sentencing system serves as a check against the random or arbitrary imposition of the death penalty. In particular, the proportionality review substantially eliminates the possibility that a person will be sentenced to die by the action of an aberrant jury. If a time comes when juries generally do not impose the death sentence in a certain kind of murder case, the appellate review procedures assure that no defendant convicted under such circumstances will suffer a sentence of death.\" Gregg, 428 U.S. at 206, 96 S.Ct. at 2940 (emphasis added).\n\nArticle 27, § 414 (e), enacted in the wake of Gregg, is patterned after the proportionality review provision of the Georgia death penalty statute. See Ga. Code Ann. § 17-10-35 (c) (1982).\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Section 414 (e) provides in pertinent part:\n\n\"In addition to the consideration of any errors properly before the Court on appeal, the Court of Appeals shall consider the imposition of the death sentence. With regard to the sentence, the Court shall determine:\n\n\"(4) whether the sentence of death is excessive or disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant.\" (Emphasis added.)\n\nManifestly, the purpose of that provision is to provide consistency and fairness in the imposition of the death penalty by assuring that the death penalty is not imposed unless it has been generally imposed in similar cases throughout the State.\n\nThis case involves a question of statutory construction. At issue is the meaning of the term \"similar cases\" appearing in § 414 (e) (4). The cardinal rule of statutory construction is to ascertain the actual intent of the Legislature. The primary source from which to determine the intention of the Legislature is the language of the statute. If the statutory language is ambiguous, the statute is to be construed reasonably and with reference to the purpose to be accomplished. Scott v. State, 297 Md. 235, 245-46, 465 A.2d 1126, 1132\n\n(1983); State v. Loscomb, 291 Md. 424, 429, 435 A.2d 764, 767 (1981); Department of State Planning v. Mayor of Hagerstown, 288 Md. 9, 14, 415 A.2d 296, 299 (1980). Finally, a penal statute must be strictly construed in favor of the accused. State v. Canova, 278 Md. 483, 496-97, 365 A.2d 988, 996 (1976); Gatewood v. State, 244 Md. 609, 617, 224 A.2d 677, 682 (1966); Weinecke v. State, 188 Md. 172, 176, 52 A.2d 73, 74 (1947). I shall apply these general rules of statutory construction here.\n\nIn enacting § 414 (e) (4), the General Assembly considered the scope of the inventory of cases necessary to assure effective proportionality review. Thus, in a letter dated 14 December 1977 from the Governor's Chief Legislative Officer to the General Assembly, it was said with respect to § 414 (e):\n\n\"In addition to any other considerations properly before the Court, subsection (E) requires the Court to make four determinations regarding the death sentence. Those considerations require the court to view the evidence in light of each of the court's or jury's separate written decisions. Also required is a comparison of the penalty imposed in cases which are similar to the murder committed in the instant case and to the defendant who committed the crime. Unlike the Georgia statute, the Court is not limited to cases which occurred after a certain date. The Court is free to consider any similar cases, and it must refer to them in its decision.\" (Emphasis added.)\n\nThis legislative history\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e establishes that the General Assembly intended that the broadest possible inventory of similar cases be utilized in Maryland's proportionality review procedure.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nNotwithstanding the General Assembly's intent that \"any\" similar cases be considered, the majority chooses to restrict the inventory of similar cases to \"only those first degree murder cases in which the State sought the death penalty under § 413, whether it was imposed or not,\" and to exclude those \"other death-eligible murder cases in which the prosecutor could have, but did not seek the death penalty.\" The majority, however, offers no affirmative justification for this exclusion.\n\nIn my view, \"death-eligible murder cases in which the prosecutor could have, but did not seek the death penalty\" are \"similar cases\" within the scope of § 414 (e) (4). In that section, the General Assembly expressly outlined the characteristics to be taken into account in proportionality review. There it stated that in determining whether the death penalty is disproportionate \"both the crime and the defendant\" should be considered.\n\nWith respect to the crime committed in this case, the distinguishing characteristics\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e are that Tichnell killed a police officer in an attempt to evade arrest. Moreover, with respect to the defendant in this case, the distinguishing characteristic is that Tichnell had not previously been found guilty of a crime of violence. Consequently, in determining what constitutes a case similar to this case, these distinguishing characteristics must be taken into account. Such distinguishing characteristics undoubtedly are present, not only in cases \"in which the State sought the death penalty . . . whether it was imposed or not,\" but also in those \"other death-eligible murder cases in which the prosecutor could have, but did not seek the death penalty.\" Under these circumstances, such cases should be included in the inventory.\n\nIn my view, \"death-eligible murder cases in which the prosecutor could have, but did not seek the death penalty\" must be included in the inventory of relevant cases in order to achieve the goal of proportionality review -- the consistent and fair application of the death penalty. Recently, in Enmund v. Florida, 458 U.S. 782, 801, 102 S.Ct. 3368, 3379 (1982), the Supreme Court held that death was a disproportionate penalty for a felony murder in which the defendant, the driver of a get-away car, did not himself kill, attempt to kill, or intend that a killing take place. In reaching this result, the plurality\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e relied upon legislative judgments and sentencing decisions of juries, both of which were regarded as significant and reliable objective indices of contemporary standards of decency. Enmund, 458 U.S. at 788-94, 102 S.Ct. at 3372-75. In response to the dissent,\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e the plurality said:\n\n\"The dissent criticizes these statistics on the ground that they do not reveal the percentage of homicides that were charged as felony murders or the percentage of cases where the State sought the death penalty for an accomplice guilty of felony murder. We doubt whether it is possible to gather such information, and at any rate, it would be relevant if prosecutors rarely sought the death penalty for accomplice felony murder, for it would tend to indicate that prosecutors, who represent society's interest in punishing crime, consider the death penalty excessive for accomplice felony murder.\" Enmund, 458 U.S. at 796, 102 S.Ct. at 3376 (emphasis added) (citation omitted).\n\nIn conclusion, the plurality said:\n\n\"Although the judgments of legislatures, juries and prosecutors weigh heavily in the balance, it is for us ultimately to judge whether the Eighth\n\nAmendment permits imposition of the death penalty. . . .\" Enmund, 458 U.S. at 797, 102 S.Ct at 3376 (emphasis added).\n\nThus, all nine Justices of the Supreme Court agreed that because the judgment of prosecutors constitutes an objective index of contemporary standards of decency, the fact that in certain circumstances prosecutors rarely seek the death penalty is relevant and should be considered in determining whether the death penalty is excessive or disproportionate.\n\nSubsequent to Enmund, the Supreme Court of Georgia, in Horton v. State, 249 Ga. 871, 295 S.E.2d 281 (1982), interpreted the scope of the term \"similar cases\" appearing in the Georgia statute. The Court, citing Enmund, expressly noted:\n\n\"We do compare cases as to which the death penalty could have been sought by the prosecutor but was not.\" Horton, 249 Ga. at 880 n.9, 295 S.E.2d at 289 n.9.\n\nConsequently, the Supreme Court of Georgia determined, in essence, that \"death-eligible murder cases in which the prosecutor could have, but did not seek the death penalty\" are included in the inventory of cases utilized for proportionality review thus acknowledging that the exercise of prosecutorial discretion is relevant in determining whether the death penalty is excessive or disproportionate.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nMaryland's death penalty statute is patterned upon the Georgia statute. Thus, the Supreme Court of Georgia's interpretation of the term \"similar cases\" based upon the United States Supreme Court's analysis in Enmund is persuasive authority.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e That interpretation supports the conclusion that\n\nin Maryland \"death-eligible murder cases in which the prosecutor could have, but did not seek the death penalty\" must be included in the relevant inventory of cases utilized for proportionality review.\n\nFor the first time, this Court has before it data concerning the exercise of prosecutorial discretion in death penalty cases.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e This data dramatically demonstrates that the inventory of relevant cases for proportionality review must include all death-eligible murder cases -- not only those in which the prosecutor sought the death penalty, but also those in which he did not.\n\nThis data reveals that in Maryland prosecutors seek the death penalty in only 7.8% of the death-eligible cases, whereas in 92.2% of the death-eligible cases the death penalty is not sought.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Consequently, this data establishes that Maryland prosecutors rarely seek the death penalty, a fact that is relevant, in and of itself, in determining whether the death penalty is disproportionate.\n\nMore important, the purpose of proportionality review is to assure that a person is not sentenced to death unless the death penalty has been imposed generally in similar cases throughout the State. Gregg, 428 U.S. at 205, 96 S.Ct. at 2940. If this purpose is to be effectuated, under § 414 (e) (4), a person sentenced to death must have his background and the nature and the circumstances of the crime committed\n\ncompared to the sentence imposed on other persons in this State of similar background who committed a similar crime under similar circumstances. That prosecutors do not seek the death penalty in 92.2% of death-eligible murder cases shows that unless all death-eligible cases are included in the inventory, a significant number of cases involving similar defendants and similar crimes would be excluded from proportionality review.\n\nIn addition, the data concerning the exercise of prosecutorial discretion reveals that in cases in which the death penalty has been sought juries in Garrett County have imposed the death penalty in 50% of the cases, whereas juries in Baltimore City have imposed the death penalty in 33%.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e This data suggests that in these two jurisdictions the death penalty has been imposed in a somewhat consistent manner. The data further reveals, however, that in Maryland there is a substantial variation in the exercise of prosecutorial discretion. In Garrett County prosecutors seek the death penalty in 100% of the death-eligible cases, whereas in Baltimore City, they seek that penalty in only 1.8%.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e This data further shows that when prosecutorial discretion is taken into account, juries in Garrett County have imposed the death penalty in 50% of all the death-eligible cases, whereas juries in Baltimore City have imposed the death penalty in only .6%.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Consequently, this data demonstrates that in these two jurisdictions the death penalty has been imposed in an inconsistent manner. If death-eligible cases in which the death penalty has not been sought are excluded from the inventory, a person who has committed a crime in Garrett County is deprived of a realistic comparison of the treatment accorded to other\n\npersons of similar background who committed a similar crime under similar circumstances in Baltimore City and, indeed, throughout the State.\n\nIn my view, if all death-eligible cases are not included in the inventory, it is impossible conscientiously to determine whether the death penalty has been imposed generally in similar cases throughout the State. In essence, the majority's restriction of the inventory of cases to those in which the prosecutor has sought the death penalty makes it impossible, in a given case, to determine that the imposition of the death penalty is fair and consistent. Such a result is not consonant with the General Assembly's intent that the broadest possible inventory of similar cases be utilized in Maryland's proportionality review procedure. More important, such an interpretation is not consonant with the General Assembly's purpose of assuring consistent and fair application of the death penalty through proportionality review.\n\nMoreover, the data concerning the exercise of prosecutorial discretion raises substantial constitutional questions concerning the majority's exclusion from proportionality review of death-eligible cases in which the prosecutor has not sought the death penalty. The majority, relying upon footnotes in Gregg, 428 U.S. at 204-05 n.56, 96 S.Ct. at 2940 n.56, and Proffitt v. Florida, 428 U.S. 242, 259 n.16, 96 S.Ct. 2960, 2970 n.16 (1976), has determined that:\n\n\"Implicit in [ Gregg and Proffitt ] is the conclusion that to include in the relevant inventory of cases only those in which the death penalty was sought does not violate the due process or cruel and unusual punishment provisions of the federal constitution.\"\n\nThus, the majority itself recognizes that in Gregg and Proffitt the Supreme Court did not explicitly hold that it is\n\nconstitutional to restrict the inventory of cases to those in which the death penalty was sought.\n\nIn Gregg and Proffitt, the Supreme Court considered only the facial constitutionality of the Georgia and Florida death penalty statutes. These cases were decided by a plurality of the Court.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e In a concurring opinion in Gregg, Justice White articulated the view that prosecutorial discretion need not be taken into account in proportionality review. There Justice White said:\n\n\"Petitioner also argues that decisions made by the prosecutor -- either in negotiating a plea to some lesser offense than capital murder or in simply declining to charge capital murder -- are standardless and will inexorably result in the wanton and freakish imposition of the penalty condemned by the judgment in Furman. I address this point separately because the cases in which no capital offense is charged escape the view of the Georgia Supreme Court and are not considered by it in determining whether a particular sentence is excessive or disproportionate.\n\n\"Petitioner's argument that prosecutors behave in a standardless fashion in deciding which cases to try as capital felonies is unsupported by any facts. Petitioner simply asserts that since prosecutors have the power not to charge capital felonies they will exercise that power in a standardless fashion. This is untenable. Absent facts to the contrary, it cannot be assumed that prosecutors will be motivated in their charging decision by factors other than the strength of their case and the likelihood\n\nthat a jury would impose the death penalty if it convicts. Unless prosecutors are incompetent in their judgments, the standards by which they decide whether to charge a capital felony will be the same as those by which the jury will decide the questions of guilt and sentence. Thus defendants will escape the death penalty through prosecutorial charging decisions only because the offense is not sufficiently serious; or because the proof is insufficiently strong. This does not cause the system to be standardless any more than the jury's decision to impose life imprisonment on a defendant whose crime is deemed insufficiently serious or its decision to acquit someone who is probably guilty but whose guilt is not established beyond a reasonable doubt. Thus the prosecutor's charging decisions are unlikely to have removed from the sample of cases considered by the Georgia Supreme Court any which are truly 'similar.' If the cases really were 'similar' in relevant respects, it is unlikely that prosecutors would fail to prosecute them as capital cases; and I am unwilling to assume the contrary.\" Gregg, 428 U.S. at 224-25, 96 S.Ct. at 2949 (White J., concurring) (emphasis added).\n\nManifestly, Justice White's view is premised upon the assumption, unsupported by facts, that there is no significant variation in the exercise of prosecutorial discretion and consequently that prosecutorial discretion has no impact upon proportionality review. The data before this Court for the first time provides facts concerning the exercise of prosecutorial discretion. This data demonstrates a substantial variation, ranging from 1.8% to 100%, in the percentage of cases in which the death penalty is sought, depending upon the identity of the prosecutor making the determination.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Equally important, this data shows that there is a substantial\n\nvariation in the standards employed by prosecutors in deciding in which cases to seek the death penalty.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e In six counties, the prosecutors exercise virtually no discretion; these prosecutors seek the death penalty whenever a single aggravating circumstance is present and mitigating circumstances are not taken into account. In six other counties and Baltimore City, prosecutors exercise considerable discretion. Such prosecutors weigh the aggravating circumstances against the mitigating circumstances in determining whether to seek the death penalty. There are many other variations in the standards employed by prosecutors. In some jurisdictions the strength of the case is evaluated. Sometimes the question whether a jury would impose the death penalty is considered. In Baltimore City the death penalty is sought if there is a substantial likelihood that the jury would impose death. In Montgomery County, the death penalty is sought if there is a reasonable possibility. In Charles County, the death penalty is sought unless it is very unlikely that the jury will impose that penalty. In two counties, the prosecutors take public sentiment with respect to the case into account, whereas in seven others, they do not. In five counties, prosecutors take the relationship between the accused and the victim into account, whereas in three others they do not. In one county, the prosecutor considers the burden of prosecuting a death penalty case upon the State's Attorney's office and the courts, whereas in seven other counties, they do not. A prosecutor in one county seeks the death penalty as a device to obtain a plea bargain, whereas the prosecutors in no other county engage in such a practice. In a single county, the prosecutor seeks the death penalty in felony murder cases only when the aggravating circumstances are separate and distinct from the underlying felony, whereas no prosecutor in any other county has such a policy. Finally, the data before this Court shows that when six prosecutors were asked the hypothetical question whether they would seek the death penalty in a case involving a fourteen-year-old charged with felony murder,\n\nthree responded that they would and three responded that they would not.\n\nManifestly, Justice White's assumption that the standards employed by prosecutors in Georgia will be consistent and that \"if the cases really were 'similar' in relevant respects, it is unlikely that prosecutors would fail to prosecute them as capital cases\" may not be well-founded. See Gregg, 428 U.S. at 225, 96 S.Ct. at 2949 (White, J., concurring). Under these circumstances, the impact upon the Supreme Court of data similar to that before this Court cannot be assessed. It is, nonetheless, apparent that the existence of such data raises the question whether the relevant inventory of cases must include those in which the death penalty was not sought in order for proportionality review to be constitutional.\n\nSubsequent to Gregg, in Enmund, all nine Justices of the Supreme Court agreed that the fact that prosecutors rarely seek the death penalty is relevant and should be considered in determining whether the death penalty is excessive or disproportionate. Enmund did not involve the question of the scope of the relevant inventory of cases necessary for constitutional proportionality review. Nonetheless, it suggests that the existence of data similar to that before this Court, indicating that prosecutors rarely seek the death penalty, and that there is significant variation in the standards employed and the percentage of cases in which the death penalty is sought, raises the question whether the relevant inventory of cases must include those in which the death penalty was not sought in order for proportionality review to be constitutional. Indeed, subsequent to Enmund, the Supreme Court of Georgia interpreted the scope of the term \"similar cases\" as including those in which the death penalty could have been sought by the prosecutor but was not. Horton, 249 Ga. at 880 n.9, 295 S.E.2d at 289 n.9.\n\nUnder these circumstances, it is clear that the majority's construction of § 414 (e) (4), restricting the relevant inventory of cases to those in which the prosecutor has sought the death penalty and excluding those death-eligible cases in\n\nwhich the prosecutor has not, raises serious doubts as to its constitutionality. Such a construction should be avoided.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nI am cognizant of the majority's statement that \"we do not preclude any defendant whose death sentence is under appellate review from presenting argument, with relevant facts, that designated non-capital murder cases are similar to the case then under scrutiny and should be taken into account in the exercise of our proportionality review function.\" I do not agree, however, with the members of this Court who concur with the majority's result in this case that the majority's construction of § 414 (e) (4) \"becomes academic and of little or no practical consequence,\" in light of the Court's expressed willingness \"to consider murder cases in which the State did not seek the death penalty, and which are brought to the Court's attention by the defendant.\"\n\nIn essence, after determining that the relevant inventory excludes death-eligible cases in which the death penalty has not been sought, the majority affords the defendant the right to argue that certain such cases should nonetheless be taken into account. Affording a defendant such a right does not eliminate the fatal defect inherent in the proportionality review procedure prescribed by the majority. The fact that a defendant is afforded a right to argue that something should be included in the relevant inventory does not mean that it will be. Thus, although the majority permits death-eligible cases in which the death penalty has not been sought to be taken into account, it does not require the consideration of all death-eligible cases. Consequently, the relevant inventory of cases remains restricted to those in which the death penalty has been sought and continues to exclude all death-eligible cases in which the death penalty has not been sought. In short, in my view, the majority's statement does nothing more than afford the defendant the right to argue\n\nthat certain cases excluded from the inventory today should be included and considered tomorrow.\n\nAdditionally, even if death-eligible cases designated by the defendant in which the death penalty was not sought were to be taken into account, the fatal defect inherent in the proportionality review procedure prescribed by the majority would not be eliminated. Under such circumstances, as a practical matter, there would still be no assurance that all similar death-eligible cases in which the death penalty has not been sought would be considered in determining whether the imposition of the death penalty is fair and consistent. Only cases of which the defendant has become aware would be considered.\n\nIn my view, it is the responsibility of this Court to assure that all death-eligible cases in which the death penalty has not been sought, to be utilized in proportionality review, be included in the inventory. Like Judge Eldridge, the Supreme Court has recognized the enormous difficulty associated with gathering data concerning the exercise of prosecutorial discretion. See Enmund, 458 U.S. at 796, 102 S.Ct. at 3376. The responsibility to accumulate such data should not be foisted upon the defendant. This is particularly true, in a case such as this in which the defendant is represented by retained counsel who does not necessarily have available even the limited statistical data available to the Public Defender.\n\nIn short, the majority has determined that in proportionality review all similar cases in which the death penalty has been sought are relevant. It has assumed the responsibility, through its rule-making powers, to develop an inventory of all death-eligible cases in which the death penalty has been sought from which relevant similar cases may be culled. The majority then belatedly indicates that similar death-eligible cases in which the death penalty was not sought may be relevant. Nevertheless, without explanation, and without any attempt to adopt a rule such as that suggested by Judge Cole, or any other rule, the Court refuses to develop an inventory of all death-eligible cases in which the\n\ndeath penalty has not been sought from which relevant similar cases may be culled. Unlike Judge Cole, I am not willing to assume that in the absence of a Court rule \"various prosecutors will maintain . . . a data bank which they will readily make available to defense counsel, public or private.\" Under the present circumstances, there is no justification whatsoever for the majority arbitrarily to shift this Court's responsibility to the defendant and to impose upon him a task which is difficult, if not impossible, to perform.\n\nIn sum, in my view, under § 414 (e) (4), the inventory of cases utilized for proportionality review must include not only those death-eligible cases in which the prosecutor has sought the death penalty, whether it was imposed or not, but all those death-eligible cases in which the prosecutor did not seek the death penalty. Such a construction is supported by the legislative history of § 414 (e) (4), is consonant with the legislative intent that the broadest possible inventory of similar cases be utilized in Maryland's proportionality review procedure, avoids serious constitutional questions, and prevents the arbitrary imposition of an unjustified burden upon the defendant. Most important, such an interpretation effectuates the purpose of proportionality review -- to assure consistent and fair application of the death penalty -- and, therefore, is favorable to the accused. I agree with Judge Seiler who in a dissenting opinion in State v. Mercer, 618 S.W.2d 1, 21 (Mo. 1981) (Seiler, J., dissenting) stated:\n\n\"By 'similar cases' is meant similar capital murders, not limited only to those where both death and life imprisonment were submitted to the jury and then affirmed on appeal, whichever way the case went on punishment. The evil deed is the murder and what accompanied it and that, as well as the defendant, is what must be looked at in comparing what one defendant received in punishment under a capital murder charge with what another received. The fact . . . that the state waived the death penalty in [a capital murder defendant's]\n\ncase . . . does not mean that we can ignore his case in making our comparison. Once we accept the idea, as we must, that the death penalty cannot be inflicted at random, or arbitrarily or inconsistently, then necessarily we must take into consideration all capital murders we know about.\" (Emphasis added.)\n\nII\n\nEven if I agreed with the majority that under § 414 (e) (4) the relevant inventory of similar cases is restricted to \"first degree murder cases in which the State sought the death penalty . . . whether it was imposed or not,\" I would not agree with the majority's conclusion \"that the death sentence imposed upon Tichnell was neither excessive nor disproportionate to the penalty imposed in similar cases in Maryland, considering both the crime and the defendant.\"\n\nThis is the first case in which this Court has engaged in proportionality review in order to determine whether a death penalty is excessive or disproportionate. It is, therefore, important that the process be defined.\n\nThe Eighth Amendment concept of proportionality involves more than merely a measure of contemporary standards of decency. It also requires that the magnitude of the punishment imposed be related not only to the degree of harm inflicted on the victim, but also to the degree of the defendant's moral culpability, Enmund, 458 U.S. at 814, 822-25, 102 S.Ct. at 3386, 3390-91 (O'Connor, J., dissenting). The General Assembly has imposed the responsibility of determining whether a death penalty is excessive or disproportionate upon this Court. The aggravating and mitigating circumstances established by the General Assembly represent a legislative judgment that each of those characteristics affects the moral culpability attributable to persons who commit crimes. In making our legislatively mandated comparison, this Court must take each of the relevant distinguishing characteristics into\n\naccount. The General Assembly further directs this Court, after comparing all of the distinguishing characteristics present in similar cases, to determine whether the defendant in a given case warrants the death penalty. Such a determination requires this Court, utilizing all of the applicable legislative judgments with respect to moral culpability, to decide in essence whether a defendant's moral culpability is closer to the moral culpability attributable to those sentenced to death or to those sentenced to life imprisonment. Manifestly, a comparison between the degree of moral culpability attributable to a given defendant in a given case, and that attributable to other similar defendants in similar cases is the core of proportionality review.\n\nIn considering whether a death penalty is excessive or disproportionate, it is necessary to determine whether in similar cases the death penalty is generally imposed throughout the State. Thus, it is necessary to show that the degree of moral culpability attributable to the defendant is at least as great as that attributable to others in similar cases sentenced to death. If it is questionable whether the defendant's moral culpability is at least as great as that of others sentenced to death, the focus of proportionality review necessarily shifts from a determination of whether in similar cases the death penalty has been generally imposed throughout the State, to whether the defendant's moral culpability so far exceeds that of others in similar circumstances sentenced to life imprisonment that the imposition of the death penalty is justified.\n\nThus, the process of proportionality review demands the striking of the most delicate balances -- balances about which reasonable persons may differ. Consequently, it is necessary to proceed with the utmost caution and the greatest care, for in the final analysis, at stake is the delicate balance between the life and death of a human being.\n\nOne difficulty inherent in the proportionality review process, acknowledged by the majority, is the selection of similar cases from the relevant inventory of cases. The majority recognizes \"that dissimilarities exist between Tichnell's case\n\nand those selected for comparative review.\" It laments that \"these cases, as well as others in the inventory, are not more similar to Tichnell's case.\" Notwithstanding these inadequacies in the inventory, the majority feels compelled to \"complete the comparative review process mandated by § 414 (e) (4).\" In so doing, it has determined that there are only five similar cases in the inventory. As a result, the majority has failed to take into account a number of similar cases considering both the crime and the defendant. In my view, there are ten cases in the inventory having distinguishing characteristics similar to those in this case that should be considered here,\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e three of which are considered by the majority.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nIn order to determine whether under § 414 (e) (4) the imposition of the death penalty is excessive or disproportionate, it is necessary to compare similar cases considering both the crime and the defendant. With respect to the circumstances of the crime in this case, the record shows that at approximately 5:25 a.m., Tichnell and a confederate broke into a store for the purpose of stealing guns. The store was not then open and nobody was present. Tichnell's departure from the scene was interrupted by a deputy sheriff whom he shot and killed. When the police discovered the deputy sheriff, he was lying face down near the store. He had been shot seven times and was dead. Of the\n\nseven shots, two were fatal -- one in the lower back and one in the back of the head.\n\nWith respect to the crime committed in this case, the distinguishing characteristics are that Tichnell killed a police officer in an attempt to evade arrest. Moreover, with respect to the defendant in this case, the record shows that the distinguishing characteristic is that Tichnell had not previously been found guilty of a crime of violence.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Consequently, in determining what constitutes a case similar to this case, these distinguishing characteristics must be taken into account.\n\nThe majority has considered only one case in which the death penalty was imposed, Calhoun, Criminal No. 26250, Circuit Court for Montgomery County, filed 12-21-81. The comparative distinguishing characteristics in that case are that a police officer was killed while the defendant was attempting to evade arrest. The judgment in Calhoun, however, is presently pending on appeal.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e More important, unlike Tichnell, in which a police officer was killed during the course of a storehouse breaking, in Calhoun, the police officer was killed during the course of a robbery. This distinction is significant because there is a difference in quality between the crimes of robbery and storehouse breaking.\n\nRobbery involves the taking of property from a person, whereas storehouse breaking involves the taking of property from a place. Based upon this difference, the General Assembly has determined that a killing during the course of a robbery constitutes an aggravating circumstance, § 413 (d) (10), that justifies the imposition of the death penalty, whereas a killing during the course of a storehouse breaking does not. Thus, the General Assembly has expressed its legislative judgment that the degree of moral culpability attributable to a person who kills during the course of a robbery exceeds that attributable to a person who kills during the course of a storehouse breaking. Moreover, although Calhoun's \"background\"\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e was found to be a mitigating circumstance, unlike Tichnell, he had repeatedly\n\nbeen found guilty of crimes of violence.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e This distinction is important too because the General Assembly has frequently asserted that the degree of moral culpability attributable to a recidivist exceeds that attributable to a first-time offender and that a recidivist who commits a crime warrants more severe punishment than a first-time offender who commits the same crime under similar circumstances. See, e.g., Md. Code (1957, 1982 Repl.Vol., \u0026 1983 Cum.Supp.), Art. 27, §§ 293, 366, 558, and 643B.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e In light of this State's public policy, I can only conclude that the degree of moral culpability attributable to a person of Calhoun's background, who has repeatedly been found guilty of crimes of violence and who kills a police officer during the course of a robbery, exceeds that of a first-time offender who kills a police officer during the course of a storehouse breaking. Manifestly, the imposition of the death penalty in Calhoun does not establish that the death penalty is generally imposed throughout the State in cases such as Tichnell's. Consequently, it is necessary to look further.\n\nThe majority itself recognizes that the Calhoun case is insufficient to justify the imposition of the death penalty in this case. Consequently, the majority considers four additional cases that in its view have comparative distinguishing characteristics. In each of these cases life imprisonment was imposed. As a result, the focus of the\n\nmajority's proportionality review necessarily shifts from a determination of whether in similar cases the death penalty has been generally imposed throughout the State, to whether Tichnell's moral culpability so far exceeds that of others in similar circumstances sentenced to life imprisonment that the imposition of the death penalty is justified.\n\nOf the four life imprisonment cases considered by the majority, two are cases in which the comparative distinguishing characteristic is that a police officer was killed. In my view, neither of these cases should be considered here. In Sails, CT 82-352, Circuit Court for Prince George's County, filed 5-24-83, the defendant during the course of a robbery repeatedly shot and ultimately killed a police officer in an effort to avoid arrest. A defense psychiatrist testified that Sails had an antisocial personality and that at the time of the murder he lacked substantial capacity to conform his conduct to the requirements of law. The defendant testified that a short time before the robbery he had taken a \"speedball,\" a mixture of heroin and cocaine, and also had smoked some marijuana. One of the mitigating circumstances found was that at the time of the murder the defendant's capacity was substantially impaired. In my view, a defendant whose capacity was substantially impaired at the time of the commission of the crime is so significantly different from a defendant whose capacity was not impaired, that cases in which such dissimilarities exist are not comparable. For this reason, the Sails case is not similar to the Tichnell case and should not be considered here.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nIn Recek, 5254 Criminal Trial, Circuit Court for Washington County, filed 3-24-80, the remaining case in which the comparative distinguishing characteristic is that a police officer was killed, the defendant, who was Tichnell's accomplice, was sentenced to life imprisonment. There was\n\nevidence to show, however, that Recek was not a principal in the first degree in the killing of the police officer, and the jury's verdict sheet makes clear that it did not believe that Recek was a principal in the first degree. Under these circumstances, Recek was not subject to the death penalty. See § 413 (e) (1). Thus, the Recek case is not similar to the Tichnell case and should not be considered here.\n\nIn any event, the majority itself recognizes that it is not possible to justify the imposition of the death penalty on the sole basis of the three cases upon which it relies in which the comparative distinguishing characteristic is that a police officer was killed. Accordingly, the majority seeks other cases that have other comparative distinguishing characteristics. There are twenty-two cases in the majority's inventory in which the comparative distinguishing characteristic is that a person other than a police officer was killed during the course of a robbery.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e I agree with the majority that eight of those cases should not be considered here.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e With respect to the remaining fourteen cases, the majority, without explanation, determines that only two are similar to this case. In both of these cases, the defendants were sentenced to life imprisonment.\n\nIn Monroe, Criminal No. 26242, Circuit Court for Montgomery County, filed 12-9-82, the defendant, an accomplice of Calhoun's, shot and killed an alarm technician during the course of a robbery in an effort to avoid apprehension. Unlike Tichnell, however, Monroe had previously been found guilty of a crime of violence.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e Nevertheless, the trial court found as a mitigating circumstance that it was unlikely that Monroe would engage in further criminal activity. Additional mitigating circumstances found were that Monroe had previously been employed, had two children,\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e and since his incarceration had made efforts to further his education. In my view, whether the degree of moral culpability attributable to Tichnell, a first-time offender who killed a police officer, exceeds the degree of moral culpability attributable to Monroe, a recidivist who killed a person other than a police officer, is questionable and, therefore, insufficient to justify the imposition of the death penalty.\n\nIn Hughes, Criminal No. 25917, Circuit Court for Montgomery County, filed 4-13-82, the defendant killed a person other than a police officer during the course of a robbery. The defendant had not previously been found guilty of a crime of violence and \"other\" mitigating circumstances were found. The \"other\" mitigating circumstances, however, were not specified by the jury. Although the comparative distinguishing characteristic that a person other than a police officer was killed during the course of a robbery was present, the crime committed was of a somewhat different quality from that committed by Tichnell. Tichnell set out to steal some guns from a store at a time when no one would be present. In contrast, in Hughes, recognized by the majority as being \"the least similar of the cases reviewed,\" the\n\ndefendant set out in broad daylight to gun down and rob the manager of a restaurant who was on his way to deposit the weekend's receipts of approximately $25,000. Accordingly, it is questionable whether the degree of moral culpability attributable to Tichnell exceeds the degree of moral culpability attributable to Hughes.\n\nMonroe and Hughes, the two cases relied upon by the majority in which a person other than a police officer was killed during the course of a robbery, do not justify the imposition of the death penalty in this case. Consequently, it is necessary to look further.\n\nThe majority's inventory contains twelve additional cases in which the comparative distinguishing characteristic is that a person other than a police officer was killed during the course of a robbery. In four of these cases, arbitrarily excluded from consideration by the majority, the death penalty was imposed, while life imprisonment was imposed in eight.\n\nIn Harris, Criminal Case No. 75400, Circuit Court for Baltimore County, filed 9-6-83, during the course of a robbery in a store, the defendant shot the victim, the sole employee present, six times. The defendant had previously been found guilty of a crime of violence.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e In my view, it is questionable whether the degree of moral culpability attributable to a first-time offender who during the course of a storehouse breaking kills a police officer is as great as that attributable to a recidivist who during the course of a robbery kills a person other than a police officer. Under these circumstances, the imposition of the death penalty in Harris does not, in and of itself, establish that the death penalty is generally imposed throughout the State in cases such as Tichnell's. Consequently, it is necessary to look further.\n\nIn Colvin, Criminal No. 25,349, Circuit Court for Anne Arundel County, filed 9-30-81, the defendant during the course of a robbery stabbed the victim twenty-eight times in\n\nher throat. The defendant had previously been found guilty of a crime of violence.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e In my view, the moral culpability of a recidivist who during the course of a robbery commits a murder in a brutal and heinous manner exceeds that of a first-time offender who during the course of a storehouse breaking kills a police officer when unexpectedly threatened with apprehension. Manifestly, the imposition of the death penalty in Colvin does not establish that the death penalty is generally imposed throughout the State in cases such as Tichnell's.\n\nIn Stebbing, Criminal Case No. 7681, Circuit Court for Harford County, filed 6-2-81, the defendant strangled a woman who at the time was being raped by the defendant's husband and thereafter stole the woman's personal possessions.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e The following day the defendant and her husband dumped the victim's partially nude body into a sewer. The defendant had not previously been found guilty of a crime of violence.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e In light of the brutal and heinous manner in which the crime was committed, the imposition of the death penalty in Stebbing does not establish that the death penalty is generally imposed in cases such as Tichnell's.\n\nIn White, Criminal No. 75226, Circuit Court for Baltimore County, filed 5-19-82, the defendant shot the victim who at the time was riding a moped that the defendant was attempting to steal. The defendant had not previously been found guilty of a crime of violence. An additional mitigating\n\ncircumstance, \"environment,\" was found. Although the jury imposed the death penalty, the trial court in its report to this Court determined that the imposition of the death penalty was \"questionable.\" Under these circumstances, the imposition of the death penalty in White can hardly be regarded as establishing that in circumstances similar to those in White the death penalty is generally imposed throughout the State and most assuredly cannot be regarded as establishing that the death penalty is generally imposed throughout the State in cases such as Tichnell's.\n\nHarris, Colvin, Stebbing, and White, four cases presently pending on appeal in which the death penalty was imposed, neither singly nor collectively, are sufficient to justify the imposition of the death penalty in this case. Consequently, it is necessary to look further.\n\nIn all of the remaining eight cases, in which the comparative distinguishing characteristic is that a person other than a police officer was killed during the course of a robbery, the sentence of life imprisonment was imposed. I agree with the majority that five of these cases are not similar to the instant case.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e With respect to the remaining three cases, arbitrarily excluded from consideration by the majority, the focus of proportionality review necessarily shifts from a determination of whether in similar cases the death penalty had been generally imposed throughout the State, to whether Tichnell's moral culpability so far exceeds that of others in similar cases sentenced to life imprisonment that the imposition of the death penalty is justified.\n\nIn Porter, Criminal No. 22,551, Circuit Court for Anne Arundel County, filed 1-2-81, during the course of a robbery,\n\nthe defendant shot and killed a gas station attendant who at the time of the shooting was in a kneeling position. The defendant had not previously been found guilty of a crime of violence and it was found unlikely that he would engage in further criminal activity.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e In my view, whether the degree of moral culpability attributable to Tichnell, who during the course of a storehouse breaking killed a police officer when unexpectedly threatened with apprehension, exceeds the degree of moral culpability attributable to Porter, who during the course of a robbery deliberately executed an innocent victim, is questionable and, therefore, insufficient to justify the imposition of the death penalty. Consequently, it is necessary to look further.\n\nIn the two remaining cases in which the comparative distinguishing characteristic is that a person other than a police officer was killed during the course of a robbery, Tichnell's moral culpability was, in my view, less than that of each of the defendants who were sentenced to life imprisonment, not death. In Green, Ind. No. 18108220-22, Criminal Court of Baltimore City, filed 7-12-82, during the course of a robbery of a restaurant, the defendant and an accomplice repeatedly stabbed two people, tied one of them up, and cut both of the victims' throats. Thus, two aggravating circumstances were present -- a killing during the course of a robbery and the commission of more than one murder arising out of the same incident. Unlike Tichnell, Green had previously been found guilty of crimes of violence.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Nevertheless, the trial court found as a mitigating circumstance that it was unlikely that Green would engage in further criminal activity. An additional mitigating circumstance was that the defendant's conduct was not the sole proximate cause of the two deaths.\n\nIn Johnson, CT 82-377, Circuit Court for Prince George's County, filed 12-1-82, the defendant abducted and robbed a thirteen-year-old girl. Thereafter, he raped her and beat her about the head with a nunchaku.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e After the defendant released the victim, he shot her point blank in the back. The defendant had not previously been found guilty of a crime of violence.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e It was found that the defendant was unlikely to engage in further criminal activity. Additional mitigating circumstances included Johnson's family background, his ability to adjust to a structured environment as evidenced by his school and Air Force experience, the fact that he gave himself up, and that he had leadership qualities that would be helpful to other inmates.\n\nIn Green and Johnson, in each of which persons other than a police officer were killed during the course of a robbery, innocent victims were arbitrarily killed in a brutal and heinous manner under circumstances in which the defendants were not threatened by immediate apprehension. It is for this reason, in my view, that, notwithstanding the various mitigating circumstances, Tichnell's moral culpability is less than that of the defendants in these two cases, both of whom were sentenced to life imprisonment, not death.\n\nI have carefully and conscientiously reviewed the ten cases in the majority's inventory that I deem to be similar to this case. My examination reveals that none of the five similar cases in which the death penalty was imposed, Calhoun, Harris, Stebbing, Colvin, and White, either singly or collectively, establish that the death penalty is generally imposed throughout the State in cases in which a person who had never previously been found guilty of a crime of violence\n\nkills a police officer in an attempt to evade arrest when unexpectedly threatened with apprehension during a storehouse breaking. Accordingly, these five cases are not sufficient, either singly or collectively, to justify the imposition of the death penalty in this case. As a result, the focus of my proportionality review necessarily shifts from a determination of whether in similar cases the death penalty has been generally imposed throughout the State, to whether Tichnell's moral culpability so far exceeds that of others in similar circumstances sentenced to life imprisonment that the imposition of the death penalty is justified.\n\nMy examination of the five similar cases in which life imprisonment was imposed reveals that in three cases, Monroe, Hughes, and Porter, it is questionable whether Tichnell's moral culpability exceeds that of the respective defendants, while in two cases, Green and Johnson, Tichnell's moral culpability is less than that of the respective defendants.\n\nUnder these circumstances, I am not persuaded that Tichnell's moral culpability so far exceeds that of others in similar circumstances sentenced to life imprisonment that the imposition of the death penalty in this case is justified. Thus, even if I agreed with the majority as to the scope of the relevant inventory of similar cases under § 414 (e) (4), I would not find that the death penalty imposed upon Tichnell is justified.\n\nIII\n\nAs a result of the majority's exclusion of \"death-eligible murder cases in which the prosecutor could have, but did not seek the death penalty\" from the relevant inventory of similar cases, I am unable to determine, pursuant to § 414 (e) (4), that the sentence of death imposed upon Tichnell is excessive or disproportionate to the penalty imposed in similar\n\ncases, considering both the crime and the defendant. Moreover, even if I agreed with the majority's restriction of the relevant inventory of similar cases, based upon my statutorily mandated proportionality review, I would hold that the sentence of death in this case is excessive and disproportionate. I therefore would set the sentence aside and remand for modification to life imprisonment.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nAPPENDIX I\n\nSTATISTICAL SUMMARY OF RECORD IN CALHOUN V. STATE RELATING TO PROSECUTORIAL DISCRETION IN DEATH PENALTY CASES\n\nQUALIFYING NOTICES NOTICES ACQUITTAL OF\n\nCASES FILED WITHDRAWN CAPITAL MURDER\n\nMONTGOMERY 10 3 0 0\n\nHARFORD 6 5 2 0\n\nGARRETT 2 2 0 0\n\nALLEGANY 3 3*fn* 2 0\n\nCHARLES 1 0 0 0\n\nWASHINGTON 8 5 5 0\n\nHOWARD 2 2 1 0\n\nANNE ARUNDEL 5 2 0 0\n\nFREDERICK 1 1 0 0\n\nWICOMICO 6 3 1 1\n\nPRINCE GEORGE 19 12*fn* 10 1\n\nWORCESTER 1 0\n\nDORCHESTER 1 1 0 1\n\n*fn** aprox\n\nBALTIMORE CITY 165 4*fn* 1 0\n\nTOTAL 230 43 22 3\n\nPERCENTAGE OF\n\nQUALIFYING CASES IN\n\nCAPITAL PROCEEDINGS LIFE DEATH WHICH CAPITAL\n\nHELD IMPOSED IMPOSED PROCEEDINGS HELD\n\nMONTGOMERY 3 2 1 30%\n\nHARFORD 3 1 2 50%\n\nGARRETT 2 1 1 100%\n\nALLEGANY 1 1 0 33%\n\nCHARLES 0 0 0 0%\n\nWASHINGTON 0 0 0 0%\n\nHOWARD 1 1 0 50%\n\nANNE ARUNDEL 2 1 1 40%\n\nFREDERICK 1 1 0 100%\n\nWICOMICO 1 1 17%\n\nPRINCE GEORGE 1 1 0 5%\n\nWORCESTER 0%\n\nDORCHESTER 0%\n\nBALTIMORE CITY*fn* 3*fn* 2*fn* 1 1.8%\n\nTOTAL 18 12 6 7.8%\n\nPERCENTAGE OF QUALIFYING\n\nCASES IN WHICH DEATH\n\nWAS IMPOSED\n\nMONTGOMERY 10%\n\nHARFORD 33%\n\nGARRETT 50%\n\nALLEGANY 0%\n\nCHARLES\n\nWASHINGTON\n\nHOWARD 0%\n\nANNE ARUNDEL 20%\n\nFREDERICK 0%\n\nWICOMICO 0%\n\nPRINCE GEORGE 0%\n\nWORCESTER\n\nDORCHESTER\n\nBALTIMORE CITY .6%\n\nTOTAL 2.6%\n\n\u003cspan class=\"fn\"\u003e1. Tichnell has appended to his brief an affidavit of his mother, which was executed three months after the death sentence had been imposed on her son. The affidavit states that two jurors approached his mother during the course of the sentencing proceeding, questioned her as to the identity of her companions, and said the information would be helpful in making their decision. Tichnell suggests that this alleged incident has some bearing on his argument that the voir dire was ineffective, although from the discussion in his brief, its significance is unclear. In any event, the affidavit was never presented to the trial court; therefore, it is not before this Court for consideration. See Sturgis v. State, 235 Md. 343, 346, 201 A.2d 681, 682 (1964); Maryland Rule 885.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The provision is made applicable to the states through the Due Process Clause of the Fourteenth Amendment. Benton v. Maryland, 395 U.S. 784, 89 S. Ct. 2056, 23 L. Ed. 2d 707 (1969).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The aggravating circumstances are: \"(1) The victim was a law enforcement officer who was murdered while in the performance of his duties. (2) The defendant committed the murder at a time when he was confined in any correctional institution. (3) The defendant committed the murder in furtherance of an escape or an attempt to escape from or evade the lawful custody, arrest, or detention of or by an officer or guard of a correctional institution or by a law enforcement officer. (4) The victim was a hostage taken or attempted to be taken in the course of a kidnapping or abduction or an attempt to kidnap or abduct. (5) The victim was a child abducted in violation of § 2 of this article. (6) The defendant committed the murder pursuant to an agreement or contract for remuneration or the promise of remuneration to commit the murder. (7) The defendant engaged or employed another person to commit the murder and the murder was committed pursuant to an agreement or contract for remuneration or the promise of remuneration. (8) At the time of the murder, the defendant was under sentence of death or imprisonment for life. (9) The defendant committed more than one offense of murder in the first degree arising out of the same incident. (10) The defendant committed the murder while committing or attempting to commit robbery, arson, or rape or sexual offense in the first degree.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The mitigating circumstances are: \"(1) The defendant has not previously (i) been found guilty of a crime of violence; (ii) entered a plea of guilty or nolo contendere to a charge of a crime of violence; or (iii) had a judgment of probation on stay of entry of judgment entered on a charge of a crime of violence. As used in this paragraph, 'crime of violence' means abduction, arson, escape, kidnapping, manslaughter, except involuntary manslaughter, mayhem, murder, robbery, or rape or sexual offense in the first or second degree, or an attempt to commit any of these offenses, or the use of a handgun in the commission of a felony or another crime of violence. (2) The victim was a participant in the defendant's conduct or consented to the act which caused the victim's death. (3) The defendant acted under substantial duress, domination or provocation of another person, but not so substantial as to constitute a complete defense to the prosecution. (4) The murder was committed while the capacity of the defendant to appreciate the criminality of his conduct or to conform his conduct to the requirements of law was substantially impaired as a result of mental incapacity, mental disorder, emotional disturbance, or intoxication. (5) The youthful age of the defendant at the time of the crime. (6) The act of the defendant was not the sole proximate cause of the victim's death. (7) It is unlikely that the defendant will engage in further criminal activity that would constitute a continuing threat to society. (8) Any other facts which the jury or the court specifically sets forth in writing that it finds as mitigating circumstances in the case.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Section 413 (e) (1) of the statute makes clear that only a principal in the first degree is subject to the death penalty, except where the aggravating circumstance charged is that outlined in § 413 (d) (7). A principal in the first degree \"is one who actually commits a crime, either by his own hand, or by an inanimate agency or by an innocent human agent.\" State v. Ward, 284 Md. 189, 197, 396 A.2d 1041 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The verdict form provides space permitting the sentencing authority to state, in writing, any other mitigating circumstances which it may find in addition to the specifically listed mitigating circumstances outlined in § 413 (g).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Section 414 (b) of the statute requires that the clerk of the trial court, in transmitting the record of the capital sentencing hearing, include the report of the trial judge, which is to contain \"a recommendation by the trial court as to whether or not imposition of the sentence of death is justified in the case.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The \"Committee note\" appended to Rule 772A states that \"[i]n the case of a life sentence the report of the judge is filed with the Clerk of the Court of Appeals only for informational purposes to permit that Court to make the determination in other cases required by Code, Article 27, § 414 (e) (4),\" i.e., the proportionality review provision of the statute.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. See consolidated Supplemental Brief of the Public Defender in Annette Louise Stebbing v. State of Maryland, Nos. 35 and 103, September Term, 1981; Eugene Sherman Colvin v. State of Maryland, Nos. 84 and 114, September Term, 1981; and James Arthur Calhoun v. State of Maryland, No. 129, September Term, 1981 and No. 5, September Term, 1982.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Capital murder is an offense for which the death penalty may but need not be imposed. See Black's Law Dictionary 189 (5th ed. 1979); Ballentine's Law Dictionary 173 (3rd ed. 1969).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The states are: Alabama, Connecticut, Georgia, Idaho, Kentucky, Louisiana, Massachusetts, Mississippi, Missouri, Montana, Nebraska, Nevada, New Hampshire, New Jersey, New Mexico, North Carolina, Ohio, Oklahoma, Pennsylvania, South Carolina, South Dakota, Tennessee, Virginia, Washington, and Wyoming.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The Ross and Horton cases give some indication that occasionally the court compares other murder cases in the courts of its proportionality review.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. See Wash. Rev. Code § 10.95.130 (2) (b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. See Tenn. Code Ann. § 39-2-205 (c) and Supreme Court Rule 12.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The states are: Connecticut, Idaho, Massachusetts, New Hampshire, New Jersey, New Mexico, Ohio, Pennsylvania, South Dakota, and Wyoming. See, however, Com. v. Zettlemoyer, 454 A.2d 937 (Pa. 1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. See Del. Code Ann. Tit. 11, § 4209 (g) (2) a.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Colorado's proportionality review provision is also different from Maryland's but no cases have as yet interpreted that state's law on the\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Legal commentators have expressed the view that the death sentence is comparatively excessive if other defendants with similar characteristics generally receive sentences other than death for committing factually similar offenses in the same jurisdiction. See D. Baldus, C. Pulaski, G. Woodworth and F. Kyle, Identifying Comparative Excessive Sentences of Death: A Quantitative Approach, 33 Stan. L. Rev. 1 (1980). While the authors caution against making the universe of cases so large as to render it impossible to conduct any meaningful proportionality review, they suggest that the case inventory include a sufficient number of potentially similar murder cases where both life and death sentences were imposed. Id. at 7 n. 15; they urge that courts compare, \"at a minimum, . . . the facts and circumstances of the death sentence case under scrutiny with the facts and circumstances of factually similar cases involving similar defendants in which the options available to the sentencing authority included a sentence of death.\" Id. at 5 n. 13.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Compare cases in which the Supreme Court, applying the principle of constitutional proportionality, has declared capital punishment per se excessive in certain circumstances. See Enmund v. Florida, 458 U.S. 782, 102 S. Ct. 3368, 73 L. Ed. 2d 1140 (1982) (death penalty excessive for felony murder when defendant did not take or attempt to take life or intend that a life be taken or that lethal force be used); Coker v. Georgia, 433 U.S. 584, 97 S. Ct. 2861, 53 L. Ed. 2d 982 (1977) (sentence of death disproportionate and excessive punishment for the crime of rape).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. In Roberts, the Supreme Court noted the dangerous nature of the police officer's calling; it indicated that statistics demonstrated that the number of police officers killed in the line of duty more than doubled in the last 10 years. 431 U.S. at 636 n. 3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. In addition to Tichnell's 3 capital sentencing hearings, Timothy Clyde Poole also had 3 capital sentencing hearings. See Poole v. State, 290 Md. 114, 428 A.2d 434 (1981); Poole v. State, 295 Md. 167, 453 A.2d 1218 (1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. See Recek v. State, No. 828, September Term, 1980, Court of Special Appeals, unreported. The evidence in the case clearly indicated that Recek was not a first degree principal in the deputy's murder.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The other mitigating circumstances were that Sails' criminal activity \"had not been characterized by gratuitous and sadistic physical violence against persons\"; that Sails was \"not a sadistic executioner style killer\"; and that his background and upbringing was unstable and \"marked by emotional trauma, neglect and inattention, and which lacked adequate guidance and supervision contributed to his criminal conduct.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. As pointed out in both the Court's opinion and Judge Davidson's dissenting opinion, § 414 (e) (4) was patterned after the proportionality review provision of the Georgia death penalty statute, and, as discussed in Judge Davidson's opinion, the Supreme Court of Georgia has flatly taken the position that \"[w]e do compare cases as to which the death penalty could have been sought by the prosecutor but was not.\" Horton v. State, 249 Ga. 871, 880 n. 9, 295 S.E.2d 281 (1982), cert. denied, U.S. , 103 S. Ct. 837, 74 L.Ed.2d 1030 (1983) (emphasis in the original).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. In that case there was testimony, from 18 of the State's 24 State's Attorneys offices, which showed the extreme differences in the standards employed to decide whether the death penalty will be sought in an eligible case. Judge Davidson's dissenting opinion in the case at bar reviews in some detail the record in the Calhoun case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Such assistance from the Public Defender's Office would appear to be available to any attorney representing in this Court a defendant under a death sentence. Report Of The Public Defender, Fiscal Year 1981, p. 43.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. In his concurring opinion, Judge Cole expresses a preference for a court-promulgated rule requiring each State's Attorney to maintain a file of those cases where the death penalty could have been sought. I have serious doubts that such a rule would be within our rule making authority under Art. IV, § 18, of the Maryland Constitution. Moreover, the proposed rule might also violate Article 8 of the Maryland Declaration of Rights. See, e.g., Duvall v. Lacy, 195 Md. 138, 149, 73 A.2d 26 (1950) (\"there is no authority in the judiciary to control the members of the executive department in carrying out their duties, so long as no plain violation of the Constitution or the law is found to exist\"); Miles v. Bradford, Governor of Maryland, 22 Md. 170, 183-185, 85 Am. Dec. 643 (1864). 1a Empirical studies in this area include: Riedel, Discrimination in the Imposition of the Death Penalty: A Comparison of the Characteristics of Offenders Sentenced Pre-Furman and Post-Furman, 49 Temp.L.Q. 261 (1976); Koeninger, Capital Punishment in Texas, 1924-1968, 15 Crime \u0026 Delinq. 132 (1969); Bedau, Death Sentences in New Jersey, 19 Rutgers L.Rev. 1 (1964); Zimring, Eigen \u0026 O'Malley, Punishing Homicide in Philadelphia: Perspectives on the Death Penalty, 43 U.Chi.L.Rev. 227 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. § 17-10-35 (c) provides in pertinent part: \"With regard to the sentence, the court shall determine: \"(3) Whether the sentence of death is excessive or disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant.\" (Emphasis added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. In order to determine a statute's meaning, a court may consider the statute's legislative history. Scott, 297 Md. at 246, 465 A.2d at 1132; Loscomb, 291 Md. at 429, 435 A.2d at 767; Department of State Planning, 288 Md. at 14, 415 A.2d at 299.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Commentators have also recognized that the efficacy of proportionality review procedures depends upon the thoroughness and accuracy of the review process. Hubbard, Burry, and Widener, A \"Meaningful\" Basis for the Death Penalty: The Practice, Constitutionality, and Justice of Capital Punishment in South Carolina, 34 S.C.L.Rev. 391, 443 (1982); Baldus, Pulaski, Woodworth, and Kyle, Identifying Comparatively Excessive Sentences of Death: A Quantitative Approach, 33 Stan.L.Rev. 1, 21 (1980-81).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Throughout this dissenting opinion, the term \"distinguishing characteristic\" refers to aggravating and mitigating circumstances found by the trier of fact. See Md. Code (1957, 1982 Repl. Vol., 1983 Cum.Supp.), Art. 27, § 413 (d) \u0026 (g).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The prevailing opinion was authored by Justice White and joined by Justices Marshall, Blackmun, and Stevens. Justice Brennan filed a concurring opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Justice O'Connor filed a dissenting opinion in which Chief Justice Burger and Justices Powell and Rehnquist joined.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. In Castell v. State, 250 Ga. 776, 793-94, 795 n. 12, 301 S.E.2d 234, 250, 250 n.12 (1983), the Supreme Court of Georgia in its proportionality review included two cases in which the death penalty was not sought. See Mulkey v. State, 250 Ga. 444, 298 S.E.2d 487 (1983); Reaves v. State, 242 Ga. 542, 250 S.E.2d 376 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. In construing a Maryland statute patterned upon the statute of another state, the judicial decisions of that state, including those rendered after the Maryland enactment, are persuasive authority. James v. Prince George's County, 288 Md. 315, 330, 418 A.2d 1173, 1181 (1980); St. Joseph Hospital v. Quinn, 241 Md. 371, 376, 216 A.2d 732, 735 (1966); Zell v. Safe Deposit \u0026 Trust Co. of Baltimore, 173 Md. 518, 525, 196 A. 298, 301-02 (1938).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. An appellate court may take judicial notice of the record in other cases before it. Dean v. State, 291 Md. 198, 203, 434 A.2d 552, 555 (1981); Jeweler v. Potomac Electric Power Co., 217 Md. 458, 463, 144 A.2d 66, 68 (1958). Consequently, I take judicial notice of the record in Calhoun v. State, (No. 129, Sept. Term, 1981 \u0026 No. 5, Sept. Term, 1982), presently pending before this Court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. See Appendix I, No. 129, Sept. Term, 1981 and No. 5, Sept. Term, 1982, Calhoun v. State, Appendix to Supplemental Brief of Appellants, Vol. I, at 1, Statistical Summary of Record in Calhoun v. State Relating to Prosecutorial Discretion in Death Penalty Cases, Percentage of Qualifying Cases in which Capital Proceedings Held. The term \"qualifying cases,\" used in Appendix I refers to all death-eligible cases including not only those in which the prosecutor sought the death penalty, but also those in which he did not.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. See Appendix I, Capital Proceedings Held, Death Imposed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. See Appendix I, Percentage of Qualifying Cases in which Capital Proceedings Held.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. See Appendix I, Percentage of Qualifying Cases in which Death was Imposed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The prevailing opinions in both Gregg and Proffitt were joined by Justices Stewart, Powell, and Stevens. Chief Justice Burger and Justices White and Rehnquist, in a separate opinion, concurred in the judgments of the Court. Justice Blackmun separately concurred in the judgments of the Court. Justices Brennan and Marshall each separately dissented.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. See Appendix I, Percentage of Qualifying Cases in which Capital Proceedings Held.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. See No. 129, Sept. Term, 1981 and No. 5, Sept. Term, 1982 Calhoun v. State, Joint Record Extract, Vol. IV.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. A construction of a statute, giving rise to doubts as to its constitutionality, should be avoided. Davis v. State, 294 Md. 370, 377, 451 A.2d 107, 111 (1982); Baltimore County v. Missouri Realty, Inc., 219 Md. 155, 159, 148 A.2d 424, 427 (1959); Barrett v. Clark, 189 Md. 116, 127, 54 A.2d 128, 133 (1947).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. See State v. Harris, Criminal Case No. 75400, Circuit Court for Baltimore County, filed 9-6-83; State v. Monroe, Criminal No. 26242, Circuit Court for Montgomery County, filed 12-9-82; State v. Johnson, CT 82-377, Circuit Court for Prince George's County, filed 12-1-82; State v. Green, Ind. No. 18108220-22, Criminal Court for Baltimore City, filed 7-12-82; State v. White, Criminal No. 75226, Circuit Court for Baltimore County, filed 5-19-82; State v. Hughes, Criminal No. 25917, Circuit Court for Montgomery County, filed 4-13-82; State v. Calhoun, Criminal No. 26250, Circuit Court for Montgomery County, filed 12-21-81; State v. Colvin, Criminal No. 25,349, Circuit Court for Anne Arundel County, filed 9-30-81; State v. Stebbing, Criminal Case No. 7681, Circuit Court for Harford County, filed 6-2-81; State v. Porter, Criminal No. 22,551, Circuit Court for Anne Arundel County, filed 1-2-81. Unless otherwise expressly indicated, throughout this dissenting opinion citations to cases in the inventory refer to the Reports of Trial Judges, filed in this Court. See Appendix A to the majority opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. See Calhoun, Monroe, and Hughes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Art. 27, § 413 (g) (1) establishes as a mitigating circumstance that the defendant has not previously been found guilty of a crime of violence. This section provides in pertinent part: \"As used in this paragraph, 'crime of violence' means abduction, arson, escape, kidnapping, manslaughter, except involuntary manslaughter, mayhem, murder, robbery, or rape or sexual offense in the first or second degree, or an attempt to commit any of these offenses, or the use of a handgun in the commission of a felony or another crime of violence.\" Throughout this dissenting opinion, the phrase \"crime of violence\" is defined as it is in § 413 (g) (1). The record additionally shows that Tichnell had not previously been found guilty of any other crime. Moreover, the record shows that Tichnell had been married, had a dependent child, had served in the military for several years, and had been employed at a steel mill until approximately one year before the crime. Although none of these characteristics were found to be mitigating circumstances in Tichnell, some of them were found to be mitigating circumstances in another case in the inventory. See Monroe.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. One of the grounds in Calhoun's pending appeal is that during the sentencing proceeding the jury took impermissible considerations into account in determining whether to impose the death penalty. It should be noted that until the instant case, this Court has not upheld a challenged death penalty in any of the nine consecutive cases decided since the enactment of Art. 27, §§ 413-415. See Scott v. State, 297 Md. 235, 465 A.2d 1126 (1983); Foster v. State, 297 Md. 191, 464 A.2d 986 (1983); Harris v. State, 295 Md. 329, 455 A.2d 979 (1983); Poole v. State, 295 Md. 167, 453 A.2d 1218 (1983); Huffington v. State, 295 Md. 1, 452 A.2d 1211 (1982); Johnson v. State, 292 Md. 405, 439 A.2d 542 (1982); Poole v. State, 290 Md. 114, 428 A.2d 434 (1981); Tichnell v. State, 290 Md. 43, 427 A.2d 991 (1981); Tichnell v. State, 287 Md. 695, 415 A.2d 830 (1980). Similarly, the United States Supreme Court has upheld only one challenged death penalty in fourteen of the fifteen cases decided since Gregg. See Enmund, 458 U.S. at 811 n.23, 102 S.Ct. at 3384 n.23 (1982) (O'Connor, J., dissenting). The death penalty was not upheld in Enmund, 458 U.S. at 782, 102 S.Ct. at 3368; Eddings v. Oklahoma, 455 U.S. 104, 102 S.Ct. 869 (1982); Estelle v. Smith, 451 U.S. 454, 101 S.Ct. 1866 (1981); Bullington v. Missouri, 451 U.S. 430, 101 S.Ct. 1852 (1981); Adams v. Texas, 448 U.S. 38, 100 S.Ct. 2521 (1980); Beck v. Alabama, 447 U.S. 625, 100 S.Ct. 2382 (1980); Godfrey v. Georgia, 446 U.S. 420, 100 S.Ct. 1759 (1980) (plurality opinion); Green v. Georgia, 442 U.S. 95, 99 S.Ct. 2150 (1979) (per curiam); Bell v. Ohio, 438 U.S. 637, 98 S.Ct. 2977 (1978) (plurality opinion); Lockett v. Ohio, 438 U.S. 586, 98 S.Ct. 2954 (1978) (plurality opinion); Coker v. Georgia, 433 U.S. 584, 97 S.Ct. 2861 (1977) (plurality opinion); Roberts v. Louisiana, 431 U.S. 633, 97 S.Ct. 1993 (1977) (per curiam); Gardner v. Florida, 430 U.S. 349, 97 S.Ct. 1197 (1977) (plurality opinion); Davis v. Georgia, 429 U.S. 122, 97 S.Ct. 399 (1977) (per curiam). The death penalty was upheld in Dobbert v. Florida, 432 U.S. 282, 97 S.Ct. 2290 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. In Calhoun the jury found: \"that a substantial mitigating factor is the defendant's background, which has been such that he has never been integrated into society. Therefore, he has been and is unable to conform with its norms and moral values.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Calhoun was convicted of armed robbery in 1971; armed robbery in 1972; armed robbery in 1978; and two armed robberies in 1979. Additionally, the record shows that Calhoun, unlike Tichnell, had never served in the military and had no dependent children.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Section 293 (a), with respect to certain crimes involving controlled dangerous substances, provides: \"Any person convicted of any offense under this subheading is, if the offense is a second or subsequent offense, punishable by a term of imprisonment twice that otherwise authorized, by twice the fine otherwise authorized, or by both.\" (Emphasis added.) Section 366 provides for enhanced punishment for recidivists with respect to crimes relating to lotteries. Section 558 provides enhanced punishment for recidivists with respect to certain crimes relating to theft. Section 643B provides for enhanced punishment for recidivists with respect to crimes of violence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Even if the Sails case were considered, I would find that while Tichnell's moral culpability was greater than that of Sails, it is questionable whether Tichnell's moral culpability so far exceeds that of Sails that the imposition of the death penalty is justified.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. This is the first case in which this Court has engaged in proportionality review. In view of the limited number of cases available for comparison in which a police officer was killed, I agree with the majority that it is necessary to compare the Tichnell case to cases in which the comparative distinguishing characteristic is that an individual other than a police officer was killed during the course of a robbery. It is possible that at some future time the inventory of cases in which the distinguishing characteristic is that a police officer was killed will unfortunately be larger. Thus, there may come a time when comparisons to cases such as Tichnell's may appropriately be limited to cases in which the distinguishing characteristic is that a police officer was killed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. In three of the eight cases, the judgment of the trial court was reversed. Foster v. State, 297 Md. 191, 464 A.2d 986 (1983); Huffington v. State, 295 Md. 1, 452 A.2d 1211 (1982); Poole v. State, 290 Md. 114, 428 A.2d 434 (1981). In three others, the death penalty was vacated and the case was remanded for a new sentencing proceeding. Scott v. State, 297 Md. 235, 465 A.2d 1126 (1983); Harris v. State, 295 Md. 329, 455 A.2d 979 (1983); Poole v. State, 295 Md. 167, 453 A.2d 1218 (1983). One case was remanded to the trial court with directions to vacate the conviction and sentence and dismiss the indictment. Thomas v. State, 294 Md. 625, 451 A.2d 929 (1982). In the remaining case, the death sentence was vacated by the trial court and a new sentencing proceeding is pending. State v. Johnson, Criminal No. 8796, Circuit Court for Harford County, filed 5-5-83.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Monroe was previously convicted of robbery.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. These two distinguishing characteristics were present in Tichnell's case but were not found to be mitigating circumstances.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Harris was convicted of robbery in 1977.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Colvin was convicted of robbery with a deadly weapon in 1972. The record additionally shows that Colvin was convicted of six burglaries in 1960; burglary in 1962; larceny in 1964; burglary in 1964; storehouse breaking in 1969; two assaults in 1973; larceny in 1973; and burglary in 1981. Additionally, the record shows that Colvin had not served in the military.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. I recognize that in Stebbing the robbery was incidental to the rape. Nevertheless, in this first exercise of proportionality review, caution requires that Stebbing be included because it contains the comparative distinguishing characteristic that a person other than a police officer was killed during the course of a robbery.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The record additionally shows that Stebbing was convicted of larceny in 1979.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. In four of these cases, the mitigating circumstance of substantially impaired capacity was found. See Allen, Criminal No. 26,323, Circuit Court for Anne Arundel County, filed 3-21-83; Johnson, Criminal No. 76415, Circuit Court for Baltimore County, filed 5-12-82; Miller, Criminal Trial 2346, Circuit Court for Allegany County, filed 12-9-81; Mayers, Criminal No. 23,921, Circuit Court for Anne Arundel County, filed 11-3-80. In one case, the robbery conviction was reversed by the Court of Special Appeals in an unreported per curiam opinion. See Quickley v. State, (No. 383, September Term, 1981, filed 17 December 1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Additionally, the record shows that Porter had not served in the military.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Green was convicted of two separate incidents of escape, one in May and one in October of 1977. The record additionally shows that Green was convicted of burglary in 1957; receiving stolen goods in 1958; assault and three larcenies in 1959; three larcenies and breaking and entering in 1962; breaking and entering in 1964; burglary in 1966; possession of a deadly weapon in 1969; possession of heroin, forgery, receiving stolen goods, and unauthorized use of a vehicle in 1971; two larcenies in 1972; interstate transportation of a stolen motor vehicle in 1973; and possession of a deadly weapon in 1980.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. A nunchaku is a weapon often used in the martial arts. It \"is a device consisting of two pieces wood, metal, plastic, or other like substance connected by any chain, rope, leather or other flexible material not exceeding 24 inches in length.\" Md. Code (1957, 1982 Repl. Vol.), Art. 27, § 36 (b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. The record additionally shows that Johnson was convicted of assault with a deadly weapon and possession of a prohibited weapon in 1982.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. In light of this conclusion, I need not consider the other issues addressed in the majority opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e* Figures includes disposition of cases which were noted as pending in the Calhoun record.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e** Assistant State's Attorney Gersh was unable to state exactly how many qualifying murders had been charged but stated that there were between 40 and 60 murders charged per year in the 3.3 years of the statute's effectiveness.\u003c/span\u003e\n\n",
    "body_length": 174953,
    "citedas": [
      "468 A.2d 1",
      "297 Md. 432"
    ],
    "attorneys": "Clark B. Frame, with whom was Richard D. Poling on the brief, for appellant. Deborah K. Handel and Stephanie J. Lane, Assistant Attorneys General, with whom was Stephen H. Sachs, Attorney General, on the brief, for appellee. Supplemental argument on January 6, 1983. Clark B. Frame for appellant and Deborah K. Handel, Assistant Attorney General, for appellee.",
    "category": [
      "242",
      "243",
      "36",
      "78",
      "75"
    ],
    "judges": "Murphy, C. J., and Smith, Eldridge, Cole, Davidson, Rodowsky and Couch, JJ. Murphy, C. J., delivered the opinion of the Court, in which Eldridge and Cole, JJ., concur and Davidson, J., dissents. Eldridge, J., filed a concurring opinion at page 477 infra; Cole, J., filed a concurring opinion at page 482 infra; Davidson, J., filed a dissenting opinion at page 485 infra.",
    "citation_count": 33
  }
}
