{
  "id": "oJWzQ2YBTlTomsSBKnFB",
  "document": {
    "title": "IN RE \"AGENT ORANGE\" PROD. LIAB. LITIG.",
    "full_title": "In Re \"AGENT ORANGE\" PRODUCT LIABILITY LITIGATION",
    "jurisdiction": "E.D. New York",
    "date": "1984-09-25T00:00:00.000Z",
    "docket": "381",
    "body": "WEINSTEIN, Chief Judge.\n\nPREFACE AND SUMMARY\n\nIn 1979 a class action was commenced charging the United States government and a major portion of the chemical industry with deaths and dreadful injuries to tens of thousands of Vietnam veterans who came in contact with herbicides used in the war in Southeast Asia. The suit also claimed that as a result of the veterans' exposure, their children suffer severe birth defects. After five years of numerous motions and extensive discovery a tentative settlement was reached on the eve of trial.\n\nThe sole question before this court is whether the case against the chemical companies should now be settled. Eleven days of nationwide hearings were conducted to give the class members themselves an opportunity to be heard on the merits of the settlement. After weighing the uncertainties and legal obstacles that would accompany years of protracted litigation were the case to go to trial, the court has concluded that the settlement should be approved. This approval is subject to reconsideration after further hearings for the reasons indicated below. See the discussion under II, B, 1, j, Inability to Decide Whether to Accept Settlement Without Knowing How it Would be Distributed and How Much Would be Spent in Attorneys Fees.\n\nThe many legal issues are unique and the factual issues unresolved by the scientific communities addressing them. But it is neither fact nor law that makes this decision such a difficult one -- rather, it is the deeply charged emotions that surround and engulf the litigation.\n\nIn listenting to hundreds of witnesses around the country and reading the poignant letters of many veterans, their wives and parents, a repeated refrain makes it clear that more than money is at stake. The veterans feel that out of love of country they went to its aid and fought bravely in a brutal war. In return, they believe, they were sprayed with chemicals that insidiously are destroying them. They were vilified by their countrymen on their return because the war became unpopular.Their perception is that are denied proper treatment by the Veterans Administration to the point where many of them shun the VA's medical and other facilities. Their families suffer as they waste away. And, perhaps even more important, they fear that they have been damaged genetically so that many choose to have no children or live in the despair of having sired children with birth defects who may spread the genetic damage to future generations.\n\nVietnam veterans and their families desperately want this suit to demonstrate how they have been mistreated by the country they love. They want it to give them the respect they have earned. They want it to protect the public against future harm by the government and chemical companies. They want a jury \"once-and-for-all\" to demonstrate the connection between Agent Orange and the physical, mental and emotional problems many of them clearly do suffer.\n\nThe court has been deeply moved by its contact with members of the plaintiffs' class from all over the nation and abroad. Many do deserve better of their country. Had this court the power to rectify past wrongs -- actual or perceived -- it would do so. But no single litigation can lift all of plaintiffs' burdens. The legislative and executive branches of government -- state and federal -- and the Veterans Administration, as well as our many private and quasi-public medical and social agencies, are far more capable than this court of shaping the larger remedies and emotional compensation plaintiffs seek.\n\nWithin the sharply limited judicial role we must ask whether the settlement of the litigation proposed by the parties' representatives is acceptable. For the reasons indicated below we tentatively hold tht it would likely achieve by attempting to litigate to the death. It provides funds to help at least some men, women and children whose hardships will be reduced in some small degree. It does represent a major step in the essential process of reconciliation among ourselves.\n\nThis opinion first summarizes the terms of the settlement and outlines why the settlement as proposed appears reasonable for plaintiffs, defendants and the public. See Introduction, infra. It then sets forth the procedural history of the case, including a summary of opinions already issued by the court on the issues of subject matter jurisdiction, class certification, choice of law and government liability. See, I, Procedural History, infra. The opinion then discusses the Fairness Hearings held by the court to solicit the views of class members on the settlement. In this section the court discusses the legal bases and requirements for class action settlement and the reactions of the class members to the settlement as expressed at the hearings and in other communications to the court. See II, Fairness Hearings, infra.\n\nSections III and IV of the opinion discuss in detail the factual and legal obstacles that would be confronted by both plaintiffs and defendants if the case were to go to trial.\n\nSection III, Factual Problems with Claims, summarizes the evidence that the plaintiffs have adduced in support of their allegations. As the opinion indicates, at best the evidence is inconclusive. This is due in part to the difficulty of proof in any mass toxic tort litigation and in part to the weakness in proof of causal relationship, at least as demonstrated in the epidemiological studies completed to date. Section III concludes with a description of the extensive knowledge the government had in the 1960s concerning the dangers of dioxin.\n\nThe legal relevance of this knowledge is developed in Section IV. Pursuant to the government contract defense, a defendant could avoid liability by showing sufficient government knowledge of the dangers of Agent Orange. The level of government knowledge was such that were the issue put to a jury, there is a substantial probability that defendants would prevail.\n\nOther legal problems posing obstacles to plaintiffs' recovery are also discussed in Section IV, including the Statute of Limitations and the Failure to determine Who Caused Harm and Who Was Harmed. Although a defensible argument can be made in favor of the application to the entire class of a single statute of limitations, it is at least questionable whether an appellate court would accept such a rationale. Thousands of plaintiffs could, therefore, be barrred from recovery, regardless of the merits of the case.\n\nThe portions of section IV on the Failure to Determine Who Caused the Harm and Who Was Harmed deal with two interrelated problems. First, plaintiffs concede that because of the way the different defendants' Agent Orange was mixed before spraying, they are unable to satisfy the traditional tort requirements that they prove not only that they were injured, but also that such injury was caused by an individual defendant. Second, it is likely that because of the epidemiological nature of much of the evidence, no individual plaintiff would be able to prove that his or her particular adverse health effects are due to Agent Orange exposure. It may be possible -- through the use of the class action device -- to overcome this obstacle by making a single, class-wide determination of liability and by distributing the damages charged to all defendants as a grou among all class members on a pro rata basis. At the present time, however, it is doubtful whether the legal system is ready to employ this device except, perhaps, as part of an overall settlement plan voluntarily entered into by the parties.\n\nThe discussion of why the settlement appears to be reasonable concludes with a description of the statutory obligations of the United States to protect and compensate the class. See section V, infra. Government action -- present and potential -- is relevant to the discussion since federal aid for the class bears directly on the overall adequacy of the settlement.\n\nIt is important to emphasize -- as the opinion does in the concluding section -- that a tentative finding that the settlement is fair, reasonable and adequate, is but the first step in granting benefits to class members. Future actions include the awarding of attorneys' fees, the resolution of plaintiffs' and third party claims against the government and, most importantly, the preparation of a plan outlining how the settlement fund will be used to assist eligible class members.\n\nINTRODUCTION\n\nOn May 7, 1984, the date on which jury selection was to begin, plaintiffs, on behalf of a class of Vietnam veterans and members of their families, agreed with defendants to settle their claims against the defendant chemical companies. See Appendix A, Settlement Agreement. Pursuant to the stipulation of settlement, defendnats have agreed to pay to the class $180 million plus interest in a manner directed by the court. Interest began accruing from May 7, 1984, at the rate of some $60,000 per day.\n\nDefendants have not admitted any liability in connection with plaintiffs' claims. Both sides have reserved whatever rights and claims they have against the United States and any person not a party to this class action.\n\nThe mechanics of administering the settlemnt fund will be dealt with in a separate opinion to be issued after further hearings. Some preliminary and tentative conclusions on this subject are set forth in VII, A, Plan for Distribution of Fund, infra. Until such a distribution plan is developed, and hearings are held, a final order approving or disapproving of the settlement is not appropriate.\n\nThe court held extensive hearings on the fairness of the settlement in New York, Chicago, Houston, Atlanta and San Francisco. See Appendix B, Order for Hearings on Fairness of Settlement and Attachments. It heard almost 500 witnesses and considered hundreds of written communications from veterans, members of their families. veterans' organizations and others. It read a large part of the relevant literature, taking judicial notice of its substance. It had the benefit of listening to sound recordings of sessions held by New Jersey's Commission on Agent Orange at various places in that state. It considered the extensive material in the court's files and the many published opinions on the subject. See Appendix C, Published Opinions on \"Agent Orange\" Litigation. Finally, it studied the extensive briefs submitted by counsel and others.\n\nFor the reasons indicated at greater length below, the settlement must be tentatively approved as reasonable under the law. There are many considerations that make this settlement desirable from the plaintiffs' viewpoint. First, the scientific data available to date make it highly unlikely that, except perhaps for those who have or have had chloracne, any plaintiff could legally prove any causal relationship between Agent Orange and any other injury, including birth defects. Second, the law that would need to be established is unique and would almost certainly result in repeated trials and appeals, with the likely ultimate result being no recovery by any plaintiff. Third, the suit was being financed by plaintiffs' lawyers who had already expended millions of dollars in disbursements and time; a full trial, appeals and retrials would have lasted years and would have required the expenditure of many more millions of dollars with serious doubts about the plaintiffs' attorneys' ability to finance the litigation properly. Fourth, benefit to plaintiffs from an ultimate recovery, if any, would not be available for many years. And, fifth, a result adverse to the plaintiffs in the litigation might have an unfavorable impact on evaluation of the Agenct Orange claims by Congress and the responsible executive departments which, in the final analysis, must take responsibility for the medical and other care of servicepersons and their families.\n\nFrom the defendants' point of view the settlement is reasonable: First, defending the case would have cost more tens of millions of dollars in legal fees and expenses plus the time of employees and executives who could be doing more productive work. Second, though slight, there was a possibility of an ultimate finding of liability with claims totalling billions of dollars. Third, an ongoing emotional trial would have created adverse publicity (whether or not unfair), perhaps causing a spillover effect against defendants' other products. Fourth, continued litigation and the possibility of an adverse result has a negative influence on the financial community, causing greater financing expenses as the companies become less attractive to investors. And, fifth, representatives of the defendants, like other Americans, have a sense of compassion and respect for veterans of the Vietnam War and their families who, because of circumstances beyond their control, have been treated with less favor and respect than they should have been. This is a matter of concern to all citizens, including those responsible for defendants' decisions.\n\nFrom the public's point of view, settlement is desirable for three reasons. First, whether or not the defendants have formally admitted some responsibility for defects in their products and for possible injuries to some plaintiffs, the public can justifiably assume, for perhaps the first time, that there is some merit to the claims of those exposed to Agent Orange that they are suffering because of their war and postwar experiences. In any event, the publicity attendant on the settlement and the Fairness Hearings has alerted the nation to the needs of many Vietnam veterans and their families. Second, the bitterness of a long, hard-fought trial is avoided; plaintiffs and members of the public can devote their energies and talents to using the settlement fund to help the class while obtaining further aid from public and private soures. Finally, trial and appeals of this case would require an expenditure of hundreds of thousands of dollars of court funds and engage the time of judges and court personnel for thousands of hours that now can be spent in the administration of other aspects of the criminal and civil justice systems.\n\nThis has been one of the most complex litigations ever brought. Some 600 separate cases have been sent to this district from all over the country with an estimated fifteen thousand named plaintiffs. Millions of pages of documents and hundreds of depositions of witnesses have been collected. The docket sheet of this court has some 400 separate entries respecting these related cases. Hundreds of motions have been heard and hundreds of oral directions given by the court, special master and magistrate in the course of preparing the case for trial. The court, magistrate and special masters have held meetings with counsel from all over the country on an almost daily basis. Hundreds of scientists, government personnel, private executives, lawyers and others have devoted a great deal of time to this litigation. It is unlikely that further expenditure of time and money will be productive. It is time to bring this dispute to a close.\n\nSince practically all the parties are before the court, a binding settlement ending the controversy as to veterans and their families is possible.\n\nThere does remain the question of the government's role. It contends that it expends some $70,000,000 a year to treat those veterans who claim Agent Orange exposure, even though causality has not been shown. Nevertheless those testifying at the Fairness Hearings were almost unanimous in expressing dissatisfaction with the medical services supplied by the government to Vietnam veterans claiming Agent Orange related injuries. The government is also spending some $150,000,000 on research to determine the effects of Agent Orange and of service in Vietnam. Moreover, legislation recently adopted by each house of Congress makes explicity the promise of further aid if a causal connection can be shown. It is, therefore, a matter of some regret to many veterans that the government decided not to participte in any settlement discussions. See Appendix D, Letter of Government, dated April 24, 1984, Refusing to Participate in Discussions. As a result, further discovery, other pretrial preparations and possible trials and appeals continue to burden the parties and the courts, disturb veterans and their families and roil the conscience of the nation.\n\nI. PROCEDURAL HISTORY\n\nOn February 19, 1979, plaintiffs filed a 162-page complaint in this district on behalf of named and unnamed Vietnam veterans and members of their families who claimed to have been injured as a result of the veterans' exposure to various phenoxy herbicides, including Agent Orange. See Dowd v. Dow Chemical Company, 79 C 467. Plaintiffs alleged, among other things, that defendants negligently manufactured and sold to the government for use in Vietnam herbicides that contained 2,3,7,8 tetrachlorodibenzo-p-dioxin (TCDD or dioxin), thought to be one of the most toxic substances known to man. See, e.g., R. Bovey \u0026 A. Young, The Science of 2,4,5-T and Associated Phenoxy Herbicides 134 (1980); United States v. Vertac Chemical Corp., 489 F. Supp. 870, 876 (E.D.Ark.1980); Citizens Against Toxic Sprays, Inc. v. Bergland, 428 F. Supp. 908, 914 (D.Or.1977). Plaintiffs also based their claims on theories of strict liability, breach of warranty, intentional tort and nuisance. According to plaintiffs, the verterans' exposure to TCDD-contaminated herbicides in Vietnam resulted in injuries, such as chloracne, various systemic diseases including soft tissue sarcoma and porphyria cutanea tarda as well as miscarriages to veterans' wives and birth defects in their children. The claims of both sides and the fats are set forth in further detail in the course of this opinion and other opinions by this court and the Court of Appeals referred to infra.\n\nShortly after the first complaint was filed, eight similar cases were transferred to this district by the Judicial Panel on Multidistrict Litigation (MDL Panel) for consolidation of pretrial proceedings. Almost 600 cases originally filed in state and federal district courts throughout the country have been transferred for inclusion in this multidistrict litigation, MDL No. 381.\n\nSimilar actions which have been filed by various civilian plaintiffs have also been transferred to this district by the MDL Panel. At present there are at least six actions involving claims by civilians. The civilian plaintiffs include: a proposed class of civilians alleged exposed to phenoxy herbicides in Vietnam, Thornton v. Dow, C-81-005-JLQ (D.Wash.); a proposed class of thirty-five thousand civilian residents of the County of Kaui, State of Hawaii, who claims exposure to Agent Orange and other phenoxy herbicides during a testing program conducted in 1967, Fraticelli v. Dow, CV No. 82-0021 (D.Hawaii); civilian employees of defense contractors who were alleged exposed to phenoxy herbicides in Vietnam in 1967, Kjome v. Dow, CV 83C-3876 (N.D.Ill.) and Vaughan v. Dow, CV No. 83-1440 (D.Ariz.); a medical doctor who served in Vietnam, in the employ of the State Department, Hogan v. Dow, CV-R-81-410ECR (D.Nev.); and a civilian employee of a contractor exposed to Agenct Orange in 1975, Lester v. Dow, CV No. H-80-587 (S.D.Tex.). These actions by civilians are, therefore, not covered by the settlement. A motion for change in venue in Fraticelli was denied by pretrial order number 37 on August 5, 1982; a motion for remand was denied by the MDL Panel on September 29, 1982 and a motion for remand in this court was denied on July 25, 1984. Discovery has not gone forward in these civilian cases although much of the information gathered in the instant case will be relevant to them. Cf. In re Cenco Inc. Securities Litigation, 434 F. Supp. 1237, 1239 (J.P.M.D.L.1977) (accommodation to special needs of particular cases in multidistrict litigation).\n\nAt the Fairness Hearings a number of class members indicated that they were puzzled by the fact that they had retained counsel to handle their cases near where they lived in other parts of the country, yet the litigation was being conducted in New York. A brief description of the operation of the Judicial Panel on Multidistrict Litigation may be helpful at this point to explain why and how the cases were transferred to the Eastern District of New York. Since 1968, section 1407 of title 28 of the United States Code has provided a means for transferring related cases pending in different districts to a single district for pretrial proceedings. The savings in time and money when many cases are investigated and prepared together for disposition can be enormous.\n\nPursuant to the statute, the MDL Panel may, after notice to the parties in all actions in which transfer is contemplated, transfer civil actions involving common questions of fact for the convenience of the parties and witnesses and to promote the just and efficient conduct of pretrial motions and discovery. 28 U.S.C. § 1407(a). The Panel may proceed under this section on its own initiative or on motion of any party seeking transfer. 28 U.S.C. § 1407(c). A subsequent action involving questions of fact in common with actions previously transferred under section 1407 is called a tag-along action and is conditionally transferred, with notice to parties, on the basis of the harings regarding the previously transferred actions. See Rules 1 and 9 of the Rules of Procedure of the Judicial Panel on Multidistrict Litigation, 89 F.R.D. 273 (1981). Any party opposing transfer of a tag-along action must file a notice of opposition within 15 days and move to vacate the conditional transfer order to prevent transfer without a further hearing. Id.; see e.g., In re Penn Central Securities Litigation, 374 F. Supp. 1400 (J.P.M.D.L.1974).\n\nSection 1407 is designed to promote judicial economy and avoid conflict and duplication in discovery by consolidating related actions for pretrial purposes. 15 C. Wright, A. Miller \u0026 E. Cooper, Federal Practice and Procedure § 3861 (1976). To effectuate these purposes, the transferee court has broad powers in matters relating to mangement of the multidistrict case before it. Weigel, the Judicial Panel on Multidistrict Litigation, Transferor Courts and Transferee Courts, 78 F.R.D. 575, 584 (1978). Once a case has been transferred by the Panel, the transferee court assumes complete jurisdiction for pretrial purposes. It has authority to decide all pretrial motions such as those for summary judgment or approval of a settlement. Weigel, supra, 78 F.R.D. at 582. The transferee court is also authorized to handle matters relating to class action certification in order to prevent inconsistent rulings and to promote judicial efficiency. See In re Piper Aircraft Distribution System Antitrust Litigation, 405 F. Supp. 1402, 1403-04 (J.P.M.L.L.1975).\n\nCertain types of cases are especially suited to MDL treatment, among them, antitrust cases, see, e.g., In re Antibiotic Drugs, 320 F. Supp. 586 (J.P.M.D.L.1970) (transfer of 150 civil antitrust disasters, see, e.g., In re Air Crash Disaster at Boston, Massachusetts on July 31, 1973, 399 F. Supp. 1106 (D.Mass.1975) (consolidation for pretrial proceedings of 54 actions involving claims for damages arising out of use of intrauterine contraceptive devics) and In re Celotex corp. \"Technifoam\" Products Liability Litigation, 68 F.R.D. 502 (J.P.M.D.L.1975) (transfer of 10 actions in which plaintiffs claimed fire losses and structural damages as a result of defects in defendant's insulation material). See also In re Aviation Products Liability Litigation, 347 F. Supp. 1401, 1403 (J.P.M.D.L.1972).\n\nSection 1407 provides that the Panel shall remand each case to the district from which it was transferred at or before conclusion of the pretrial proceedings unless it has already been terminated.28 U.S.C. § 1407(a). Most actions are terminated in the transferee court, often by settlement or by transfer by the transferee court to itself for trial pursuant to section 1404(a) (convenience of parties and witnesses) or section 1406 (proper venue). Weigel, supra, 78 F.R.D. at 583. See, e.g., In re Antibiotic Actions, 333 F. Supp. 299 (S.D.N.Y.1971) (transfer of antitrust actions to home district transferee judge for trial pursuant to section 1404(a)).\n\nCommon to the actions either started in this court or sent here by the MDL Panel are allegations that plaintiffs, principally American, Australian and New Zealand servicemen, wre injured by exposure to Agent Orange or other phenoxy herbicides used as defoilants in Vietnam from 1961 to 1972. In 1980 a class was certified. The nature of a class action and some of its procedural implications are described in this court's prior opinions. See In re \"Agent Orange\" Product Liability Litigation,\" 506 F. Supp. 762 (E.D.N.Y.1980), modified, 100 F.R.D. 718 (E.D.N.Y.1983), mandamus denied, 725 F.2d 858 (2d Cir.), cert. denied, 465 U.S. 1067, 104 S. Ct. 1417, 79 L. Ed. 2d 743 (1984). Further reference to the effect of certifying a class action is made in the body of this opinion, particularly in connection with the discussion of statutes of limitations and indeterminate plaintiffs and defendants, infra.\n\nNotice was given to the class. All members of the class were afforded the option of withdrawing from the class seeking compensatory damages; this option was not granted to the class seeking punitive damages. See 100 F.R.D. 718, 732 (E.D.N.Y.1983).\n\nIn October 1983 the court, after conferring with the parties, ordered the trial to begin on May 7, 1984. To assist the jury in focusing on the problems of causation the plaintiffs were directed to choose ten plaintiffs -- veterans, wives and children -- who had what they considered to be typical injuries, so that their claims would be litigated as characteristic of those of the class.\n\nThe Honorable Shira A. Scheindlin, United States Magistrate, was directed to control the completion of discovery on all issues and assist in preparation of a pretrial order. Special Master Sol Schreiber, Esq., who had been appointed in April 1982, had already supervised much of the discovery on the government contract defense. See 94 F.R.D. 173 (E.D.N.Y.1982).\n\nWith the approval of the parties, in April 1984, Kenneth R. Feinberg, David I. Shapiro, and Leonard Garment, Esqs., all of Washington, D.C, were appointed as Special Masters to assist the parties in settling the case. Special Master Kenneth R. Feinberg had already commenced preliminary work on the issues with the knowledge of the parties tht such work would be going forward.\n\nPlaintiffs' claims against defendants Hooker, Ansul and Occidental were dismissed on the ground that those companies never designed, manufactured or marketed any phenoxy herbicides for use in Southeast Asia. 534 F. Supp. 1046, 1051-52 (E.D.N.Y.1982). For the same reason, defendant Uniroyal Merchandising Company's motion for summary judgment was granted, 537 F. Supp. 977 (E.D.N.Y.1982), and defendants Syntex Corporation, Syntex Laboratories, Inc., Syntex Agribusiness, Inc., and Hoffman-Taff, Inc. (Delaware) and Northeast Industries were dismissed. See 544 F. Supp. 808, 809-10 (E.D.N.Y.1982) and 475 F. Supp. 928, 931 (E.D.N.Y.1979). The dismissal of these defendants as well as Hooker, Ansul and Occidental was conditioned upon each filing with the court a consent to renewal of the action against them by any present or future Agent Orange plaintiffs or class members in the event that the evidence showed that these companies did manufacture and sell Agent Orange to the government for use in Southeast Asia. These defendants also agreed not to raise any statute of limitations defense that included any time that passed between the date of commencement of the first of these actions and any renewal. The summary judgment motions of defendants Riverdale Chemical Company and Hoffman-Taff, Inc. (Missouri) were unopposed and, accordingly, granted. 565 F. Supp. 1263, 1272 (E.D.N.Y.1983).\n\nSummary judgment motions of defendant Hercules, Inc. and defendant Thompson Chemical Corporation were also granted based on plaintiffs' failure to show that these defendnats' products contained dioxin. 565 F. Supp. at 1272-74. In November 1983, the court reconsidered this issue and denied the summary judgment motions of Hercules, Inc. and Thompson Chemical Corporation. Also denied were a number of jurisdictional motions by Thompson Chemical Corporation. Seven companies remain as defendants: Dow Chemical Company, Monsanto Company, Diamond Shamrock Chemicals Company, Hercules, Inc., Uniroyal, Inc., T.H. Agriculture \u0026 Nutrition Company and Thompson Chemical Corporation.\n\nDefendants have denied that the products they manufactured and sold to the government for use in Vietnam caused plaintiffs' injuries. Defendants also contend that to the extent their products caused harm injuries occurred because of misuse by the government. Moreover, their position has been that if any liability exists, the government, not the manufacturers, is responsible because it knew as much or more than the defendnts about possible dangers and assumed responsibility for any ensuing damages.\n\nIt appeared at one point that the government contract defense could be tried separately. See 506 F. Supp. 762, 769 (E.D.N.Y.1980). Later, after further discovery and briefing, it became apparent that a separate trial of the government contract defense was not desirable. 565 F. Supp. 1263, 1265, 1275 (E.D.N.Y.1983). Elsewhere in this opinion, modifying 534 F. Supp. 1046, 1054-58 (E.D.N.Y.1982), are set out the elements of proof which defendnats would have had to meet on the government contract defense. See IV, Nature of Liability and Relation to Defense of Government Knowledge, infra.\n\nDefendants have served third-party complaints upon the United States, seeking indemnification or contribution for monies paid by defendants or plaintiffs' claims. The government moved to dismiss on the grounds that the Feres-Stencel doctrine barred defendants' actions. See Feres v. United States, 340 U.S. 135, 71 S. Ct. 153, 95 L. Ed. 152 (1950); Stencel Aero Engineering Corp. v. United States, 431 U.S. 666, 97 S. Ct. 2054, 52 L. Ed. 2d 665, reh'g denied, 434 U.S. 882, 98 S. Ct. 250, 54 L. Ed. 2d 168 (1977). The government's motion was granted. 506 F. Supp. 762 (E.D.N.Y.1980). Upon reconsideration the government's motion to dismiss defendants' third-party complaints was granted only as to claims made by the veterans and the derivative claims of their family members. 580 F. Supp. 1242 (E.D.N.Y.1984). The government's motion to dismiss was denied insofar as it related to the independent claims of the veterans' wives and children. Id. As indicated in the court's 1980 and 1984 decisions on the issue, the law on the point is far from clear; this uncertainty enhances the desirability of the settlement.\n\nThe third-party complaints against the government for the independent claims of veterans' wives and children are still pending. They are not subject to the proposed settlement of plaintiffs' claims against defendants. In effect, the manufacturers are saying that anything they pay to plaintiffs either by award or settlement is reimbursable by the government. Plaintiffs' Eighth Amended Complaint, filed after the settlement was reached, for the first time seeks to obtain a remedy directly from the government on behalf of the class.\n\nA.Jurisdiction\n\nPlaintiffs originally brought this action pursuant to 28 U.S.C. § 1331, asserting that their claims arose under the statutes and common law of the United States. They argued that a private right of action could be implied from any of four statutes allegedly applicable to their claims: the Federal Insecticide, Fungicide \u0026 Redoenticide Act (FIFRA), 7 U.S.C. §§ 135-135K; the Federal Environmental Pesticide Control Act (FEPCA), 7 U.S.C. §§ 136-136y; the Toxic Substances Control Act (TOSCA), 15 U.S.C. § 2601, et seq. and the Consumer Product Safety Act (CPSA), 15 U.S.C. § 2051, et seq. Analyzing each of these statutes, the court rejected plaintiffs' argument, finding that TOSCA and CPSA expressly exclude pesticides and that no private cause of action can be implied from FIFRA as amended by FEPCA. See 506 F. Supp. 737, 741-42 (E.D.N.Y.1979).\n\nPlaintiffs also contended that federal question jurisdiction existed because defendants had violated the common law of the United States. This court sustained their contention. 506 F. Supp. 737, 749 (E.D.N.Y.1979). The Court of Appeals reversed over a strong dissent, concluding for the purpose of denying federal question jurisdiction, that \"there is [no] identifiable federal policy at stake in this litigation that warrants the creation of federal common law rules.\" 635 F.2d 987, 993 (2nd Cir. 1890), cert. denied, 454 U.S. 1128, 102 S. Ct. 980, 71 L. Ed. 2d 116 (1981). The Court of Appeals held that if the action was to continue in the federal courts, jurisdiction would have to be based on diversity of citizenship pursuant to 28 U.S.C. § 1332. Id.\n\nIn a subsequent decision on appalability of the class certification order, the Court of Appeals pointed out that it had not decided whether the government contract defense was controlled by federal law. In re Diamond Shamrock Chemicals Co., 725 F.2d 858, 861 n. 2 (2d Cir.1984). This reservation has implications discussed below in connection with the substantive law applicable to the case and the general rule of conflicts as well as statutes of limitations. The majority decision by the Court of Appeals at 635 F.2d 987 injected great legal complexity and doubt into the litigation making further appeals after trial a near certainty and increasing the desirability of settlement.\n\nIn their first amended complaint plaintiffs had assertd diversity of citizenship jurisdiction as well as federal question jurisdiction. The court struck the allegation of diversity because the first complaint failed to include the domiciles of plainitffs and the corporate residences of the defendants. See 475 F. Supp. 928, 936 (E.D.N.Y.1979). Plaintiffs reasserted diversity as a jurisdictional basis when they filed their fourth amended complaint in 1983. Since the case was certified as a class action complete diversity was required only as between the named plaintiffs and the defendants. See Snyder v. Harris, 394 U.S. 332, 340, 89 S. Ct. 1053, 1059, 22 L. Ed. 2d 319 (1969); Supreme Tribe of Ben-Hur v. Cauble, 255 U.S. 356, 41 S.ct. 338, 65 L. Ed. 673 (1921). Plaintiffs also alleged that the amount in controversy with respect to each of the individual claims of the representative plaintiffs exceeded $10,000 thus satisfying the requirements of 28 U.S.C. § 1332. See Zahn v. International Paper Co., 414 U.S. 291, 94 S. Ct. 505, 38 L. Ed. 2d 511 (1973).\n\nSubsequent amended complaints designed to avoid various procedural difficulties were filed. The complaint now before the court is styled the Eighth Amended Complaint.\n\nB. Conflicts of Law\n\nCertification of a class in a diversity jurisdiction case such as this does not necessarily provide uniformity in substantive law where the substantive and conflict of law rules of many states may apply. Accordingly, this court examined the choice of law rules of many states may apply. Accordingly, this court examined the choice of law rules of the various states in which the transferor courts sit. See Klaxon Co. v. Stentor Elec. Mfg. Co., 313 U.S. 487, 61 S. Ct. 1020, 85 L. Ed. 1477 (1941); Van Dusen v. Barrack, 376 U.S. 612, 84 S. Ct. 805, 11 L. Ed. 2d 945 (1964). The difficulty in finding any one state's law controlling was readily apparent. Any state's contacts with this case are dwarfed by the national contacts.\n\n\"[T]he United States Government (as distinct from any state of the United States) carried on [the Vietnam] war . . . for national foreign policy and military purposes.\" The exposure of veterans to Agent Orange manufacturedby the defendants \"was incident to carrying out those foreign and military policies. If the . . . injury suffered by\" the veterans \"was caused by the negligence of the\" defense contractors who manufacturred Agent Orange \"expressly for the United States and to its specifications, this is a matter of far greater concern to the United States than to any other State of the United States.\"\n\n580 F. Supp. 690, 712 (E.D.N.Y.1984) (quoting In re Air Crash Disaster Near Saigon, South Vietnam on April 4, 1974, 476 F. Supp. 521, 529 (D.D.C.1979)).\n\nThe conflict of laws opinion analyzed the five most widely used choice of law methodologies and concluded that under any approach utilized today the result, so far as could be predicted, would be the same. Given the strong state-federal interest in equal treatment of Vietnam veterans, the lack of a federal statute of any uniform state statute on the issues, as well as the Second Circuit's opinion denying that federal common law controls here of its own force, the states would look to federal or national consensus substantive law as the only workable approach to resolving the issues in this unusual case. The reasoning is developed at length in the opinion at 580 F. Supp. 690 (E.D.N.Y.1984). It is obvious that since no appellate court has passed on this theory, the probability of appeal and possible reversal or modification is substantial, making settlement more appropriate.\n\nC. Class Action\n\nIn 1980, this court decided that the litigation would proceed as a class action pursuant to Rule 23(b)(3) of the Federal Rules of Civil Procedure. 506 F. Supp. 762, 787 (E.D.N.Y.1980). The basis for the decision was stated at length in the two opinions on the point describing why a class action was the best vehicle to achieve a fair result. Id.; 100 F.R.D. 718 (E.D.N.Y.1983). As the court noted:\n\nA single class-wide determination on the issue of causation will focus the attention of Congress, the Executive branch and the Veterans Administration on their responsibility, if any, in this case. By contrast, possibly conflicting determinations made over many years by different juries make it less likely that appropriate authorities and the parties will arrive at a fair allocation of the financial burden, if any.\n\n100 F.R.D. at 721. It was also pointed out that class certification would make settlement more likely. Id. at 723.\n\nIn addition to its earlier conclusions, this court found that issues of general causation as well as certain defenses were common to the class, that such questions predominated over questions affecting individual members and that \"given the enormous potential size of plaintiffs' case and the judicial economies that would result from a class trial, a class was superior \"for the fair and efficient adjudication of the controversy.\" 100 F.R.D. at 724.\n\nAt the same time a separate class was certified on the issue of punitive damages under Rule 23(b)(1)(B), with no power to opt out. Questions as to the effect of certification under Rule 23(b)(1)(B) on plaintiffs' rights to opt out under Rule 23(b)(3) were reserved. It was decided to permit plaintiffs to exercise their right to opt out pursuant to Rule 23(b)(3) but not to opt out pursuant to Rule 23(b)(1)(B). 100 F.R.D. at 728.\n\nThe class is defined as \"those persons who were in the United States, New Zealand or Australian Armed Forces at any time from 1961 to 1972 who were injured while in or near Vietnam by exposure to Agent Orange or other phenoxy herbicides, including those composed in whole or in part of 2, 4, 5-trichlorophenoxyacetic acid or containing some amount of 2,3,7,8-tetrachlorodibenzo-p-dioxin. The class also includes spouses, parents, and children of the veterans born before January 1, 1984 directly or derivatively injured as a result of the exposure.\" 100 F.R.D. at 729.\n\nAlthough the class certification order was entered on January 16, 1984, notice to the class was not sent until March 9, 1984 because of a stay issued by the Court of Appeals pending decision on defendants' petition for mandamus. The Second Circuit ultimately denied mandamus and vacated its stay. 725 F.2d 858 (2d Cir.1984).\n\nPursuant to this court's certification order personal notice was mailed to several hundred thousand persons. The largest group represented names on file at the Veterans Administration Agent Orange Registry which the Veterans Administration made available to plaintiffs' counsel. A copy of the class order and notice was also sent to the governors of the states asking that the notice be referred to the proper state organization dealing with Vietnam veterans. Cooperation was excellent. Many states gave wide circulation to the notice and others provided a list of names and addresses so the notice could be mailed to those veterans by plaintiffs' counsel.\n\nA court-approved announcement on nationwide television networks and on radio stations with a combined coverage of at least 50% of the listener audience in each of the top 100 radio markets was circulated. The text of that notice can be found in 100 F.R.D. at 734.\n\nThe class notice was also published in three national general circulation newspapers and magazines and six veterans' magazines. Notice was directed to be sent to the 10 largest circulation newspapers in Australia and the five largest circulation newspapers in New Zealand. The text of the newspaper and magazine notice can be found 100 F.R.D. at 734-35. Informal notice through the news media was wide-spread.\n\nFinally, plaintiffs were authorized to arrange a toll-free \"800\" telephone number. Callers were to be told where to write to obtain more information concerning the litigation. The names and addresses of those calling were to be taken and those requesting a copy of the notice mailed to class members were to be sent one. A large number of peopled called the \"800\" number. Their names are in the files of the court.\n\nThe notice to class members included a Request for Exclusion Form to be completed by anyone wishing to be excluded from the class. Exclusion forms were to be received by the Clerk of the Court on or before May 1, 1984. As of May 6, 1984, 2440 requests for exclusion had been received. This number should be compared to the 2,400,000 persons who, it is estimated, served in the American, Australian and New Zealand Vietnam forces. The number of persons from the group believed to have had some chance of exposure to Agent Orange has been variously estimated as between 600,000 and 2,400,000.\n\nAs of the middle of July 1984 some 600 persons who had previously opted out asked to be reinstated as members of the class. More such communications are expected as a result of the public hearings even though they were to be filed by July 15. The court will consider such late applications to rejin the class sympathetically.\n\nFollowing the settlement, but prior to the Fairness Hearings, counsel for a number of those who had not opted out moved to certify a subclass of those members of the class who object to terms of the settlement and to appoint counsel to represent the subclass. Cf. 534 F. Supp. 1046, 1052-53 (E.D.N.Y.1982). The court denied the motion orally on July 25, 1984. Attorneys and objecting members of the class were free to write to the court and to appear at the Fairness Hearings to explain their views. See II A, Fairness Hearings, Legal Requirements, infra. No purpose would have been served by appointing counsel for a subclass of disappointed claimants except to increase expenses to the class and delay proceedings. Cf. Parker v. Anderson, 667 F.2d 1204, 1208 (5th Cir.), cert. denied, 459 U.S. 828, 103 S. Ct. 63, 74 L. Ed. 2d 65 (1982) (10 of 11 named plaintiffs who objected to settlement and insisted on satisfaction of their individual claims named as part of new subclass).\n\nD. Status of the Third-Party Complaints\n\nDefendnats' third-party action against the United States for indemnity and contribution on the independent claims of veterans' wives and children is still pending. See 580 F. Supp. 1242 (E.D.N.Y.1984). The Court of Appeals denied the government's petition for a writ of mandamum seeking review of this court's February 1984 decision not to strike defendants' third-party claims. 733 F.2d 10 (2d Cir.1984). Subsequently the government filed several motions with the Court of Appeals for rehearings, permission to proceed with an intermediate appeal and for a stay of the trial of the third-party claims which was then scheduled to begin on May 7, 1984. On May 4, 1984, the Court of Appeals stayed the trial of the third-party claims until May 8. On May 8 that court extended its stay. On May 23 the government moved in this court for a stay of all proceedings pending disposition of its appeal to the Court of Appeals. That motion was denied. On June 22, the Court of Appeals indefintely stayed the trial of the third-party claims and this court then stayed further discovering pending a decision by the Court of Appeals on appealability. The appeal was dismissed for lack of jurisdiction in the Court of Appeals on September 21, 1984. See In re \"Agent Orange\" Product Liability Litigation, 745 F.2d 161 (2d Cir.1984).\n\nThe defendnts have conducted an enormous amount of discovery of the government in preparing the government contract defense. Since an early stay on discovery was lifted in 1980, 506 F. Supp. 762, 797 (E.D.N.Y.1980), the United States has attended these depositions and, in many cases, represented the deponents. See 99 F.R.D. 338 (E.D.N.Y.1983) (approving Special Master's recommendation to permit government counsel appearing as counsel for former employees to review personal files of former employees for relevance as well as privilege claims).\n\nA principal focus of discovery was on an element of the government contract defense -- the extent of the government's knowledge of alleged hazards relating to the use of Agent Orange. More than 200 depositions were taken of former or current government employees, including military personnel, ranging from generals to privates. Rooms filled with military documents and other governmental records pertaining to the Vietnam War were made available for inspection by the parties, and hundreds of thousands of pages of government documents, many of which were formerly considered classified, were produced for the parties. Pursuant to pretrial discovery orders, and on consent of the government employees and the vast bulk of documents produced by the government are not subject to any protective order and are open to public scrutiny.\n\nMany other depositions were taken of selected plaintiffs and of scores of expert witnesses from each side. In addition, a large file of defendants' records was amassed.\n\nOriginally no separate trial of the third-party claims against the government was envisioned. These claims were to be heard by the same jury deciding the claims of plaintiffs against defendants. Since no jury is permitted in Federal Tort Claims Act cases against the government, the jury would be sitting in an advisory capacity to the judge. Any discovery which the government had not completed as of May 7, 1984 was to have been conducted during the trial of the main action pursuant to a schedule worked out by the Magistrate and the parties.\n\nAfter settlement of the controversy between plaintiffs and defendants, the parties were informed that trial of the defendants' indemnification claims against the government would be scheduled for September 1984. At a pretrial conference on May 29, 1984, on the assumption that the Court of Appeals' stay of trial would be lifted promptly, the Magistrate, at the court's direction, set a new schedule for discovery in the third-party action. Since, however, the government's appeal was not decided until September 21, 1984 it was not possible to complete discovery or to try the third-party claims in September 1984 as scheduled.\n\nOn May 4, 1984, defendant Diamond Shamrock moved in this court for reconsideration of so much of the February 16 decision as dismissed third-party claims against the government. Diamond Shamrock's motion was premised upon claims arising under the Tucker Act for breach of contract. Oral argument on that motion was scheduled to be heard after the Court of Appeals decided the government's appal on third-party claims.\n\nThere was substantial doubt about whether the Court of Appeals has jurisdiction to hear an appeal from a district court's order denying dismissal of a complaint. See In re \"Agent Orange\", 733 F.2d 10, 14, (2dCir.1984). Accordingly, by letter dated May 24, 1984, the government inquired anew whether the district court would certify its ruling refusing to dismiss third-party claims against the government under 28 U.S.C. § 1292(b) to permit an immediate interlocutory appeal. The application was denied on May 25. The court pointed out that a prompt trial or other disposition was in the public interest and was consistent with efficient judicial management of these protracted proceedings.\n\nII. FAIRNESS HEARINGS\n\nA. Legal Requirements\n\nRule 23(e) of The Federal Rules of Civil Procedure provides that a class action may not be settled without approval of the court and notice to members of the class. The procedure (1) assures that any person whose rights would be affected by settlement has the opportunity to support or oppose it, Pearson v. Ecological Science Corp., 522 F.2d 171, 176-77 (5th Cir.1975), cert. denied, 425 U.S. 912, 96 S. Ct. 1508, 47 L. Ed. 2d 762 (1976); (2) prevents private arrangements that may constitute \"sweet-heart deals\" contrary to the best interests of the class, Dam, Class Actions: Efficiency, Compensation, Deterrence and Conflict of Interest, 4 J. of Legal Stud. 47, 57 n. 19, 58 (1975); (3) protects the rights of these whose interests may not have been given due regard by the negotiating parties, Armstrong v. Board of School Directors, 616 F.2d 305, 313 (7th Cir.1980); Alliance to End Repression v. City of Chicago, 561 F. Supp. 537, 548 (N.D.Ill.1982); and finally, (4) assures each member of the class that his or her integrity and right to express views and be heard on matters of vital personal interest has not been violated by others who have arrogated to themselves the power to speak and bind without consultation and consent.\n\nThe court's role in reviewing the proposed settlement is \"as a fiduciary . . . serv[ing] as a guardian of the rights of absent class members.\" Grunin v. International House of Pancakes, 513 F.2d 114, 123 (8th Cir.), cert. denied, 423 U.S. 864, 96 S. Ct. 124, 46 L. Ed. 2d 93 (1975). \"Voluntary out of court settlement of disputes is \"highly favored in the law.\" Wellman v. Dickinson, 497 F. Supp. 824, 830 (S.D.N.Y.1980), aff'd. 647 F.2d 163 (2d Cir.1981). The court will not, therefore, substitute its own judgment for the good faith negotiations of experienced counsel.\n\nBecause the settlement, if approved, will have res judicata effects on all class members, due process requuires that notice of the proposed settlement is given to members of the class. Grunin v. International House of Pancakes, 513 F.2d 114, 120 (8th Cir.), cert. denied, 423 U.S. 864, 96 S. Ct. 124, 46 L. Ed. 2d 93 (1975). See also Mullane v. Central Hanover Bank \u0026 Trust Co., 339 U.S. 306, 70 S. Ct. 652, 94 L. Ed. 865 (1950). But see Manual for Complex Litigation § 1.45 at 51-52 (5th ed. 1981) (suggesting that failure to send notice of proposed settlement may not necessarily prejudice the rights of absent class members in view of Rule 23's requirement that the court approve any settlement). Cf. Trist v. First Federal Savings \u0026 Loan, 89 F.R.D. 1 (E.D. Pa.1980) (in an antitrust class action, the court approved settlement for damages and other relief and refused to exclude from the class persons to whom notice of the proposed settlement was not sent).\n\nWhile an objector cannot opt out of a settlement he or she feels is unfavorable, notice provides an opportunity to class members to make their objections known to the court and enables both objectors and supporters to bring to the court's attention relevant facts concerning the settlement. See Mendoza v. United States, 623 F.2d 1338, 1348 (9th Cir.1980). The number and nature of objections may reflect, to some extent, the adequacy of class representation, which is a factor in determining whether the settlement is fair. See Malchman v. Davis, 706 F.2d 426, 433 (2d Cir. 1983); In re Federal Skywalk Cases, 97 F.R.D. 3880 (W.D.Mo.1983). In this case there were many objections to the settlement and to the failure of class counsel to consult adequately with members of the class, see II, B, Reaction of Class Members, infra, but a substantial number were based on a lack of a full appreciation of the case's legal and factual problems and the mechanics of mass tort litigation.\n\nThe manner of giving notice of the proposed settlement is left to the discretion of the trial court by Rule 23(e). The notice must describe the settlement sufficiently to offer an opportunity to class members to present their objections. Weinberger v. Kendrick, 698 F.2d 61, 70 (2d Cir.1982), cert. denied, 464U.S.818, 104 S. Ct. 77, 78 L. Ed. 2d 89 (1983); Mullane v. Central Hanover Bank \u0026 Trust Co., 339 U.S. 306, 314, 70 S. Ct. 652, 657, 94 L. Ed. 865 (1950). Notice must be \"scrupulously neutral,\" expressing no opinion on the merits or amount of settlement. Grunin v. International House of Pancakes, 513 F.2d 114, 122 (8th Cir.), cert. denied, 423 U.S. 864, 96 S. Ct. 124, 46 L. Ed. 2d 93 (1975), quoting Philadelphia Housing Authority v. American Radiator \u0026 Standard Sanitary Corp., 323 F. Supp. 364, 378 (E.D.Pa.1970). Due process does not require that a copy of the settlement agreement itself be attached to the notice. Grunin v. International House of Pancakes, 513 F.2d at 122. A general description of the settlement terms is sufficient. Weinberger v. Kendrick, 698 F.2d at 70. The \"options open to dissenting class members\" in connection with the proceedings regarding the fairness determination must be apparent. Air Lines Stewards and Stewardesses Ass'n v. American Airlines, Inc., 455 F.2d 101, 108 (7th Cir.1972). In this case both the settlement agreement and a description were included to enhance communication with the class.\n\nFinally, the notice should be given a reasonable time before the court determines whether or not to approve the settlement in order to permit members of the class to investigate and reflect on the matter before taking a position. What is a reasonable time varies from case to case. In Grunin v. International House of Pancakes, 513 F.2d 114 (8th Cir.), cert. denied, 423 U.S. 864, 96 S. Ct. 124, 46 L. Ed. 2d 93 (1975), notice of the proposed settlement was given only 19 days before the court held a hearing on fairness. In Greenfield v. Villager Industries, Inc., 483 F.2d 824 (3d Cir.1973), the court allowed one month between notice and hearing. Here some three months' notice of the settlement hearings was given to the class. Moreover, additional communications to the court are still possible since a final decision has not yet been reached.\n\nThe Manual for Complex Litigation recommends that before sending notice a court decide whether the settlement is within the range of possible approval and suggests that the court hold a preliminary hearing for this purpose. Manual for Complex Litigation § 1.46 (5th ed. 1981); see In re General Motors Corp. Engine Interchange Litigation, 594 F.2d 1106, 1133 (7th Cir.1979), cert. denied, 444 U.S. 870, 100 S. Ct. 146, 62 L. Ed. 2d 95 (1979). Such a preliminary hearing is designed to avoid wasting time and money when a proposed settlement does not approach fairness. See Manual for Complex Litigation § 1.46 (5th ed. 1981). This court implicitly found that the settlement was within the range of possible approval before notifying the class. A preliminary hearing was not required because the court had closely followed the settlement negotiations. Settlement was proposed only after intensive negotiations between counsel for all defendants and every member of the Plaintiffs' Management Committee. They were assisted by neutral settlement masters appointed by the court. Negotiations took place over a period of several days culminating in the proposed settlement on the morning the parties were scheduled to go to trial. Obviously both sides had developed substantial evidence by that time and were fully aware of the strengths and weaknesses of their cases.\n\nIn deciding whether to approve the settlement the court must have a sufficient grasp of the facts and the law involved in the case in order to make a sensible evaluation of the litigation's prospects. See Malchman v. Davis, 706 F.2d 426, 433 (2d Cir.1983). An appreciation of the probabilities of plaintiffs' recovery after a trial and the possible range of damages is essential. The cases caution, however, that the court \"should not . . . turn the settlement hearing \"into a trial or rehearsal of the trial\".\" Flinn v. FMC Corp. 528 F.2d 1169, 1172 (4th Cir.1975), cert. denied, 424 U.S. 967, 96 S. Ct. 1462, 47 L. Ed. 2d 734 (1976), quoting Teachers Ins. \u0026 Annuity Ass'n of America v. Beame, 67 F.R.D. 30, 33 (S.D.N.Y.1975). See also Malchman v. Davis, 706 F.2d 426, 433 (2d Cir.1983). Thus the trial court has a limited scope of review for determining fairness. The very purpose of settlement is to avoid trial of sharply disputed issues and the costs of protracted litigation. Haudek, The Settlement and Dismissal of Stockholders' Actions -- Part II: The Settlement, 23 Sw.L.J. 765, 795 (1969); Newman v. Stein, 464 F.2d 689, 691-92 (2d Cir.), cert. denied, 409 U.S. 1039, 93 S. Ct. 521, 34 L. Ed. 2d 488 (1972).\n\nThe court may limit its fairness proceeding to whatever is necessary to aid it in reaching a just and informed decision. Flinn v. FMC Corp., 528 F.2d at 1173. An evidentiary hearing is not required. Malchman v. Davis, 706 F.2d at 434; Patterson v. Stovall, 528 F.2d 108, 112 (7th Cir.1976). Typically, however, courts hold a hearing so that objectors to the settlement may make their views known. See, e.g., City of Detroit v. Grinnell Corp., 495 F.2d 448, 462-64 (2d Cir.1974).\n\nIt has been argued that approval of a settlement should in theory turn on whether the group consents, instead of on how close or far the proposed settlement is from an \"imagined\" judgment. See Fiss, Against Settlement, 93 Yale L.J. 1073, 1082 (1984), reprinted in G. Friedman, J. Himmelstein, H. Lesnick, C. Menkel-Meadow \u0026 L. Riskin, Beyond the Adversary Model, Materials on Mediation and Alternative Approaches to Law Practice 196 (1984). But an approach requiring consent cannot be followed in most cases, including the instant one, for practical reasons. A democratic vote by informed members of the class would be virtually impossible in any large class suit. The costs of ensuring that each member of the class in this case fully understood the issues bearing on settlement and then voted on it would be prohibitive and the enterprise quixotic. Even though hundreds of members of the class were heard from, there was an overwhelmingly large silent majority. In the final analysis there was and can be no \"consent\" in any meaningful sense. This is an inherent conceptual problem of the class action, but in considering the matter it must be remembered that without the class action controlled by attorneys for the class there could be no recovery in many instances where a viable lawsuit is clearly in the public interest.\n\nIn the usual settlement in a non-class proceeding the parties on both sides voluntarily enter into a compromise of their differences. A party may or may not feel a certain reluctance in giving up its claims or agreeing to pay some amount of money, but each party has determined for itself that settlement is preferable to going forward with the suit. Individual members are represented in settlement as in all other phases of the litigation by counsel to the representative parties. See, e.g., In re \"Agent Orange\" Product Liability Litigation, 100 F.R.D. 718, 721 (E.D.N.Y.1983), mandamus denied, 725 F.2d 858 (2d Cir.), cert. denied, 465 U.S. 1066, 104 S. Ct. 1417, 79 L. Ed. 2d 743 (1984).Few members of the class know \"their\" counsel or have any special reason to have confidence in them. Those class members must, in the ultimate analysis, depend upon the court's impartiality and judgment.\n\nIt is apparent, therefore, that while some members of the class object strongly to any settlement to which they did not consent on the ground that they are being deprived of a due process right to an adjudication of individual claims by a jury, this objection cannot prevent a final settlement. The court is sympathetic to these views but individual rights must yield in this instance or the substantial benefits of class actions to other memberrs of the class and to the public will be lost.\n\nRule 23 does not set out any standard for approval of class action settlements. The cases state in general terms that the settlement should be fair, reasonable and adequate. West Virginia v. Chas. Pfizer \u0026 Co., 440 F.2d 1079, 10805 (2d Cir.) cert. denied, 404 U.S. 871, 92 S. Ct. 81, 30 L. Ed. 2d 115 (1971), aff'g 314 F.Suppp. 710 (S.D.N.Y.1970); Walsh v. Great Atlantic \u0026 Pacific Tea Co., Inc., 726 F.2d 956, 965 (3d Cir.1983). Fairness, reasonableness and adequacy must be judged in light of the \"totality of the circumstances.\" Grunin v. International House of Pancakes, 513 F.2d at 124.\n\nSeveral factors have emerged to guide the courts in determining whether a settlement is fair, reasonable and adequate. See, e.g., McGough \u0026 Lerach, Termination of Class Actions: The Judicial Role, 33 U.Pitt.L.Rev. 445 (1972). In City of Detroit v. Grinnell Corp., 495 F.2d 448 (2d Cir.1974), the Second Circuit set out the following oft-cited factors that a trial court should consider: \"(1) The complexity, expense and likely duration of the litigation,\" id. at 463 -- here complexity and expense are enormous and the litigation would extend over the years. \"(2) [T]he reaction of the class of the settlemlent,\" id. -- this class was divided; of those who addressed the court, a majority opposed the settlement. \"(3) [T]he stage of the proceedings and the amount of discovery completed,\" id. -- the case was about to be tried and almost all discovery was completed. \"(4) [T]he risks of establishing liability,\" id. -- liability is almost impossible to establish. \"(5) [T]he risks of establishing damages,\" id. -- damages could easily be shown. \"(6) [T]he risks of maintaining the class action through the trial,\" id. -- this could be accomplish although it would be difficult in view of the great expense to the class attorneys. \"(7) [T]he ability of the defendants to withstand a greater judgment,\" id. -- there is no doubt about the defendants' great resources. \"(8) [T]he range of reasonableness of the settlement fund in light of the best possible recovery,\" id. -- the maximum recovery was great but no recovery was more likely. Finally, \"(9) the range of reasonableness of the settlement fund to a possible recovery in light of all the attendant risks of litigation,\" id. -- the settlement is well within the range of reasonableness in view of all the relevant factors.\n\nThe most important consideration is the strength of plaintiffs' case on the merits weighed against the amount offered in settlement. 7A C. Wright \u0026 A. Miller, Federal Practices and Procedure § 1797 (1972); City of Detroit v. Grinnell Corp., 495 F.2d 448, 455 (2d Cir.1974); West Virginia v. Chas. Pfizer \u0026 Co., 440 f.2d 1079, 1085 (2d Cir.), cert. denied, 404 U.S. 871, 92 S. Ct. 81, 30 L. Ed. 2d 115 (1971). The weakness of plaintiffs' case, the availability of defenses to the suit,and the risks of establishing liability and damages at trial must be factored into this balance. See City of Detroit v. Grinnell Corp., 495 F.2d at 457; Alliance to End Repression v. City of Chicago, 561 F. Supp. 537, 548-49 (N.D.Ill.1982). The costs of continued litigation, see City of Detroit v. Grinnell Corp., 495 F.2d at 457, and the effect of an adverse judgment after rejection of the settlement are also relevant. See Wellman v. Dickinson, 497 F. Supp. 824, 830 (S.D.N.Y.1980); In re Scientific Control Corp., 80 F.R.D. 237, 242 (S.D.N.Y.1978).\n\nThe dollar amount of the settlement by itself is not decisive in the fairness determination. The fact that the settlement amount may equal but a fraction of potential recovery does not render the settlement inadequate. Dollar amounts are judged not in comparison with the possible recovery in the best of all possible worlds, but rather in light of of the strengths and weaknesses of plaintiffs' case. See, e.g., Flinn v. FMC Corp., 528 F.2d 1169, 1172-73 (4th Cir.1975); City of Detroit v. Grinnell Corp., 495 F.2d 448, 455 (2d Cir.1974). As the Grinnell court noted, \"there is no reason, at least in theory, why a satisfactory settlement could not amount to a hundredth or even a thousandth part of a single percent of the potential recovery.\" Id. at 455 n.2. As the Fairness Hearings demonstrated, the settlement amount would not begin to cover the total costs of medical treatment for the class which easily could amount to billions of doldlars. Ultimately the government will have to make the political and social decision to pay these costs for veterans and their families, as it has already begun to do. This is not unfair since the United States of America ordered the production and use of the Agent Orange.\n\nA second major set of factos for the court's consideration focuses on the process of negotiations which culminate in the proposed settlement. These include the absence of collusion in reaching th settlement and whether the interests of all class members were adequately considered. Parker v. Anderson, 667 F.2d 1204 (5th Cir.), cert. denied, 459 U.S. 828, 103 S. Ct. 63, 74 L. Ed. 2d 65 (1982); Malchman v. Davis, 706 F.2d 426, 433 (2d Cir.1983); In re General Motors Corp. Engine Interchange Litigation, 594 F.2d 1106 (7th Cir.1979); In re Federal Skywalk Cases, 97 F.R.D. 380, 386 (W.D.Mo.1983). Cf. Ace Heating \u0026 Plumbing Co. v. Crane Co., 453 F.2d 30, 33 (3d Cir.1971) (negotiating process does not require as strict scrutiny when settlement does not require as strict scrutiny when settlement for class has been negotiatd by court-approved class counsel as when it has been negotiated by counsel not so approved). Here negotiations and settlement discussions were observed by Special Masters accountable to the court insuring against any selling out of the class for the benefit of insiders.\n\nA third set of factors utilized in the fairness determination concerns the reaction to the settlement, including the amount of opposition to and support for the settlement, and the opinions of the class members and their counsel. City of Detroit v. Grinnell Corp., 495 F.2d at 463. At least one court has cited the impact of the settlement on the community as a factor to be considered. See In re Federal Skywalk Cases, 97 F.R.D. 380 (W.D.Mo.1983). The court has given these factors extended consideration. A large portion of the Fairness Hearings was devoted to the impact of the settlement on members of the class and the community. After giving these matters full weight, the court finds they support settlement. The strong opposition of a considerable number of sincere and well-motivated members of the class cannot, under these circumstances, be decisive.\n\nNotice of the proposed settlement was mailed to all class members to whom notice of the pendency of the class action was sent, as well as to all persons whose names and addresses were provided to the Management Committee through the \"800\" telephone number. See Appendix B. Notice was also published in many newspapers and magazines. The notice generally described the litigation and the terms of the settlement and included a copy of the settlement agreement itself. See Appendix B. It invited written communications and announced that this court would be holding hearings in five cities across the country to consider the fairness of the settlement and indicated the dates on which these hearings would be held. The notice also announced the date on which this court would hold a hearing to consider attorneys' fee applications. In addition the mailed notice contained a claim form to be filled out by any class member (or representative) who believes he or she suffers or suffered from adverse health effects related to exposure to Agent Orange. The published notice advised class members where to write for this claim form. Over 400,000 copies of this notice have been distributed, although some class members have received more than one notice since the names were taken from overlapping lists supplied by various sources.\n\nThe Fairness Hearings revealed that the settlement was widely discussed by veterans groups and public commissions as well as other state officials. There were widespread reports on, and discussions of, the settlement in newspapers, and on radio and television. Undoubtedly there were some who were not aware of the case or its proposed termination, but this group is probably small. Notice must be deemed adequate.\n\nThe notice of proposed settlement did not contain the final plan for distribution of the settlement fund. Rather, it outlined the basic elements of the plan that the Plaintiffs' Management Committee has indicated it will propose to the court. As outlined the plan must allocate a portion of the settlement fund for payment of claims for manifested illnesses and another portion for future payments to class members who have not as yet suffered adverse health effects. The fund will also provide assistance to children of veterans exposed to Agent Orange including those not yet born who wish to join the class.\n\nA complete distribution and administration plan will be presented. Until submitted and approved by the court following public hearings, no final order approving or disapproving the distribution will be issued. An appealable order will, however, be entered shortly after fees are fixed to allow appeals challenging the settlement and fees orders. This delay is in accord with the views expressed by some at the Fairness Hearings that a final order is not appropriate until members of the class know the amount of attorneys' fees and the elements of the distribution plan have begun to be considered.\n\nAlthough a formal order of the court approving or disapproving the settlement will be held in abeyance, this cautionary step is not required. Approval of the settlement amount does not depend on approval of the distribution plan. See In re Chicken Antitrust Litigation, 560 F. Supp. 957, 959 (N.D.Ga.1980) (\"the approval vel non of the interclass sharing proposal is a separate issue [from that of the fairness, reasonableness and adequacy of the settlement], one which the court will consider at a later date\"), aff'd, 669 F.2d 228 (5th Cir. 1982). See also West Virginia v. Chas. Pfizer \u0026 Co., 314 F. Supp. 710 (S.D.N.Y. 1970), aff'd, 440 F.2d 1079 (2d Cir.), cert. denied, 404 U.S. 871, 92 S. Ct. 81, 30 L. Ed. 2d 115 (1971); 3 Newberg, Newberg on Class Actions § 5640 at 551 (1977).\n\nConditional approval of the settlement now will permit work to begin on the development of a distribution plan unaccompanied by the doubts and uncertainties that would exist if the settlement between the plaintiffs and defendant chemical companies were not tentatively ratified by this court. The formulation of a distribution plan in a case as complex as this is extraordinarily complicated. Consultations with a variety of medical, scientific, economic, actuarial, insurance and other experts are currently proceeding so that a fair and comprehensive distribution scheme may be developed. Some options concerning such a distribution plan have been suggested at the Fairness Hearings. See VII, Plan for Distribution of Fund, infra. Representatives of the class, including veterans, will play a major role in providing advice and guidance concerning the best methods of achieving the maximum benefits for eligible class members and afterborn children.\n\nAt the Fairness Hearings considerable time was devoted to preliminary discussions of the possible distribution plans. Those discussions and research by the court demonstrate that an effective distribution plan is possible. From a practical standpoint no sound purpose would be served by delaying initial approval of the settlement. Significant expenditures of time, money and talent necessary to develop a comprehensive and fair distribution scheme would be called into question if the plan were to be a part of a proposed settlement which did not at least have the conditional approval of this court.\n\nB. Reaction of Class Members\n\nMore than a thousand class members have expressed their views on the settlement both orally, in hearings held by the court and in writing, through letters, cards and telegrams. A few quotations from the hearings and other communications are set out in this section.\n\nThe quotations do not begin to reflect the moving sights and sounds of the hearings -- broken hearted young widows who have seen their strapping young husbands die of cancer, wives who must live with husbands wracked with pain and in deep depression, mothers whose children suffer from multiple birth defects and require almost saint-like daily care, the strong men who have tears welling up in their eyes as they tell of fear that their families will be left without support because of their imminent death, the man whose mind is so clouded he must be prompted by his wife standing by with his defective child in her arms to go on with his speech, the veterans trying to control the rage that wells up within them, the crippled and diseased with running sores and green fungus growths, and the women who volunteered for field or Red Cross duty and now feel themselves rejected and sick with what they believe are Agent Orange related diseases.\n\nJust a few years ago these veterans were healthy and handsome youths in their teens and early twenties who bravely went to war because their leaders asked them to. And it is clear from what they said and did in court that they are sincere when many of them say they would volunteer their broken bodies and worn spirits once again if their country called. Some are understandably bitter that their government and its people have shunned them instead of embracing them as heroes. Only the cold written transcript is permitted as a record of these remnants of the war pleading for justice for themselves and for their families. They remind us, as we enjoy the fruits of our power and wealth, to remember those men and women who struggle each day with disasterous medical problems they attribute to service in Vietnam.\n\n1. Hearings\n\nThe court held Fairness Hearings in Brooklyn, New York (August 8-10, 1984), Chicago, Illinois (August 13-14), Houston, Texas (August 16-17), Atlanta, Georgia (August 20-21) and San Francisco, California (August 23-24). Most of those who spoke were American veterans, their wives and parents. A number of Red Cross volunteers and other civilians who worked in Vietnam and were exposed to Agent Orange testified in support of the veterans although they themselves are not members of the class and do not receive veterans' benefits.\n\nRepresentatives from Australia and New Zealand appeared at a three hour session in San Francisco on the evening of August 24. In July the court received a memorandum that discussed some of the special problems, notably with the claim forms, faced by the Australian and New Zealand veterans. The forms were modified to take account of their special needs.\n\nThe court also heard testimony from representatives of a variety of veterans' organizations, some born of the Agent Orange controversy itself, such as the Agent Orange Children's Fund and Agent Orange Victims International, as well as less specialized veterans' organizations such as local and national chapters of Vietnam Veterans of America (VVA), the Veterans of Foreign Wars (VFW), Vietnam Veterans Against the War, and Black Veterans for Social Justice. Also represented were some state Agent Orange commissions and state veterans organizations as well as a wide variety of local self-help groups that do impressive work to aid Vietnam veterans.\n\nDespite the many unique and individual stories, certain concerns were voiced repeatedly. Some of these themes are set forth below followed by a few representative quotations from the testimony at the hearings.\n\na. Need for Medical Help for Veterans and Financial Help for Those Too Ill to Work\n\nMany class members who spoke at the hearings emphasized their need to receive medical treatment for themselves and their families. A monetary award as compensation for their illnesses did not appear to be as important to them as ensuring that some sort of diagnostic and treatment program be instituted to deal with the problems they believe are a result of exposure to Agent Orange in Vietnam.\n\nVeterans recognize the difficulties inherent in allocating one sum out of which people suffering from a variety of problems could be compensated and they advocate treatment and health care. As one veteran from New York put it:\n\nThe answer is to provide a means whereby adequate medical care is made available to Vietnam veterans. . . . The money in this settlement could be used as a part of a fund that would be set up for this reason.\n\nMany who stressed the immediate need for medical and financial help supported the settlement because they believe that it offers some measure of relief to the veteran now, not as one of them put it,\" \"in some misty future that . . . may never come.\" A veteran from South Dakota who has been active in lobbying for legislation on behalf of Vietnam veterans stated:\n\nMany people have suffered and need some form of support immediately. If the settlement is not accepted and we are forced to reenter the judicial course it could possibly take five to ten years longer at a minimum.\n\nA woman, whose husband saw combat in Vietnam, testified to the emotional toll that the litigation has taken on her and her family.:\n\nI fully support the financial settlement proposed in the class action suit. There is no sum of money that can replace a loved one's life but this settlement would insure some equitable settlement for those who have and are suffering.\n\nI have gone through an awful lot of emotional suffering. And this settlement would allow me to go on with my life without further disruption because of this case. . . . I do not need the stress of many years of litigation.\n\nb. Need for Medical and Financial Aid for Children Born with Birth Defects\n\nMost of the class members who spoke had a genuine and deep-felt concern for the future of their children and those of other veterans, whether or not they had yet manifested problems. A number described their children who suffer from a variety of deficiencies ranging from multiple birth defects necessitating frequent hospitalizations and surgery to less medically severe handicaps and a host of learning disabilities. Over and over again the veterans expressed a desire that any resolution of this litigation provide for the children of veterans who suffer, or may in the future suffer, disabilities and birth defects. The words of one veteran who spoke at the Brooklyn hearing were repeated by many:\n\nI need some assurances that my wife and five kids are going to be taken care of it they come down with some medical problems. I don't have that with the VA.\n\nAnother veteran, from Chicago, stated:\n\nMoney is not the issue. It never will be the issue. The issue is human beings and life. The issue is my children and their children's children.\n\nAnd a mother testified in Houston:\n\nI don't know about the settlement, your honor, the amount of money. What amount of money does it take to tell my son and explain to him why he cannot function, walk, run, talk, play with his friends, go to school, in a world that his dad helped to make safe? I can't explain it to him. I don't think anybody else can. But if all of us talking like this helps one child or one doctor to be able to pinpoint these problems and benefit one life, then I'm all for helping.\n\nc. Need for Information on Possible Genetic Damage to Veterans and Their Children\n\nMany of the speakers believe that their exposure to Agent Orange in Vietnam has damaged their genes. The testimony of a veteran from Connecticut illustrates this view:\n\nMy main risk is not my personal health but the reproductive situation of my daughters, should it later be found that some exposure to Agent Orange or Dioxin could negatively affect them.\n\nAnother veteran, from Vermont, echoed this concern and asked for genetic counseling services to be a part of the settlement:\n\nAs to my twin daughters, who were conceived and born after I left Vietnam, I believe that the contamination I received has, without a doubt, passed from me to them. . . . This is just my family and the effects of dioxin on them. I ask this court to consider not only my family but every family so affected and set aside at least one half of the total final settlement for the children and their children's children: this should include genetic exams, genetic counseling, psychological counseling along with a monetary settlement.\n\nd. Dissatisfaction with the Veterans Administration and the Treatment Received in its Hospitals\n\nThe majority of those who spoke expressed extreme dissatisfaction with the Veterans Administration. The court makes no findings on this issue. The Department of Justice, unlike counsel for plaintiffs and defendants, chose not to attend any of the Fairness Hearings or to present evidence contradicting complaints of VA inadequacy. Nevertheless, it seems highly unlikely that service to veterans is as uniformly bad as was suggested at the Fairness Hearings. For example, by letter dated August 30, 1984 to Special Master Kenneth Feinberg, the Department of Justice indicates that biennial \"patient satisfaction questionnaires\" and various evaluation and certification procedures ensure adequate quality of care.\n\nA veteran from Montana expressed a common complaint: \"The VA is not the place to go.\" Another veteran put it more bluntly: \"The treatment in the VA hospital is atrocious.\"\n\nMany feel that the VA is not sensitive to the needs of Vietnam veterans. A veteran who served in the Army from 1962 to 1969 testified:\n\nThe treatment in VA hospitals is horrendous to the Vietnam veteran. For the most part they don't care and turn a deaf ear to our problems and conditions.\n\nA Vietnam veteran with twenty-four years of service used a quotation repeated over and over again at the hearings:\n\nIn the words of John Fitzgerald Kennedy, \"Ask not what your country can do for you, but what you can do for your country.\" Now the question becomes, what is the country doing for the Vietnam veterans? The Federal Government has closed its eyes to the cry of the Vietnam veteran, not only for medical compensation, but it's closed the doors for medical care.\n\nA veteran who, like many others, had a vasectomy after his wife had a number of miscarriages because he feared he had damaged genes (his wife had healthy full term children by him before he was exposed to Agent Orange), complained:\n\nI was subjected to ridicule and was laughed at about my health concerns by V.A. personnel. I would hope that somebody, some institution, somebody in this country can direct that the V.A. start out-reaching, identifying and informing those who served this country. My God, our tax dollars went to support it and it's sitting on its collective duff, and I for one have had enough of the V.A.\n\nMany veterans did not always know what benefits were available from the VA or who was entitled to them. Several believed -- mistakenly, the court is informed -- that they were not entitled to any benefits unless they received an honorable discharge. One veteran who lost a leg in Vietnam combat, cited his personal experience:\n\nI went to the VA myself and asked [about help for Agent Orange]. And they told me I had to go to a private doctor. They have no help because since I received less than honorable discharge, the VA will not handle it and you have to have an honorable discharge.\n\nAnother speaker, a veteran from Illinois, testified that those in active service in the military will not seek treatment at military hospitals for illnesses they believe are related to exposure to Agent Orange because they fear their military careers will be jeopardized:\n\nMany of the individuals who have requested medical attention who are on active duty or with reserve contingent from active duty are now being told they may not continue to act or function in the same capacity as they have before . . . [These are people who claim] Agent Orange exposure, post-traumatic distress disorder. They will ask him to leave [the military service].\n\n3. Insufficiency of Settlement Amount to Pay Adequate Damages\n\nA woman who served in the Army Nurse Corps in Vietnam likens the process of allocating the settlement amount among class members to triage -- the procedure in battle zones of determining who among the casualties should receive medical attention first. She explained in Chicago:\n\n[W]ho would be given the first chance to live and who would go behind the screen and wait, perhaps til it was too late . I look upon the settlement as people playing a sort of triage with us. How will it be decided how much each of us is worth? Who will decide it? Is one of us worth more than another? Does a spina bifida baby receive the same amount as the soft tissue sarcoma?\n\nWe need research. We need evidence. We need facts. We don't need your insignificant amount of money.\n\nThe wife of a veteran with a child who had severe birth defects and who was a named plaintiff told the court, while her deformed daughter sat in a wheelchair beside her:\n\nClose to this trial date the Management Committee called to tell me that one of the best economists in the country would call me to ascertain the cost of Kerry living into projected old age.\n\nAfter four hours of conversation with me and in conjunction with discussion of the Management Committee, the economist submitted a detailed analysis that it will take $6.6 million to care for Kerry.\n\nMichael and I were able to legitimately show we had laid out on Kerry, during these 13 years of her life, a dollar amount of $475,000.\n\nSo now I realize we are in need of a miracle of the loaves and fishes if we only have $180 million.\n\nKerry, with 22 congenital birth defects, who forever lives in a wheelchair, who is denied the right to design her own destiny, who will never know the beauty of making love or marrying some great guy, who will never know the satisfaction of going to M.I.T. or Harvard, but must settle for a special education setting gets $14,000 and you talk about justice?\n\nf. Failure of Chemical Companies to Admit Fault\n\nSome opposed the settlement because it contains no admission of guilt, no assignment of blame. As a former Marine stated:\n\nI don't think it's reasonable that there is no cause or liability assigned at all. I'd like to have this come out in court and have a cause established for the conditions that the veterans, myself included, are alleging and the liability assumed for whoever is at fault.\n\nA woman, the wife of a veteran from Wisconsin, shares this feeling:\n\nFor the defendant to deny liability for those physical injuries and the emotion[al] suffering that my family and thousands of others have gone through for years particularly in light of the scientific research is extremely insulting and morally contemptible.\n\nWhen this litigation began in 1979 and to this day my family has had a primary goal in this historic litigation whereby the chemical companies and the United States government admit what they have done, accept their responsibility to the citizens of this country and never be allowed to repeat this scenario anywhere in the world. That basic goal has now been dropped by the legal wayside.\n\nAnother woman, whose husband returned from Vietnam in 1968 and died nine years later, testified:\n\nOn May 7th no one stood accused, no one accepted responsibility for the deaths of these men, no one showed remorse for our losses and the burdens of our families, no one even said they were sorry.\n\nA regional coordinator of a veterans organization from Georgia put it this way:\n\nThe toxic effects of Agent orange were known and utilized by the military, the chemical companies, and now we are supposed to agree to a stipulation that nobody did anything wrong. Somebody did something wrong. Somebody engaged in chemical warfare. Somebody violated international law and even more important somebody violated our health, our bodies, and the future of our children.\n\nNow they want to say and want us to endorse \"We are not responsible.\" 30 years of knowledge regarding the ill effects of Agent Orange calls them liars. They are responsible. You know it, I know it, and the world knows it, and we will never acquiesce in a condition which states otherwise.\n\ng. Failure of Government to Admit Fault, Participate in Settlement and Accept its Responsibility for Caring for Vietnam Veterans and Their Families\n\nMost of those who spoke felt that Vietnam veterans have been ignored by the government. Many did not understand why the government did not participate in the settlement. A majority of those who spoke believed that the government should take responsibility for the problems the veterans believe resulted from their exposure to Agent Orange. One woman, whose husband served in Vietnam and whose son has multiple birth defects, movingly expressed this belief.\n\nEverytime [my son] turns blue you can bet I think of our government and Agent Orange.\n\nOur government knew since 1957 what their chemicals would do to the human body. Our government has sentenced our vets and their children to a slow death.\n\nSome who support the settlement feel that it will prompt the government to take action on behalf of the Vietnam veterans. A veteran from Michigan summarizes this view:\n\nI also feel that this settlement in itself, it it is allowed, will force the Government into recognizing our problem. [I]t's the government who should take care of me and take care of my wife. I am a veteran. I went over there. I served my country. If I die then it is the Government's responsibility. It is not the chemical companies' responsibility. I truly believe that this settlement, if allowed, will actually bring pressure to bear on the Government to say: Hey look, the chemical companies made a bad product, they admitted it. They are giving $180 million. Now it's our turn. We have cheated the veterans. We have denied them all their rights. And now it is our responsibility to take care of the veterans.\n\nIn his statement to the court, a lawyer for the plaintiffs urged the United States Government \"to put its arms around these veterans and tell them for once that they care.\" A former male nurse who served in Vietnam and is now a member of the faculty of the School of Medicine, University of Southern California, declared: \"the deadly legacy of Agent Orange will conclude when the United States is held accountable.\"\n\nAnother veteran, who spent thirteen months in a hospital after combat in Vietnam, told us:\n\nI think that we should have some sort of resolution made from this courtroom where we can sue the United States government, let them be accountable. And let them say that they did wrong. They owe us something. I don't care whether it's a nickel or a dime, I want them to say, \"I was wrong.\" I want justice from my country who I stood for, who I fought for, who I loved and who I gave everything I could in my life.\n\nh. Possibility of a Coverup of Information with Sealed Files and Return of Documents to Defendants\n\nThe testimony of a Marine Corps veteran active in regional veterans' organizations illustrates the repeated concern about coverup:\n\nIt is, therefore, necessary that through the process of discovery all information be made public, a guarantee that all parties -- not to exclude the government -- be held equally responsible and that all parties aid in the process of corrective rehabilitation to veterans, their children and all after-borns.\n\nTo do less than that would somehow take on again the awful stench of another governmental cover-up.\n\nAs we walked through the rice paddies and the jungle and the marshlands to locate, to close and engage the enemy, we were aware of the risks to our life and limb, but at no time did we feel that our own country would care so little about our welfare that they would spray down from the skies poison.\n\nWe were exposed to a lethal agent. That in itself is criminal. But the government and its contractors have gone to great lengths in an attempt to cover up their actions.\n\nEver so slowly the cloak of deception is being removed and the truth is emerging. The total light of day must be placed on this deceit.\n\nThe California State Council of Vietnam Veterans of America requested that:\n\nThe court unseal all discovery documents produced by the parties, allowing the public free access. The question becomes whether these documents should be returned to the chemical companies or placed in the public domain?\n\nThese discovery documents must be placed in the public domain because they contain important information. [They] address such issues as the evidence that exists that Agent Orange covered certain illnesses, when and to what extent the chemical companies knew the harmful effects and what the government independently knew about these adverse health effects.\n\nThese issues are important to Vietnam veterans in making decisions regarding living children needing medical care, etc.\n\nThis concern, while understandable, is not an appropriate reason for rejecting the settlement. The court has the power to order documents released even though they were sealed as part of a settlement. See In re Franklin National Bank Securities Litigation, 92 F.R.D. 468 (E.D.N.Y.1981). That power is particularly important in a multidistrict litigation since the purpose of the MDL process is to assemble data through discovery that can be used in any related litigation without the need for duplicative efforts. See In re Upjohn Co. Antibiotic Cleocin Products Liability Litigation, 664 F.2d 114 (6th Cir.1981) (transferee court vacated protective order of transferor court). Any party or interested persons may move for such relief. See In re Franklin National Bank Securities Litigation, 92 F.R.D. 468 (E.D.N.Y.1981) (public interest group's motion to intervene to unseal documents). Until all litigation related to \"Agent Orange,\" MDL 381, is completed, no documents will be destroyed. The parties are expected to file all depositions and other papers obtained in discovery in a depository at the courthouse in accordance with directions to be provided by a Magistrate who will determine sealing and disposition subject to appeal to the court. See In re \"Agent Orange\" Product Liability Litigation, 98 F.R.D. 539, 545-548 (E.D.N.Y.1983), 99 F.R.D. 645 (E.D.N.Y.1983) (unsealing of documents previously sealed).\n\ni. Need for a Full Open Trial to Vindicate the Plaintiffs and Protect Their Rights to Individual Justice\n\nMany veterans who opposed the settlement did so because they wanted their \"day in court.\" An Army veteran who served in Vietnam from 1968 to 1970 expressed the view of those who wanted a trial to hold the defendants accountable:\n\nI have come here to plead with you not to accept this offer, to give us our day in court. I have heard some say this settlement is fair and I ask them, would any amount of money help correct the problems with our children? Would all the money in the world be worth having a child born without a hand, without a foot, severely brain-damaged, deformed grossly or dead? What price do you put on my suffering? We started this lawsuit to bring those responsible to trial and find them guilty. We can't stop now.\n\nOthers wanted their day in court to answer questions about Agent Orange. More than one speaker alluded to the trial as a tool to aid the public, the scientific community and the medical community in understanding the role of Agent Orange in veterans' problems. A veteran from Wisconsin opposed the settlement for this reason:\n\n[t]he feeling is that win or lose at the actual trial we would gain more information and knowledge through the discovery process of the trial.\n\nWe feel that the trial procedure would help to determine the facts that will be needed to pursue a claim with the Veterans Administration and the federal government.\n\nFor these people, a trial -- win or lose -- is preferable to a settlement in which the questions still remain. As one former Marine puts it:\n\nWe wanted to have our day in court so that the evidence can be brought out and we could present our allegations and that the chemical companies can present their defenses against it concerning the scientific and medical data and we think this would be vastly useful to the scientific and medical community and would probably put them quite a few years ahead with all their studies that are going on. We really wanted to have that brought out in open public court, printed in the media, let the American public know and also the scientists and doctors.\n\nj. Inability to Decide Whether to Accept Settlement Without Knowing How it Would Be Distributed or How Much Would be Spent in Attorneys' Fees\n\nOne veteran from California asked the following questions, reflecting the same position as many other veterans:\n\nNumber one, how can the court request class members to decide if the settlement is fair and reasonable when the proposed settlement does not provide those affected with adequate information on which to make an intelligent decision?\n\nNumber two, how can the court award damages when there is inaccurate information on how many veterans and their family members have been adversely affected by exposure to Agent Orange; or how many veterans have already died; or identify those exposed veterans who are at risk of developing long term health problems?\n\nNumber three, how can the court award damages without addressing eligibility requirements?\n\nMany others indicated that they could not decide if the settlement would be adequate without knowing how much would be spent in attorneys' fees. As a result of these views the order approving the settlement will be made conditional, subject to reconsideration after plans for disposition of funds have been considered preliminarily and the amounts of attorneys' fees have been fixed.\n\nk. Inadequate Payment by Defendants Relative to Their Resources\n\nRepeatedly witnesses referred to the assets of the defendants as over ten billion dollars and their earnings as in the hundreds of millions of dollars a year. The amount of the settlement was, as some indicated, \"petty cash\" for the defendants. Many pointed out that insurance companies would foot all or most of the cost. Some pointed to the fact that defendants' stock rose on the exchange after the settlement was announced. They thought it unfair not to have defendants pay more in view of their resources.\n\n1. Inadequate Time to File Claims\n\nThere were many people who indicated that they and those they knew had just heard of the settlement and many of them needed more time to file claims. One witness asked the court:\n\nHow will veterans in the State of Washington find out about the settlement?\n\nSecond, veterans are concerned that they are unable to make an informed choice about whether the settlement is fair, reasonable or adequate. We want to know what they're agreeing to in the settlement.\n\nThey want to know their rights, their risks, and their options. Vietnam veterans question the fairness of the settlement when most veterans have not been informed and the claims deadline is just around the corner.\n\nAs a result of these suggestions, the court has extended the time to file claims to January 2, 1985.\n\nm. Need to Settle Now to Get on With Life\n\nA veteran from Pennsylvania voiced his desire to bring the litigation to a close:\n\nI too would like to see the chemical companies admit that they knew what the herbicides would do, but I do not, nor do the veterans and their families, have the time to continue to fight this out in a court of law.\n\nMany veterans spoke about how the Agent Orange controversy continues the Vietnam war for them. They feel that the government refuses to recognize that there is a problem, they feel slighted by the VA, they feel that no one appreciates the fact that they, like all veterans, fought for their country in time of need. For them, Agent Orange is part of the remaining unfinished business of the Vietnam war. As one veteran put it:\n\nAgent Orange and the MIA-POW [missing in action-prisoner of war] issue[s] . . . are the only real tragedies left to end that war. It will never end as long as Agent Orange is festering.\n\nMany see the settlement as a part of the process of finally putting the Vietnam War behind us and as a step toward a better future. Some believe that although no liability has been established, the fact of the settlement gives some legitimacy to their claims, or as one of them noted, \"the act of paying 180 million would have a voice of its own.\" Another veteran, comparing the Vietnam episode to a societal mental illness \"because we have been so destructive of our veterans,\" illustrates this point:\n\n[W]hen there is an illness, the first step is to recognize it and to make an admission that it exists, and then to move from there. The $180 million settlement is a step in the much larger battle which is beyond the legal battle which would be the political battle in the political arena. Move with that toward having the recognition from the government that our veterans deserve and have a compensation from the government that our veterans deserve. I am hopeful this settlement will be the first step towards that political solution which I think would be the best that we would hope for.\n\nAn Oregon doorgunner in the herbicide spraying operation put it this way:\n\nThe Challenge is a $180 million settlement fund is going to cause power to be created. I believe firmly that we should stay positive. What has come in the past is the past. We need to create a system able to respond with quality assistance to all needy veterans now.\n\nAnother veteran with a deformed daughter who described a comrade's suicide ended his testimony by saying:\n\nI think that's the most important of all, of the feelings of what these people have really been through and I am sure that with the attorneys and everybody working hand in hand, if that's the intentions of everybody, I am sure we can come to a quick decision and we can get on with our lives and what lives we have got, let's pick up the pieces and go on and let's start living a little bit.\n\nI am tired. I am 42 years old.\n\nn. Need for Further Research and Reassurance\n\nThe unanswered questions about Agent Orange and its effects on health exacerbate the veterans' problems. A veteran from Connecticut points out the terrible cost of our ignorance:\n\nA lot of veterans are out there thinking they are victims and they are not victims. A lot of veterans have created illnesses because of the controversy of Agent Orange.They think they are contaminated. They don't know. None of us know whether any of these illnesses are a result of Agent Orange poisoning at this time.\n\nAnd a veteran who works in one of the veterans' organizations summarizes his group's reaction to the settlement.\n\n[W]e came to the conclusion that had we gotten to trial we would have gotten a lot of dirt out about corporate defendants [and] various government agencies. But there would have been a chance that all of this would have jeopardized what we were seeking. We were seeking positive help for the Vietnam veterans. This is how we started out when we initiated this litigation. We started out simply to get help for the veterans. [W]e see the settlement as a positive step in the right direction in obtaining help for the veterans. We really don't want to go through five more years or more of litigation. We want an end -- an end to the legal controversy. Our fight now should be in the medical community and the scientific community in getting more help. And we feel this settlement can be a catalyst for that.\n\n2. Written Communications\n\nThe court has received hundreds of letters from class members about the settlement. A few express a deep hostility toward the defendant chemical companies and the United States bordering on the irrational. Most, however, are thoughtful and helpful. The letters express essentially the same considerations referred to at the hearings. These include doubts about the existence or provability of a causal connection between exposure to Agent Orange and a host of ailments; an understanding that even if general causation were provable, there are serious legal obstacles to each individual class member's recovery; a recognition that even if the plaintiffs were ultimately to prevail after trial and on appeal, the many years it would take to achieve that result might make any victory a Pyrrhic one; and satisfaction that \"something is finally being done\" for Vietnam veterans after years of perceived mistreatment and neglect.\n\nThose who oppose the settlement do so for a variety of reasons. Some are genuinely convinced that they, their comrades and families suffer as a direct result of the use of Agent Orange in Vietnam and that the evidence and law will sustain their views. Others, while not opposed to the concept of a settlement, are dissatisfied with the amount and the nonparticipation of the government, viewed by some as the chief culprit. Many are outraged by the failure of defendants to admit culpability. Some wish a full airing of all the evidence in a public trial and oppose return or destruction of any evidence assembled through discovery.\n\nTypical of the letters favoring settlement is one from a physician in Michigan who feels that while Vietnam veterans were unjustly treated, he has\n\nseen no reputable research indicating that any of the so called \"Agent Orange\" casualties are anything but anecdotal. I have seen studies that show that those who were most heavily exposed suffered no ill effects.\n\nOthers do believe that there is a causal connection, but believe in the words of a New York veteran that \"to go to trial would be a disaster and turn out to be a can or worms with losers on both sides.\"\n\nA veteran from California asked that the settlement be approved because\n\n[a]fter reading and hearing much material about this proposed settlement, I am somewhat concerned. I believe that under the circumstances revolving around such a legal suit that what was effected by the chemical companies is justifiable. Naturally only one who lives in a dream would expect to receive everything asked for. Compromise is the basis of any settlement and the benefit of compromise is [to] AVOID COURT DELAY.\n\nAs he and many class members recognize, \"the 180 million dollars looks damn good\" because it \"avoid[s] all the red tape\" and eliminates the possible chance of losing in the end.\"\n\nNo more valuable time can be wasted in dealing with this matter because the victims directly involved are hurting. Compensation is one of the major priorities.\n\nA Rhode Island veteran writes:\n\nWe have waited long enough. Let us be done with the delays and begin now to create programs and provide services to assist present and future generations affected by the dioxins used in Southeast Asia. At last, perhaps, we shall see a light at the end of the tunnel.\n\nAlso typical of the communications favoring the settlement is a letter from an Arkansas veteran who writes that he\n\nfeel[s] that the chemical companies did the Veterans a great justice, by settling out of court. If the veterans would have held on and went to court, they could have spent another 10 to 20 years in court.\n\nMany of the class members express a special desire that the settlement fund be used to assist the children who were allegedly affected. As a veteran from Pennsylvania writes:\n\nI have seen with my own eyes the children [of exposed veterans] with birth defects and I want to express to you my belief that the Federal Class Action Law Suit should be settled now, with acceptance of the Trust Fund money.\n\nI am blessed with a healthy son and for that I thank my Higher Power. For those of my military friends who do [have children with birth defects], I know we should do what is necessary now to start the healing process. Again, I implore you to accept the Chemical Companies Trust Fund Offer.\n\nAlong the same line, a veteran from California, after detailing his wife's and children's problems which he attributes to Agent Orange, writes:\n\nThe newly acquired monies from the lawsuit would mean nothing to me, but continued research into the dioxin-related illnesses could help thousands of others, and a fund started to aid that research would be a fitting tribute to the many who suffered for their participation in the Vietnam War. Put the money into a trust for that purpose!\n\nMany letters are strongly negative. In the words of one letter which was circulated by a group of veterans from Iowa:\n\nThe amount of money agreed upon by the management committee and the chemical companies does not even begin to compensate the hundreds of thousands of families for their medical expenses, not to mention physical suffering and emotional agony. More importantly, the issues of causation and liability have gone unresolved, perhaps forever.\n\nIn a similar vein, a Wisconsin veteran urged the court to reject the settlement because he believes the settlement\n\nis an attempt to prevent the public from finding out the true facts as to who is responsible for the use of Agent Orange. A lot of loyal U.S. servicemen are to be affected by this decision and I think that they should have their day in court.\n\nLetters urging rejection of the settlement assume that there is a causal connection that can be proven between exposure to Agent Orange and the various illnesses and conditions Vietnam veterans suffer from. As a New Jersey veteran put it,\n\n[y]ou would be hard pressed to convince me that Agent Orange is not responsible for my daughters [birth defects] and my [medical] problems.\n\nThe need to \"bring out the facts\" is emphasized by virtually all the letters urging rejection of the settlement. As another veteran from Wisconsin put it,\n\nthe issue goes far beyond mere monetary compensation. The ultimate issue is establishing liability for damages and/or injuries arising from exposure. This settlement did not affix blame; indeed, it emphasizes that the payment is in no way an admission of guilt or liability. . . . I view this settlement as an attempt to sweep the whole issue under the rug; to cover up the plight of thousands of veterans and their families.\n\nMany letters express frustration and anger with the way Vietnam veterans have been treated by the government and society. Typical are the comments of a New Jersey veteran:\n\nI volunteered for the army as soon as I was 18 years old because at that time it seemed like the right and patriotic thing to do. If I had been able to see into the future and seen how shabbily my own government and fellow Americans (non-vets) would treat all Vietnam vets, I probably would have become a draft resister and moved to Canada.\n\nSimilarly, another New Jersey veteran writes,\n\nWhen my country needed me, I went. When I needed my country, they were not there. Who will go next time?\n\nOthers believe that the government is at least as responsible, if not more so, than the chemical companies for any damage that was done; they object to the nonparticipation of the government in the settlement. In the words of a Virginia woman,\n\nIn my opinion the government reps were aware of what we were being exposed to in RVN [Republic of Vietnam] as well as the companies. I am appalled that the government is not a defendant and that it along with the chemical companies are not admitting irresponsibility.\n\nAnother Wisconsin veteran writes:\n\nI want [the court] to know that I, and many of my fellow Veterans of all eras stand in protest of this proposed sell-out to big business -- I feel that liability and responsibility go hand in hand here. This must be proven. We owe it to the thousands of Nam Vets and their families to prove this issue once and for all. We will not be used and thrown away -- No more Vietnams.\n\nAs does the writer of the last quoted letter, some view the settlement as another example of a victory by \"big business\" represented by the chemical companies, over the \"little guy,\" represented by the veterans. In the words of a West Virginia veteran,\n\n[t]hese [chemical] companies are in reality getting away with murder and torture, while we, the veterans, are getting stepped on and pushed under the rug, as usual.\n\nIn sum, there is a sharp split of opinion among class members as to whether the court should accept the settlement. Yet only a small fraction of one percent of the class has been heard from at the Fairness Hearings and in correspondence with the court. The silent majority remains inscrutable.\n\nIII. FACTUAL PROBLEMS WITH CLAIMS\n\nThere are serious factual problems with plaintiffs' case, the chief one being doubt that present scientific knowledge would support a finding of casuality. In addition, problems respecting the discretionary power of the government to make decisions even when it creates dangers to individuals, and the defense the manufacturers may have because of the government's knowledge of the dangers from Agent Orange reduce substantially the prospects of recovery after trial. This legal issue is discussed in part IV, infra, in connection with the applicable substantive law.\n\nA. Use of Agent Orange in Vietnam\n\nIn late 1961, President Kennedy approved a joint recommendation of the Departments of State and Defense to initiate, on a limited scale, defoliant operations in Vietnam. The decision made at these high levels provides a basis for the argument that the government in its discretion knowingly assumed the risks. If so, there is possibly no right to sue the government under the Federal Tort Claims Act and, since at least some of the manufacturers claim that they were compelled to supply the government under various war power acts, governmental immunity might accrue to them some degree. See IV, C, Nature of Liability and Relation to Defense of Government Knowledge, infra.\n\nProject Ranch Hand, as the Air Force defoliation program became known, began its spray missions in January 1962. See generally, W. Buckingham. Operation Ranch Hand, The Air Force and Herbicides in Southeast Asia 1961-1971 29-31 (1982); G. Lewy, America in Vietnam, 257-66 (1978). Initially the aerial spraying took place near Saigon; its purpose was to clear the thick jungle canopy from around roads, power lines and other lines of communications in order to lessen the potential of ambush. There was also some hand spraying from the ground around gun emplacements and the like to reduce surprise attacks and maintain open lines of fire. By late 1962 approval was granted for offensive use of herbicides to destroy planted fields and crops suspected of being used by the Viet Cong. The use of herbicides for crop destruction peaked in 1965 when 45% of the total spraying was designed to destroy crops.\n\nVarious herbicides were used for defoliation and crop destruction spraying in Vietnam including Agent Blue (cacodylic acid), Agent White (a mixture of 80% tri-isopropranol amine salt of 2,4-dichlorophenoxyacetic acid (2,4-D) and picloram), Agent Purple (a formulation of 50% n-butyl ester of 2,4-D, 30% n-butyl ester of 2,4,5-trichlorophenoxyacetic acid (2,4,5-T) and 20% isobutyl ester of 2,4-D), Agent Green (100% n-butyl ester of 2,4,5-T) and Agent Pink (60% n-butyl ester of 2,4,5-T and 40% isobutyl ester of 2,4,5-T).\n\nAfter 1964, Agent Orange, a 50-50 mixture of the n-butyl esters of 2,4-D and 2,4,5-T, was one of the most widely used herbicides, along with Agent White and Agent Blue. See A. L. Young, J. A. Calcagni, C. E. Thalken \u0026 J. W. Tremblay, The Toxicology, Environmental Fate, and Human Risk of Herbicide Orange and its Associated Dioxin, USAF OEHL Technical Report (Oct. 1978); R. Bovey \u0026 A. Young, The Science of 2,4,5-T and Associated Phenoxy Herbicides (1980). Phenoxy herbicides such as Agents Orange, White, Pink and Green are growth regulators that kill certain plants by inducing malfunctions in the growth process. Agents Pink and Green were rarely used after Agent Orange was introduced in early 1965. Agent Orange proved to be an effective defoliant when used in heavy concentrations and was used on a wide variety of woody and broadleaf herbaceous plants, causing discoloration and dropping of leaves. Agent White was especially useful in killing conifers. Agent Blue was used primarily for crop destruction.\n\nEValuation of the early Ranch Hand missions recommended increasing the amount of herbicide sprayed per acre. The first mission in 1962 lasted three days and used 7920 gallons of herbicide to cover 6920 acres. See W. Buckingham, IOperation Ranch Hand, supra, at 36. In September 1962, in a four-week period, Ranch Hand sprayed more than 9000 acres with 27,648 gallons of Agent Purple, clearing vegetation along rivers and canals on the Cau Mai Peninsula in the Mekong Delta. Id. at 62. This application rate of three gallons of herbicide per acre became the standard for spraying in Vietnam. Domestically, herbicides such as 2,4-D and 2,4,5-T were applied at a rate of one gallon per acre.\n\nOccasionally, because of malfunctions and the need of aircraft to escape enemy fire, much higher concentrations were dropped suddenly on small areas. Miscalculations, drifts and respraying undoubtedly caused heavier concentrations in some instances than the planned three gallons per acre.\n\nAs the war in Vietnam escalated in the mid-1960s, so too the use of herbicides expanded. In 1967, the peak year for herbicide spraying in South Vietnam, 1,687,758 acres were sprayed -- 85% for defoliation purposes and 15% for crop destruction. W. Buckingham, Operation Ranch Hand, supra, at 129. Eighteen to twenty-seven sorties were flown per day. Id. at 131.\n\nBeginning about 1967 herbicide spraying in Vietnam became the subject of increasing controversy in this country and abroad. A report prepared by the Bionetics Research Laboratory for the National Institutes of Health in 1969 indicated that 2,4,5-T, a major component of Agent Orange and other herbicides used in Vietnam, could cause malformed offspring and stillbirths in mice when administered in high dosage to the mothers.The Bionetics study has been criticized on the ground that the test conditions greatly increased the amount and intensity of exposure. See, e.g., W. Buckingham, Operation Ranch Hand, supra, at 163-64.\n\nOn April 15, 1970, the Secretaries of Health, Education and Welfare, Agriculture and the Interior issued a joint statement suspending domestic use of herbicides containing 2,4,5-T except for limited non-crop uses. W. Buckingham, Operation Ranch Hand, supra, at 166; see also Dow Chemical Co. v. Ruckelshaus, 477 F.2d 1317, 1318-19 (8th Cir.1973); Citizens Against Toxic Sprays, Inc. v. Bergland, 428 F. Supp. 908, 914 (D.Or.1977); United States v. Vertac Chemical Corp., 489 F. Supp. 870, 881 (E.D.Ark.1980). That same day, the Department of Defense suspended military use of 2,4,5-T, including Agent Orange, \"pending a more thorough evaluation of the situation.\" W. Buckingham, Operation Ranch Hand, supra, at 166. Thereafter, herbicide spraying for defoliation continued for a short while, using Agent White. Crop destruction, utilizing Agents White and Blue, continued throughout 1970. In January 1971, the last Ranch Hand mission took place.\n\nOverall, between 17 and 19 million gallons of Agents Orange, White and Blue were procured by the United States and disseminated in Vietnam between January 1965 and February 1971. A. L. Young, J. A. Calcagni, C. E. Thalken \u0026 J. W. Tremblay, The Toxicology, Environmental Fate, and Human Risk of Herbicide Orange and its Associated Dioxin, supra, I-10. A study by the National Academy of Sciences concluded that herbicides had been sprayed on 10.3% of inland forests, 36.1% of mangroves and 3% of cultivated areas. Id. at I-11. Between eight and ten percent of the total land area in South Vietnam was sprayed. Id.\n\nIt is estimated that the seven defendant chemical companies manufactured approximately 99% of all Agent Orange used by the military between 1965 and 1970. After cessation of herbicide spraying in February 1971, approximately 2,220,000 gallons of Agent Orange remained unused -- 1,370,000 gallons in Vietnam which was shipped to Johnston Island in the Pacific Ocean for storage, and 850,000 gallons stored at Gulfport, Mississippi. W. Buckingham, Operation Ranch Hand, supra, at 183. The average dioxin contamination of these more than 2 million gallons of left-over Agent Orange was estimated at approximately 2 parts per million (ppm). Id. Of 200 samples of the Agent Orange that had been shipped to Johnston Island for storage, four contained more than 15 ppm of dioxin, with one sample as high as 47 ppm. Of the samples tested at Gulfport, none contained more than 15 ppm. A. L. Young, J. A. Calcagni, C. E. Thalken \u0026 J. W. Tremblay, The Toxicology, Environmental Fate, and Human Risk of Herbicide Orange, supra, at I-21. See also Veterans Administration, Review of Literature on Herbicides Including Phenoxy Herbicides and Associated Dioxins, Vol. I, 2-21 (1981).\n\nThe teratogenic effects -- that is the effect on a fetus of exposure of the mother during pregnancy -- associated with high level doses of 2,4,5-T in the Bionetics report were subsequently determined to result from a toxic contaminent in 2,4,5-T, identified as 2,3,7,8-tetrachlorodibenzo-p-dioxin (TCDD). TCDD enters the 2,4,5-T product during the manufacture of trichlorophenol (TCP), a necessary precursor chemical for 2,4,5-T; some of the TCDD generated in the manufacture of TCP carries forward into 2,4,5-T and thus into the phenoxy herbicides containing 2,4,5-T.\n\nB. Claimed Effects of Contact with Agent Orange in Vietnam\n\n1. General Considerations\n\nThe basic problem with the plaintiffs' factual case was succinctly and accurately stated in a memorandum by counsel to a large number of plaintiffs, dated December 28, 1983, edited January 25, 1984, and attached to an affirmation filed July 26, 1984. It stated:\n\n[The] class action is now careening toward a trial in May without the basic information necessary to establish a causal relation between exposure to dioxin contaminated phenoxy herbicides in Vietnam and the illness, disability, and death of the plaintiff veterans. There is not sufficient command of the biological, chemical, medical, epidemiological, and genetic evidence to establish a causal relation between the disease, disability, and death of the plaintiff veterans much less the catastrophic polygenetic birth defects afflicting their children.\n\nPlaintiffs' factual case may be briefly summarized. Agent Orange contained small quantities of dioxin. Dioxin is a potent poison which can cause serious harm to humans. Many plaintiffs suffer from diseases that can be caused by dioxin. Dioxin caused the diseases. The logical and practical difficulty with their argument is that the diseases referred to may result from causes other than dioxin poisoning.\n\nAs to the poisonous nature of dioxin and its ability to cause harm to mammals, including homo sapiens, there is no doubt. The form of dioxin implicated in Agent Orange is a dangerous, stable, long lasting chemical. See, e.g., R. E. Tucker, A. L. Young \u0026 A. P. Gray, Human and Environmental Risks of Chlorinated Dioxins and Related Compounds, sections on Environmental Chemistry, and Environmental Toxicology, 143-341 (1983); M. P. Esposito, T. O. Tiernan \u0026 F. E. Dryden, U.S. Environmental Protection Agency, Dioxins 230-256 (1980); A. Hay, the Chemical Scythe 32 (1982). Dioxin is one of the most powerful poisons known, as is indicated by the following table. Minimum SL lethal dose Substance Molecular weight (moles/kg) Botulinum toxin A 9.0 x 105 3.3 x 10-17Tetanus toxin 1.0 x 105 1.0 x 10-15Diptheria toxin 7.2 x 104 4.2 x 10-122,3,7,8-TCDD 322 3.1 x 10-9Saxitoxin 372 2.4 x 10-8Tetrodotoxin 319 2.5 x 10-8Bufotoxin 757 5.2 x 10-7Curare 696 7.2 x 10-7Strychnine 344 1.5 x 10-6Muscarin 210 5.2 x 10-6Diisopropylfluorophosphate 184 1.6 x 10-5Sodium cyanide 49 2.0 x 10-4\n\nM. P. Esposito, T. O. Tiernan \u0026 F. E. Dryden, U.S. Environmental Protection Agency, Dioxins 188 (1980). See generally R. E. Tucker, A. L. Young \u0026 A. P. Gray, Human and Environmental Risks of Chlorinated Dioxins and Related Compounds (1983); Veterans Administration, Review of Literature on Herbicides Including Phenoxy Herbicides and Associated Dioxins Vols. I, II, III (1981, 1983); Centers for Disease Control, Protocol for Epidemiologic Studies of the Health of Vietnam Veterans (Nov. 1983).\n\nThere is also little doubt that many servicepersons were exposed to some amounts of herbicides containing at least trace amounts of dioxin while they were in Vietnam. The following map and tables from volume I of the Review of Literature on Herbicides, Including Phenoxy Herbicides and Associated Dioxins suggest the extent of the spraying. These charts do not help much in determining extent of exposure since, for example, a great deal of the herbicide was in the high canopy of jungle trees and samples of Agent Orange showing relatively high dioxin content may have been taken from other products. Id. at 2-20 to 2-22. Although no one can tell exactly how much dioxin was involved, a reasonable estimate for the years 1965 to 1971, the time of heaviest troop involvement in Vietnam, is 240 pounds. As the Review of Literature puts it:\n\nOverall, the spraying of more than 11.3 million gallons of Orange/Orange II from August 1965 through February 1971 is estimated to have released close to 240 pounds of TCDD, assuming that the average concentration of TCDD was 2ppm (2.1 x 10-5 pounds per gallon).\n\nId. at 2-22. Another estimate for the years 1962 to 1971 is 368 pounds, although some of this total may have come from herbicides other than Agent Orange. See B. B. Dan, Vietnam and Birth Defects, 252 J.A.M.A. 936 (1984). The differences are not significant for present purposes given the large amount of Agent Orange sprayed and the wide area over which it was spread.\n\n[SEE ILLUSTRATION IN ORIGINAL] APPLICATION OF HERBICIDES IN THE VIETNAM WAR BY YEAR Millions of Gallons 1962- Aug-Dec Year July 1965 1965 1966 1967 1968 1969 1970 1971 Total Orange NAa .37 1.64 3.17 2.23 3.25 .57 .00 11.22White NAa 0 .53 1.33 2.13 1.02 .22 .01 5.24Blue NAa 0 .02 .38 .28 .26 .18 .00 1.12Total 1.27 .37 2.19 4.88 4.63 4.53 .97 .01 18.95[From Veterans Administration, Review of the Literature of Herbicides, Including Phenoxy Herbicides and Associated Dioxins, Vol. I Table 2-1, at 2-16.] ANNUAL NUMBER OF ACRES SPRAYED IN VIETNAM Year Acresa* 1962 5,7241963 24,9201964 93,8691965 221,5521966 608,1061967 1,570,1141968 1,365,4791969 1,365,7541970 294,9251971\n\n[From Veterans Administration, Review of Literature on Herbicides, Including Phenoxy Herbicides and Associated Dioxins, Vol. I Table 2-2, at 2-17.]\n\nAs the various industrial accidents in which people were exposed to heavy doses of dioxin in a single event or smaller doses over a longer period show, dioxin may be highly toxic to humans. This conclusion is confirmed by experience with contamination around homes and farms. Animal studies also suggest the serious harm that this poison can cause. These studies and data are considered more fully in III, C, Scientific Studies on Effect of Contact with Agent Orange, infra.\n\nIt is important in considering the facts to keep clearly in mind in this section and the sections that follow the different problems of proof posed in determining if dioxin can cause certain diseases and whether it did cause a particular disease or defect in a particular person. This is an issue to which we now turn and return to again and again in the course of this opinion.\n\nIn this connection we note that a number of letters and statements at the Fairness Hearings suggest that there may be a failure among some class members to distinguish between the avoidance of risks by regulation and legislation designed to prevent injuries on the one hand, and the compensation for injuries, particularly through tort law, on the other. For example, a number of class members pointed out that while the government refuses to compensate veterans and defendants continue to deny liability in this case, the United States has spent large sums cleaning up toxic wastes and compensating \"victims\" of the chemical dumps, most notably in Times Beach, Missouri. See, e.g., A. Hay, The Chemical Scythe 229-43 (1982) (description of the Love Canal incident); cf. A. L. Young, J. A. Calcagni, C. E. Thalken \u0026 J. W. Tremblay, The Toxicology Environmental Fate, and Human Risk of Herbicide Orange and its Associated Dioxin, USAF OEHL Technical Report, V-17 to V-19 (Oct. 1978) (description of the Eastern Missouri Horse Arena episode in which heavily contaminated oils were spread on farm property).\n\nThe distinction between avoidance of risk through regulation and compensation for injuries after the fact is a fundamental one. In the former, risk assessments may lead to control of a toxic substance even though the probability of harm to any individual is small and the studies necessary to assess the risk are incomplete; society as a whole is willing to pay the price as a matter of policy. In the latter, a far higher probability (greater than 50%) is required since the law believes it unfair to require an individual to pay for another's tragedy unless it is shown that is more likely than not that he caused it. See, e.g., Ayers v. Jackson Tp., 189 N.J.Super. 561, 461 A.2d 184, 187 (N.J.Super.Ct.Law Div.1983) (increased risk of exposure to contaminated water not enough for tort liability because of \"speculative\" nature of proof); Pierce v. Johns-Manville Sales Corp., 296 Md. 656, 464 A.2d 1020, 1026 (C.A.Md.1983) (applying 50% probability rule to asbestos exposure). See generally ALI-ABA, Symposium on Environmental Law sponsored by the Environmental Law Institute and the Smithsonian Institute, February 23-25, 1984, Washington, D.C.; Grad, Hazardous Waste Victim Compensation: The Report of the § 301(e) Superfund Study Group, 13 ELR 10234 (1983); Office of Science and Technology Policy, Chemical Carcinogens: Review of the Science and Its Associated Principles, 49 Fed.Reg. 21594, 21596 (1984); D. G. Barnes, Regulatory Actions in Dioxins and Related Compounds, in R. E. Tucker, A. L. Young \u0026 A. P. Gray, Human and Environmental Risks of Chlorinated Dioxins and Related Compounds 23-31 (1983).\n\nIn both the regulatory and tort models, the techniques for assessment of the probabilities of risk can be similar -- courts need not deny themselves the same sophisticated methods used by regulatory agencies. National Research Council, Steering Committee on Identification of Toxic and Potentially Toxic Chemicals for Consideration by the National Toxicology Program, Toxicology Testing 349 (1984).\n\nThe statistical and other scientific bases for finding possible dangers from the use of Agent Orange might be more than enough for a court to uphold governmental action limiting its use, particularly in view of the need to defer to an administrative agency. See, e.g., Batterton v. Marshall, 208 U.S. App. D.C. 321, 648 F.2d 694, 699-710 (D.C.Cir.1980) (statistical methodology for a rule); FMC Corp. v. Train, 539 F.2d 973 (4th Cir.1976); National Association of Metal Finishers v. Environmental Protection Agency, 719 F.2d 624 (3rd Cir.1983) (toxic pollutants and causation), cert. granted, 466 U.S. 957, 104 S. Ct. 2167, 80 L. Ed. 2d 551 (1984); Lead Industries Association v. Environmental Protection Agency, 208 U.S. App. D.C. 1, 647 F.2d 1130 (D.C. Cir.) (standard deviation method not arbitrary), cert. denied, 449 U.S. 1042, 101 S. Ct. 621, 66 L. Ed. 2d 503 (1980). Even given such deference, some courts might have difficulty in finding a causal relationship between Agent Orange use in Vietnam and dangers to servicepersons. See, e.g., Ethyl Corporation v. Environmental Protection Agency, 176 U.S. App. D.C. 373, 541 F.2d 1 (D.C.Cir.) cert. denied, 426 U.S. 941, 96 S. Ct. 2663, 49 L. Ed. 2d 394, 96 S. Ct. 2662 (1976), where the court was sharply divided on the issue of cause and the probative force of epidemiological studies. See generally National Research Council, Committee on the Institutional Means for Assessment of Risks to Public Health, Risk Assessment in the Federal Government: Managing the Process (1983); Office of Science and Technology Policy, Chemical Carcinogens: Review of the Science and its Associated Principles, 49 Fed.Reg. 21594 (1984); ALI-ABA Conference on Environmental Law, supra, at 48-49; Proceedings of the Seventh Symposium on Statistics and Environment, 37 American Statistician 359 ff. (1983). Regardless of what regulatory action would be justified by current evidence, as noted in III, B, 2, Plaintiffs' Evidence of Causality and III, C, Scientific Studies on Effect of Contact with Agent Orange, infra, such evidence would not be sufficient to find an individual defendant liable to an individual plaintiff.\n\n2. Plaintiffs' Evidence of Causality\n\nThe critical problem for the plaintiffs is to establish that the relatively small quantities of dioxin to which servicepersons were exposed in Vietnam caused their present disabilities. Here adequate proof is lacking.\n\nSince no motion for summary judgment based on inability to demonstrate causation was made, the exact evidence plaintiffs were relying upon to satisfy their burden of proof on the issue was never fully set forth. Some indication of their theory is contained in their draft memorandum on \"Distribution and Administration of Settlement Fund\" dated June 1, 1984. See also the references in plaintiffs' Fairness Brief to expected scientific testimony on particular plaintiffs, infra. A central problem under plaintiffs' theory would be establishing a causal relationship between exposure and discrete diseases. As yet little if any scientific support for plaintiffs' views has been developed.\n\nEven if we assume that chloracne in veterans was caused by exposure to Agent Orange, plaintiffs concede that the government contract defense, see IV, C, Nature of Liability and Relation to Defense of Government Knowledge, infra, represents a substantial impediment to recovery for this disease. It was well known in the 1960's that workers' exposure to dioxin in herbicides caused chloracne, so that the government's knowledge of this fact was probably as great as that of the manufacturers.\n\nThe kind of study necessary to support some of the hypotheses of plaintiffs' experts is now being undertaken by the Centers for Disease Control. See Centers for Disease Control, Protocol for Epidemiologic Studies of the Health of Vietnam Veterans (Nov. 1983) (\"CDC\" Protocol\"). (101 page detailed description of study). Assuming that the study was started in December, 1983 as planned, it would take 69 months to complete the report -- i.e., if all goes well it will be available in mid-1989. Id. at 40. A partial copy of the CDC protocol is printed as Appendix F to indicate the difficulty of obtaining satisfactory proof. [omitted.] Courts cannot, unfortunately, with indefinitely until all scientists have completed their long term studies. They must decide on information now available.\n\nIn the intensive study of the Ranch Hand personnel who conducted most of the spraying and had most contact with Agent Orange, no statistically significant dermatological differences were found between these men and a control group. Air Force Health Study, An Epidemiologic Investigation of Health Effects in Air Force Personnel Following Exposure to Herbicides, XV-9 (Feb. 24, 1984) (Ranch Hand II Study -- 1984 Report).\n\nThe evidence with respect to birth defects is even more tenuous. Male mediated birth defects might theoretically result from exposure of the father to Agent Orange, but no supporting data associating dioxin exposure of males with birth defects of children has been made available.\n\nNo test, plaintiffs' experts apparently concede, is decisive in proving exposure to Agent Orange, partly because, as one expert put it, \"all of us have probably been exposed to dioxin at some time.\" Their suggestion that combinations of symptoms \"hold the most promise for determining possible exposure to dioxin,\" is certainly worth study, but could not now be the basis for recovery in a lawsuit, where relatively high degrees of probative force are required.\n\nIn short, the evidence provided by the plaintiffs to date on general causality, while supportive of the desirability of further studies, lacks sufficient probative force -- except in the case of chloracne -- to permit a finding of general causality. It might require the direction of a verdict for defendants at the end of plaintiffs' case. It simply is not sufficient to point to an individual and show that he was exposed to Agent Orange and had a cancer. The incidence of cancers of the type suffered by plaintiffs in the population as a whole make it at least as likely, based upon present knowledge, that the cancer resulted from causes other than Agent Orange. The problems with plaintiffs' factual case are even greater with respect to birth defects and miscarriages.\n\nThe scientific data relied upon by defendants, a subject to which we turn in the next section, throws even greater doubt on plaintiffs' case. This litigation presents quite a different picture from one where long term repeated exposure to a highly toxic substance leads a number of acknowledged experts to state flatly that the exposure caused the disease. See, e.g., Ferebee, Jr. v. Chevron Chemical Co., 237 U.S. App. D.C. 164, 736 F.2d 1529 (D.C.Cir.1984) (repeated intensive exposure to paraquat; experts' positive testimony as to specific causation). We are not dealing here with exposure of workers in a factory or laboratory to dioxin in concentrated amounts where the probative force of the evidence on causality may be substantial.\n\nAs all experts, both plaintiffs' and defendants\", recognize, \"[t]he dose-response relationship at low levels of exposure for admittedly toxic chemicals is one of the most sharply contested questions currently being debated in the medical community.\" Id. at 1536. See also, e.g., National Research Council, Steering Committee on Identification of Toxic and Potentially Toxic Chemicals for Consideration by the National Toxicology Program, Toxicity Testing (1984); R. E. Tucker, A. L. Young, \u0026 A. P. Gray, Human and Environmental Risks of Chlorinated Dioxins and Related Compounds (1984); Office of Science and Technology Policy, Chemical Carcinogens: Review of the Science and Its Associated Principles, 49 Fed.Reg. 21594 (1984); Proceedings of the Seventh Symposium on Statistics and the Environment, 37 American Statistician 359 (1983); National Research Council, Committee on the Institutional Means for Assessment of Risks to Public Health, Risk Assessment in the Federal Government: Managing the Process (1983); Leape, Quantitative Risk Assessment in Regulation of Environmental Carcinogens, 4 Harv.Envt'l L.Rev. 86, 100-03 (1980). The problem of obtaining useful data on the effects of Agent Orange is particularly difficult for a number of reasons. First, the relatively young males who served in Vietnam were a highly selected, healthy group so that the expected mortality was relatively slight in their early ages and a comparison with base civilian population is difficult. Second, there may be many confounding factors that explain diseases such as stress of combat and local natural and man-made carcinogens. Third, the cancers involved may take a long time to reveal themselves since they become important in a epidemologic sense only in older age groups. Some of the problem is revealed in the table below, taken from the Air Force Health Study of some 1000 Air Force personnel, showing very few cancers among the control group or the Ranch Hand group. TOTAL MORTALITY AND MORBIDITY STUDY MORPHOLOGY OF SYSTEMIC NEOPLASM ICD-O MORTALITY MORBIDITY CODES NOMENCLATURE RANCH HAND COMPARISON RANCH HAND COMPARISON O S RM800 Neoplasm not otherwise specified (NOS) Bronchus and Lung 0 1 0 0 0 0 Intestinal Tract 0 1 0 0 0 0M801-804 Epithelial neoplasms Appendix 0 0 0 1 0 0 Bladder 0 0 0 1 0 0 Bronchus and Lung 1 1 1 0 0 0 Kidney 1 0 0 0 0 0 Lip 0 0 1 0 0 0 Nasopharynx 0 1 0 0 0 0 Tongue 0 0 1 0 0 0 Unspecified site 1 1 0 0 0 0 Vocal Cord 0 0 0 1 0 0M805-808 Papillary and Squamous Cell Lip 0 0 2 2 0 0 Lung 0 0 1 0 0 0M812-813 Transitional Cell Papillomas and Carcinomas Bladder 0 0 2 0 1 0M814-838 Andenomas and Adenocar- cinomas Bronchus and Lung 0 1 0 0 0 0 Colon 0 0 0 2 0 1 Kidney 0 1 1 0 0 0 Prostate 0 0 1 1 0 0 Pancreas 0 0 0 1 0 0M850-854 Ductal, lobular,and medul- lary neoplasms Thyroid 0 0 0 1 0 0M872-879 Nevi and Melanomas Mediastinal 1 0 0 0 0 0M905 Mesothelioma Bronchus and Lung 0 1 0 0 0 0M906-909 Germ cell neoplasms Testicle 0 0 2 0 0 0M938-948 Gliomas Frontal Lobe 0 1 1 0 0 0\n\n[From Ranch Hand II Study -- 1984 Report, Table X-6] Even in cohorts as large as 6000, such as that being used in the Centers for Disease Control Study of Veterans, the incidence in the general population of diseases of particular concern in this case is so low that changes due to exposure to any one chemical such as Agent Orange are difficult to detect. This is shown by the table below. Estimated Yearly Number of Cases \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\" Prevalence Number of of Vietnam Soft Tissue Nasal and \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\" Primary \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\" Age Males Service Sarcoma Lymphoma Nasopharyngeal Liver \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\" \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\" \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\" \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\" 30-34 980 4.0 20 53 4 335-39 907 11.7 14 45 5 340-44 740 12.5 17 52 6 545-49 590 3.7 22 75 10 1250-54 552 1.5 33 106 17 20Total 3,769 7.4 106 331 42 43\n\n[From CDC Protcol Table 4]\n\nA government administrative agency may regulate or prohibit the use of toxic substances through rulemaking, despite a very low probability of any causal relationship. A court, in contrast, must observe the tort law requirement that a plaintiff establish a probability of more than fifty percent that the defendant's action injured him. See IV, B, Failure to Determine Who Caused Harm and Who Was Harmed, infra. This means that at least a two-fold increase in incidence of the disease attributable to Agent Orange exposure is required to permit recovery if epidemiological studies alone are relied upon. The numbers are such that even when we put aside such confounding factors as use of drugs administered for malaria or self administered through smoking or drinking, special stresses and natural carcinogens peculiar to service in Vietnam, see, e.g., S. Karnow, Vietnam, A History 25-26 (1983), increased relative risks are hard to prove. This point is illustrated by the table set out below and other tables of the CDC Protocol for Epidemiologic Studies of the Health of Veterans at 43, 48-49; see also Appendix F. Extrapolations to all Vietnam veterans (approximately 2,400,000) from the table below, which is designed for 6,000, can be obtained by multiplying the table's figure by 400. These figures, it should be pointed out, are for a sample civilian population and therefore do not take account of special health and other factors that may affect Vietnam veterans. Putting aside such problems, the total expected deaths of veterans after the war would be in the order of 85,000. More than 52,000 deaths would be violent -- accident, homicide and suicide --, about the number of deaths of United States servicemen in Vietnam from 1961 to 1972. The New Columbia Encyclopedia, Vietnam War, 2891 (1975). Cumulative Expected Numbers of Deaths by Cause1a in a Hypothetical Cohort of 6,000 Men Aged 22 in 1968 and Followed Through 1984 (17 Years) Expected Number Cause of death2a of Deaths All causes 213.0Accidents (E800-E949) 79.1Motor vehicle (E810-#823) 48.3Other (E800-E807, E825-E949) 30.8Suicide (E950-E959) 25.5Homicide (E960-E978) 27.3Diseases of Heart 18.6(390-398, 402, 410-429)Malignant Neoplasms 17.3(140-204)Cirrhosis of liver (571) 6.6Cerebrovascular diseases 3.6(430-438)Influenza and Pneumonia 2.9(470-474, 480-486)Diabetes Mellitus (250) 2.1Nephritis and nephrosis 0.7(580-584)Bronchitis, emphysema 0.5and Asthma (490-493)Septicemia (038) 0.5All other causes (residual) 28.2\n\n[From CDC Protocol, Table 1]\n\nYet, despite the lack of general scientific evidence, it cannot be said without hearing the evidence that the plaintiffs could not possibly recover. In Plaintiffs' Fairness Brief, dated August 7, 1984, at 38-43, they summarize their evidence on representative plaintiffs based upon their proposed expert opinion testimony. The flavor of their claims is illustrated by the following paragraph (citations to depositions and some omissions not indicated):\n\nAs to those Representative Plaintiffs whose cases were to be tried beginning May 7, 1984, Plaintiffs' experts, Dr. Alastair Hay, Dr. Ellen Silbergeld, Dr. Marvin Legator, Dr. Lennart Hardell, Dr. Ronald Codario, Dr. Peter Orris and Dr. Alan Levin, testified [in depositions] that in their scientific opinions, based on reasonable medical and/or scientific certainty and/or probability certain specific conditions of the 5 Representative Plaintiff veterans resulted from their exposure to Agent Orange in Vietnam. Further, Dr. Silbergeld, Dr. Legator, and Dr. Levin testified that the birth defects suffered by Chad and Michael Jordan and Kerry Ryan were the result of their fathers' exposure to Agent Orange, with its contaminant dioxin, in Vietnam. More specifically, Dr. Hardell, Dr. Legator, Dr. Sillbergeld, Dr. Levin, Dr. Codario and Dr. Orris testified that George Ewalt's basal cell carcinoma, David Lambiotte's lymphocytic lymphoma and basls cell carcinoma and Danny Ford's rhadbomyosarcoma (a soft-tissue sarcoma) were proximately caused by these veterrans' exposure to Agent Orange in Vietnam.\n\nThis positive evaluation of the depositions is that of plaintiffs' counsel, not that of the court. How effective the testimony would be at trial is not clear. The birth defect testimony would be subject to analysis in light of the study published by the Centers for Disease Control after the depositions relied upon by plaintifffs. See III, C, Scientific Studies on Causal Relationship, infra. Briefs and other materials from defendants throw substantial doubt on the probative force of this evidence and indicate that highly persuasive contrary evidence on specific causality would have been offered had the case gone to trial. See the extensive brief submitted by defendants in support of the settlement, dated August 24, 1984, devoting 260 pages to the proposition that plaintiffs cannot prove causation, with extensive documentation.\n\nIt is possible that the court would have admitted all the experts' evidence offered by both sides, leaving it to the jury to decide credibility. See Federal Rules of Evidence, Rules 702, 703. Experience with hundreds of Eastern District of New York juries over an eighteen year period gives the court no confidence in predicting how the jury would evaluate this evidence. Based on the evidence so far provided, however, even if the case were permitted to go to a jury and even were there a verdict for plaintiffs, it appears doubtful whether the verdict would have withstood a post-trial motion for judgment notwithstanding the verdict in the trial and appellate courts. This legal evaluations shared by almost all attorneys from both sides in the case provides a strong inducement for plaintiffs to settle.\n\nC. Scientific Studies on Causality\n\nThe effect of exposure to dioxin has been and is being studied at least as intensively as that of any other toxic substance. To date none of the studies furnish sufficient support for plaintiffs' casuality claims to warrant a recovery by individuals.\n\nA number of state studies of Agent Orange effects on veterans do not provide substantial support to plaintiffs because of their small size, self-selective nature and other defects. See, e.g., G. R. Newell, Development and Preliminary Results of Pilot Clinical Studies (March 26, 1984) (Texas Study); New York State Temporary Commission on Dioxin Exposure, What You Should Know About Dioxin (January, 1983) (New York Report). See also 3 Agent Orange Rev. 1 (July 1984) (describing other ongoing state studies). At the hearings in New York, representatives of New Jersey's Agent Orange Commission indicated that New Jersey was about to undertake a scientific study, but its results will probably not be available for a year or more. At the Chicago hearings a proposed Wisconsin study was described, but it will not be available until at least December 1985. A reference to the Australian study of birth defects is made in the Study of the Centers for Disease Control described in the next section; it is essentially negative.\n\nThe Texas study of 85 men with the assumed highest exposure to Agent Orange provided no statistically significant correlation with observed cell aberrations. Texas Study, supra, at 12-13. There also was no demonstrated effect on sperm characteristics. Id. at 14-15. Immunologic studies also proved essentially negative. Id. at 16-18. The New York State sponsored studies, one a proportional mortality rate study and another, an epidemiological study of soft tissue sarcoma, both based primarily on death certificates are expected to be published late in 1984. New York Report at 13. The value of the New York Studies has been recognized as extremely limited. See New York State Department of Health, Dioxin Exposure 28-29 (April 1982).\n\nThe most intensive Agent Orange study of effects on veterans published to date is that of the Air Force. Air Force Health Study, An Epidemiologic Investigation of Health Effects in Air Force Personnel Following Exposure to Herbicides (February 24, 1984) (Ranch Hand II Study -- 1984 Report). This study utilized 1024 matched pairs of men for analysis. Id. at v. Essentially all those who had participated in the fixed wing spraying and who could be located were studied. The conclusion was negative. In summary,\n\nThis baseline report concludes that there is insufficient evidence to support a cause and effect relationship between herbicide exposure and adverse health in the Ranch Hand group at this time.\n\nId. at iii.\n\nUndoubtedly this conclusion is subject to reevaluation insofar as it is sought to extrapolate from it to the entire class of plaintiffs. It is, for example, obvious that Air Force personnel who generally have clean clothes and showers available at the end of their missions are in a far different situation from a marine or soldier in the jungle who may be drinking contaminated water and living under primitive conditions in sprayed areas.\n\nThere were a number of anomalies noted in the Ranch Hand Study. For example, significantly more nonmelanotic skin cancers were observed in the ranch handers, but whether that was due to differences in exposure to sunlight -- the prime etiology of these cancers -- was not determined. Id. at ii. Ranch Hand offspring \"showed significantly more minor birth defects (birth marks, etc). . . . [N]eonatal deaths and physical handicaps were also significantly excessive in the Ranch Hand Group,\" but there was an inconsistent relationship to the herbicide exposure index. Id. Subjective deficits such as fatigue, anger, fear and anxiety were higher in the Ranch Hand personnel. Id. Significantly, however, \"no cases of chloracne were diagnosed clinically or by biopsy.\" Id. at iii, XV-9.\n\nIt is fair to say that some of the Ranch Hand Study findings were \"puzzling.\" Id. at iii. The small sample and other factors, particularly the length of time it takes for most cancers to develop, support the conclusion that more work is needed before any firm conclusion can be reached respecting morbidity. Id. at v. The authors support a 20 year mortality follow-up study. Id. at v., XVIII-I.\n\nThe Ranch Hand Study authors state that \"[i]n full context, the baseline study results should be viewed as reassuring to the Ranch Handers and their families at this time.\" Id. at iii; see also id. at XIV-4 to XIX-9.Their study, however, offers no solace to either defendants or plaintiffs in the instant litigation. It simply seems inconclusive.\n\nThe other major study of the effect of Agent Orange published to date is that on birth defects of the Center for Disease Control. It furnished no material support for plaintiffs' claims. Because it was first publicly released only a short time ago in The Journal of the American Medical Association, it is too early for critical analysis by medical and statistical experts and others. See J. D. Erickson, J. Mulinare, P. C. McClain, T. G. Fitch, L. M. James, A. B. McClearn \u0026 M. J. Adams, Jr., Vietnam Veterans' Risks for Fathering Babies With Birth Defects, 252 J.A.M.A. 903 (Aug. 17, 1984) (CDC Birth Defect Study). Because it has been condensed and somewhat simplified, the JAMA version rather than the original CDC Birth Defect Study is referred to in the discussion and quotations that follow.\n\nThe study covers male-mediated defects only. There are a number of female veterans who are members of the class. A female class member who was stationed in Vietnam and claimed exposure to Agent Orange testified at the Chicago hearing. Her pregnancy was apparently in the third trimester when she left Vietnam. The father, her former husband, was a Vietnam veteran who apparently also was exposed before she conceived. The child, a thirteen year old male, apparently suffered from no birth defects, but has recently required some psychiatric help. So far as this witness knew, hers is the only case of this type. For all practical purposes, therefore, the CDC Birth Defect Study is relevant to the entire class of children. Mutagenesis rather than teratogenesis is our primary concern.\n\nThe CDC Birth Defect Study is well summarized and its significance in excluding support for claimed Agent Orange genetic effects is reasonably assessed in an editorial published in JAMA by Bruce B. Dan, M.D., for the American Medical Association. He writes:\n\nDespite the lack of evidence of increased incidence of congenital malformations in children of parents exposed to large doses of TCDD, there has still been concern that birth defects observed in children of men serving in Vietnam might be related to exposure to Agent Orange or to some other chemical during their experience in Southeast Asia. Because serious birth defects occur in approximately 2% to 3% of all live births, the number of such defects that would be expected to have occurred, to date, in children of Vietnam veterans ranges from 50,000 to 150,000. It is not surprising that a veteran who noted a disturbing skin condition apparently associated with his tenure in Vietnam might question whether a birth defect in his child could also be related to that experience.\n\nHow might a chemical exposure be related to congenital malformations? Most birth defects result from the abnormalities of development soon after conception, through either teratogensis or mutagenesis. For teratogenesis to occur, the exposure to a putative chemical agent would have to occur in utero. While it is possible that an absorbed and retained chemical from previous exposure might be transmitted to an embryo through semen, it is unlikely. It is possible, however, that a chemical mutagen could produce future birth defects by disturbing the father's germ cells.\n\nIt is also possible that exposure to a specific infectious agent encountered while in Vietnam could contribute to an increased rate of birth defects. And while it may not be a direct effect of military service, it is conceivable that stress experienced in Vietnam could translate into an unhealthy family milieu with the possibility of inadequate prenatal care, poor nutrition, or abuse of alcohol or other drugs that would adversely affect the pregnancy. Therefore, it is not only important to investigate whether exposure to specific chemical agents could increase the incidence of birth defects, but also whether service in Vietnam alone would have done so.\n\nAs with all retrospective views of \"experiments of nature,\" the study has some inherent strengths and weaknesses.\n\nThe date set is derived from a large subset of the Metropolitan Atlanta Congenital Defects Program, a registry of birth defects observed during the first year of life. Attributes of parents of babies with defined defects were compared with those of randomly selected babies born without known defects. The case group and control group were matched to race, year, and hospital of birth. Parents of each group were questioned by interviewers who were blinded as to case or control status in order to eliminate possible bias.\n\nPossible confounding by known contributors to birth defects, e.g., maternal age, education, or alcohol consumption, were considered in the lengthy analysis. The investigators were able to evaluate possible birth defect syndromes by considering combinations of two and three defects taken together. They also looked at the effect of malaria or malaria chemoprophylaxis.\n\nBecause it is impossible to measure accurately the actual herbicide exposure a veteran may have received, the authors have constructed two indices of possible exposure -- a veteran's own estimate of possible exposure and an objective scoring system based on the serviceman's location, occupation, and dates of service in Vietnam. While neither one of these two scales relates the possible contribution of ingestion, inhalation, or skin contact of herbicides, they are probably the best estimates of exposure that can be obtained. Although imprecision in exposure might exist, the estimates do not seem to be distorted by any bias. The consequence of this imprecision in the exposure to TCDD is the reduction in the sensitivity in detecting specific birth defects.\n\nThe authors are appropriately cautious in the interpretation of their results, but considering the overall strength of the study, the past evidence from human exposure, and the confirming experience of Australian servicemen, it would seem that a fairly strong statement can be made that it is unlikely that serious congenital anomalies in children of men serving in Vietnam were results of that experience. That may be of little consolation to those who have suffered the unfortunate circumstances associated with birth defects. But perhaps it will encourage us to expend more effort in preventing birth defects in any child.\n\n\u003cspan class=\"fn\"\u003e1. Estimated number of males (thousands) in SEER areas, 1976 data projected to 1986, National Cancer Institute Monograph 57, 1981.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Percent of males who are Vietnam veterans; estimated from VA data on numbers of Vietnam era veterans and assumption that 32.2% of Vietnam era veterans served in Vietnam.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Incidence of cancers derived from National Cancer Institute Monograph 57, 1981.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Includes the following (morphology-based) tumor types: fibrosarcoma, malignant fibrous histiocytoma, liposarcoma, leiomyosarcoma, rhabdomyosarcoma, Kaposi's sarcoma (estimate based on pre-AIDS incidence), blood vessel sarcoma, nerve sheath sarcoma, synovial sarcoma, malignant mesenchymona, malignant paragarglioma. Incidence estimates also based on categories \"sarcoma NOS\" and \"other sarcoma.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Includes Hodgkin's Disease and non-Hodgkin's lymphoma.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Includes the following topographic tumor types: nasopharynx, nasal cavity, accessory sinuses.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Includes liver and intrahepatic bile ducts. 1a Expected numbers based on 1978 U.S. age-specific rates for males. The age-specific rates were quinquennial (5 years), and the cumulative rates used to derive the expected numbers were computed by weighting the quinquennial rates by the number of years of cohort experience in each quinquennium (constant cohort size). Source of rates: Vital statistics of the U.S.: 1978, Vol. II, Mortality Part A, NCHS, 1982. 2a Numbers in parentheses are the relevant codes from the Eighth Revision International Classification of Diseases, Adapted. 1b Significant odds ratio or regression coefficients (P 1c Judicially created discovery rule in medical malpractice cases. 2b Judicially created discovery rule in medical malpractice \"foreign object\" cases. 3a Statutorily created discovery rule in professional malpractice cases. 4a Statutorily created discovery rule in medical malpractice cases. 5a Judicially created discovery rule for tort actions. 6a Legislatively created discovery rule for tort actions. 7a If the action is time-barred in the state where it arose, it is barred in the forum state.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. If the action is time-barred in the state where it arose, it is barred in the forum state unless the plaintiff is a citizen of the forum state.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The statute of limitations is tolled during the plaintiff's minority.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The statute of limitations is tolled during the plaintiff's minority except that if the limitations period would have otherwise expired before the end of minority, the suit must be brought no later than two years after the end of minority.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Same as #10, except that the period for filing suit is one year instead of two.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The statute of limitations is tolled during the plaintiff's minority except that all suits must be brought within three years after plaintiff attains majority.\u003c/span\u003e\n\n",
    "body_length": 162457,
    "citedas": [
      "597 F. Supp. 740"
    ],
    "attorneys": "Stephen J. Schlegel, Schlegel \u0026 Trafelet, Ltd., Chicago, Ill., Benton Musselwhite, Law Offices of Benton Musselwhite, Inc., Houston, Tex., Thomas Henderson, Henderson \u0026 Goldberg, Pittsburgh, Pa., Philip E. Brown, Hoberg, Finger, Brown, Cox \u0026 Molliga, San Franciso, Cal., Stanley Chesley, Waite, Schnider, Bayless \u0026 Chesley, Cincinnati, Ohio, John M. O'Quinn, O'Quinn, Hagans \u0026 Wettman, Houston, Tex., Neil R. Peterson and Gene Locks, Greitzer \u0026 Locks, Philadelphia, Pa., Newton B. Schwartz, Houston, Tex., Irving Like, Reilly, Like and Schneider, Babylon, N.Y., David J. Dean, Dean, Falanga \u0026 Rose, Carle Place, N.Y., Aaron Twerski, Hempstead, N.Y., for plaintiffs. , Leonard Rivkin, Rivkin, Leff, Sherman \u0026 Radler, Garden City, N.Y., Philip Pakula, Townley \u0026 Updike, New York City, Wendell B. Alcorn, Jr., Cadwalader, Wickersham \u0026 Taft, New York City, William Krohley, Kelley, Drye \u0026 Warren, New York City, Thomas Beck, Arthur, Dry \u0026 Kalish, New York City, Richard Goldstein, Shea \u0026 Gould, New York City, David M. Gross, Budd, Larner, Kent, Gross, Picillo \u0026 Rosenbaum, New York City, Henry G. Miller, Clark, Gagliardi \u0026 Miller, White Plains, N.Y., for defendants, Arvin Maskin, Dept. of Justice, Washington, D.C., for third-party defendant United States.",
    "category": [],
    "judges": "WEINSTEIN, Chief Judge.",
    "citation_count": 2
  }
}
