{
  "id": "I6JzR2YBTlTomsSBi0es",
  "document": {
    "title": "Powers v. City of Richmond",
    "full_title": "DONNA R. POWERS ET AL. AND v. CITY OF RICHMOND AND .",
    "jurisdiction": "California Supreme Court",
    "date": "1995-05-08T00:00:00.000Z",
    "docket": "No. S039547",
    "body": "KENNARD, J.:\n\nThe Legislature has provided that actions seeking disclosure of documents under the Public Records Act (Gov. Code, § 6250 et seq.; hereafter the PRA) may be brought and tried in superior court, and thus are within that court's original jurisdiction. (Id., §§ 6258-6259.) The Legislature has further provided that superior court decisions in PRA cases are not appealable but instead are \"immediately reviewable by petition to the appellate court for the issuance of an extraordinary writ.\" (Id., § 6259, subd. (c), italics added; hereafter § 6259(c).)\n\nWe granted review in this case to decide whether section 6259(c) -- making a petition for extraordinary writ the exclusive mode of appellate review in PRA actions -- violates our state Constitution and in particular section 11 of article VI, which states that, except when a judgment of death has been pronounced, the \"courts of appeal have appellate jurisdiction when superior courts have original jurisdiction . . . .\" We conclude that section 6259(c) does not violate the \"appellate jurisdiction\" provision of the state Constitution.\n\nI\n\nDonna R. Powers, then a candidate for city council, requested that defendant City of Richmond disclose all expenditures by the mayor, the city council, and the city manager during the second half of fiscal year 1990-1991. The city supplied the requested information in the form of a computer generated report. Powers and certain of her supporters (hereafter collectively plaintiffs) then requested the same information for the first half of fiscal year 1990-1991. This time, the city refused to generate a computer report and instead gave plaintiffs access to a check register in which the requested information was intermingled with information concerning the expenditures of other city departments and agencies.\n\nPlaintiffs then began an action in superior court under the PRA to compel the city to prepare and release a computer generated report containing only the requested information. After hearing evidence, the trial court ruled for the city. Plaintiffs then sought review in the Court of Appeal both by a petition for a writ of mandate and by direct appeal.\n\nAfter soliciting and considering informal opposition concerning the merits of plaintiffs' PRA request, the Court of Appeal denied plaintiffs' writ petition summarily -- that is, without holding a hearing and without issuing a written opinion. The city then moved to dismiss plaintiffs' appeal as barred under section 6259(c). In opposing the motion to dismiss, plaintiffs argued that section 6259(c) violates the \"appellate jurisdiction\" provision of the state Constitution (art. VI, § 11) to the extent it bars direct appeal of a final order of the superior court in a proceeding in which the superior court exercises original jurisdiction.\n\nThe Court of Appeal issued an opinion granting the motion to dismiss. The court interpreted the \"appellate jurisdiction\" provision of the state Constitution as granting the Courts of Appeal power to review final judgments and orders in all proceedings (except death penalty cases) in which superior courts exercise original jurisdiction, but also as not requiring any particular form or mode of this appellate review. Concluding that extraordinary writ petitions and direct appeals are alternative modes of appellate review, the Court of Appeal held that the \"appellate jurisdiction\" provision of the state Constitution does not deprive the Legislature of authority to specify that appellate review of superior court orders in PRA cases shall be by means of petition for extraordinary writ rather than by direct appeal.\n\nII\n\nPlaintiffs contend that the California Constitution, in section 11 of article VI, confers on litigants a right of direct appeal from final orders and judgments in proceedings in which superior courts exercise original jurisdiction. In their view, this constitutional right of appeal necessarily includes the rights to oral argument, a decision on the merits, and a written opinion explaining the basis of the appellate court's decision.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThe issue plaintiffs raise requires that we construe our state Constitution. In construing constitutional provisions, the intent of the enacting body is the paramount consideration. (Davis v. City of Berkeley (1990) 51 Cal. 3d 227, 234, 272 Cal. Rptr. 139, 794 P.2d 897.) To determine that intent, courts look first to the language of the constitutional text, giving the words their ordinary meaning. (Ibid.; see also, Bowens v. Superior Court (1991) 1 Cal. 4th 36, 48, 820 P.2d 600; Lungren v. Deukmejian (1988) 45 Cal. 3d 727, 735, 248 Cal. Rptr. 115, 755 P.2d 299.) We begin, then, with the text of the constitutional provision on which plaintiffs rely:\n\n\"The Supreme Court has appellate jurisdiction when judgment of death has been pronounced. With that exception courts of appeal have appellate jurisdiction when superior courts have original jurisdiction\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e and in other causes prescribed by statute. [P] Superior courts have appellate jurisdiction in causes prescribed by statute that arise in municipal courts in their counties. [P] The Legislature may permit appellate courts to take evidence and make findings of fact when jury trial is waived or not a matter of right.\" (Cal. Const., art. VI, § 11.)\n\nNothing in the text of this provision conveys an intention to confer on litigants a right of direct appeal in cases within the original jurisdiction of the superior courts. Giving the words their ordinary meaning, the provision serves to establish and allocate judicial authority, not to define or guarantee the rights of litigants. Indeed, the provision nowhere mentions direct appeals or a \"right of appeal.\"\n\nThe state Constitution does indeed establish a number of litigant rights, but it does so in article I, entitled \"Declaration of Rights,\" rather than in article VI, entitled \"Judicial.\" For example, section 16 of article I states: \"Trial by jury is an inviolate right and shall be secured to all . . . .\" Had the people of this state intended to give similar constitutional status to a \"right of appeal,\" it is reasonable to assume that they would have used equally direct language and would have placed the right in article I with the other personal rights.\n\nPlaintiffs may be understood to argue that the term \"appellate jurisdiction\" means the power to decide direct appeals and that by giving the Courts of Appeal authority to decide direct appeals in all civil cases brought in superior court, the Constitution implicitly grants litigants a right to bring direct appeals in those same civil cases.\n\nThe ordinary meaning of \"appellate jurisdiction\" is broader than the meaning plaintiffs would ascribe to it. A legal dictionary defines \"appellate\" as \"pertaining to or having cognizance of appeals and other proceedings for the judicial review of adjudications.\" (Black's Law Dictionary (6th ed. 1990) p. 97, italics added.) The same dictionary defines \"appellate jurisdiction\" as \"the power vested in an appellate court to review and revise the judicial action of an inferior court\" and as \"the power of review and determination on appeal, writ of error, certiorari, or other similar process.\" (Id. at p. 98, italics added.)\n\nThe United States Supreme Court has declared that the \"essential criterion of appellate jurisdiction\" is \"that it revises and corrects the proceedings in a cause already instituted, and does not create that cause.\" (Marbury v. Madison (1803) 5 U.S. (1 Cranch) 137, 175, 2 L. Ed. 60.) Applying this definition, the high court has concluded that appellate jurisdiction includes review by writ, including the writ of habeas corpus. (Ex parte Watkins (1833) 32 U.S. (7 Peters) 567, 572.) Courts in other states have given similar definitions of the term \"appellate jurisdiction.\" (See, e.g., Ward School Bus. Mfg., Inc. v. Fowler (Ark. 1977) 261 Ark. 100, 547 S.W.2d 394, 395 [\"the review of an order or decree of an inferior court\"]; Lane v. State (Fla. 1944) 154 Fla. 853, 19 So. 2d 366, 368 [\"'the power to take cognizance of and review proceedings in an inferior court irrespective of the manner in which they are brought up, whether by appeal or writ of error'\"]; In re Constitutionality of House Bill No. 222 (Ky.Ct.App. 1936) 262 Ky. 437 [90 S.W.2d 692, 693] [quoting the Marbury definition of \"appellate jurisdiction\"]; Rudnick v. City of Jamestown (N.D. 1990) 463 N.W.2d 632, 636 [\"the power of a superior court to review and revise a decision that has been rendered by an inferior court or tribunal\"]; Carder v. Court of Criminal Appeals (Okla. 1979) 595 P.2d 416, 419 [\"that power and jurisdiction to review and correct those proceedings of inferior courts brought for determination in the manner provided by law\"]; Waters-Pierce Oil Co. v. State (Tex. 1907) 107 Tex. 1, 106 S.W. 326, 331 [\"'the power and authority conferred upon a superior court to rehear and determine causes which have been tried in inferior courts'\"].)\n\nAs these authorities amply establish, the ordinary and widely accepted meaning of the term \"appellate jurisdiction\" is simply the power of a reviewing court to correct error in a trial court proceeding. By common understanding, a reviewing court may exercise this power in the procedural context of a direct appeal, a writ petition, or otherwise. Thus, a provision conferring \"appellate jurisdiction\" does not necessarily or strongly imply a right of litigants to bring direct appeals.\n\nWe conclude that textual analysis, which is the best indicator of the intended meaning of a constitutional provision, does not support plaintiffs' contention that the \"appellate jurisdiction\" provision confers on litigants a right to a direct appeal in cases within the original jurisdiction of the superior courts. To declare such a right would \"violate the cardinal rule that 'The Constitution is to be interpreted by the language in which it is written, and courts are no more at liberty to add provisions to what is therein declared in definite language than they are to disregard any of its express provisions.'\" (Delaney v. Superior Court (1990) 50 Cal. 3d 785, 799, 268 Cal. Rptr. 753, 789 P.2d 934, quoting People v. Campbell (1902) 138 Cal. 11, 15, 70 P. 918.)\n\nWe might well stop here. This court has stated that resort to extrinsic aids to interpret a constitutional provision is justified only when the constitution's language is ambiguous. (Delaney v. Superior Court, supra, 50 Cal. 3d 785, 798; ITT World Communications, Inc. v. City and County of San Francisco (1985) 37 Cal. 3d 859, 868, 210 Cal. Rptr. 226, 693 P.2d 811.) Although we find no ambiguity in article VI, section 11, nevertheless, in an abundance of caution, we shall test our construction against those extrinsic aids that bear on the enactors' intent.\n\n1966 CONSTITUTIONAL REVISION\n\nThe provision we construe here -- article VI, section 11 -- was enacted in substantially its present form\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e in 1966, when the previous article VI was repealed and its provisions revised and redistributed. This comprehensive revision was largely drafted by the California Constitutional Revision Commission,\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e and a court may consult the commission's official reports to determine the intent and objective of ambiguous provisions. (Mosk v. Superior Court (1979) 25 Cal. 3d 474, 495, 159 Cal. Rptr. 494, 601 P.2d 1030.) An examination of the records of the commission's official proceedings reveals that its basic objective in revising article VI was \"to delete provisions which were redundant, obsolete, or unnecessary for inclusion in the Constitution, such as procedural matters which could be prescribed or provided for by statute or court rule.\" (Mosk v. Superior Court, supra, at p. 496.) By removing \"unnecessary\" provisions from article VI, and allowing those matters to be regulated by statute, the commission's revisions of article VI effectively broadened the scope of the Legislature's control over judicial procedures.\n\nIn its report recommending adoption of section 11 of article VI, the commission gave this explanation for its proposal: \"This section collects those parts of existing Sections 4, 4b, 4e, and 5 that deal with appellate jurisdiction. Some of the existing sections contain detailed references to instances of appellate jurisdiction. The Commission deleted those references as unnecessary in the Constitution except in death penalty cases where, because of the extreme nature of the penalty, jurisdiction was given to the Supreme Court. [P] The phrase 'on questions of law alone,' as a description of appellate jurisdiction in criminal causes when judgment of death has been rendered was deleted as unnecessary since this is the ordinary scope of review in appellate courts.\" (Cal. Const. Revision Com., Proposed Revision (1966) p. 91.)\n\nWe have diligently researched all available records of the commission's proceedings and reports bearing on the \"appellate jurisdiction\" provision, and we have found therein not a single reference to a litigant's \"right of appeal\" and nothing that would suggest in any way that the commission understood or intended that the \"appellate jurisdiction\" would confer on litigants a right to a direct appeal.\n\nThe new article VI as drafted by the commission and approved by the Legislature was submitted to the voters as Proposition 1-a at the general election held on November 8, 1966. Because the voters at this election are the enactors of the provision we here construe, their intent governs. (Delaney v. Superior Court, supra, 50 Cal. 3d 785, 798.) For further evidence of their intent, we consider the arguments presented in the ballot pamphlet, which are \"accepted sources from which to ascertain the voters' intent.\" (Id. at p. 801.)\n\nWe have closely examined the ballot pamphlet for the election of November 8, 1966, and in particular those parts dealing with Proposition 1-a. The ballot pamphlet contains no mention of any \"right of appeal\" under the state Constitution and no suggestion that the \"appellate jurisdiction\" provision would have an effect not discernible from the \"plain meaning\" of its words.\n\nOnce again, we might well stop here. Having found no support for plaintiffs' proposed construction in either the language of the \"appellate jurisdiction\" provision or in sources contemporary with that provision's enactment, we would certainly be justified in declining to consider more remote and speculative evidence of the enactors' intent. But plaintiffs and the Dissent argue that in adopting article VI, section 11, the voters may be presumed to have intended that the words \"appellate jurisdiction\" carry the meaning they had in earlier constitutional provisions as authoritatively construed by the courts. They rely on the rule that the \"adoption of constitutional language similar to that in a former constitutional provision is presumed to incorporate authoritative judicial construction of the former language.\" (Sarracino v. Superior Court (1974) 13 Cal. 3d 1, 8, 118 Cal. Rptr. 21, 529 P.2d 53.) To assess the strength of this argument, we will review the historical antecedents of article VI, section 11, to determine whether, in 1966, the term \"appellate jurisdiction\" had an \"authoritative judicial construction\" that embraced a right to a direct appeal.\n\n1849 CONSTITUTION\n\nThe earliest antecedent of the \"appellate jurisdiction\" provision of the present state Constitution appears in the 1849 Constitution as article VI, section 4. It provided:\n\n\"The Supreme Court shall have appellate jurisdiction in all cases when the matter in dispute exceeds two hundred dollars, when the legality of any tax, toll, or impost or municipal fine is in question, and in all criminal cases amounting to felony or questions of law alone. And the said Court, and each of the Justices thereof, as well as all district and county Judges, shall have power to issue writs of habeas corpus at the instance of any person held in actual custody. They shall also have power to issue all other writs and process necessary to the exercise of their appellate jurisdiction, and shall be conservators of the peace throughout the state.\"\n\nAt the constitutional convention of 1849,\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e there was spirited debate about the merits of limiting this court's appellate jurisdiction to cases \"when the matter in dispute exceeds two hundred dollars.\" (See Rep. of the Debates, Cal. Const. Convention 1849, pp. 225-233; hereafter 1849 Debates.) Opponents of this restriction argued that it favored the wealthy,\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e while the proponents argued that it would protect rich and poor alike from the costs of excessive litigation and that the Supreme Court's time should not be taken up with relatively minor matters.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nBecause several of the delegates framed the issue as whether litigants in cases involving $200 or less should have a \"right of appeal,\"\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e we have carefully examined these statements to determine what the delegates understood that term to mean. Although the delegates never expressly defined the term \"right of appeal,\" its meaning as used in the convention proceedings is fairly summarized by the remark of one delegate (Mr. Norton) that if a case were to be wrongly decided by a trial court, a litigant \"should have the right to go to the highest tribunal to get Justice\" or the \"right to go to a higher tribunal and have that decision reversed.\" (1849 Debates, supra, at p. 227.)\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Significantly, the debate concerning the $200 limitation contains no Discussion of review by petition for extraordinary writ as a procedure separate and distinct from the \"right of appeal.\" Finally, and perhaps most significantly, the delegates appear to have assumed that if as to a particular matter there was no \"appellate jurisdiction\" -- and hence no \"right of appeal\" -- then the trial court's judgment would be final and unreviewable.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e In short, our examination of the constitutional debates persuades us that when the delegates spoke of a \"right of appeal,\" they used the term \"appeal\" to include all forms of appellate review, including but not limited to direct appeal.\n\nThis would not be an unusual or improper use of the term \"appeal.\" As a legal term, \"appeal\" is generally defined as \"resort to a superior (i.e., appellate) court to review the decision of an inferior (i.e., trial) court or administrative agency\" (Black's Law Dictionary, supra, p. 96 ) or, in the words of Justice Story, as \"a complaint to a superior court of an inJustice done by an inferior one\" (U.S. v. Wonson (1812) 1 Gall. 5, 28 Fed. Cas. 745, 748, citing 4 Blackstone's Commentaries 312). Like the term \"appellate jurisdiction,\" the word \"appeal\" is not necessarily limited to direct appeals, but may include also writ petitions and other procedural devices.\n\nThis court first had occasion to construe the \"appellate jurisdiction\" provision of the 1849 Constitution in People ex rel. Mulford v. Turner (1850) 1 Cal. 143 (hereafter Turner). There, a trial court had made an order expelling three attorneys from the bar for defiant behavior. The expelled attorneys petitioned this court to reverse the order by issuing a writ of mandate. Because the 1849 Constitution had not given this court original jurisdiction in mandate proceedings, there was a question of this court's power to entertain the petition. This court concluded that it had received power to issue the writ from the part of the 1849 Constitution's \"appellate jurisdiction\" provision that expressly granted this court authority \"to issue all other writs and process necessary to the exercise of [its] appellate jurisdiction.\" (1849 Cal. Const., art. VI, § 4.) Thus, this court recognized at an early date that an appellate court exercises \"appellate jurisdiction\" when it entertains an original proceeding in mandate for the purpose of reviewing an order or judgment of a trial court.\n\nThe \"appellate jurisdiction\" provision of the 1849 Constitution was again before this court in Haight v. Gay (1857) 8 Cal. 297 (hereafter Haight). In that case, the defendants \"sued out a writ of error\" after this court had dismissed their appeal for failure to timely file the appellate record. This court granted a motion to quash the writ, relying on a statute that made direct appeal the exclusive means of appellate review for the challenged judgment, thereby barring use of the writ of error as an avenue of appellate review. The defendants contended that by restricting this court's ability to review the judgment, the statute violated the \"appellate jurisdiction\" provision of the 1849 Constitution. This court rejected the defendants' attack on the constitutionality of the statute, with these words:\n\n\"The appellate power of the Supreme Court is given by the fourth section of the sixth article of the Constitution, which expressly empowers this Court to issue all writs and process necessary to the exercise of its appellate jurisdiction. The Legislature, therefore, can pass no act impairing the exercise of this appellate power. [P] But while the Legislature cannot substantially impair the right of appeal, it is certainly competent to regulate the mere mode in which this right must be asserted. The Constitution only empowers this Court to issue such writs and process as may be necessary to the exercise of its appellate jurisdiction; if this appellate jurisdiction can be exercised without this process, then it cannot be necessary, and should not be issued.\" (Haight, supra, 8 Cal. 297, 300, italics added, original italics omitted.)\n\nLike the delegates to the 1849 constitutional convention, this court appears to have viewed the \"appellate jurisdiction\" provision of the 1849 Constitution as conferring or implying a \"right of appeal,\" but this court likewise recognized that there was more than one \"mode\" in which this \"right of appeal\" might be exercised. Viewing the \"writ of error\" and direct appeal as alternative modes of appellate review, we concluded that the Legislature had constitutional authority to determine which mode would be permitted, so long as it did not thereby impair the exercise of the appellate power.\n\n1862 AMENDMENT\n\nIn 1862, the 1849 Constitution was amended to provide for appellate jurisdiction in \"all cases at law . . . in which the demand, exclusive of interest or the value of the property in controversy amounts to three hundred dollars\" and \"all cases in equity\" as well as \"cases at law which involve the title or possession of real estate\" and \"all cases arising in the Probate Courts.\" (Cal. Const. of 1849, art. VI, § 4.)\n\nThe view that the Legislature had at least some authority to specify the manner in which courts exercised jurisdiction conferred by the 1849 Constitution received additional support in Ex Parte Harker (1875) 49 Cal. 465. There, the petitioners had been taken into custody, in a civil case, under a writ of ne exeat.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e They argued that this use of the common law writ violated a statute restricting the means for making arrests in civil cases. The opposing side argued that the power to issue the writ was implicit in the constitutional grant of original jurisdiction. This court ordered the petitioners discharged from custody, stating that \"the mere procedure by which jurisdiction is to be exercised may be prescribed by the Legislature, unless, indeed, such regulations should be found to substantially impair the constitutional powers of the Courts, or practically defeat their exercise.\" (Ex Parte Harker, supra, 49 Cal. at p. 467.) Thus, this court construed a provision of the 1849 Constitution conferring \"original jurisdiction\" as limiting the Legislature's power to specify procedures for the exercise of that jurisdiction, but it defined that limit in terms of an effect on judicial powers and not in terms of how it might advantage or disadvantage litigants. As we shall see, this court later adopted the same view in construing the \"appellate jurisdiction\" provision of the 1879 Constitution.\n\n1879 CONSTITUTION\n\nCalifornia adopted a new Constitution in 1879. Article VI, section 4, of that Constitution provided:\n\n\"The Supreme Court shall have appellate jurisdiction in all cases in equity, except such as arise in Justices' Courts; also, in all cases at law which involve the title or possession of real estate, or the legality of any tax, impost, assessment, toll, or municipal fine, or in which the demand, exclusive of interest, or the value of the property in controversy, amounts to three hundred dollars; also, in cases of forcible entry and detainer, and in proceedings in insolvency, and in actions to prevent or abate a nuisance, and in all such probate matters as may be provided by law; also, in all criminal cases prosecuted by indictment, or information in a Court of record on questions of law alone. The Court shall also have power to issue writs of mandamus, certiorari, prohibition and habeas corpus, and all other writs necessary or proper to the complete exercise of its appellate jurisdiction. Each of the Justices shall have power to issue writs of habeas corpus to any part of the State, upon petition by or on behalf of any person held in actual custody, and may make such writs returnable before himself, or the Supreme Court, or before any Superior Court in the State, or before any Judge thereof.\"\n\nThis provision was the subject of debate at the 1878-1879 constitutional convention. (See Debates \u0026 Proceedings, Cal. Const. Convention 1878-1879, pp. 962-966, 1333; hereafter 1879 Debates.) Much of the debate concerned the $300 \"amount in controversy\" limitation on this court's appellate jurisdiction. As had occurred at the 1849 convention, some of the delegates framed the debate in terms of whether civil litigants in matters involving relatively small sums of money ought to have a \"right of appeal,\" a term that the delegates did not pause to define.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e The same term was also used in debating the scope of this court's appellate jurisdiction in criminal cases.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Once again, the absence of any Discussion of the relative merits of writ petitions and direct appeals as alternative modes of appellate review, and the apparent assumption of the delegates that a trial court's judgment would not be reviewable at all if a litigant was denied a \"right of appeal,\"\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e strongly support the Conclusion that the delegates used the term \"right of appeal\" expansively to encompass all forms of appellate review.\n\nAs we have seen, the \"appellate jurisdiction\" provision of the 1849 Constitution had received an authoritative judicial construction when the 1879 constitutional convention performed its labors. This court had established in Turner, supra, 1 Cal. 143, that this court exercised \"appellate jurisdiction\" when it entertained an original writ proceeding to review an order or judgment of a trial court. And in Haight, supra, 8 Cal. 297, this court had established that review by writ and review by direct appeal were alternative modes for the exercise of appellate jurisdiction and that the Legislature had constitutional authority to determine which mode would be available, provided it did not thereby impair the exercise of appellate power. When they adopted language similar to the \"appellate jurisdiction\" provision of the 1849 Constitution, the enactors of the 1879 Constitution may be deemed to have incorporated this authoritative judicial construction.\n\nThe 1879 Constitution's grant of \"appellate jurisdiction\" to this court was held to be self-executing in People v. Jordan (1884) 65 Cal. 644, 4 P. 683. There, the People appealed from a judgment for the defendant after the trial court had sustained a demurrer to an indictment charging a misdemeanor. The defendant moved to dismiss the appeal. He argued, among other things, that the appeal would not lie because the Legislature had established an appeal procedure only for those criminal prosecutions \"amounting to felonies,\" and had established no procedure for appellate review of misdemeanor prosecutions. (Id. at p. 645.)\n\nThis court rejected the defendant's argument, holding that because the 1879 Constitution had granted this court appellate jurisdiction in \"all criminal cases prosecuted by indictment,\" the Legislature could not defeat that power by failing to establish a procedure for its exercise. We said: \"When a certain jurisdiction has been conferred on this or any court, it is the duty of the court to exercise it; a duty of which it is not relieved by the failure of the legislature to provide a mode for its exercise.\" (People v. Jordan, supra, 65 Cal. 644, 646.)\n\nBecause the Legislature had not authorized review by extraordinary writ, we did not consider whether appellate review in that form would have satisfied the \"appellate jurisdiction\" provision of the 1879 Constitution. Significantly, however, we referred to the Legislature's failure to provide \"a mode\" for the exercise of appellate jurisdiction (People v. Jordan, supra, 65 Cal. 644, 646), thereby necessarily implying that more than one such mode was possible. In context, the word \"mode\" could refer only to a distinct procedure for obtaining appellate review (such as direct appeal or extraordinary writ petition) and not merely to procedural rules governing direct appeals.\n\nA reference to a \"right of appeal\" under the \"appellate jurisdiction\" provision of the 1879 Constitution appears in this court's decision in People ex rel. Davidson v. Perry (1889) 79 Cal. 105, 21 P. 423, but again the context discloses that the reference was to appellate review generally rather than to the specific procedure known as a direct appeal. The case involved a contest between two individuals claiming the same seat on San Francisco's Board of Health. The claimants litigated the dispute in a special superior court proceeding that the Legislature had established to resolve such contests. The claimant who lost in the superior court appealed to this court. The other claimant (who had prevailed in superior court) argued that the appeal did not lie because the special superior court proceeding was not among the proceedings over which the 1879 Constitution gave this court appellate jurisdiction.\n\nThis court rejected the contention, reasoning that the special proceeding was simply a form of quo warranto.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e This court stated: \"And we think this court retains jurisdiction of the case, notwithstanding the legislature may have changed the procedure, enlarged the remedy, and given it a new name. To hold otherwise would be to admit a power in the legislature to abridge our jurisdiction, and take from parties the right of appeal, by the easy device of a change of procedure, in many cases where the right and jurisdiction are unquestioned.\" (People ex rel. Davidson v. Perry, supra, 79 Cal. 105, 108, italics added, original italics omitted.)\n\nThis court had occasion to construe the term \"appellate jurisdiction\" in In re Jessup (1889) 81 Cal. 408, 22 P. 742. The Legislature had enacted a statute requiring a vote of five of this court's seven Justices to grant a rehearing. To determine the constitutionality of the statute, we examined the provision of the 1879 Constitution granting this court appellate jurisdiction. We said: \"The only possible controversy is as to the extent of the power implied ex vi termini[\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e] by the phrase 'appellate jurisdiction.' That this embraces the right to review the final judgments of the courts of original jurisdiction, -- the right, in other words, to reverse, affirm, or modify them, and to enforce by some appropriate mandatory process the judgment of the appellate tribunal, -- will scarcely be denied.\" (In re Jessup, supra, 81 Cal. 408, 465; see also, Maxson v. Superior Court (1899) 124 Cal. 468, 473-474, 57 P. 379.) This definition of \"appellate jurisdiction\" -- as the power or \"right\" of one court to correct error in a decision, order, or judgment of another court -- is consistent with common legal usage, as we have seen.\n\nThis court's decision in In re Jessup, supra, 81 Cal. 408, is significant also because it further supports the Conclusion that a court may exercise \"appellate jurisdiction\" by means other than direct appeal. Quoting from Ex Parte Harker, supra, 49 Cal. 465, 467, we reiterated that \"'the mere procedure by which jurisdiction is to be exercised may be prescribed by the legislature, unless, indeed, such regulations should be found to substantially impair the constitutional powers of the courts, or practically defeat their exercise.'\" (In re Jessup, supra, 81 Cal. 408, 470, italics omitted.)\n\n1904 AMENDMENT\n\nIn 1904, article VI, section 4 of the Constitution was amended to establish the Courts of Appeal and to transfer from this court to those courts \"appellate jurisdiction on appeal from the Superior Courts in all cases at law in which the demand, exclusive of interest, or the value of the property in controversy, amounts to three hundred dollars, and does not amount to two thousand dollars; also, in all cases of forcible and unlawful entry and detainer (except such as arise in Justices' Courts), in proceedings in insolvency, and in actions to prevent or abate a nuisance; in proceedings of mandamus, certiorari and prohibition, usurpation of office, contesting elections and eminent domain, and in such other special proceedings as may be provided by law (excepting cases in which appellate jurisdiction is given to the Supreme Court); also, on questions of law alone, in all criminal cases prosecuted by indictment or information in a court of record, excepting criminal cases where judgment of death has been rendered.\"\n\nThis court retained appellate jurisdiction over all cases in equity, cases involving title to or possession of real estate, the legality of any tax, or where the amount in controversy was $2,000 or more, and in \"such probate matters as may be provided by law.\" (Cal. Const. of 1879, art. VI, § 4, as amended Nov. 8, 1904.)\n\nThe scope of the Legislature's authority to regulate appellate procedures was again before this court in In re Sutter-Butte By-Pass Assessment (1923) 190 Cal. 532, 213 P. 974 (hereafter Sutter-Butte). Having authorized a drainage district to issue bonds and to assess benefited property for revenue to service the bonds, the Legislature established a special validation proceeding under which three superior court Judges in the most affected county would determine the validity of an assessment. The Legislature further provided that \"the decision of a majority of said court shall be final and conclusive, and no motion for a new trial of said proceeding shall be allowed, and no appeal from the judgment given and made by said court shall be had.\" (Stats. 1919, ch. 520, § 8, p. 1094.)\n\nWhen property owners affected by one such assessment attempted to appeal a validation decision to this court, the drainage district moved to dismiss the appeal. This court denied the motion to dismiss, holding that the statute making the three-Judge ruling nonappealable was invalid as violating the \"right of appeal\" implicit in the constitutional grant of appellate jurisdiction over cases concerning the validity of assessments. This court declared that \"litigants have a constitutionally guaranteed right of appeal in all litigated matters within the express jurisdiction of appellate courts.\" (Sutter-Butte, supra, 190 Cal. 532, 536.) We further stated that \"if the proceeding before us is included in that class of cases . . . over which appellate jurisdiction has been given by the constitution the appellants have a constitutionally guaranteed right of appeal of which they cannot be deprived.\" (Id. at p. 537.)\n\nAs in the 1849 and 1878-1879 constitutional debates concerning the \"amount in controversy\" limitations, and as in People v. Jordan, supra, 65 Cal. 644 and People ex rel. Davidson v. Perry, supra, 79 Cal. 105, the issue before this court in Sutter-Butte, supra, 190 Cal. 532, was not whether the Legislature could specify a procedure other than direct appeal by which this court or the Courts of Appeal could exercise constitutionally conferred \"appellate jurisdiction,\" but whether the Legislature could eliminate all procedures for the exercise of that jurisdiction. We are persuaded that this court's use of the term \"right of appeal\" in that context carried the same meaning as in the 1849 and 1878-1879 constitutional debates and in this court's earlier decisions in People ex rel. Davidson v. Perry, supra, 79 Cal. 105, 107, and in Haight, supra, 8 Cal. 297, 300, -- that is, a right to some effective procedural vehicle by which to invoke the constitutionally conferred appellate jurisdiction. We do not conclude, as plaintiffs would have us do, that the term was intended to refer only to direct appeals.\n\n1928 AMENDMENT\n\nIn 1928, the \"appellate jurisdiction\" provisions of the 1879 Constitution were again amended. As amended, the Constitution gave the Courts of Appeal appellate jurisdiction \"on appeal from the superior courts (except in cases in which appellate jurisdiction is given to the supreme court) in all cases at law in which the superior courts are given original jurisdiction; also, in all cases of forcible or unlawful entry or detainer (except such as arise in municipal, or in Justices' or other inferior courts); in proceedings in insolvency; in actions to prevent or abate a nuisance; in proceedings of mandamus, certiorari, prohibition, usurpation of office, removal from office, contesting elections, eminent domain, and in such other special proceedings as may be provided by law; also, on questions of law alone, in all criminal cases prosecuted by indictment or information, except where judgment of death has been rendered.\" (Cal. Const. of 1879, art. VI, § 4b, as adopted Nov. 6, 1928.)\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nAny lingering uncertainty about whether the \"appellate jurisdiction\" provisions of the 1849 and 1879 Constitutions conferred on civil litigants a right to a direct appeal was dispelled by this court's opinion in Trede v. Superior Court (1943) 21 Cal. 2d 630, 134 P.2d 745. There, a building and loan association brought a superior court action for the return of association assets that the Building and Loan Commissioner had seized. After losing the case in superior court, the association appealed. While the appeal was pending, the commissioner applied to the superior court for authorization to liquidate the association's assets. One of the association's investors objected to the application, but the superior court overruled her objections. The investor, later joined by the association, then sought a writ of prohibition from this court, asserting that the association's appeal would be rendered meaningless if the commissioner liquidated the assets before the appeal was decided. They argued that the Building and Loan Association Act (Stats. 1931, ch. 269, pp. 483-554), to the extent it authorized asset liquidation pending appeal, was an \"unreasonable exercise of the police power.\" (Trede v. Superior Court, supra, 21 Cal. 2d 630, 632.)\n\nThis court rejected the argument and denied the writ. Although nothing in this court's opinion indicates that the association had relied on a constitutional right of appeal, this court nonetheless addressed that subject, with these words: \"There is no constitutional right to an appeal; the appellate procedure is entirely statutory and subject to complete legislative control.\" (Trede v. Superior Court, supra, 21 Cal. 2d 630, 634.) This court cited no authority for the stated propositions, nor did we mention the \"appellate jurisdiction\" provision of the state Constitution or any of the cases construing that provision. But the statement may not be dismissed as dictum. The petitioners had argued that once the commissioner had liquidated the association's assets, their appeal would be rendered meaningless. We did not dispute that liquidation would have this result, but concluded, in effect, that petitioner's right of appeal, because it was entirely statutory in origin, did not prevail over the commissioner's statutory authority to liquidate the assets. If the right of appeal derived from the constitution, this reasoning could not have sufficed.\n\nPlaintiff's position is further undermined by this court's decision in Modern Barber Col. v. Cal. Emp. Stab. Com. (1948) 31 Cal. 2d 720, 192 P.2d 916 (hereafter Modern Barber). The case arose under the Unemployment Insurance Act (Stats. 1935, ch. 352, p. 1226 et seq.), which required employers to contribute to an unemployment compensation fund according to the number of persons they employed. The California Employment Stabilization Commission (the agency charged with administering the act) had found that the students, proprietor, and bookkeeper of a barber college were all its employees. To challenge these findings, the college petitioned the superior court for a writ of mandate.\n\nThe question on appeal in this court was whether the barber college could maintain the mandate action without first paying the contributions. A provision of the act ( § 45.11, subd. (d)) made a suit for refund the exclusive means of challenging the commission's decision, but the college contended that the statute was unconstitutional, arguing that it both denied employers due process of law and interfered with the constitutional grant of original jurisdiction to superior courts in mandate actions. We rejected both grounds, concluding, as to the second, that the statute did not interfere with the constitutional grant of original jurisdiction because the Legislature had general authority to define rights such as the right to make a prepayment challenge of a tax, whether by mandate or otherwise. As this court put it, \"Except as the Constitution otherwise provides, the Legislature has complete power to determine the rights of individuals\" and also \"to regulate and circumscribe the methods and means of enjoying those rights, so long as there is no interference with constitutional guaranties.\" (Modern Barber, supra, 31 Cal. 2d 720, 726.)\n\nFurther developing this idea, we added:\n\n\"The fallacy of petitioner's position is again exposed when we consider the law governing appeals. The Constitution (art. VI, §§ 4, 4b) provides that the Supreme Court and the District Courts of Appeal 'shall have appellate jurisdiction on appeal from the Superior Court. . . .' In interpreting this provision, the courts have held that the Legislature has the power to declare by statute what orders are appealable, and, unless a statute does so declare, the order is not appealable. (Gale v. Tuolumne County Water Co., 169 Cal. 46 [145 P. 532]; see Trede v. Superior Court, 21 Cal. 2d 630, 634 [134 P.2d 745]; cf. Byers v. Smith, 4 Cal. 2d 209 [47 P.2d 705] [express constitutional right of appeal in cases involving removal from public office]; In re Sutter-Butte By-Pass Assessment, 190 Cal. 532 [213 P. 974] [express constitutional right of appeal in cases involving legality of tax assessments].)\" (Modern Barber, supra, 31 Cal. 2d 720, 728.)\n\nIn assessing the significance of this statement, it may be useful to examine the authorities this court cited. In Gale v. Tuolumne County Water Co., 169 Cal. 46, 145 P. 532, this court dismissed an appeal from a contempt judgment on the authority of Tyler v. Connolly (1884) 65 Cal. 28, 2 P. 414, in which this court had held that no appeal would lie from a contempt judgment because contempt proceedings were not among the categories of cases over which the 1879 Constitution had granted this court appellate jurisdiction (id. at p. 30). After \"conceding that the legislature may confer appellate jurisdiction on this court in cases not provided for in the Constitution,\" we concluded that the Legislature had not done so for contempt judgments, but on the contrary had provided, in Code of Civil Procedure section 1222, that judgments in contempt proceedings are \"final and conclusive.\" (Tyler v. Connolly, supra, at p. 30.) The cases of Trede v. Superior Court, supra, 21 Cal. 2d 630, and Sutter-Butte, supra, 190 Cal. 532, we have already discussed. Byers v. Smith (1935) 4 Cal. 2d 209, 47 P.2d 705 (hereafter Byers), was a mandate proceeding by an elected city attorney to ensure continued payment of his salary, and to prevent election or appointment of a replacement, pending the outcome of his appeal from a superior court judgment removing him from office on grounds of misconduct. This court granted the requested relief, noting that the 1928 constitutional amendment had conferred appellate jurisdiction on the Courts of Appeal \"'in proceedings of . . . removal from office'\" and that some means of staying the judgment was necessary to ensure that the appeal would provide the officeholder an effective remedy. (Id. at p. 212.) After noting that under Political Code section 996 an office became vacant upon the holder's removal, this court observed, with a citation to Sutter-Butte, supra, that \"the legislature has not the power, either through direct enactment or indirect device, to destroy or abridge the right of an appeal constitutionally granted.\" (Byers, supra, at p. 214.)\n\nBecause Modern Barber's entire Discussion of the \"right of appeal\" was dictum, intended only to illustrate the general principle that the Legislature has authority \"to regulate and circumscribe the methods and means of enjoying . . . rights, so long as there is no interference with constitutional guaranties\" (Modern Barber, supra, 31 Cal. 2d 720, 726), it is not authority on the issue we face here; therefore, extensive analysis is not warranted. For present purposes, it is sufficient to note that in Modern Barber, this court, although not purporting to overrule our earlier decisions in Byers, supra, 4 Cal. 2d 209, and Sutter-Butte, supra, 190 Cal. 532, did appear to suggest that the \"constitutional right of appeal\" mentioned in those cases extended only to proceedings specifically mentioned in the constitutional grant of appellate jurisdiction, and not to proceedings encompassed by jurisdictional grants phrased in more general terms.\n\nIn addition to Trede, supra, 21 Cal. 2d 630, a number of cases decided before the November 1966 general election declared that there was no constitutional right of appeal or (what amounts to the same thing) that the right of appeal is wholly statutory. (See, e.g., Lund v. Superior Court (1964) 61 Cal. 2d 698, 709, 39 Cal. Rptr. 891, 394 P.2d 707 [stating that \"no order or judgment in a civil action is appealable unless it is embraced within the list of appealable orders provided by statute\"]; In re Conley (1966) 244 Cal. App. 2d 810, 815 [stating that \"there is no constitutional right to an appeal\"]; City of Los Angeles v. Schweitzer (1962) 200 Cal. App. 2d 448, 452, 19 Cal. Rptr. 429 [same]; Efron v. Kalmanovitz (1960) 185 Cal. App. 2d 149, 157, 8 Cal. Rptr. 107 [same]; Kadota Fig Assn. v. Case-Swayne Co. (1946) 73 Cal. App. 2d 815, 823, 167 P.2d 523 [stating that \"the right of appeal is statutory\"]; Jackson v. Jackson (1945) 71 Cal. App. 2d 837, 839, 163 P.2d 780 [stating that \"the right of appeal is purely statutory\"]; Leftridge v. City of Sacramento (1943) 59 Cal. App. 2d 516, 526, 139 P.2d 112 [stating that \"the right of appeal is statutory\"]; Strauch v. Bieloh (1936) 16 Cal. App. 2d 278, 280, 60 P.2d 582 [stating that \"the right of appeal is entirely statutory\"].)\n\nReflecting this widespread understanding, a respected guide to California civil procedure in use at the time of the November 1966 general election, expressed a similar view, in these words: \"There is no constitutional right to an appeal or other review of a judicial decision, and the Legislature therefore has power to change the procedure, limit the right, or even abolish the right altogether.\" (3 Witkin, California Procedure (1954) Appeal, § 1, p. 2141, original italics.) The same work also noted, however, that \"if appellate jurisdiction is conferred by the California Constitution, it cannot be destroyed or abridged by legislative action or inaction . . . .\" (Ibid.)\n\nHaving traced the constitutional antecedents of the current \"appellate jurisdiction\" provision, we return to the question whether, at the time of the November 1966 general election, there was an \"authoritative judicial construction\" (see Sarracino v. Superior Court, supra, 13 Cal. 3d 1, 8) of the term \"appellate jurisdiction\" as conferring on litigants a right of direct appeal. As we have seen, there are no cases directly in point. Before the 1966 general election, neither this court nor the Courts of Appeal were ever called upon to determine the constitutional validity of a legislative scheme making review by extraordinary writ the exclusive mode of appellate review of a superior court proceeding within the appellate jurisdiction of this court or the Courts of Appeal. Because the positive authority of an appellate opinion is coextensive only with the facts presented by the case (Brown v. Kelly Broadcasting Co. (1989) 48 Cal. 3d 711, 734-735, 257 Cal. Rptr. 708, 771 P.2d 406), the absence of any case presenting these facts necessarily means that there was no \"binding judicial construction\" of the \"appellate jurisdiction\" language as it applies to this issue.\n\nFurthermore, although some early cases referred to a constitutional \"right of appeal,\" they appear to have used that term to encompass a right to appellate review generally, and later cases either implied that the constitutional right of appeal was limited to superior court proceedings expressly mentioned in the \"appellate jurisdiction\" provision or denied the existence of any constitutional right of appeal. Given this uncertainty and conflict in the case law, we conclude that in 1966 plaintiffs' proposed construction of the \"appellate jurisdiction\" language -- that is, that it confers on civil litigants a right of direct appeal -- did not have the sanction of an authoritative judicial construction. For this reason, we reject plaintiffs' proposed construction.\n\nThis Conclusion is reinforced by consideration of cases decided after 1966. In those cases, we find no decisions affirming the existence of a \"right of appeal\" under the state Constitution, nor do we find references to the \"appellate jurisdiction\" provision as limiting the Legislature's authority to determine which superior court judgments and orders are reviewable by direct appeal and which by extraordinary writ or other mode of review. We do find many pronouncements by California courts, including this one, that there is no constitutional right of appeal and that the right of appeal is wholly statutory in origin. (See, e.g., Agricultural Labor Relations Bd. v. Tex-Cal Land Management, Inc. (1987) 43 Cal. 3d 696, 705, 238 Cal. Rptr. 780, 739 P.2d 140; People v. Chi Ko Wong (1976) 18 Cal. 3d 698, 709, 135 Cal. Rptr. 392, 557 P.2d 976; In re Marriage of Griffin (1993) 15 Cal. App. 4th 685, 687; Steen v. Fremont Cemetery Corp. (1992) 9 Cal. App. 4th 1221, 1226; In re Taya C. (1991) 2 Cal. App. 4th 1, 6; Rao v. Campo (1991) 233 Cal. App. 3d 1557, 1564, 285 Cal. Rptr. 691; County of Monterey v. Mahabir (1991) 231 Cal. App. 3d 1650, 1653, 282 Cal. Rptr. 924; In re Eli F. (1989) 212 Cal. App. 3d 228, 232, 260 Cal. Rptr. 453; State Farm Fire \u0026 Casualty v. Hardin (1989) 211 Cal. App. 3d 501, 505, 259 Cal. Rptr. 433; Uptain v. Duarte (1988) 206 Cal. App. 3d 1258, 1261, 254 Cal. Rptr. 150; In re T. M. (1988) 206 Cal. App. 3d 314, 316; Reisman v. Shahverdian (1984) 153 Cal. App. 3d 1074, 1088, 201 Cal. Rptr. 194; Redevelopment Agency v. Goodman (1975) 53 Cal. App. 3d 424, 432, 125 Cal. Rptr. 818; Draus v. Alfred M. Lewis, Inc. (1968) 261 Cal. App. 2d 485, 489, 68 Cal. Rptr. 154; Woodman v. Ackerman (1967) 249 Cal. App. 2d 644, 649, 57 Cal. Rptr. 687.)\n\nAlthough we recognize that none of these cases is directly on point, they nonetheless represent a significant consensus of judicial thinking on this topic over the past 30 years. We find nothing in any of these decisions to support plaintiffs' contention. We also note that courts in other states with constitutions containing \"appellate jurisdiction\" provisions similar to article VI, section 11 of our state Constitution, have rejected the contention that this language confers on litigants a right of direct appeal. (See, e.g., Appeal of O'Rourke (1974) 300 Minn. 158 [220 N.W.2d 811].)\n\nThis does not mean, however, that the \"appellate jurisdiction\" provision imposes no restrictions on the Legislature's authority to allocate appellate review as between direct appeals and extraordinary writ petitions. As we have seen, the plain language of the provision reveals that it is a grant of judicial authority and this form of grant has been interpreted to mean that, although the Legislature may regulate the mode of appellate review, it may do so only to the extent that it does not thereby \"substantially impair the constitutional powers of the courts, or practically defeat their exercise.'\" (In re Jessup, supra, 81 Cal. 408, 470, italics omitted; see also, Haight, supra, 8 Cal. 297, 300.) If it could be demonstrated in a given case, or class of cases, that, for whatever reason, the Courts of Appeal or this court could not effectively exercise the constitutionally granted power of appellate review by an extraordinary writ proceeding, then such a proceeding could not constitutionally be made the exclusive mode of appellate review.\n\nNo such claim is made here, however, and we see no reason to conclude that extraordinary writ review is not a sufficient or effective appellate remedy in this or other PRA cases. Indeed, an examination of the history of § 6259(c), making petition for extraordinary writ the only mode of appellate review in PRA cases, shows that it was intended not to impair judicial power but to make the appellate remedy more effective for litigants seeking disclosure of public records.\n\nOur opinion in Times-Mirror Co. v. Superior Court (1991) 53 Cal. 3d 1325, 283 Cal. Rptr. 893, 813 P.2d 240 (hereafter Times-Mirror), explains the origin, evolution, and purpose of this provision:\n\n\"Prior to 1984, review of a trial court order either directing disclosure of a public record or refusing disclosure was by appeal. In 1984, however, the Legislature substituted a writ procedure for the appellate process by amending section 6259 to provide as follows: 'In an action filed on or after January 1, 1985, an order of the court, either directing disclosure by a public official or supporting the decision of the public official refusing disclosure, is not a final judgment or order within the meaning of Section 904.1 of the Code of Civil Procedure from which an appeal may be taken, but shall be immediately reviewable by petition to the appellate court for the issuance of the extraordinary writ of review as defined in Section 1067 of the Code of Civil Procedure.' ( § 6259, subd. (c); Stats. 1984, ch. 802, § 1, pp. 2804-2805.) . . . .\n\n\". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n\n\"The legislative history of the 1984 amendment to section 6259, subdivision (c) reveals that the exclusive purpose of the amendment was to speed appellate review, not to limit its scope. The bill which contained the amendment, Senate Bill No. 2222, 1983-1984 Regular Session, was sponsored by a news organization, the California Newspaper Publishers' Association. It was inspired by a case in which a newspaper had successfully sued in the superior court to obtain government records, but was forced to wait several years while the case was on appeal, by which time the story was no longer newsworthy.\n\n\"The perceived evil at which the bill was aimed, according to a Senate Judiciary Committee analysis, was 'delays of the appeal process, [by means of which] public officials are frustrating the intent of the laws for disclosure . . . .' 'The sponsors of this bill,' the analysis continued, 'seek to correct an inJustice they perceive due to . . . the potential for . . . public agencies to delay the disclosure of public documents.' Accordingly, the amendment's goal was 'to prohibit public agencies from delaying the disclosure of public records by appealing a trial court decision and using continuances in order to frustrate the intent of the Public Records Act.' (Sen. Com. on Judiciary, Analysis of Sen. Bill No. 2222 (1983-1984 Reg. Sess.).)\" (Times-Mirror, supra, 53 Cal. 3d 1325, 1332-1335, original italics, fns. omitted.)\n\nAfter the 1984 amendment, a Court of Appeal held that the scope of review in PRA actions under the writ of review was confined to jurisdictional issues, and thus was much narrower than the scope of review on direct appeal. (Freedom Newspapers, Inc. v. Superior Court (1986) 186 Cal. App. 3d 1102, 1109, 231 Cal. Rptr. 189.) Following this decision, the Legislature amended section 6259(c) to eliminate the reference to the \"writ of review,\" and to provide instead that superior court orders under the PRA \"shall be immediately reviewable by petition to the appellate court for issuance of an extraordinary writ.\" (Stats. 1990, ch. 908, § 2.) As we noted in Times-Mirror, supra, 53 Cal. 3d 1325, 1335-1336, \"the amendment also added two new provisions: (1) the petition for extraordinary writ must be filed within ten days[\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e] after receipt of notice of the trial court order, and (2) no stay of the trial court order shall be permitted 'unless the petitioning party demonstrates it will otherwise sustain irreparable damage and probable success on the merits.'\"\n\nAs we explained in Times-Mirror, supra, the 1990 amendment reinforces our Conclusions about the legislative purpose underlying section 6259(c): \"The effect of the 1990 amendment providing for review by 'extraordinary writ,' including presumably writ of mandate, is, of course, to make it plain that review of orders subject to the amendment is not confined to acts in excess of jurisdiction. The analysis of the bill prepared for the Assembly Committee on the Judiciary indicates that the recent amendment was a response to Freedom Newspaper, Inc. v. Superior Court, supra, 186 Cal. App. 3d 1102, and was intended to overrule that decision by 'clarifying' that the purpose of writ review is to speed appellate review, not to preclude review on the merits. As the analysis explains, 'The courts [(an apparent reference to Freedom Newspapers)] . . . have narrowly interpreted [the 1984 amendment] to review questions of jurisdiction and not broader as intended by the original statute. The bill expands the extraordinary writ by clarifying that courts can rule quickly on substantive issues.' (Assem. Com. on Judiciary, Analysis of Sen. Bill No. 2272 (1989-1990 Reg. Sess.), italics added.)\" (Times-Mirror, supra, 53 Cal. 3d 1325, 1336.)\n\nThus, the history of section 6259(c) reveals that the Legislature's purpose in replacing review by direct appeal with review by extraordinary writ was in no sense to disadvantage litigants seeking review of PRA decisions or to constrict the power of the Courts of Appeal to correct errors in those decisions. Rather, the legislative objective was to expedite the process and thereby to make the appellate remedy more effective.\n\nTo achieve this objective, the Legislature eliminated direct appeals in PRA cases. Its reason for doing so becomes apparent when we examine certain rules governing extraordinary writs.\n\nGenerally, a judgment that is immediately appealable is not subject to review by mandate or other extraordinary writ. (In re Marriage of Skelley (1976) 18 Cal. 3d 365, 369, 134 Cal. Rptr. 197, 556 P.2d 297; Neal v. State of California (1960) 55 Cal. 2d 11, 15, 9 Cal. Rptr. 607, 357 P.2d 839.) Mandate is available to review an appealable judgment only when the remedy by appeal would be inadequate or the issues presented are of great public importance and must be resolved promptly. (Clean Air Constituency v. California State Air Resources Bd. (1974) 11 Cal. 3d 801, 808, 114 Cal. Rptr. 577, 523 P.2d 617; California Trial Lawyers Assn. v. Superior Court (1986) 187 Cal. App. 3d 575, 578-579, 231 Cal. Rptr. 725; see also, Code Civ. Proc., § 1086.) A remedy by immediate direct appeal is presumed to be adequate, and a party seeking review by extraordinary writ bears the burden of demonstrating that appeal would not be an adequate remedy under the particular circumstances of that case. (Phelan v. Superior Court (1950) 35 Cal. 2d 363, 370, 217 P.2d 951.)\n\nIn light of these rules, the Legislature's reason for eliminating direct appeals is readily apparent. Had the Legislature not abolished direct appeals in PRA cases, parties seeking review by extraordinary writ would have been required in each case to demonstrate the inadequacy of appeal. Litigation of this issue would have complicated the proceeding and introduced a risk that a Court of Appeal, not fully realizing the importance of speedy relief in many PRA cases, would erroneously deny an extraordinary writ petition on the ground that an adequate remedy existed by appeal. To keep the process simple and streamlined, and to remove a procedural barrier to review on the merits, the Legislature barred direct appeal of PRA decisions.\n\nPlaintiffs may be understood to argue that appellate review by extraordinary writ petition is inherently less effective than a remedy by direct appeal because issuance of the extraordinary writs is discretionary whereas direct appeal guarantees a decision on the merits. The argument betrays a serious misunderstanding of the discretionary character of extraordinary writs.\n\nAlthough appellate review by extraordinary writ petition is said to be discretionary, a court must exercise its discretion \"within reasonable bounds and for a proper reason.\" (Scott v. Municipal Court (1974) 40 Cal. App. 3d 995, 997, 115 Cal. Rptr. 620.) The discretionary aspect of writ review comes into play primarily when the petitioner has another remedy by appeal and the issue is whether the alternative remedy is adequate. (See, e.g., Consumers Lobby Against Monopolies v. Public Utilities Com. (1979) 25 Cal. 3d 891, 901, fn. 3, 160 Cal. Rptr. 124, 603 P.2d 41 [stating that courts have discretion to deny extraordinary writ petitions \"because the law does provide other means of judicial review in such cases\"].)\n\nWhen an extraordinary writ proceeding is the only avenue of appellate review, a reviewing court's discretion is quite restricted. Referring to the writ of mandate, this court has said: \"'Its issuance is not necessarily a matter of right, but lies rather in the discretion of the court, but where one has a substantial right to protect or enforce, and this may be accomplished by such a writ, and there is no other plain, speedy and adequate remedy in the ordinary course of law, he [or she] is entitled as a matter of right to the writ, or perhaps more correctly, in other words, it would be an abuse of discretion to refuse it.'\" (Dowell v. Superior Court (1956) 47 Cal. 2d 483, 486-487, 304 P.2d 1009, quoting Potomac Oil Co. v. Dye (1909) 10 Cal. App. 534, 537, 102 P. 677; accord, May v. Board of Directors (1949) 34 Cal. 2d 125, 133-134, 208 P.2d 661.) Accordingly, when writ review is the exclusive means of appellate review of a final order or judgment, an appellate court may not deny an apparently meritorious writ petition, timely presented in a formally and procedurally sufficient manner, merely because, for example, the petition presents no important issue of law or because the court considers the case less worthy of its attention than other matters.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nTHE CONCURRING OPINION\n\nInvoking the principle of judicial self-restraint, Justices George and Arabian would decide only that section 6259(c) does not violate the \"appellate jurisdiction\" provision of the state Constitution, without undertaking to construe that provision in any meaningful way. They decline to decide not only whether the provision gives litigants a constitutional right of appeal in other superior court proceedings, but also whether it would permit the Legislature to abrogate all forms of appellate review of superior court decisions in PRA actions.\n\nAlthough courts should not fashion unnecessarily broad constitutional rules, courts must construe constitutional provisions when necessary to resolve issues properly presented. Recognizing that this court's role in the judicial system is to settle \"important questions of law\" (Cal. Rules of Court, rule 29(a)), and that, in the words of Chief Justice Marshall, it is \"emphatically the province and duty of the judicial department to say what the law is\" (Marbury v. Madison, supra, 5 U.S. (1 Cranch) 137, 177), we have used established methods of constitutional interpretation to determine whether, as plaintiffs contend, the \"appellate jurisdiction\" provision of our state Constitution confers on litigants a right of direct appeal from final judgments and orders in superior court actions, and we have concluded that it does not. As we have seen, this court has not hesitated in the past to affirm or deny the existence of a constitutional \"right of appeal.\" Indeed, we have spoken to this issue so many times, making so many apparently conflicting statements without careful analysis, that the time for a definitive construction should no longer be postponed. To suddenly turn coy on this issue, after decades of careless loquacity, is to shirk our constitutional obligation, to create or at least perpetuate uncertainty, and to invite needless litigation.\n\nIII\n\nThe Legislature, in section 6259(c), has provided that the mode of appellate review for superior court decisions in PRA cases shall be an extraordinary writ proceeding rather than direct appeal. To determine whether, as plaintiffs contend, the \"appellate jurisdiction\" provision of the state Constitution forbids this legislative choice, we have examined the text and history of this constitutional provision, including judicial decisions construing and applying its constitutional predecessors. We conclude that the \"appellate jurisdiction\" provision does not require the Legislature to provide for direct appeals in all cases within the original jurisdiction of the superior courts; that it permits some variation in and experimentation with the traditional procedures for appellate review of civil actions brought in the superior courts, provided always that the constitutional powers of the courts are not thereby impaired; and that in particular it does not afford litigants in PRA cases a constitutionally guaranteed right to a direct appeal.\n\nThe judgment of the Court of Appeal is affirmed.\n\nBAXTER, J. and WERDEGAR, J., Concurring.\n\nARABIAN, J., Concurring.\n\nMOSK, J., Concurring.\n\nGEORGE, J., Concurring:\n\nI agree with the lead opinion's Conclusion that the Legislature did not violate the \"appellate jurisdiction\" provision of the California Constitution (Cal. Const., art. VI, § 11) by providing in Government Code section 6259, subdivision (c), that trial court rulings on claims brought under the California Public Records Act are subject to review in the Court of Appeal only by petition for extraordinary writ, and not by \"direct appeal.\"\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e In my view, however, it is neither necessary nor appropriate to go beyond the Public Records Act provision here at issue to announce a broad constitutional rule that may be understood to validate virtually all, or at least most, legislative measures that in the future might substitute writ review for direct appeal in contexts not presented by the case now before us. Accordingly, I would limit the holding in this case to the specific Public Records Act provision before the court.\n\nI\n\nWell-settled principles of judicial restraint establish that when a case must be decided upon constitutional grounds, a court should strive to resolve the matter as narrowly as possible, and should avoid expansive constitutional pronouncements that inevitably preJudge future controversies and may have unforeseen and questionable consequences in other contexts. (See generally Steamship Co. v. Emigration Commissioners (1885) 113 U.S. 33, 39, 28 L. Ed. 899, 5 S. Ct. 352 [the high court \"has rigidly adhered\" to the rule that it is \"never to formulate a rule of constitutional law broader than is required by the precise facts to which it is . . . applied\"]; Ashwander v. Valley Authority (1936) 297 U.S. 288, 347, 80 L. Ed. 688, 56 S. Ct. 466 (conc. opn. of Brandeis, J.) [listing this rule as one of the cardinal principles of judicial restraint].)\n\nIn my view, this familiar precept of judicial restraint has particular force in the present case, because the potential ramifications of a broad constitutional holding are so far reaching. Taken to its logical Conclusion, the lead opinion's reasoning very well could be understood to permit the Legislature totally to transform the California Court of Appeal from an appellate tribunal whose duties generally involve the resolution of cases in which litigants have a direct appeal \"as a matter of right\" -- and in which most decisions must be rendered \"in writing with reasons stated\" (Cal. Const., art. VI, § 14) -- into an appellate court whose jurisdiction consists entirely of writ review and as to which the court has no obligation to resolve any of the cases before it by a written decision setting forth the reasons for its ruling. Such a general transformation of the Court of Appeal into an appellate court of purely writ review clearly would work a very substantial change in the nature of the appellate process that has existed in California from the inception of its statehood. I believe there is ample reason for this court to be extremely cautious before embracing an interpretation of the pertinent state constitutional provision that would permit such a major revision of the state's appellate process to be made by the Legislature acting alone, rather than through the procedure prescribed for amending the state Constitution.\n\nIn this case, of course, we are not faced with the broad question whether the Legislature has the constitutional authority to substitute review by extraordinary writ for direct appeal in all cases. The Legislature has not purported to enact a wide-ranging legislative measure that would restructure, in a fundamental manner, the operation of the state's appellate process. Indeed, the Legislature has shown no interest in substituting writ review for direct appeal with regard to a majority, or even a significant proportion, of the caseload of the Courts of Appeal. Instead, in enacting the statutory provision here at issue, the Legislature simply has concluded that, because of the special importance of obtaining a very prompt appellate resolution in the relatively small and discrete class of cases brought under the Public Records Act, appellate review of a superior court ruling in such cases should proceed by extraordinary writ rather than by direct appeal. I believe we can, and should, determine the constitutionality of only this limited statutory provision, and explicitly should reserve judgment as to whether a similar legislative substitution of review by extraordinary writ for review by direct appeal would be permissible if enacted either \"across the board\" or in other contexts. Thus, unlike the lead opinion, which approaches the case by first setting forth a broad constitutional rule and then indicating that -- although there possibly may be some exceptions to the rule -- the Public Records Act provision is not such an exception (see, ante, p. ___ [typed lead opn., pp. 30-31]), I believe we should approach the matter from a more cautious perspective and explicitly limit our holding in this case to a narrow determination that the statute before us is constitutional.\n\nII\n\nAs we explained in Times-Mirror Co. v. Superior Court (1991) 53 Cal. 3d 1325, 1332-1335, 283 Cal. Rptr. 893, 813 P.2d 240, the statutory provision at issue in the present case -- Government Code section 6259, subdivision (c) (hereafter section 6259(c)) -- was enacted in 1984 in response to problems encountered in direct appeals in cases arising under the Public Records Act. The principal proponent of the legislation, the California Newspaper Publishers' Association -- which represented numerous news organizations that frequently relied upon the Public Records Act to obtain information concerning the actions of governmental entities and public officials -- maintained that, in practice, the ordinary process of direct appeal was operating in cases under the Public Records Act to frustrate the significant public purposes underlying the act. In this regard, the association pointed out that, even when a newspaper or other plaintiff who had brought an action under the Public Records Act prevailed at the trial court level and obtained a judgment compelling disclosure of particular records, a defendant public agency or public official routinely could delay disclosure of the records in question for a considerable period of time (often years) simply by filing an appeal of the adverse judgment, thereby preventing disclosure of public information at a time when the material still was newsworthy or of particular importance to the plaintiff.\n\nPersuaded that the timeliness of disclosure often is of crucial importance in actions brought under the Public Records Act, the Legislature responded by enacting section 6259(c). As amended in 1990, that statute provides that a trial court order made under the Public Records Act -- either directing disclosure of a public record or supporting the decision of a public official refusing disclosure -- is not subject to ordinary direct appeal but instead is \"immediately reviewable\" by petition for an extraordinary writ to the Court of Appeal.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nAs this legislative background demonstrates, it is clear that section 6259(c) was enacted not to diminish the rights of individuals, such as plaintiffs in this case, who seek disclosure of governmental information under the Public Records Act, but, on the contrary, for the general purpose of enhancing such persons' rights by ensuring that appellate review of trial court decisions under the act is conducted in a manner that promotes, rather than frustrates, the purpose of the act.\n\nIII\n\nAt this juncture, plaintiffs in the case at bar are challenging the validity of section 6259(c). Nonetheless, because -- as we just have seen -- the challenged statute was enacted primarily to protect the interests of litigants, like plaintiffs, who seek disclosure of governmental information under the Public Records Act, it may be instructive to review briefly the facts of this case in order to accord proper consideration to the potential benefits that section 6259(c) afforded these plaintiffs at earlier stages of this proceeding.\n\nThe request for disclosure of public information that gave rise to the underlying litigation in the present case was made in the midst of an election campaign for a seat on the Richmond City Council. Less than two months before the election, plaintiffs -- a candidate running for the city council, and her supporters -- filed this action under the Public Records Act, seeking to obtain from city officials information concerning expenditures of public funds that had been made by the city in the previous fiscal year. Had plaintiffs prevailed in the trial court in their Public Records Act action, section 6259(c) would have prevented defendant city and its officials from delaying disclosure of the records sought by plaintiffs beyond the date of the election by simply filing an appeal from the trial court's ruling, and would have permitted defendant to obtain a stay of the trial court order by filing a petition for an extraordinary writ only if defendants were able to make the substantial showing required by the statute. (See, ante, fn. 2.) Thus, had plaintiffs prevailed in their Public Records Act action in the trial court, section 6259(c) would have been of considerable assistance in helping to ensure that plaintiffs' victory was not illusory.\n\nOf course, as things turned out, plaintiffs did not prevail in the trial court. Nevertheless, by virtue of the provisions of section 6259(c), the adverse trial court ruling was \"immediately reviewable\" in the Court of Appeal by petition for extraordinary writ. Acting pursuant to this provision, plaintiffs timely sought review of the trial court order by extraordinary writ. The Court of Appeal, after requesting briefing of the Public Records Act issue by defendant, rendered its decision on the writ petition just a few weeks later, summarily denying the requested writ. Had plaintiffs been able to persuade the Court of Appeal of the merit of their Public Records Act claim, however, the extraordinary writ remedy provided by section 6259(c) very likely would have permitted plaintiffs to obtain the records they sought much more quickly than would have been possible had plaintiffs been relegated to an ordinary direct appeal.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nWhile their petition for extraordinary writ was pending in the Court of Appeal, plaintiffs filed the present appeal, raising and briefing precisely the same legal issue under the Public Records Act that they had raised and fully briefed in their writ petition. Relying upon section 6259(c), and rejecting plaintiffs' constitutional challenge to the provision, the Court of Appeal ultimately dismissed the appeal. We granted review.\n\nIV\n\nPlaintiffs acknowledge that the Legislature, in enacting section 6259(c), intended that a trial court decision under the Public Records Act would be subject to review in the Court of Appeal only by extraordinary writ (which they already have pursued, albeit unsuccessfully) and not by direct appeal. Plaintiffs maintain, however, that the Legislature lacked the constitutional authority to prescribe this form of appellate review of a superior court ruling under the Public Records Act. Plaintiffs assert that the California Constitution grants them the right to have the Court of Appeal review a superior court decision under the Public Records Act by direct appeal, and that affording them appellate review of such a decision only by extraordinary writ is constitutionally impermissible.\n\nPlaintiffs rest their constitutional argument upon article VI, section 11, of the California Constitution, which provides that, with the exception of cases in which a judgment of death has been imposed, \"courts of appeal have appellate jurisdiction when superior courts have original jurisdiction . . . .\"\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Plaintiffs contend that this constitutional provision mandates that whenever a superior court has original jurisdiction in a cause, the parties have a constitutional right to a direct appeal in the Court of Appeal. Because the Legislature has provided that the superior court has original jurisdiction in an action under the Public Records Act (Gov. Code, §§ 6258, 6259, subd. (a)), plaintiffs maintain that, under article VI, section 11, they have a constitutionally based right to file and pursue a direct appeal in the Court of Appeal in any such action, and that the Legislature lacks the authority to substitute review by extraordinary writ for direct appeal in such an action.\n\nI disagree with plaintiffs' position. Assuming, without deciding, that the current \"appellate jurisdiction\" provision of article VI, section 11, properly should be interpreted to preclude the Legislature from abrogating any and all appellate review of a superior court decision in an action under the Public Records Act (cf. In re Sutter-Butte By-Pass Assessment (1923) 190 Cal. 532, 537, 213 P. 974), in my view plaintiffs have failed to demonstrate that article VI, section 11, should be interpreted to bar the Legislature from adopting the much more modest provision of the Public Records Act here at issue, which does not bar all appellate review of a trial court ruling under the act but provides for review of such decisions in the Courts of Appeal by extraordinary writ rather than by direct appeal.\n\nIn analyzing plaintiffs' constitutional claim, it is important to recognize that the constitutional challenge that plaintiffs have mounted in this case necessarily rests upon the very broad proposition that the \"appellate jurisdiction\" provision of article VI, section 11, requires that all cases falling within the constitutionally established appellate jurisdiction of the Courts of Appeal be subject to review by direct appeal, and does not permit the Legislature to provide for exclusive review by extraordinary writ in any case falling within such appellate jurisdiction. In pressing their claim, plaintiffs have not suggested that there is anything in the nature or subject matter of an action under the Public Records Act that renders a trial court ruling under that act susceptible to adequate appellate review only by direct appeal, and not by extraordinary writ. (Cf. In re Shafter-Wasco Irr. Dist. (1942) 55 Cal. App. 2d 484, 487-488, 130 P.2d 755 [noting the constitutional question that would be raised by a statutory provision imposing an unreasonably short time limit for the determination of an appeal].) Thus, for example, plaintiffs do not contend that superior court actions under the Public Records Act generally are so protracted, or so factually or legally complex, that the Legislature could not reasonably have concluded that the Courts of Appeal properly could review trial court orders in such cases through the traditional extraordinary writ procedure, rather than the more elaborate and time-consuming process of a direct appeal.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Nor do plaintiffs contend there is anything in the nature of the particular rights or interests at stake in a Public Records Act proceeding that suggests that limiting appellate review of a trial court ruling in such a case to review by extraordinary writ, rather than direct appeal, inadequately would protect the interests at issue. (Indeed, as we have seen, the Legislature enacted section 6259(c) precisely because it concluded that the substitution of writ review in place of direct appeal would, in practice, better protect the interests and objectives underlying the Public Records Act.) Instead, plaintiffs simply assert that whenever a cause of action falls within the original jurisdiction of the superior court, the \"appellate jurisdiction\" provision of article VI, section 11, compels the Court of Appeal to review the final determination of that cause by direct appeal, even when the Legislature has concluded that the rights sought to be protected by the superior court action would be better preserved by providing for exclusive review by extraordinary writ in the Court of Appeal.\n\nIn my view, neither the language or history of article VI, section 11, nor the past decisions interpreting and applying this provision or its constitutional predecessors, support plaintiffs' broad constitutional argument. As the lead opinion thoroughly and persuasively explains, the term \"appellate jurisdiction\" that appears in article VI, section 11, long has been understood to encompass an appellate court's review of a lower court decision either by direct appeal or by extraordinary writ. (See, e.g., People ex rel. Mulford v. Turner (1850) 1 Cal. 143, 145-149; see generally 2 Witkin, Cal. Procedure (3d ed. 1985) Courts, § 254, pp. 277-278.) Furthermore, the lead opinion also demonstrates that the debates at the Constitutional Conventions of 1849 and 1879 -- though they include numerous references to a general \"right of appeal\" -- contain no suggestion that the convention delegates ever considered the relatively esoteric point presented by the case now before us, namely whether, and under what circumstances, appellate review of a lower court ruling may or may not be conducted by extraordinary writ, as contrasted with direct appeal. Finally, plaintiffs have not identified any previous decision that, in applying either article VI, section 11, or its constitutional predecessors, purports to hold (or even to intimate) that in all cases falling within the appellate jurisdiction of an appellate court, appellate review invariably must be by way of direct appeal rather than extraordinary writ.\n\nAs an historical matter, there always have existed categories of cases in which the final decision of a superior court has been subject to review not by direct appeal, but only by means of some form of extraordinary writ issuable by a higher court. (See, e.g., Tyler v. Connolly (1884) 65 Cal. 28, 32-33, 2 P. 414 (conc. opn. of Morrison, C.J.) [contempt order is not subject to review by appeal, but may be reviewed by petition for writ of certiorari or habeas corpus in a higher court]; In re Crow (1971) 4 Cal. 3d 613, 621, fn. 8, 94 Cal. Rptr. 254, 483 P.2d 1206 [lower court order denying habeas corpus relief is not subject to appeal, but may be reviewed by a new petition for habeas corpus filed in a higher court].) Moreover, throughout the years, the Legislature has found, in a variety of settings, that the need for a speedy, final determination of certain discrete issues arising in the course of trial litigation justifies the adoption of statutory provisions permitting a trial court's resolution of such issues to be challenged in an appellate court only through the prompt filing of a petition for extraordinary writ (and not in a subsequent direct appeal of the final judgment rendered in the case). The decisions of the California courts regularly have upheld and applied such legislative measures. (See, e.g., McCorkle v. City of Los Angeles (1969) 70 Cal. 2d 252, 257, 74 Cal. Rptr. 389, 449 P.2d 453 [under former Code Civ. Proc. § 416.3 (now Code Civ. Proc. § 418.10, subd. (c)), a defendant in a civil case may challenge only by extraordinary writ a trial court order refusing to quash service, and may not raise the issue on direct appeal from a judgment entered after trial on the merits]; People v. Brown (1993) 6 Cal. 4th 322, 334-335, 862 P.2d 710 [under Code Civ. Proc. § 170.3, a superior court order denying a statutory peremptory challenge to a trial Judge is subject to review only by extraordinary writ and may not be reviewed on direct appeal of the final judgment]; see also People v. Chi Ko Wong (1976) 18 Cal. 3d 698, 709-714, 135 Cal. Rptr. 392, 557 P.2d 976 [juvenile court order, finding defendant fit to be tried as an adult in superior court, is subject to challenge only by peremptory writ and may not be reviewed on direct appeal of the final superior court judgment].)\n\nIn my view, these diverse authorities demonstrate that the state Constitution generally has not been interpreted to require that appellate review of a superior court decision invariably proceed by direct appeal, but instead has been viewed as permitting a considerable degree of legislative innovation in devising appellate procedures that are compatible with the particular issue or ruling subject to review and that, at the same time, serve to promote a fair and efficient judicial system. (See generally Haight v. Gay (1857) 8 Cal. 297, 300 [\"The Legislature . . . can pass no act impairing the exercise of [a court's constitutionally conferred] appellate power. [P] But while the Legislature cannot substantially impair the right of appeal, it is certainly competent to regulate the mere mode in which this right must be asserted.\"].) Under the interpretation urged by plaintiffs, and apparently embraced by the Dissenting opinion, however, the Legislature seemingly would lack the authority to substitute writ review for direct appeal in any case falling within the historically established \"appellate jurisdiction\" of the Court of Appeal. Thus, for example, if the Legislature were to find in the future that the appellate process was becoming unduly burdened by direct criminal appeals in which the only issue raised (and thus the issue determinative of the cause) concerned a minor discrepancy (of a few days or less) as to the credit to which the defendant was entitled in the computation of his or her sentence, the Legislature apparently would be foreclosed from providing for appellate review in such cases by extraordinary writ, rather than by direct appeal.\n\nTaking into consideration the language and history of article VI, section 11, and the relevant judicial authorities noted above, I conclude that the Legislature -- having determined that appellate review by extraordinary writ, rather than by direct appeal, would better protect the rights afforded by the Public Records Act -- did not violate article VI, section 11, in enacting the challenged provisions of section 6259(c).\n\nAs stated at the outset of this Concurring opinion, however, in reaching this Conclusion I do not believe it is necessary or appropriate to determine, at this juncture, whether the provisions of article VI, section 11, should be interpreted to permit the Legislature to substitute writ review for direct appeal in all cases or in specific contexts not presented here. A statute that purported to substitute writ review for direct appeal in all cases falling within the appellate jurisdiction of the Courts of Appeal clearly would present constitutional considerations quite different from those raised under the limited Public Records Act provision here at issue. Similarly, a statute that purported to substitute writ review for direct appeal in, for example, all cases resulting in a felony conviction, or in all contract or tort actions, also would present, from the perspective of both the Court of Appeal and the parties, constitutional considerations of a considerably different magnitude from those evoked by the statute now before us. In my view, in resolving this case there is no reason to set forth a broad constitutional rule that could be understood to validate those types of measures. It will be time enough to address the constitutional questions raised by such legislation if and when the Legislature chooses to enact measures of this scope.\n\nV\n\nBecause I conclude that section 6259(c) is constitutional, I concur in the lead opinion's affirmance of the Court of Appeal's dismissal of the appeal.\n\nLUCAS, C.J., Dissenting:\n\nI Dissent. The litigants in this case have a right of appeal under California Constitution, article VI, section 11, as similar litigants in \"public records\" cases have had for over 100 years.\n\nWe granted review to decide whether the Legislature may, under the Public Records Act, Government Code section 6250 et seq.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e (PRA or Act), section 6259, subdivision (c) (section 6259(c)), bar review on appeal of superior court orders granting or denying disclosure of records, and restrict review to that available by discretionary writ. The lead and Concurring opinions erroneously conclude that the Legislature may do so.\n\nTo resolve the question posed, we must construe California Constitution, article VI, section 11 (article VI, section 11), which vests the Courts of Appeal and this court with \"appellate jurisdiction.\" The lead opinion approaches this task in inconsistent fashion.\n\nAt times, it views article VI, section 11 as merely defining the powers of the courts, and not as establishing any separate substantive right of litigants. In this respect, the lead opinion suggests the Legislature has authority to foreclose a right to review on the merits and a written opinion -- or indeed, any review -- in any litigated matter, criminal or civil.\n\nFor the most part, however, the lead opinion concedes that the constitutional grant of appellate jurisdiction was intended to confer on litigants \"a right to some effective procedural vehicle by which to invoke the constitutionally conferred appellate jurisdiction\" (lead opn., ante, at p. 22) -- e.g., a right to petition the court to exercise its discretion to review the underlying dispute. But, the lead opinion concludes, article VI, section 11 affords litigants no right to \"direct appeal\" -- i.e., a right to review on the merits\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e and a written opinion \"with reasons stated\" (Cal. Const., art. VI, § 14). Instead, the lead opinion suggests, the right that article VI, section 11 confers on litigants is very limited: It extends only the right to ask a court to exercise its discretion to hear the dispute; it does not include a right to obtain review on the merits, or a right to a written opinion.\n\nUltimately, the lead opinion concedes that article VI, section 11 precludes the Legislature from substantially impairing the constitutional powers of the Courts of Appeal or this court. (Lead opn., ante, at p. 30.) That, however, is not the claim in this case. Plaintiffs assert section 6259(c) unconstitutionally impairs their right to review on the merits and a written opinion.\n\nThe lead opinion conspicuously, and inexplicably, fails to address the latter aspect of plaintiffs' constitutional claim, i.e., whether they have a right to a written opinion. It impliedly rejects the former aspect of plaintiffs' claim (their right to review on the merits) by asserting that, independently from the Constitution, plaintiffs in this case have a right, under general principles of writ jurisprudence, to merit review whenever, as here, the Legislature establishes discretionary writ review as the sole means of review. (Lead opn., ante, at p. 35.)\n\nThis belated and grudging acknowledgment that PRA litigants are entitled to half of what the Constitution grants them of right is both revealing and unpersuasive. The lead opinion cites no authority for its Conclusion that PRA litigants are entitled to merit review by discretionary writ -- and indeed, no litigant in this matter (nor any party in prior cases presenting the identical issue to this court) has so argued -- because the legislative history of section 6259(c) forecloses the lead opinion's theory. That history shows the Legislature did not intend to guarantee review on the merits, but instead contemplated that the Court of Appeals would retain discretion to deny such writs without adjudicating the merits of a claim. In light of this history, if we are to conclude that merit review is guaranteed under section 6259(c), we may do so only on the basis that the section must be read to guarantee merit review in order to preserve the statute's constitutionality. The lead opinion, however, completely refuses to acknowledge the constitutional basis for its Conclusion, because to do so would fatally undermine its premise that article VI, section 11, confers on litigants neither a substantive right of merit review, nor a right to a written opinion.\n\nWe need not engage in such machinations in order to acknowledge a right to merit review, and we should not deny plaintiffs their constitutional right to a written opinion explaining the court's reasons for its resolution of the merits.\n\nThe history of article VI, section 11, as revealed by the intent of its drafters in 1966 and that of the drafters of its antecedent provisions in 1849 and 1879, establishes that the grant of appellate jurisdiction was intended to accomplish two things: First, section 11 defines the power of the court to exercise \"appellate jurisdiction.\" Second, as the lead opinion concedes in parts of its analysis, the antecedents of section 11 reflected an intent, evident from the drafters' repeated reference to a \"right of appeal\" during the debates at the 1849 and 1879 Constitutional Conventions, that litigants have a constitutional \"right of appeal\" in matters within the courts' \"appellate jurisdiction.\"\n\nThe early debates also clarify the intended scope of the \"right of appeal.\" Despite the lead opinion's assertion otherwise, there is no evidence that the drafters in 1849 and 1879 contemplated that a litigant's \"right of appeal\" could be satisfied by affording a mere opportunity to seek discretionary writ review. Indeed, the evidence firmly refutes this position: Passages of the debates relied on by the lead opinion, as well as whole portions it neglects to emphasize, demonstrate that the drafters assumed that the \"right of appeal\" entailed a right to review on the merits, and that a court would not have discretion to dispose of a litigant's \"right of appeal\" either by declining to consider the merits, or by summarily denying the requested relief without a written opinion. These fundamental assumptions were at the heart of the delegates' debates and ultimately informed their choice of constitutional language.\n\nMoreover, the case law construing article VI, section 11 and its antecedents provides no support for the lead opinion's view, and in fact, disproves it. The lead opinion concedes, as it must, that starting with our earliest decisions, we have repeatedly construed our \"appellate jurisdiction\" provision as guaranteeing a \"right of appeal.\" Nevertheless, it insists that in so stating, we actually meant no more than that litigants have \"a right to appellate review generally\" (lead opn., ante, at p. 29) -- a right that the lead opinion appears to believe would be satisfied by affording litigants a mere opportunity to seek discretionary writ review. The case holdings, however, are not susceptible to such revisionism. In each relevant decision, and without a single Dissent, we found or confirmed the existence of a constitutional \"right of appeal\" in matters within this court's appellate jurisdiction. Nowhere in any case is there a hint to support the proposition that the constitutional \"right of appeal\" may be satisfied merely by affording a litigant an opportunity to petition for discretionary writ review, and that the \"right of appeal\" does not entail guaranteed review on the merits and a written opinion.\n\nUltimately, the lead opinion is compelled to rely on several cases broadly asserting in dicta that there is no state constitutional right of appeal. As I shall explain, not only are these cases inapposite, but they contain no analysis, ignore the contrary debates and case law, and with one distinguishable exception, do not even discuss article VI, section 11, or its predecessors.\n\nTo its credit, the Concurring opinion expressly declines to endorse the lead opinion's broad constitutional analysis, and cautions that the Legislature may not have constitutional authority to foreclose appeal -- i.e., a right to review on the merits and a written opinion -- in favor of discretionary and potentially summary writ review in matters outside the context of the PRA. Significantly, the Concurring opinion does not join in the lead opinion's analysis of the 1849 and 1879 constitutional debates and the case law interpreting the resulting provisions. Indeed, it carefully avoids suggesting that when the delegates and Justices of this court repeatedly used the phrase \"right of appeal,\" they contemplated a right that would be satisfied by the mere opportunity to seek discretionary and potentially summary writ review.\n\nNevertheless, the Concurring opinion concludes the elimination of \"appeal\" under the PRA is justified in this case because the Legislature reasonably decided that \"review by extraordinary writ, rather than by direct appeal, would better protect the rights afforded by the Public Records Act . . . .\" (Conc. opn., ante, at p. 13.) I cannot agree with this aspect of the Concurring opinion, which is unsupported by analysis or precedent.\n\nThe Concurring opinion relies heavily on the few other statutory schemes in which the Legislature has eliminated appeal in favor of review by discretionary writ. There have always been exceptions to the general right of appeal conferred by article VI, section 11. For example, our state system has never afforded a constitutional right of appeal from contempt judgments, habeas corpus proceedings, or from inferior courts. Similarly, there has never been a constitutional right of appeal from interim rulings, or determinations of discrete preliminary issues unrelated to the substantive merits of an underlying cause of action. But the \"public records cases\" decided in this state over the past 100 years have always been treated as cases as to which there is a constitutional right of appeal.\n\nAccordingly, the fact that our decisions recognize the Legislature's long-established authority to preclude appeal in favor of review by discretionary writ in contempt and habeas corpus matters provides the Concurring opinion no support, in light of the equally established history affording appeal in \"public records cases\" before and after adoption of the PRA. Likewise, the fact that there is no constitutional right to appeal rulings on discrete, preliminary issues unrelated to the substantive merits of the underlying cause of action affords the Concurring opinion no support because the present case does not involve review of a ruling on a discrete, preliminary issue unrelated to the substantive merits of the underlying PRA litigation. It instead concerns the very essence of the cause of action -- namely, whether plaintiffs are entitled to the disclosure they seek.\n\nGiven the consistent history of a substantive right of appeal in this state, what are we to make of section 6259(c)? To give maximum effect to the legislative purpose underlying the section, I would read it as barring appeal if (i) a litigant neglects to seek discretionary writ review, or if, (ii) on discretionary writ review in the Court of Appeal, the litigant is afforded review on the merits and a written opinion with reasons stated. But in my view the statute may not constitutionally be applied to preclude appeal in cases such as this one, in which the litigants first properly sought, but were summarily denied, writ review. Accordingly, I would reverse the judgment of the Court of Appeal, and hold that although section 6259(c) is not unconstitutional on its face when construed as above, it may not constitutionally be applied to bar the appeal in this case.\n\nI. THE STATUTE\n\nAs we noted in Times-Mirror Co. v. Superior Court (1991) 53 Cal. 3d 1325, 1333, 283 Cal. Rptr. 893, 813 P.2d 240, footnote 6, section 6259(c), forecloses appeal and provides exclusively for discretionary writ review in cases of this kind. The section states: \"An order of the court, either directing disclosure by a public official or supporting the decision of the public official refusing disclosure, is not a final judgment or order within the meaning of Section 904.1 of the Code of Civil Procedure from which an appeal may be taken, but shall be immediately reviewable by petition to the appellate court for the issuance of an extraordinary writ.\" ( § 6259(c).)\n\nII. THE RIGHT OF APPEAL UNDER CALIFORNIA CONSTITUTION, ARTICLE VI, SECTIONS 10 AND 11\n\nA. The sections\n\nArticle VI, section 10, of the state Constitution grants this court and the Courts of Appeal original jurisdiction to issue writs of habeas corpus, mandate, prohibition, and certiorari, and grants the superior courts original jurisdiction \"in all causes except those given by statute to other trial courts.\" Article VI, section 11 provides in relevant part: \"The Supreme Court has appellate jurisdiction when a judgment of death has been pronounced. With that exception courts of appeal have appellate jurisdiction when superior courts have original jurisdiction and in other causes prescribed by statute.\" (Italics added.) Article VI, section 12 grants the Supreme Court original and appellate jurisdiction over all \"causes\" pending in or transferred from the Courts of Appeal.\n\nB. Overview\n\nPlaintiffs contend the grant in article VI, section 11 of \"appellate jurisdiction\" to the Courts of Appeal and this court also grants to litigants a constitutional right of appeal -- i.e., a right to review on the merits and a written opinion. They claim a right to such review of the superior court judgment at issue here, and assert section 6259(c) is unconstitutional to the extent it purports to bar their appeal.\n\nThe City of Richmond, and the lead opinion, correctly observe that the bare text of article VI, section 11 explicitly conveys no such right. As the lead opinion concedes, however, neither does the provision foreclose plaintiffs' contention that the Constitution implicitly grants litigants a right of appeal. In such circumstances, as the lead opinion acknowledges, it is proper -- indeed, necessary -- to consider the intention of the constitutional drafters, in order to determine the extent and scope of the provision. I survey below that constitutional history, and respond to the lead opinion's misconstruction of that history.\n\nC. The 1849 Constitution\n\n1. Appellate jurisdiction\n\nThe 1849 Constitution (art. VI, § 4) granted the Supreme Court \"appellate jurisdiction\" in specified classes of litigation: \"All cases when the matter in dispute exceeds two hundred dollars, when the legality of any tax, toll, or impost or municipal fine is in question, and in all criminal cases amounting to a felony [on] questions of law alone.\" In addition, the court was granted authority to issue writs \"necessary to the exercise of [its] appellate jurisdiction.\" Finally, the court was granted very limited original jurisdiction, confined to issuance of the writ of habeas corpus.\n\n2. The \"right of appeal\" at the 1849 Constitutional Convention\n\nThe debates of the 1849 Constitutional Convention are set out in Browne, Report of the Debates in the Convention of California on the Formation of the State Constitution (1850) (Browne). As the lead opinion observes, to the extent the debates shed light on the drafters' intent, they assist our interpretation and understanding of the language employed by the drafters. Indeed, we relied on the 1849 debates in our earliest decisions construing former article VI, section 4. (People v. Applegate (1855) 5 Cal. 295.)\n\nAs the lead opinion acknowledges, the 1849 delegates debated limiting the Supreme Court's \"appellate jurisdiction\" to cases involving at least $200. In the course of that debate, the drafters referred repeatedly to the effect of such a provision on a litigant's \"right of appeal.\"\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The debates reveal the delegates' intent that the provision defining the Supreme Court's appellate jurisdiction would accomplish two things: First, define the Supreme Court's appellate jurisdiction; and second, affirm the existence of a litigant's \"right of appeal.\"\n\nWhat did the delegates mean when they repeatedly referred to a \"right of appeal\"? The lead opinion asserts the drafters intended only to guarantee a right to seek review, and did not intend to guarantee any specific form of review or a right to obtain review, e.g., by appeal, discretionary writ, or otherwise. Accordingly, the lead opinion says, when the delegates argued about a litigant's \"right of appeal,\" they did not intend to convey the idea that a litigant would have a right of review on the merits. In fact, the lead opinion assumes that the drafters intended that the \"right of appeal\" would be satisfied if a litigant were given the opportunity to petition for discretionary review -- even if the court summarily denied the petition without considering the merits.\n\nThe record of the debates, however, reveals that when the drafters used the phrase \"right of appeal,\" they intended to convey the essential attribute of what we know the term means today -- the right to obtain review on the merits.\n\nIndeed, even the lead opinion's selective quotation from the debates disproves its point. It acknowledges the meaning of the phrase \"right of appeal\" was \"fairly summarized by the remark of one delegate (Mr. Norton) that if such a case were wrongly decided by a trial court, a litigant 'should have the right to go to the highest tribunal to get Justice' or the 'right to go to a higher tribunal and have that decision reversed.'\" (Lead opn., ante, at p. 11, quoting Browne, supra, at p. 227.) To like effect, the lead opinion quotes Mr. Lippitt, asserting \"that 'the poor have just as much right to carry up their disputes, and have them settled by the most competent tribunals, as the richest man in the land.'\" (Lead opn., ante, fn. 9, italics deleted, quoting Browne, supra, at p. 226.)\n\nThis concededly representative language is incompatible with the idea that the right of appeal could be satisfied by the mere opportunity to seek a discretionary writ. It is instead language intended to convey a right to obtain review on the merits. Plainly, Mr. Norton believed that a litigant should be guaranteed a right to go to a higher court to \"get Justice\" or \"have that decision reversed\" -- neither of which could be guaranteed if the litigant had a mere right to seek discretionary review, i.e., if the reviewing court were authorized to deny review without reaching the merits. The same applies to Mr. Lippitt's observations.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nIs there any evidence supporting the lead opinion's premise that the delegates assumed that discretionary writ review would satisfy the right of appeal? No. To the contrary. For example, when Mr. Jones spoke in favor of the amendment to impose a jurisdictional amount requirement, he asserted the Supreme Court should not be forced to \"preside[] over some petty case which some petty Justice of the peace has decided.\" (Browne, supra, at p. 226.) The premise of his argument, and that of all of the other delegates who supported and opposed his view, was that the Supreme Court would lack authority to weed out the important from the insignificant cases, and would thus be burdened with the task of resolving all such cases on the merits. Obviously, if the delegates believed that the court would have authority to dispose of such matters summarily and in its discretion (by concluding, for example, that the matter posed no important question of law or was less deserving than other cases competing for the court's attention), they would not have perceived the so-called \"petty\" cases as posing any substantial burden on the court.\n\nThe lead opinion advances a number of additional arguments in support of its reading of the 1849 debates. As explained below, the lead opinion's analysis is flawed in each respect.\n\nFirst, the lead opinion divines support for its view by noting that the delegates \"appear to have assumed that if as to a particular matter there was no 'appellate jurisdiction' -- and hence no 'right of appeal' -- then the trial court's judgment would be final and unreviewable.\" (Lead opn., ante, at pp. 11-12.) The lead opinion's premise is incorrect. The delegates allowed for \"county courts\" to review the judgments of inferior trial courts. (Cal. Const. of 1849, art. VI, § 9.) Contrary to the lead opinion, the delegates did allow for review of matters that fell outside the ambit of the \"right of appeal\" to the Supreme Court.\n\nSecond, the lead opinion seeks support for its interpretation of the 1849 drafters' intent in three early cases decided by this court. (People v. Turner (1850) 1 Cal. 143; Haight v. Gay (1857) 8 Cal. 297; Ex Parte Harker (1875) 49 Cal. 465.) None of these decisions construed former article VI, section 4's grant of \"appellate jurisdiction\" to confer only a right to seek discretionary writ review, and none reasonably supports the lead opinion's reconstruction of the drafters' intent.\n\nPeople v. Turner, supra, 1 Cal. 143, held only that this \"court may exercise [its] appellate jurisdiction . . . by means of the writ of mandamus.\" (Id. at p. 148.) In other words, Turner, supra, held nothing more than that the court may exercise discretion to grant extraordinary writ relief sought by a party in certain situations. That case says nothing about the present and converse situation, i.e., whether the Legislature may preclude appeal (with its concomitant right to review on the merits, and, as explained below, a written opinion) and limit the parties to discretionary and potentially summary writ review.\n\nThe second case relied on by the lead opinion, Haight v. Gay, supra, 8 Cal. 297, is similarly distinguishable, and indeed, as the lead opinion concedes, it contains language helpful to plaintiffs' position. Consistently with the history of the 1849 debates set out above, this court noted that although the Legislature has power to regulate the \"mode in which the right [of appeal] must be asserted,\" it \"cannot substantially impair the right of appeal.\" (Haight v. Gay, supra, 8 Cal. 297, 300, first italics in original, second added.) A close reading of Haight v. Gay reveals it does not suggest, much less hold, that the Legislature has the power to select freely between discretionary writ review and review by appeal.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Haight v. Gay says only that the Legislature may bar review by \"writ of error\" in favor of exclusive review by direct appeal -- a firmly established proposition that says nothing about the present, and opposite question -- whether the Legislature may bar review by appeal in favor of exclusive review by discretionary writ.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nThe third case on which the lead opinion relies, Ex Parte Harker, supra, 49 Cal. 465, did not concern, or even mention, this courts' constitutional jurisdiction under former article VI, section 4. The case instead involved simply the district court's original jurisdiction under former article VI, section 6.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nFinally, the lead opinion's historical analysis is flawed by its unduly and conveniently narrow scope. It views article VI, section 4, of the 1849 Constitution as the \"earliest antecedent of the 'appellate jurisdiction' provision of the present Constitution . . . .\" (Lead opn., ante, at p. 9.) By ignoring the true \"earliest antecedent\" of our present article VI, section 11, the lead opinion treats the 1849 (and 1879) constitutional antecedents as if they had no relevant out-of-state history that might have informed the California drafters or the case law construing the California provisions. I review the relevant history and background below.\n\nIn drafting our appellate jurisdiction provision, the delegates consulted the constitutions of every state then in existence. (Browne, supra, at p. 221.) Under the predominant model of the day (and the federal approach), the Legislature was granted express authority to define the appellate jurisdiction of the state's highest court.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Under the minority model, followed by a handful of states, the Constitution itself set out and defined the state high court's jurisdiction.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e All but one of the few states that followed the minority approach vested appellate jurisdiction in its high court in general terms, for example: \"The supreme court . . . shall have original jurisdiction in cases relative to the revenue, in cases of mandamus, habeas corpus, and in such cases of impeachment as may be by law directed to be tried before it, and shall have appellate jurisdiction in all other cases.\" (Ill. Const. (1848) art. V, § 5, italics added; see also Mo. Const. (1820) art. V, § 2; Md. Const. (1776) art. LVI.) The sole exception within the minority group -- Louisiana -- adopted a more explicit approach, actually listing the classes of cases within the Supreme Court's appellate jurisdiction, for example, \". . ., and in all criminal cases on questions of law alone, whenever the punishment of death or hard labor may be inflicted . . . .\" (La. Const. (1845) tit. IV, art. 63.) As explained below, our 1849 delegates rejected the prevailing federal approach and adopted the Louisiana version of the minority model.\n\nThe convention appointed a special committee of three -- Norton, Dimmick, and Jones (the latter a young attorney from Louisiana) -- to reconcile divergent approaches to the judicial article. (Browne, supra, at pp. 224, 478.) Thereafter the special committee proposed an appellate jurisdiction provision that was quite clearly modeled after the corresponding provision of the Louisiana Constitution of 1845 (tit. IV, art. 63).\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Over the objection of Mr. Jones, however, the special committee declined to embrace one significant aspect of the Louisiana scheme -- the minimum \"amount in controversy\" limitation on the Supreme Court's appellate jurisdiction. (See ante, fn. 10.)\n\nWhen the special committee's report was submitted to the whole convention, an amendment was immediately proposed to limit the Supreme Court's appellate jurisdiction to cases \"where the matter in dispute exceeds $200.\" (Browne, supra, at p. 225.) Thereafter, the debate about the effect of that amendment on a litigant's \"right of appeal\" ensued. Eventually the amendment was adopted. With this change, the resulting provision (article VI, section 4 of the 1849 California Constitution) substantially mirrored the corresponding \"appellate jurisdiction\" provision of the 1845 Louisiana Constitution.\n\nThis background of the 1849 appellate jurisdiction provision is significant because it demonstrates that the California delegates intentionally departed from the prevailing model, which gave the Legislature complete power to regulate the high court's appellate jurisdiction, and hence could not be construed as affording a constitutional right of appeal. They opted instead for Louisiana's novel approach under which the Constitution fixes the high court's appellate jurisdiction. The decision to follow the Louisiana course becomes all the more significant when we review the history and construction of the Louisiana provision. It shows: (i) the 1845 Louisiana constitutional debates reflected the drafters' understanding that their provision created a \"right of appeal\";\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e (ii) as early as 1876 the Louisiana Supreme Court interpreted the Louisiana provision as granting such a constitutional right;\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e and (iii) since at least that date -- and continuing to this day -- the Louisiana \"appellate jurisdiction\" provision has been construed to grant a constitutional \"right of appeal\" (a right that includes review on the merits)\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e even though the guarantee is found only in that state's judicial article, and not in its \"Declaration of Rights.\"\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nThe 1849 California debates show that the drafters of our Constitution similarly intended the appellate jurisdiction provision to confer a \"right of appeal,\" modeled on the Louisiana provision. Contrary to the lead opinion's premise, the relevant history and debates establish that the delegates understood that \"right of appeal\" meant a right to obtain review on the merits.\n\nD. The 1862 Amendments and the 1879 Constitution\n\n1. Appellate jurisdiction\n\nIn 1862, the California Constitution was modified, expanding the list of cases establishing appellate jurisdiction to include \"all cases at law . . . in which the demand, exclusive of interest or the value of the property in controversy, amounts to three hundred dollars.\" Furthermore, the Supreme Court was given appellate jurisdiction in \"all cases in equity\" as well as \"cases at law which involve the title or possession of real estate\" and in \"all cases arising in the probate courts.\"\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nWhen the Constitution was rewritten by the delegates to the Constitutional Convention of 1879, the list of matters giving rise to the Supreme Court's appellate jurisdiction was both narrowed to exclude cases in equity arising in the Justices' courts, and expanded to include \"cases of forcible entry and detainer, and in proceedings in insolvency, and in actions to prevent or abate a nuisance . . . .\" (Cal. Const. of 1879, art. VI, § 4.) In addition, appellate jurisdiction in criminal cases was clarified to include \"all criminal cases prosecuted by indictment or information in a Court of record . . . .\" (Ibid.)\n\n2. The \"right of appeal\" at the 1879 Constitutional Convention and immediately thereafter\n\n(a) The 1879 debates\n\nThe 1879 delegates, like their 1849 predecessors, rejected the prevailing model of the day, under which the Legislature was granted complete authority to control all appeals,\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e and instead retained the scheme under which the Constitution itself defined the appellate jurisdiction of the Supreme Court. Moreover, as noted above, by that time, the antecedent of the 1849 Constitution -- the Louisiana Constitution of 1845 -- had been construed by the Louisiana Supreme Court as granting a \"right of appeal.\" (State v. Judge of the Superior District Court, supra, 28 La.Ann. 547, 548.)\n\nThe record of the 1879 debates reveals that, like the drafters of the 1849 Constitution, the delegates understood that article VI, former section 4, both defined appellate jurisdiction and also affirmed and defined a litigant's \"right of appeal\" in all civil and criminal cases within the \"jurisdiction list\" of former section 4.\n\nOnce again, as the lead opinion concedes, the delegates focused initially on defining appellate jurisdiction in terms of the monetary \"amount in controversy\" in a given case, and the effect of such a scheme on a litigant's \"right of appeal.\"\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Then, when debating this court's appellate jurisdiction in criminal matters, the delegates focused again on a criminal defendant's \"right of appeal.\"\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Thereafter, the delegates debated, and ultimately rejected the proposition that there should be a constitutional \"right of appeal\" from certain judgments of the inferior trial courts to the Supreme Court.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nWhat did the delegates mean by \"right of appeal\"? Again, the lead opinion asserts they \"used the term . . . expansively to encompass all forms of appellate review\" (lead opn., ante, at p. 17), and reiterates its construction of the 1849 debates: It claims the 1879 delegates repeatedly used the phrase \"right of appeal\" to guarantee only a right to seek review, and did not intend to guarantee any specific form of review or a right to obtain review. And once more, the lead opinion assumes the drafters intended that the \"right of appeal\" would be satisfied if a litigant were given the opportunity to petition for discretionary review -- even if the court summarily denied the petition without considering the merits.\n\ni. The right to obtain review on the merits\n\nThe record of the debates again disproves the lead opinion's premise. First, the lead opinion points to nothing suggesting that the delegates contemplated that a litigant's constitutional \"right of appeal\" would be satisfied if the litigant were afforded the mere right to seek discretionary writ review. Indeed, as in 1849, the 1879 delegates' premise was the opposite: When they (i) discussed the various proposals to increase and decrease the dollar amount giving rise to \"appellate jurisdiction\" in the Supreme Court (2 Willis \u0026 Stockton, supra, pp. 963-964), (ii) debated changes in the language granting appellate jurisdiction in criminal cases (id. at p. 964, col. 1), and (iii) debated whether, in certain cases, a Justices' court litigant should be allowed a \"second appeal\" to the Supreme Court (id. at pp. 976-981), the delegates assumed the Supreme Court would lack discretion to decline to entertain an \"appeal\" that fell within the court's appellate jurisdiction list, and would have to decide such matters on the merits. Indeed, as noted above in the Discussion about the 1849 debates, if the delegates believed the court would have authority to dispose of \"appeals\" summarily and in its discretion, they would not have perceived the above described proposals as posing any substantial burden on the court. Significantly, the lead opinion cites nothing to suggest the 1879 delegates viewed the \"right of appeal\" differently from their 1849 predecessors; and as shown above, the 1849 delegates viewed the \"right of appeal\" as encompassing at least a right to obtain review on the merits.\n\nThe lead opinion again perceives support for its position by attributing to the 1879 delegates the \"apparent assumption . . . that a trial court's judgment would not be reviewable at all if a litigant was denied a 'right of appeal' . . . . \" (Lead opn., ante, at pp. 16-17.) And again, the lead opinion's premise is incorrect. The delegates provided for review of matters that fell outside the ambit of the \"right of appeal\" to the Supreme Court. First, they expressly gave the superior courts \"appellate jurisdiction\" in cases arising from all inferior courts \"as . . . may be prescribed by law.\" (Cal. Const. of 1879, art. VI, § 5; see also, e.g., 2 Willis \u0026 Stockton, supra, at p. 964, col. 2 [\"Superior Courts shall operate as appellate courts\" to review the judgments of inferior trial courts (remarks of Mr. Wilson)].) In addition, as explained above, the delegates expressly provided for original writ jurisdiction in the Supreme Court, which would of course permit discretionary writ review of matters outside the Supreme Court's \"appellate jurisdiction\" list. (See, e.g., Tyler v. Connolly (1884) 65 Cal. 28, 32-33, 2 P. 414 (conc. opn. of Morrison, C.J.) [although the \"right of appeal\" conferred by former art. VI, § 4 does not extend to contempt judgments, such judgments are nonetheless reviewable by discretionary writ]). Once again, the lead opinion does not support its Conclusion that the drafters contemplated that a mere right to seek discretionary writ review would satisfy a litigant's constitutional \"right of appeal.\"\n\nThe 1879 delegates intended to guarantee not simply a right to seek review, but a right to obtain review on the merits in a higher court. If the delegates had intended to guarantee only the amorphous \"right to seek review of some kind\" attributed to them by the lead opinion, the delegates would have made this unusual construction clear at some point during their extensive debates.\n\nii. The right to a written opinion \"with reasons stated\"\n\nIn yet another important respect, the 1879 delegates further clarified, and expanded on, what the \"right of appeal\" entailed. Immediately before the above described debate about article VI, former section 4, the delegates debated and adopted another provision (art. VI, former § 2, 15th sentence) that remains essentially unchanged today (art. VI, § 14, 2d par.).\n\nTwo decades earlier, in Houston v. Williams (1859) 13 Cal. 24, the court held unconstitutional a statute requiring that \"'all decisions given upon an appeal in any Appellate Court of this State shall be given in writing, with the reason therefor, and filed with the Clerk of the Court . . . .'\" (Id. at p. 25.) Justice Field, writing for the court, rejected the statute as an attack on the court's \"dignity and independence.\" (Ibid.)\n\nThe 1879 delegates viewed the \"in writing\" requirement otherwise. To them, it was necessary to ensure the quality and integrity of appellate court decisions. Hence, they moved to enshrine the invalidated statutory requirement in the Constitution. The following draft language was submitted: \"In the determination of causes, all decisions of the Court in bank or in Departments shall be given in writing, and the grounds of the decision shall be stated.\" (2 Willis \u0026 Stockton, supra, at p. 950, col. 2.) Speaking on behalf of the provision, Mr. Wilson asserted:\n\n\"The importance of requiring the Court to give written opinions cannot be overrated. They not only become the settled law of the State, and are precedents for subsequent cases, but in many causes where the litigation is not ended by the decision of the Supreme Court, and new trials are consequent upon a reversal, the decision of the Supreme Court should be given in writing, and reasons assigned, for they are instructions to the Court below, and are the controlling rule in the subsequent litigation. . . . Undoubtedly [the requirement of a written opinion] will insure a careful examination of the cases, and result in well considered opinions, because they must come before the jurists of the country and be subjected to the severest criticism. . . . It tends to purity and honesty in the administration of Justice.\" (Id. at p. 951, col. 1, italics added.) There was no objection to the provision, and it was adopted. (Id. at p. 957, col. 1.)\n\nFrom this, two Conclusions flow: First, the delegates intended that decisions of the Supreme Court in which a \"cause\" is determined (but not decisions of the superior court acting in an appellate capacity) must be in writing with reasons stated. Resolution by this court (or now, the Court of Appeal) of an appeal determines a \"cause\" within the meaning of the \"in writing\" provision. Accordingly, when the delegates later referred repeatedly to a \"right of appeal,\" it seems plain that they contemplated a procedure that would include the right to an opinion in writing with reasons stated whenever this court (or now, the Court of Appeal) decides an appeal.\n\nSecond -- and quite apart from the question of whether the delegates intended to grant a \"right of appeal\" under article VI, former section 4 -- the \"in writing\" requirement first set out in article VI, section 2, and presently existing in article VI, section 14, has independent significance for the review of writ petitions under section 6259(c). It is well established that, in other contexts, an appellate court may summarily deny a petition for an original writ without violating this constitutional provision. (Funeral Dir. Assn. v. Bd. of Funeral Dirs. (1943) 22 Cal. 2d 104, 106, 136 P.2d 785.) Nonetheless, past decisions have not considered the application of article VI, section 14, to a statutory scheme such as that established by section 6259(c), in which writ review has been substituted for appeal as the exclusive avenue by which the Court of Appeal reviews the superior court's Disposition of an entire cause of action.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e In the unique context of section 6259(c) -- in which resolution of a writ petition decides the entire cause of action -- it is contrary to the purpose and language of article VI, section 14, to suggest that a Court of Appeal ruling, resolving the writ petition, does not \"determine a cause\" within the meaning of this constitutional provision. Accordingly, it would appear that even under the lead opinion's view (i.e., assuming the drafters did not intend to grant litigants what the lead opinion terms a \"direct appeal\"), a Court of Appeal faced with a writ petition such as this would lack the authority to dispose of it summarily, i.e., without a written opinion.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nIn Conclusion, the record of the 1879 debates reveals that the delegates intended the Constitution's grant of appellate jurisdiction (former art. VI, § 4) to accomplish two things: It established this court's appellate jurisdiction and it also established for litigants a right of appeal -- meaning a right to review on the merits and a written opinion with reasons stated -- in all cases coming within the court's appellate jurisdiction.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nb. Case law interpreting the 1879 Constitution -- Tyler, Jordan \u0026 Perry\n\nIn decisions rendered shortly after the 1879 convention, and thus reflecting an essentially contemporaneous understanding of the drafters' intent, we acknowledged that former article VI, section 4 both established this court's appellate jurisdiction and granted a \"right of appeal\" (a right to review on the merits and a written opinion with reasons stated) in cases within that appellate jurisdiction.\n\nTyler v. Connolly, supra, 65 Cal. 28 (Tyler), a decision effectively ignored by the lead opinion, is the most significant. The case involved a $500 fine imposed under a contempt judgment against Tyler. Although established case law recognized a right to challenge contempt judgments by seeking the discretionary writs of habeas corpus, prohibition, and certiorari (see, e.g., Huerstal v. Muir (1880) 62 Cal. 479, 481, and cases cited), Tyler was not content to settle for such discretionary and potentially summary review, and instead asserted his right to \"appeal.\"\n\nFor over 30 years, however, the Legislature had prohibited appeals of contempt judgments. (Tyler, supra, 65 Cal. 28, 30, citing Code Civ. Proc., § 1222 (1872); see also Practice Act, § 493, Stats. 1851, ch. 5, § 493, p. 128.) Accordingly, the respondent moved to dismiss the appeal. In reply, Tyler asserted his \"right of appeal\" was conferred by the Constitution, former article VI, section 4 (65 Cal. at p. 29), and that Code of Civil Procedure section 1222 was unconstitutional.\n\nThe issue was thus framed: Even though an opportunity to seek \"review\" was available by discretionary writ, did the Constitution nevertheless grant Tyler a \"right of appeal\"? Contrary to suggestions of the lead opinion, when the Tyler court addressed this constitutional issue, it could not have labored under the assumption that discretionary writ review and review by appeal were constitutionally equivalent methods of satisfying a litigant's constitutional \"right of appeal.\" As explained below, the court plainly recognized that the \"right of appeal\" asserted by Tyler was something different from, and greater than, the mere right to seek discretionary writ review, which might be denied summarily and without considering the merits.\n\nThe court rejected Tyler's claimed constitutional right of appeal because the judgment at issue fit nowhere in the jurisdiction list of former article VI, section 4. After quoting that provision, the majority opinion said: \"It is argued that because the judgment against Tyler exceeds three hundred dollars, that the appeal is given by the Constitution. But the Constitution does not give an appeal in all cases where the judgment exceeds three hundred dollars; it gives it only when the demand, exclusive of interest, exceeds that sum.\" (Tyler, supra, 65 Cal. at pp. 29-30.) The majority opinion in Tyler noted that there is no such \"demand for a sum of money in a proceeding for a contempt.\" (Id. at p. 30.) The Tyler majority also observed that, although the contempt at issue was criminal in nature, it was \"not prosecuted by indictment or information,\" and hence \"its character as a criminal case furnishes no ground for an appeal.\" (Ibid., italics added.) The court concluded, \"we find no warrant in the Constitution for an appeal in a proceeding for contempt.\" (Ibid., italics added.)\n\nThe Concurring opinion in Tyler, supra, 65 Cal. 28, echoed and amplified these points. Chief Justice Morrison addressed the petitioner's assertion that \"the right of appeal is a constitutional right -- not to be taken away by the legislature\" (id. at p. 31 (conc. opn. of Morrison, C.J.)), and proceeded to consider \"if the right of appeal exists under the Constitution.\" (Ibid.) After quoting former article VI, section 4, the Chief Justice concluded that the contempt proceeding was a \"criminal proceeding,\" but that because it was not \"'prosecuted by indictment or information . . . . '\" (65 Cal. at p. 32), it did not fall within the language of former article VI, section 4, and hence there was no constitutional right of appeal in such a case. (65 Cal. at p. 32.) Significantly, however, Chief Justice Morrison observed that Tyler had an opportunity to seek review of his contempt judgment through \"other modes of relief,\" namely, discretionary writ review \"by certiorari or habeas corpus.\" (Id. at pp. 32-33, italics in original.) In other words, the Chief Justice drew a distinction, implicit in the majority opinion, between matters over which the Constitution granted a \"right of appeal,\" and other matters, such as contempt judgments, which are reviewable exclusively by a procedure other than \"appeal,\" i.e., by discretionary writ.\n\nIn view of the fact that the contemner in Tyler, supra, 65 Cal. 28, had a right to seek discretionary writ review, it is clear that the Tyler majority generally, and Chief Justice Morrison's Concurring opinion in particular, necessarily rejected the theory advanced by the lead opinion today, namely, that the \"right of appeal\" could be satisfied by affording a litigant the opportunity to seek discretionary writ relief, which might be denied summarily and without considering the merits. Indeed, if the court believed the \"right of appeal\" would be satisfied by affording an opportunity to seek discretionary writ review, the court would have simply treated the purported appeal as a discretionary writ application. The fact that it did not do so, and instead engaged in an extensive analysis of the \"right of appeal\" under former article VI, section 4, demonstrates that the court did not equate an opportunity to seek discretionary writ review with a \"right of appeal.\" Reading the court's two opinions together, Tyler reflects the court's understanding, rendered roughly contemporaneously with the drafting and ratification of the 1879 Constitution, that former article VI, section 4, provided a right of appeal -- meaning a right to review on the merits and a written opinion, as opposed to a right to seek discretionary and potentially summary writ review -- in cases within the list of matters giving rise to the court's appellate jurisdiction.\n\nA few months later, in People v. Jordan (1884) 65 Cal. 644, 4 P. 683 (Jordan), we addressed the Legislature's failure to provide a means for the People to appeal from a superior court's judgment of dismissal after the sustaining of a demurrer to an indictment. Unlike Tyler, supra, 65 Cal. 28, Jordan was a case that was expressly within the Supreme Court's appellate jurisdiction, and as to which there was, accordingly, a right of appeal. Consistently with the history described above, we noted in Jordan that because the matter involved a \"criminal case[] prosecuted by indictment,\" the court was granted appellate jurisdiction under former article VI, section 4. Significantly, we concluded from this that the constitutional provision was self-executing: \"When a certain jurisdiction has been conferred on this or any court, it is the duty of the court to exercise it; a duty of which it is not relieved by the failure of the legislature to provide a mode for its exercise.\" (Jordan, supra, 65 Cal. at p. 646, italics added.)\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Thereafter, we reiterated our \"duty, imposed by the Constitution, of reviewing the proceedings of the court below\" (id. at p. 648), and asserted our power, \"as necessarily incident to our jurisdiction,\" to \"establish[] any appropriate practice for the bringing here [of] a record or proceeding in the court below.\" (Ibid.)\n\nIn so proclaiming, we were careful to contrast our broad constitutional authority and duty with the more restrictive grant to the federal courts under the federal Constitution. (Jordan, supra, 65 Cal. at p. 648.) We again stressed our inability to \"refuse to exercise a jurisdiction imposed upon this court by the [state] Constitution\" (id. at p. 649), and concluded the court had \"inherent\" power to establish rules governing appeal in such cases. (Ibid.) Accordingly, we denied a motion to dismiss the pending appeal (id. at p. 651), and in a separate decision filed shortly thereafter we proceeded to address and resolve the appeal on the merits. (See People v. Jordan (1884) 66 Cal. 10, 11-15, 4 P. 773 (Jordan II).)\n\nWe followed Jordan, supra, 65 Cal. 644, in People v. Perry (1889) 79 Cal. 105, 21 P. 423 (Perry), which concerned an action to determine which of two persons was entitled to take appointive office. When the claimant who failed to prevail in the superior court appealed to this court, the other claimant moved to dismiss the appeal, arguing the matter was outside this court's appellate jurisdiction. (Id. at p. 107.) We rejected the argument, stating: \"This court retains jurisdiction of the case, notwithstanding the [Legislature] may have changed the procedure, enlarged the remedy, and given it a new name. To hold otherwise would be to admit a power in the [Legislature] to abridge our jurisdiction, and take from the parties the right of appeal, by the easy device of a change of procedure, in many cases, where the right and jurisdiction are unquestioned.\" (79 Cal. at p. 108, first italics in original, second added; see also Estate of Nelson (1900) 128 Cal. 242, 245, 60 P. 772 [\"The right of appeal is conferred by the constitution, and statutes and rules of procedure for its exercise are to be liberally construed.\"].)\n\nIn Jordan, Perry, and Estate of Nelson, all supra, the respondents sought to dismiss what the lead opinion terms \"direct appeals\" -- i.e., proceedings in which the appellants claimed a right to review on the merits and a written opinion. In each case this court rejected those arguments and held the appellants had a right, derived from our Constitution (former article VI, section 4), to proceed with the appeal. The lead opinion's strained attempt to read Jordan and Perry otherwise is unpersuasive.\n\nConcerning Jordan, supra, 65 Cal. 644, the lead opinion asserts: \"Because the Legislature had not authorized review by extraordinary writ, we did not consider whether appellate review in that form would have satisfied the 'appellate jurisdiction' provision of the 1879 Constitution. Significantly, however, we referred to the Legislature's failure to provide 'a mode' for the exercise of appellate jurisdiction (People v. Jordan, supra, 65 Cal. 644, 646), thereby necessarily implying that more than one such mode was possible. . . .\" (Lead opn., ante, at p. 18.)\n\nNothing in Jordan supports the lead opinion's speculation that, had the Constitutional adequacy of discretionary writ review been raised, we might have held that the Legislature could relegate the People to the mere opportunity to seek such discretionary review. Nor does the lead opinion's selective quotation support its point. When read in context (see ante, at pp. 31-32), and in view of the fact that the Jordan court denied the motion to dismiss the appeal (Jordan, supra, 65 Cal. at p. 651) and ultimately addressed and resolved the matter before it on appeal (Jordan II, supra, 66 Cal. 10, 11-15), it is clear that the court's reference to \"a mode\" pertained to the procedural rules for presentation of the People's \"direct appeal,\" and was not, as the lead opinion divines, an oblique and veiled hint that the People's right under article VI, former section 4, would be adequately protected by the opportunity to seek discretionary writ review.\n\nPerry, supra, 79 Cal. 105, is likewise mistreated by the lead opinion, which asserts that when the court spoke of the \"right of appeal,\" it really meant to say \"appellate review in any form rather than . . . the specific procedure known as a direct appeal.\" (Lead opn., ante, at p. 19.) The difficulty with this analysis is that \"the specific procedure known as a direct appeal\" was the only procedure at issue in the case. If the Perry court had actually done what the lead opinion asserts it intended to do, the court would have neglected its obligation to address and resolve the sole issue raised by the appellant -- his right to appeal, i.e., review on the merits and a written opinion. Judicial decisions are of course authority for what they actually decide; we do not readjust their holdings to incorporate claims not asserted or considered therein. The lead opinion's proposed reinterpretation of Perry is unconvincing.\n\nEqually unpersuasive is the lead opinion's reliance on In re Jessup (1889) 81 Cal. 408, 22 P. 742 (Jessup). First, contrary to the lead opinion's suggestion, Jessup does not purport to provide an all-purpose definition of our constitutional \"appellate jurisdiction.\" Jessup considered the Legislature's authority to require that a decision of this court to grant rehearing be supported by a vote of five of seven Justices. We declared the statute unconstitutional, observing that \"'the mere procedure by which jurisdiction is to be exercised may be prescribed by the legislature, unless, indeed, such regulations should be found to substantially impair the constitutional powers of the courts, or practically defeat their exercise.' We concede the power to regulate, but not the power to take away or defeat, the exercise of jurisdiction. And this, in our opinion, the legislature has . . . attempted to accomplish.\" (Jessup, supra, 81 Cal. at p. 470, italics added by Jessup court.)\n\nBefore reaching that Conclusion the Jessup court considered \"the extent of the power implied ex vi termini by the phrase 'appellate jurisdiction.' That this embraces the right to review the final judgments of the courts of original jurisdiction, -- the right, in other words, to reverse, affirm, or modify them, and to enforce by some appropriate mandatory process the judgment of the appellate tribunal, -- will scarcely be denied.\" (81 Cal. at p. 465, italics added.) Viewed in context, it seems clear that Jessup's sole focus was on the power granted to the court by the Constitution; it did not purport to define \"appellate jurisdiction\" outside that limited context or for all purposes, and indeed, its observation that the term \"embraces\" certain powers would seem to underscore the restricted scope of its inquiry.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nFinally, the lead opinion finds Jessup, supra, 81 Cal. 408 \"significant also because it further supports the Conclusion that a court may exercise 'appellate jurisdiction' by means other than direct appeal.\" (Lead opn., ante, at p. 20.) To the extent Jessup supports that unchallenged (and correct) principle, first articulated in People v. Turner, supra, 1 Cal. 143, it is irrelevant to the present case for the same reason Turner is irrelevant. (See, ante, at p. 12.) The fact that a court may, under its \"appellate jurisdiction,\" exercise discretion to grant extraordinary writ relief sought by a party in certain situations, says nothing about the present and converse situation, i.e., whether the Legislature may preclude \"appeal\" and limit the parties to seek discretionary writ review. Nothing in Jessup, supra, is inconsistent with the proposition, established in our cases before and after Jessup, that the Constitution grants a right of appeal -- i.e., review on the merits and a written opinion -- on review from the superior court to the Court of Appeal and this court.\n\nE. The 1904 amendments\n\n1. Appellate jurisdiction\n\nIn 1904, the Courts of Appeal were created. The appellate jurisdiction of those courts was established and that of the Supreme Court was modified. The list of matters giving rise to the Supreme Court's appellate jurisdiction was narrowed to provide for \"appellate jurisdiction on appeal from the Superior Courts[\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e] in all cases in equity, except such as arise in Justices' Courts; also, in all cases at law which involve the title or possession of real estate, or the legality of any tax, impost, assessment, toll, or municipal fine, or in which the demand, exclusive of interest, or the value of the property in controversy, amounts to two thousand dollars; also, in all such probate matters as may be provided by law; also, on questions of law alone, in all criminal cases where judgment of death has been rendered; the said court shall also have appellate jurisdiction in all cases, matters, and proceedings pending before a District Court of Appeal which shall be ordered by the Supreme Court to be transferred to itself for hearing and decision . . . .\" (Cal. Const. of 1879, art. VI, § 4, as amended Nov. 8, 1904.)\n\nThat which was taken from the Supreme Court's initial appellate jurisdiction, and more, was given to the appellate jurisdiction of the Courts of Appeal. Those courts were vested with \"appellate jurisdiction on appeal from the Superior Courts in all cases at law in which the demand, exclusive of interest, or the value of the property in controversy, amounts to three hundred dollars, and does not amount to two thousand dollars; also, in all cases of forcible entry and detainer (except such as arise in Justices' Courts), in proceedings in insolvency, and in actions to prevent or abate a nuisance; in proceedings of mandamus, certiorari, and prohibition,[\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e] usurpation of office, contesting elections and eminent domain, and in such other special proceedings as may be provided by law (excepting cases in which appellate jurisdiction is given to the Supreme Court); also, on questions of law alone, in all criminal cases prosecuted by indictment or information in a court of record, excepting criminal cases where a judgment of death has been rendered. The said courts shall also have appellate jurisdiction in all cases, matters, and proceedings pending before the Supreme Court which shall be ordered by the Supreme Court to be transferred to a District Court of Appeal for hearing and decision.\" (Cal. Const. of 1879, art. VI, § 4, as amended Nov. 8, 1904, italics added.)\n\n2. The right of appeal -- Gale and Sutter-Butte\n\nWe applied the 1904 version of former article VI, section 4, in Gale v. Tuolumne County Water Co. (1914) 169 Cal. 46, 145 P. 532 (Gale), another case essentially ignored by the lead opinion. Like Tyler, supra, 65 Cal. 28, Gale was an attempted appeal from a contempt judgment. And, as in Tyler, supra, the contemner in Gale asserted a constitutional right of appeal under former article VI, section 4, this time on the basis that the contempt judgment was appealable as being a \"'case in equity.'\" (Gale, supra, 169 Cal. at p. 51.) The Gale court accepted the premise that \"section 4 of article VI of the constitution . . . provides for an appeal from the superior court to the supreme court 'in all cases in equity except as arise in the Justices' courts,'\" but explained that a contempt proceeding is not a case in equity for purposes of the constitutional provision. (Gale, supra, 169 Cal. at p. 51.) The court conceded that \"the right of appeal\" is \"derived from our constitution\" (id. at p. 52), but observed that because \"the constitution nowhere, expressly or impliedly, gives a right of appeal in cases of contempt\" (ibid., italics added), the statute prohibiting appeal of contempt judgments (Code Civ. Proc., § 1222) did not conflict with former article VI, section 4, and was thus constitutional. (169 Cal. at p. 52.)\n\nGale is significant in two respects. First, it reconfirms the court's view (set out in Tyler, supra, 65 Cal. 28) that litigants were granted a constitutional \"right of appeal\" in matters within the appellate jurisdiction list of former article VI, section 4. Second, and again like Tyler, supra, Gale's analysis of the constitutional right of appeal disproves the lead opinion's thesis that the court used the term \"right of appeal\" loosely to describe a right of review either by discretionary writ or by appeal. As in Tyler, supra, 65 Cal. 28, the contemner in Gale already had a right to seek discretionary writ review. Accordingly, the Gale court spoke exclusively about what the lead opinion terms \"direct appeal,\" i.e., a right to review on the merits and a written opinion, when it discussed whether the contemner had a constitutional right of appeal.\n\nAlmost a decade later we again confirmed the existence and scope of the \"right of appeal\" in In re Sutter-Butte By-Pass Amendment (1923) 190 Cal. 532, 213 P. 974 (Sutter-Butte). Sutter-Butte was an appeal from a judgment concerning the legality of a tax assessment. As in the present case, the respondent moved to dismiss the appeal, citing a statute that expressly made such matters \"'final and conclusive,'\" and hence nonappealable. (Id. at p. 535, italics added.)\n\nAs noted above, the same italicized language had been long employed in Code of Civil Procedure, section 1222, and had been interpreted as precluding appeal of contempt judgments and yet permitting the opportunity to seek discretionary writ relief challenging such judgments. (See, e.g., Tyler, supra, 65 Cal. at pp. 32-33 (conc. opn. of Morrison, C.J.); Huerstal v. Muir, supra, 62 Cal. 479, 481, and cases cited.) Accordingly, as in Tyler, supra, and Gale, supra, 169 Cal. 46, the appellants in Sutter-Butte had a right to seek discretionary review to challenge the tax assessment.\n\nBut again, as in Tyler, supra, 65 Cal. 28, and Gale, supra, 169 Cal. 46, the appellants in Sutter-Butte, supra, 190 Cal. 532, declined to settle for a mere opportunity to seek discretionary and potentially summary writ review; instead, they asserted a constitutional right of appeal, and claimed the statute precluding appeal was unconstitutional. We found that the statute purported to forbid \"appeal,\" but concluded the statute violated former article VI, section 4, which expressly granted the Supreme Court appellate jurisdiction over, and therefore granted a right of appeal in, such litigation.\n\nThe appellants claimed the statute was unconstitutional on two grounds. They asserted \"that the validating proceeding provided for by the act in question is in its essence either a suit in equity or one at law involving the validity of an assessment and, therefore, falls within the appellate jurisdiction conferred upon this court and guaranteed to litigants by that constitutional provision which provides that this court shall have appellate jurisdiction 'on appeal from the superior courts . . . in all cases in equity . . .; also in all cases at law which involve the . . . legality of any tax, . . . assessment, etc. . . .' (Const., art. 6, § 4.)\" (Sutter-Butte, supra, 190 Cal. at p. 536.) We resolved the question as follows:\n\n\"It is the settled rule of law that if the right of appeal is constitutionally granted in any given case such right cannot be destroyed nor delimited by legislative enactment. 'The courts of this state derive their powers and jurisdiction from the constitution of the state. The constitutional jurisdiction can neither be restricted nor enlarged by legislative act. An attempt to take away from the courts judicial power conferred upon them by the constitution is void.' (Pacific Telephone etc. Co. v. Eshleman [(1913)] 166 Cal. 640, 690, 137 P. 1119 (conc. opn. of Sloss, J.), italics added.)[\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e] The case last cited, and other cases assembled and referred to therein, recognize that litigants have a constitutionally guaranteed right of appeal in all litigated matters within the express jurisdiction of appellate courts.\" (Sutter-Butte, supra, 190 Cal. at p. 536, italics added.)\n\nWe continued, in language relied on by plaintiffs in this case: \"And if the legislature cannot take away this right by direct enactment neither can it accomplish the same result by any indirect device. While the legislature has, ordinarily, the power to create a new remedy for the enforcement of a right or a defense against a wrong, it cannot, under the guise of creating a new statutory remedy, deprive a litigant of an existing constitutionally guaranteed right to defend, even unto a court of last resort, against the enforcement of an alleged right. This right to so defend, once existing, continues regardless of the form in which the legislature may cast the remedy. In other words, as was said in the case of People v. Perry [, supra,] 79 Cal. 105, 108, 21 P. 423: 'This court retains jurisdiction of the case, notwithstanding the legislature may have changed the procedure, enlarged the remedy and given it a new name. To hold otherwise would be to admit a power in the legislature to abridge our jurisdiction and to take from parties the right of appeal by the easy device of a change of procedure in many cases where the right and jurisdiction are unquestioned.'\" (Sutter-Butte, supra, 190 Cal. at pp. 536-537, italics added.)\n\nWe concluded that a \"right of appeal\" existed on the basis of both grounds advanced by the appellants, i.e., the underlying litigation was a case in equity and a case involving the legality of a tax or assessment.\n\nOn the first point, Sutter-Butte, supra, 190 Cal. at page 537 stated: \"In other words, the legislature cannot by the creation of a new remedy deprive this court of its constitutional grant of appellate jurisdiction if the right involved in the execution of the remedy is of a character which in its very essence is equitable and was of an equitable nature and character at the time of the adoption of the constitutional provision which gave to this court appellate jurisdiction over the subject matter of the remedy. It follows, therefore, that if the proceeding before us is included in that class of cases, in contradistinction to special proceedings, over which appellate jurisdiction has been given by the constitution the appellants have a constitutionally guaranteed right of appeal of which they cannot be deprived.\" (Italics added.) We concluded the action was not a \"special proceeding,\" and that it had the \"characteristics\" of a suit in equity. (Id. at pp. 537-538.)\n\nWe also observed that the appellants had a constitutional right of appeal because the action was \"well within the letter and spirit of the constitutional provision which grants to this court and guarantees to litigants the right, beyond legislative control, to an appeal in all cases, either at law or in equity, involving the validity of any tax or assessment.\" (Sutter-Butte, supra, 190 Cal. at p. 539.)\n\nIn the course of its analysis, the Sutter-Butte court further stressed that the constitutional right of appeal should be broadly construed and enforced so long as the \"substance\" of the matter appealed from falls within the scope of one of the categories listed in former article VI, section 4. This is so, the court said, even if \"at first blush\" the appeal does not appear to fall within the list of matters that are appealable under the section. (Sutter-Butte, supra, 190 Cal. at p. 538.)\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nThe lead opinion attempts to distinguish Sutter-Butte, supra, 190 Cal. 532, on two grounds. First it asserts that because the statute at issue in Sutter-Butte, supra, made the challenged decision \"'final and conclusive'\" (id. at p. 535), our decision in that case concerned a legislative scheme that, unlike the PRA, purported to preclude both review by appeal and review by writ. But Sutter-Butte is not thus distinguishable: As noted above, the quoted statutory phrase has long been construed as simultaneously barring appeal, and yet permitting review by discretionary writ.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nSecond, the lead opinion attempts to distinguish Sutter-Butte, supra, 190 Cal. 532, on the same ground on which it failed to distinguish Jordan, supra, 65 Cal. 644, and Perry, supra, 79 Cal. 105. It asserts that when the Sutter-Butte court repeatedly said the appellants had a constitutional \"right of appeal,\" it meant only that they had \"a right to some effective procedural vehicle by which to invoke the constitutionally conferred appellate jurisdiction\" (lead opn., ante, at p. 22) -- presumably, a right to seek discretionary writ review.\n\nThe posture of the Sutter-Butte litigation disproves the lead opinion's strained reading. As noted above, the appellants in Sutter-Butte, supra, 190 Cal. 532, like the would-be appellants in Tyler, supra, 65 Cal. 28, and Gale, supra, 169 Cal. 46, had a right to challenge the tax assessment by seeking a discretionary writ. Also like the contemners in Tyler and Gale, however, they were not content to settle for discretionary and potentially summary review, and instead asserted a right to \"appeal\" in the face of a statute that foreclosed review on appeal. In this context, when the Sutter-Butte court considered whether the appellants had a right of \"appeal,\" it could not possibly have intended to equate an opportunity to seek discretionary writ review, which right the appellants already had, with the right of \"appeal,\" which the appellants sought. Indeed, if, as the lead opinion claims, the Sutter-Butte court meant only that the appellants had \"a right to some effective procedural vehicle by which to invoke the constitutionally conferred appellate jurisdiction,\" it would have been unnecessary for the Sutter-Butte court to construe the statute as barring \"appeal,\" and to declare the statute unconstitutional. Under the lead opinion's construction, the Sutter-Butte court could have simply treated the purported \"appeal\" as a writ application. The fact that it did not do so, and instead declared unconstitutional the statute purporting to foreclose \"appeal,\" demonstrates when the Sutter-Butte court repeatedly said the appellants had a constitutional \"right of appeal,\" the court meant a right to obtain review on the merits and a written opinion, and not a mere right to seek discretionary writ review.\n\nF. The 1928 Amendments\n\n1. Appellate jurisdiction\n\nIn 1928, the provision of former article VI, section 4, governing the jurisdictional amount in controversy in the Supreme Court was eliminated. The provision otherwise retained \"appellate jurisdiction on appeal from the superior courts\" in the various matters listed in the 1904 amendment. The jurisdiction of the Courts of Appeal was set out in a new provision, former article VI, section 4b. The dollar amount provision giving rise to that court's jurisdiction was also eliminated, and replaced with a grant of \"appellate jurisdiction on appeal from the superior courts . . . in all cases at law in which the superior courts are given original jurisdiction . . . .\" The rest of the jurisdiction list was retained, and one new matter added, providing for jurisdiction in cases of \"removal from office.\"\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\n2. The right of appeal -- Byers, the Trede dictum, and Modern Barber\n\nThe first important case following the 1928 constitutional amendment was Byers v. Smith, supra, 4 Cal. 2d 209 (Byers), which concerned an appeal from a proceeding removing an official from public office. At issue was whether the Court of Appeal properly stayed execution of the judgment pending appeal. We concluded it properly issued the stay, and again followed the \"self-executing\" rationale of Jordan, supra, 65 Cal. 644, and expressly applied the holding of Sutter-Butte, supra, 190 Cal. 532: \"Where jurisdiction is conferred by the Constitution, the power is conferred to adopt such measures and rules as will render the constitutional grant effective and operative, otherwise the legislature might by mere inaction defeat the will of the people expressed in the fundamental law. But the legislature has not the power, either through direct enactment or indirect device, to destroy or abridge the right of an appeal constitutionally granted. ([Sutter-Butte, supra,] 190 Cal. 532.)\" (Byers, supra, 4 Cal. 2d at pp. 213-214, italics added.)\n\nEight years later, in Trede v. Superior Court (1943) 21 Cal. 2d 630, 134 P.2d 745 (Trede), we considered a writ proceeding in which the petitioner sought a stay pending appeal. Although the right of appeal was plainly not in issue (indeed, the applicable statute granted appeal), we nevertheless said, in a brief and ill-considered dictum that has gained currency through uncritical repetition: \"There is no constitutional right to an appeal; the appellate procedure is entirely statutory and subject to complete legislative control.\" (Id. at p. 634.) For this proposition, which clearly conflicts with all the foregoing case law and constitutional history, nothing was cited whatsoever.\n\nOrdinarily, such an abrupt and wholly unsupported dictum would be accorded the little weight it deserves. The lead opinion, however, embraces Trede's dictum as dispelling \"any lingering uncertainty about whether the 'appellate jurisdiction' provisions of the 1849 and 1879 Constitutions conferred on civil[\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e] litigants a right to direct appeal . . . .\" (Lead opn., ante, at p. 23.)\n\nThere was no \"uncertainty\" -- lingering or otherwise -- to dispel. As demonstrated above, neither the words of the drafters nor the subsequent decisions of this court provide any foundation for the lead opinion's premise that when the drafters and Justices of this court spoke of a litigant's \"right of appeal,\" they contemplated that the \"right of appeal\" did not guarantee review on the merits, but would instead be satisfied by affording a litigant the right to seek discretionary and potentially summary writ review.\n\nFive years after Trede, supra, we returned to the issue, again in dictum, this time in Modern Barber Col. v. Cal. Emp. Stab. Com., supra, 31 Cal. 2d 720 (Modern Barber). Because the City of Richmond relies heavily on Modern Barber, and despite the lead opinion's assertion that \"extensive analysis [of that case] is not warranted\" (lead opn., ante, at p. 27), a full description of the Modern Barber case is necessary.\n\nIn 1935, the Legislature enacted the Unemployment Insurance Act (Stats. 1935, ch. 352, p. 1226 et seq.), mandating that certain employers make contributions to a newly created unemployment fund. The California Employment Stabilization Commission (Commission) found the petitioner, the proprietor of a barber college, to be an employer under the act, and ordered him to make certain contributions pursuant to the act. Section 45.11(d) of the act barred writ review of the Commission's findings, forcing the petitioner to first make the challenged contributions and then sue to recover contributions made, after which review would be available on appeal. Despite this statutory scheme, the petitioner sought immediate writ relief, arguing his remedy on appeal was inadequate. He asserted a constitutional right to seek discretionary writ review.\n\nWe held that the Legislature could constitutionally bar the use of mandamus to challenge the tax before the taxpayer paid it, even though the Constitution granted this court original appellate jurisdiction to issue mandamus. (Modern Barber, supra, 31 Cal. 2d at pp. 726-727.) Modern Barber did not hold that the Legislature had precluded, or could preclude, a taxpayer from obtaining review on appeal of the validity of the tax in a post-payment tax refund proceeding. Instead, as noted, Modern Barber involved a purported right to seek and obtain discretionary writ relief.\n\nThe City of Richmond suggests that Modern Barber's Discussion of the Legislature's power to create and define statutory rights, and to specify the \"methods and means\" of enforcing those rights, sheds light on the present constitutional challenge to section 6259(c)'s provision for review exclusively by writ. In resolving the petitioner's writ application in Modern Barber, we rejected the argument that the power given to the courts to issue writs of mandate (under former art. VI, §§ 4, 4b \u0026 5) conferred on the petitioner a constitutional right to seek that relief in any case in which a court would deem such relief appropriate. We expressly rejected the argument that \"the Legislature has no power to define [or] curtail . . . the circumstances under which [such writs] may be issued\" (Modern Barber, supra, 31 Cal. 2d at p. 726), explaining:\n\n\"The fallacy in this argument lies in the failure to distinguish between jurisdiction to grant the remedy and the right which is to be vindicated. Except as the Constitution otherwise provides, the Legislature has complete power to determine the rights of individuals. (See Delaney v. Lowery [(1944)] 25 Cal. 2d 561, 568, 154 P.2d 674.) It may create new rights or provide that rights which have previously existed shall no longer arise, and it has full power to regulate and circumscribe the methods and means of enjoying those rights, so long as there is no interference with constitutional guaranties. . . . The mere statement in the Constitution that a court has the power to grant certain remedies, however, does not mean that the rights which those remedies were intended to protect have been fixed in the Constitution as of the time of its adoption and are thereafter immune from legislative change or regulation.\" (Modern Barber, supra, 31 Cal. 2d at pp. 726-727, first and second italics added, others in original.)\n\nWe went on to note: \"'Statutory changes are almost perpetual. New rights are created under which new equities arise. These make new cases in equity, of which the courts at once take cognizance. The jurisdiction of courts of equity is not thereby enlarged. Neither is it diminished when by statutory changes some rights cease to exist and certain cases which courts of equity once entertained can no longer arise . . . .'\" (Modern Barber, supra, 31 Cal. 2d at p. 728, quoting Spreckels v. Hawaiian Com. \u0026 Sugar Co. (1897) 117 Cal. 377, 381, 49 P. 353.)\n\nAs the City of Richmond suggests, this aspect of our Discussion in Modern Barber makes clear that the Legislature is free to create a new statutory scheme, or revise an existing one, in a way that defines rights and the method by which litigants may seek to vindicate those rights under the statutory scheme. Doubtless the Legislature has had this authority before and since Modern Barber. But, contrary to the City of Richmond's suggestion, this principle does not resolve the question in this case, because, by its own terms, Modern Barber makes clear that the Legislature may exercise its authority only insofar as it does not \"interfere[] with constitutional guarantees.\" That is precisely plaintiffs' claim here.\n\nThe City of Richmond also asserts Modern Barber stands for the proposition that there is no constitutional right of appeal, and hence section 6259(c) works no \"interference with constitutional guarantees.\" As explained below, although dictum in Modern Barber states there is no constitutional right of appeal, that dictum is of no weight.\n\nThe dictum in Modern Barber was as follows: \"The fallacy of petitioner's position is again exposed when we consider the law governing appeals. . . . In interpreting [former article VI, sections 4 and 4b], the courts have held that the Legislature has the power to declare by statute what orders are appealable, and unless a statute does so declare, the order is not appealable. (Gale v. Tuolumne County Water Co., [supra,] 169 Cal. 46, 145 P. 532; see Trede v. Superior Court, [supra,] 21 Cal. 2d 630, 634, 134 P.2d 745; cf. Byers v. Smith, [supra,] 4 Cal. 2d 209, 47 P.2d 705 [express constitutional right of appeal in cases involving removal from public office]; In re Sutter-Butte By-Pass Assessment, [supra,] 190 Cal. 532, 213 P. 974 [express constitutional right of appeal in cases involving legality of tax assessments].)\" (Modern Barber, supra, 31 Cal. 2d at p. 728, parenthetical statements in citations in original, italics added.)\n\nThere is an undeniable tension between Modern Barber's above italicized dictum and its simultaneous citations to and descriptions of Byers and Sutter-Butte, both of which, in the court's own words, involved an \"express constitutional right of appeal.\" On closer examination, the better argument rests with the latter cases, recognizing a constitutional right of appeal in some matters.\n\nAs the lead opinion recognizes, the first case cited in support of Modern Barber's dictum, Gale, supra, 169 Cal. 46, 50, involved an attempted appeal from a contempt judgment -- a matter that, by long-established authority, was not included in the grant of constitutional appellate jurisdiction under former article VI, section 4, and hence did not afford a constitutional right of appeal. (See, e.g., Tyler, supra, 65 Cal. 28, 30-31.) Indeed, as noted above, properly construed, Gale stands for the proposition that the Constitution confers a right of appeal -- but not from contempt judgments. The second case cited, Trede, supra, 21 Cal. 2d 28, 30-31, is discussed ante, at page 46. As noted there, Trede did not involve a matter over which the Legislature had barred appeal; instead, it was a writ proceeding in which the petitioner sought a stay pending a statutory appeal. Accordingly, neither Gale, supra, nor Trede, supra, stands for the broad proposition that the Legislature may control or ban appeals in any case in which it chooses, or that there is no constitutional right of appeal, i.e., review on the merits and a written opinion. Moreover, as noted above, the last two cases cited by Modern Barber -- Byers, supra, and Sutter-Butte, supra, both of which involved matters included in former article VI, sections 4 and 4b's lists of litigation giving rise to appellate jurisdiction -- hold just the opposite, i.e., there is a constitutional right of appeal in cases included in the \"appellate jurisdiction lists\" of former article VI, sections 4 and 4b.\n\nIn light of this analysis, Modern Barber, supra, 31 Cal. 2d 720, must be read consistently with Sutter-Butte, supra, 190 Cal. at pages 536-537, and Byers, supra, 4 Cal. 2d at pages 213-214, as standing for the proposition that the Legislature has authority to reshape and redefine statutory rights and remedies, \"so long as there is no interference with constitutional guaranties\" (Modern Barber, supra, 31 Cal. 2d at p. 726). This proviso, as noted in Sutter-Butte, supra, and as confirmed in Modern Barber, supra, contemplates a right of appeal -- i.e., review on the merits and a written opinion -- in certain matters within the constitutional appellate jurisdiction of the Courts of Appeal and this court, and it bars legislation that substantially interferes with that right.\n\nThe lead opinion's contrary and novel construction of Modern Barber is unpersuasive. It asserts that \"although [Modern Barber did not] purport[] to overrule our earlier decisions in Byers, supra, 4 Cal. 2d 209, and Sutter-Butte, supra, 190 Cal. 532, [it] did appear to suggest that the 'constitutional right of appeal' mentioned in those cases extended only to proceedings specifically mentioned in the constitutional grant of appellate jurisdiction, and not to proceedings encompassed by the jurisdictional grants phrased in more general terms.\" (Lead opn., ante, at p. 27, italics in original.)\n\nThis interpretation of the relevant constitutional provisions finds no support in the debates of 1849 or 1879, and it is directly contrary to Tyler, supra, 65 Cal. 28, at pages 29-30 (maj. opn.) and pages 31-33 (conc. opn. of Morrison, C.J.), in which we plainly stated that proceedings encompassed by the jurisdictional grants \"phrased in more general terms\" (i.e., \"criminal cases prosecuted by indictment or information\" or cases \"in which the demand . . . amounts to three hundred dollars\") did indeed trigger a constitutional right of appeal. Moreover, the lead opinion's construction mires itself in layers of unresolvable quandary.\n\nThe lead opinion's interpretation of Modern Barber, supra, 31 Cal. 2d 720, would mean that under present article VI, section 11, there is a constitutional right of \"direct appeal\" to this court in capital cases (but no others) because capital cases are still \"specifically mentioned in the constitutional grant of appellate jurisdiction.\" At the same time, however, the lead opinion insists that present article VI, section 11, merely \"serves to establish and allocate judicial authority, not to define or guarantee the rights of litigants. Indeed, the provision nowhere mentions direct appeals or a 'right of appeal.'\" (Lead opn., ante, at p. 4.) One of these propositions must be wrong. The lead opinion cannot infer from article VI, section 11, a right of \"direct appeal\" to this court in capital cases, and at the same time maintain that the same provision merely \"allocates judicial authority,\" and does not define or guarantee the rights of litigants.\n\nMoreover, if the lead opinion were to elect to resolve this dilemma consistently with its own suggested interpretation of Modern Barber, supra, 31 Cal. 2d 720, and hence acknowledge a constitutional right of appeal in capital cases, it would find itself in an even tighter spot. The first sentence of present article VI, section 11, grants exclusive jurisdiction to this court in capital cases; the second sentence grants to the Courts of Appeal exclusive jurisdiction over all noncapital judgments -- i.e., all other criminal judgments, and all civil judgments of the superior court.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e In regard to the respective courts' powers and litigants' rights, it is difficult to understand how the general constitutional grant of jurisdiction to the Courts of Appeal has an effect different from the specific grant of capital judgment jurisdiction to this court. In other words, if the lead opinion is willing to concede that the first sentence of article VI, section 11, by implication grants a right of appeal in capital cases within this court's appellate jurisdiction, why is it unwilling also to concede that the second sentence by implication grants a right of appeal in other litigation within the Court of Appeal's initial appellate jurisdiction? The lead opinion does not answer.\n\nThese substantial analytical problems arising from the lead opinion's interpretation of Modern Barber, supra, 31 Cal. 2d 720, can be avoided by simply construing that case consistently with the case law that preceded it -- in other words, as recognizing a right of appeal (meaning a right to review on the merits and a written opinion) in certain matters within the constitutional appellate jurisdiction of the Courts of Appeal and this court. As explained above, Modern Barber properly should be so construed. (See ante, at p. 51.)\n\n3. Post-Modern Barber case law\n\nUnfortunately for the development of the law in this area, some decisions since Trede and Modern Barber have uncritically repeated the dicta of those cases to the effect that there is no constitutional right of appeal. (See, e.g., Agricultural Labor Relations Bd. v. Tex-Cal Land Management, Inc. (1987) 43 Cal. 3d 696, 705, 238 Cal. Rptr. 780, 739 P.2d 140; Steen v. Fremont Cemetery Corp. (1992) 9 Cal. App. 4th 1221, 1226; In Re Taya C. (1991) 2 Cal. App. 4th 1, 6-7; County of Monterey v. Mahabir (1991) 231 Cal. App. 3d 1650, 1653, 282 Cal. Rptr. 924; Reisman v. Shahverdian (1984) Cal. App. 3d 1074, 1088; Agricultural Labor Relations Bd. v. Abatti Produce, Inc. (1985) 168 Cal. App. 3d 504, 509, 214 Cal. Rptr. 283, disapproved on other grounds in Agricultural Labor Relations Bd. v. Tex-Cal Land Management, Inc., supra, 43 Cal. 3d 696, 699; Woodman v. Ackerman (1967) 249 Cal. App. 2d 644, 649, 57 Cal. Rptr. 687; In re Conley (1966) 244 Cal. App. 2d 755, 759, 53 Cal. Rptr. 321; City of Los Angeles v. Schweitzer (1962) 200 Cal. App. 2d 448, 452, 19 Cal. Rptr. 429; Efron v. Kalmanovitz (1960) 185 Cal. App. 2d 149, 157, 8 Cal. Rptr. 107.) When this progeny is presented as a string citation in briefs or judicial opinions, it conveys an illusion of solid authority. As explained below, however, all of these cases are distinguishable, and in each the statement is misleading dictum. As the lead opinion concedes (lead opn., ante, at p. 30), none of the cases involved a legislative attempt to bar appellate review (i.e., review on the merits and a written opinion) of a final judgment of the superior court and to relegate litigants to discretionary and summary writ review.\n\nMost of the cited cases involved nothing more than an attempt by a litigant to take an interlocutory appeal. (Steen v. Fremont, supra, 9 Cal. App. 4th 1221, 1226-1230; In re Taya C., supra, 2 Cal. App. 4th 1, 5-6; Woodman v. Ackerman, supra, 249 Cal. App. 2d 644, 649; City of Los Angeles v. Schweitzer, supra, 200 Cal. App. 2d 448, 452; Efron v. Kalmanovitz, supra, 185 Cal. App. 2d 149, 157.) It has been long established, however, that there is no constitutional right to do so.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e Other cases are distinguishable on other grounds. In County of Monterey v. Mahabir, supra, 231 Cal. App. 3d 1650, 1652, the purported appellant waived its right to appeal an award of attorney fees when it voluntarily dismissed the underlying action with prejudice. The court in In re Conley, supra, 244 Cal. App. 2d 755, 761, dismissed a purported appeal from the juvenile court in a case concerning Vehicle Code infractions -- litigation over which the Constitution has never provided for an appeal to the appellate court. (See post, fn. 45.) In the remaining cases (Agricultural Labor Relations Bd. v. Tex-Cal Land Management, Inc., supra, 43 Cal. 3d at p. 705; Agricultural Labor Relations Bd. v. Abatti Produce, supra, 168 Cal. App. 3d 504 [disapproved in Tex-Cal, supra]; Reisman v. Shahverdian, supra, Cal. App. 3d 1074, 1088), appeal was granted by statute.\n\nThe significance of the statements made in these cases is further eroded by the fact that with one distinguishable exception the decisions do not even mention article VI, section 11, or its predecessor, former article VI, sections 4 or 4b.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nIn addition, a number of cases have included statements to the effect that the Legislature has complete power to regulate appeals. Some assert the Legislature has complete power over appellate rights.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e Others state the Legislature has power to decide what \"orders\" are appealable,\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e or that an order is not appealable unless declared to be so by the Constitution or by statute.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e Some assert the Legislature has power to decide what \"judgments\" are appealable.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e And there are cases stating the Legislature has power to withdraw the right of an appeal by retroactive legislation, thus destroying the right to an appeal already taken.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nLike the cases asserting in dicta that there is no constitutional right of appeal, each of these cases is distinguishable.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e None concerned a legislative attempt to substitute review by discretionary and potentially summary writ for review by appeal in litigation falling within the constitutional \"appellate jurisdiction\" of this court or the Courts of Appeal, and hence the broad statements, although correct on the facts of each case, do not apply to the present situation. And again, the significance of these cases is further diminished by the fact that none even mentions the relevant constitutional provision, article VI, section 11, or its predecessor, article VI, former sections 4 or 4b.\n\nG. The 1966 constitutional revisions\n\nArticle VI, former sections 4, 4b, and 5, remained essentially unchanged between 1928 and 1966. In 1966, on the recommendation of the California Constitution Revision Commission, the voters adopted present article VI, which as noted above covers the original ( § 10) and appellate ( § 11) jurisdiction of the courts. Before addressing the effect of the revisions, at this point it is helpful to summarize the decisions construing article VI, former sections 4 and 4b.\n\nSetting aside the unsupported dicta in Trede, supra, 21 Cal. 2d 630, and its progeny, the historical record of the debates considered in conjunction with the decisions construing former article VI, sections 4 and 4b, establishes the following propositions: First, the provisions established the appellate jurisdiction of the courts, and imposed a constitutional duty on the part of the appellate court to entertain an appeal within the court's appellate jurisdiction (Jordan, supra, 65 Cal. 644, 646). Second, the provisions also established a litigant's constitutional \"right of appeal\" (e.g., Sutter-Butte, supra, 190 Cal. 532, 536, 537, 539; see also Tyler, supra, 65 Cal. 28, 29-30 (maj. opn.) \u0026 31-33 (conc. opn. of Morrison, C.J.)) -- i.e., a right to obtain review on the merits and a written opinion. Third, although the Legislature may impose reasonable regulations and procedures governing a litigant's constitutional right of appeal, it has no power to provide by statute that an appeal may not be taken from a final judgment in a case in which the Constitution grants appellate jurisdiction to the Courts of Appeal or this court (Sutter-Butte, supra, 190 Cal. 532, 536, 537, 539; Byers, supra, 4 Cal. 2d 209, 214; see also Modern Barber, supra, 31 Cal. 2d 720, 728), nor may the Legislature \"substantially impair\" the right of appeal (Haight v. Gay, supra, 8 Cal. 297, 300; In re Jessup, supra, 81 Cal. 408, 470).\n\n1. Appellate jurisdiction under the 1966 revisions\n\nIn 1963, the Legislature established the California Constitution Revision Commission to refine and propose revisions to the Constitution. (See Cal. Const. Revision Com., Proposed Revision (Feb. 1966), at p. 12.) As we have observed, the drafters \"contemplated few substantive changes in article VI.\" (Mosk v. Superior Court (1979) 25 Cal. 3d 474, 496, 159 Cal. Rptr. 494, 601 P.2d 1030.)\n\nWhen the commission turned its attention to the appellate review sections of article VI, it proposed to vest the Courts of Appeal with direct appellate jurisdiction and to make the appellate jurisdiction of the Supreme Court \"discretionary, except in death penalty cases, thereby conforming to a long-standing practice of the Supreme Court to refer the types of cases enumerated in the existing Section 4 to district courts of appeal.\" (Cal. Const. Revision Com., Proposed Revision, supra, at p. 81.)\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e The commission then proposed to streamline the appellate jurisdiction provisions of former sections 4, 4b, 4e,\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e and 5, into a new article VI, section 11, which was ultimately adopted by the voters in November 1966. As noted above, article VI, section 11 vests this court with \"appellate jurisdiction when judgment of death has been pronounced. With that exception courts of appeal have appellate jurisdiction when superior courts have original jurisdiction[\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e] and in other causes prescribed by statute. . . .\"\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\nThe commission staff's comment regarding the proposed change noted: \"Some of the existing sections contain detailed references to instances of appellate jurisdiction. The commission deleted those references as unnecessary in the Constitution except in death penalty cases where, because of the extreme nature of the penalty, jurisdiction was given to the Supreme Court.\" (Cal. Const. Revision Com., Proposed Revision, supra, at p. 91.)\n\n2. The right of appeal under the 1966 revisions -- Hawes\n\nNothing in the working documents of the commission, or its report to the Legislature, suggests that it addressed, much less intended to modify, the established principle that the constitutional grant of appellate jurisdiction also confers a litigant's right of appeal. Nor did the ballot materials submitted to the voters suggest the proposed new section yielded any such change. (Ballot Pamp., Prop. 1-a, General Elec. (Nov. 8, 1966) pp. 1-2; see generally Hill v. National Collegiate Athletic Assn. (1994) 7 Cal. 4th 1, 16, 865 P.2d 633 [examining ballot pamphlet to determine voters' intent].)\n\nThe lead opinion's review of the 1966 revisions conveniently fails to acknowledge that, as noted above, the drafters \"contemplated few substantive changes in article VI.\" (Mosk v. Superior Court, supra, 25 Cal. 3d 474, 496, 159 Cal. Rptr. 494, 601 P.2d 1030.) Certainly, the drafters would have considered abrogation of the constitutional right of appeal -- a right recognized in at least seven prior decisions of this court and repeatedly emphasized by the 1849 and 1879 convention delegates -- as a \"substantive change.\" It therefore seems patent that the drafters did not intend to abrogate that established right sub silentio. Nor would it be reasonable to conclude that the drafters unintentionally abrogated the right. Clearly, then, \"the right of appeal\" \"survived\" the 1966 revision of article VI.\n\nThe lead opinion asserts it finds no decision after 1966, \"affirming the existence of a 'right of appeal' under the State Constitution, nor do we find references to the 'appellate jurisdiction' provision as limiting the Legislature's authority to determine which superior court judgments and orders are reviewable by direct appeal and which by extraordinary writ or other mode of review.\" (Lead opn., ante, at p. 29.) Addressing the second point first, it is obvious why the lead opinion has found no case addressing whether the Legislature may constitutionally substitute discretionary writ review for review on appeal of an entire cause of action: There has never been such a decision (before or after 1966) because, with the possible exception of a few narrow statutes listed post, at page 81, the Legislature has heretofore not acted as it has done in this case, i.e., barred appeal and substituted discretionary writ review as the sole means of reviewing a judgment of the superior court resolving a cause of action within the original jurisdiction of the superior court.\n\nOn the first point, the lead opinion overlooks a key Court of Appeal decision rendered after the 1966 revision of article VI, and consistent with the proposition that the Constitution continues to afford a right of appeal in cases like this. In People v. Hawes (1982) 129 Cal. App. 3d 930, 181 Cal. Rptr. 456, the defendant -- a district attorney -- was removed from office on charges of misconduct. He appealed, and the People moved to dismiss the appeal on the ground it was not authorized by statute.\n\nThe Court of Appeal held the appeal authorized by article VI, section 11, of the Constitution. It noted that appellate jurisdiction over removal proceedings was expressly granted to the Courts of Appeal in the 1928 amendment to former article VI, section 4b, and that we held in Byers, supra, 4 Cal. 2d 209, 214, that under the former section \"the constitutional grant of appellate jurisdiction . . . was self-executing, not dependent for its vitality on the existence of implementing legislation.\" (Hawes, supra, 129 Cal. App. 3d at p. 934.) The court also observed that the ballot materials submitted to the voters concerning the 1966 revision suggested no \"design . . . to alter the scope of appellate jurisdiction over removal proceedings as conferred by its predecessor,\" and that the language of the revision \"reveals no intent to diminish the compass of appellate jurisdiction in respect to removal proceedings and we are satisfied that none was intended. Elimination of express mention of removal proceedings from the 1966 revision had no substantive effect as removal proceedings are clearly encompassed within the general language of the 1966 revision.\" (Id. at p. 935.)\n\nThe Hawes court concluded: \"Under article VI, section 11, except where judgment of death has been pronounced, the Court of Appeal has appellate jurisdiction when superior courts have original jurisdiction. The superior court has original jurisdiction over the trial of an accusation [citation]. We conclude jurisdiction over this appeal is authorized by California Constitution, article VI, section 11. That provision is self-executing (Byers v. Smith, supra, 4 Cal. 2d at pp. 213-214).\" (Hawes, supra, 129 Cal. App. 3d at p. 935.)\n\nThe fact that the court went on to note that \"in addition to constitutional jurisdiction,\" there was, contrary to the People's view, \"statutory authorization for the defendant's appeal\" (129 Cal. App. 3d at p. 935), does not diminish the clear thrust of the Hawes opinion. After acknowledging the statutory authorization, the court reaffirmed that in the matter before it, \"no statutory authority [for appeal] was required (Byers v. Smith, supra, 4 Cal. 2d at pp. 213-214).\" (Hawes, supra, 129 Cal. App. 3d at p. 936.) When we read Hawes as a whole, it reiterates, under the 1966 revisions, the holding of Byers, supra, 4 Cal. 2d 209, that in matters over which \"[appellate] jurisdiction is conferred by the Constitution\" (id. at p. 213) the Constitution grants a \"right of an appeal\" (id. at p. 214) that must be afforded whether or not there is statutory authority for the appeal.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\n\nThe lead opinion then turns to a sampling of the numerous cases cited ante, at pages 53-58, in which this court or the Court of Appeal has said \"there is no constitutional right of appeal and that the right of appeal is wholly statutory in origin.\" (Lead opn., ante, at pp. 29-30; see also id. at pp. 27-28.) The lead opinion \"recognizes that none of these cases is directly on point,\" but asserts \"they nonetheless represent a significant consensus of judicial thinking on this topic over the past 30 years.\" (Lead opn., ante, at p. 30.)\n\nThese cases, far from representing a consensus of \"judicial thinking,\" are instead examples of something that courts should avoid. They are but mechanical incantations of a so-called \"rule\" without bothering to consider whether it is supported by anything other than a prior opinion that said the same thing. (See Hyde v. United States (1912) 225 U.S. 347, 391, 56 L. Ed. 1114, 32 S. Ct. 793 (dis. opn. of Holmes, J.) [observing that \"ideas become encysted in phrases and thereafter for a long time cease to produce further analysis\"].) As noted above, with one easily distinguishable exception none of the listed cases even cited the relevant portions of the state Constitution that it purported to construe. (See ante, fn. 34.) In short, the cited cases are examples of judicial regurgitation, not judicial thinking.\n\nNext, the lead opinion \"also notes that courts in other states with constitutions containing 'appellate jurisdiction' provisions similar to article VI, section 11, . . . have rejected the contention that this language confers on litigants a right of direct appeal. (See, e.g., Appeal of O'Rourke (1974) 300 Minn. 158 [220 N.W.2d 811] .)\" (Lead opn., ante, at p. 30.)\n\nBy focusing on Minnesota, the lead opinion conveniently ignores the best and most compelling out-of-state evidence. As explained above, our 1849 \"appellate jurisdiction\" provision was modeled after the 1845 Louisiana Constitution. The record of the Louisiana debates shows that the delegates intended their provision to grant a right of appeal. Moreover, since 1876 the Louisiana courts have construed their provision as granting a right of appeal, meaning a right to review on the merits. (See ante, at pp. 17-19.) Instead of acknowledging this significant point, the lead opinion casts about for case law in harmony with its reconstructed view of California constitutional history and case law. As explained below, however, there are numerous problems with the lead opinion's reliance on Appeal of O'Rourke.\n\nAs a initial matter, it may be questioned whether the \"appellate jurisdiction\" provisions of the California and Minnesota Constitutions are in fact analogous,\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e and whether, given the procedural posture of the purported appeal in Appeal of O'Rourke (Minn. 1974) 300 Minn. 158, 220 N.W.2d 811 (O'Rourke), that decision is persuasive authority for the question posed here.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e More important, however, assuming these significant threshold problems may be overlooked, O'Rourke itself demonstrates that Minnesota's interpretation of its appellate jurisdiction provision is inapposite and unpersuasive authority in this case.\n\nFirst, the court in O'Rourke, supra, 220 N.W.2d 811, was not faced with a record showing the drafters' intent that the Minnesota provision established a litigant's right of appeal. Second -- and again, unlike California -- O'Rourke, supra, makes it clear that earlier Minnesota case law construing the appellate jurisdiction provision did not find a right of appeal (i.e., review on the merits and a written opinion), but instead, only the right to seek discretionary review in the nature of certiorari. (See cases discussed in O'Rourke, supra, 220 N.W.2d 811, at pp. 818-820; see also id. at p. 821, fn. 12.) Indeed, in summarizing the relevant cases, the O'Rourke court explained they \"demonstrate that the court was asserting its constitutionally independent power of review, subject to reasonable legislative regulation, as distinguished from admitting its constitutional duty to accept an appeal in any case.\" (Id. at p. 818, italics in original.)\n\nThe California cases on this crucial latter point are precisely opposite: In Jordan, supra, 65 Cal. at page 646, we construed our appellate jurisdiction provision (former art. VI., § 4) as self-executing, and said: \"When a certain jurisdiction has been conferred on this or any court, it is the duty of the court to exercise it; a duty of which is not relieved by the failure of the legislature to provide a mode for its exercise.\" (65 Cal. at p. 646, italics added; see also Byers, supra, 4 Cal. 2d at pp. 213-214 [appellate jurisdiction provision is self-executing]; Hawes, supra, 129 Cal. App. 3d 930, 935 [same].)\n\nFor these reasons, the lead opinion's reliance on out-of state cases such as O'Rourke, supra, 220 N.W.2d 811, is misplaced.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\nNext, although it finds for litigants no right of appeal in article VI, section 11, the lead opinion acknowledges that the provision imposes some \"restrictions on the Legislature's authority to allocate appellate review as between direct appeals and extraordinary writ petitions.\" (Lead opn., ante, at p. 30.) The lead opinion proceeds to address that issue, however, only from the perspective of the power of courts, and not from the perspective of the rights of litigants. It asserts: \"If it could be demonstrated in a given case, or class of cases, that, for whatever reason, the Courts of Appeal or this court could not effectively exercise the constitutionally granted power of appellate review by an extraordinary writ proceeding, then such a proceeding could not constitutionally be made the exclusive mode of appellate review.\" (Ibid., italics added.)\n\nAs the lead opinion recognizes immediately thereafter, however, \"no such claim is made here\" (lead opn., ante, at p. 30), and thus the last quoted passage does not address the question posed in this case. The sole issue raised by plaintiffs is whether their constitutional rights are satisfied when they are relegated to review by discretionary writ. Plaintiffs do not claim section 6259(c) precluded the Court of Appeal from reviewing the matter on the merits and issuing a written opinion; instead, their claim is based on the fact that section 6259(c) does not guarantee such review.\n\nAlthough it faults the Concurring opinion for avoiding the difficult constitutional issue addressed herein (lead opn., ante, at pp. 36-37), the lead opinion itself never clearly analyzes whether plaintiffs have a constitutional right under article VI, section 11, to review on the merits and a written opinion. On the latter point, the lead opinion's resolution of the issue is patently unacceptable: It simply ignores plaintiffs' claimed right to a written opinion. On the former point (right to merit review) the lead opinion implies the issue need not be resolved because general principles of writ jurisprudence guarantee a right to merit review on petition for extraordinary writ in PRA disclosure cases. As explained below, this purported holding is foreclosed by the legislative history of section 6259(c).\n\nThe lead opinion announces: \"When an extraordinary writ proceeding is the only avenue of appellate review, a reviewing court's discretion is quite restricted. Referring to the writ of mandate, this court has said: \"'Its issuance is not necessarily a matter of right, but lies rather in the discretion of the court, but where one has a substantial right to protect or enforce, and this may be accomplished by such a writ, and there is no other plain, speedy and adequate remedy in the ordinary course of law, he [or she] is entitled as a matter of right to the writ, or perhaps more correctly, in other words, it would be an abuse of discretion to refuse it.'\" [Citations.] Accordingly, when writ review is the exclusive means of appellate review of a final order or judgment, an appellate court may not deny an apparently meritorious writ petition, timely presented in a formally and procedurally sufficient manner, merely because, for example, the petition presents no important issue of law or because the court considers the case less worthy of its attention than other matters.\" (Lead opn., ante, at p. 35, italics added.)\n\nAs explained, post, footnote 55 and page 81, there are very few statutory schemes in which \"writ review is the exclusive means of appellate review of a final order or judgment\" of the superior court. Assuming the lead opinion's assessment of writ jurisprudence is correct as to those few other schemes -- and hence litigants seeking discretionary writ relief under such schemes have a general \"writ law\"-based right to review on the merits -- it does not follow that the same general principle applies in the context of the PRA.\n\nIt is not surprising that the lead opinion cites no authority for its italicized statement, because there is none. Neither party in this case argues that plaintiffs had a right, under general principles of writ law, to guaranteed merit review of their earlier writ petition to the Court of Appeal. In fact, although the precise issue raised here has been twice previously before this court, no party or amicus curiae has ever suggested what the lead opinion asserts, i.e., that general principles of writ jurisprudence guarantee merit review of a discretionary writ petition under section 6259(c).\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e It is clear why no prior judicial decision and no prior PRA litigant has advanced the lead opinion's novel theory: The legislative history of section 6259(c) forecloses it.\n\nAs we noted in Times-Mirror, supra, 53 Cal. 3d 1325, the Legislature did not intend to guarantee review on the merits in PRA litigation, and in fact contemplated that \"writ review might occasionally result in a summary denial rather than an adjudication on the merits.\" (Id. at p. 1335, italics added.) Analyses prepared by the Judiciary Committees of both houses of the Legislature in 1984 and 1990 confirm Times-Mirror's assessment of the Legislature's intent.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e Indeed, even the history selectively relied on by the lead opinion proves that point. As the lead opinion concedes, an analysis prepared for the Assembly Judiciary Committee explains the amendment was designed to \"clarify[] that courts can rule quickly on substantive issues.\" (Assem. Com. on Judiciary, Background Sheet re: Sen. Bill No. 2272 (1989-1990 Reg. Sess.) June 8, 1990, italics added.) If the drafters intended to convey the idea that writ review would be guaranteed rather than merely permitted, they would have used a mandatory word like \"must\" instead of the permissive word \"can.\"\n\nGiven this history, the lead opinion cannot reasonably purport to hold that litigants in PRA disclosure matters have a right, found in general principles of writ jurisprudence, to have discretionary writ petitions under section 6259(c) reviewed on the merits. The legislative history -- from all four Judiciary Committees that considered the 1984 provision and the 1990 amendment -- discloses that, at most, the Legislature intended not to preclude, but to allow review on the merits; it did not intend to guarantee review on the merits, but instead understood that writ review might occasionally result in a denial without adjudication on the merits. (Times-Mirror, supra, 53 Cal. 3d 1325, 1335.)\n\nIf a right to merit review in PRA disclosure cases is to be found, it must rest on a constitutional basis. For the reasons outlined above, the lead opinion errs by failing to recognize a litigant's constitutional right of appeal, i.e., a right to review on the merits and a written opinion.\n\nMoreover, the lead opinion's Conclusion creates a special anomaly in this case. Under its novel theory, plaintiffs had a general \"writ law\"-based right to merit review when they earlier sought discretionary writ relief in the Court of Appeal. But because the lead opinion erroneously ignores the second aspect of plaintiffs' constitutional claim (their right to a written opinion) neither plaintiffs, nor this court, can know whether plaintiffs actually received the merit review to which they are entitled, or, just as important, whether the Court of Appeal's merit review (assuming it occurred) was legally correct. Plaintiffs in this and future cases are implicitly told to simply trust that the Court of Appeal has engaged in, and will engage in, legally correct merit review. As explained above, the right to a written opinion with reasons stated was enshrined in the Constitution to avoid just this kind of unseemly consequence.\n\nIn summary, the lead opinion would allow the Legislature to transform this Court and the Courts of Appeal into writ courts exclusively, so long as the power of the courts is not significantly impaired -- a caveat that, under the lead opinion's analysis, affords no protection for litigants' rights. As noted above, under the lead opinion's analysis, there is no principled reason why this rule would not apply even to defendants convicted of capital crimes. Moreover, under the lead opinion's analysis, the same rule would also apply to all civil litigants. Accordingly, neither a defendant ordered to pay damages in a contract dispute, nor a probate plaintiff who unsuccessfully challenges a will, nor a defendant ordered to pay punitive damages, nor a plaintiff whose meritorious civil rights claim is erroneously rejected, nor a governmental entity ordered to disclose documents under the PRA, would have a constitutional right to appeal the adverse judgment of the superior court. We should reject this radical position, and conclude, in light of the foregoing history and case law, that article VI, section 11 of the California Constitution grants a constitutional right to review on appeal -- i.e., review on the merits and a written opinion -- of judgments that arise from the original jurisdiction of the superior court.\n\nIV. APPLICATION OF THESE PRINCIPLES TO THIS CASE\n\nA. The right of appeal in the present case\n\nThe present litigation arose from the original jurisdiction of the superior court, and is hence within the appellate jurisdiction of the Court of Appeal and this court. (See Cal. Const., art. VI, § 11.) It is not a matter over which the Constitution has traditionally declined to authorize appeal (e.g., appeals from contempt judgments,\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e habeas corpus proceedings,\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e and inferior courts\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e) nor is it a matter involving review of interim rulings\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e or determination of discrete preliminary issues, rather than review of an entire cause of action.\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e\n\nThe Concurring opinion would add one further exception to this list. It concludes that PRA actions such at this are properly within the class of matters over which there is no right to review on appeal. (See conc. opn. at pp. 10-13.) It fails, however, to provide a basis for its proposed holding.\n\nBefore revision of article VI in 1966 and adoption of the PRA in 1968, actions such as the present one were routinely treated as within the constitutional appellate jurisdiction of the Courts of Appeal and this court. Under century-old statutes governing public records disclosure that preceded the PRA,\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e litigants sought from the superior courts writs of mandate directing disclosure of public information, and the Courts of Appeal and this court routinely entertained appeals from superior court judgments granting or denying writs of mandate in such cases.\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e After revision of article VI in 1966 and enactment of the PRA in 1968,\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e and until adoption of section 6259(c) in 1984, the Courts of Appeal continued to routinely entertain appeals from superior court judgments granting or denying writs of mandate in such cases.\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e\n\nThus, our decisions have long treated \"public records cases\" as giving rise to direct appeals -- unlike the types of actions in the cases relied on by the Concurring opinion. Tyler, supra, 65 Cal. 28, and In re Crow (1971) 4 Cal. 3d 613, 94 Cal. Rptr. 254, 483 P.2d 1206, found no right of appeal because our Constitution and case law have, since the earliest days of statehood, treated judgments of contempt, and applications for a writ of habeas corpus, as not subject to appeal. Reliance on these cases is thus inappropriate because they involve actions whose constitutional and statutory history is wholly different from that of PRA actions.\n\nThe Concurring opinion also relies on three cases involving review of \"certain discrete issues arising\" during the course of litigating an underlying cause of action. (Conc. opn., ante, at pp. 11-12, italics added, citing McCorkle v. City of Los Angeles, supra, 70 Cal. 2d 252, 257 (McCorkle); People v. Brown, supra, 6 Cal. 4th 322, 334-335 (Brown); People v. Chi Ko Wong, supra, 18 Cal. 3d 698, 709-714 (Chi Ko Wong).)\n\nIn each case, a preliminary issue unrelated to the substantive merits of the underlying cause of action was made reviewable by discretionary writ and not on appeal (even from a subsequent final judgment). The statute in McCorkle, supra, 70 Cal. 2d 252, barred review on appeal of the preliminary issue whether personal jurisdiction was established; the statute in Brown, supra, 6 Cal. 4th 322, barred review on appeal of the preliminary issue whether the trial court should have disqualified itself on a statutory ground, and the statute in Chi Ko Wong, supra, 18 Cal. 3d 698, barred review on appeal of the preliminary issue whether a defendant was properly held fit for trial in superior court. (See ante, fn. 55.)\n\nThe present case does not involve review of a ruling on a discrete, preliminary issue unrelated to the substantive merits of the underlying PRA litigation. It instead involves the very heart of the cause of action: Are plaintiffs entitled to the disclosure they seek?\n\nThe cases and statutory schemes relied on by the Concurring opinion are thus inapposite. None of them involves Disposition of a cause of action traditionally entitled to review on direct appeal. None of them supports the Concurring opinion's position that the Legislature may, at its own discretion, constitutionally foreclose review on appeal of an entire cause of action for disclosure of documents under the PRA.\n\nBecause (i) the present litigation arose from the original jurisdiction of the superior court, (ii) the \"public records cases\" have never, in over 100 years, been treated as a matter over which the Constitution has declined to authorize appeal, and (iii) the PRA litigation at issue here concerns review of an entire cause of action rather than mere interim rulings or determination of discrete preliminary issues unrelated to the substantive merits of an underlying cause of action, it follows that plaintiffs have a constitutional right of appeal -- i.e., review on the merits and a decision in writing with reasons stated -- from the judgment of the superior court denying their application for a writ of mandate seeking disclosure of public information under the PRA.\n\nB. Constitutional validity of section 6259(c) on its face and as applied in this case\n\nAs an initial matter there is no basis in logic or fact for the lead opinion's assertion that \"the Legislature's reason for eliminating appeals is readily apparent. Had the Legislature not abolished direct appeals in PRA cases, parties seeking review by extraordinary writ would be required in each case to demonstrate the inadequacy of appeal. . . .\" (Lead opn., ante, at p. 34.) The Legislature could have easily avoided this problem by simply specifying that a litigant would be permitted to opt for writ review in lieu of appeal, or that a litigant would be permitted to appeal only if review by writ was first sought and denied summarily. (Cf. Welf. \u0026 Inst. Code, § 366.26, as amended by Stats. 1994, ch. 1007, eff. Jan. 1, 1995.) Alternatively, the Legislature could have given PRA appeals priority, or, as one of the interested entities commenting on the amendment of section 6259(c) in 1990 suggested, it could have specified that appellate review would be available, albeit without an automatic stay of disclosure pending filing of an appeal. (See Assem. Com. on Judiciary, Analysis of Sen. Bill No. 2272 (1989-1990 Reg. Sess.) Aug. 15, 1990, p. 3; Sen. Com. on Judiciary, Analysis of Sen. Bill No. 2272 (1989-1990 Reg. Sess.) Apr. 3, 1990, p. 4.) Contrary to the lead opinion's assertion, the Legislature was not \"forced\" to eliminate \"direct appeals\" in order to achieve its goal.\n\nIn any event, the Legislature decided that actions under the PRA should be subject to immediate and final review by extraordinary writ. Of course, it is our duty to honor, insofar as permitted by the Constitution, the Legislature's intent in that regard. (See, e.g., Brockett v. Spokane Arcades, Inc. (1985) 472 U.S. 491, 504, 506, 86 L. Ed. 2d 394, 105 S. Ct. 2794 [applying \"normal rule that partial, rather than facial, invalidation is the required course,\" and severing from overbroad statute any meaning that would result in unconstitutional application; court noted such \"partial invalidation\" was consistent with legislative intent]; Barrows v. Municipal Court (1970) 1 Cal. 3d 821, 827-828, 83 Cal. Rptr. 819, 464 P.2d 483 [construing otherwise valid statute as inapplicable to constitutionally protected conduct]; In re Cox (1970) 3 Cal. 3d 205, 223, 90 Cal. Rptr. 24, 474 P.2d 992 [same]; People v. Freeman (1988) 46 Cal. 3d 419, 424, 250 Cal. Rptr. 598, 758 P.2d 1128 [same].)\n\nThe Legislature's goals can be achieved by construction of the statute without destroying the constitutional right of appeal. I would find no facial constitutional infirmity insofar as section 6259(c) requires all litigants who seek review on appeal of a superior court order granting or denying a writ of mandate or prohibition in an action for disclosure under the PRA to first timely seek writ review as described in section 6259(c). As a practical matter, most litigation under the PRA would come to a speedy and final resolution at that stage.\u003cspan class=\"fnref\"\u003e60\u003c/span\u003e If a litigant neglects to seek writ review or to present to the Court of Appeal an adequate record supporting the claim for relief, or if, on writ review in the Court of Appeal, the litigant is afforded the substance of the procedural protections to which he or she would be entitled on appeal (i.e., review on the merits and a decision in writing with reasons stated), that litigant may properly be precluded by section 6259(c) from subsequently pursuing the same challenge on appeal.\n\nIn other words, the Legislature may place conditions on the constitutional right of appeal. The construction described above (akin to an \"exhaustion\" requirement) advances the Legislature's legitimate interest in speeding review in PRA disclosure actions while constituting an insubstantial legislative impairment of the right. (Cf. Welf. \u0026 Inst. Code, § 366.26, as amended by Stats. 1994, ch. 1007, eff. Jan. 1, 1995 [enacting \"exhaustion\" requirement as condition of appeal, as suggested in In re Matthew C., supra, 6 Cal. 4th at p. 400, fn. 13].)\n\nThis construction is necessary, however, because a statute may not constitutionally deny a litigant the procedural rights that are guaranteed on appeal when, as in this case, the litigant timely sought and was summarily denied writ relief from the superior court's order granting or denying disclosure under the PRA. In such a case a litigant has furthered the legislative objective by providing the courts an early opportunity to correct any alleged error. But, because the petition has been summarily denied, the litigant has not been afforded his constitutional right to review on the merits (Cal. Const., art. VI, § 11), and he has been denied his constitutional right to a written opinion with reasons stated (id., art. VI, §§ 11, 14).\u003cspan class=\"fnref\"\u003e61\u003c/span\u003e Because plaintiffs in this case sought writ review in conformity with the statute in the Court of Appeal and then in this court, and because the Court of Appeal summarily denied writ relief and we summarily denied review of that decision, section 6259(c) cannot constitutionally be applied to bar plaintiffs' subsequent appeal. Both the lead and the Concurring opinions err by concluding otherwise.\u003cspan class=\"fnref\"\u003e62\u003c/span\u003e\n\nC. Impact on appellate jurisdiction and workload\n\nContrary to suggestions of the lead and Concurring opinions, the opportunity for appellate review after denial of writ relief should not significantly, if at all, slow the speedy resolution of PRA actions by writ. (See ante, at pp. 77-80 \u0026 fn. 60.) At the same time, contrary to suggestions by the City of Richmond, I doubt that the availability of review on appeal will substantially burden the Courts of Appeal. For many years before enactment of the PRA, and for the first 16 years thereafter, these matters were subject to appeal but posed no apparent special burden on the appellate courts. (As noted ante, fn. 59, during 1968-1984, published appeals in such matters averaged only about one case per year.)\n\nThe City of Richmond offers a related argument, on which the lead opinion does not overtly rely. The City of Richmond claims that \"in numerous statutes the Legislature has precluded review by appeal,\" and it suggests such schemes would be cast into doubt by a Conclusion that plaintiffs have a right of appeal in this case. It lists (i) contempt orders (Code Civ. Proc., § 904.1, subd. (a)(1)(B)); (ii) orders assuming jurisdiction over a law practice (Bus. \u0026 Prof. Code, § 6180.13); (iii) superior court orders on petitions for discovery under the Fair Employment and Housing Act ( § 12963.5, subd. (d)) and under state civil service disciplinary procedures ( § 19574.2, subd. (h)); (iv) certain court orders regarding enforcement of zoning regulations ( § 65908); and (v) certain superior court determinations on incorporation of bridge and highway districts (Sts. \u0026 Hy. Code, §§ 27107, 27108).\n\nAssuming for purposes of analysis that the existence of these statutory schemes is relevant to our interpretation of the Constitution, they do not support the City of Richmond's view. The first category is clearly inapposite: the statute precluding appeal of contempt judgments conforms to the well-established rule, which predated the 1879 Constitution by almost 30 years, that judgments of contempt are not appealable under the present and past versions of article VI, section 11. (See Tyler, supra, 65 Cal. 28, 30-31, and cases cited.) The remaining four schemes involve narrow questions of administrative and public law. At least some of them concern review of interim rulings or discrete preliminary issues, rather than review of an entire cause (see ante, fns. 33 \u0026 55), and hence they do not interfere with the right of appeal. None of them poses a threat to the efficiency of the appellate courts, and hence the City's list hardly constitutes a parade of horribles.\n\nContrary to widely held assumptions that statutes such as the one at issue here (barring appeal from a final judgment or order of the superior court concerning a matter originating and pending in the superior court) are common, in fact they are exceptionally rare. Indeed, this is why, as the lead opinion repeatedly observes, no prior case has addressed the precise question of whether the Legislature may constitutionally substitute discretionary writ review for review on appeal of an entire cause of action. There has been no such case prior to this one for the simple reason that, with the possible exception of one or more of the narrow statutes listed above, the Legislature has heretofore not acted as it has done in this case, i.e., barring appeal and substituting discretionary writ review as the sole means of reviewing a judgment of the superior court resolving an entire cause of action within the original jurisdiction of the superior court.\n\nIt is true that in many schemes, the Legislature specifies that certain orders or judgments are reviewable by writ, but in those situations, the order or judgment is also reviewable in due course on appeal if the writ is summarily denied, pursuant to the usual civil and criminal rules permitting review on appeal of all orders or judgments below. (See Code Civ. Proc., § 906 [appellate court \"may review . . . any intermediate ruling, proceeding, order or decision\"]; Pen. Code, § 1259 [appellate court may \"review any question of law involved in any ruling, order, instruction, or thing whatsoever . . . which affected the substantial rights of the defendant.\"].) Accordingly, our acknowledgment that the Constitution affords a right of appeal in cases such as this would affect only a handful of statutory schemes.\u003cspan class=\"fnref\"\u003e63\u003c/span\u003e\n\nThe Concurring opinion, apparently conceding this point, speculates that the Legislature, at some distant date, may want to eliminate the constitutional right of appeal in certain extremely narrow situations in order to achieve increased efficiencies. Specifically, it asserts the Legislature might decide to eliminate appeal in favor of discretionary writ review in \"criminal cases in which the only issue raised . . . concerns a minor discrepancy (of a few days or less) as to the credit to which the defendant is entitled in the computation of his or her sentence.\" (Conc. opn., ante, at p. 12.) The Concurring opinion objects to the holding proposed herein, insofar as it would bar the Legislature from taking that heretofore not contemplated step.\n\nAssuming for purposes of analysis that such conjecture is a relevant or proper consideration in our interpretation of the Constitution, the Concurring opinion's point is easily answered as follows:\n\nFirst, constitutional rights are not always convenient or efficient; often they impose on government burdens that would not otherwise exist if the state were allowed to pursue the most efficient means of accomplishing its goals. But as a general matter, we do not subject constitutional rights to the kind of cost-benefit analysis employed by an economist. Indeed, few rights would withstand such review. For example, under the efficiency-based approach suggested in the Concurring opinion, we might allow the Legislature to bar jury trial whenever a defendant faces imprisonment for \"a few days or less\" -- as opposed to applying the well-established rule that, under the California Constitution, a litigant has a right to a trial by jury in any case in which he faces any length of imprisonment. (See Mills v. Municipal Court (1973) 10 Cal. 3d 288, 298, 110 Cal. Rptr. 329, 515 P.2d 273; see also Mitchell v. Superior Court (1989) 49 Cal. 3d 1230, 1243, 265 Cal. Rptr. 144, 783 P.2d 731 [1879 Constitutional Convention delegates \"expressed their intent that the right to trial by jury be preserved for any defendant who might lose his liberty by a sentence of imprisonment, however short . . . .\" (Italics added.)].) I thus reject the Concurring opinion's suggested \"efficiency exception\" to constitutional analysis as a radical and dangerous innovation.\n\nA second and related point is that, to the extent the policy interests of efficiency may militate in favor of allowing the Legislature authority to replace appeal with discretionary writ review in some situations, this presents a question for future revisers of the California Constitution, and not for this court. Our Constitution is a living document that has been amended hundreds of times. Indeed, article VI, section 11 and its antecedents have been amended eight times since 1849, most recently just this year. (See lead opn., ante, fn. 3.) If at a future date, the appropriate entities conclude it is proper or necessary to grant the Legislature the concededly limited authority envisioned by the Concurring opinion, such an amendment may be enacted. Until then, however, courts must construe the Constitution as they find it.\n\nFinally, beyond these basic interpretive weaknesses, and contrary to the Concurring opinion's suggestion, the Legislature is not precluded from enacting innovative statutes designed to address the efficiency concerns that motivate the Concurring opinion. The Legislature might, for example, designate an agency to adjudicate \"minor\" sentencing matters, and condition the right of appeal on prior exhaustion of such remedies. Alternatively, or in addition, the Legislature might require such appellants to seek review by discretionary writ before proceeding to appeal (cf. ante, pp. 79-80). In other words, the Legislature presently has constitutional authority to operate flexibly in this area, even though it lacks authority to simply abolish such appeals.\n\nThe Concurring opinion offers no principled basis on which to conclude that the Legislature has constitutional authority to eliminate appeals in PRA litigation, or any other narrow class of cases outside the traditionally recognized exceptions to the right of appeal. (See ante, at pp. 73-74.)\n\nVI. CONCLUSION\n\nArticle VI, section 11, of the California Constitution confers a \"right of appeal\" -- i.e., a right to review on the merits and a written opinion -- in cases such as this. I cannot agree with any significant analytical step used by the lead opinion to reach its contrary Conclusion. Nor does the Concurring opinion support its position that PRA actions are excepted from the general constitutional right of appeal.\n\nAlthough the Legislature may not substantially impair the constitutional right of appeal in litigation such as this, it may condition the right on a litigant's prior \"exhaustion\" of writ review. In order to give maximum effect to the legislative purpose of section 6259(c), I would read that statute as properly precluding appeal when a litigant neglects to seek writ review, or when, on writ review in the Court of Appeal, the litigant is afforded the substance of the procedural protections to which he would be entitled on appeal, i.e., review on the merits and a written opinion \"with reasons stated\" (Cal. Const., art. VI, § 14). But the statute may not constitutionally be applied to bar appeal in cases, such as this one, in which the litigant first properly sought, and was summarily denied, writ review. Accordingly, I would reverse the judgment of the Court of Appeal with directions to entertain the appeal on the merits.\n\n\u003cspan class=\"fn\"\u003e1. Subsequent references in this opinion to \"direct appeals\" should be understood in the sense intended by plaintiffs -- that is, a procedure for appellate review that includes oral argument, a decision on the merits, and a written opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The state Constitution provides (in article VI, section 10) that superior courts have original jurisdiction \"in habeas corpus proceedings,\" in \"proceedings for extraordinary relief in the nature of mandamus, certiorari, and prohibition,\" and in \"all causes except those given by statute to other trial courts.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Proposition 191, operative January 1, 1995, deleted a reference to \"Justice courts\" in the second sentence of article VI, section 11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The last sentence of the \"appellate jurisdiction\" provision, concerning appellate factfinding, was not part of the draft that the commission submitted to the Legislature; the Legislature added this sentence before submitting the proposed revision to the voters.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. To resolve an ambiguity in a constitutional provision, a court may consider the debates at the constitutional convention at which the provision was drafted. (State Board of Education v. Levit (1959) 52 Cal. 2d 441, 462, 343 P.2d 8; Story v. Richardson (1921) 186 Cal. 162, 165, 198 P. 1057; Older v. Superior Court (1910) 157 Cal. 770, 776, 109 P. 478.) The debates are useful \"less for the purpose of learning the opinion of particular members upon points of verbal construction than for informing ourselves historically of the evil which it was intended to guard against, or the benefit to be secured.\" (Matter of Smith (1907) 152 Cal. 566, 569, 93 P. 191.) We have cautioned that the convention debates \"furnish but an uncertain and often unreliable guide in the interpretation of Constitutions\" because the spoken comments may not express the views \"of those by whose votes a measure of importance is passed.\" (People v. McCreery (1868) 34 Cal. 432, 453; accord, Pitts v. Reagan (1971) 14 Cal. App. 3d 112, 118, 92 Cal. Rptr. 27; Helping Hand Home v. San Diego (1938) 26 Cal. App. 2d 452, 457, 79 P.2d 778.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. For example, one delegate, Mr. Lippitt, asserted that the proposed rule would preclude the poor, whose disputes often involve less than $200, from final resolution of legal disputes by a \"wiser\" higher court and, thus, \"will work oppressively upon the poor.\" (1849 Debates, supra, at p. 226.) Similarly, Mr. Hastings said the restriction \"strikes fatally at another unfortunate class of men--the poor.\" (Id. at p. 227.) He added: \"If you deprive [a poor man] of the right of appeal,\" he will remain subjected exclusively to the \"County Court, . . . [which] is probably under the immediate influence of wealthy men . . . . The rich man's influence operates almost unconsciously upon the members of the court. . . . But give the poor man the privilege of going further, and he goes to a Court that is beyond the influence of the wealthy man.\" (Id. at p. 229.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Mr. Noriego asserted that the limitation was necessary to preclude litigants from pressing an appeal in minor cases merely \"to gratify a malicious feeling towards the opposite party.\" (1849 Debates, supra, at p. 225.) Referring to the Supreme Court, another delegate, Mr. Jones, stated that \"its time and attention should not be occupied by such small matters.\" (Id. at p. 226.) Noting that many in California were \"totally unacquainted with the technicalities of the law,\" Mr. Noriego warned of \"the abuses to which this right of appeal in petty cases would subject them.\" (Id. at p. 228.) Mr. Ord also supported the limitation, echoing reasons advanced by Mr. Noriego: \"If you give the right of appeal in all cases, whatever the amount in controversy, the rich man can take his appeal . . . . It may cost the poor man ten times the amount of the original claim.\" (Id. at pp. 228-229.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. References to a \"right of appeal\" are numerous. (See, e.g., 1849 Debates, supra, at pp. 225 [Lippitt], 227 [Norton], 228 [Hastings], 230 [Vermeule].) Some delegates framed the issue in terms of whether there should be a \"right of appeal in all cases\" (id. at pp. 227 [Hastings], 228 [Ord], 229 [Vermeule]) or whether instead the Constitution should bar \"this right of appeal in petty cases\" (id. at p. 228 [Noriego]).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. To similar effect is the statement by Mr. Lippitt that \"the poor have just as much right to carry up their disputes, and have them settled by the most competent tribunals, as the richest man in the land.\" (1849 Debates, supra, at p. 226, italics added; see also ibid. [Mr. Sherwood's reference to \"the chance to go to a higher tribunal\"].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In the words of Mr. Lippitt, for example, the $200 limitation effectively tells \"the poor man . . . he shall not have the benefit of any higher tribunal than the District Court\" and thereby \"prohibits the application of the best talent and fairest judgment to all disputes under $200.\" (1849 Debates, supra, at pp. 226, 229; see also id. at pp. 227-228 [remarks of Mr. Hastings].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. A writ of ne exeat \"forbids the person to whom it is addressed to leave the country, the state, or the jurisdiction of the court.\" (Black's Law Dictionary, supra, p. 1031; see also In re Marriage of Gray (1988) 204 Cal. App. 3d 1239, 1244, 251 Cal. Rptr. 846.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. For example, Mr. McFarland stated that the provision \"proposes to give the right to appeal in all cases in which the amount in dispute is three hundred dollars\" and that \"it may be said that a man ought to have the right to appeal in any case.\" (1879 Debates, supra, at p. 963.) Mr. McCallum argued in favor of \"giving the right of appeal, or rather retaining the right of appeal, in all cases involving three hundred dollars and upwards.\" (Ibid.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Mr. Terry proposed an amendment, which the convention adopted, to extend the Supreme Court's appellate jurisdiction in criminal matters to all cases \"prosecuted by indictment, or information in a Court of record\" rather than to all cases \"amounting to felony\" because under the latter language \"the right of appeal depended, not upon the verdict of the jury, but upon the sentence of the Court.\" (1879 Debates, supra, at p. 964.) Explaining the proposed amendment, he said: \"I propose to extend the right of appeal to all cases prosecuted by indictment . . . .\" (Ibid.) Arguing in support, Mr. Wilson said: \"If a man is prosecuted by indictment, then the offense rises to such magnitude that it seems to me every citizen should have the right of appeal.\" (Ibid.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. For example, Mr. McFarland, referring to cases involving small sums of money, said: \"I believe that benefits would accrue to litigants in all that class of cases, if the decision of the Court below was final.\" (1879 Debates, supra, at p. 963.) Shortly thereafter, he gave this explanation: \"When all parties have an understanding that the judgment is final, that judgment will be much more apt to be right than where each party understands there is going to be an appeal.\" (Ibid.) In closing, he observed: \". . . more Justice can be done to the parties with the understanding that the trial shall be ended in the lower Court than where you grant an appeal.\" (Ibid.) Mr. Herrington made a similar remark: \". . . I believe that in every instance where a person is prevented from any further litigation it will be to his best interest that it shall be adopted and he prevented from taking any further steps.\" (1879 Debates, supra, at p. 964.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Quo warranto is a remedy \"against any person who usurps, intrudes into, or unlawfully holds or exercises any public office, civil or military, or any franchise, or against any corporation, either de jure or de facto, which usurps, intrudes into, or unlawfully holds or exercises any franchise, within this state.\" (Code Civ. Proc., § 803; see also Citizens Utilities Co. v. Superior Court (1976) 56 Cal. App. 3d 399, 406, 128 Cal. Rptr. 582; 8 Witkin, Cal. Procedure (3d ed. 1985) Extraordinary Writs, § 6, pp. 645-646.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The Latin phrase \"ex vi termini\" means \"from or by the force of the term\" or \"from the very meaning of the expression used.\" (Black's Law Dictionary, supra, p. 589.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The 1928 amendment eliminated the \"amount in controversy\" limitation on the appellate jurisdiction of the Courts of Appeal. The Legislature could, however, set the \"amount in controversy\" limit for the original jurisdiction of the superior courts. Cases excluded from the superior courts' original jurisdiction by this means would also, of course, be removed from the appellate jurisdiction of the Courts of Appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The time for filing the writ petition has since been expanded from 10 days to 20 days. (Stats. 1993, ch. 926, § 10.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. In his Dissenting opinion, the Chief Justice asserts that the legislative history of section 6259(c) \"forecloses\" this Conclusion (dis. opn., post, at p. ___ [typed dis. opn., at p. 70]) and reveals instead a legislative intent to invest the Courts of Appeal with discretion to summarily deny extraordinary writ petitions on grounds unrelated to the merits of the PRA action or to the formal or procedural sufficiency of the petition. The Chief Justice fails to say, however, what those additional grounds might be. We disagree. The legislative history of section 6259(c) demonstrates the Legislature's understanding that an appellate court may deny an extraordinary writ petition summarily -- that is, without issuing an alternative writ or order to show cause, without affording the parties an opportunity for oral argument, and without issuing a written opinion -- and that this power of summary denial distinguishes writ review from direct appeal. But the legislative history discloses no purpose to alter established rules of law governing extraordinary writs as articulated in Dowell v. Superior Court, supra, 47 Cal. 2d 483, and May v. Board of Directors, supra, 34 Cal. 2d 125, by expanding the grounds for summary denials of extraordinary writ petitions in PRA cases. Had the Legislature entertained such an intent, surely it would have specified the additional grounds in section 6259(c).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. For convenience, I employ the term \"direct appeal\" in the same sense as the lead opinion. (See lead opn., ante, at p. ___ [typed lead opn., p. 3, fn. 1.])\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Section 6259(c) currently provides in relevant part: \"In an action filed on or after January 1, 1991, an order of the court, either directing disclosure by a public official or supporting the decision of the public official refusing disclosure, is not a final judgment or order . . . from which an appeal may be taken, but shall be immediately reviewable by petition to the appellate court for the issuance of an extraordinary writ. . . . A stay of the order or judgment shall not be granted unless the petitioning party demonstrates it will otherwise sustain irreparable damage and probable success on the merits. . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Indeed, had plaintiffs not waited so long to seek the records and to file their action in superior court, the speedy appellate review afforded by section 6259(c) might have enabled them to obtain an appellate decision as to the propriety of the trial court ruling prior to the city council election.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Article VI, section 11, currently provides in its entirety: \"The Supreme Court has appellate jurisdiction when judgment of death has been pronounced. With that exception courts of appeal have appellate jurisdiction when superior courts have original jurisdiction and in other causes prescribed by statute. [P] Superior courts have appellate jurisdiction in causes prescribed by statute that arise in municipal courts in their counties. [P] The Legislature may permit appellate courts to take evidence and make findings of fact when jury trial is waived or not a matter of right.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. In view of the provisions of Government Code section 6259, subdivision (a), which set forth the general procedures that a superior court is to follow in an action under the Public Records Act, plaintiffs would have been hard pressed to make such a contention. Section 6259, subdivision (a), provides: \"Whenever it is made to appear by verified petition to the superior court of the county where the records or some part thereof are situated that certain public records are being improperly withheld from a member of the public, the court shall order the officer or person charged with withholding the records to disclose the public record or show cause why he or she should not do so. The court shall decide the case after examining [1] the record in camera, if permitted by subdivision (b) of Section 915 of the Evidence Code, [2] papers filed by the parties and [3] any oral argument and additional evidence as the court may allow.\" (Italics and bracketed numbers added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. All further statutory references are to this code unless otherwise indicated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Even on appeal, a litigant may lose the right to review on the merits if the appeal is not perfected. In contrasting generally the two methods of review, I assume a perfected appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Examples of the debate are set out in the lead opinion, ante, at pages 10-12. See Browne, supra, at pages 226 (remarks of Mr. Lippitt), 227 (remarks of Messrs. Norton \u0026 Hastings), 228 (remarks of Messrs. Noriego \u0026 Ord), 229 (remarks of Messrs. Hastings \u0026 Vermeule), 230 (remarks of Mr. Vermeule).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The identical point is also shown by the remarks of Mr. McCarver, who objected to former article VI, section 4, insofar as it \"provides for an appeal of criminal cases to the Supreme Court. If we adopt that system, we may take it for granted that every case will go to the Supreme Court. . . . I do not desire that men shall get clear, after they have been found guilty before a jury of their peers, by any quibble of the law.\" (Browne, supra, at p. 226, italics added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Haight v. Gay, supra, did not involve a situation in which the Legislature attempted to impair the right of appeal; in fact, it provided for appeal by statute. The defendant, however, failed to file a record, and his appeal was dismissed. The defendant thereafter sought a \"writ of error\" in the Supreme Court. A \"writ of error\" was a common law discretionary writ proceeding that, like appeal, was designed to review the legal merits of lower court's judgment. (See 4 C.J.S. (1993) Appeal and Error, §§ 8-16, pp. 64-80; 4 Am.Jur.2d, Appeal and Error, § 2, pp. 533-534.) The court Haight v. Gay held: \"In all cases where an appeal is given by the statute, that remedy is exclusive and must be pursued, and . . . a writ of error will only lie in cases where no appeal is given by the act.\" (8 Cal. at p. 300.) Properly understood, Haight v. Gay stands for the proposition that the Legislature is free to bar use of the \"writ of error\" in favor of a statutory appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. 2 California Jurisprudence (1921) Appeal and Error, section 5, pages 113-114 correctly summarizes the holding in Haight v. Gay, supra, 8 Cal. 297: \"While writ of error, as a remedy to review errors in proceedings at law, existed at common law, it is well settled that if an appeal is given by the code in a particular case, that remedy is exclusive and must be followed.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Ex Parte Harker, supra, 49 Cal. 465, concerned a petitioner who was jailed after the district court issued a writ of ne exeat to secure his custody pending resolution of a civil suit against him, and sought a writ of habeas corpus in the Supreme Court. The petitioner claimed the district court had no statutory authority to issue the writ of ne exeat because that writ had been abolished by the Legislature. We granted relief, and rejected the suggestion that, because jurisdiction in equity cases was conferred on the district courts by the Constitution, the Legislature had no authority to abolish the writ. We explained: \"Jurisdiction is also conferred by the Constitution upon those Courts in certain cases at law; but it is apparent, in equity no less than law, that the mere procedure by which jurisdiction is to be exercised may be prescribed by the Legislature, unless, indeed, such regulations should be found to substantially impair the Constitutional powers of the Courts, or practically defeat their exercise.\" (Id. at p. 467.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Article III, section 2, paragraph 2 of the United States Constitution provides: \"The Supreme Court shall have appellate jurisdiction . . . with such exceptions, and under such regulations as the Congress shall make.\" Most states followed this scheme, and granted the state Legislature power to control and alter the appellate jurisdiction of their high courts. (See Ala. Const. (1819) art. V, § 2; Ark. Const. (1836) art. VI, § 2; Conn. Const. (1818) art. V, § 1; Del. Const. (1831) art. VI, § 12; Fla. Const. (1838) art. V, § 2; Iowa Const. (1846) art. 5, § 3; Ind. Const. (1816) art. V, § 2; Ky. Const. (1799) art. IV, § 2; N.Y. Const. (1846) art. VI, § 5; see also Code of Proc. of the State of N.Y. (1848) § 11; Ohio Const. (1802) art. III, § 2; Tenn. Const. (1834) art. VI, § 2; Tex. Const. (1845) art. IV, § 3; Va. Const. (1830) art V, § 1.) A few of these provisions contained the caveat that legislative regulation \"not [be] repugnant to this Constitution.\" (See the cited provisions of Arkansas, Florida, Indiana, Kentucky.) The Indiana Constitution was subsequently amended to remove the caveat. (Ind. Const. (1851) art. VII, § 4.) Similarly, the Kentucky Constitution was amended expressly to remove any constitutional limitation on the state legislature's authority to control appeals from the trial court of general jurisdiction to the state's highest court: \"The right to appeal . . . to the court of appeals shall remain as it now exists, until altered by law, hereby giving to the general assembly the power to change, alter, or modify said right.\" (Ky. Const. (1850) art. VI, § 18.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. A third group of state constitutions failed expressly to define or even provide for the appellate jurisdiction of the state's highest court. (See Ga. Const. (1835) art. III, § 1; Me. Const. (1819) art. VI; Mass. Const. (1780) ch. III; Mich. Const. (1835) art. VI; N.H. Const. (1792), § LXXIII et seq.; N.J. Const. (1844) art. VI; N.C. Const. (1776); Pa. Const. (1838) art. V; S.C. Const. (1790) art. III; Vt. Const. (1793) ch. II, art. 4.) One state expressly left the scope of appellate jurisdiction open. (See Miss. Const. (1832), art. IV, art. 4 [high court \"shall have no jurisdiction but such as properly belongs to a court of errors and appeals\"].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Like Louisiana, and unlike any other existing state constitution, it listed the classes of cases within the Supreme Court's appellate jurisdiction. It granted the Supreme Court appellate jurisdiction in all cases concerning \"the legality of any tax, toll, or impost, or municipal fine,\" and in \"all criminal cases amounting to a felony, on questions of law alone.\" (Browne, supra, at p. 233.) Similarly, the Louisiana provision (La. Const. (1845) tit. IV, art. 63) granted the state Supreme Court appellate jurisdiction in \"all cases where the matter in dispute shall exceed three hundred dollars, and to all cases in which the constitutionality or legality of any tax, toll, or impost, of any kind or nature soever, shall be in contestation, whatever may be the amount thereof; and likewise to all fines, forfeitures, and penalties imposed by municipal corporations, and in criminal cases on questions of law alone, whenever the punishment of death or hard labor may be inflicted . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. See Ker, Proceedings and Debates of the Convention of Louisiana (1845) pages 714-715, 803-815. Like their subsequent California counterparts of 1849, the Louisiana drafters of 1845 focused on the jurisdictional amount aspect of their provision, and debated the effect of such a provision on a litigant's \"right of appeal.\" (See id. at pp. 714 [remarks of Mr. Ratliff], 715 [remarks of Mr. Benjamin], and 806 [remarks of Mr. Mayo]. The Louisiana delegates also demonstrated that they knew how to grant the Legislature authority to govern appeals when they intended to do so. (Id. at pp. 797-799 [granting Legislature power to control appeals from the Justices' court].) The 1845 Louisiana drafters' intention was reaffirmed in 1864, when the delegates to the Louisiana Constitutional Convention readopted, without significant change, the appellate jurisdiction provision of 1845. (See Bennett, Debates in the Convention for the Revision and Amendment of the Constitution of the State of Louisiana (1864) pp. 265, 268-271, 273-281.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. See State v. Judge of the Superior District Court (1876) 28 La.Ann. 547. The court held that \"the right to an appeal is protected by the constitution, . . . however baseless or indifferent the demand on the merits may be. [P] The sole question now is whether the relators are entitled to a suspensive appeal, and to this question there is but one answer: It is a final judgment, and the matter in dispute exceeds five hundred dollars; therefore an appeal, suspensive or devolutive, will lie at the option of appellants on complying with the requirements of the law.\" (Id. at p. 548.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Nine amendments to the Louisiana Constitution since 1845 have modified the appellate jurisdiction provisions, but the Louisiana courts have consistently interpreted them as providing a state constitutional right of appeal -- meaning at least a right to review on the merits -- in any case in which the state Constitution grants appellate jurisdiction to the Louisiana Supreme Court or state Courts of Appeal. (See, e.g., State v. Whitaker (La. 1893) 14 So. 66, 68 [constitutional right of appeal lies, regardless merits of claim]; R.M. Walmsley \u0026 Co. v. Nicholls (1884) 36 La.Ann. 799, 800-801 [constitutional amendment creating court of appeal did not destroy right of appeal pending in Supreme Court, but instead removed the appeal to lower court]; Succession of Damico (La. 1925) 161 La. 725, 109 So. 402, 403 [\"in civil cases, an appeal lies of right . . . from all final judgments\" under the appellate jurisdiction provisions of the state Constitution] (italics in original); Harnischfeger Corp. v. C.W. Greeson Co. et al. (La. 1951) 219 La. 546, 53 So. 2d 488, 489 [\"An appeal is a constitutional right and any doubt as to the right of an appeal must be resolved in favor of the appeal.\"]; Darouse v. Mamon (La. 1967) 201 So. 2d 362, 364 [\"the right of appeal is constitutionally guaranteed\" under the Constitution's appellate jurisdiction provisions]; State v. Holmes (La. 1967), 251 La. 607, 205 So. 2d 416, 419, fn. 2 [\"the right of appeal is conferred on all litigants by the provisions of [the appellate jurisdiction provisions of] Article VII of our Constitution\"]; see also Tennessee Gas Transmission Co. v. Violet Trapping Co. (La. 1965) 248 La. 49, 176 So. 2d 425, 431-433.) The present Louisiana Constitution, adopted in 1974, retains the essential structure of the prior state Constitutions, and continues to guarantee, under the state Constitution's appellate jurisdiction provisions, an \"appeal of right.\" As explained in Hargrave, The Judiciary Article of the Louisiana Constitution of 1974 (1977) 37 La. L.Rev. 765, 795 \"Article V, section 5 specifies the supreme court's original, supervisory, and appellate jurisdiction. . . . 'Supervisory' refers to the court's discretionary jurisdiction under which it has the power to select the cases it will hear, and 'appellate' contemplates cases in which a party as a matter of right can demand that the court hear the case.\" (See also id. fn. 126, pp. 796, 800-801.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Compare Hargrave, The Judiciary Article of the Louisiana Constitution of 1974, supra, 37 La. L.Rev. 765 (right of appeal is found in appellate jurisdiction provisions of Louisiana's judicial article) with Hargrave, The Declaration of Rights of the Louisiana Constitution of 1974 (1974) 35 La. L.Rev. 1, 60-62 (criminal defendant's \"right of review\" does not afford \"right of appeal\"). This answers the lead opinion's suggestion that, had the 1849 delegates intended a right of appeal, they would have expressly so provided in our \"Declaration of Rights,\" i.e., California Constitution of 1849, article I. (See lead opn., ante, at p. 4.) Given the absence of any such express mention in the Louisiana Constitution's \"Declaration of Rights\" counterpart (1845 La. Const., Tit. VI [\"General provisions\"]), the California delegates would have considered express mention unnecessary.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. In addition, the original jurisdiction of the court was expanded to permit issuance of writs of \"mandamus, certiorari, and prohibition\" as well as habeas corpus.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. With the sole exception of Florida (see post, fn. 48), the sister state provisions cited ante, footnote 8, remained substantively unchanged in 1879. By that time, new states had entered the Union, and those as well, with the sole exception of Nevada (see post, fn. 48) followed the prevailing federal model by granting the state legislature power over appellate jurisdiction. (See Colo. Const. (1876) art. VI, § 2; Kan. Const. (1855) art. VI, § 2; Kan. Const. (1858) art. VI, § 13; Kan. Const. (1859) art. III § 3; Neb. Const. (1875) art. VI, § 2.) In addition, when other states amended their various provisions that had previously failed to clearly establish the appellate jurisdiction of the state's highest court (see ante, fn. 9), they did so in a manner that granted legislative control over the court's appellate jurisdiction. (See, e.g., Mich. Const. (1850) art. VI, § 2; Pa. Const. (1878) art. V, § 3; see also S.C. Const. (1868) art. IV, § 4.) Finally, acts establishing territories regularly followed the same model. (See, e.g., Act to Establish the Territorial Government of Minnesota (1849) § 9; Act to Provide a Temporary Government for the Territory of Idaho (1863) § 9 [both set out in 2 Thorpe, Federal and State Constitutions, Colonial Charters, and other Organic Laws (1909) at pp. 1981-1899, 905-912].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Mr. McFarland led the charge to limit the right of appeal: \"This section proposes to give the right to appeal in all cases in which the amount in dispute is three hundred dollars. . . . I believe the business of our appellate Court has been unnecessarily retarded by appeals in small matters. . . . It may be said that a man ought to have the right to appeal in any case. You have abandoned that principle now, because you provide that he can only appeal in a case involving three hundred dollars. It is a question of where you draw the line. . . . And I believe that more Justice would be done to litigants if appeals were cut off in these small cases . . . .\" (2 Willis \u0026 Stockton, Debates and Proceedings of the Constitutional Convention of the State of California (1880) at p. 963, col. 1, italics added (hereafter Willis \u0026 Stockton).) The debate continued in this vein. (See id. at p. 963, col. 1 [remarks of Mr. McFarland]; id. at p. 963, cols. 1-2 [remarks of Mr. Smith]; id. at p. 963, col. 2 [remarks of Mr. McCallum]; id. at p. 963, col. 2 \u0026 p. 964, col. 1 [remarks of Mr. Beerstecher]; id. at p. 964, col. 1 [remarks of Mr. Herrington].) The amendment failed, and the $300 floor remained. (Ibid.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Mr. Terry observed that the 1862 version of article VI, former section 4, granted the Supreme Court appellate jurisdiction over \"all criminal cases amounting to felony.\" The result, he noted, was that \"the right of appeal depended, not upon the verdict of the jury, but upon the sentence of the Court. If [the defendant] was sentenced simply to fine or imprisonment in the County Jail, he had no appeal; whereas if he was sentenced to one month in State Prison, his right to appeal would be perfect. I propose to extend the right of appeal to all cases prosecuted by indictment, so that when a man is indicted he is entitled to have an appeal from the judgment if it is against him.\" (2 Willis \u0026 Stockton, supra, at p. 964, col. 1, italics added.) After additional debate about the propriety of granting a \"right of appeal\" in such criminal cases (id. at p. 964, cols. 1-2 [remarks of Mr. McCallum] \u0026 p. 964, col. 2 [remarks of Mr. Wilson]), the amendment was slightly revised and adopted. (Id. at p. 964, col. 2.) Thereafter, the delegates rejected an attempt to repeal the amendment and thereby curtail the Supreme Court's appellate jurisdiction in criminal matters. (3 Willis \u0026 Stockton, supra, at p. 1333, col. 2 [remarks of Messrs. McCallum \u0026 Campbell].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. See 2 Willis \u0026 Stockton, supra, at page 977, column 1 (remarks of Messrs. Wilson \u0026 Reddy); id. at page 980, column 1 (remarks of Messrs. Edgerton, Freeman \u0026 Terry); id. at page 980, column 2 (remarks of Messrs. Shafter \u0026 Beerstecher); id. at page 981, column 1 (remarks of Mr. Hale); id. at page 981, column 2 (remarks of Mr. McCallum); see also 3 Willis \u0026 Stockton, supra, at page 1333, column 2 (clarifying amendment by Mr. Wilson). The delegates engaged in similar debate concerning the effect on the right of appeal of a proposed amendment granting the Superior Court and Justice's Courts alternative jurisdiction in certain matters. (See 2 Willis \u0026 Stockton, supra, at p. 966, col. 2 [remarks of Mr. McCallum]; id. at p. 967, col. 2 [remarks of Mr. Wilson].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. As noted post, footnote 55, there is no constitutional right to \"appeal\" rulings on discrete, preliminary issues unrelated to the substantive merits of an underlying cause of action.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Plaintiffs effectively raised this point in their petition for review in this court following the Court of Appeal's summary denial of their writ petition.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. And, as noted above, it also established a right to a written opinion with reasons stated whenever the Court of Appeal or the Supreme Court determines a \"cause.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Immediately thereafter, the court continued: \"In the absence of any rules of practice enacted by the legislative authority, it is competent for the courts of this State to establish an entire Code of procedure in civil cases, and an entire system of procedure in criminal cases . . . .\" (Ibid.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Maxson v. Superior Court (1899) 124 Cal. 468, 473-474, 57 P. 379, also relied on by the lead opinion in this regard, is clearly distinguishable. It involved the statutorily defined appellate jurisdiction of the superior court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. We have found no authority addressing the significance of the 1904 amendment's inclusion of the phrase \"on appeal from the superior courts\" in this clause and the clause governing the Courts of Appeal. In any event, the 1904 terminology is consistent with the proposition that article VI, former section 4 established both appellate jurisdiction and a right of appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The reference to these writs was apparently added in response to and in recognition of cases in which the Supreme Court had \"repeatedly exercised\" appellate jurisdiction over appeals taken to it \"from a judgment of the Superior Court, granting or denying\" such writ applications. (See Palache v. Hunt (1884) 64 Cal. 473, 474, 2 P. 245.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Pacific Telephone etc. Co. v. Eshleman (1913) (Eshleman) 166 Cal. 640, 137 P. 1119, stands for the proposition that the Constitution confers power on the Legislature to restrict or even ban appellate review of \"orders or decisions\" of the Railroad Commission (now the Public Utilities Commission). (Id. at pp. 658-659 (lead opn.); see Cal. Const., art. XII, § 5.) Of course, no similar constitutional grant of power exists as to PRA actions. The lead opinion in Eshleman stated: \"'It is a well recognized principle that where the judicial power of courts, either original or appellate, is fixed by constitutional provisions, the legislature cannot either limit or extend that jurisdiction.' (Chinn v. Superior Court [(1909)] 156 Cal. 478, 105 P. 580; Marbury v. Madison [(1803)] 5 U.S. 137, 1 Cranch 137 [2 L.Ed. 60].)\" (166 Cal. at p. 647; see also Great Western Power Co. v. Pillsbury (1915) 170 Cal. 180, 183, 149 P. 35 [Legislature lacks power to divest Supreme Court of certiorari jurisdiction granted by Constitution].) The Concurring opinion in Eshleman stated: \"The courts of this state derive their powers and jurisdiction from the constitution of the state. The constitutional jurisdiction can neither be restricted nor enlarged by legislative act. An attempt to take away from the courts judicial power conferred upon them by the constitution, or to impose on them judicial powers not granted or authorized to be granted is void. This declaration . . . has been held by this court from the early history of the state (Thompson v. Williams [(1856)] 6 Cal. 88; Hicks v. Bell [(1853)] 3 Cal. 219; Burgoyne v. Supervisors [(1855)] 5 Cal. 9; Parsons v. Tuolumne Water Co. [(1855)] 5 Cal. 43; People v. Applegate, [supra,] 5 Cal. 295; Fitzgerald v. Urton [(1854)] 4 Cal. 235; Wilson v. Roach [(1854)] 4 Cal. 362; Zander v. Coe [(1855)] 5 Cal. 230; Haight v. Gay, [supra,] 8 Cal. 297; People v. Peralta [(1853)] 3 Cal. 379; Caulfield v. Hudson [(1853)] 3 Cal. 389; In re Jessup, [supra,] 81 Cal. 408, 22 P. 742; Tulare v. Hevren [(1899)] 126 Cal. 226, 228, 58 P. 530; Chinn v. Superior Court, [(1909)] 156 Cal. [478,] 479). It is still the rule except in so far as it may have been modified by the constitution itself.\" (Eshleman, supra, 166 Cal. 640, 690-691 (conc. opn. of Sloss, J.).)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Accord, People v. Perry, supra, 79 Cal. 105, 109, in which we said: \"It has been held that a meaning must be attributed to [article VI, former section 4] broader than is contained in its express terms.\" (Cf. People v. Valenti (1957) 49 Cal. 2d 199, 207, 316 P.2d 633, disapproved on other grounds in People v. Sidener (1962) 58 Cal. 2d 645, 647, 25 Cal. Rptr. 697, 375 P.2d 641 [\"'The right of appeal is remedial and in doubtful cases the doubt should be resolved in favor of the right whenever the substantial interests of the party are affected by a judgment.'\"]; People v. Bank of San Luis Obispo (1907) 152 Cal. 261, 264, 92 P. 481 [same]; Bailey v. Fosca Oil Co., Ltd. (1967) 211 Cal. App. 2d 307, 309, 27 Cal. Rptr. 454 [same]; Kneeland v. Ethicon Suture Laboratories (1952) 113 Cal. App. 2d 335, 338, 248 P.2d 447 [same].) We have recently relied on these latter cases for the same proposition. (See People v. Brown (1993) 6 Cal. 4th 322, 335, fn. 10, 862 P.2d 710; In re Matthew C. (1993) 6 Cal. 4th 386, 394, 862 P.2d 765.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Nor have the cases that followed Sutter-Butte, supra, 190 Cal. 532 (Byers v. Smith (1935) 4 Cal. 2d 209, 47 P.2d 705; Modern Barber Col. v. Cal. Emp. Stab. Com. (1948) 31 Cal. 2d 720, 192 P.2d 916), so distinguished that case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. This facial expansion of the appellate jurisdiction of the Courts of Appeal was, however, somewhat illusory, in light of another amendment to article VI, defining the original jurisdiction of the superior court. Former article VI, section 5, as amended in 1928, provided: \"The superior court shall have original jurisdiction in all civil cases and proceedings (except . . . cases and proceedings in which jurisdiction is or shall be given by law to municipal or Justices or other inferior courts) . . . .\" (Italics added.) The prior versions of former article VI, section 5, had given the Legislature no power to move jurisdiction over such proceedings from the superior to the inferior courts. But, because under the 1928 amendment to former article VI, section 4b, the constitutional jurisdiction of the Courts of Appeal and this court was based at least in part on the original jurisdiction of the superior court (see former art. VI, §§ 4b, 4), the combined effect of the 1928 amendments was to give the Legislature limited authority indirectly to deprive the appellate courts, and hence this court, of constitutional jurisdiction in some civil cases, by moving original jurisdiction from the superior court to the inferior courts. (See post, fn. 43.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. The lead opinion's insertion of the qualifying term, \"civil,\" here and elsewhere in its opinion, bespeaks a certain unease -- or at least reluctance -- about the broad scope of its analysis. Nothing in the lead opinion, however, suggests any justification for confining its analysis to civil litigants; indeed, it could not be so confined. Nothing in the history of the constitutional provision, or of the case law interpreting that provision, supports any such distinction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. As noted above, the provision reads: \"The Supreme Court has appellate jurisdiction when judgment of death has been pronounced. With that exception courts of appeal have appellate jurisdiction when superior courts have original jurisdiction and in other causes prescribed by statute.\" (Art. VI, § 11.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. See Title Ins. \u0026 Trust Co. (1911) 159 Cal. 484, 486, 114 P. 838, citing Myers v. Mott (1866) 29 Cal. 359, Illinois Trust \u0026 Sav. B'k v. Alvord (1893) 99 Cal. 407, Rochat v. Gee (1891) 91 Cal. 355, 27 P. 670, and Allender v. Fritts (1864) 24 Cal. 447.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. The exception is In re Taya C., supra, 2 Cal. App. 4th 1, at pages 6-7, which in turn relied on three decisions (Lavine v. Jessup (1957) 48 Cal. 2d 611, 311 P.2d 8; Superior Wheeler Cake Corp. v. Superior Court (1928) 203 Cal. 384, 264 P. 488; and Supple v. City of Los Angeles (1988) 201 Cal. App. 3d 1004, 247 Cal. Rptr. 554, disapproved on other grounds in Jennings v. Marralle (1994) 8 Cal. 4th 121, 129, 876 P.2d 1074, all described post, fn. 40), none of which involved an attempt by the Legislature to deprive a litigant of a constitutional right of appeal from a final judgment of the superior court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. See Skaff v. Small Claims Court (1968) 68 Cal. 2d 76, 78, 65 Cal. Rptr. 65, 435 P.2d 825; Lund v. Superior Court (1964) 61 Cal. 2d 698, 709, 39 Cal. Rptr. 891, 394 P.2d 707; People v. Valenti, supra, 49 Cal. 2d 199, 204; Lavine v. Jessup, supra, 48 Cal. 2d 611, 613; Superior Wheeler Cake Corp. v. Superior Court, supra, 203 Cal. 384, 386 (citing Estate of McPhee (1908) 154 Cal. 385); In re Marriage of Griffin (1993) 15 Cal. App. 4th 685, 687; Rao v. Campo (1991) 233 Cal. App. 3d 1557, 1564, 285 Cal. Rptr. 691; In re Eli F. (1989) 212 Cal. App. 3d 228, 232, 260 Cal. Rptr. 453; State Farm Fire \u0026 Casualty v. Hardin (1989) 211 Cal. App. 3d 501, 505, 259 Cal. Rptr. 433; Uptain v. Duarte (1988) 206 Cal. App. 3d 1258, 1261, 254 Cal. Rptr. 150; Redevelopment Agency v. Goodman (1975) 53 Cal. App. 3d 424, 432, 125 Cal. Rptr. 818; Draus v. Alfred M. Lewis, Inc. (1968) 261 Cal. App. 2d 485, 489, 68 Cal. Rptr. 154; Kadota Fig Assn. v. Case-Swayne Co. (1946) 73 Cal. App. 2d 815, 823, 167 P.2d 523; Jackson v. Jackson (1945) 71 Cal. App. 2d 837, 839, 163 P.2d 780; Leftridge v. City of Sacramento (1943) 59 Cal. App. 2d 516, 526, 139 P.2d 112; Strauch v. Bieloh (1936) 16 Cal. App. 2d 278, 280, 60 P.2d 582.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. See Collins v. Corse (1936) 8 Cal. 2d 123, 124, 64 P.2d 137; Sherman v. Standard Mines Co. (1913) 166 Cal. 524, 525, 137 P. 249; In re Brekke (1965) 233 Cal. App. 2d 196, 199, 43 Cal. Rptr. 553).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. See People v. Keener (1961) 55 Cal. 2d 714, 720, 12 Cal. Rptr. 859, 361 P.2d 587, disapproved on other grounds in People v. Butler (1966) 64 Cal. 2d 842, 845, 52 Cal. Rptr. 4, 415 P.2d 819; In re Corey (1964) 230 Cal. App. 2d 813, 820, 41 Cal. Rptr. 379.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. See People v. Chi Ko Wong (1976) 18 Cal. 3d 698, 709, 135 Cal. Rptr. 392, 557 P.2d 976, disapproved on other grounds in People v. Green (1980) 27 Cal. 3d 1, 33-34, 164 Cal. Rptr. 1, 609 P.2d 468; Supple v. City of Los Angeles, supra, 201 Cal. App. 3d 1004, 1009; Woodman v. Ackerman, supra, 249 Cal. App. 2d 644, 649; People v. Superior Court (Kasparek) (1962) 202 Cal. App. 2d 850, 852, 21 Cal. Rptr. 178; see also Rossi v. Caire (1922) 189 Cal. 507, 508, 209 P. 374.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. See In re T. M. (1988) 206 Cal. App. 3d 314, 316; see also 2 Witkin, Cal. Procedure (3d ed. 1985) Courts, section 3, page 34, and cases cited.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. Most involved purported interlocutory appeals, which, as observed, ante, footnote 33, the Legislature may constitutionally ban. (Lund v. Superior Court, supra, 61 Cal. 2d 698, 709; People v. Keener, supra, 55 Cal. 2d 714, 720; Collins v. Corse, supra, 8 Cal. 2d 123, 124; Rossi v. Caire, supra, 189 Cal. 507, 508; Sherman v. Standard Mines Co., supra, 166 Cal. 524, 525; In re Marriage of Griffin, supra, 15 Cal. App. 4th 685, 687; Rao v. Campo, supra, 233 Cal. App. 3d 1557, 1564; In re Eli F., supra, 212 Cal. App. 3d 228, 232 (see In re Matthew C. (1993) 6 Cal. 4th 386, 397-401, 862 P.2d 765); State Farm Fire \u0026 Casualty v. Hardin, supra, 211 Cal. App. 3d 501, 505; Uptain v. Duarte, supra, 206 Cal. App. 3d 1258, 1261; Draus v. Alfred M. Lewis, Inc., supra, 261 Cal. App. 2d 485, 489; Woodman v. Ackerman, supra, 249 Cal. App. 2d 644, 649; In re Brekke, supra, 233 Cal. App. 2d 196, 199; Strauch v. Bieloh (1936) 16 Cal. App. 2d 278, 280, 60 P.2d 582.) One case found a statutory right of appeal (In re Corey, supra, 230 Cal. App. 2d 813, 820), and another was a mandamus proceeding in which the court rendered an opinion on the merits of the underlying dispute (Leftridge v. City of Sacramento, supra, 59 Cal. App. 2d 516, 526). Still others involved legislative rules governing conditions or procedure on appeal (Lavine v. Jessup, supra, 48 Cal. 2d 611, 613; Estate of McPhee, supra, 154 Cal. 385, 391; Kadota Fig Assn. v. Case-Swayne Co., supra, 73 Cal. App. 2d 815, 823; Jackson v. Jackson, supra, 71 Cal. App. 2d 837, 839; Redevelopment Agency v. Goodman, supra, 53 Cal. App. 3d 424, 432), and restrictions on small claims appeals over which the Legislature is granted plenary authority by the Constitution (Skaff v. Small Claims Court, supra, 68 Cal. 2d 76, 78; Superior Wheeler Cake Corp. v. Superior Court, supra, 203 Cal. 384, 386). Supple v. City of Los Angeles, supra, 201 Cal. App. 3d 1004, 1009, involving a purported appeal from a judicial arbitration judgment as to which the plaintiff neglected to seek a trial de novo, was subsequently overruled in Jennings v. Marralle, supra, 8 Cal. 4th 121, 129. Two cases, People v. Valenti, supra, 49 Cal. 2d 199, 204, and People v. Superior Court (Kasparek), supra, 202 Cal. App. 2d 850, 852, barred appeal from a final judgment on the ground that the People may not appeal from their own dismissal of an action. Similarly, the cases allowing the Legislature to withdraw the right of appeal all involved types of appeals over which the Constitution granted the Legislature complete control. (See, e.g., Berg v. Traeger (1930) 210 Cal. 323, 325, 292 P. 495 [appeal from municipal court]; Hirsch v. All Persons (1916) 173 Cal. 268, 269, 159 P. 712 [appeal from interlocutory order granting new trial]; In re T. M., supra, 206 Cal. App. 3d 314, 316 [appeal from interlocutory order]; Pacific G. R. Co. v. Superior Court (1924) 70 Cal. App. 200, 202, 232 P. 995 [appeal from Justice court].) Finally, People v. Chi Ko Wong, supra, 18 Cal. 3d 698, 709, concluded the Legislature intended to preclude a defendant from raising on appeal from a final judgment, a juvenile court's order, issued outside the criminal proceedings, finding the defendant fit for trial in the superior court. (See id. at pp. 710-712.) It is plainly distinguishable from the present case. (See post, fn. 55.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Witkin explains: \"The Constitution formerly specified the types of cases of which the court had appellate jurisdiction. The effect of the specification was roughly to keep appeals in equity cases, and cases involving title to land, tax and probate matters, in the Supreme Court, and to channel appeals in actions at law and special proceedings to the courts of appeal. [Citations.] . . . [P] . . . [The constitutional revision of 1966] merely confirmed the existing system. The [former] Constitution gave the old district court of appeal appellate jurisdiction in all matters transferred to it by the Supreme Court. As the Supreme Court's case load increased, the practice arose of transferring nearly all its direct appeals to the district court of appeal. . . .\" (2 Witkin, Cal. Procedure, Courts, supra, § 265, pp. 287-288.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Article VI, section 4e, adopted in 1960, granted the Courts of Appeal appellate jurisdiction over cases from the municipal and Justice courts \"to the extent and in the manner provided for by law.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. Under article VI, section 10, superior courts, like the Courts of Appeal and the Supreme Court, have \"original jurisdiction\" in \"habeas corpus proceedings . . . [and] proceedings for extraordinary relief in the nature of mandamus, certiorari, and prohibition.\" In addition, the superior courts have original jurisdiction \"in all causes except those given by statute to other trial courts.\" This latter clause, in conjunction with article VI, section 11 (defining appellate jurisdiction of the Courts of Appeal based on the original jurisdiction of the superior court) gives the Legislature apparent authority to transfer all matters -- both civil and criminal -- from the superior court to the municipal court (see 2 Witkin, Cal. Procedure, Courts, supra, § 133, pp. 155-156), and thereby curtail the appellate jurisdiction of the Courts of Appeal and this court. Whether the Legislature might exercise that power and thereby properly deprive litigants of a constitutional right of appeal is a question that is not presented here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. The phrase \"and in other causes prescribed by statute\" permits the Legislature to \"enlarge the appellate jurisdiction of the courts of appeal, and [it] has done so by providing for a hearing in such courts after decision on an appeal to the superior court in a case originating in the municipal or the Justice court.\" (2 Witkin, Cal. Procedure, Courts, supra, § 133, p. 156, italics added; see art. VI, former § 4e [predecessor provision]; Pen. Code, § 1471 [implementing legislation]; Code Civ. Proc., § 911 [same].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. Plaintiffs also rely on Bloom v. Municipal Court (1976) 16 Cal. 3d 71, 127 Cal. Rptr. 317, 545 P.2d 229 (Bloom), an appeal from the superior court's denial of a writ of prohibition to bar a criminal obscenity prosecution in the municipal court. On close analysis it appears Bloom did not reach the constitutional question. Bloom cited none of the above discussed cases holding there is a constitutional right of appeal, nor any of the above discussed cases stating in dicta the contrary proposition. In fact, there was no constitutional right of appeal in the litigation at issue in Bloom. Although the Legislature was authorized by the Constitution (art. VI, § 11, par. 1 [\"courts of appeal have appellate jurisdiction when superior courts have original jurisdiction and in other causes prescribed by statute\"] (italics added)) to provide for appellate review in the Court of Appeal of cases involving litigation originating and pending in the municipal court (see Code Civ. Proc., § 1110 \u0026 former § 904.1), litigants in those matters had no constitutional right to such an appeal. Indeed, the Legislature has complete control over appeals from the inferior courts. (Burrus v. Municipal Court (1973) 36 Cal. App. 3d 233, 238, 111 Cal. Rptr. 539.) Consistent with its constitutional authority, the Legislature in 1982 amended Code of Civil Procedure, former section 904.1, to preclude appeal of superior court orders granting or denying issuance of a writ of mandate or prohibition directed at a municipal court or a Judge thereof, and that relate to a matter pending in that inferior court. (See id. § 904.1, subd. (a)(1)(D); see generally Bermudez v. Municipal Court (1992) 1 Cal. 4th 855, 857-860, 823 P.2d 1210.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. The Minnesota Constitution, article VI, section 2, grants its state Supreme Court appellate jurisdiction \"in all cases\" -- a broad phrase that includes cases originating in the general trial courts (i.e., the \"district court\"), and the inferior trial courts created by the Legislature (i.e., the \"county court\"). (Minn. Const., art. VI, § 1.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. The issue in O'Rourke, supra, 220 N.W.2d 811, was whether a litigant whose case was tried in the inferior trial court (the \"county court\") had an appeal of right to the state Supreme Court, following an initial appeal to the district court \"acting in an appellate capacity.\" (Id. at p. 812.) The analogous question in California would be whether a municipal court litigant has an appeal of right to the Court of Appeal following an appeal to the superior court appellate department. Plainly, there is no such constitutional right in California.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. A few states modeled their appellate jurisdiction provisions on the approach taken in our 1848 and 1879 Constitutions. Although most state courts, like O'Rourke, supra, 220 N.W.2d 811, construed their provisions as not granting a right of appeal, like O'Rourke, those cases are distinguishable. First, although four states subsequently followed the California model (see Nev. Const. (1864) art. VI, § 4; Fla. Const. (1868) art. VII, § 5; Wn. Const. (1989) art. IV, § 4; Ariz. Const. (1912) art. V, § 4), their constitutional history reveals no evidence that the drafters viewed the \"appellate jurisdiction\" provision as establishing a right of appeal. (See Marsh, Official Report of the Debates and Proceedings in the Constitutional Convention of the State of Nevada (1866) 650, 712-713; Journal of the Proceedings of the Constitutional Convention of the State of Florida (1868), pp. 50-51; 101-102 [minutes]; Rosenow, ed., The Journal of the Washington State Constitutional Convention 1889 (1962), pp. 603-606 [minutes]; Goff, ed., The Records of the Arizona Constitutional Convention of 1910 (1991), 326-369.) Second, case law in those four jurisdictions is premised on the same point relied on in O'Rourke, supra, 220 N.W.2d 811, but rejected by this court in, among other cases, Jordan, supra, 65 Cal. 644, 646. Specifically, the cases hold, contrary to Jordan, supra, that their respective \"appellate jurisdiction\" provisions are not self-executing, and hence impose no duty on the state Supreme Court to entertain an appeal within its appellate jurisdiction. (State v. Creighton (Fla. 1985) 469 So. 2d 735, 737-740 [suggesting that before 1956, there was no state constitutional right of appeal]; Western American Co. v. St. Ann Co. (Wn. 1900) 22 Wash. 158, 60 P. 158, 161; Mohave County v. Stephens (Ariz. 1915) 17 Ariz. 165, 149 P. 670, overruled on other grounds in Gila County v. Inspiration Consolidated Copper Co. (Ariz. 1919) 20 Ariz. 503, 181 P. 955, 956-957; compare State v. McCormick (Nev. 1879) 14 Nev. 347, 349-350 [suggesting right of appeal in criminal cases] with Chapman Industries v. United Insurance Company of America (Nev. 1994) 110 Nev. 454, 874 P.2d 739, 740 [right of appeal is \"wholly derived from statute\"].) Decisions from three other states with roughly similar appellate jurisdiction provisions (see N.M. Const. (1912) art 6, § 2; Wis. Const. (1848) art. VII, §§ 3, 8; Mich. Const. (1850) art. VI, §§ 3, 8) are likewise distinguishable on at least this latter ground. (See, e.g., State v. Chacon (N.M. 1914) 19 N.M. 456, 145 P. 125, 126-128 and cases cited, superseded by constitutional amendment granting right of appeal -- see State v. Griffin (N.M. 1994) 117 N.M. 744, 877 P.2d 551, 553; State v. Chittenden (Wis. 1906) 127 Wis. 468, 107 N.W. 500, 513-514 and cases cited; Sullivan v. Haug (Mich. 1890) 82 Mich. 548, 46 N.W. 795, 797 and cases cited.) Again, in each case, the dispositive point was the court's Conclusion that its state's appellate jurisdiction provision was not intended by the drafters to be \"self-executing,\" but instead required action by the Legislature to authorize appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. See Times-Mirror, supra, 53 Cal. 3d 1325, 1333, footnote 6 (declining to resolve issue after seeking supplemental briefing); State Bd. of Control v. Superior Court (C009882) (review granted May 23, 1991, cause trans. to Ct. App. Dec. 19, 1991, \"with directions to vacate its decision and reconsider in light of [Times-Mirror, supra]\"). Even the Attorney General, who took diametrically opposed positions on the precise question posed here in Times-Mirror, supra (concluding section 6259(c) is constitutional) and State Bd. of Control, supra (concluding section 6259(c) is unconstitutional), has never offered the theory advanced by the lead opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. The Assembly Committee analysis, referred to in Times-Mirror, supra, 53 Cal. 3d 1325, 1335, noted that writ review, as compared with appeal, allows a court to \"decide[] without necessarily doing a full review of the evidence and testimony and without a hearing,\" and it similarly observed that writ review, unlike appeal, would not afford litigants a \"full hearing.\" (Assem. Com. on Judiciary, Analysis of Sen. Bill No. 2222 (1983-1984 Reg. Sess.) Aug. 6, 1984, pp. 2-3.) The Senate analysis was essentially identical. (Sen. Com. on Judiciary, Analysis of Sen. Bill No. 2222 (1983-1984 Reg. Sess.) pp. 3-4.) Later, an analysis prepared for the Assembly Committee on the Judiciary observed that review by appeal, unlike writ review, \"affords a method of attack on the intrinsic merit of the order or judgment\" (Assem. Com. on Judiciary, Analysis of Sen. Bill No. 2272 (1989-1990 Reg. Sess.) Aug. 15, 1990, p. 1), and contrasted writ review with review on appeal, in which \"a full hearing is granted by the appellate court, the evidence is reviewed, and a decision is made by the court. . . .\" (Id. p. 3, italics added.) Again, the Senate analysis was essentially identical. (Sen. Com. on Judiciary, Analysis of Sen. Bill No. 2272 (1989-1990 Reg. Sess.) Apr. 3, 1990, pp. 1-2.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. See, e.g., Tyler, supra, 65 Cal. 28, 29-31, and cases cited.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. It has long been established that there is no constitutional right of appeal from the denial of writ of habeas corpus. (Matter of Zany (1913) 164 Cal. 724, 729, 130 P. 710; see also In re Wells (1917) 174 Cal. 467, 473, 163 P. 657; In re Crow (1971) 4 Cal. 3d 613, 621, fn. 8, 94 Cal. Rptr. 254, 483 P.2d 1206.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. See ante, footnote 45.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. See ante, footnote 33.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. Our cases have long recognized that the Legislature has authority, in situations involving a discrete preliminary issue unrelated to the substantive merits of an underlying cause of action, to limit review to that available by discretionary writ, and to foreclose review of such a preliminary issue on appeal, even from a subsequent final judgment. (McCorkle v. City of Los Angeles (1969) 70 Cal. 2d 252, 257-258, 74 Cal. Rptr. 389, 449 P.2d 453 [so construing Code Civ. Proc., former § 416 (present § 418.10), concerning challenges to personal jurisdiction]; People v. Chi Ko Wong, supra, 18 Cal. 3d 698, 709-714 [so construing Welf. \u0026 Inst. Code, § 800, and Pen. Code, § 1259, thus making a juvenile court certification order reviewable exclusively by discretionary writ, and not on appeal from a final judgment]); People v. Brown, supra, 6 Cal. 4th 322, 335 [so construing Code Civ. Proc., § 170.3(d), insofar as it applies to statutory judicial disqualification claims].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. See Government Code, former section 1227 (\"The public records in the office of any officer, except as otherwise provided, are at all times during office hours open to inspection by any citizen of the State\") added by Statutes 1951, chapter 655, section 23, page 1851, and repealed by statutes 1968, chapter 1473, section 38, page 2945, replacing former Political Code, section 1032 (substantially the same) adopted in 1872; Code of Civil Procedure, former sections 1892 (\"Every citizen has a right to inspect and take a copy of any public writing of this State, except as otherwise expressly provided by statute\"), 1888 (defining \"public writings\"), and 1894 (classifying \"public writings\") all adopted 1872 and repealed by Statutes 1968, chapter 1473, sections 24, 25, 27, page 2945.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. See Colnon v. Orr (1886) 71 Cal. 43, 11 P. 814; Harrison v. Powers (1912) 19 Cal. App. 762, 127 P. 818; Mushet v. Department of Pub. Service (1917) 35 Cal. App. 630, 170 P. 653; Coldwell v. Board of Public Works (1921) 187 Cal. 510, 202 P. 879; Runyon v. Board Etc. of Cal. (1936) 26 Cal. App. 2d 183, 79 P.2d 101; Bruce v. Gregory (1967) 65 Cal. 2d 666, 56 Cal. Rptr. 265, 423 P.2d 193.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. The Act repealed a number of statutes that had, for almost 100 years, granted a right of access to public records (see ante, fn. 56), as well as scores of disparate statutes that set out various exceptions to disclosure (see, e.g., statutes listed in Comment, Access to Government Information in California (1966) 54 Cal.L.Rev. 1650, 1671-1677), and replaced them with a comprehensive scheme designed to collect, clarify, and redefine a public right of access to governmental information. (See Shaffer et al., A Look at the California Records Act and its Exemptions (1974) 4 Golden Gate L.Rev. 203; Comment, The California Public Records Act: The Public's Right of Access to Governmental Information (1976) 7 Pac.L.J. 105; see also Times Mirror, supra, 53 Cal. 3d 1325, 1338; American Civil Liberties Union Foundation v. Deukmejian (1982) 32 Cal. 3d 440, 447, 186 Cal. Rptr. 235, 651 P.2d 822; Cal. Public Records Act of 1968, Assem. Com. on Statewide Information Policy Rep. (1970) pp. 7, 8, 1 Append. to Assem. J (1970 Reg. Sess.).)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. See Uribe v. Howie (1971) 19 Cal. App. 3d 194, 96 Cal. Rptr. 493; Yarish v. Nelson (1972) 27 Cal. App. 3d 893, 104 Cal. Rptr. 205; Statewide Homeowners, Inc. v. Williams (1973) 30 Cal. App. 3d 567, 106 Cal. Rptr. 479; Rosenthal v. Hansen (1973) 34 Cal. App. 3d 754, 110 Cal. Rptr. 257; Black Panther Party v. Kehoe (1974) 42 Cal. App. 3d 645, 117 Cal. Rptr. 106; Cook v. Craig (1976) 55 Cal. App. 3d 773, 127 Cal. Rptr. 712; American Federation of State Etc. Employees v. Regents of University of California (1978) 80 Cal. App. 3d 913, 146 Cal. Rptr. 42; Northern Cal. Police Practices Project v. Craig (1979) 90 Cal. App. 3d 116, 153 Cal. Rptr. 173; American Civil Liberties Union Foundation v. Deukmejian (1982) 32 Cal. 3d 440, 186 Cal. Rptr. 235, 651 P.2d 822; Johnson v. Winter (1982) 127 Cal. App. 3d 435, 179 Cal. Rptr. 585; Eskaton Monterey Hospital v. Myers (1982) 134 Cal. App. 3d 788, 184 Cal. Rptr. 840; Pantos v. City and County of San Francisco (1984) 151 Cal. App. 3d 258, 198 Cal. Rptr. 489; Register Div. of Freedom Newspapers, Inc. v. County of Orange (1984) 158 Cal. App. 3d 893, 205 Cal. Rptr. 92; South Coast Newspapers, Inc. v. City of Oceanside (1984) 160 Cal. App. 3d 261, 206 Cal. Rptr. 527; Citizens for a Better Environment v. Department of Food \u0026 Agriculture (1985) 171 Cal. App. 3d 704, 217 Cal. Rptr. 504.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. Speedy final resolution by discretionary writ will be the rule in all cases in which the litigant -- government or private entity -- elects to accept denial of discretionary writ review as the end of the litigation and declines to appeal. For the following reasons, this will probably be the course of most litigation under the PRA: If the trial court denies disclosure, and the litigant is thereafter denied writ review, a private-party litigant will often have little practical reason to appeal, because time-sensitive information will be less useful or newsworthy after the lengthy appeal process is exhausted. On the other side of the coin, if the trial court orders disclosure and the government is thereafter denied writ review, unless it can obtain a stay of the disclosure (which, under section 6259(c) \"shall not be granted unless the petitioning party demonstrates it will otherwise sustain irreparable damage and probable success on the merits\"), it may conclude an appeal is useless (unless, perhaps, an important institutional principle is at stake).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. Of course, in such a situation, the law of the case doctrine does not apply. (See Kowis v. Howard (1992) 3 Cal. 4th 888, 894-899, 838 P.2d 250.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. As suggested above (ante, at pp. 26-27), article VI, section 14 would also appear to prohibit a Court of Appeal from summarily denying writs such as this, which dispose of the entire cause of action. Accordingly, although the issue is not now before the court, it would appear that the Court of Appeal's summary denial of plaintiffs' writ petition was improper under article VI, section 14.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. We have recently construed two key statutes, both of which were claimed to bar appellate review of certain issues after a final judgment in the superior court, as not having that effect. (See In re Matthew C., supra, 6 Cal. 4th 386 [construing Welf. \u0026 Inst. Code, § 366.26]; Brown, supra, 6 Cal. 4th 322, 335 [construing Code Civ. Proc., § 170.3, subd. (d), as inapplicable to \"nonstatutory\" claims supporting judicial disqualification].) As noted above, Code of Civil Procedure section 904.1, subdivision (a)(1)(D), has since 1982 barred appeal in a subset of cases within the original jurisdiction of the superior court -- i.e., \"a judgment granting or denying a petition for issuance of a writ of mandamus or prohibition directed to a municipal court or Justice court or the Judge or Judges thereof which relates to a matter pending in the municipal or Justice court\" -- but as explained, ante, footnote 45, the Legislature has constitutional authority to bar such appeals, which in essence concern litigation originating and pending in the inferior courts. Nor would Penal Code section 1237.5, which severely limits appeal after a guilty plea, be cast in doubt if we were to recognize a state constitutional right of appeal. As observed above, the Legislature is not precluded from imposing restrictions on the constitutional right of appeal; it may condition that right, but not \"substantially impair\" it. A defendant has notice of the conditions placed on his appeal rights when he enters a guilty plea. It is one of the factors he considers when deciding whether to plead guilty or to put the People to proof at trial. He waives his state constitutional appeal right by pleading guilty, and retains only such appeal rights as are granted to him by statute. The constitutionality of Penal Code section 1237.5 is not thereby implicated; that section merely defines a consequence of waiving trial and entering a guilty plea. In this regard, I note that because there is no federal constitutional right of appeal (Ross v. Moffitt (1974) 417 U.S. 600, 606, 611, 41 L. Ed. 2d 341, 94 S. Ct. 2437; Abney v. United States (1977) 431 U.S. 651, 656, 52 L. Ed. 2d 651, 97 S. Ct. 2034), the absence of an express a waiver of appeal rights would pose no federal constitutional problem. Nor, as we explained in In re Tahl, supra, 1 Cal. 3d 122, would the absence of an express waiver of state constitutional appeal rights render a guilty plea invalid under California law. In re Tahl stands for the proposition that the guilty plea requirements of Boykin v. Alabama (1969) 395 U.S. 238, 23 L. Ed. 2d 274, 89 S. Ct. 1709, apply to certain federal rights. Consistently with our analysis in In re Tahl, supra, 1 Cal. 3d 122, I would not read Boykin, supra, 395 U.S. 238, or its progeny, as supporting a claim that the state constitutional right of appeal must be expressly waived before the state may enforce a plea or limit appeal under Penal Code section 1237.5.\u003c/span\u003e\n\n",
    "body_length": 291660,
    "citedas": [
      "10 Cal.4th 85",
      "893 P.2d 1160",
      "40 Cal.Rptr.2d 839"
    ],
    "attorneys": "Pelletreau, Moses, Alderson \u0026 Cabral and Alfred A. Cabral for Plaintiffs and Appellants. Malcolm Hunter, City Attorney, and Everett Jenkins, Assistant City Attorney, for Defendant and Respondent.",
    "category": [
      "242",
      "243",
      "75"
    ],
    "judges": "Kennard, J.; Baxter, J. and Werdegar, J., Concurring. George, J.; Concurring separately, Arabian, J., Concurring. Lucas, C.J.; Dissenting separately, Mosk, J., Concurring.",
    "citation_count": 92
  }
}
