{
  "id": "lLJETGYBTlTomsSBZh0m",
  "document": {
    "title": "In re Asbestos",
    "full_title": "IN RE ASBESTOS v. BORDELON, INC., (FORMERLY THE BORDEN COMPANY); ET AL.",
    "jurisdiction": "Louisiana Court of Appeal",
    "date": "1998-10-21T00:00:00.000Z",
    "docket": "No. 96-CA-0525.",
    "body": "ASBESTOS v. BORDELON, INC., 96-0525 (La.App. 4 Cir. 10/21/98)\n\nOpinion Denying Rehearing December 9, 1998.\n\nThis appeal arises out of a consolidated lawsuit filed by approximately 2995 individuals employed at Avondale Shipyards between 1938 and 1995. The lawsuits giving rise to this appeal were instituted on behalf of individuals who were exposed to asbestos while working at Avondale Shipyards. The Plaintiffs claim that as a result of their exposure they suffered asbestosis, cancer, or other health problems related to continuous exposure to asbestos. The Defendants are a number of companies who manufactured and supplied asbestos-containing products to Avondale Shipyards. For judicial economy the Plaintiffs or their survivors were divided into \"Flights\" of approximately 10 individuals. Flights One and Two are the subjects of this appeal.\n\nFACTS\n\nDue to the nature of shipbuilding and repair, the Plaintiffs in this case were exposed to different levels of asbestos at different times, under a variety of conditions, and at diverse locations within the shipyard. The Plaintiffs' exposures were scattered and varied throughout the shipyard. Plaintiffs' petitions allege that individuals contracted a variety of medical problems, namely asbestosis and lung cancer, as a result of their exposure to asbestos.\n\nFlight One Plaintiffs consist of the following seven individuals: Clifton Abadie, Horace Bordelon, Jr., Joseph Constant, Thomas Naquin, Clovis Orgeron, Robert Terrebonne, and Clifton Washington.\n\nFlight Two Plaintiffs consist of the following seven individuals: Louis Duplantis, Romain Duronslet;, Willie Jackson, Nelson LaBorde, Dean Mefferd, Lester Plaisance, and Louis Rodriquez.\n\nThe Defendants in this matter fall into two distinct categories. The first are the manufacturers and suppliers of asbestos containing products, and the second are the manufacturers of respiratory devices used to reduce asbestos exposure. The Defendants in Flights One and Two are Owens-Corning Fiberglass Corporation (OCF), Owens-Illinois, Inc., Pittsburgh-Corning Corporation, Rock Wool Manufacturing Company, Anchor Packing Company, Fibreboard Corporation, Garlock, Inc., A.W. Chesterson Company, Flexitallic, Inc., Hopeman Brothers, Inc., Westinghouse Electric Corporation, and Uniroyal, Inc.\n\nPlaintiffs' former employer, Avondale Shipyards, along with certain executive officers, were also named as Defendants in this matter. However, Avondale negotiated a settlement with Plaintiffs in Flights One and Two, thereby avoiding litigation.\n\nFLIGHT ONE TRIAL\n\nThe Flight One trial began on January 19, 1994. The Defendants in Flight One were OCF, Owens-Illinois, Pittsburgh-Corning, Rock Wool, Fibreboard, and Flexitallic. The other Defendants were either dismissed by the trial court or negotiated settlements prior to trial. During the course of the Flight One trial, the trial court granted a motion for directed verdict in favor of Flexitallic. At the Conclusion of the Flight One trial the jury returned verdicts awarding damages to the following Plaintiffs: Joseph Constant ($375,000), Clovis Orgeron, Sr. ($375,000), and Horace Bordelon, Jr. ($200,000).\n\nPlaintiff, Clifton Washington, died prior to the commencement of the trial; however, the jury awarded damages to his wife and children under their wrongful death and survival actions. Albertha Washington, the Plaintiff's spouse received $300,000 in damages for her wrongful death claim. Kenneth and Chris Washington, the Plaintiff's children, received $50,000 each for their wrongful death claims. The jury also awarded the Washingtons $100,000 for their survival action claim. The judgments were entered March 18, 1994. Subsequently, in Flight One, each judgment awarding monetary damages was reduced by a single virile share to reflect the settlement Fibreboard negotiated after the verdict.\n\nThe jury also awarded monetary damages to Clifton Abadie, Thomas Naquin, and Robert Terrebonne. Disregarding the jury's monetary awards to Mr. Abadie, Mr. Naquin, and Mr. Terrebonne, the trial court rendered and signed judgments against these three plaintiffs in favor of the defendants. The trial court's judgments were consistent with the jury's determinations that neither of the three plaintiffs suffered an asbestos related injury. As a result Mr. Abadie, Mr. Naquin, and Mr. Terrebonne were denied the monetary damages established by the jury. These three plaintiffs then filed motions for judgment notwithstanding the verdict (JNOV) and in the alternative motions for a new trial. The trial court denied both motions.\n\nFLIGHT TWO TRIAL\n\nThe Flight Two trial commenced on June 22, 1994. The Defendants in Flight Two were OCF, Owens-Illinois, Pittsburgh-Corning, Rock Wool, Anchor Packing, Garlock, A.W. Chesterson, Flexitallic, Hopeman Brothers, and Westinghouse. Prior to trial other Flight Two Defendants were dismissed by the trial court or they negotiated a settlement with the Plaintiffs.\n\nAt the completion of the Flight Two trial the jury returned verdicts awarding damages to the following parties: Nelson LaBorde ($375,000), Louis Rodriquez ($300,000), Willie Jackson ($250,000), and Louis Duplantis ($300,000). After the verdicts in favor of the Plaintiffs, A.W. Chesterton filed motions for JNOV or, in the alternative, a motion for a new trial. The trial court granted Chesterton's JNOVs to all Flight Two plaintiffs except Dean Mefferd and Romain Duronselet. The jury awarded both of these Plaintiffs damages in the amount $250,000 against Defendants, A.W. Chesterson and Garlock. The judgments were entered by the trial court on December 16, 1994. Subsequently, in Flight Two each monetary judgment awarding damages was reduced by the virile shares represented by three of the Avondale executive officers, each of whom had settled with the Plaintiffs but had been found liable, by the jury, for their Plaintiffs' injuries.\n\nPlaintiff, Lester Plaisance, was dismissed by the trial court from the lawsuit when OCF and other Defendants moved for a directed verdict at the close of the Plaintiff's case, on the grounds that Lester Plaisance's claim had prescribed prior to his filing suit in October 1991.\n\nThese consolidated appeals arise from rulings by the trial court and the jury verdicts entered in favor of both the Plaintiffs and Defendants in both flights.\n\nDISCUSSION\n\nASBESTOS-CONTAINING PRODUCTS\n\nThe asbestos-containing products complained of in Flights One and Two involved thermal pipe insulation, cement blocks, asbestos cloth, and gaskets.\n\nThe thermal pipe insulation called \"Kaylo insulation\" was manufactured by Owens-Illinois (Owens), and Owens-Illinois was later taken over by Owens-Corning Fiberglass (OCF) in May, 1958. Kaylo insulation was composed from raw material that was mined from the earth, and included two types of asbestos fibers Ä amosite and chrysolite.\n\nThe asbestos component of Kaylo insulation made it susceptible to temperatures ranging from 1200 to 1800 degrees Fahrenheit. Kaylo insulation came in two halfmoon, crescent-shaped pieces. Once the Kaylo pipe insulation package was opened, the insulator would measure the pipe to which he wanted to apply the insulation, then cut the Kaylo insulation with a handsaw, tie both pieces together with a wire and wrap asbestos cloth around the pipe and secure it with asbestos cement for added protection.\n\nFibreboard Corporation (Fibreboard), also manufactured thermal pipe insulation called PABCO which was similar in structure and composition to that of Kaylo, but was not as widely used by Avondale employees. Pittsburgh Corning Corporation (Pittsburgh), manufactured a product called Unibestos thermal insulation. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nA.W. Chesterton Company (Chesterton), manufactured both asbestos and non-asbestos white braided packing material which was designed to seal the valves in the engine rooms of the naval vessels at Avondale.\n\nFlexitallic, Inc., (Flexitallic) and Garlock, Inc., (Garlock) manufactured gaskets and packaging material which were used in the engine and boiler rooms of the vessels. Gaskets were used as a sealant between adjoining flanges, and the packing material was used between the valves to prevent leakage through the valve stem.\n\nRock Wool Manufacturing Company, (Rock Wool), manufactured two asbestos containing cements called One Shot cement and Delta Maid AF cement. As stated earlier, cement was used to secure the thermal pipe insulation onto the pipes after the asbestos pipe insulation and asbestos cloth were placed tightly around these pipes.\n\nMEDICAL TERMINOLOGY\n\nThroughout the course of the trials for both Flights One and Two, a number of medical terms were used by the medical experts and counsel for both parties to describe the diseases generally associated with exposure to asbestos, and more specifically those disease sustained by the plaintiffs who were exposed to asbestos fibers while employed at Avondale. Therefore, for clarity, we find it imperative that we, define the medical terms that were commonly used by Dr. Robert Jones and Dr. Louis Rubin, the physicians who treated each of the plaintiffs.\n\nFibrosis is a disease caused by the inhaling of a large amount of carcinogenic fibers into the lungs. This is a standard term used by pathologists to describe diseases caused by the inhalation of carcinogenic fibers. Because fibrosis has at least 100 known causes, we will limit our Discussion to those diseases and symptoms caused by the exposure to asbestos fibers.\n\nAsbestosis is a dose related disease associated with the inhalation of a large amount of asbestos fibers. Asbestosis is also known as interstitial fibrosis because these fibers are present along the fine membranes of the lungs which forms the boundary between the air or oxygen and the blood in the lungs.\n\nWhen the lungs have been scarred by a large amount of asbestos fibers, these fibers harden the lungs and interfere with a person's ability to inflate and deflate their lungs. Further, these fibers prevent the lungs from being able to transport oxygen into the bloodstream. Asbestosis has also been known to cause an extreme shortness of breath, thereby causing it to be classified as a restrictive disease. When fibrosis, in whatever form, interferes with the ease with which oxygen can pass out of the air through the lungs and into the bloodstream, then that person's diffusing capacity has been interrupted.\n\nTo determine whether a person's lungs have been affected by asbestos fibers, the physician examining that person measures the total lung capacity of that person when the lungs are fully inflated by conducting a pulmonary function test (PFT). When the amount of gas that person takes into his lungs is at least 80% of the amount of gas the average person of the same age, gender and height can take into his lungs, then the total lung capacity of the person tested is considered normal. Mild restrictive defect occurs when the amount of gas intake is between 65% and 80% of the normal range, and moderate restrictive defect occurs when the gas intake is less than 50%.\n\nNormally, only twenty percent of fibers inhaled into the body are deposited into the lungs. Further, these fibers can also migrate to the lining layer of the lungs in the chest wall called the pleura which acts as a cushion between the chest wall and the lungs when the lungs are inflated. When the pleura is overcome with asbestos fibers or bodies, it produces a pleura disease or pleural asbestosis. When the asbestos fibers are centralized in one area it produces pleural thickening or pleural plaques which are tumors or cancers of the pleura.\n\nA person with pleural plaques or pleural thickening is also under an increased risk of contracting mesothelioma which is a cancer of the pleura. This cancer is untreatable and causes intractable pain because the tumor encases the lung and causes the person to die due to suffocation. A person can contract this disease with as little as three (3) months of exposure to high levels of asbestos fibers. See also Egan v. Kaiser Aluminum \u0026 Chemical Corp., 94-1939 (La.App. 4 Cir. 5/22/96) 677 So.2d 1027, 1035, writ denied, 96-2401 (La. 12/6/96), 684 So.2d 930.\n\nDiseases associated with activities like cigarette smoking are obstructive diseases because these diseases cause the airways to become narrow thereby reducing the amount of gas into the lungs as we normally breathe in and breathe out. The most common type of obstructive diseases are emphysema and chronic bronchitis which are usually associated with cigarette smoking.\n\nAPPLICABLE LAW\n\nIn the first assignment of error, we consider the issue raised by Garlock, Inc. (Garlock), a Flight Two defendant, regarding the trial court's decision to implement the Supreme Court ruling in Halphen v. Johns-Manville Sales Corp., 484 So.2d 110 (La. 1986), as controlling law in this products liability case. This assignment of error was raised only in Flight Two; therefore, we shall limit our review to this flight only. Halphen is a Supreme Court decision which answered a certified question posed by the United States Court of Appeals for the Fifth Circuit, 755 F.2d 393, regarding Louisiana's products liability law prior to the enactment of the Louisiana Products Liability Act (LPLA) in 1988. The LPLA placed a higher burden of proof on the injured consumer by abolishing the \"unreasonably dangerous per se\" category in Halphen. The LPLA also required the consumer to prove by a preponderance of the evidence that the defective nature of the product at issue, and the manufacturer's knowledge of such defect existed before the product entered into commerce. See LSA-R.S. 9:2800.51 et seq., Acts 1988, No. 64, § 1, eff. Sept. 1, 1988.\n\nGarlock, a manufacturer of asbestos-containing gaskets and packing material, argues the trial court's use of Halphen was improper because the exposures complained of by the plaintiffs in Flight Two occurred either before the Halphen decision was rendered or after the enactment of the LPLA. Therefore, Garlock argues that either the 1971 Supreme Court decision in Weber v. Fidelity \u0026 Casualty Insur. Co. of N.Y., 259 La. 599, 250 So.2d 754 (La. 1971), or the LPLA should have been the controlling authority for this action.\n\nGarlock also argues the plaintiffs must show that their cause of action arose prior to the enactment of the LPLA, and they must prove their cause of action resulted from repeated and continuous exposure to asbestos fibers with on-going damages. Cole v. Celotex Corp., 599 So.2d 1058, 1066 (La. 1992). Moreover, Garlock argues the plaintiffs in Flight Two broke their consistent pattern of exposure to asbestos fibers when they terminated their employment with Avondale before their alleged lung problems had surfaced. Garlock further argues Halphen is inapplicable because plaintiffs filed their Petition for Damages after the LPLA was enacted. Therefore, Garlock concludes the trial court should have implemented Weber as controlling law considering this Court's decision in Young v. Logue, 94-0585 (La. App. 4 Cir. 5/16/95), 660 So.2d 32, writ denied, 95-2575, 96-2585, 95-2597 (La. 12/15/95), 664 So.2d 444. We disagree for several reasons.\n\nThe issue of applying Halphen in Flight Two is dependent upon when the plaintiffs' cause of action arose, and it is dependent upon whether Halphen, Weber or the LPLA was in effect at that time. However, before we began our Discussion on the issue of Halphen's applicability in Flight Two, we must first determine whether Halphen, a 1986 decision, or Weber; a 1971 decision, can be used in the trial of a lawsuit filed in 1991, after the enactment of the LPLA.\n\nThe Supreme Court in Cole noted that the reviewing court must implement a two-fold inquiry under LSA-C.C. art. 6, to resolve this question.\n\n\"LSA-C.C. art. 6, requires that we engage in a two-fold inquiry. First, we must ascertain whether in the enactment the legislature expressed its intent regarding retrospective or prospective application. If the legislature did so, our inquiry is at an end. If the legislature did not, we must classify the enactment as substantive, procedural or interpretive. Cole, supra, p. 1063.\"\n\nSubstantive laws, in the absence of contrary legislative expression, apply prospectively only because they establish new rules, rights, and duties or change existing ones. McCann v. Normand, 97-103 (La. App. 3 Cir. 6/4/97), 696 So.2d 203, 206; citing Segura v. Frank, 93-1271, 93-1401 (La. 1/14/94); 630 So.2d 714, cert. denied, 511 U.S. 1142, 114 S.Ct. 2165, 128 L.Ed.2d 887 (1994). Although the LPLA is not specifically classified as substantive, procedural or interpretive law, the Supreme Court and this Court have declared the LPLA to be substantive law.\n\n\"Since the [LPLA] alters substantive rights, it is not retroactive and does not apply to this lawsuit. A statute that changes settled law relating to substantive rights only has prospective effect.\" Gilboy v. American Tobacco Co., 582 So.2d 1263 (La. 1991)\n\nTherefore, in light of Gilboy, the LPLA has prospective effect only because it overruled Halphen. Nevertheless, our inquiry is not complete until we ascertain when the plaintiffs' cause of action accrued.\n\nGenerally, the determinative point in time separating prospective from retroactive application of an enactment is the date the cause of action accrues. Cole, 599 So.2d at 1062. Accrual of a cause of action is when a suit may legally be instituted on the cause of action, that is, when it becomes immediately enforceable. DeGeorge v. Allstate Insurance Co., 93-612 (La. App. 5 Cir. 1/25/94), 631 So.2d 1257, 1261. Once a party's cause of action accrues, it becomes a vested property right that may not constitutionally be divested. Cole, supra, p. 1063; citing Crier v. Whitecloud, 496 So.2d 305, 308 (La. 1986).\n\nThe primary elements for asserting a cause of action in Louisiana are: (1) defining a wrongful act by the defendant; and (2) declaring damages resulting from this act. See LSA-C.C. art. 2315 et seq. However, in an asbestos-related cases, damages resulting from the wrongful act are not as immediately evident as they are in traditional personal injury cases because the latency period in an asbestos case can last for a decade or longer. See Cole, supra.\n\nThe Supreme Court has concluded that in order for the plaintiffs to prevail, they must prove their exposure to asbestos was done repeatedly, resulting in continuous, on-going damages. In other words, the plaintiff must prove to the trier of fact that his exposure to asbestos was consistent, regular and frequent, and that his damages resulted from his exposure. The Supreme Court went on to say:\n\n\"We further concluded that when the tortious exposures occurring before [LPLA's] effective date are significant and such exposures later result in the manifestation of damages, pre-Act law applies.\" Cole, supra, 1066.\n\nIn both Flights One and Flight Two, it was uncontroverted that all of the named plaintiffs in both flights received some form of exposure to asbestos-containing products prior to the enactment of the LPLA, namely between the 1950s and the early 1980s. With the exception of Romain Duronselet, Joseph Constant, Clifton Abadie and Nelson LaBorde, all of the plaintiffs in both flights were employed at Avondale not later than 1984, and the average length of their employment was at least 20 years. Each plaintiff's occupational duties required tearing, mixing, repairing, or hauling discarded asbestos products on a regular, consistent basis. Hence, the record supports the Conclusion that the plaintiffs, particularly those in Flight Two, satisfied their burden by showing that they encountered significant pre-LPLA exposure to asbestos dust and fibers sufficient to implement pre-LPLA law to their claim. Notwithstanding the fact that the consolidated petitions for damages were filed in 1991, the pre-LPLA law applies in the case sub judice, and particularly in Flight Two.\n\nWe now must determine whether Halphen or Weber should have been applied in Flight Two. In Young, we stated that \"[c]auses of action that arose prior to Halphen are governed by the law of products liability as expressed in Weber and its progeny\". See Young, 660 So.2d at 53. Though there were plaintiffs in Flight Two who continued their employment with Avondale in the 1980s, the record reveals that each plaintiff received substantial injury-producing exposures prior to 1986, the year Halphen was decided. Therefore, because Halphen cannot be applied retroactively, it was improper for the trial court to charge the jury using the language of Halphen.\n\nThe record is void of any indication Garlock objected to the jury charges or the special jury interrogatories using from Halphen. Without making a timely objection to the trial court's use of Halphen, Garlock failed to preserve this issue for appeal, and we cannot say that the use of Halphen by the trial court in the jury instructions was anything more than harmless error.\n\n\"A party may not assign as error the giving or the failure to give an instruction unless he objects thereto either before the jury retires to consider its verdict or immediately after the jury retires, stating specifically the matter to which he objects and the grounds of his objections.\" LSA-C.C.P. art 1793 (C). (Emphasis added).\n\nAn appellate court must exercise great restraint before overturning a jury verdict on the suggestion that the instructions were so erroneous as to be prejudicial. Doyle v. Picadilly Cafeterias, 576 So.2d 1143 (La. App. 3 Cir. 1991). This manifest error standard of review may not be ignored unless the proposed jury instructions are so incorrect or inadequate as to preclude the jury from reaching a verdict based on the law and the facts. Lee v. Automotive Cas. Insur. Co., 96-517 (La. App. 3 Cir. 11/6/96), 682 So.2d 995, 997, writ denied, 96-2949, 687 So.2d 409 (La. 1/31/97). (Emphasis added). In order to preserve an objection to a jury charge for appeal, a party must specifically object at trial and must state the reasons for the objection, and a general objection is insufficient. Bourgeois v. Puerto Rican Marine Management, Inc., 589 So.2d 1226 (La. App. 4 Cir. 1991), writ denied, 592 So.2d 1299, 1300 (La. 1992). Rule preventing party from assigning jury instruction as error absent a specific objection at trial also applies to jury interrogatories. Vaughan Contractors, Inc. v. Cahn, 629 So.2d 1225 (La. App. 4 Cir. 1993), writ denied, 94-0393, (La. 4/22/94), 637 So.2d 156.\n\nThe record in Flight Two does not reveal that Garlock suffered any prejudices by having Halphen applied as the law of the trial. Courts have also opined that de novo review of jury instructions is not warranted where prejudice cannot be shown.\n\n\"Moreover, the party alleging error has the burden of showing the error was prejudicial to its case. The determination is whether the error, when compared to the record in its totality, has a substantial effect on the outcome of the case. Absent a prejudicial error of law, this Court is not required to review the appellate record de novo.\" LSA-C.E. art. 103; Brumfield v. Guilmino, 93-0366, (La. App. 1 Cir. 3/11/94), 633 So.2d 903, 911, writ denied, 94-0806 (La. 5/6/94), 637 So.2d 1056; see also Rosell v. ESCO, 549 So.2d 840, 844 n. 2 (La. 1989), and LSA-C.E. art. 103. (Emphasis added).\n\nFurther, nothing in the records supports Garlock's allegation that had Halphen not been applied there would have been a different verdict. Therefore, the issue of whether Halphen was applicable in the trial of Flight Two is not properly before us because it was not preserved for appeal.\n\nProducts Liability law under Halphen\n\nIn Halphen, plaintiff contracted a malignant mesothelioma caused by his exposure to various asbestos products. Halphen filed suit in the United States District Court for the Western District of Louisiana against 16 asbestos products manufacturers seeking recovery under the theory of strict liability. All defendants were dismissed prior to trial except Johns-Manville, a manufacturer of asbestos insulation. Plaintiff later died, and his wife was substituted as party-plaintiff. Following trial, the jury returned a verdict in favor of the plaintiff.\n\nJohns-Manville appealed arguing it was not strictly liable for the illness and death of the plaintiff resulting from plaintiff's exposure to its asbestos insulation because it was not foreseeable that such exposure would cause this type of harm. The court affirmed the jury's verdict stating that a manufacturer is presumed to know the defects inherent in its product, and that foreseeability is immaterial. Chief Judge Clark Dissented from the majority because he found that erasing the foreseeability element from a products liability case amounts to placing absolute liability on the manufacturer which \"files in the face of the Restatement's teaching that unsafe products can be marketed with proper warnings.\" Halphen v. Johns-Manville Sales Corp., 737 F.2d 462, 470 (5th Cir. 1984). In response to this Dissent, the Fifth Circuit en banc decided to vacate the panel's opinion and certify the question to the Louisiana Supreme Court.\n\nThe certified question provides:\n\n\"May a manufacturer be held liable for injuries caused by an unreasonably dangerous product if the manufacturer establishes that it did not know and reasonably could not have known of the inherent danger posed by its product?\"\n\nHaving determined that Halphen can be applied in the trials of both Flights One and Two, we consider the principles, reasoning and analysis of the Louisiana Supreme Court as it answered the certified question in Halphen, and we evaluate those principles against the facts and circumstances of each flight.\n\nIn answering this question, our Supreme Court noted that the plaintiff must satisfy three essential prerequisites before he can prevail in his claim. The three prerequisites are: (1) the injury suffered by the plaintiff must have resulted from a condition of the product; (2) the condition made the product unreasonably dangerous to normal use; and (3) the condition complained of existed at the time the product left the manufacturer's control. See Halphen, supra p. 113. In other words, recovery is allowed so long as the injured party proves by a preponderance of the evidence that the product which caused his harm was defective when it left the manufacturer's hands. Norris v. Bell Helicopter Textron, 495 So.2d 976, 981 (La. App. 3rd Cir. 1986), writ denied, 499 So.2d 85 (La. 1987); citing Madden v. Louisiana Power and Light Co., Inc., 334 So.2d 249, 253, 255 (La. App. 4th Cir. 1976).\n\nUnder Halphen, the plaintiffs in Flights One and Two are not required to provide a showing of the manufacturer's negligence in a products liability case, but rather must establish the manufacturer's legal relationship to the \"defective\" product. Consequently, the manufacturer cannot offer his knowledge or lack thereof concerning the condition of the product as a method to exonerate it from liability. Bell v. Jet Wheel Blast, Division of Ervin Industries, 462 So.2d 166 (La. 1985) and Hebert v. Brazzel, 403 So.2d 1242 (La. 1981).\n\nOnce these plaintiffs have crossed these preliminary hurdles, they must identify the theories under which they plan to pursue their claim. Although Halphen outlines four principles of recovery, we shall limit our Discussion to the three principles used in both flights: (1) unreasonably dangerous per se; (2) unreasonably dangerous because of its design; and (3) unreasonably dangerous because of a failure to warn.\n\nUNREASONABLY DANGEROUS PER SE\n\nThe jury in Flight One found that OCF, Rock Wool, Fibreboard and Owens-Illinois were negligent because these manufacturers produced products which were unreasonably dangerous per se.\n\n\"Unreasonably dangerous per se\" denotes a product that is defective due to the fact that the risk imposed on the user outweighs the social utility of the product. In other words, the product's benefit to society is overshadowed by its potential for causing harm to the average consumer. However, evidence concerning the manufacturer's conduct, knowledge or technology is irrelevant in this equation. Halphen, supra, p. 114; see also Bloxom v. Bloxom, 494 So.2d 1297, 1302 (La. App. 1986).\n\nThe risk-utility test employed by the trier of fact is dependent upon whether the injury sustained by the plaintiff is attributed to the \"normal use\" of the product. Normal use is a matter of foreseeable use and may include something broader than operation exactly in accordance with the manufacturers instructions. Bloxom, 494 So.2d at 1304.[I]t is a term of art that includes all intended uses, as well as all foreseeable uses and misuses of the product. Page v. Gilbert, 598 So.2d 1110, 1116 (La. App. 4 Cir. 1992), writ denied, 605 So.2d 1146 (La. 1992); citing Rey v. Cuccia, 298 So.2d 840 (La. 1974); and Branch v. Chevron International Oil Co., Inc., 681 F.2d 426 (5th Cir. 1982). When the victim or a third party engages in conduct that ignores or disregards an obvious or well-known danger, this conduct is not normal use. Whitacre v. Halo Optical Products, Inc., 501 So.2d 994, 999 (La. App. 2nd Cir. 1987); Savoie v. Deere \u0026 Co., 528 So.2d 724, 733 (La. App. 1st Cir. 1988), writ denied, 532 So.2d 177 (La. 1988), (Emphasis theirs). While the manufacturer must provide a reasonably safe product, he does not insure against conduct not in normal use. Clark v. Jesuit High School of New Orleans, 96-1307 (La. App. 4 Cir. 12/27/96), 686 So.2d 998, 1002. Hence, the injury resulting from normal or intended use of the product is just as essential in a products liability claim as the danger-in-fact of the product.\n\nIn the trial of Flight One, the jury found products manufactured by Pittsburgh, OCF, Owens-Illinois, Fibreboard, Rock Wool and Flexitallic were unreasonably dangerous per se, defective by design, and defective because of a failure to warn. In Quick v. Murphy Oil Co., 93-2267 (La. App. 4 Cir. 9/20/94), 643 So.2d 1291, writ denied, 94-2583 (La. 1/6/95), 648 So.2d 923, this Court stated that when evaluating asbestos cases involving multiple defendants, the substantial factor inquiry is suitable when there are two or more combined causes present. In the cases sub judice, products in Avondale's pipe department were made by various manufacturers, but used in the same general vicinity. Hence, we find that labeling one product unreasonably dangerous per se when there are several products allegedly emitting the same harmful carcinogens in the breathing zone of the workers is difficult, at best. Therefore, we must determine whether any one product made by an individual manufacturer was a substantial factor in bringing about the plaintiffs' injuries.\n\nOCF argues in brief that asbestos-containing pipe insulation, namely its Kaylo insulation, was not unreasonably dangerous per se because of the numerous societal benefits it had, especially in the construction of war vessels during World War II. OCF further argues that notwithstanding the fact that prolonged periods of exposure to asbestos was harmful, the United States developed a \"threshold limit value for exposure to asbestos\" which was derived from a 1946 study known as the Dreason study. This study outlined a permitted level of exposure to this product which OCF argues the plaintiffs in this appeal did not surpass because they were not constantly exposed to asbestos in its \"raw\" form. Additionally, OCF contends that because the plaintiffs worked in a variety of crafts which did not require constant exposure to asbestos-containing products, the incidents of asbestosis among these plaintiffs were either low or nonexistent.\n\nPlaintiffs respond that OCF's argument in favor of its Kaylo insulation centered mainly on this product having been useful to society and the ship building industry, but this argument purposefully fails to disclose the hazards associated with the use of Kaylo insulation. Plaintiffs further argue their individual testimony regarding how frequently Kaylo insulation was used, together with the testimony of OCF's former employees was conclusive proof that Kaylo insulation was unreasonably dangerous per se. Furthermore, plaintiffs contend that any information, testimony or documents used to support the state-of-the-art defense proposed by OCF is irrelevant. We agree.\n\nOwens-Corning Fiberglass\n\nIn the cases sub judice, we recognize that Kaylo insulation was instrumental in the construction and repair of oceangoing vessels during World War II, and it was uncontroverted at both trials that Kaylo insulation was specifically designated by the federal government to be used in insulating these vessels; notwithstanding the asbestos content. However, we must evaluate this product not based on its popularity or the existing technology available to the manufacturer during the late 1940s, when Kaylo insulation began selling in large numbers, but we must evaluate Kaylo insulation based on its utility to the shipping industry and the impact Kaylo insulation had on the health of society as a whole.\n\nThe \"unreasonably dangerous per se\" category as stated in Halphen is recognized as a separate class of defective products, and is evaluated based on the intrinsic characteristics of the product irrespective of the manufacturer's intent, knowledge or conduct. Halphen, p. 113. To properly evaluate the product, the trier of fact must employ a balancing test which weighs the product's usefulness versus the risk it imposed, and if a reasonable person would conclude that the danger imposed by the product outweighs the benefits, then the product is labeled as \"unreasonably dangerous per se\". Id.; see also William E. Crawford, Developments in the Law, 1985-1986-Part I, 47 La.L.Rev. 485, 488 (1986) (discussing evidence admissible under this theory).\n\nMr. Willis G. Hazard, plaintiffs' expert witness and former industrial hygienist of Owens-Illinois \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e (Owens) from 1934 to 1974, testified by deposition, that Owens was the original manufacturer of Kaylo insulation. He also testified Kaylo insulation contained 15% asbestos and was used not only as thermal block insulation, but also as ceiling tile. Further, Mr. Hazard testified Owens placed asbestos in this product to give Kaylo insulation strength and keep it from crumbling. He added that Owens manufactured fiberglass insulation, but asbestos was preferred by Owens because it was a better insulator. Kaylo insulation was a combination of two types of asbestos chrysolite and amosite. Though crocidolite, another type of asbestos not found in Kaylo insulation, has been identified as more lethal than amosite and chrysolite, there was expert testimony to show that each type of asbestos is capable of causing disease.\n\nDr. Arnold Brody, a pathologist with the National Institute of Environmental Health Sciences and a professor at Tulane University Medical School, testified occupational exposure to asbestos creates an increased risk of cancer. Dr. Brody also testified that he conducted a number of studies with animals to establish the impact of asbestos on the lungs of humans. After establishing the similarities in the structure of the lungs between humans and laboratory mice, Dr. Brody stated that exposing mice to a large concentration of asbestos dust in a restricted area for approximately one hour produced evidence of asbestosis. Though the length of time these mice were exposed to asbestos was extremely small in comparison to that of the plaintiffs in both flights, Dr. Brody testified the concentration was similar and in conformity with the plaintiffs' testimony. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nAfter discussing the experiments that were conducted with the mice, Dr. Brody demonstrated to the jury through physical evidence how asbestos fibers would infect the lungs and gradually deteriorate the lungs within one hour of exposure. He further illustrated to the jury that asbestos fibers sometimes migrate to other organs of the body through the blood stream. Additional testimony identified three ways in which asbestos fibers can lead to a condition known as asbestosis: (1) the fibers form large amounts of scar tissue; (2) asbestos fibers are transferred to other areas of the body; and (3) there are large amounts of secreted fluids by certain cells in the lungs to remove unwanted asbestos fibers. Dr. Brody concluded that if each plaintiff in both flights were exposed to high concentrations of asbestos fibers like the mice in these experiments then the contraction of asbestosis or an asbestos-related disease was highly probable.\n\nDr. Hans Weill, an expert witness for the defense in pulmonary medicine who also works with asbestos related diseases, testified that every significant exposure to asbestos fibers contributes to the overall risk of contracting asbestosis. Such exposure, he adds, must not be small or trivial because asbestosis is a dose-related disease, and part of the equation is the time one spends in an atmosphere that contains asbestos fibers.\n\nEach plaintiff testified about working at the bottom of many vessels at Avondale for a least eight hours per day. Each plaintiff further testified about inhaling the dust emitted by the Kaylo insulation since respirators and masks were not provided to Avondale employees. Many of the plaintiffs had been working at Avondale from the early 1950s until the late 1970s, and their exposure to Kaylo insulation was consistent, regular, and definitely not \"trivial\" as was alleged with the plaintiff in Quick.\n\nTo counter the above arguments, OCF read into the record the deposition of Mr. Jerry Helser, an advanced technologist who was employed with OCF at the time of his deposition. Mr. Helser testified that asbestos material was the best insulator at the time the plaintiffs were employed at Avondale. Though fiberglass insulation was also available, it was limited in temperature up to 450 degrees Fahrenheit, and if the temperatures exceeded 450 degrees, it would char, burn, melt and drop off the pipe. Kaylo insulation, on the other hand, could withstand temperatures between 1200 to 1800 degrees Fahrenheit. Mr. Helser also testified that the research and development department later produced a product called Multi-Temp which was a fibrous glass product intended to replace the Kaylo insulation. However, after two years, the Multi-Temp insulation was withdrawn from the market because of declining sales, consumer dissatisfaction, a number of product deficiencies.\n\nThe record also contains substantial evidence which indicates that Kaylo insulation, manufactured by OCF, was unreasonably dangerous per se. Hence, the jury in both flights were not clearly wrong or manifestly erroneus in finding that OCF's Kaylo insulation was unreasonably dangerous per se.\n\nManufacturers of Gaskets, Valve Packing Material and Cement\n\nGarlock and Flexitallic are manufacturers of asbestos gaskets. Chesterton manufactures asbestos-containing packing material as well as asbestos gaskets. Rock Wool manufactures asbestos cement. All of the above named manufacturers made specific arguments relative to their individual products. Chesterton, Flexitallic and Rock Wool also adopted the arguments and testimony of Dr. Carl A. Mangold, Garlock's expert witness. The arguments presented by each manufacturer were: (1) plaintiffs failed to specifically identify the products they used during their tenure at Avondale; (2) plaintiffs failed to state whether or not the defendants manufactured asbestos-containing products, or, in the alternative, that asbestos fibers from their products caused them harm; and (3) plaintiffs had minimal exposure to their products, and such exposure, if any, could not have resulted in the occurrence of an asbestos-related disease.\n\nGarlock and Chesterton\n\nGarlock and Chesterton \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e, defendants in Flight Two, argue that the jury committed manifest error in finding that their \"encapsulated\" gaskets and packing materials were unreasonably dangerous per se. In conjunction with the aforementioned arguments, both companies argue that their products were not a substantial contributing factor in the causation of any of the plaintiffs' injuries because the individual occupations of each plaintiff in Flight Two did not require constant, frequent and regular exposure to their products on a daily basis as required in Quick.\n\nChesterton specifically argues that Mr. Mefferd's and Mr. Duronslet's injuries could not have resulted from their exposure to its encapsulated products because its packing material contained less than 1% asbestos by weight, thereby not qualifying as \"friable asbestos material\" as defined by the Environmental Protection Agency (EPA).\n\nPlaintiffs, in the cases sub judice, did not make specific arguments in opposition to the evidence presented by defendants Garlock, Chesterton, Rock Wool or Flexitallic. Therefore, without a showing that such evidence is contested, we conclude that the jury committed manifest error in finding that these manufacturers were liable in the causation of the plaintiffs' injuries.\n\nGarlock offered the expert testimony of Dr. Carl A. Mangold, an industrial hygienist who has participated in a 1978 U.S. Navy study on the use and handling of asbestos gaskets, including Garlock gaskets. This study included reviewing the procedures used to remove old gaskets from the valves, and the study was used to calculate the amount of dust created from each procedure. Dr. Mangold also worked on many asbestos studies with such well known physicians as Dr. Irving J. Selikoff, who was a renowned physician in the field of occupational medicine. Dr. Selikoff was also known for his extensive studies in the area or asbestos and its effects on the lungs.\n\nFurther, Dr. Mangold is certified in the comprehensive practice of occupational health problems, especially asbestos. He has worked as an industrial hygienist for the Department of the Navy, Occupational Safety and Health Association, and was a consultant for the federal government until he entered private practice as a consultant. Dr. Mangold testified at length concerning the composition, use and installation of gaskets and packing material manufactured by Garlock and other manufacturers of similar products. Dr. Mangold also testified that though a majority of his studies took place in Puget Sound, Washington, the data he received remained relatively the same despite geographical differences. He further testified that because the gaskets and packing material produced by Garlock contained less that 1% asbestos material by weight and was covered in a grease-like substance that prevented large emissions of asbestos fibers, these products were considered non-hazardous by OSHA. He went on to say that removing gaskets and packing material from high-temperature valves in the naval vessels was easy and dustless. In the event the gaskets and packing material stuck to the valves when the workers tried to remove them, the asbestos ladened dust that was created from the removal of those gaskets and packing material still did not exceed the amount of asbestos fibers found in ordinary society.\n\nDr. Mangold also testified that a majority of the gaskets manufactured in the United States, including Garlock, are pre-cut and require little to no alterations when installed. Dr. Mangold gave a lengthy description of the different methods used by insulators to install gaskets, and the following colloquy between Mr. Tyner, counsel for Garlock, and Dr. Mangold illustrates the doctor's Conclusion from studying and testing these methods:\n\n\"Q. Did you test each method of cutting out that you found to be used and utilized in gasket shops to see if any of those methods caused the release of asbestos fibers from asbestos containing gaskets?\"\n\n\"A. Well, yes. In 1989, I made a number of measurements based upon what workmen were describing they did with asbestos in various applications.\"\n\n\"Q. Did any of these tests indicate results that exceeded the threshold limit values or the PELs established by OSHA?\"\n\n\"A. Sir, first of all, OSHA does not establish a threshold limit. That is the American Conference of Government Industrial Hygienists, which is a recommendation. Secondly, a PEL is a permissible exposure limit. That is the level in the standard to which you can be exposed day-after-day, without adverse effects.\"\n\n\"Now, none of those even came close to the federal standard which involves the eight-hour time-weighted average.\"\n\n\"Q. Did you perform any tests to determine whether or not asbestos fibers were released from asbestos gaskets if that method [using a ball-peen hammer to install gaskets] were used?\"\n\n\"A. Yes.\"\n\n\"Q. And what were the results of your tests and your study?\"\n\n\"A. The results were in the environmental range, based upon an eight-hour time-weighted average of cutting at least eight gaskets a day, which is about what a workman gets done when he is putting piping together.\"\n\nDr. Mangold also testified that without any evidence to show that emission of asbestos fibers from gaskets or packing material were above federal standards, neither Garlock nor any other manufacturer of encapsulated gaskets or packing material can be liable to a consumer for manufacturing gaskets or packing material with a defective design or for failing to place a warning on its products.\n\nQ. \"It is known that [a] large proportion, something over fifty percent, of the asbestos used in this country for the past 40 years has gone into the construction industry in one form or another. It is fortunate that the greatest part of this has been in products in which the asbestos is `locked in,' that is, it is bound with cement or mastic or other binders so that there is no release, certainly no significant release, of asbestos fibers in either working areas or general air.\"\n\n\"Do you agree with that statement Doctor Selikoff has pronounced in 1970?\"\n\n\"A. Yes. That applies to some groups of products, but gaskets and packing and certain types of materials that contain Ä cement that contains asbestos release few fibers on handling or processing.\"\n\n\"Q. And can you explain to the Court and the Jury why gaskets and packing were either not tested nor considered in the study [Puget Sound study] you did in 1970 or completed in 1970?\"\n\n\"A. Mr. Tyner, they were tested. But there was a reason why we identified those things that were leading to the most problems in terms of substantial exposure in the shipyards. Gaskets and packing simply weren't one of them.\"\n\nWhen Dr. Mangold was questioned by counsel for A.W. Chesterton, he testified to the following:\n\n\"Q. And your testimony today concerning the packing and gaskets products of Garlock and Anchor \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e will be equally applicable to the Chesterton products; is that correct?\"\n\n\"A. Yes, many of them, especially those that were involving ships follow a specification for temperature and pressure and sometimes, once the packing material is out of their respective boxes, it takes only a very educated product fellow to tell which is which. I certainly can't.\"\n\n\"Q. So your testimony, then, would be equally applicable to the Chesterton packing products?\"\n\n\"A. To the best of my knowledge and belief, yes.\"\n\nDr. Mangold also testified as to the necessity for a warning on encapsulated gaskets and packing material on cross-examination by OCF.\n\n\"Q. Are you aware, sir, that in 1977 Garlock placed warning labels on its asbestos-containing gasket and packing material?\"\n\n\"A. I don't know to what extent, but there was no real requirement to do so. There wasn't one in 1971 when the standard came out, and there isn't one today for encapsulated products. So, if they put on (sic) there, it may be a prudent thing to do, but it is not required by the regulations.\"\n\n\"Q. You would agree, would you not, sir, that Garlock's warnings in 1977 were appropriate for asbestos-containing products as their gaskets and packing?\"\n\n\"A. As I point (sic) out, there is no scientific or legal requirement to do so. It may be prudent to do so based on the company's judgment.\"\n\nCounsel for Rock Wool also questioned Dr. Mangold concerning \"friable products.\"\n\n\"Q. And the reason that they've (EPA) done this [defined `friable'] is, any material that contains less than one percent asbestos would be insignificant versus this (sic) ambient air, water, everywhere where we find asbestos naturally; is that correct?\"\n\n\"A. Yes. As a practical matter, they cut it off at one percent. Even if you have a product that contains less than one percent asbestos, it's not regulated.\"\n\nIn essence, Dr. Mangold concluded that with emission levels below federal standards, the gaskets and packing material manufactured by Garlock, Chesterton and also Flexitallic could not have reasonably caused the plaintiffs' injuries. Furthermore, Dr. Mangold testified he was not familiar with any study that outlined a causal link between packing material and asbestosis. Dr. Weill, an expert witness for OCF, corroborated Dr. Mangold's testimony in Quick, by saying that he too was not aware of any study showing a connection between gaskets or valve packing and asbestosis.\n\nThus, without any evidence to rebut the compelling testimony of Dr. Mangold, we find the jury was clearly wrong in finding products manufactured by Garlock and Chesterton were unreasonably dangerous per se.\n\nAdditionally, testimony from Dean Mefferd and Romain Duronslet against Chesterton was unpersuasive and did not establish by a preponderance of the evidence that products manufactured by Garlock and Chesterton were unreasonably dangerous per se, defective by design, or that these manufacturers failed to warn ordinary consumers of their products' alleged hazards.\n\nMr. Mefferd was an employee at Avondale for over 30 years, first as an electrician and later as a machinist. As an electrician, he was required to perform many electrical tasks ranging from changing lights and motors to pulling cable. A number of these jobs took place in the bottom of the ships where the insulators, pipefitters and other craftsman were working with Kaylo insulation.\n\nMr. Mefferd recalled personally removing and installing Kaylo insulation, but when he was questioned about his use of gaskets and packing material, he recalled the names of packing material from Chesterton, Garlock and Anchor, but since he never received the packing material from the warehouse, he could not say as a certainty that these products contained asbestos or that he personally used these items. He recalled the names of some gaskets he used, but the names he gave were of manufacturers not named in this appeal. Furthermore, Mr. Mefferd stated that every craftsman working in the bottom of these vessels created large amounts of dust from their individual jobs, and there was no way he could distinguish between the dust from the insulators and the dust from the pipefitters, who used the gaskets and packing material. As a machinist, Mr. Mefferd was required to work exclusively with grinding tools and other steel products, and had little to no exposure to insulation products.\n\nMr. Duronslet also worked at Avondale for over 30 years. He worked initially as a laborer and then as a machinist. Mr. Duronslet testified that as a laborer, he and his cleaning crew would sweep the areas of the ship where the insulators, pipefitters and craftsman had worked. He also testified that he came in contact with boxes with the Chesterton name on it, but could not say that he had specific contact with products from this manufacturer, nor could he distinguish between dust from pipe insulation and dust from gaskets and packing material.\n\nMr. Duronslet also assisted the sandblasters at Avondale while a laborer, and recalled having to breathe the dust and debris emitted from the sandblasters. He also testified to working in various departments at Avondale, but stated without hesitation that he never had any direct contact (i.e. tearing, removing, or repairing) with insulation or insulating cements, and he could not say whether the dust he was in contact with contained asbestos. Once Mr. Duronslet was transferred to the machine shop, he, like Mr. Mefferd, had minimal exposure to insulation products.\n\nFlexitallic\n\nFlexitallic joined the arguments presented by the other complaining manufacturers, and further argued that the testimony of the plaintiffs established that there was very little exposure to its gaskets. In fact, Flexitallic argues the plaintiffs' own testimony established that there was a standard practice at Avondale to classify all gaskets as \"Flexitallic\" gaskets even though other brand name gaskets were used by Avondale. Plaintiffs also failed, according to Flexitallic, to prove their alleged exposure to its product caused them injury. Without any evidence to support the fact that plaintiffs' injuries resulted from exposure to Flexitallic's gaskets, Flexitallic claims the trial court erred in denying its Motion for a Directed Verdict. Again, we agree.\n\nThe uncontroverted arguments presented by Flexitallic as to all plaintiffs, excluding Robert Terrebonne and Clifton Abadie, are that its product was not properly identified by either plaintiff as containing asbestos, nor were their gaskets a cause-in-fact of plaintiffs' injuries. Flexitallic further argues that no plaintiff testified that he exclusively used Flexitallic gaskets at any given time. In the event that these gaskets did contain asbestos, Flexitallic argues the plaintiffs did not offer any evidence to show that the asbestos content of this product caused them injury.\n\nSeveral plaintiffs in Flight One testified that they were familiar with the name \"Flexitallic\"; however Mr. Terrebonne testified it was common practice among Avondale employees to call all gaskets \"Flexitallic\" gaskets even though other brand name gaskets were purchased and used.\n\nMr. Calvin Danos, Sr., worked at Avondale for 39 years. He was initially a pipefitter's helper, and was later promoted to a pipefitter. Mr. Danos remembered working with Flexitallic gaskets and other spiral gaskets, but conceded that he did not work with gaskets on a regular basis. He testified that many of the pipefitters would make their owns gaskets because most gaskets were pre-cut and may not have been suitable in their original form for the particular jobs being done at the time. Mr. Danos also testified that on occasion he would have to remove some of the spirals from the Flexitallic gasket so that it could conform to the particular job he was doing. He further testified that even removing some of the spirals from the Flexitallic gaskets did not create any dust. Mr. Danos went on to say that removing some of the old gaskets around the valve did create dust; however, he failed to say whether the old gaskets were made by Flexitallic or by another manufacturer. Additionally, Mr. Danos did not testify whether Flexitallic gaskets contained asbestos or that he witnessed any of the plaintiffs removing Flexitallic gaskets.\n\nIn asbestos cases, the term \"exposure\" refers to inhalation of asbestos fibers into the lungs. Therefore, in order for such exposure to result in an asbestos-related disease, the claimant must show that he had significant exposure to the product complained of to the extent that it was a substantial factor in bringing about his injury. See Egan, 677 So.2d at 1035. Without frequent, regular exposure to Flexitallic's gaskets by the plaintiffs, we are without authority to say that the plaintiffs' handling of Flexitallic gaskets was a substantial factor in the causation of their injuries. See Cole, 599 So.2d at 1066. We also conclude that altering the Flexitallic gaskets by removing some of the spirals from these gaskets was not a normal use contemplated by Flexitallic, considering that the gaskets were pre-cut before they were shipped to Avondale. Thus, we find the trial court did not commit manifest error in granting Flexitallic's Motion for Directed Verdict as to Horace Bordelon, Joseph Constant, Thomas Naquin, Clovis Orgeron and Clifton Washington in light of their \"trivial\" exposure to Flexitallic gaskets. See Quick, supra.\n\nAs it relates to Robert Terrebonne and Clifton Abadie, the testimony from Mr. Terrebonne did not establish by a preponderance of the evidence a cause of action against Flexitallic. Mr. Terrebonne merely stated in his testimony that while employed as an expediter in the warehouse at Avondale, he received a shipment of Flexitallic gaskets. He did not testify that he personally used these products or that they contained asbestos. Ironically, Mr. Terrebonne did testify that these gaskets were primarily used by pipefitters Ä a position Mr. Terrebonne did not occupy at Avondale.\n\nOn the other hand, Clifton Abadie, a pipefitter for Avondale for approximately 7 years, testified he had worked specifically with Flexitallic gaskets during his tenure at Avondale. He recalled not only working with this type of gasket, but he also testified in detail how Flexitallic gaskets were made at that time. However, there was no evidence presented by OCF or Mr. Abadie to show that Flexitallic gaskets contained asbestos during the time Mr. Abadie used these products. Dr Mangold, Garlock's expert witness, previously testified that on average no more than eight gaskets would be removed during an average eight-hour work shift. Dr. Mangold also testified the emission of asbestos dust from these gaskets could not have caused the harm complained of by the plaintiffs in both Flights. In light of Dr. Mangold's testimony, we cannot say that Mr. Abadie's exposure to Flexitallic gaskets was significant enough to amount to an asbestos related disease, considering the fact that Mr. Abadie held the pipefitter position for only seven years.\n\nOther plaintiffs have testified that many of the pipefitters made their own gaskets or altered the gaskets to conform to particular jobs. Therefore, we cannot say that gaskets made by Flexitallic, to the exclusion of other manufacturers, caused Mr. Abadie's injuries. Motion for directed verdict is appropriately granted in jury trial when, after considering all evidentiary inferences in the light most favorable to movant's opponent, it is clear that facts and inferences are so overwhelmingly in favor of moving party that reasonable persons could not arrive at a contrary verdict. Lott v. Lebon, 96-1328, 96,1329 (La. App. 4 Cir. 1/15/97), 687 So.2d 612, writ denied 97-0359 (La. 3/21/97), 691 So.2d 92, writ denied 97-0414 (La. 3/21/97), 691 So.2d 95. Hence, we reverse the trial court's judgment denying Flexitallic's Motion for Directed Verdict against both Robert Terrebonne and Clifton Abadie.\n\nHaving reversed the trial court's judgment, and having granted Flexitallic's Motion for Directed Verdict as to both Mr. Terrebonne and Mr. Abadie, we pretermit any Discussion regarding whether products manufacturer by Garlock, Chesterton, or Flexitallic were defective by design. We further pretermit Discussion as to whether these gaskets failed to warn consumers of hazards with asbestos, in light of the uncontroverted expert testimony offered by Drs. Mangold, Weill, and Brody, together with evidence of plaintiffs' trivial exposure to products made by these manufacturers.\n\nRock Wool\n\nRock Wool specifically argues the trial court erred in denying its Motion for a Directed Verdict and Motion for Judgment Notwithstanding the Verdict given the overall weight of the evidence. Rock Wool further argues the Motion for Directed Verdict and Motion for JNOV should have been granted because plaintiffs in both flights failed to show frequent, daily and persistent exposure to Rock Wool's One Shot insulation cement sufficient to support a claim of asbestosis. Thus, Rock Wool contends that without a sufficient evidentiary basis to show that Rock Wool's insulating cement was unreasonably dangerous per se the Motion for Directed Verdict and Motion for JNOV should have been granted.\n\nFurthermore, Rock Wool claims the jury erred in finding Rock Wool strictly liable for the injuries the plaintiffs sustained from being exposed to its asbestos-containing cement while working at Avondale. As support for their argument, Rock Wool offers that its One Shot insulating cement contained less than .045% asbestos per every fifty pound bag, and that this quantity does not make One Shot cement a friable asbestos product according to the EPA standards. Rock Wool argues this small amount of asbestos prevents the cement from shrinking and cracking, and such a minute amount of asbestos should not make One Shot cement an unreasonably dangerous per se product.\n\nMr. George Cusick, current owner and proprietor of a small family business in Leeds, Alabama, named Rock Wool Manufacturing Company, testified that its Delta Maid/One Shot (One Shot), insulating cement was the only product Rock Wool manufactured which contained asbestos. The asbestos ingredient only was used to prevent this cement from shrinking and cracking when dried. According to Mr. Cusick, there was no substitute for asbestos back in 1958, when Rock Wool first placed asbestos in its cements. Nevertheless, Mr. Cusick testified Rock Wool placed less than one-half percent of asbestos in its cement.\n\nMr. Cusick further testified the number of Rock Wool employees was composed of approximately 90 persons, and production of its One Shot cement was relatively small in comparison to the other manufacturers. In fact Mr. Cusick could only recall one shipment of cement to Avondale Shipyard, if any. Mr. Cusick also testified Rock Wool's One Shot cement had a shelf life of six months, and was specifically tailored for application on the fittings of the pipes on the ships. Mr. Cusick went on to say that One Shot could not be applied to any other areas of the pipes, otherwise it would not stick and properly insulate the pipes. Mr. Cusick testified Rock Wool was not aware of any hazards associated with asbestos until the late 1960s, when Mr. Cusick's brother heard a lecture given by Dr. Selikoff concerning the hazards of using asbestos. Following this lecture, Rock Wool extracted asbestos from the One Shot cement.\n\nOn cross-examination, Mr. Cusick conceded Rock Wool also manufactured other asbestos cements called Delta Maid AF and Delta Maid High-Temp Master. Delta AF cement contained 25% to 40% asbestos. Mr. Cusick also testified he learned of a disease called asbestosis while in college and prior to becoming vice president of Rock Wool in 1958. However, he testified the Delta Maid AF cement and Delta High-Temp Master cements were only manufactured from 1968 to 1970, as an experimental product, and neither Delta Maid AF nor Delta High-Temp Master cements were ever sold in Louisiana. Mr. Cusick added that Rock Wool did not place a warning on its asbestos-containing products because it subsequently decided to discontinue use of asbestos altogether in 1970, when it learned of the risks.\n\nDuring its cross examination of Mr. Cusick, OCF questioned Mr. Cusick about the testimony previously given by Mr. Joseph Constant. Mr. Constant testified he saw Rock Wool's insulating cement being mixed on the vessels at Avondale. Mr. Constant further testified he specifically recalled seeing the word \"Delta Maid\" on one of the buckets where the cement was mixed, and recalled seeing the \"world globe\" logo on one of the shipping bags for the insulating cement.\n\nMr. Cusick confirmed the testimony of Mr. Constant, and testified that Rock Wool's bags did in fact contain the world globe logo, but the record reflects Mr. Constant's familiarity with the name \"Delta Maid\" came from conversations with other co-workers in the pipe department rather than from personal contact with One Shot cement. The record also contains testimony from several of the plaintiffs and other witnesses who have identified Rock Wool's One Shot cement as the one of the cements used by the employees at Avondale. It is also clear from the testimony of Mr. Eugene Coincon that One Shot cement was routinely used on the turbines of the ships, the steam drums and on the stacks of the ships. Mr. Coincon further testified that when the workers would pour this cement into the five gallon buckets, it \"created more dust that cutting a piece of Kaylo.\"\n\nHence, there is sufficient evidence in the record to show that Rock Wool's One Shot cement was consistently used by the plaintiffs in both flights, and that normal use of this cement resulted in a large amount of dust. Therefore, the jury was not clearly wrong when they concluded Rock Wool's One Shot cement was unreasonably dangerous per se, in light of the testimony of Mr. Abadie, Mr. Constant and Mr. Coincon. Additionally, no evidence was presented to show that this cement was non-hazardous to the workers at Avondale, other than the testimony of Mr. Cusick. Because Mr. Cusick initially stated that none of Rock Wool's cements contained no more than 1% asbestos, and later recanted his testimony under cross examination, it was reasonable for the jury to have found his testimony to be less than persuasive.\n\n\"When findings are based on determinations regarding the credibility of witnesses, the manifest error Ä clearly wrong standard demands great deference to the trier of fact's findings; for only the factfinder can be aware of the variations in demeanor and tone of voice that bear so heavily on the listener's understanding and belief in what is said.\" Rosell v. ESCO, 549 So.2d 840, 844 (La. 1989).\n\nWhile applying this standard of review, this Court cannot review factual issues de novo. Id. Therefore, we affirm the jury's verdict finding Rock Wool's One Shot cement to be unreasonably dangerous per se.\n\nFAILURE IN DESIGN\n\nNext, we consider the jury's determination that products manufactured by OCF and Rock Wool were unreasonably dangerous by design. According to this theory, the plaintiff must prove by a preponderance of the evidence that the product is unreasonably dangerous because: (1) the danger-in-fact, whether foreseeable or not, outweighs the utility of the product; (2) though the product may not be classified as unreasonably dangerous per se in design using the risk-utility test, alternative products were available to serve the same needs and desires with less risk of harm; and (3) even though the utility may outweigh the risk, there was a feasible way to design the product with less harmful consequences. Halphen supra, p. 115, see also, Mistich v. Volkswagen of Germany, Inc., 95-0939 (La. 1/29/96) 666 So.2d 1073, 1081; and Hopper v. Crown, 93-2021 (La. App. 1 Cir. 10/7/94), 646 So.2d 933, 944, writ denied, 95-0179 (La. 3/17/95), 651 So.2d 275.\n\nThe danger-in-fact criteria under the \"unreasonably dangerous by design\" theory is also one of the elements under the unreasonably dangerous per se category. This similarity relieves the plaintiff of having to demonstrate for the trial court what characteristic of the product caused the harm. In other words, the plaintiff can say that the product was either dangerous by design or that it was dangerous because its dangerous. Halphen, supra, at 115. The Halphen decision also makes clear that the trier of fact would have to examine admitted scientific data and other research presented by the parties to determine whether the manufacturer ignored alternative methods of design, thereby breaching his duty to the consumer. Hence, the scienter element is extremely relevant for both parties when the plaintiff selects this theory for his claim.\n\n\"If the plaintiff seeks to prove his case by impugning the manufacturer's conduct, e.g., by contending that manufacturer failed to warn or to adopt feasible alternative designs, in fairness the manufacturer should be permitted to introduce evidence and present argument as to the standard of knowledge and conduct by which its conduct is to be Judged.\" Halphen, 484 So.2d at 118; and Hopper supra, at 944.\n\nIn essence, design defects may be magnified by comparing the product at issue to other similar products, and the plaintiff would be entitled to recovery under the unreasonably dangerous by design theory upon proving that the design chosen by the manufacturer was faulty and avoidable.\n\nOCF argues that asbestos, which had wide popularity in the shipping industry in the 1930s, was used by OCF because of the lack of an adequate and available substitute material capable of working efficiently in the high-temperature atmosphere on naval vessels. In fact, OCF argues the federal government, in preparation for World War II, mandated shipyards to insulate naval vessels with asbestos because of its usefulness in fire prevention. OCF further argues that once asbestos became scarce and difficult to purchase, OCF, as well as other manufacturers who used asbestos for its products, began to search for substitutes, but the substitutes found proved to be unfeasible. Therefore, OCF argues its products were not unreasonably dangerous by design in light of the wide popularity of asbestos, its importance in the war effort and the failure to find a suitable alternative.\n\nPlaintiffs argue that though OCF specifically outlined the benefits and usefulness of Kaylo insulation, OCF purposefully failed to inform the jury that its Kaylo product was extremely dangerous in that long periods of exposure to Kaylo insulation could result in lung diseases, namely asbestosis. Plaintiffs also contend that testimony presented at trial indicated that other products were identified as possible replacements for Kaylo insulation, but OCF withdrew those replacements because they were not economically feasible. Plaintiffs further argue that OCF knew in the early 1940s that workers who used asbestos products would \"get sick\" from these products unless they wore respirators or masks. However, plaintiffs claim that because OCF did not take any steps to remove or replace the asbestos in its Kaylo insulation it was negligent in failing to adopt a feasible design. We agree.\n\nEvidence was presented at trial by OCF which demonstrated that Avondale purchased and used other asbestos-containing products like Pabco and Unibestos to insulate pipes on the naval vessels. Mr. Jerry Helser, OCF's witness and also an advanced technologist in the Research and Development Department at OCF at the time of trial, testified that asbestos was the best product available in the early 1960s for thermal insulation. Mr. Helser also testified that by adding asbestos to the Kaylo insulation it allowed Kaylo to absorb temperatures up to 1200 degrees Fahrenheit. Mr. Helser said that fiberglass was also considered by OCF for possible use in its thermal insulation department, but fiberglass could not absorb temperatures beyond 450 degrees Fahrenheit; and when temperatures exceeded this 450 degree mark, the fiberglass would \"char, burn or drop off of the pipe\". Mr. Helser further testified that OCF test marketed an insulation product named Multi-Temp which apparently exceeded the 450 degree limit of fiberglass. However, after two years, Multi-Temp was withdrawn from the market because sales were low and consumers complained that Multi-Temp did not meet their requirements.\n\nThe overwhelming weight of the evidence from the records in Flights I and II show that Kaylo thermal insulation was used approximately 90% more than any other asbestos-containing product purchased by Avondale; and that each of the plaintiffs not only recognized the \"Kaylo\" name, but remembered using or being exposed to Kaylo insulation while working in one of the 10 x 12 rooms at the bottom of the vessels. Each plaintiff also testified that if they were not personally using the Kaylo insulation, they were at least in the vicinity where one of the craftsman was either sawing or tearing Kaylo insulation.\n\nThe plaintiffs offered into evidence a video showing how insulation was cut, the average room size where craftsman generally worked with Kaylo and other insulation products, and the average amount of dust created by the various craftsman on a daily basis. The defendants objected to the admission of this videotape, but their objection was overruled by the trial court. The trial court reasoned that the videotape would be admitted only as demonstrative evidence.\n\nAll plaintiffs attested to having to inhale large amounts of asbestos dust on a daily basis without using any masks or respiratory devices. Several of plaintiffs also complained of having to use air hoses to blow some of the dust off of their clothing once their shift ended, and several of the their spouses testified that when their husbands would come home, their clothes would be covered with white dust from working at Avondale. Though none of these plaintiffs testified that the dust on their clothing came from Kaylo insulation, they were very specific in stating that the product they worked with the most, and caused the most dust was the Kaylo insulation. In retrospect, these plaintiffs testified had they known that the dust they were inhaling was hazardous, they would have demanded Avondale to provide them with masks or respiratory devices when working with Kaylo insulation.\n\nAccording to Halphen, the manufacturer is held to the same standard of knowledge, skill and care as that of an expert, which includes the duty to test, inspect, research and experiment commensurate with the danger. Halphen at 115. In essence, evidence as to whether the manufacturer, held to the standard and skill of an expert, could know of and feasibly avoid the danger is admissible under a theory of recovery based on alleged alternative designs or alternative products. Halphen, 484 So.2d at 115.\n\nMr. John Thomas, former president of OCF (1965-1970), testified that OCF knew as early as the 1940s of the risks of contracting asbestosis from inhaling asbestos dust, and knew that such risks were reduced with the use of hoods, exhaust systems and wearing respirators. Mr. Thomas further testified that Owens-Illinois, before it merged with Owens Corning Fiberglass Company, manufactured fiberglass pipe covering which was sold to the Asbestos Workers Union. This fiberglass pipe covering did not cause lung cancer, but the workers complained about using this product because the fibers from the fiberglass pipe covering would stick the workers and cause them to itch.\n\nFrom 1953 to 1958, Owens-Illinois and Owens-Corning began marketing Kaylo insulation. Owens-Illinois manufactured Kaylo insulation and Owens-Corning sold the product. After the merger of Owens-Illinois with Owens Corning Fiberglass, Mr. Thomas learned that OCF had sponsored a study at Saranac Laboratory to learn if there was a relationship between exposure to Kaylo insulation and asbestosis. The study began in 1943, and continued until 1951. The results of the study indicated that there was an increase in lung abnormalities when there was prolonged exposure to asbestos.\n\nThe results of the experiment were communicated to OCF by memo from Dr. Leroy Gardner, director of the Saranac Laboratory experiment, to OCF's medical director. The memo indicated there was a first-class hazard associated with the presence of asbestos in Kaylo, but OCF failed to take any immediate steps to extract asbestos from this product. When Mr. Thomas began making efforts to take asbestos out of Kaylo, other department heads refused to heed his warnings, disregarded these studies and continued selling Kaylo insulation heavily ladened with asbestos.\n\nThe record before us from both flights allows us to find that there was sufficient evidence presented at trial to show that OCF knew of the hazards associated with asbestos in the 1940s, but failed to take reasonable precautionary measures to avoid marketing the Kaylo pipe insulation without conducting the proper tests. Furthermore, Mr. Thomas' apprehension about using asbestos in Kaylo insulation should have alerted OCF to discontinue using asbestos. The records indicates that OCF's decision to market Kaylo despite the studies concerning asbestos was economically motivated. Therefore, the jury did not commit error in determining that OCF produced a product that was unreasonably dangerous by design.\n\nFAILURE TO WARN\n\nNext, we turn to whether the jury committed manifest error or was clearly wrong in finding OCF failed to provide an adequate warning to its consumers in light of the danger imposed by Kaylo insulation. Lastly, \"[a]lthough a product is not unreasonably dangerous per se or flawed by a construction defect, it may still be an unreasonably dangerous product if the manufacturer fails to adequately warn about a danger related to the way the product is designed.\" Halphen, 484 So.2d at 114-115.\n\nIn the cases sub judice, OCF argues that the jury committed manifest error by finding that Avondale was not a sophisticated user of its Kaylo insulation. OCF also attacks the jury instructions as being improper because the jury was not aware that OCF's duty to warn did not apply to sophisticated users or employees of sophisticated users.\n\nOCF further argues that Avondale knew through its familiarity and expertise with Kaylo insulation that the contents of this insulation (i.e., asbestos fibers) was harmful if inhaled for long periods of time. OCF also contends that a warning or precaution would have been of no value to Avondale employees because they were either casual users of Kaylo, or they neglected to even read the warning at all. Therefore. OCF argues, the plaintiffs caused their own injuries with their substandard conduct.\n\nOCF further argues that the warning was of no value to the plaintiffs because Avondale's delivery procedures prevented the employees from seeing the original packaging for Kaylo insulation. Even if the warning was more detailed, OCF contends, the plaintiffs would not have been apprised of the dangers because they negligently failed to read such warning.\n\nMoreover, OCF argues it did not have a duty to warn these plaintiffs because when the purchaser is a sophisticated user, then employees of the sophisticated user have no cause of action against the manufacturer. OCF goes on to say that Avondale and other shipyards around the nation all had access to the same information and studies concerning asbestos as did OCF, including the Minimum Requirements for Safety and Industrial Health in Contract Shipyards Act issued in 1943.\n\nOCF concluded its argument by suggesting that since the jury was not instructed to exonerate OCF of its duty to warn if Avondale was found to be a sophisticated user, this Court should reverse the jury's finding.\n\nOn the other hand, plaintiffs argue that Avondale was never found to be a \"sophisticated user\" in either flight because Avondale did not meet the qualifications of a sophisticated user. Plaintiffs argue Avondale did not exclusively purchase or distribute asbestos products, and Avondale was not a manufacturer as was OCF. Also, OCF did not submit any information to Avondale regarding the hazards with its Kaylo insulation in spite of the Minimum Requirements Act discussed in OCF's brief.\n\nPlaintiffs further argue that information regarding the hazards with asbestos and possible preventive measures was available to OCF prior to implementing the Minimum Requirements Act, and for OCF to delegate its duty to warn to Avondale, which was not found to not be a sophisticated user by the jury, was a cause-in-fact of the plaintiffs' injuries. Lastly, plaintiffs argue the warning that OCF claims to have placed on its Kaylo insulation was neither adequately worded nor adequately placed as required by Louisiana jurisprudence. We agree.\n\nUnder the \"failure to warn\" theory of liability, the plaintiff can introduce scientific data, current research and other technological advances presumably accessible to the manufacturer during the time the product was placed into commerce in order to establish that the manufacturer breached its duty. Halphen, supra. The manufacturer is allowed to defend its actions by presenting its own scientific data and research in rebuttal. See Keeton, Product Liability Ä Problems Pertaining to Proof of Negligence, 19 Sw.L.J. 26, 30-33 (1965). This defense is commonly known as the \"state-of-the-art\" defense which has been overshadowed by the court because of the manufacturer's continuous duty to bear the cost for placing a defective product into the stream of commerce. See Garner, Louisiana 1988 Product Liability Reform Act: The changes and their effects, 5 Tul. Civ. L.F. 129 (1990); and Grimley, Louisiana Products Liability Law reconsidered in Halphen: A question of knowledge, 34 La.B.J. 195 (1986).\n\nThough some losses from scientifically unknowable dangers may be uninsurable, a rule of law requiring the manufacturer to assume the cost of accidents caused by products which are unreasonably dangerous per se, regardless of whether the danger was foreseeable, will provide an effective incentive to eliminate all possible dangers before putting products on the market. Halphen, 484 So.2d at 118, see also Loescher v. Parr, 324 So.2d 441 (La. 1975); DeBattista v. Argonaut-Southwest Ins. Co., 403 So.2d 26 (La. 1981); cf. Bell v. Jet Wheel Blast, supra.\n\nHowever, a product which contains an inherent danger that is not obvious or exposed to the ordinary consumer who normally uses the product must also contain a warning that must be adequately worded and adequately placed. It is only when those hazards are obvious and expected, or when the consumer is distinctly aware of those hazards (sophisticated user) that a warning is not required. See Mozeke v. International Paper Co., 933 F.2d 1293, 1297 (5th Cir. 1991). [T]here is no duty to warn sophisticated users of the dangers, which they may be presumed to know about because of their familiarity with the product. Johnston, supra, at 37; see also Hines v. Remington Arms Co. Inc., 94-0455 (La. 12/8/94), 648 So.2d 331, 337. Hence, a mechanic does not need to be told by the vehicle manufacturer not to place his hand in the wheel well of a vehicle when the motor is running because the dangers from his action should be obvious and expected from his trade. Id. supra, at 337. However, it (the warning) cannot be required as a protection against the utterly indifferent or foolhardy. Levi supra, at 1089.\n\nOnce the trier of fact determines that the inherent danger is not obvious, and the consumer is not aware of or trained to detect that danger, then the warning, or lack thereof, must be scrutinized. Clark v. Jesuit High School of New Orleans, 572 So.2d 830 (La. App. 4 Cir. 1990), writ denied, 576 So.2d 48 (La. 1991). Therefore, the warning must be: (1) properly worded to signify the intensity of the inherent danger in the product; (2) properly placed on the product so that the consumer cannot avoid seeing it; and (3) it must convey to the consumer that injury or damage can result from a normal or intended use of the product. Id. The manufacturer can then present evidence to show its product either did not require a warning or that the warning that was provided was adequately worded or placed. Id.\n\nIn the instant matter, no evidence was presented by OCF or the plaintiffs to show that Avondale employees did anything more than purchase, install, remove and discard large quantities of Kaylo insulation on a regular basis. Avondale did not manufacture any insulation of its own, and it did not mine raw materials and construct a final product like OCF and the other defendants. We note that a sophisticated user possesses more than a general knowledge of the product and how it is used.\n\nThe jury instruction complained of by OCF states in pertinent part:\n\n\"Sophisticated user. A sophisticated user is one who by expertise knew or should have known of the potential health hazards associated with the use of the product and who has an obligation to inform its employees of such potential health hazard.\"\n\nWe find that the sophisticated user instruction did apprise the jury as to what a sophisticated user was and what a sophisticated user's duty was as to his employees when these employees are required to work with hazardous products. However, there must be more than just a general knowledge of the product and how it is used. Hines, 630 So.2d at 815.\n\nJury interrogatory number eight which correlates to the sophisticated user portion of the jury instructions merely requires the jury to reflect on the testimony and evidence offered and determine by a preponderance of the evidence if Avondale is a sophisticated user. The jury's finding that Avondale was not a sophisticated user was supported by the evidence; thus, OCF's argument regarding the jury's finding on this issue is without merit.\n\nThough Avondale was not a sophisticated user, Avondale was negligent in not protecting its workers from contracting lung disease. Avondale specifically established a safety department whose job was to provide a safe work environment for its employees. This department was to provide protective clothing for its employees as well as remain abreast of all literature, including the Minimum Requirements Act, which outlines the safety standards each employer is to provide for its employees. Therefore, Avondale negligently contributed to the causation of the plaintiffs' injuries from exposure to OCF's asbestos-containing Kaylo insulation by ignoring its duties.\n\nHaving found that Avondale was not a sophisticated user, and that OCF could not eliminate its duty to warn the plaintiffs in both flights, we affirm the jury's determination that OCF had a duty to warn the plaintiffs of the hazards with Kaylo insulation in light of the voluminous testimony concerning the asbestos content of Kaylo insulation, and the dangers accompanied with being exposed to asbestos for long periods of time.\n\nMr. Jerry Helser, OCF's expert witness, and a technologist in the Research and Development Department at OCF, testified that on December 23, 1966, he received a memo from OCF's corporate headquarters indicating that a caution label would be stamped on the Kaylo insulation cartons prior to shipment, and that such label should be placed on the blank side of the carton near the top. The stamp was purchased in 1967, but the record is not clear as to whether every carton contained the caution label. The caution label that was placed on the cartons read as follows:\n\n\"This product contains asbestos fiber. If dust is created when the product is used, avoid breathing the dust. If adequate ventilation control is not possible, wear a respirator approved by the U.S. Bureau of Mines.\"\n\nIn July 1970, another memo was circulated from OCF's corporate headquarters to other department heads stating that the warning would be revised to conform with OSHA standards, and this revised caution label would be incorporated on the Kaylo insulation cartons by the carton manufacturer. The revised caution label would then read:\n\n\"CAUTION Ä PRODUCT CONTAINS ASBESTOS FIBER\"\n\n\"INHALATION OF DUST IN EXCESSIVE QUANTITIES OVER LONG PERIODS OF TIME MAY BE HARMFUL.\"\n\n\"AVOID BREATHING DUST.\"\n\n\"IF ADEQUATE VENTILATION IS NOT POSSIBLE, WEAR RESPIRATORS APPROVED BY THE U.S. BUREAU OF MINES FOR PNEUMOCONIOSIS PRODUCING DUST.\"\n\nThis caution label was placed on the Kaylo insulation cartons until 1972, when Kaylo became asbestos-free. The warning, as it is written, does not alert consumers of the results of excessive exposure to asbestos fibers, nor does it clarify to the reader what is considered excessive. [T]he manufacturer is obligated to anticipate the environment in which the product will be used and to give notice of the potential risks arising from foreseeable use in the foreseeable environment. Johnston v. Hartford Insur. Co., 623 So.2d 35 (La. App. 1 Cir. 1993), writ denied, 626 So.2d 1170 (La. 1993). The warning should be such that if followed, it would make the product safe for users. Winterrowd v. Travelers Indem. Co., 462 So.2d 639, 643 (La. 1985). The warning is necessary to the trier of fact when distributing fault. Gilboy, supra, at 1265.\n\nAdditionally, potential users of Kaylo insulation should have been told by the warning that wearing respirators was mandatory given the fact that asbestos exposure could cause severe lung diseases. Further, since OCF knew of these hazards as early as the 1940s, it was negligent for Owens-Illinois and OCF not to place a more suitable and detailed warning on Kaylo insulation until the late 1960s.\n\n\"To determine if a warning is adequate[,] numerous factors should be considered. Included among those factors is the severity of the danger, the likelihood that the warning will catch the attention of those who foreseeable (sic) may encounter the protected risk, the intensity and form of the warning and the cost of improving the strength or mode of the warning.\" Clark supra, at 1002.\n\nDespite the fact that the revised caution label conformed to OSHA standards, the caution label was not placed in such a manner that the consumers would have no choice but to see it. The purpose of requiring adequate warnings is to attract and arrest the attention of a potential victim. Clark, supra at 1002; citing Levi v. Southwest Louisiana Elec. Membership Cooperative, 542 So.2d 1081, 1089 (La. 1989). See also Easton v. Chevron Industries, Inc., 602 So.2d 1032, 1037 (La. App. 4 Cir. 1992), writ denied, 604 So.2d 1315 (La. 1992).\n\nPlaintiffs in both flights testified that they did not see a warning on the Kaylo insulation carton, and had they known of the danger in using this insulation, they would have not worked around this product without protective clothing. In order for the warning or instruction to be adequate, it must be expressed with an intensity proportionate to the danger inherent in the product. Ducote v. Liberty Mutual Insur. Co., 451 So.2d 1211 (La. App. 4 Cir.), writ denied, 457 So.2d 15 (La. 1984). In failure to warn cases, plaintiff must prove a reasonable relationship between the omission of the warning and the injury suffered. Gauthier v. McDonough Power Equipment, Inc., 608 So.2d 1086 (La. App. 3 Cir. 1992).\n\nEvidence presented at both trials demonstrated that OCF failed to properly warn its consumers about the hazards with Kaylo insulation, and failed to provide a timely and effective warning about Kaylo insulation. For example, Mr. Thomas, testified that during his tenure as president of OCF, he was concerned about the dangers with Kaylo insulation when he received Dr. Selikoff's study of cancer in asbestos workers in 1964. He testified he was not surprised by the results of the Saranac Laboratory study because he had already begun to take steps to remove asbestos from the Kaylo insulation. However, Mr. Thomas was not aware that the study revealed a link between inhalation of asbestos fibers and lung disease. Mr. Thomas further testified that had he known of the results from this study, he would have been more determined to extract asbestos from the Kaylo insulation much sooner.\n\nWhen questioned about OCF's caution label, Mr. Thomas stated the following:\n\n\"Q. Mr. Thomas, did you have any input directly yourself on what information, if any, should be put on the labeling Ä\"\n\n\"A. None\"\n\n\"Q. Ä of the Kaylo product?\"\n\n\"A. Never knew they were planning on putting a label or that they were putting one out. Didn't know anything about labeling anyway except I have (sic) a hell of a time reading the cautions because they got the print so God damn fine that you can't read them.\"\n\n\"Q. What type of warning label should be put on the product, or put on the package, don't you agree that in the minimum you should have had a word on the warning that said danger or potentially dangerous? You agree with that, don't you?\"\n\n\"A. Yeah, potentially dangerous. I mean, not just like a road sign that says danger.\"\n\n\"Q. And one of the ways to communicate that would be to use the word warning over the top of any label on the package or instructions on the package, correct? You agree with that?\"\n\n\"A. Not necessarily.\"\n\n\"Q. What would you think should have been Ä\"\n\n\"A. Because I don't see any point in having it put dangerous. Anything you buy Ä you could put it on your shirt tail and say dangerous, but you'd sell a hell of a lot less shirts.\"\n\n\"Q. I understand. You agree with me, if you had a word like danger or warning on the box, it would probably have caused fewer people to buy the Kaylo product? You can answer that, I'm sure.\"\n\n\"A. Well, I don't Ä well, you're trying to sell something, you don't you know, kill them in advance, you know. If you got a product and you put danger, I've got a similar product and it doesn't say that, what are you going to buy? Are you going to buy the danger or Ä I think you got to give it more thought than to the actual circumstance.\"\n\nIn conjunction with Mr. Thomas' testimony, Mr. Hazard testified that in 1948, Owens-Illinois' medical director suggested a safety program for the marketing and sale of Kaylo insulation, following his review of the results of the Saranac Laboratory animal study which indicated a correlation between long exposure to asbestos fibers and lung disease. However, Mr. Hazard testified that Owens-Illinois made no effort to remove asbestos from the Kaylo insulation or to warn consumers about the danger. Of course, OCF cannot be held liable for the failure of Owens-Illinois to take these preventive measures prior to the takeover in 1958; however, according to Mr. Hazard, all of the documents regarding Kaylo were delivered to OCF in May of 1958. The documents that were delivered included the results from the animal study and the memo from the medical director at Owens-Illinois. Therefore, in light of the foregoing testimony and the evidence presented in the record, we find that the jury was not clearly wrong in finding that OCF had failed to warn its consumers of the hazards with Kaylo insulation.\n\nOCF argues that Rock Wool also failed to fulfill its obligation to safely construct its cement so as not to cause harm to its consumers, or to provide an adequate warning to its customers about the side effects related to asbestos exposure. Plaintiffs join the argument presented by OCF and rely on the testimony offered by Mr. Cusick as evidence of Rock Wool's failure to comply with both obligations.\n\nRock Wool's primary argument in response to OCF's cross claim is that Rock Wool's One Shot cement was the only cement shipped to Louisiana, and even if more than one shipment was made, this cement contained less than 1% asbestos content which is not sufficient to cause the injuries complained of by these plaintiffs. Furthermore, Rock Wool argues it was exonerated of its duty to warn consumers about the asbestos in its insulating cement because plaintiffs did not show Rock Wool had actual or constructive knowledge that it produced a harmful product. Moreover, Rock Wool argues asbestos was extracted out; of its cements once it was discovered that asbestos was harmful. Rock Wool also contends that since the federal government does not require a warning on friable material such as its One Shot cement, then it cannot be liable to these plaintiffs for not including a warning on this cement. We disagree.\n\nFirst of all, Mr. Cusick denied manufacturing any insulating cement with asbestos other than the One Shot insulating cement. However, he later admitted to manufacturing two additional insulating cements with asbestos, one of which, Delta Maid AF cement, contained 25% to 40% asbestos. Secondly, Mr. Cusick denied making any shipments of Delta Maid AF cement to Louisiana, and only one shipment of One Shot. However, no records were introduced by Rock Wool to substantiate Mr. Cusick's statement.\n\nBecause Mr. Cusick denied that Rock Wool manufactured more than one asbestos-containing cement, we infer that the jury discredited his testimony when he testified that Rock Wool's Delta Maid AF cement was not shipped to Louisiana at all. Thus, there is circumstantial evidence to believe that AF cement was shipped, used, and discarded by the plaintiffs at Avondale in the late 1960s.\n\nBecause Mr. Cusick denies shipping hazardous cement to Louisiana, and plaintiffs argue that such shipment was indeed made, then there exists a conflict in the facts. When there exists a conflict in the facts, the trier of fact becomes the ultimate Judge of credibility even though we may or may not differ with their decision. Fuge v. Uiterwyk, 94-1815 (La. App. 4 Cir. 3/29/95), 653 So.2d 707, writ denied, 98-1099 (La. 6/5/98), 720 So.2d 1205, 1998 WL 485290.\n\nFinally, Rock Wool argues that they cannot be liable for the plaintiffs' injuries because the EPA does not require warnings on products like One Shot cement, which contain less than 1% asbestos (i.e. friable material). This argument is without merit. Mere compliance with federal standards or any other safety standards without more is not prima facie proof that a product is not dangerous or is no longer dangerous. Duanne v. Wal-Mart Stores, Inc., 95-2047 (La. App. 1 Cir. 9/10/96), 679 So.2d 1034, 1037; see also Dill v. State Department of Transportation and Development, 545 So.2d 994, 996 (La. 1989). The warning which is required must alert the consumer prior to use of the dangers within the product, otherwise the warning is ineffective.\n\n\"'\"Adequate warning\"' by manufacturer of product with dangerous propensities (which a manufacturer is presumed to know) is one which, if followed, would make product safe for user; that is, had injured person complied with the warning, there would have been no accident. The warning must be given in such a manner that it can reasonably be brought to the attention of the user.\" Quattlebaum v. Hy-Reach Equipment, 453 So.2d 578 (La. App. 1 Cir. 1984), writ denied, 458 So.2d 474, 458 So.2d 483.\n\nMr. Eugene Coincon, a former employee at Avondale, testified that using Rock Wool's One Shot cement emitted approximately the same amount of dust as the Kaylo insulation. The fact that this cement contained less than 1% asbestos is immaterial. No asbestos warnings were provided, and Rock Wool did not inform its consumers that protective clothing should be used when mixing the cement. Therefore, the danger-in-fact of this cement far outweighed the utility it had in the construction and repair of ocean-going vessels, and because Rock Wool negligently decided to forfeit its duty to provide an adequate and properly placed warning on its insulating cements, we affirm the jury's determination that Rock Wool's product was unreasonably dangerous by design and by failure to warn. We further conclude that the trial court did not err by denying Rock Wool's Motion for a Judgment Notwithstanding the Verdict.\n\nJURY INTERROGATORIES\n\nThe first assignment of error arises from Flight One Plaintiffs, Clifton Abadie, Thomas Naquin, and Robert Terrebonne. They submit that the trial court erred in failing to correct the inconsistent jury interrogatories prior to entering the judgments against them. At the close of the Flight One trial the Judge instructed the jury on the applicable law. The jury was also presented with interrogatories to be completed to return a special verdict for each Plaintiff Additionally, the trial Judge instructed the jury to \"answer all interrogatories, [e]ven if you determine somewhere along the line that there is no liability.\"\n\nThe first question of each interrogatory asked whether the jury found by a preponderance of the evidence that the Plaintiff was occupationally exposed to a significant amount of asbestos. The second question asked whether the jury found by a preponderance of the evidence that the Plaintiff sustained an asbestos related injury. As to both questions the jury was instructed to answer yes or no. Question eight required the jury to \"express in dollars the total monetary compensation, if any, that will fairly compensate [each Plaintiff] for the damage he has sustained.\"\n\nThe jury found by a preponderance of the evidence that Clifton Abadie was occupationally exposed to asbestos. However, they did not find that he had sustained an asbestos related injury. The jury found by a preponderance of the evidence that neither Thomas Naquin nor Robert Terrebonne was occupationally exposed to asbestos. Accordingly, the jury also found that neither Mr. Naquin nor Mr. Terrebonne sustained an asbestos related injury. Although the jury indicated that neither of the three Plaintiffs sustained an asbestos related injury, they returned the interrogatories for Mr. Abadie, Mr. Naquin, and Mr. Terrebonne indicating awards for damages in the amounts of $100,000, $40,000, and $40,000 respectively.\n\nThe three plaintiffs argue that the trial court should have returned the interrogatories to the jury to cure the inconsistencies, or in the alternative, granted their motion for a new trial. Plaintiffs contend that the trial court erred in not correcting the inconsistencies in the interrogatories prior to entering judgments against them.\n\nLSA-C.C.P. art. 1812 sets forth the procedure for a jury to return a \"special verdict.\" Article 1812 states that \"[t]he court shall enter judgment in conformity with the jury's answers to [the interrogatories].\" The Plaintiff's cite Stevens v. Scottsdale Ins. Co., 95-2347 (La. App. 4 Cir. 3/27/96), 672 So.2d 1031, and Ferrell v. Fireman's Fund Ins. Co., 94-1252 (La. 2/20/95) 650 So.2d 742, as the controlling cases for this issue. In both cases the issues involved the juries' verdicts which attributed fault in automobile accidents. Although Stevens and Ferrell are factually dissimilar to the matter at hand, both cases discuss in detail LSA-C.C.P. art. 1813, which addresses alternatives available to a trial court faced with inconsistent answers to interrogatories.\n\nLSA-C.C.P. art. 1813 provides:\n\n\"D. When the answers [to interrogatories] are consistent with each other but one or more is inconsistent with the general verdict, the court may direct the entry of judgment in accordance with the answers, notwithstanding the general verdict, or may return the jury for further consideration of its answers and verdict, or may order a new trial.\"\n\n\"E. When the answers are inconsistent with each other and one or more is likewise inconsistent with the general verdict, the court shall not direct the entry of judgment but may return the jury for further consideration of its answers or may order a new trial.\"\n\nThe plaintiffs argue that LSA-C.C.P. art. 1813 (E) applies and as such the trial court did not have the option to direct the entry of a judgment. We disagree.\n\nAlthough the jury's interrogatories indicate that, unlike Thomas Naquin and Robert Terrebonne, Clifton Abadie was occupationally exposed to a significant amount of asbestos; the jury uniformly decided that neither of the three Plaintiffs sustained an asbestos related injury. The Plaintiffs argue that the jury's answer to interrogatories one and two are inconsistent with their determination that the plaintiffs were entitled to monetary damages. Although this Court recognizes the merit in the Plaintiffs' argument, we decline to follow their application of LSA-C.C.P. art. 1813 (E).\n\nAlthough the jury's answers to interrogatories one and two are inconsistent with the final verdict awarding damages; the answers are not inconsistent with each other. Article 1813 (D) provides an additional procedural option to the trial court in instances where the answers are consistent with each other, but inconsistent with the general verdict. When the answers to the interrogatories are consistent with each other, but inconsistent with the verdict, the trial court may direct the entry of a judgment consistent with the answers to the interrogatories. LSA-C.C.P. art. 1813 (D).\n\nAnswering the interrogatories for Clifton Abadie, Thomas Naquin, and Robert Terrebonne, the jury found that by a preponderance of the evidence neither party had sustained an asbestos related injury. Clearly, the answers are consistent with the jury's determination that Mr. Naquin and Mr. Terrebonne had not been occupationally exposed to a significant amount of asbestos. Although the jury found that Abadie had been occupationally exposed to a significant amount of asbestos, that determination is not inconsistent with findings that he did not sustain an asbestos related injury.\n\nLouisiana Civil Code article 2315 is the foundation upon which all tort law in Louisiana has been founded. \"Every act whatever of man that causes damage to another obliges him by whose fault it happened to repair it.\" LSA-C.C. art. 2315. Damage is an essential element to the statute. The Courts of this state have consistently held that a plaintiff who has not sustained injuries cannot recover damages. It follows that although a party falls victim to some negligent act, the party must have sustained some injury to recover damages. Therefore, the jury's determination that Clifton Abadie did not sustain an asbestos related injury is not inconsistent with their finding that he was occupationally exposed to a significant amount of asbestos.\n\nThe jury's awards for damages to Clifton Abadie directly contradicted their findings that this plaintiff had not sustained an asbestos related injury. However, the contradiction was a direct result of the trial Judge's instruction to the jury to \"answer all interrogatories, [e]ven if you determine somewhere along the line that there is no liability.\" Therefore, pursuant to LSA-C.C.P. art. 1813 (D), the trial court correctly directed the entry of the judgment against the plaintiffs, in accordance with the trial Judge's instructions to the jury and the answers to the interrogatories.\n\nThe jury found Robert Terrebonne also had not sustained an asbestos-related injury. They found he was not occupationally exposed to a significant amount of asbestos. However, in answering the seventh interrogatory, the jury found by a preponderance of the evidence that Robert Terrebonne, \"knowingly and voluntarily assumed the risk of the injury from asbestos containing products.\" Consequently, the jury's finding that Robert Terrebonne assumed the risk of injury is not an error in light of their determinations that he did not suffer an asbestos related injury, nor was he exposed to a significant amount of asbestos.\n\nMr. Terrebonne argues there was no evidence presented which would support a jury finding that he assumed any risk associated with his exposure. However, the threshold determination is whether Mr. Terrebonne sustained an asbestos related injury. In this case the jury's determination that Mr. Terrebonne assumed that risk of injury is merely speculative. Mr. Terrebonne may have been exposed to a significant amount of asbestos. He may have even assumed the risk of exposure. However, in the absence of an asbestos related injury the latter findings are moot. Pursuant to LSA-C.C.P. art. 1813 (D), the trial court entering judgment against Mr. Terrebonne was consistent with the jury's determinations regarding his injuries. Therefore, for the foregoing reasons the trial court's judgment dismissing the suits of Clifton Abadie, Thomas Naquin, and Robert Terrebonne is affirmed.\n\nGENERAL DAMAGES\n\nPlaintiffs, Robert Terrebone, Thomas Naquin and Clifton Abadie, appeal the jury verdict rendered in Flight One which denied their claim for damages resulting from the injuries they incurred from asbestos exposure while employed at Avondale. The jury determined Mr. Terrebone and Mr. Naquin were: (1) not occupationally exposed to a significant amount of asbestos; (2) did not sustain and asbestos-related injury; and (3) that the defendants' products were not a substantial cause in fact of the injuries sustained by them.\n\nOn the other hand, Mr. Abadie was found to have been occupationally exposed to a significant amount of asbestos; however the jury concluded that he did not sustain an asbestos-related injury, and that the products he was exposed to were not a cause in fact of the injuries he sustained. The jury further concluded Mr. Abadie and Mr. Naquin did not assume the risk of their injuries; however, the jury did find Mr. Terrebonne assumed the risk for his injuries. The judgment included a general damage amount for these three plaintiffs, however such amount was not awarded because the jury did not find any connexity between the plaintiffs' exposure to asbestos and their injuries. Thus, we commence our Discussion by examining the record to ascertain whether the jury was manifestly erroneous or clearly wrong.\n\nRobert Terrebonne\n\nMr. Terrebonne, who was 46 years old at the time of trial, testified he was employed by Avondale Shipyards for two and one half months as a student worker in 1966. He later enrolled in college that year, but because of financial difficulties, he returned to Avondale in 1967, and worked there until 1984. Mr. Terrebonne was originally employed as a tacker/helper which he described as similar to carpentry work because a great deal of his duties encompassed new construction. One of the duties required that he assist the fitters with cutting steel and positioning steel doors around the vessels. He also testified this position did not require any exposure to any pipe insulation, nor exposure to any other products used in conjunction with this insulation.\n\nSubsequently, after a couple of years as a tacker/helper, Mr. Terrebonne became a rigger/hooker which required that he load and unload pre-cut steel, angles, beams and flat bars and other prefabricated steel products. As a rigger, Mr. Terrebonne was mainly outdoors and had little to no exposure to other crafts, namely those using asbestos-containing products. Mr. Terrebonne occupied the rigger/hooker position until 1974.\n\nMr. Terrebonne also testified that during the time he occupied this position, he worked overtime on the vessels, filling in wherever he was asked by supervisors in the shipfitting department. He worked regular eight-hour shifts Mondays through Fridays, and worked five hours overtime on Saturdays. At trial, Mr. Terrebonne could not estimate how much overtime he worked from 1969 to 1974, but conceded that his overtime hours were \"always erratic and sporadic\".\n\nIn 1974, Mr. Terrebonne was transferred to the warehouse as an expediter until 1981. As an expediter he was required to receive and store inventory for each department at Avondale, and to prepare shipments to be delivered to each department as needed. As it relates to the shipfitting department, Mr. Terrebonne recalled working with Kaylo, Unibestos, Pabco and One-Shot cement. He had to take these products out of the boxes, label them, determine the amount of material in each box, and ship the material to the departments which requested them. He also testified that on one occasion when taking the Kaylo and Pabco insulation out of the boxes the seal on the material broke and he inhaled some of the dust, and from that point on he avoided inhaling any dust which came from those products.\n\nThe medical experts (Dr. Robert Jones and Dr. Louis Rubin) testified Mr. Terrebonne smoked a half pack of cigarettes a day for two years until 1962, and complained of chronic fatigue, shortness of breath with exertion, difficulty sleeping, and an occasional dry cough. Two pulmonary function tests were conducted: the first was done in March 1991, and the other was done in July, 1993. In 1991, Dr. Louis Rubin diagnosed Mr. Terrebonne as having mild restrictive defect because his lung volume was less than 80%. In 1993, Dr. Rubin testified Mr. Terrebonne's lung condition had worsened to a moderate restrictive defect, and his diffusing capacity had been reduced by 30%. Dr. Rubin also found evidence of pleural thickening.\n\nDr. Jones also conducted an examination of Mr. Terrebonne in 1993, and he concluded that Mr. Terrebonne's lung function was normal even though he is a relatively small man with a small frame. He testified Mr. Terrebonne's x-rays appear normal \"except for a few little round-shaped nodules widely scattered in the lungs\". Dr. Jones dismissed the possibility of any asbestos-related disease for Mr. Terrebonne, but attributed the presence of these small nodules to low-grade infections like the flu. Mr. Terrebonne total lung volume was less than normal, however, Dr. Jones testified this reduced lung volume was the result of his shallow chest size. As it relates to the discrepancy between the diffusing capacity test results between his lab and Dr. Rubin's lab, Dr. Jones testified \"you cannot compare the value of a diffusing capacity test between two labs and assume that the difference represents the change in a patient . . . It's not valid\". Dr. Jones reasoned that the types of machines used between the two labs and the actions of the technicians conducting the test can cause such a discrepancy.\n\nOn cross-examination, Mr. Terrebonne, who had hardly ever gone to see a doctor prior to his kidney stones operation, testified he took the X-rays he received from Dr. Rubin to Dr. Elaine LaNasa Richardson, a physician who was referred to him by his family doctor. Like Dr. Jones, Dr. Richardson was not able to find any evidence of asbestosis from her reading of these X-rays, and she could not link his complaint of shortness of breath to his asbestos exposure at Avondale.\n\nIn addition to finding Mr. Terrebonne was not exposed to a significant amount of asbestos fibers and did not receive an injury related therefrom, the jury also concluded the exposure he sustained was from his own negligence. In other words, Mr. Terrebonne assumed the risk of his injuries.\n\nMr. Terrebonne argues the record does not support the jury's decision, and considering the overwhelming weight of the evidence, the jury's Conclusion was clearly wrong. He further argues the trial court's failure to correct their decision was manifest error. We disagree.\n\nGenerally, the assumption of the risk defense would not have been available to a plaintiff like Mr. Terrebonne. [T]his [Supreme] Court held that the absolute defenses of assumption of the risk and contributory negligence were no longer viable as they had been subsumed by comparative fault principles. Murray v. Ramada Inns, Inc., 521 So.2d 1123 (La. 1988), see also Pitre v. Louisiana Tech University, 95-1466 (La. 5/10/96), 673 So.2d 585, cert. denied, ___ U.S. ___, 117 S.Ct. 509, 136 L.Ed.2d 399, 65 USLW 3395, 65 USLW 3398 (U.S. La. 1996). However, as mentioned earlier, the statute which replaced assumption of the risk defense, (i.e. comparative fault) is a substantive right which is applied prospectively only. Cole, supra. Therefore, the assumption of the risk defense is applicable to this case because the alleged injury complained of transpired prior to abolishing this defense.\n\nNext, this Court, in an effort to properly evaluate the assumption of the risk defense, must find whether the plaintiff suffered some compensable injury from the inhalation of asbestos from the defendants' products. A plaintiff bears the burden of proving the causal connection between an accident and injury (damage) by a preponderance of the evidence. Rhodes v. State Through Dept. of Trans. and Development, 94-1758 (La. App. 1 Cir. 12/20/96), 684 So.2d 1134, 1144, writ considered, 97-0242 (La. 2/7/97), 688 So.2d 487; see also Head, 669 So.2d at 507. (Emphasis added). This Court cannot presume that a plaintiff assumed a risk until his actions have caused him injury. In essence, the plaintiff assumes the risk of injury only when he ignores an obvious danger and is subsequently injured.\n\nAccording to the jury's answers to the interrogatories, Mr. Terrebonne did not sustain any injury related to his occupational exposure to asbestos. He testified his regular work detail from 1969 to 1974, encompassed cutting, loading and hauling steel and other products to the four different yards at Avondale, and the only period in which he was exposed to asbestos dust was when he worked five hours per week overtime on the vessels in various positions in the shipfitting department. He also testified this overtime work was \"sporadic\" and inconsistent. Dr. Jones testified that from his examination, Mr. Terrebonne's lung function was normal and did not show any evidence of any abnormalities.\n\nConsidering the jury's determination that Mr. Terrebonne's exposure to asbestos was minimal, at best, and did not result in an injury, we are reluctant to disturb the jury's findings as to this question of fact since there was no error in their determination as to the credibility of the witnesses and the weight to be given the evidence presented at trial. Furthermore, Mr. Terrebonne argues that his exposure to these products has caused him to suffer damages from fear of contracting this lethal disease. We find Mr. Terrebonne's concern for contracting cancer in the future (cancerphobia) is without merit because he lacks specificity in his testimony.\n\nWhile a plaintiff may recover for \"cancerphobia\" without stating he is suffering mental distress, a plaintiff must, as a threshold matter, present evidence of his particular fear of developing cancerous conditions in the future to support that recovery. Smith v. A.C. \u0026 S., Inc., 843 F.2d 854, 859 (5th Cir. 1988).\n\n\"While it is true that they [Louisiana jurisprudence] allowed recovery for mental anguish engendered by a proven traumatic ordeal which did not result in physical injury, the cases do not recognize any right of recovery for mental anguish arising from fear of future complications from an unproven event. [Plaintiff's] case failed because he did not prove that he sustained an injury resulting from his exposure to asbestos products.\" Adams v. Johns-Manville Sales Corp., 783 F.2d 589 (5th Cir. 1986).\n\nIn the case sub judice, neither Dr. Richardson, a physician who subsequently examined Mr. Terrebonne, nor any other physician, other that Dr. Rubin, has told Mr. Terrebonne he has an asbestos-related disease. Furthermore, Mr. Terrebonne's fear of contracting this disease did not come to light until he heard the testimony of the other plaintiffs or their survivors. Hence, we find that at the time of the filing of this lawsuit, Mr. Terrebonne did not have any compensable damages for fear of contracting cancer in the future.\n\nThomas Naquin\n\nMr. Naquin was 44 years old at the time of trial, and was employed at Avondale between 1968 to 1971, as a shipfitter's helper. His occupational duties required working on both old and new vessels at the shipyard; and, his specific duties required working with iron, putting up beams and sides of walls, working on bulkheads, hallways and engines. Mr. Naquin was also a pipefitter, and as such he was required to lay pipeline throughout vessels.\n\nBecause he had to work on old vessels, Mr. Naquin had to repair defective pipelines by tearing off old thermal insulation. Asbestos cement and cloth which was used to secure the thermal insulation had to be broken, cut and chipped away with a hacksaw, chipping hammer or a knife. This procedure created a lot of dust which Mr. Naquin eventually became accustomed to while working in the bottom of ships. Further, this \"dusty\" condition was aggravated by the use of blowers which many of the craftsman used to provide some ventilation in these parts of the vessels. Mr. Naquin testified he was never told of the danger of asbestos, and he was not required to wear any sort of protective wear while working in the bottom of vessels.\n\nMr. Naquin was a relatively light smoker in that he smoked one pack of cigarettes per day for four years and quit smoking in 1967. He complained to his physician of shortness of breath and exhaustion because of his previous exposure and inhalation of pipe insulation dust while working at Avondale. He also testified his condition affects his job performance with his present employer, the Lafourche Basin Levee District.\n\nApproximately four years prior to trial in Flight One, Mr. Naquin was employed as a laborer for the levee district, along with fifteen other workers. Mr. Naquin was required to fortify the levee and the surrounding homes with sandbags whenever high water threatened the levee. He remembered getting tired easily, and having his co-workers to fill in for him until he regained his strength. At the time of trial, Mr. Naquin was a foreman with the levee district supervising at least twelve men, and he was no longer required to do any manual labor in this position.\n\nMr. Naquin further testified he has some \"psychological problems\" after hearing the medical testimony related to the other plaintiffs who have either died, had heart attacks, bypass surgery, or had portions of their lungs removed because of exposure to asbestos. He also complained that he cannot walk for long distances like he had done in the past. Testimony also revealed that Mr. Naquin has an occasional dry cough which periodically produces sputum or phlegm and requires antibiotics and sometimes hospitalization.\n\nDr. Rubin conducted a PFT (pulmonary function test) on Mr. Naquin in 1991, and diagnosed him with moderate restrictive ventilatory defect. In 1993, Dr. Rubin testified that Mr. Naquin's condition remained relatively the same. Dr. Rubin also found evidence of pleural thickening on both sides of Mr. Naquin's lungs, pleural plaques and nodular opacities from Mr. Naquin's X-rays. From these findings, Dr. Rubin diagnosed Mr. Naquin with pleural and pulmonary asbestosis, and hypertension. According to Dr. Rubin, this condition also gives Mr. Naquin an increased risk of contracting lung cancer.\n\nDr. Jones also conducted an examination of Mr. Naquin and reviewed a number of X-rays taken at the Tulane Medical Center as well as X-rays from Thibodaux General Hospital where Mr. Naquin was admitted for the removal of kidney stones. Dr. Jones found no definite evidence of asbestosis, but alluded to the possibility of pleural plaques which he could not substantiate because it was not completely visible on the X-rays. In any event, Dr. Jones testified pleural plaques would not cause any breathing defects nor would it increase Mr. Naquin's chances of contracting asbestosis.\n\nAfter having some breathing tests done, Dr. Jones discovered that Mr. Naquin had a normal forced vital capacity, normal diffusing capacity, reduced residual volume and a slightly reduced total lung capacity, all of which was consistent with normal lung functioning. Because the spirometric tests were virtually normal, Dr. Jones excluded any possibility of restrictive or obstructive diseases. In other words, without an abnormal X-ray, it is difficult to diagnose a person having asbestosis. Dr. Jones also noted from the reports he was given to review that Mr. Naquin's complaints of shortness of breath was never communicated to hospital personnel at Thibodaux General Hospital when he was scheduled to have some kidney stones removed. Dr. Jones further testified Mr. Naquin's complaint of shortness of breath is attributable to the fact Mr. Naquin was out of shape, and had gotten older and heavier since the time he initially started working at the levee board.\n\nClifton Joseph Abadie\n\nMr. Abadie, who was 57 years old at the time of trial, testified he was employed at Avondale as a pipefitter from 1961 until 1966. From 1966 until 1987, Mr. Abadie worked as a pipefitter at Union 60 until he returned to Avondale in 1987, to occupy his previous position. As a pipefitter, Mr. Abadie worked on both old and new construction, but the majority of his duties involved new construction. He laid various pipelines in the engine rooms of vessels while working around other craftsman. Though he did not work as an insulator, Mr. Abadie testified he inhaled dust which was created in that section of the vessels because neither he nor his other co-workers were given any respiratory devices or masks. He also testified he and his co-workers worked in close proximity with insulators.\n\nMr. Abadie also recalled working with gaskets manufactured by Garlock and Flexitallic, however he could not say as a certainty whether any of the gaskets contained asbestos. These gaskets, as he described them, would stick to the grooves of the flanges which seal pipes together, and if there was any repair work to be done on those pipes, the pipefitter would have to scrub off the broken gasket with a knife or a corkscrew-like tool which would create a large amount of airborne dust.\n\nMr. Abadie testified he was hospitalized on a number of occasions for problems unrelated to asbestos exposure, and because he gets short-winded easily, he cannot climb stairs, hunt or sing as he once did. Both Dr. Rubin and Dr. Jones noted Mr. Abadie was hospitalized for hypertension.\n\nHowever, Mr. Abadie was still employed by Avondale as a full-time pipefitter at the time of trial. The only work-related injuries he described in his testimony was an injury to his knee and a hernia operation from a fall he had within one of the vessels.\n\nDr. Rubin examined Mr. Abadie and diagnosed him with having pleural asbestosis which he stated has a tendency to progress as Mr. Abadie gets older, or it can progress into some other disease from a subsequent illness. Dr. Rubin also testified if Mr. Abadie is ever diagnosed with asbestosis, which is different from pleural asbestosis, it may aggravate a pre-existing heart condition, or place him at risk for developing several types of cancers, including mesothelioma. Asbestosis can also be fatal to Mr. Abadie if he caught a simple cold or flu because of his respiratory infection.\n\nOn the other hand, Dr. Jones took X-rays, conducted examinations, breathing tests, and reviewed the medical history of Mr. Abadie for two days; and Dr. Jones concluded Mr. Abadie's lung function and X-rays were normal. No evidence of asbestos exposure was found in his lungs, and Dr. Jones did not find any reason to diagnose Mr. Abadie with asbestosis. Dr. Jones also believed Mr. Abadie would not have any complications from any future illnesses because his lungs did not exhibit any abnormalities. Furthermore, Dr. Jones testified Mr. Abadie's complaint of shortness of breath could have resulted from a number of different causes including Mr. Abadie's physical condition wherein he was out of shape, overweight and getting older.\n\nStandard of Review\n\nConsidering our well-settled jurisprudence, this Court is bound by the Louisiana Constitution to give deference to the trier of fact's decision when evaluating appeals from the trial court, and our subjective viewpoints must not interfere with the trier of fact's decision unless it is not supported by the record. In other words, the trier of fact must be clearly wrong or manifestly erroneous. Mundy v. Department of Health and Human Resources, 609 So.2d 909 (La. App. 4 Cir. 1992), writ granted, 613 So.2d 960, affirmed 620 So.2d 811; see also J.A.G. v. Schmaltz, 95-2755 (La. App. 4 Cir. 10/23/96), 682 So.2d 331, writ denied 96-3074 (La. 2/7/97), 688 So.2d 505.\n\n\"Article V § 10 (B) of the Louisiana Constitution of 1974[,] provides that the appellate jurisdiction of a court of appeal extends to law and facts. The exercise of this jurisdiction, however, has been limited by the jurisprudential rule that a court of appeal may not set aside a trial court's or a jury's finding of fact in the absence of \"manifest error\" or unless it is \"clearly wrong,\" and where there is a conflict in the testimony, reasonable evaluations of credibility and reasonable inferences of fact should not be disturbed upon review. Weatherford v. Commercial Union Insurance, et al., 94-1793, 941927 (La. 2/20/95), 650 So.2d 763, 765, 766; citing Stobart v. State, 617 So.2d 880 (La. 1993); Sistler v. Liberty Mutual Insur. Co., 558 So.2d 1106 (La. 1990).\" (Emphasis theirs).\n\nAlthough deference to the factfinder should be accorded, the court of appeal, and the Louisiana Supreme Court, nonetheless, have a constitutional duty to review facts. of course, the reviewing court may not merely decide if it would have found the facts of the case differently. Rather notwithstanding the belief that they might have decided it differently, the court of appeal should affirm the trial court where the latter's judgment is not clearly wrong or manifestly erroneous. Bennett v. Wal-Mart Store, Inc., 96-1726 (La. App. 1 Cir. 6/20/97), 696 So.2d 631, writ denied, 97-1928 (La. 11/7/97), 703 So.2d 1269; citing Ambrose v. New Orleans Police Dept. Ambulance Service, 93-3099, 93-3110, 93-3112 (La. 7/5/94) 639 So.2d 216, 221. (Emphasis added). In applying the manifestly erroneous clearly wrong standard to the finding below, appellate courts must constantly have in mind that their initial review function is not to decide factual issues de novo. Foster v. Liberty Rice Mill, 96-438 (La. App. 3 Cir. 12/11/96) 690 So.2d 792.\n\nTherefore, it is incumbent upon this Court to review the facts with great deference to the trier of fact, but ever mindful that the trier of fact's decision is subject to be overturned if it is not supported by the law and the evidence. Though a number of medical experts were presented by both the plaintiffs and the defendants in both flights, we shall limit our review of these plaintiffs' medical conditions to the two physicians who personally examined all of the plaintiffs and reviewed their medical records: Dr. Louis Rubin, plaintiffs' medical expert; and Dr. Robert Jones, defendants' medical expert.\n\nIn reviewing the expert medical testimony of the two primary medical experts presented in this case, we must be careful not to frustrate the jury's findings without just cause.\n\nCredibility determinations are subject to the strictest deference and the manifest error-clearly wrong standard demands great deference for the trier of fact's findings, because only the trier of fact can be aware of the variations in demeanor and tone of voice that bear so heavily on the listener's understanding and belief in what is said. Rosell v. ESCO, 549 So.2d 840, 844-45 (La. 1989); see also Theriot v. Lasseigne, 93-2661 (La. 7/5/94), 640 So.2d 1305, 1313. The reviewing court may not disturb reasonable evaluations of credibility and reasonable inferences of fact when viewed in light of the record in its entirety even though it feels its evaluations are more reasonable. Id. at 1313; citing Stobart, 617 So.2d at 882. Even when we consider the medical testimony of several differing opinions, our duty remains the same.\n\n\"[W]e would affirm the trial court's judgment because when there are two permissible views of evidence, a fact finder's choice between them cannot be manifestly [erroneous] or clearly [wrong]. Moreover, where the testimony of expert witnesses differ, it is the responsibility of the trier of fact to determine which evidence is the most credible.\" Sistler v. Liberty Mutual Insurance Co., 558 So.2d 1106, 1114 (La. 1990); see also Picou v. Equifax Services, Inc., 96-819 (La. App. 5 Cir. 2/25/97), 690 So.2d 219, 225.\n\nWe have before us the testimony of several well known medical experts whose credentials and years of experience we cannot discredit, but we must look to their testimony in the record to discover if the jury's reliance on either is reasonable.\n\nDr. Jones has been a professor of medicine at Tulane University Medical Center since 1974, a lung specialist with board certification in internal medicine, and a subspecialty in pulmonary disease. He is also a medical advisor to the Social Security Administration, and has memberships in and publications with a number of national medical organizations related to internal medicine.\n\nDr. Rubin is a professor of medicine, professor of physiology, and the head of the pulmonary and critical care medicine division at the University of Maryland School of Medicine. He was the former chief of pulmonary medicine at the Veterans Administration Hospital in Baltimore, Maryland, but he continues to be an attending physician at the V.A. Hospital. Dr. Rubin has testified he has examined a number of workers who were occupationally exposed to asbestos even during his training at Duke University. Dr. Rubin has also been asked to serve on many panels regarding occupational diseases, and has assisted the United States Attorney General's Office in training its attorneys for asbestos litigation.\n\nWhile it is our duty to examine the totality of the evidence, both medical and lay, in our ruling as to this appeal, we maintain that the credibility, demeanor and weight of the testimony of both Drs. Jones and Rubin remain at the jury's discretion. See Johnson v. Louisiana Dept. of Health \u0026 Human Resources, 590 So.2d 854 (La. App. 3 Cir. 1991); and Head v. Pendleton Memorial Methodist Hospital, 95-0461 (La. App. 4 Cir. 1/31/96), 669 So.2d 504, 507. Moreover, the testimony of a specialist in a certain field is entitled to greater weight than that provided by other medical experts when the subject at issue concerns the particular field of the specialist's expertise. Johnson, 590 So.2d at 856.\n\nIn the case sub judice, both physicians have specialized in the field of pulmonary medicine and have examined hundreds, if not thousands, of individuals for asbestos-related diseases during their individual practices. However, for the jury to decide whether Mr. Terrebonne, Mr. Naquin and Mr. Abadie did not sustain an asbestos related disease from their employment at Avondale is not manifest error nor clearly wrong from our review of the record before us. Furthermore, for the jury to rely upon and favor the expert testimony of Dr. Jones to substantiate their factual determination was not unreasonable.\n\nAlthough Dr. Rubin took great care to define and explain medical terminology, critique the X-rays and medical documents for each of these three plaintiffs, and to discuss previously related experiments which he conducted in other areas of the country, his testimony was not given as much weight in comparison to Dr. Jones because: (1) he admitted he failed the B reader's examination; \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e (2) Dr. Rubin did not published an article specifically related to diseases cause by asbestos exposure; (3) Dr. Rubin is not licensed to practice medicine in Louisiana; (4) he did not take any chest X-rays of these three plaintiffs; (5) he was not a consultant with any of the national medical organizations; and (6) he was not familiar with the latest studies in the medical journal publications, namely those dealing with the correlation between cigarette smoking and the presence of opacities.\n\nTherefore, we find the jury's reliance on Dr. Jones' testimony was not manifest error nor clearly wrong. Dr. Jones' experience in examining patients in the New Orleans area with pulmonary diseases for over 20 years, and his knowledge of occupational diseases impressed this jury. Thus, we affirm.\n\nMr. Abadie further argues he was prejudiced by the trial court's decision to not allow him to cross-examine Dr. Jones regarding a radiology report Dr. Jones had received. This report stated Mr. Abadie had evidence of mild pleural thickening consistent with asbestos exposure. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Mr. Abadie also argues this report was purposefully withheld by the defendants and not submitted to Mr. Abadie's counsel in response to his discovery request. This report totally contradicted Dr. Jones' diagnosis that Mr. Abadie's X-rays and lung function was normal.\n\nDefendants argue this report was also not submitted to them by Dr. Jones, and since Dr. Jones was the only expert they retained from the Tulane Medical Center, the fact that Dr. Jones did not forward the radiology report to them as part of his report is immaterial. Therefore, they argue the defendants should not be penalized for not forwarding this information to the plaintiffs since they were unaware that it existed.\n\nDr. Jones, while under cross-examination by the plaintiffs, testified the X-rays are taken by a technician on duty at time the patient arrives for his examination. The X-rays are then viewed by the radiology department before it is sent to him, and sometimes the radiologists issue reports concerning their observation of those X-rays. However, Dr. Jones testified that any reports that are issued by a radiologist concerning a patient who is not in agreement with his final analysis is not included in his report. Dr. Jones further testified it would be unreasonable to compare a radiologist's decision about whether or not a person had an injury from asbestos exposure with his decision given his years of experience. Moreover, Dr. Jones testified the radiology report would not be concealed or mentioned in his report because he, not the radiologist, is to make the decision concerning the subject's medical condition.\n\nThe defendants also contend since the plaintiffs subsequently obtained possession of the radiology report, it was the plaintiffs' ethical obligation to disclose this information to the defendants and not vice versa.\n\nThe trial court found the defendants had the obligation to supply the plaintiffs with everything they received from their expert. When this report from the radiologist came into the possession of the plaintiffs, it was then the plaintiffs' obligation to forward a copy to opposing counsel Ä especially when plaintiffs intended to use this report to impeach the credibility of Dr. Jones. Because Dr. Jones was questioned extensively by the plaintiffs concerning his procedure for handling contradicting reports from the radiology department concerning his patients, the trial court allowed the plaintiffs to proffer the radiology reports, however, the court denied plaintiffs the right to cross-examine Dr. Jones about the substance of those reports. We agree.\n\nLa. C.E. art. 607 provides the general rule for using extrinsic evidence to impeach the credibility of witnesses. This article states in pertinent part:\n\n\"(2) Other extrinsic evidence, including prior inconsistent statements and evidence contradicting the witness' testimony, is admissible when offered solely to attack the credibility of a witness unless the court determines that the probative value of the evidence on the issue of credibility is substantially outweighed by the risks of undue consumption of times, confusion of the issues, or unfair prejudice.\" (Emphasis added).\n\nIn the case subjudice, it would have been prejudicial to the defendants to allow the plaintiffs to cross-examine Dr. Jones concerning the substance of the radiology report for Mr. Abadie when this report was not made part of Dr. Jones' report. Because the plaintiffs' counsel obtained this report indirectly, the burden shifted to them to disclose this information. Therefore, we also find the trial court's decision to deny the plaintiffs' request to cross-examine Dr. Jones on the substance of the radiology report for Mr. Abadie to be proper, and we find no error in allowing the radiology reports for Mr. Bordelon, Mr. Constant and Mr. Abadie to be proffered before the jury.\n\nOCF also claims the jury's general damage award of $200,000 to Mr. Horace Bordelon was excessive given the \"scant\" amount of evidence presented at trial to prove Mr. Bordelon's medical condition resulted from his exposure to asbestos. OCF furthers argues by its cross claim that the general damage award of $375,000 each to Clovis Orgeron, Joseph Constant and Nelson LaBorde was excessive because each plaintiff had successfully undergone treatment for their cancers and their remaining symptoms from asbestos exposure was only shortness of breath and intolerance to exercise. OCF also appeals the general damage awards of $300,000 to both Louis Rodriquez and Romain Duplantis, and the general damage awards to Dean Mefferd and Willie Jackson each as excessive.\n\nHorace Bordelon\n\nMr. Bordelon argues that during his twenty-seven years at Avondale, he performed mainly as a shipfitter doing carpentry work (i.e. tearing and repairing pipes), and he was constantly working around other crafts which utilized the asbestos-containing pipe insulation named Kaylo and Pabco. Because of poor ventilation, lack of protective equipment, and an improperly placed warning, if any, Mr. Bordelon was forced to breathe the asbestos dust while working in the lower parts of the vessels. In 1978, Mr. Bordelon retired from Avondale after having a heart attack and having been diagnosed with coronary artery disease. Mr. Bordelon also argues that because his exposure to asbestos aggravated his pre-existing condition \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e and could produce future complications for him, the general damage award was reasonable and within the discretion of the jury. We agree.\n\nThere is evidence in the record to support the argument that Mr. Bordelon's health has severely deteriorated because of his occupational exposure to asbestos, and that the risk of contracting cancer of the lungs and cancer of the pleura is greatly increased by the cumulative effect of smoking, his pre-existing heart attack and his asbestos inhalation for over 20 years. In fact, the following colloquy between Dr. Louis Rubin, plaintiffs' medical expert, and Mr. Murray, plaintiffs' counsel, illustrates the seriousness of Mr. Bordelon's condition:\n\n\"Q. Doctor, do you relate the moderately reduced diffusing capacity of carbon monoxide that you observed in Mr. Bordelon to his occupational exposure to asbestos?\"\n\n\"A. Yes. The reduced diffusing capacity, I believe, is due to the presence of asbestosis, which is the result of his occupational exposure to asbestos.\"\n\n\"Q. Now, you've indicated that when he was tested for the second time in 1993, just about two years difference between the two dates, that there was an increase in the impairment of diffusing capacity, that he got worse. Did I understand you correctly?\"\n\n\"A. Yes, there was a decrease in measurement in diffusing capacity which indicates a worsening of impairment.\"\n\n\"Q. What would be the significance of that finding to you sir?\"\n\n\"A. Well, I think the major thing to be concerned about in that situation would be that is indicative of a progression of the disease process.\"\n\n\"Q. What findings did you observe on the x-rays?\"\n\n\"A. There was evidence of prior open heart surgery. There was thickening of the pleura, on the right side more so than the left. And again, there were nodular opacities, small little pea-sized nodules in the mid and lower parts of the lungs on both sides, again, right side more so than the left.\"\n\nQ. And that indicates interstitial fibrosis?\n\nA. That indicates interstitial lung disease, yes.\n\nQ. In your opinion, is that asbestosis in this patient?\n\nA. Yes. I believe this patient had occupational exposure, latency period, symptoms, pulmonary function and x-ray changes, all of which are consistent and diagnostic by putting the constellation of asbestosis.\n\nQ. Doctor, what is the effect of the combination of these two problems on this patient; that is, the heart condition directly for which he had bypass surgery, and his lung condition, asbestosis?\n\nA. Well, the combination of the two together again, of greater significance, in terms of both symptoms and perhaps lifespan, than either one independently, either one, alone. Again we're disrupting the machinery at both ends, the cogs on both ends. The lungs are impaired. The heart has abnormalities. That is more significant than if just one of those processes, one of those organs were impaired.\n\nGiven the following excerpts from the transcript of Flight One as to Mr. Bordelon, it is clear that Mr. Bordelon has sustained a significant amount of damages from his exposure to asbestos, and though his heart condition was unrelated to such exposure, it was a relevant factor for this jury to consider because of the cumulative effect it had on Mr. Bordelon's health. The trial court has much discretion in assessing general damages, and an appellate court should not modify the award unless it is beyond that which a reasonable trier of fact could assess for a particular injury to the particular plaintiff under the particular circumstances. Only if the appellate court finds an abuse of discretion may it examine prior awards of general damages to determine the amount the trier of fact reasonably could award. Reichert v. Bertucci 96-1213 (La. App. 4 Cir. 12/4/96), 684 So.2d 1041, 1045, writ denied, 97-0023 (La. 2/7/97), 688 So.2d 511. (Emphasis added). See also Youn v. Maritime Overseas Corp. et al., 623 So.2d 1257, 1261 (La. 1993), cert. denied, 510 U.S. 1114, 114 S.Ct. 1059, 127 L.Ed.2d 379 (1994). Hence, the general damage award to Mr. Bordelon was within reason, and we will not disturb the award because ample evidence was presented to support the jury's verdict.\n\nWe now turn to the general damage awards given in favor of Mr. Clovis Orgeron and Mr. Joseph Constant to determine whether such awards were excessive.\n\nJoseph Constant\n\nThe record indicates Mr. Constant worked at Avondale for 40 years as a pipefitter's helper until 1984, when he underwent surgery to remove cancer from the right upper lobe of his lungs. This procedure is called a right upper lobectomy, and resulted in the loss of 12% to 13% of his total lung. Mr. Constant was also an active smoker for 30 years prior to the surgery, and following the surgery he had constant complaints of progressive shortness of breath, chronic cough and severe chest pain when he inhales Ä conditions similar to pleurisy. Mr. Constant had a series of repeated respiratory infections which required antibiotics and even hospitalization. Relief was only achieved by the use of bronchodilator medications like Ventolin and Uniphyl which were designed to open the airways and improve air flow and decrease mucus secretion into the airways.\n\nAccording to Dr. Rubin, Mr. Constant's x-rays indicated evidence of asbestosis and some nodular opacities in both lungs which was consistent with interstitial lung disease from asbestosis. However, neither Dr. Rubin nor Dr. Jones attributed this obstructive lung disease to asbestos exposure; however Dr. Rubin testified that Mr. Constant's obstructive lung disease, together with his prior smoking history and repeated bouts with respiratory infections would make it difficult for him to breathe because these problems would affect the efficiency with which oxygen and carbon dioxide is exchanged in his lungs.\n\nTherefore, in light of Reichert and Youn, we will not disturb the general damage award for Mr. Constant because the jury entertained the diagnoses of both physicians, and made the general damage award accordingly.\n\nClovis Orgeron\n\nMr. Orgeron, on the other hand, was a tacker and a shipfitter's helper at Avondale for seventeen years. He was an active cigarette smoker for 20 years, but later quit in 1960. Mr. Orgeron underwent a left pneumonectomy for lung cancer in 1974, which required his entire left lung be removed, and he had a history of childhood pneumonia and possible empyema. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e His major complaint was progressive shortness of breath, and his PFT between the years of 1991 and 1993 revealed the presence of a moderate restrictive defect with a moderate to severely reduced diffusing capacity in his measurements. Dr. Rubin attributed the obstructive defect in Mr. Orgeron's lungs to his prior smoking history, and found the restrictive defect resulted from Mr. Orgeron's having only one lung which tried to compensate for the missing lung. The abnormalities Dr. Rubin noticed Mr. Orgeron's diffusing capacity was evidence of asbestosis, and coupled with the other named complications, Dr. Rubin concluded Mr. Orgeron had cancer of the pleura which was caused by a combination of cigarette smoke and asbestos. When damages are unsusceptible of precise measurement, much discretion is left to the court for its reasonable assessment. La. C.C. art. 1999; see also Head, 669 So.2d at 509.\n\nFLIGHT TWO PLAINTIFFS\n\nPlaintiffs, Nelson LaBorde, Dean Mefferd, Romain Duronslet, Willie Jackson, and Louis Rodriguez were found by the jury to have sustained asbestos related injury from their individual occupations with Avondale. The jury also determined that Lester Plaisance's cause of action had prescribed due to his failure to take timely action on his claim. Duronslet, Mefferd and Jackson were awarded $250,000 each for their injuries. Duplantis and Rodriguez were awarded $300,000 each for their injuries, and LaBorde received $375,000 in damages.\n\nNelson LaBorde\n\nIn Flight Two, testimony revealed Nelson Laborde worked at Avondale for 27 years, first as an electrician's helper in 1962 and later transferred to the paint department.\n\nIn both occupations, Mr. LaBorde recalled working around other craftsmen who were handling Kaylo insulation, and remembers specifically having to breathe the dust created by the other crafts on a daily basis. Mr. Laborde complained of extensive respiratory problems, shortness of breath, sleeping difficulty, and a history of pneumonia. Dr. Rubin diagnosed Mr. Laborde with pleural and pulmonary asbestosis, and a substantial decline in his total lung volume measurement. Dr. Rubin also testified that pleural and pulmonary asbestosis could increase his risk of developing cancer in the future.\n\nDean Mefferd and Romain Duronslet\n\nDean Mefferd and Romain Duronslet were both electricians at Avondale for over 25 years. They testified they worked with and around Kaylo insulation on a consistent basis. Mr. Mefferd was diagnosed with congestive heart failure, and pleural disease from asbestos exposure. Mr. Duronslet was diagnosed with asbestosis in 1991, pleural thickening on both sides, pleural plaques and nodular changes consistent with asbestosis. Both diagnoses were made by Dr. Rubin.\n\nWillie Jackson\n\nWillie Jackson worked at Avondale for 14 years as a trash truck driver and also as a boilermaker. He previously worked with asbestos roofing products in Los Angeles, California. As a truck driver for three years, Mr. Jackson would have to regularly sweep and haul discarded asbestos insulation. As a boilermaker for the remainder of his years at Avondale, Mr. Jackson worked around insulators who were cutting and tearing Kaylo insulation in small rooms along with several of the plaintiffs in this action. At the time of trial, Mr. Jackson and his wife currently live with their daughter because of Mr. Jackson's deteriorating health. Mr. Jackson cannot cook for himself, takes almost two hours dressing himself, and sleeps in an elevated bed. Dr. Rubin diagnosed Mr. Jackson with pleural disease from asbestosis, thickening of the chest wall, mild to moderate restriction (i.e. severely scarred lungs), hardening of the arteries and congestive heart failure.\n\nLouis Rodriguez\n\nLouis Rodriguez was employed with Avondale for 11 years as an electrician's journeyman. He worked mainly in the engine rooms, and worked with asbestos pipe covering. Mr. Rodriguez's testimony was that the video admitted at trial as demonstrative evidence was an accurate depiction of the conditions which existed in the engine rooms when he worked at Avondale. Though the size of the rooms varied, Mr. Rodriguez testified the amount of dust created from Kaylo insulation was the same as in the video. Mrs. Rodriguez corroborated the testimony of her husband by testifying that when her husband would come home, his clothes were covered with so much white dust she had to shake them before she would wash them.\n\nMr. Rodriguez testified Avondale had also implemented the buddy system which required every employee to assist other workers with different jobs as the need arose. Thus, Mr. Rodriguez would sometimes cut, tear and install asbestos insulation, mix cement or install gaskets. He did not recall the name of the insulation he worked with, but did recall working with Mr. Jackson, Mr. Laborde and Mr. Duplantis on a regular basis.\n\nMr. Rodriguez had a heart attack in 1989, had undergone two coronary angioplastys and a carotid artery endarterectomy. At the time of trial, Dr. Rubin found rales (i.e. snapping sounds when one takes a breath) in both lungs, pleural thickening on both lungs, and interstitial nodular fibrotic changes in both lungs. Dr. Rubin diagnosed Mr. Rodriguez with asbestosis, and testified Mr. Rodriguez had a great risk of contracting cancer.\n\nDr. Robert Jones, the IME for the defense, disputed the diagnoses of Dr. Rubin as to all plaintiffs in Flight Two. For example, Dr. Jones diagnosed Mr. Mefferd with an enlarged heart related to his cardiomyopathy which is a condition where the heart muscle gets weak and does not have the strength to eject the normal amount of blood. Dr. Jones determined that his lung region and his pleura were normal, and no evidence of asbestosis was found.\n\nLouis Duplantis was diagnosed with pleural thickening and pleural plaques which, according to Dr. Jones, does not have any effect on his lung function and does not increase the risk of lung cancer. The restriction on his diffusing capacity was related to his smoking history, and the damage to his lower lobe on his left side was caused by his previous history of pneumonia. No evidence of asbestosis was found.\n\nDr. Jones did not find any lung abnormalities with Nelson Laborde, however, he attributed Mr. Laborde's complaints of shortness of breath to his smoking history and his medication from a liver transplant in 1990 which reduced his immune system.\n\nAlthough Dr. Jones found a number of problems with Willie Jackson consisting of a chest surgery in 1986, aneurysm, rales and wearing a nitroglycerin patch caused by angina, which is heart pain resulting from narrowed coronary arteries, he only found asbestos induced thickening of the pleura and pleural plaques. Dr. Jones further testified the other medical problems were caused by Mr. Jackson's smoking history which also might increase his chances for lung cancer. Further, Dr. Jones could not find any evidence of asbestosis in Mr. Jackson.\n\nAs it related to Romain Duronslet, Dr. Jones found diffused disease involving all zones of both lungs, rales and a very abnormal x-ray exam which he could not explain. However, Dr. Jones only diagnosed Mr. Duronslet with lung fibrosis and ventilated lungs, and testified the diffused disease could be the result of idiopathic interstitial pulmonary fibrosis \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e or hard metal disease \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e. Once again, evidence of asbestosis was not found, however, according to Dr. Jones, Mr. Duronslet's smoking history was considered more of a threat of lung cancer than previous asbestos exposure.\n\nFinally, Dr. Jones diagnosed Louis Rodriguez with having medium rales caused by his obesity. Dr. Jones did not find any evidence of pleural plaques or pleural thickening. There was no significant lung abnormalities or evidence of asbestosis.\n\nUpon cross examination, Dr. Jones conceded that he frequently disagrees with many of the known authorities in the area of asbestos-related diseases, because many of the claims of asbestos induced diseases from individuals who are short of breath and who have worked around hazardous substances are either specious or false. Therefore, it appears from the record the jury Judged the weight of each expert's testimony based upon their demeanor and credibility.\n\nAlthough there are two competing viewpoints on the medical conditions and diagnoses as to all plaintiffs in this action as it relates to their alleged asbestos-caused injuries, we note, however, that judgments as to credibility and demeanor of witnesses are specifically reserved for the trier of fact, and such findings will remain unless they are clearly wrong or manifestly erroneous. Schlesinger v. Herzog, 95-1127 (La. App. 4 Cir. 4/3/96), 672 So.2d 701, writ denied, 96-1328 (La. 10/4/96), 679 So.2d 1381; see also Maldonado v. Louisiana Superdome Commission, 95-2490 (La. App. 4 Cir. 1/22/97), 687 So.2d 1087, writ denied, 97-0469 (La. 4/18/97), 692 So.2d 448. Reasonable rejection by the trier of fact of one physician's testimony for the testimony of another physician is permissible. Dehart v. Ferruzzi U.S.A., Inc., 95-0653 (La. App. 4 Cir. 10/12/95), 663 So.2d 466. Expert opinions are persuasive, but not controlling. Merritt v. Karcioglu, 95-1335 (La. App. 4 Cir. 1/19/96), 668 So.2d 469, writ denied, 96-0435 (La. 4/26/96) 672 So.2d 677; see also Jordan v. Ryan, 95-2259 (La. App. 4 Cir. 11/27/96), 684 So.2d 1030, writ denied, 97-0405 (La. 3/27/97) 692 So.2d 397.\n\nThe record does not indicate the jury's adoption of Dr. Rubin's diagnoses of the plaintiffs was unreasonable, exaggerated or the product of misinformation. When reviewing a general damage award, this Court must consider whether the award resulted from an abuse of discretion, otherwise we must yield to the decision of the trier of fact because damage awards are not susceptible of precise measurement. New Orleans Riverwalk Association v. Robert P. Guastella Equities, Inc., 94-2092, 94-2093 (La. App. 4 Cir. 1995), 664 So.2d 151, writ granted, 96-0199 (La. 4/8/96), 671 So.2d 327. Given the amount of experience all plaintiffs had with asbestos-containing products, primarily Kaylo insulation, during the time they were at Avondale, and considering their prior smoking history together with their prior medical conditions, we cannot say that the jury abused its discretion.\n\n\"It is a settled rule of law that a defendant takes his victim as he finds him and is responsible for all natural and probable consequences of his tortious conduct. When the tortfeasor's conduct aggravates a pre-existing condition, the tortfeasor must compensate the victim for the full extent of the aggravation.\" Roig v. Travelers Insurance Co., 96-164 (La. App. 5 Cir. 12/11/96), 694 So.2d 362, 378, writ denied, 97-0721 (La. 5/1/97) 693 So.2d 739.\n\nAlthough plaintiffs' previous medical conditions were not associated with asbestos exposure, the jury was reasonable in considering their previous medical history when making the award because plaintiffs pre-existing injuries, including their smoking history, were aggravated by asbestos exposure and assisted in the development of cancer-producing diseases in plaintiffs' respiratory system. Hence, we will not disturb the general damage awards to the plaintiffs in this matter.\n\nLester Plaisance\n\nAt the time of the trial Plaintiff, Lester Plaisance was 65 years old. He had been employed at Avondale from 1965 until his retirement in 1991. Mr. Plaisance was primarily employed as a boiler maker. As a result, throughout his employment at Avondale, Mr. Plaisance was required to work with products which contained asbestos. Due to the nature of his employment, Mr. Plaisance wore a paper mask while performing certain tasks.\n\nIn the early 1980's Avondale began to medically monitor Mr. Plaisance's health. Chest x-rays and breathing tests were performed periodically until he retired in 1991. After retiring, Mr. Plaisance learned that he might have an asbestos related injury due to his exposure at Avondale. After consulting an attorney, Mr. Plaisance was referred to a physician for further testing.\n\nIn October 1991, suit was filed on Mr. Plaisance's behalf. Mr. Plaisance's trial was set for June 1994. At the Conclusion of Mr. Plaisance's case, OCF and the other Defendants, moved for a directed verdict on the basis that his claim had prescribed. The trial court granted the Defendant's motion and dismissed the claim, giving rise to Mr. Plaisance's appeal. On appeal Mr. Plaisance argues that his claim had not prescribed because he did not know or have reason to know that he was suffering from an asbestos related injury until 1991.\n\nThe trial Judge has wide discretion in determining whether to grant a directed verdict and the standard of review is whether, viewing the evidence submitted, an appellate court could conclude that reasonable persons could not reach a contrary verdict. Lott v. Lebon, 96-1328, 96-1329 (La. App. 4 Cir. 1/15/97), 687 So.2d 612, writ denied, 97-0359 (La. 3/21/97), 691 So.2d 92, 691 So.2d 95; Cross v. Cutter Biological, Div. of Miles Inc., 94-1477 (La. App. 4 Cir. 5/29/96), 676 So.2d 131, writ denied, 96-2220 (La. 1/10/97), 685 So.2d 142. In Lott, this Court held that:\n\n\"A motion for a directed verdict is appropriately granted when, after considering all evidentiary inferences in the light most favorable to the movant's opponent, it is clear that the facts and inferences are so overwhelmingly in favor of the moving party that reasonable men could not arrive at a contrary verdict. However, if the evidence opposed to the motion, i.e., evidence of such quality and weight that reasonable and fair-minded jurors in the exercise of impartial judgment might reach different Conclusions, the motion should be denied, and the case submitted to the jury.\" Lott at 616-17.\n\n\"Delictual actions are subject to a liberative prescription of one year. This prescription commences to run from the day injury or damage is sustained.\" LSA-C.C. art. 3492. Statutes governing prescription are strictly construed against prescription in favor of the obligation sought to be extinguished; therefore of two possible constructions, that which favors maintaining, as opposed to barring, an action should be adopted. Lima v. Schmidt, 595 So.2d 624 (La. 1992). Because of the sometimes harsh consequences which result from the strict interpretation of prescription statutes, our courts have adopted a jurisprudential exception to prescription. Id.\n\n\"The doctrine of contra non valentum agere nulla currit praescriptio (contra non valentum) prevents the running of liberative prescription where the cause of action is not known or reasonably [discernable] by the plaintiff.\" Brumfield v. Avondale Industries, Inc., 95-2260 (La. App. 4 Cir. 5/8/96), 674 So.2d 1159, writ denied, 96-1799 (La. 10/25/96), 681 So.2d 367; citing, In re Medical Review Panel of Howard, 573 So.2d 472 (La. 1991). Essentially, the doctrine of contra non valentum prevents the running of prescription in cases where a plaintiff is ignorant as to the facts upon which his cause of action may be based, as long as such ignorance is not negligent or unreasonable. In re Medical Review Panel of Howard, 573 So.2d at 474; Griffin v. Kinberger, 507 So.2d 821 (La. 1987), Young v. Clement, 367 So.2d 828 (La. 1979).\n\nMr. Plaisance argues that he had no reasonable basis to believe that any health problems he experienced prior to 1991 were attributable to his exposure to asbestos while employed at Avondale. He further argues that prior to the 1991 diagnosis that he was suffering from an asbestos related injury, any apprehensions he had were not sufficient to put him on notice that he had a cause of action. Although Mr. Plaisance's health was monitored by Avondale during the 1980's, he claims that Avondale never informed him of any negative test results. Consequently, Mr. Plaisance contends that it would not have been reasonable for him to believe that he suffered from an asbestos related injury before he consulted an independent physician, not associated with Avondale.\n\nThe Defendants counter Mr. Plaisance's argument with his testimony to questions presented on cross examination. Mr. Plaisance testified that in 1986 he was aware that he suffered from health problems from his exposure to asbestos. During cross examination Mr. Plaisance testified as follows:\n\n\"Q. Now, let me ask you this: As I understand it, sir, your only real complaint is that you had some coughing when you get up in the morning; isn't that correct?\"\n\n\"A. Coughing, and I'm out of breath a lot of time.\"\n\n\"Q. And you've been having that coughing in the morning, that shortness of breath since about 1986; isn't that correct?\"\n\n\"A. Around there.\"\n\n\"Q. And in fact, sir, back in 1986, you believed that your coughing, your shortness of breath was related to your asbestos exposure; isn't that true?\"\n\n\"A. Right.\"\n\n\"Q. And you recall, sir, that back in 1982, at Avondale, you took this training course, the asbestos Training Orientation Respirator Course?\"\n\n\"A. We had a course of it, yes.\"\n\n\"Q. So you knew as early as 1982, did you not, that breathing asbestos dust could be harmful to your health?\"\n\n\"A. Yes, we did.\"\n\nPlaintiff argues that his \"coughing\" and \"shortness of breath\" did not concern him. He suggests that although he believed that the health problems he had in 1986 were related to his asbestos exposure, the problems were so negligible that it was not necessary for him to seek medical treatment until after he retired in 1991. He further argues that even though Avondale monitored his health beginning in the early 1980's, they never informed him of any negative test results; therefore, he had no reasonable basis to heed his apprehensions. We disagree.\n\nAlthough prescription will not begin to run at the earliest indication that a plaintiff may have suffered some wrong; a plaintiff bears the responsibility to reasonably inquire into a possible injury he may have sustained. He is also responsible for seeking out those whom he believes may be responsible. Brumfield, 674 So.2d at 1162; Cole v. Celotex Corp., 620 So.2d 1154 (La. 1993); Jordan v. Employee Transfer Corp., 509 So.2d 420, 423 (La. 1987).\n\nUltimately, when prescription begins to run depends on the reasonableness of a plaintiff's action or inaction. Clearly, prescription begins to run when a plaintiff has actual knowledge of an injury. However, in the absence of a plaintiff's actual knowledge, prescription will begin to run when the plaintiff has constructive knowledge; that is, information sufficient to incite curiosity, excite attention, or put a reasonable person on guard to call for inquiry. Boyd v. B.B.C. Brown Boveri, Inc., 26,889 (La. App. 2 Cir. 5/10/95), 656 So.2d 683, 688; Richardson v. Avondale Shipyards, Inc., 600 So.2d 801 (La. App. 5 Cir. 1992); Harlan v. Roberts, 565 So.2d 482 (La. App. 2 Cir. 1990), writ denied, 567 So.2d 1126 (La. 1990). Therefore, the issue before this Court is when did Mr. Plaisance have actual or constructive knowledge sufficient to commence the running of prescription.\n\nAvondale began to monitor Mr. Plaisance's health in the early 1980's. Mr. Plaisance's testimony indicated that in 1982, he took an Asbestos Training Orientation Respirator Course, at which time he was aware that breathing asbestos dust could be harmful. Mr. Plaisance's testimony further indicated that as early as 1986, he began to experience coughing in the mornings; as well shortness of breath, and he attributed these symptoms to his exposure to asbestos. The Plaintiff admittedly had knowledge of facts which strongly suggested that the coughing and shortness of breath he was experiencing was caused by his exposure to asbestos. However, the record is void of any evidence that would even suggest that Mr. Plaisance reported his coughing and shortness of breath to the Avondale physicians monitoring his health.\n\nAlthough Mr. Plaisance was aware of symptoms related to his exposure to asbestos, he waited some five years to file suit in October, 1991. During this time he not only failed to report his symptoms to the Avondale physicians who were monitoring his health, but he also failed to consult an independent physician. The doctrine of contra non valentum only prevents the running of prescription in cases where a plaintiff's ignorance is not negligent or unreasonable. In re Medical Review Panel of Howard, supra. Clearly, the Plaintiff had constructive knowledge of his injury in 1986, at which time prescription began to run. The inaction on the part of Mr. Plaisance, for more than a year, was clearly negligent and unreasonable. Therefore the ruling of the trial court granting the directed verdict against Mr. Plaisance is affirmed.\n\nVIRILE SHARE\n\nOCF argues that they are entitled to have the monetary damages awarded to the Plaintiffs reduced by the virile share attributable to Avondale, and at the minimum, a credit for contribution against third-party defendant, Flexitallic.\n\nThe trial court granted a directed verdict against OCF on its third-party demand against Flexitallic, and as discussed earlier we affirm that judgment. Therefore, it follows that OCF is not entitled to a credit for contribution against Flexitallic. This argument is without merit.\n\nHowever, before being made a party to the litigation, Avondale negotiated a settlement in both Flight One and Two. Notwithstanding Avondale's settlement, OCF specifically argues that as to Flight One Plaintiffs, Mr. Orgeron, Mr. Constant, and Mr. Washington, it is entitled to claim a virile share reduction for the fault of Avondale. It is well established law that the injury producing events determine the time at which a plaintiff's claim arises, as well as the controlling law to be applied, when it is alleged that earlier exposure resulted in a belated manifestation of damages. Thomas v. Armstrong World Industries, 92-2222 (La. App. 1 Cir. 6/28/96), 676 So.2d 1185, writ denied, 96-1965 (La. 11/1/96), 681 So.2d 1272. OCF argues the comparative fault principles established by LSA-C.C. art. 2323 do not apply, and pre-comparative fault law should apply. We agree.\n\nOCF cites Cole v. Celotex, 91-2531 (La. 5/28/92), 599 So.2d 1058 (La. 1992), as the controlling jurisprudence regarding this issue. In Cole, refinery workers who were injured as a result of long term exposure to asbestos, sought recovery against various manufacturers and executive officers of their employers. Their period of exposure to asbestos was prior to the adoption of the provisions of the Louisiana Comparative Fault Law which was enacted by Act 431 of 1979 and which became effective on August 1, 1980. Section 4 of Act 431 provides that the Act does not apply to claims arising from events occurring before the Act's effective date. Therefore, since the Cole suit was filed in 1987, the Supreme Court was faced with the issue of whether the plaintiffs' claims would be governed by pre-act contributory negligence law, or post-act comparative fault law.\n\nIn resolving this issue the Supreme Court explained the inherent problems which arise from the application of traditional personal injury theories of law to asbestos cases. In traditional personal injury cases the damage results from a single, identifiable act which causes injury. However, in asbestosis cases, the slow development of this hidden disease over the years is a result of continuous exposure. Cole, 599 So.2d at 1065; R.J. Reynolds Tobacco Co. v. Hudson, 314 F.2d 776 (5th Cir. 1963). Asbestosis cases are characterized by a long latency period, which in most instances results in a lengthy temporal separation between the tortious conduct and the appearance of the injury. Cole, 599 So.2d at 1065; See Comment Liability Insurance For Insidious Disease: Who Picks Up The Tab?, 48 Fordham L.Rev. 665 n. 46 (1980). The long latency period makes it virtually impossible to determine the date on which the disease was contracted. Cole, 599 So.2d at 1066; Porter v. American Optical Corp., 641 F.2d 1128, 1133 (5th Cir.), cert. denied, 454 U.S. 1109, 102 S.Ct. 686, 70 L.Ed.2d 650 (1981). Consequently, determining the date on which the plaintiff's cause of action accrued becomes a herculean task. Cole, 599 So.2d at 1066.\n\nThe Supreme Court in Cole held that when significant tortious exposure occurs prior to the effective date of Act 431 and such exposures result in the manifestation of damages after the Act's effective date, pre-act contributory negligence law applies. Cole, 599 So.2d at 1066. In the case at hand the plaintiffs' exposure to asbestos began in the late 1930's and lasted over 50 years. Similar to Cole, it is virtually impossible to determine the dates which the Plaintiffs' cause of action accrued. The latency period of asbestosis in many instances exceeded 30 years in this case. Therefore, as a result of the Plaintiffs' significant, continuous exposure occurring before the effective date of Act 431, we must apply pre-act law.\n\nIn Harvey v. Travelers Insurance Company, 163 So.2d 915, 921 (La. App. 3 Cir. 1964), the court succinctly explained the pre-Act law stating:\n\n\"Where the claimant in a tort action settles with and releases one of two joint tortfeasors, reserving all of his rights against the other, the remaining tort-feasor is thereby deprived of his right to enforce contribution against one who has been released. And, since the claimant by his own act has deprived the unreleased tort-feasor of this right to enforce contributions, he can recover from the latter only one-half of the damages which he sustained.\"\n\nAs this Court noted the virile share rule of law was based on former Civil Code Article 2103, as amended in 1960. That article provided, in part:\n\n\"When two or more debtors are liable in solido, whether the obligation arises from a contract, a quasi contract, an offense, or a quasi offense, it should be divided between them. As between the solidary debtors, each is liable for his virile share only.\"\n\nIn Vedros v. Public Grain Elevator of N.O., Inc., 94-0659 (La. App. 4 Cir. 4/13/95), 654 So.2d 775, writ denied, 95-1205 (La. 6/23/95), 656 So.2d 1024, this Court discussed the application of the virile share principle of pre-comparative fault law. On November 24, 1986, Percy Vedros died as a result of grain asthma. His widow and children filed suit against 10 grain elevators, American Optical, and Sears. Plaintiffs alleged that Vedros had worn a defective respirator manufactured by American Optical and distributed by Sears which contributed to his death. Plaintiffs negotiated a settlement with the 10 grain elevators. After a trial against American Optical and Sears, the jury awarded plaintiffs $75,000. Plaintiffs appealed the trial court's application of pre-comparative fault, virile share principles.\n\nAfter reviewing the trial court's application of pre-comparative fault, virile share principles this court affirmed the jury award on appeal. We found that since plaintiffs settled with 10 grain elevators prior to trial and all parties were found at fault, plaintiffs' recovery against American Optical and Sears was reduced by 10/12ths. Furthermore, this Court explained that pre-comparative fault virile share rules would probably only be applied in cases involving injury brought on by long term exposure to hazardous material which occurred prior to the adoption of comparative fault principles. Vedros, 654 So.2d at 778.\n\nIn the present case, before being made a party to the litigation, Avondale negotiated a settlement in both Flights One and Two, thereby avoiding litigation. In Flight One and Two the trial court applied the virile share principle to the amounts awarded to Plaintiffs. In Flight Two the trial court reduced the Plaintiffs' award by the three virile shares represented by the three Avondale Executives found to be liable. However, in Flight One the court reduced the Plaintiffs' award by a virile share to reflect only the Fibreboard settlement.\n\nIn Cole, this Court applied the virile share principles and considered whether nine executive officers should be counted as one, collectively comprising one virile share. The plaintiffs' petition named 17 executive officers, the jury interrogatories listed 11 executive officers, and the jury found nine of the executive officers to be at fault. The defendant in Cole argued that counting each officer as an individual virile share would allow the plaintiffs to name countless officers, thereby reducing the manufacturer's liability. The Supreme Court rejected the defendant's argument citing the requirement that allegations of fault against each officer must be proven at trial. The Supreme Court held that in tort cases against executive officers, \"each officer found negligent is treated as a separate virile share.\" Cole, 599 So.2d at 1073, 1074.\n\nIn Flight Two the trial court properly reduced the Plaintiffs' award by three virile shares representing the three executive officers found by the jury to be at fault. The Flight One issue presented by OCF regarding Avondale's virile share can be distinguished from Flight Two. The jury interrogatories in Flight Two listed the Avondale executive officers and asked the jury to identify those executive officers at fault. However, in Flight One the jury interrogatories were silent as to Avondale's executive officers. Therefore, the award against OCF in Flight One must be reduced by one virile share representing Avondale's virile share.\n\nDECREE\n\nFor the assigned reasons, we affirm the judgment of the trial court finding Owen Corning Fiberglass' Kaylo insulation and Rock Wool's One Shot cement unreasonably dangerous per se, defective by design, and defective for failure to warn.\n\nWe also affirm the trial court's finding that Kaylo insulation and Rock Wool's One Shot cement were substantial, contributory factors in causing the injuries sustained by Flight One plaintiffs, Horace Bordelon, Jr., Joseph Constant, and Clovis Orgeron. We also affirm the trial court's finding that Kaylo insulation and Rock Wool's One Shot cement were also substantial, contributory factors in causing the injuries sustained by Flight Two plaintiffs, Louis Duplantis, Romain Duronslet, Willie Jackson, Nelson LaBorde, Dean Mefferd, and Louis Rodriguez.\n\nAs to Robert Terrebonne, Thomas Naquin, and Clifton Abadie, the jury's finding that neither of these three plaintiffs were occupationally exposed to a significant amount of asbestos, or sustained an asbestos related injury is hereby affirmed.\n\nWe affirm the jury's general damage awards to Flight One plaintiffs, Horace Bordelon, Jr., Joseph Constant, Clovis Orgeron, and Clifton Washington, and we also affirm the jury's general damage awards to Flight Two plaintiffs, Louis Duplantis, Romain Duronslet, Willie Jackson, Nelson LaBorde, Dean Mefferd, and Louis Rodriguez. Additionally, the trial court's judgment dismissing Lester Plaisance's lawsuit because of prescription is also affirmed.\n\nHowever, we reverse the trial court's judgment against Garlock and A.W. Chesterton, and dismiss all claims against them. The trial court's judgment denying Flexitallic's motion for directed verdict as to Robert Terrebonne and Clifton Abadie is also reverse; and all claims by them against Flexitallic are dismissed.\n\nFinally, we amend the judgment in Flight One to reduce the plaintiffs' award by one virile share (i.e. Avondale's virile share).\n\nREVERSED IN PART; AMENDED IN PART; AND AFFIRMED AS AMENDED.\n\nON APPLICATIONS FOR REHEARING\n\nPlaintiffs' application for rehearing is granted in part and denied in part. The rehearing is granted in favor of all plaintiffs except Romain Duronslet. According to the record, Mr. Duronslet was the only plaintiff to stipulate in the record to a settlement agreement with Avondale and its executive officers prior to trial. Thus, the portion of our opinion relative to virile shares applies only to Romain Duronslet.\n\nFurther, the application for rehearing filed by Owens-Corning Fiberglas Corporation is also granted in part for the purpose of clarifying our original opinion to reflect that the testing conducted at the Saranac Laboratory was requested and sponsored by Owens-Illinois, and not Owens-Corning. The remainder of this defendant's application is denied.\n\n\u003cspan class=\"fn\"\u003e1. Neither Fibreboard nor Pittsburgh are defendants in this appeal, but are named in the original action.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The KAYLO division of Owens-Illinois was sold to OCF in May, 1958, and all of the information in Mr. Hazard's possession was delivered to OCF.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The plaintiffs all testified that the dust from the cutting, tearing and ripping of the Kaylo insulation, asbestos cloth and the mixing of asbestos cement was so heavy that it was difficult to see the light that was on in the bottom of the vessels.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Chesterton's appeal related only to Dean Mefferd and Romain Duronslet. The remaining plaintiff's were dismissed when the trial court granted Chesterton's Motion for Judgment Notwithstanding the Verdict.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Anchor, Inc., is not a manufactuler of asbestos products, but rather buys, repackages and resells asbestos material.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The B readers examination is given to physicians in the field of pulmonary medicine whereby the physician would read between 125 to 140 X-rays, and a score of 50 or more was needed to pass the examination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Radiology reports for Horace Bordelon and Joseph Constant were also received, but the report for Mr. Abadie was the only one which disagreed with Dr. Jones' diagnosis.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Mr. Bordelon had a coronary bypass graft in 1983 for which he took nitroglycerine to control the chest pain. Though Dr. Rubin stated that this condition was not the result of his asbestos exposure, he did indicate that his previous heart condition can greatly contribute to further complications.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Empyema is an infection in the space between the lungs and the lining of the chest wall or the pleura.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. A condition whereby the lungs are scarred, but the treating physicians are not able to find any cause for the fibrosis even after isolating possible causes. In other words it is fibrosis with unknown causes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Disease caused by the cobalt content of tungsten carbide on cutting bits.\u003c/span\u003e\n\n",
    "body_length": 181494,
    "citedas": [
      "726 So.2d 926"
    ],
    "attorneys": "Stephen B. Murray, Joseph A. Race, Murray Law Firm, New Orleans, Louisiana, Timothy W. Porter, Patrick C. Malouf, Wm. Roberts Wilson, Jr., P.a., Jackson, Mississippi, for Plaintiffs-Appellants. Mack E. Barham, Robert E. Arceneaux, Travis L. Bourgeois, Barham \u0026 Arceneaux, New Orleans, Louisiana, for Garlock, Inc. Michael T. Cali, James H. Brown, Jr., John J. Hainkel, III, Greg A. Pellegrini, Frilot, Partridge, Kohnke \u0026 Clements, New Orleans, La, for Owens-Corning Fiberglas Corporation. Robert E. Kerrigan, Jr., A. Wendel Stout, III, Janet L. MacDonell, William C. Harrison, Lisa C. Winter, Janice M. Culotta, Deutsch, Kerrigan \u0026 Stiles, L.l.p., New Orleans, Louisiana, for Flexitallic, Inc. Earle C. Cooley, Christopher J. Cunio, Cooley, Manion, Moore \u0026 Jones, L.l.p., Boston, Massachusetts, Edward B. McDonough, Jr., Edward B. McDonough, Jr., P.C., Mobile, Alabama, William L. Crull, III, Edward J. Castaing, Jr., Edward J. Lilly, Jonathan M. Herman, Crull, Castaing \u0026 Lilly. New Orleans, Louisiana, for A.w. Chesterton Co. Catherine I. Chavarri, Maria I. O'Byrne Stephenson, Aimee Lonergan, Stephenson, Matthews \u0026 Chavarri, L.l.c., New Orleans, Louisiana, for Rock Wool Manufacturing Company.",
    "category": [
      "243"
    ],
    "judges": "Court composed of Judge Robert J. Klees and Judge William H. Byrnes, III and Judge Charles R. Jones.",
    "citation_count": 8
  }
}
