{
  "id": "XYHxPWYBTlTomsSBQ2sZ",
  "document": {
    "title": "Town Sound and Custom Tops",
    "full_title": "TOWN SOUND AND CUSTOM TOPS, INC., SUBURBAN AUTO SOUND \u0026 COMMUNICATIONS, INC., NORTHEAST ELECTRONICS SUPPLY, INC., DOMINION RADIO SUPPLY, INC., ON BEHALF OF THEMSELVES AND ALL OTHERS SIMILARLY SITUATED v. CHRYSLER MOTORS CORPORATION",
    "jurisdiction": "Third Circuit",
    "date": "1992-03-26T00:00:00.000Z",
    "docket": "No. 90-1547",
    "body": "Opinion OF THE COURT\n\nBECKER, Circuit Judge.\n\nUntil the mid-1970s, Chrysler Motors Corporation (\"Chrysler\") and other leading American automobile manufacturers sold car radios as options that were priced separately from the rest of the cars' standard features. By the mid-1980s, however, Chrysler began to include factory-installed sound systems as a standard feature of its models. Today the price of a sound system is included in the base price of virtually all Chryslers, Plymouths, and Dodges (\"Chrysler cars\"). Whereas car buyers could formerly purchase Chrysler cars without sound systems and buy their own systems from independent autosound dealers, now they cannot even receive credit on a car's price for deleting the sound system. The independent autosound dealers have accordingly seen consumer demand for their products and services decline.\n\nAs a result, the plaintiffs, a group of independent autosound dealers, sued Chrysler in the district court for the Eastern District of Pennsylvania, claiming that Chrysler has illegally restrained commerce by conditioning the sale of Chrysler cars on the purchase of Chrysler-supplied autosound systems. Their complaint avers that Chrysler's actions force purchasers of Chrysler cars to accept inferior and overpriced Chrysler-supplied sound systems, resulting in harm to consumers as well as to the independent dealers themselves. Specifically, the plaintiffs claim that Chrysler has tied the sales of Chrysler cars and automobile sound systems for Chrysler cars in violation of section 1 of the Sherman Act, 15 USC § 1 (1988), and section 3 of the Clayton Act, 15 USC § 14 (1988). They seek certification as class representatives and, eventually, treble damages, injunctive relief, costs, and attorneys' fees.\n\nUpon consideration of Chrysler's motion for summary judgment, the district court ruled that because Chrysler lacked market power in both the tying product market (all automobiles sold domestically) and the tied product market (all autosound systems sold domestically), the plaintiffs could not succeed under either \"per se\" or rule of reason theories of antitrust liability. It accordingly denied the plaintiffs' request for class certification and entered a final judgment for Chrysler. On appeal, a panel of this court unanimously affirmed the district court's ruling on the \"per se\" theory but reversed on the rule of reason theory. Chrysler sought and obtained an order granting rehearing in banc, which vacated the panel opinion.\n\nWe agree with the district court that Chrysler possesses insufficient tying market power to violate the Sherman Act on a \"per se\" theory. We also believe that in some cases a tying claim based on the rule of reason may survive summary judgment when the seller lacks power in the tying product market. We nevertheless hold that these plaintiffs' allegations, when combined with indisputable evidence of market structure, are insufficient to withstand Chrysler's motion for summary judgment. Although the plaintiffs have proffered some evidence of harm to themselves and to consumers from the tie-in, they do not offer any theory of how Chrysler caused them an injury cognizable under the antitrust laws, as the Supreme Court's jurisprudence requires. This reasoning applies equally to the plaintiffs' Clayton Act claim. Accordingly, we will affirm the district court's summary judgment for Chrysler in its entirety.\n\nI. FACTS, PROCEDURAL HISTORY, AND THE\n\nPARTIES' THEORIES OF THE CASE\n\nFrom the early days of the automotive industry until the mid-1970s, automobile manufacturers produced and sold virtually all of the sound systems for use in their cars. During that era, each company's car radios were separately priced, add-on options for its new cars. Around the mid-1970s, however, perhaps as a result of the increasing sophistication of stereophonic equipment and of consumer tastes, independent companies began to manufacture, distribute, and sell various autosound products, including AM and FM car radios, cassette decks, and, eventually, compact disc systems. Some of these independently produced sound systems were sold to auto manufacturers which installed them at the factory; others were sold and installed in a vigorous \"aftermarket,\" either directly to the retail public or indirectly through local car dealerships.\n\nThe plaintiffs seek to be representatives of a class of independent (non-Chrysler-franchisee) autosound dealers who have competed since 1984 with Chrysler in the sale of automotive sound equipment for installation into Chrysler cars sold in the United States. All four of the named plaintiffs distribute autosound equipment to and install that equipment for local automobile dealerships; three also sell autosound systems directly to the public. Chrysler is the third largest American manufacturer of automobiles, accounting for between 10 and 12 percent of the total American market for cars between 1983 and 1987 (the market consisting of domestic sales of cars of either foreign or domestic manufacture). Chrysler both manufactures its own autosound equipment and purchases autosound equipment from the independent manufacturers, which also supply the plaintiffs.\n\nThe parties agree on the basic facts about Chrysler's autosound sales practices. Until the mid- to late 1970s, Chrysler customers could purchase cars with or without sound systems. They could easily purchase a Chrysler car with a factory-installed sound system, with a dealer-installed sound system (of either Chrysler or independent manufacture), or with no sound system at all. If they chose a Chrysler car without a sound system, they would not be charged for one and therefore could purchase a different sound system on the retail aftermarket with no financial penalty.\n\nBy 1978, however, Chrysler, along with other auto manufacturers, began to standardize autosound equipment -- that is, it included what had been a separately priced sound system option into the base price of the vehicle. When a feature is standard, no credit for deleting it is permitted. The 1979 settlement of litigation brought by aftermarket autosound dealers against other automobile manufacturers resulted in Chrysler's agreement that it would either make autosound systems entirely optional or offer a \"delete option\" for sound systems on many of its models.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e The delete option, however, by its nature had no effect on those buyers who were unaware of it, or on the sizeable percentage of less patient buyers who preferred to purchase out of dealer inventories rather than to special-order their cars.\n\nChrysler's arrangement with aftermarket representatives expired in 1983, and, starting with the 1984 model year, it steadily began to eliminate the sound system delete option on virtually all of its models and to upgrade the standard sound equipment on many models. According to the plaintiffs, by 1986, 95.9 percent of Chrysler cars were delivered to dealers with factory-installed sound systems, in comparison to 88.5 percent in 1979 (before the agreement with the aftermarket) and 67.2 percent in 1981 (during the agreement). Under Chrysler's revised sound system sales practices, dealers do not receive a credit for sound systems that they remove unless the customer upgrades to another sound system supplied by Chrysler. As a result, although a Chrysler buyer may still remove the factory-installed sound system and purchase a different one on the aftermarket, he or she will then have paid for two sound systems.\n\nIn this suit, filed on January 7, 1988, the plaintiffs challenge Chrysler's autosound sales practices dating from January 1, 1984 as a tie-in arrangement that is illegal under the antitrust laws. They allege, in essence, that automobiles and autosound equipment are separate products, and that by tying the two, Chrysler has insulated itself from competition with respect to autosound systems for its cars, thereby depriving consumers of choice and inhibiting technological innovation. In the plaintiffs' view, Chrysler is foisting inferior and overpriced sound systems on the Chrysler-buying public and seriously threatening the viability of its aftermarket competitors. According to the plaintiffs, because the value of the sound system is so small relative to that of the entire car, many consumers do not consider autosound systems at all. Many car buyers decide on the car first and only consider the sound system later, and therefore may tolerate or be ignorant of Chrysler's inferior product. Moreover, the plaintiffs suggest, buyers who do care about their sound systems are unable to determine how good a deal they are getting because Chrysler's inclusion of the sound system in the base price of the whole car hides the price of the autosound system.\n\nIn legal terms, the plaintiffs' claims rest on section 1 of the Sherman Act, 15 USC § 1, which generally outlaws \"every contract . . . in restraint of [interstate or international] trade or commerce,\" and section 3 of the Clayton Act, 15 USC § 14, which proscribes tying the sale of one good to another \"where the effect . . . may be to substantially lessen competition or tend to create a monopoly . . . .\"\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The plaintiffs contend that Chrysler's sales practices are illegal under both \"per se\" and rule of reason theories of antitrust liability. They seek an injunction, treble damages, costs, and attorneys' fees under sections 4 and 16 of the Clayton Act, 15 USC §§ 15 and 26.\n\nChrysler, for purposes of its July 15, 1988 motion for summary judgment, conceded that it has tied the sale of new Chrysler cars to the purchase of a separate product, Chrysler-installed autosound systems.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Chrysler also conceded, again for purposes of the motion, that this tying arrangement affects a substantial amount of interstate commerce. It sought summary judgment solely on the ground that the plaintiffs could not show harm to competition as a result of its autosound sales practices.\n\nGenerally, Chrysler contends that the plaintiffs did not allege and cannot prove that Chrysler has economic power in a properly defined tying product market. That market, it submits, consists of all new automobiles (in contrast to the plaintiffs' proposed market definition, which includes only new Chrysler cars). Chrysler argues that because it lacks the power to influence prices in the automobile market, it cannot exploit any \"leverage\" arising from that market. Chrysler also contends that it has no power in the tied product market, which it correspondingly defines as all autosound products (as opposed to the the plaintiffs' coordinate one-brand definition consisting only of autosound products for Chrysler cars). Therefore, concludes Chrysler, it is economically incapable of causing any significant economic harm in the autosound market, even by a manner other than leveraging.\n\nIn doctrinal terms, Chrysler contends that for its tying arrangement to be illegal \"per se\" under the Sherman Act, as the plaintiffs allege, the Supreme Court case law requires a showing of tying market power. Because the plaintiffs' submissions do not raise a triable issue on that factual question, says Chrysler, it is entitled to summary judgment on that theory. Chrysler also claims that its lack of tying market power is equally fatal to the plaintiffs' rule of reason theory of liability under the Sherman Act, and that in any event, Chrysler's indisputable lack of market in both the tying (automobile) and tied (autosound) markets entitles it to summary judgment. Finally, Chrysler argues that the standards for liability under the Sherman and Clayton Acts are identical, hence it is entitled to summary judgment on the Clayton Act claim as well.\n\nThe district court agreed with Chrysler and entered summary judgment for Chrysler on all counts. See Town Sound \u0026 Custom Tops, Inc. v. Chrysler Motor Corp., 743 F Supp 353 (E.D. Pa. 1990). It defined the relevant tying product market to include \"all automobile manufacturers which compete with Chrysler for the sale of automobiles in the United States,\" id at 357, and found that Chrysler lacked economic power in that market, id at 358-59. Because Chrysler lacked tying market power, the district court held that the plaintiffs could not sustain a \"per se\" claim of tying liability. Id at 359.\n\nThe district court then addressed the plaintiffs' rule of reason theory. Consistent with its approach to defining the tying product market (that is, rejecting the concept of a Chrysler-only market), the district court defined the tied product market as \"all sound equipment sold in the United States for installation in automobiles.\" Id at 360. It also concluded that Chrysler was in no position to restrain trade in the tied product market as thus defined, and thus was entitled to summary judgment. Id at 361. As an alternative ground supporting summary judgment, the court held that Chrysler's lack of market power in the automobile market disposed of the rule of reason claim as well as the \"per se\" claim. Id at 360-61. Finally, it concluded that the plaintiffs could not succeed on a claim under section 3 of the Clayton Act without proof of tying market power. Id at 361-62. The court also denied the plaintiffs' pending motions for class action certification and for compulsion of certain discovery, including production of cost and profit information on Chrysler's autosound sales.\n\nWe now exercise plenary review of the district court's summary judgment. If we find a genuine issue of material fact such that a reasonable jury could return a verdict for the plaintiffs, then we must reverse and remand for further proceedings. F.R.C.P. 56. See Anderson v. Liberty Lobby, Inc., 477 U.S. 242, 247-52, 106 S. Ct. 2505, 91 L. Ed. 2d 202 (1986).\n\nII. \"PER SE\" LIABILITY\n\nWe first consider the plaintiffs' claim that Chrysler's practices violate the antitrust laws \"per se.\"\n\nA. The Nature of a \"Per Se\" Tying Claim\n\nTying is defined as selling one good (the tying product) on the condition that the buyer also purchase another, separate good (the tied product). See, for example, Bogosian v. Gulf Oil Corp., 561 F.2d 434, 449 (3d Cir 1977). Courts have traditionally expressed great concerns about the possible anticompetitive effects of tying arrangements, at least those in poorly functioning or uncompetitive markets.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Their fear has centered on sellers who have market power in one product market and seem intent on exploiting that power in another market. See, for example, Times-Picayune Publishing Co. v. United States, 345 U.S. 594, 611, 73 S. Ct. 872, 97 L. Ed. 1277 (1953) (\"The essence of illegality in tying agreements is the wielding of monopolistic leverage; a seller exploits his dominant position in one market to expand his empire into the next.\"). Even if a seller has obtained a monopoly in the tying product legitimately (as by obtaining a patent), courts have seen the expansion of that power to other product markets as illegitimate and competition-suppressing. See, for example, United States v. Paramount Pictures, 334 U.S. 131, 156-59, 68 S. Ct. 915, 92 L. Ed. 1260 (1948); International Salt Co. v. United States, 332 U.S. 392, 395-96, 68 S. Ct. 12, 92 L. Ed. 20 (1947).\n\nThe cases thus reveal a concern that a monopolist in the tying product market may use that leverage to garner sales in a second market, thereby foreclosing competitors and monopolizing the formerly competitive tied product market too. At least, the courts fear, the arrangement may raise barriers to entry to the tied product market because new entrants would have to sell both tied and tying products to compete. See, for example, Fortner Enterprises v. United States Steel Corp., 394 U.S. 495, 513, 89 S. Ct. 1252, 22 L. Ed. 2d 495 (1969) (\" Fortner I \") (White Dissenting). Use of a tie-in may enable a producer with monopoly power to force its full line on customers.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Id at 513-14. Finally, another fear has been that the second monopoly could impede innovation in the tied product market by reducing competitive pressure in that market.\n\nTying may also provide a way for a monopolist to hide other activities that are either illegal or disfavored by the law. For example, a monopolist may also use a tie to increase its profits by indirect price discrimination, a practice that the Robinson-Patman Act, 15 USC § 13 (1988), significantly restricts.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Even non-monopolists may seek to evade price or other regulatory controls in the tying product market by hiding the inflated price in the tied product's price. Fortner I, 394 U.S. at 513 (White Dissenting).\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nAlthough past cases have also spoken of the evils of foreclosing consumer choice (for example, Northern Pacific Railway Co v. United States, 356 U.S. 1, 6 78 S. Ct. 514, 2 L. Ed. 2d 545 (1958); Times-Picayune, 345 U.S. at 605, 73 S. Ct. at 878), more recent Supreme Court cases have primarily concerned themselves with that danger when a seller leverages economic power from one market to another. The reason is that if the seller has no control over the tying product market, the customer ordinarily has a realistic option to go elsewhere to buy both the tying and tied products. As Justice Stevens wrote in the majority opinion in Jefferson Parish :\n\nOur cases have concluded that the essential characteristic of an invalid tying arrangement lies in the seller's exploitation of its control over the tying product to force the buyer into the purchase of a tied product that the buyer either did not want at all, or might have preferred to purchase elsewhere on different terms. When such \"forcing\" is present, competition on the merits for the tied item is restrained and the Sherman Act is violated.\n\n466 U.S. at 12. See also Fortner I, 394 U.S. at 512-14 (White Dissenting) (cited approvingly by the Jefferson Parish majority, 466 U.S. at 13 n.19 [Footnote Omitted] ).\n\nIn sum, the Supreme Court's primary concern with tying arrangements has always been the use of tie-ins to abuse power in the tying product market. Accordingly, it has\n\ncondemned tying arrangements when the seller has some special ability -- usually called \"market power\" -- to force a purchaser to do something that he would not do in a competitive market. . . . When the seller's power is just used to maximize its return in the tying product market, where presumably the product enjoys some justifiable advantage over its competitors, the competitive ideal of the Sherman Act is not necessarily compromised. But if that power is used to impair competition on the merits in another market, a potentially inferior product may be insulated from competitive pressures.\n\nJefferson Parish, 466 U.S. at 13-14 (citations omitted). The Court long ago established a so-called \"per se\" rule against tying arrangements in cases where it thought exploitation of leverage is \"probable,\" id at 15.\n\nThe hornbook rule thus provides that where (1) a defendant seller ties two distinct products; (2) the seller possesses market power in the tying product market; and (3) a substantial amount of interstate commerce is affected, then the defendant's tying practices are automatically illegal without further proof of anticompetitive effect. See, for example, Northern Pacific, 356 U.S. at 5; Bogosian, 561 F.2d at 449. For other statements of the \"per se\" rule, see Fortner I, 394 U.S. at 498-99, and the other cases cited in Jefferson Parish, 466 U.S. at 10 n.14 [Footnote Omitted]\n\nThe rule in tying cases is not, however, like other, truly per se rules in antitrust law.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e For example, naked horizontal price fixing is condemned with no inquiry at all into market structure or the activity's actual effect or possible justifications. The rationale for true per se rules is that the challenged conduct has so little chance of being economically beneficial and so great a likelihood of being economically harmful that inquiry into market structure and real world effect is not worth the cost. See, for example, Jefferson Parish, 466 U.S. at 15 n.25 [Footnote Omittted] ; Arizona v. Maricopa County Medical Society, 457 U.S. 332, 350-51, 102 S. Ct. 2466, 73 L. Ed. 2d 48 (1982). The \"per se\" rule against tying goes only halfway, however: the inquiry into tying product market structure (which is frequently costly and time-consuming) is still required, but if the defendant is found to have market power there, the plaintiff is, in theory, relieved of proving actual harm to competition and of rebutting justifications for the tie-in.\n\nBecause the Supreme Court has always recognized that tie-ins in competitive markets are not necessarily dangerous, it has declined to ban all tie-ins. Moreover, although the Court initially adopted the \"per se\" rule in part because it thought that \"tying agreements serve hardly any purpose beyond the suppression of competition,\" see Standard Oil Co. v. United States, 337 U.S. 293, 305, 69 S. Ct. 1051, 93 L. Ed. 1371 (1949), it has not always been so strict in applying the \"per se\" rule in tying cases even where the rule's preconditions are met. See, for example, United States v. Jerrold Electronics Corp., 365 U.S. 567 , 81 S. Ct. 755, 5 L. Ed. 2d 806 (1961) (per curiam), aff'g 187 F Supp 545 (ED. Pa. 1961) (\"per se\" rule not applicable when rule of reason inquiry inexpensive and conduct that was necessary to establish a new industry was clearly reasonable while in effect). The lower courts have recognized, in effect, a host of defenses to \"per se\" tying claims. See generally 9 Phillip E. Areeda, Antitrust Law para. para. 1722-1727 at 285-368 (Little Brown, 1991) (listing exceptions recognized where foreclosure of the tied product market is zero or minimal or the seller had no financial interest in the suppliers of the tied product).\n\nOver time, many commentators and the Antitrust Division of the Justice Department have suggested that even tie-ins in concentrated markets may serve procompetitive purposes, such as quality control, production and sales efficiencies, and facilitation of indirect price competition. In the critics' view, the \"per se\" rule, weak and riddled with exceptions though it may be, is overinclusive.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Four Concurring Justices in Jefferson Parish similarly sought to abandon the \"per se\" approach altogether because it is not truly per se and may condemn too much legitimate conduct. See 466 U.S. at 32-42 (O'Connor Concurring) (favoring rule of reason analysis for all tying arrangements).\n\nNonetheless, a majority of the Supreme Court has been steadfast thus far in its refusal to jettison either the traditional \"per se\" nomenclature or the traditional formulation of the test. See Jefferson Parish, 466 U.S. at 9-11 (majority opinion); id at 32 (Brennan, joined by Marshall, Concurring). Thus, we must apply the traditional \"per se\" rule (with its recent glosses) unless and until the Supreme Court decides to do away with it. We now apply that doctrine to the facts of this case.\n\nB.\n\nThe Structure of the Tying Product Market\n\nBecause Chrysler has conceded the existence of a tie and that a substantial amount of interstate commerce is affected, it contests only one of the three elements of the \"per se\" liability test. To prevail on summary judgment on the \"per se\" claim, Chrysler must show that the plaintiffs raise no triable issue regarding Chrysler's power in the tying product market. The plaintiffs note that the requirement of market power is really shorthand for an inquiry into the ability to force unwanted products on consumers. It follows, they say, that because the ultimate issue of forcing is in dispute, we need not detain ourselves by defining the tying product market and investigating Chrysler's economic power therein. The plaintiffs cite language in Jefferson Parish that seems to define \"market power\" as a \"special ability to force a purchaser to do something that he would not do in a competitive market.\" 466 U.S. at 13-14.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e They then point to a number of affidavits in the summary judgment record that they claim (1) tend to show that some consumers are forced to take unwanted autosound systems, hence (2) raise an inference of tying market power, and therefore (3) raise a triable issue as to the presence of a \"per se\" violation of the Sherman Act. In short, they contend that the district court misapprehended the teachings of Jefferson Parish by insisting upon examining preliminary issues regarding market structure when there was plenty of direct evidence of market power and forcing.\n\nIn our view, the plaintiffs, not the district court, have misread Jefferson Parish. Justice Stevens's majority opinion specifically cautioned against considering market power \"in some abstract sense,\" and in a footnote more precisely defined market power as the seller's ability to sustain prices above levels that would be charged in a competitive market. 466 U.S. at 27 \u0026 n.46 [Footnote Omitted] See also Fortner II, 429 U.S. at 620 (similar definition). The plaintiffs have it backwards: the Supreme Court has told us to look at market power to see whether courts should presume economic harm and rule \"per se\" for plaintiffs. Direct inquiry into forcing or other harm to competition is what the \"per se\" analysis is supposed to obviate, although such an approach is appropriate for a rule of reason claim, as we will discuss in Part III.\n\nTo determine the existence of market power for purposes of the \"per se\" test, then, we must first define the relevant tying product market and inquire into whether Chrysler has power over price in that market.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Chrysler deserves summary judgment if it can establish that, as a matter of indisputable fact, it lacks sufficient power in the tying product market (as properly defined) to create a triable \"per se\" claim.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nThe Supreme Court has given us considerable guidance on what constitutes sufficient tying market power to condemn a tie \"per se.\" As the Court noted in Jefferson Parish, courts have typically found sufficient economic power in the tying market to condemn tying arrangements \"per se\" when: (1) the defendant has a patent or other government-granted monopoly over a product; (2) the defendant's share of the market is so high that it occupies a dominant market position; or (3) the defendant offers a unique product or possesses a market advantage not shared by its competitors. 466 U.S. at 16-17. As the first and the third factors demonstrate, the questions of market definition and market power may blend. If a defendant offers a unique and nonreplicable product, for example, other products may not be adequate substitutes for it, and hence are not part of the same market.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nThe plaintiffs' basic theory is that the relevant tying product market consists only of new Chrysler cars manufactured for sale in the United States.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e If the market were so defined, of course Chrysler would have market power, being the sole seller. But such a narrow definition makes no sense in terms of real world economics, and as a matter of law we cannot adopt it.\n\nThe plaintiffs do not contend, nor seriously could they, that Chrysler's patents on several car components make Chrysler cars a one-brand market or give Chrysler any market power. They do contend, however, that CHRYSLER, PLYMOUTH, and DODGE are popular trademarks, making Chrysler cars unique products with an advantage not shared by would-be competitors, and hence infusing Chrysler with market power. But \"a prestigious trademark is not itself persuasive evidence of economic power\" because a trademark, unlike a patent, protects only the name or symbol and not the product itself. Mozart Co. v. Mercedes-Benz of North America, Inc., 833 F.2d 1342, 1346 (9th Cir 1987). Chrysler cars may be \"unique\" in a broad sense of the term, but \"uniqueness confers economic power only when other competitors are in some way prevented from offering the distinctive product themselves.\" Fortner I, 394 U.S. at 505 n.2 [Footnote Omitted] Despite Chrysler's trademark, GM, Ford, Toyota, Honda, and other auto manufacturers are perfectly capable of producing functionally similar and competitive products. The plaintiffs offer no evidence that Chrysler's marks are so strong that consumers consider Chrysler's products wholly distinct and not competitive with other manufacturers' cars.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nMoreover, the plaintiffs' proposed market definition conflicts with principles of market definition that are well-established in antitrust law. The relevant product market includes Chrysler cars and cars that are reasonably interchangeable with Chrysler cars. See United States v. E.I. du Pont de Nemours \u0026 Co., 351 U.S. 377, 404, 76 S. Ct. 994, 100 L. Ed. 1264 (1956). In technical terms, the market also includes other manufacturers' vehicles that have a significant cross-price elasticity of demand with Chrysler cars. Id at 400. Put more simply, a market also includes actual or potential competitors who may take business away from each other. SmithKline Corp. v. Eli Lilly \u0026 Co., 575 F.2d 1056, 1063 (3d Cir. 1978).\n\nExcept in rare circumstances, courts reject market definitions consisting of one supplier's products where other brands compete. One of the classic cases, in fact, dealt with automobile brands. In Packard Motor Car Co. v. Webster Motor Car Co., 100 App. D.C. 161, 243 F.2d 418 (DC Cir 1957), the court rejected a market definition consisting only of Packard automobiles precisely because other cars were \"reasonably interchangeable by consumers for the same purposes.\" Id at 420 (applying the du Pont test). Proposed Chrysler-only product market definitions have fared no better in the courts. See Kingsport Motors, Inc. v. Chrysler Motors Corp., 644 F.2d 566, 571 (6th Cir 1981); Merit Motors, Inc. v. Chrysler Corp., 417 F Supp 263, 269-70 (DDC 1976), aff'd, 187 App. D.C. 11, 569 F.2d 666 (DC Cir 1977). See also Mogul v. General Motors Corp., 391 F Supp 1305, 1313 (ED. Pa. 1975) (relevant product market could not be limited to Cadillacs), aff'd without published opinion, 527 F.2d 645 (3d Cir. 1976) (table).\n\nMost tellingly, in this case Chrysler has offered unrebutted affidavits confirming what everyone who watches television or goes to an automobile dealership already knows -- that Chrysler cars compete vigorously with many other companies' automobiles. Chrysler's affidavits demonstrate that new car buyers commonly compare Chrysler cars with other cars; that Chrysler's sales depend on its cars' comparative prices and features; that Chrysler's advertising compares the price and features of its autos with other companies'; that the media perceive Chrysler as competing with other brands; and that Chrysler's pricing is constrained by the prices its competitors charge for comparable automobiles. We conclude that the district court was correct to define, as a matter of law, the tying product market to include all new automobiles sold in the United States.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nThe Supreme Court has also suggested that courts consider evidence of market share when determining the existence of tying market power. Jefferson Parish, 466 U.S. at 17, 26-27. Here it is uncontroverted that over the relevant time period, Chrysler-manufactured cars accounted for only 10-12 percent of the automobiles sold in the United States. In Jefferson Parish, the Court held that the defendant hospital's 30 percent market share showed that it lacked the \"kind of dominant market position that obviates the need for further inquiry into actual competitive conditions.\" Id at 27. See also Times-Picayune, 345 U.S. at 612-13 (newspapers' 33-40 percent share of advertising market insufficient to invoke \"per se\" rule). Certainly Chrysler's small share of the domestic automobile market provides unrefuted evidence that it lacks power in the tying product market.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nThe plaintiffs nonetheless contend that the definition of the tying product market and the existence of market power therein are issues of fact that we should not weigh and should leave to the jury to decide. The question of market power is certainly dependent on factual findings, and some older cases did state that summary judgments against plaintiffs are particularly disfavored in complex antitrust cases. See, for example, Fortner I, 394 U.S. at 500 (citing Poller v. CBS, Inc., 368 U.S. 464, 473, 82 S. Ct. 486, 7 L. Ed. 2d 458 (1962)). But many courts, including the Supreme Court, have more recently held defendants entitled to summary judgment in antitrust cases. See, for example, Matsushita Electric Industrial Co. v. Zenith Radio Corp., 475 U.S. 574, 106 S. Ct. 1348, 89 L. Ed. 2d 538 (1986); First National Bank of Arizona v. Cities Service Co., 391 U.S. 253, 289-90, 88 S. Ct. 1575, 20 L. Ed. 2d 569 (1968); Collins v. Associated Pathologists, Ltd., 844 F.2d 473, 475 (7th Cir. 1988). It may be that because antitrust cases are so factually intensive that summary judgment occurs proportionately less frequently there than in other types of litigation, but the standard of F.R.C.P. 56 remains the same.\n\nIn our view, the plaintiffs' submissions do not establish any genuine issue of material fact as to Chrysler's economic power in the automobile market. We therefore conclude that Chrysler has no significant power in the tying product market. Because one of the prerequisites to applying the \"per se\" rule is not present, we will affirm the district court's grant of summary judgment on the \"per se\" claim.\n\nIII. RULE OF REASON LIABILITY\n\nWe next consider the plaintiffs' claims under the rule of reason. At times during this litigation, Chrysler has suggested that the \"per se\" and rule of reason tests have converged -- that a finding of no tying market power during the \"per se\" inquiry automatically dictates dismissal of the rule of reason claims. At other times, Chrysler has suggested that although the quantity or degree of tying market power necessary to sustain a rule of reason claim may be somewhat smaller than for a \"per se\" claim, a significant amount of tying market power remains a prerequisite for a rule of reason claim. We reject both views as inconsistent with the position of the majority in Jefferson Parish. We do insist, however, that to defeat summary judgment on a rule of reason claim, a plaintiff must offer a plausible theory of how the defendant's tie-in is causing injury cognizable by the antitrust laws, for that is what the Supreme Court's jurisprudence requires. It is on this hurdle that these plaintiffs stumble and, as a result, their rule of reason claim must fall.\n\nA. The Nature of a Rule of Reason Tying Claim\n\nAlthough tying claims and the rule of reason have coexisted in antitrust law for eighty years, the case law on tying claims under the rule of reason is amazingly sparse. The Supreme Court has been consistent in holding that rule of reason claims are still available to plaintiffs who do not succeed with their \"per se\" claims. See, for example, Jefferson Parish, 466 U.S. at 17-18; Fortner I, 394 U.S. at 499-500; Times-Picayune, 345 U.S. at 614-15. But because the Court was historically so favorable toward \"per se\" tying claims, plaintiffs have rarely bothered to make rule of reason tying claims, having in mind, no doubt, such claims' attendant additional requirement of proving causation of anticompetitive effects and perhaps the necessity at trial of rebutting defendants' justifications.\n\nFor example, although in Fortner I, 394 U.S. at 500, the Court specifically suggested to the plaintiffs that they could proceed on a rule of reason claim as well as \"per se\" claim, the plaintiffs did not pursue that suggestion. See Fortner II, 429 U.S. at 612 n.1 [Footnote Omitted] See also Image Technical Services, Inc. v. Eastman Kodak Co., 903 F.2d 612, 615 n.1 [Footnote Omitted] (9th Cir. 1990) (rule of reason theory not considered because plaintiff did not raise it until appeal), cert granted, 111 S. Ct. 2823 (1991). Indeed, until Chrysler's petition for rehearing, the briefs in this case paid scant attention to rule of reason issues. Because tying cases brought under the rule of reason may become more frequent now that the Supreme Court has become less expansive in its view of liability under the \"per se\" rule in Fortner II and Jefferson Parish, we will explain in some detail our view of what the threshold requirements for a rule of reason claim are.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\n1.\n\nNo Requirement that the Seller Have Power in the Tying Product Market\n\nChrysler is undoubtedly correct that the tying cases have primarily been concerned with the leveraging of economic power from the market for one product into the market for another, with the resulting forcing of consumers to take unwanted products and foreclosure of competitors from the tied product market. Many Supreme Court cases on tying have intimated that tie-ins deserve special scrutiny only when the defendant has power in the tying product market. See, for example, Northern Pacific Railway Co. v. United States, 356 U.S.1, 6, 78 S. Ct. 514, 2 L. Ed. 2d 545 (where seller has no dominance over the tying product, it has no effectual weapon to pressure buyers, hence restraint of trade is \"insignificant at most\"). The \"per se\" sections of the majority opinion in Jefferson Parish similarly suggest that the primary evil of tying consists of market power extension. See, for example, 466 U.S. at 25 (\"Only if patients are forced to purchase Roux's services as a result of the hospitals' market power would the arrangement have anticompetitive consequences.\"); id at 12 (\"the essential characteristic of an invalid tying arrangement lies in the seller's expoitation of its control over the tying product\"); id at 14 (ties condemned where power used to impair competition in another product market).\n\nIn Chrysler's view, extension of power from tying to tied product markets is the only manner in which a tie-in can cause antitrust injury. Chrysler thus suggests that its indisputable lack of power in the automobile market is proof that it cannot have caused significant economic harm in the tied product market; the plaintiffs' proffer of empirical evidence of economic harm must, according to Chrysler, be disregarded as proof of the impossible. Chrysler thus would have us adopt, in effect, a reverse per se rule in favor of defendants: when an inquiry into the structure of the tying market shows that the defendant has no market power there, we should conclusively presume no adverse effects on the tied product market.\n\nIn essence Chrysler asks us to adopt an expansive reading of Justice O'Connor's Concurring opinion for four Justices in Jefferson Parish. The Concurring Justices wanted to do away with the \"per se\" rule altogether and to adopt a unitary standard, including a tying market power requirement, for all tying claims premised on extension of power from tying to tied product market. 466 U.S. at 37 (O'Connor, joined by Burger, Powell, and Rehnquist, Concurring). According to Justice O'Connor,\n\nsuch extension of market power is unlikely, or poses no threat of economic harm, unless the two markets in question and the nature of the two products tied satisfy three threshold criteria.\n\nFirst, the seller must have power in the tying-product market. Absent such power tying cannot conceivably have any adverse impact in the tied-product market, and can only be procompetitive in the tying-product market.\n\nId (footnotes omitted).\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nJustice O'Connor may not have meant to endorse a market power prerequisite for tying claims based on a theory other than power leveraging.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Moreover, even if she did, the majority of the Court in Jefferson Parish certainly declined to adopt that view. The majority insisted on retaining the distinction between \"per se\" and rule of reason tying claims, and its distinction was more than nominal. Distinguishing \"per se\" claims from rule of reason claims, Justice Stevens wrote:\n\nWhen, however, the seller does not have either the degree or the kind of market power that enables him to force customers to purchase a second, unwanted product in order to obtain the tying product, an antitrust violation can be established only by evidence of an unreasonable restraint on competition in the relevant market.\n\n466 U.S. at 17-18. From that language, we must conclude that the majority, at least, believed that to make out a rule of reason claim, a plaintiff need not make the same showing of tying market power that is necessary as a prerequisite to a \"per se\" claim. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nChrysler contends that even if the same showing is not required for \"per se\" and rule of reason cases, then at least some showing of tying market power is required, but again we must disagree. The just-quoted passage from Jefferson Parish suggests that the majority favored direct inquiry into the effects that the tie-in causes in the tied product market (anesthesiology in that case), rather than any inquiry into the structure of the tying product market (hospital services there). That interpretation is confirmed by Court's actual analysis of the rule of reason claim in Part V of Jefferson Parish, 466 U.S. at 29-31, which contains no hint of a market power requirement for rule of reason claims. Instead, Justice Stevens there stressed that evaluation of the reasonableness of a tying arrangement's restraint on competition \"necessarily involves an inquiry into the actual effect of the exclusive contract on competition among anesthesiologists.\" 466 U.S. at 29. See also id at 30 n.49 [Footnote Omitted] (seeking \"empirical demonstration concerning the effect of the arrangement on price or quality\").\n\nChrysler points to passages from the \"per se\" section of Justice Stevens's opinion that focus on extension of market power and says that the majority implicitly relied in part on the hospital's lack of tying market power in its rule of reason analysis as well. That argument has considerable force. But if the hospital's lack of tying market power was itself conclusive, as Chrysler suggests, surely the Court would have at least mentioned it in the rule of reason Discussion, and it did not.\n\nIn sum, we decline to read Jefferson Parish as approving Chrysler's view that courts deciding a rule of reason claim may ignore proffered evidence of actual conduct and economic performance in the tied product market simply because of a finding on tying product market structure. See also Fortner II, 97 U.S. at 612 n.1 [Footnote Omitted] (implying that U.S. Steel's lack of power in the market for credit, the tying product market, would not necessarily have been fatal to Fortner's rule of reason claim). Instead we read the majority opinion as rejecting Chrysler's proposal for an across-the-board prerequisite of tying market power, just as it rejected the proposal to abandon the \"per se\" rule altogether.\n\nChrysler correctly notes that several other courts of appeals have reached different results, but we find the analyses in those opinions unpersuasive. In dictum in Amey, Inc. v. Gulf Abstract \u0026 Title, Inc., 758 F.2d 1486, 1502-03 (11th Cir. 1985), the court asserted that Jefferson Parish continues to require, even in rule of reason cases, all five of the factors listed in a pre- Jefferson Parish Second Circuit case, Yentsch v. Texaco, Inc., 630 F.2d 46, 56-57 (2d Cir. 1980), one of which factors was \"sufficient market power in the tying product market to force the buyer to accept the tied product.\" Unfortunately, the cited page in Jefferson Parish (104 S. Ct. at 1568) does not support a requirement of all of those factors for rule of reason claims (certainly not one of tying product market power), and in any event the Eleventh Circuit's holding turned on factors that are not at issue here. See 758 F.2d at 1503.\n\nHand v. Central Transport, Inc., 779 F.2d 8, 11 (6th Cir. 1985) (per curiam), did summarily hold that a seller must have tying market power to be guilty of a rule of reason violation, but the decision (which in fact reversed the district court's ruling of no market power) relied on the concurrence in Jefferson Parish, not the majority opinion. We cannot rely on the concurrence when in our view the majority opinion fundamentally conflicts with it. Similarly, Carl Sandburg Village Condominium Association No. 1 v. First Condominium Development Co., 758 F.2d 203, 210 (7th Cir. 1985), relied only on Justice O'Connor's minority Concurring opinion in requiring power in the tying product market. Moreover, the court's opinion turned on the defense that the tying product seller had no economic interest in the sales of the tied product seller, hence was not expanding into the tied product market. Finally, Great Escape, Inc. v. Union City Body Co., 791 F.2d 532, 537-38 (7th Cir. 1986), did not even discuss Jefferson Parish ; it therefore hardly counts as a reasonable interpretation of Jefferson Parish.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nOther cases from courts of appeals may implicitly agree with the interpretation of Jefferson Parish put forth here when they recite that to prove a rule of reason claim, a plaintiff must demonstrate actual anticompetitive effects -- with no mention of how tying market power fits into that analysis. For example, Judge Breyer's scholarly opinion in Grappone, Inc. v. Subaru of New England, Inc., 858 F.2d 792 (1st Cir. 1988), discussed the rule of reason claim solely in terms of whether the anticompetitive effects there outweighed the business justifications. Id at 799-800. That Discussion followed an extended Discussion of the requirement of tying market power in the \"per se\" portion of the opinion, id at 794-98, yet never intimated that tying market power was also a prerequisite to a rule of reason claim. See also F.M. Scherer and David Ross, Industrial Market Structure and Economic Performance 568 (Houghton Mifflin, 3d ed. 1990) (reading Jefferson Parish to say that where seller lacks tying market power, restraint is Judged under rule of reason); Ware v. Trailer Mart, Inc., 623 F.2d 1150, 1153-54 (6th Cir. 1980) (pre- Jefferson Parish opinion citing Fortner I and holding that tying market power is not a prerequisite to a rule of reason claim). At all events, even if Chrysler's position is the sounder as a matter of economics, and even if Chrysler accurately predicts the direction in which the Supreme Court is heading, still-binding precedent forecloses our adopting Chrysler's proposed rule.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\n2.\n\nThe Need to Set Forth a Viable Theory of Causation of Antitrust Injury\n\nIt does not follow, however, that every defendant's motion for summary judgment on a rule of reason claim must be denied. Obviously, if the plaintiff cannot come up with evidence of injury to competition, not simply to the plaintiffs themselves, then summary judgment is appropriate. See Brunswick Corp. v. Pueblo Bowl-O-Mat, 429 U.S. 477, 97 S. Ct. 690, 50 L. Ed. 2d 701 (1977). More generally, a rule of reason plaintiff must allege a plausible theory of causation of \"injury of the type the antitrust laws were designed to prevent.\" Id at 489. See also Cargill, Inc. v. Monfort of Colorado, Inc., 479 U.S. 104, 109-13, 107 S. Ct. 484, 93 L. Ed. 2d 427 (1986) (same standard when injunctive relief sought); Jack Walters \u0026 Sons Corp. v. Morton Building, Inc., 737 F.2d 698, 708-09 (7th Cir. 1984) (\"[the Brunswick rule] is the application to antitrust law of venerable principles of tort causation\").\n\nIn a \"per se\" case, the usual theory of causation of harm is familiar and, under the logic of the \"per se\" rule, need not be proved: the defendant is alleged to have market power and if so is presumed to be using that power to expand its control into another market. Similarly, a plaintiff's rule of reason claim may be based on leveraging of market power. But where a defendant indisputably proves that it lacks sufficient power in the tying product market, a plaintiff's power leveraging claim, whether packaged in \"per se\" or rule of reason terms, falls apart. As Professor Areeda has written:\n\nWith zero power in the market for the tying product, a tie-in cannot be a vehicle for distorting competition in a second market. Any purchaser buying the second product from the defendant does so voluntarily, or at least for reasons other than an unrequited desire for the tying product.\n\n9 Antitrust Law para. 1728d at 371-72. Here we have concluded that Chrysler has no tying market power to exploit -- no possibility of expanding a nonexistent automotive empire into the autosound market.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e If forced sales and other anticompetitive effects are occurring, as the plaintiffs allege, they cannot be due to Chrysler's dominance in the automobile market, but instead to something else. We insist that before going to trial the plaintiffs tell us what else: they must state some plausible theory of antitrust harm that does not depend implicitly on power leveraging. To the extent that res ipsa loquitur (\"the thing speaks for itself\") is a doctrine of the antitrust laws, it is limited to per se cases.\n\nWe cannot list exhaustively the viable non-leverage-based theories that a rule of reason plaintiff may make. We simply hold that a plaintiff may not proceed to trial simply because it presents some evidence that the defendant is engaged in tying and some evidence that some injury is occurring. A plaintiff must link the two showings with a theory of causation that is both plausible and cognizable by the antitrust laws.\n\nB. The Plaintiffs' Theories of Causation\n\nAlthough Chrysler has conceded the existence of a tie, and although the plaintiffs proffer otherwise sufficient evidence of injury to consumers as well as to themselves, we conclude that the plaintiffs allege no triable theory to link the alleged weapon to the alleged injury. From the plaintiffs' submissions, we can discern several theories of harm. We have already rejected the triability of the theories of harm based on leveraging of market power; we now consider (and reject) the others in turn.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\n1. Forced Purchase of Inferior Goods\n\nBy definition, in no free market can buyers be forced to pay more for a package than they think that the package is worth at the time of purchase. In an uncompetitive market, however, buyers may be forced to pay more for the same package than they would have to pay in a competitive market (or, equivalently, to accept lesser quality for the same price). That is the evil of \"forcing\" that has concerned the Supreme Court.\n\nBecause the market for automobiles is competitive, however, no auto manufacturer can profitably sustain supracompetitive prices for its cars -- or for car-plus-sound-system packages. Therefore, a car buyer who actually considers the autosound system will not be forced to take an unwanted package or to pay a supracompetitive price for the package (assuming that the local car dealership market has no dominant seller).\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e See Hovenkamp, Economics and Federal Antitrust Law § 8.3 at 217-18 (forced purchase of unwanted product is equivalent to a price increase, which seller cannot sustain in competitive market without compensating the buyer in another way). No doubt many of these buyers will not find their sound systems ideal even at the time of purchase, but buyers compromise and bargain based on price and the total package of fuel economy, comfort, performance, repair record, styling, autosound system, etc., with the result that the overall price for the package will not be too high. In sum, the competition in the automobile market adequately protects those consumers who consider autosound systems when buying their cars from having to pay too much.\n\nThe plaintiffs' proffers do not seriously challenge this logic. The plaintiffs do offer survey data showing that Chrysler buyers tend to buy from dealers' lots more frequently than Ford or GM buyers, and thus tend to compromise more on their options packages. \"Options clustering\" is the tying of one option to another, and hence is not quite the same thing as standardizing the sound system, but even if we were to equate the two, all that the survey shows is that consumers are forced to compromise. The study does not rebut the point that if consumers do not like the price for the entire package of performance, color, styling, autosound system, etc., then they can easily shop elsewhere for a price and package that pleases them more.\n\nIndeed, a second study from 1986 showed that Chrysler might lose 11.1 percent of its potential customers if it failed to present desirable options packages. The plaintiffs read that study as saying that 88.9 percent of Chrysler customers will accept options (or sound systems) that they find undesirable, but that does not follow, even assuming that the study applies to standardized autosound systems as well as to clusters of options.\n\nThe study divides Chrysler buyers into several groups. Some buyers are special order buyers, who by definition order individual options or a package that they specifically want at the going price. The remainder are stock buyers, a portion classified as \"patient,\" the remainder \"impatient\" and hence more likely to compromise. Some of these customers will wait for an acceptable car from the same dealer or go to another dealer for the same model or a different make; the market thus works to protect them. Other customers will take the car \"as is\" but only if they are offered a price discount on the options package; the market obviously works for them, too. The remainder consists of those who are indifferent to options, so may take the same car regardless of the options package. This group may buy cars with options (or sound systems) that they did not desire beforehand,\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e but they are not truly forced to take an undesired package at an uncompetitive price because they are perfectly free to buy cars (packaged with other options and autosound systems) elsewhere.\n\nNo doubt, some customers would be most happy purchasing every option or feature a' la carte.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e The plaintiffs proffer survey evidence that 13.4 percent of Chrysler buyers would have preferred another brand or type of autosound system than they actually bought, and 20.8 percent would at least have preferred to have the option to take their Chrysler cars without the sound system that came with their cars. The plaintiffs suggest that this is direct evidence of consumer injury through anticompetitive forcing. But these numbers do not show that purchasers of Chrysler cars and autosound systems had to pay supracompetitive prices. Once again, because the automobile market is competitive, a consumer can demand compensation for taking a less desirable sound system in the form of a lower price for the vehicle or for optional features.\n\nThe plaintiffs also cite dealer complaints and exhortations in internal memos to improve autosound quality as evidence that Chrysler sound systems were of poor quality and overpriced. In the same documents, however, there are complaints about batteries, water leaks, windshields, horns, switches, etc. Surely we do not have an antitrust problem every time a manufacturer makes a lemon model; an antitrust issue only arises when the market is incapable of disciplining sellers in the form of lowered demand in the future. In other words, evidence of some consumer dissatisfaction is insufficient to raise a triable claim unless linked to a showing that consumers have little realistic choice to buy comparable goods at a comparable price elsewhere.\n\nHere the plaintiffs show forced compromise, not forced sales. The most probable reason for the dealer complaints and exhortations is that the sound systems (if poor) were hurting Chrysler cars' competitiveness versus other vehicles. Those documents thus show, if anything, that Chrysler was unable to get away with shoddy autosound systems -- that the market was working, not failing. At all events, standing alone the internal Chrysler documents are evidence of consumer dissatisfaction, but not necessarily \"injury of the type the antitrust laws were meant to prevent,\" Brunswick, 429 U.S. at 489, because the competitive automobile market is capable of providing the proper incentives.\n\n2.\n\nConsumer Surprise\n\nThe plaintiffs' other primary theory of causation rests on the premise that many car buyers do not comparison shop for autosound systems at the time of their car purchase, in part because for most purchasers the sound system is unimportant compared to the rest of the car. They therefore may be surprised after purchasing the car to find that the sound system was not as good as they expected.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e In contrast, according to the plaintiffs, if consumers purchased (or at least could purchase) their sound systems separately, they would be more likely to get what they wanted at a fair price. To put it bluntly, Chrysler's tie-in may well take advantage of consumer laziness.\n\nIn most markets, so long as some buyers are knowledgeable and comparison shop, the rest are protected because the market mechanism will ensure one competitive price for all buyers. Absent an ability to price discriminate, even a monopolist must offer a single price that responds to how much the marginal consumer would pay, not the inframarginal or even the average consumer. See, for example, Robert S. Pindyck and Daniel L. Rubinfeld, Microeconomics § 8.3 (Macmillan, 1989). We all free ride in this manner. Even though some buyers of motor oil, for example, are unknowledgeable about that product or are not price conscious, they can rest assured that they will not have to pay any more than the knowledgeable customer in line ahead of them at the automotive supply store, and not much more than the price at other automotive supply stores, because the retail industry is highly competitive.\n\nThis is not so in the retail automobile market, however, where prices are individually negotiated and price discrimination is rampant. The market mechanism protects customers who do respond to the price and quality of sound systems, but it does not protect the other buyers who fail to consider autosound systems and thus might pay too much for the car-plus-autosound package. The record in fact shows that many Chrysler purchasers do not compare autosound systems when shopping for cars. So it is at least conceivable that Chrysler's tie-in takes advantage of a market failure due to inadequate consumer information. The real question is whether that consumer protection problem states an antitrust claim. We hold that it does not.\n\nThe response of the antitrust laws is caveat emptor : if car purchasers do not comparison shop, that is their problem, so long as Chrysler is doing nothing to stop them. To use the terminology of Jefferson Parish, Chrysler is not forcing consumers into taking unwanted goods at inflated prices; it is not foreclosing a choice that would have been made on the merits but for the tie-in. As Justice Stevens wrote for the majority:\n\nTying arrangements need only be condemned if they restrain competition on the merits by forcing purchases that would not otherwise be made. A lack of price or quality competition does not create this type of forcing. If consumers lack price consciousness, that fact will not force them to take an anesthesiologist whose services they do not want--their indifference to price will have no impact on their willingness or ability to go to another hospital where they can utilize the services of the anesthesiologist of their choice. Similarly, if consumers cannot evaluate the quality of anesthesiological services, it follows that they are indifferent between certified anesthesiologists even in the absence of a tying arrangement--such an arrangement cannot be said to have foreclosed a choice that would otherwise have been made \"on the merits.\"\n\n466 U.S. at 27-28. Jefferson Parish thus states a general rule that even if a seller's tie-in exploits consumer indifference, such taking advantage of consumer inability or disinclination to compare goods or services does not create an antitrust claim.\n\nThe above statement was made in the \"per se\" portion of Jefferson Parish, so perhaps it could be read only to say that such facts do not merit \"per se\" condemnation. We doubt that, however, because if taking advantage of consumer indifference could state a rule of reason claim, the Court would have noted that in its rule of reason Discussion, and it did not. The harm from consumer failure to consider autosound does not differ meaningfully from the harm caused by consumer failure to consider the size of cars' trunks. Perhaps legislators may wish to protect consumers from themselves, but that is not the task of the antitrust laws. Once again, this kind of injury, which we concede is real, is not \"injury of the type the antitrust laws were designed to prevent,\" Brunswick, 429 U.S. at 489.\n\n3. Difficulty in Making Price Comparisons\n\nThe plaintiffs' theory of harm that troubles us most is one that they have pressed only weakly since filing their complaint: according to them, Chrysler's tie-in makes it impossible for nonlazy consumers who want to comparison shop for autosound systems to know the sub-price for the sound equipment apart from the rest of the vehicle. When cataloguing the potential harms from tying arrangements in the \"per se\" section of Jefferson Parish, Justice Stevens did suggest that the consumer's \"freedom to select the best bargain in the second market is . . . perhaps [impaired] by an inability to evaluate the true cost of either product when they are available only as a package.\" 466 U.S. at 15. In a footnote, he continued: \"Especially where market imperfections exist, purchasers may not be fully sensitive to the price or quality implications of a tying arrangement, and hence it may impede competition on the merits.\" Id at 15 n.24 [Footnote Omitted] , citing Richard Craswell, Tying Requirements in Competitive Markets: The Consumer Protection Issues, 62 B.U. L. Rev. 661, 675-79 (1982).\n\nBut the Court did not have to decide whether a tying arrangement's inducement of such information-related market failures can by itself give rise to antitrust liability. In Jefferson Parish the plaintiffs offered no \"empirical demonstration concerning the effect of the arrangement on price or quality\" of anesthesiological services. Id at 30 n.49 [Footnote Omitted]\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e Here, in contrast, the plaintiffs proffer some evidence of price and quality problems with Chrysler autosound systems. Nonetheless, we hold that antitrust liability does not attach simply because a seller who engages in tying in a competitive market fails to inform consumers of the implicit subprices for each of the two items that it ties.\n\nBecause Justice Stevens cited Professor Craswell's insightful article on the economic effects of tying arrangements in competitive markets, we naturally turn to it for guidance. In particular, Justice Stevens cited Professor Craswell's Discussion of the problem of \"lemons equilibria,\" 62 B.U. L. Rev. at 675-79.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Actually, Professor Craswell's (and therefore arguably Justice Stevens's) point was not that tie-ins make it difficult to compare prices of competing goods, which is the plaintiffs' theory. Instead, Professor Craswell noted, \"the number and nature of tying requirements that a seller insists on can be viewed as a dimension of the quality of that seller's offer,\" id. at 678 (emphasis added), and although \"competition over price still may keep any seller from earning monopolistic profits, . . . there will be no similar competition to eliminate the tying requirements themselves,\" id. The result may be one type of lemons equilibrium: \"all sellers [will] offer an excessive number of costly tying requirements.\" Id.\n\nThe plaintiffs do not raise Professor Craswell's theory, and even he considered it speculative, see id. at 678-79, so we could end there. But we will address the issue of consumers' inability to evaluate the true cost of the car and the sound system apart from the package because Justice Stevens (and the majority of the Court in Jefferson Parish) may have harbored concerns beyond those of Professor Craswell.\n\nAs far as we can tell, consumers know what they need to know to evaluate how good a deal they are getting for what they are buying.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e Surely car buyers know from the sticker price or the salesperson exactly what price they have to pay for what Chrysler car -- for the package, including vehicle body, options, and autosound system. And surely they know or could easily find out how much GM, Nissan, Volkswagen, and others are charging for their competitive packages. The packages are comparable, and, indeed, the record indisputably shows that buyers do compare those packages.\n\nThus we do not have the more typical lemons equilibrium problem of inability to make price comparisons. That concern typically arises in markets where price advertising has been banned, as was traditionally the case in legal, medical, optical, and pharmaceutical markets until those bans were struck down. See Craswell, 62 BU L Rev. at 676-77. A patient may have known how much his or her doctor would charge for a particular procedure but found it nearly impossible to find out what other doctors would charge; hence price competition was inadequate. As the barrage of television and newspaper advertisements for cars attests, automobile purchasers face no serious hurdles in comparing the price -- or, for that matter, most aspects of the quality -- of Chrysler car packages to those Chrysler's competitors.\n\nWe do not see why the buyer should care whether the underlying prices for a $10,000 car package are $500 for the sound system and $9,500 for the rest of the car, or $1,000 for the sound system and $9,000 for the rest of the car. For antitrust purposes, it makes no difference. If Chrysler's current practice is simply to sell cheap cars and expensive sound systems, that is not an antitrust violation. See Fortner II, 429 U.S. at 621-22 (using cheap financing to sell expensive houses may be an unusual credit bargain, but not an antitrust violation).\n\nThe plaintiffs evidently believe that if Chrysler's current implicit prices for base vehicle and sound system were $9,000 and $1,000 respectively, and the free market price for the sound system was $500, then, if the tie-in were outlawed, consumers would react by purchasing a sound system on the aftermarket for $500, a car without sound system for $9,000, and end up paying only $9,500 for a car-plus-sound-system package. But the flaw in that logic is that the price for the rest of the car would not be $9,000. Because the automobile market is competitive, Chrysler is not now achieving supranormal profits overall, although Chrysler might be losing money on the base price of the vehicle and making money on the autosound systems. But if so and the tie-in were banned, Chrysler would no longer be able to cross-subsidize. In order to recover its costs (including the cost of capital), Chrysler would have to raise the base price of the vehicle to $9,500 and consumers would be no better off than before.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nAll the same, banning Chrysler's tying arrangement would surely compel Chrysler to disclose information to consumers that consumers do not now have, so let us assume that potential Chrysler buyers would find some utility in knowing the itemized price for Chrysler-installed sound systems. It still would not follow that Chrysler's tying practices have caused antitrust injury.\n\nThe antitrust laws were designed to deal with markets that are actually or potentially uncompetitive (in the sense of having higher prices and lower quantities produced than in a competitive market). But the market for automobiles (and automobile-plus-sound-system packages) is competitive. The problem that the plaintiffs appear to allege is one of market failure due to imperfect information, which has not been a traditional concern of the antitrust laws. The language of the antitrust laws is probably broad enough to encompass such issues,\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e but for us to hold that the antitrust laws cover such ordinary consumer protection issues would require us to endorse a potentially massive expansion of the scope of the antitrust laws in an era when the Supreme Court has greatly cut back on the scope of antitrust liability. That we decline to do absent a much clearer mandate from the Court.\n\nMoreover, strong institutional considerations counsel against turning the antitrust laws into wide-ranging consumer protection laws. As Professor Craswell himself noted in the article that the Jefferson Parish majority repeatedly cited, the appropriate remedy for an information problem is frequently to force disclosure of information, not to prohibit the tie-in or award damages to competitors. See 62 B.U. L. Rev. at 687-96. According to Professor Craswell,\n\nthe antitrust courts clearly are not the ideal institution for addressing the consumer protection issues identified in this Article. Antitrust courts have developed a large body of doctrine over the years to help assess a firm's market power, or to analyze the effects of various types of behavior on competition or on competitors, but they have not developed similar doctrines to help address consumer protection issues. Considerations of consumer information, unfair surprise, or the optimal allocation of risks between buyers and sellers are entirely foreign to antitrust law. The same is true of the remedial issues--antitrust courts have never had to wrestle with the difficulties involved in designing an efficient disclosure remedy. Indeed, many of the remedies discussed here could not be imposed by a court entertaining a private antitrust suit against only one or two defendants.\n\nId. at 697.\n\nWe agree. We recognize that economic problems resulting from market failures can be severe, and we do not deprecate problems of imperfect information by calling them consumer protection problems. But such problems are likely to be unique to particular industries, and they are best dealt with by a legislative or administrative body. Such a body would be far more capable than an antitrust jury of balancing the costs of information loss against the competitive benefits of a tying arrangement in a competitive market. And even though Judges may fashion injunctive remedies under section 16 of the Clayton Act, the remedies sought by competitors (who are usually the plaintiffs) may not be those best for consumers. An agency or a legislative body aided by specialized studies would also have better wherewithal to design an appropriate remedy.\n\nIn short, we doubt that Chrysler's tying practices are causing a significant information problem here, but even if they are, the antitrust laws are not the solution and do not provide a cause of action.\n\n4. Foreclosure of the Tied Product Market\n\nThe plaintiffs also suggest that Chrysler is foreclosing a substantial portion of the tied product market. As a general proposition, we agree that even if a defendant lacks power in the tying product market, it could conceivably achieve a substantial foreclosure of the tied product market, just as it might by using a requirements contract involving just one product. That might be the case where the seller of a machine requires that the buyer agree to purchase all its future requirements for a complementary input. In such a case, the concern is not so much with the tie between the two products, but with the tying up of sales in the tied product market, which is the issue in exclusive dealings cases, which are evaluated under the rule of reason anyway. See 9 Areeda, Antitrust Law para. 1728d at 372.\n\nThat theory makes no sense on the facts of this case, however. Because the theory is one of market foreclosure, we must examine the structure of the market supposedly foreclosed.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e In this case, the plaintiffs define the tied product market as autosound products for new Chrysler cars and contend that Chrysler has foreclosed competitors from virtually all of that market. But, as we explained at page in Part II.C that manner of market definition is improper. The tied product market also includes all sound systems with which Chrysler-installed sound systems compete.\n\nCertainly the manufacturers of autosound systems for the aftermarket compete with Chrysler, for if they did not, these plaintiffs could not have claimed to suffer any injury. Moreover, the sound systems installed by other automobile manufacturers compete with Chrysler via the competitive market for automobiles. If Ford, for example, offered a free top-of-the-line sound system with every subcompact car it sold, surely that sales pitch would affect the demand for Chrysler cars and hence Chrysler-installed autosound systems.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Chrysler certainly views itself as being in competition with Ford- and GM-manufactured autosound systems (presumably Sony, Blaupunkt, and other independent autosound manufacturers do as well). Indeed, the plaintiffs' own submissions show that Chrysler dealers have been concerned over the competitiveness of certain Chrysler-installed sound systems against the sound systems available on other cars. If Chrysler-installed sound systems did not compete with GM's, Ford's, Toyota's, etc., the dealers would not have complained. That Chrysler now buys some autosound systems from other manufacturers rather than producing all its own (as it used to) may also indicate that Chrysler is not insulated from competition in the autosound market.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nThe plaintiffs do proffer an affidavit from their expert, Professor Adams, in support of their definition of the tied product market. Professor Adams's affidavit offers his opinion that \"the relevant market properly examined in this case is the market for autosound equipment for installation in new Chrysler vehicles, and . . . Chrysler possesses market power in that market.\" As grounds for his opinion, he cited the consumer surveys and statements by Chrysler dealers that we mentioned above. We do not think that Professor Adams's affidavit raises questions different from the market failure questions discussed in the previous two subsections. His affidavit does not controvert the fact that sound systems installed in non-Chrysler cars are actual or potential competitors of sound systems in Chrysler cars. A small fraction of consumers may have their hearts set on Chrysler cars, and some others may not care about autosound systems when they buy their cars. But for those who do consider autosound systems (the consumers about whose interests the antitrust laws are concerned) all manufacturers' sound systems compete and are therefore in the same market.\n\nWe therefore believe that the district court properly defined the tied product market to include all autosound systems sold in the United States.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e Chrysler controls well under ten percent of the tied product market as thus defined. Even if Chrysler were to install sound systems on every car it sells, we see no reasonable possibility that Chrysler could establish a dominant position over the autosound market when Chrysler cars comprise only a tenth of the American automobile market.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Therefore, to the extent that the plaintiffs' rule of reason claim rests on a theory of foreclosure of the tied product market, it does not raise a triable issue of fact.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nC. Summary\n\nTo survive summary judgment on their rule of reason claim under the Sherman Act, the plaintiffs do not have to show that Chrysler has economic power in the automobile market, at least as the law now stands. But they do have to show injury, not simply to themselves but of the type that the antitrust laws were designed to prevent. Brunswick, 429 U.S. at 489. Antitrust injury means injury to competition. Id at 488. Here the plaintiffs offer no evidence that Chrysler has impeded the market mechanism from punishing it if it tries to sell inferior and overpriced autosound systems. The competitive automobile market protects consumers from having to pay too much for autosound systems just as much as it prevents consumers from having to pay too much for tires and other standard equipment on cars. No doubt the plaintiffs' businesses have suffered, but that is not by itself an antitrust problem. If competition in the autosound market is suffering, that is only because some consumers are choosing not to exercise their right to compare competing products, and protecting consumers from themselves is not the goal of the antitrust laws. Because the plaintiffs allege no plausible theory of antitrust injury, we will affirm the district court's grant of summary judgment on the rule of reason claim.\n\nIV. LIABILITY UNDER SECTION 3 OF THE CLAYTON ACT\n\nFinally, the plaintiffs submit that even if they have no claim under the Sherman Act, then at least they have a claim under section 3 of the Clayton Act, which, they say, proscribes more conduct than the Sherman Act. In support, the plaintiffs cite dictum in Times-Picayune Publishing Co. v. United States, 345 U.S. 594, 73 S. Ct. 872, 97 L. Ed. 1277 (1953), where the majority opinion stated:\n\nWhen the seller enjoys a monopolistic position in the market for the \"tying\" product, or if a substantial volume of commerce in the \"tied\" product is restrained, a tying arrangement violates the narrower standards expressed in § 3 of the Clayton Act because from either factor the potential lessening of competition is inferred. And because for even a lawful monopolist it is \"unreasonable, per se, to foreclose competitors from any substantial market\", a tying arrangement is banned by § 1 of the Sherman Act whenever both conditions are met.\n\n345 U.S. at 608-09 (emphasis in the original). \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e Actually, the plaintiffs only cite this language in support of their belief that antitrust liability for a tie-in can exist absent power in the tying product market, a position with which we have already agreed. But the quoted language does suggest that the Clayton Act generally has a weaker standard for liability, so we will address that more general issue. We hold that even if the standards of liability under the two acts have not coalesced since 1953,\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e the plaintiffs do not raise a triable Clayton Act claim.\n\nThese plaintiffs have no Clayton Act claim because the effect of Chrysler's actions is not and will not be \"to substantially lessen competition or tend to create a monopoly\" in the autosound market, as section 3 of the Clayton Act requires.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e At best, the statutory language suggests that the Clayton Act may reach conduct that will eventually become illegal under the Sherman Act at an earlier stage -- in its incipiency. For the same reasons discussed in our evaluation of the plaintiffs' Sherman Act claims, however, Chrysler's practice of making autosound systems standard equipment on its cars is not now causing, and is not likely in the future to cause, injury of the sort that the antitrust laws were intended to prevent. Chrysler therefore is entitled to summary judgment that it has not violated section 3 of the Clayton Act.\n\nV. CONCLUSION\n\nBecause Chrysler lacks market power in the tying product market (the market for automobiles sold in the United States), the plaintiffs cannot succeed on their \"per se\" claim, or on a rule of reason claim based on leveraging of market power. Because the plaintiffs do not offer any other plausible and cognizable theory of causation of antitrust injury, the plaintiffs raise no other triable rule of reason claim. Because the plaintiffs offer no better evidence of incipient antitrust injury than of current antitrust injury, their Clayton Act claim must fail as well. Accordingly, the summary judgment of the district court will be affirmed.\n\nSLOVITER, Chief Judge, Concurring and Dissenting, with whom Judge Mansmann joins.\n\nI.\n\nTying As A Per Se Violation\n\nThe majority's clear explication of tying doctrine is persuasive insofar as it covers per se antitrust liability. I agree with its view, which is consistent with that of the original panel, that plaintiffs failed to produce sufficient evidence to withstand summary judgment on the per se theory of liability.\n\nThe dual anticompetitive effects from tying which the Supreme Court has recognized, i.e., the harm that such arrangements may cause competitors of the seller of the tied product, see Jefferson Parish Hosp. Dist. No. 2 v. Hyde, 466 U.S. 2, 13, 80 L. Ed. 2d 2, 104 S. Ct. 1551 n.19 (1984), and the injury to consumers of the tied product, see, e.g., id. at 15, cannot be presumed in this case because plaintiffs have failed to make any showing that Chrysler held market power in the tying product. Although plaintiffs are correct that the scope of the relevant market may be a question of fact for jury resolution, see Weiss v. York Hosp., 745 F.2d 786, 825 (3d Cir. 1984), cert. denied, 470 U.S. 1060, 105 S. Ct. 1777, 84 L. Ed. 2d 836 (1985); Columbia Metal Culvert Co. v. Kaiser Aluminum \u0026 Chem. Corp., 579 F.2d 20, 28 (3d Cir.), cert. denied, 439 U.S. 876, 58 L. Ed. 2d 190, 99 S. Ct. 214 (1978), in this case they have failed to create a material factual dispute to support their contention that a properly defined market includes only Chrysler automobiles. The affidavits submitted by Chrysler as well as reports of Chrysler dealer meetings evidencing that the Chrysler dealers perceive themselves as competing with dealers handling other cars with respect to price, features, quality, comfort, warranties, financing and other terms, were not effectively rebutted.\n\nThe position of the majority is amply supported by the available precedent. See Kingsport Motors, Inc. v. Chrysler Motors Corp., 644 F.2d 566, 571 (6th Cir. 1981) (relevant market consists of sum total of medium-priced automobiles manufactured by Chrysler and all other automobile manufacturers and sold in the United States); Merit Motors, Inc. v. Chrysler Corp., 417 F. Supp. 263, 269 (D.D.C. 1976) (\"Automobiles are more or less interchangeable items, and the price of one brand affects the demand for other brands. Hence, it is clear that the relevant market . . . cannot be limited to the sale of one brand of automobile, but must include the fleet market for all brands of automobiles.\" (citation and footnote omitted)), aff'd, 187 App. D.C. 11, 569 F.2d 666 (D.C. Cir. 1977); see also R.D. Imports Ryno Indus. v. Mazda Distribs. (Gulf), Inc., 807 F.2d 1222, 1225 n.2 (5th Cir.) (market not limited to Mazdas because \"Mazda vehicles had a variety of domestic and foreign substitutes\"), cert. denied, 484 U.S. 818, 108 S. Ct. 75, 98 L. Ed. 2d 38 (1987); Packard Motor Car Co. v. Webster Motor Car Co., 100 App. D.C. 161, 243 F.2d 418, 420 (D.C. Cir.) (other cars are \"'reasonably interchangeable by consumers for the same purposes' as Packard cars\" and are therefore in competition with Packard cars), cert. denied, 355 U.S. 822, 2 L. Ed. 2d 38, 78 S. Ct. 29 (1957); Mogul v. General Motors Corp., 391 F. Supp. 1305, 1313 (E.D. Pa. 1975) (market not limited to Cadillacs), aff'd mem., 527 F.2d 645 (3d Cir. 1976). I thus agree with the majority that the district court properly rejected the plaintiffs' per se theory.\n\nII.\n\nRule of Reason Inquiry\n\nI also agree with the majority's rejection of Chrysler's contention that the absence of market dominance in the tying market precludes any rule of reason inquiry, and see no need to repeat the authorities upon which it relies for that proposition. Regrettably, my agreement with the majority stops at that point.\n\nInitially, I note that the majority's holding necessarily undercuts the basis for the district court's grant of summary judgment on plaintiffs' rule of reason claim. The district court had interpreted Jefferson Parish to require a plaintiff to prove that the defendant has market power in both the tying and tied product markets. It followed for the district court that because it found that Chrysler had a ten to twelve percent share of all automobiles sold in the United States and a three to seven percent share of the market for automotive sound equipment sold in the United States for installation in automobiles, plaintiffs' rule of reason claim failed and the court saw no need to look at the effect of Chrysler's tying practices.\n\nThe majority concedes that the district court's legal premise is erroneous. As the majority implicitly recognizes, under the district court's approach where both tests have identical market power requirements, the rule of reason analysis would be collapsed into the per se test. Although the four Concurring Justices in Jefferson Parish advocated only a single analysis in tying cases, even they did not suggest accomplishing that by abrogating the rule of reason analysis; rather they sought to abolish the per se test. See Jefferson Parish, 466 U.S. at 35 (O'Connor, J., Concurring).\n\nUnder ordinary circumstances, when we hold that the\n\ndistrict court granted summary judgment based on an erroneous view of the law, we remand for further proceedings unless the result reached by the district court can be otherwise sustained as a matter of law. Presumably acting under this exception, the majority upholds the summary judgment in this case, but the reasons on which it does so were neither the focus of Chrysler's motion for summary judgment nor were they even considered by the district court. Although Chrysler's summary judgment submissions contained some allusions to the material seized upon by the majority, these peripheral references hardly supplant the need to give plaintiffs an opportunity to respond to the issue of\n\ncausation of antitrust injury which is the basis of the majority's holding. See 10A Charles A. Wright et al., Federal Practice and Procedure § 2725 (1983) (\"the court normally should give the parties notice when it intends to rely on a legal doctrine or precedents other than those briefed and argued by the litigants\").\n\nIt is simply unfair for the majority to chastise plaintiffs for failing to file a motion under Rule 56(f) if they believed that they had not had \"ample discovery to determine precisely how Chrysler's challenged practices are hurting them,\" Majority Typescript Op. at 42 n.25 (emphasis added), when the only basis urged in Chrysler's summary judgment motion was that \"Chrysler indisputably lacks the economic power in any relevant market needed to establish a tying violation.\" App. at 415. Chrysler did not claim lack of antitrust injury, at least at this stage, and the briefs on appeal are not directed to that issue. Thus, even if I did not disagree with the majority in the almost insurmountable obstacles it imposes on antitrust plaintiffs in tying cases, I would disagree with the procedure it follows in this case.\n\nMy principal disagreement with the majority is more fundamental and goes to the essence of a rule of reason inquiry. It has long been understood that the rule of reason focuses directly on the challenged restraint's impact on competitive conditions and requires the court to examine the purpose\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and effects of an allegedly anticompetitive practice to determine whether the general standards of the antitrust laws have been violated. See Fortner Enters. v. United States Steel Corp., 394 U.S. 495, 500, 89 S. Ct. 1252, 22 L. Ed. 2d 495 (1969) [hereinafter Fortner I ].\n\nIn the absence of any proffer by the plaintiffs as to the causation of antitrust injury issue that the majority finds dispositive, the majority is thus left to attempt to \"discern\" several theories of harm that it believes plaintiffs would proffer. I am unpersuaded by the majority's purported demolition of each of them.\n\nIt is plaintiffs' principal theory that Chrysler's tie of autosound equipment to its automobiles was in fact causing the destruction of the autosound aftermarket, which plaintiffs contend has been the source of technological innovation. Plaintiffs thus posit both injury to and the potential destruction of the class of independent autosound equipment dealers, including themselves, as well as injury at the consumer level.\n\nThe majority gives little attention to the possibility of anticompetitive effect through injury to or elimination of a class of independent autosound dealers. Accepting the majority's position that the tied product market includes all autosound systems sold in the United States, Chrysler's tie forecloses from the independents 10% of the market for autosound equipment installed in new cars. This amount itself could have anticompetitive effects. But the effect of the practice is even greater. Because Chrysler has admitted that Ford and GM are undertaking similar tying arrangements, the majority is obliged to concede that at least 50% of the market for autosound equipment in new cars may be foreclosed. See Majority Typescript Op. at 61-62 n.40.\n\nIn fact, Chrysler probably understated the share of the market represented by the American automakers. According to industry statistics, the Big Three American auto manufacturers accounted for almost two-thirds of domestic car sales in 1990. Ward's Automotive Yearbook 208 (1991). In 1984, the first year of the tying practice at issue, the Big Three accounted for just under three-quarters of all domestic car sales. See id. (appearing in App. at 124). If this tying practice were adopted industry-wide,\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e it would have the potential to foreclose almost entirely the aftermarket for autosound systems because the demand for the tied product (autosound systems) is derivative of that for the tying product (automobiles).\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe anticompetive effect of such rippling practices is evident. As Areeda has observed:\n\nThough it individually forecloses only a modest portion of the tied market, a particular seller's tie-in might be one of several. The cumulative impact of these several ties could then be substantial, and it is that cumulative impact that [indicates] whether tie-ins can create or reinforce concentration in the tied market, create a barrier to entry, or facilitate tacit coordination in the tied market.\n\n9 Phillip E. Areeda, Antitrust Law para. 1709d2, at 103-04 (1991).\n\nI find disturbing the majority's remarkable statement that even if all automobile manufacturers tied autosound equipment to the car and, as a result, \"a certain class of competitors (namely the autosound aftermarket dealers) might be doomed to competitive oblivion . . . that would be no concern of the antitrust laws unless consumers were also hurt because of diminished competition.\" Majority Typescript Op. at 62 n.40. In contrast to the majority, I believe that if the \"doom\" of independent dealers is precipitated by a practice prohibited by the antitrust laws, then the effect is injury cognizable under those laws.\n\nI believe that underlying the majority's position is a serious misinterpretation of the Supreme Court's statement that \"the antitrust laws . . . were enacted for 'the protection of competition, not competitors.'\" See Brunswick Corp. v. Pueblo Bowl-O-Mat, Inc., 429 U.S. 477, 488, 50 L. Ed. 2d 701, 97 S. Ct. 690 (1977). In Brunswick, three small bowling centers claimed that the nation's largest operator of bowling centers violated section 7 of the Clayton Act by acquiring several failing bowling centers that competed with plaintiffs. The Court held that the jury verdict for plaintiffs could not be sustained because the damage theory posited by the plaintiffs, i.e., that plaintiffs were injured because the mergers preserved their bowling alley competitors who would have closed but for the mergers, was not \"injury of the type the antitrust laws were intended to prevent.\" Id. at 489. Thus, it was in a case where the challenged conduct led to the continued existence of competitors, not their potential destruction, that the Court made the now famous statement that \"the antitrust laws . . . were enacted for 'the protection of competition, not competitors.'\" Id. at 488. I see nothing in Brunswick that suggests that a tying arrangement that makes it difficult, if not impossible, for a class of independent competitors to compete does not cause antitrust injury.\n\nThe other Supreme Court case cited by the majority in this connection, Cargill, Inc. v. Monfort of Colorado, Inc., 479 U.S. 104, 93 L. Ed. 2d 427, 107 S. Ct. 484 (1986), also does not support the majority's construction of antitrust injury. In Cargill, the Court held that an integrated beef packing company could not enjoin the merger of two large packers because the plaintiff's loss of profits from the need to lower its prices to remain competitive was not antitrust injury. As the Court explained, just as the losses in Brunswick from continued competition did not constitute antitrust injury, neither did losses from increased competition. Id. at 116. Thus, the loss of an individual competitor might not be cognizable injury to competition when it results from fair competition.\n\nHowever, the Cargill Court certainly did not imply that injury to competitors from predatory practices would not be cognizable. See Klor's, Inc. v. Broadway-Hale Stores, Inc., 359 U.S. 207, 213, 3 L. Ed. 2d 741, 79 S. Ct. 705 (1958). In fact, the Cargill Court's rejection of an invitation to deny competitors standing to challenge acquisitions demonstrated that the viability of competitors remains an antitrust concern. 479 U.S. at 120-21. As far as I know, the statement in International Salt Co. v. United States, 332 U.S. 392, 396, 92 L. Ed. 20, 68 S. Ct. 12 (1947), a tying case, that \"it is unreasonable, per se, to foreclose competitors from any substantial market,\" remains good law. See Eleanor M. Fox, The Modernization of Antitrust: A New Equilibrium, 66 Cornell L. Rev. 1140, 1153-54 (1981) (\"Interests of entrepreneurs and small business have been a recurrent concern because independent entrepreneurs have been seen as the heart and lifeblood of American free enterprise, and freedom of economic activity and opportunity has been thought central to the preservation of the American free enterprise system.\").\n\nNor is there anything in Jefferson Parish to the contrary. Although the Court in that case focused on the effect on patients of the hospital's exclusive contract for anesthesiological services with one doctors' group, the Court did not suggest there could never be antitrust injury to competitors in the tied market. To the contrary, the Court noted that one of the effects of a tie could be impairment of competition on the merits in the market for a tied product which could \"harm existing competitors or create barriers to entry of new competitors in the market for the tied product.\" 466 U.S. at 14 (emphasis added); see also id. at 13 n.19 (\"'the practice of tying forecloses other sellers of the tied product and makes it more difficult for new firms to enter that market'\" (quoting Fortner I, 394 U.S. at 513 (White, J., Dissenting))).\n\nI, therefore, believe that the majority errs in failing to accept that injury to a class of independent autosound dealers and destruction of the autosound aftermarket can constitute antitrust injury. The evidence of the share of the tied market foreclosed by the tying practices condoned by the majority is sufficient to permit a jury to find such antitrust injury.\n\nNor do I agree with the majority that as a matter of law the Chrysler tying arrangement could not cause injury to consumers of a type cognizable under the antitrust laws. To the contrary, elimination of independent autosound dealers necessarily adversely affects consumers for the tied product. See 9 Phillip E. Areeda, Antitrust Law para. 1705b, at 65 (1991) (\"the disappearance of rival firms in the tied market . . . eliminates competitive spurs toward cost reduction, innovation, and improvements in the production and distribution of that product.\").\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nThe majority's Conclusion that there will be no anticompetitive effect of the tie on the consumer level is based entirely on its view that competition in the automobile market adequately \"protects consumers from having to pay too much for autosound systems,\" Majority Typescript Op. at 63. This, in turn, is based on two premises: one, that the automobile market is competitive, see, e.g., id. at 55, and the other, that it is to the advantage of automobile manufacturers to compete with each other as to autosound equipment. I believe that neither premise is established as a matter of law on this record, which is what the majority's affirmance of summary judgment signifies.\n\nIt simply is not evident, as the majority assumes, that the automobile market is competitive. Industry statistics reveal that only six car companies (GM, Ford, Chrysler, Honda, Toyota, and Nissan) accounted for almost 90% of the cars sold in the United States in 1990. See Ward's Automotive Yearbook 207 (1991). These numbers are not characteristic of competition, but of oligopoly.\n\nI agree with the majority that if the automobile market operated like the hypothetical competitive market, we could expect that some sellers of automobiles might seek to compete by lowering price or increasing the quality of the autosound equipment offered in their cars. Neither the academic economists relied on by the majority, nor the economic theories that it discusses, are needed to recognize that the competition that exists among automobile manufacturers is imperfect, and that such competition that does exist is generally directed toward more dominant features than autosound equipment, such as style, price and even safety features. How many of the Super Bowl automobile commercials were devoted to the automobile's CD sound?\n\nIn light of the small number of competitors, it is at least likely that the automobile market may be operating in an oligopolistic fashion. As Areeda, on whom the majority frequently relies, observes: tacit coordination among sellers may occur \"among as many as eight or twelve significant firms in a market.\" 9 Phillip E. Areeda, Antitrust Law para. 1704c, at 59 (1991). The automobile market is even more concentrated.\n\nIn an oligopolistic market, the leading players can follow the behavior of their counterparts without any direct contact. There is some possibility that occurred as to the tying arrangements of autosound equipment. The 1986 Chrysler Sound System Distribution Proposal states:\n\nG.M. and Ford both feature successful radio programs. Coordinated efforts between Production, Electronics Division and Parts Division have effectively blocked Audiovox \"look-alike\" sales. In fact, their success has caused Audiovox to concentrate its efforts on Chrysler.\n\nG.M. and Ford dealers are locked in to original equipment radios through high factory radio installation rates and efficient upgrade programs.\n\nApp. at 891. One of the goals listed in the Chrysler memorandum was \"integration of sound systems with vehicle design to obstruct aftermarket competitors.\" Id. at 902 (emphasis added).\n\nThere are plausible business explanations why, in an oligopolistic market, automobile manufacturers would choose to abstain from competing against each other by giving their auto buyers freedom of choice of automotive systems. Cf. Matsushita Elec. Indus. Co. v. Zenith Radio Corp., 475 U.S. 574, 589-90, 106 S. Ct. 1348, 89 L. Ed. 2d 538 (1986). There is evidence that the profit margin on the sale and installation of car radios by independents was as high as eighty-five percent. App. at 141. Thus, if each manufacturer included its own sound system as a standard feature in the automobiles it sold, each would reap the high profit and be insulated from competition with independent retailers and installers on the basis of price, service, or quality.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e See Phillip Areeda \u0026 Louis Kaplow, Antitrust Analysis para. 232, at 278 (1988) (\"even without direct communication, such firms may be able to reach and maintain the monopoly price through such mutual coordination by observing each other in the marketplace and acting consistently with the group interest\").\n\nMoreover, the majority appears to discount the effect of the tying arrangement in limiting consumer choice of autosound equipment.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The fact that particular consumers may be uninformed or lazy, as the majority posits, does not forfeit their statutory right to buy in a market which is free of artificial obstacles. Only if competition were dysfunctional or Chrysler in fact had some leverage could one explain the evidence that the radios Chrysler supplied were, as viewed by their own dealers, of poor quality and overpriced. See App. at 298 (dealers at a council meeting in Cincinnati in September 1987 complained that \"radios are extremely overpriced\"); id. at 295 (internal Chrysler memorandum dated May 6, 1987 that the dealers \"are convinced that the higher the cost of a Chrysler radio, the lower the quality of the radio\"); id. at 303 (52% of Chrysler dealers surveyed January 1984 when delete option still available would have ordered more Chrysler factory radios if they were more price competitive).\n\nChrysler's ability to force what may have been or is an inferior or overpriced autosound system on its car buyers need not have come solely from market dominance. To most car purchasers, the autosound system is viewed as a small and relatively inexpensive component of the total car purchase. In economic terms, the demand for autosound systems may be highly inelastic.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e If that is proven, then it is illusory for the majority to conclude that competition at the automobile level will ensure competition in the autosound product market.\n\nI find it anomalous that although the majority states that a rule of reason claim does not require an inquiry into market power in the tying product market, the result it reaches under the rubric of absence of antitrust injury stems from its Conclusion that Chrysler does not have such market power (\"Where a defendant indisputably proves that it lacks sufficient power in the tying product market, a plaintiff's power leveraging claim, whether packaged in 'per se' or rule of reason terms, falls apart.\" Majority Typescript Op. at 40). In effect, the majority ultimately restores, as a prerequisite for a successful tying case, precisely the market power showing it initially eschewed.\n\nUnlike the majority, I am not prepared to discount the possibility that plaintiffs can produce evidence that, if credited by a jury, would show that Chrysler's tie of radios to the purchase of Chrysler cars caused the two principal effects which the Supreme Court identified in Times-Picayune as the harms from tying arrangements, i.e., the inhibition of buyers from making their preferred purchase choice on the merits and the exclusion of competing sellers from the tied product market. See Times-Picayune Publishing Co. v. United States, 345 U.S. 594, 605, 97 L. Ed. 1277, 73 S. Ct. 872 (1953).\n\nIt has not been lost on me that some economists and antitrust academicians have been pressing for a different approach to tying arrangements than that which has been followed heretofore. Although I believe that economic analysis has a useful role to play in assisting the courts in understanding the realities of the marketplace, we cannot allow economic theory to replace the function traditionally allocated to the trier of fact in cases governed by the rule of reason.\n\nFor example, while the article authored by Professor Richard Craswell, Tying Requirements in Competitive Markets: The Consumer Protection Issues, 62 B.U. L. Rev. 661 (1982) [hereinafter Craswell, Tying Requirements], may be \"insightful,\" I am unwilling to assume that because it was cited in Jefferson Parish (one of many), his theories have the imprimatur of the majority of the Supreme Court. See Majority Typescript Op. at 52. The thesis of Craswell's article is \"that most tie-in controversies could be addressed far more effectively if they were removed from the penumbra of the antitrust laws entirely.\"\n\nCraswell, Tying Requirements, 62 B.U. L. Rev. at 663 (emphasis added). I see nothing in the majority's opinion in Jefferson Parish which endorses that view.\n\nIt is Congress which has placed tying \"within the penumbra of the antitrust laws,\" and indeed did so quite explicitly and emphatically through its enactment of section 3 of the Clayton Act. Because I believe that the majority, through its interpretation of a causation of antitrust injury test, has effectively enacted Craswell's thesis into the law of this circuit, I respectfully Dissent.\n\n\u003cspan class=\"fn\"\u003e* The Honorable Dolores K. Sloviter became Chief Judge on February 1, 1991.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e** The Honorable H. Lee Sarokin, United States District Judge for the District of New Jersey, sitting by designation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. By exercising the delete option, which was in effect for model years 1980 to 1983, Chrysler buyers could specially order cars from the factory without a factory-installed sound system, and if they did so they would receive a credit against the base price of the car.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Technically, section 3 of the Clayton Act is written to cover exclusive dealing contracts (contracts requiring the purchaser not to deal in the goods of a competitor of the seller), but Congress also intended to cover tying arrangements. A requirement that the buyer take another good of the seller means that the buyer may not deal with other sellers for that purchase. See IBM Corp. v. United States, 298 U.S. 131, 137-38, 56 S. Ct. 701, 80 L. Ed. 1085\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Chrysler says that if the case were to go to trial, it would argue that autos and autosound systems are not in fact distinct products, but instead part of one package. According to Chrysler, it only conceded this point for summary judgment purposes to avoid unnecessary lengthy discovery about its historical sales practices. In light of our Disposition, the one versus two product issue becomes moot.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Tying in competitive markets has long been common for promotional and other legitimate purposes. As the Supreme Court has repeatedly observed, package sales such as flour with sugar normally pose no antitrust concern, because if the seller ties the two products and does not offer a good deal, the customer in a competitive market can go elsewhere. See Jefferson Parish Hospital District No. 2 v. Hyde, 466 U.S. 2, 11-12, 104 S. Ct. 1551, 80 L. Ed. 2d 2 (1984) (\" Jefferson Parish \"). See also United States Steel Corp. v. Fortner Enterprises, 429 U.S. 610, 622, 97 S. Ct. 861, 51 L. Ed. 2d 80 (1977) (\" Fortner II \") (using cheap financing to sell expensive housing does not by itself violate the antitrust laws). As we will suggest in Part III, however, economic harm in the tied product market may still be possible, though unlikely, when the tying product market is competitive.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Through full line forcing, a seller may homogenize heterogeneous demand and increase profits. For example, a movie distributor might own the exclusive rights to three films, and there might be three television stations wanting to rent the films. Station A expects its viewers to like Film 1 and would pay $5000 for it singly, but Station A doubts that its viewers would like Films 2 and 3, so would pay only $2500 for each singly. Station B thinks that Film 2 is worth $5000 but that the other two are worth only $2500 each. And similarly, Station C values Film 3 at $5000, but the first two at only $2500 each. If the distributor marketed each film individually, the market price would be $2500 each, but if the distributor could require the stations to rent all three together, the package price would be $10,000. No station would be forced to take an undesired package, but the distributor would make a larger profit by bundling. Demand homogenization can also reduce costs, resulting in savings which will inure in part to consumers' benefit. Most relevant to this case, automobile manufacturers have increasingly standardized or packaged options that were formerly purchased singly. They justify that practice in part because it reduces costs somewhat, but it could also increase automakers' profits in the short term (although not in the long term if the automobile market remains competitive).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. IBM Corp. v. United States, 298 U.S. 131, 56 S. Ct. 701, 80 L. Ed. 1085 (1936), is frequently cited as such an example. In that case, IBM had a monopoly on card counting machines -- the forebear of modern computers. By charging a lot for cheap punch cards, IBM was able to vary the price for its system according to how intensively its customers used the machine, even though everyone paid the same low price for the machine. The Robinson-Patman Act does not condemn all price discrimination, of course, and many economists doubt the wisdom of prosecuting price discrimination. But price discrimination remains disfavored by the antitrust laws, which gives monopolists an incentive to effect it surreptitiously through tying.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Similarly, a seller might want to attribute income to one source rather than another in order to evade taxes, although in both the tax- and regulatory-evasion circumstances, it is hard to see the additional antitrust implications of the otherwise illegal conduct.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The Supreme Court itself has used quotation marks in referring to the \"per se\" rule against certain tie-ins, noting that \"tying may have procompetitive justifications that make it inappropriate to condemn without considerable market analysis.\" NCAA v. Board of Regents of the University of Oklahoma, 468 U.S. 85, 104 26, 104 S. Ct. 2948, 82 L. Ed. 2d 70 (1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. For the most recent comprehensive statement of this view, see generally 9 Areeda, Antitrust Law, especially para. para. 1703 at 50-55, 1730 at 406-14. Beginning with the seminal article by Ward Bowman, Tying Arrangements and the Leverage Problem, 67 Yale L.J. 19 (1957), the critics have also questioned the leverage hypothesis. They ask why a monopolist would want to expand control over a complement as opposed to a competing substitute, which would in fact be an expansion in the same product market. Other writers, however, have demonstrated that some monopolists can in fact increase their profits by tying, and that in some instances consumers will be hurt on net. In any event, although courts have long had an aversion to tying, the modern economic and legal literature generally agrees that tie-ins need not be, though can be, anticompetitive. See generally Louis Kaplow, Extension of Monopoly Power Through Leverage, 85 Colum. L. Rev. 515 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In Jefferson Parish, the most recent Supreme Court case covering a tying claim, a hospital had an exclusive dealing contract with a firm of anesthesiologists which provided that patients would receive anesthesiological services only from members of that firm while they were in the hospital. The plaintiff, an anesthesiologist but not a member of the firm, sued the hospital, claiming that the hospital had illegally tied hospital operating rooms to anesthesiological services. As discussed in the text, the Supreme Court reaffirmed the validity of the \"per se\" rule against tying but ruled that the tie-in there was not illegal \"per se.\" According to the Court, anesthesiology and hospital services were separate products, but the hospital possessed insufficient power in the tying (hospital services) market to invoke the \"per se\" rule. As we will discuss in Part III, the Court also ruled that the plaintiff failed to show an unreasonable restraint on competition in the tied product market (anesthesiology), so that the plaintiff had no rule of reason claim either.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. To the extent that Digidyne Corp. v. Data General Corp., 734 F.2d 1336, 1339-41, 1344-46 (9th Cir. 1984), suggests that defining the tying product market is generally unnecessary on a \"per se\" claim because power over a portion of that market (there, \"locked in\" purchasers of system software) is sufficient, we disagree with it. That may have been the Court's view in Fortner I, 394 U.S. at 502-04, but the Court retreated from this position in Fortner II and Jefferson Parish, 466 U.S. at 26-28. See also Data General Corp. v. Digidyne Corp., 473 U.S. 908, 908-09, 105 S. Ct. 3534, 87 L. Ed. 2d 657 (1985) (White, joined by Blackmun, Dissenting from denial of certiorari) (questioning the Ninth Circuit's opinion for this and other reasons, including the opinion's presumption that a copyright confers market power and its Conclusion that power to force is established by a demonstration that some buyers find the tying product uniquely desirable).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. More precisely, the plaintiffs, not Chrysler, shoulder the burden of defining the relevant tying product market. To win summary judgment on the \"per se\" theory, a defendant need only show that the plaintiff has failed to make any showing that the defendant has power in an economically and legally relevant tied product market. When opposing Chrysler's summary judgment motion, the plaintiffs must tell us the facts that they wish to prove at trial. If their sole proffered definition of the tying product market is wholly implausible, they have no triable \"per se\" case, whether or not Chrysler's definition is indisputable. For present purposes, however, that fine point does not matter. We easily conclude that the tying product market includes not only Chrysler-manufactured cars sold in the United States, but also all new automobiles competing with those cars (precisely the market definition that Chrysler proposes), and that Chrysler has no power over prices in that market.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Market definition (product or geographical) always involves the difficult task of line drawing, so that the two-step process of (1) market definition and (2) determination of power therein is unavoidably somewhat artificial. The important question for present purposes is the ultimate one: whether Chrysler has power over pricing its cars, such that we must presume (under the logic of the \"per se\" rule) that it is exploiting its leverage in the autosound market.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The parties appear to agree that the relevant geographic market is the entire United States, rather than any particular region. Neither party suggests that used cars belong in the market.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The plaintiffs do cite several old cases that viewed trademarks as creating presumptions of market power. But modern courts and commentators reject this position. See, for example, Grappone v. Subaru of New England, 858 F.2d 792, 796-97 (1st Cir. 1988) (almost all sellers of branded products have some loyal customers, but this alone is insufficient to prove market power for purposes of the \"per se\" rule); Phillip E. Areeda and Herbert Hovenkamp, Antitrust Law para. 511.1 at 488-89 (1991 Supp.) and cases cited therein.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The plaintiffs offer no creditable evidence to the contrary. Their only submission that is even arguably relevant to this issue is an affidavit by their expert, Dr. F. Gerard Adams, who simply concluded that the market alleged by the plaintiffs in their complaint is proper. In our view, Dr. Adams was merely agreeing with the plaintiffs' definition of the tied product market; nowhere does he specifically say anything about the tying product market or explain how Chryslers do not in fact compete with other cars. The documents that his affidavit cross-references relate to the autosound market, not the automobile market. Even if we believed that Dr. Adams meant to approve of the plaintiffs' definitions of both tying and tied product markets, his affidavit would be insufficient to raise a triable issue of fact. For purposes of tying product market definition, it is wholly conclusory and sets forth no specific facts or reasoning and therefore cannot defeat summary judgment. See F.R.C.P. 56(e); Lujan v. National Wildlife Federation, 497 U.S. 871, 110 S. Ct. 3177, 3188, 111 L. Ed. 2d 695 (1990).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Although courts can also infer market power from direct evidence of sustained supranormal profits rather than indirectly from evidence of market shares, the plaintiffs have offered no such evidence here. The plaintiffs complain that they have been denied discovery as to the profitability of Chrysler's autosound sales, but evidence of Chrysler's overall profitability from automobile sales is easily available from public sources and, not surprisingly, the plaintiffs have declined to introduce it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. We need not detail the prerequisites that are clear from the applicable statutes and are not at issue here. For example, a prerequisite to all Sherman Act claims is an effect on interstate or international commerce, but both parties agree that Chrysler's actions have an effect on interstate commerce.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The other two prerequisites the Concurring Justices would have imposed were \"a substantial threat that the tying seller will acquire market power in the tied-product market,\" id. at 38, and \"a coherent economic basis for treating the tying and tied products as distinct,\" id at 39.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The concurrence also suggested that tying might be undesirable if it serves as a means to evade regulatory price controls or if it enables the seller to engage in price discrimination by metering demand. Id at 37 n. 4. The former theory does not require market power, and Justice O'Connor had no reason to endorse or reject a market power requirement in general in Jefferson Parish. Thus Chrysler arguably overstates the views of the Concurring Justices as well as the majority.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Chrysler suggests that Justice Stevens's next paragraph effectively negated the sentence quoted in the text. That paragraph reads, in its entirety: In sum, any inquiry into the validity of a tying arrangement must focus on the market or markets in which the two products are sold, for that is where the anticompetitive forcing has its impact. Thus, in this case our analysis of the tying issue must focus on the hospital's sale of services to its patients, rather than its contractual arrangements with the providers of anesthesiological services. In making that analysis, we must consider whether petitioners are selling two separate products that may be tied together, and, if so, whether they have used their market power to force their patients to accept the tying arrangement. 466 U.S. at 18. Chrysler says that because the first sentence discusses \"any inquiry into the validity of a tying arrangement,\" the entire paragraph also covers rule of reason claims, and that the last phrase shows that the majority still requires a showing of power in the tying product market in rule of reason claims. Although that argument seems powerful, it ignores the beginning of the second sentence, which indicates that the Court was talking about what its inquiry in that case would involve. In Jefferson Parish, the primary issue was the \"per se\" claim, so of course the Court had to consider tying market power. The issue is not free from doubt, but we are reluctant to read that paragraph (or, as explained in the text, the entire majority opinion) as insisting on a showing of tying market power when making a rule of reason claim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. In several other cases not relied on by Chrysler for this proposition, courts of appeals have generically described the requirements for demonstrating an illegal tying claim as including tying market power. See Xeta, Inc. v. Atex, Inc., 852 F.2d 1280, 1282-83 (Fed Cir. 1988); Wells Real Estate, Inc. v. Greater Lowell Board of Realtors, 850 F.2d 803, 814 (1st Cir. 1988); Will v. Comprehensive Accounting Corp., 776 F.2d 665, 670-74 (7th Cir. 1985); Jack Walters \u0026 Sons Corp. v. Morton Building, Inc., 737 F.2d 698, 702 (7th Cir. 1984). But those cases do not distinguish between \"per se\" and rule of reason claims and may only have meant to cover \"per se\" claims. These cases merely cite the \"per se\" portions of Jefferson Parish and do not explain how, if their holdings do cover rule of reason claims, those holdings are consistent with the words and deeds of the Jefferson Parish majority when specifically considering the rule of reason claim there.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The economic (as opposed to legal precedential) soundness of a requirement of tying market power for a rule of reason claim is a matter of academic debate. Some commentators agree with the Concurring Justices in Jefferson Parish. See, for example, Herbert Hovenkamp, Economics and Federal Antitrust Law § 8.3 at 217-19 (1985) (tying arrangement in competitive market can cause no harm because seller cannot impose unwanted second product without compensating buyer; hence tie-in must be \"efficiency-creating\"). Most of the work of \"Chicago School\" theorists has centered on the general proposition that significant economic harm cannot occur (and hence the antitrust laws should not interfere) in competitive markets. See, for example, Frank H. Easterbrook, The Limits of Antitrust, 63 Tex. L. Rev. 1, 20-21 (1984) (\"Firms that lack [market] power cannot injure competition no matter how hard they try.\"). But other commentators, for varying reasons, suggest that economic harm from tie-ins is possible, although not probable, where the tying product market is competitive. See 9 Phillip E. Areeda, Antitrust Law para. para. 1728b at 369-70, 1728d at 371-72, 1729 at 375-406 (1991) (harm from foreclosure of substantial share of concentrated tied product market still possible without power in tying product market); Richard Craswell, Tying Requirements in Competitive Markets: The Consumer Protection Issues, 62 B.U. L. Rev. 661 (1982) (tie-ins in competitive markets may be linked to market failures caused by imperfect information, although antitrust laws may not be the best solution to this consumer protection problem); W. David Slawson, Excluding Competition Without Monopoly Power: The Use of Tying Arrangements to Exploit Market Failure, 36 Antitrust Bull. 457 (1991) (favoring broader \"per se\" rule, even where seller has no power in tying product market, but with expansive affirmative defenses). Because we believe that we are bound by Jefferson Parish unless and until the Court changes its mind, we need not take sides in this debate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The plaintiffs claim that the \"synergy\" between Chrysler's eleven percent share of the automobile market, some customers' loyalty, and Chrysler's trademarks creates a triable issue over whether Chrysler can exploit those factors to \"force\" sales of unwanted radios -- under the rule of reason, even if not under the \"per se\" rule. In our view, on these facts at least, the power extension theory is no more triable under the rule of reason than it is under the \"per se\" rule. Of course, tying market power is not a binary issue (present or not present), but a question of degree. Perhaps, as both sides have at times suggested, the minimum power threshold for a leverage-based rule of reason claim should be lower than for a \"per se\" claim. Justice Stevens's \"kind or degree\" language in Jefferson Parish, 466 U.S. at 18 (quoted at ), certainly supports that interpretation. But in practice, although economists use indices, market power is difficult to measure with precision. At all events, here the plaintiffs have no reasonable argument that Chrysler has any significant leverage from the automobile market. Thus, although in theory there may be cases in which the plaintiffs can proceed on a leverage-based theory under the rule of reason but not under the \"per se\" rule, this is not a case that requires us to venture onto the slippery slope of market power quantification.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. We decide this case on Chrysler's motion for summary judgment, not on the pleadings. If the plaintiffs believed that they have not had ample discovery to determine precisely how Chrysler's challenged practices are hurting them, then the proper approach would have been to file a motion under F.R.C.P. 56(f) identifying the additional documents needed. The plaintiffs have not done so. The plaintiffs do assert that they were denied discovery as to the profitability of Chrysler's autosound sales, but even if they had not waived the point by failing to file a Rule 56(f) motion, we do not see how the requested information (if available) could help them over the causation hurdle.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. As we discuss below, this is so whether or not the buyers know the underlying prices for each component: if the package is not worth the package price, or another manufacturer's package is a better deal on net, the car buyer will offer less or go elsewhere. We consider buyers who fail to consider autosound systems when buying their cars in the next subsection.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. According to the plaintiffs' consumer survey, only 43.3 percent of buyers of Chrysler cars bought the type of autosound equipment that was on their cars because they wanted it beforehand, and only 15.4 percent specifically preferred Chrysler's brand of autosound equipment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Others would not, for at least two reasons. First, they may not know how well options will fit together. Second, due to production efficiencies, installing individual preferences is more expensive than installing a standard options package.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The plaintiffs also offer evidence that some consumers do consider autosound systems (and hence are not surprised), but consider them as only a secondary factor. For these consumers, the autosound system matters but will rarely be a deal-breaker by itself, again because it is a small fraction of the total price. But for them, the argument of the last section applies: nothing prevents these consumers from going elsewhere. Chrysler may force them to compromise, but it cannot force them to accept an inferior package at an inflated price, which is the concern of the antitrust laws.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. In another portion of the opinion, which we discussed in the previous subsection, Justice Stevens did write that \"tying arrangements need only be condemned if they restrain competition on the merits by forcing purchases that would not otherwise be made. A lack of price or quality competition does not create this type of forcing.\" 466 U.S. at 27-28. Out of context, that statement seems to say that a tying arrangement's inhibition of price and quality competition is not, of itself, an antitrust concern -- which is in tension with the passages we have quoted in the text. But the remainder of the Discussion there shows that the Court was talking about consumer inability to evaluate anesthesiological services -- a preexisting and continuing problem of price and quality competition. The quality of an autosound system is less difficult to Judge than the caliber of an anesthesiologist. No doubt Chrysler buyers can evaluate the price and quality of autosound systems, although, as the plaintiffs have shown, they often choose not to. The claim here is that the tie-in has induced a market failure, not merely taken advantage of an existing one, and Jefferson Parish neither rules out nor rules in such claims.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Professor Craswell's article also contains Discussions of the problems of surprise and opportunism. 62 B.U. L. Rev. at 672-75. His Discussion of surprise focuses on the problem of buyer misperception. For example, when a buyer buys a photocopier and commits to purchasing the same manufacturer's paper, the buyer may misestimate the amount of paper that will be needed and hence the cost of the package, or it may simply misunderstand its commitment. Automobile purchases, however, are one-shot deals that require no complex estimation of future purchases; their greatest complexity is usually the financing, which is not at issue here. Similarly, Professor Craswell's Discussion of opportunism, which focuses on the problem of locked-in buyers, is not applicable here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Car buyers might want to know the price and dealer cost of each option to determine the dealer's margin, which might help them in bargaining with the dealer. Of course, they would be just as well off knowing the total dealer cost for each car, which they could compare with the total price offered. But neither the antitrust laws (nor, as far as we are aware, consumer protection statutes) require sellers to advise consumers of their mark-ups. At all events, outlawing Chrysler's tying practices would only reveal itemized prices, not itemized costs, which would not help consumers in bargaining.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. If the plaintiffs' claim is instead that itemized pricing will spur consumers to consider alternative suppliers for each component, it has two problems. First, it proves too much: the same argument would apply to every component of a car, whether currently denominated an option (such as an airbag on most cars) or standard equipment (such as windshield wipers). Second, and more basically, while spurring consumers to comparison shop may be a worthy societal goal, that is not Chrysler's duty under the antitrust laws. Some legislators may want to require itemized pricing for automobiles just as some locales now require unit pricing in supermarkets, but we cannot read such a requirement into the antitrust laws.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Actions creating or exacerbating problems of imperfect information could be seen as \"restraining trade\" or \"substantially lessening competition\" even though not leading to monopoly or oligopoly.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Chrysler has conceded that its practices affect a substantial amount of commerce. We do not read that concession, however, as an acknowledgement that Chrysler has foreclosed such a substantial portion of the tied product market to hurt competition. Chrysler's briefs vigorously deny that it has power in a properly defined tied product market, and Chrysler submits that as a result there is no way that it could appreciably restrain competition in that market.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. That not all Ford and GM sound systems may physically fit into Chrysler dashboard slots is irrelevant to the process of market definition. The real question is whether the systems compete with each other. For someone who has already decided to buy a Chrysler, it is true that a Ford-installed sound system may not compete with a Chrysler- or aftermarket-supplied sound system because the Ford system would be too big to fit. But the question of fit only matters if automobile buyers are locked into buying Chryslers, which is simply not true.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. The plaintiffs argue that Chrysler's practice is motivated by its greater profits on sound systems that it manufactures itself. Even if we assume that this is true (which is by no means obvious as a matter of economic theory), if Chrysler also were totally insulated from competition with respect to autosound systems, it would make no sense for Chrysler to continue to purchase any sound systems from other manufacturers. Thus one or both of the plaintiffs' two premises must be false.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. At all events, the plaintiffs, not Chrysler, bear the burden of defining a relevant tied product market for purposes of this theory. Even if we were to agree that Chrysler's broad definition of the tied product market was disputable, certainly the plaintiffs are not entitled to go to trial with their Chrysler-only definition of the tied product market. The plaintiffs' definition is patently invalid.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. The plaintiffs requested but did not obtain discovery of the profitability of Chrysler's autosound sales, information which would be relevant to Chrysler's ability to sustain supranormal profits from autosound sales (that is, power in the autosound market). Once again, however, if the plaintiffs felt that this discovery was necessary for them to defeat Chrysler's motion for summary judgment, it was incumbent on them to file a Rule 56(f) affidavit. They did not do so, and therefore cannot complain now. See Dowling v. City of Philadelphia, 855 F.2d 136, 139-40 (3d Cir. 1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. The plaintiffs have also asked that this court take notice that Chrysler's practice of standardizing autosound systems is becoming prevalent across the automotive industry. That standardization, they suggest, will ultimately doom the entire autosound aftermarket industry because aftermarket sellers will not enter the automobile market in order to sell their audio wares. Chrysler has admitted that Ford and GM are undertaking similar standardization programs. The Big Three American automakers, however, only account for about half of the American automobile market. Asian and European manufacturers have made large inroads into the American car market, and the plaintiffs have not introduced into the record any information about foreign manufacturers' practices. We do not believe that this is the type of fact of which federal courts may take judicial notice under Federal Rule of Evidence 201(b). Actually, Chrysler suggested at oral argument that the foreign manufacturers are not following the American practice. But this fact is not generally known and we have not independently confirmed it, nor could we easily do so. Whatever the truth may be, we cannot credit the plaintiffs' arguments to the extent that they are based on industry-wide practices. Moreover, even if we assumed that soon every automobile manufacturer will include an autosound system on every car, the most that we could conclude would be that a certain class of competitors (namely the autosound aftermarket dealers) might be doomed to competitive oblivion. But that would be no concern of the antitrust laws unless consumers were also hurt because of diminished competition. See Brunswick, 429 U.S. at 488 (antitrust laws serve to protect competition, not competitors). If the autosound aftermarket were to disappear, vigorous competition in the automobile market would remain. That competition would protect those consumers who care about autosound systems no less than it now protects consumers who care about other standard features, including the comfort of the front seats, the quality of the brakes, and the fuel efficiency of the engine. If the plaintiffs alleged actual or tacit collusion among automobile manufacturers with respect to standardization, that would be a serious antitrust concern. But the plaintiffs do not. If the autosound aftermarket industry wants protection from auto manufacturers' supposedly widening yet noncollusive standardization practices, it should seek relief from the Congress, not from the federal courts whose duty it is to adjudicate antitrust claims.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. The language in Times-Picayune, although part of an extended Discussion, is doubly dictum because (1) the case did not involve a claim under section 3 of the Clayton Act, and (2) the decision turned on whether the morning and afternoon newspapers were one product, hence whether there was a tie-in at all. Because the Court has never stated this position in a holding, technically it does not bind us. Generally, however, we consider and respect Supreme Court dicta as well as holdings because the Supreme Court hears relatively few cases and frequently uses dicta to give guidance to the lower courts. Of course, at the time of Times-Picayune, antitrust cases were directly appealable to the Supreme Court, so perhaps we could dismiss the language as \"mere\" dictum, but it was carefully considered dictum and we prefer to tackle the plaintiffs' argument head on and not dispose of it on that tenuous ground.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Actually, the dual-standard position that the Court endorsed in Times-Picayune may not have survived the intervening years. The Court has not faced a claim under section 3 of the Clayton Act since Times-Picayune, so not surprisingly it has not explicitly either reaffirmed or backed off from the language at issue. Nevertheless, we are inclined to agree with Professor Areeda, among others, that the standards for illegality of tying arrangement under the Sherman and Clayton Acts have coalesced. See 9 Areeda, Antitrust Law para. 1719b at 254-57 (citing cases and noting arguments for differing standards based on precedent, legislative history, and general principles of statutory interpretation, but persuasively rejecting each). See also 2 Areeda and Turner, Antitrust Law para. 304 at 6-9.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. The plaintiffs rely heavily on the legislative history of the Clayton Act, but the legislative history of that act is a complicated one. See 2 \u0026 3 Earl W. Kintner, ed. The Legislative History of the Federal Antitrust Laws and Related Statutes (Clark Boardman, 1978). Some members of Congress sought to clarify and expand the scope of antitrust liability under the Sherman Act, which was murky after the promulgation of the rule of reason in Standard Oil Co. v. United States, 221 U.S. 1, 31 S. Ct. 502, 55 L. Ed. 619 (1911). Others sought to rein in their colleagues by insisting on the qualifier requiring a substantial lessening of competition or the tendency to create a monopoly. Because one can find choice statements in the voluminous legislative history of this statute to support almost any interpretation, we prefer to focus on the compromise language eventually hammered out.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The majority focuses on the effects rather than the purpose of Chrysler's tie, although there is evidence that suggests that Chrysler was targeting its competitors in the aftermarket installation. An internal Chrysler memorandum in 1983 by a departmental specialist to the manager of Options and Mix Merchandising stated, \"we will support product planning's proposal to make radios standard on everything. . . . Our field force should have ample reason to force our radios in place of aftermarket installations.\" App. at 301 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The majority appears to credit Chrysler's suggestion made at oral argument that the foreign manufacturers are not following the American tying practice. See Majority Typescript Op. at 61-62 n.40. If the majority had permitted this case to proceed to an inquiry into actual competitive effects, it might have been relatively easy for plaintiffs to establish that, in fact, many of Chrysler's foreign competitors are engaging in similar tying practices. See, e.g., Five Compacts Sedans, Consumer Reps., March 1990, at 199 (noting that Honda Accord LX, Nissan Stanza GXE, and Subaru Legacy LS all include stereos as standard equipment).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The interconnection between demand for the tying product and the tied product is one of the distinguishing factors between this situation and the flour/sugar hypothetical discussed in Jefferson Parish, 466 U.S. at 12, where the demand for the two goods is independently derived.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Similarly, foreclosure of part of the market occupied by independents also may injure consumers in their pocketbooks. As a general matter, in an oligopolistic market \"ties narrowing the volume of orders potentially available to rivals lower their possible gains from price cutting. In turn, reducing their incentive for price competition diminishes its likelihood, thereby helping stabilize non-competitive oligopoly pricing.\" 9 Phillip E. Areeda, Antitrust Law para. 1707c, at 80-81 (1991). Thus, such a tying practice may also discourage aftermarket sellers from engaging in vigorous price competition (an anticompetitive effect).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Although the majority does not accept plaintiffs' argument that the district court erred in failing to require Chrysler to produce documents relating to the profitability of its radio sales, I would not discount the relationship of such evidence to an inquiry into effect on competition in the tied product market.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. A consumer survey presented by plaintiffs reported that 13.4 percent of Chrysler buyers would have preferred to choose a different brand or type of radio than that supplied with their cars, App. at 579, and 20.8 percent would have preferred to have had the option to purchase a car without its accompanying automotive sound equipment, id. at 584.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. It is significant that unlike flour and sugar, items of relatively equal value, there is evidence in this case that the typical consumer has already decided to purchase a particular brand of automobile, a major decision, before considering the relatively minor decision regarding preferences as to a car radio. There is evidence that only 1.6% of the Chrysler buyers decided not to buy a particular car because the desired automotive sound equipment was not available. The figure for buyers of cars generally was 2.4%. App. at 581. This court has previously expressed concern that a minor decision may be insulated from the competitive pressures of the marketplace due to the nature of an accompanying major decision and the order in which the decisions are typically made by consumers. See Weiss, 745 F.2d at 826 (jury could reasonably have concluded that a consumer of hospital services makes one purchase decision and that further decisions concerning his treatment are relatively insulated from competition). Thus, the normal market pressures from competition, which are expected when one sells independent products together, such as flour and sugar, and which, at least theoretically, protect against monopoly profits and inferior products, may not be operating in the tied product market here.\u003c/span\u003e\n\n",
    "body_length": 142984,
    "citedas": [
      "959 F.2d 468"
    ],
    "attorneys": "Donald B. Lewis (Argued), Ann Miller, Law Offices of Donald B. Lewis, 3240 PSFS Building, 12 South 12th Street, Philadelphia, PA 19107. Sidney Dickstein, Peter J. Kadzik, Dickstein, Shapiro \u0026 Morin, 2101 L Street, NW, Washington, DC 20037, Attorneys for Appellants. Joseph Angland (Argued), Robin D. Adelstein, Steven A. Klein, Dewey Ballantine, 1301 Avenue of the Americas, New York, NY 10019. Lewis H. Goldfarb, Allan M. Huss, Paul R. Eichbauer, Chrysler Corporation, 12000 Chrysler Drive, Highland Park, MI 48288, Attorneys for Appellee.",
    "category": [
      "243",
      "252"
    ],
    "judges": "Argued December 14, 1990 Before: Sloviter, Chief Judge,*fn* Mansmann, Circuit Judge, and Sarokin, District Judge.*fn** Reargued November 13, 1991 Before: Sloviter, Chief Judge, and Becker, Stapleton, Mansmann, Greenberg, Hutchinson, Scirica, Cowen, Nygaard, Alito, and Roth, Circuit Judges.",
    "citation_count": 79
  }
}
