{
  "id": "nc1fYWYBTlTomsSBdVsQ",
  "document": {
    "title": "Gruen v. State Tax Commission",
    "full_title": "CHARLES H. GRUEN v. THE STATE TAX COMMISSION ET AL.",
    "jurisdiction": "Washington Supreme Court",
    "date": "1949-11-05T00:00:00.000Z",
    "docket": "No. 31083",
    "body": "Plaintiff, who is a taxpayer engaged in the sale of cigarettes in the city of Seattle, instituted this action in the superior court of Thurston county. The complaint contains several allegations attacking the constitutionality of the Session Laws of 1949, chapter 180, p. 496. Plaintiff asked for a permanent injunction against the tax commission of the state of Washington to prevent the collection of the taxes provided for in the act; a permanent injunction against the state finance committee to prevent the issuance, sale, or retirement of bonds; and a permanent injunction against Honorable Cliff Yelle, state auditor, to prevent the issuance or the drawing of warrants, or otherwise doing or performing any of the acts or duties directed by the act.\n\nThe defendants interposed a demurrer to the complaint on the ground that a cause of action was not stated. The demurrer was overruled. The defendants refused to plead further to the complaint, and a permanent injunction was issued as prayed for. This appeal followed.\n\nThe assignments of error made by appellants are sufficient to challenge the judgment entered by the trial court.\n\nThe respondent contends that the act violates the following provisions of the Washington state constitution: (1) Art. II, § 19; (2) Art. II, § 37; (3) Art. VIII, § 5; (4) Art. I, § 12 (and amendment fourteen, United States constitution); (5) amendment one; (6) Art. VIII, §§ 1 and 3; and (7) amendment fourteen.\n\nThe act under consideration provides for the payment of a bonus to the veterans of World War II. Sections 2, 3, 4, 5, a portion of 7, 8, 10, and 11 of the act simply indicate the persons who are entitled to receive the bonus, and determine the legal machinery for the sale and disposal of\n\nthe bonds issued to secure the money necessary to pay the bonus. They also indicate the duties of certain state officials in relation to the payments to veterans and the sale of the bonds, and the collection of taxes to retire them. Section 7 provides that limited bonds of the state of Washington be issued and sold in the sum of eighty million dollars for the purpose of paying the veterans' compensation. It makes the bonds payable in thirty years from the date of their issuance. Section 9 of the act provides that funds necessary to pay the bonds and interest thereon shall be secured from the excise tax on cigarettes imposed by Title XII (§§ 82 to 95, inclusive), chapter 180, p. 706, Laws of 1935 as amended (Rem. Rev. Stat. (Sup.), §§ 8370-83, -85, -87, -89, -90, -91, -94, -95; Rem. Supp. 1941, §§ 8370-84, -86, -88, -92, -93; Rem. Supp. 1943, § 8370-82), and an additional tax upon the sale, use, consumption, handling, or distribution of cigarettes in an amount equal to one cent upon each ten cents or fraction of the intended retail selling price thereof.\n\nBefore entering into a discussion of the questions appearing in this case, we deem it proper to refer to certain principles which must be applied in ascertaining whether or not a law passed by the legislature is constitutional.\n\n[1] In construing a statute, every reasonable intendment will be indulged in in favor of the construction that it is in conformity with the provisions of the constitution. If a reasonable doubt appears, it should be resolved in favor of the validity of the law, the presumption being \"that the statute in question is constitutional,\" and the burden rests upon the attacking party to clearly establish its invalidity. State v. Hanlen, 193 Wash. 494, 76 P.2d 316.\n\n\"It is a well settled rule that, where a statute is open to two constructions, one of which will render it constitutional, and the other unconstitutional, the former construction, and not the latter, is to be adopted. Poolman v. Langdon, 94 Wash. 448, 162 P. 578.\" State ex rel. Campbell v. Case, 182 Wash. 334, 47 P.2d 24.\n\n\"We are in complete accord with the principle announced in the case of Farquharson v. Yeargin, 24 Wash. 549, 64 P. 717, to the effect that all presumptions must be indulged in, in favor of the constitutionality of a legislative act, and\n\nthat, where possible, it will be presumed that the legislature has affirmatively determined any special facts requisite to the validity of the enactment, even though no legislative finding of fact appears in the statute.\n\n\"We are also in accord with the rule announced in the case of State ex rel. State Reclamation Board v. Clausen, supra, [110 Wash. 525, 188 P. 538, 14 A. L. R. 1133], where we approved the rule that a statute should not be declared unconstitutional unless such a holding is clearly required, and that this rule applies with peculiar force to the question of whether or not a legislative appropriation of public moneys is for a public purpose.\" State ex rel. Collier v. Yelle, 9 Wash. 2d 317, 115 P.2d 373.\n\n\"The statute, it must be remembered, is an exercise of the taxing power by the state. It must be remembered, also, that, before a taxing statute is held to be in violation of the fundamental law, it must be so clearly so that no other rational conclusion can be reached.\" Spokane International R. Co. v. State, 162 Wash. 395, 299 P. 362.\n\n[2] A statute, when enacted, possesses that binding force and effect named therein, unless it is clearly in conflict with our fundamental law. In other words, a statute cannot be judicially declared beyond the power of the legislature to enact unless in conflict with some specific or definite provision of the constitution. State v. Emonds, 107 Wash. 688, 182 P. 584.\n\n[3] The legislature may legally enact any law not expressly or inferentially prohibited by our state constitution, the constitution being a limitation, not a grant of power. Walker v. Spokane, 62 Wash. 312, 113 P. 755, Ann. Cas. 1912C, 994; State ex rel. Mountain Tbr. Co. v. Superior Court, 77 Wash. 585, 137 P. 994; Standard Oil Co. v. Graves, 94 Wash. 291, 162 P. 558; Sears v. Western Thrift Stores, 10 Wash. 2d 372, 116 P.2d 756.\n\nIt must be remembered that the legislature is the chosen representative of the people. It speaks for them. Under our constitution, the legislature passes laws and repeals laws as the sole representative of the people. This definite conclusion is admirably summed up in the case of Commonwealth ex rel. McCormick v. Reeder, 171 Pa. 505, 33\n\nAtl. 67, 33 L. R. A. 141, wherein the supreme court of Pennsylvania said:\n\n\"But whatever the people have not, by their constitution, restrained themselves from doing, they, through their representatives in the legislature, may do. This latter body represents their will just as completely as a constitutional convention in all matters left open by the written constitution. Certain grants of power, very specifically set forth, were made by the states to the United States, and these cannot be revoked or disregarded by state legislation; then come the specific restraints imposed by our own constitution upon our own legislature; these must be respected; but in that wide domain not included in either of these boundaries the right of the people through the legislature to enact such laws as they choose, is absolute. Of the use the people may make of this unrestrained power, it is not the business of the courts to inquire. We peruse the expressions of their will in the statute; then examine the constitution and ascertain if this instrument says, 'Thou shalt not,' and if we find no inhibition, then the statute is the law simply because it is the will of the people and not because it is wise or unwise.\"\n\nWhen the constitutionality of an act is questioned, it is the solemn duty of the court to lay the act alongside the constitution and, with that instrument alone as a yardstick, decide the question according to the applicable rules of law which we have set out.\n\nThe question presented here is: Does the act represent a valid exercise of the legislative power?\n\nRespondent makes the contention that the title of the act does not comply with the provisions of Art. II, § 19, of our state constitution, which provides that no bill shall embrace more than one subject, and that shall be expressed in the title.\n\nThe title to chapter 180, p. 496, Laws of 1949, reads as follows:\n\n\"An Act providing for the payment of a bonus to veterans of World War II from the proceeds of a bond issue repayable from the excise taxes on cigarettes as herein provided for; making an appropriation and providing penalties.\"\n\nThe solution of this question depends upon whether the title to the act may be said to be general or restrictive.\n\n[4] In State ex rel. Seattle Electric Co. v. Superior Court, 28 Wash. 317, 68 P. 957, 92 Am. St. 831, this court said, in referring to Art. II, § 19, of our state constitution:\n\n\"The above constitutional provision is clear, direct, and mandatory in its nature, and, if the legislative act in question violates that provision, it must be held void.\"\n\nAgain, we stated in Great Northern R. Co. v. Cohn, 3 Wash. 2d 672, 101 P.2d 985:\n\n\"In determination of the question whether the title of an act is in compliance with the constitutional requirement invoked by respondent, the title must be construed with reference to the language used in the title only and not in the light of the context of the act.\"\n\n[5] This court has, in numerous decisions, pointed out that there are two classes of titles to legislative acts -- general and restrictive. A recent consideration of this subject is contained in State ex rel. Washington Toll Bridge Authority v. Yelle, 32 Wash. 2d 13, 200 P.2d 467. That case involved the constitutionality of chapter 266, p. 858, Laws of 1945. In passing upon the act and its validity, in view of the provisions of Art. II, § 19, this court stated:\n\n\"The purposes of this constitutional mandate are threefold: (1) to protect and enlighten the members of the legislature against provisions in bills of which the titles give no intimation; (2) to apprise the people, through such publication of legislative proceedings as is usually made, concerning the subjects of legislation that are being considered; and (3) to prevent hodge-podge or log-rolling legislation. We have declared that when laws are enacted in violation of this constitutional mandate, the courts will not hesitate to declare them void.\n\n\"Another rule which has been frequently stated by this court is that the title of an act need not be an index to the contents of the legislation that follows, nor need it express in detail every phase of the subject which is dealt with by the enactment, but that it is sufficient if the title gives such notice as should reasonably lead to an inquiry into the body of the act itself, or indicates, to an inquiring mind, the scope and purpose of the law. [Citing cases.]\n\n\"In applying this latter rule, however, there is a distinction between the effect of a broad, general title and that of a narrow, restricted one. If the title is general and comprehensive, it will be given a liberal construction; in such case, no elaborate statement of the subject of the act is necessary, and a few well-chosen words suggestive of the general subject treated is all that is required. If, however, the title is a restricted one, it will not be regarded so liberally, and provisions which are not fairly within such restricted title will not be given force.\"\n\nWe quote from the following cases in order to indicate titles which have been held to be restrictive:\n\nIn Anderson v. Whatcom County, 15 Wash. 47, 45 P. 665, 33 L. R. A. 137, action was brought by the justice of the peace against the county for his salary. The county, in refusing to pay the salary, based its defense upon a statute entitled, \"An act to provide for the economical management of county affairs.\" In deciding the constitutionality of the act, the court had this to say:\n\n\"It is contended that this act repeals the act of February 7, 1891, which is entitled 'An act fixing the salaries of justices of the peace and constables, in incorporated cities and towns having more than five thousand inhabitants,' etc., and that its effect is to reduce the salary of the officer to the amount represented by the fees collected by such officer, while the contention of the respondent is that the act was intended to operate only upon deputies and outside assistance employed by the county commissioners. Whatever may have been the intention of the legislature, and it must be conceded that if the law has the effect contended for it by the appellant so far as its application to justices of the peace is concerned, it would equally apply to all the county officers excepting to the fees of county attorney, which is specially excepted by the provisions of the act, we are satisfied that, if it was intended to change the salaries of county officers, the title is obnoxious to the constitutional provision that no bill shall embrace more than one subject, and that subject expressed in the title. The title to this act is 'An act to provide for the economical management of county affairs.' We do not think this gives a legal notice of the reduction or change of salaries. Economical management of county affairs would convey the idea of the management on the part of the county commissioners, or of somebody who had\n\npower or discretion to manage the business affairs of the county, and would not suggest to the mind the question of salaries in any respect. It could not reasonably be concluded that an act providing for economical management of county affairs could work a repeal of an act entitled 'An act fixing the salaries of justices of the peace and constables,' so that if it was the intention of the legislature to change the salaries of county officers, that intention is not foreshadowed by the title to the act, and would therefore be unconstitutional so far as effecting that object is concerned.\"\n\nThe title questioned in Percival v. Cowychee \u0026 Wide Hollow Irr. Dist., 15 Wash. 480, 46 P. 1035, read:\n\n\"An Act providing for the organization and government of irrigating districts and the sale of bonds arising therefrom, and declaring an emergency.\"\n\nIn passing, this court said:\n\n\"Hence, the question presented for decision is as to whether or not a title which shows nothing more than that the act is to provide for the organization and government of irrigation districts and the sale of bonds arising therefrom is broad enough to warrant the enactment thereunder of a provision for the validating of the indebtedness of a district which might have been organized thereunder, and the levying of a tax to pay the same.\n\n\"That the provision in the constitution in question should be reasonably construed and legislation sustained which fairly comes within the subject matter embraced in the title has been frequently held by this court. See Marston v. Humes, 3 Wash. 267 (28 P. 520); In re Rafferty, 1 Wash. 382 (25 P. 465). And such we believe to be the tendency of the decisions of all of the courts. But it will not do to sustain legislation which is so foreign to the subject matter embraced in the title that one could read such title without having his attention in any manner directed toward the legislation attempted to be embraced thereunder. A title may be as broad as the legislature sees fit to make it, and thereunder any specific legislation, as to any subject relating to the general matter thus broadly embraced in the title, sustained. But when it sees fit to adopt a restricted title and thereunder attempts to enact provisions not fairly within such restricted title, such provisions cannot be given force by reason of the fact that it would have been competent for the legislature to have adopted a more generic\n\ntitle and thereunder properly included all of the provisions of the act.\"\n\nIn State v. Clark, 43 Wash. 664, 86 P. 1067, we had under consideration the title to an act which provided for the protection of builders, and declared an emergency. In passing upon the question presented, this court said:\n\n\"An act for the protection of builders, with perhaps the first emergency clause ever attached to a criminal statute in this state, does not convey notice to contractors that they are to be punished, or to the owners of buildings that they are to be protected, nor could any reasonable man expect to find such a provision under such a title.\"\n\nState ex rel. Arnold v. Mitchell, 55 Wash. 513, 104 P. 791, concerned the primary election law of 1909, entitled:\n\n\"An act relating to, regulating and providing for the nomination of candidates for public office in the State of Washington and providing penalties for the violation thereof, and amending sections 1, 2, 3, 5, 10, 13, 22, . . .\"\n\nNo mention was made of § 12, which was amended, and which amendment was attempted to be enforced in the action. In passing, it was held:\n\n\"If the act of 1909, in so far as it refers to section 12, be an attempted amendment of the registration law or of the primary law, it is void because there is no suggestion of an amendment to the registration law, or that section 12 of the primary law is to be amended in the title of the act. Perhaps the most salutary provision in our state constitution is section 2, art. 19: 'No bill shall embrace more than one subject and that shall be expressed in the title.' In it the people have found their most potent weapon against vicious legislation. It is a declaration that truth must go before, shedding its light upon every legislative act. It makes the title speak the object of the law. A wholesome statute, if declaratory of a subject not within the title, must fall before it, for it is general in its application. While it is intended as a guard against the bad in legislation, it is also intended as a herald of the true intent and purpose of the law. It is not within the power of the courts to declare a law which is passed in contravention of this mandate wholesome because it is so. If this power were exercised, it would result in a direct violation of the constitutional\n\nmandate and a usurpation of the functions of the legislature on the part of the courts. Laws would be sustained or defeated by considerations of present policy rather than by reference to the constitution.\"\n\nThe question and decision in Potter v. Whatcom County, 138 Wash. 571, 245 P. 11, is explained in the following quotation:\n\n\"Subsequently, and before the bridge collapsed, the act of 1923, took effect; but it is contended that the proviso which we have quoted and which is relied upon by the township, is unconstitutional because the title of the amendatory act is not broad enough to include the matters covered by the proviso. The title of the 1923 act is, 'An Act relating to townships and amending §§ 11369, 11375, 11376, 11378, 11404, 11433, 11441, 11445 and 11456 of Remington's Compiled Statutes' (Laws of 1923, ch. 13, p. 14), and contains no reference to counties, their duties or liabilities; and yet the office of the proviso quoted is to place the whole responsibility for bridges costing in excess of three hundred dollars upon the county. The constitutional provision, art. II, § 19, state constitution, seems clearly to have been disregarded, and under our prior holdings we have no choice but to hold the title of the amendatory act insufficient to give effect to the proviso quoted.\"\n\nIt was held in Blalock v. Condon, 51 Wash. 604, 99 P. 733:\n\n\"'An act relating to the defense of the statute of limitations in actions brought by or for the benefit of the state or any of its municipalities,' is clearly too narrow and restricted to admit of affirmative legislation fixing the time when an action by private parties shall be deemed commenced.\"\n\nThe case of National Ass'n of Creditors v. Brown, 147 Wash. 1, 264 P. 1005, called in question the constitutionality of chapter 264, p. 614, Laws of 1927, upon the ground that the title was insufficient under § 19, Art. II, of the state constitution. In passing, attention was called to the fact that certain titles to acts are construed liberally, and that the title need not be a complete index of the subject matter of the act. The title to the act read: \"An Act relating\n\nto the venue of civil actions in justice courts.\" In deciding the case, it was held:\n\n\"That title manifestly was a sufficient title for ch. 53, Laws of 1925, Ex. Ses., p. 48, for that act, as construed in Nichols v. National Association of Creditors, 137 Wash. 74, 241 P. 960, was purely a venue statute; but a casual inspection of the act of 1927 shows that it has to do with the question of jurisdiction. Its substantial provision is to the effect that, if a civil action is brought contrary to venue requirements of ch. 53, 'No jurisdiction over the defendant shall be acquired thereby, and no judgment shall be entered therein against such defendant.'\n\n\"'Venue' and 'jurisdiction' are entirely distinct matters, and one does not embrace the other. [Citing cases.] . . .\n\n\"From what we have heretofore said, we think it clearly appears that the title to the act is insufficient within the decisions of this court construing § 19, art. II of our constitution.\"\n\nThe title to the act construed in Slotemaker v. International Fruit \u0026 Produce Co., 156 Wash. 574, 287 P. 883, was: \"An act providing for the release of sureties on official bonds and undertakings.\" This court decided that the act was not broad enough to include indemnity bonds of compensated sureties for commission merchants, required for the protection of consignees by law.\n\nIn State ex rel. Washington Toll Bridge Authority v. Yelle, 32 Wash. 2d 13, 200 P.2d 467, we had for consideration the question of whether chapter 173, p. 654, Laws of 1937 (Rem. Rev. Stat., Vol. 7A, § 6524-1, et seq.) was sufficient to authorize the issuance of bonds to finance the establishment of a Puget sound ferry and toll bridge project. We held that the title,\n\n\"An Act relating to toll bridges; creating the Washington Toll Bridge Authority and providing for certain officers as members thereof; relating to the powers and duties of the Washington Toll Bridge Authority and certain officers; providing for the investigation, examination, survey, recognizance [reconnaissance], construction and operation of toll bridges; providing for the examination, survey, reconnaissance, construction and operation of toll tunnels; providing for the acquisition of property for toll tunnels, their approaches,\n\nand establishment; providing for the issuance and sale of bonds and the conditions, terms and redemption thereof; providing for the deposit and use of certain funds and revenues; defining terms; repealing acts and parts of acts in conflict; providing for constitutionality; and declaring an emergency,\"\n\nwas a restricted one, could not be liberally construed, and was insufficient to include the subject of financing ferries. Our conclusion was worded as follows:\n\n\"We are further of the opinion that the term 'ferry connections,' as used in the title of the 1945 act, is not sufficient to put a reasonably intelligent person on notice that the powers of the Washington toll bridge authority have purportedly become so enlarged, beyond the limited powers which it formerly possessed, under the 1937 act, that it can now acquire and operate a general water transportation system of the magnitude outlined in its recent resolution.\"\n\nInitiative measure No. 169 was attacked in Gilman v. State Tax Comm., 32 Wash. 2d 480, 202 P.2d 443. In passing upon the issues in that case, we held, without discussing the question, that the title to the act,\n\n\"An Act providing for the payment of additional compensation to veterans of World War II; establishing administrative procedures; authorizing the issuance and sale of state bonds and allocating the revenues thereof to a compensation fund; providing for the retirement of the bonds through the proceeds of a tobacco tax; making an appropriation and providing penalties,\"\n\nwas insufficiently broad to make the bonds provided for in the act a general obligation of the state.\n\n[6] These decisions indicate clearly that, without exception, statutes which cover or include several definite objectives, must mention those objectives in the title of the act. For instance, venue and jurisdiction are entirely different, and the mention of the one in the title of the act does not allow the act itself to govern the other. The mention of official bonds in the title does not permit legislation concerning bonds of commission merchants. The title to an act providing for the economical management of county affairs cannot include provisions reducing the salaries of county officers.\n\nAn act providing for the organization and government of irrigation districts is not broad enough to include validation of bonds and the levying of a tax. Situations such as these just mentioned could be called to mind indefinitely.\n\nApproved general titles, liberally construed, have been considered in cases which we cite below.\n\nIn In re Rafferty, 1 Wash. 382, 25 P. 465, our court made the following statement:\n\n\"Petitioner further contends that § 7 of the act found at page 100, Session Laws 1889-90, dispensing with grand juries unless ordered by the judge, is void, as not being within the title to the act, which only relates to proceedings by information, and he also claims it is another and distinct subject. . . . but we are all of the opinion the section of the act referred to is within the title, as in providing for proceedings by information the necessity for a grand jury was dispensed with, and the same act, consequently, could very well provide grand jurors should not be summoned, except in the contingency there mentioned. Nor does it bring another subject into the act in the sense contemplated by the constitutional provision referred to, it not being within the spirit or reason of the prohibition. The subject being in relation to prosecutions for crimes, the matters there legislated upon were all properly included in the act.\"\n\nMarston v. Humes, 3 Wash. 267, 28 P. 520, was a case brought to determine the validity of an act entitled, \"An act relating to pleadings in civil actions, and amending §§ 76, 77 and 109 of the Code of Washington of 1881.\" In that case, the court interpreted the word \"subject\" in a broad sense and said the title was sufficient, and quoted from Cooley on Constitutional Limitations, p. 144, to the effect that the generality of a title is not objectional so long as it is made to cover the legislation itself. Thus the court intimated that it is the legislature who decides the scope of an act and the court must take its information from such title to determine if a certain proceeding or action is within the intended scope.\n\nAppellant in State v. Blaine, 64 Wash. 122, 116 P. 660, challenged the title to an act which read:\n\n\"An act relating to crimes and punishments and the rights and custody of persons accused or convicted of crime, and repealing certain acts.\"\n\nIt was contended that the title was not broad enough to cover a section of the act which had to do with the admission of evidence. The court said the title was broad enough and then quoted from Marston v. Humes, supra :\n\n\"'Again, it would hardly be contended that it is not competent under the provision in question for the legislature to enact as a single law a code of civil procedure, and that an act entitled \"An act to provide a code of civil procedure\" would be invalid, yet under this subject innumerable subheads and subjects can easily be carved out. Such title is good because the legislature has seen fit to take a comprehensive subject which can properly cover all of such subjects. If the legislature can thus by a name sufficiently comprehensive embrace all the subjects properly relating to civil procedure, it must follow that by adopting a subject sufficiently general it can embrace in one act all the statute law of the state. In other words, the legislature may adopt just as comprehensive a title as it sees fit, and if such title when taken by itself relates to a unified subject or object, it is good, however much such unified subject is capable of division.'\"\n\nCudihee v. Phelps, 76 Wash. 314, 136 P. 367, was an action instituted by the sheriff of King county to enjoin the county auditor from taking any action on a petition filed by a voter, under a statute providing for a recall election. His contention was that the title to the statute was misleading. We held that the title expressed the entire subject matter, and said that the title need not be an index to the act, but is sufficient if it indicates its substance and scope in such a manner as to put a person of ordinary intelligence upon notice and inquiry as to its provisions.\n\nHolzman v. Spokane, 91 Wash. 418, 157 P. 1086, cited and quoted from many of the early cases, some of which we have not mentioned. The question in this case had to do with the title to an act which read: \"An act relating to local improvements in cities and towns, and repealing certain acts and parts of acts.\" In passing, this court said:\n\n\"This court has always liberally construed the constitutional requirement that the subject-matter of an act of the legislature shall be expressed in its title, and has deferred to legislative discretion touching that requirement, except in cases of its plainest violation. The doctrine that all reasonable doubts as to the constitutionality of an act of the legislature should be resolved in favor of upholding the act has peculiar force in the solution of the question of whether or not the act has been in form constitutionally passed, because such a constitutional question has to do with legislative procedure.\"\n\nOne of the contentions in Duke v. American Cas. Co., 130 Wash. 210, 226 P. 501, was that the title was not broad enough to comprehend the subject matter. The title read: \"An act relating to insurance and repealing sections 6059-23 and 6059-27 of Remington \u0026 Ballinger's Annotated Codes and Statutes of Washington.\" This court concluded that the term \"insurance\" was sufficient to relate to the powers and duties of an insurance company, and stated and applied a liberal rule.\n\nThe appellant, in State v. Nelson, 146 Wash. 17, 261 P. 796, had been convicted of violating the game code, and urged that the title was not specific enough. In passing, it was stated:\n\n\"Concerning the first objection, it is to be noticed that the act contains no unusual features. It relates wholly to game animals, game birds, and game fishes, and provides for their protection and propagation. It is but an attempt on the part of the legislature to include in one general enactment all of the statutory law relating to a cognate subject. That the legislature may do this without violating the constitutional provision forbidding the inclusion in one act of more than one subject is generally held. Any rule that would forbid it would not only be contrary to the spirit of the constitutional provision, but would seriously embarrass the legislature.\"\n\nThe question in National Ass'n of Creditors v. Pendleton, 158 Wash. 137, 290 P. 987, was whether the title of the statute reading,\n\n\"An act relating to justice courts, fixing the venue of civil actions therein and the jurisdiction of justices of the peace\n\nin relation thereto, prescribing duties of justices of the peace, and repealing certain acts relating thereto,\"\n\nembraced more than one subject. Held:\n\n\"The title of the act recites that it relates to justice courts, fixes the venue of civil actions therein, and the jurisdictions of justices of the peace in relation thereto. The general subject is 'justice courts'; 'venue' and 'jurisdiction' are subordinate subjects under this general subject.\"\n\nWe then stated:\n\n\"In the case now before us, as stated, the generic title was used. In the case of National Association of Creditors v. Brown, 147 Wash. 1, 264 P. 1005, where it was held that the title of the act was not sufficient, such title was, 'An Act relating to venue of civil actions in justice court.' It was there held that jurisdiction of such courts was not embodied in the title. In that act, the legislature chose to use a restricted title, and not, as in the present case, the broader title of justice courts, which would include, as indicated, both jurisdiction and venue. The act does not offend against § 19, of art. II, of the constitution of this state, which provides that no bill shall embrace more than one subject and that shall be expressed in the title.\"\n\nIn Hemmi v. James, 164 Wash. 170, 2 P.2d 750, it was said:\n\n\"The next question is whether the title of the act of 1895 is sufficiently broad to include the office of justice of the peace. The title recites that the act is one to provide for township organizations and 'prescribing the duties and fixing the compensation of township officers.' In the body of the act, as already seen, a justice of the peace is made a township officer. There was no more necessity of naming in the title the office of justice of the peace than any other of the township officers. The act is comprehensive, and covers in detail township organization and government, and it would not be very inaccurate to say that it constitutes a code upon that subject. The title was obviously sufficient.\n\n\"The cases of Potter v. Whatcom County, 138 Wash. 571, 245 P. 11, and National Assn. of Creditors v. Brown, 147 Wash. 1, 264 P. 1005, are different. In the former, the act of the legislature related to townships and amended certain sections of the statute, and contained no reference to counties, their duties or liabilities; yet in the body of the act\n\nthere was a proviso which placed responsibility on the county for the cost of bridges in excess of three hundred dollars. In the second case, the title of the act used the word 'venue,' and it was held that this was not broad enough to cover 'jurisdiction.'\"\n\nThe title questioned in In re Peterson's Estate, 182 Wash. 29, 45 P.2d 45, read:\n\n\"An Act authorizing the incorporation of mutual savings banks, defining their powers and duties, and prescribing penalties for violations hereof.\"\n\nThe question was whether that title was broad enough to include a section on joint tenancies. In passing upon the question, it was held:\n\n\"It thus appears that the title is general and comprehensive. No elaborate statement of the subject of an act is necessary to meet the requirements of the constitutional provision. A few well-chosen words, suggestive of the general subject stated, is all that is necessary. State ex rel. Seattle Electric Co. v. Superior Court, 28 Wash. 317, 68 P. 957, 92 Am. St. 831. Such a title to the act as this one should be liberally construed, and in deference to legislative discretion on the subject, acts shall not be construed as void, as violating the constitution, unless they are so beyond any reasonable doubt. [Citing cases.]\n\n\"A title to an act may be as broad as the legislature sees fit to make it, and thereunder any specific legislation as to any subject relating to the general character thus broadly embraced in the title will be sustained. When, however, the legislature sees fit to adopt a restricted title, and thereunder attempts to embrace provisions not fairly within such restricted title, such provisions cannot be given force, because it would have been convenient for the legislature to have adopted a more generic title and thereunder properly included all the provisions of the act.\"\n\nKlickitat County v. Jenner, 15 Wash. 2d 373, 130 P.2d 880, had to do with the question of whether the sales tax would have to be paid on courthouse construction. In deciding the case, it was held:\n\n\"Appellants also maintain that the amendatory acts of 1939 and 1941 violate Art. II, § 19, of the state constitution in that the titles do not express the subject matter. The material portions of the titles of the acts in question read:\n\n'An Act relating to taxation; amending sections . . . 5 . . . of chapter 180, Laws of 1935, . . . as amended. . . .' Chapter 225, Laws of 1939, p. 976. 'An Act relating to revenue and taxation; amending sections . . . 5 . . . of chapter 180, Laws of 1935, as amended. . . .' Chapter 178, Laws of 1941, p. 480.\n\n\"The sales tax, as applied to the construction of county courthouses, appellants say, is so far removed from the ordinary meaning of a retail sale that it cannot be deemed authorized by these titles, and they cite Petroleum Lease Properties Co. v. Huse, 195 Wash. 254, 80 P.2d 774, and DeCano v. State, 7 Wash. 2d 613, 110 P.2d 627.\n\n\"In each of those cases, a key word in the title of an amendatory statute had been given a definition within the body of the act broader than, and different from, its common, ordinary meaning. As the title did not indicate that this had been done, we held that it was deceptive and not in conformance with the constitutional requirement. Here, we have a very different situation, as neither of the key words of the statutes now under consideration, namely, 'taxation' and 'revenue,' is defined in the body of either act. In the DeCano case, we said, p. 627:\n\n\"'The legislature may, if it chooses, adopt a very broad and comprehensive title in a bill, in which case great liberality will be indulged to hold that any subject reasonably germane to such title may be embraced within the body of the bill. If, however, the legislature sees fit to use a restricted title, in which the language is of specific, rather than generic, import, the title will not be regarded so liberally, and provisions of the bill not fairly embraced therein cannot be given force.'\"\n\nOne of the questions presented in Randles v. Washington State Liquor Control Board, 33 Wash. 2d 688, 670, 206 P.2d 1209, was whether the title to initiative No. 171 was sufficient to meet the requirements of Art. II, § 19. A claim was made that the title of the act was defective, in that it made no reference to taxes or discounts in favor of certain holders of licenses. We held the title was proper, in that it related to the control and regulation of the preferred license holders. In so deciding, it was stated:\n\n\"A title does not need to be an index to the contents of a measure. The purpose of a title is to call attention to the subject matter of the act, so that any one reading it may\n\nknow what matter is being legislated upon, and is sufficient when it is broad enough to accomplish that purpose. All incidentals germane to a title may be brought within the legislation although not specifically referred to in such title.\" (Italics ours.)\n\nThe titles considered in the cases just cited were general -- that is, they referred to the purpose to be obtained in a broad sense, without any attempt to break down the various parts of the act and indicate the definite manner of attainment. The titles were made comprehensive by embracing a variety of related or unified subjects under a general statement. They have wholly related to a definite subject.\n\nFrom the holdings in these cases we restate the rule as follows:\n\n[7] Titles to statutes may be general or restrictive; or, in other words, broad or narrow, since the legislature in each case has the right to determine for itself how comprehensive shall be the object of the statute. And it also has a wide discretion in the particularity of the title selected to express it, provided that, by a fair construction, such title complies with the constitutional provision in question.\n\n[8, 9] A general title may be said to be one which is broad and comprehensive, and covers all legislation germane to the general subject stated. It is not an objection that it covers more than the subject of the body of the act, but it must not, in any event, cover less. It is not necessary that it index the details of the act, or give a synopsis of the means by which the object of the statute is to be accomplished. All matters which are germane to the subject may be embraced in one act. Under the true rule of construction, the scope of the general title should be held to embrace any provision of the act, directly or indirectly related to the subject expressed in the title and having a natural connection thereto, and not foreign thereto. Or, the rule may be stated as follows: Where the title of a legislative act expresses a general subject or purpose which is single, all matters which are naturally and reasonably connected with it, and all measures which will, or may, facilitate the accomplishment\n\nof the purpose so stated, are properly included in the act and are germane to its title.\n\n[10] On the other hand, a restrictive title is one where a particular part or branch of a subject is carved out and selected as the subject of the legislation. If the legislature seeks this method, and notwithstanding a general title could have been adopted which would have covered the entire subject and authorized legislation upon the whole of it, the body of the act must be confined to the particular portion of the subject which is expressed in the limited title. The courts cannot enlarge the scope of the title. They are invested with no dispensing power. The constitution has made the title the conclusive index to the legislative intent as to what shall have operation. It is no answer to say that the title might have been more comprehensive, if, in fact, the legislature has not seen fit to make it so.\n\n[11] The title to the act here being considered meets the requirements of our constitution, as those requirements have been stated in the rule. The subject is made general in content and subject matter. It refers to and embraces a general subject or purpose which is single, and all matters naturally and reasonably connected with it.\n\nRespondent contends that the title here is no different from that considered in the Gilman case. There is a great difference, in that the act considered in the Gilman case attempted to impose on the state a general obligation without any reference whatever to it in the title to the act. Moreover, the title in the cited case was restrictive in character and commanded a strict construction. Here we have a simple, well-worded, general title that requires a liberal construction. Aside from that consideration, it does not attempt to in any way mislead the legislator who voted for it, the governor who signed it, or the people who will be bound by its provisions.\n\nThe next objection made to the act is that it adopts, or changes, certain acts without setting those acts out in full as commanded by Art. II, § 37 of our constitution.\n\n\" Sec. 9. For the purpose of creating the fund for the retirement of said bonds upon maturity and the payment of\n\ninterest thereon as it falls due, all proceeds hereafter received from the excise tax on cigarettes imposed by Title XII (sections 82 to 95, inclusive), chapter 180, Laws of 1935, as now or hereafter amended, shall, so long as any part of principal or interest of the bonds herein provided for remains outstanding, be paid into the War Veterans' Compensation Bond Retirement Fund hereinafter provided for. In addition thereto, there is hereby levied and there shall be collected by the Tax Commission from the persons mentioned in and in the manner provided by Title XII (sections 82 to 95, inclusive), chapter 180, Laws of 1935, as now or hereafter amended, an excise tax upon the sale, use, consumption, handling or distribution of cigarettes in an amount equal to one cent (1cent) upon each ten cents (10cents) or fraction of the intended retail selling price thereof, but the provisions of subsection (f), section 82 chapter 180, Laws of 1935, allowing dealers' compensation for affixing stamps shall not apply to this additional tax. All money derived from such tax shall be paid to the State Treasurer and credited to a special trust fund to be known as the War Veterans' Compensation Bond Retirement Fund, which shall be kept segregated from all money in the State Treasury and shall, while any of the bonds herein authorized or any interest thereon remain unpaid, be available solely for the payment thereof. . . .\" (Italics ours.)\n\nThe parties to this appeal admit that the first reference to Title XII does not violate any constitutional provision.\n\n[12] Our general rule, reflected in many of our opinions, is: A new section to an original act cannot be added by reference and comply with the constitutional provision. If an act is not complete in itself, but is clearly amendatory of a former statute, it falls within the constitutional prohibition. Whether or not it purports on its face to be amendatory or an independent act, is immaterial. Copland v. Pirie, 26 Wash. 481, 67 P. 227, 90 Am. St. 769; State ex rel. Gebhardt v. Superior Court, 15 Wash. 2d 673, 131 P.2d 943.\n\nRespondent contends that Gebhardt v. Superior Court, supra, and Swedish Hospital v. Department of Labor \u0026 Industries, 26 Wash. 2d 819, 176 P.2d 429, compel affirmance of the trial court's judgment in so far as this phase of the\n\ncase is concerned. The cases just cited, however, do not add to, or detract from the rule which we have just stated.\n\n[13] It appears to us that this is a reference statute -- that is, it is a statute which refers to, and adopts by reference, the pre-existing statutes, and makes them applicable to this legislation. This conclusion is supported by our decisions in State v. Rasmussen, 14 Wash. 2d 397, 128 P.2d 318, and State ex rel. Washington Toll Bridge Authority v. Yelle, 32 Wash. 2d 13, 200 P.2d 467.\n\nIn the first case, it appears that the legislature by chapter 5, Laws of 1919, § 15, p. 25 (Rem. Rev. Stat., § 10109), passed an act which made it a crime to practice chiropractic without complying with the provisions of the act, and provided that any person violating those provisions should be guilty of a misdemeanor. The act created a state board of chiropractic examiners, who were to be appointed by the governor, and gave it power to conduct examinations and issue and revoke licenses, along with authority to enforce regulations imposed by it. By the Laws of 1921, chapter 7, § 135, p. 68 (Rem. Rev. Stat., § 10893), the legislature abolished that board. The new section provided:\n\n\"From and after the thirty-first day of March, 1921, the following offices, boards, commissions, bureaus, and departments of the state government heretofore created by law shall be and are hereby abolished, viz.: . . . the state board of chiropractic examiners, . . .\"\n\nThen it was provided by § 96(1) of that chapter (Rem. Rev. Stat., § 10854), that:\n\n\"The director of licenses shall have the power, and it shall be his duty:\n\n\"(1) To exercise all the powers and perform all the duties now vested in, and required to be performed by, . . . the state board of chiropractic examiners. . . .\"\n\nIt was urged in that case that the act of 1921, substituting the office of director of licenses for the state board of chiropractic examiners, was an attempt to amend the former law and was unconstitutional under the provisions of Art. II, § 37, of our constitution. The conclusion we reached in that\n\ncase was that statutes which refer to other statutes and make them applicable to the subject of the legislation, may be called reference statutes.\n\n[14] Reference statutes do not come within the constitutional prohibition. The rule is well stated in State ex rel. Toll Bridge Authority v. Yelle, supra, as follows:\n\n\"It is generally recognized that certain types of enactments, designated by the courts as 'reference statutes,' are not within the restrictions contemplated by Art. II, § 37, of the constitution. State v. Rasmussen, 14 Wash. 2d 397, 128 P.2d 318; 50 Am. Jur. 195, Statutes, § 215.\n\n\"Reference statutes are those statutes which refer to and by reference adopt wholly or partially, pre-existing statutes, or which refer to other statutes and make them applicable to an existing subject of legislation. 36 Words \u0026 Phrases (Perm. ed.) 618.\n\n\"In State v. Rasmussen, supra, the purpose, use, and effect of such statutes are described in language quoted from 25 R. C. L. 907, § 160, as follows:\n\n\"'\"Statutes which refer to other statutes and make them applicable to the subject of the legislation are called 'reference statutes.' Their object is to incorporate into the act of which they are a part the provisions of other statutes by reference and adoption. Reference statutes are of frequent use to avoid encumbering the statute books by unnecessary repetition, and they have frequently been recognized as an approved method of legislation, in the absence of constitutional restrictions. . . . When in one statute a reference is made to an existing law, in prescribing the rule or manner in which a particular thing shall be done, or for the purpose of ascertaining powers with which persons named in the referring statute shall be clothed, the effect generally is not to revive or continue in force the statute referred to for the purposes for which it was originally enacted, but merely for the purpose of carrying into execution the statute in which the reference is made.\"'\n\n\"See, also, 50 Am. Jur. 57, 58, Statutes, §§ 36, 37, 38; Notes (1930), 67 A. L. R. 564 et seq.\n\n\"In Pacific First Federal Sav. \u0026 Loan Ass'n v. Pierce County, 27 Wash. 2d 347, 178 P.2d 351, this court said, with reference to such statutes:\n\n\"'Courts are unanimous concerning the primary legal effect of the statutory reference whenever an act of the legislature brings into itself, by reference, the terms of another\n\nact. The precepts and terms to which reference is made are to be considered and treated as if they were incorporated into, and made a part of the referring act, just as completely as if they had been explicitly written therein. [Citing cases.]'\"\n\nA second reference to the laws of 1935 simply indicates the persons from whom the tax shall be collected and the manner or method of making collections. The last reference states the fact that the law for affixing stamps, as provided for in the act of 1935, shall not apply to the additional tax imposed by this act. The second reference does not amend the former act, but includes and makes it a part of this act. The reference adopts the provisions of the older act and makes it a portion of the present statute. The last reference accomplishes the same purpose and, in addition, is, to a certain extent, surplusage, because if we found it contrary to our constitutional provision, it would not affect, or render invalid, the present law.\n\nThe next challenge to the constitutionality of the act is predicated upon the theory that it violates Art. VIII, § 5, of our state constitution, which reads:\n\n\"Credit Not to be Loaned. -- The credit of the state shall not, in any manner, be given or loaned to or in aid of any individual, association, company, or corporation.\"\n\nRespondent contends that the whole tenor and purpose of the act is to raise the sum of eighty million dollars, or more, which in turn is to be given as a \"bounty\" or \"bonus\" or \"adjusted compensation\" to certain private individuals or groups of individuals. The question presented, in so far as it affects acts of the character here reviewed, is of first impression in this state.\n\nIn State ex rel. Hart v. Clausen, 113 Wash. 570, 194 P. 793, 13 A. L. R. 580, this court declared that a bonus similar to the one before the court at the present time was constitutional. However, the question before us in that case was whether or not the tax levied was for a public or private purpose. There, we held that there was a moral and honorable claim upon the public treasury, and although\n\nthere was no debt which could obtain recognition in a court of law or equity, it was a basis for the exercising of the taxing power. See also, State ex rel. Reclamation Board v. Clausen, 110 Wash. 525, 188 P. 538, 14 A. L. R. 1133.\n\nState ex rel. Hart v. Clausen, 117 Wash. 260, 201 P. 30, was another attack upon the act considered in the first Clausen case. This court again held the act constitutional.\n\nState ex rel. Collier v. Yelle, 9 Wash. 2d 317, 115 P.2d 373, had to do with an act relating to public highways. This court held that that portion of the act which directed that part of the proceeds of the gasoline tax allocated to the motor vehicle fund should be appropriated to the payment of unpaid Aurora avenue assessments and to the reimbursement of individuals who had paid the assessments, was within the prohibition of constitutional provision Art. II, § 28, subd. 10, which provides that the legislature shall not enact any private or special laws releasing or extinguishing the indebtedness of any person or corporation to the state or any municipal corporation therein. It will be noted that Art. VIII, § 5, and Art. II, § 28, of our state constitution are similar in purpose. One prohibits the giving of credit to individuals, and the other prohibits the releasing or extinguishing of the indebtedness, liability, or other obligation of any person or corporation owing to the state. In none of these cases was it urged that Art. VIII, § 5, applied.\n\nThe respondent bases his contention principally upon the decision of the court of appeals of the state of New York in People v. Westchester County Nat. Bank, 231 N. Y. 465, 132 N. E. 241, 15 A. L. R. 1344. This case is directly in point and upholds respondent's point of view. The constitution of the state of New York provided:\n\n\"The credit of the state shall not in any manner be given or loaned to or in aid of any individual.\" Art. 7, § 1.\n\n\"Neither the credit nor the money of the state shall be given or loaned to or in aid of . . . any private undertaking.\" Art. 8, § 9.\n\nIn 1920, the legislature of the state of New York passed an act which provided for the issuance of state bonds to raise\n\na fund with which to pay a bonus to persons who had served in the military or naval service of the United States in the first World War, and who, at the time of entering service, were residents of the state of New York. After a thorough discussion of the question, which included the citation and consideration of many cases, the court held that the act was prohibited by the constitution of the state of New York. During its discussion, the court called attention to our holding in the first Hart v. Clausen case. However, in doing so, they neither approved or disapproved the holding of this court.\n\nThe attorney general has called our attention to a case which is also directly in point, that being Grout v. Kendall, 195 Iowa, 467, 192 N. W. 529. In that case, the issue of lending credit was before the court, the same as it was in the New York case. The constitutional provision was identical with that of the New York constitution cited by respondent. The Iowa court held that the state's incurring of a primary indebtedness to pay a bonus was not within the prohibition of the article mentioned. Speaking of the constitutional provision, the court said:\n\n\"The section does not, in terms, purport to deal with the creation of primary indebtedness by the state for any purpose whatsoever. The prohibition is that the state shall not lend its credit to any other being whatever, and that it shall 'never assume' the debts or liabilities of any other being whatsoever. Omitting now all reference to the closing proviso, is there a distinction to be observed between a loan of credit and the power of the constituted authorities of the state to create a primary indebtedness to subserve some public purpose or in response to some moral obligation? This section is not qualified in terms by any subsequent section. When we define its field, its prohibition is supreme therein and irrevocable. . . .\n\n\"We hold, therefore, that the prohibition of Section 1, Article 7, has no reference to the creation of a primary indebtedness. It necessarily follows that the power to create such an indebtedness and the limitations thereon must be sought in other sections of the Constitution.\"\n\nSpeaking of the appellant's contention that the proposed issue of bonds by the state for the purpose of paying a bonus was a loan of credit, it was decided:\n\n\"The argument is that the issue of a bond is an extension of credit. A bond is a credit. It is urged that, when the state borrows money upon its bonds for the purpose of paying the same to the beneficiaries of the act, it loans its credit to such beneficiary; because, without the credit of the state, the beneficiary could not obtain the money at all.\n\n\"The argument is not sound. The beneficiary is not a debtor at all. He sustains no relation of liability to the bondholder, either primary or secondary. The state recognizes the beneficiary as in the nature of a creditor, to whom the state proposes to pay its recognized obligation. The state becomes debtor to the bondholder under a primary liability, and not a secondary one. Neither legislator nor voter is beguiled by any delusion that the bonds will be paid by someone else as a primary debtor. In voting the appropriation, both legislator and voter frankly face the constitutional necessity of an immediate tax levy, to meet the obligation thus assumed. This necessity is the practical safeguard of the Constitution, to compel legislator and voter to a thoughtful consideration of the expediency of the proposed appropriation. No more efficient safeguard could well be devised without unduly interfering with the exercise of the inherent power of the people of the state.\"\n\nTo our minds, the holding of the supreme court of the state of Iowa is more convincing than is the holding in the New York case. In the Iowa case, the court simply determined the meaning of the constitutional provision according to the plain wording and intent of its sections.\n\n[15] The credit of the state of Washington is not given to, or in aid of, the recipients of the state's bounty under chapter 180, Laws of 1949. The bonds authorized by the act are to be sold to the purchasers on the market. The money thus received becomes that of the state and is held subject to the provisions of the act. It may not be paid to, or in aid of, any individual unless that individual has rendered service to his country in time of war. The funds raised by the sale of bonds are not to be given away. They are to be paid for services rendered.\n\nThe payment of a compensation or bonus to veterans has been held to be for a public purpose and undertaking. The purpose and undertaking is to supplement the pay of the veterans, and thereby\n\n\". . . encourage the spirit of loyalty and patriotism and so promote the public good by affording visible evidence that hereafter, if there should be a call for men, the commonwealth would not forget those who had served its cause.\"\n\nIn the past, courts have upheld statutes which have provided: (1) bounties for soldiers (see 7 A. L. R. 1636); (2) the issuance of bonds for the purpose of constructing a memorial to the soldiers and sailors of the first World War (Hill v. Roberts, 142 Tenn. 215, 217 S. W. 826); and (3) money for relief of distress due to general unemployment or other unusual conditions (see 73 A. L. R. 699).\n\nAfter a thorough consideration of the act, and its relation to Art. VIII, § 5, of our constitution, we hold that the act does not violate the provision of the section just mentioned.\n\nRespondent maintains that the tax imposed by the act upon the distribution of cigarettes as opposed to the distribution of other tobacco or kindred products, is a discriminatory, unreasonable, and arbitrary classification, in violation of the fourteenth amendment to the constitution of the United States, and Art. I, § 12, of the Washington state constitution, which reads:\n\n\"Special Privileges and Immunities Prohibited. -- No law shall be passed granting to any citizen, class of citizens, or corporation, other than municipal, privileges or immunities which, upon the same terms, shall not equally belong to all citizens or corporations.\"\n\n[16] The tax imposed by this act is an excise tax. An instructive case as to the definition of excise tax is Patton v. Brady, 184 U.S. 608, 619, 46 L. Ed. 713, 22 S. Ct. 493. In that case, the court had before it the validity of a stamp tax imposed on tobacco. In the opinion, the court followed definitions of excise tax as defined by Story, Constitution of the United States, § 953; Cooley, Taxation, p. 3; Bouvier's and Black's dictionaries; Webster's International dictionary; and\n\nthe Century dictionary. In speaking of the charge, the supreme court said:\n\n\"It is not a tax upon property as such but upon certain kinds of property, having reference to their origin and their intended use.\"\n\nIn Morrow v. Henneford, 182 Wash. 625, 47 P.2d 1016, an excise tax was defined as follows:\n\n\"An excise tax has been defined as one levied upon the manufacture, sale, or consumption of commodities within the country, upon licenses to pursue certain occupations, and upon corporate privileges. 1 Cooley on Taxation (4th ed.), § 42.\n\n\"It is defined by the supreme court of the United States to be an inland imposition, sometimes upon the consumption of the commodity and sometimes upon the retail sale; sometimes upon the manufacturer and sometimes upon the vendor. Pacific Ins. Co. v. Soule, 74 U.S. 433.\"\n\n[17] It can be stated that there is no constitutional limitation upon the selection by the legislature of the subjects for excise tax, so long as there is any reasonable basis for the classification whatsoever. The two quotations which follow contain previous holdings of this court in accordance with the statement just made:\n\n\"It is well settled law that the legislature may constitutionally classify persons with reference to their business, occupation or inheritance, with a view of exacting from them excise or privilege taxes differing in amount, or differing in that one class shall be taxed and another class shall be exempted, so long as there may be some reasonable basis for such classification, and so long as all in each class shall be taxed or exempted alike. [Citing cases.]\" State v. Hart, 125 Wash. 520, 217 P. 45.\n\n\"This being an excise tax, the legislature, under the 14th amendment to our state constitution, has very broad power, and we cannot interfere with that power except for arbitrary action, clear abuse, or constructive fraud appearing on the face of the act or from facts of which we may take judicial knowledge.\n\n\"'A very wide discretion must be conceded to the legislative power of the state in the classification of trades, callings, businesses or occupations which may be subjected to special forms of regulation or taxation through an excise or license\n\ntax. If the selection or classification is neither capricious nor arbitrary, and rests upon some reasonable consideration of difference or policy, there is no denial of the equal protection of the law.' Brown-Forman Co. v. Kentucky, 217 U.S. 563.\" State ex rel. Stiner v. Yelle, 174 Wash. 402, 25 P.2d 91.\n\nIn Puget Sound Power \u0026 Light Co. v. Seattle, 117 Wash. 351, 364, 201 P. 449, 207 P. 689, we adopted a statement from Chicago \u0026 Northwestern R. Co. v. State, 128 Wis. 553, 108 N. W. 557, which reads:\n\n\"'The discretion of the legislature in this field is so broad that it is not competent for the court to mark the constitutional limitations of it other than at the farthest one might go without transcending all reason.'\"\n\nIt is true that, in Collier v. Yelle, supra [at p. 329], it was stated, in referring to the gasoline tax and the fourteenth amendment:\n\n\"This, of course, refers to all taxes collected by the state, including property, excise, and all other taxes. The amendment, then, in scope covers all the state's power to levy taxes.\"\n\nThis statement, however, was dicta in that the questions before the court, outlined on page 321, made no reference whatever to the proposition above stated.\n\n[18] It is a universal practice to raise revenue by taxing tobacco products. Nearly every state in the Union levies a tax upon cigarettes, and these statutes have been upheld in many cases. From the cases to which we have referred, it must be concluded that there is no constitutional objection to this act because of the fact that the tax is levied on one group of tobacco users and not upon others. The selection is made as a matter of legislative discretion, and cannot be called in question by the courts. There is no contention, and there can be none in this case, that all cigarette users are not taxed uniformly, or that the tax is discriminatory as between various users or sellers of cigarettes.\n\n[19] Respondent also raises the point that the cigarette tax bears no relation to the object for which the tax is to be\n\nused. That excise taxes need bear no relation to the object for which the proceeds are to be expended, is well settled. See New York Rapid Transit Corp. v. New York, 303 U.S. 573, 82 L. Ed. 1024, 58 S. Ct. 721, and George E. Breece Lbr. Co. v. Mirabal, 34 N. M. 643, 287 P. 699, 84 A. L. R. 827.\n\nThese questions are definitely concluded by our following holding in Texas Co. v. Cohn, 8 Wash. 2d 360, 112 P.2d 522:\n\n\"The familiar rule that legislative classification, in order to come within constitutional limitations, must bear some reasonable relation to the object of the law in which it appears, originated in cases construing regulatory laws, where it has a natural and logical application. A statute prescribing a regulation in the exercise of the police power has a definite object which concerns the public health, safety, morals, or the like. If such a statute is not universal in its application, but applies only to a particular class, then, in order to satisfy constitutional requirements the regulation of those within the class, as distinguished from those excluded therefrom, must tend to accomplish the object of the statute. When the rule is applied to a tax law, however, it should be done with due appreciation of the fact that usually the principal object of such a law, and very often the sole object, is to raise revenue for the support of the taxing government. Thus, the state may constitutionally tax one class and exempt other classes if the classification reasonably tends, in some lawful way, to facilitate the raising of revenue. . . .\n\n\"A state legislature has very broad discretion in making classifications in the exercise of its taxing powers. A classification of commodities, businesses, or occupations, for excise tax purposes, under which the classes are taxed at unequal rates, or one class is taxed and another is exempted, will be upheld as constitutional if it is not arbitrary nor capricious and rests upon some reasonable basis of difference or policy. The difference between the classes need not be great. It may consist of physical and chemical dissimilarity of commodities or difference in the character or manner of their uses. Classification may also be permissible if it is reasonably related to some lawful taxing policy of the state, such as greater ease or economy in the administration or collection of a tax, the selection of a fruitful source of revenue with the exemption of sources less promising, or the equalization of the burdens of taxation. If any such reasonable\n\nbasis for the classification exists, or conceivably may exist, then the circumstance that there is competition between a commodity or business which is taxed and some commodity or business which is not taxed, does not materially affect the validity of the classification.\"\n\nIt is our conclusion, based upon the decisions just cited, that it was within the discretion of the legislature to impose a tax upon cigarettes without imposing a tax upon other tobacco products, and, the legislature having exercised its discretion, it is not within the province of the court to hold otherwise.\n\n[20] The attorney general admits that a portion of § 7, chapter 180, is unconstitutional because it attempts to make the bonds issued under the act a legal investment for the permanent school fund. The first amendment to our state constitution provides:\n\n\"Investment of School Fund. -- None of the permanent school fund of this state shall ever be loaned to private persons or corporations, but it may be invested in national, state, county, municipal, or school district bonds.\"\n\nIt was clearly the intent of the people to limit the investment of the school fund in general obligation bonds of the nation, state, county, municipality, or school districts.\n\n[21] However, the holding of this portion of the act invalid does not affect the balance of the act. There are two reasons for so holding. This provision for the investment of school funds is entirely independent of the other provisions in the act, and the balance of the act is capable of being executed in accordance with the legislative intent wholly independent of the portion eliminated. This ruling is in accord with the holdings made in the following cases: Oregon R. \u0026 Nav. Co. v. Smalley, 1 Wash. 206, 23 P. 1008, 22 Am. St. 143; State ex rel. Lindsey v. Derbyshire, 79 Wash. 227, 140 P. 540; Swanson v. School Dist. No. 15, 109 Wash. 652, 187 P. 386; Sherman Clay \u0026 Co. v. Brown, 131 Wash. 679, 231 P. 166; State v. Nelson, 146 Wash. 17, 261 P. 796; and Morgan v. Department of Social Security, 14 Wash. 2d 156, 127 P.2d 686.\n\nThe other reason is that § 13 of the act provides:\n\n\"If any section or provision of this act shall for any reason be held invalid, such decision shall not invalidate the remaining portions of this act.\"\n\nThe effect of portions of acts such as the one just set out has been construed by this court in State ex rel. Davis-Smith Co. v. Clausen, 65 Wash. 156, 117 P. 1101, 37 L. R. A. (N.S.) 466, as properly indicating the legislative intent to be that the act shall be enforced as far as may be, and that the legislative intent shall govern in the absence of other constitutional inhibitions.\n\nRespondent's next attack upon the act is based upon the claim that a debt is created against the state in defiance of §§ 1 and 3 of Art. VIII of our state constitution. The sections read:\n\n\"§ 1. Limitation of State Debt. -- The state may, to meet casual deficits or failure in revenues or for expenses not provided for, contract debts, but such debts, direct and contingent, singly or in the aggregate, shall not at any time exceed four hundred thousand dollars ($400,000), and the moneys arising from the loans creating such debts shall be applied to the purpose for which they were obtained, or to repay the debts so contracted, and to no other purpose whatever.\"\n\n\"§ 3. Special Indebtedness, How Authorized. -- Except the debt specified in sections one and two of this article, no debts shall hereafter be contracted by or on behalf of this state, unless such debt shall be authorized by law for some single work or object to be distinctly specified therein, which law shall provide ways and means, exclusive of loans, for the payment of the interest on such debt as it falls due, and also to pay and discharge the principal of such debt within twenty years from the time of the contracting thereof. No such law shall take effect, until it shall, at a general election, have been submitted to the people and have received a majority of all the votes cast for and against it at such election, and all moneys raised by authority of such law shall be applied only to the specific object therein stated, or to the payment of the debt thereby created, and such law shall be published in at least one newspaper in each county, if one be published therein, throughout the state, for three\n\nmonths next preceding the election at which it is submitted to the people.\"\n\nSection 7 of the act provides for the sale of bonds in the sum of eighty million dollars for the purpose of paying compensation to veterans and expenses of administration.\n\nSection 9, as we have already indicated, imposes a tax upon the sale, use, consumption, handling, or distribution of cigarettes, in order to create a fund for the retirement of the bonds and the payment of interest thereon.\n\nCounsel for respondent argue that a study of certain decisions of this court demonstrates that\n\n\". . . none sanctions the contract authorized here, but on the contrary expressly recognizes that where the source is general taxation the constitutional debt limit applies.\"\n\nThe question, then, fairly presented is: Does the four-hundred-thousand-dollar debt limit apply?\n\n[22] The recognized principle which applies is well stated in 49 Am. Jur. 280, States, Territories, and Dependencies, § 67:\n\n\"Obligations Payable from Special Funds. -- Although the cases are not entirely in accord and dissenting opinions have been frequent, it has generally been held that an obligation payable from a special fund created by the imposition of fees, penalties, or excise taxes, and for the payment of which the general credit of the state is not pledged and resort may not be had to property taxation, is not a debt within the meaning of constitutional debt limitations. Such a limitation applies solely to that arising from a general levy and not excise taxes.\"\n\nThis court has not passed upon the exact question presented here. However, we have approved the principle stated above in several cases to which we shall now refer.\n\nIn 1893, the legislature passed an act which created a fund known as the state capitol building fund, into which fund was to be paid the proceeds of all moneys derived from the sale of state lands granted to the state of Washington by the Federal government for the purpose of erecting public buildings. The act was attacked in Allen v. Grimes, 9 Wash. 424, 37 P. 662, upon the ground that it violated the provisions\n\nof Art. VIII of the constitution. The court held, however, that the money was actually derived from the sale of the lands granted by the government and that a warrant drawn on the fund did not create a debt against the state.\n\nIn State ex rel. Capitol Comm. v. Lister, 91 Wash. 9, 156 P. 858, it was held that an act providing for bonding the capitol building lands for $1,500,000, the principal to be payable only from the capitol building fund derived from the sale of land, and which provided for the levy of an annual tax sufficient to meet the interest on the bonds, the same to be deemed a loan from the general fund and repaid from the proceeds of the sales or leases of capitol building lands, was unconstitutional, as it created a debt for such interest charges within the meaning of Art. VIII of our constitution.\n\nIn 1917, the legislature provided for a one-half mill property tax, levied to raise money for capitol building purposes. The act provided that the money raised should be charged against the land grant for capitol purposes to the state from the Federal government, and as moneys were derived from the sale, lease, or other disposition of the land grant, the obligation should be repaid. In 1925 the legislature, by chapter 27, appropriated four million dollars for building purposes. These acts were attacked in State ex rel. Capitol Comm. v. Clausen, 134 Wash. 196, 235 P. 364. It was held that the legislative acts under discussion expressly provided that the principal and interest of the bonds authorized should be payable from revenues from the lease and sale of granted lands, and that in no way was the credit of the state involved, and that not one dollar of its general property could be used to discharge the bonds or the interest on them.\n\nThe following cases determine that the source of the revenue is not the determinative factor in ascertaining whether or not a certain tax or appropriation comes within the bar of the constitutional provision to which we have just referred.\n\nIt appears in Comfort v. Tacoma, 142 Wash. 249, 252 P. 929, that the question was raised as to whether bonds issued\n\nunder the provisions of the local improvement guaranty law became a debt of the city. It was decided that the obligation of the city was no more than a contingent liability, and not a general obligation of the municipality.\n\nAjax v. Gregory, 177 Wash. 465, 32 P.2d 560, was an action to determine the constitutionality of the liquor act passed in 1932-33. Concerning Art. VIII, this court stated:\n\n\"Article VIII of the constitution of this state places a limitation upon state indebtedness, but the provisions of this act in no way conflict with such limitations. As already pointed out, the act expressly provides that all expenses arising under the administration thereof shall be paid from the liquor revolving fund, and that each bond and the interest coupon attached shall show on its face\n\n\"'. . . that it is payable solely from the liquor revolving fund and not otherwise, and that neither the state of Washington nor the board nor any member thereof shall incur any liability or obligation by reason of the authority granted in this section.'\n\n\"Under those provisions, there is not created any state indebtedness within the contemplation of the constitution.\"\n\nIt then held that there was no difference between the case decided and that of State ex rel. Capitol Comm. v. Clausen, supra.\n\nOn several occasions, we have held that Art. VIII, § 6, of our constitution, relative to the debts of municipal corporations, has no application in those cases in which the general credit involving property is not pledged, or where the obligations are to be paid from special assessments.\n\nIn Winston v. Spokane, 12 Wash. 524, 41 P. 888, this court held:\n\n\"It will be seen that the sole question presented for our consideration is as to whether or not the ordinance in question, the contract to be executed in pursuance thereof, or the obligations provided for in said contract, will create an indebtedness of the city within the meaning of the provisions of the constitution. . . .\n\n\"In our opinion, the ordinance, construed in the light of the facts stated in the complaint and the answer thereto, was a valid one, and that the contract provided for therein when entered into would be binding as against the city, for\n\nthe reason that the obligations to be issued in pursuance thereof would not constitute an indebtedness within the meaning of the constitutional provision.\"\n\nAgain, in Potter v. Whatcom, 25 Wash. 207, 65 P. 197, we stated:\n\n\"In line with these cases may be cited the cases holding that a municipality, where it contracts for a street improvement by the terms of which payment for the improvement is to be made out of a special fund created by assessment upon the property benefited, does not incur a debt, within the meaning of the constitutional provision prohibiting municipalities from incurring an indebtedness in excess of one and one half per centum of the assessed value of the taxable property within its jurisdiction. Baker v. Seattle, 2 Wash. 576 (27 P. 462); Soule v. Seattle, 6 Wash. 315 (33 P. 384, 1080); Winston v. Spokane, 12 Wash. 524 (41 P. 888); Faulkner v. Seattle, 19 Wash. 320 (53 P. 365); Fogg v. Town of Hoquiam, 23 Wash. 340 (63 P. 234).\"\n\nAccord: Comfort v. Tacoma, 142 Wash. 249, 252 P. 929; Jones v. Hammer, 143 Wash. 525, 255 P. 955.\n\nThat excise taxes were not within the purview of the constitutional concept of debt is indicated by the statements made in the following cases concerning them:\n\n\"Our constitution does not expressly mention such taxation, and, as that instrument is not a grant of power, but a limitation of power inherent in the state, independent of that instrument, it follows that this tax must be declared valid, unless the legislature was indirectly and by necessary implication prohibited from authorizing it to be levied by some provision of the constitution.\" State v. Ide, 35 Wash. 576, 77 P. 961, 102 Am. St. 914, 67 L. R. A. 280.\n\n\"As we have seen, our constitution does not directly or indirectly, prohibit the imposition of a per capita tax, therefore the case of State v. Ide, supra, is absolutely controlling upon the point now under discussion.\" Nipges v. Thornton, 119 Wash. 464, 206 P. 17.\n\nAgain, in State v. Sheppard, 79 Wash. 328, 140 P. 332, it was pointed out that excise taxes are not mentioned or considered in the constitution, and that, therefore, they are enacted by virtue of the inherent power of the legislature, unrestrained by constitutional limitation.\n\nWith this background, we now call attention to numerous cases from sister states which deal with the question presented here.\n\nThe Oregon constitution limits debts and liabilities to fifty thousand dollars. In 1933, the legislature created a state relief committee, and at the same session a law was enacted creating a state unemployment relief fund. These funds were to be expended by the state relief committee with the consent of the governor. At a second special session of the legislature in 1933, the Oregon liquor control act was enacted, which provided that all moneys collected by the commission administering the act, with the exception of license fees, should be deposited in the general fund of the state to the credit of the Oregon state liquor commission account. The liquor control act provided for the collection of certain fees or taxes from manufacturers, users, and retailers of all intoxicating liquors. It was also provided that certain portions of the fund should be paid for unemployment relief. At the same special session, the legislature appropriated the sum of three million dollars from the net proceeds of revenues to be raised from the manufacture, sale, distribution, taxing, or licensing of liquor. The act also empowered the state treasurer to borrow such amounts as necessary to pay all lawful claims filed against the unemployment relief fund. The certificates were made payable solely from the revenue to be derived from the liquor tax. The supreme court of Oregon, in Moses v. Meier, 148 Ore. 185, 35 P.2d 981, referred to the Oregon constitution and the statutes, and said:\n\n\"From the above statutory provisions it is clear that these certificates of indebtedness drawn on a special fund and to be paid solely from anticipated revenue derived from the manufacture and sale of alcoholic beverages are not general obligations of the state. In the event the anticipated profits do not materialize and the fund becomes exhausted, the purchaser of such certificates has no legal redress against the state. He must look solely to the fund upon which they are drawn. Whether there would be a moral obligation to redeem such certificates of indebtedness is a matter with which this court is not concerned. Suffice it to say there is\n\nno legal obligation to do so in the event the special fund is exhausted.\n\n\"Does this legislative act authorizing the issuance and sale of certificates to secure money for the purpose of relieving the suffering and distress of the unemployed transcend the Constitutional limitation against indebtedness? Article XI, section 7, of the Constitution, was enacted by the people as a protection against burdensome and excessive taxation. In the event the net revenues turned in to the relief fund are insufficient to redeem the certificates of indebtedness, there will be no additional tax burden by reason thereof for, as previously stated, there is no general obligation on the part of the state to redeem them. A 'debt' within the meaning and purview of the Constitutional provision in question is that which the state in any event is bound to pay: Alabama State Bridge Corporation v. Smith, 217 Ala. 311 (116 So. 695).\"\n\nThe supreme court of Kansas, in State ex rel. Boynton v. State Highway Comm., 138 Kan. 913, 28 P.2d 770, held that warrants issued by its highway commission to secure money borrowed from an agency of the Federal government did not constitute debts as mentioned in the constitution where the warrants were payable from the motor vehicle and motor fuel taxation fund. The court concluded that the constitution, which is similar to ours, in speaking of debts, referred only to those to be paid by general property taxes.\n\nThe constitution of New Mexico provides that the state may borrow money not to exceed the sum of two hundred thousand dollars in the aggregate to meet casual debt or failure in revenue or for necessary expenses. In 1934, the legislature of New Mexico passed an act authorizing the construction of an addition to the capitol building and imposing an additional fee upon civil actions filed in the district courts for the payment of interest and principal of debentures issued to provide the funds for the building.\n\nThe act was challenged in State ex rel. Capitol Addition Bldg. Comm. v. Connelly, 39 N. M. 312, 46 P.2d 1097, 100 A. L. R. 878. The issue in that case was whether the debentures, when issued, constituted a binding obligation on the state. The court held that the tax imposed\n\ndid not come within the debt limitation section of the constitution because the tax was not a property tax and was set aside into a special fund. The court analyzed its constitution, and decided that the taxes referred to therein were ad valorem or property taxes, and that the debt limitation sections must be applied only to those kinds of taxes. In construing the debt limitation, the court pointed out that it was not unusual to find words in the constitution used in a less comprehensive way than they were capable of bearing; that is, the word \"taxes\" as used in the constitutional guaranty of equality and uniformity did not apply to excise taxes. Concerning the term \"debt,\" the court said:\n\n\"'The idea of a \"debt\" in the constitutional sense is that an obligation has arisen out of contract, express or implied, which entitles the creditor unconditionally to receive from the debtor a sum of money, which the debtor is under a legal, equitable, or moral duty to pay without regard to any future contingency.' [ Seward v. Bowers, 37 N. M. 385, 24 P.2d 253.]\"\n\nThe constitution of the state of Colorado limits the public debt to one hundred thousand dollars. In 1935, the Colorado legislature enacted a law to provide ways and means whereby the state might procure from the Federal government an advance of not to exceed twenty-five million dollars to be used for the construction, supervision, and maintenance of public highways within the state of Colorado. At the same session, they passed a law providing for a highway department and gave it very broad powers by the exercise of which it could use the amount raised for the purpose mentioned in the highway act. The act provided for a contract between the state highway department and the Federal government, with the highway department issuing warrants to the government in exchange for money, and, further, that the highway department was to set up a sinking fund into which certain excise taxes were allocated for the purpose of paying the warrants. In Johnson v. McDonald, 97 Colo. 324, 49 P.2d 1017, an action was brought to enjoin the carrying out of the provisions of the statute. There were nine issues presented in the case, one of which claimed that the statute\n\ncreated a debt prohibited by the constitution. Concerning the debt limitation, the court said:\n\n\"We hold that the pledging of the future excise revenues making up the fund to pay the anticipation warrants provided by the acts in question does not create a debt prohibited by sections 3 and 4 of article XI of the Constitution. That the gasoline tax revenue is an existing revenue and not a new revenue is not a material or a controlling factor under the rule announced in Searle v. Town of Haxtun, supra [84 Colo. 494, 271 P. 629], permitting the pledge of existing revenue.\" (Italics ours.)\n\nIn other portions of the opinion, the court upheld the constitutionality of the act, the theory being that the special indebtedness created by legislative act was to be paid by a special fund secured by excise taxes, and was not a debt of the state of Colorado.\n\nIn 1883, an ordinance was passed by the city of Laredo, Texas, authorizing the issuance of bonds in the sum of seventy-five thousand dollars, payable in 1913. It was provided that the bonds should be styled \"city improvement bonds,\" and should be paid from certain taxes, fines, and other assessments. In the case of Laredo v. Frishmuth, 196 S. W. (Tex. Civ. App.), 190, the question presented was whether or not the ordinance incurred a debt contrary to the constitutional debt limitation. In its decision, the court of civil appeals said:\n\n\"It is the rule, well sustained by authority, that contracts may be made without incurring a debt within the meaning of the Constitution when the municipal corporation has cash in the treasury with which to meet the liabilities, or when the debt is made payable out of a special fund raised or to be raised. Galveston v. Heard, 54 Tex. 420; Dillon Mun. Corp. §§ 197, 198; State v. Neosho, 203 Mo. 40, 101 S. W. 99. The fact that such special fund is not in existence at the time when the bonds were issued does not make expenditures incurred on the credit of the fund and only payable therefrom an indebtedness in the purview of the Constitution. State v. Whatcom County, 42 Wash. 521, 85 P. 256; McNeal v. City of Waco, 89 Tex. 83, 33 S. W. 322. As said in the last-named case:\n\n\"'These constitutional provisions were intended as restraints upon the power of municipal corporations to contract that class of pecuniary liabilities not to be satisfied out of the current revenues or other funds within their control lawfully applicable thereto, and which would therefore at the date of the contract be an unprovided for liability and properly included within the * * * meaning of the word \"debt.\" They have no application, however, to that class of pecuniary obligations in good faith intended to be and lawfully payable out of either the current revenues for the year of the contract or any other fund within the immediate control of the corporation.'\n\n\"The intent of the Constitution is to protect the citizenship of the municipality from exorbitant taxes, and that was attained in this case when only the constitutional tax was levied. The fund provided by the ordinance to come out of rents, fines, forfeitures, and sales of land was more than sufficient to pay the interest and create a sinking fund for $39,000 of the bonds, the amount unprovided for by taxation.\" (Italics ours.)\n\nThe supreme court of North Dakota, in Minot Special School Dist. v. Olsness, 53 N. D. 683, 208 N. W. 968, 45 A. L. R. 1337, considered a proceeding to prohibit and enjoin the commissioner of insurance of North Dakota from enforcing what was known as the fire and tornado fund law. The law, in effect, put the state in the insurance business, and set up a system whereby all school districts would pay premiums to the fund and all losses would be paid from the fund. It also set up a system whereby the legislature would insure the fund if there was insufficient money to cover any one loss. There were several constitutional grounds involved, one of which concerned the question of whether the act created an indebtedness on the part of the state in excess of the limit fixed by the constitution. Speaking on this point, the court said:\n\n\"It is next contended that the act creates an indebtedness on the part of the state in excess of the limit fixed by § 182 of the constitution. This contention is clearly without merit. The act does not purport to create an indebtedness on the part of the state at all. The obligations of the state fire and tornado fund are not made obligations of the state.\"\n\nIt is interesting to note that the law here involved provided that, in case of emergency, the insurance fund would borrow from the general revenues of the state, and it further provided that the state should be repaid if, and only if, a sufficient fund was again built up in the insurance department. As a matter of fact, this law placed the general revenues of the state in the position of a surety.\n\nThis case has been quoted with approval in the case of Lang v. Cavalier, 59 N. D. 75, 228 N. W. 819.\n\nThe leading case in South Carolina upon the question under consideration is Briggs v. Greenville County, 137 S. C. 288, 135 S. E. 153. The case involved so-called reimbursement agreements with the state highway commission of South Carolina. For the purpose of raising moneys required by the reimbursement agreements, a state officer proposed to issue bonds of the county or of the road district in an aggregate principal amount of more than one million five hundred thousand dollars, which was in excess of debt allowed by the state constitution. In passing upon the question, the supreme court of South Carolina stated:\n\n\"The proposed reimbursement agreements will not constitute a general liability of the State. The reimbursements to be made thereunder can be made only from a special fund consisting of the gasoline tax, automobile license tax, and federal aid. No property tax can ever be levied to meet these obligations.\n\n\"Is such a limited liability a debt of the State in the constitutional sense? The underlying purpose of the constitutional provisions concerning the creation of state debt was that they should serve as a limit of taxation -- as a protection to taxpayers, and especially those whose property might be subjected to taxation. This purpose will not be defeated if it should be held by this Court that a debt for the construction of a state highway system, payable exclusively from federal aid moneys and special license taxes to be borne by the persons who will derive the principal benefits from the state highway system, is not a debt of the kind required by the Constitution to be approved by the voters of the State before it is incurred. According to the weight of authority in other states, such a debt does not fall within the terms of such a constitutional provision.\"\n\nIn passing upon the issue, the court cited the following Washington cases: Faulkner v. Seattle, 19 Wash. 320, 53 P. 365; Winston v. Spokane, 12 Wash. 524, 41 P. 888; Uhler v. Olympia, 87 Wash. 1, 151 P. 117, 152 P. 998; and State ex rel. Capitol Comm. v. Clausen, 134 Wash. 196, 235 P. 364.\n\nAgain, the South Carolina court said:\n\n\"This Court has held a number of times that obligations of the same character as these bonds, secured by the pledge of a fund which might reasonably be expected to be sufficient to meet the obligations without resorting to the levy of a property tax, did not constitute bonded debt within the meaning of the constitutional limitations, notwithstanding that the full faith, credit, and taxing power of a political subdivision were pledged for the payment of the obligations. . . .\n\n\"From the foregoing review of the decisions, it is obvious that the present case cannot be distinguished from the previous cases upon the ground that the obligations here in question are payable primarily out of an ad valorem tax. If the statutes in question had not made such a provision for payment, but had required the holders of the proposed bonds to look first to the reimbursement moneys and gasoline tax, and required the county or road district to exhaust its remedies against the State Highway Commission or the State Treasurer before it could resort to the levy of a property tax in order to meet the bonds, the bonds would be unsaleable, or they would have to be sold on such a high interest basis as to make the cost of the financing excessive.\"\n\nThe rule stated was approved in State ex rel. Richards v. Moorer, 152 S. C. 455, 502, 150 S. E. 269. This case again brought up for constitutional determination the highway act of South Carolina. The act considered was an amendment to the one considered in the Briggs case. The act was divided into three parts. The first provided for the state unit plan of financing, which provided a fund made up of gasoline and motor vehicle taxes; and second, for a district unit plan (an alternative plan in case the state plan was held unconstitutional). The main point concerned the constitutionality of the state plan. Here, the court quoted extensively\n\nfrom the Briggs case and, in a summary of its quotations, said:\n\n\"The principle stated in the first sentence of the foregoing extract was adopted by the Court as the controlling principle of its decision. In both cases it was held that county bonds, secured by the pledge of a special fund which might reasonably be expected to be sufficient to pay the obligations without resorting to the levy of a general property tax -- the fund referred to being derived from the same sources as the special fund provided for the payment of the obligations in the instant case -- did not constitute bonded debt within the meaning of the constitutional restrictions upon the creation of 'bonded debt' of counties, notwithstanding that the bonds were 'direct and general obligations' of the counties, 'payable primarily' from a general property tax, rather than from the special fund, and the 'full faith, credit and taxing power' of a county or counties were pledged for the payment of the bonds. In both cases the same principle was applied to bonds of a highway district. The statutes involved authorized the issuance of bonds either in the name of a highway district on the one hand or in the name of a county or group of counties on the other hand, as the local officers might in their discretion determine.\"\n\nThe rule laid down in the Briggs case was again affirmed in State ex rel. Crawford v. Stevens, 173 S. C. 149, 175 S. E. 213.\n\nIn Alabama State Bridge Corp. v. Smith, 217 Ala. 311, 116 So. 695, the supreme court of the state of Alabama had before it a case quite similar to the one presented to us. The Alabama legislature, in 1927, authorized an incorporation for the purpose of constructing bridges and approaches. The act provided for the issuance of bonds, the principal and interest of which were to be paid from the proceeds derived from the collection of tolls, interest also to be payable from the residue of receipts from a gasoline tax passed earlier in 1927, or from net receipts from the convict department, or out of any funds in the treasury as authorized. The question before the court was whether or not this act violated the constitution of the state of Alabama, which said: \"No new debt shall be created against, or incurred by this state.\"\n\nIn passing upon the question, the court decided:\n\n\"Our judgment is that 'debt,' within the meaning, the purview, the whole content, of the constitutional provision, is that which the state in any event is bound to pay, an obligation secured by the general faith and credit of the state. Bonds that may be issued for the construction of bridges under this act will not evidence such an obligation -- will not be so secured. The surplus of several funds pledged in the first place for the security of bonds, the proceeds of which have, or will have, been used for other designated purposes or of funds devoted to other specified purposes -- these surplus funds, along with the right to collect tolls, are pledged for the security of bonds to be negotiated for the building of bridges. If these special funds should for any reason fail of realization, or should be exhausted in execution of the primary purposes for which they may be raised, nothing will be left to creditors advancing money on the faith of the bonds authorized but the right to collect tolls. There is no promise on the part of the state to pay in any event; there is no pledge that there will be a surplus of any fund; there is no pledge of the general credit of the state; there will be no debt within the meaning of section 213.\"\n\nIn September, 1935, the governor of the state of Alabama asked the supreme court of that state for an opinion upon the constitutionality of an act which authorized certain counties in Alabama to issue warrants, assignments, and other obligations payable out of the gasoline tax collected by the state of Alabama. It was the opinion of the court in In re Opinions of the Justices, 230 Ala. 673 (2d case), 163 So. 105, that the warrants or other securities authorized by the bill did not constitute nor evidence debts of the counties within the meaning of the constitution of Alabama. In so deciding, the court, in referring to the warrants, said:\n\n\"They are expressly declared not to be a charge on the general credit of the county, but payable solely from the funds allocated and pledged under the act. The fund thus pledged is part of the proceeds of a state excise tax, levied and collected by the state, and allocated by statute to the several counties for the construction and maintenance of roads and bridges. Jefferson County v. Hard, Comptroller, et al., 227 Ala. 201, 149 So. 81.\n\n\"These obligations are not a charge on the general revenues of the county, nor on the proceeds of any levy by the county for special county purposes under the Constitution.\"\n\nAccord: Routt v. Barrett, 396 Ill. 322, 71 N. E. (2d) 660.\n\nOur attention has been called to three cases which, it is claimed, are opposed to the conclusion arrived at by the courts in the cases just cited. These are State ex rel. Diederichs v. State Highway Comm., 89 Mont. 205, 296 P. 1033; People ex rel. Chicago v. Barrett, 373 Ill. 393, 26 N. E. (2d) 478; and Boswell v. State, 181 Okla. 435, 74 P.2d 940.\n\nIt is true that, in the Boswell case, the court held that a state debt was created in violation of a constitutional debt limitation similar to ours when the legislature passed an act providing for highway revenue anticipation notes to be issued in the sum of thirty-five million dollars for the construction of roads and bridges, to be paid by an excise tax on gasoline. The court renounced its adherence to the special fund doctrine previously adopted in the case of Baker v. Carter, 165 Okla. 116, 25 P.2d 747.\n\nHowever, in State ex rel. Kerr v. Grand River Dam Authority, 195 Okla. 8, 154 P.2d 946, the Oklahoma court returned to the special fund theory and approved the issuance of bonds in the amount of eleven million dollars, and this, notwithstanding the fact that the people of Oklahoma had amended their constitution subsequent to the time of the decision in the Boswell case prohibiting the creation of any debt or obligation against the state or any institution or agency thereof, regardless of its form or the source of money from which it was to be paid, except as provided in two other sections of the constitution, which limited the state indebtedness to five hundred thousand dollars, except in cases where it was necessary to raise funds to repel invasion or defend the state in time of war. The court in this last opinion admitted that the authority issuing the bonds was a governmental agency.\n\nThe Montana court in the Diederichs case did not decide that case upon the question of whether a debt was created\n\nby the issuance of debentures in excess of the constitutional debt limitation.\n\nIt appears in the Barrett case that the constitution of Illinois is so unlike ours that that case is of no help in arriving at a decision in the case at bar.\n\n[23] The cases which we have considered state what must be held to be the unanimous view of the courts of this country upon the question of whether or not bonds payable out of a special fund, supplied by an excise tax, constitute a debt within the meaning of constitutional limitations fixing a general debt limitation. Based upon those cases and the cited cases decided by this court, which indicate an approval of the special fund doctrine and, further, that excise taxes are not controlled by constitutional provisions, we hold that the issuance and sale of bonds provided for in this act do not in any way constitute a debt against the state of Washington. The bonds provided for are to be paid from a special fund and solely from anticipated revenues to be derived from the sale of cigarettes. They are not, and cannot be, a general obligation of the state. In the event the anticipated profits do not materialize and the fund becomes exhausted, the purchaser of the bonds has no legal redress against the state. He must look solely to the fund upon which they are drawn.\n\nWhether there would be a moral obligation to redeem the bonds, is a matter which does not concern this court. It is sufficient to say there is no legal obligation to do so in the event the special fund is exhausted. In that event, there will be no additional tax burden by reason thereof; for, as just stated, there is no general obligation on the part of the state to redeem the bonds.\n\n[24] A debt within the meaning and purview of the constitutional provision in question is that which in any event the state is bound to pay. That is not the situation in this case. This conclusion is fortified by § 12 of the act, which reads:\n\n\"The Legislature may provide additional means for raising money for the payment of the interest and principal of said bonds, and this act shall not be deemed to provide an\n\nexclusive method for such payment. The power given to the Legislature by this section is permissive and shall not be construed to constitute a pledge of the general credit of the State of Washington.\"\n\nRespondent takes the position that § 9 of the bonus act, which provides\n\n\". . . the state undertakes to continue to levy the taxes upon cigarettes referred to in this section and to place the proceeds thereof in the War Veterans' Compensation Bond Retirement Fund and to make said Fund available to meet said payments when due until all of said bonds and the interest thereon shall have been paid,\"\n\nviolates the fourteenth amendment to our state constitution. The fourteenth amendment was adopted by the people of this state at the general election in 1930, which amended Art. VII of our constitution by striking out all of §§ 1, 2, 3 and 4, and inserting in lieu thereof the following, to be known as § 1:\n\n\"Art. VII, § 1. The power of taxation shall never be suspended, surrendered or contracted away. All taxes shall be uniform upon the same class of property within the territorial limits of the authority levying the tax and shall be levied and collected for public purposes only. The word 'property' as used herein shall mean and include everything, whether tangible or intangible, subject to ownership. All real estate shall constitute one class: Provided, That the Legislature may tax mines and mineral resources and lands devoted to reforestation by either a yield tax or an ad valorem tax at such rate as it may fix, or by both. Such property as the Legislature may by general laws provide shall be exempt from taxation. Property of the United States and of the state, counties, school districts and other municipal corporations, and credits secured by property actually taxed in this state, not exceeding in value the value of such property, shall be exempt from taxation. The Legislature shall have power, by appropriate legislation, to exempt personal property to the amount of three hundred ($300.00) dollars for each head of a family liable to assessment and taxation under the provisions of the laws of this state of which the individual is the actual bona fide owner.\"\n\nRespondent has argued that the state has, by the passage of the act in question, obligated itself to continue the tax on\n\ncigarettes until the sum of eighty million dollars has been paid in full, together with the interest and the service charges thereon; and that this, therefore, is not a question of exhausting a special fund, but is rather one of obligating the state to reduce its general fund in the amount of revenue derived from the cigarette taxes. Based upon this theory, the respondent has argued that the state, by this act, has contracted away to the bondholders the right to tax cigarettes at the level covered by the bonus act until the bond obligations are fully discharged.\n\n[25] Words used in a constitution are to be understood in their usual and ordinary sense -- that is, as they are understood ordinarily in the sense that they convey to the popular mind. Bronson v. Syverson, 88 Wash. 264, 152 P. 1039, Ann. Cas. 1917D, 833; State ex rel. State Capitol Comm. v. Lister, 91 Wash. 9, 156 P. 858.\n\n[26] Having this rule in mind, we inquire into the meaning of the words used in the first sentence of the amendment. \"Surrender\" means to yield, render, or deliver up (Nolander v. Burns, 48 Minn. 13, 50 N. W. 1016); to give up completely, resign, to relinquish (Webster's International Dictionary (2d ed.)).\n\nIt is crystal clear that the legislature did not in any way relinquish or yield its right to impose a tax and see to it that it was collected. The bondholders are not even mentioned in this regard. On the other hand, the legislature, in no uncertain terms, retained this right to tax.\n\nThe word \"suspended\" is defined as temporarily inactive or inoperative -- that is, held in abeyance. Towles v. Travelers Ins. Co., 282 Ky. 147, 137 S. W. (2d) 1110. There are no words in the act which in any way state, or even indicate, that the legislature suspended a tax. On the other hand, it definitely determined to continue its power of taxation.\n\nThe words \"contracted away\" manifest in themselves their meaning. The legislature did not contract away its taxing authority, but on the other hand, decided in a definite manner its intention of retaining its rights.\n\nThe general rule is announced as follows, in 51 Am. Jur. 529, Taxation, § 526:\n\n\"The rule is laid down by many courts that the taxing power of the state is never presumed to be relinquished, but continues to exist unless the intention to relinquish it is declared in clear and unambiguous terms, admitting of no other reasonable construction.\"\n\n[27] It is further contended that the legislature of 1949 had no right to enact a law which would be binding upon future legislatures. It is, of course, a general rule that one legislature cannot abridge the power of a succeeding legislature, and succeeding legislatures may repeal or modify acts of a former legislature. However, exceptions appear in those cases in which the legislative act is equivalent to a contract. Winter v. Jones, 10 Ga. 190, 54 Am. Dec. 379.\n\n[28] That contracts, when entered into by a state, cannot be changed by legislative enactment is fundamental. Dartmouth College v. Woodward, 17 U.S. 518, 4 L. Ed. 629.\n\nThe principle of law to be applied to this question is well stated by Mr. Justice Roberts in the following quotation from Indiana ex rel. Anderson v. Brand, 303 U.S. 95, 82 L. Ed. 685, 58 S. Ct. 443, 113 A. L. R. 1482:\n\n\"The principal function of a legislative body is not to make contracts but to make laws which declare the policy of the state and are subject to repeal when a subsequent legislature shall determine to alter that policy. Nevertheless, it is established that a legislative enactment may contain provisions which, when accepted as the basis of action by individuals, become contracts between them and the State or its subdivisions within the protection of Art. I, § 10. If the people's representatives deem it in the public interest they may adopt a policy of contracting in respect of public business for a term longer than the life of the current session of the legislature.\"\n\nPrior to, and in June, 1863, an individual was the owner and holder of certain coupons on interest notes of the city of Quincy, Illinois. When they were issued, they were attached to certain bonds made and delivered by the city under a law of the state which authorized their issuance. Thereafter, the legislature of the state of Illinois passed an\n\nact which purported to repeal the one which authorized the issuance of the bonds and their coupons. The question presented to the supreme court of the United States in United States ex rel. Von Hoffman v. Quincy, 71 U.S. 535, 18 L. Ed. 403, for determination was whether the latter statute was valid, or whether the legislature had transcended its power in enacting it. The court referred to Fletcher v. Peck, 6 Cranch 87 (10 U.S. 87), which was the first case in the supreme court in which the question under consideration was decided.\n\nIt was held in the cited case that the legislative act of the state of Georgia, under which an individual had acquired title by mesne conveyances from the state, constituted a contract which could not be invalidated by a subsequent act of the legislature. The court then stated:\n\n\"It is also settled that the laws which subsist at the time and place of the making of a contract, and where it is to be performed, enter into and form a part of it, as if they were expressly referred to or incorporated in its terms.\"\n\nIn deciding the case, the court said:\n\n\"When the bonds in question were issued there were laws in force which authorized and required the collection of taxes sufficient in amount to meet the interest, as it accrued from time to time, upon the entire debt. But for the act of the 14th of February, 1863, there would be no difficulty in enforcing them. The amount permitted to be collected by that act will be insufficient; and it is not certain that anything will be yielded applicable to that object. To the extent of the deficiency the obligation of the contract will be impaired, and if there be nothing applicable, it may be regarded as annulled. A right without a remedy is as if it were not. For every beneficial purpose it may be said not to exist. . . .\n\n\"The laws requiring taxes to the requisite amount to be collected, in force when the bonds were issued, are still in force for all the purposes of this case. The act of 1863 is, so far as it affects these bonds, a nullity.\"\n\nWolff v. New Orleans, 103 U.S. 358, 26 L. Ed. 395, had to do with the validity of an act for the issuance of bonds by the city of New Orleans in 1876. This act, to all intents and purposes, invalidated outstanding bonds authorized\n\nby a previous state act, which act also provided that a special tax should be levied each year to pay the annual interest on the bonds. Holding the last act unconstitutional, the court said:\n\n\"It is true that the power of taxation belongs exclusively to the legislative department, and that the legislature may at any time restrict or revoke at its pleasure any of the powers of a municipal corporation, including, among others, that of taxation, subject, however, to this qualification, which attends all State legislation, that its action in that respect shall not conflict with the prohibitions of the Constitution of the United States, and, among other things, shall not operate directly upon contracts of the corporation, so as to impair their obligation by abrogating or lessening the means of their enforcement. Legislation producing this latter result, not indirectly as a consequence of legitimate measures taken, as will sometimes happen, but directly by operating upon those means, is prohibited by the Constitution, and must be disregarded -- treated as if never enacted -- by all courts recognizing the Constitution as the paramount law of the land. This doctrine has been repeatedly asserted by this court when attempts have been made to limit the power of taxation of a municipal body, upon the faith of which contracts have been made, and by means of which alone they could be performed. So long as the corporation continues in existence, the court has said that the control of the legislature over the power of taxation delegated to it is restrained to cases where such control does not impair the obligation of contracts made upon a pledge, expressly or impliedly given, that the power should be exercised for their fulfilment. However great the control of the legislature over the corporation while it is in existence, it must be exercised in subordination to the principle which secures the inviolability of contracts.\"\n\nIn 1852, the city of New Orleans issued its bonds which were authorized by a legislative act of that year, and pledged the levy and collection of an annual tax of six hundred thousand dollars, increased to six hundred and fifty thousand dollars by a supplementary act, for the payment of the interest on the bonds and their gradual retirement. In March, 1876, the legislature passed what was known as the premium bond plan. That act, too long to be\n\nrecited here, in effect invalidated the obligation contracted by the city in 1852. In deciding the case of Louisiana v. Pilsbury, 105 U.S. 278, 26 L. Ed. 1090, the court stated:\n\n\"If the provisions of this act nullifying the pledges of the act of 1852 are valid, the consolidated bonds are virtually destroyed; no taxation is allowed to raise funds for them; their payment, therefore, would be so uncertain as to render them practically valueless. The chance with premium bonds offered in their place of a favorable turn of the wheel in a lottery would be a poor substitute for the levy of an annual tax for the payment of interest and principal. We shall not waste words upon the scheme thus developed to evade the just obligations of the city. Notwithstanding the declaration in its preamble, that the act seeks from the creditors the indulgence necessary 'for the public wellbeing and the maintenance of the public honor,' it is, so far as the consolidated bonds are concerned, tainted with the leprosy of repudiation. It says to the creditors: 'Take these premium bonds, and trust for payment within fifty years to your fortune in the lottery we offer; no other way is left open to obtain a possible payment. No tax can be levied for your benefit. No compulsory writ can issue from the courts. Take these bonds or take nothing.' The primal duty of the city authorities to fulfill punctually their obligations and maintain good faith is thus proclaimed to be no duty at all. . . .\n\n\"Legislation of a State thus impairing the obligation of contracts made under its authority is null and void, and the courts in enforcing the contracts will pursue the same course and apply the same remedies as though such invalid legislation had never existed.\"\n\nThe final judgment of the court compelled the city to levy a tax to pay the bonds.\n\nThe supreme court of Colorado in Johnson v. McDonald, supra, decided as follows:\n\n\"The conclusion we have reached, that the contract authorized does not create a debt of the state in the constitutional sense under sections 3 and 4 of article XI of the state constitution is not equivalent to determining that the authorized transaction does not constitute a contract. It does constitute a contract for the payment of money on a contingency, that contingency being that the revenue from the excise taxes, now in force, shall be sufficient to pay the\n\nobligations and interest as they mature. That in all human probability, as indicated by the figures above quoted, the revenues will be more than sufficient, does not prevent the obligation to pay being contingent and not absolute. Since section 3, article XI, supra, limits the power of the legislature only as to the contracting of a debt, then under its residual plenary power it may make a contract or authorize the making of a contract by a state institution, the highway department, and if the contract necessitates the continued existence of existing legislation, then future legislatures are barred by the contract from modifying that legislation so that the obligation of the contract will be impaired, for one of the powers delegated to the Federal Government was the power to restrict legislation by a state impairing the obligations of contracts. 'No state shall * * * pass any * * * law impairing the obligation of contracts.' Art. 1, sec. X, U.S. Constitution.\"\n\nThis decision of the supreme court of Colorado was based upon the following cases: Fletcher v. Peck, 6 Cranch 87 (10 U.S. 87), 3 L. Ed. 162; New Jersey v. Wilson, 7 Cranch 164 (11 U.S. 164), 3 L. Ed. 303; East Hartford v. Bridge Co., 17 Conn. 79; State ex rel. Diederichs v. State Highway Comm., 89 Mont. 205, 296 P. 1033.\n\n[29] In this case we have before us the undisputed fact that the legislature, in passing the bonus act, in effect entered into a contract with the bond buyers that a tax would be levied upon cigarettes for the purpose of retiring the bonds and paying the interest thereon. When the bonds are issued and sold, the bondholders will have a right to the enforcement of their contract, and that contract cannot be in any way limited or voided by subsequent legislatures.\n\n[30] It is contended that the legislature may not provide for the retirement of the bonds authorized under chapter 180, Laws of 1949, by reaching into a source already set aside and allocated for the support of the state government. It will be observed, in passing, that the funds derived from the tax imposed by the prior act (chapter 180, Laws of 1935, as amended) were not definitely allocated to any fund, general or special, hence it cannot be said that the legislature violated any contract when it provided for the tax to be placed in a fund to redeem the bonus bonds. The answer\n\nis that the legislature may do as provided for in this act, the reason being that the constitution does not prohibit such action. Therefore, the legislature was at liberty, in passing the bonus measure, to apply all taxes upon cigarettes to the redemption of the bonds authorized by the act.\n\nThe following decisions support our position, and we are unable to find cases opposed to our conclusion:\n\nThe petition, in Michaels v. Barrett, 355 Ill. 175, 188 N. E. 921, sought to restrain expenditures from the motor fuel tax fund to pay the principal and interest on bonds issued to provide relief for destitute persons. The supreme court of Illinois decided the question in the following language:\n\n\"The amendment of section 9 of the Motor Fuel Tax law to conform to the fourth act, the appellant insists, constitutes an unlawful diversion of the portion of the privilege tax allotted to the several counties for State aid road purposes. To sustain this contention, the appellant argues that the Motor Fuel Tax law, as originally enacted, was part of a legislative plan for financing the construction of State aid roads and that no subsequent General Assembly has the power, by amending the appropriate section, to change the purpose for which funds collected by authority of that act may be expended. The act originally provided that money allotted to the several counties should be used, as the counties might desire, for one or more of the following purposes: First, to retire bonds issued or to pay obligations incurred by a county to construct State aid roads in accordance with section 15d of article 4 of the Road and Bridge Act, approved June 27, 1913; second, for the construction of designated State aid roads in the manner approved by and under the supervision of the department of public works and buildings; and third, with the approval of that department, to maintain roads and bridges constructed in accordance with the provisions of the foregoing subdivision. The Road and Bridge act, approved June 27, 1913, which authorized the construction and improvement of roads and bridges at the joint expense of the State and any county or counties, and which designated such highways as State aid roads, became effective July 1, 1913. Sixteen years later the Motor Fuel Tax law was made a part of the law of this State. Before the enactment of the statute imposing a tax upon the privilege of operating motor vehicles on the public highways, the funds required for the construction and improvement\n\nof State aid roads were derived from other sources. The revenues so produced are or may be made available and recourse may be taken thereto whenever necessary to carry on the construction and improvement of State aid roads. Any disposition for a public purpose other than the allotment of a portion of the privilege tax to the several counties might have been made by the General Assembly, and that department of the State government at any time may amend or even repeal the Motor Fuel Tax law. The tax imposed by it, when collected, becomes public money and may be applied to such purposes as the legislature from time to time may determine.\"\n\nThe case of Crawford v. Johnston, 177 S. C. 399, 181 S. E. 476, concerned the constitutionality of an act which authorized the issuance of state bonds, the funds to be used for the care of certain institutions. The act recited that the bonds should be redeemed by funds from two sources of revenue; first, from the gross revenues of the particular state institution for which they were issued; or second, from the gross receipts from any excise, license, or privilege tax levied upon persons, firms, or corporations engaged in the business of manufacturing, generating, or selling electric power. In passing upon the question presented, the court stated:\n\n\"It is further alleged that the Act is invalid, for the reason that it diverts funds paid into the State Treasury under Section 2564 of the Code of 1932, 'thereby making it necessary to raise the amount of such funds by a general property tax or some other tax.'\n\n\"This position is unsound. Unquestionably, the General Assembly may appropriate funds from the State Treasury to whatever purpose it thinks proper so long as its acts are not in conflict with the Constitution, even if in doing so it changes existing laws and requires the levy of additional taxes. The petitioner can point to no provision of the fundamental law which prohibits the legislative action here complained of.\n\n\"In 12 C. J. 805, the writer says: 'The state legislature possesses all legislative power, except such as has been delegated to congress and prohibited by the constitution of the United States to be exercised by the United States, and such as is expressly or impliedly withheld by the state constitution\n\nfrom the state legislature. The only limitations, therefore, upon the power of the legislature, are those imposed by the state constitution, the federal constitution and the treaties and acts of congress adopted and enacted under it. The powers of the legislature are in no manner limited or restricted by the common law. The constitution as applied to the legislative department is a limitation and not a grant of power.'\"\n\nIn passing upon this question, the supreme court of Colorado stated in Johnson v. McDonald, 97 Colo. 324, 49 P.2d 1017:\n\n\"That the gasoline tax revenue is an existing revenue and not a new revenue is not a material or a controlling factor under the rule announced in Searle v. Town of Haxtun, supra, permitting the pledge of existing revenue.\"\n\nIn Searle v. Haxtun, 84 Colo. 494, 271 P. 629, it was held that property owners whose property was covered by a lien to secure the town's bonds given in payment of an electric light plant, had no right to have the income of the plant applied exclusively to the liquidation of its purchase price, and that another bond issue pledging the income of the electric light plant to pay for improvements and extensions, did not deprive property owners of due process of law.\n\nIn Collector of Taxes of Boston v. National Shawmut Bank, 259 Mass. 14, 156 N. E. 48, the supreme judicial court of Massachusetts had before it a question quite similar to the one under consideration here. There, the court held:\n\n\"The laws of taxation may be changed. In the absence of some binding contract, no one has a vested right to the continuance of such laws in any particular form.\"\n\nThe following quotation from Board of Commissioners of Boone County v. Adler, 77 Ind. App. 296, 133 N. E. 602, states the rule to be applied to situations such as here presented:\n\n\"Taxation is a subject peculiarly within the province of the legislative department of our state government. Subject only to constitutional provisions, the legislature has the exclusive power to devise the plan of taxation; to prescribe the method by which property shall be listed and valued; to fix the rate for state purposes; to designate the manner in which, and the agencies by whom the rates shall be fixed\n\nfor counties, townships, and municipal corporations; to designate the officers by whom, the time within which, and the manner in which, the taxes shall be collected; and to say who shall have the custody of the funds and how the funds shall be disbursed.\"\n\nIn this opinion, we have, in keeping with our own decisions and those of the great majority of the courts in the United States, adhered to the special fund doctrine. At the various sessions of our state legislature, many laws have been passed which created special funds. The first, in so far as the right to impose a tax binding upon future legislatures is concerned, was passed at the session of the legislature in 1889-90. That act, chapter 2, p. 32, \"Bonds,\" provided for the funding of a debt existing at the time of the adoption of the constitution. It is in part as follows:\n\n\"Sec. 4. For the purpose of providing a fund for the redemption of said bonds and payment of interest thereon, the state auditor is hereby authorized and required to levy for five (5) consecutive years an annual tax not exceeding one-tenth (1-10) of one mill on the dollar of the taxable property of the state, which tax, when collected, shall be known as the 'interest fund,' and shall be applied solely to the payment of the interest on said bonds. In the year 1895, and thereafter, the state auditor is hereby authorized and required to levy an annual tax of not exceeding one-fifth (1-5) of one mill on the dollar of the taxable property of the state, which tax, when collected, shall be known as the 'redemption fund,' and shall, until such bonds and interest are paid, be applied solely to the payment thereof in the following manner, viz.: . . .\"\n\nIt is reasonable to believe that, because the legislature which passed this act was so close in time to the adoption of the constitution and its members were in large part composed of the framers of the constitution, they had no intent to limit each legislature to the extent that it could not pass such acts as the one above mentioned, and the one here challenged, which would be binding upon future legislatures. Of course, at that time, we did not have the fourteenth amendment, but we did have Art. VII, which applied to corporate property, which was taxed by the act.\n\nOther acts passed throughout the years have provided for special funds. Some of them are as follows:\n\nChapter 69, § 10, p. 119, of the Laws of 1891, provided that certain amounts paid as fines for trespassing on premises be paid into school funds. The same act provided that fines paid for the violation of the act relative to the disposing of intoxicants on Sunday should be paid into the school fund.\n\nChapter 27, § 7, p. 40, Laws of 1893, provided that the proceeds from auction sales of forfeited animals be paid into the school fund, as were the proceeds secured from fines recovered for violation of chapter 50, p. 79, an act relating to public health; it was also provided that proceeds secured from violations of the act regulating the practice of dentistry, chapter 55, p. 88, should be paid into the school fund.\n\nChapter 68, p. 122, Laws of 1895, also provided that certain fines should be paid into the school fund.\n\nThis is true of chapter 53, p. 89, Laws of 1897.\n\nChapter 89, p. 229, Laws of 1897, provided for certain proceeds from sales of escheating and gift lands to be paid into the school fund.\n\nCertain Session Laws of 1899, 1907, and 1909 provided for the payment of fines into the permanent school fund.\n\nChapter 15, p. 32, Laws of 1915, related to temporary loans and transfers of money from one fund to others, except from the state school fund.\n\nChapter 30, p. 57, Laws of 1919, chapter 50, p. 156, Laws of 1921, chapter 186, p. 632, Laws of 1923, and chapter 255, p. 468, Laws of 1927, made provision for the payment of certain funds obtained by fines and forfeitures for violations of certain laws into the common school fund rather than into the general fund.\n\nIn 1935, the legislature, by chapter 180, Laws of 1935, enacted legislation under twenty titles, sixteen of which dealt with specific types of taxation and generally covered the field of excise taxation in this state. Under title 19, § 211, the legislature allocated this tax money to eight different funds, which included the state emergency relief fund, the school fund, the general fund, and funds belonging\n\nto the university and normal schools. That act was amended in 1937 by chapter 227, Laws of 1937, which amendment provided, among other things, for allocation of the moneys to one less special fund. The act was further amended by chapter 225, Laws of 1939, chapter 178, Laws of 1941, chapter 156, Laws of 1943, and chapter 249, Laws of 1945.\n\nIt should be borne in mind that the cigarette tax was originally passed by the initial act of 1935. The history of these acts shows that this tax was by the legislature initially allocated, along with other funds, not only to the general fund, but to others; that it was not exclusively placed at the disposal of the general fund until 1945.\n\nThe history further shows that the legislature, in allocating a tax established by chapter 180, Laws of 1935, to the bonus fund by chapter 180, Laws of 1949, was doing nothing which to them was unusual; for the legislature has always made a practice of allocating excise tax proceeds to special types of funds.\n\nSome fear has been expressed that, with this decision before them, the legislatures of the future will allocate so many of the excise taxes to special purposes that the general fund will be entirely depleted. There are several answers to this question.\n\nIn the first place, it is none of this court's concern, because the state's fiscal policy has been by the constitution delegated to the legislature and not to this court. Second, the people have the right of referendum. Third, we have had thirty-one regular, and many special sessions of our legislature, and the general fund has not been depleted by special fund acts, though the pattern was set by the act of 1889-90 to which we have heretofore referred. And, finally, we must have faith in the honesty and integrity of future legislatures -- a faith that is justified by the experience of the past.\n\nIt is our conclusion that the legislature acted within its authority when it provided that the funds raised by the tax imposed on cigarettes by chapter 180, Laws of 1935, as\n\namended, should be used to redeem the bonds authorized by chapter 180, Laws of 1949.\n\nWe have made a thorough and painstaking review of all of the cases in the United States which bear upon the issues presented in this case. The cases we have collected and cited reflect not only the great weight of authority, but, as to most of the issues, the unanimous thought of our courts.\n\nBased upon the rules of construction set out in the first part of this opinion, the wording and meaning of our state constitution, our own cases and those from other jurisdictions, we conclude that chapter 180, Laws of 1949, with the one exception noted, is in full accord with constitutional requirements.\n\nWe therefore reverse the judgment of the trial court.\n\nDisposition\n\nReversed.\n\nHill, J. (dissenting)\n\nWith the conclusions arrived at by the majority in the first thirty-five pages of its opinion, I have no serious differences, albeit I would direct attention to § 12 of the act under consideration, which reads:\n\n\"The Legislature may provide additional means for raising money for the payment of the interest and principal of said bonds, and this act shall not be deemed to provide an exclusive method for such payment. The power given to the Legislature by this section is permissive and shall not be construed to constitute a pledge of the general credit of the State of Washington\";\n\nand to the title, which reads:\n\n\"An Act providing for the payment of a bonus to veterans of World War II from the proceeds of a bond issue repayable from the excise taxes on cigarettes as herein provided for; making an appropriation and providing penalties.\"\n\nIt seems to me that, under the rules discussed in extenso by the majority, the statement in the title that the bonds are to be \"repayable from the excise taxes on cigarettes as herein provided for\" puts nobody, in or out of the legislature, on notice that \"additional means\" may be provided by the legislature. One purpose of Art. II, § 19, of our state\n\nconstitution, discussed in the majority opinion, is to prevent little jokers like § 12. However, it is conceded that the unconstitutionality of § 12 would not affect the validity of the rest of the act.\n\nI disagree with the majority's conclusions as elaborated in the second thirty pages of its opinion, i.e., (1) that the bonds to be issued will not be a debt within the constitutional limitations of Art. VIII of our constitution, and (2) that, despite Art. VII of the constitution (as amended; see amendment fourteen), one legislature may, for the payment of obligations other than debts, contract that specific excise taxes will be levied for a fixed period for the payment of certain bonds, or until the bonds are paid, and thereby contract away the right of subsequent legislatures to repeal that tax or apply it to different purposes.\n\nThese two propositions are interrelated, but, inasmuch as Judge Donworth is writing a dissent dealing with the second, I shall limit this dissent to a consideration of whether the bonds to be issued will be a debt within the purview of Art. VIII of the constitution.\n\nThe majority's position that the eighty million dollars in bonds contemplated by chapter 180, p. 496, of the Laws of 1949 will not be a debt as that term is used in Art. VIII of our constitution, seems to me to disregard the clear intent of the constitutional provision. In that article it is stated that \". . . no debts shall hereafter be contracted by or on behalf of this state . . .\" except as provided in §§ 1, 2, and 3 thereof. Section 1 provides that the state may contract debts, not at any time exceeding a total of four hundred thousand dollars, to meet casual deficits, failures in revenue, or expenses not provided for. Section 2 provides that the state may contract debts (and there is no limit) to repel invasion, suppress insurrection, or defend the state in war. Section 3 provides for the authorization of a debt by law (and there is no limit) if it is for some single work or object distinctly specified in the law, and if the law provides ways and means, exclusive of loans, for the payment of the interest on such debt and for payment of the principal within\n\ntwenty years. Such a law cannot take effect until it has received a majority vote of the people at a general election.\n\nSection 1 is for casual deficits, etc., small in amount; § 2 is for great emergencies; § 3 gives the procedure which would normally be followed to incur a state debt. It was under § 3 that the World War I bonus was enacted and upheld by this court. State ex rel. Hart v. Clausen, 113 Wash. 570, 194 P. 793, 13 A. L. R. 580; State ex rel. Hart v. Clausen, 117 Wash. 260, 201 P. 30.\n\nIt must be noted that the majority does not suggest that the act here in question comes under the exceptions referred to in §§ 1,2, or 3. Its position is that the obligation to pay the eighty-million-dollar bond issue will not be a debt of the state of Washington within the purview of the declaration of Art. VIII of the constitution that \". . . no debts shall hereafter be contracted by or on behalf of this state. . . .\"\n\nThe cases involving bond issues payable from the revenues from leases and sales of granted lands or from the revenues of self-liquidating projects such as the operation of toll bridges or state liquor stores, are patently not in point. But every Washington case cited by the majority comes within these categories.\n\nIt is conceded that, if the principal or even the interest on the bond issue here in question were to be paid by the levy of an ad valorem tax, a debt would be created. State ex rel. State Capitol Comm. v. Lister, 91 Wash. 9, 156 P. 858. The distinction upon which the majority relies is that the tax by which the principal and interest of the bonus bonds are to be paid is an excise tax. I concede that there are cases recognizing such a distinction and holding that obligations of the state to be paid from the proceeds of specific excise taxes available for general state purposes, are not debts within the purview of constitutional debt limitations. There are also cases which hold that this is a distinction without a difference and that, if the obligation of the state must be paid from tax revenues, ad valorem or excise, pledged for that purpose and which would otherwise be available for\n\ngeneral state purposes, it is a debt within the constitutional debt limitations.\n\nThis dissent could have been very brief; I would have been content to say that each member of the court has the responsibility of satisfying his own mind and his own conscience as to which of these two views is sound, and would have concluded with a brief statement of what I regard as the important reasons why the bonds involved in this case will constitute a debt within our constitutional debt limitation. The majority, however, has elected to take the dogmatic position that this is a matter on which there is no doubt, and to assert that the view which it takes\n\n\". . . must be held to be the unanimous view of the courts of this country upon the question of whether or not bonds payable out of a special fund, supplied by an excise tax, constitute a debt within the meaning of constitutional limitations fixing a general debt limitation.\"\n\nI must, with all deference, disagree with that assertion. But to show the basis and reasons for my disagreement involves the lengthening of this dissent to the extent necessary to analyze the cases from eleven states which the majority discusses and on which it bases the sweeping statement I have quoted. I have divided those cases into three classes:\n\n(1) Cases not pertinent to the question before us (four states).\n\nThe cases from North Dakota (Minot Special School Dist. v. Olsness, 53 N. D. 683, 208 N. W. 968, and Lang v. Cavalier, 59 N. D. 75, 228 N. W. 819) and Texas (Laredo v. Frishmuth, 196 S. W. (Tex. Civ. App.) 190) do not involve excise taxes.\n\nThe case from Kansas (State ex rel. Boynton v. State Highway Comm., 138 Kan. 913, 28 P.2d 770) makes it clear that constitutional amendments had been adopted so that the debt limitation provisions of the Kansas constitution (Art. XI, §§ 5 and 6) would not apply to money borrowed for highway purposes.\n\nIn the Colorado case (Johnson v. McDonald, 97 Colo. 324, 49 P.2d 1017), the court placed its decision squarely on the proposition that the fund from which the obligations\n\nwere to be paid would not be otherwise available for general purposes because of a constitutional amendment, adopted in 1934, which provided that any excise tax on motor vehicle fuels should be used exclusively for highway purposes. In fact, before the 1934 amendment, while motor fuel taxes were available for general purposes, the Colorado court held that debentures to be paid from such taxes would constitute a debt and would be in violation of the constitutional limitation on debts. In re Senate Resolution No. 2, 94 Colo. 101, 31 P.2d 325.\n\nKansas and Colorado, like many other states, have constitutional provisions which provide that all motor fuel taxes shall go into special funds and be used for highway purposes only, which eliminates their availability for general state purposes and takes them out of the scope of the question here presented. That the people may establish such special funds by constitutional amendment cannot be gainsaid. State ex rel. Syvertson v. Jones, 74 N. D. 465, 23 N. W. (2d) 54.\n\n(2) Pertinent cases which, directly or inferentially, support the majority position (four states).\n\nThe Alabama cases (Alabama State Bridge Corp. v. Smith, 217 Ala. 311, 116 So. 695; In re Opinions of the Justices, 230 Ala. 673, 163 So. 105) must be read in the light of two amendments to the Alabama constitution, Arts. XX and XXA, specifically authorizing the issue of bonds for road and bridges, and the fact that the fund for the retirement of the bonds in question was to be derived from tolls from the bridges to be erected from the proceeds of the bonds. There was no pledge of taxes; there was merely a provision that the interest on the bonds may be paid from certain enumerated sources, including the proceeds of a tax on gasoline, after the proceeds of the tax had first been applied to meet the primary purposes to which the proceeds of such a tax were pledged under Art. XXA of the Alabama constitution. In Boswell v. State, 181 Okla. 435, 74 P.2d 940, the court, discussing the Alabama State Bridge Corp. case, supra, said:\n\n\"In Alabama, the portion of the act regarding the application of the gasoline tax and other revenues, in addition to tolls, to the payment of the bonds was construed not to constitute a pledge of those funds, 'but only an authority so to do, if the Governor, in the exercise of executive discretion, approves such course of action.' See concurring opinion by Justice Bricken. Thus the only thing pledged . . . was the toll.\"\n\nThe other Alabama case referred to, In re Opinion of the Justices, supra, involved a construction of the county debt limitation provision of the Alabama constitution, § 224, the wording of which made it clear that it was concerned only with debts in excess of a certain percentage of the assessed value of the property in the county, and subject to the inference that the debts referred to were to be paid by ad valorem taxes.\n\nThe New Mexico case (State ex rel. Capitol Addition Bldg. Comm. v. Connelly, 39 N. M. 312, 46 P.2d 1097) considered the question of whether certain debentures constituted a state debt, they having been issued for the purpose of securing funds to construct and equip a building to be known as the \"Capitol Addition,\" the principal and interest to be paid from a fund derived from an additional fee of $2.50 upon each civil action filed in the district courts of that state. The New Mexico court assumed that such an increase in the filing fee is an excise tax (contra, State ex rel. Lindsey v. Derbyshire, 79 Wash. 227, 140 P. 540), and arrived at the same conclusion as does the majority in the present case, but with much less assurance and no claim to unanimity, the court saying:\n\n\"We are not unmindful that some courts take a view contrary to that which we uphold. See In re Senate Resolution, 94 Colo. 101, 31 P.2d 325 (a four to three decision); State v. State Highway Commission, 89 Mont. 205, 296 P. 1033. See, also, In re Opinion to the Governor (R. I.) 169 A. 748, 89 A. L. R. 1521, and Crick v. Rash, 190 Ky. 820, 229 S. W. 63.\n\n\" In none of these cases, however, were the courts construing constitutional provisions so obviously comprehending a debt repayable only by resort to general property taxation.\" (Italics mine.)\n\nThere do indeed seem to be provisions in the New Mexico constitution, completely lacking in our own, which support the New Mexico court in its feeling that the debt limitation comprehends a debt payable only by a resort to general property taxation, i.e., § 8 of Art. IX of the New Mexico constitution creates an over-all debt limitation of one per cent of the assessed valuation of all property subject to taxation, and, in the event that a debt is authorized, provision must be made for an annual tax levy sufficient to pay the interest and provide for a sinking fund for the payment of the principal within fifty years. (The Washington constitution, as it deals with limitations on state debts, contains no limitation based on assessed valuation. Our comparable constitutional provision as to payment is much broader; it provides that when a debt is authorized the ways and means of paying it shall be provided, but there is no suggestion that it be limited to an annual tax levy.)\n\nBoswell v. State, supra, distinguishes the New Mexico case on the basis that the constitutional provisions of that state seem to be designed to contemplate a levy of a general property tax for the retirement of debentures.\n\nThe Oregon case (Moses v. Meier, 148 Ore. 185, 35 P.2d 981) was a mandamus action to compel certain state officials to execute and issue certificates of indebtedness of the par value of two hundred fifty thousand dollars, to meet the demands for unemployment relief. These certificates of indebtedness were to be payable solely from the net revenues derived from the manufacture, sale, distribution, taxing and licensing of alcoholic beverages. The Oregon court at no point in its decision discussed the precise question before us, and at one point said:\n\n\"From the above statutory provisions it is clear that these certificates of indebtedness drawn on a special fund and to be paid solely from anticipated revenue derived from the manufacture and sale of alcoholic beverages are not general obligations of the state.\"\n\nIn the dissent, it is stated that these certificates of indebtedness were to be paid from the profits of the liquor business. Neither the majority nor the dissenting judge gave any\n\nattention to the taxes on alcoholic beverages which were to go into the fund from which the certificates of indebtedness were to be paid.\n\nThis seems to have been a case in which the tail (taxes) went with the hide (revenues from the operation of state liquor stores). It is important to note, as pointed out in Boswell v. State, supra, that the Oregon court relied upon the self-liquidating special fund theory, and regarded the university dormitory case of McClain v. Regents of University, 124 Ore. 629, 265 P. 412, as indistinguishable.\n\nThe South Carolina cases (Briggs v. Greenville County, 137 S. C. 288, 135 S. E. 153; State ex rel. Richards v. Moorer, 152 S. C. 455, 150 S. E. 269; State ex rel. Crawford v. Stevens, 173 S. C. 149, 175 S. E. 213) support the majority view fully and completely, though over vigorous dissents in State v. Moorer, supra.\n\nOf the four states placed in this category, Alabama does not actually pledge the taxes on motor vehicle fuels for the payment of bonds except as authorized by Arts. XX and XXA of its constitution, although it authorized their use under certain circumstances for the payment of interest on toll bridge bonds; the New Mexico decision is justified by unusual constitutional provisions; Oregon has never actually passed on the question; and only South Carolina clearly and unequivocally supports the majority position. And that state is finding that the breach in the dike of debt limitation made in the cases cited, where bonds for highway construction were to be paid from motor vehicle fuel taxes pledged for that purpose, is rapidly widening. In Arthur v. Johnston, 185 S. C. 324, 194 S. E. 151, the South Carolina supreme court complains that special funds for bond payments should be derived only from sources related, directly or indirectly, to the promotion for which the obligations are pledged (such as motor vehicle fuel taxes for highway construction), but admits that, having held that only obligations to be paid by general taxes are debts, there is no logical basis upon which it can distinguish an allocation of part of the state's income tax to the payment\n\nof bonds for erection of buildings at institutions of higher learning from its holdings in the cases heretofore cited. The allocation of taxes on the generation and sale of electric power for the payment of bonds for certain state hospitals and training schools was approved on the authority of the cases cited in Crawford v. Johnston, 177 S. C. 399, 181 S. E. 476. South Carolina's subsequent experiences might suggest: \"STOP! LOOK! LISTEN!\"\n\n(3) Pertinent cases which reach a conclusion different from that of the majority but which the majority says are in accord with its views or can be distinguished (three states).\n\nIn this category are the cases from Oklahoma (Boswell v. State, 181 Okla. 435, 74 P.2d 940; State ex rel. Kerr v. Grand River Dam Authority, 195 Okla. 8, 154 P.2d 946), Illinois (People ex rel. Chicago v. Barrett, 373 Ill. 393, 26 N. E. (2d) 478; Routt v. Barrett, 396 Ill. 322, 71 N. E. (2d) 660), and Montana (State ex rel. Diederichs v. State Highway Comm., 89 Mont. 205, 296 P. 1033).\n\nIt seems to me that the majority not only does not succeed in distinguishing the cases from Oklahoma and Illinois, but that the reasoning and the logic of the decisions as epitomized in the quotations from those cases which follow, is unanswerable. There is a basis on which the Montana case may be distinguished.\n\nIn Boswell v. State, supra, the Oklahoma court declared unconstitutional an act authorizing highway revenue anticipation notes in the sum of thirty-five million dollars, for the construction of roads and bridges, to be paid from an excise tax of three cents a gallon on gasoline. The act recited that the notes were not to be debts or general obligations of the state.\n\nComparing Art. X, §§ 23, 24, and 25 of the Oklahoma constitution as it existed at the time of the Boswell case (prior to the amendment of Art. X, § 23, in 1941) with Art. VIII, §§ 1, 2, and 3 of the Washington constitution, we find that §§ 23 and 1 were identical, §§ 24 and 2 were practically identical, and §§ 25 and 3 were similar in purport and content,\n\nwith a variation in the time within which the debt must be paid, twenty-five years being the time limit in the Oklahoma constitution. The court there said:\n\n\"Although the bill recites that the notes 'are not debts or general obligations of the State of Oklahoma,' this is in no respect conclusive of the matter. The question of whether the bill authorizes a debt of the state contrary to the constitutional provisions is a judicial and not a legislative question. [Citing cases.] . . .\n\n\"These sections do not provide that a debt payable in a certain manner may not exceed $400,000, but that no debt shall exceed that sum. No distinction is made between the two forms of taxation in so far as limiting the amount of indebtedness which may be incurred by the state is concerned. . . .\n\n\"While the Constitution must be interpreted in the light of its meaning at the time of its adoption by the people, the state is now wholly dependent upon funds derived from levies of specific taxes for the operation of the affairs of government. To sustain the position of the defendants in this case, that the 'debt limit' provisions of the Constitution have application only to general ad valorem property taxation would be to hold that there is no constitutional debt limit in this state. Such a conclusion would thus nullify the provisions of sections 23 and 25, article 10, of the Constitution. . . .\n\n\"If the Legislature had the power to authorize the creation of a debt for a purpose deemed to be beneficent, and to provide for the pledging of revenues derivable from the gasoline tax to the payment of such an obligation, then future Legislatures, for other purposes which they deem to be beneficent, may authorize the creation of indebtedness and irrevocably pledge the revenues to be derived from other specific taxes to the payment of said obligations, which might result in impoverishing the general revenue fund of the state to the extent that the orderly functions of government could not be carried on, or, in the alternative, in onerous and burdensome levies of other specific taxes in sums sufficient to meet the ever-expanding expenses of state government. . . .\n\n\"The question, however, is not 'Will the Legislature abuse the power and create all such special funds?' but 'Did the people intend to give the power which might be so abused?' It is difficult to reach the conclusion that the people so intended,\n\nif they were attempting to guard against abuses of the past. We may not contemplate that future legislative assemblies will become reckless, extravagant, or improvident in dealing with the revenues of the state, but it is our solemn duty to determine the intent of the framers of the Constitution and of the people in adopting it with respect to the authority of the Legislature to incur debts which the people must pay. What we have said clearly demonstrates that the interpretation and construction sought to be placed upon these constitutional provisions by the defendants could not have been contemplated by the framers of that document, but that the people intended that the government should be operated on a cash, or pay-as-you-go plan. It is significant to note that in the adoption of the Constitution the people reserved to themselves all power to determine whether or not debts should be incurred [likewise in the Washington constitution, Art. VIII, § 3], excepting only those debts which might be incurred under the specific provisions of sections 23 and 24, article 10, of the Constitution [Art. VIII, §§ 1 and 2, Washington constitution], and also fixed upon themselves the responsibility for providing the revenue for the payment of such debts. We cannot approve the contention of defendants that the limitations contained in said constitutional provisions relate only to ad valorem taxes on property and have no application to specific taxes.\"\n\nThe majority seeks to distinguish the Boswell case, which construed constitutional provisions almost identical to our own, by saying that in State ex rel. Kerr v. Grand River Dam Authority, supra, the Oklahoma court returned to the special fund theory, and implies, as I read the majority opinion, that the Oklahoma court repudiated the special fund theory in the Boswell case and that the Kerr case supersedes it. The Boswell case cited and reviewed practically every case relied upon by the majority on this phase of the case, distinguished some, and refused to follow others. The Oklahoma court never departed from the special fund theory in the Boswell case, but, in fact, explained it in considerable detail and pointed out the distinction between special funds raised by special assessments on benefited property or from the revenues of self-liquidating projects\n\nsuch as utilities, toll bridges, state liquor stores, university dormitories, etc., and a fund\n\n\". . . created from specific taxes which constitute a part of the state's general revenue . . . which can otherwise be devoted by the Legislature to any legitimate public use.\"\n\nWhether this distinction is valid constitutes one of the pivotal points in this case.\n\nI cannot see how the majority gets any consolation from the case of State ex rel. Kerr v. Grand River Dam Authority, supra. The Oklahoma court there pointed out that the Grand River Dam Authority can incur a bonded indebtedness because it is a self-liquidating project, and as to the availability of the special fund theory in such cases there has been no question. In view of the majority's contention as to the effect of the Kerr case on the Boswell case, the following passage from the former is indeed significant:\n\n\"In Sheldon v. Grand River Dam Authority, 182 Okla. 24, 76 P.2d 355, we held that said Authority was not a political corporation or subdivision of the state within the meaning of section 26 of article 10 of the State Constitution but was a governmental agency as declared in the act of its creation. We further held that the project within the terms of the act was purely self-liquidating, and, thus falling within the scope of the special fund doctrine announced in Baker v. Carter, 1933, 165 Okla. 116, 25 P.2d 747, and further defined and limited in the case of Boswell v. State, 1937, 181 Okla. 435, 74 P.2d 940, the then authorized bond issue of $15,000,000 would not operate to create a debt within the inhibition of said article 10, sec. 23, of the Constitution.\" (Italics mine.)\n\nThe Oklahoma court could not return to what it had never departed from, i.e., the special fund doctrine as \"defined and limited\" in the Boswell case.\n\nI now direct attention to the Illinois case of People ex rel. Chicago v. Barrett, 373 Ill. 393, 26 N. E. (2d) 478, in which an act authorizing payment of certain notes from the motor vehicle fuel tax fund was declared unconstitutional. The court said:\n\n\"Under our constitution the State is not limited to levying a property tax to raise necessary revenue for operation of the State government, but may levy property taxes on valuation basis, occupation taxes, or franchise or privilege taxes. [Citing cases.] All State taxes and all revenues derived through any or all of those three methods are State revenues. . . .\n\n\"Bonds and notes secured by and to be paid from revenues derived from the specific income-bearing property, for which the bonds are issued, differ very materially from notes issued in anticipation of the collection of the public revenue for the construction of highways which return no revenue but are a constant liability for maintenance and repair. In the latter case the State is pledging its faith that revenues paid to it, which may be used for general governmental purposes [citing cases] if the General Assembly should so direct, shall, however, be used to pay such notes. An essential element of a debt is the obligation to pay. This obligation the State, by guaranteeing that the source or allocation of State revenues to such purpose shall not be altered or reduced, assumes under this act. An instrument that is to be paid through a tax levied by the State, is a State debt. [Citing cases.]\n\n\"The special fund doctrine, which, in cases of water and electric light utilities and bridge tolls, constitutes an exception to the debt-limitation provision, is based on the theory that an obligation incurred in the acquisition, construction or extension of income-bearing property and payable solely from the income of that property, is not a debt of the State or municipality. Such doctrine does not, in our opinion, extend to obligations payable from taxes, which, in whatever form the legislature may collect them, are State revenues.\"\n\nThe majority attempts to distinguish this case by saying:\n\n\"It appears in the Barrett case that the constitution of Illinois is so unlike ours that that case is of no help in arriving at a decision in the case at bar.\"\n\nWe present herewith the portion of Art. IV, § 18, of the Illinois constitution which sets out the conditions under which a debt may be created in that State. They are strikingly similar to our own except that, instead of being divided into three sections, they are all included in one:\n\n\". . . Provided, the state may, to meet casual deficits or failures in revenues, contract debts, never to exceed in the aggregate $250,000; and moneys thus borrowed shall be applied to the purpose for which they were obtained, or to pay the debt thus created, and to no other purpose; and no other debt, except for the purpose of repelling invasion, suppressing insurrection, or defending the state in war, (for payment of which the faith of the state shall be pledged,) shall be contracted, unless the law authorizing the same shall, at a general election, have been submitted to the people, and have received a majority of the votes cast for members of the general assembly at such election. The general assembly shall provide for the publication of said law for three months at least before the vote of the people shall be taken upon the same; and provision shall be made, at the time, for the payment of the interest annually, as it shall accrue, by a tax levied for the purpose or from other sources of revenue; which law, providing for the payment of such interest by such tax, shall be irrepealable until such debt be paid: And, provided further, that the law levying the tax shall be submitted to the people with the law authorizing the debt to be contracted.\"\n\nWe too can say, with the Illinois court:\n\n\"Under our constitution the State is not limited to levying a property tax to raise necessary revenue for operation of the State government, but may levy property taxes on valuation basis, occupation taxes, or franchise or privilege taxes. . . . All State taxes and all revenues derived through any or all of those three methods are State revenues.\"\n\nI have been unable to discover in what respect the constitution of Illinois \"is so unlike ours that that case is of no help in arriving at a decision in the case at bar.\"\n\nThe majority also cites another Illinois case, on p. 50 of the opinion, immediately following the discussion of the Alabama cases, saying: \"Accord: Routt v. Barrett, 396 Ill. 322, 71 N. E. (2d) 660.\" This case involved the Illinois World War II bonus. In that state, bonus bonds were regarded as a debt, and, under the Illinois constitutional provision, the proposition for authorization of a state debt was submitted to the people, which I contend is the proper procedure in this state. The Illinois court passed on the\n\nsufficiency of the title and the ballot form, and approved its submission to the people in the form passed by the legislature. Its relevancy to the majority's position on the proposition now under consideration is not apparent.\n\nWe come now to a consideration of the Montana case (State ex rel. Diederichs v. State Highway Comm., supra), which the majority distinguishes with the statement that the Montana court\n\n\". . . did not decide that case upon the question of whether a debt was created by the issuance of debentures in excess of the constitutional debt limitation.\"\n\nThe Montana constitutional provision in question is Art. XIII, § 2, which reads as follows:\n\n\"The legislative assembly shall not in any manner create any debt except by law which shall be irrepealable until the indebtedness therein provided for shall have been fully paid or discharged; such law shall specify the purpose to which the funds so raised shall be applied and provide for the levy of a tax sufficient to pay the interest on, and extinguish the principal of such debt within the time limited by such law for the payment thereof; but no debt or liability shall be created which shall singly, or in the aggregate with any existing debt or liability, exceed the sum of one hundred thousand dollars ($100,000) except in case of war, to repel invasion or suppress insurrection, unless the law authorizing the same shall have been submitted to the people at a general election and shall have received a majority of the votes cast for and against it at such election.\" (Italics mine.)\n\nThe Montana court said that the debentures, which were to be sold for the purpose of providing money for highways and were to be paid from the motor vehicle fuels excise tax, clearly constituted a liability, if not a debt, within the contemplation of the constitution, and hence could be valid only if approved by a vote of the people. Judge Angstman, in his concurring opinion, stated that the determination of the case did not require the drawing of distinctions between debts and liabilities, and that:\n\n\"The reasons stated in the court's opinion supporting the conclusion that the creation of the special fund for the payment\n\nof the debentures does not prevent the Act from creating a liability are my reasons why the provision for a special fund does not save the Act from creating a debt. The scheme provided by Chapter I diverts public revenues to the payment of a loan by the state as effectually as if the full faith and credit of the state were actually pledged in payment of the debentures.\"\n\nThis completes the analysis of the cases relied upon by the majority. While regrettably long, it seems to me to demonstrate that the decisional foundations relied upon by the majority are inadequate to support its conclusion that the position it has assumed represents the unanimous view of the courts of this country.\n\nThe question actually presented is: What was the purpose of the framers of the constitution of the state of Washington and of the people who adopted it, with respect to the authority of the legislature to incur debts which the people must pay? What the courts of South Carolina, etc., or Oklahoma, etc., have decided is of importance only as their reasoning and logic is persuasive.\n\nThe purpose of the debt limitation provision in our constitution was stated in Allen v. Grimes, 9 Wash. 424, 427, 37 P. 662, where it was said:\n\n\"The object of the constitutional provisions mentioned was to insure economy in the management of the state's business affairs by taking away even from the legislature the power to create obligations on behalf of the state which would necessitate taxation to meet them.\"\n\nThe majority now says that when we said \"necessitate taxation to meet them\" we did not mean excise taxation; and it thereby writes\n\n\"Requiescat in Pace\"\n\nover the idea of debt limitation.\n\nIf this bond issue does not constitute a debt of the state of Washington within the purview of Art. VIII of our constitution because it is to be paid by an excise tax, then there is no such thing as effective debt limitation in this state. All the legislature needs to do is to follow the lead of the South Carolina legislature and pledge a portion of the sales tax or\n\nsome other excise tax on specified commodities or businesses, to the payment of the principal and interest of any desired bond issue.\n\nThe majority's ad hominem argument relative to its faith in the honesty and integrity of the legislature, carried to its logical conclusion, precludes the necessity for any constitutional limitations on the powers of that body. The argument is well answered in an excerpt from the Boswell case hereinbefore quoted:\n\n\"The question, however, is not 'Will the Legislature abuse the power and create all such special funds?' but 'Did the people intend to give the power which might be so abused?' It is difficult to reach the conclusion that the people so intended, if they were attempting to guard against abuses of the past. We may not contemplate that future legislative assemblies will become reckless, extravagant, or improvident in dealing with the revenues of the state, but it is our solemn duty to determine the intent of the framers of the Constitution and of the people in adopting it with respect to the authority of the Legislature to incur debts which the people must pay.\"\n\nIn conclusion, I would state that, while the majority and I have arrived at different conclusions in the performance of the \"solemn duty\" referred to, I agree that the veterans of World War II can have a bonus within the constitution. There is a blazed and approved trail for reaching that goal by complying with Art. VIII, § 3, of the state constitution, as was done in the case of the bonus for World War I veterans. The first attempt to secure a bonus for World War II veterans failed because the bonds were made payable at a time \"not exceeding thirty years\" from the date of their issuance, in the face of a specific constitutional provision requiring bonds to be paid within twenty years, and it thereby met an insuperable constitutional obstruction. The second attempt, now before us, tries a short cut by taking the position that the bonds will not be a debt within the purview of Art. VIII of the constitution because they are not to be paid by ad valorem taxes; and chapter 180 of the Laws of 1949 makes no pretense of attempting to come within the exception of\n\n§ 3 of that article, under which the World War I bonus was upheld.\n\nIt is my view that, when bonds are to be paid from future taxes irrevocably allocated to that purpose, which taxes could otherwise be devoted by the legislature to any legitimate public use, a debt is created, and it is immaterial whether the taxes are ad valorem or excise.\n\nThe judgment of the trial court should be affirmed.\n\nDonworth, J. (dissenting)\n\nI concur in the dissenting opinion of Judge Hill in holding that this eighty-million-dollar bond issue creates a debt in violation of the provisions of Art. VIII of the state constitution.\n\nI am also of the opinion that chapter 180 of the Laws of 1949 violates the clause of the fourteenth amendment (adopted in 1930) providing that \"The power of taxation shall never be suspended, surrendered or contracted away.\" Owing to the far-reaching effect of the majority's interpretation of these two articles of our constitution relating to taxation, I deem it proper to state rather fully the reasons for my dissent, particularly with reference to the fourteenth amendment.\n\nHaving in mind the above-quoted clause of the fourteenth amendment, the following provisions of chapter 180 are pertinent: Section 9 of the act provides that, for the purpose of creating the fund to pay the principal and interest of these bonds, all proceeds of the present excise tax on cigarettes shall be paid into the bond retirement fund until the bonds are all paid in full with interest. This period may be as long as thirty years. The proceeds of this tax now amount to approximately five million dollars annually, which is currently being paid into the general fund and which is now proposed to be diverted for possibly thirty years to the payment of these bonds.\n\nThis same section further provides that, in addition to the present excise tax, \"there is hereby levied\" a new excise tax on cigarettes the proceeds of which are to be used to pay\n\nthese bonds in the same manner as stated above with respect to the proceeds of the existing excise tax on cigarettes. Appellants state in their brief that it may be assumed that this additional excise tax will produce a like amount of money, that is, another five million dollars annually. This money is also to be paid into the bond retirement fund and is to be available solely for the payment of principal and interest thereof. By § 7 of the act, it is expressly declared that these bonds and the interest thereon shall constitute a prior and exclusive claim against the proceeds of both cigarette taxes and the bond retirement fund so long as any portion thereof remains unpaid.\n\nDuring the period that these bonds are outstanding (which may be thirty years), there are two possible events which may cause a part of the proceeds of these two excise taxes to be transferred from the bond retirement fund to the general fund:\n\n(a) if during any year the receipts in the bond retirement fund exceed $4,500,000 or\n\n(b) whenever the receipts in the bond retirement fund shall exceed by $4,100,000 the amount needed to pay principal and interest during any year (as determined by the state finance committee).\n\nIn either of these events, the excess in the bond retirement fund shall be transferred to the general fund.\n\nThe last sentence of § 9 reads:\n\n\" As a part of the contract of sale of the bonds herein authorized, the state undertakes to continue to levy the taxes upon cigarettes referred to in this section and to place the proceeds thereof in the War Veterans' Compensation Bond Retirement Fund and to make said Fund available to meet said payments when due until all of said bonds and the interest thereon shall have been paid.\" (Italics mine.)\n\nThis is an express contract on the part of the state of Washington whereby it covenants with the holders of these bonds that it will not use the proceeds of these two cigarette taxes for general fund or other purposes connected with the operation of the state government for possibly thirty\n\nyears (except to the extent and in either of the events mentioned above).\n\nThus several million dollars of tax proceeds now being paid into the state's general fund and available to pay the expenses of operation of the state government are to be siphoned off and diverted to the payment of these bonds pursuant to this contract between the state and the bondholders. In addition, the same covenant is made with respect to the proceeds of the new cigarette tax levied by the provisions of § 9. Thus, in my opinion, the state's power to levy an excise tax on cigarettes up to twenty per cent of their retail sale price is to be suspended and surrendered and contracted away for possibly thirty years. This is in direct violation of the first sentence of the fourteenth amendment to the state constitution.\n\nIf such a contract pledging the proceeds of certain excise taxes to the payment of certain bonds is valid, then all of the state's revenues from excise taxes can be so pledged from time to time, with the result that the legislature at some future time may find all available sources of revenue thus contracted away, and the operation of the state government would either be seriously curtailed or halted altogether for lack of funds. This is the logical result arrived at, if the position adopted by the majority decision is sound.\n\nThe majority says that such a situation will never come to pass because (among other reasons) there have been thirty-one regular sessions of the legislature since 1889 and the general fund has not been depleted in this manner, and because we should have faith in the integrity of future legislatures. If these reasons were sound, we would not need any provisions in our constitution limiting the power of the legislature in regard to taxation. The answer is that the people saw fit in 1930 to place the fourteenth amendment in their state constitution, and, until it is repealed or amended by them, it is the duty of the courts to enforce this provision and to declare invalid any legislation which violates its plain meaning.\n\nThe United States supreme court has held an act of Congress invalid as being in contravention of a tax limitation\n\nprovision of the Federal constitution (Art. I, § 9). The legislative enactment attempted to levy a stamp tax on foreign bills of lading in the face of the constitutional provision that no tax or duty shall be laid on articles exported from any state. Speaking for the court, Mr. Justice Brewer in Fairbank v. United States, 181 U.S. 283, 45 L. Ed. 862, 21 S. Ct. 648, said:\n\n\"The constitutionality of an act of Congress is a matter always requiring the most careful consideration. The presumptions are in favor of constitutionality, and before a court is justified in holding that the legislative power has been exercised beyond the limits granted, or in conflict with restrictions imposed by the fundamental law, the excess or conflict should be clear. And yet, when clear, if written constitutions are to be regarded as of value, the duty of the court is plain to uphold the Constitution, although in so doing the legislative enactment falls. The reasoning in support of this was in the early history of this court forcibly declared by Chief Justice Marshall in Marbury v. Madison, 1 Cranch, 137, 177, and nothing can be said to add to the strength of his reasoning. His language is worthy of quotation:\n\n\"'The Constitution is either a superior paramount law, unchangeable by ordinary means, or it is on a level with ordinary legislative acts, and, like other acts, is alterable when the legislature shall please to alter it.\n\n\"'If the former part of the alternative be true, then a legislative act contrary to the Constitution is not law; if the latter part be true, then written constitutions are absurd attempts, on the part of the people, to limit a power in its own nature illimitable.\n\n\"'Certainly all those who have framed written constitutions contemplate them as forming the fundamental and paramount law of the nation, and, consequently, the theory of every such government must be that an act of the legislature repugnant to the Constitution is void.\n\n\"'This theory is essentially attached to a written constitution and is consequently to be considered, by this court, as one of the fundamental principles of our society.\n\n\"'It is emphatically the province and duty of the judicial department to say what the law is. Those who apply the rule to particular cases must of necessity expound and interpret that rule. If two laws conflict with each other, the courts must decide on the operation of each.\n\n\"'So if a law be in opposition to the Constitution; if both the law and the Constitution apply to a particular case, so that the court must either decide that case conformably to the law, disregarding the Constitution, or conformably to the Constitution, disregarding the law, the court must determine which of these conflicting rules governs the case. This is of the very essence of judicial duty.\n\n\"'If, then, the courts are to regard the Constitution, and the Constitution is superior to any ordinary act of the legislature, the Constitution, and not such ordinary act, must govern the case to which they both apply.'\" (Italics mine.)\n\nThe basis of the majority decision in upholding this contract is substantially that none of the provisions of our state constitution relating to taxation limit the power of the legislature to levy excise taxes, and that, therefore, the provisions of Art. VIII and of the fourteenth amendment have no bearing on this case. In view of the fact that practically all of the state's revenue derived from taxation which is available to pay the expense of operating the state government is produced by the levy of excise taxes, the decision adopts an interpretation of these two constitutional provisions which, to my mind, renders them entirely inoperative.\n\nIn support of their position, the majority cite State v. Sheppard, 79 Wash. 328, 140 P. 332, in which a peddlers' licensing act was sustained as being an exercise of the taxing power on the authority of McKnight v. Hodge, 55 Wash. 289, 104 P. 504, 40 L. R. A. (N.S.) 1207. The annual license fees prescribed by the act were:\n\n\"(1) Peddler on foot $100.\n\n\"(2) Peddler with one horse and wagon, $150.\n\n\"(3) Peddler with two horses and wagon, $250.\n\n\"(4) Peddler with any other conveyance, $300.\"\n\nThese license fees were payable to the respective county treasurers who issued the licenses. The defendant in that case, a peddler who had failed to take out a license, contended that the law was unconstitutional in that it did not state the purpose to which such license fees were to be applied. This failure, it was asserted, violated § 5 of Article VII of the state constitution, which reads:\n\n\"No tax shall be levied except in pursuance of law; and every law imposing a tax shall state distinctly the object of the same, to which only it shall be applied.\"\n\nThis court in that case held that the provisions of Art. VII applied only to the taxation of property and that § 5 of that article did not apply to peddlers' license fees. It is to be noted that neither the interpretation of Art. VIII nor of the fourteenth amendment (which was later adopted) was involved in the Sheppard case, supra, and hence the sweeping language in the decision to the effect that the only taxes mentioned anywhere in the constitution were property taxes was not necessary to the decision. Furthermore, this case was decided in 1914 which was long prior to the adoption of the fourteenth amendment.\n\nIn the recent case of State ex rel. Collier v. Yelle, 9 Wash. 2d 317, 328, 115 P.2d 373 (decided in 1941), this court in discussing the scope of the fourteenth amendment said:\n\n\"In the case of State ex rel. Hart v. Clausen, supra [113 Wash. 570, 194 P. 793, 13 A. L. R. 580], this court held valid an act of the legislature known as the veterans' equalized compensation act, enacted at the extraordinary session of the legislature in 1920, and approved by the voters of the state November 2, 1920, found in Laws of 1920, Ex. Ses., chapter 1, p. 7. Upon application for a writ of mandamus filed in this court, a writ was issued directing the state auditor to issue a warrant pursuant to the act, this court being of the opinion that a moral obligation on the part of the state to recognize the services of its citizens in the armed forces of the United States during the World War was sufficient to sustain the taxing power of the state. This latter case falls within a well-recognized class in which acts for the relief of veterans, enacted after the service was rendered, have been held valid.\n\n\"If it be suggested that the fourteenth amendment to the state constitution applies only to taxes levied against property, as that word is defined in the amendment, and that such taxes as support the motor vehicle fund are neither property taxes nor are they levied, such an argument would be untenable. The first sentence of the amendment reads as follows: 'The power of taxation shall never be suspended, surrendered or contracted away.' This, of course, refers to all taxes collected by the state, including property,\n\nexcise, and all other taxes. The amendment, then, in scope covers all the state's power to levy taxes.\n\n\"In the second sentence of the amendment, above quoted, the opening words 'all taxes' apply to the first clause of the sentence, and also to the last clause, 'shall be levied and collected for public purposes only.'\n\n\"In referring to privilege taxes, the state sales tax, and similar exactions, this court has repeatedly referred to such taxes as 'levied.' Shell Co. v. State, 113 Wash. 632, 194 P. 835; Morrow v. Henneford, 182 Wash. 625, 47 P.2d 1016; Spokane v. State, 198 Wash. 682, 89 P.2d 826. The legislature, in Laws of 1935, chapter 180, p. 726, § 31, relating to the compensating tax, used the word 'levied,' and the same word is found in Rem. Rev. Stat. (Sup.), § 8327-23 [P. C. § 7068-93] (Laws of 1933, chapter 58, p. 326, § 23), referring to the gasoline tax.\n\n\"In the case of State ex rel. Hamilton v. Martin, 173 Wash. 249, 23 P.2d 1, this court, in considering chapter 65, Laws of 1933, p. 336, and chapter 8, Laws of 1933, p. 103, known, respectively, as the 'bond act' and the 'relief act,' held the last act constitutional, after considering the fourteenth amendment in connection with the problems presented. A portion of the revenues accruing to the motor vehicle fund were appropriated to the retirement of bonds issued pursuant to the relief act. From the opinion in the latter case, it is evident that this court considered the fourteenth amendment as applying to revenues accruing to the motor vehicle fund with which we are here concerned.\" (Italics mine.)\n\nThe majority opinion states that the quoted language was dicta. It is to be noted, however, that this case was heard En Banc and that eight of the nine members of the court concurred in the opinion. Whether or not the quoted language was necessary to the decision, the interpretation there placed upon the first sentence of the fourteenth amendment, to-wit, that it applies to all taxes collected by the state, including property, excise, and all other taxes, seems to me to be the only possible interpretation of it.\n\nThe holding of the majority is based upon the untenable premise that when the people of this state in 1930 amended § 4 of Art. VII of the constitution, which formerly read:\n\n\"The power to tax corporations and corporate property shall not be surrendered or suspended by any contract or grant to which the state shall be a party,\" (italics mine.)\n\nto read:\n\n\" The power of taxation shall never be suspended, surrendered or contracted away, . . .\" (italics mine.)\n\nthey did not mean all power of taxation but only the power to tax real and personal property.\n\nFrom a practical standpoint, if the majority decision is sound, the new limitation placed upon the legislature's power of taxation by this amendment would amount to virtually nothing. Under the seventeenth amendment (adopted in 1944), the taxation of real and personal property is limited to forty mills, with certain exceptions. The only portion of the real and personal property taxes which the state receives is the proceeds of the two-mill levy which is allocated exclusively to the support of institutions of higher learning as provided in chapter 253 of the Laws of 1945. There are, therefore, no taxes to which the amendment could apply, if excise taxes are excluded from its operation.\n\nThus, if the people did not intend by adopting the fourteenth amendment to prevent the legislature from suspending, surrendering, and contracting away the power to levy excise taxes, they accomplished nothing in their attempt to protect the power of taxation.\n\nIn the majority opinion, the rule is stated that words used in a constitution are to be understood in their usual and ordinary sense. Applying this rule of construction to the first sentence of the fourteenth amendment, I arrive at the very opposite interpretation to that adopted by the majority.\n\nThe power of taxation has been judicially defined as \"a power to enforce contributions from persons and property for the maintenance of the government.\" Shurtleff v. Chicago, 190 Ill. 473, 60 N. E. 870.\n\nIt has also been defined as \"the power to take from the citizen a sum for the support of the government, whether that be national, State or municipal.\" Hoefling v. San Antonio, 85 Tex. 228, 20 S. W. 85, 16 L. R. A. 608.\n\nThis court very recently said:\n\n\"We repeat, a tax is an enforced contribution of money, assessed or charged by authority of sovereign government for the benefit of the state or the legal taxing authorities.\" State ex rel. Seattle v. Department of Public Utilities, 33 Wash. 2d 896, 207 P.2d 712.\n\nIn 51 Am. Jur. 35, Taxation, § 2, taxation is defined as follows:\n\n\"Taxation, in its broadest and most general sense, includes every charge or burden imposed by the sovereign power upon persons, property, or property rights for the use and support of the government and to enable it to discharge its appropriate functions, and in that broad definition there is included a proportionate levy upon persons or property and all the various other methods and devices by which revenue is exacted from persons and property for public purposes.\"\n\nFrom these definitions of the terms \"power of taxation,\" \"tax,\" and \"taxation,\" it would seem very clear that the people meant when they adopted the fourteenth amendment that the first sentence should apply to all power of taxation which the state possessed. They must be held to have intended to include the power to levy excise taxes as well as property taxes. At the present time, as pointed out above, the state is dependent upon excise taxes for practically all of its operating revenue, and to construe the first sentence of the amendment as applicable only to property taxes is to hold that this important constitutional limitation has no meaning and could have been omitted entirely.\n\nWhat has been said herein does not mean that such legislation as is here under consideration cannot be validly enacted. The object sought to be accomplished by chapter 180 of the Laws of 1949 may be accomplished in compliance with the state constitution in the same manner as was done with respect to the veterans' equalized compensation act of 1920, which was upheld by this court in State ex rel. Hart v. Clausen, 113 Wash. 570, 194 P. 793, and in State ex rel. Hart v. Clausen, 117 Wash. 260, 201 P. 30.\n\nThe people of this state have placed in their constitution certain limitations on the power of the legislature to incur indebtedness and to levy taxes, and it is the function of the\n\ncourts to interpret and enforce those provisions. The applicable principles are well stated in 11 Am. Jur. 651, in § 44, where, referring to state constitutions, the author says:\n\n\"A written Constitution is not only the direct and basic expression of the sovereign will, but is the absolute rule of action and decision for all departments and offices of government with respect to all matters covered by it and must control as it is written until it shall be changed by the authority that established it. No function of government can be discharged in disregard of, or in opposition to, the fundamental law. The state Constitution is the mandate of a sovereign people to its servants and representatives. No one of them has a right to ignore or disregard its mandates; and the legislature, the executive officers, and the judiciary cannot lawfully act beyond the limitations of such Constitution.\" (Italics mine.)\n\nHaving due regard to the presumption of validity to which all acts of the legislature are entitled, I am, for the reasons herein stated, constrained to dissent from the majority decision in this case.\n\nThe judgment of the trial court should be affirmed.\n\n",
    "body_length": 192092,
    "citedas": [
      "211 P.2d 651",
      "35 Wash. 2d 1"
    ],
    "attorneys": "The Attorney General and Lyle L. Iverson, Assistant, for appellants. Willard J. Wright, Joe S. Pearson, Solie M. Ringold, and Stimson Bullitt, for respondent. T. David Gnagey, Ralph C. Hove, Clay Nixon, Joseph P. Adams, D. Van Fredenberg, and Walthew, Gershon, Yothers \u0026 Warner, amici curiae.",
    "category": [
      "252"
    ],
    "judges": "En Banc. Simpson, C. J. Beals, Schwellenbach, Grady, and Hamley, JJ., concur. Hill, J., dissenting. Donworth, Robinson, and Mallery, JJ., concur with Hill, J. Donworth, J., dissenting. Hill, Robinson, and Mallery, JJ., concur with Donworth, J.",
    "citation_count": 6
  }
}
