{
  "id": "IJA9QmYBTlTomsSBnlXA",
  "document": {
    "title": "UNITED STATES v. DANSKER",
    "full_title": "UNITED STATES of America, Plaintiff, v. Norman DANSKER, Joseph Diaco, Steven Haymes, Warner Norton, Donald Orenstein, Nathan L. Serota, Andrew Valentine, Investors Funding Corporation of New York and Valentine Electric Company, Defendants",
    "jurisdiction": "D. New Jersey",
    "date": "1977-06-02T00:00:00.000Z",
    "docket": "74-555",
    "body": "LACEY, District Judge.\n\nThe defendants have moved for a new trial on Count II of the indictment, the count on which their conviction at trial was upheld by the Court of Appeals for the Third Circuit, 537 F.2d 40 (3d Cir. 1976), cert. denied, 429 U.S. 1038, 97 S. Ct. 732, 50 L. Ed. 2d 748 (1977). Additionally, they move for an evidentiary hearing to adduce support for said motion. For the reasons hereinafter set forth, the application for an evidentiary hearing and the motion for new trial are denied.\n\nThe movants preface their legal arguments with what is an unacceptable analysis of the evidence in the case. Their principal theme is that their convictions resulted from the unsupported testimony of the government witness, Arthur Sutton, of whose criminal propensities the jury, because of prosecutorial wrongdoing, was ignorant. Thus, the IFC defendants (Dansker, Haymes and Orenstein) jointly state (Brief in Support of Motion, 4-5):\n\n. . . The Government's entire case . . . rested . . . squarely and exclusively on the live, in-court and uncorroborated testimony of Arthur Sutton. . . .\n\nAt another point, the same defendants argue (Id. at 6):\n\n. . . Sutton was portrayed to the jury as a businessman of integrity and honesty. . . .\n\nThis distorts the record. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\" The proof against the defendants was overwhelming; and the evidence came from a variety of sources, not simply from an \"uncorroborated\" Sutton. Nor did the government depict Sutton to the jury as a \"businessman of integrity and honesty.\" Not only was his total involvement in the illegal activity charged made sharply evident at trial, but over the objection of all defendants, the government was permitted to show that in the months preceding the time covered by the indictment, Sutton participated with the IFC defendants in embezzling corporate funds from IFC through the use of fraudulent means. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\"\n\nGiven the defendants' grossly inaccurate characterization of the facts of the case, and the support they seek to derive from those facts, as thus represented, it is necessary that I review extensively the evidence as it related to the charges against the several defendants. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\"\n\nI. THE NATURE OF THE CHARGES\n\nAs tried, the indictment consisted of a substantive count to bribe Mayor Ross (Count II), a substantive count to bribe Nathan Serota (Count III), and a count charging a conspiracy to bribe Ross and Serota (Count I). The Court of Appeals reversed the judgments of conviction of all defendants under Count III and vacated the convictions under Count I. The case was remanded to this court with directions to enter judgments of acquittal for the defendants under Count III and for further proceedings as to Count I. The judgments of conviction on Count II were affirmed.\n\nUnderlying the arguments of movants here is a basic misconception: that because the \"bribe\" of Serota was held not to be a crime, the evidence related to the Serota transaction must, on this application, be ignored. To the contrary, it was a necessary first step to \"take care\" of Serota before Ross could be approached. 537 F.2d at 45. Thus, in sustaining the conviction on Count II, the Court of Appeals, per Chief Judge Seitz, stated:\n\nIn any event, nearly all of the evidence concerning the defendants' dealings with Serota would have been admissible even if Count III had not been included in the indictment. The Serota transaction was an integral part of the defendants' scheme to obtain the variances needed for their project. Hence, evidence concerning it was clearly relevant to show the defendants' motive in approaching Ross with their proposition as well as their modus operandi. Any prejudice suffered by the defendants from the balance of this evidence was minimal and certainly does not entitle them to a new trial.\n\n537 F.2d at 52.\n\nDiaco, to make Ross more amenable to his bribe offer when he first approached Ross, said:\n\nThat fellow Serota is killing you -- publishing ads knocking this project. With Serota there is going to be no problems. Serota has been taken care of.\n\nTr. 648. Ross then asked:\n\nDo you know what you are talking about?\n\nId. Diaco responded:\n\nI guarantee it. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\"\n\nId. The path was now clear for the planned advance to Ross. In this light I shall now review the testimony.\n\nII. SUTTON AS \"PORTRAYED\" TO THE JURY\n\nThe evidence as presented by the government made it starkly plain that if the defendants on trial were corrupt, venal and criminal, so was Sutton. Indeed, because the positions of Sutton and the IFC defendants were precisely the same, that is, men so desperate to avoid losing millions of dollars that they combined to bribe a public official, the government had no choice but to paint Sutton with the same brush of guilt, under its theory of the case.\n\nAs I have noted under I, supra, the bribery of Ross was practical only after Serota's opposition to the George Washington Plaza Project [GWPP] had been stilled. The government elicited from Sutton on direct examination his admissions that he was involved in not only raising but passing cash to both Serota and Ross, and in thereafter engaging with the IFC defendants in the fraudulent utilizing of GWPP \"closings\" to obtain reimbursement. He admitted that it was he who had first proposed the bribery scheme to the IFC defendants. He stated that his motive -- and theirs -- was to prevent financial ruin. He did not attempt to mitigate his guilt by claiming that he had been coerced, or threatened with physical injury, into committing the crime charged. He described his meetings with Valentine and how he, Sutton, had become involved in the corrupt scheme after Valentine told him that the project's success required two \"problems\" to be resolved, Serota and Ross. He admitted he had passed on the cash to Diaco for delivery to Serota. He related too how he had arranged for Ross to receive the first $100,000; and, of course, through Ross' testimony and tape recordings the government tendered evidence that Sutton was present with Diaco at two meetings with Ross, including the occasion when Ross received from Diaco $100,000 on account of the $500,000 Ross was to receive overall. While highly condensed, this brief description of but a small portion of the government's case suffices to show that on the government's case Sutton was portrayed to the jury as exactly what he was, a dishonest businessman utterly without integrity.\n\nMoreover, in addition to the impeachment material brought out on Sutton's direct examination, the jury was given, through skilled and lengthy cross examination, a penetrating insight into Sutton's background. As the Court of Appeals observed:\n\nMoreover, we do not believe that the balance struck by the district court unduly restricted the non-IFC defendants' right to conduct a meaningful cross-examination. The evidence before the jury was more than sufficient for it to conduct a \"discriminating appraisal\" of Sutton's credibility. See United States v. Mallah, 503 F.2d 971 (2d Cir. 1974). The jury was fully aware of his prior conviction, his expectations of leniency and his previous unlawful activities. In addition, his credibility was repeatedly and severely assailed from every conceivable angle over a cross-examination which covered more than 1,100 pages of a 2,600 page transcript. In this context, we find no error in the district court's decision to exclude a few questions as to the title of a tax statute which were, at best, of limited probative value in discrediting Sutton's testimony. To the extent that any defendant other than Valentine and Valentine Electric seeks to advance this argument we find it equally lacking in merit.\n\n537 F.2d at 60.\n\nThe cross examiners were, of course, most familiar with numerous intimate details of Sutton's background. At trial I noted the thoroughness of their investigation into Sutton's past. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\" Dansker's counsel, for example, elicited from Sutton that he had sold an automobile to a Mr. Wilner at the County Trust Company. Tr. 1847-48.\n\nOrenstein's counsel asked Sutton about his relationships with one Robert Brown (Tr. 2132; 2294-95); had Sutton admit that he and a Mr. Comras were attempting to acquire a Rolls Royce automobile agency (Tr. 2170); brought out that Sutton's Rolls Royce was a model unlike Serota's (Tr. 2172); and knew that Tony Cutrupi's daughter worked for Sutton (Tr. 2183).\n\nCounsel inquired whether Sutton had made certain statements to one Dennis Smith who, counsel knew, had done publicity work for Sutton in the past (Tr. 2463). They knew who Sutton's neighbors and social friends were (Tr. 2462); that Sutton had told someone he expected at most \"a slap on the wrist\" (Tr. 1698); that he owned or had owned 22 corporations (and the names of most of them) (Tr. 1713-16); that he was an experienced builder (Tr. 1719-21); and that he had relationships with Comras \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\" (Tr. 1721-23; 2188) [and defendants raised in summation why Comras had not been called as a witness by the government (Tr. 3378-80) (Valentine's counsel); (Tr. 3652; 3655) (Haymes' counsel); (Tr. 3710) (Dansker's counsel)]; \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\" that Sutton was involved in various leases (Tr. 2188); and that \"Tony C\" was not Tony Cutrupi. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\"\n\nThus, as they went into Sutton's past, they dredged up material that reflected meticulous preparation of the defense. This material, moreover, was used to advantage by the learned and skilled defense attorneys, whose background speaks for itself.\n\nThe cross-examination of Sutton on the substantive aspects of the case left him unshaken in his basic themes. On the other hand, the impeachment aspect of his cross was relentless. He admitted he had pleaded guilty to a one-count information but had not yet been sentenced 5-6 months later. Tr. 1696. He \"hoped to win leniency\" on sentencing by his testimony. Tr. 1698. He \"hoped\" the court would bear his testimony in mind when it imposed sentence. Tr. 1698-1701.\n\nTwo months after indictment he started to cooperate with the government and had met with them 7-8 times a month, at least in the early months. Tr. 1701-11. He decided to cooperate because he wanted to help himself. Tr. 1711.\n\nHe was taken through the Fed.R.Cr.P. 11 guilty plea proceedings and his admissions of guilt (Tr. 1791; 1938 et seq., -2527; 2539), and he admitted he was allowed to enter a plea to a one-count information when he had committed crimes for which he could go to jail for many years. He admitted he had committed the crime of conspiracy to commit the crime of bribery. Tr. 2527-30.\n\nSutton had testified before the Grand Jury. Defendants had his transcript and questioned him about discrepancies between his trial and grand jury testimony.\n\nAlso, defendants submitted, and I gave, jury charges on Sutton's credibility, including the so-called \"accomplice\" charge, and references to his expectation of leniency and his conviction of a crime.\n\nThe cross-examination by these experienced lawyers, when it was done, had not portrayed Sutton as a businessman of integrity and honesty. And if there still is doubt about the inaccuracy of defendants' present claim that it did, it is removed by a review of the summations given by their trial counsel as they commented about the testimony they had thereby developed. In the words of the Court of Appeals, 537 F.2d at 60, the jury had been given an opportunity for a \"discriminating appraisal\" of Sutton.\n\nHe had been shown to be a greedy opportunist who corrupted a political campaign and, by his own voice on tape, the jury heard him discuss bribery with Diaco and Ross. This was not a portrayal of innocence.\n\nSignificantly, not one counsel argued to the jury what is argued by counsel involved in this proceeding, that the government had misleadingly \"portrayed\" Sutton as \"a businessman of honesty and integrity.\" \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\" Indeed, if such an argument had been made, it would have been without basis and, if objected to, would have been stricken by me.\n\nMovants, to support their claim of the government's obscuring Sutton's criminality, refer to certain portions of the record. Their references fail to support their argument. The government's opening made it clear that Sutton was as guilty as the defendants on trial, that he had admitted his guilt by pleading guilty, and that he was as much a part of the illegal scheme as any of the defendants on trial. See Tr. 490-508. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\"\n\nI find that at trial Sutton was portrayed to the jury as a crooked businessman who readily stooped to corruption, a man who lived beyond his means, who readily accepted the fact that Ross and Serota should be bribed, and who sat in on bribe discussions with Ross and Diaco. He was portrayed as a man who quickly agreed, in the pre-conspiracy payments, to make it possible for the controlling persons of IFC, Dansker, Haymes and Orenstein, to steal from their corporation through the fraudulent closings device. He was portrayed as a man who had cooperated with the government only after he knew he had been \"caught,\" and as a man who hoped that his testimony against the defendants would draw as a sentence no more than a \"slap on the wrist.\"\n\nIndeed, all trial counsel took the foregoing aspects of Sutton, as revealed at trial, and used it in arguing that their clients were respectable businessmen as contrasted with Sutton. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\"\n\nIII. THE CASE AGAINST DIACO AND VALENTINE. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\"\n\nA. The Serota Transaction\n\nThere seems to be little if any dispute about the fact that Serota was vocally and forcefully opposed to the GWPP and that Sutton and others set out to \"buy\" Serota's silence and withdrawal of his opposition. It is likewise not seriously disputed that the attempt to bribe Ross had to wait until Serota had been \"taken care of.\" Moreover, that a nominee (Orenstein's brother-in-law) was named as the \"buyer\" of the Serota apartment in a contract which reflected anything but a routine sale is likewise not in contention, nor is so much of Sutton's testimony that $900,000 was to go to Serota for an apartment valued at $500,000; that Serota could live in the apartment rent-free until September 30, 1978; that he was given the option, exercisable at any time prior to three months before the expiration of the so-called \"sublease,\" to repurchase the apartment for $300,000, representing quite obviously a $600,000 \"payoff;\" and that he, Serota, agreed to withdraw his opposition to the project. See 537 F.2d at 45. What is in dispute is Sutton's testimony naming the various defendants as participants in the Serota transaction, and that Serota got, in addition to the consideration stated in the contract, $200,000 in cash. Id.\n\nI start with Diaco. Sutton's testimony links him to the Serota \"pay-off.\" The jury had abundant corroboration of Sutton's statement. Thus Ross testified that on May 26, 1974, he met with Sutton and Diaco at the Forum Diner. He repeated what he had been told by Diaco one week before (Tr. 648), that Serota had now been \"taken care of\" and Sutton, in Diaco's presence, affirmed it. Tr. 854. It was at this latter meeting when Ross received $100,000 from Diaco as testified to by Ross and corroborated by recording. Tr. 854-63. If Diaco had nothing to do with Serota, how was he able to state to Ross on May 19, 1974 that Serota had been \"taken care of\"? It is of some significance too that, according to Ross, Diaco first proposed to him that he, Ross, could be paid off by buying some property from him, as, of course, had been done with Serota. Tr. 771-73.\n\nMoreover, one cannot read the transcripts of the Ross-Diaco conversations without perceiving the overpowering inference that Diaco had an intimate knowledge of what was at stake in connection with the GWPP, and that in the sequence of things, Diaco knew it had been decided, by whoever had constructed the scheme, that Ross could be dealt with only after Serota's silence had been purchased.\n\nThis then is corroborative of Sutton's testimony that, following certain conversations he had had with Valentine, Diaco came by and took cash to the Serota closing to \"take care of\" Serota.\n\nObviously, the case against Valentine, in reference to the Serota transaction, is bolstered by the materials just covered relating to Diaco's involvement. Partners in at least one building project, Valdiac (an acronym for Val entine and Diaco), and principals in Valentine Electric Company, an electrical contractor, both had indicated a desire to get the electrical contract on the GWPP. Cf. Tr. 751-53.\n\nThus Valentine's claim, like Diaco's, that Sutton's testimony as to their alleged criminal involvement in the Serota transaction was uncorroborated must be rejected.\n\nSutton testified that Valentine had come to him on or about April 14, 1974 to tell him he had two problems, Serota and Ross, in the way of GWPP. Tr. 1354, 1366-67, 1380, 1396. Valentine did not deny having meetings with Sutton, thus confirming the numerous diary entries made by Sutton. He simply claimed they were unrelated to bribery of Ross or pay-offs to Serota. Yet, if, contrary to what the government contends, Valentine did not construct the first version of the Serota transaction, who did? \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\" The first closing took place on May 10, 1974. As Orenstein's counsel brought out on his cross-examination of Sutton, the latter had not even met Serota until he was introduced to him on May 11, 1974 by Orenstein who had been at the May 10, 1974 closing. Tr. 2170. Sutton testified Orenstein had telephoned him from the closing to ask who Diaco was and why he was there. No one denied that Diaco was there.\n\nMoreover, on April 14, 1974, the day, as Sutton testified, that Valentine first broached the subject of Serota and Ross, a toll call went from Valentine Electric Company to Serota. Tr. 1368-72; Tr. 1502-74. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\" No explanation of this was ever forthcoming at trial from either Valentine or Serota.\n\nAfter the second closing on May 15 on the Serota transaction, Sutton testified, he telephoned Valentine to complain that Serota was not keeping his end of the bargain. Valentine, he testified, said, \"We will get back to Mr. Serota and we will call you back.\" Tr. 1502. Ex. G-723 shows two telephone calls that day from Valentine Electric Company to Elota Realty. Ex. G-723a reflects that same evening there was a telephone call from Serota's home to Valentine Electric Company. Later, according to Sutton, Valentine called Sutton and told him matters were now taken care of and that Serota would issue a statement approving the project. That this is in substance what happened is clear; and any doubt at all about it is removed by Serota's grand jury testimony which was read into the record.\n\nAgain there was no explanation, even on summation, of why Valentine and Serota were conferring. Instead, while a violent attack was made upon Sutton's credibility, Valentine's counsel avoided any mention of his client doing (or not doing) business with Serota; and did not deny the government's claim that his client had been the architect of the Serota-Ross bribery scheme. Equally significant, in view of the government's claim that Diaco and Valentine were working together on the twin problems of Serota and Ross, Valentine's counsel offered no explanation of why Diaco, the vice president of Valentine Electric Company (which Valentine's counsel also represented), would be able to announce to Ross, as Ross said he had, that Serota had been \"taken care of.\" \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\"\n\nB. The Attempted Bribe of Ross\n\nAs to Diaco, it appeared that each time Valentine and Sutton had a conversation relating to bribing Ross, Diaco would shortly after be in contact with Ross. This significant sequence was never explained or even dealt with at trial by either Valentine or Diaco. The inference was clear: Valentine's dealings with Sutton were matched by Diaco's dealings with Ross.\n\nThe case against Diaco is strengthened when it is realized that the entire scheme involved, as a prelude to bribing Ross, the silencing of Serota. Here, as Ross testified, Diaco, when he first approached Ross, told him Serota had been \"taken care of.\" \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\" Now he, Diaco, was ready to deal with the second of the two \"problems,\" namely, Ross.\n\nTo argue that Diaco's conviction depended on Sutton's uncorroborated testimony is absurd. Indeed, at trial his counsel, on summation, dealing with Diaco's meetings with Ross, obviously unable to refute the tape-recorded evidence of his client's guilt, conceded the payment of cash to Ross. His only argument was that Diaco was a \"fish . . . my poor client . . . lured into that position by the Mayor.\" Tr. 3347.\n\nNor did counsel for Valentine and the company deny Diaco had attempted to bribe Ross, or that $100,000 in cash had been delivered to Ross by Diaco. Instead he berated Ross for allegedly using the matter, and his reporting of it to the United States Attorney, for political purposes. Tr. 3360.\n\nSince it can hardly be denied that Diaco gave Ross $100,000 in cash, it is of interest to ask where the cash came from. Did Diaco expend his own funds, or his company's funds, or Sutton's (passed through Valentine)?\n\nThe only one to offer an explanation of this was Sutton. This leads to analysis of this phase of the case as it relates to Valentine. Thus, Sutton testified to a meeting with Valentine at Sutton's office on May 24, 1974. This followed a meeting Diaco and Ross had earlier that day when Diaco gave his true identity (theretofore he had used the name DiGiacomo) and gave Ross a business card showing Diaco to be a vice president of Valentine Electric Company. Tr. 204-05; 751-52.\n\nSutton testified that, at Valentine's direction, he gave Valentine $100,000 in cash for the first payment to Ross. Valentine, he added, agreed to help him raise another $200,000, but required that Sutton give him a check for $270,000 (the extra $70,000 was to arrange for conversion to cash); \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\" and Valentine agreed to arrange a meeting with Ross at the Forum Diner in Paramus. Tr. 1576-82. Once again, such a statement by Valentine was followed shortly by Diaco calling Ross to arrange the meeting with him as Valentine called back Sutton to advise him it had been arranged. The meeting was held, with Diaco (not Valentine) again in attendance, and, as Ross testified, Diaco took from his car a folder with $100,000 cash and gave it to Ross. Tr. 830-47; 857-63. Valentine's counsel offered no explanation of how Diaco got the $100,000 to pay Ross. The jury was left to infer that, in view of the repeated pattern of activity, with Valentine dealing with Sutton and Diaco then taking over to deal with Ross, it had gone from Valentine (after he got it from Sutton) to Diaco.\n\nNor was Sutton's testimony about the $270,000 uncorroborated. Sutton, when he gave Valentine his check, knew he could not cover it. Thus, he made several telephone calls to Haymes in what was an unsuccessful attempt to raise funds through another closing. Tr. 1593. As a result, the check was dishonored when put through for deposit by Valentine. In corroboration of Sutton's testimony, the government put into evidence Valentine Electric Company's deposit slip for $270,000 along with the dishonored check.\n\nValentine's counsel, without a shred of evidence to support his summation argument, but mindful of the strong corroboration given Sutton's testimony by the \"bounced\" check, endeavored to relate the $270,000 to some other transaction between Sutton and Valentine. He floundered; there was no other transaction. Tr. 3384-85.\n\nIn summary, the case against Diaco was overwhelming. As to Valentine, it was only slightly less so. Counsel for Valentine (and his company) gave no explanation either for Diaco's conversations and meetings with Ross which invariably followed an appropriate discussion between Valentine and Sutton that such conversations and meetings should take place, or for the congruence between the parallel sequence of the two sets of conversations. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\" In addition to his failure to explain how Diaco came into possession of the $100,000 cash which he paid over to Ross, and why Diaco, the Valentine Electric Company's vice president, would participate in such a transaction, counsel did not deal with Ross' testimony that Diaco told Ross, to whom he gave a company business card, that he had gotten involved in the matter so that he could obtain the electrical work on the project (Tr. 3392-92), paralleling what Valentine told Sutton. As to both, therefore, it can be said that Sutton's testimony was not only corroborated; it was but a portion of what was a tightly proved case of criminality against them.\n\nIV. THE CASE AGAINST THE IFC DEFENDANTS -- DANSKER, HAYMES AND ORENSTEIN\n\nA. Introduction\n\nI have to a degree already touched upon the unqualified assertion of these defendants that their convictions rested upon the uncorroborated testimony of Sutton alone. 1059-1061, supra.16 I shall now examine this claim in detail in light of all the evidence.\n\nIn this review, it must be recalled that the evidence against these defendants related not only to the attempt to bribe Ross but also to the Serota transaction. The setting aside of their convictions on Counts I and III does not mean that, on this application, the role of these defendants in silencing Serota's opposition to their project is not to be considered. See I, supra, 1060-1061.\n\nThe government's theory, as perceived by the Court of Appeals, 537 F.2d at 52, leads to but one conclusion: one of the strongest pieces of circumstantial evidence against all the defendants, insofar as the actual pay-off to Ross is concerned, is their participation in the Serota transaction. This is because giving Serota approximately one-half million dollars or better \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\" simply to silence him was without logic or rationality if the wrongdoing stopped there. Ross had to be won over as well. One can assume what the IFC defendants would have said to Sutton if he had told them simply that Serota had to be \"bought off\" under the terms which are so well documented. No imagination is required. The obvious response would be, \"What does that get us?\"\n\nAccordingly, while I shall deal separately with the Serota and Ross transactions, for purposes of relating the evidence to each, it should be understood that I reject as false the basic premise underlying movants' analysis of the case, that is, that on this motion, only the evidence directly related to bribing Ross is to be considered.\n\nCutting across both the Serota transaction and the bribery of Ross is the Sutton testimony of his participating with the IFC defendants in their embezzlement of money from their company and their fraudulent use of the Sutton-IFC relationship to funnel money to Sutton, for \"kick-backs\" to them, concealed in the sums going to Sutton legitimately through periodic closings under his loan agreement with IFC. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\"\n\nI fail to grasp how the defendants can seriously label \"uncorroborated\" Sutton's testimony as to how he and the IFC defendants embezzled from IFC, first, cash they diverted to themselves, and later, cash to insure that Sutton could in turn pay off Serota and Ross.\n\nThe documentation was abundant, the accounting easy to comprehend. Periodic \"closings\" were held to forward IFC funds to Sutton as the GWPP moved along and land sites were acquired. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\" The accountants hired by the defendants had complete access to all of IFC's records which had been subpoenaed by the government. The defendants were unable to show one closing which represented totally payment for legitimate expenditures (and conversely, not for illegitimate ones to which Sutton had testified).\n\nThe defendants' inability to impeach or contradict Sutton's testimony on the diversion of IFC funds would have been of less significance if the amounts involved had been so small as to be easily concealed in the legitimate payments made. The fact is, however, that Ex. G-205, on which Sutton had listed various specific sums thus disbursed by him and which were in turn given to him by these defendants through the \"closing\" device, reflects almost $5,000,000 was involved. Given this analysis, it cannot be said that Sutton's testimony as to how IFC money was illegally transferred to him was uncorroborated.\n\nTaking it one step further, Sutton's testimony as to whom, and for what, he disbursed the embezzled moneys at defendants' direction, ranged widely. He named specific persons and projects. Defendants' failure to dent seriously any aspect of this testimony is of great significance.\n\nOne transaction saw Sutton giving $50,000 cash to Orenstein for Haymes. Orenstein said that the defendants would get the cash back to Sutton, concealing it within the next GWPP closing. Tr. 1430. Sutton cashed a personal check, dated November 21, 1972 (Ex. G-119) to raise the $50,000. He also identified three other checks, totalling $75,000 (Tr. 1434), which were cashed, with the cash going to Orenstein. Ex. G-861R, 861P, 861S. The arrangement was the same: he got the cash back concealed in the next GWPP closing. Tr. 1434. No one, on cross of Sutton, was able to demonstrate this was not the case. No one contradicted what he said. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\"\n\nThe summary sheet, Ex. G-205, also referred to $145,000 given by Sutton to Laurence Labriola, a contractor. Sutton testified that Labriola had worked on Dansker's New York estate; and that Haymes had told him to pay for this work, assuring him that the same system, repayment out of the next GWPP closing, would get back the $145,000 to him. Tr. 1435-43. Sutton identified each check. Ex. G-861M through O, 861Q, 851C and D. The time spanned was December 1972 through October 1973.\n\nNo one contradicted Sutton's testimony on this aspect either. Indeed, in spite of the lengthy and skillfully conducted cross-examination, no defendant's counsel ventured into the Labriola area. Moreover, it was never even rationalized on summation by any defense counsel. The same is true of Sutton's testimony on the East Orange Phalia properties, which Sutton testified he purchased from IFC at defendants' direction (Tr. 1443-46) for $1,650,000, using the same device, a GWPP closing to get the money back.\n\nThus, Sutton's credibility was exposed along a wide front. His testimony about cash payments to Orenstein and Haymes, the Labriola payments for Dansker at Haymes' direction, and the Phalia purchase, implicated substantial documentation and several persons. The same is true as to the payments to Serota and Ross. The documentation presented corroborated his testimony. Not one person came forward to deny his assertions; and no documentation from IFC, or elsewhere, was offered to contradict him. Indeed, as now appears, these defendants (two of whom are now represented by new counsel) now admit that Sutton told the truth about paying off Serota and obtaining reimbursement from IFC therefor through the closing device (under the same arrangement used, according to Sutton, to siphon IFC funds earlier to these defendants).\n\nB. The Serota Transaction\n\nThe Serota transaction, like the Ross bribery, had its genesis in Valentine's statement to Sutton in April 1974 that the success of the GWPP depended upon the resolution of two \"problems,\" Serota and Ross.\n\nThe IFC defendants at trial forcefully resisted the government's charge that they were involved in the pay-off to Serota to buy his silence. In their unrelenting attack upon Sutton's credibility, they expressly and impliedly contended that Sutton was lying in his testimony that, after his April 1974 conversations with Valentine, he had brought the subject matter of that conversation to their attention, and had received their approval of what Valentine proposed, bribing Serota and Ross. Orenstein's counsel, who had to deal with his client's obvious presence at the two Serota closings, argued to the jury that Orenstein was there only because he had been asked by Sutton to renegotiate Sutton's contract with Serota. Tr. 529; 3605-18. Dansker's counsel flatly told the jury on opening that IFC had refused to get involved. Tr. 514-20. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\"\n\nIn all other respects, Dansker, Haymes and Orenstein, through their counsel, said and did nothing to indicate they were aware of, or involved in, the Serota transaction (except, as indicated, for Orenstein); and, of course, they never came close to conceding that Sutton had laid before them \"taking care of\" Serota and then purchasing Ross' cooperation. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\" Starkly missing at trial was defendants' concession they had utilized the GWPP closing device to reimburse Sutton for the money used to pay off Serota.\n\nOn this motion these defendants abandon their approach at trial and now state:\n\nthe case against the IFC defendants in connection with the Serota bribe was not based entirely on Sutton's testimony. Indeed, there was substantial documentary evidence establishing Serota's agreement to withdraw his public opposition to the construction of the project in exchange for money, and the IFC defendants never disputed their participation in that agreement. (They disputed only the government's claim that the Serota agreement was illegal -- a position ultimately vindicated by the Court of Appeals' reversal as to Count III). \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\"\n\nBrief in Support of Motion at 5, n.4.\n\nGiven what is in effect a concession now that Sutton's trial testimony in connection with the Serota bribe was true -- and corroborated -- it is pertinent to inquire what it was that Sutton said about it. In doing so, some repetition of testimony earlier reviewed is necessary.\n\nValentine was introduced to Sutton by a Joe Comras. Tr. 1354, 1366-67. On April 24, 1974 Valentine told him that to obtain a variance, he had to resolve two \"problems,\" Serota and Ross; and that they could be resolved by a payment of $900,000 to Serota for his apartment and $500,000 in cash to Ross and others. Tr. 1380. This was conveyed to Dansker and Orenstein almost immediately (Haymes was in Florida) and they laid out how it was to be done. Tr. 1383, 1388-92. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\"\n\nAfter the IFC approval, Sutton telephoned Valentine on April 25 to tell him he had authority to proceed but that (as Dansker had told him) the payments to Serota would have to be spread out. Tr. 1396. A telephone toll slip reflects this call. Ex. G-722. At subsequent meetings the Serota closing, set by Valentine for May 10, was discussed by Sutton with all the IFC defendants and with Valentine. Tr. 1400 et seq. Pursuant to Dansker's direction to Sutton to start raising the cash to go to Serota, accompanied by the reassurance he would be reimbursed through the usual means of GWPP closings, Sutton testified to his cashing checks, \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\" gathering cash, and, at Valentine's direction, later turning it over to Diaco for delivery to Serota at the May 10 closing. Tr. 1474-77.\n\nOn May 8 Sutton met with the IFC defendants in New York, attending a birthday party that evening for Dansker. Dansker told him that IFC had to have the payments to Serota stretched out. Tr. 1464-65. Dansker directed that Orenstein handle the closing and renegotiate the terms of the contract. Id. ; Tr. 1875.\n\nThe closing was held but aborted. Diaco and Orenstein had not known each other before; indeed, Sutton had not even met -- or heard of -- Diaco until he had stopped by, said he was Valentine's \"partner,\" and picked up the $100,000 for the closing.\n\nDiaco called Sutton from the closing to complain Orenstein was \"screwing up;\" Sutton spoke with Orenstein who took his call at the closing. Tr. 1479.\n\nImmediately after the closing was called off, Sutton met in New York with the IFC defendants that evening to discuss the Serota transaction; and Orenstein, during this meeting, telephoned Serota and arranged to meet him the next day. Tr. 1480-83. A telephone toll record supports Sutton's testimony about this call from the IFC office to Serota. Ex. G-11A.\n\nThe next day, Saturday, May 11, Valentine and Diaco met with Sutton at the latter's office, Valentine being upset that the closing had not been accomplished. Tr. 1485. Sutton then went home and shortly a Rolls Royce came up. Serota was driving and Orenstein was next to him. Tr. 1486. Serota and Orenstein told Sutton they had revised the deal and it was all worked out. Tr. 1487. Serota said he would take care of the hearings. Tr. 1488. Sutton recalled a policeman had stopped by the Rolls Royce and found Serota had no license. Tr. 1489.\n\nLater that day, at Orenstein's request, Sutton called Dansker to praise Orenstein. Telephone toll slips confirm this call, and a call to Haymes, also made at Orenstein's request. Tr. 1490-92; Exs. G-725B, G-22. Orenstein told Sutton there would be another GWPP closing arranged to get monies for Sutton for the Serota closing. Tr. 1493.\n\nThe following Monday, May 13, Orenstein told Sutton he was still working on the Serota closing and would get an IFC check to Sutton in advance. Tr. 1493. This was at a breakfast meeting Sutton had with Dansker, Haymes and Orenstein. Tr. 1494. Later that day, IFC delivered a check to Sutton for $150,000. Tr. 1494. See Ex. G-663, an IFC cancelled check for $150,000, payable to a Sutton company, dated May 13. Tr. 1495.\n\nOrenstein and Serota had set the closing on Serota's apartment for May 15, 1974. Serota was to get at this time $250,000 in a certified check and $200,000 in cash (and the balance was stretched into the future). Tr. 1497. Sutton then testified how the rest of the money was raised and given to Diaco for delivery at the closing. Tr. 1497-1512. The closing this time went uneventfully. Obviously no one wanted to be named in the documents as purchaser; and Orenstein arranged for his brother-in-law to be named as agent for an undisclosed principal. 537 F.2d at 45.\n\nNotwithstanding the Serota closing, Sutton had to complain to Valentine on May 16 that the opposition to the GWPP had not quieted. Valentine said: \"We will get back to Mr. Serota and we will call you back.\" Tr. 1502. Telephone records show calls between Valentine and Serota that evening. Tr. 1502-03. Exs. G-723; G-23A. Valentine then told Sutton everything was taken care of. Tr. 1504.\n\nOn May 16, 1974, as Orenstein had promised, IFC had another GWPP closing with Sutton. Tr. 1505; Ex. G-717. The money Sutton got was $150,000 less than the closing papers stated, to make up the $150,000 delivered on May 13 to aid Sutton in raising the Serota funds. Tr. 1506. The amount paid on May 13, 1974 represented the first time IFC had ever given Sutton money except at a closing. Tr. 1507.\n\nConcluding this review of the evidence as it related to (1) the genesis of the Serota (and Ross) transactions, Valentine's conversation with Sutton on April 14, 1974; (2) Sutton's informing the IFC defendants of Valentine's solution to their two \"problems\"; (3) IFC's acquiescence in the wrongdoing; (4) IFC's implementation of the scheme through Dansker's and Haymes' discussions with Sutton, Dansker's direction to Orenstein to renegotiate the original transaction, and Orenstein's carrying out this direction in his May 11 meeting with Serota; (5) the assistance rendered by the IFC defendants by forwarding funds to Sutton through the same misuse of a GWPP closing; and (6) the delivery of funds to Serota by Diaco on May 15 (after Diaco and Orenstein had first met on May 10), the following is clear:\n\na. The IFC defendants were deeply involved in purchasing Serota's silence and quieting his opposition to the GWPP.\n\nb. They were familiar with the contract which, in effect (even without the cash payment), represented a $400,000 pay-off to Serota, conditioned upon Serota not opposing the GWPP and issuance of a building permit.\n\nc. They continued to use the GWPP closing device to funnel funds to Sutton for illegitimate purposes.\n\nThe gravity and meaning of their concession, made now for the first time, that they were involved in the Serota transaction, are defined best by the foregoing analysis of the evidence. The effect of their concession is to put the stamp of truth on Sutton's testimony.\n\nC. The Attempted Bribe of Ross\n\nIt is difficult to understand how the IFC defendants can now deny their involvement in the attempted bribe of Ross. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\" It is even more difficult to comprehend how it can now be contended, given their belated acknowledgment of Sutton's veracity, at least as to his testimony regarding their complicity in the Serota transaction, that the case against them is a close one. What persuasive argument is available to them, to explain how their willingness to act with Sutton to clear the path for the GWPP ended with Serota receiving over $1,000,000 for an apartment worth no more than $500,000? Notwithstanding this, however, I shall review the evidence to ascertain if it is true, as defendants contend, that Sutton's testimony linking them to the Ross bribery was uncorroborated.\n\nAs I have already observed, there is strong circumstantial evidence that implicates these defendants in the Ross bribery: it would have been folly to have paid off Serota, if that were all there was to the scheme. What was to be accomplished by simply silencing him? They had been given no assurance that Serota's vocal opposition was all that stood in the way of their receiving a variance. The evidence, in fact, is to the contrary. Ross was the other \"problem.\" Logic itself supports the conclusion that the scheme to secure local approval for the GWPP consisted of paying off both Serota and Ross. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\"\n\nIn addition to the circumstantial support thus rendered to Sutton's testimony, other evidence exists as well.\n\nAs Sutton stated, once the first problem, Serota, had been resolved, he and the others directed their attention to Ross. As discussed earlier, III, B, supra, 1066, his meetings and discussions with Valentine produced action in the form of Diaco's meetings with Ross.\n\nThus on May 16, 1974, after another conversation between Valentine and Sutton, and just prior to the presentation of final arguments on the GWPP before the Board of Adjustment, the Board Chairman, Mr. Mazur, got a telephone call from a \"Joe Green\" who said he wanted to meet him and discuss delaying the case a few weeks. Tr. 1102-03.\n\nOn May 18, a Fort Lee councilman called Ross and arranged for Ross to meet a \"Joey D.\" Interestingly, this was the way Diaco had first introduced himself to Sutton, according to Sutton's testimony. Tr. 1477 et seq.\n\nDiaco called on Ross the next day, May 19. He tried to get Ross to delay the Board of Adjustment vote on the project. Then he said to Ross:\n\nWith Serota there is going to be no problems. Serota has been taken care of. . . . I guarantee it. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\"\n\nTr. 648.\n\nThus, just as Diaco had played a key role in paying off Serota, he moved into an important role in the attempt to bribe Ross.\n\nRoss reported this contact to the United States Attorney and thereafter kept that office advised of the matter. Tr. 651-60.\n\nOther than Sutton, only Diaco of the defendants met with Ross. Since the events to which Ross testified are not disputed, and Ross' credibility is not challenged, it is significant to note that his testimony, at certain critical points, corroborates Sutton, either directly or indirectly.\n\nSutton stated that on May 21 he had a conversation with Valentine. Tr. 1553. He told Valentine \"our attorneys\" fear they are going to be turned down by the Board at the May 22 meeting, the next night. He told Valentine to try to get the meeting continued. Tr. 1554. In the meantime, Sutton and the IFC defendants had conferred about the possibility of putting together \"a plan of lesser magnitude\" and had discussed the alternate plan with their attorney, Mr. Cummis. Tr. 1556. No one impeached or contradicted Sutton on this. Sutton told Valentine IFC wanted the May 22 meeting continued past the primary election. Valentine said he would try to contact Mayor Ross and would get back to Sutton. Tr. 1559. The significance of this, of course, is that not only Sutton but the IFC defendants were being sorely pressed by events. All of them were desperate at this point. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\"\n\nValentine, it appears, delegated Diaco to get to Ross again. Sutton testified that Diaco called Sutton later that day (Tr. 1560) and said that he was going to set up a meeting with Ross, Orenstein, Sutton and himself. Tr. 1560. Later, according to Sutton, Diaco called to say Ross had an emergency in Fort Lee and had returned there from his New York office. Tr. 1560-61. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\" Sutton went to New York anyway and met with Orenstein, telling him nothing more could be done. Tr. 1561. After the meeting Sutton and Orenstein returned to their respective offices. Tr. 1562. Orenstein then telephoned Sutton to say Dansker was \"terribly upset,\" that IFC would not \"survive\" a turndown, and that Orenstein was coming over the Sutton's office to meet with the Mayor. Tr. 1561-62. After Orenstein arrived, Sutton called one Tony Cutrupi to learn where Ross was; thereafter, Orenstein left Sutton's office to meet with Cutrupi. Tr. 1562-63. Later, according to Sutton, Orenstein returned to Sutton's office, accompanied by not only Cutrupi but Diaco (Tr. 1563), and made certain telephone calls which I shall shortly detail.\n\nRoss' testimony corroborated Sutton. On May 22, Ross stated, he got a telephone call from Diaco, who wanted to see him. Diaco suggested lunch at \"Club Cabalero\" and Ross agreed to meet him at 2 p.m.; but later Diaco called again to say he would come to Ross' office. Tr. 663-64. Ross, however, was advised by the United States Attorney not to meet with Diaco and Ross told his switchboard operator to tell Diaco he had an emergency in Ft. Lee. Tr. 664.\n\nDiaco arrived, but Ross hid from him. Tr. 665. Ross went to his Ft. Lee office in the Municipal Building. Diaco, however, followed him there and walked into Ross' office. Obviously knowing the Board meeting was on that night, Diaco urged Ross to delay the Board's decision, offering him first $200,000 and then $400,000, which Ross refused. He told Ross millions of dollars were tied up in the project and time was needed at the bank. While they were talking, Ross was told Tony Cutrupi wanted to see him. Ross believed Cutrupi was associated with Sutton and asked Diaco why Cutrupi was coming to his office. Tr. 669-71.\n\nAt this point, after additional conversation, and reference by Ross to Cutrupi and the man with him, Diaco said:\n\nDon't worry. He's a friend of mine. He works for Investors Funding. . . .\n\nTr. 672.\n\nRoss, by pretext, got Diaco out of his office. Tr. 672. Shortly, Diaco returned; and by this time Ross had arranged to have two police officers in the adjacent conference room to eavesdrop. Tr. 674.\n\nDiaco reiterated his offer to Ross and his plea to put off the Board decision. Ross declined, pointing out it was only two hours before the meeting. Tr. 675. Ross then terminated the conversation. Tr. 676-77.\n\nThe substantiation of Sutton's testimony by Ross' testimony is clear.\n\nThus on May 22(a) Sutton testified he spoke to Valentine and urged Ross be contacted to get that evening's meeting put off.\n\n(b) Sutton testified Diaco called him to say he was arranging a luncheon meeting with Sutton, Ross, Orenstein and himself. Ross testified that Diaco did in fact try to set up a luncheon meeting.\n\n(c) Ross said he avoided Diaco and left word for Diaco he had an emergency in Ft. Lee. Sutton testified Diaco called him and told him Ross had an emergency in Ft. Lee and there would be no luncheon meeting.\n\n(d) Ross testified he encountered Diaco in the Ft. Lee Municipal Building and got a telephone call from Cutrupi during the meeting. Sutton testified that, after Orenstein came to his office, he called Cutrupi to locate Ross.\n\n(e) Sutton testified Orenstein went to meet Cutrupi. Ross testified Cutrupi and Orenstein were in the building while he spoke to Diaco.\n\n(f) Ross testified the meeting with Diaco terminated. Sutton testified that Diaco, Cutrupi and Orenstein returned together to his office, where Diaco told him that he had been talking to Ross when there had been a knock on the door and there were Orenstein and Cutrupi standing outside the door. Tr. 1563. Diaco told this to Sutton in the presence of Orenstein and Cutrupi.\n\nWhat next occurred was highly significant on the question of the involvement of the IFC defendants in the Ross bribe, and further impairs the movants' claim that they were convicted solely by the uncorroborated testimony of Sutton.\n\nSutton, addressing himself further to events in his office after Diaco, Orenstein and Cutrupi returned there together following the aforesaid meeting between Ross and Diaco in Ross' office on May 22, testified that Diaco, after bringing Sutton up to date on what had occurred in Ross' office, said he was going to telephone Ross, and did so, calling Ross' home. Tr. 1565. Ross testified that he received a call at home from Diaco at about 7 p.m. Tr. 695. Sutton said that while Diaco was using one telephone in his office, Orenstein was on another, calling the IFC offices in New York City. Since this was of course a toll call it was reflected in Sutton's telephone toll charges (Ex. G-722A), which showed that on May 22, 1974 there was an 8-minute telephone call to the IFC offices, more precisely, to the extension listed for Haymes. Tr. 1573. Sutton testified Orenstein was using both Haymes' and Dansker's names as he spoke into the telephone and reported what Diaco was stating to Ross in their telephone conversation. Tr. 1566. Sutton heard Orenstein say, \"We offered him $500,000.\" Tr. 1565-67. Sutton also heard Diaco offering Ross $500,000. Tr. 1566. When Diaco shook his head and said, \"I'm sorry, he can't postpone the decision . . .\", Orenstein, according to Sutton, \"hollered . . . 'Offer him anything.'\" Tr. 1567.\n\nNor was this all. Ross said he hung up on Diaco. Tr. 695-96. Sutton testified that Diaco said Ross had hung up on him. Tr. 1569.\n\nNext, Sutton testified that Diaco said he was going to call Ross again, and when he did so, Orenstein again called IFC, asking for Haymes (Tr. 1569), but mentioning Dansker's name as well. Tr. 1570. Sutton testified as to what Diaco said to Ross. Tr. 1570-71.\n\nRoss not only testified that he got a second call from Diaco on the evening of May 22; he actually taped it. Tr. 698-704.\n\nSince Orenstein's second call, like the first one, was a toll call, it was reflected on Sutton's telephone bill. Thus Ex. G-722A shows a telephone call from Sutton's office at 7:31 p.m. to Haymes' number at IFC. Tr. 1573.\n\nCounsel for the IFC defendants generally argued at trial that Sutton was lying when he placed Orenstein together with Cutrupi and Diaco in his office, and when he testified that two telephone calls were placed by Diaco to Ross while Orenstein placed them to Dansker and Haymes, and related to them what Diaco was telling Ross. Yet they could not specifically deny Orenstein's presence; and the documentary evidence of his telephone calls to Dansker and Haymes, severely injured their chances of acquittal. These facts were corroborative of everything Sutton had said about their involvement. Diaco and Orenstein were brought together once again, significant in view of what Orenstein had learned about Diaco in connection with the Serota closings on May 10 and 15, 1974.\n\nIt was impossible for counsel to argue Orenstein was not in the Municipal Building or at Sutton's office on May 22, 1974. This is because he was in fact there and counsel knew it. Indeed, he had conceded this on opening. Tr. 534-38. Moreover, as was developed in a brief hearing out of the jury's presence, Orenstein had first gone before the Grand Jury on August 9, 1974. Even then he admitted he had gone to the office of Mayor Ross, but stated that after that he had gone home and did not meet with Diaco and Cutrupi. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\" For a reason that did not appear of record, Orenstein, after his first Grand Jury appearance, wrote a letter to the United States Attorney, requesting that he be permitted to return to the Grand Jury. He was allowed to do so, and this time he admitted he had gone back to Sutton's office with Cutrupi and Diaco and that he had heard the conversation between Diaco and Ross. Tr. 2220-22. At another point, still out of the jury's presence, Sutton, whom I had permitted Orenstein's counsel to voir dire (Tr. 2219), testified that Orenstein had been trying to find out from Sutton whether Cutrupi had told the Grand Jury that Orenstein had returned to Sutton's office after the encounter with Ross in the Municipal Building. Tr. 2239. See also Tr. 2270 (Orenstein's counsel concedes his client was the source of information which had led him to put a question to Sutton); and see Tr. 1908 and 1921 (the United States Attorney, out of the jury's presence, stated, and counsel did not deny, that Orenstein in his Grand Jury appearance had testified that he had spoken to Dansker and Haymes in New York on May 22 from Sutton's office).\n\nGiven the foregoing, trial counsel for Dansker and Haymes on summation never touched upon the fact of the telephone calls reflected from Sutton's office to IFC's offices in New York at times when, according to Ross, he was also receiving calls from Diaco. Dansker's counsel did disparage Sutton's ability to be able to hear, as he said he did, both the conversations Diaco was having with Ross and the conversations Orenstein was having with Dansker and Haymes; and see Haymes' counsel's reference at Tr. 3659. No one denied the meeting or the telephone calls to IFC by Orenstein. Neither, for that matter, did counsel argue that Orenstein had not related to Dansker and Haymes what Diaco was offering Ross.\n\nOrenstein's counsel in his summation admitted Sutton had told the truth about getting Cutrupi to find Ross and then arranging for Orenstein to meet Cutrupi so that Orenstein's request to see Ross could be fulfilled. Tr. 3631.\n\nAn obvious question, the answer to which was circumstantial evidence corroborative of Sutton and damaging to Orenstein (and Dansker and Haymes), was why Orenstein believed Ross was the official to see in order to (a) get the Board of Adjustment hearing put off; and (b) to get the matter back on the agenda? Who told him this? The government of course claims Sutton did, in discussing with these defendants Valentine's early remedy for resolution of the two \"problems.\" No other explanation was tendered by the defendants; and, when it is understood that Orenstein, from New York City, would have had no knowledge of Ft. Lee politics so far as the record is concerned, the logical inference, supportive of the government's case, is that Orenstein had learned of the very critical nature of Ross' position through Sutton. Cf. Tr. 533-35.\n\nNotwithstanding his broad-scale attack upon Sutton's credibility, Orenstein's counsel used, in discussing Orenstein's \"true role,\" (Tr. 3595), Sutton's testimony and treated it as true where it suited his theme. Thus he said Orenstein had gone to see Ross on May 22 carrying the \"tools of his trade.\" Tr. 3594-95. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\" The only point at which he disagreed with Sutton seriously is when he came to Sutton's description of what Diaco had told him Orenstein had shouted at Ross -- \"pay him a million dollars\" (Tr. 3628); yet here Sutton was not stating what he had seen or heard but what Diaco had told him had happened. Of course, neither Diaco nor Orenstein testified to the contrary.\n\nThe next significant date is May 24, 1974. Sutton had a telephone conversation with Valentine. He told Valentine he had the additional $100,000 Valentine said would be needed and that a meeting with Ross was necessary to get the matter back on the agenda. Tr. 1576. That Sutton had $45,000 in his office was testified to earlier by him. He raised the additional $55,000 on May 24, and the checks were produced in support of this. Tr. 1577-78; G-810, 832A and B.\n\nSutton then testified that Valentine came to his office. Tr. 1579. Sutton told Valentine that he had only another $100,000; but Valentine told him that he could help Sutton raise additional cash. He told Sutton to write a company check for $200,000 and then said further that \"it would cost him money, that he had to have additional money\" to convert the check into cash. Tr. 1579. Valentine wanted an additional $70,000; therefore, Sutton wrote out a check to him for $270,000. Tr. 1580. The check was made payable to Valentine Electric Company, although at that time Sutton had no business transactions whatever with Valentine Electric. Tr. 1581. Valentine left with the check and the $100,000 in cash and said he would set up a meeting with the Mayor over the weekend. Tr. 1581-82. Sutton suggested that the meeting be set up at the Forum Diner in Paramus. The next day, Saturday, May 25, Valentine called to say a meeting had been set up at the Forum Diner for 11 a.m. on Sunday, May 26. Tr. 1582.\n\nRoss testified that he had been contacted by telephone by Diaco on May 24. Tr. 731.\n\nRoss taped this conversation. Tr. 736. They arranged for a meeting at Rudy's Restaurant in Hackensack. Tr. 739. Agents of the F.B.I. had been present at the time of the call and so they \"wired\" him before he went to the meeting. Tr. 744. Reference had been made earlier to the fact that Sutton had testified that he had been directed by IFC to reduce the magnitude of the project. Diaco took this up in his conversation of May 24 with Ross. Tr. 750. For the first time Diaco gave his real name to Ross, Joe Diaco, and stated that he was associated with Valentine Electric Company. Tr. 752. The entire conversation is reflected on tape. Tr. 753-804.\n\nThey had discussed having a second telephone conversation and they did late that Friday afternoon, to set up the May 26 meeting with Sutton. Tr. 807. This conversation was taped as well. Tr. 808-13.\n\nOn May 26 Sutton, Diaco and Ross met at the Forum Diner. Tr. 814. Again Ross was \"wired.\" Tr. 816-57.\n\nAfter the meeting concluded, Sutton left first. Then Diaco and Ross went out together and Diaco took from his car an attache case and gave Ross an envelope with $100,000 in cash in it. Tr. 860. Ross immediately left with the money and drove to F.B.I. headquarters where the money was counted. The envelope containing the cash and the cash were marked in evidence. Tr. 861-62; G-499.\n\nAfter Sutton testified to what went on at the meeting (Tr. 1582-85), he stated he went back to his home at the conclusion of the meeting and called Haymes to tell him Ross would cooperate and that Diaco had just given Ross $100,000. Tr. 1585. Haymes told Sutton to call Dansker and Sutton did. Tr. 1585-86. As he placed the call on one telephone, Sutton himself got a call from Diaco on another. Tr. 1586. Diaco reported that he had given Ross the $100,000 and that Ross was happy. Tr. 1587. Sutton then called Dansker and gave him the news.\n\nThe government then introduced certain significant evidence, telephone records of Sutton's toll calls and of Dansker's calls from his home. Ex. G-725, Sutton's personal telephone records, show that on May 26, at 12:33 p.m., there was a four-minute telephone conversation from Sutton's home to Haymes in New York. Immediately after this call terminated at 12:37 p.m., G-726 (a record of toll calls from Haymes' home) shows at 12:38 p.m. there was a six-minute telephone conversation from Haymes to Dansker's home.\n\nThe records further show that Sutton called Dansker and spoke for one minute at 12:49 p.m. Then there was a two-minute conversation from Diaco's telephone to Sutton, ending at 12:51 p.m. Then Sutton immediately called Dansker again at 12:51 p.m. Tr. 1587-90.\n\nThis unusual sequence of telephone calls, on a Sunday, and related in time so closely to the tape-recorded meeting, was obviously hurtful to the defense. They of course offered no explanation for the calls.\n\nOn May 27, Sutton testified, he called Haymes to say that he had written a check for $270,000 to Valentine and did not have the funds to cover it and that they had to have a closing to get Sutton some money. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\" Haymes told him not to worry, that they would get money some place. Tr. 1593.\n\nHaymes, even before a closing was set, responded on May 29 to Sutton's request for funding of money to go to Valentine and Diaco for delivery to Ross and for making good on the $270,000 bad check. Orenstein brought over two checks, drawn upon the account of an IFC subsidiary, Balco Properties, totalling $45,000; and Sutton and Orenstein falsified vouchers running from a Sutton company to Balco citing work allegedly done, to support the payment of the $45,000. Tr. 1601-04; G-668-669; G-668B and 669B; G-668C and 669C. No explanation of this transaction was ever entered by defense counsel.\n\nHaymes and Dansker responded again the next day, May 30, with a check for $55,000 drawn on the account of another IFC subsidiary corporation, IFC Collateral Corporation. The documentation directly involves both Dansker and Haymes in the issuance of this check, which was charged to \"overhead,\" and indicates the amount was to be reflected in the next closing. Tr. 1609-10. No explanation of this evidence was attempted by defense counsel at any time during trial, including summation.\n\nOn May 31 Sutton was subpoenaed to go before the grand jury. Tr. 1611.\n\nConcluding this discussion of the evidence relating to the Ross bribery and the role of the IFC defendants in it, the argument that their convictions on Count II rested solely upon Sutton's uncorroborated testimony must be rejected.\n\nV. THE BRADY ISSUES\n\nA. Introduction\n\nThe defendants charge the United States with suppressing alleged exculpatory materials within the meaning of Brady v. Maryland, 373 U.S. 83, 83 S. Ct. 1194, 10 L. Ed. 2d 215 (1973) and United States v. Agurs, 427 U.S. 97, 96 S. Ct. 2392, 49 L. Ed. 2d 342 (1976). These alleged exculpatory materials relate to James Silver and Anthony Carminati. With the possible exception of Valentine, no defendant urges that the alleged Brady material points to their innocence. Instead, they urge that it casts doubt upon Sutton's credibility.\n\nIt is against this background that the Brady issues raised on this motion will now be considered.\n\nB. The Law\n\nBrady v. Maryland, supra, provides:\n\n. . . the suppression by the prosecution of evidence favorable to an accused upon request violates due process where the evidence is material either to guilt or to punishment, irrespective of the good faith or bad faith of the prosecution.\n\nThe interest vindicated by this principle is that of affording a fair trial to the accused. United States v. Agurs, supra, 427 U.S. at 107, 96 S. Ct. 2392. The Brady rule covers evidence material to the credibility of government witnesses. Giglio v. United States, 405 U.S. 150, 154, 92 S. Ct. 763, 31 L. Ed. 2d 104 (1972)). \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\" Finding that the trial witness had lied, and that the government had not corrected the record, \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\" the Court held a new trial was required. However, the Court stated:\n\n[We] do not, however, automatically require a new trial whenever \"a combing of the prosecutors' files after the trial has disclosed evidence possibly useful to the defense but not likely to have changed the verdict . . . .\" United States v. Keogh, 391 F.2d 138, 148 (CA2 1968). A finding of materiality of the evidence is required under Brady, supra, at 87, 83 S. Ct. at 1196, 10 L. Ed. 2d 215. A new trial is required if \"the false testimony could . . . in any reasonable likelihood have affected the judgment of the jury . . . .\" Napue, [ Napue v. Illinois, 360 U.S. 264, 79 S. Ct. 1173, 3 L. Ed. 2d 1217 (1959)] supra, at 271, 79 S. Ct. 1173.\n\n405 U.S. at 154, 92 S. Ct. at 766.\n\nAgurs, unlike Giglio and here, involved alleged exculpatory evidence as in Brady, rather than evidence reflecting upon the credibility of a government witness, as defendants here charge.\n\nAgurs involved the innocent nondisclosure by the government, in a murder case in the District of Columbia, of an unrequested criminal record of the decedent which indicated that he had pleaded guilty to assault and twice to charges of carrying a deadly weapon. The defense tendered was self-defense, and it was contended that the prior criminal record, concededly admissible, would have tended to show the decedent's aggressive character and would have been corroborative of the claim of self-defense. The court of appeals reversed the district court's denial of a motion for a new trial. The Supreme Court reversed, stating that the court of appeals had \"incorrectly interpreted the constitutional requirement of due process.\" 427 U.S. at 102, 96 S. Ct. at 2397.\n\nAs difficult as Brady (and Agurs) may be to apply in the exculpatory evidence context, the difficulty is magnified when the undisclosed evidence relates to the credibility of a government witness. Unless dealing with the use of perjured testimony [ Mooney v. Holohan, 294 U.S. 103, 55 S. Ct. 340, 79 L. Ed. 791 (1935)], or the suppression of a government promise not to prosecute (Giglio), or suppression of government conduct reflecting preferential treatment (McCrane II), \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\" there are few guideposts; each case must be decided on its own peculiar facts. In applying Brady and Agurs (and McCrane II), particularly in the undisclosed impeachment situation, the analysis must search out what standard of materiality applies and, thus armed, apply it to the entire trial record, cf. Agurs, 427 U.S. 97, 96 S. Ct. 2392, 49 L. Ed. 2d 342, since it is not every nondisclosure or suppression of evidence related to a witness' credibility which violates Brady and Agurs.37 As the Court stated in Agurs :\n\nBut to reiterate a critical point, the prosecutor will not have violated his constitutional duty of disclosure unless his omission is of sufficient significance to result in the denial of the defendant's right to a fair trial.\n\n427 U.S. at 108, 96 S. Ct. at 2399.\n\nNor is the test of materiality, whatever the standard under Agurs, in terms of what \"might\" affect a verdict, or has the possibility of affecting a verdict. As the Court in Agurs said:\n\nFor a jury's appraisal of a case \"might\" be affected by an improper or trivial consideration as well as by evidence giving rise to a legitimate doubt on the issue of guilt. If everything that might influence a jury must be disclosed, the only way a prosecutor could discharge his constitutional duty would be to allow complete discovery of his files as a matter of routine practice.\n\nWhether or not procedural rules authorizing such broad discovery might be desirable, the Constitution surely does not demand that much. While expressing the opinion that representatives of the State may not \"suppress substantial material evidence,\" former Chief Justice Traynor of the California Supreme Court has pointed out that \"they are under no duty to report sua sponte to the defendant all that they learn about the case and about their witnesses.\" In re Imbler, 60 Cal.2d 554, 569 [35 Cal.Rptr. 293,] 387 P.2d 6, 14 (1963). And this Court recently noted that there is \"no constitutional requirement that the prosecution make a complete and detailed accounting to the defense of all police investigatory work on a case.\" Moore v. Illinois, 408 U.S. 786, 795, [92 S. Ct. 2562, 33 L. Ed. 2d 706]. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\"\n\nThe mere possibility that an item of undisclosed information might have helped the defense, or might have affected the outcome of the trial, does not establish \"materiality\" in the constitutional sense.\n\n427 U.S. at 108-09, 96 S. Ct. at 2400.\n\nAgurs follows Brady in holding that the good faith or bad faith of a prosecutor has little if any significance in applying the appropriate materiality standard. \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\"\n\nAgurs also states:\n\nOn the other hand, since we have rejected the suggestion that the prosecutor has a constitutional duty routinely to deliver his entire file to defense counsel, we cannot consistently treat every nondisclosure as though it were error. It necessarily follows that the judge should not order a new trial every time he is unable to characterize a nondisclosure as harmless under the customary harmless-error standard. Under that standard when error is present in the record, the reviewing judge must set aside the verdict and judgment unless his \"conviction is sure that the error did not influence the jury, or had but very slight effect.\" Kotteakos v. United States, 328 U.S. 750, 764 [66 S. Ct. 1239, 90 L. Ed. 1557]. Unless every nondisclosure is regarded as automatic error, the constitutional standard of materiality must impose a higher burden on the defendant.\n\nThe proper standard of materiality must reflect our overriding concern with the justice of the finding of guilt. Such a finding is permissible only if supported by evidence establishing guilt beyond a reasonable doubt. \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\"\n\n427 U.S. at 111-12, 96 S. Ct. at 2401.\n\nNor should the standard focus on the impact of the undisclosed evidence on the defendant's ability to prepare for trial, at least not in the exculpatory evidence situation, and perhaps not in the impeaching evidence context either:\n\nSuch a standard would be unacceptable for determining the materiality of what has been generally recognized as \" Brady material\" for two reasons. First, that standard would necessarily encompass incriminating evidence as well as exculpatory evidence, since knowledge of the prosecutor's entire case would always be useful in planning the defense. Second, such an approach would primarily involve an analysis of the adequacy of the notice given to the defendant by the State, and it has always been the Court's view that the notice component of due process refers to the charge rather than the evidentiary support for the charge.\n\n427 U.S. 112, n. 20, 96 S. Ct. at 2401.\n\nAs explicated in McCrane II, Agurs established three separate standards of materiality, for \"three described situations\":\n\n1. The prosecution used perjured testimony;\n\n2. The defense requested specific evidence;\n\n3. The defense made no request, or only a general one, for exculpatory material [or material impeaching one or more witnesses].\n\n547 F.2d at 205.\n\nAs to the first, the Court stated the \"reasonable likelihood\" test:\n\nIn the first situation, typified by Mooney v. Holohan, 294 U.S. 103 [55 S. Ct. 340, 79 L. Ed. 791,] the undisclosed evidence demonstrates that the prosecution's case includes perjured testimony and that the prosecution knew, or should have known, of the perjury. In a series of subsequent cases, the Court has consistently held that a conviction obtained by the knowing use of perjured testimony is fundamentally unfair, and must be set aside if there is any reasonable likelihood that the false testimony could have affected the judgment of the jury.\n\n427 U.S. at 103, 96 S. Ct. at 2397. \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\" (footnotes omitted)\n\nAs to the second category, the Court said:\n\nThe second situation, illustrated by the Brady case itself, is characterized by a pretrial request for specific evidence. In that case defense counsel had requested the extra-judicial statements made by Brady's accomplice, one Boblit. This Court held that the suppression of one of Boblit's statements deprived Brady of due process, noting specifically that the statement had been requested and that it was \"material.\" A fair analysis of the holding in Brady indicates that implicit in the requirement of materiality is a concern that the suppressed evidence might have affected the outcome of the trial.\n\nBrady was found guilty of murder in the first degree. Since the jury did not add the words \"without capital punishment\" to the verdict, he was sentenced to death. At his trial Brady did not deny his involvement in the deliberate killing, but testified that it was his accomplice, Boblit, rather than he, who had actually strangled the decedent. This version of the event was corroborated by one of several confessions made by Boblit but not given to Brady's counsel despite an admittedly adequate request.\n\n* * *\n\nIn Brady the request was specific. It gave the prosecutor notice of exactly what the defense desired. Although there is, of course, no duty to provide defense counsel with unlimited discovery of everything known by the prosecutor, if the subject matter of such a request is material, or indeed if a substantial basis for claiming materiality exists, it is reasonable to require the prosecutor to respond either by furnishing the information or by submitting the problem to the trial judge. When the prosecutor receives a specific and relevant request, the failure to make any response is seldom, if ever, excusable.\n\n427 U.S. 104-106, 96 S. Ct. at 2397. \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\" (emphasis added) (footnote omitted)\n\nAs to the third category, the Court said: \"The third situation in which the Brady rule arguably applies, typified by this case, therefore embraces the case in which only a general request for ' Brady material' has been made.\" Id. at 107, 96 S. Ct. at 2399.\n\nTurning to McCrane II, the Court of Appeals has this to say about the third Agurs category:\n\nFinally, if no request is made, or if it is couched in such broad terms as \"all Brady material\" or for \"anything exculpatory,\" the Court prescribed a third standard. In this context, to establish a constitutional violation, the defendant need not carry the severe burden of demonstrating his probable acquittal. As the Court phrased it:\n\n\"The proper standard of materiality must reflect our overriding concern with the justice of the finding of guilt. . . . [If] the omitted evidence creates a reasonable doubt that did not otherwise exist, constitutional error has been committed . . . If there is no reasonable doubt about guilt whether or not the additional evidence is considered, there is no justification for a new trial. On the other hand, if the verdict is already of questionable validity, additional evidence of relatively minor importance might be sufficient to create a reasonable doubt.\" 427 U.S. at 112-13, 96 S. Ct. at 2401. \u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\"\n\n547 F.2d at 205.\n\nMovants here on several occasions asked for \" Brady material\" and \"exculpatory material\" and \"material impeaching of Sutton.\" Close study of Agurs, however, yields the conclusion that what is a general request does not become specific through repetition. \u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\"\n\nIn McCrane II, the court of appeals, after first stating that even if the request made by the defense for material impeaching of Bellante, the government witness, was nonspecific, \"nevertheless this case is one where the verdict has only slight support and 'additional evidence of relatively minor importance might be sufficient to create a reasonable doubt.'\" 547 F.2d at 207 (citing United States v. Agurs, 427 U.S. at 113, 96 S. Ct. 2392, 49 L. Ed. 2d 342).\n\nThe court of appeals then went on to find that materiality was to be measured by the specific request standard. Id. An analysis of the court's examination of the defense request is instructive. Sought was not simply evidence \"which may be used to impeach\" a government witness. The request went beyond that, referring to \"any standards used in declining prosecution of the government witnesses in similar circumstances.\" Id. The court of appeals said: \"It requires no profound intellectual analysis to perceive that the defense was seeking material that might provide a basis for a claim of prosecutorial favoritism or preferential treatment of government witnesses.\" Id.\n\nAccordingly, the court vacated the defendant's conviction on those counts as to which there had been nothing more than Bellante's testimony to inculpate defendant. \u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\"\n\nAgainst this background, I shall now examine the Brady issues raised by defendants.\n\nBecause the facts differ as to the Silver and Carminati materials, I shall deal with each separately.\n\nC. James Silver\n\nA chronology of events with respect to Mr. Silver's role in this proceeding follows:\n\nFall 1974 -- Silver visited the F.B.I. office in San Francisco, California.\n\nJanuary 24, 1975 -- Silver wrote to United States Attorney Goldstein.\n\nJanuary - February 1975 -- Silver was interviewed by Mr. Goldstein and certain of his staff on three occasions.\n\nMarch 23-24, 1975 -- Silver was interviewed by certain of the IFC lawyers. Sutton was still on cross-examination.\n\nMarch 24-27, 1975 -- Prior to the conclusion of the taking of evidence all of the IFC defendants and their lawyers met and discussed Silver and the information he had conveyed to them.\n\nApril 1975 -- A post-trial meeting between Silver and counsel for the IFC defendants took place prior to motions for new trial and judgment of acquittal.\n\nSpring - Summer 1975 -- Appellate counsel for the defendants, hearing of Silver, brought on the matter before the Court of Appeals; papers were exchanged and filed. The Court of Appeals, in its decision of June 2, 1976 declined to act on the matter, leaving it to the parties to take appropriate action in this court.\n\nDecember 18, 1975 -- A subsequent letter was written by Silver to the United States Attorney, in which he alleges that, prior to defendants' filing of their motion in the Court of Appeals, he had received $5,000 from defendant Dansker and has received promises of financial security from Dansker and Haymes with the money to be paid at such time as they won their appeal (Exhibit R). \u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\"\n\ni. Contacts between Silver and the United States:\n\nIn September 1974, James Silver appeared at the office of the Federal Bureau of Investigation in San Francisco, California (See Exhibit J). \u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\" According to the F.B.I. agents who interviewed him, Silver at the meeting stated, in an incoherent and erratic fashion, that he was writing a book about hoodlum activities in the Eastern United States. During the course of preparing his book Silver claims he became fearful for his life. When specifics were sought to substantiate his story, Silver was unable to supply any.\n\nThereafter, the United States Attorney's Office for the District of New Jersey received a letter from Silver dated January 24, 1975 (Exhibit L). \u003cspan class=\"fnref\"\u003e47\u003c/span\u003e\" Silver wrote he had been associated with Sutton, was embarking upon a writing career, and was passing on certain information out of \"conscience.\" Most of the balance of the letter was devoted to denouncing Joseph Comras, with whom, Silver said, Sutton had a \"financial relationship and partnership.\" He stated Comras had been a partner at Arlen Realty, and thereafter, while a partner in the Sonnenblick-Goldman Corporation, was introduced to Valentine Electric Company when it applied to the Sonnenblick firm for a mortgage on certain East Orange properties. Comras, according to Silver, called Sutton to ascertain \"who this Valentine Company was.\" Sutton told Comras that Valentine was a \"connected\" company. Comras met with a representative of Valentine at least once \"(i believe that this was D'Arco)\" [sic]; and Comras thereafter arranged a meeting with the man he believed was \"D'Arco\" at Sutton's office but Silver was not permitted to be present; however, he overheard through telephone conversation that the subjects to be discussed included Fort Lee and five properties in East Orange. These properties in East Orange, Silver wrote, were properties that Sutton \"had bought from Investors Funding in one of those phony Chinese deals that your office is well aware of.\" He further stated that \"D'Arco\" had notified one of Sutton's people (Schaffel) that there was a partnership arrangement in the works and \"that the Valentine organization could assure instant if not expeditious processing of contemplated FHA and New Jersey state housing applications for the rehabilitation of these properties.\" He went on to accuse Comras of being an \"integral cog in the conspiratory wheel that helped conceive the bribery situation.\" He added: \"I believe he initiated the idea; and this is excellently supported by the fact that he introduced Sutton to the Valentine organization and partook in whatever planning of projects with them went on.\" Comras, he added, \"dealt with the Valentine people with full knowledge of their identities.\"\n\nHe went on to denounce Comras as having a history of bribery and payoff scandals and stated that he had been involved in a trial in New York involving bribery. Comras, he said, had escaped prosecution by testifying for the state. He stated that his once excellent social relationship with Comras had deteriorated and he was now \"disillusioned\" and \"plans a book; sort of an expose.\" He concluded his attack on Comras by stating that Comras was involved in the use of cocaine and marijuana.\n\nUpon receipt of this letter, Mr. Bruce Goldstein, Executive Assistant United States Attorney, and another Assistant, Joel Rosen, interviewed Silver on three separate occasions (Exhibit K -- Goldstein affidavit, August 19, 1975). Mr. Goldstein's notes are part of the government's submissions on this motion as Exhibit Q. These notes are fragmentary and convey little information to me. There are, however, references to a person named Brown; to the Rolls Royce Trading Company; to Comras and Sutton; to Linda Cutrupi; Landscaping -- Labriola; Ronnie Shell -- Valentine; Schaffel and Diaco; Comras -- coke; a reference to \"blank Electric,\" (which I suppose is Valentine Electric), a reference to Comras being a son-in-law of Goldman; a reference to a mortgage application by Valentine on an office building in the Oranges; and a reference to \"Arthur's building nonunionized.\"\n\nAt this juncture, it is appropriate to refer to the affidavit of Silver, sworn to July 15, 1975, which affidavit was obtained by the IFC defendants in their application to the Court of Appeals, to which I have previously referred. Because of its length, I have not included this affidavit as an appendix to this opinion.\n\nAfter stating how he had become associated with Sutton in building ventures, Silver stated that Sutton had discussed with him his \"underworld connections . . . [the] illegal manner in which he conducted many of his real estate transactions and . . . his personal animosity toward Norman Dansker. . . .\" He related that in the summer of 1974, in California, he read of the indictments in this case and went to the F.B.I. office in San Francisco to inform them of what he knew about Sutton. He had six meetings with the F.B.I., he said, the first one occurring on September 18, 1974, with Agents Lee McCoy and Robert Heiner. He told the F.B.I. he had never met the IFC defendants except for Orenstein. His affidavit omits mention of any meeting with Diaco and any reference to Valentine Electric Company as a \"connected\" company. He told the F.B.I. of Sutton's \"partnership\" with Comras and his involvement with Arlen Realty; that Sutton was \"a con man\" with a connection with an \"underworld character\" Samuel Schell (Samuel Schlitz); that Sutton had told him that Schell had been paid $350,000 to insure that a labor strike in St. Louis did not affect construction of buildings owned by Arlen; and that Sutton was on the same airplane with Schell and the Jacobson brothers when the latter were murdered at St. Louis airport. He also told the agents, according to the affidavit, that Sutton had told him that he had never had any intention of building the Fort Lee project, that he hated Dansker, and that he intended to \"screw\" IFC.\n\nHe went on to say that he told the F.B.I. after Sutton had heard of Serota opposing the variance, Sutton called from Orlando, Florida, and advised Silver to inform Sammy Schell of the events. Silver did, and later that day after Sutton talked with Schell, \"mentioned to Silver the possibility of having Serota murdered.\"\n\nAt the end of his first meeting with the F.B.I., he stated, he asked that the information he had given be forwarded to the United States Attorney in Newark.\n\nHe then stated in his affidavit that at subsequent meetings with the F.B.I., he informed them that Sutton was a \"con man and a crook\" and said that $105,000 had disappeared from a project in East Orange, and \"it appeared\" that Sutton had taken the money \"in the form of kickbacks\"; and that the agents \"elicited\" from him \"information regarding Valentine and Diaco and their relationship to Comras.\" His affidavit does not detail what this information was.\n\nThereafter, his affidavit states, he returned to New York and then went to Europe; upon his return he sent a four and one-half page letter dated January 24, 1975 to the United States Attorney, \"setting forth in substance the same information I had previously communicated to the F.B.I.\" This letter, he states, contained the following categories of information: (a) Silver's relationship with Sutton and his familiarity with the Fort Lee case; (b) Sutton's underworld connection, his relationship with Schell and Arlen and his business relationship with members of organized crime; (c) his knowledge of Sutton's \"specific hatred for Norman Dansker and Sutton's suggestion for murdering Serota\"; (d) Sutton's partnership with Comras, their bank account at Security National Bank, and Comras' expensive cocaine habit.\n\nThereafter, he said, the United States Attorney's office contacted him and he met with them for the first time on January 30, 1975.\n\nThe initial focus of that first meeting, he stated, was to review his letter that he had written on January 24, 1975. According to his affidavit, he elaborated on the points raised in the letter and gave certain additional information. Thus he elaborated on Schell's involvement with Arlen and Sutton; and told the government that Sutton had boasted that Sutton's building was without unionized maintenance personnel because of his underworld ties. Silver also said that he told the government that Diaco and Valentine had met Sutton through Comras, and that one of Comras' employees at Sonnenblick had received a mortgage application from Valentine Electric for a loan of $3.5 million. He later turned over a copy of this application to the office.\n\nHe met with the government again, he said, on February 5, 1975. This meeting focused almost exclusively on Arlen Realty and its connection with Sutton and organized crime. The third meeting took place on February 11, 1975, and consisted of various topics previously covered.\n\nFollowing submission of this affidavit to the Court of Appeals, the United States responded with an affidavit of Bruce Goldstein, sworn to August 19, 1975 (Exhibit K). This affidavit purports to show several inconsistencies between the F.B.I. Nitel letter and the averments in Silver's affidavit. Goldstein's affidavit stated that at no time before the conclusion of the trial had he received any information from the F.B.I. concerning Silver or concerning any interview of Silver by the agents of the F.B.I.\n\nThe Goldstein affidavit also pointed out differences between the letter Silver wrote to the United States Attorney on January 24, 1975, and what he said about this letter in his affidavit. Thus, contrary to his affidavit, Silver's letter to the United States says nothing about Sutton having a \"specific hatred for Norman Dansker\" or indeed for any other defendant; and there is nothing in the letter intimating that Sutton at any time suggested murdering Serota or had discussed with Silver accomplishing such, with or without Schell. Goldstein pointed out that there was nothing in the letter suggesting even remotely that any defendant was innocent of the crimes charged, or that Sutton bore any animosity toward any defendant, or that Sutton had ever engaged in or suggested that anyone engage in any violent conduct directed at any defendant or anyone else. Goldstein further stated that the letter was primarily concerned with charging that Comras was also involved in the conspiracy for which the defendants were being prosecuted, but it did not suggest that the other defendants were innocent. Goldstein also said in his affidavit that at the interviews conducted of Silver, Silver never gave any exculpatory information and furnished little information that was germane to the case. Consistent with the January 24 letter, Silver never stated in words or substance that Sutton had a specific hatred of or harbored any animosity toward any defendant or that he had suggested murdering Serota or anyone else. Based upon the information he had received, stated Goldstein, he did not feel the information received from Silver \"even arguably was required to be disclosed pursuant to Brady v. Maryland and its progeny.\"\n\nii. Contacts between Silver and the defendants:\n\nAfter his last interview by the government, nothing was heard from Silver for a few weeks. Meantime, the trial began. Then, on Sunday, March 23, 1975, Judge Bauman, Dansker's trial counsel, received a telephone call from his client, and as a result, met that evening with Dansker, Silver, and Foster Wollen, Esq., a partner of Judge Bauman's, for approximately two hours. Mr. Wollen took notes. The next morning, March 24, Silver came to Judge Bauman's New York City offices at Shearman \u0026 Sterling, where Mr. Wollen interviewed Silver again and took notes. \u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\" Judge Bauman could not be present. He was, of course, in my court, engaged in trial.\n\nThereafter, before the conclusion of taking of evidence on March 26, 1975, the IFC defendants and their counsel met and discussed the interviews of Silver by Judge Bauman and Mr. Wollen. \u003cspan class=\"fnref\"\u003e49\u003c/span\u003e\" It is clear that all counsel decided not to bring the matter to my attention or to pursue further cross-examination of Sutton.\n\nAfter conclusion of the trial, Silver was interviewed again, at Judge Bauman's office, by all IFC counsel. \u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\" This meeting preceded the filing of defendants' post-trial motions for judgment of acquittal and for a new trial. \u003cspan class=\"fnref\"\u003e51\u003c/span\u003e\" When said motions were made, they made no mention of, or sought any relief based upon, anything related to Silver. \u003cspan class=\"fnref\"\u003e52\u003c/span\u003e\"\n\nJudge Bauman in his affidavit expressly refrained \"from stating the substance of any of the conversations or any of the reasons for . . . [his] decisions\" on privilege and work-product grounds.\n\nMr. Richard Levin, the only one of the IFC trial counsel still involved in this matter, who appears for Orenstein, has filed an abbreviated affidavit in this proceeding. \u003cspan class=\"fnref\"\u003e53\u003c/span\u003e\" Mr. Levin states that on March 23, 1975, he learned from Orenstein that James Silver had contacted Dansker to tell him he, Silver, had information about Sutton. Orenstein also told Levin that Judge Bauman was interviewing Silver at the Bauman home in Rye, New York, that evening. Mr. Levin's affidavit continues:\n\nAfter that interview I was informed by Mr. Bauman and his law partner Foster Wollen, Esq. of the results of the interview of Silver. \u003cspan class=\"fnref\"\u003e54\u003c/span\u003e\" Because of the lateness of the date and the impossibility of conducting an adequate investigation of Silver's information relevant to Sutton's credibility before deciding whether or not to call Silver as a witness, and on the basis of the information known and available to the IFC defendants at that time, it was decided that it would not be possible to predict what kind of witness Silver would make. Therefore, it was concluded that it would be too risky to put Silver on the stand at that time.\n\nIn view of defendants' Brady claim respecting Silver, it becomes pertinent to inquire what the defense did with the information they received from Silver on March 23 and March 24, 1975, while the trial was still on and Sutton was on the stand, undergoing cross-examination.\n\nFor reasons of their own, defendants' counsel on this application have not seen fit to provide in affidavits to this court (1) what it was they or their predecessors or their clients learned from Silver on March 23 and 24; (2) what they discussed among themselves and with their clients on those dates, and thereafter, prior to the end of the trial; and post-trial but prior to making of motions; and (3) why they did not bring to this court's attention what they now contend was a Brady violation by the United States.\n\nBefore continuing with an analysis of counsel's inaction, it is appropriate to review what was going on at trial at the very time the IFC defendants were receiving information from Silver and being told by him that he had conveyed to the government information which these defendants now claim was Brady impeachment material.\n\nOn Monday, March 24, 1975, court began at 9:05 a.m. Tr. 2605. All counsel were present. Sutton took the stand out of the jury's presence, Tr. 2624, as I covered with counsel a claim of attorney-client privilege. In this regard, I denied an application to strike the direct examination, Tr. 2630, stating \"I have never heard a more comprehensive or meticulously-detailed cross-examination.\" The jury was then brought in and Sutton then continued under cross-examination by Serota's counsel at Tr. 2638 et seq. ; and by Valentine's counsel, Tr. 2717 et seq.\n\nThe latter questioned on Sutton's background in Arlen Realty and Joseph Comras. Tr. 2725-28. Counsel obviously was familiar with Comras. Indeed, he knew Comras was the son-in-law of Mr. Goldman of Sonnenblick-Goldman.\n\nAfter a luncheon recess I again called Sutton to the stand out of the jury's presence on an application by Serota's counsel. Tr. 2767-71. Then the jury was brought in and cross-examination of Sutton by Valentine's counsel resumed, Tr. 2772-2805; and it was followed by cross-examination by Diaco's counsel. Tr. 2805-38.\n\nI then gave all defense counsel an opportunity for further cross-examination which all of them declined. Tr. 2839.\n\nCourt resumed on Tuesday, March 25. One government witness was called, Tr. 2887, and, after his cross-examination was concluded, I excused the jury to deal with the motion to strike Sutton's direct examination because of his invocation of the attorney-client privilege. Tr. 2934.\n\nI then held there had been a waiver of the privilege, Tr. 2951, and told defense counsel they could now cross-examine Sutton further. They declined the opportunity to do so; and I then excused Sutton. Tr. 2967.\n\nThe government rested and motions for judgment of acquittal were heard and denied. Tr. 3015-35.\n\nOn Wednesday, March 26, Valentine called one witness. Tr. 3236. The other defendants rested without calling any witnesses.\n\nThis recitation of the events of the last week of trial reflect that well after the IFC defendants' counsel were aware of Silver's information they were afforded an opportunity by the court, albeit unwittingly, to cross-examine Sutton, without the jury present. Beyond this, however, the week before, in connection with a sensitive issue, I had allowed Orenstein's counsel to cross-examine Sutton out of the jury's presence.\n\nThus, there is absolutely no reason why counsel could not have put to Sutton at least some of the material gathered from Silver.\n\nIn addition, there can be no excuse for counsel not having taken up with me on Monday, March 24, what they had learned the evening before, assuming a Brady violation; and, of course, the same can be said about their opportunity to advise me on March 25 about what they had been told on March 23 and March 24. \u003cspan class=\"fnref\"\u003e55\u003c/span\u003e\"\n\niii. What did defendants' counsel learn from Silver ?\n\nMr. Szuch represented Haymes at trial, but does so no longer. He was replaced on appeal by Mr. Dershowitz who has been referred to by at least one other defense counsel here as \"lead counsel\" on this motion.\n\nCounsel for the movants have been singularly unhelpful in advising the court on this motion what it was Silver told their clients and their then counsel on March 23 and 24, and after trial (but before post-trial motions were made).\n\nJudge Bauman and his partner met with Silver on three occasions. Yet, on the motion I was given nothing by way of affidavit stating what they had been told by Silver. I cannot understand why they have not been asked to provide such a submission.\n\nMr. Szuch, as I have noted, represented Haymes. He met with Silver at least once. Even up till now, nothing has been received from movants indicating what he and his client were told by Silver, or by Messrs. Bauman and Wollen.\n\nMr. Levin, who continues as counsel for Orenstein, has also refrained from submitting an affidavit containing the substance of what the IFC defendants and counsel were told by Silver in their meetings. But see 1090, infra.\n\nFinally, I have been given nothing from Silver which deals with this point. His affidavit of July 15, 1975, was prepared for submission to the court of appeals and defendants' counsel there, while obviously aware of the meeting during trial between Silver and the defendants and their then attorneys, in their moving papers never brought to the attention of the court of appeals that such meetings occurred. This is why that same Silver affidavit is devoid of any mention of what defendants were told by him in March 1975. \u003cspan class=\"fnref\"\u003e56\u003c/span\u003e\"\n\nBecause I considered it important on this motion, I quickly brought to counsel's attention what I perceived to be a substantial omission from their papers. See Hearing of February 4, 1977, 6-8, 11-12, where I stated to counsel that by the return date of their motions, February 14, 1977, I felt I should have (a) what Silver told them in March 1975; and (b) why trial counsel had elected not to bring the matter to my attention so that I could do something about it. \u003cspan class=\"fnref\"\u003e57\u003c/span\u003e\" Thus I stated (Id., Tr. 11-12):\n\nI simply said that -- let's put in broader terms -- along the way it appears to me if I am to function on the motion I ought to have all the facts at the time the Silver motion arose, and for me to be told by somebody who was not at the trial -- for example, let's say Mr. Dershowitz says \"Obviously at the time of the trial counsel couldn't do certain things.\" Well, you make that statement. That is meaningless. I want to know why Judge Bauman made the assessment when he was counsel for your client, why Mr. Szuch make [sic] the judgment he did. I want to know that Mr. Levin had before him in its entirety when he made the judgment he did, and why the three of them all decided the same way.\n\nThe point to my inquiry was this: if they have a Brady issue now, did they not have it then? If they did, why was the matter not brought to my attention? Sutton was still available and on the stand under cross-examination while the conferences with Silver were being held and while counsel met among themselves and determined to drop the matter.\n\nDansker's counsel responded (with no disagreement from counsel for Haymes and Orenstein) so as to leave no doubt of the defense strategy to force an evidentiary hearing. Any materials such as notes or memoranda in Judge Bauman's possession, he said, presented a problem since\n\nThe papers taken in a vacuum may cause misimpressions or misapprehensions of what the facts are. I think the papers should be taken in conjunction with Judge Bauman's testimony.\n\nId., Tr. 17.\n\nWhile what counsel stated might have been the case, why could an affidavit not have been obtained from Judge Bauman to clear up any \"misimpressions or misapprehensions\"?\n\nI then advised counsel:\n\nYet I find, frankly, based on what I have, I have an initial reaction that you have not given me the full story and that this step you took here in this obviously incomplete presentation was calculated. If that is still your feeling, that is that you want to pursue this and say \"No, we are only going to give you this much and no more,\" I'm not going to force you to disgorge. I want to assure you I am making no determination now whether there is going to be or not going to be an evidentiary hearing.\n\nThereafter, I received a letter from Mr. Shargel, dated February 11, 1977. Ct. Ex. 1. The letter read as follows:\n\nDear Judge Lacey:\n\nEnclosed herein please find photostatic copies of notes taken by W. Foster Wollen, Esq. of Shearman \u0026 Sterling relative to the interview of James Silver. Pursuant to our request, these notes were received by my office yesterday, February 10th, 1977.\n\nReview of these notes, apparently taken on March 23rd and 24th, 1975, indicates that they are largely incomprehensible and in many instances, illegible. I submit to Your Honor that this material is essentially useless without the testimony of the person who made them.\n\nAt the time I appeared before Your Honor on Friday, February 4th, as I believe you know, I did not have these notes in my possession. My analysis of the material strengthens my belief that they should not be considered without the context of testimonial explanation.\n\nAs Your Honor suggested, these materials are, at the present time, being turned over solely for your inspection. \u003cspan class=\"fnref\"\u003e58\u003c/span\u003e\"\n\nThe only other information given me by movants as to what the IFC defendants learned from Silver came from Mr. Levin in response to questions put to him by the court respecting statements made by him on oral argument and in the Joint Brief submitted by the IFC defendants on this motion.\n\nThese statements were made at the oral argument held on February 14, 1977, Tr. 1-120, where Mr. Levin assumed the burden of arguing the Brady issue primarily as to Silver. Tr. 41. \u003cspan class=\"fnref\"\u003e59\u003c/span\u003e\"\n\nUnfortunately, Mr. Levin had made no notes of what he had been told Silver had said to Dansker's counsel on March 23 and 24, of what counsel had themselves discussed about Silver immediately thereafter, or of what Silver said in his post-trial meeting with counsel.\n\nMoreover, his recollection had not been refreshed by his review of Mr. Wollen's notes, and apparently still has not, notwithstanding the \"careful study\" of these notes by counsel. IFC Defendants' Memorandum in Response, at 9, n. 3. It is also obvious that he had not endeavored to refresh his recollection by conversation either with his client or with other IFC counsel involved in the March meetings with counsel. Indeed, he did not even recall that Silver had told IFC counsel he had had contact before trial with the United States Attorney, having written a letter to that official about Sutton. Id., Tr. 60-65. \u003cspan class=\"fnref\"\u003e60\u003c/span\u003e\"\n\nMr. Levin could only recall that in the March meetings Silver had advised IFC counsel that Sutton was involved in a number of illegal and corrupt transactions, that Silver had no recollection that Sutton ever kept a diary, and that Silver had had a long-time association with Sutton and might prove to be an additional source of information. Tr. 45.\n\nSilver also said others were involved, Tr. 45, but Mr. Levin said his recollection was \"that the identification of the others, namely, Mr. Comras, was something I learned subsequently.\"\n\nMr. Levin concluded:\n\n\"As I stand here now . . . that's my best recollection of what he [Mr. Wollen] related to me on the 23rd and 24th. There may have been more but I have no notes of that.\"\n\nId., Tr. 45. \u003cspan class=\"fnref\"\u003e61\u003c/span\u003e\"\n\nMr. Levin repeated what was in the affidavit he had filed on appeal. Thus, his client told him on March 23 that Silver was meeting with Dansker and his attorney; that Mr. Wollen told him on Sunday night what Silver had said on March 23; that thereafter on March 24 he had again been in touch with Mr. Wollen and had been advised of what Silver had said; and that he had met Silver at a post-trial meeting to which reference is made in the Bauman affidavit. Id., Tr. 45-46.\n\nHaving available to them what was available to IFC counsel, and having refrained from submitting to the court what trial counsel and the defendants had learned from Silver, said counsel must be held to have decided that to do so would injure their chances for obtaining the relief they seek. \u003cspan class=\"fnref\"\u003e62\u003c/span\u003e\"\n\nCertainly, counsel cannot say they were uninformed of what I felt was lacking in their moving papers. My earlier observations were reiterated to Mr. Dershowitz on February 14, 1977, when I stated, notwithstanding the many documents already submitted:\n\nI have already evinced an interest and I think a very strong one in why trial counsel pursued the course they did. And if you feel that you want to submit affidavits from Judge Bauman, and Mr. Szuch and Mr. Wollen, I'll permit you to do that. Indeed, I was surprised, frankly, that you hadn't submitted them earlier because they were trial counsel. \u003cspan class=\"fnref\"\u003e63\u003c/span\u003e\"\n\nId., Tr. 90.\n\nGiven their failure to respond affirmatively to my repeated suggestions, I must assume that Silver presented to IFC counsel and their clients, during the trial and post-trial meetings in March 1975 what he gave to IFC counsel in his July 15, 1975 affidavit on appeal in connection with their motion before the court of appeals. Mr. Dershowitz, appellate counsel for Haymes, and Mr. Goldberg, appellate counsel for Dansker, had discussed Silver with Judge Bauman at or about this time. Neither before the Court of Appeals nor here has there been a claim made that Silver in July 1975 gave the IFC attorneys more -- or different -- information than he gave them in March 1975. \u003cspan class=\"fnref\"\u003e64\u003c/span\u003e\"\n\nThis assumption is reinforced by many of the references in Mr. Wollen's notes. Indeed, as my sealed analysis of those notes reflects, IFC counsel in March, 1975 had more information disparaging of Sutton than is reflected in the July, 1975 affidavit.\n\nFinally, the assumption is likewise supported by the utter absence of any claim in this proceeding that the IFC defendants and their counsel did not receive from Silver in March, 1975 any information impeaching Sutton.\n\nAccordingly, given the assumption I have made, I shall analyze the alleged Brady violation.\n\niv. Counsel's Failure to Bring the Silver Matter to this Court's Attention65\n\nOne can only speculate why IFC counsel decided not to cross-examine Sutton on the material they had acquired from Silver. They may have decided that Silver was unreliable, that since much of their cross would be on collateral matters they would be bound by Sutton's answers, that much of what Silver gave them they had already discovered in their investigation of Sutton, that Silver was unbelievable, or that, by their cross-examination to that point, they had destroyed Sutton's credibility, so that any further cross-examination ran the risk of exciting jury sympathy for Sutton. There may have been other reasons as well. The fact remains that they made a calculated strategic determination, when counsel returned to court on March 24, not to cross-examine Sutton; and they adhered to this decision the next day, after having had an additional day of interview of Silver.\n\nAs has been elsewhere noted, Sutton was actually still on cross-examination on March 24. On March 25, by reason of another issue, I unwittingly gave counsel another opportunity to consider their decision of the day before, when I offered to let them reopen their cross-examination. \u003cspan class=\"fnref\"\u003e66\u003c/span\u003e\"\n\nThis came about because of my earlier ruling on March 24, upholding Sutton's claim of attorney-client privilege in connection with his cross-examination, thus depriving defense counsel of the right to inquire into Sutton's credibility. On my own motion, I directed the government and Sutton's counsel to have Sutton available on March 25. He was there, and I invited counsel to cross-examine him, Tr. 2935-50, setting no limits. Id., Tr. 2961-62.\n\nAfter two days of interviewing Silver, the IFC counsel declined the opportunity to resume their cross-examination of Sutton.\n\nNot even a fragment of an explanation is offered to explain why the opportunity to cross-examine Sutton was thus foregone. The Bauman affidavit simply says Judge Bauman decided not to call Silver as a defense witness. \u003cspan class=\"fnref\"\u003e67\u003c/span\u003e\"\n\nIt is true, perhaps, that under certain circumstances the inability to call a witness may require refraining from using on cross-examination what that person has given you. However, further examination of this proposition is needed.\n\nLet's assume, for example, that counsel had decided to cross-examine Sutton on whether he had ever told Silver he intended to murder Serota. Given the government objection, I would have explored the matter at side-bar. Judge Bauman or other defense counsel would have demonstrated their good faith basis, that Silver had given them this information. Let us assume I would have let the matter be inquired into. If Sutton denied this, it would have been the end of the matter, unless counsel persuaded me that we were not in a collateral area. If on the other hand Sutton had admitted the fact, there would have been no need to call Silver.\n\nI have reviewed the other items embodied in the Wollen notes (and in the July 15, 1975 Silver affidavit). I see nothing therein which could be said to be the kind of cross-examination which could not be gone into simply because the cross-examiner had not yet decided to call as a witness the person giving the information. \u003cspan class=\"fnref\"\u003e68\u003c/span\u003e\" Of equal significance is the fact that counsel here have simply implied broadly that the decision not to cross-examine further was founded upon an inability to investigate Silver. They do not refine this argument by pointing to what it is that he gave them which could not be used on cross-examination until Silver was \"checked out.\"\n\nHowever, the failure to cross-examine Sutton is not really at the heart of the problem here. If these defendants have a Brady violation now, their counsel had one then. Present counsel do not criticize trial counsel for their strategy. They rationalize it. No amount of explanation, however, can justify why experienced counsel would not bring the Silver matter to the attention of the court unless they decided that it was to their clients' best interests that they not do so.\n\nHad the matter of a Brady violation been brought to my attention at trial, I could have had Silver in immediately. I could have conducted a hearing. I could have taken other measures. Yet the defendants, who elected to say nothing at the time, now seek to overturn their convictions upon bases they did not then consider worthy of being brought before me.\n\nOf course, IFC counsel presently recognize the weakness of their Brady argument in the light of their failure to raise it at trial. Thus, they endeavor to explain their inaction: \u003cspan class=\"fnref\"\u003e68\u003c/span\u003e\"\n\nBecause of the highly inflammatory nature of the testimony which Silver was offering -- accusing Sutton of serious wrongdoing and of close connections with the criminal underworld -- defense counsel could not have called Silver to the witness stand without first conducting an investigation to check out and corroborate his accusations, and also to determine whether Silver's own background might not foreclose his usefulness as a witness on the stand. However, there was, quite obviously, absolutely no time to conduct such an investigation, an investigation which might have taken weeks, if not months to complete.\n\nMoreover, quite apart from the inability of the defense to use Silver as a witness at that late date, it was simply impossible for the defense to make effective use of the information which Silver provided.\n\nBecause the kind of investigation which necessarily had to precede a decision to use Silver as a witness could not possibly have been done in a few days time, a request for a continuance in the trial would have been irresponsible and unprofessional. The jury was sequestered in a different city from that of their homes and had already sat for two and a half weeks. Indeed, the judge had held trial days on weekends precisely so as to shorten the length of time the jury would have to retain [sic] sitting and thus sequestered.\n\nJoint Brief at 18.\n\nMr. Levin's answer to my question of why it would have been \"irresponsible and unprofessional\" to at the very least have brought the matter to my attention was never forthcoming. \u003cspan class=\"fnref\"\u003e69\u003c/span\u003e\" Tr. 52-55. Instead, he responded: \"What the brief says is to seek a continuance would be irresponsible and unprofessional. The brief does not say it would have been unprofessional to bring it to your attention.\" Tr. 55.\n\nOf course, even the assertion that it would have been irresponsible and unprofessional to ask for a continuance is absured in view of what I had offered by way of a continuance the preceding Friday, in connection with the Carminati matter. \u003cspan class=\"fnref\"\u003e70\u003c/span\u003e\"\n\nOn the other hand, what was most revealing, when I asked Mr. Levin, \"Why did you think it was irresponsible and unprofessional,\" he stated, Tr. 55: \"Because there was no application we wanted from the court. There was no action that we sought. The only action we would have sought would be a continuance and that continuance we determined would be inappropriate at the time because of the great length of time it would have taken to complete the investigation.\" \u003cspan class=\"fnref\"\u003e71\u003c/span\u003e\"\n\nI again asked Mr. Levin at Tr. 65, \"Why didn't you tell me Silver had come into your camp? Why didn't you tell me so that I could have done something about it? You know me well enough to know I would have done something about it.\" Mr. Levin responded, \"The fact is, Your Honor, we made no application.\" Tr. 65.\n\nThe sensitivity to Brady of all counsel is reflected in every volume of the transcript of this three-week trial. It is too much to ask this court to accept that the trial counsel involved in this case were unaware of Brady. On the other hand, I do not wish to be understood as suggesting that they deliberately laid back to preserve the issue for appeal. Their eminent reputations repel that notion. On the basis of all that is before me, I have no difficulty in concluding that these experienced counsel came to the unanimous view that the coordinated defense they were making was best presented by neither (a) cross-examining Sutton on Silver's allegations; nor (b) bringing the matter to my attention.\n\nBefore concluding this portion of this opinion, I turn to the last contact Silver had with the United States. Exhibit R on this proceeding (Appendix C) is a letter from Silver to the United States Attorney dated December 18, 1975. It begins:\n\nDear Mr. Goldstein:\n\nThis letter concerns the above referenced case. Since my having agreed to sign certain affadavits [sic] on behalf of Defendant Norman Dansker, certain other facts have come to my attention; as well as other laws not known to me prior to my signing of these documents.\n\nI shall list my points numerically:\n\nExhibit R (Appendix C).\n\nThereafter, the letter reflects the reaction of one who has become disgruntled because certain promises made to him \"by Norman Dansker . . . [of] financial compensation for my willingness to assist Dansker in his appeal\" have not been kept; that he knew or knew of Dansker in 1972-73 in relation to dealings with one Morris Karp against whom Silver testified in an R EC [sic] case; that Dansker has given him $5,000 disguised as a brokerage commission; that while he was in jail in July, 1975, on charges still pending, \"a former Dansker employee furnished bail for his release and drove him home; that he has never repaid this bail money; that Dansker promised him \"books to be published\"; that Dansker and Haymes hold six tapes he recorded for a book he intends to write; and that he has been in contact with Mr. Dershowitz; that he has been a fugitive in the Los Angeles area \"over the last few months\"; and the letter concludes:\n\nNUMBER SIX: Promises of financial security in the form of brokerage fees to be paid and financial interests to be won were promised to me by defendants Dansker and Haymes at such time as they won their appeal. Both my grandfather and I were told that I \"would not have anything to worry about for the rest of my life\" by both Dansker, Haymes and Morris Karp acting in Dansker's behalf. I hope these facts will assist your department.\n\nThis letter was not in the hands of the government before trial or the IFC defendants during and after trial. Nonetheless, it does suggest that Silver may have impressed not only the government but defense counsel as well as a witness they did not wish to call. Notwithstanding the many obvious inferences to be drawn from this letter, there has been no denial by any of the IFC defendants of the charges it makes.\n\nOn the other hand, I will not, of course, consider this in connection with the determination on the issue of whether the Silver materials the government possessed prior to trial constituted Brady matter.\n\nv. The Legal Consequences of the Inaction of the IFC defendants as to Silver :\n\nThere may be, I suppose, cases of Brady violations where defense counsel, having knowledge thereof, can sit back and do nothing, confident they have plain error. Cf. Federal Rules of Evidence 103(d). I thus will not presume to lay down a broad rule for all cases. It is clear to me, however, that it would be unwise as a matter of policy, and contrary to the public interest in the finality of criminal judgments, cf. United States v. Agurs, supra, 427 U.S. at 117, 96 S. Ct. 2392, 49 L. Ed. 2d 342 (Marshall, J., dissenting), to allow these defendants to now claim as a basis for a new trial that which they had known of and deliberately determined not to reveal to the court at the time of trial. See United States v. McMillian, 535 F.2d 1035, 1037-38 (8th Cir. 1976):\n\nDefendants urge that they were prejudiced by being given this information during rather than before trial. However, the defendants did not seek a continuance to interview these witnesses and no order of the court prevented defendants from subpoenaing the witnesses and calling them to testify. Furthermore, after trial, there was no attempt to interview the witnesses to learn whether they possessed any evidence which might otherwise be considered helpful to the defense on motion for a new trial. We conclude that defendants have made no showing of prejudice.\n\nIt is enough that during trial they let pass the opportunity to resume their cross-examination of Sutton and decided not to advise me of what is now claimed to be a Brady violation. Beyond that, they had about a month to investigate further into what Silver had told them, before arguing the motions for new trial. Another month went by before an order was entered. Nothing was brought to my attention.\n\nDeciding against these movants for the reason given does not mean I thereby condone a Brady violation by the government. I will deal with this aspect presently, as it arises with respect to the other defendants from whom the IFC defendants likewise kept concealed the information relating to Silver.\n\nvi. The Application of Brady Law to the Silver Material Available to the United States prior to Trial.\n\nAs I have indicated, with the possible exception of Valentine, no defendant claims the alleged material was exculpatory. The claim is that it was in the impeachment category.\n\nDealing first with Valentine, he claims that the materials exculpate him since they show Sutton could confirm that he and Diaco had met Comras at Sonnenblick-Goldman when they tried to get mortgage financing for their East Orange building, under the name Valdiac. \u003cspan class=\"fnref\"\u003e72\u003c/span\u003e\"\n\nCounsel for Valentine and the company on this motion states:\n\n[Its] [sic] our position that it virtually corroborated word for word the opening statement of Michael Rosen to the effect that when Valentine met with Sutton it was for an innocent purpose.\n\nHearing of February 14, 1977, Tr. 106.\n\nActually, the letter must be read in the light of the trial testimony, particularly that given by Sutton on cross-examination by counsel for Valentine and Valentine Electric Company. \u003cspan class=\"fnref\"\u003e73\u003c/span\u003e\" The letter of January 24, 1975 is congruent with that testimony, which in substance states that Valentine Electric Company and Valentine first came to his notice when Comras brought Valentine to him, at which time he knew there had been an application to Comras for a $3,500,000 mortgage on the Valdiac property in East Orange. Tr. 2746-57. In fact, this was discussed in his presence. Tr. 2746. He also had explored doing work with a Mike Levy and Valentine and Diaco in Connecticut where the latter were interested in a project. Tr. 2758-62. He testified that he had been interested in having Valentine's company do some work on the buildings in East Orange which he, Sutton, owned. Tr. 2758. Thus, Sutton did not deny that he had engaged in certain innocent activity with Valentine and Diaco and their company.\n\nMoreover, read carefully, the letter inculpates Valentine, Diaco and their company. Whereas counsel for Valentine and the company told the jury that Comras and Valentine dealt only on the East Orange properties, Tr. 3236-47, Silver's letter states that, when Comras first asked Sutton about Valentine Electric Company, Sutton told him it was a \"connected\" company. It confirms Sutton's testimony that Comras brought the company to Sutton (although Silver states he believed Diaco [whom he called D'Arco] was the one who met Sutton). It also confirms Sutton's testimony that the discussion was about \"Fort Lee\" and \"five East Orange properties in East Orange that Sutton had bought from Investors Funding in one of those phony Chinese deals that your office is well aware of.\" \u003cspan class=\"fnref\"\u003e74\u003c/span\u003e\" The letter then states:\n\nIn essence I thought that your office should be aware of the fact that Joseph Comras was an integral cog in the conspiratory wheel that helped conceive the bribery situation. I belive [sic] he initiated the idea; and this is excellently supported by the fact that he introduced Sutton to the Valentine organization and partook in whatever planning of projects with them went on. I repeat. COMRAS WAS PRESENT AT MEETINGS. HE SIMPLY DID NOT OFFER HIS FRIEND TELEPHONE CONVERSATIONS AND HE MET AND DEALT WITH THE VALENTINE PEOPLE WITH FULL KNOWLEDGE OF THEIR IDENTITIES.\n\nSilver's letter, January 24, 1975, page 2, para. 1.\n\nFar from exculpating Valentine, the letter deeply implicates him as president and Diaco as vice-president of a \"connected\" company involved in a conspiracy.\n\nValentine's counsel also saw his client exculpated by that part of Silver's affidavit of July 15, 1975, which stated that he explained to the F.B.I. agents that Sutton intended to \"screw\" Dansker by not building the project. This, counsel reasoned, exculpated Valentine (and, of course, Diaco and their company, as well) since it had been Sutton's testimony that Valentine \"got involved in this conspiracy\" because he wanted to get the $10 million electrical contract. Hearing of February 14, 1977, Tr. 107. \u003cspan class=\"fnref\"\u003e75\u003c/span\u003e\" The flaw in counsel's reasoning (Id. 107) is that, even if true that Sutton told this to Silver, Dansker was not to know it nor were Valentine, Diaco and their company, and therefore Sutton let them get involved in the scheme knowing all the time that they would never realize their expectation of getting the electrical contract. This was hardly likely to excite jury sympathy for these defendants. Indeed, the jury reaction would undoubtedly have been that they got what they deserved. As I elsewhere point out, this evidence would not add lustre to Sutton's character but, in terms of impeachment, this was merely cumulative of what had been developed.\n\nMoreover, at no time during the trial did the United States contend that Sutton had intended to build the Plaza Project alone. Speyer of Tishman Realty and Construction Company, the last witness called by the government, made this clear. Speyer testified that he had spoken with the defendant Orenstein in March, 1974, concerning the GWPP, and discussed with Orenstein the feasibility of Tishman Realty and Construction Company constructing the multi-story office buildings that had been planned for the project. Tr. 2929-34.\n\nValentine's claim that the Silver affidavit of July 15, 1975 exculpates him is rejected.\n\nIn reviewing the Goldstein notes, there are references to \"Ronnie Shell-Valentine,\" \"Ivan Schefelt-discussion w Diaco\" and \"Blank Electric\". Nothing has been tendered to suggest what in these items is exculpatory. I uphold as to Valentine the government's claim that the materials it received were not exculpatory. I further find that the nondisclosure of Silver himself was not a suppression under Brady.76\n\nI now turn to the claims of all defendants that the Silver materials were impeaching of Sutton. To aid on appellate review, I shall analyze them as to all defendants, notwithstanding that the inaction by the IFC defendants in March, 1975 precludes them from now raising a Brady claim. See 1095, supra.\n\nvii. Was the Withholding of the Silver Materials a Nondisclosure of Impeachment Material under Brady ?\n\nIn the analysis which follows, it is important that it be kept in mind that even now defendants have not spelled out exactly how they would have used the Silver material to impeach Sutton's credibility and thus have failed to show prejudice. Aside from the vague and conclusory nature of his allegations, Silver does not claim to know, and defendants do not suggest he knows, anything concerning the bribe offered to Ross. Moreover, it is not stated by the IFC defendants in what respects they now claim Sutton lied. What is clear is that, by their concession as to their involvement in the Serota transaction, they remove from controversy any issue as to Sutton's credibility in that area of his testimony, and indeed, implicitly, as to all his testimony. See 1069-1070; 1072, supra.\n\nMoreover, with the exception of the defendant Valentine, whose position has been dealt with, not one defendant has attempted to demonstrate what Silver could have testified to during the trial; and no defendant has made any showing that any alleged non-disclosure by the government of information obtained from Silver has prejudiced them in any way. The defendants, having been in possession of Silver's information for two years, have still not demonstrated how his information could have produced exculpatory evidence. That fact alone clearly demonstrates that Silver did not provide the government with exculpatory evidence.\n\nUnder these circumstances, it is impossible to see why this court is required to conduct hearings on what Silver may or may not have disclosed to the government. This is particularly so when, as here, Silver later suggests that his affidavit to the defendants was procured through a payment of $5,000.\n\nAs to the materials which were in the government's possession before trial, I find that the United States Attorney, prior to trial, did not have in his possession, and did not know of, information given to the F.B.I. in San Francisco by Silver. Silver's letter of January 24, 1975 makes no mention of such prior meeting or meetings; and neither the Goldstein affidavit nor his notes of conferences with Silver refer to any meeting with the F.B.I. Moreover, Silver nowhere makes the claim that he told the United States Attorney he met with the F.B.I. in San Francisco. The F.B.I. here cannot be viewed as a part of the prosecutorial arm as in United States v. Morell, 524 F.2d 550 (2d Cir. 1975). See also United States v. Quinn, 445 F.2d 940 (2d Cir.), cert. denied, 404 U.S. 850, 92 S. Ct. 87, 30 L. Ed. 2d 90 (1971).\n\nAs to whether or not the IFC defendants, while on trial, were aware of Silver having gone to the F.B.I., see Ct. Exs. 2, 2(a) and 3 (Wollen notes).\n\nGiven the circumstances, I do not regard such material as was given to the F.B.I. as Brady material. \u003cspan class=\"fnref\"\u003e77\u003c/span\u003e\"\n\nAs to the January 24, 1975 letter, \u003cspan class=\"fnref\"\u003e78\u003c/span\u003e\" I regard the following matter as possibly impeaching of Sutton, but certainly of no materiality under any of the three Agurs situations:\n\n1. That Sutton was involved with Investors Funding \"in one of those phony Chinese deals.\"\n\nThis would be of no value to any of the defendants and none has urged here that it was.\n\n2. The clear implication Sutton was involved \"in the conspiratory wheel\" with Comras and the Valentine organization.\n\nThis too would be of no value to any of the defendants and none has urged that it was. The fact that it implicates Comras does not exculpate the defendants.\n\n3. That Sutton knew the Valentine Electric Company was a \"connected\" company.\n\nSutton's knowledge of this fact might qualify it as impeachment, particularly when other facts in the case are considered. On the other hand, who would have wanted to use it?\n\nAs to the Goldstein notes of his conferences with Silver (Exhibit Q), I have hereinabove detailed the references. 1083-1084, supra. Several of the referenced items were the subject of cross-examination; and defendants here have not pointed to one item as reflecting any person, or subject matter, they did not know about or were unaware of at trial. In fact, one item was covered in direct examination, e.g., \"Landscaping -- Labriola.\" Brown, Rolls Royce and Sutton's connection with Comras in connection therewith, that Comras was related to a principal of Sonnenblick-Goldman, Linda Cutrupi, and Valentine's application on an office building in the Oranges, all were the subject of cross-examination. Indeed, the latter was also proved in Valentine's case in chief, as well. I see no Brady violation, or impeaching material, in this area; and, in fact, as to those matters listed, which were covered on cross-examination, I can state as the trial judge that the material explored was of no significance in determining Sutton's credibility. This was not so only in absolute terms. It was also true in relative terms. When one reviews the prior crime and typical \"bad act\" impeachment, cf. Federal Rules of Evidence 608(b), 609, and the other areas covered so effectively by counsel \u003cspan class=\"fnref\"\u003e79\u003c/span\u003e\" over several days of cross-examination, any conceivable impeachment information contained in Goldstein's notes was not material under any of the three Agurs classifications.\n\nI shall now deal with the matter the United States had in its possession if what Silver said in his July, 1975 affidavit is credited, and assume, for this alternate consideration, that the F.B.I. is a prosecutorial arm even where, as here, the agents were 3,000 miles away and nothing exists to show they conveyed to the United States Attorney information received from Silver. \u003cspan class=\"fnref\"\u003e80\u003c/span\u003e\" See 1096, n.73, supra.\n\nI adopt this procedure for the purpose of aiding review of my decision in the event of appeal.\n\nUnder this alternative approach, I turn to Silver's affidavit as to what he told the F.B.I. and the United States Attorney. 1083-1085, supra. The following emerge as items reflecting upon Sutton's character \u003cspan class=\"fnref\"\u003e81\u003c/span\u003e\" generally:\n\n1. Sutton's discussion with Silver of \"underworld connections . . . the illegal manner in which he conducted many of his real estate transactions.\"\n\n2. Sutton's personal animosity toward Norman Dansker; he hated Dansker.\n\n3. That Sutton was a \"con man\" and crook.\n\n4. That Sutton had a \"connection\" with an \"underworld character,\" Samuel Schell.\n\n5. Sutton had no intention of building the Fort Lee project and intended to \"screw\" IFC.\n\n6. That after Serota opposed the variance, Sutton called from Florida, told Silver to inform Schell, and later Sutton \"mentioned to Silver the possibility of having Serota murdered.\"\n\n7. That $105,000 disappeared from a project in East Orange and it \"appeared\" Sutton took it in the form of \"kickbacks.\"\n\n8. That Sutton's building maintenance people were non-unionized because of his organized crime connections.\n\n9. That Sutton had been connected with Arlen Realty which in turn had \"organized crime\" connections. \u003cspan class=\"fnref\"\u003e82\u003c/span\u003e\"\n\nUnder the assumption I am making, that the United States had pre-trial everything in Silver's July, 1975 affidavit, it could be said that, logically, I should also charge the United States with having in its possession what IFC counsel were told by Silver in March, 1975. \u003cspan class=\"fnref\"\u003e83\u003c/span\u003e\" Mr. Levin told me on oral argument that he recalled that Silver said Sutton never kept a diary, that Sutton was involved in a number of illegal and corrupt transactions, that Sutton and Silver had a long association, and that others were involved, although he learned of the name Comras \"subsequently.\"\n\nThe only firm information relates to Sutton's diary. In fairness to Silver, he may be interpreting the word \"diary\" in such a way as to have unintentionally misled counsel. I have reviewed the exhibits representing Sutton's secretary's daily record and his daily calendar. He obviously kept this calendar as a matter of routine business over the years 1972 and thereafter. Of its genuineness there can be no doubt. Beyond this, here was certainly an area for cross-examination which could have been explored at trial on March 24 or 25, 1975. \u003cspan class=\"fnref\"\u003e84\u003c/span\u003e\"\n\nThe only other source I can look to in order to ascertain what I shall charge the government with possessing pre-trial regarding Silver is the Wollen notes. Again, I will deal with these in Ct. Ex. 3. It can be said, however, that I find nothing there of any impeachment significance which is not in the July 15, 1975 affidavit.\n\nI now return to items 1-9, 1099-1100, supra, and analyze them, in the order previously listed, in terms of their impeachment value.\n\nItems 1, 3, 4, 5, 6, 7, 8, 9 are of general application, and can be lumped together as \"bad act\" impeachment. \u003cspan class=\"fnref\"\u003e85\u003c/span\u003e\"\n\nItems 1, 4, 8 and 9 have at their core that Sutton had underworld connections. Superficial analysis might lead to this being defined as material impeachment matter. The fact is, first, that virtually all of the questions which could be founded upon such information would be held to be improper cross-examination under the broad discretion of the trial judge. Federal Rules of Evidence 611. How is the question to be put? Do you have friends who are \"underworld\" or \"organized crime\" connected? An objection would be promptly sustained. \u003cspan class=\"fnref\"\u003e86\u003c/span\u003e\"\n\nEven if a proper question could have been put to Sutton in this area, a negative answer by him would have been binding on the cross-examiner, since the question dealt with collateral matter.\n\nThere are still other reasons, aside from its obvious imprecision, why this information must be stamped as of no consequence in this case. Sutton was already, by his own admission, guilty in the bribery of the Mayor of Fort Lee. The jury had heard his venality exposed not only from the witness stand. They had actually heard him as, on two occasions, unwittingly, he recorded his criminality on the \"wire\" Ross was carrying. They had heard him admit he had knowingly given Valentine a bad check. They listened while he recounted how he had aided the IFC defendants in embezzling money from IFC. They knew he had agreed to testify only after being caught. These and many other things marking him as a man lacking in morality had been drawn out for jury analysis. Thus, the \"underworld\" or \"organized crime\" association, or to use a Silver word, \"connection,\" would not have tarnished him further. It was, in the very essence of the word, cumulative.\n\nThere is, of course, the suggestion that the defendants might, having been given time before trial to investigate him, have called Silver as a witness. This must be rejected. It is clear from the information he gave the United States in his letter of January 24, 1975, that defendants could not have called him as a witness. The defendants, once they knew the contents of the letter Silver had written the government on January 24, 1975, would have abandoned any thought of calling Silver. \u003cspan class=\"fnref\"\u003e87\u003c/span\u003e\"\n\nReturning to the impeachment items, item 2 reflects a bias against Dansker. Had I not ruled that the IFC defendants cannot now raise as Brady what they could have raised at trial, counsel for Dansker would have been entitled to ask Sutton on cross-examination if he had ever said to Silver in words or substance that he \"hated Dansker.\" If denied, in view of the possible bias, I would have permitted the defendants to call Silver to contradict the negative answer. Again, however, we are confronted with the inevitable question: how can you call Silver when the United States can cross-examine him on the letter he wrote?\n\nBeyond this, Sutton's enmity toward Dansker and the other IFC defendants was clear at trial. Dansker and the other IFC defendants, as the government's case showed, had compelled him to advance almost $6 million with reimbursement under the GWPP closing device. When \"reimbursement\" came, it was in the form of a loan, on which Sutton had to pay as much as 13% interest. Sutton had prepared Ex. G-205 to reflect the almost $6 million he had thus laid out and was \"reimbursed\" for under the GWPP mortgage loan. He had tried and failed to get Dansker to give him some relief. He had no reason to be disposed kindly toward Dansker. Beyond this, if asked if he hated Dansker and he had said \"Yes,\" he would have been given an opportunity to explain why he did. This might have led to answers even more damaging to Dansker than the ones that were given. Putting such speculation aside, however, and returning to the premise that an affirmative answer would have been given, such would have been merely cumulative of what had been developed by Dansker's counsel particularly, and by other counsel as well on their cross-examination.\n\nI thus regard this as being of no consequence.\n\nI turn to item 6. This reflects, if true, that Sutton was a man who had considered, or at least discussed, committing a violent crime. \u003cspan class=\"fnref\"\u003e88\u003c/span\u003e\" It was as well directly applicable to Serota, showing a bias against him, and could be said to thus have indirectly an impact upon the other defendants whose guilt on Count II rested in part on the proofs relating to paying off Serota. The IFC defendants, however, have now conceded their involvement in the Serota transaction. As to Valentine, Diaco and their company, I find this indirect effect so attenuated as to be without any force.\n\nReturning, then, to a consideration of the light cast upon Sutton as a man who considered eliminating someone because he stood in his way, it underscores the desperation he admitted at trial he felt, faced with losing everything. It also shows he was willing to go to almost any lengths to achieve his objective. Finally, it sheds light on his character generally as a venal and corrupt person. These latter two revelations, however, are not new. It is what this case was all about. If Sutton was not that kind of man, this case never would have come about. He admitted it was he who, when first approached by Valentine, acquiesced in the bribery scheme, and thereafter got the IFC defendants to acquiesce in it as well, leading to the Serota pay-off and Diaco delivering $100,000 to Ross.\n\nAs to the \"lengths\" to which he was willing to go, the possibility of murdering Serota became the reality of paying Serota at least $900,000 (plus $200,000 in cash, Sutton says) for an apartment worth $500,000 at most; and giving Serota the right to buy it back for $300,000. Next came Diaco ultimately paying Ross $100,000 as a down payment on $500,000. It is difficult to conceive of a case -- even with the experience this court has had as attorney for accused, prosecutor, and judge -- where the mention of a witness having considered murdering someone would not have substantial effect upon the view a jury would take of that witness. As the trial judge in this case, I have no hesitancy in stating that an affirmative answer to the question here -- or extrinsic proof that it was said -- would not have altered the view Sutton's testimony had already caused the jury to have of his character.\n\nAccordingly, the information covered by items 1-9, 1099-1100, supra, which under my hypothesis the government had pre-trial (and thus should have turned over) would not have altered the portrayal of Sutton as accomplished by what was brought out in the case on direct and cross-examination of Sutton, the moving documents, the recorded conversations, the Ross testimony, the IFC involvement (now conceded) in the Serota pay-off at Sutton's suggestion, and the many other items of evidence referred to herein at 1059-1078.\n\nNext, notwithstanding my having found no materiality whatever to the alleged Brady information, I will, again for aiding appellate review, now cover the Agurs formulation.\n\nviii. The Request: It was Non-specific in Agurs Terms89\n\nBrady was a \"specific request\" case. The defendant specifically requested an extra-judicial statement of his accomplice, Boblit. It was withheld. In it the accomplice confessed that it was he and not Brady who had strangled their victim. Since this was material on the issue of punishment, the Court held that Brady had been deprived of a fair trial. Using this definition of \"specific request,\" it is clear that the request here was not specific under the Agurs formulation as related to the Silver information. Applying the \"reasonable doubt\" standard, 1082, supra, I have no hesitancy in finding that, judged in the light of the record, 1059-1078, supra, the Silver material, whether what the United States Attorney had, or what I assumed he had, 1096-1101, supra, is considered, does not create a reasonable doubt about the guilt of any of the defendants. I shall consider each defendant separately.\n\nDiaco, Valentine and Valentine Electric Company\n\nLittle need be said as to Diaco. I have set forth the evidence as to him, 1064-1067, supra. The proofs were overwhelming that he and Valentine, principals in Valentine Electric Company, intervened in the GWPP controversy, Valentine telling Sutton, and Diaco telling Ross, that all they wanted was to get the electrical contract for their company. Valentine and Diaco were linked to Serota through evidence independent of Sutton. At critical junctures telephone calls passed between Valentine and Serota which were never explained. Diaco knew Serota had been \"taken care of\" and so informed Ross. Valentine had deposited a $270,000 Sutton check which \"bounced.\" It verified Sutton's testimony about delivery of funds to Valentine which in turn went to Diaco for delivery to Serota and Ross. Diaco was taped on several occasions, including the event of delivery of $100,000 cash. Valentine and their company were deeply involved with Diaco. No explanation was ever given by Diaco or Valentine which would have removed Valentine and their company from the conspiracy in which Diaco, the company's vice-president and Valentine's partner in Valdiac, was obviously the \"bag man.\"\n\nSutton's testimony as to these defendants assured that the government's case against them did not rest on a \"slender reed.\" McCrane II, supra.\n\nIt is for these reasons and others set forth herein that I state that these defendants sustained no substantial prejudice in terms of Agurs ' \"third situation.\"\n\nDansker, Haymes and Orenstein\n\nI will add little to what I have previously stated as to these defendants in my detailed appraisal of the evidence. 1067-1078, supra.\n\nPreliminarily, the application of the \"non-specific\" Agurs standard is particularly appropriate as to these defendants. As has been developed during the course of oral argument before me, these defendants and their counsel knew that there was in fact a letter written by Silver to the United States Attorney. See also, the Wollen notes, Ct. Exs. 2, 2(a) and 3. They therefore had it within their power while Sutton was still under cross-examination of making a specific request for specific material.\n\nHere too, as I have stated, the government's case did not depend upon a \"slender reed.\" I have described the \"portrayal\" of Sutton to the jury by the government and the defendants, 1061-1064, supra ; and have analyzed why, in spite of the heavy blows struck at Sutton's credibility, the jury found these defendants guilty, 1064-1078, supra. That the jury's verdict of guilty was well founded on Count III, putting aside my erroneous instruction on the law, is now demonstrated by the concession made here that these defendants were involved in the Serota pay-off. This not only confirms Sutton's testimony. It insures with certainty that any fair-minded jury would have been compelled to find these defendants guilty on the Ross charge once presented with the admission of their Serota involvement. The reasons for this conclusion have been set forth. 1068-1069; 1069, n. 18; 1070, 1072-1073, supra.\n\nThus, even if these defendants had not been barred from raising Brady by their inaction in March, 1975, 1091-1096, supra, they would have no basis for complaining of the Brady violation found here. Again, I find as to these defendants that a reasonable doubt as to their guilt has not been created, whether the evidence the government had, or what I assumed it had, is considered.\n\nix. Alternative Ground: That the Request Was Specific in Agurs Terms\n\nThe defendants argue that their requests were specific in Agurs terms. \u003cspan class=\"fnref\"\u003e90\u003c/span\u003e\" While I disagree, since I regard Agurs as requiring a request as specific as in Brady, I will apply the standard of Agurs ' \"second situation\" in order to aid any appellate review.\n\nI find, under the analysis I have made of the record, and of the alleged Brady information conveyed by Silver, that the withheld Silver information was not material, and that there was no substantial basis for claiming it was material, as to any of the defendants, for all the reasons hereinabove set forth. \u003cspan class=\"fnref\"\u003e91\u003c/span\u003e\"\n\nIn this connection, I cannot subscribe to the defendants' argument that \"materiality\" here means any information which \"might\" have affected the verdict. See Agurs, 427 U.S. 97 at 108-09, 96 S. Ct. 2392, 49 L. Ed. 2d 342; 1078-1080, supra. Indeed, as the Court said in Agurs, \"a jury's appraisal of a case 'might' be affected by an improper or trivial consideration . . . .\" In other words, to apply \"might\" as a standard of materiality is to deal in possibilities and the most gossamer speculation. \u003cspan class=\"fnref\"\u003e92\u003c/span\u003e\" Even more significantly, the \"might\" test would mean that the test for knowing use of perjured testimony (e.g., Mooney v. Holohan, supra), the \"reasonable likelihood\" test was more favorable to the prosecution than in Agurs ' \"specific request\" situation. I do not so read Agurs.\n\nInstead, I shall apply the \"reasonable likelihood\" test and, doing so, in the light of my analysis of the record, find that there is no reasonable likelihood that the nondisclosed material could have affected the jury's verdict. \u003cspan class=\"fnref\"\u003e93\u003c/span\u003e\"\n\nD. Carminati\n\ni. Defendants' Contentions\n\nDefendants argue that their Brady rights were violated, as to Carminati, in two respects, first, that the United States knew Sutton lied when he said he did not know Tony C's last name; and second, that the United States had in its possession and did not disclose information about Sutton and Carminati which would have served to impeach Sutton's credibility. Essentially, they do not contend that the alleged Brady material would have exculpated them. Instead, reiterating a theme I have found totally discredited by the evidence, they contend that information regarding Carminati \"would have materially aided the defense in attacking Sutton's image as an honest businessman.\" Joint Brief of IFC Defendants, 12 (emphasis added). See also the affidavit of Mr. Shargel, Dansker's present attorney, dated January 13, 1977, para. 6.\n\nThey argue from these propositions that Carminati was in a position at the time of trial to furnish evidence which could have been used to impeach Sutton's credibility, but that they were deprived of the opportunity to call him because of the government's alleged misconduct. \u003cspan class=\"fnref\"\u003e94\u003c/span\u003e\"\n\nAs I have earlier noted, Sutton was portrayed to the jury as anything but an honest businessman; and the convictions of the defendants rested upon much more than the testimony of Sutton. 1059-1064, supra.95 The predicate of defendants' argument is thus destroyed. Moreover, as I shall later show, defendants at trial had all of the essential information necessary to make a decision whether to call Carminati. United States v. DiGiovanni, 544 F.2d 642, 645 (2d Cir. 1976). See also, United States v. Prior, 546 F.2d 1254, 1259 (5th Cir. 1977): \". . . numerous cases have ruled that the government is not obliged under Brady to furnish a defendant with information which he already has or, with any reasonable diligence, he can obtain himself.\" Nonetheless, I shall examine the factual and legal issues raised to aid any appellate review of my ruling.\n\nii. Trial Events and the Issue of Tony C's Last Name\n\nSutton, admitting his role in gathering the cash used to pay off Serota and Ross, detailed the sources of the cash. 1066-1067, 1070-1071, 1076-1077, supra. Of the huge sums Serota and Ross received, $100,000 was raised by borrowing from two sources, $60,000 from a \"Tony C\" and $40,000 from a man Sutton identified as Cass Lauracella at Cass Electric. Tr. 1513, 2041. These transactions were without notes and were usurious loans. Sutton repaid Tony C $80,000 six months later by three checks payable to the latter's company, 803 Maintenance, G-93, 979-980; and repaid Lauracella $44,000. \u003cspan class=\"fnref\"\u003e96\u003c/span\u003e\"\n\nThe $40,000 cash transaction with Lauracella was virtually unchallenged on cross-examination; \u003cspan class=\"fnref\"\u003e97\u003c/span\u003e\" that with Tony C was subjected to lengthy cross-examination. Repeatedly, counsel pressed Sutton for Tony C's last name. Sutton maintained he knew the man only as Tony C, but agreed to produce for defendants, if they wished it, his lease with Tony C's company, 803 Maintenance, Sutton's tenant; and the government had previously made available for defendants' pre-trial discovery Sutton's office records (Exhibit F) wherein the name Carminati appeared. See reference thereto by counsel for Haymes on this motion. Hearing of February 14, 1977, Tr. 93. The attack upon Sutton for his failure to know -- or his refusal to give -- Tony C's last name, had a tactical value which defendants had obviously planned and exploited. On summation, defendants, all of whom knew Tony C's last name was Carminati, argued that Sutton was not to be believed in his testimony that the defendants had joined with him in pay-offs to Serota and Ross because of what they charged was his lie as to not knowing the last name of Tony C, whom one defendant, as I have noted, expressly referred to as a \"loan shark.\" Tr. 3714. \u003cspan class=\"fnref\"\u003e98\u003c/span\u003e\"\n\nIt was evident defendants had no interest in eliciting from Sutton Tony C's last name for any substantive reason, such as enabling them to identify and subpoena the man; and even today they do not claim they wanted to interview him and call him as a witness but were prevented from doing so by Sutton's \"lie.\" They not only knew he was Sutton's tenant and where to find him (i.e., in the basement of Sutton's building, where Orenstein claimed to have been, Tr. 2191, 2246); but the fact is they knew Tony C's last name. Indeed, on Sunday, March 23, 1975 (the same day Silver first met with IFC counsel) even a newspaper, the Bergen Record, had identified Tony C as Anthony Carminati. \u003cspan class=\"fnref\"\u003e99\u003c/span\u003e\" Yet not one defendant thereafter put to Sutton who was still on cross-examination, see 1091-1093, supra, whether Tony C's last name was Carminati, or confronted him with his aforementioned office records. \u003cspan class=\"fnref\"\u003e100\u003c/span\u003e\" On the other hand, Sutton was asked and answered questions describing Tony C by height, weight, age, and whether he spoke English with an Italian accent. Tr. 2191. Additionally, Sutton stated that he met with Tony C almost every day and implied he telephoned him as well. Tr. 2372.\n\nMoreover, in response to defendants' claim for what they argued was Brady information, I stated, both before and after I offered them a continuance to check into Carminati, that I was surprised, in view of their apparent interest in knowing Tony C's last name and ascertaining facts about the transaction and the connection between him and Sutton, that they had not issued a subpoena to 803 Maintenance and Carminati. Tr. 2080, 2084, 2273. \u003cspan class=\"fnref\"\u003e101\u003c/span\u003e\" They never did so, \u003cspan class=\"fnref\"\u003e102\u003c/span\u003e\" nor can they seriously contend that they could not have done so. Additionally, they do not here contend that they attempted to interview Carminati and failed.\n\nTheir lack of interest in Tony C is further demonstrated by their decision not to accept my offer of a continuance, in the face of their claim of surprise. \u003cspan class=\"fnref\"\u003e103\u003c/span\u003e\" See also, 1091-1092, supra.\n\nInstead, defense counsel, each in turn, first on cross-examination and later in summation, underscored the cash involved in the Tony C loan, the lack of a note, the failure to count the cash, and the $20,000 \"premium.\" Tr. 2038; see also Tr. 1883, 2035-40, 2191-92, 2247-50, 2301-02, 2370, 2674, 3643, 3670, 3714. They argued from these points that a man who dealt in such transactions was not to be believed.\n\nCounsel also had the opportunity to cross-examine Sutton on voir dire, out of the jury's presence, 1092, supra, as to several questions related to threats allegedly made by Sutton to Orenstein, after counsel said he would, if such were denied by Sutton, produce a witness who would testify to the threats having been made. Tr. 2210. I then conducted a voir dire at which counsel had the opportunity to put the questions, Tr. 2237 et seq. ; thereafter, they were put again before the jury. Sutton denied that he had told Orenstein what was suggested; but no witness was ever brought on to support the interrogation. One of the questions was (Tr. 2227): \"Did you tell Donald Orenstein that this office belongs to a man named Tony C, who was just released from prison after serving ten years for manslaughter?\" See also Tr. 2247. Orenstein's counsel said that his client had told him of this conversation in September, 1974, several months before trial. Tr. 2251. It is almost inconceivable to me that, given the prodigious defense investigation, and the importance of such a threat in furnishing an explanation as to why Orenstein lied when he first went before the Grand Jury, defendants would not have thoroughly investigated Tony C. This impression is strengthened by the absence of any averment from the defendants that they did not have any background information on Tony C.\n\nFinally, as I have noted in connection with Silver, Sutton was on the stand on March 24, and, pursuant to my direction, the United States had him available on March 25, as defense counsel were advised. 1092, supra. They never raised the name Antonio Carminati with Sutton. \u003cspan class=\"fnref\"\u003e104\u003c/span\u003e\"\n\nIn point is United States v. Ruggiero, 472 F.2d 599, 603-04 (2d Cir.), cert. denied, 412 U.S. 939, 93 S. Ct. 2772, 37 L. Ed. 2d 398 (1973):\n\nAppellant knew the identity and location of Lundy and Sheridan and of the likelihood that they might give testimony helpful to his defense.\n\n* * *\n\nThe purpose of the Brady rule is not to provide a defendant with a complete disclosure of all evidence in the government's file which might conceivably assist him in preparation of his defense, but to assure that he will not be denied access to exculpatory evidence known to the government but unknown to him. Here the appellant was on notice of the essential facts required to enable him to take advantage of such exculpatory testimony as Lundy and Sheridan might furnish. He was also well aware of the process by which they could be compelled to testify at trial. As long as they could be subpoenaed to testify, their grand jury testimony, if offered in their absence, would have been excluded as hearsay. If appellant wanted their testimony, the obvious and logical course was to subpoena them and put them on the witness stand.\n\nBefore calling Lundy and Sheridan as trial witnesses, defense counsel was not legally barred from interviewing them to ascertain the substance of their prospective testimony. Indeed if he had not attempted to do so, he would have been remiss in the performance of his pretrial duties as trial counsel, see Xydas v. United States, 144 U.S.App.D.C. 184, 445 F.2d 660, 667, 668 (1971).\n\nSee also, Giles v. Maryland, supra, 386 U.S. at 98, 87 S. Ct. 793 (Mr. Justice Fortas concurring), quoted at 1079, supra.\n\nIn summary, then, it can be said that counsel, having full knowledge of who Tony C was, and mindful that the basic theme of their defense was aided by the unusual facts of the Tony C transaction, decided to leave it that way. \u003cspan class=\"fnref\"\u003e105\u003c/span\u003e\" It did not serve their interests to cast doubt on whether Sutton had gotten the $60,000 cash from Tony C, because it was so certain that Serota and Ross had been paid off just as Sutton stated. They profited from the testimony, as their cross-examination and summations show, by painting a picture of Sutton as one who dealt in cash with a \"loan shark.\" Tr. 3714. It is consistent with this strategy that they apparently decided not to interview or subpoena Carminati (if in fact they did not) and thus not to accept the continuance I had offered them.\n\nThe Joint Brief of the IFC defendants states:\n\nSee affidavit of Gerald Shargel counsel for IFC defendant Norman Dansker for full description of why the information sought regarding \"Tony's\" identity would have been materially useful and of how the government took a \"parlor game\" approach to the defense requests for this information.\n\nPage 12, n.12.\n\nThe fact is defendants knew Tony C's identity, his business affiliation and where to find him. They elected to do nothing. United in their approach, it was obvious they had decided not to question whether Sutton had borrowed the cash from Tony C, thus leaving them free to ridicule the transaction on the one hand, and, on he other, to affirm it as a demonstration that Sutton knew, saw every day, and had a business relationship with usurers. \u003cspan class=\"fnref\"\u003e106\u003c/span\u003e\"\n\nIn addition to their contention that they were deprived of valuable information at trial by not knowing Tony C's last name, defendants also claim that Sutton lied when he said that he did not know it, and that the United States Attorney knew he lied. There is absolutely no basis in the record for this claim. \u003cspan class=\"fnref\"\u003e107\u003c/span\u003e\"\n\nIt is true that the United States Attorney knew, and stated he knew the last name. \u003cspan class=\"fnref\"\u003e108\u003c/span\u003e\" He denied, however, that he ever told it to Sutton, or that Sutton told it to him. Tr. 2258. Sutton was questioned on this as well.\n\nAt any time in the course of your conversations with any member of the United States Attorney's office, is it your testimony that no one in the room mentioned Tony C's last name?\n\nA That's correct sir.\n\nNot you?\n\nA Not me.\n\nQ Not Mr. Goldstein?\n\nA Absolutely, sir.\n\nTr. 2376.\n\nNor does logical analysis support the defendants' claim of perjury by Sutton. As I have noted, he gave the defendants enough information to identify the person he was talking about, even if they themselves had not known Tony C's full name to be Antonio Carminati. Given this information, Sutton could have hardly believed the defendants could not trace Tony, locate him, and ascertain his last name. Parenthetically, had Sutton wanted to conceal, by lying, his true relationship with Tony C, he would have stated he had borrowed $80,000 in cash, not $60,000, thus matching the amount of the checks in evidence. By his own testimony Sutton was conceding the usurious nature of the transaction and unmasking Tony C as a criminal and the loan shark defendants labelled him.\n\nI have carefully reviewed every page of this lengthy transcript. I do not see any answer by Sutton about Tony C -- or 803 Maintenance -- which, even today in the light of the defendants' motion and affidavits, can be said to be a lie.\n\nIt is noted that Orenstein's counsel, referring to the Shargel affidavit of January 13, 1977, suggested that the movants might also contend that Sutton did not get $60,000 in cash from Tony C, Hearing of February 14, 1977, Tr. 44; and thus could not have raised the cash needed to pay off Serota and Ross. This has not been seriously urged, however, nor could it be. No one disputes Serota was paid off with the cash Sutton raised; and the IFC defendants now concede their involvement in the Serota pay-off. No one, given the recordings, dares to dispute that Ross was paid off with cash Sutton raised. Thus everything points up the fact Sutton told the truth as to the amount of cash he raised, how he raised it, to whom it was delivered for the pay-offs, and who finally received it, that is, Serota and Ross.\n\nThere is no basis for defendants' motion to the extent it rests upon the failure of the United States to turn over Tony C's last name. Defendants knew it; and if it be urged that they did not know it soon enough, they did not ask for a continuance. Finally, even without the name, at trial they had all the identification they needed to subpoena 803 Maintenance to get all the information they needed. Cf. United States v. Kaplan, 554 F.2d 577, 578-580 (3d Cir.1977); United States v. Harris, 498 F.2d 1164, 1170 (3d Cir. 1974). As shall be discussed hereinafter, the foregoing sets forth why, after hearing the United States in camera on the Carminati issue overall, I held that it posed no Brady violation. \u003cspan class=\"fnref\"\u003e109\u003c/span\u003e\"\n\niii. Denial by the Court of Brady Applications\n\nDuring the trial there were numerous Brady applications made to me by defense counsel. As to some of these, I either reviewed information in camera or, in one instance, held a hearing in camera. As to others, I heard argument from counsel in open court. See, e.g., Tr. 2887 et seq.\n\nInsofar as the Tony C, or Carminati, issue is concerned, I denied all of the Brady applications made. I shall now set forth trial events relating thereto.\n\nThe first Brady application as to Tony C or Carminati came at Tr. 2079:\n\nI suggest that this is in the nature of Brady material. I most respectfully request while this witness is on cross, before some of us get to our cross, that anything, that the United States Attorney has, if anything, in relation to Mr. Tony be turned over to us as Brady.\n\nThe United States responded:\n\nYour Honor, there is no Brady material. Of course, the United States knows who the individual is, Tony. Yes, the United States has investigated transactions. Yes, we can corroborate the facts of that transaction. But we were precluded from doing so when we tried to offer proof of post-May 31.\n\nThere is no Brady material at all. I can't testify obviously as to the party. Mr. Sutton has testified to the best of his knowledge as to what the events are and whether or not he does or does not know the man's last name. There is no Brady material at all. The United States has made inquiries into the area and the defendants in this case precluded us from going into post-May 31 events.\n\nTr. 2080.\n\nI denied the application. Tr. 2080.\n\nAt Tr. 2083 the United States said:\n\nThere is no mysterious individual. I'll be happy to in an in camera proceeding explain to your Honor exactly my reasons why I would not be prepared to disclose the name. Although I do have reason to believe that defense counsel in this case know exactly who the individual is and I'll be happy to disclose to your Honor certain other events as well that I will be happy to put on the record as to interviews that have been conducted by certain investigators for the defendants in this case. \u003cspan class=\"fnref\"\u003e110\u003c/span\u003e\"\n\nSee also Tr. 2088.\n\nAnother application was made for a hearing on whether the United States knew Sutton was lying when he said he did not know Tony C's last name. Tr. 2263. I denied it.\n\nAt Tr. 2266 Tony C's last name was said to be \"imperative.\" Indeed, at Tr. 2271 I asked counsel:\n\nAll right. Now, specifically, Mr. Rosen, what is it that you wanted on Brady?\n\nMr. Rosen: I want the last name of Tony C.\n\nAt Tr. 2273 I again denied an application founded upon Brady.\n\nThe United States thereafter responded to a renewal of defendants' argument (Tr. 2275):\n\nThe United States does have additional reasons why we do not wish to disclose at this time the name of the individual, and I'm not trying to prevent counsel from learning that name, but I do have very good reasons which I think I should protect the United States as well, but on the record I suggested in an in camera proceeding that's sealed that I do think there are interests the United States must protect, and I have an obligation to protect those interests, and I think it would not be fair for me in representing my client if I did not take this position.\n\nI then stated I might hold an in camera review with the United States over the lunch hour. Tr. 2277. No one objected.\n\nI then denied a Giglio motion for a hearing, stating:\n\nTHE COURT: Application based upon Brady is, as you stated yesterday, the information that you incorporated in your application yesterday, that application is denied.\n\nYour application for dismissal and judgment of acquittal is denied.\n\nThe application for hearing at this stage, frankly, I see no basis for it. This is not, however, to say that I would deny it with prejudice. It may be that as the case goes further, that there would come a time during the trial or even after the trial when you may wish to renew your motion, but for now, I will deny it.\n\nTr. 2278. One defense counsel then stated, and I responded:\n\nMr. LONDON: Also the application to require the government to turn over to me all of the information they have with respect to not only his name, but all of the information, do you deny that?\n\nTHE COURT: Yes, based on all of the arguments that I have heard and the representations from both sides, which are part of the record.\n\nTr. 2279.\n\nOn March 22, 1975 during the luncheon recess, I heard government counsel in camera, on the record; and a transcript thereof has been provided to counsel for movants here. C-1. Subsequently, I put the following remarks in the record:\n\nTHE COURT: I'm sorry. Let me start over. Counsel have raised . . . [a] Brady issue that the United States has failed to disclose the last name of Tony C. Their claim is rejected. He was identified at trial on April 17th [sic] as a principal in 803 Maintenance. Counsel have had access to some eighty thousand dollars ($80,000) from Sutton's company to this company, well before trial, and at least one defendant, Orenstein, by his counsel, has demonstrated detailed knowledge about this man.\n\nMoreover, counsel could have done what a reporter for the Bergen Record did last week, get the names of the principals of the corporation from the Secretary of State Office, or serve a subpoena on the company for its records last week.\n\nNothing more need be said. The claim is frivolous. Moreover, as to the claim that the government should have turned over material dealing with the borrowing by Sutton from this company, that, too, is rejected. The government states it corroborated this transaction. Indeed, the evidence supports this. Thus, there is no exculpatory evidence here.\n\nAs to the claim that Sutton's credibility would be tested by the facts of this transaction, the government brought them out on direct, as supplemented by the checks made available to defendants. The evidence shows that if there was usury here, Sutton was the victim, not the perpetrator.\n\nThe application is denied. \u003cspan class=\"fnref\"\u003e111\u003c/span\u003e\"\n\nTr. 2890-91.\n\nMy determination on the Brady issue, as thus announced, was founded not only on the testimony, and argument of counsel, but also on the in camera disclosure made by the United States on March 22, 1975 (C-1).\n\nThus, as set forth in C-1, the United States, after stating it knew the name of Tony C, asked to be relieved of the obligation of disclosing it until later because of the pressure which certain investigators had exerted upon other government witnesses. The latter included Lauracella of Cass Electric, who, the government represented, was called by Orenstein, and was threatened by defendants' investigators with being accused of being an arsonist. C-1 at 9. The government did not suppress that it knew of the background of Tony C. See United States v. Agurs, supra, 427 U.S. at 104-06, 96 S. Ct. 2392. \u003cspan class=\"fnref\"\u003e112\u003c/span\u003e\" The decision not to compel further disclosure was made by me, not only because of what had already been put into the trial record as to Tony C, but also because of what occurred at trial subsequent to March 22, 1975, when it became evident defendants knew Tony C's last name and that he had a criminal record; and, as has been noted, defendants' cross-examination of Sutton had also laid bare not only Sutton's character but the kind of person Carminati was. As to the reference in C-1 that the United States made to Tony C's background, I saw this to be of no added significance in terms of Brady. I drew from the reference that Tony C's background was such that he was susceptible to being compelled \"to give false and perjurious testimony.\" C-1 at 10. However, I had already heard the reference to the usurious loans made by him and Lauracella to Sutton. That Tony C was the kind of person one would expect Sutton to go to in order to borrow cash had been made clear to the jury, as had Sutton's character as a venal and corrupt person, who had fully admitted bribery and embezzlement. Thus I did not regard it as requiring disclosure under Brady that Tony C was of bad repute, as appeared to be so from Sutton's testimony and the United States Attorney's reference. \u003cspan class=\"fnref\"\u003e113\u003c/span\u003e\" Sutton's credibility was not going to be further discredited by demonstration that this man, who was himself a criminal, borrowed cash from another criminal on the already disclosed terms. Indeed, given Sutton's testimony, Carminati had committed a high misdemeanor under New Jersey law, under N.J.Stat.Ann. 2A:119A-1, \"Loan Sharking\"; cf. 18 U.S.C.  892, and the defendants could have obtained an instruction that Tony C had thus committed a crime in lending the cash at 66 2/3% interest to Sutton, if they had desired it. They did not request such an instruction. In their summations they referred to \"Tony C\" without revealing to the jury they knew his full name. I would have taken a different view if, as the defendants have contended was the case, and as I have shown was not, Sutton had been presented to the jury as an honest businessman who somehow had innocently stumbled into wrongdoing. Then it may have had bearing upon his credibility that he had an association with someone of bad repute, as the government's remarks to me suggested Tony C was; however, even under this assumption, I still would have been confronted with the fact that the defendants had all the information they needed to attack Carminati, and Sutton's relationship with him, and they did just that on their summations. Tr. 3670, 3714.\n\nTo the extent that post-trial developments suggest or indicate that Carminati was of bad repute, therefore, no basis for granting defendants' motion is established. There was in fact sufficient in this regard disclosed to defendants at trial to enable them to make an informed decision as to whether to interview and call Carminati, and to confront Sutton with Tony C's last name. \u003cspan class=\"fnref\"\u003e114\u003c/span\u003e\" This is why I decided as I did in not requiring further disclosure by the United States following the in camera proceeding.\n\nDefendants also contend that post-trial it has been discovered that prior to and during trial Carminati was under state or county investigation, that the United States knew it, and that this was Brady information. They also contend that the Sutton-Carminati relationship was more \"intricate\" than testified to at trial and that this too was Brady information. I now address these issues.\n\niv. Post-Trial Developments\n\nDuring trial, it appears, Carminati was under investigation by the Bergen County Prosecutor's Office. This investigation allegedly included electronic surveillance and contacts between a Bergen County undercover agent, Lt. Delaney, and Carminati and others. The defendants charge that the United States Attorney knew of the fact of the investigation, and was given specific information developed from it relating to Carminati, Sutton, and the relationship between them.\n\nThe starting point for consideration of these contentions is an affidavit, dated January 13, 1977, submitted by Mr. Shargel. \u003cspan class=\"fnref\"\u003e115\u003c/span\u003e\" This affidavit, while commenting upon Mr. Shargel's review of the trial transcript, overlooked or ignored every one of the trial developments I have heretofore related, including defendants' knowledge of Tony C's last name, that he had a criminal record, and the crime he had committed by the usurious loan marking him, as counsel at trial had said, a \"loan shark.\" Unmentioned too were the facts developed hereinabove as they bear upon defendants' trial strategy; and their decision not to take a continuance, not to subpoena Carminati or 803 Maintenance, and not to examine into records which the United States represented, when it sought to introduce post-indictment period evidence, corroborated the Tony C -- Sutton transaction.\n\nPerhaps even more basic, the Shargel affidavit attempts to perpetuate defendants' persistent claim that Sutton was presented to the jury as a businessman of honesty and integrity. Thus, it is suggested, anything which would have shown Sutton to have been involved with Carminati more \"intricately\" than shown at trial, or which would have besmirched Carminati, would have changed the trial's result. Again, therefore, it is necessary to explode this concept so basic to the defendants' Brady claims.\n\nThe Shargel affidavit is misleading not only because of what it omits but because of what it includes. Thus, it claims that its author has had access to confidential state wiretap records which, it states, \"in effect\" report Carminati denying that he loaned $60,000 to Sutton. \u003cspan class=\"fnref\"\u003e116\u003c/span\u003e\" As earlier noted, this is without substantive significance in view of the overwhelming evidence of what was not disputed at trial, that Serota and Ross were paid off with cash gathered by Sutton. Moreover, Carminati, by admitting the transaction, would be confessing to the state crime of \"loan sharking.\" Beyond that, however, the triple-layered hearsay averment by Mr. Shargel is totally discredited by his very affidavit through an exhibit attached thereto. This exhibit, which purports to be a \"surveillance report,\" quotes one Miceli as confirming precisely the $60,000 cash loan, with Miceli calculating the interest for the 6-month term at 66 2/3% just as defense counsel had at trial. \u003cspan class=\"fnref\"\u003e117\u003c/span\u003e\"\n\nEven had suspicion not thus been cast upon the accuracy of the Shargel affidavit, I would still find that it lacks sufficient reliability to be given any weight. Thus, in what are Mr. Shargel's words, rather than quoted conversations, he states that \"the taped conversations indicate clearly that Sutton's relationship with Carminati was significantly different than that to which he testified.\" A line-by-line review of Sutton's testimony at trial, however, fails to indicate that Sutton was either asked to, or on his own did, define his \"relationship\" with Carminati. Instead of having him characterize his \"relationship,\" at most a vague and conclusory term, counsel drew from him facts relating to his admitted daily contact with Carminati, to the $60,000 loan, to Carminati's affiliation with 803 Maintenance, and to a physical description of Carminati. They avoided putting to Sutton, as I have noted, whether Tony C's last name was Carminati or whether the latter had a criminal record (except to ask if Sutton had told Orenstein Tony C had just finished a 10-year term for manslaughter).\n\nThe Shargel affidavit is seriously wanting in accuracy in still another respect. \u003cspan class=\"fnref\"\u003e118\u003c/span\u003e\"\n\nIt states that: \"[On] March 22, 1975 Carminati, as noted on another log sheet, directly states that Sutton's testimony is perjurious.\" Para. 11.\n\nThen, apparently quoting from a log entry made by someone who is not identified, the affidavit continues: \"'Tony talks about knowing Sutton very well and how Sutton is lying when he said he doesn't know him.' (Plant No. 75/1C, 3/22/75).\"\n\nMr. Shargel's characterization of Sutton's testimony as perjurious is later taken up by the affidavit of Mr. Dershowitz, counsel for Haymes. \u003cspan class=\"fnref\"\u003e119\u003c/span\u003e\" Thus, in his affidavit dated February 21, 1977, Mr. Dershowitz averred that, in a telephone discussion on February 18, 1977, he had discussed with Mr. Woodcock, the Prosecutor of Bergen County, that Sutton had committed \"perjury.\" \u003cspan class=\"fnref\"\u003e120\u003c/span\u003e\"\n\nThe fact is that, if Sutton would have been lying if he had testified he did not know Tony C, he did not so testify. One can only guess why the person who purports to quote Carminati in the aforementioned log entry, or why Mr. Shargel, for that matter, did not point out the obvious mischaracterization of Sutton's testimony. One possibility that arises is that Carminati may have read a newspaper report of the trial which misled him as to what Sutton's testimony at trial was. As has been noted herein so many times, Sutton testified at length to his daily contacts with Tony C and identified him in such specific terms that defense counsel at trial would have known whom he referred to, even if they themselves had not known from their own sources.\n\nThe Shargel affidavit (para. 11), in what I assume is a paraphrasing of a log entry, states that the \"conversations\" reveal that the government \"had contact with Tony Carminati prior to the instant trial.\" The affidavit further states that \"Government attorneys, prior to the trial, had subpoenaed Carminati's books and records.\" The affidavit then departs from its factual averments and states that these records, \"it is submitted, clearly reflect an intricate financial relationship between Carminati and Arthur Sutton.\"\n\nFor all the reasons set forth herein, putting aside the obscurity of the language, the fact the United States had \"contact\" with Carminati prior to trial is not Brady material. As to the allegation the United States had subpoenaed Carminati's records, and the suggestion of intricacy of financial relationships, Sutton's financial relationship with \"Tony C\" and 803 Maintenance had been reviewed by the defendants' accountants prior to trial as demonstrated by the fact that Orenstein's counsel used an accounting report (Ex. DO2) concerning Sutton and 803 Maintenance in his cross-examination of Sutton. Tr. 2252, 2301-02. \u003cspan class=\"fnref\"\u003e121\u003c/span\u003e\"\n\nIt is further noted that the United States had proffered post-indictment evidence, as previously mentioned, but it was rebuffed in its efforts. 1104, n. 95, supra. There is absolutely nothing before me to indicate that such books and records reflect what Mr. Shargel states is \"submitted\" by him.\n\nFinally, as I have earlier noted, defendants at trial could have subpoenaed such books and records of both Carminati and 803 Maintenance. \u003cspan class=\"fnref\"\u003e122\u003c/span\u003e\" They elected not to do so, as I have earlier observed, because of a fundamental trial decision. They cannot now be heard to say they were deprived of vital information.\n\nEven if I were to credit as accurate everything else in the Shargel affidavit which is averred as fact, I would not find this affidavit to be sufficiently reliable either as to the Brady motion or on a motion based upon newly discovered evidence. \u003cspan class=\"fnref\"\u003e123\u003c/span\u003e\" What is reflected is, as I have stated, triple-layered hearsay, with the purported first layer a person who, at best, would be highly impeachable if the other characterizations made of his character by the defendants are accurate. \u003cspan class=\"fnref\"\u003e124\u003c/span\u003e\"\n\nThe tapes and the information contained therein do not constitute newly discovered evidence requiring the granting of a new trial because evidence is not newly discovered when it was known or could have been known by the exercise of diligence on the part of a defendant or his counsel. United States v. Bujese, 371 F.2d 120 (3d Cir. 1967); Wilkerson v. United States, 435 F.2d 845 (3d Cir. 1970); and see United States v. Natelli, 553 F.2d 5, 7 (2d Cir.1977).\n\nThe defendants had the opportunity prior to and during the trial to interview and/or subpoena Carminati, with a continuance to do so, but did nothing. They have made no showing that they could not have obtained the same information allegedly contained in the electronic surveillance materials gathered by the State by simply interviewing Carminati or by calling him to testify at the trial; and as I have pointed out, defendants do not argue they tried to contact Carminati but were unsuccessful. The defendants' lack of diligence in seeking to interview Carminati concerning his association with Sutton is sufficient reason alone for denying their motion. This is particularly so in view of the disclosure, made only recently, that at least some of the defendants have received the cooperation of Carminati's attorney, in their motions now before me.\n\nNext, even if the logs be viewed in a light most favorable to the defendants, and interpreted to mean that Carminati was overheard to refute Sutton's description of their loan transaction, all that defendants have established is that Carminati had made a self-serving statement, that is, a denial he committed the crime of \"loan sharking,\" on a matter collateral to the issue of defendants' guilt, in view of the virtually undisputed fact of pay-offs to Serota and Ross.\n\nI turn now to the allegation by the defendants that the United States Attorney had access to the information on the Bergen County tapes. Defendants have failed to carry their burden. I am completely satisfied by the affidavits submitted by detached and objective state officials that, with one possible exception, covered by the Ferry affidavit, they gave no detailed information gathered therefrom to federal authorities adverting to Sutton or to a relationship between Carminati and Sutton. \u003cspan class=\"fnref\"\u003e125\u003c/span\u003e\"\n\nIn one narrow area there is an apparent fact clash between what Prosecutor Woodcock states in his affidavits of February 4 and March 4, 1977 and what Mr. Dershowitz states in his affidavit of February 21, 1977 he was told by Mr. Woodcock. Mr. Dershowitz stood firm in his position that I had to accept as true whatever he stated in his affidavit. Hearing of May 6, 1977, Tr. 38, et seq. He further stated that he could show by independent means that Mr. Woodcock's affidavit was false. Since their contact was by telephone, I suggested that this \"independent means\" might be a telephone recording and invited Mr. Dershowitz to relieve the record of the impression that either he or Mr. Woodcock had filed a false affidavit. He declined to do so.\n\nActually, I think the clash between the affidavits is more apparent than real. Thus, while I find that Prosecutor Woodcock gave no detail about the undercover investigation to the F.B.I., I do find that he had discussion with certain agents about the fact that his office, through Lt. Delaney, was engaged in an undercover investigation into organized crime in Bergen County. I further find that the F.B.I. was advised that a subject of said investigation was Carminati. See Affidavit of Special Agent John H. Connors.\n\nI further find that the F.B.I. did not pass on this information to the United States Attorney, and that the F.B.I. for this narrow purpose was not a prosecutorial arm of the United States and that the doctrine of constructive notice is not here applicable. United States v. Quinn, supra, 445 F.2d at 944.\n\nAssuming, alternatively, for purposes of aiding appellate review, that the F.B.I. here should be considered a prosecutorial arm of the United States, the question thus posed is whether the information that Carminati was under state investigation was Brady information and should have been turned over to the defendants. Bearing as it does upon one who might be labelled at most an associate of a witness who was already a self-admitted criminal whose character had been thoroughly blackened, I do not regard this as Brady information.\n\nNext, assuming that it was Brady information, under the Agurs formulation, I do not find that this information was \"material\" under either the \"reasonable doubt\" or the \"reasonable likelihood\" test as embodied in my earlier analysis of Agurs, 1101-1102, supra, considered in the light of the totality of the evidence. \u003cspan class=\"fnref\"\u003e126\u003c/span\u003e\"\n\nAs I have noted in connection with the in camera hearing, Carminati had been described as a \"loan shark\" by one defense counsel at a time when it is beyond dispute all counsel knew his name. Another asked flatly for his \"rap sheet.\" The circumstances of the loan made the \"loan shark\" description appropriate; and Tony C had been well pictured for the jury. Moreover, I have reviewed the evidence at length and the substantial corroboration Sutton's testimony received. \u003cspan class=\"fnref\"\u003e127\u003c/span\u003e\" Diaco is recorded meeting with and paying off Ross and his presence at the Serota closing is almost as clearly demonstrated. That Valentine was the indispensable man, first arranging to resolve the two \"problems\" and thereafter functioning to have his vice-president Diaco make contact with Ross and deliver the money to both Ross and Serota, is equally evident. Telephone calls at critical junctures, the $270,000 bad check, the matching of Diaco's statement to Ross, with his to Sutton that each wanted for their efforts only to get the project's electrical work for their company; the undenied fact that Valentine met frequently with Sutton as evidenced by Sutton's office records, are just some of the reasons why the evidence of Valentine's guilt was almost as clear and weighty as it was as to Diaco.\n\nThe IFC defendants could gain nothing from a further blackening of Sutton. Sophisticated businessmen, as they pictured themselves to the jury through their counsel's openings, are not going to be able to argue that they were as closely related to Sutton as they obviously had to concede, over a period of many months, without finding out about his background. This is particularly so when they are going to grant him loans into the millions of dollars. Any juror knows the investigation that even a small consumer loan entails. Then, of course, these self-proclaimed honest businessmen \"kick-off\" their relationship with Sutton by directing him to assist them in stealing money from their corporation. Sutton here was powerfully corroborated, as I have earlier noted. 1067-1069, supra.\n\nSutton's testimony as to the IFC defendants' involvement with the Serota pay-off these defendants now concede to be true. As I stated earlier, had they taken this position at the outset of trial, one could have predicted with certainty their conviction on the Ross Count (Count II). 1069-1073, supra.\n\nStopping here, it is instantly apparent that under the unusual circumstances of this case, the lower Sutton sank in terms of his criminal activities, the poorer the chances of these defendants for acquittal became. This is not theoretical conjecture. It is a conclusion tested by what occurred at trial. The jury actually heard Sutton, meeting with Diaco and Ross, coolly discuss each step in the scheme, ending with the bribe offer to Ross. They heard from his own words on this occasion what a thorough scoundrel he was. The effect in the courtroom was dramatic as the recording was laid before the jury. Nothing involved in the alleged Carminati- Brady matter, whether directly or through its fruits, could have brought home to the jury Sutton's venality and criminal propensity as did this conversation. Yet there was more, both on direct and cross-examination, to which I have already adverted. 1061-1064, supra.\n\nAccordingly, for the reasons set forth, I find no reasonable likelihood that the information \"suppressed\" under my assumption could have or would have affected the judgment of the jury in this case.\n\nAs to the Ferry affidavit, it states that his office files show receipt of three references to Sutton from state and local officials during 1974 and 1975; and that, except for these, \"a review of the files of DEA concerning the Bergen County investigation reflects no other information furnished my office by either the State Police, Lt. Joseph Delaney or the Bergen County Prosecutor's Office in which Sutton's name is mentioned.\"\n\nThe Ferry affidavit concludes: \"At no time prior to March 21, 1977, did the Drug Enforcement Administration disclose to the Office of the United States Attorney for the District of New Jersey any information or files relating to the investigation heretofore described in paragraph 2 or to an individual named Arthur Sutton.\"\n\nI have made those references available to defense counsel for their comments. This material is not to be regarded as within the constructive knowledge of the United States Attorney since Mr. Ferry was obviously not part of the prosecutorial arm in this case, \u003cspan class=\"fnref\"\u003e128\u003c/span\u003e\" see, 1096, supra, and I find that the United States Attorney did not have actual knowledge of such information. Even if he had, however, applying again the \"reasonable likelihood\" test, defendants' motion must be denied. For the reasons already given, I would conclude again that as Sutton was more and more blackened, so were the IFC defendants; and, of course, I have already stated the overwhelming nature of the case against Valentine, Diaco and their company, even though these defendants, unlike the IFC defendants, still do not concede their involvement in the Serota pay-off.\n\nIn summary, and for the reasons stated, defendants' Brady motion as to Carminati is denied.\n\nFirst, counsel by their inaction at trial lost their right to invoke Brady. Having made an informed decision on their trial strategy, they cannot double back on their trail and thereby disavow what trial counsel, with all the information they had about Carminati, elected to do: ignore Carminati entirely, and simply attack Sutton on the terms of the illegal transaction.\n\nSecond, even if counsel were not precluded by their trial conduct, the matter before me does not constitute Brady material. Even if it did, moreover, under Agurs, defendants still fail to succeed on their application.\n\nv. Disqualification and Evidentiary Hearing\n\nIt has been said too often to require citation of authority that a judge has a duty to sit absent persuasive reasons to the contrary. Such duty is particularly appropriate here. Although I was the judge in this lengthy trial, the instant motions still required of me a tremendous effort over many hours in reading and re-reading every page of the trial transcript and relating one piece of evidence to another. \u003cspan class=\"fnref\"\u003e129\u003c/span\u003e\"\n\nThe burden upon a judge unfamiliar with the trial proceedings would have been multiplied many times. \u003cspan class=\"fnref\"\u003e130\u003c/span\u003e\"\n\nThe claim that I should disqualify myself is frivolous. While it is not clearly stated, defendants' contention seems to rest upon a portion of the transcript which, given a strained reading, out of context, suggests that I conducted two, not one, in camera proceedings on the \"Tony C\" matter.\n\nI have noted earlier the various Brady applications and my disposition of them. The expression of the United States that it would be willing to submit \"Tony C\" material to me in camera was not objected to by the defendants, nor did they object when I stated, first, that I would undertake such a review, and thereafter, that I had. Tr. 2275 and 2384. The transcript of this in camera proceeding has been made available to the defendants on this motion. Even a cursory reading demonstrates it relates to \"Tony C\" matters which defendants had persistently raised, and to which the United States had just as persistently responded, with its offer to disclose such information to the court in camera. It is also clear that it is complete and that it makes no reference to any other review by the court of \"Tony C\" information. After the in camera hearing I stated:\n\nTHE COURT: Let the record reflect I held an in-camera hearing at -- not a hearing, but rather heard counsel for the government, in-camera from approximately 1:05 to approximately 1:30 and at the conclusion of his statement for the record I indicated I would reflect further on the matter and make a determination next week on what I was going to do having to do with this matter that was reflected earlier in the minutes of this proceeding, of the testimony and the conferences at side bar.\n\nTr. 2384.\n\nThis followed a statement by the United States just prior to the luncheon break, as follows:\n\nMR. J. GOLDSTEIN: The United States does have additional reasons why we do not wish to disclose at this time the name of the individuals and I'm not trying to prevent counsel from learning that name, but I do have very good reasons which I think I should protect the United States as well, but on the record I suggested in an in-camera proceeding that's sealed that I do think there are interests the United States must protect, and I have an obligation to protect those interests, and I think it would not be fair for me in representing my client if I did not take this position. (emphasis supplied)\n\nTr. 2275.\n\nThe underlined reference, as I understand defendants' position, is interpreted by them to mean I conducted an earlier \"Tony C\" in camera proceeding without reflecting it in the record. This is belied by the facts of record.\n\nThe reference by the United States was obviously to an earlier request it had made for such in camera review. Tr. 2083; 1110, supra. That it was so understood by all present is plain. Defendants certainly did not raise any question, and the only counsel on this motion who was at trial has not taken a position now to the contrary.\n\nThe Dershowitz affidavit omits a significant reference. Thus, after the United States offer at Tr. 2275, I stated I might hold an in camera review with the United States over the lunch hour. Tr. 2277. No one objected. Later, at Tr. 2890-91, as has already been noted, I resolved the Brady issue as I had said at Tr. 2384 I would do.\n\nI have stated that the defendants did not object. It is more accurate to say they suggested it. Counsel for one defendant stated, without a dissent from the others, that it was desired that I review the \"Tony C\" matter and that he was content to let me make the decision whether the defendants should have the information. 1112, n. 111, supra.\n\nI reviewed in camera other material as well. Some of this was at defendants' request, such as the Cutrupi grand jury testimony and Sutton's pre-sentence report. This procedure is one invariably followed by a trial judge. It is a procedure which must be followed where doubt arises over whether information is Brady material. It is a novel position to take in urging that, in doing so here, I laid the basis for recusal on a post-conviction relief application, particularly when, as here, defendants not only did not object to, but actually encouraged, the procedure.\n\nThere was some additional material given to me for review before trial. This review, like that during trial of certain grand jury testimony and the Sutton pre-sentence report, did not require any discussion with the United States. It related not to Brady but rather to Jencks Act material. 18 U.S.C.  3500. Thus on March 7, 1973, in the presence of all counsel, I stated:\n\nTHE COURT: All right. I can't resolve this now. I've got a dentist appointment at five o'clock I have to get to. If you feel that there is anything in this area then I'd suggest that you get it to me in terms of -- for in camera examination.\n\nNow, in that regard I had indicated earlier I wanted anything that you felt was not Jencks Act material but nonetheless that should be submitted to me to see whether I concurred, submitted to me as soon as possible. You have given me one item and I have reviewed it and I find that it is Jencks Act material. I will leave this in my chambers and you can pick it up. I'm going to mark it now Court's Exhibit 1 and then that will be reflected in the record that I've done that.\n\nTr. 156.\n\nThe material in question bore no relation at all to Carminati; and the defendants sought neither to review the material at the time nor object to the procedure. \u003cspan class=\"fnref\"\u003e131\u003c/span\u003e\"\n\nDefendants raise another issue in connection with their motion for my recusal and for an evidentiary hearing. They contend that, since they wish to examine me as a witness on whether, in connection with Carminati, I held more than just the one in camera proceeding with the United States, on March 22, 1975, I must therefore recuse myself. Were I to do so on the basis of the grounds thus urged, it requires little imagination to perceive the result. Counsel in every post-trial Brady application, where a court at trial had conducted an in camera review of documents for Jencks Act study or had conducted under Agurs a Brady review or inquiry, as I did here, could by the simple process of demanding the testimony of the trial judge at an evidentiary hearing, obtain his recusal. I decline to be a party to creating such a precedent, particularly when what I did was done on the record and at the request and acquiescence of the defendants.\n\nFinally, defendants urge my recusal because of statements made to me at the March 22, 1975 in camera hearing by the United States, which statements, they contend, prejudiced me against the defendants. Again it must be noted that the Supreme Court in Agurs prescribes in camera review by the trial judge in connection with possible Brady issues; and that not only had the United States indicated here, prior to the in camera hearing, why it desired such a hearing, but that defendants had urged such a hearing. Moreover, the in camera allegations in large part matched what the United States had previously and thereafter stated in open court. Tr. 1617-22; 1638-39; 1641. See also Tr. 1655-56, where the United States set forth what it sought to prove about post-indictment activity of the defendants. Additionally, it was brought to my attention out of the jury's presence, that Orenstein had changed his testimony when he went before the grand jury for the second time. In this regard, his counsel virtually conceded that Orestein had lied in his first appearance before the grand jury.\n\nMore than this, however, was the evidence I heard during trial. To say that I was prejudiced by the in camera hearing, when the totality of the evidence is considered, is to state the absurd.\n\nThus, the motion for recusal is denied.\n\nDealing with the request for an evidentiary hearing, crystal clear here is the fact that defendants have carefully plotted a course which they hoped would put them barely over the threshold of evidentiary hearing requirements, avoiding delivering to me a great deal of information readily available only to them. My suggestions or requests for more information have been met by defendants' \"stonewalling\" it. In effect, they say \"We have given you enough to require an evidentiary hearing. To get more you will have to give us that hearing. Then and only then will you get it.\" See 1086; 1088, n. 56. My suggestions that their record lacked vital materials, such as affidavits from Judge Bauman, Mr. Wollen and Mr. Szuch, have gone unheeded. 1088-1091, 1094 supra.\n\nThe practical and easy approach on a Brady motion ordinarily is to hold an evidentiary hearing. It saves the kind of review I have had to make of the record. Counsel here, however, have listed the witnesses they would call on such a hearing. My experience tells me that the agenda they propose would call for several weeks of testimony. \u003cspan class=\"fnref\"\u003e132\u003c/span\u003e\" It is for this reason that I have so carefully reviewed this matter. Notwithstanding the added burden upon me -- or another judge, as proposed by movants -- if defendants are entitled to a hearing they must be given one. I have concluded, after careful study of the issues, an evidentiary hearing is not required. Williams v. United States, 503 F.2d 995 (2d Cir. 1974); United States v. Franzese, 525 F.2d 27, 31 (2d Cir. 1975), cert. denied, 424 U.S. 921, 96 S. Ct. 1128, 47 L. Ed. 2d 328 (1976).\n\nvi. Motion for Bail\n\nIn these days of crowded dockets, already beset by problems of the Speedy Trial Act, the schedule of the trial judge now is becoming increasingly subject to post-conviction relief proceedings.\n\nFinality of criminal proceedings is a goal we seek. Yet, resourceful counsel can by motion after motion, and hearing after hearing, with appeals of every post-trial determination, seemingly postpone almost forever the day when a defendant has to begin serving his sentence. Consistent with such strategy, counsel have here moved for bail pending final disposition of their motions.\n\nIn point is United States v. Rosner, 549 F.2d 259, 264 (2d Cir.1977), where Circuit Judge Gurfein wrote:\n\nThe history of this case reveals that Rosner has been afforded every opportunity for judicial review and reconsideration at every level. This court has remanded once for resentencing to provide him the opportunity to establish that Judge Bauman relied upon false and misleading information. In the intervening three years and four months there has been no attempt to establish that the court had relied on anything improper. For the reasons given, Judge Wyatt's sentence is not vulnerable. It is appropriate that this litigation cease at some point and we believe that this time has now arrived. \u003cspan class=\"fnref\"\u003e133\u003c/span\u003e\"\n\nI had not acted formally upon defendants' motion for bail pending determination of these motions. Instead, by tacit understanding of counsel, defendants have continued to be at large while these motions have been pending.\n\nI now order that they surrender to the United States Marshal to begin their sentences. Assuming arguendo the applicability of 18 U.S.C.  3148, an appeal would be frivolous and taken only for delay. Assuming too, but not deciding that the burden of proving such rests upon the United States, it has discharged that burden beyond a reasonable doubt.\n\nI have reviewed the evidence at length in the accompanying opinion. It destroys every claim made by defendants on this motion.\n\nThus, their basic claim, to come within the \"slender reed\" of McCrane II, that their convictions were founded solely upon an \"uncorroborated Sutton,\" is totally without support. See 1063, et seq., supra.\n\nNext, that Sutton was portrayed as an honest businessman is just as inaccurate. See 1059-1063, supra.\n\nDefendants' Brady claim as to Silver is made against a background which lends it no support. The IFC defendants, having interviewed Silver during trial, and having been apprised by him as to his knowledge of Sutton, decided either they had no Brady claim, or if they did, that they were not going to raise it. They never brought the matter to my attention, or examined Sutton about Silver, or sought a continuance. See 1085-1095, supra. The Wollen notes are particularly destructive of any claim these defendants might make that they were not sufficiently informed about Sutton by Silver so as to take action under Brady at trial. See my analysis thereof, Ct. Ex. 3; see also 1085-1095, supra.\n\nEven if the IFC defendants had not thus barred themselves from presenting a Brady issue at this late date, the Silver material is not exculpatory of any of the defendants, and, even now, two years after the disclosures, defendants present nothing to show otherwise. 1095-1101, supra. To the extent the Silver material impeaches Sutton, it is merely cumulative and falls far short of being \"material\" under any Agurs \"situation.\" See 1101-1110, supra.\n\nActually, the IFC defendants knew that Silver had written a letter to the United States. They could have made a \"specific\" Brady request. 1090, supra. They did nothing.\n\nAs to Diaco and Valentine, the Silver material simply adds to the overwhelming proof of guilt. See 1094-1096, supra.\n\nAs to Carminati, all defendants at trial played a little game. They knew so much about Tony C, yet examined Sutton (or refrained from examining him) so as to avoid conveying to the jury that they knew Tony C was Antonio Carminati, had a criminal record, had committed a crime with the $60,000 loan, and that they could have readily located him, interviewed him and subpoenaed him, if they had desired. The United States agreed to lay before me its information about Carminati. I decided not to require disclosure to the defendants because it was evident defendants already knew much more about Tony C than they professed to know, and because, given the information they had, including the foregoing, they clearly were in the position of being able to make an informed decision to contact Carminati. Also a factor in my decision was that, to the extent Sutton's credibility was affected by his association with Tony C, the defendants had all the information necessary to conclude what kind of man Carminati was, and to confront Sutton therewith.\n\nGiven all of this, the fact that Carminati was under state investigation meant nothing in Brady terms; nor did the fact that he was under electronic surveillance, for the reasons already set forth.\n\nAccordingly, because any appeal would be frivolous and taken only for further delay, I am denying defendants' motions for bail; and I direct their surrender at once to begin serving their terms.\n\nvii. Motion for Reduction of Sentence\n\nOn their motions the defendants have predictably urged the hardship imposed upon the defendants' families by the sentences imposed. I have been told the sentences were unusually harsh when judged by standards of other circuits. Finally, defendants argue that, since Counts I and III have been reversed, there should be a reduction in sentence.\n\nThe motions are denied.\n\nEach case must stand on its facts. These defendants were convicted of offering a public official $500,000, and delivering a $100,000 installment to him, to corrupt the processes of government. The Serota payoff of $1,100,000 for an apartment worth at most $500,000, was a prerequisite and was intertwined with the attempt to bribe Ross. Emboldened by their success in buying Serota's silence, the defendants then endeavored to resolve the second of their two problems. The evidence of guilt was overwhelming. I need add nothing to what I said on sentence day to characterize properly the defendants' wrongdoing.\n\nMy original sentence was built upon an understanding of the case as involving one scheme. This is why I imposed concurrent sentences. The fact that, for the legal reasons with which counsel are familiar, the Serota pay-off was not a federal crime, does not make it any the less immoral or any the less a vital part of defendants' corrupt overall scheme.\n\nFinally, in terms of comparisons, the sentences here were well under those imposed in certain other corruption cases in this district in recent years.\n\nAccordingly, the motions for reduction of sentence are denied.\n\nSubmit an appropriate form of order on two days' notice.\n\nAPPENDIX A\n\nVAR DIC SF PLAIN\n\n3:30 PM NITEL AUGUST 7, 1975 JFL\n\nTO: NEWARK (166-2126)\n\nFROM: SAN FRANCISCO (166-2652) (RUC)\n\nNORMAN DANSKER, ARTHUR SUTTON; JOSEPH DIACO, ET AL, ITARBRIUARY. OO: NK.\n\nRE NEWARK TELCALL AUGUST 6, 1975.\n\nFOR INFORMATION NEWARK OFFICE, SA LEROY M. TEITSWORTH AND SA CHARLES E. MC COY, SAN FRANCISCO OFFICE, RECALL JAMES SILVER APPEARED AT SAN FRANCISCO OFFICE ABOUT SEPTEMBER 1974. SILVER CLAIMED HE WAS WRITING A BOOK CONCERNING HOODLUM ACTIVITIES IN THE EASTERN UNITED STATES AND IN DEVELOPING THIS INFORMATION HE IS NOW FEARFUL FOR HIS LIFE. UPON SPECIFIC QUESTIONING SILVER WAS UNABLE TO BE SPECIFIC CONCERNING ANY THREATS MADE AGAINST HIM. SILVER FURNISHED THE NAMES OF SEVERAL ITALIAN HOODLUMS WHO HE CLAIMED ARE ENGAGED IN CRIMINAL ACTIVITIES IN THE EAST. AGAIN WHEN SPECIFICALLY QUESTIONED SILVER COULD FURNISH NO SPECIFIC INFORMATION CONCERNING THE CRIMINAL INVOLVEMENT OF THESE INDIVIDUALS AND AS A MATTER OF FACT DELIVERED A VERY INCOHERENT STORY CONCERNING THESE INDIVIDUALS AND THE THREATS AGAINST HIS LIFE.\n\nIN VIEW OF THE INCOHERENT STORY RELATED BY SILVER, AND THE APPARENT INSTABILITY OF SILVER, NO EXTENSIVE NOTES WERE TAKEN, NO FO 362 WAS PREPARED, AND THE DATA RELATED BY SILVER WAS NOT FURNISHED THE NEWARK OFFICE OR ANY OTHER FIELD OFFICE.\n\nSA'S TEITSWORTH AND MC COY ARE POSITIVE SILVER DID NOT MENTION THE NAMES ARTHUR SUTTON, JOSEPH DIACO, OR NORMAN DANSKER. END\n\nAPPENDIX B\n\nDear Mr. Goldstein,\n\nI am well aware of the fact that your office has prosecuting jurisdiction in the case involving ARTHUR SUTTON AND THE PLAZA DEVELOPMENT CO AND THE ALLEGED BRIBE OF THE MAYOR OF FORT LEE: TO OBTAIN CERTAIN VARIANCES IN ZONING AND TO ASSURE THE FUTURE REALIZATION OF THE PROJECT.\n\nA simple investigation on your part would proove to you that I was associated with Mr. Sutton -- and in fact a partner with him in numerous developments that were either under construction or in planning at the time of the Board of Adjustment hearings in the Borough of Fort Lee. I fact I made my offices with Mr. Sutton. There is certain information which I would like to bring to the attnetion of your office. My purpose in passing on this information is purely our of conscience. I am no longer in the real estate business and am just beginning to embark on a writing career and the furtherance of my education. I never at anytime had a hidden or identifable interest in the Fort Lee development.\n\nAn examination of the activities of Mr. Sutton, would reveal a financial relationship and partnership with one Joseph Comras (750 Park Ave NYC). Mr. Comras, like Mr. Sutton is a former partner at Arlen Realty etc. During the period of time that we are talking about (the hearings and shortly thereafter) Mr. Comras wasa partner in the NY Mortgage Banking firm of Sonnenblick-Goldman Corp. It came to pass through one of Comrass's employees, a Mr. Phil Cohen, that the firm of Sonneblick etc received a mortgage application on a completed building in the Oranges where the electrical contractor had to take over owenership of the project due to the original builders non failure to pay the contractor. The contractor was Valentine Electric Co. Mr. Comras called Mr. Sutton to ascertain who this Valentine company was. I was in Mr. Sutton's office when that initial call took place. Mr. Sutton informed Comras that they were a \"connected\" company. Mr. Comras met with a representative of Valentine at least once (i believe that this was D'Arco). He then called Arthur Sutton to set up a meeting with this D'Arco at our office in Englewood Cliffs. The purpose of this meeting was not devulged to me nor was I permitted to meet with Mr. Sutton, D'arco and Mr. Comras when they met. The two subjects that were to be discussed (I overheard this through telephone conversations, was Fort Lee and 5 properties in East Orange that Sutton had bought from Investors Funding in one of those phony chinese deals that your office is well aware of. In fact Mr. D'Arco later visited these properties and dined with our chief property management man, a Mr. Ivan Schaffel (212 896-8335) and represented to mr. Schaffel that there was a partnership arrangement in the works and that the Valwntine organization could assure instant if not expeditious processing of contemplated FHA and New Jersey state housing applications for the rehabilation of these properties. Mr. Comras was to be (if not already) a partner in this development. An examination of the banking records of Venice Corporation at Security Natl Bank 1212 Sixth Ave would support my position and both Sutton and Comras where guarantos there of a $200,000 loan.\n\nIn essence I thought that your office should be aware of the fact that Joseph Comras was an integral cog in the conspiratory wheel that helped conceive the bribery situation. I believe he initiated the idea; and this is excellently supported by the fact that he introduced Sutton to the Valentine organization and partook in whatever planning of projects with them went on. I repeat. COMRAS WAS PRESENT AT MEETINGS. HE SIMPLY DID NOT OFFER HIS FRIEND TELEPHONE CONVERSATIONS AND HE MET AND DEALT WITH THE V LENTINE PEOPLE WITH FULL KNOWLEDGE OF THEIR IDENTITIES.\n\nMr. Joseph Comras has a history of such bribery and payoff scandals. An examination of the files of the D.A. of N.Y. County would find that Mr. Comras while a apartner at Arlen Realty made a substantial payoff to the then deputy Comptroller of the city of N.Y. in order to obtaina mortgage loan from the City of N.Y. employees pension fund. Mr. Comras was not to be prosecuted by arrangement and later testified against Eugene Sugarman, the deputy Comptroller who was convicted of a felony as a result of Comras's \"deal\" for non prosecution. Sugarman received a 2 year sentence as a result of the conviction based purely on Comras testimony. I thought that this style and history might be important to you.\n\nIn the past I have maintained an excellent social relationship with Mr. Comras and his new wife. Upon my disillusionment with Comras, Sutton and others who I respected in the business world, I became quite disillusioned and needless to say \"dropped out\" but plan a book; sort of an expose among the stories I plan to tell is the one I have told above . . . only in my book with conclusions where I do truly suspect that Mr. Comras had a hidden financial interest in the Fort Lee development.\n\nAs to Mr. Comras present activities, I can not say. I have it from reliable sources that on any given day one could find between 1 and 3 ounces of cocaine in his house or on he or his wife's person or being held by their Chauffer. A substantial amount of marajuana is purchased by them in additional to qualudes (i dont know what they are). I don't know weather the Comrasses purchase these substantial amounts of cocaine and other drugs for resale or for their own personal consumption.\n\nI have generally told my story in this letter. I have been to Geneva in the last week and maintain residence in California where I am pretty certain that I am going tomorrow. I can be contacted through my grandfather who has complete power of attorney for me. He is Louis Weisberg Tel Home 212 685-9300 business 212 541-4321. I hope that the information provided helps your office to do the right thing and give other developers an example that they can not toy with the public trust.\n\nVery Truly Yours.\n\nJames Silver\n\ns/ James Silver\n\nAPPENDIX C\n\nUnited States Attorney\n\nJonathan Goldstein\n\nUnited States Department of Justice\n\nFederal Building\n\nNewark, New Jersey\n\nDecember 18, 1975\n\nRe: USA vs Dansker, Haymes Et al\n\nDear Mr. Goldstein,\n\nThis letter concerns the above referenced case. Since my having agreed to sign certain affadavits on behalf of Defendant Norman Dansker, certain other facts have come to my attention; as well as other laws not known to me prior to my signing of these documents.\n\nI shall list my points numerically:\n\nNUMBER ONE : I was promised by N. Dansker, both personally and via my grandfather Louis Weisberg financial compensation for my willingness to assist Dansker in his appeal. My Grandfather was also made like promises by one Morris Karp who is well known to your office. My testimony against Karp and Realty Equity Corporation of NY in the SEC 1972-1973 matter still stands under oath. It also applies as to my then knowledge of dealings between Dansker and Karp. Today in fact, they are purchasing properties in partnership. Some of these real properties are the very ones that were the subject of the Republic National Life Insurance Co and REC alleged fraud. They now involve Norman Dansker, the original owner of these properties prior to their purchase by Karp and then the alleged fraudulent dealings with Republic Life.\n\nNUMBER TWO : My grandfather and Arthur Puro were the Real Estate Brokers on the purchase of an apartment building from the Long Island Savings Bank, the intended owners were to be a partnership between Karp and Dansker. A brokerage fee of $5,000. was paid by the bank to my grandfather, which was shared with Puro. In addition my GRANDFATHER RECEIVED A $ 5,000. CHECK FROM DANSKER'S ATTORNEY (which was earmarked for and given to me). Dansker willallege this was part of the brokerage fee, however it was never shared with Puro the co-broker.\n\nNUMBER THREE : Late in July 1975 I was arrested and while temporarily incarcerated on Rikers Island NY, a former Dansker employee, one John Gardner came to Rikers Island and posted the remaining $ 250. of my bail and drove me home. That money was never repaid. Today those charges are pending.\n\nNumber FOUR : Dansker made me numerous promises of books to be published etc. He and Stephen Haymes have in their possession, 6 tapes belonging to me which were for a book to be written by me. They have refused to return these tapes to either me or my grandfather. They were not recorded for any legal purpose whatsoever. The purpose of thez tapes can be corroborated by Isabel Geiler 300 East 74th st NYC for it was in her apartment that the tapes were recorded. I have asked Attorney Alan Dershawitz to return these tapes to my grandfather and indeed he has refused.\n\nNUMBER FIVE : I have been in various parts of the USA as you might well understand over the last few months. Defendant Dansker and Haymes and their counsel, know of my whereabouts at all times in the Los Angeles area; although I was a figitive at the time. This can be corroborated by telephone calls from 213 396-4866 to various offices and homes of Defendants and Counsel alike.\n\nNUMBER SIX : Promises of financial security in the form of brokerage fees to be paid and financial interests to be won were promised to me by Defendants Dansker and Haymes at such time as they won their appeal. Both my grandfather and I were told that I \"would not have anything to worry about for the rest of my life\" by both Dansker, Haymes and Morris Karp acting in Dansker's behalf.\n\nI hope these facts will assist your department.\n\nSincerly Yours,\n\ns/ James Silver\n\nJames Silver\n\n\u003cspan class=\"fn\"\u003e1. Only counsel for Orenstein and Diaco in this proceeding served as trial counsel. Counsel for Dansker at trial was Shearman \u0026 Sterling of New York City, by former United States District Judge Arnold Bauman. Trial counsel for Haymes was Pitney, Hardin \u0026 Kipp, by Clyde A. Szuch, Esq. Trial counsel for Valentine and Valentine Electric was Michael Rosen, Esq. IFC, the corporation, is not represented in this proceeding. It is involved in a Chapter XI proceeding in the United States District Court for the Southern District of New York.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. See infra 1067-1069; and see 537 F.2d at 57-58. As the Court of Appeals notes (537 F.2d at 58), I avoided leaving the impression with the jury that the \"transactions were criminal.\" That they were improper was clear. Actually, there was much more by way of proof of secret payments by Sutton on behalf of the IFC defendants that the jury did not hear, e.g., the \"agreement\" between Dansker and a Sutton company, Sanson, Inc., which led to Dansker paying $40,000 for what the government claimed was $320,000 worth of work. Tr. 1540. 2a Such a review is required to make the materiality determinations under United States v. Agurs, 427 U.S. 97, 112, 96 S. Ct. 2392, 49 L. Ed. 2d 342 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The government, of course, contends that Ross was a credible witness and that Diaco could \"guarantee\" Serota had been \"taken care of\" because he, Diaco, had directly participated in the \"pay-off\" to Serota. Testimony such as this is obviously independent corroboration of Sutton.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Movants in their \"Brief in Support of Motion\" state (6-7): That Arthur Sutton would be the key prosecution witness against the IFC defendants -- and that therefore a central defense strategy would be to attack Sutton's credibility and motivations -- was clear from the outset of the extensive pretrial proceedings in this case. Also from the outset the IFC defendants suspected that Sutton was not the honest businessman that he -- and the government -- held him out to be, and that instead he was involved in dealings and relationships with \"organized crime\" and \"underworld\" figures. Affidavit of Richard Levin, counsel for IFC defendant Donald Orenstein para. 4. They did not, however, possess the concrete evidence they needed to back up and present to the jury their suspicions. Thus, while they undertook their own investigation into Sutton's background, as a significant part of their trial preparation the IFC defendants turned to the government with specific requests for such information under the authority of Brady v. Maryland, 373 U.S. 83 [83 S. Ct. 1194, 10 L. Ed. 2d 215] (1963). (footnote omitted) That the \"investigation\" was extensive and thorough was manifest from the cross examination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Sutton had testified Comras had brought Valentine to him. The government, quite properly, did not ask why Comras had done so. The defendants could have inquired into the introduction conversation but did not do so. The only logical inference to be drawn is that Comras knew what Valentine was going to propose and that this is why he brought Valentine to Sutton. Certainly, no one who brings in a man who proposes to Sutton what Valentine did, according to the government, is being made to appear as an honest man, and the government did not claim he was. This is of interest in light of what defendants contend respecting James Silver.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. In fact, Valentine's counsel on his case introduced evidence showing that Valentine and Diaco knew Comras and had done business with him. They did not call Comras as a witness. 6a It is appropriate to note at this point that the Court of Appeals, in approving the admission of the evidence of the participation of Sutton with the IFC defendants in the pre-indictment period embezzlement, said that this evidence \"cast light, as the district court correctly determined, on the relationship, if any, existing between Sutton and the IFC defendants.\" The \"existence and the nature of this relationship were of critical importance to Sutton's credibility.\" The Court of Appeals also noted that this evidence \"enabled the jury to better understand Sutton's role in the bribery scheme. . . .\" \"Finally,\" said the Court of Appeals, \"this evidence was relevant to show a motive on the part of the IFC defendants for their alleged attempt to secure the needed zoning variances through bribery. . .. [It] is not inconceivable that the IFC defendants would resort to bribery in order to obtain zoning variances permitting the large project needed to cover up their previous unlawful activities.\" 537 F.2d at 58.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Indeed, Serota's counsel put it this way: \". . . Sutton conceded that Sutton's activities were illegal.\" Tr. 3500. Moreover, Sutton's confession to bribing Ross, stated in a plea-taking proceeding, was read to the jury and commented upon by Serota's counsel in summation. Tr. 3542.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. See also references to Sutton's testimony concerning payments in the pre-indictment period to and on behalf of the IFC defendants. This evidence was reviewed by the Court of Appeals, 537 F.2d at 57. See G-204; Tr. 1427-1446. As I have noted earlier, he, by his own testimony, marked himself as one who willingly participated in embezzlement. 8a Unfortunately for the IFC defendants, the blacker they painted Sutton, the more their own images suffered since it was clear that men as experienced as the IFC defendants were would not have gotten involved with Sutton without thoroughly investigating him; and, of course, their having joined with Sutton in the early embezzlement (e.g., Labriola) and other diversions (e.g., the Phalia properties in East Orange), documented and unexplained, simply served to reinforce the fact that whatever Sutton was, so were they.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Valentine Electric Company's criminal responsibility is, like IFC's, predicated upon the alleged wrongdoing of its principals. Hence no separate treatment of the corporations is necessary. See 537 F.2d at 44-45.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. That the evidence was at least reasonably susceptible to the inference that Valentine constructed the \"pay-offs\" appears in the Court of Appeals opinion. 537 F.2d at 45-46.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Ex. G-19 shows that in the late afternoon of April 14, 1974 at 4:25 p.m., a call went from Valentine Electric Company to Elota Realty, Serota's business office.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Diaco, according to Ross, said his efforts were simply designed to clear the way for ultimately getting the project's electrical work. Tr. 751-53. This is what Valentine had told Sutton he wanted as well. Tr. 1368.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. To show how much Diaco knew, he also told Ross on their first meeting that \"The banks have a lot of money in this. They are going to pull the money out. If they pull the money out, Investors Funding is going to go bankrupt . . . people are going to go to jail.\" Tr. 644-45. As is noted elsewhere, IFC was in a Chapter XI proceeding at the time of trial (and Dansker's counsel on opening referred to him as the former chief executive officer of IFC). Tr. 513.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. This is to be compared with the Sutton transaction with 803 Maintenance where he borrowed $60,000 and had to repay $80,000. Tr. 1549 et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Diaco, it is true, generally avoided implicating Valentine. He slipped, however, on one occasion and, in a taped conversation on May 30, 1974, mentioned the name \"Andy\" to Ross.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. As to defendants' contention that the government \"portrayed\" Sutton \"to the jury as a businessman of integrity and honesty,\" see II, supra, 1061-1064.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. See, for the terms of this transaction, 1064, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. IFC, of course, was borrowing heavily from Chase Manhattan Bank to finance the GWPP.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Certain of this evidence was reviewed by the Court of Appeals at 537 F.2d at 57-58. See 1060 n.2, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The only defendant to even venture into the area of these so-called \"kick-backs\" was Orenstein, and his counsel did so only as to Sutton's having paid expenses for Orenstein and his family on a Las Vegas trip. No counsel mentioned the Labriola or Phalia transactions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The IFC defendants used the same approach on appeal as at trial. Joint Brief of Haymes and Orenstein (at 26) claims that Sutton's \"naked testimony was the only evidence\" against them as to both Serota and Ross; and see, Dansker's Brief (at 16-17). Thus, as at trial, these defendants did not concede on appeal that which they now concede, that Sutton's testimony of their involvement in the Serota pay-off was true.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. It would be evident why these defendants could not concede at trial that Sutton was in fact telling the truth about their involvement in paying off Serota. First, it would have impeded their basic strategy of destroying Sutton's credibility to acknowledge he was telling the truth as to the Serota phase of Valentine's proposal. Second, as has earlier been pointed out, I, supra, 1060-1061, to have conceded their agreement to and participation in the Serota transaction would have made it almost impossible to persuade the jury that they had simply stopped at that point in their illegal activity, and knew nothing about, and had not participated in, the bribery of Ross. Indeed, as the judge at trial, I can state with confidence that if these defendants had at the outset of trial conceded, as they now do, their role in the Serota transaction, convictions on Count II would have been a certainty. They would have also credited Sutton's testimony on how they funneled IFC funds to him for their private gain and later to provide the pay-off money to him. See also 1067-1068, supra ; 1072-1073, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. It is not correct to say that this was the IFC defendants' position at trial, as they now contend. I suppose it is taken now to enable these defendants to deal with the Ross transaction as if it were separate and distinct from the Serota \"pay-off,\" in an effort to avoid the \"spillover\" effect on the Ross bribe from the substantial corroboration of Sutton's testimony as to the Serota bribe. If this is the strategy, it fails, because as has been demonstrated, the compelling logical inference to be drawn from all the evidence is that these two transactions were closely intertwined, with the overall scheme being two-pronged (i.e., bribery of both Serota and Ross).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. As I have already noted, 1067-1068, supra, it is unlikely that the IFC defendants would have approved of the Serota bribe unless they knew that, beyond it, the cooperation of Ross was purchasable as well. Valentine's message, as Sutton said he conveyed it, would give that assurance. This obvious point is not dealt with by these defendants here in connection with the concession they now make. They do not explain how their claimed non-involvement as to the Ross pay-off is logically consistent, under all the circumstances, with their now admitted involvement in the Serota pay-off.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. By checks Exs. G-160, 812B, 733, 161, 821, he had raised $110,000 by May 10.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. At trial, just as they had argued with respect to Serota, Dansker and Haymes argued that they had never met Ross. Ironically, in view of their attack on Sutton's credibility, they cited his testimony to support this argument; and, of course, Ross did not testify to any meeting with these defendants.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. If, as defendants now concede, Sutton was telling the truth about their role in the Serota pay-off, why would he shrink from presenting to them the second half of their joint problem, that is, Ross? Additionally, since Sutton now knew these defendants had agreed to and did reimburse him for the money he had delivered to Valentine for the Serota pay-off, it would have been amazing if Sutton did not take up with them the necessity for paying off Ross up to $500,000. What reason exists for Sutton not to have looked to the same source of cash, IFC and the GWPP closings, which he and these defendants had utilized and abused in the past? The fact is, given the character of Sutton as depicted by these defendants, it would have been absurdly incongruous for him to have borne the burden himself of raising the Ross bribe money.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. See 1061, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Indeed, Sutton testified that the Chase Manhattan Bank, IFC's lender, \"was giving Mr. Dansker fits and was threatening not to extend the loans.\" Tr. 1597-99. No one testified otherwise; and, as has been noted, IFC has since gone into a Chapter XI proceeding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Actually, Ross was avoiding Diaco. Tr. 664.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Ross, in a recorded conversation, had mentioned the May 22 confrontation in his office to Diaco, and Orenstein and Cutrupi were named as being present. Tr. 760-61.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The same approach was used by other IFC counsel. They relied upon much of Sutton's testimony as true in fashioning their arguments. See, e.g., Orenstein's counsel. Tr. 3585-3631. Orenstein's counsel paid the best compliment to Sutton's credibility. He actually read his questions and Sutton's answers, took them as true, and then used them to advance his argument. Tr. 3595 et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The detail on this check that \"bounced\" has been presented previously. 1066, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. In Giglio there had been a promise by an Assistant United States Attorney that if a witness testified at grand jury and at trial, he would not be prosecuted. 405 U.S. at 152, 92 S. Ct. 763, 31 L. Ed. 2d 104. Yet the witness testified there had been no such promise; and the government trial attorney repeated this in summation. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. The promise was made by one assistant. The assistant at trial was unaware of the promise.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. United States v. McCrane, 547 F.2d 204 (3d Cir. 1976), upon remand from the Supreme Court in the light of Agurs. In McCrane the United States had written letters to public bodies suggesting that Bellante, an architect, should not be punished by depriving him of jobs, in view of his cooperation. This is not \"bad act\" impeachment, as is relied upon by movants here, but more resembles the Giglio -type promise of prosecutorial assistance in return for favorable testimony.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. McCrane II suggests Agurs may not be applicable to a nondisclosure of impeaching evidence, 547 F.2d at 205, leaving the Giglio standard unchanged. In view of the nature of the resolution of this matter, I need not take one side or the other. That the significance of the undisclosed material (in Agurs, the deceased's prior criminal record) can only be evaluated in the context of the full trial is certain. See 427 U.S. at 113, 96 S. Ct. 2392, 49 L. Ed. 2d 342. See also, Brach v. United States, 542 F.2d 4 (2d Cir. 1976); United States v. Stassi, 544 F.2d 579 (2d Cir. 1976), cert. denied, 430 U.S. 907, 97 S. Ct. 1176, 51 L. Ed. 2d 582, 97 S. Ct. 1177 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. In his opinion concurring in the judgment in Giles v. Maryland, 386 U.S. 66, 98 [87 S. Ct. 793, 17 L. Ed. 2d 737,] Mr. Justice Fortas stated: \"This is not to say that convictions ought to be reversed on the ground that information merely repetitious, cumulative, or embellishing of facts otherwise known to the defense or presented to the court, or without importance to the defense for purposes of the preparation of the case or for trial was not disclosed to defense counsel. It is not to say that the State has an obligation to communicate preliminary, challenged, or speculative information.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. If the nature of the prosecutor's conduct is not controlling in a case like Brady, surely it should not be controlling when the prosecutor has not received a specific request for information. 427 U.S. at 110, n. 17, 96 S. Ct. at 2400.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. This portion of the opinion appears in the context of a discussion of the law applicable to the general request situation. Its application to other situations, however, at least in part, is clear.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. The Court in Mooney stated: It [a trial free of the knowing use of perjured testimony] is a requirement that cannot be deemed to be satisfied by mere notice and hearing if a State has contrived a conviction through the pretense of a trial which in truth is but used as a means of depriving a defendant of liberty through a deliberate deception of court and jury by the presentation of testimony known to be perjured. Such a contrivance by a State to procure the conviction and imprisonment of a defendant is as inconsistent with the rudimentary demands of justice as is the obtaining of a like result by intimidation. 294 U.S. at 112, 55 S. Ct. at 342. This category includes the Giglio -type case too.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Unlike the general request for \" Brady material\" or \"exculpatory information\" or \"material impeaching of witness X\", the request was for a statement made by Boblit. Cf. Agurs, 427 U.S. at 106, 96 S. Ct. 2392, 49 L. Ed. 2d 342. The suggestion by the Court in Agurs that \"it is reasonable . . . to respond either by furnishing the information or by submitting the problem to the trial judge\" is significant here. As I will later note, the latter is what was done as to the Carminati matter. Defendants' claim that the United States made no response is inaccurate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Since Smith's arrest record had not been requested, Agurs is a third-category case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. Nor was the Silver material, in the words of Agurs, \"so clearly supportive of a claim of innocence that it gives the prosecution notice of a duty to produce . . . even if no request is made.\" 427 U.S. at 107, 96 S. Ct. at 2399.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. The letters written for Bellante are referred to in United States v. McCrane, 527 F.2d 906 (3d Cir. 1975) (McCrane I), at 910, n. 4.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. References are to exhibits submitted by the United States on this motion. For convenience of the reader, this exhibit is attached hereto as Appendix C.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. This exhibit is attached hereto as Appendix A.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. This letter is attached hereto as Appendix B.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. Bauman affidavit, February 11, 1976, paras. 2-3 (Exhibit M). The United States had obtained this affidavit in connection with the proceedings in the Court of Appeals. No affidavit from him has been submitted in this proceeding before me. When Dansker heard of Silver's attempt to reach him, Dansker was at the office of Haymes' attorney. Dansker affidavit of February 22, 1977, para. 3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. Id., para. 4. It should be repeated that at the time Judge Bauman represented Dansker, Mr. Levin represented Orenstein and Mr. Szuch represented Haymes. Counsel for the corporation was not present. It was clear that the IFC defendants closely coordinated their defenses. See Levin affidavit (Exhibit N), sworn to January 14, 1977, para. 4 (reference to the \"central defense strategy\" and Mr. Levin's ability to state under oath what all three IFC defendants did in preparing for trial).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. See statement of Mr. Levin, Hearing of Feb. 14, 1977, Tr. 41, et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. Bauman affidavit, para. 6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. The post-trial motions were heard on or about April 28, 1975 and decided by opinion filed May 9, 1975. The order of denial was not entered until June 3, 1975. There was not even an indirect reference to Silver; and, as had been the case at trial, including summations, utterly lacking was the suggestion that the defendants had information in their possession which they now present through the Wollen notes and Silver's affidavit of July 15, 1975.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. Levin affidavit, para. 5.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. Mr. Levin, as has been noted, is the only attorney who was trial counsel for an IFC defendant and continued to represent his client on appeal and now.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. I will, under iv, infra, discuss counsel's decision not to pursue the Silver matter further at trial, and how present counsel (including Orenstein's attorney) have endeavored to rationalize their decision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. Defense counsel have repeatedly taken the position that by refusing to submit such information they can trigger an evidentiary hearing. They overlook the fact that I am obliged to consider the reliability of materials submitted on a motion for new trial. It is significant, as bearing upon Silver's reliability, that he says nothing in his July 15, 1975, affidavit about meeting with the IFC counsel and defendants in March 1975. It is even more significant that, while omitting to state what he told IFC counsel in March 1975, he goes into his meetings with the F.B.I. and United States Attorney at length.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. Indeed, to advance the February 4, 1977 hearing, I had telephoned Dansker's present counsel whose partner told me he had been in touch with Mr. Newcomb, Judge Bauman's partner, and that they had \"notes and memoranda\" of the March 1975 conferences with Silver. Id., Tr. 9. Only the Wollen notes have been delivered to me. See 1089, infra. In his most recent affidavit Mr. Dershowitz states he has inquired of Mr. Szuch whether he had any notes of the Silver conversations. It is regrettable that I have not been told of any response. It is even more regrettable that there continues to be a reluctance on counsel's part to furnish meaningful material.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. As I have pointed out earlier, n. 52, no memoranda were given me, nor was I given any materials reflecting the meeting counsel had with their clients, regarding Silver, before the trial ended. Missing too were notes or memoranda of the post-trial meeting with Silver. In this connection, counsel in connection with their motions, have waived the attorney-client privilege on behalf of their clients, so this does not stand as an impediment to turning over the other materials I mention. As to the notes turned over to me, it will be observed that Mr. Shargel stated that \"they are largely incomprehensible and in many instances, illegible.\" The defense strategy to trigger an evidentiary hearing again manifested itself. \"I submit,\" Mr. Shargel went on, \"that this material is essentially useless without the testimony of the person who made them.\" Of course, Mr. Shargel could have made my task easier if he had had a typed version prepared for me as I suggested, Hearing of February 14, 1977, Tr. 4-5, enlisting Mr. Wollen's assistance in that regard, as could have other IFC counsel who, of course, have copies of the Wollen notes. Id., Tr. 6. Regrettably, that has not been done. As is discussed later, because the Wollen notes were given me for in camera review, and counsel have chosen not to make them available to the government, I will not detail what they state. These notes will be sealed by me and made a part of the record. The rough notes as I received them are marked Ct. Ex. 2. The typed version as I have prepared it in my chambers is marked Ct. Ex. 2(a). Mr. Shargel's letter of transmittal is marked Ct. Ex. 1. I am also enclosing my analysis of certain portions of Mr. Wollen's notes to confirm my assumption that what defendants knew in the summer of 1975 they knew in March 1975, marked Ct. Ex. 3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. Mr. Shargel had assumed the role of dealing primarily with the Carminati matter. Mr. Dershowitz covered both Silver and Carminati, underscoring what Messrs. Levin and Shargel had argued.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. As appeared at this hearing, Wollen had been told by Silver of the latter's contact with the United States Attorney. Tr. 61-63. I shall deal later with this matter. Suffice it to say for now that Mr. Levin did not deny knowing either on March 23 or 24, or immediately post-trial, that there had been such a contact. He simply says that he had \"no recollection and did not believe that at any time prior to Mr. Dershowitz's communication to me [in the summer of 1975] did I know the specific form that that communication took, namely, a letter of a specific date.\" (emphasis supplied) Tr. 65. He added that when he asked Mr. Goldstein for the letter in July, 1975, \"that was the first point in time that any defense attorney had sought the production of that letter.\" Tr. 65. That, of course, is accurate. The existence of the letter was known to IFC counsel who made no attempt to bring the matter to the court's attention nor request that the letter be produced, while the trial was still on or even after trial but before filing a post-trial motion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. Given this limited recollection, the request of IFC counsel that I grant an evidentiary hearing so that he might be heard under oath (see, e.g., Tr. 54, 89), cannot be taken seriously. Mr. Dershowitz objected to my questioning Mr. Levin since he was not under oath and Mr. Dershowitz had not had an opportunity to refresh his recollection. Tr. 89. Neither Mr. Levin nor other counsel, having had opportunity to refresh their recollections, have submitted additional affidavits on this issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. The affidavit submitted by Mr. Levin has been covered. Judge Bauman's affidavit submitted in the court of appeals has also been discussed. It contains nothing as to what Silver told IFC counsel or their clients.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. Mr. Dershowitz's response indicated that he was going to claim that there were \"problems\" with those gentlemen which made it impossible to secure affidavits. I then stated that if I had before me that Mr. Dershowitz wished to put in affidavits from Judge Bauman and Mr. Szuch, but they refused to give affidavits, and he stated what the problem was and he did it in affidavit form \"perhaps I can then be of help to you.\" Tr. 91. Mr. Dershowitz has submitted no such affidavit and all IFC counsel have refrained from saying that Messrs. Bauman, Wollen and Szuch had been asked to give affidavits and had refused to do so.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. Bauman affidavit, para. 7. Mr. Goldberg, appellate counsel for Dansker, was also present at this meeting, or met separately with Judge Bauman. Mr. Dershowitz was thus in a position to compare what Judge Bauman had been told by Silver with what Silver was now telling IFC counsel. Certainly, if there had been any inconsistencies, the latter counsel would have brought this to the attention of the court of appeals. Legal ethics required no less.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. This discussion relates, of course, only to the IFC defendants. They elected not to tell counsel for Valentine, Valentine Electric Co. and Diaco about Silver. Indeed, counsel for IFC itself was not told. As to the IFC defendants, none claims that he somehow got less information from Silver than the others, nor could he, in view of the several meetings, discussions, and the well-coordinated defense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. Movants' Joint Brief somewhat obscurely states that the meeting on March 23, 1975 between Judge Bauman, Mr. Wollen, Dansker and Silver, the information about which had been given to IFC counsel, occurred after the IFC defendants had completed their cross-examination of Arthur Sutton. Tr. 46. On oral argument Mr. Levin, Orenstein's counsel, conceded that movants did not mean thereby to suggest that the decision to drop the Silver matter was made because of a belief they would not be able to resume their cross-examination of Sutton founded upon what Silver had told them. Hearing of February 14, 1977, Tr. 47. Orenstein's counsel also stated that his decision not to call Silver on behalf of his client \"was not founded on the fact that the initial contact [with Silver] was made with Mr. Dansker.\" Id., Tr. 48. It is a matter of some irony, too, in view of what is advanced to justify trial counsel's inaction respecting Silver, that a few days before I had allowed Mr. Levin to cross-examine Sutton, on a sensitive matter, with the jury out of the courtroom. See Tr. 2219-49. Even inexperienced counsel would have thus been alerted to my practice of protecting the rights of the defendants to a fair trial. Additionally, in connection with the Carminati matter, I offered counsel a continuance to enable defense counsel to explore into certain information. I stated: I want you to let me know at 4:30 today how much of a continuance you will need in order to investigate it, because I want to be sure that everybody has whatever time he feels he needs to complete the issue. If you need a period of time we will recess, we will close down the trial until such time as you need it within, of course, reasonability. Id., Tr. 2096. The latter incident occurred on Friday, March 21, 1975. The incident when I allowed cross-examination out of the jury's presence occurred on March 22, 1975, one day before Silver first met with IFC. It occurred again on March 24, 1975 after the first meeting with Silver.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. Defendants' Joint Brief inaccurately paraphrases Judge Bauman's affidavit, as Mr. Levin later conceded at oral argument. Hearing of February 14, 1977, Tr. 49-50.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. Indeed, a reading of the kind of questions put to Sutton on \"credibility\" cross indicates these defendants did not lean to the conservative side as cross-examiners. They were what might be called \"free swingers\" and often, as I have noted, hit the ball hard and well in their examination. 68a What follows shows that movants were aware in the court of appeals and here of what Silver said about Sutton during trial. See also Wollen Notes, especially Ct. Ex. 3. Thus defendants at trial had from Silver what later is set forth in the Silver affidavit of July, 1975, including Sutton's \"serious wrongdoing\" and \"close connections with the underworld.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. Again, movants' counsel objected to my questioning Mr. Levin at oral argument. As I pointed out, the usual practice of a court is to inquire of counsel about a brief he has signed. Moreover, the other counsel on the Brief, Messrs. Dershowitz and Shargel, were not at trial. Mr. Levin was.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. Mr. Levin conceded I had allowed him cross-examination of Sutton out of the jury's presence the preceding Saturday as well.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71. I will not characterize this explanation. The transcript of oral argument reflects my reaction to it. Hearing of February 14, 1977, Tr. 50-60. It just does not have the ring of accuracy to it. These experienced attorneys knew that it would count heavily against them if they failed to ask for a continuance. Moreover, carefully read the \"explanation\" is not that at all. It does not say why Judge Bauman, Mr. Szuch and Mr. Levin themselves, at the trial, decided not to bring the matter to my attention. It simply says now that to have asked for a continuance then would have been irresponsible and unprofessional.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72. Since Diaco was also involved in Valdiac in the East Orange properties, presumably he makes the same claim as Valentine does -- that his dealings with Sutton were always innocent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73. See also Ct. Exs. 2, 2(a) and 3 (Wollen notes).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74. Valentine on his own case introduced evidence of the mortgage loan application through the witness Ferraro. Tr. 3236-50; DV9, 14. Thus, even if Silver had been called to testify concerning the matters mentioned, his testimony simply would have matched the government's and defendants' evidence on issues which were collateral in any event.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e75. Counsel is correct in recalling what Sutton testified Valentine had told him. Omitted by counsel is that Diaco gave the same reason to Ross.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e76. Valentine, Diaco and their company raise on this motion that the IFC defendants did not disclose to them the information gathered by them from Silver in March, 1975 at trial and immediately thereafter. I see no prejudice in this regard. Valentine, Diaco and their company obviously could not have called Silver as a witness. See Ct. Exs. 2, 2(a) and 3 (Wollen notes) and 1097-1101, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e77. See Appendix B; 1125-1126, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e78. Silver states in his July 15, 1975 affidavit to defendants' counsel, at a time when they had not seen the January 24, 1975 letter, that he had laid out information to the F.B.I. in San Francisco, which he detailed, 1083-1085, supra, and then states, significantly, that he later sent a letter to the United States Attorney embodying \"in substance\" the same facts. 1084, supra. It can thus fairly be inferred that what the F.B.I. was told matched what was in the January 1975 letter to the United States Attorney. On the other hand, as I have already noted, Silver's July, 1975 affidavit claims that things were told by him to the F.B.I. and the United States Attorney which are not consistent with what the F.B.I. Nite letter states and are undeniably untrue in the light of what is in the January 24, 1975 letter to the United States Attorney. 1084-1086, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e79. See 1061-1064, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e80. See, however, Goldstein affidavit, and 1083-1085, supra. It can, of course, be said, about the clash between what Silver says he told the F.B.I., and what the F.B.I. reports he said, that such can only be resolved by an evidentiary hearing. This is not necessary, however, in view of my having found the F.B.I. here not to be an arm of the prosecution. Additionally, as is noted, as an alternative ground for my decision, I am now going to accept as true what Silver says he told the F.B.I. (and treat the F.B.I. as a \"prosecutorial arm\" of the United States Attorney). With regard to the latter, it should not be forgotten that Silver did not write concerning \"murder\" or \"hatred\" in his January 24, 1975 letter (which, he states, contained the substance of what he told the F.B.I.); therefore, his affidavit is false.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e81. See, however, Federal Rules of Evidence 608(a) and (b). It is inconceivable that the defendants, had they known of Silver, would ever call him as a witness to testify to Sutton's reputation for untruthfulness. At best, Silver, if called as a witness, would have been limited in what he could have said. For example, assuming that Sutton had been asked if he told Silver he was considering murdering Serota, or if he told Silver he hated Dansker, and denied it, Silver could have been called as a defense witness on what obviously goes to bias. On the other hand, it is clear that no trial judge would let a question be put on cross in terms of \"Do you have underworld connections?\" Nonetheless, because of the often blurred line between proper and impermissible cross-examination, I shall not dwell further upon this analysis. The fact is that the IFC counsel had material to use on cross if they had elected to do so, and decided their clients' interests would not be served by doing so. Thus, the issue is really one of consequence only as it concerns Valentine, Diaco and their company. Even as to them, however, the issue is whether additional evidence tending further to impeach the credibility of a witness whose character had already been shown to be bad, admissible only in the court's discretion, might have created a \"reasonable doubt\" under Agurs. See 1078-1083, supra ; 1101-1103, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e82. See Ct. Ex. 3, my analysis of the Wollen notes, and Ct. Exs. 2 and 2(a), the notes themselves. I compare the above items with what is set forth in the Wollen notes. The point is, of course, that the IFC defendants cannot complain here as to items set out above if the same items were available to them during trial and they chose neither to cross-examine on them or bring them to my attention.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e83. See 1088-1091, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e84. On March 24, 1975, the day after IFC counsel first met with Silver, Sutton, on cross-examination by Valentine's counsel, was several times referred to his \"diary\" as counsel relied upon it. Tr. 2763, 2786. Sutton stated the record was not a \"diary\" but an appointment record. During the trial, counsel were advised that the government intended to use these documents during Sutton's testimony on March 17 (Exhibits E and F). Sutton's 1974 \"diary\" and his secretary's phone log, which he relied upon extensively during the trial, were admitted into evidence (Tr. 1363-64). Counsel also received copies of Sutton's 1973 \"diary\" as well as his phone log book maintained by his secretary (Exhibit E). These documents contained repeated references to Sutton's meetings and phone conversations with Silver. These documents had long been available for inspection and analysis by the defendants and none had raised a question about authenticity. Finally, counsel even at trial, given this information by Silver on March 23-24 as Mr. Levin concedes they were, could have asked for expert document examination. They did nothing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e85. Item 5 does mention IFC specifically. On the other hand, it has broader application in that, if it were true Sutton had no intention of building the Fort Lee project, he had no motive to bribe either Serota or Ross. That this is absurd is at once apparent. Ross was paid off by Diaco. Sutton is on tape discussing it. Serota was paid off; no one disputes this. For this reason, I regard this item as having no value as impeachment material, either in absolute or, under the circumstances here, relative terms.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e86. See also Ct. Ex. 3 and Wollen notes, Ct. Exs. 2 and 2(a). Indeed, given the concern that Valentine, Diaco and their company had expressed regarding Boiardo, see 537 F.2d at 52-54, on their motion for recusal, they would have had any objection to a question going to Boiardo quickly sustained. Defendants attempt to weave their Carminati claim into the Silver claim through the \"organized crime\" device, more particularly, by Silver's statement as to Schell. The fact is Schell's name appears throughout the documentary evidence; and Sutton was cross-examined about Schell. See also Wollen notes, and, in particular, Ct. Ex. 3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e87. Indeed, the suggestion that defendants in March, 1975 entertained the notion of calling Silver as a witness must likewise be rejected. Had they done so, they would have, as the first step in their preparation, called upon me to direct the United States to produce the January 24, 1975 letter and any information received from Silver. Such a request could have been easily made. Defendants thought so little of Silver, they even refrained from this step.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e88. Silver's affidavit does not state what he did or said when Sutton made the remark attributed to him. Presumably, whoever of IFC's counsel was responsible for drafting the affidavit for signature did not consider it necessary, in order to test Silver's veracity, to ask him this. I will, however, accept as true that Sutton said it, for purposes of this analysis. See Ct. Exs. 2, 2(a) and 3 (Wollen notes and my analysis).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e89. See 1078-1083, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e90. See Agurs, 427 U.S. at 106, 96 S. Ct. at 2399: \"In Brady the request was specific. It gave the prosecutor notice of exactly what the defense desired.\" That was not so here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e91. Again, I consider here the Silver information actually possessed by the United States Attorney and, as well, the information I assumed he possessed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e92. Anything is possible. If the test is \"probability\" or \"mere probability,\" however, I can state that there was no probability that the jury's verdict would have been affected. All Agurs says about the situation where there has been a specific demand, with a substantial basis for the claim of materiality, the prosecutor must respond or take the matter up with the trial judge. This may mean that the prosecutor is obligated to respond every time there is a specific request coupled with a substantial basis for claiming materiality. However, the opinion does not discuss the standard of materiality to be utilized on post-trial review where error is found to exist because of a failure to respond to a specific request. I should think it clear, nonetheless, that the same standard should apply, see Giglio, supra, and where there is an erroneous failure to respond to a specific request followed by a conviction, that conviction will be set aside if there is any reasonable likelihood that production of the omitted evidence could have affected the jury's verdict.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e93. This test is appropriate too in view of vague allegations by the defendants that the United States was guilty of knowingly using perjured testimony.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e94. Defendants do not elaborate on this latter argument. Thus, they never make clear in what respect they would have used Carminati to impeach Sutton's credibility. That there would be limits on cross-examination related to any \"association\" with Carminati is certain; such would be limited to \"specific acts\" reflecting upon truthfulness or untruthfulness. Extrinsic evidence would be barred on what would appear to be collateral matters. Cf. Federal Rules of Evidence 608(b). Even as of today they have not filed an affidavit from Carminati as to what he would say. The defendants have only recently admitted they have had access to Carminati's counsel. That he was cooperative to the extent of making available to them certain tapes, transcripts and logs (Hearing of May 9, 1977) is significant. Given this cooperation it underscores the record deficiency caused by the absence of an affidavit of Carminati.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e95. Had I let in other evidence the government offered at an early stage relating to the conduct of Sutton, the IFC defendants and their then attorney, after Sutton was indicted, Sutton's character would have been once again assailed. Vigorous objection, particularly by IFC counsel, was entertained by me. While admissible against the IFC defendants, the proffered evidence was not admissible against Valentine, Diaco and their company. Tr. 1620-60. See also the statement Orenstein allegedly made to Sutton about \"taking the rap\" and that Dansker would take care of his family. Tr. 1639. I told the United States that it was in a delicate area and that Sutton should be prepared very carefully so as not, by his answers relating to his post-conspiracy conduct, to prejudice any of the other defendants. Tr. 1653-60. See also my sustaining of the defendants' objection at Tr. 1654. Based upon my rulings, the government decided it would not go into this testimony. Tr. 1692-95. As I have previously pointed out, it was defense counsel who sought to legitimize Sutton by characterizing him as a financier well known as a real estate developer who was a good customer of IFC, and who, as far as they knew, prior to this case had a good reputation. Tr. 514, 526-27, 603-04.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e96. All of Sutton's records had been reviewed by defendants' accountants. Counsel cross-examined Sutton on other checks to 803 Maintenance written by Sutton's sister on March 14 and August 14, 1973, each in the amount of $4,000. Tr. 2301-02; Ex. DO-2. Sutton's suggestion that defendants check his records for the amount of rent paid by Carminati's company was not acted upon, or if it was, led to no questioning. Tr. 2303. Defendants' inquiry about a $10,000 check to Cass Electric, was also founded, I must assume, upon their accountant's analysis of Sutton's records held by the United States, as to which I had permitted unlimited discovery. Tr. 2304.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e97. See C-1 at 9 of in camera proceeding, March 22, 1975, as to the explanation for this, tendered by the United States.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e98. This characterization was apt and was not objected to by the United States. Thus, given repayment of the loan in six months, the interest rate was 66 2/3%. Tr. 2377. The information on the checks and dates of repayment were in Sutton's records. Interestingly, the rate thus computed by counsel on cross-examination was also thus computed by one Miceli for a Lt. Delaney in the hereinafter discussed Bergen County investigation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e99. See also Tr. 2868 where counsel asked for Carminati's \"rap sheet\": Now, your Honor, if Tony C, whom the U.S. Attorney does not deny is Antonio Carminati, if the rap sheet of this man discloses he, in fact, served ten years for manslaughter I suggest it would be relevant and appropriate information to adduce on the defendant's case. Counsel then said he would issue a subpoena for the \"rap sheet.\" Reference to the Bergen Record story was made at a hearing on this motion. Orenstein's counsel pointed out that the reporter who had so easily obtained Tony C's last name was in the courtroom. Hearing of February 14, 1977, Tr. 43. It is, of course, of interest that counsel in requesting the \"rap sheet\" inadvertently disclosed he knew Carminati's full first name as Antonio. Thus the Bergen Record story was not the only source counsel had as to Carminati's full name. In the Record his first name is given as Anthony. Defendants' decision not to cross-examine Sutton on March 24 and 25 draws heightened significance from the fact that they now not only had Tony C's last name, his full first name (Antonio), the information Sutton had given them, and at least the suspicion if not actual knowledge Carminati had a criminal record, but they also had the information Silver had given them. See 1087-1091, supra, and Wollen notes, Ct. Exs. 2, 2(a) and 3. See 1093-1094, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e100. On cross-examination Sutton was asked whether his secretary knew Tony C's last name. If, as seems unlikely, in view of the close attention given these records at trial (Tr. 1363-64; 2763; 2786), counsel had not picked up Carminati's name in their examination of the exhibits, the fact remains the United States cannot be said to have concealed the name from defendants.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e101. THE COURT: I don't find any Brady material. Application is denied. The point is you have all of the information that would enable you to serve the subpoena on that corporation, it has been identified, as I recalled the record, as having some position of principalship in the corporation -- let's brush that aside for the moment, not even reach what your pretrial preparation was, but as of the 17th there was sufficient information to alert prudent counsel if they wanted to take advantage of it. Quite aside from all of that, this is not Brady material, as I see it. Application denied.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e102. Orenstein's counsel stated he had obtained information from his client, which furnished the basis for questions he put to Sutton on cross-examination. Thus it can be inferred that Orenstein knew, and had told his attorney, that Sutton, in discussion with Orenstein, referred to \"Tony\" as \"Tony C,\" from a question put by that attorney to Sutton. Tr. 2189-90: Q You told us the principal of 803 Building Maintenance Corporation was a man named Tony whose last name you didn't know, is that correct? A That is correct. Q Do you know the first initial of his last name? A C. Q And you refer to him as Tony C. on occasions, have you not? A That's correct sir. See counsel's statement to the same effect, that is, that he knew that Sutton, in conversations with Orenstein, referred to \"Tony\" as \"Tony C\" and not by Tony's last name. Tr. 2086-87.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e103. My offer of a continuance appears verbatim at 1092, supra. Movants here also contend that the United States had some of Carminati's records, yet trial counsel never sought to examine them or to subpoena them. Had they wanted to cross check Sutton's records showing payment of the $80,000 against Carminati's, they could easily have done so.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e104. On summation defense counsel did not argue they could not locate Tony C since they did not know Tony C's last name, nor could they. Instead, they argued that Sutton knew it, and since he did, he was obviously lying when he testified he did not. It is again emphasized that they did not contend Sutton had not accumulated the pay-off money for Serota and Ross and did not argue that Serota and Ross had not been paid off.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e105. The support, as I mentioned, lay in their two-pronged argument that, on the one hand, the jury should not believe Sutton, when he stated he did not know Tony's last name, and on the other, that Sutton was a bad man indeed for dealing in cash with Tony and Lauracella for the rates of interest charged. Moreover, the $80,000 to 803 Maintenance was explained as repayment of the loan. The defendants' accountants apparently never were able to discredit this; and again defendants did not seek a continuance to check this out further. They did not seek access to 803 Maintenance's records. Counsel on summation argued: It's a cash deal. First he has a sister and brother-in-law running around cashing checks for him to raise the cash but that proves not to be enough. What to do now. What to do now, Mr. Sutton. Does this fine upstanding man, this businessman, this responsible pillar of the community go to his friendly neighborhood bank and borrow the amount he needs? I suppose you could answer that question yes, even though the bank is a little different than the ones we are used to dealing with and the interest is a little higher. He goes to the bank of Mr. Tony. Now, Mr. Tony is a man whose last name he didn't know. Mr. Tony was a tenant in his building for two years but he didn't know his last name. A man who gave Mr. Sutton sixty thousand dollars in cash. When asked why? Because they are friends. Well, maybe. But, of course, let's not forget that Mr. Tony was going to get back eighty thousand dollars for sixty. Not a bad deal for Mr. Tony, and one that Mr. Sutton knew that he could get. But wait, there is still more cash needed. Now Mr. Sutton goes out and gets an additional forty thousand dollars from Cass Electric paying a bonus this time of somewhat a lesser percentage. This time it is only a ten per cent bonus of four thousand dollars. Again there is no witness. There are no notes, no nothing . . . . Tr. 3670.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e106. It should be noted I am not denouncing trial counsels' handling of the matter. I am simply saying that present counsel (one of whom, at trial, knew Tony C's last name and first name and that he had a \"rap sheet\") cannot now take a course totally inconsistent with what was so clearly a well-considered trial decision by outstanding trial lawyers.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e107. This is the only specific question as to which defendants now claim Sutton lied.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e108. See Tr. 2080, 2083 and 2868.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e109. See Tr. C-1. Thus there was no suppression. United States v. Ruggiero, supra, 472 F.2d at 604. See also, United States v. Agurs, supra, 427 U.S. at 106, 96 S. Ct. at 2399, quoted at 1081, supra. Here the United States did what the Court in Agurs suggested, by \"submitting the problem to the trial judge.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e110. No defense counsel objected; and in C-1 this is what the United States Attorney did. Defendants cannot now contend that they did not know the United States intended to advise me what \"certain investigators for the defendants\" had done in their \"interviews.\" See 1121-1122, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e111. By the time I announced this ruling, I had had the opportunity to acquire all of the information referred to in 1059-1067, supra. It was counsel's suggestion, without dissent from other defendants, that I evaluate the alleged Brady material in camera. Mr. Ritger: I can't see any reason why the government should stand on that position unless for some strong reason they are trying to protect the identity of this individual. If they are, let them tell the Court. I will certainly stand back and say to the Court that you are capable to make the decision that we should or should not have it. At another point I stated I would review the alleged material in camera (Tr. 2087); there was no dissent. Cf. Tr. 2257. Indeed, I had with counsel's knowledge also reviewed in camera other material defendants alleged to be Brady information. See, e.g., Cutrupi grand jury testimony. Tr. 2267. See also Mr. Ritger's letter of May 12, 1977.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e112. See 1081, n. 36, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e113. See also the statement by the United States Attorney at C-1 at 8: \". . . if this individual was subpoenaed . . . there is a distinct possibility that there may be some harm brought to the person of Arthur Sutton. \"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e114. I have been given no reason by any defendant as to why trial counsel decided to pursue the course of not cross-examining Sutton with Tony C's full name and not bringing Carminati in to testify.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e115. The defendants' presentation is weakened by their having submitted on the Carminati issue only the affidavits of Messrs. Shargel and Dershowitz. There is no affidavit from either Carminati or his attorney with whom at least some of the defendants have had contact. See 114, n. 116, infra. Missing too are the affidavits of the various county and state officers who had and have first-hand knowledge of events. It was left to the United States to get their affidavits even though the significant April 18, 1977 meeting with various state officials was inspired by the defendants. A reading of these affidavits makes it clear why defendants elected not to submit them.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e116. The United States challenged the authenticity of the Shargel statements as to what a log entry reported a taped conversation contained. Mr. Shargel initially advised this court he would disclose to me how he had obtained this information. He withdrew this offer by letter when he was subpoenaed to go before a state grand jury. Later, on May 9, 1977, he stated on the record that Carminati's attorney had given him access to tapes and logs.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e117. Thus the report, annexed to the Shargel affidavit as Exhibit A, and which lacks both an addressee and the name of the writer, states: \"Miceli indicated that the money lent to Sutton by Carminati was in effect shylocking. Miceli did not use the word shylocking but rather shying (that's s-h-y-i-n-g) and described it as being such at 33 1/3 a year making it somewhere in the neighborhood of 67% interest.\" This version of the Sutton-Carminati transaction conforms to Sutton's testimony. The claim made by Orenstein's attorney at the February 14, 1977 hearing (Tr. 44), that the Shargel affidavit shows Sutton lied, is thus eroded.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e118. The fact that I find it necessary to point out such serious shortcomings in the affidavit of an attorney, who is also attorney of record, demonstrates that matters such as Mr. Shargel purports to have investigated should have been left to the investigator the IFC defendants have been using on this application. See Hearing of May 6, 1977.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e119. The other IFC defendant's counsel, Mr. Levin, did not fall into the error Messrs. Shargel and Dershowitz did in picking up this statement and thereafter charging Sutton with perjury based upon someone's log entry digesting what Carminati is alleged to have said. He was at the trial and knew Sutton had not testified he did not know Tony C.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e120. To the extent this discussion related to Sutton's testimony about knowing and referring to Carminati as \"Tony C,\" I have covered the matter.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e121. See 1104, n. 96, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e122. As the United States points out once again, counsel rejected the offered continuance; and as to the 803 Maintenance records subpoenaed, the government was prepared to go forward to produce post-May 31, 1974 evidence, which, it states, would have shown that 803 had received the checks from Sutton and would have corroborated that testimony. See Hearing of February 14, 1977, Tr. 79.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e123. They refer to Carminati as a reputed organized crime figure, yet at the same time would pit his credibility as to his statement denying a criminal act against Sutton, who testified in court under oath. In this regard, defendants represented on February 14, 1977 (though not through affidavit) that their \"initial leads\" to the Carminati material were supplied by material obtained from Silver. Tr. 100. Although I have not advised counsel that I was going to take judicial notice of the fact, cf. Federal Rule of Evidence 201, the Carminati arrest was \"big news\" in the New Jersey area in 1975. See also, Ritger letter of May 12, 1977. If counsel is suggesting that somehow Silver's reference to Schell led to Carminati, I point out first nothing was contained in the lengthy and detailed affidavits on this. Moreover, in this regard counsel are referred to the Wollen notes, Ct. Ex. 2, et seq., and to the fact that Schell's name is prominently mentioned in the Sutton diaries and telephone records.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e124. I specifically reject, as unsupported allegations of counsel, that Sutton lied when he described his relationship with Carminati (para. 13); that during trial Carminati was the subject of a federal investigation (para. 14); that the United States had full knowledge of the wiretaps and the information therein (as distinct from the F.B.I. being told Carminati was a subject of a State investigation) (para. 14); and that the United States knew of Carminati's alleged \"intricate involvement\" with Sutton (para. 14). These latter findings as to para. 14 of the Shargel affidavit of January 13, 1977 are of particular significance. This is because on oral argument on February 14, 1977 Mr. Shargel stated the issue thus: \"The question that is raised by this wiretapping is was the relationship . .. between Sutton and Carminati more intricate?\" Tr. 81, et seq. I also specifically reject movants' contention that I must accept as true everything counsel include in their affidavits, without analysis, and even though what is stated is beyond belief. For example, the Dershowitz affidavit of January 14, 1977 states that defendants were able to corroborate various allegations made by Silver in his letter of January 24, 1975 to the United States. The fact is that only one element is corroborated, that relating to Comras. Am I to accept as true that other things, not revealed by Mr. Dershowitz, were also corroborated? I decline to do so, particularly since repeated questioning by me at oral argument for more particulars has produced nothing other than the reluctantly surrendered Wollen notes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e125. I have read the affidavits of Messrs. Shargel and Dershowitz; United States Attorney Goldstein; Prosecutor Woodcock and his two assistants; Mr. Del Tufo; F.B.I. Agents La Prade, Connors, and Pirog; Sgt. Polizzo; and Agent Ferry of the Drug Enforcement Administration. The above-mentioned exception relates to what was given to Mr. Ferry and was made available, as Ct. Ex. 2, on May 6, 1977 to defendants' counsel. I shall deal with this matter shortly. The Del Tufo affidavit is significant. After defendants had been granted extensions of time for further submissions, counsel met with Mr. Del Tufo. Mr. Del Tufo's affidavit describes that meeting. There is nothing in the affidavits of the state officials which does anything but support United States Attorney Goldstein's averment in his affidavit (Exhibit H) that at no time prior to or during trial was he aware of any investigation by the Bergen County Prosecutor's Office involving Anthony Carminati (para. 5); and that his office in that period of time had not had access to any information from any electronic surveillance conducted by the Bergen County Prosecutor (para. 6). Nothing but argument of counsel has been offered to controvert this.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e126. For purposes of this specific point, and the assumption made, I will assume arguendo that the undisclosed material either related to the first or second Agurs \"situation.\" See 1078-1083, supra ; and the same is true with respect to that which follows where again an assumption is made that Brady material was withheld by the United States Attorney. This assumption also puts aside the fact that I have earlier determined that defendants lost any Brady rights they had by their inaction; and that, moreover, there was no \"suppression\" by the United States in view of the in camera hearing held by me.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e127. My review of the evidence as to Diaco, Valentine and their company is set out at 1064-1067, and as to the IFC defendants at 1067-1078, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e128. As was said in United States v. Quinn, supra, 445 F.2d at 944, where defendants urged that the United States Attorney is held to have constructive knowledge of a sealed indictment returned in another district, during trial in New York, against a government witness there: [Appellants] take the completely untenable position that \"knowledge of any part of the government is equivalent to knowledge on the part of this prosecutor\" and that \"he [the New York prosecutor] must be deemed to have had constructive knowledge of this evidence\" (Applts' Quinn and Seiden Br., pp. 8, 9). The Department of Justice alone has thousands of employees in the fifty States of the Union. Add to these many more thousands of employees of \"any part of the government.\" Appellants' argument can be disposed of on a \"reductio ad absurdum\" basis. Moreover, the chronology of events refutes any knowledge of, or suppression by, the New York prosecutor of the Florida indictment; June 23 New York prosecutor's statement during trial; June 25 sealed indictment against Garrison returned in Florida; July 13 indictment unsealed in Florida; July 15 news disclosure in New York. The \"suppression of evidence\" cases cited by appellants deal with facts known to the prosecution -- not to facts concededly unknown. (footnote omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e129. To aid on appellate review, I have cited generously to the record, to both transcript references and exhibits.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e130. A new judge would have had to familiarize himself with several months of pretrial proceedings, consisting of hundreds if not thousands of pages of transcript, approximately 4,000 pages of trial transcript, and numerous exhibits.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e131. The documents are police reports which I am releasing to counsel. They are confirmatory of Mayor Ross' testimony as to his meeting with Diaco at the Fort Lee Municipal Building on May 22, 1975.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e132. See Mr. Dershowitz' affidavit of February 21, 1977, para. 12.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e133. Conviction was on December 5, 1972; yet serving of sentence had not yet commenced, four years later. Interestingly, the district judge who presided at trial resigned from the bench and represented Dansker at trial before me. Counsel for Rosner is counsel here for Haymes. See also United States v. Albanese, 554 F.2d 543, 549 (2d Cir. 1977), where, in an unusual fact setting, Dansker's present counsel represented the defendant.\u003c/span\u003e\n\n",
    "body_length": 284141,
    "citedas": [
      "449 F. Supp. 1057"
    ],
    "attorneys": "Richard D. Shapiro, Asst. U.S. Atty., Newark, New Jersey, for plaintiff. , Fischetti \u0026 Shargel by Gerald L. Shargel, New York, New York, Alan M. Dershowitz, Cambridge, Massachusetts, Amster \u0026 Levin by Richard A. Levin, Millburn, N.J., Frederic C. Ritger, Jr., South Orange, New Jersey, for defendants. Lacey, District Judge.",
    "category": [
      "243",
      "36",
      "75"
    ],
    "judges": "LACEY, District Judge.",
    "citation_count": 0
  }
}
