{
  "id": "t4C6PWYBTlTomsSBuKor",
  "document": {
    "title": "De Falco v. Bernas",
    "full_title": "JOSEPH DE FALCO, ELEANOR DE FALCO, ROBERT BROWN, JANICE BROWN, TOP OF THE WORLD ESTATES, INC. AND JOBO ASSOCIATES, INC. -CROSS-APPELLANTS, v. JOHN BERNAS, JOHN BERNAS, INC., AND JML QUARRIES, INC., WILLIAM DIRIE -CROSS-DEFENDANTS-APPELLANTS-CROSS-APPELLEES, PAUL ROUIS, V. EDWARD CURTIS, ALFRED STEPPICH, RICHARD FERBER, AND WILLIAM ROSEN -CROSS-DEFENDANTS-CROSS-APPELLEES, GEORGE LAHM -CROSS-APPELLEE, TERRY KELLY -CROSS-DEFENDANT-CROSS-CLAIMANT-CROSS-APPELLEE, HARRY FISHER, WILLIAM DIEHL AND ROBERT ROSEN -CROSS-DEFENDANTS.",
    "jurisdiction": "Second Circuit",
    "date": "2001-03-16T00:00:00.000Z",
    "docket": "Docket No. 99-7648 (L),, Docket No. 99-7696 (XAP),, Docket No. 99-7694 (CON)",
    "body": "Argued: January 5, 2000\n\nAppeal and cross-appeal from a judgment entered by the United States District Court for the Southern District of New York.\n\nAffirmed in part, reversed in part.\n\nPlaintiffs brought this action under 18 U.S.C. § 1962(c), a provision of the Racketeer Influenced and Corrupt Organizations Act (\"RICO\"), 18 U.S.C. §§ 1961-68, claiming that their efforts to develop real estate in Sullivan County, New York, were illegally impeded as a result of the defendants' operation of the Town of Delaware, New York as a RICO enterprise. Plaintiffs claimed that the action arose out of a conspiracy, plan and scheme among the defendants - an assortment of public officials, private individuals and corporations - to use the Town of Delaware as a racketeering enterprise to extort money, real property and personal property through misuse of certain public offices, in violation of section 1962(c).\n\nAfter pretrial proceedings eliminated a number of defendants, the plaintiffs' claims against eleven remaining defendants were first tried to a jury between December 10 and December 20, 1996, with United States District Judge Barrington D. Parker presiding. The trial resulted in jury verdicts against six defendants. The Court granted motions for judgment as a matter of law in favor of two defendants and, with respect to the remaining four defendants, the Court held that the proof of damages adduced at trial was too speculative and imprecise to support the damages awarded by the jury. Accordingly, Judge Parker granted a new trial on both liability and damages.\n\nThe case was then retried against the remaining defendants from February 1 to February 9, 1999, with United States District Judge Charles L. Brieant presiding. The second trial again resulted in jury verdicts against the four defendants. Although the Court sustained certain damage awards, Judge Brieant vacated a special verdict of $1.6 million (before trebling) as having \"no relation to reality.\"\n\nThis appeal and cross-appeal followed. The defendants appealed, contending that the plaintiffs' evidence at the second trial was insufficient as to both liability and damages. The plaintiffs' cross- appeal challenges the Court's vacatur of the jury's verdicts at the first trial and, alternatively, the Court's vacatur of the $1.6 million award at the second trial. For the reasons discussed below, we vacate a $1,000.00 award against the defendant Dirie, but affirm the judgments of the District Court in all other respects.\n\nI. THE PARTIES\n\nA. The Plaintiffs\n\nPlaintiff Top of the World Estates, Inc. (\"TOP\") is the owner and developer of approximately 1,450 acres of land in the Town of Delaware in Sullivan County, New York. Located on this property is a residential development known as \"Top of the World Estates.\"\n\nPlaintiff JOBO Associates, Inc. (\"JOBO\") owns approximately 250 acres adjoining the TOP property. The JOBO property contains deposits of sand and gravel.\n\nThe individual plaintiffs, Joseph DeFalco, Eleanor DeFalco, Robert Brown and Janice Brown are the principal officers, directors and shareholders of both TOP and JOBO.\n\nB. The Defendants\n\nThe defendants are an assortment of public officials, private individuals and corporations from Sullivan County, New York:\n\nDefendant William Dirie was the elected Supervisor of the Town of Delaware from January 1986 to December 1991. In that position, Dirie served as a member of the Town Board and as a member of the Town Legislature;\n\nDefendant John Bernas is a local contractor and owner of both Defendant JML Quarries, Inc. and Defendant John Bernas, Inc.;\n\nDefendant V. Edward Curtis was the appointed Chairman of the Delaware Planning Board from 1964 to December 1994. At all relevant times, he was also engaged in the nursery and landscaping business;\n\nDefendant Alfred Steppich was the appointed Building Inspector of the Town of Delaware from 1986 to 1991;\n\nDefendant Richard Ferber was an elected Tax Assessor for the Town of Delaware from 1976 to 1994 and was Chairman of the Delaware Tax Assessors from 1990 to 1994;\n\nDefendant Donald Meckle was an elected Tax Assessor for the Town of Delaware from 1978 to 1993 and was Chairman of the Delaware Tax Assessors from 1979 to 1990;\n\nDefendant Paul Rouis was the appointed Sullivan County Administrator from 1977 to June 1993;\n\nDefendant Terry Kelly was at all relevant times chief engineer of the Town of Delaware;\n\nDefendant William Rosen was the appointed Town Attorney for the Town of Delaware from 1986 to December 1991. He was also Sullivan County Attorney from 1988 to 1991;\n\nDefendant George Lahm was at all relevant times the Highway Superintendent for the Town of Delaware; and\n\nDefendant Harry Fisher was at all relevant times an overseer of the plaintiffs' business operations as well as a personal acquaintance of William Dirie.\n\nII. BACKGROUND\n\nA. Factual Background\n\nReading the evidence from the second trial in the light most favorable to the plaintiffs, a reasonable jury could have found the following facts.\n\nIn May 1987, Joseph DeFalco (\"DeFalco\"), a butcher and professional hunter from Long Island, New York, decided to purchase approximately 1,700 acres of land from the Tamarack Hunting Club. The property straddled the Town of Delaware and the Town of Cochecton, in Sullivan County, New York. DeFalco and his partner, Robert Brown, and their wives, formed two corporations, Top of the World Estates, Inc. (\"TOP\") and JOBO Associates, Inc. (\"JOBO\"). TOP acquired title to the portion of the property in the Town of Delaware and JOBO acquired title to the smaller portion located in the Town of Cochecton. Although DeFalco initially intended to use the Tamarack property for hunting, he subsequently decided to develop a small part of it as a residential real estate development known as \"Top of the World Estates.\"\n\nBefore the closing of the land purchase, DeFalco was approached by local resident Harry Fisher (\"Fisher\"), who told DeFalco that there were potentially valuable gravel deposits on the JOBO parcel. Shortly thereafter, Fisher paid another visit to DeFalco, this time with William Dirie (\"Dirie\"), Supervisor of the Town of Delaware and a local firewood salesman. Dirie introduced himself and informed DeFalco that Delaware, New York \"is not Long Island,\" and that \"[a]round here in Sullivan County, you got to deal with the local people.\" (T2:71). \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Dirie advised DeFalco that he would help guide DeFalco \"through the muddy waters\" of real estate development in the Town of Delaware, so long as DeFalco followed Dirie's suggestions. (T2:70).\n\nDirie made some suggestions to DeFalco at this initial meeting. First, Dirie informed DeFalco that Fisher was about to retire and he recommended that DeFalco hire Fisher as a foreman for the real estate development project at $300 per week. It was imperative, however, that Fisher not show the $300 per week as income, so Dirie suggested that DeFalco pay Fisher by purchasing him a new truck in Fisher's son's name and making the loan payments on the truck purchase. Second, Dirie recommended that DeFalco buy shrubs and other landscaping items from V. Edward Curtis (\"Curtis\"), a local nursery owner and Chairman of the Delaware Planning Board. Dirie also suggested that DeFalco, an avid hunter with a televised hunting program, support Tax Assessor Donald Meckle (\"Meckle\") by purchasing equipment at Meckle's sporting goods store. Finally, Dirie suggested that DeFalco use local resident John Bernas (\"Bernas\") to do the road construction at the development and mine the gravel from the JOBO gravel pit.\n\nDeFalco complied with Dirie's initial suggestions. DeFalco agreed to hire Fisher as a foreman for the real estate development project, purchased Fisher a new truck in his son's name, and made loan payments on the truck. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e DeFalco also purchased equipment at Meckle's sporting goods store and hired Bernas to construct the roads at the development.\n\nDeFalco also visited nursery owner and Planning Board Chairman Curtis. Curtis indicated that \"things [would] go a lot easier\" if DeFalco were to use a particular landscaping contractor, Ed Matern, who would purchase plants and shrubs from Curtis' nursery. (T2:74). Later, Curtis also suggested that DeFalco hire a particular contractor, Jim Glavin, to design the entrance to the development, indicating that DeFalco should \"do it the right way and bring in Galvin [sic]. And if you use these people, everything is going to go smoother.\" (T2:82). \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nPlaintiffs intended the TOP development to proceed in four phases. Before Phase I commenced, in August 1987, DeFalco and Bernas met to discuss road construction for the development. Although no written contract was executed, DeFalco and Bernas agreed that Bernas' company John Bernas, Inc. (\"JBI\") would construct roads at TOP in exchange for the cost of labor plus a one-third stock interest in JOBO. Bernas was to extract gravel from the JOBO site to use in building the roads at TOP and was additionally entitled to sell any excess sand and gravel removed from JOBO, with any profits from such sales split 50-50 between Bernas and the plaintiffs.\n\nAs the project progressed, the defendants made additional demands on DeFalco coupled with a threat of adverse official action on the project. For example, Dirie suggested that DeFalco let Dirie's son cut timber on the property. When DeFalco resisted and indicated that he intended to bring in a logger to cut timber for himself, Dirie responded, \"If you want to go by the Planning Board and you want things to go smooth, you know, this is the way it is in Sullivan County. That's it.\" (T2:97).\n\nDeFalco also complied with the defendants' suggestions to hire particular individuals. At an October 2, 1987 meeting between DeFalco, Brown, Bernas and Sullivan County Administrator, Paul Rouis (\"Rouis\"), Rouis pulled DeFalco aside and insisted that he be the accountant for the development project and that DeFalco hire a local attorney named Robert Rosen. (T2:113-14). Rouis further indicated that he would be making Robert Rosen's brother and Delaware Town Attorney, William Rosen, the Sullivan County Attorney in January 1988. (T2:114). When DeFalco indicated that he planned to use his son as the accountant for the project and planned to use his son-in-law as the attorney, Rouis stated that \"You're in Sullivan County now. And if you want this development to go, you can't bring up New Yorkers.\" (T2:113-14). DeFalco hired Rouis and Robert Rosen even though he did not want to use them. (T2:114); see also Letter from Joe DeFalco to Robert Rosen dated Oct. 5, 1987 (E:141-42) (\"I would like to talk to you about representing TOP OF THE WORLD ESTATES in all transactions that are going to occur in Sullivan County . . . . I would like you to know that you were highly recommended by Mr. Paul Rouis.\").\n\nEach time a demand was made and DeFalco resisted, the defendants used their political power to impede the development or otherwise harm the plaintiffs. Conversely, each time DeFalco complied with a demand, he was \"rewarded\" by having the development project proceed.\n\nFor example, following the defendants' suggestions, DeFalco permitted Dirie, Fisher and others to cut timber and firewood on TOP property. In order to avoid any questions, Dirie insisted that DeFalco run an ad in certain newspapers that DeFalco was offering free firewood. One such advertisement ran June 11, 1988 in the New York Times. (T2:136); see also Pl.'s Ex. 34 (E:158) (New York Times, \"Free Oak Firewood\" advertisement dated June 11, 1988). The defendants, however, wanted their logging activities to remain exclusive. When DeFalco granted a logging contract for a certain section of the property to the Walczak Lumber Company for a price of $8800, see (E:129-30), Dirie insisted that DeFalco cancel the contract and return the check. When DeFalco protested, Dirie told him \"Don't expect to get your approvals at the Planning Board meeting unless it's done.\" (T2:126). At the next Planning Board meeting, the plaintiffs' project was suspended for thirty days. (T2:127); see also Pl.'s Ex. 24, Oct. 21, 1987 Planning Board Minutes (E:133-34). The following day, Dirie visited DeFalco at the development and asked whether he \"got the message.\" (T2:127). DeFalco returned the check and paid a penalty for canceling the contract. (T2:128). DeFalco was further instructed by Tax Assessor Richard Ferber to use his cousin, Ray Ferber, for the logging contract; \"[o]therwise [he was] never going to get approvals.\" (T2:128). At the next Planning Board meeting on November 18, 1987, the project was once again allowed to move forward. (T2:130); see also Pl.'s Ex. 26, Nov. 18, 1987 Planning Board Minutes (E:135-37).\n\nSimilarly, when DeFalco attempted to fire Fisher and his crew, Rosen warned him against \"rocking the cradle,\" Dirie told him that he would \"scrap the project,\" and Rouis stated that DeFalco was \"going to have major problems.\" (T2:132).\n\nFormer Town of Delaware Building Inspector Alfred Steppich (\"Steppich\") also testified that both Supervisor Dirie and Planning Board Chairman Curtis instructed him at one point to stop issuing building permits for Top of the World. (T2:335). Notwithstanding that neither Dirie nor Curtis was authorized to tell Steppich to stop issuing building permits, Steppich wrote in his personal log: \"Called Kathy at Top of the World. Told her no more building permits to be issued until I got an okay from Bill Dirie and Ed Curtis.\" (T2:338-39). \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nAs the project progressed, DeFalco complied with other demands made by the defendants. For example, DeFalco gave a set of used truck wheels and tires to Dirie's son, as demanded by Dirie (T2:152-53). During the course of Bernas' work on the roads, the Town of Delaware removed gravel from the plaintiffs' gravel pit free of charge. (T2:162-63). When DeFalco questioned Bernas' giving free sand and gravel to the Town of Delaware, DeFalco suddenly faced problems with a previously agreed deal regarding plowing and maintenance of the development roads by the Town as well as threats that the Phase I roads either would not be accepted for dedication by the Town or that the dedication process would be delayed. (T2:165-66); see also (E:287-88). \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nIn mid-1989, before Phase I was complete, DeFalco approached Bernas about beginning work on the roads for Phase II. Both Bernas and DeFalco, however, wanted to address certain outstanding issues. DeFalco wanted Bernas to give him a detailed breakdown of what materials he had removed, sold or given away from the gravel pit. Bernas wanted resolution of the then outstanding issue of when he would receive the one-third equity interest in JOBO.\n\nOver the course of the project, Bernas had been extracting gravel from the JOBO site. Pursuant to the agreement with plaintiffs, Bernas was to provide plaintiffs with accountings of the gravel and other materials removed from the pit. After repeated requests from DeFalco and Brown, \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Bernas rendered the accountings of materials sold from the JOBO site. See (E:163-71). DeFalco became skeptical of the accuracy of the accountings and insisted that Bernas both refrain from giving away any materials free-of-charge and that he share the profits of any sales with the plaintiffs. Whenever DeFalco broached the topic with Bernas, however, Bernas threatened to get the Town to either stop the project or refuse dedication of the development's roads.\n\nUnder DeFalco's agreement with Bernas, DeFalco was not required to turn over the one-third interest in JOBO stock until Bernas had completed twelve miles of roads. (T2:177). By mid-1989, however, DeFalco faced mounting pressure from several defendants with respect to transferring the JOBO stock to Bernas. For example, when issues arose over the transfer of the JOBO stock, Rouis, as the development's accountant, entered on the project's financial statements a false entry showing $275,000 payable to Bernas. (T2:179- 81). This fraudulent entry purportedly reflected monies owing to Bernas for services in connection with road work on Phase I. Rouis threatened to cause a tax audit of the project unless DeFalco conveyed the JOBO shares to Bernas. When DeFalco pressed his concerns over the gravel pit accounting, Rouis told him to \"back off, and that he was going to get involved, and that (DeFalco) should sign . . . a third of the gravel pit over now.\" (T2:175). DeFalco testified that \"Rouis told me straight up and down, like if I don't sign the stock over, `you ain't seen nothing yet.'\" (T2:181-82). With respect to the financial statement, DeFalco testified that Rouis \"was going to take care of it when the stock was signed over.\" (T2:182).\n\nSimilarly, Dirie threatened adverse official action if DeFalco failed to give Bernas the stock. (T2:178). DeFalco testified that \"Dirie told me straight up and down, `you can kiss Phase 2 good-bye, the development good-bye.'\" (T2:178). The sudden issues regarding plowing and maintenance of the development's roads and whether the roads would be accepted for dedication by the Town were also tied to transfer of the JOBO stock. According to DeFalco, with Dirie, \"it was always the same story. `If you sign over the stock, the problems go away.'\" (T2:197). Delaware Town Engineer Terry Kelly, Tax Assessor Ferber, Tax Assessor Meckle and Building Inspector Steppich each pressured DeFalco to turn the stock over to Bernas. (T2:183).\n\nOn several occasions, Dirie and Bernas indicated that, if DeFalco didn't sign over the stock, the project would be scrapped. (T2:202). DeFalco testified: \"I didn't have a choice. I wanted to get this matter over with.\" (T2:201). DeFalco ultimately transferred the one-third interest in the JOBO stock to JBI on December 6, 1989. See Pl.'s Ex. 60, Stock Transfer Agreement dated Dec. 6, 1989 (E:181); Pl.'s Ex. B31, JOBO Stock Certificate for John Bernas, Inc. (E:361). The Phase I roads were thereafter accepted for dedication by the Town. (T2:206); see also Letter from Robert M. Rosen to William Dirie dated Dec. 7, 1989 (E:179).\n\nAfter DeFalco signed over the one-third interest in JOBO to Bernas, however, Bernas wanted rights to the entire gravel pit, and suddenly the dedication of the Phase I roads was again called into question. (T2:206). At the same time, DeFalco remained concerned with the accountings Bernas had prepared for the gravel pit and instructed Bernas not to mine the JOBO site after December 15, 1989. (T2:208). \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e In March 1990, on DeFalco's return from a seasonal trip to Florida, however, he found Bernas' people working to remove material from the JOBO site. (T2:207). DeFalco again directed Bernas to stop work at JOBO and erected physical barriers there. (T2:208-12); see also \"Cease and Desist Order\" Letter from Joe DeFalco to John Bernas, Inc. and JML Quarries dated Mar. 2, 1990 (E:182). On March 15, 1990, DeFalco wrote to Bernas: \"I feel that I am always being harassed over this gravel pit. I have no intentions of backing down anymore.\" (T2:212); see also Letter from Joe DeFalco to John Bernas, Inc. and JML Quarries dated Mar. 5, 1990 (E:183-84).\n\nDeFalco faced mounting pressure from several of the defendants to give Bernas the entire gravel pit. For example, Bernas told DeFalco that, if DeFalco did not turn over the gravel pit, \"(t)hey were going to close the development down.\" (T2:214). When DeFalco resisted giving Bernas the entire gravel pit, Tax Assessors Ferber and Meckle reassessed certain lots from $20,000 to $45,000 a piece, more than doubling plaintiffs' taxes. (T2:253). \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nOn or about April 2, 1990, the Town of Delaware Planning Board issued a letter listing certain requirements to be completed before final approval would be granted for Phase II. The Planning Board required: (1) a letter from Town Engineer Kelly stating that the roads satisfied certain town requirements; and (2) a letter from the Supervisor of the Town stating that the Town Board was satisfied that the Top of the World Estates had met certain guaranty requirements by posting a surety bond acceptable to the Town Board, as directed by the Town Attorney. (T2:223); see also Town of Delaware Planning Board Letter from V. Edward Curtis to Robert M. Rosen dated Apr. 2, 1990 (E:188; E:317). Only when those requirements were met would the Planning Board \"give final approval to Phase 2 of the Top of the World Estates.\" (T2:223); see also (E:188; E:317). When DeFalco subsequently spoke with Dirie about the letter and asked Dirie how he could get Phase II approved, Dirie replied, \"Give Bernas the gravel pit.\" (T2:225).\n\nDeFalco never completed Phase II nor sought any approvals from the Town in the years preceding trial. Although he had received conditional final approval for Phase II from the Town Planning Board and was invited to retain another road contractor or, alternatively, to put up a completion bond of $200,000 from a creditworthy bonding company and commence marketing lots in Phase II prior to completion of the roads, DeFalco claimed that he could not get final Town approval of Phase II because he refused to comply with the new demand by Bernas to give him all of the JOBO property.\n\nB. Procedural History\n\nThe initial complaint in this action was filed on September 6, 1990. (JA:9). Pretrial proceedings eliminated a number of defendants, one of whom is pertinent to this appeal.\n\nOn October 17, 1996, the District Court dismissed the claim against William Rosen as articulated in the plaintiffs' second amended complaint. The Court concluded that, based on the Supreme Court's decision in Central Bank of Denver v. First Interstate Bank, 511 U.S. 164 (1994), RICO does not provide for aider and abettor liability. Because the plaintiffs' second amended complaint accused Rosen of aiding and abetting liability, the Court dismissed the case against Rosen for failure to state a claim.\n\n1. The First Trial\n\nPlaintiffs' claims against the eleven remaining defendants were tried before Judge Barrington D. Parker and to a jury between December 10 and December 20, 1996. The jury found that the Town of Delaware had been operated as a RICO enterprise and that six of the defendants had conducted or participated in the affairs of the Town through a pattern of racketeering activity. The jury returned verdicts in favor of the other five defendants. The jury found that each of the six liable defendants committed two or more predicate acts and assessed monetary damages (prior to trebling) as follows:\n\nWilliam Dirie $250,000\n\nJohn Bernas $500,000\n\nJML Quarries, Inc. $500,000\n\nV. Edward Curtis $250,000\n\nPaul Rouis $1,000,000\n\nJohn Bernas, Inc. $0\n\nEach of these defendants filed motions for judgment as a matter of law and for a new trial pursuant to Rules 50(b) and 59 of the Federal Rules of Civil Procedure.\n\nWith respect to Rouis and Curtis, the District Court held that there was insufficient evidence for the trier of fact to have concluded that the predicate acts found to have been committed by them were the proximate cause of harm to plaintiffs' business or property and, accordingly, their motions for judgment as a matter of law pursuant to Rule 50(b) were granted. With respect to the remaining four defendants, however, the Court concluded that the proof of damages adduced at trial was too speculative and imprecise to support the damages awarded by the jury and, because the issues of damages and liability were inextricably intertwined, Dirie, Bernas, JML and JBI were entitled to a new trial on both liability and damages. See DeFalco v. Dirie, 978 F. Supp. 491, 500 (S.D.N.Y. 1997) (Plaintiffs' \"wide ranging and vague theories of RICO injury created a substantial likelihood that the jury's award was based on something other than adequate proof.\").\n\n2. Unconsummated Sales Opportunities and the October 15, 1998 Order\n\nThe evidence presented at the first trial included DeFalco's unsuccessful attempts to sell certain portions of the project to two entities known as Tri-Sec and Valente in 1989. Plaintiffs' theory that the defendants were responsible for frustrating the Tri-Sec and Valente deals was set forth in their post-trial brief:\n\nThe evidence established that [DeFalco] at one point, received an offer to sell [the] property (including the JOBO gravel pit) to an entity called Tri-Sec for an aggregate purchase price of $8.3 million [Tr.12/11, p. 342-343; Tr.12/12, p. 485]. The gravel pit itself was to be sold for $2,000,000.00 [Ex. C \u0026 D-51; Ex. B-25]. Rouis, however, upon learning of that, threatened to have the Town of Delaware take detrimental action regarding road dedications at [DeFalco's] development if DeFalco went ahead with his plans to sell the gravel pit to Tri-Sec\n\nThus, Rouis' extortionate infusion [sic] as accountant for [DeFalco's] development project resulted in his ability to (1) know of the prospective sale to Tri- Sec; and (2) threaten the further misuse of his public office and control of the enterprise to cause the sale not to take place [Tr.12/11, p. 350]. The result was that Rouis \"killed\" the deal [Tr.12/12, p. 485]. Clearly, the fact that [DeFalco] would lose the profits from that transaction were foreseeable when Rouis acted in the manner that he did. Rouis' actions just in this regard were sufficient to support the jury's damage award against him.\n\nThe evidence also established that the defendants (including Rouis) pressured DeFalco into not making another deal to sell a portion of the property [Tr.12/11, p. 352-356]. This deal was with Louie Valente who agreed to purchase the gravel pit and another 800 acres of [DeFalco's] land . . . for a purchase price of $6 million [Tr.12/11, p. 353-354]. Valente and DeFalco entered into a letter agreement for that sale, and Valente tendered a $5,000.00 deposit [Tr.12/11, p. 353]. Again, because of Rouis' predicate acts of compelling [DeFalco] to convey JOBO stock to Bernas, Bernas was placed in a position of being able to take action intended to \"kill\" this deal as well, which Bernas intentionally did [Tr.12/11, p. 355]. Again, the damages flowing from that (i.e., the loss to [DeFalco] of the profit that [he] would have made from this deal) was clearly foreseeable. (sic) (Plaintiffs' Memorandum of Law in Opposition to Post-Trial Motion by Defendant Paul Rouis, ¶. 22-24.) DeFalco v. Dirie, 978 F. Supp. 491, 498 (S.D.N.Y. 1997).\n\nIn ruling on certain post-trial motions, however, the Court held that this theory was analytically inadequate because \"neither the retention of Rouis as the Project's accountant nor the transfer of one-third of the shares of JOBO to Bernas could be reasonably concluded to have been the proximate cause of any lost profits from unconsummated sales opportunities. There was no \"direct relationship between the plaintiffs' injury and the defendants' injurious conduct.\" DeFalco, 978 F. Supp. at 498. The Court stated that:\n\nCommon experience teaches that real estate developments are inherently speculative and that myriad factors - foreseen and unforeseen - can frustrate their completion. DeFalco's proof at trial of the two inchoate land deals was insufficient. There was no testimony to indicate that either of the deals had progressed to the point where any enforceable obligations had been created. No written agreement between DeFalco and Valente was produced at trial. A two page agreement with Tri-Sec was introduced but it was no more than a preliminary document.\n\nIt contained none of the provisions customarily found in a formal commitment to convey land, much less the sorts of provisions essential to a large, complex real estate transaction of the sort DeFalco claims was contemplated. Moreover, the trial testimony conclusively showed that the purported Tri-Sec agreement was signed not by the purchaser but by DeFalco's secretary. As a result, the proffered documentation did not satisfy the New York Statute of Frauds. DeFalco, 978 F. Supp. at 499 (citing N.Y. Gen. Oblig. Law § 5-703(2) (McKinney 1989)).\n\nThe Court also noted that \"DeFalco paid approximately $960,000 for the land in 1987 and claims to have lost the opportunity to sell the land for approximately $7,300,000 in 1989. However, at the time of the trial DeFalco still owned the land. Consequently, the critical issue was not simply the purchase price for the land, or the value of the contract said to have been frustrated. DeFalco was also obligated to offer satisfactory evidence of the market value of the land at the time of trial. No such evidence was adduced.\" Id. at 499 n.3. With respect to the unconsummated sales opportunities, the Court concluded that:\n\nThere was no evidence offered at trial to establish adequately the existence of an agreement with respect to either transaction whose consummation DeFalco claims were thwarted. Moreover, there was no adequate proof that the conduct of the defendants actually interfered with either of these purported deals. Assuming, arguendo, that DeFalco had entered into purchase and sale agreements, and that the defendants illegally impeded their completion, DeFalco's evidence of any RICO damages was far too speculative and uncertain. Id. at 499-500.\n\nThe Court therefore concluded that the plaintiffs' evidence of RICO damages alleged to have been incurred as a consequence of DeFalco's inability to consummate the Tri-Sec and Valente real estate transactions was highly speculative and legally insufficient.\n\nWith this problem in mind, on May 1, 1998, the Court directed counsel for the plaintiffs to supply an affidavit informing the Court what evidence of the Tri-Sec and Valente deals would be offered at the second trial that was not offered at the first. The plaintiffs were also instructed \"to append to the affidavit or otherwise clearly identify any documentation that would be offered at trial to establish that the deals existed and that they were frustrated by the conduct of the defendants.\" See Memorandum and Order dated Oct. 15, 1998 (Parker, J.) at 2 (JA:614).\n\nIn response, counsel for the plaintiffs submitted an affirmation regarding damages dated June 25, 1998. (JA:573-82). The affirmation indicated that, at the second trial, the plaintiffs intended to offer essentially the same proof with respect to the Valente and Tri-Sec deals that was offered at the first trial. See Memorandum and Order dated Oct. 15, 1998 at 2 (JA:614).\n\nIn an October 15, 1998 decision, the Court held that:\n\nThis Court has carefully considered the evidence proffered and concludes that it is still too speculative, conjectural and contingent to serve [as] a predicate for the possible imposition of RICO damages. Sedima S.P.R.L. v. Imrex Company, Inc., 473 U.S. 479 (1985); Holmes v. SIPC, 503 U.S. 258 (1992) and Norman v. Niagra Mohawk Power Corp., 873 F.2d 634 (2d Cir. 1989).\n\nAs the first trial of this action demonstrates, in a RICO jury trial, the danger of massive damage awards based on factors other than adequate proof of RICO injury is a source of potentially serious prejudice. Norman at 636. In view of this Court's experience with plaintiff's [sic] proof with respect to the Valente and Tri-Sec deals, this Court would exclude at retrial such evidence pursuant to Rule 403 Fed. R. Evid. since its probative value is substantially outweighed by its prejudicial effects.\n\nIndependent of this conclusion, this Court grants defendants' motion in limine with respect to the Valente and Tri-Sec transactions. For the reasons set forth herein and in this Court's opinion of September 26, 1997, this Court concludes that such evidence should also be excluded as too speculative and conjectural. Id. at 2-3 (JA:614-15).\n\nAccordingly, the plaintiffs' proffered evidence regarding the unconsummated Valente and Tri-Sec deals was ordered excluded at the second trial.\n\n3. The Second Trial\n\nThe remaining issues were thereafter retried against Dirie, Bernas, JBI and JML from February 1 to February 9, 1999 with Judge Charles L. Brieant presiding. The jury at the second trial returned verdicts against all four defendants.\n\nWith respect to Dirie, the jury found that, as RICO predicate acts, Dirie: (1) extorted from the plaintiffs the value of the services of Harry Fisher; (2) extorted timber and firewood from the plaintiffs for his own benefit, and separately for the benefit of Ray Ferber; (3) extorted from the plaintiffs one-third of the shares of JOBO for the benefit of JBI; and (4) extorted from the plaintiffs two truck wheels and tires for the benefit of Dirie's son.\n\nThe jury also found that, by means of the RICO enterprise, John Bernas and JBI extorted from the plaintiffs one-third of the shares of JOBO and a substantial amount of sand and/or gravel from the gravel pit on the JOBO property. As to JML, the jury found that it, too, had extorted sand and/or gravel from the JOBO gravel pit.\n\nThe jury, answering special interrogatories, assessed monetary damages (prior to trebling) as follows. As to Dirie, the jury found damages with respect to the services of Harry Fisher to be $20,251.91. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e The jurors found no damages for the timber or firewood that Dirie obtained; $12,300.00 for the timber extorted for the benefit of Ray Ferber; and $1,000.00 for the truck wheels and tires.\n\nAs to John Bernas, and both of his corporations, JBI and JML, jointly and severally, the jury found they had extorted sand and gravel worth $250,000.00.\n\nThe jury awarded $1.6 million as damages in addition to the damages described in answers to specific interrogatories. Those damages were attributed to the defendants' participation in the conduct of the affairs of the Town of Delaware through a pattern of racketeering activity, and were in addition to the value of one-third of the shares of the stock of JOBO, as to which the Court had reserved decision whether to require specific equitable restitution.\n\nFinally, the jury found that Bernas, JBI and JML obtained $45,000.00 worth of sand and/or gravel by conversion, and that Bernas, JBI and JML extorted from plaintiffs the shares of JOBO by conversion and fraud.\n\nOn motions to set aside all or part of the jury verdict, or, in the alternative, for a new trial, the Court noted that:\n\nFor the second time in this Court a jury has held unanimously that the plaintiffs have proved that the Town of Delaware was conducted as a RICO enterprise which affected interstate commerce, and that all the defendants on trial before it conducted or participated in the conduct of the affairs of the Town through a pattern of racketeering activity, namely William Dirie, John Bernas, John Bernas, Inc. and JML Quarries, Inc., and probably others. See Memorandum and Order dated May 17, 1999 (Brieant, J.) (JA:877).\n\nThe Court added that it had no fault to find with the jury verdict in general. The granting of a new trial should be done sparingly, and a court must respect the findings of a trial jury. This is especially true when a different jury in a prior trial has reached a very similar result. Id. (JA:880).\n\nAlthough the Court noted that the $1,600,000.00 figure \"corresponds very closely to the general damages awarded in the first trial before Judge Parker in the amount of $2,500,000.00, at which the Valente and Trisec evidence had been received,\" id. (JA:879), the Court granted the defendants' motions to the extent of vacating the special verdict award of $1.6 million. The Court explained that:\n\n[W]e are constrained to conclude from the trial record that there is simply insufficient credible evidence of any kind of damages directly flowing from the predicate acts which the jury found, other than as specifically found in the separate interrogatories regarding damages for those predicate acts. Accordingly, the damage award of $1,600,000 . . . simply has no relation to reality.\n\nAs Judge Parker already found, it is far from clear that the cessation of activity at the land development site of Top of the World, Inc., was attributable entirely to the criminality of the defendants, and plaintiffs are still left in full ownership of their land. This Court can only conclude that the unfolding of the whole sordid story of the relationships between the Town of Delaware officials and its parallel twilight government which included these defendants and numerous others, so inflamed the passions of our jury that they found damages beyond those which were actually proved at the trial. There is no reason to believe that the plaintiff[s] could present any more direct or any better evidence to support this non-specific damage claim, were this Court to order a third trial. With some regret, the Court concludes that it must vacate that much of the jury's award in the amount of $1,600,000.00 . . . and grant judgment on that issue in favor of defendants notwithstanding the verdict. In all other respects the verdict is well justified by the proof at trial. Id. (JA:880).\n\nThe Court sustained the other damages awards: (1) $250,000 (before trebling) against the Bernas defendants, based upon a predicate act of extortion of sand and gravel mined from the JOBO property; and (2) a total of $33,551.94 (before trebling) against Dirie for extortion of firewood or timber; the used truck wheels and tires for his son; and the pickup truck for Harry Fisher. See Final Judgment dated May 17, 1999 (JA:874-75). \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThe trial court also required JBI to deliver its one-third of the outstanding shares in JOBO Associates, Inc. to the plaintiffs, based upon the jury's finding that those shares were extorted and plaintiffs' election to recover the shares in lieu of monetary damages. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nThis appeal and cross-appeal followed.\n\nIII. DISCUSSION\n\nA. Standard of Review\n\n\"A court of appeals reviews a district court's decision on a motion for judgment as a matter of law de novo, applying the same standards as the district court to determine whether judgment as a matter of law was appropriate.\" Merrill Lynch Interfunding, Inc. v. Argenti, 155 F.3d 113, 120 (2d Cir. 1998); Schlaifer Nance \u0026 Co. v. Estate of Andy Warhol, 119 F.3d 91, 98 (2d Cir. 1997); Katara v. D.E. Jones Commodities, Inc., 835 F.2d 966, 970 (2d Cir. 1987). Under Rule 50 of the Federal Rules of Civil Procedure, judgment as matter of law is appropriate where \"there is no legally sufficient evidentiary basis for a reasonable jury to find for\" a party. Fed. R. Civ. P. 50(a)(1). In ruling on a motion for judgment as a matter of law, the court \"must view the evidence in a light most favorable to the non-movant and grant that party every reasonable inference that the jury might have drawn in its favor.\" Samuels v. Air Transport Local 504, 992 F.2d 12, 16 (2d Cir. 1993).\n\nA district court's decision to grant or deny a motion for a new trial will be reversed only if the trial court's decision was an abuse of discretion. Atkins v. New York City, 143 F.3d 100, 102 (2d Cir. 1998); Lightfoot v. Union Carbide Corp., 110 F.3d 898, 911 (2d Cir. 1997). \"A motion for a new trial ordinarily should not be granted unless the trial court is convinced that the jury has reached a seriously erroneous result or that the verdict is a miscarriage of justice.\" Lightfoot, 110 F.3d at 911 (internal notations and quotations omitted). We now review the district courts' decisions in light of these well established standards.\n\nB. Elements of a RICO Claim\n\nTo establish a RICO claim, a plaintiff must show: \"(1) a violation of the RICO statute, 18 U.S.C. § 1962; (2) an injury to business or property; and (3) that the injury was caused by the violation of Section 1962.\" Pinnacle Consultants, Ltd. v. Leucadia Nat'l Corp., 101 F.3d 900, 904 (2d Cir. 1996) (citing First Nationwide Bank v. Gelt Funding Corp., 27 F.3d 763, 767 (2d Cir. 1994)). Section 1962(c), the section relevant here, makes it unlawful for any person employed by or associated with any enterprise engaged in, or the activities of which affect, interstate or foreign commerce, to conduct or participate, directly or indirectly, in the conduct of such enterprise's affairs through a pattern of racketeering activity . . . .\n\nTo establish a violation of 18 U.S.C. § 1962(c) then, a plaintiff must show \"(1) conduct (2) of an enterprise (3) through a pattern (4) of racketeering activity.\" Sedima, S.P.R.L. v. Imrex Co., 473 U.S. 479, 496 (1985); Cofacredit, S.A. v. Windsor Plumbing Supply Co. Inc., 187 F.3d 229, 242 (2d Cir. 1999); Azrielli v. Cohen Law Offices, 21 F.3d 512, 520 (2d Cir. 1994). The requirements of section 1962(c) must be established as to each individual defendant. See United States v. Persico, 832 F.2d 705, 714 (2d Cir. 1987), cert. denied, 486 U.S. 1022 (1988) (\"The focus of section 1962(c) is on the individual patterns of racketeering engaged in by a defendant, rather than the collective activities of the members of the enterprise, which are proscribed by section 1962(d).\").\n\nThe terms \"enterprise,\" \"racketeering activity,\" and \"pattern of racketeering activity\" are defined in 18 U.S.C. § 1961. A RICO enterprise \"includes any individual, partnership, corporation, association, or other legal entity, and any union or group of individuals associated in fact although not a legal entity.\" 18 U.S.C. § 1961(4). \"Racketeering activity\" is broadly defined to encompass a variety of state and federal offenses including, inter alia, murder, kidnapping, gambling, arson, robbery, bribery and extortion. See 18 U.S.C. § 1961(1). A \"`pattern of racketeering activity' requires at least two acts of racketeering activity, one of which occurred after the effective date of this chapter and the last of which occurred within ten years . . . after the commission of a prior act of racketeering activity.\" 18 U.S.C. § 1961(5).\n\nAlthough at least two predicate acts must be present to constitute a pattern, two acts alone will not always suffice to form a pattern. See Sedima, 473 U.S. at 496 n.14 (\"The implication is that while two acts are necessary, they may not be sufficient.\"); see also United States v. Indelicato, 865 F.2d 1370, 1382 (2d Cir. 1989) (\"The legislative history is . . . inconsistent with a rule that any two acts of racketeering activity, without more, suffice to establish a RICO pattern.\").\n\nIn short, to establish a violation of 18 U.S.C. § 1962(c), a plaintiff must establish that a defendant, through the commission of two or more acts constituting a pattern of racketeering activity, directly or indirectly participated in an enterprise, the activities of which affected interstate or foreign commerce. See, e.g., Sedima, S.P.R.L. v. Imrex Co., 473 U.S. 479, 496 (1985); Moss v. Morgan Stanley, Inc., 719 F.2d 5, 17 (2d Cir.1983), cert. denied sub nom. Moss v. Newman, 465 U.S. 1025 (1984).\n\nWe take up each of the RICO elements at issue below.\n\n1. The Town of Delaware as a RICO Enterprise\n\nDirie claims that the plaintiffs failed to establish that the Town of Delaware was a RICO enterprise and that the plaintiffs failed to establish an enterprise separate from the individual defendants. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e The plaintiffs argue that an enterprise may be organized for a legitimate and lawful purpose and may include such things as a municipality or town or a subdivision thereof.\n\nAs noted above, the RICO statute defines an \"enterprise\" as \"includ[ing] any individual, partnership, corporation, association, or other legal entity, and any union or group of individuals associated in fact although not a legal entity.\" 18 U.S.C. § 1961(4). The enterprise \"is an entity, . . . a group of persons associated together for a common purpose of engaging in a course of conduct.\" United States v. Turkette, 452 U.S. 576, 583 (1981). A racketeering enterprise is proven through \"evidence of an ongoing organization, formal or informal, and by evidence that the various associates function as a continuing unit.\" Id.; see United States v. Morales, 185 F.3d 74, 80 (2d Cir. 1999). Thus, evidence of an ongoing organization, the associates of which function as a continuing unit, suffices to prove an enterprise. See Turkette, 452 U.S. at 583; Procter \u0026 Gamble Co. v. Big Apple Industrial Buildings, Inc., 879 F.2d 10, 15 (2d Cir. 1989).\n\nUnder section 1962(c), a defendant and the enterprise must be distinct. Indeed, \"[i]t is well established in this Circuit that, under § 1962(c), the alleged RICO `person' and RICO `enterprise' must be distinct.\" Cedric Kushner Promotions, Ltd. v. King, 219 F.3d 115, 116 (2d Cir. 2000) (per curiam) (footnotes omitted) (citing Anatian v. Coutts Bank (Switzerland) Ltd., 193 F.3d 85, 89 (2d Cir. 1999); Riverwoods Chappaqua Corp. v. Marine Midland Bank, N.A., 30 F.3d 339, 343-45 (2d Cir. 1994); Bennett v. U.S. Trust Co., 770 F.2d 308, 315 (2d Cir. 1985), cert. denied, 474 U.S. 1058 (1986)).\n\nIn Riverwoods, this Court applied the distinctness requirement to hold that a bank - the RICO enterprise and the sole defendant - could not be liable under section 1962(c) when the RICO persons identified were the bank and bank employees acting within the scope of their employment. The Court later explained that \"the distinctness requirement could not be circumvented `by alleging a RICO enterprise that consists merely of a corporate defendant associated with its own employees or agents carrying on the regular affairs of the defendant.'\" Cedric Kushner Promotions, 219 F.3d at 116 (quoting Riverwoods, 30 F.3d at 344).\n\nBecause a corporation can only function through its employees and agents, any act of the corporation can be viewed as an act of such an enterprise, and the enterprise is in reality no more than the defendant itself. Thus, where employees of a corporation associate together to commit a pattern of predicate acts in the course of their employment and on behalf of the corporation, the employees in association with the corporation do not form an enterprise distinct from the corporation. Riverwoods, 30 F.3d at 344 (citation omitted).\n\nNotably, the Court stated that \"the plain language of section 1962(c) clearly envisions separate entities, and the distinctness requirement comports with legislative intent and policy.\" Riverwoods, 30 F.3d at 344 (citing Bennett, 770 F.2d at 315). \"This requirement focuses the section on the culpable party and recognizes that the enterprise itself is often a passive instrument or victim of the racketeering activity.\" Id. (internal quotation marks omitted).\n\nThe requirement of distinctiveness between the defendants and the enterprise, however, was met here. The jury could reasonably have concluded that the RICO persons - Dirie, Bernas, JBI and JML - were a separate and distinct assortment of public officials, private individuals and corporations who used their political power to influence the Town of Delaware's exercise of governmental authority over the plaintiffs' development. From the evidence adduced at trial, there was sufficient evidence from which a reasonable jury could conclude that the named defendants were separate, culpable parties and that the alleged enterprise, the Town of Delaware, was the \"passive instrument or victim of [their] racketeering activity.\" Id.\n\nMoreover, this Court has previously held that a governmental unit can be a RICO enterprise. See United States v. Angelilli, 660 F.2d 23, 30-35 (2d Cir. 1981), cert. denied, 455 U.S. 910, 945 (1982). In Angelilli, the defendants were four of approximately eighty New York City marshals appointed by the Mayor of the City of New York as officers of the City's Civil Court. The marshals were charged with mail fraud in a scheme to auction judgment debtors' property at artificially deflated prices. Prior to an auction, the marshals would meet with certain buyers and determine: (1) a deflated price at which property would ostensibly be sold and (2) the amount over the agreed sales price that would be paid to the marshals in return (\"top money\"). The marshals retained the \"top money\" and subsequently mailed to judgment creditors amounts reflecting the fraudulently deflated prices. The enterprise in whose activities the marshals were alleged to have participated in a pattern of racketeering activity was the New York City Civil Court.\n\nIn concluding that the New York City Civil Court was an enterprise within the meaning of RICO, this Court first noted that, under the language of the statute: \"the definition of `enterprise' is quite broad. We see no sign of an intention by Congress to exclude governmental units from its scope.\" Id. at 31. In reviewing the language of RICO, the Court concluded that, \"on its face the definition of an enterprise to `include any . . . legal entity' is unambiguously broad, and that it does not exclude the Civil Court.\" Id.\n\nThat conclusion was bolstered by certain of RICO's substantive goals, some of which are specifically directed toward governmental entities. Id. Recognizing that \"racketeering activity\" is defined in section 1961(1) to include bribery and extortion, the Court noted that \"bribery is `a crime which is peculiar to public officials,'\" and \"[e]xtortion under color of law is a crime which `can only be committed in the context of governmental activity.'\" Id. at 31-32 (citations omitted).By making bribery and extortion RICO offenses, Congress must be said to have understood that these offenses would be committed by governmental officials as a part of their work. Since these offenses can only be committed in the context of the work of a government agency, Congress must be taken to have intended that a governmental agency could be one of the types of \"enterprises,\" the affairs of which are conducted through a pattern of racketeering offenses. Id. at 32 (quoting United States v. Sisk, 476 F. Supp. 1061, 1062 (M.D. Tenn. 1979)).\n\nThus, \"[t]he connection between the named offenses of bribery and extortion and governmental work is too close to say that government work is not one of the kinds of activity that may constitute a RICO `enterprise.'\" Id.\n\nThe interpretation of the language of the statute to extend to activities affecting governmental entities is supported by the purpose and legislative history of the Organized Crime Control Act of 1970 (\"the Act\"), Pub. L. No. 91-452, 84 Stat. 922, of which RICO is Title IX. Angelilli, 660 F.2d at 32-33. Both the purpose and legislative history of the Act reflect \"concern about the infiltration of local government units.\" Id. at 32. Accordingly, \"the language of section 1961(4), defining enterprise, . . . unambiguously encompass[es] governmental units, and . . . the purpose and history of the Act and the substance of RICO's provisions demonstrate a clear congressional intent that RICO be interpreted to apply to activities that corrupt public or governmental entities.\" Id. at 33 (citing cases).\n\nThe analysis in Angelilli applies with equal force to this case. Throughout this action, the only enterprise alleged by the plaintiffs was the Town of Delaware, and the jury specifically found that the Town of Delaware was a RICO enterprise. See Special Verdict Form, Question 1 at 1 (JA:629); see also (T2:1200). Based upon the evidence admitted at trial, the jury could reasonably have concluded that the Town of Delaware's grant or denial of approval for aspects of the plaintiffs' development was conditioned upon complying with the demands of Dirie, the Town Supervisor, and others with influence. As with the New York City Civil Court in Angelilli, the jury here could have reasonably found that the Town of Delaware was a \"passive instrument\" through which the defendants wielded power for their personal benefit and, accordingly, was a RICO enterprise.\n\n2. Interstate Commerce\n\nDirie argues that the plaintiffs offered little, if any, proof of a material impact on interstate commerce of either the enterprise or the RICO predicate crimes. We disagree.\n\nThe law in this Circuit does not require RICO plaintiffs to show more than a minimal effect on interstate commerce. United States v. Banton, 647 F.2d 224, 233 (2d Cir.), cert. denied, 454 U.S. 857 (1981) (\"In determining what connections with interstate commerce must be proven . . . to establish a violation of § 1962, the courts have ruled that the impact need not be great. So long as the activities of the enterprise affect interstate commerce, the jurisdictional element is satisfied.\") (collecting cases). Here, one of the extortionate demands caused DeFalco to break an $8800 contract with the Walczak Lumber Company, an out-of-state logger located in Clifford, Pennsylvania. (T2: 125-29); (E:129-30). There was also testimony by the Clerk of the Town of Delaware that the regular business of the Town affected interstate commerce. (T2:579-83). Accordingly, Dirie's contention that the plaintiffs failed to establish that the activities of the enterprise affected interstate commerce is without merit.\n\n3. Participation in the Conduct of the Town's Affairs\n\nSection 1962(c) makes it unlawful \"for any person employed by or associated with any enterprise . . . to conduct or participate, directly or indirectly, in the conduct of such enterprise's affairs through a pattern of racketeering activity . . . .\" 18 U.S.C. § 1962(c) (emphasis added). The Supreme Court has interpreted the phrase \"to participate . . . in the conduct of [the] enterprise's affairs\" to mean participation in the operation or management of the enterprise. See Reves v. Ernst \u0026 Young, 507 U.S. 170, 185 (1993). Both Dirie and the Bernas defendants argue that there was insufficient evidence for the jury to find that they conducted the affairs of the Town and that their conduct met the \"operation or management\" test. We disagree.\n\nIn Reves, when assessing the RICO liability of an outside accounting firm for racketeering activity carried on by its client, the Supreme Court addressed the question \"whether one must participate in the operation or management of the enterprise itself to be subject to liability under this provision.\" Id. at 172. The Supreme Court examined Section 1962(c) and adopted an \"operation or management\" test to determine whether a defendant had sufficient connection to the enterprise to warrant imposing liability. Id. at 178-79. The Court held that, to conduct or participate, directly or indirectly, in the conduct of an enterprise's affairs, \"one must have some part in directing those affairs.\" Id. at 179. The Court stated that \"the word `participate' makes clear that RICO liability is not limited to those with primary responsibility, just as the phrase `directly or indirectly' makes clear that RICO liability is not limited to those with a formal position in the enterprise . . . .\" Id.\n\nThe jury specifically found that Dirie, Bernas, JML and JBI each \"conducted or participated in the conduct of the affairs of the Town of Delaware through a pattern of racketeering activity,\" see Special Verdict Form, Question 3 at 2 (JA:630); (T2:1200-01), and the record here contains ample evidence from which a reasonable jury could have found that Dirie and the Bernas defendants each had some part in directing the Town of Delaware's affairs.\n\nDirie was the elected Supervisor of the Town of Delaware from January 1986 to December 1991. In this position, Dirie served as a member of the Town Board and as a member of the Town Legislature. There was evidence at trial that Dirie offered to help guide DeFalco \"through the muddy waters\" of real estate development in the Town of Delaware, so long as DeFalco followed Dirie's suggestions. (T2:70). There was also evidence that, when DeFalco resisted Dirie's suggestions, Dirie used his authority within the Town of Delaware to affect the plaintiffs' development.\n\nFor example, when DeFalco resisted Dirie's suggestion that DeFalco let Dirie's son cut timber on the property, Dirie responded, \"If you want to go by the Planning Board and you want things to go smooth, you know, this is the way it is in Sullivan County. That's it.\" (T2:97). When DeFalco granted a logging contract to a lumber company for $8800, see (E:129-30), Dirie insisted that DeFalco cancel the contract and return the check. When DeFalco resisted, Dirie told him \"Don't expect to get your approvals at the Planning Board meeting unless it's done.\" (T2:126). At the next Planning Board meeting on Oct. 21, 1987, DeFalco's project was suspended for thirty days (T2:127); see also Pl.'s Ex. 24, Oct. 21, 1987 Planning Board Minutes (E:133-34). The following day, Dirie visited DeFalco at the development and asked whether he \"got the message.\" (T2:127). DeFalco returned the check and paid a penalty for canceling the contract. (T2:128). At the next Planning Board meeting on November 18, 1987, the project was once again allowed to move forward. (T2:130); see also Pl.'s Ex. 26, Nov. 18, 1987 Planning Board Minutes (E:135-37). Similarly, when DeFalco attempted to fire Fisher and his crew, Dirie told DeFalco that he would \"scrap the project.\" (T2:132). Dirie also instructed Town of Delaware Building Inspector Alfred Steppich to stop issuing building permits for Top of the World. (T2:335). \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nDirie also threatened adverse official action if DeFalco failed to give Bernas the JOBO stock. (T2:178). DeFalco testified that \"Dirie told me straight up and down, `[y]ou can kiss Phase 2 good-bye.'\" (T2:178). The sudden issues regarding plowing and maintenance of the development's roads and whether the roads would be accepted for dedication by the Town were also tied to transfer of the JOBO stock. According to DeFalco, with Dirie, \"it was always the same story. `If you sign over the stock, the problems go away.'\" (T2:197).\n\nDirie also influenced the Town of Delaware tax assessments for the plaintiffs' development. For example, Tax Assessor Richard Ferber testified that, notwithstanding that the Town Supervisor and the Town Board had no role in tax assessments, there were several conversations with Dirie and others, off the record and outside of official Town Board meetings, regarding the Top of the World taxes. (T2:614-19).\n\nIn short, there was ample evidence from which a reasonable jury could conclude that Dirie participated in the operation or management of the Town of Delaware. Indeed, there was more than enough evidence in the record for a reasonable jury to conclude that Dirie had more than just \"some part in directing those affairs.\" Reves, 507 U.S. at 179 (emphasis added).\n\nSimilarly, a reasonable jury could have found that the Bernas defendants participated in the operation or management of the Town of Delaware. Although the Bernas defendants had no official role in the operation or management of the Town, \"RICO liability is not limited to those with primary responsibility for the enterprise's affairs, . . . [or] limited to those with a formal position in the enterprise . . . .\" Id. \"An enterprise also might be `operated' or `managed' by others `associated with' the enterprise who exert control over it as, for example, by bribery.\" Id. at 184. There was ample evidence from which the jury could have concluded that Bernas played some part in directing the affairs of the Town.\n\nFor example, when DeFalco complained about Bernas giving free sand and gravel to the Town of Delaware, DeFalco suddenly faced problems with a previously agreed deal regarding plowing and maintenance of the development roads by the Town as well as threats that the Phase I roads either would not be accepted for dedication by the Town or that the dedication process would be delayed. (T2:165-66). Although the Town was prepared to accept the roads in October 1988, see Sullivan County Board of Supervisors Letter from William Dirie dated Oct. 17, 1988 (E:287), in December 1988 Bernas sought to delay the dedication of the roads to the Town until they met his standards. See Letter from John Bernas to Robert M. Rosen dated Dec. 9, 1988, showing courtesy copies to William Dirie and Joseph DeFalco (E:288). \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nBernas also threatened adverse official action from the Town of Delaware if DeFalco did not give him the JOBO stock. On several occasions, Bernas indicated that, if DeFalco did not sign over the stock, the project would be scrapped and that Bernas had the power to cause the development to come to a halt. (T2:202). Dirie threatened adverse official action if DeFalco failed to give Bernas the stock (T2:178), and Delaware Town Engineer Terry Kelly, Tax Assessor Ferber, Tax Assessor Meckle and Building Inspector Steppich each pressured DeFalco to turn the stock over to Bernas. (T2:183). Once DeFalco transferred the stock to Bernas, the Phase I roads were immediately accepted for dedication by the Town. (T2:206).\n\nAfter DeFalco signed over the one-third interest in JOBO, however, Bernas wanted rights to the entire gravel pit and the dedication of the Phase I roads was called into question again. (T2:206). Bernas told DeFalco that, if he did not turn the gravel pit over to him, \"[t]hey were going to close the development down.\" (T2:214). When DeFalco resisted giving Bernas the entire gravel pit, Tax Assessors Ferber and Meckle reassessed certain lots from $20,000 to $45,000 a piece, more than doubling plaintiffs' taxes. (T2:253). When DeFalco asked Dirie how he could get Phase II approved in light of the April 2, 1990 letter from the Town of Delaware Planning Board listing certain uncompleted requirements, Dirie replied, \"Give Bernas the gravel pit.\" (T2:225).\n\nPerhaps the most striking evidence that Bernas influenced the affairs of the Town, however, was set forth in the Sullivan County Board of Supervisors Letter from Delaware Supervisor William Dirie to Joe DeFalco dated March 30, 1990, in which Dirie wrote: \"As we have previously discussed, there are several ways that you can complete the work on Phase II. I am confident that we can reach an agreement with the approval of John Bernas, that will meet all our needs.\" See Sullivan County Board of Supervisors Letter from Delaware Supervisor William Dirie to Joe DeFalco dated Mar. 30, 1990 (E:189-90; E:315-16) (emphasis added). \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e That letter - stating in effect that completion of Phase II of the plaintiffs' development was subject to Bernas' approval - is strong evidence from which a jury could conclude that Bernas participated in the operation or management of the Town of Delaware.\n\nIn short, there was ample evidence from which a reasonable jury could conclude that Bernas participated in the operation or management of the Town of Delaware, had at least some part in directing the affairs of the Town and, indeed, exerted some control over it. See Reves, 507 U.S. at 179, 184. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\n4. Predicate Acts\n\nBoth Dirie and the Bernas defendants argue that the plaintiffs failed to establish the commission of at least two predicate acts of racketeering by them.\n\na. William Dirie\n\nDirie argues that the crimes allegedly constituting racketeering activity by him were all based on extortion. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e In essence, Dirie argues that extortion requires the wrongful use of force, violence or fear and, in each of these instances, that element is entirely missing. Dirie claims that there was no evidence of a threat from him and that there was no evidence of the requisite fear of adverse consequences with respect to each of the charges of extortion. Dirie also argues that the predicate acts with which he was charged were \"supported, like much else, by no evidence except the testimony of DeFalco.\" See Brief of Defendant-Cross-Defendant-Appellant-Cross-Appellee William Dirie at 14.\n\nThe plaintiffs argue that 18 U.S.C. § 1951(b)(2) defines \"extortion\" as \"the obtaining of property from another, with his consent, induced by wrongful use of actual or threatened force, violence or fear, or under color of official right.\" The plaintiffs further claim that fear of economic loss has long been held to satisfy this statutory definition of \"extortion.\" The plaintiffs argue that Dirie's acts clearly constitute extortion because, in each instance that DeFalco followed Dirie's orders, DeFalco acted under a threat or implication that the plaintiffs' project would be harmed by the political actions or inactions of Dirie or the other defendants.\n\nUnder the Hobbs Act, \"[t]he term `extortion' means the obtaining of property from another, with his consent, induced by wrongful use of actual or threatened force, violence, or fear, or under color of official right.\" 18 U.S.C. § 1951(b)(2). \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Extortion through threats of economic loss falls within the Hobbs Act's prohibitions, see United States v. Robilotto, 828 F.2d 940, 944-45 (2d Cir.1987), cert. denied, 484 U.S. 1011 (1988). Extortion may therefore be established on a theory that activities amounted to extortion by wrongful use of fear of economic loss. See, e.g., United States v. Capo, 817 F.2d 947, 951 (2d Cir. 1987) (en banc); United States v. Rastelli, 551 F.2d 902, 904 (2d Cir.), cert. denied, 434 U.S. 831 (1977).\n\nIn this Circuit, \"[t]he cases interpreting the Hobbs Act have repeatedly stressed that the element of `fear' required by the Act can be satisfied by putting the victim in fear of economic loss.\" Capo, 817 F.2d at 951 (quoting United States v. Brecht, 540 F.2d 45, 52 (2d Cir. 1976), cert. denied, 429 U.S. 1123 (1977)) (citations omitted). The absence or presence of fear of economic loss \"must be considered from the perspective of the victim, not the extortionist; the proof need establish that the victim reasonably believed: first, that the defendant had the power to harm the victim, and second, that the defendant would exploit that power to the victim's detriment.\" Capo, 817 F.2d at 951 (citing Rastelli, 551 F.2d at 905).\n\nThis Circuit's case law on extortion by wrongful use of fear of economic loss \"is comprised of cases in which the evidence was plain that nonpayment would result in preclusion from or diminished opportunity for some existing or potential economic benefit.\" Capo, 817 F.2d at 951. For example, in Brecht, the evidence established that the defendant was the manager of Westinghouse's technical publications group, a position that afforded him discretion to award outside subcontracts for the production of Westinghouse's technical manuals. At a meeting with a subcontractor's representative, the defendant \"demanded a $1,000 kickback as a condition for the award of the contract to [the subcontractor].\" Brecht, 540 F.2d at 47. This Court affirmed Brecht's conviction for extortion by wrongful use of fear of economic loss because \"the evidence showed that he obtained the $1,000 by the use of fear, attempting to convince the victim that he would be denied any chance to obtain a contract unless he paid.\" Id. at 52; see also United States v. Clemente, 640 F.2d 1069, 1073 (2d Cir.) (nonpayment would lead to loss of existing carpentry account), cert. denied, 454 U.S. 820 (1981); United States v. Daley, 564 F.2d 645, 650 (2d Cir. 1977) (failure to provide free supplies and labor to union official would lead to loss of jobs and labor unrest), cert. denied, 435 U.S. 933 (1978); Rastelli, 551 F.2d at 904-05 (failure of lunch truck suppliers to pay kickbacks to union official would lead to loss of union members' business).\n\nConversely, in Capo, there was no evidence that noncompliance would result in preclusion from or diminished opportunity for some existing or potential economic benefit. In Capo, the defendants allegedly solicited bribes in exchange for certain job referrals to Eastman Kodak. The government argued that the evidence was adequate to allow a rational juror to find that the victims reasonably feared economic loss if they did not make the payments demanded by the defendants. In holding that the evidence of fear of economic loss was insufficient as a matter of law, the Court held that there was no evidence that any defendant did, in fact, negatively influence any hiring decision after allegedly soliciting bribes in exchange for job referrals to Eastman Kodak. Capo, 817 F.2d at 952. The Court noted that \"not one witness testified to any fear that nonpayment would result in one of the defendants adversely affecting his or her chances for a job at Kodak; indeed, most of the `victims' testified that they had no such fear, while others simply were not asked.\" Id. Accordingly, the Court held that \"the second part of the Rastelli test - that the victim reasonably believed that the defendant would exploit his power to the victim's detriment - [was] not satisfied.\" Id.\n\nApplying these principles here, we conclude that extortion by Dirie through threats of economic loss was shown in the instant case. Dirie was the elected Supervisor of the Town of Delaware. In this position, Dirie served as a member of the Town Board and as a member of the Town Legislature. As set forth in detail above, there was ample evidence at trial that Dirie offered to help guide DeFalco with his real estate development in the Town of Delaware, provided that DeFalco followed the suggestions that Dirie made to him. There was also considerable evidence that, when DeFalco resisted each of Dirie's suggestions, Dirie used his authority within the Town of Delaware to adversely affect the plaintiffs' development.\n\nDirie's argument that the \"suggestions\" were not accompanied by the requisite threat of harm to the plaintiffs is perhaps strongest with respect to the finding that Dirie \"[e]xtorted from plaintiffs the value of the services of Harry Fisher,\" see Special Verdict Form, Question 4 at 2 (JA:630); (T2:1201), because the suggestion that DeFalco hire Fisher occurred at the initial 1987 meeting between DeFalco, Dirie and Fisher at DeFalco's home. Although it is a close call, there was sufficient evidence from which a reasonable jury could conclude that DeFalco reasonably believed, at the time of their first meeting, that Dirie had the power to harm him, and that Dirie would exploit that power to his detriment. See Capo, 817 F.2d at 951 (citing Rastelli, 551 F.2d at 905).\n\nAt the initial meeting, Dirie informed DeFalco that he was the Supervisor of the Town of Delaware. (T2:70). Dirie proceeded to tell DeFalco that \"This is not Long Island . . . .We're going to help you every possible way we can to guide you through the muddy waters . . . . I'm going to make some suggestions to you.\" (T2:70). Dirie then proceeded to make his initial suggestions that: (1) DeFalco hire Fisher as a foreman and pay Fisher by purchasing him a new truck in Fisher's son's name; (2) DeFalco buy landscaping materials from Curtis, local nursery owner and Chairman of the Delaware Planning Board; (3) DeFalco purchase equipment at Tax Assessor Meckle's sporting goods store; and (4) DeFalco use Bernas to do the road construction at the development and mine the gravel from the JOBO gravel pit. Dirie explained that \"Around here in Sullivan County, you got to deal with the local people.\" (T2:71) (emphasis added).\n\nAlthough Dirie characterizes his initial statements as \"suggestions\" that were accompanied with no threat of adverse action, and DeFalco characterizes them as threats made by a Town Supervisor demanding that DeFalco use local people, the jury reasonably sided with DeFalco. Dirie informed DeFalco of his position as the Town of Delaware Supervisor. Dirie's \"suggestions\" not only benefited certain members of the Town government and favored local residents, but also were coupled with the statement that: \"Around here in Sullivan County, you got to deal with the local people.\" (T2:71) (emphasis added). A reasonable jury therefore could have concluded that these were credible threats rather than mere suggestions. A reasonable jury could also have found that DeFalco reasonably believed that Dirie had the power to harm him, and that Dirie would exploit that power to the his detriment. Indeed, that fear of economic loss was subsequently borne out - when DeFalco \"fired the whole crew, including Harry Fisher . . . Dirie told [him] that he'd scrap the project\" (T2:132), and took steps to do so. Accordingly, there was sufficient evidence for a reasonable jury to find that Dirie extorted the value of the services of Harry Fisher.\n\nAs set forth in detail above, there was also ample evidence from which the jury could reasonably have found that Dirie put DeFalco in fear of economic loss with respect to the other predicate acts - namely, that Dirie extorted timber and/or firewood for his own benefit; extorted timber for the benefit of Ray Ferber; extorted one-third of the shares of JOBO Associates, Inc., for the benefit of John Bernas, Inc.; and extorted from plaintiffs truck wheels and tires for the benefit of William Dirie's son. For example, when DeFalco protested Dirie's demand that he cancel the Walczak logging contract so that Dirie's logging activities could remain exclusive, Dirie told him \"Don't expect to get your approvals at the Planning Board meeting unless it's done.\" (T2:126). DeFalco was also instructed by Tax Assessor Richard Ferber to use his cousin, Ray Ferber, for the logging contract, \"[o]therwise [he was] never going to get approvals.\" (T2:128). There was also considerable evidence of actual or threatened adverse official action with respect to the transfer of the JOBO stock. In short, there was sufficient evidence of fear of economic loss with respect to all five predicate acts charged against Dirie for a reasonable jury to conclude that DeFalco believed that Dirie had the power to harm him, and that Dirie would exploit that power to the plaintiffs' detriment.\n\nb. The Bernas Defendants\n\nThe Bernas defendants also argue that the plaintiffs failed to establish the commission of at least two predicate acts of racketeering against them. The plaintiffs charged the Bernas defendants with three predicate acts: (1) extortion of the construction contract to build the development's roads; (2) extortion of one-third of the JOBO stock; and (3) extortion of sand and gravel from the JOBO pit. The jury found that none of the Bernas defendants \"[e]xtorted from plaintiffs a construction contract to build Top of the World Phase I roads;\" but that they \"[e]xtorted from plaintiffs one-third of the shares of JOBO;\" and \"[e]xtorted from plaintiffs sand and/or gravel from the JOBO gravel pit.\" (JA:630-31); (T2:1201-02). \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\ni. The JOBO Stock\n\nThe Bernas defendants argue that the evidence does not demonstrate extortion of the one-third JOBO stock interest: \"Extortion, as defined in the Hobbs Act, consists of the use of wrongful means to achieve a wrongful objective,\" and \"[t]he use of economic fear as leverage to drive a hard bargain in an ordinary commercial relationship will not support a RICO claim based on extortion.\" Brief of Defendants- Appellants John Bernas, John Bernas, Inc. and JML Quarries, Inc. at 21. They argue that a threat to cause economic loss is wrongful only when it is used to obtain property to which one is not entitled.\n\nThe Bernas defendants claim that the District Court erred by failing to instruct the jury that, before it could find wrongful use of actual or threatened fear of economic loss, it had to find that the Bernas defendants had no lawful right to the JOBO stock. They argue that DeFalco and Bernas never had a binding agreement providing for the number of miles of roads Bernas had to build in order to obtain the transfer of the JOBO stock. They also argue that DeFalco later accepted a proposal by Bernas that he would finish the Phase I roads and do the Phase 2 roads for a flat fee of $40,000, in return for the plaintiffs' transfer of the one-third stock interest in JOBO. See Brief of Defendants-Appellants John Bernas, John Bernas, Inc. and JML Quarries, Inc. at 23-24 (citing (E:354); (T2:297)); see also (E:356). The Bernas defendants argue that, according to DeFalco's own testimony, this offer induced DeFalco to agree to give the stock to Bernas. See id. (citing (T2:175, 294-97)). The Bernas defendants therefore argue that they had a legal right to the JOBO stock and that the court erred by failing to instruct the jury that it had to find that the Bernas defendants had no lawful right to the JOBO stock before it could find wrongful use of actual or threatened fear of economic loss.\n\nThe trial court's instruction with respect to extortion as a RICO predicate act was as follows:\n\nExtortion is a separate crime. Extortion is the obtaining of property or anything of value from another person with his consent, when that consent is induced or caused or brought about by the wrongful use of actual or threatened force, violence or fear of physical injury or economic harm and loss.\n\nThe word \"property\" includes money and any valuable right considered to be a source or element of wealth. It is not limited to physical or tangible property and things. In this case \"property\" includes money and payment for unwanted services, such as accounting or engineering or legal or landscaping or other work, sand and gravel and firewood and timber, and anything else of value. It also includes the right to have government affairs administered impartially, and to receive the benefits of permits or other lawful applications to planning boards or building inspectors or zoning boards.\n\nThe terms \"force,\" \"violence,\" \"fear,\" and \"threats\" have their common everyday meanings. The use or exploitation of fear exists if the victim would reasonably experience anxiety, concern or worry about economic harm to himself or his company. The reasonable existence of fear must be determined by considering all the facts existing at the time of the defendant's actions.\n\nYou may consider the person who made the demand, the nature of the conduct, and all the circumstances a reasonable person, situated as the particular victim was situated, would perceive.\n\nYou may consider the relationship of the parties in deciding whether the element of the use of fear exists. A friendly relationship between the parties, however, does not mean that you cannot find that fear exists. Indeed, the fact that relations between a victim and alleged extorter may sometimes appear cordial is not inconsistent with the crime of extortion.\n\nThreats can be direct or indirect. It may be aimed at a third person. They may be veiled threats made by suggestion, implication and inference, though such inference on the part of the person extorted must be reasonable. Whether a physical gesture or veiled reference amounts to a threat is a matter for you to decide under all the circumstances. You must determine if a reasonable person under all the circumstances would perceive it to be a threat. (T2:1174-76).\n\nThe Bernas defendants failed to object to this charge, and now argue that the charge was plain error.\n\nBecause the Bernas defendants failed to object, this Court will review the jury charge not for \"plain error,\" but for \"fundamental error.\" As noted above, Rule 51 of the Federal Rules of Civil Procedure provides, in pertinent part, that \"[n]o party may assign as error the giving or the failure to give an instruction unless that party objects thereto before the jury retires to consider its verdict, stating distinctly the matter objected to and the grounds of the objection.\" Fed. R. Civ. P. 51; see also Fogarty, 162 F.3d at 79 (\"A party who fails to object to a jury instruction at trial waives the right to make that instruction the basis for an appeal.\"). Under these circumstances, the charge is reviewed for \"fundamental error,\" which \"is narrower than the plain error doctrine applicable to criminal cases.\" Travelers Indem. Co., 62 F.3d at 79. To qualify as a fundamental error there must be \"an error so serious and flagrant that it goes to the very integrity of the trial,\" id. (quoting Modave, 501 F.2d at 1072 (2d Cir. 1974)), and the instruction must have \"deprived the jury of adequate legal guidance to reach a rational decision.\" Id. (quoting Werbungs, 930 F.2d at 1026).\n\nThere was nothing close to fundamental error in the present case. The District Court's instruction on extortion - at the point at which it discussed the RICO claim - did not include language that \"wrongful\" means that the defendants had no lawful right to the property obtained. That principle was covered, however, elsewhere in the charge. In its discussion of the plaintiffs' claim of conversion by extortion, the District Court instructed the jury:\n\nTo prove conversion by extortion, the plaintiffs must prove by a preponderance of the evidence that by means of extortion, the defendants intentionally exercised control over the property of another, thereby interfering with the person's right of possession. The parties agree that 50 shares of JOBO stock were transferred to John Bernas by Mr. DeFalco. I have already explained the elements of extortion in connection with the RICO claim.\n\nThe plaintiffs allege that by means of extortion, John Bernas, John Bernas, Incorporated, and JML Quarries removed and sold large quantities of gravel and sand from the JOBO gravel pit belonging to JOBO Associates, Inc., and did not belong to them. Defendants assert that any gravel or sand taken from the JOBO pit was taken rightfully, with authority and by agreement with the plaintiffs, and not as a result of extortion . . . .\n\nThe plaintiffs also allege that by means of extortion, John Bernas, Incorporated, through its agent, obtained one-third of the stock in the JOBO Corporation. You are instructed that John Bernas, Inc., currently exercises control over one-third of the shares in JOBO Associates.\n\nThe defendants assert that John Bernas, Incorporated, obtained the shares of JOBO Associates rightfully by voluntary agreement with the plaintiffs, not by extortion. (T2:1180-82) (emphasis added).\n\nThe principle that \"wrongful\" means that the defendants had no lawful right to the property obtained should have been set forth in the section discussing extortion under the RICO claim. Nevertheless, we cannot say that the failure to do so was fundamental error. \"`[A] single instruction to a jury may not be judged in artificial isolation, but must be viewed in the context of the overall charge.'\" United States v. Locascio, 6 F.3d 924, 942 (2d Cir.1993), cert. denied, 511 U.S. 1070 (1994) (quoting Cupp v. Naughten, 414 U.S. 141, 146-47 (1973)). Moreover, although it is preferable that the district court expressly instruct the jury that it must find that the defendants had no lawful claim of right to the property they obtained through wrongful use of fear, cf. United States v. Jackson, 196 F.3d 383, 387 (2d Cir. 1999), cert. denied, --- U.S. ---, 120 S. Ct. 2731 (2000), \"[t]he thrust of the district court's charge, when read as a whole, was that the use of fear of economic loss to obtain property to which one is not entitled is wrongful.\" United States v. Clemente, 640 F.2d 1069, 1077 (2d Cir.), cert. denied, 454 U.S. 820 (1981) (citation omitted). Unlike Jackson, where the Court gave no other explanation of the term \"extort\" and did not limit the scope of that term to the obtaining of property to which the defendant had no actual, or reasonable belief of, entitlement, the District Court here instructed the jury regarding the defendants' claim that the JOBO stock and any gravel or sand taken from the JOBO pit \"was taken rightfully, with authority and by agreement with the plaintiffs, and not as a result of extortion.\" (T2:1181). Accordingly, this was not \"an error so serious and flagrant that it goes to the very integrity of the trial.\" Travelers Indem. Co., 62 F.3d at 79 (internal quotation marks omitted); see also United States v. Middlemiss, 217 F.3d 112, 121 (2d Cir. 2000) (\"While we prefer the district court to explicitly instruct the jury that it must find that the defendants were not lawfully entitled to the property they obtained through wrongful use of fear, [the district court's] charge as a whole conveys that idea. No plain error is present.\") (citation omitted). \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nii. The Sand and Gravel\n\nThe Bernas defendants also argue that the plaintiffs did not adduce any evidence from which the jury could find that the Bernas defendants extorted gravel and sand. The Bernas defendants argue that the gravamen of extortion is consent induced by the wrongful use of threats. They argue that, based on DeFalco's own testimony, the jury found that the Bernas defendants did not extort the contract to build the development's roads. The Bernas defendants assert that the same agreement under which they built the roads also \"permitted Bernas to mine the JOBO site to extract gravel necessary to build the roads at [Top of the World], as well as to sell to third parties, splitting any profits with plaintiffs 50-50.\" Brief of Defendants-Appellants John Bernas, John Bernas, Inc. and JML Quarries, Inc. at 19. They argue that this compels the conclusion that the removal and sale of sand and gravel was not the product of extortion, but of a wholly voluntary agreement.\n\nThe defendants further argue that the plaintiffs instructed Bernas to close down the JOBO operation effective December 15, 1989, and when DeFalco returned from Florida in March 1990 and found Bernas working at JOBO, DeFalco immediately ordered Bernas out and erected physical barriers to prevent entry. Accordingly, the defendants argue, any removal of materials after December 15, 1989 was without the plaintiffs' consent and, by definition, \"[s]uch materials were not obtained by extortion, the essence of which is consent induced by wrongful use of threats or fear.\" Brief of Defendants-Appellants John Bernas, John Bernas, Inc. and JML Quarries, Inc. at 20.\n\nThe plaintiffs concede that, pursuant to the negotiations between Bernas and DeFalco, the parties contemplated that Bernas would mine the JOBO gravel pit to obtain material for the roads in plaintiffs' development and sell the excess (and split the profit with plaintiffs). The plaintiffs argue, however, that it was not until after the plaintiffs discovered that Bernas was using the gravel for neither purpose and there was no splitting of profits that they instructed Bernas to cease removing any additional gravel. When Bernas refused to do so, the defendants threatened adverse political action from members of the enterprise if plaintiffs tried to force him to stop, thereby committing extortion. The plaintiffs argue that the evidence before the jury was therefore sufficient to conclude that Bernas used the political power of the enterprise to extort sand and gravel from the plaintiffs. We agree.\n\nThe essence of Bernas' argument is that he was contractually entitled to mine the sand and gravel and, if the plaintiffs were not satisfied with the work done or the profit sharing, their claim was for breach of contract. Bernas' argument, however, presupposes that the Bernas defendants indeed had a contractual right to the sand and gravel. The jury, however, made no such finding.\n\nAlthough the jury found that the Bernas defendants did not extort a construction contract to build the development's roads, that is not tantamount to a finding that a construction contract existed and that the Bernas defendants therefore had a contractual right to the sand and gravel. The Bernas defendants' effort to infer a contractual right from the jury's negative finding on the first predicate act is unavailing. The jury could reasonably have concluded that there was no extortion of any construction contract because there was no contract. Indeed, Bernas concedes that there was no formal, written contract. See Brief of Defendants-Appellants John Bernas, John Bernas, Inc. and JML Quarries, Inc. at 19 (\"the removal and sale of sand and gravel was not the product of extortion but of a wholly voluntary agreement in principle, which the parties proceeded to carry out without benefit (unwisely) of ever executing a definitive written contract.\").\n\nEven assuming there was a contract, however, a reasonable jury could have found that Bernas had breached the agreement at the time DeFalco ordered him to stop removing sand and gravel, and DeFalco was within his contractual rights to order the stoppage. The jury could reasonably have concluded that the only reason DeFalco allowed any further access to the gravel was because of extortionate threats by Bernas.\n\nIn any event, there was ample evidence from which the jury could reasonably conclude that the Bernas defendants extorted sand and gravel from the JOBO pit. During the course of Bernas' work on the roads, the Town of Delaware removed gravel from the plaintiffs' gravel pit free-of- charge. (T2:162-63). When DeFalco raised the issue of Bernas giving away free sand and gravel, DeFalco suddenly faced problems with plowing and maintenance of the development roads by the Town as well as threats that the Phase I roads either would not be accepted for dedication by the Town or that the dedication process would be delayed. (T2:165-66); compare (E:287) with (E:288). DeFalco also wanted Bernas to give him a detailed breakdown of what materials had been removed, sold or given away from the gravel pit. Whenever DeFalco broached the topic with Bernas, however, Bernas threatened to get the Town either to stop the project or to refuse dedication of the development's roads. In short, the evidence was sufficient for a reasonable jury to conclude that the Bernas defendants extorted from the plaintiffs sand and gravel from the JOBO pit.\n\n5. Pattern of Racketeering Activity\n\nThe Bernas defendants argue that the plaintiffs failed to establish a pattern of racketeering activity. RICO defines a \"pattern of racketeering activity\" as requiring \"at least two acts of racketeering activity\" committed in a 10-year period. 18 U.S.C. § 1961(5); see also Cofacredit, S.A. v. Windsor Plumbing Supply Co. Inc., 187 F.3d 229, 242 (2d Cir. 1999); Azrielli v. Cohen Law Offices, 21 F.3d 512, 520 (2d Cir. 1994). To establish a pattern, a plaintiff must also make a showing that the predicate acts of racketeering activity by a defendant are \"related, and that they amount to or pose a threat of continued criminal activity.\" H.J., Inc. v. Northwestern Bell Tel. Co., 492 U.S. 229, 239 (1989); Cofacredit, 187 F.3d at 242. The continuity necessary to prove a pattern can be either \"closed-ended continuity,\" or \"open-ended continuity.\" See H.J., Inc., 492 U.S. at 239, 241.\n\nThe Bernas defendants argue that the plaintiffs have failed to establish the requisite minimum period of closed-ended continuity. Here, the Bernas defendants argue, the extortion took place over a period of only a few months: the one-third stock in JOBO was extorted in December 1989, induced by pressure upon DeFalco between May and December 1989; and the extortion of sand and gravel was also complete by December 1989. Thus, the defendants' extortion scheme lasted at most a few months during the last half of 1989, a duration not sufficient to establish a closed-ended pattern of racketeering by these defendants.\n\nThe Bernas defendants argue that the plaintiffs have also failed to establish a pattern of open-ended continuity, because the scheme by the Bernas defendants was by its very nature finite - once achieved the scheme would necessarily come to an end and there was no evidence that the predicate acts by the Bernas defendants were a regular way of conducting defendants' ongoing legitimate business.\n\nThe plaintiffs claim that they established both closed- and open- ended continuity. They argue that the Bernas defendants' extortionate theft of sand and gravel included multiple extortionate acts and lasted for an extended period of almost three years from September 1987 through May 1990. The plaintiffs claim that the other racketeering activities of the enterprise commenced in 1987 and are continuing to date, because the extortionate acts by which the defendants obtained the JOBO stock began in December 1989 and continued through the time that the defendants were ordered to deposit the stock in escrow with the court. The plaintiffs further claim that the defendants are still preventing plaintiffs from completing their development project. They argue that the escalating nature of the defendants' demands, such as their demanding an increasing interest in JOBO, reveals an enterprise with no intention of stopping once it met an immediate goal.\n\na. Closed-Ended Continuity\n\nClosed-ended continuity is demonstrated by predicate acts that \"amount to continued criminal activity\" by a particular defendant. To satisfy closed-ended continuity, the plaintiff must prove \"a series of related predicates extending over a substantial period of time. Predicate acts extending over a few weeks or months . . . do not satisfy this requirement.\" Id. at 242. To establish closed-ended continuity, \"a plaintiff must provide some basis for a court to conclude that defendants' activities were `neither isolated or sporadic.'\" GICC Capital Corp. v. Technology Finance Group, Inc., 67 F.3d 463, 467 (2d Cir. 1995).\n\nSince the Supreme Court decided H.J., Inc., this Court has never held a period of less than two years to constitute a \"substantial period of time.\" See Cofacredit, 187 F.3d at 242; see also GICC Capital Corp., 67 F.3d at 467; Metromedia Co., 983 F.2d at 369 (finding closed-ended continuity when predicate acts occurred over a period of two years); Jacobson v. Cooper, 882 F.2d 717, 720 (2d Cir. 1989) (finding closed-ended continuity when predicate acts occurred over a \"matter of years\"). Other circuits have required similar periods. See GICC Capital Corp., 67 F.3d at 468 (collecting cases). Although closed-ended continuity is primarily a temporal concept, other factors such as the number and variety of predicate acts, the number of both participants and victims, and the presence of separate schemes are also relevant in determining whether closed-ended continuity exists. See Cofacredit, 187 F.3d at 242; GICC Capital Corp., 67 F.3d at 468.\n\nThe duration of a pattern of racketeering activity is measured by the RICO predicate acts the defendants commit. See Cofacredit, 187 F.3d at 243 (citing H.J., Inc., 492 U.S. at 242 (continuity test looks to period during which predicate acts were committed)); GICC Capital Corp., 67 F.3d at 467 (actions that do not constitute predicate racketeering activity not included in the calculation). Here, the jury found that the Bernas defendants extorted from plaintiffs sand and/or gravel from the JOBO gravel pit and extorted from plaintiffs one-third of the shares of JOBO Associates, Inc. (JA:630-31); (T2:1201-02).\n\nThe plaintiffs claim that they satisfy closed-ended continuity because the extortion of sand and gravel took place over a period of at least three years from September 1987 through May 1990. Their only record citation for this proposition, however, is the handwritten note that Bernas gave DeFalco as his accounting of the gravel pit through 1989. See Brief of Plaintiffs-Appellees-Cross-Appellants at 31 n.23 (\"The Bernas Defendants extortion of sand and gravel occurred multiple times over a long period of time.\") (citing (E:163-65)). We are not persuaded that these three pages, which purport to be the yards of sand and gravel Bernas billed from January to June 1989, establish extortion of sand and gravel from September 1987 through May 1990 as plaintiffs claim.\n\nEven assuming that the Bernas defendants were taking gravel from the site and not using it on the developments' roads or sharing the profits from any third-party sales, the earliest threat that we can find by Bernas to stop the project if the Bernas defendants were not allowed to continue to remove sand and gravel from the pit is December 1988. See (T2:165-66); see also Letter from John Bernas to Robert M. Rosen dated Dec. 9, 1988, with courtesy copies to William Dirie and Joseph DeFalco (E:288). \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Bernas' December 1988 letter is well past the September 1987 point at which the plaintiffs allege the extortion began. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nThe plaintiffs point to only one other extortionate act by the Bernas defendants with respect to the sand and gravel, namely, when the plaintiffs told the Bernas defendants to \"cease and desist\" from removing any additional gravel and \"Bernas refused to do so, threatening adverse political action from members of the enterprise if plaintiffs tried to force him to do so . . . .\" Brief of Plaintiffs-Appellees-Cross-Appellants at 37-38. The record reveals, however, that DeFalco did not instruct the Bernas defendants to refrain from removing additional gravel until December 15, 1989. (T2:207). When DeFalco returned to New York in March 1990 from Florida and found Bernas' people working on the JOBO site, DeFalco again directed Bernas to stop work at JOBO and erected physical barriers there. (T2:208-12); see also \"Cease and Desist Order\" Letter from Joe DeFalco to John Bernas, Inc. and JML Quarries dated Mar. 2, 1990 (E:182).\n\nSimilarly, the duration of the Bernas defendants' predicate act of extorting the one-third interest in JOBO occurred over a relatively short period of time. DeFalco testified that it was not until mid-1989 that he faced extortionate threats to induce the transfer of the JOBO stock to Bernas. (T2:176-83). DeFalco transferred the one-third interest on December 6, 1989. See Pl.'s Ex. 60, Stock Transfer Agreement dated Dec. 6, 1989 (E:181); Pl.'s Ex. B31, JOBO Stock Certificate for John Bernas, Inc. (E:361). Although DeFalco testified that, after he signed over the one-third interest in JOBO to Bernas, Bernas wanted rights to the entire gravel pit, on March 15, 1990, DeFalco wrote to Bernas: \"I feel that I am always being harassed over this gravel pit. I have no intentions of backing down anymore.\" (T2:212); see also Letter from Joe DeFalco to John Bernas, Inc. and JML Quarries dated Mar. 5, 1990 (E:183-84). DeFalco testified that he finally had had enough and, after he attempted to submit a bond to get Phase II approved on or about May 14, 1990, he \"had no intentions of signing over the gravel pit.\" (T2:230).\n\nAt best, the evidence in the record indicates that the predicate acts by the Bernas defendants took place between December 1988 and May 1990 - a period of approximately a year and a half. This Court has never held that such a short period of activity satisfies the closed- ended continuity requirement. See Cofacredit, 187 F.3d at 242. Even viewing the evidence in the light most favorable to the plaintiffs, the predicate acts that the Bernas defendants committed spanned less than a year and a half. That period is of insufficient length to demonstrate closed-ended continuity under this Court's precedents.\n\nb. Open-Ended Continuity\n\nThe plaintiffs argue, however, that they have alternatively established open-ended continuity. To establish open-ended continuity, \"the plaintiff need not show that the predicates extended over a substantial period of time but must show that there was a threat of continuing criminal activity beyond the period during which the predicate acts were performed.\" Cofacredit, 187 F.3d at 242 (citing H.J., Inc., 492 U.S. at 242-43).\n\nIn this Circuit, the \"cases assessing whether a threat of continuity exists have looked first to the nature of the predicate acts alleged or to the nature of the enterprise at whose behest the predicate acts were performed.\" GICC Capital Corp., 67 F.3d at 466 (collecting cases). In assessing whether or not the plaintiff has shown open-ended continuity, the nature of the RICO enterprise and of the predicate acts are relevant. See Cofacredit, 187 F.3d at 242; Schlaifer Nance \u0026 Co. v. Estate of Andy Warhol, 119 F.3d 91, 97 (2d Cir.1997); GICC Capital Corp., 67 F.3d at 466. Where an inherently unlawful act is performed at the behest of an enterprise whose business is racketeering activity, there is a threat of continued criminal activity, and thus open-ended continuity. See H.J. Inc., 492 U.S. at 242- 43 (\"[T]he threat of continuity is sufficiently established where the predicates can be attributed to a defendant operating as part of a long-term association that exists for criminal purposes.\"); see also Cofacredit, 187 F.3d at 242; GICC Capital Corp., 67 F.3d at 466. However, \"where the enterprise primarily conducts a legitimate business, there must be some evidence from which it may be inferred that the predicate acts were the regular way of operating that business, or that the nature of the predicate acts themselves implies a threat of continued criminal activity.\" Cofacredit, 187 F.3d at 243 (citing H.J. Inc., 492 U.S. at 243; GICC Capital Corp., 67 F.3d at 466; Azrielli, 21 F.3d at 521).\n\nFor example, in Beauford v. Helmsley, 865 F.2d 1386 (2d Cir.) (en banc), vacated and remanded, 492 U.S. 914, adhered to on remand, 893 F.2d 1433, cert. denied, 493 U.S. 992 (1989), this Court held that \"allegations that defendants had engaged in a one-time mailing of 8,000 copies of fraudulent documents in connection with a condominium conversion plan was sufficient to plead a pattern of racketeering activity, where there was a basis to infer that similar mailings would occur in the future.\" GICC Capital Corp., 67 F.3d at 466. Similarly, Azrielli v. Cohen Law Offices, 21 F.3d 512 (2d Cir. 1994), held that \"a series of fraudulent sales of securities over at least one year, coupled with the fact that the defendants `apparently ha[d] been trying to continue to sell' securities, permitted a jury to find a RICO pattern.\" GICC Capital Corp., 67 F.3d at 466 (quoting Azrielli, 21 F.3d at 521).\n\nThe Bernas defendants argue that the plaintiffs failed to establish a pattern of open-ended continuity against them, because the alleged scheme by the Bernas defendants to obtain stock and gravel was inherently finite and therefore did not pose a threat of repetition. See Brief of Defendants-Appellants John Bernas, John Bernas, Inc. and JML Quarries, Inc. at 29. We disagree.\n\nThe record reveals sufficient evidence from which a reasonable jury could infer that the nature of the predicate acts committed by the Bernas defendants implied a threat of continued criminal activity. See Cofacredit, 187 F.3d at 242. For example, DeFalco testified that whenever he broached the issues of Bernas not giving away sand and gravel and of sharing the profits of any sales with the plaintiffs, Bernas threatened to get the Town to either stop the project or refuse dedication of the development's roads. DeFalco also testified that, on several occasions, Bernas indicated that, if he didn't sign over the JOBO stock, the project would be scrapped. (T2:202). Although DeFalco ultimately transferred the one-third interest in the JOBO stock to JBI on December 6, 1989, after he did so, Bernas wanted rights to the entire gravel pit and the dedication of the Phase I roads was again called into question. (T2:206). Thus, there was evidence that, even when DeFalco complied with the Bernas defendants' threats, DeFalco faced escalating demands. Indeed, DeFalco testified that Bernas' \"attitude was, if I didn't give him the pit now . . . that we would be closed down. `You haven't seen nothing yet.'\" (T2:236) (emphasis added). Moreover, when the Town of Delaware Planning Board issued a letter requiring DeFalco to satisfy certain uncompleted requirements, there was evidence that DeFalco would need Bernas' approval before the Board would grant final approval for Phase II. See Sullivan County Board of Supervisors Letter from Delaware Supervisor William Dirie to Joe DeFalco dated Mar. 30, 1990 (E:189-90; E:315-16). When DeFalco asked Dirie how he could get Phase II approved, Dirie told him to give Bernas the entire gravel pit. (T2:225). DeFalco never completed Phase II because he refused to comply with the new demand by Bernas to give him all of the JOBO property.\n\nIn short, there was sufficient evidence from which a reasonable jury could conclude that the escalating nature of the Bernas defendants' demands - such as their demanding an increasing interest in the gravel pit - indicated that they had no intention of stopping once they met some immediate goal. Based on this evidence, the jury could reasonably have concluded that the Bernas defendants would have continued extorting the plaintiffs into the future. Accordingly, the scheme was not \"inherently terminable\" and the jury could reasonably have found that the nature of the Bernas' predicate acts themselves implied a threat of continued criminal activity. See Cofacredit, 187 F.3d at 242; see also Azrielli, 21 F.3d at 521 (series of fraudulent sales of securities over at least one year, coupled with the fact that the defendants apparently had been trying to continue to sell securities, permitted a jury to find a RICO pattern).\n\nC. Damages\n\nThis leaves the question of damages. Both Dirie and Bernas argue that the plaintiffs failed to establish with any specificity or certainty any damages proximately caused by the predicate acts they committed. The plaintiffs argue that the jury could reasonably have concluded from the evidence that the plaintiffs' injuries were proximately caused by the defendants' predicate acts and/or their pattern of racketeering activity. They argue that the jury determined the amount of those damages with reasonable specificity. In their cross-appeal, the plaintiffs also argue that the district court improperly vacated the jury's separate award of $1.6 million for additional damages.\n\n1. The Damages from the Predicate Acts\n\nTo compensate plaintiffs for Dirie's predicate acts, the jury awarded $20,251.94 for the value of the services of Harry Fisher; $12,300 for timber and/or firewood extorted for the benefit of Ray Ferber; and $1,000.00 for the truck wheels and tires extorted for the benefit of Dirie's son. See Special Verdict Form, Question 5A at 3-4 (JA:631-32). Dirie claims that the damages awarded are unsupported by the record.\n\nTo compensate plaintiffs for the predicate acts of the Bernas defendants, the jury found that the extortion of sand and gravel by the Bernas defendants caused damages to the plaintiffs in the amount of $250,000. The Bernas defendants argue that the plaintiffs failed to present the jury with a sound basis to establish these damages for the extorted sand and gravel, because the plaintiffs' evidence did not establish the amount of sand and gravel removed or the fair market value of these materials.\n\nAfter trial, the defendants moved, in the alternative, for judgment as a matter of law or a new trial. With the exception of the $1.6 million award discussed above, the district court denied both motions. As a general matter, an appellate court will reverse a trial court's denial of a new trial motion where the denial constitutes an abuse of discretion. See, e.g., Dailey v. Societe Generale, 108 F.3d 451, 458 (2d Cir. 1997); Smith v. Lightning Bolt Prods., Inc., 861 F.2d 363, 370 (2d Cir. 1988). \"This circuit, however, recognizes an exception to this rule: where a district court denies a motion for a new trial made on the ground that the verdict was against the weight of the evidence, such a ruling is not reviewable on appeal.\" \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Dailey, 108 F.3d at 458; see also Robinson v. Cattaraugus County, 147 F.3d 153, 160 (2d Cir. 1998); Stonewall Ins. Co. v. Asbestos Claims Management Corp., 73 F.3d 1178, 1199 (2d Cir. 1995), modified on other grounds, 85 F.3d 49 (2d Cir. 1996).\n\nIt is not entirely clear whether the defendants' motions for a new trial were made on the ground that the evidence supporting the jury verdict was legally insufficient or on the ground that the jury verdict was against the weight of the evidence. See Memorandum and Order dated May 17, 1999 (Brieant, J.) (JA:879-80) (quoted in section II(B)(3) above). It is similarly unclear on appeal whether the defendants challenge the legal sufficiency or the weight of the evidence. See, e.g., Brief of Defendants-Appellants John Bernas, John Bernas, Inc. and JML Quarries, Inc. at 34 (\"Plaintiffs failed to present the jury with a sound basis . . . to establish damages . . . .\"); Brief of Defendant- Cross-Defendant-Appellant-Cross-Appellee William Dirie at 22 (\"The plaintiffs' claim . . . was not supported by the evidence . . . .\"). Either way, we would affirm.\n\nIf the defendants' motion for a new trial and their argument on appeal are construed as a challenge to the weight of the evidence supporting the jury's award, appellate review is unavailable. Stonewall Ins. Co., 73 F.3d at 1199. As this Court explained in Stonewall Ins. Co.:\n\nReview of a trial court's ruling assessing the weight of the evidence imposes on an appellate court far more of a burden than arises from review of a ruling rejecting a challenge to the sufficiency of the evidence. The latter ruling can be readily affirmed as soon as the reviewing court identifies adequate evidence in the record . . . . Such review does not require an assessment of all the evidence. Reviewing a ruling on a \"weight of the evidence\" challenge, however, obliges a reviewing court to examine in some detail all of the evidence. That burdensome review is warranted in the rare case where a trial judge rejects a jury's verdict as against the weight of the evidence . . . but is not warranted in the far more frequent circumstance where a trial judge denies a \"weight of the evidence\" challenge and leaves in place a jury verdict supported by legally sufficient evidence. Id.\n\nWhere a trial judge denies a \"weight of the evidence\" challenge and leaves in place a jury verdict supported by legally sufficient evidence, the loser's only appellate recourse is to challenge the legal sufficiency of the evidence. The loser is . . . entitled to argue to the trial judge that the verdict is against the weight of the evidence and to obtain a new trial if the judge can be persuaded, but the denial of that challenge is one of those few rulings that is simply unavailable for appellate review.Id.\n\nTo the extent that the challenge is one to the legal sufficiency of the evidence, we conclude that, with the exception of the evidence regarding the value of the truck wheels and tires extorted for the benefit of Dirie's son, discussed below, the claim fails. There was at least some evidence supporting all of the remaining damage awards. For example, with respect to the jury's award of $20,251.94 for the value of the services of Harry Fisher, there was evidence that DeFalco hired Fisher as a foreman for the real estate development project, purchased Fisher a new truck in Fisher's son's name, and made the purchase payments on the truck. For Fisher's services, the jury awarded the entire value of the truck that DeFalco purchased. See Vehicle Invoice dated July 28, 1987 from Robert Chevrolet, Inc. (E:7) (\"Total: 20251.94\").\n\nSimilarly, with respect to the jury's award of $12,300 for timber and/or firewood extorted for the benefit of Ray Ferber, DeFalco testified that, following the defendants' suggestions, he permitted Dirie, Fisher and others to cut timber and firewood on the property. When DeFalco granted a logging contract for a certain section of the property to the Walczak Lumber Company for a price of $8800, see (E:129- 30), Dirie insisted that DeFalco cancel the contract and return the check. When DeFalco protested, Dirie told him \"Don't expect to get your approvals at the Planning Board meeting unless it's done.\" (T2:126). DeFalco was further instructed by Tax Assessor Richard Ferber to use his cousin, Ray Ferber, for the logging contract, \"[o]therwise [he was] never going to get approvals.\" (T2:128). DeFalco returned the check and paid an $880 penalty for canceling the contract. (T2:128); (E:132). DeFalco also testified that Ferber started cutting trees in other sections and did not pay him for those trees. (T2:131). Paul Kowalczyk, a consulting forester, testified that the value of the timber that was on the right of way and adjoining lands in the second section was around $2800. (T2:417).\n\nThere was also evidence from which the jury could reach the damages awarded against the Bernas defendants. The documentary evidence before the jury included, for example: (1) the schedule prepared by Bernas to account for the quantity of sand and gravel removed by him from the JOBO gravel pit for the six-month period of January though June of 1989 (E:163-65); (2) the schedule of additional sales of materials by Bernas entitled \"John Bernas Printout as of July 20, 1988,\" (E:166-69); and (3) the letter from Town Engineer Kelly (E:186), which reflected a $70,000 cost for placing an additional four inches of gravel on the roads at Phase II. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nIn addition, the jury heard testimony supporting the damages awarded against the Bernas defendants. For example, John Fink (\"Fink\") who, at the relevant times, worked for the Sullivan County Division of Solid Waste and also owned property across the road from the Top of the World Developments, testified of his observations at the JOBO gravel pit. Fink testified that, in 1988 and 1989, he observed \"many trucks, empty dump trucks, entering the property. They were being filled with sand and gravel and stone, and then driving away to their destinations.\" (T2:380). The markings on the trucks that Fink observed were from the \"Town of Delaware and New York State, Town of Freemont, Town of Rockland, Town of Callicoon. I noticed Town of Manchester and Town of Damacas in Pennsylvania. Those were the municipal trucks. There were many trucks from Mr. Bernas's own construction company, and other private haulers, as well.\" (T2:381). Fink testified that the trucks he observed were steadily going in empty and coming out full. (T2:381).\n\nBernas also testified that he allowed the Town of Delaware to screen material and remove 4,000 to 5,000 cubic yards of sand from the JOBO property using the Town of Delaware's own equipment and without charge to the Town. (T2:525-29, 778) (\"Q: How much sand did the Town of Delaware remove from the gravel pit? A: I would guess four to five thousand yards.\").\n\nJohn Cortese (\"Cortese\"), from the Cortese Brothers Construction Company, which built approximately 800 feet of road at the Top of the World Development, also testified. Cortese stated that, after clearing the area of brush, his company \"put down the base, [and] put down a foot of gravel.\" (T2:405). The base of the road included \"bank gravel, 28 feet wide.\" Id. Cortese testified that the Town of Delaware required 12 inches of bank gravel on its roads. Id. Cortese obtained the materials to build the 800 feet of road from Joe DeFalco. Id. He built the 800 feet of roads for $9600 and that the cost per mile of roads with 12 inches of gravel in the Town of Delaware was approximately $60,000 a mile. (T2:406-07). Cortese also testified that, during the time period when he was doing work at the plaintiffs' development he sold gravel from his own gravel pit to others in Sullivan County. (T2:409). The price Cortese received \"was three or three-fifty a yard.\" (T2:409).\n\nIn light of this evidence, any claim by the defendants that the evidence was legally insufficient to support the awards of $20,251.94 for the value of the services of Harry Fisher, the $12,300 for timber and/or firewood extorted for the benefit of Ray Ferber, and the $250,000 for extorted sand and gravel is without merit. There was sufficient evidence to sustain these awards, and weighing that evidence was a matter for the jury.\n\nThe only exception is the $1,000.00 awarded for the truck wheels and tires extorted for the benefit of Dirie's son. The plaintiffs, providing no record citation, argue that \"[t]he jury, having found that Dirie extorted the truck wheels and tires from DeFalco, were perfectly reasonable in adopting DeFalco's testimony that the same were valued at $1,000.00. It is that amount that they awarded and the award should not be disturbed.\" Brief of Plaintiffs-Appellees-Cross-Appellants at 42.\n\nWith respect to the truck wheels and tires extorted for the benefit of Dirie's son, DeFalco testified as follows:\n\nQ: Now, around that time, Mr. DeFalco, did there come a time when an incident occurred regarding a truck and some tires that you had on the truck?\n\nA: Yes.\n\nQ: Please tell the jury about that.\n\nA: I had a 1984 Ford that I was using personally up there. When I bought it, I took the tires off and put big tires on. And somebody wanted the four tires and wheels. They were brand new, no mileage on them. And I had the truck parked by the office. And Bill Dirie's son had the same kind of truck.\n\nAnd Dirie came down and asked me what am I doing with these four tires. I said I'm selling them.\n\nHe said: \"You just sold them to my son. He needs tires,\" something similar to that. \"Give them to my son.\"\n\nAnd I looked at him. And Fisher - like I walked away. And Fisher came up to me and said: \"You know, it's Bill Dirie, man. We need this guy. The Planning Board, the houses are going up.\" You know it was always the same story: Go along with it. Go along with it.\n\nQ: Did Mr. Dirie bring his son over to the truck at that point?\n\nA: Yeah. This [sic] son came over to the truck and took the four tires and wheels.\n\nQ: Did you hear Mr. Dirie say anything to his son at that point?\n\nA: I believe he said, \"It's a present for you.\" (T2:152-53).\n\nWe have been unable, however, to find any evidence regarding the value of the truck wheels and tires that the jury found Dirie extorted for his son, and the plaintiffs have pointed us to none. Indeed, the only reference in the record to the value of the tires appears to be from counsel's closing argument, in which he stated: Remember the testimony about the truck tires that Dirie told DeFalco to give to his son? If you believe DeFalco that he had the tires sold for $1,000, that is an easy calculation. (T2:1152).\n\nGiven the complete lack of evidence regarding the value of the truck wheels and tires, the record is legally insufficient to sustain the jury's award. Because we have been unable to find - and the plaintiffs have failed to provide citation to - any evidence in the record establishing the value of the truck wheels and tires, we vacate that $1,000 award.\n\n2. The Vacated $1.6 Million Award\n\nIn their cross-appeal, the plaintiffs assert that the District Court erred in its determination that \"there [wa]s simply insufficient credible evidence of any kind of damages directly flowing from the predicate acts that the jury found, other than those found in the separate interrogatories regarding damages for those predicate acts\" to support the additional $1.6 million award. (JA:880). The plaintiffs claim that \"the jury's verdict as to enterprise damages was supportable by the record below and, as such, should not have been reversed by the trial court.\" Brief of Plaintiffs-Appellees-Cross-Appellants at 45.\n\nThe plaintiffs point to the following testimony of DeFalco, which they claim sets forth a reasonable basis for a finding of proximate cause with respect to the $1.6 million award:\n\nQ: From the day that you refused to give Mr. Bernas the gravel pit to today, Mr. DeFalco, have you been able to proceed with the project?\n\nA: The project has been closed.\n\nQ: Have you received - Since the day you refused to give Mr. Bernas the gravel pit, have you received a single approval or permit from the Town of Delaware?\n\nA: No, sir.\n\nQ: Have you made a single dime from Phases 2, 3 or 4 since then?\n\nA: No, sir.\n\nQ: Were it not for the actions of Mr. Bernas, Mr. Dirie, Mr. Rouis and the others that you described during your testimony, would you have completed the Top of the World Project?\n\nA: I think Top of the World could have been sold out in one year if it had been done. Brief of Plaintiffs-Appellees-Cross-Appellants at 46 (citing (T2:245)).\n\nThe plaintiffs also argue:\n\nDeFalco testified . . . that Phase I of the plaintiff's [sic] development (which sold out virtually overnight) made very little profit because of the cost of acquisition of the property, the erection of a sales office, putting up electric poles, etc., and that (because all of those costs had already been incurred) the sale of lots in Phase II would be pure profit. (T2:218-19). Since there would have been 50 available lots in Phase II (T2:219), and since each lot was selling for between $40,000 and $60,000 per lot (T2:218), the plaintiffs would have received profits of between $2 million and $3,000,000. Thus, the jury's determination of $1,600,000 (exactly 20% less than the lower profit figure) is clearly supportable. Brief of Plaintiffs-Appellees-Cross-Appellants at 47 (footnotes omitted).\n\nThe private right of action provision of RICO provides that:\n\nAny person injured in his business or property by reason of a violation of section 1962 of this chapter may sue therefor in any appropriate United States district court and shall recover threefold the damages he sustains and the cost of the suit, including a reasonable attorney's fee. 18 U.S.C. § 1964(c).\n\n\"`The phrase \"by reason of\" requires that there be a causal connection between the prohibited conduct and [the] plaintiff's injury.'\" County of Suffolk v. Long Island Lighting Co., 907 F.2d 1295, 1311 (2d Cir. 1990) (quoting Norman v. Niagara Mohawk Power Corp., 873 F.2d 634, 636 (2d Cir. 1989)). To show that an injury resulted \"by reason of\" the defendant's action, a plaintiff must show \"`that the defendant's violations were a proximate cause of the plaintiff's injury, i.e., that there was a direct relationship between the plaintiff's injury and the defendant's injurious conduct.'\" First Nationwide Bank v. Gelt Funding Corp., 27 F.3d 763, 769 (2d Cir. 1994) (quoting Standardbred Owners Ass'n v. Roosevelt Raceway Assocs., L.P., 985 F.2d 102, 104 (2d Cir. 1993)); see also Holmes v. Securities Investor Protection Corp., 503 U.S. 258, 268 (section 1964(c) requires plaintiff to establish proximate cause). This requires a showing \"not only that the defendant's alleged RICO violation was the `but-for' or cause-in- fact of his injury, but also that the violation was the legal or proximate cause.\" First Nationwide Bank, 27 F.3d at 769 (citing Holmes, 503 U.S. at 265-69; Standardbred Owners, 985 F.2d at 104; Hecht v. Commerce Clearing House, Inc., 897 F.2d 21, 23 (2d Cir. 1990)). In other words, a plaintiff's injury must be both factually and proximately caused by a defendant's violation of section 1962. See, e.g., In re American Express Co. Shareholder Litigation, 39 F.3d 395, 399 (2d Cir. 1994) (plaintiff's injuries must be \"both factually and proximately caused by the alleged RICO violation\"); Hecht, 897 F.2d at 23 (\"By itself, factual causation (e.g., `cause in fact' or `but for' causation) is not sufficient\"); Sperber v. Boesky, 849 F.2d 60, 63 (2d Cir. 1988) (RICO \"liability should not extend as far as factual causation.\").\n\nEven assuming arguendo that a plaintiff may recover for injuries caused by the operation of a RICO enterprise, in addition to injuries caused by discrete unlawful predicate acts, we see no error in the District Court's ruling that the plaintiffs failed to prove that the defendants' conduct caused the losses they claimed with respect to subsequent phases of the development project. The plaintiffs failed to satisfy the proximate cause requirement with respect to those claimed damages, because there was insufficient evidence that the plaintiffs would have been able to sell the Phase II lots even in the absence of the defendants' wrongful conduct. Phase II was conditionally approved pending work that still needed to be done on the roads. The record does not permit a reasonable jury to find that plaintiffs' inability to sell the Phase II lots substantially resulted from their inability to obtain further permits and approvals from the Town. DeFalco's mere belief that the plaintiffs would have completed the Top of the World project were it not for the defendants' actions is not sufficient.\n\nTo prove proximate causation, the plaintiffs would have had to offer evidence that they were otherwise entitled to approval of Phase II and that no independent, intervening factors affected their ability to sell the lots. \"[T]he less direct an injury is, the more difficult it becomes to ascertain the amount of the plaintiff's damages attributable to the violation, as distinct from other, independent factors.\" Holmes, 503 U.S. at 269. \"The key reasons for requiring direct causation include avoiding unworkable difficulties in ascertaining what amount of the plaintiff's injury was caused by the defendant's wrongful action as opposed to other external factors, and in apportioning damages between causes.\" First Nationwide Bank, 27 F.3d at 770. As this Court stated in First Nationwide Bank:\n\n[W]hen the plaintiff's loss coincides with a marketwide phenomenon causing comparable losses to other investors, the prospect that the plaintiff's loss was caused by the fraud decreases . . . . [The plaintiff's] loss, coupled with the concurrence of that loss with the real estate market crash, is additional support for the conclusion that the fraud was not a substantial cause of [the plaintiff's] injury. Id. at 772.\n\nThus, even were we to accept the plaintiffs' \"enterprise damages\" theory, under this Court's RICO precedents, the causal link between the plaintiffs' evidence and the inability to sell the Phase II lots is too weak to satisfy the proximate causation requirement. Thus, the District Court was correct in vacating the $1.6 million award.\n\nD. Dismissal of the Claim Against William Rosen\n\nIn their cross-appeal, the plaintiffs claim error in the District Court's dismissal of the case against William Rosen. On October 17, 1996, reviewing the plaintiffs' second amended complaint, the District Court dismissed the action against William Rosen for failure to state a claim upon which relief could be granted. (JA:285-303). The District Court concluded, based on the Supreme Court's decision in Central Bank of Denver v. First Interstate Bank, 511 U.S. 164 (1994), that RICO does not provide for aider-and-abettor liability. The District Court concluded that the plaintiffs' second amended complaint stated only an aider-and-abettor claim against Rosen and, accordingly, dismissed the action against him.\n\nThe plaintiffs do not challenge the District Court's conclusion that there is no cause of action for aider-and-abettor liability under RICO. Rather, they argue that the complaint stated a \"direct claim\" against Rosen. We disagree.\n\nIn the \"defendants\" subsection of the second amended complaint, plaintiffs allege that Rosen used his power and influence as Town and County Attorney \"in furtherance of the conspiracy described herein and aided and abetted the defendants in their extortionate obtainment of money and property belonging to the plaintiffs.\" (JA:222) (emphasis added). \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Moreover, in the section alleging each defendant's predicate acts, the first act charged against Rosen states that he \"aided and abetted the defendants in their extortionate scheme . . . [and] rendered substantial assistance to the defendants . . . .\" (JA:270) (emphasis added). The second act charged relates to disclosures that Rosen allegedly failed to make in connection with certain covenants on an adjacent parcel upon which the defendants threatened to build a garbage facility. (JA:271). Although those allegations do not expressly include \"aider and abettor\" language, earlier in the complaint all of Rosen's actions are described as being in aid of the enterprise. Thus, all of Rosen's acts were pled as aiding the alleged RICO enterprise and the District Court properly dismissed the claim against Rosen.\n\nE. Vacating the First Jury Verdict and the October 15, 1998 Order\n\nIn their cross-appeal the plaintiffs also argue that the District Court improperly vacated the jury award following the first trial. In that decision, the District Court held that there was insufficient evidence for the trier of fact to have concluded that the predicate acts found to have been committed by Rouis and Curtis were the proximate cause of harm to the plaintiffs' business or property. With respect to Dirie and the Bernas defendants, however, the Court concluded that the proof of damages adduced at trial was too speculative and imprecise to support the damages awarded by the jury and, because the issues of damages and liability were inextricably intertwined, Dirie, Bernas, JML and JBI were entitled to a new trial on both liability and damages.\n\nAs noted above, a district court's decision on a motion for judgment as a matter of law is reviewed de novo, applying the same standards as the district court to determine whether judgment as a matter of law was appropriate. See, e.g., Merrill Lynch, 155 F.3d at 120.\n\nWe find no error in the District Court's ruling on the defendants' motions for judgment as a matter of law following the first trial. For the reasons set forth in detail by the Court in DeFalco v. Dirie, 978 F. Supp. 491 (S.D.N.Y. 1997), quoted in the procedural history section above, we affirm that decision.\n\nThe plaintiffs also argue that the District Court improperly precluded them from offering any evidence at the second trial regarding damages from the aborted sales of the property. For the reasons set forth in the District Court's October 15, 1998 order and in its opinion of September 26, 1997, this Court agrees that such evidence was properly excluded as too speculative and conjectural. We will not disturb the District Court's determination that the probative value of the proffered evidence was substantially outweighed by its prejudicial effect. Fed. R. Evid. 403.\n\nIV. CONCLUSION\n\nWe have considered the parties' remaining contentions and find them to be without merit. Accordingly, we VACATE the $1,000.00 award against Dirie for the truck wheels and tires extorted for the benefit of Dirie's son, but AFFIRM the judgments of the District Court in all other respects.\n\n\u003cspan class=\"fn\"\u003e1. Stefan R. Underhill, United States District Judge for the District of Connecticut, sitting by designation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Record references will recite the volume and page number. For example, the reference \"(T2:71)\" is to the Transcript volume from the second trial at page 71. Similarly, \"(T:40)\" references the Transcript from the first trial at page 40; \"(E:9)\" references the Exhibit volume at page 9; \"(JA:880)\" references the Joint Appendix at page 880.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Fisher himself testified to this arrangement. In lieu of getting paid money on the books, he was to get a truck, purchased in his son's name, on which DeFalco would make the payments. (T2:560); see also (E:9).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. See also Letter from James E. Glavin to Joe DeFalco dated Aug. 20, 1987 (\"This is an exciting project and should be of mutual benefit to you and the Town of Delaware. I think that we can be of sincere help to you in charting a smooth course through the regulatory agency maze.\") (E:13); and separate Letter from James E. Glavin to Joe DeFalco dated Aug. 20, 1987 (\"This is in the form of a report covering my conference of August 19, 1987 with Planning Board Chairman Ed Curtis in regard to questions that must be addressed relative to the Top of the World Estates. Ed Curtis laid his cards squarely on the table. He would like this process to be a smooth and fruitful one for Top of the World Estates and the Town.\") (E:14). See also Letter from Joe DeFalco to Ed Curtis at Curtis Nurseries dated Sept. 18, 1987 (E:120) (\"I have done a tremendous amount of work in reference to this project and have followed every piece of advice you ever gave me.\"); and Letter from V. Edward Curtis on Curtis Nurseries, Inc. Letterhead to Joe DeFalco dated Sept. 23, 1987 (E:122) (\"I recognize that you have done everything that we have suggested with regard to your project, and I so stated at the Planning Board meeting on the 16th . . . . I think it is important to consider the activities at the public hearing, which will have a great bearing on the next step in your project. As I understand it, you have engaged some excellent professional people . . . . I think if they do their homework, they will be able to satisfy the concerns of the various parties at the public hearing. It will be our job, to decide if the concerns of the public have been resolved, or that further work will have to be done.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Steppich's personal log contained several other references to issues regarding DeFalco and Top of the World. See, e.g., (E:81) (\"SAW ED CURTIS; DISCUSSED TOP OF WORLD - NO MORE PERMITS.\"); (E:82) (\"MEETING WITH ED CURTIS ABOUT SITUATION AT TOP OF WORLD. WILL WAIT FOR ROSEN'S ADVICE ABOUT FURTHER ACTION.\"); (E:83) (\"MEETING IN LIBERTY OFFICES OF LEON GREENBERG ABOUT JOE DEFALCO - IN ATTENDANCE WERE LEON GREENBERG, BILL ROSEN, JOE DEFALCO, TERRANCE KELLY, ED CURTIS, AN ASSOC OF KELLY \u0026 MYSELF. . . . MR GREENBERG I HOPE FINALLY GOT IT THRU DEFALCO THAT HE NEEDS THE PERMIT BEFORE PROCEEDING, NOT AFTER.\"); (E:86) (\"BILL DIRIE \u0026 I MET WITH BILL ROSEN THIS AM [sic]. I MUST CITE TOP OF WORLD SPECIFICALLY WITH VIOLATIONS. ALSO WE ARE NOT TO COMMUNICATE AT ALL WITH JOE DEFALCO. ONLY IN WRITING - NOT PERSONALLY OR OVER PHONE.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Roger Wehr (\"Wehr\"), who was employed in the Sullivan County Department of Public Works and was ultimately appointed Commissioner of that Department on the recommendation of Paul Rouis, testified that Bernas received special treatment from the County. (T2:490-94). Wehr further testified that, when the County needed to select a site for a garbage transfer station, one of the sites selected for consideration was immediately adjacent to the Top of the World Development (T2:494-95), \"to get even with Joe DeFalco.\" (T2:498-99).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. See, e.g., Letter from Joe DeFalco to John Bernas dated Nov. 7, 1989 (E:360) (\"We would like to have a breakdown on how much of the gravel and fill was used for Top of The World and all records of sand that was given away to towns free-of-charge and what was sold on your computer. As per our discussion with Paul Rouis, we are hiring an engineer to determine what sand and gravel was taken out of the pit since you opened it. We also requested from him, what he feels was used for roads and fills at Top of The World Estates. I discussed this with Bobby Brown, Paul Rouis and the people that are interested in buying the pit. Everyone agrees that they would like to know what has come out of the pit so far.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. DeFalco testified that Bernas gave him a handwritten note as his accounting of the gravel pit through 1989. (T2:171); see also Pl.'s Ex. 48 (E:163-69). Highway Superintendent Lahm testified that, according to Bernas, they did not need to keep records of the materials removed by the Town of Delaware from the JOBO gravel pit. (T2:528).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Lloyd Heller, successor to Dirie and Supervisor of the Town of Delaware from January 1992 to December 1993, testified that, after he became Supervisor, the Town Board of Assessment Review decided to reduce the taxes for Top of the World, pursuant to a petition filed by DeFalco. After the Board of Assessment Review had issued a written decision, but before the decision had been mailed out, a meeting was called between the Town Board and the Board of Assessment Review. Following that meeting, the decision was revoked and the assessments were reinstated. The Town Board, Tax Assessors and Town Council members have no supervisory power over the Board of Assessment Review. No minutes were kept of that meeting, nor was any roll call taken. (T2:346-51). Walter Roemer, former Chair of the Board of Assessment Review also testified to these events and testified that he resigned that day. (T2:357-69). There was also testimony by Tax Assessor Richard Ferber that, notwithstanding that the Town Supervisor and the Town Board had no role in tax assessments, there were several conversations with Dirie and others, off the record and outside of official Town Board meetings, regarding the Top taxes. (T2:614-19). By 1992, the tax issues led DeFalco to bring an Article 78 proceeding in state court seeking the removal from office of Tax Assessor Meckle, Tax Assessor Ferber and the following members of the Town Board: Gerald Doetsch, William Diehl, Michael Henke and Carl Rosenberger. In a \"Memorandum and Judgment\" dated October 20, 1994 (\"Decision\"), the Appellate Division of the New York Supreme Court, Third Department, dismissed the petition against Meckle, Henke and Rosenberer as moot because they no longer held public office and any findings would not necessarily be a bar to re-election. See Decision at 2, Pl.'s Ex. 78 at E:199. With respect to Doetsch, Diehl and Ferber, however, the Court found \"a pattern of intentional and reckless wrongdoing, breach of trust and abuse of authority sufficient to warrant the relief requested in the petition.\" See id. The Court found that the three \"improperly attempted to, and did in fact, influence the Town Board of Assessment Review to alter certain decisions it had made, after considering the owners' grievances, with respect to properties in petitioner's development.\" Id. at 3, Pl.'s Ex. 78 at E:200. The Court further found that Ferber had made some handwritten \"`red ink' changes to the tentative [tax] assessment roll after May 1, 1991, without following the procedure set forth in RPTL 552, despite having been informed that it was improper to do so.\" Id. (citation omitted). The Court found that, in a \"flagrant abuse of . . . power,\" \"Ferber and Diehl engaged in inexcusable self-dealing, by deliberately adjusting . . . preliminary values . . . so that their own properties, and those of their friends and relatives, were ultimately assessed well below market value, while the properties in petitioner's development were assessed at a level that was undeniably above market value.\" Id. The Court also decried \"several meetings of the Town Board that were held in private, without notice, and for which no minutes were kept.\" Id. The Court therefore ordered that Diehl, Doetsch and Ferber be removed from office. Id. at 4, Pl.'s Ex. 78 at E:201; see also (T2:627-31).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. As noted above, Dirie suggested that DeFalco buy a new pickup truck for Fisher and place the title in the name of Harry Fisher's son. The evidence presented indicated that the truck cost $20,251.91.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The Court also ordered that \"DeFalco shall recover from defendant William Dirie the sum of $27,042.93 for legal fees and disbursements,\" and that \"DeFalco shall recover from John Bernas, John Bernas, Inc. and JML Quarries, Inc. jointly and severally the sum of $228,079.08 for legal fees and disbursements.\" See Final Judgment dated May 17, 1999 (JA:875).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Judge Brieant also ruled that, upon deposit of security in the total amount of $250,000 and the surrender of title to the JOBO stock in escrow, the final judgment would be stayed against all defendants pending appeal. In establishing a bonding requirement of about one-quarter of the total money judgment against the Bernas defendants, the Court stated that it was \"not prepared to say that the validity of the judgment on appeal is free from doubt. The presumptive viability of an appeal is always a point to be considered in granting a stay pending appeal, and here weighs in favor of granting a stay.\" See Memorandum and Order dated May 17, 1999 (Brieant, J.) (JA:882-83).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The Bernas defendants do not argue this point and concede that \"Judge Parker properly held prior to trial that a governmental unit or municipal subdivision qualifies as an `enterprise' within the meaning of RICO, 18 U.S.C. § 1961(4).\" See Brief of Defendants-Appellants John Bernas, John Bernas, Inc. and JML Quarries, Inc. at 37-38 (citing DeFalco v. Dirie, 923 F. Supp. 473, 477 (S.D.N.Y. 1996) (\"The Town of Delaware falls within the enterprise definition and Defendants do not dispute this.\")).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. As noted in section II(A) above, Steppich wrote in his personal log: \"Called Kathy at Top of the World. Told her no more building permits to be issued until I got an okay from Bill Dirie and Ed Curtis.\" (T2:338- 39).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. As noted in Section II(A) above, Roger Wehr, who was employed in the Sullivan County Department of Public Works and was ultimately appointed Commissioner of that Department, also testified that Bernas received special treatment from the County. (T2:490-94).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. See also (T2:226-27) (\"Q: Was John Bernas's approval necessary for the completion of Phase 2, to your knowledge, Mr. DeFalco? A: John Bernas is not an official, but I said it a hundred times, they controlled each other.\"); Letter from Joe DeFalco to John Bernas, Inc. dated May 8, 1990 (\"You have proved your point, that John Bernas, Inc. has a lot of influence and control over the Town of Delaware.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Although the thrust of Bernas' argument regarding the Reves operation or management test is that the plaintiffs failed to establish that the Bernas defendants operated or managed the Town of Delaware, Bernas makes passing reference that it was \"plain error to instruct the jury that it could find the requisite control by the Bernas Defendants over the Town of Delaware based merely on evidence of `friendships.'\" See Brief of Defendants-Appellants John Bernas, John Bernas, Inc. and JML Quarries, Inc. at 43. The Bernas defendants put forth no objection to the charge. See Fed. R. Civ. P. 51 (\"[n]o party may assign as error the giving or the failure to give an instruction unless that party objects thereto before the jury retires to consider its verdict, stating distinctly the matter objected to and the grounds of the objection.\"); see also Fogarty v. Near North Ins. Brokerage, Inc., 162 F.3d 74, 79 (2d Cir. 1998) (\"A party who fails to object to a jury instruction at trial waives the right to make that instruction the basis for an appeal.\"). Under these circumstances, the instructions are reviewed for \"fundamental error,\" which \"is narrower than the plain error doctrine applicable to criminal cases.\" Travelers Indem. Co. v. Scor Reinsurance Co., 62 F.3d 74, 79 (2d Cir. 1995). Fundamental error is limited to \"an error so serious and flagrant that it goes to the very integrity of the trial.\" Id. (quoting Modave v. Long Island Jewish Med. Ctr., 501 F.2d 1065, 1072 (2d Cir. 1974)). To qualify as a fundamental error a jury charge must have \"deprived the jury of adequate legal guidance to reach a rational decision.\" Travelers Indem. Co., 62 F.3d at 79 (quoting Werbungs v. Collectors' Guild, Ltd., 930 F.2d 1021, 1026 (2d Cir. 1991)). Although the language of the jury instruction is not ideal, we have considered and rejected Bernas' argument. The allegedly erroneous instruction was coupled with a clear statement of the Reves requirement that each defendant must be found to have participated in the operation or management of the enterprise. The charge did not say that friendship, in and of itself, was sufficient to establish control. Under the charge given, the jury still had to conclude that each defendant actually exerted control over the enterprise. Accordingly, we do not find an error \"so serious and flagrant that it goes to the very integrity of the trial,\" or one that \"deprived the jury of adequate legal guidance to reach a rational decision.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The jury specifically found that Dirie: (1) \"[e]xtorted from plaintiffs the value of the services of Harry Fisher;\" (2) \"[e]xtorted from plaintiffs timber and/or firewood for the benefit of William Dirie;\" (3) \"[e]xtorted from plaintiffs timber for the benefit of Ray Ferber;\" (4) \"[e]xtorted from plaintiffs one-third of the shares of JOBO Associates, Inc., for the benefit of John Bernas, Inc.;\" and (5) \"[e]xtorted from plaintiffs truck wheels and tires for the benefit of William Dirie's son.\" See Special Verdict Form, Question 4 at 2 (JA:630); (T2:1201).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The five racketeering acts charged against Dirie in the complaint were set forth as violating the Hobbs Act and certain New York extortion and penal statutes. See, e.g., Brief of Defendant-Cross-Defendant- Appellant-Cross-Appellee William Dirie at 13.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The jury, answering special interrogatories, was asked to determine whether John Bernas and John Bernas, Inc. had \"[e]xtorted from plaintiffs a construction contract to build Top of the World Phase I roads;\" \"[e]xtorted from plaintiffs one-third of the shares of JOBO Associates, Inc.;\" and \"[e]xtorted from plaintiffs sand and/or gravel from the JOBO gravel pit.\" (JA:630-31); (T2:1201-02). As to defendant JML Quarries, Inc., however, the jury was only asked whether JML had \"extorted from plaintiffs sand and/or gravel from the gravel pit.\" (JA:631). On its face, therefore, the verdict might appear to include but a single predicate act by JML. None of the parties has raised this as an issue nor did any object to the verdict sheet. See (T2:1044-64). As noted above, the requirements of section 1962(c) must be established as to each individual defendant. See United States v. Persico, supra, 832 F.2d at 714. Under Rule 49(a) of the Federal Rules of Civil Procedure, however, a party who failed to object, before the jury retired, to the substance of special verdict questions to be put to the jury has no right to object to such matters on appeal. See, e.g., Metromedia Co. v. Fugazy, 983 F.2d 350, 363 (2d Cir. 1992); Bohack Corp. v. Iowa Beef Processors, Inc., 715 F.2d 703, 710 n.8 (2d Cir. 1983). In any event, to the extent that the Special Verdict Form creates an issue whether two predicate acts were found by the jury with respect to JML, the Court treats the finding that JML \"extorted from plaintiffs sand and/or gravel from the gravel pit\" to include multiple acts of extortion from the plaintiffs of sand and gravel or, alternatively, acts in the conjunctive (i.e., that JML \"extorted from plaintiffs sand and[] gravel from the gravel pit.\"). \"Where there is a view of the case that makes the jury's answers to special interrogatories consistent, they must be resolved that way.\" Atlantic \u0026 Gulf Stevedores, Inc. v. Ellerman Lines, Ltd., 369 U.S. 355, 364 (1962). The defendants do not suggest any error in the instruction that, in order to find a pattern as to any given defendant, the jury must find that that defendant committed at least two acts of racketeering activity. In response to Question 3, the jury found that JML \"conducted or participated in the conduct of the affairs of the Town of Delaware through a pattern of racketeering activity.\" Interpreting the finding that JML extorted from plaintiffs sand and/or gravel from the gravel pit to include multiple acts of extortion, or alternatively, acts in the conjunctive is appropriate because it harmonizes the jury's findings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. We would reach the same result even were we to apply plain error analysis. Because the district court's charge, when read as a whole, included the idea that the use of fear of economic loss is wrongful when it is used to obtain property to which one is not entitled, there was no plain error. Moreover, any error in the charge was harmless because we are persuaded that the jury would nonetheless have found that the Bernas defendants extorted from plaintiffs one-third of the shares of JOBO and extorted from plaintiffs sand and/or gravel from the JOBO gravel pit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. See also Brief of Plaintiffs-Appellees-Cross-Appellants at 38 n.29 (\"[W]hen DeFalco instructed Bernas to stop giving away free sand to Dirie, Bernas directed Dirie to halt the dedication process for the roads at the plaintiff's [sic] development. (T2:165-66). When DeFalco confronted Bernas about that, Bernas instructed DeFalco to either allow him to remove sand and gravel, or the roads at plaintiff's [sic] development `would never be dedicated.' (T2:166). Similarly when DeFalco asked Bernas to close down the entire gravel pit, Bernas had Rouis instruct DeFalco to `sit tight and back off.' (T2:174-75).\" (Emphasis in original). The record references relate to the same time period noted above - December 1988.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. As noted above, the requirements of section 1962(c) must be established as to each defendant. See Persico, 832 F.2d at 714. Accordingly, regardless of the point in time at which the plaintiffs allege the overall extortion began, to determine whether the plaintiffs satisfied the requisite period of closed-ended continuity for the Bernas defendants, the duration of the pattern of racketeering activity must be measured by the RICO predicate acts that the jury found the Bernas defendants committed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. This rule applies with equal force to weight-of-the-evidence motions challenging the jury's finding of liability and to such motions challenging the size of a verdict. See Lightfoot, 110 F.3d at 910 (defendants may not obtain review of the denial of a new trial on the ground that the jury's damage award was against the weight of the evidence); Haywood v. Koehler, 78 F.3d 101, 104 (2d Cir. 1996) (refusing to review weight-of-the-evidence challenges to both liability and damages findings); 11 Charles A. Wright, Arthur R. Miller \u0026 Mary Kay Kane, Federal Practice and Procedure § 2807 (2d ed. 1995) (describing grant of new trial based on verdict size being against the weight of the evidence as \"merely a special application of the general power of the trial court to set aside a verdict that is against the weight of the evidence\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. We do not rely on Exhibit 50, an \"Accounting Headed JML Quarries, Inc. Bearing Fax Date of August 4,1989.\" See Exhibit Volume at iv; see also (E:170-71). Although this item was marked for identification and shown to DeFalco by his attorney (T2:178), it was not offered or received into evidence at the second trial. Accordingly, the jury could not have used the quantity, amounts charged and payments received that are reflected in that document as a basis for its award.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. As noted above, with respect to RICO, the plaintiffs proceeded solely under section 1962(c) and made no conspiracy claim pursuant to section 1962(d). See (JA:62).\u003c/span\u003e\n\n",
    "body_length": 150764,
    "citedas": [
      "244 F.3d 286"
    ],
    "attorneys": "Michael L. Levine, The Law Firm of MichaelLevine, P.C., Scarsdale, NY for Plaintiffs-Appellees-Cross-Appellants. James J. Harrington, Harrington Henry Llp, New York, NY for Defendant-Cross- Defendant-Appellant-Cross-Appellee William Dirie and for Defendant-Cross-Defendant- Cross-Appellee V. Edward Curtis. Martin J. Schwartz, Rubin Baum Levin Constant \u0026 Friedman, New York, NY and Max Wild, Liberty, NY for Defendants- Appellants-Cross-Appellees John Bernas, John Bernas, Inc. and Jml Quarries, Inc. and for Defendant-Cross-Appellee Paul Rouis. Lawrence S. Goldman, Goldman \u0026 Hafetz, New York, NY for Defendant-Cross-Defendant- Cross-Appellee William Rosen.",
    "category": [
      "243",
      "251",
      "252",
      "213"
    ],
    "judges": "Before: Kearse and Sack, Circuit Judges, and Underhill, DistrictJudge. *fn1",
    "citation_count": 280
  }
}
