{
  "id": "xc1fYWYBTlTomsSBNFoz",
  "document": {
    "title": "Washington Local Lodge No. 104 of International Brotherhood of Boilermakers v. International Brotherhood of Boilermakers",
    "full_title": "WASHINGTON LOCAL LODGE NO. 104 OF THE INTERNATIONAL BROTHERHOOD OF BOILERMAKERS, IRON SHIP BUILDERS AND HELPERS OF AMERICA ET AL. v. INTERNATIONAL BROTHERHOOD OF BOILERMAKERS, IRON SHIP BUILDERS AND HELPERS OF AMERICA ET AL. AND CROSS-APPELLANTS, SEATTLE-FIRST NATIONAL BANK ET AL.",
    "jurisdiction": "Washington Supreme Court",
    "date": "1949-02-21T00:00:00.000Z",
    "docket": "No. 30485",
    "body": "This is an action for injunctive relief, instituted by Washington Local Lodge No. 104 of the International Brotherhood of Boilermakers, Iron Ship Builders and Helpers of America, and Edward R. Hanson, Archie Collins, and T. A. Norgord, who allege that they are members\n\nof Lodge No. 104, and that they joined in the action against the parent organization on their own behalf and on behalf of all members of Lodge No. 104, who are too numerous to be made parties plaintiff. The defendants are the International Brotherhood and its president, Charles J. MacGowan, its vice-president William Williams, and several other officers, and two local banks in which Lodge No. 104 deposits its funds.\n\nSo many pleadings and affidavits, with long, typewritten exhibits attached, were filed in this cause that the transcript of record, certified by the King county clerk, consists of two hundred thirty pages. The original complaint was filed on February 24, 1947. It will not be outlined at this point, as the cause was finally tried on a second amended complaint.\n\nThe filing of the complaint on February 24th was accompanied by a motion for an order requiring the defendants to show cause why a temporary restraining order should not be granted. The defendants were ordered to appear and show cause on March 4, 1947. The defendants' return to the order was largely by voluminous affidavits which were, in part, denied by affidavits filed on behalf of plaintiffs. On March 21, 1947, a temporary injunction was granted by the superior court, the material part of which will be quoted, since it throws much light upon the nature of the controversy:\n\n\". . . and it appearing to the court that since the issuance of said order to show cause the affidavits of Nick Hughes, William Miller, Angus MacKenzie and Joe Clancy, all members of plaintiff Local 104, have been filed herein setting forth that on or since February 24, 1947, they have been summarily suspended from membership by the president of defendant International Brotherhood of Boilermakers and the Court having read and considered the plaintiffs' complaint herein and the affidavit of plaintiff Archie Collins in support of the motion of plaintiffs for an order to show cause, the affidavits of the defendants Homer Parrish and Walter B. Toner in support of their return to said order to show cause, and it appearing therefrom and from the files and records herein that on or about the 20th day of February, 1947, the defendant Charles J. MacGowan,\n\nthe President of defendant Brotherhood, without notice, charges, trial or other opportunity to be heard, suspended all of the duly elected, qualified and acting officers of plaintiff Lodge 104, suspended all meetings of said Lodge, appointed a so-called Governing Board for said Lodge with the defendant Homer Parrish, a representative of the defendant Brotherhood, as its chairman, and defendant Walter B. Toner, as its vice-chairman, appointed officers pro tem for Lodge 104, instructing them to take under their control all of the funds, property, books and records of Lodge 104, demanded that the officers of said Lodge deliver to said officers pro tem said funds, property, books and records, together with all indicia of office, and simultaneously instructed defendant banks to honor checks drawn on the accounts of Lodge 104 only when signed by such officers as are designated for that purpose by said Governing Board and not to honor any checks drawn on said accounts by the duly elected officers of Lodge 104; and said Governing Board having on the same day suspended the publication of the weekly newspaper of Lodge 104, known as 104 Reporter; it further appearing that unless the defendants are restrained they will wrongfully and unlawfully seize control of Lodge 104 from its duly elected officers and they will seize and deprive it of its funds, property, books and records, and that the plaintiffs have no plain, speedy or adequate remedy in the ordinary course of law; and it further appearing that Walter B. Toner and Joe Clancy are, respectively, the duly elected, qualified and acting President and Secretary-Treasurer of Lodge No. 104, whose duty it is under the constitution of said Lodge jointly to pay all orders and sign all checks drawn against the bank accounts of Lodge No. 104, after the same shall have been ordered paid by a majority of all members present in good standing at a meeting of said Lodge; and the Court having heard and considered the arguments of counsel, having taken the matter under advisement, and on the 10th day of March, 1947, filed a memorandum decision and being now fully advised in the premises, it is, therefore,\n\n\"Ordered and Adjudged that the defendants International Brotherhood of Boilermakers, Iron Ship Builders and Helpers of America, Charles J. MacGowan, its President, Homer Parrish and Walter B. Toner, and each of them, and their agents and representatives, including all members of said Governing Board, be and they are hereby restrained and enjoined, pending the trial of this cause or the further order of the court, from\n\n\"(1) Suspending, without notice, charges and hearing, any of the duly elected or appointed officers of plaintiff Local Lodge 104 and/or interfering, directly or indirectly, with their administration of the affairs and activities of said Lodge;\n\n\"(2) Suspending, without notice, charges and hearing, the meetings of said Lodge 104;\n\n\"(3) Suspending or otherwise interfering with the publication of plaintiffs' weekly newspaper, known as the 104 Reporter, without notice, charges and hearing;\n\n\"(4) Seizing or attempting to seize, without notice, charges and hearing, either by force or otherwise, the funds, properties, books and records of said Lodge 104 and/or the control or management thereof;\n\n\"(5) Interfering, without notice, charges and hearing, either directly or indirectly, with the right of said Lodge 104 to manage its own affairs and/or disburse its own funds in accordance with the Subordinate Lodge constitution.\n\n\"It Is Further Ordered and Adjudged that the defendants Seattle-First National Bank and Peoples National Bank of Washington, and each of them, be and they are hereby restrained, pending the trial of this cause or the further order of the court, from refusing to honor such checks drawn on the accounts of plaintiff Local Lodge 104 as are jointly signed by the elected and authorized officers of said Lodge, namely, Walter B. Toner, its President, and Joe Clancy, its Secretary-Treasurer, and they, and each of them, are hereby restrained from honoring checks drawn on the accounts of said Lodge 104 and signed by any person or persons other than said elected and authorized officers of said Lodge, and said banks, and each of them, are further restrained and enjoined, until the further order of the court, from affording access to the safety deposit box of Local Lodge 104 to any person or persons other than said elected and authorized officers of said Lodge.\n\n\"It Is Further Ordered and Adjudged that the duly elected and qualified President and Secretary-Treasurer of plaintiff Local Lodge 104, namely, said Walter B. Toner and Joe Clancy, be and they are hereby restrained, until the further order of the court, from refusing to perform their duties and collecting and disbursing the funds of plaintiff Local Lodge 104 in accordance with the provisions of Article II of the Subordinate Lodge constitution, provided, however, that pending the trial of this cause or the further order of the court, the plaintiffs and their officers shall be and they are hereby restrained from making any\n\nwithdrawals from Local 104's safety deposit box No. 1967 in the Seaboard Branch of the Seattle-First National Bank and from withdrawing any funds from the Local's special payroll account with said Bank and from the Local's building fund account with the Metropolitan Branch of said Bank, and said bank is likewise restrained from permitting any withdrawals from said safety deposit box and/or said accounts.\n\n\"And It Is Further Ordered and Adjudged that, pending the trial of this cause, or the further order of the court, Local Lodge 104 and its officers shall be and they are hereby restrained from making any withdrawals from its sick fund account with the Seaboard Branch of the Seattle-First National Bank, except such withdrawals as are made for the uses and purposes for which said fund was established, and from drawing any checks against or any funds from any other account or accounts which Local 104 has with said banks, i.e., the general fund account on deposit with the Seaboard Branch of defendant Seattle-First National Bank and the publication fund account with the defendant Peoples National Bank of Washington, except for the following uses and purposes:\n\n\"(1) Salaries of officers and office help;\n\n\"(2) Office rent and supplies;\n\n\"(3) Telephone and telegraph supplies;\n\n\"(4) Purchase of dues receipts from the defendant Brotherhood and per capita tax payments to the Brotherhood; and\n\n\"(5) Per capita tax to the Washington State Federation of Labor, Seattle Central Labor Council, Seattle Metal Trades Council, and to other like affiliated organizations to which Local 104 has heretofore regularly paid per capita taxes or contributions.\n\n\"Provided, however, that said banks shall be under no obligation to inquire as to the purpose for which any withdrawal is made.\n\n\"The foregoing temporary injunction shall become effective immediately upon the filing of a bond with the Clerk of the Court by plaintiffs in the amount of $1000.00 or in lieu thereof deposit in the registry of the court the sum of $1000.00.\n\n\"Done in Open Court this 21st day of March, 1947.\n\n\"Donald A. McDonald, Judge.\"\n\nA notice of appeal from the above order was immediately served and filed. A demurrer to the original complaint\n\nwas filed on March 31, 1947. An amended complaint was filed on April 24th. A demurrer to the amended complaint was filed on May 15th. The appeal from the temporary injunction was, on stipulation of the parties, dismissed on May 27th, and on June 23rd the amended complaint was stricken.\n\nA second amended complaint was filed on June 30th. Unfortunately, a full analysis of this complaint and liberal quotations from it, and from some of the exhibits attached thereto, appear necessary to an understanding of the principal legal questions raised by this appeal.\n\nIn the first paragraph of the second amended complaint, it is alleged, in substance, that, during the times therein mentioned, the plaintiff Washington Local Lodge No. 104 embraced in its membership between thirty-five hundred and fifteen thousand members, and that the individual plaintiffs Hanson, Collins, and Norgord were members of Lodge No. 104, in good standing, and join in the action in their own behalf and on behalf of all members of the lodge, who are too numerous to be named parties plaintiff.\n\nIt is further alleged that the defendant International Lodge is a voluntary association, composed of a large number of members and subordinate lodges, too numerous to be made parties defendant, including many members who are citizens and residents of the state of Washington; that the International Lodge is affiliated with the American Federation of Labor and is composed of several lodges which are located in the state of Washington; and that the defendants Charles J. MacGowan and William Williams were, and still are, president and vice-president, respectively, of the International, and defendant William Williams was, and still is, one of its representatives in the state of Washington and a member of its executive council.\n\nIt is further alleged that the affairs of the International Lodge and its subordinate lodges, including Lodge No. 104 and its members, are governed by an International Lodge and Subordinate Lodge constitutions which, together, constitute a contract between the International, on the one hand, and Lodge No. 104, and its members, on the other.\n\nIt is further alleged that the defendants Seattle-First National Bank and Peoples National Bank of Washington have on deposit, or in one of their safety deposit vaults, all the funds and securities of Lodge No. 104, amounting approximately to $576,000.\n\nThe gist of the complaint is found in the remaining paragraphs of the complaint, that is, in paragraphs Nos. VI, VII, VIII and IX, which read as follows:\n\n\"VI. That on or about the 20th day of February, 1947, the defendant MacGowan, without notice, charges, trial or other opportunity to be heard, suspended all of the duly elected, qualified and acting officers of Lodge 104, suspended all meetings of said Lodge, appointed a so-called governing board for said Lodge with defendant Homer Parrish, a representative of the International Lodge, as its chairman and defendant Walter B. Toner as its vice-chairman, instructing said defendants to take under their control all of the funds, property, books and records of Lodge 104, demanded that said officers of Lodge 104 deliver to said defendants said funds, property, books and records, together with all indicia of office, and simultaneously instructed said banks to honor checks drawn on the accounts of Lodge 104 only when signed by defendants Homer Parrish and Walter B. Toner, and not to honor any checks drawn on said accounts by the duly elected officers of Lodge 104, and suspended the publication of the weekly newspaper of said Lodge known as 104 Reporter.\n\n\"VII. That on the aforesaid date there was delivered to each of the duly elected, qualified and acting officers of Lodge 104 a letter signed by the defendant Charles J. MacGowan and bearing the seal of the defendant International Brotherhood, copy of which is attached hereto as Exhibit 'B' and made a part hereof by this reference. On the same day there was also delivered to the defendant Toner and to Joe Clancy, the duly elected, qualified and acting Secretary-Treasurer of Lodge 104, another letter signed by the defendant Charles J. MacGowan and bearing the seal of the defendant International Brotherhood, copy of which is attached hereto as Exhibit 'C' and made a part hereof by this reference. The plaintiffs deny any knowledge or information sufficient to form a belief concerning the matters stated in the first paragraph of Exhibit 'B' and they deny any knowledge or information sufficient to form a belief concerning the truth or falsity of the statement in\n\nthe second paragraph of said Exhibit 'B' to the effect that defendant MacGowan 'first secured the advice of a majority of the International Executive Council' before committing the acts complained of in paragraph VI of the second amended complaint; and they deny the recitals contained in Exhibit 'C' whereby the defendant MacGowan attempted to explain and justify the acts complained of in paragraph VI of said complaint.\"\n\n[Exhibit \"B,\" mentioned in the preceding paragraph VII and appearing in the record as \"Plaintiffs' Exhibit 6,\" reads as follows:\n\n\"Office of Kansas City 11, Kansas\n\n\"International President February 20, 1947\n\n\"522 Brotherhood Bldg.\n\n\"Mr. Joe Clancy, Fin-Cor. Secy.-Treas.,\n\n\"Local Lodge No. 104,\n\n\"2800 First Street, Room No. 50,\n\n\"Seattle, Washington.\n\n\"Dear Sir and Brother:\n\n\"I have carefully examined a complete and comprehensive report made by the committee of the International Executive Council appointed and sent to Seattle for the purpose of conducting extensive hearings relative to complaints and controversies existing in Local Lodge No. 104, which report contains a series of recommendations, chief among which is a strong recommendation that meetings of Local Lodge No. 104 be forthwith suspended and that a governing board from among the membership of Local Lodge No. 104 be appointed by the President of the International Brotherhood, with an International Representative or officer as Chairman of such Board.\n\n\"Having first secured the advice of a majority of the International Executive Council and acting pursuant thereto, I have by notice to Local Lodge No. 104, suspended the meetings of Local Lodge 104 and have appointed a Governing Board as contemplated by Article IV of the International Constitution; and have suspended all of the elected and appointed officers of Local Lodge No. 104 to the end that the Governing Board may proceed unhampered in the administration of the affairs of Local Lodge No. 104 as contemplated within the Constitution and By-Laws of the International Brotherhood.\n\n\"You are notified accordingly that you are hereby suspended as Financial-Corresponding Secretary and Treasurer\n\nof Local Lodge No. 104 of the International Brotherhood of Boilermakers, Iron Ship Builders and Helpers of America, and I do hereby appoint Walter B. Toner as Financial-Corresponding Secretary and Treasurer pro tem of Local Lodge No. 104 to serve as such until the Governing Board is organized and his successor is duly elected by the Governing Board.\n\n\"You are hereby ordered and directed to immediately turn over to Walter B. Toner, as Financial-Corresponding Secretary and Treasurer pro tem of Local Lodge No. 104, all books, records, documents, funds, accounts and properties of Local No. 104 and of Boilermakers Washington Lodge Building Association, a fully owned subsidiary of and maintained for the benefit of Local Lodge No. 104, in your possession or under your control, together with all other indicia of office, and to forthwith cease and desist from the performance of any and all functions of such office, and to fully cooperate with your successor so named in securing such transfer of the functions of your office to the end that business for Lodge No. 104 may not be disrupted.\n\n\"By copy of this letter Brother Walter B. Toner is hereby notified of his appointment as Financial-Corresponding Secretary and Treasurer pro tem of Local Lodge No. 104 and is hereby ordered and directed to possess himself of all books, records, documents, funds, accounts and properties of Local Lodge No. 104 and of Boilermakers Washington Lodge Building Association, pertaining to such office.\n\n\"Fraternally yours,\n\n\"Chas. J. MacGowan\n\n\"International President.\"]\n\n[Exhibit \"C,\" mentioned in the preceding paragraph VII and appearing in the record as \"Plaintiffs' Exhibit 7,\" reads as follows:\n\n\"Office of Kansas City 11, Kansas\n\n\"International President February 20, 1947\n\n\"522 Brotherhood Bldg.\n\n\"Mr. Walter B. Toner, Pres. L-104\n\n\"2800 First Street, Room No. 50\n\n\"Seattle, Washington\n\n\"Mr. Joe Clancy, Secy.-Treas., L-104\n\n\"2800 First Street, Room No. 50\n\n\"Seattle, Washington\n\n\"Gentlemen and Brothers:\n\n\"For approximately two years the International Brotherhood has patiently and faithfully attempted to persuade\n\nLocal Lodge No. 104 to operate within the framework of our Constitution and the policies of our International Brotherhood. Time and space will not permit a complete recitation at this time of the repeated and continuing efforts which the International Brotherhood has made to achieve that purpose; but because Local Lodge No. 104 has been in complete control of a small but powerfully organized willful minority, every effort which the International Brotherhood has made has been flouted, ridiculed and generally denounced. During this period there has existed within Local Lodge No. 104, dissension and internal conflicts caused by this powerfully organized willful minority, and an insubordination and lack of cooperation with the Brotherhood and a continuing conspiracy to subvert and evade the Constitution and By-Laws of the International Brotherhood.\n\n\"A committee of the International Executive Council was appointed and sent to Seattle with instructions from the Executive Council to do everything within their power to end the turmoil and dissension within Local Lodge No. 104 and bring about a reconciliation, but, as a result of the acts of the powerfully organized minority, the effectiveness of the committee of the International Executive Council was virtually destroyed.\n\n\"I now have before me, however, a complete and comprehensive report of that committee which contains a series of recommendations, chief among which is a strong recommendation that the meetings of Local Lodge No. 104 be forthwith suspended and that a governing board from among the membership of Local Lodge No. 104 be appointed by the President of the International Brotherhood, with an International Representative or officer as Chairman of such a board.\n\n\"Having first secured the advice of a majority of the International Executive Council, and acting pursuant thereto, I am accepting the recommendations of the committee of the International Executive Council and do hereby suspend the meetings of Local Lodge No. 104, and do hereby suspend all of the elected and appointed officers of Local Lodge No. 104, and do hereby appoint a Governing Board as contemplated by Article IV of the International Constitution, for the following purposes:\n\n\"1. Jealously safeguard the property and funds of Local Lodge No. 104 so that they may be preserved in their entirety for the membership of that Lodge;\n\n\"2. Administer all the business affairs of Local Lodge No. 104 and select from among their number necessary officers to conduct the business of the Lodge.\n\n\"The Governing Board will meet at least once per month or more often, if necessary. A full report of their actions and deliberations will be submitted to the International President after each meeting. Meetings of the membership of Local Lodge No. 104 will be called from time to time in order to receive from the Governing Board a report of business transacted by them, and to convey to the Governing Board suggestions for the betterment of the membership.\n\n\"Acting pursuant to Article IV, Section 1, of the International Constitution, I am hereby appointing officers pro tem of Local Lodge No. 104, these officers to serve until the Governing Board is organized and the successors of such officers pro tem are duly elected by the Governing Board:\n\n\"Vice-Chairman - Walter B. Toner\n\n\"Secretary-Treasurer - Walter B. Toner\n\n\"Business Agent - A. F. O'Neill\n\n\"Assistant Business\n\nAgent \u0026 Dispatcher - Dan McKillop\n\n\"Assistant Business Agent - Chas. D. Berger\n\n\"Trustee - Angus MacKenzie\n\n\"Trustee - Robert Ferguson\n\n\"Trustee - Gus Haug\n\n\"The following members of Local Lodge No. 104 are hereby appointed as a Governing Board for Local Lodge No. 104 to act until such time as the situation in Local Lodge No. 104 has been composed and the autonomy has been restored, provided that the members so named, or such of the members so named as shall upon notice of the appointment, accept such appointment in writing, shall constitute the Governing Board for Local Lodge No. 104:\n\n\"Walter B. Toner, Reg. No. 700905\n\n\"A. F. O'Neil, Reg. No. 174281\n\n\"Daniel P. McKillopp, Reg. No. 63107\n\n\"Frank Knowlton, Reg. No. 530732\n\n\"Robert Ferguson, Reg. No. 530583\n\n\"Gus Haug, Reg. No. 68429\n\n\"Sherman MacAbee, Reg. No. 588628\n\n\"Ben Holmes, Reg. No. 125305\n\n\"George Ellis, Reg. No. 927067\n\n\"Robert Robinson, Reg. No. 466814\n\n\"Ed Wiwi, Reg. No. 60516\n\n\"D. L. Rembaugh, Reg. No. 126833\n\n\"James A. Nash (Bud), Reg. No. 67372\n\n\"Roderick Weir, Reg. No. 45757\n\n\"Ted Prescott, Reg. No. 588712\n\n\"Charles Coulter, Reg. No. 515155\n\n\"Loe Miller, Jr., Reg. No. 468271\n\n\"Joseph Hoopes, Reg. No. 530632\n\n\"Oliver Anderson, Reg. No. 467379\n\n\"Arlo Spaetig, Reg. No. 445866\n\n\"James Thayer, Reg. No. 155557\n\n\"Charles D. Berger, Reg. No. 501172\n\n\"Angus MacKenzie, Reg. No. 123756\n\n\"William Evans, Reg. No. 570840\n\n\"I hereby designate and appoint Brother Homer Parrish, International Representative and a member of Local Lodge No. 401 of Vancouver, Washington, to act as Chairman of this Governing Board, and further designate and appoint Brother Walter B. Toner to act as Vice-Chairman of this Governing Board.\n\n\"The men who I have selected to serve on this Governing Board have been chosen solely on the basis of their loyalty to the Trades Union movement, to Local Lodge No. 104 and to this International Brotherhood.\n\n\"Fraternally yours,\n\n[Signed] Chas. J. MacGowan\n\nInternational President.\"]\n\n\"VIII. That unless the defendants are restrained by this court they will wrongfully and unlawfully seize control of Lodge 104 from its duly elected, qualified and acting officers and they will seize and deprive it of its funds, property, books and records, and they have threatened and will unlawfully suspend such members as they see fit to suspend without notice, charges, trial or other opportunity to be heard. That all of the acts and threatened acts of the defendants, hereinabove mentioned, are unlawful, void and in violation of the law of the land, and the plaintiffs have no plain, speedy or adequate remedy in the ordinary course of law or under said constitution.\n\n\"IX. That the plaintiffs are not required to exhaust remedies provided in said constitution for the following reasons:\n\n\"(1) Article IV, Section 1 of the International Lodge constitution, which purports to invest the International president with power and authority to commit the acts and\n\nattempted acts above mentioned, without notice, charges, trial or other opportunity to be heard, is contrary to the law of the land and invalid;\n\n\"(2) Property rights of Lodge 104 are involved;\n\n\"(3) Suspension of the officers and members of Lodge 104 would deprive them of the right to work at their trade and earn a livelihood and would deprive them of insurance, sick and other benefits;\n\n\"(4) The International Lodge constitution expressly prohibits a stay pending any appeal provided therein;\n\n\"(5) The appellate procedure provided by the International Lodge constitution is expensive, slow and subject to great delay; and\n\n\"(6) Any appeal from the acts and threatened acts of the defendants, aforesaid, would be futile, vain and illusory because the defendant Charles J. MacGowan (International President) is chairman of the Executive Council as well as the presiding officer of the convention, and both he and the Executive Council have already prejudged the case.\n\n\"Wherefore, the plaintiffs pray that the defendants, (except defendant banks), and each of them, and their agents and representatives be permanently restrained and enjoined from\n\n\"(1) Suspending the duly elected, qualified and acting officers of Lodge 104 or interfering, directly or indirectly, with their administration of the affairs and activities of said Lodge;\n\n\"(2) Suspending the meetings of Lodge 104;\n\n\"(3) Suspending or otherwise interfering with the publication of the 104 Reporter;\n\n\"(4) Seizing or attempting to seize, either by force or otherwise, the funds, properties, books and records of Lodge 104 and/or the control and management thereof;\n\n\"(5) Interfering, either directly or indirectly, with the right of Lodge 104 to manage its own affairs and/or disburse its own funds in accordance with the Subordinate Lodge constitution.\n\n\"That the defendant banks be required to honor only such checks drawn on the accounts of Lodge 104 as are signed by the duly elected and authorized officers of said Lodge and that they be permanently restrained and enjoined from honoring any checks drawn on said accounts by any other person or persons and from affording access to the safety deposit box of Lodge 104 to any person or persons other than the duly elected and authorized officers of said Lodge.\n\n\"And the plaintiffs pray for such other and further relief as to the court may seem just and equitable in the premises, together with judgment for the costs and disbursements of this action.\"\n\nOn July 22nd, an order was entered overruling the defendants' demurrer to the second amended complaint and denying defendants' motion to strike certain portions thereof. On August 22nd, the defendants filed their answer to the second amended complaint. For answer to paragraph No. 1 of the second amended complaint, the defendants admitted that Local Lodge 104 was a voluntary association, embracing, \"at the present time,\" approximately thirty-four hundred members and having had, during the war years, approximately sixteen thousand, and that it was organized as a labor union and as a subordinate lodge, pursuant to a charter issued by the International, and denied all other allegations of said paragraph not so admitted.\n\nIn answer to paragraph No. 2, the defendants admitted that plaintiffs Hanson, Collins, and Norgord were members of Local 104 and, except as so admitted, denied all other allegations of said paragraph.\n\nIn answer to paragraph No. 3 of the second amended complaint, the defendants admitted that the International Brotherhood of Boilermakers, Iron Ship Builders, and so forth, was an international labor union, affiliated with the American Federation of Labor and composed of numerous subordinate lodges, some of which, including Local Lodge 104, were located in the state of Washington, and that defendant MacGowan was president of the International and William Williams was one of its thirteen vice-presidents and a member of its executive council, and denied all other allegations in paragraph No. 3 not so admitted.\n\nAnswering paragraph No. 4, the defendants admitted that the International and its subordinate lodges were governed by the International constitution and subordinate constitutions which were construed as a contract between the International and subordinate lodges, and, except for such admissions, all other allegations in paragraph No. 3 are denied.\n\nAnswering paragraph No. 5, the defendants admitted that Seattle-First National Bank and Peoples National Bank of Washington were engaged in the banking business in Seattle, and that Local Lodge 104 had a portion of its funds and securities on deposit in said banks and in a safe deposit box in one of them, and all other allegations in paragraph No. 5, not so admitted, are denied.\n\nAnswering paragraph No. 6, defendants admitted that, on or about the twentieth day of February, 1947, the International, acting through its president, MacGowan, suspended all officers of Local Lodge 104, suspended all meetings of said lodge, and appointed a governing board for Local Lodge 104, with Homer Parrish as its chairman and Walter B. Toner as its vice-chairman, and, except as so admitted, denied all other allegations in said paragraph.\n\nAnswering paragraph No. 7, defendants admitted that, on or about February 20, 1947, there was delivered to each of the several officers of Lodge 104 a letter signed by International President MacGowan, which letters were in general form as set forth in Exhibit \"B\" attached to the complaint in the action, except as said individual letters delivered to each officer referred to the individual office of such officer, appointed a successor to each of the officers, and directed that books, records, documents, funds, accounts, and properties be turned over to such successor so named. It is further admitted that, on or about February 20, 1947, Walter B. Toner and Joe Clancy, president and secretary, respectively, of Local 104, received a letter signed by the president of the International, authenticated by its seal, in the form of Exhibit \"C,\" attached to and made a part of the complaint, and, having made the foregoing admission, defendants denied all other allegations contained in paragraph No. 7.\n\nAnswering paragraph No. 8, defendants denied each and every allegation therein contained.\n\nAnswering paragraph No. 9, defendants denied each and every allegation therein contained.\n\nThe defendants also attached to their answer an affirmative defense to which the plaintiffs filed a reply on September\n\n2. We now quote the affirmative defense, paragraph by paragraph, each, except paragraph No. 1, followed by the reply thereto:\n\n\"I. That the International Brotherhood of Boilermakers, Iron Ship Builders and Helpers of America is a voluntary association and labor organization, and has adopted and there is presently in force and effect a constitution, together with a Subordinate Lodge Constitution, all as revised and adopted at the 17th Consolidated Convention held in Kansas City, Missouri, January 31 to February 9, 1944, a copy of which is attached as Exhibit 'A' to the plaintiffs' complaint.\n\n\"II. That Washington Local Lodge No. 104 of said Brotherhood is a subordinate lodge of said Brotherhood, organized and existing by virtue of a charter issued by said International Brotherhood and that as such, said Local Lodge 104 and the members thereof are subject to the constitution of the said International Brotherhood and to said Subordinate Lodge Constitution.\n\n[\"I. Replying to paragraph II, they [plaintiffs] admit that Local Lodge 104 and the members thereof are subject to the Constitution of the International Brotherhood and the Subordinate Lodge Constitution in so far as the provisions thereof do not contravene the law of the land.\"]\n\n\"III. That the said Brotherhood and the subordinate lodges thereof operate with a ritualistic form of government, as an incident to which all members upon their admission to the International Brotherhood take an oath of membership, by the terms of which all members agree to conform to and abide by all the laws and rules of the Brotherhood in force or that may thereafter be adopted by the governing body, and all officers of subordinate lodges upon taking office take an oath of office to faithfully and impartially perfrom all duties incumbent upon them as officers in accordance with the by-laws of the subordinate lodge and the Constitution, laws and orders of the Brotherhood.\"\n\n[\"II. Replying to paragraph III they admit that all members upon their admission to the International Brotherhood take an oath of membership whereby they agree to conform to and abide by all the laws and rules of the Brotherhood in so far as the same do not contravene the law of the land, and admit that all officers of Subordinate Lodges upon taking office take an oath to faithfully and impartially perform all duties incumbent upon them as officers in accordance with the by-laws of the Subordinate Lodge and the Constitution,\n\nlaws and orders of the Brotherhood in so far as the same do not contravene the law of the land.\"]\n\n\"IV. That by direction of International President Charles J. MacGowan, a special meeting of the International Executive Council was called to convene at Denver, Colorado, beginning April 8, 1946, for the purpose of presentation to the International Executive Council of matters relating to the internal affairs existing within Local Lodge 104, and Local Lodge 104 was directed to be represented at such hearing by its president, secretary-treasurer, business agent, and assistant business agent, and that at said hearing the designated officers of Local Lodge 104, together with four additional representatives elected by Local Lodge 104 appeared before the International Executive Council and were accorded a full and ample hearing, and following such hearing and action by the International Executive Council, a committee of three members of the International Executive Council was appointed to go to Seattle, Washington, and hold or conduct extended hearings in Local Lodge 104 to secure all factual information possible from its officers and members relative to any complaints and controversies existing in that lodge, and to prepare and submit a comprehensive report of their findings, with recommendations, to the International President, the said committee of the International Executive Council consisting of Tom Crowe, O. W. Mursener and Wm. Williams, all vice-presidents of the International Brotherhood and members of the International Executive Council, and International President Charles J. MacGowan, under date of May 8, 1946, gave notice to Local Lodge 104 of such action and of the hearings to be conducted by the committee of International Executive Council by letter, copy of which is hereto attached and marked Exhibit 'A'.\"\n\n[\"III. Replying to paragraph IV, they admit that the International President convened a meeting of the International Executive Council at Denver, Colorado on or about April 8, 1946; admit that he directed Local Lodge 104 to be represented at said meeting by its president, secretary-treasurer, business agent and assistant business agent, together with four additional representatives elected by Local Lodge 104; admit that said representatives attended said meeting as directed; admit that shortly thereafter three members of the International Executive Council, namely, Tom Crowe, O. W. Mursener and William Williams, all Vice Presidents of the International Brotherhood, came to Seattle; admit that under date of May 8, 1946, the International\n\nPresident transmitted a letter directed to the persons named therein, copy of which is attached to said Answer as Exhibit 'A'; they deny each and every other allegation of said paragraph and particularly deny that any hearing was held at Denver, Colorado or at Seattle, Washington.\"]\n\n\"V. That the committee of the International Executive Council proceeded to Seattle, Washington, for the purpose of conducting such hearings and met in Seattle May 16, 1946, and proceeded to examine officers and members of Local Lodge 104 relative to complaints and controversies existing in Local Lodge 104, continuing with such hearings until December of 1946.\"\n\n[\"IV. Replying to paragraph V, they admit that on or about May 16, 1946, said committee appeared at Seattle, but deny each and every other allegation of said paragraph, and particularly deny that said committee at any time conducted any hearing.\"]\n\n\"VI. That under date of February 20, 1947, and giving full consideration in the premises and to the hearings as conducted by the International Executive Council and the committee of the International Executive Council, International President Charles J. MacGowan did, by letter to Local Lodge 104, copy of which is attached to the second amended complaint as Exhibit 'C', having first secured the advice of a majority of the International Executive Council and acting pursuant thereto, suspend the meetings of Local Lodge 104, suspend all the elective and appointive officers of Local Lodge 104, and appoint a Governing Board for Local Lodge 104, as contemplated by Article IV of the International Constitution, and appoint officers pro tem of Local Lodge 104 to serve until the Governing Board was organized and successors of such officers pro tem were elected by the Governing Board, and did address and cause to be delivered to all officers of Local Lodge 104 so suspended, with copy to the successor officers pro tem so appointed, a letter in form the same as that attached as Exhibit 'B' to the second amended complaint, except as it was addressed to the several different officers in their several different capacities, and directing them to turn over books, records, documents, funds and accounts of Local Lodge 104 to their successor officers pro tem.\"\n\n[\"V. Replying to paragraph VI, they deny each and every allegation therein contained contrary to or inconsistent with the allegations of plaintiffs' Second Amended Complaint.\"]\n\n\"VII. That the said acts and actions of International President Charles J. MacGowan were taken pursuant to and in compliance with the International Constitution and the Subordinate Lodge Constitution and were taken after notice to Local Lodge 104 and after hearings in which Local Lodge 104 and all of its officers and members were accorded the full opportunity to be heard.\"\n\n\"VIII. That the action of the International in all these matters has been for the best interests of the Brotherhood and for the interests of all members thereof and for the best interests of the entire membership of Local Lodge 104 and that in so acting the International has acted without any intention of depriving Local Lodge 104 or its members of any funds, property, books or records, but on the contrary such action was taken for the express purpose of safeguarding the properties and funds of Local Lodge 104 so that they might be preserved in their entirety for the membership of Local Lodge 104.\"\n\n[\"VI. They deny each and every allegation of paragraphs VII and VIII.\"]\n\n\"IX. That a first meeting of the Governing Board of Local Lodge 104, as so appointed, was held in the city of Seattle on the 20th day of February, 1947, at which there were present nineteen members of the Governing Board, all of whom accepted appointments as members of the Governing Board in writing and were duly installed and took oath of office as such and at all times since have been and now are the duly appointed and acting Governing Board of Local Lodge 104. That at a meeting of the said Governing Board of Local Lodge 104 held at the City of Seattle, Washington, on the 27th day of February, 1947, the officers pro tem of Local Lodge 104 as appointed by the International President of the Brotherhood, were confirmed and elected by the Governing Board as officers of Local Lodge 104 and the said officers so elected, together with the Governing Board as so appointed, presently constitute the duly appointed, elected and authorized officers and agents on behalf of Local Lodge 104.\"\n\n[\"VII. Replying to paragraph IX they deny any knowledge or information sufficient to form a belief concerning the allegations thereof.\"]\n\n\"X. That the plaintiffs herein, Local Lodge 104 and any member or officer of Local Lodge 104 having any grievance by reason of the action so taken by the International Brotherhood or by International President Charles J. MacGowan, have a plain, speedy and adequate remedy within\n\nthe Association pursuant to and as provided within the Constitution of the Brotherhood and the Subordinate Lodge Constitution.\"\n\n[\"VIII. They deny each and every allegation of paragraph X.\"]\n\n\"Wherefore, having fully replied, the plaintiffs pray judgment and decree in accordance with the prayer of their Second Amended Complaint.\"\n\nIt is, of course, apparent that the foregoing pleadings raised a vast number of both factual and legal issues. The case was on trial for eleven days, and the statement of facts consists of 786 pages of transcribed oral evidence and three sizable cartons of documentary exhibits, some of which are printed booklets and others are long dissertations written in longhand.\n\nThe record shows that Local Lodge 104 has had difficulties with the International Brotherhood over a period of years. Until 1944, Local 104 had elected its officers annually. At the convention of the International held in February, 1944, a resolution was introduced amending the International constitution to provide that officers of Locals should be elected every four years. The resolution was actively opposed by the delegates of Local 104 on the floor of the convention. It was adopted. Near the end of the year, Local 104 petitioned the International president for leave to hold an election of officers. It seems that the president had the right to do so, with permission of the executive council. The petition was refused, but it appears that the International president suggested that, if the then officers of the Local resigned, an election to fill the vacancies thus created would naturally follow. All the officers of Local 104 resigned, and an election was held to fill the resulting vacancies.\n\nAs we understand the matter, the new officers were elected with the understanding that they would resign at the end of one year. It is obvious that this plan, if carried out year by year, would by-pass the constitutional amendment made at the 1944 convention. However, the president and business agent of Local 104 refused to resign at the\n\nend of 1945, and all of the officers remained in office, to the dissatisfaction of many of the members of the Local.\n\nAt about that time, it became necessary for the Local to cut down expenses, owing to the fact that, after the end of the war, its membership had diminished from some fifteen thousand to less than thirty-five hundred. Two different plans were suggested to meet the situation. The president of the International suggested that savings could be made by abolishing certain local offices, by consolidating others, and by discontinuing the publication of the 104 Reporter. The board of trustees of Local 104 suggested that savings could be made by reducing the salaries of the officers. At a regular meeting of the Lodge, a majority of the members present rejected the plan proposed by the International president and adopted the plan proposed by the trustees of the Local. It was claimed by the International that the real purpose of the reduction of the salaries of the elective officers was to induce them to resign so that an election could be had, despite the constitutional amendment adopted at the 1944 convention. The salary reductions which became effective as of February 1, 1946, were substantial. Complaint was made to the International president by the Local officers, and the president appears to have taken the matter up with the Brotherhood council.\n\nIn May, 1946, President MacGowan sent a letter to Local 104, which read, in part, as follows:\n\n\"That there may be no misunderstanding, I now direct the officers of Lodge No. 104:\n\n\"'To immediately restore, retroactive to the date the reduction was effective, the salary of each of the salaried officers of Lodge No. 104, in the amount received by them prior to the recent action of Lodge No. 104 reducing their salaries.'\"\n\nInstead of carrying out the foregoing directive, Local 104, invoking the declaratory judgment act of this state, brought an action against the International Brotherhood in which the court was asked to determine whether or not, under the International and Subordinate Lodge constitutions, a local had the right to fix and regulate the salaries of its officers\n\nwithout the approval and consent of the International Brotherhood. Injunctive relief was also prayed for. A temporary restraining order was issued on May 23, 1946. After a long trial, ending in November, 1946, the trial court, on November 22nd, ordered that the temporary restraining order be vacated and the action dismissed. The dismissal seems to have been based upon two grounds: (1) that the plaintiffs' case did not fall within the purview of the declaratory judgment act; and (2) that the plaintiffs had not exhausted their remedies within the Brotherhood.\n\nOn November 27, 1946, the case was appealed to this court, and the decision of the trial court was reversed by Departmental opinion filed on July 24, 1947 (Washington Local Lodge No. 104 etc. v. International Brotherhood of Boilermakers etc., 28 Wash. 2d 536, 183 P.2d 504). A rehearing by the court En Banc was prayed for, and granted and a per curiam decision was rendered on February 17, 1948, reciting that a majority of the court adhered to the result of the Departmental opinion. 28 Wash. 2d 546.\n\nTwo days after Local 104 appealed the salary case referred to in the preceding paragraph, President MacGowan of the International sent out individual letters to eleven members of Local 104, including several of its officers, each of which reads as follows:\n\n\"Office of Kansas City 11, Kansas\n\n\"International President November 29, 1946\n\n\"522 Brotherhood Bldg.\n\n\"Mr. Nicholas P. Hughes, Reg. No. 444164,\n\n\"Route 2, Box 618,\n\n\"Renton, Washington.\n\n\"Dear Sir and Brother:\n\n\"You are hereby notified to be and appear in Room 102, Stratford Hotel, Seattle, Washington, on Thursday, December 5, 1946, at 9:30 A.M., where the Committee of the Executive Council will conduct an investigation for the International President of the following charges against you:\n\n\"That you did, in conspiracy with other members, hereinafter named of Local Lodge No. 104 of the International Brotherhood of Boilermakers, Iron Ship Builders and Helpers of America, violate Section 9 Article XV of the\n\nSubordinate Lodge Constitution of the International Brotherhood, which provides that:\n\n\"'Any member who endeavors to create dissension among the members or to work against the interest and harmony of this International Brotherhood or of a Subordinate Lodge . . . shall, upon conviction, be punished by expulsion from this International Brotherhood.'\n\n\"You are specifically charged with conspiring with\n\n\"Nicholas P. Hughes - Reg. No. 444164\n\n\"Joe Clancy - Reg. No. 161672\n\n\"John Grosso - Reg. No. 532245\n\n\"W. J. Miller - Reg. No. 456133\n\n\"Walter Rasmussen - Reg. No. 603103\n\n\"Frank Chinella - Reg. No. 603700\n\n\"Ed. L. Palmquist - Reg. No. 1184354\n\n\"Wm. J. Nadeau - Reg. No. 614731\n\n\"Chas. E. Taylor - Reg. No. 583531\n\n\"Roy A. Taylor - Reg. No. 677462\n\n\"Hagbard M. Edwards - Reg. No. 545788\n\nto subvert and evade Section 5 of Article III of the Subordinate Lodge Constitution, relative to the term of office of elective officers. You did so by maliciously attempting to coerce the said elective officers to resign so annual elections could be held; and when said elective officers refused to resign you, in conjunction and conspiracy with the said other members, attempted to cause the salaries of said elective officers to be reduced for the unlawful and malicious purpose of causing said elective officers to resign. That the said conduct and conspiracy were for malicious and unlawful purpose of causing other members than those lawfully occupying said elective offices to be put in said offices contrary to the Subordinate Lodge Constitution and By-Laws and contrary to the interest and harmony of the International Brotherhood and of the said Local Lodge.\n\n\"For the purpose of causing an adequate investigation to be made of said charges against you, the International President has appointed Vice-Presidents Crowe, Mursener, and Williams, to hold a hearing at Room 102, Stratford Hotel, Seattle, Washington, on Thursday, December 5, 1946, at 9:30 A.M., at which hearing you are commanded to appear for questioning; and at which hearing you may produce evidence, both oral and documentary, and cross examine witnesses produced against you.\n\n\"At said hearing you may either represent yourself, or you may be represented by another member of the Brotherhood as counsel, or both.\n\n\"The three Vice-Presidents herein named and constituting the investigating committee are directed by the International President to report to him and the International Council their findings from the evidence produced at said hearing, in order that the International President and the International Executive Council may determine whether or not you are guilty or innocent of said charges, and whether or not, if guilty, you should be expelled as a member from the International Brotherhood of Boilermakers, Iron Ship Builders and Helpers of America.\n\n\"Fraternally submitted\n\n[Signed] Chas. J. MacGowan\n\nInternational President\"\n\nSeveral of the recipients of the above letter appeared at the time and place as directed. We have, among the exhibits, transcripts of a portion of the so-called hearings. When Joe Clancy appeared, the following occurred: He was shown a copy of the text of the letter above quoted and was asked whether he had appeared in response to it. He said he had and asked that his attorney, Mr. Ed Henry, be permitted to represent him. The request was denied, and the following reason was assigned:\n\n\"It is denied because it is the policy of this International Brotherhood and of its affiliated Subordinate Lodges that none but members of the International Brotherhood shall appear in hearing as counsel for individual members.\"\n\nClancy then requested that Nicholas P. Hughes be permitted to act as his counsel. After it was determined that Hughes was a member of Local 104, the request was granted; whereupon Vice-president Williams of the International, who presided at the investigation, began the interrogation of Clancy, as follows:\n\n\"By Mr. Williams: Q. Do I understand, Brother Clancy, that you are now at this time requesting Brother Hughes as counsel in your behalf? A. That is right. Q. The request is granted. However, as a matter of record we would like to identify your counsel. Vice President Williams: Brother Hughes, you are now appearing as counsel on behalf of Brother Clancy? Mr. Hughes: That is right, I am. Vice President Williams: You are a member of Subordinate Lodge No. 104 of the International Brotherhood? Mr. Hughes: Yes. My register number is 444164 and my\n\nhome address is Route 2, Box 618, Renton, Washington. Vice President Williams: You are also a member of Lodge No. 104 who has been requested to appear on your own behalf on the subject matter as outlined in the letter of November 29, 1946? Mr. Hughes: That is right. Vice President Williams: As stated before, Brother Clancy, you can arrange if it is necessary, or we will arrange, if it is necessary, to adjust to permit you or any of the other members as much time as it is possible and under all of the circumstances. We now ask you, Joe, if you wish to make response to the show cause order that brings you here? You can now proceed. Mr. Hughes: On behalf of Brother Clancy, I would like to again challenge the use of that 'show cause', and, ask for a definition of what you mean by 'show cause'. Do you mean that Brother Clancy is here and must show cause why he should not be expelled, even though no witnesses or evidence has been produced against him? Vice President Williams: The show cause order under date of November 29 requests the appearance of Brother Clancy to show cause why he should not be suspended from membership, in this International Brotherhood. Mr. Hughes: Have you made that letter a part of the record? Vice President Williams: The record is, the letter is a part of the record in evidence in each case. Mr. Hughes: Is it a part of the record in the other case, too? Vice President Williams: In each case. Mr. Hughes: I would like to take a look at this and see where it says 'ordered to show cause'. (Perusing document) Well, I find no place in this letter where it says that Brother Clancy is here to show cause on anything. I would like to quote you what might be the paragraph that you are thinking of:\n\n\"'For the purpose of causing an adequate investigation to be made of said charges against you, the International President has appointed Vice-Presidents Crowe, Mursener, and Williams, to hold a hearing at Room 102, Stratford Hotel, Seattle, Washington, December 5, 1946, at 11:00 A.M. at which hearing you are commanded to appear for questioning and at which hearing you may produce evidence, both oral and documentary, and cross examine witnesses produced against you.'\n\n\"Brother Clancy is here in response to that letter, but the letter does not say 'to show cause'. Do you want to repeat the rest of the question? We are just objecting to that 'show cause' part of it. Vice President Williams: Well, the 'show cause' or the letter under date of November 29, 1946 will speak for itself. Mr. Hughes: Well, we agree on\n\nthat, if that is all. Has it been entered in the record that Brother Clancy is here in response to that letter? Vice President Williams: The record should so show, so state, but just in case it does not show, it will be now recorded that Brother Clancy is here in response to the communication under date of November 29, 1946. Mr. Hughes: You had better ask him the question.\n\n\"By Vice President Williams: Q. Is it not a fact, Brother Clancy, that you are now here in response to the letter a moment ago that was identified as one being received by you under date of November 29, 1946? A. Yes. Mr. Hughes: We would like at this time -- maybe we will speed things up by asking all of these things at one time that was asked at the other one. It will save a lot of time. But we would like again to make this request for an open hearing. Mr. Clancy has already requested legal talent. We would like to make a request for our own court reporter. That is all of it at this time. I would like to offer this same letter again as I requested for the open hearing previously. Vice President Williams: The request will be denied. We are re-affirming the same request which was identically the same as in the case of Brother Hughes. Mr. Hughes: Okeh. Vice President Crowe: Your petition in the form of a petition, or your request in the form of a petition directed to this committee and filed by certain members of Lodge No. 104 may be made a part of the record as in the case of the previous case.\n\n\"(Letter referred to follows:)\n\n\"'To: Seattle, Washington\n\n\"'International Vice Presidents December 5, 1946\n\n\"'Thomas Crowe\n\n\"'Otto W. Mursener\n\n\"'William Williams\n\n\"'Gentlemen and Brothers:\n\n\"'For the best interests of all concerned we respectfully request an open hearing on all the charges contained in International President MacGowan's letter of November 29 addressed to eleven members of Lodge 104.\n\n\"'If this request is granted we shall be glad to provide a hall.\n\nFraternally yours,\n\nNick Hughes Roy A. Taylor\n\nWalt Rasmussen Frank Chinella\n\nJohn Grosso Ed Palmquist\n\nW. J. Miller Wm. J. Nadeau'\n\nJoe Clancy\n\n\"Vice President Williams: That is correct. Mr. Hughes: Well, of course, you want to enter it into the record that a request for a court reporter was denied. We will be allowed a copy of the transcript according to your previous statement? Vice President Williams: The request for a court reporter in this case is denied for the same reasons as set forth in the previous request, but your request for a copy of the transcript is granted. You may have that, but it is your own responsibility. Mr. Hughes: Okeh. Vice President Crowe: While, Brother Hughes, it appears to me that it does not mean anything, your request for a copy of the transcript to be made available to you to purchase as in the previous case, in your own case, the answer is 'Yes, you may have that, of course.' Mr. Hughes: Yes. I thought you made that statement before. I thought you made that statement when you said the reasons for it previously -- that is, that we may purchase it -- thanks for putting that in, Tom. Did I interrupt a question of his? Vice President Williams: Brother Clancy, do you hold any office in Lodge No. 104? Mr. Clancy: Yes, Secretary-Treasurer. Q. That is of Subordinate Lodge No. 104? A. Yes. Q. We now ask if you have any showing you wish to make in response to this show cause order, and if so, we are here to receive it, and you may proceed. Mr. Hughes: I want to enter an objection again to this 'show cause' order because the letter does not state that. It does not state there is a show cause on anything. If you want to save time, you might just get a statement here on whether this is a, -- as was made before, -- that this is not a trial and who is preferring the charges, and of course, I know that there was no statement in the previous case on when or where we are alleged to have conspired.\n\n\"Vice President Williams: The identified communication as received by Brother Clancy will speak for itself, and it is now a matter of record in this hearing. Mr. Hughes: Well, for a point of clarification: Is this a trial or just an investigation? Vice President Williams: I will again say that while the communication of November 29, 1946 speaks for itself, I may add that this a hearing and not a trial. Mr. Hughes: Well, the communication mentions charges. Who is preferring the charges? Mr. Williams: The communication of November 29th will have to be referred to again in so far as who has preferred the charges. I think that the letter speaks for itself. It was received with the outlined charges over the signature of the International President.\n\nMr. Hughes: Well, you are appearing on behalf of the International President? Vice President Williams: We are appearing at the request of the International President to sit here and hear the response and whatever Brother Clancy has to say on behalf of himself or any witnesses that he may care to produce to substantiate anything that he may have to say. Mr. Hughes: You are here on request of the International President as you have outlined it? Vice President Williams: We are assigned to sit in here and hold this hearing. Mr. Hughes: All right.\n\n\"Vice President Crowe: I think, Mr. Hughes, in the last paragraph to which we have referred, which has been identified by Brother Clancy as having been received by him and in response to which he is now appearing, speaks for itself. Mr. Hughes: I don't know whether it is necessary or not to show that Brother Mursener is not in attendance? Vice President Williams: The record will speak for itself who is in attendance. Mr. Hughes: I think there is a question back there I objected to the language of it. We are willing to answer the question, but we object to that certain part of it, referring to the show cause. Would you read it, Mr. Stoddard? (Question referred to read back). Mr. Hughes: Outside of the objection to the wording 'show cause', he wants to make an answer to the question now. A. I deny the charges. I might say though that I am willing to face anybody, any place, and answer the said charges against me. Mr. Hughes: You had better qualify that 'any place'. You mean any reasonable place? The Witness: Yes, any reasonable place. Or to prove that I have ever conspired with anybody to the welfare, or against the welfare, of this Brotherhood in any way, or No. 104.\n\n\"By Vice President Williams: Q. I understand, Joe, you have a witness here? A. The understanding was in case I would need him. Q. Well, is it your intention -- you have Brother Bill Miller here as a witness, -- and he is sitting here, and I am now wondering if you care to call upon your witness in order that we may identify him as a matter of record as being here and appearing as a witness for you? Mr. Hughes: Bill, we are willing to identify Bill Miller, as being present here and/or as a witness if he is needed. But so far nothing has come up that it is needed to refute. That is, in our opinion. Vice President Williams: Well, do we understand that Brother Miller is here as his witness, on behalf of Brother Clancy? Mr. Hughes: In case he is needed. Vice President Williams: Naturally in case he\n\nis needed, he will be called upon? Mr. Hughes: That is right. Vice President Williams: But the record will show that Brother Miller is here as a witness chosen by Brother Clancy? Mr. Hughes: That is right. And if he is used, then the record will show that he is used and if not, okeh.\n\n\"By Vice President Crowe: Q. Brother Clancy, do we understand now that you have made a denial or deny any charge or charges made against you, or all the charge or charges made against you in the letter of November 29, 1946, which you received from the International President MacGowan, and in response to which you are now appearing? A. I do, yes. Q. Do you feel that you have had a complete and full opportunity to present any statements or witnesses or any evidence, oral or documentary, that you desire to present in the denial of those charges; have you had a full opportunity? We want the record to show whether you believe that you have or have not. A. In view of the fact that there is no evidence produced against me, I deny again that the charges are all false, -- Mr. Hughes: (Interposing) You had better rephrase that answer to the question to the way you mean it. You mean you deny the charges? A. (Continuing) I deny the charges. Q. (By Mr. Crowe) You understand, Brother Clancy, that this is not a trial? A. So I am told. Q. It is merely a hearing? A. A hearing. Q. And an investigation which we are conducting here for the record and the statements that you have made in the record are all that you care to make? A. In view of the fact that there is nothing been brought against me, that is all that I can do. I might state that my record in the Lodge No. 104 will speak for itself. That I have always worked for the best interests of the International and Local 104. Q. In doing that, you have complied with the laws of the International? A. As I understood them.\n\n\"By Vice President Williams: Q. Have you anything further to offer, Joe, in addition to your blanket denial of the charges that you received in the communication of November 29th; have you any other matter in reference to this communication that you received; have you anything further to offer or submit to this committee? Mr. Hughes: Did you say 'a blanket denial'? Vice President Williams: I think it was. Mr. Hughes: Would you read his statement, Mr. Stoddard? Vice President Williams: Yes, would you read that back? (Whereupon, the last question was read back by the reporter.) Mr. Hughes: Now, Mr. Reporter, would you check back there a ways and see -- we want to be\n\nsure it is a blanket denial of the charges and covers it all, because if there is anything he left out, he can take it up now. Vice President Williams: I would refer you back to the last statements made by Brother Clancy. Mr. Hughes: No, I think that it was before that. Vice President Williams: Well, whatever time it was. (Whereupon, previous questions and answers were read back.) Vice President Williams: Now, will you read the last statement of myself to Brother Clancy in order that he may familiarize himself with it? (Statement read back) A. No. Vice President Williams: If not, if there is nothing further, why you may be excused and the hearing will be closed. (Hearing adjourned at 11:50 A. M.)\"\n\nOn January 9, 1947, the committee rendered a fourteen-page report of their investigations to President MacGowan. This report is in the record as an exhibit, and is far too long to quote here or even adequately summarize. It may be mentioned, however, that, among other things, it reported that Joe Clancy, financial secretary-treasurer of Local 104, was \"incompetent, untrustworthy and incapable of performing the duties of his office in a proper and efficient manner,\" and that he had assisted in obtaining a restraining order against the International Brotherhood. The committee made a number of specific recommendations, and, among them, the following:\n\n\"A. That the publication of the '104 Reporter' be immediately discontinued.\n\n\"B. That Brothers William Miller, Dispatcher; Joe Clancy, Secretary-Treasurer, and John Grosso, Trustee, be suspended from office.\n\n\"C. That all regular meetings of Lodge 104 be suspended.\n\n\"D. That a Governing Board of sixteen (16) members be appointed to administer the affairs of Lodge 104 and that an International Representative be assigned as Chairman of the Governing Board.\n\n\"E. That the office of Dispatcher be discontinued and abolished and that the dispatching of men be the responsibility of the Business Agent's office.\n\n\"F. That the paid office of Sick Steward be discontinued and abolished and the duties of the Sick Steward be the responsibility of the Business Agent's office.\n\n\"G. That the salary of the Inside Guard or Inspector be discontinued as unwarranted expense.\n\n\"H. That the Assistant Secretary-Treasurer's Office be discontinued and abolished as unnecessary and an unwarranted expense.\"\n\nOn February 20, 1947, as we have hitherto shown by quoting exhibits \"B \" and \"C\" attached to the second amended complaint, President MacGowan had suspended the meetings of Local 104, and also suspended all of its officers. He further appointed officers for the Local to serve until the governing board, named by him, should be organized and officers for the Local should be selected by it. Four days after these directives (exhibits \"B\" and \"C\") were issued by the International president, the original complaint in this action was filed.\n\nWhen the parties to this case rested on November 3rd, and the trial judge had heard oral argument, he stated that he would announce a decision on November 4th, and did so, analyzing and stating his views as to the various questions presented. Although this opinion has already reached an unreasonable length, we feel that, since both parties have appealed from the decree subsequently entered, in justice to the trial judge the court's oral opinion as to the questions presented should be fully set out herein. As it appears in the statement of facts, it reads as follows:\n\n\"Oral Decision of the Court\n\n\"November 4, 1947.\n\n\"Robert M. Jones, J.\n\n\"The Court: I think, gentlemen, it substantially appears that prior to the early part of 1946 there had been in the local lodge a substantial element who were at odds with the parent organization.\n\n\"It is to be remembered that plaintiff here does not charge arbitrary or capricious action on the part of the parent organization, the plaintiff's bottom charge being the claim that what was done was unlawful as being in violation of some broad principle called the law of the land.\n\n\"In the spring, or prior, I think it is, to April, 1946, this condition in the Local Union had reached such a point that the parent organization summoned the members of the Local to appear before it at its Denver meeting of the Executive Council. In addition to the officers summoned to appear the Local Union sent four other representatives.\n\n\"I pass over the question of this fixing of the salary of these various officers because it is a subject-matter of a case which has been tried and which is now in the hands of the Supreme Court.\n\n\"Following this April meeting the parent body sent a committee to examine into the troubles in the Local Union in an attempt to reconcile the factions. After some action by that committee the International, Mr. MacGowan, wrote the letter of May 8th. The local union, I think, might have taken the attitude that it was rather a suggestion than order. They did not follow the suggestion.\n\n\"Whereupon we have the letter of May 20th, which I think may indicate may have some element of spleen in it, for what was suggested on the 8th becomes an order of May 20th. Then we have some more litigation.\n\n\"The committee came to Seattle, interviewed various persons, and eventually makes a report. This report carries a number of recommendations. It is passed from the committee of three to the whole Executive Council, the whole Executive Council approves it, the President approves it. The local continues its fight against it.\n\n\"It has been argued, why I don't know, but there is, rather from the plaintiff's standpoint, that the action of the International body followed hard upon the appeal by the Local by the Local from the decision in the case now before the Supreme Court. Mr. Bassett: The salary case. The Court: Yes. It does appear that that action may have been one of pique over the fact that the Local, having lost before the trial court, had decided to press its appeal. But this committee had found certain things of an irregular character in the administration of the Local Union. As to some of its findings this element of suddenly getting religion; but as to several of them, namely, the fact that the Local in 1942 had, for the purpose of fighting the parent, sequestered this $100,000.00 put it in a position where it could be used by agents of the Local and not checked out through the regular channels. They found that on another occasion this $10,000.00 incident had occurred. They had reason to believe that there was dissension in the Local Union, perhaps the result of inability of the elected officers to maintain order in meetings. In any event, they found that the affairs of the Local were considerably disturbed.\n\n\"The plaintiff asked injunctive relief. He is met at the threshold by the claim on the part of the defendant that he has not exhausted the remedies within the organization.\n\n\"With regard to the exhaustion of the remedy before this affiliate body, which is the Council, the courts will not require the taking of a vain and useless step. That council selected its own committee to make an investigation. It had unanimously agreed with the findings and recommendations of that committee, and pursuant to those findings and recommendations had taken the action here complained of. I think it is idle, gentlemen, and vain to think that these people who feel thus aggrieved by that action should have to waste their time in arguing to that same committee.\n\n\"As to the further right of appeal to the whole Union in convention, it appears that there are six or seven hundred lodges or Locals; that the opportunity to put their case before them in advance and call their attention to it is limited, because before they may circularize the other Locals they have to get consent of the executive head, and possibly of this Executive Committee, at least of the executive head, who has already ruled on this matter. Coupled with that there is a very definite uncertainty as to when this meeting will take place, whether it will occur next year or some other time.\n\n\"I conclude that they do not have to go through that rather vain process before seeking redress in the civil courts.\n\n\"Now, a great deal has been said here touching the subject of the democratic way and due process and numerous references to what might ordinarily be done under what may be called a democratic system.\n\n\"But this is no democratic scheme. It may have been initially a confederation of various groups of men possessing similar skills in various portions of the country, or maybe the world.\n\n\"These people having convention after convention over fifty years gradually evolved what is now this Constitution, and they agreed to it. It may be that some individual who, during the stress of the recent war, sought a job in some shipyard had nothing to do with the organization of this Constitution. He may not have known what it was. He may have been forced to join for want of an option, but he did, and he secured the fruits of this organization. At least the people here complaining do not represent that type.\n\n\"Now, this Constitution, I will state again, is something not in its present shape a confederation, an organization starting from the top down. You are first a member of this International Union. Like an army, you may be presently\n\nsubdivided into companies or divisions of Local lodges. Powers are vested in the Executive Council.\n\n\"Sec. 6. 'The International Executive Council shall be empowered to charter' various lodges.\n\n\"Sec. 7. 'The International Executive Council shall have supervision over the Order when the International Brotherhood is not in session.'\n\n\"That means all of the time except when one of these conventions, seven or eight years apart, is in session 'They shall have the power to pass on any subject, proposition or grievance, hear and determine all cases of appeal from the decisions and rulings of the Subordinate Lodges, or against any Officer of this International Brotherhood,' and so on.\n\n\"Then under the recent amendment, as I understand it, these conventions have further done this, they have vested the following powers in the International President, being a part of Section 1, Article IV:\n\n\"'He shall be empowered to suspend Subordinate Lodge meetings, appoint officers pro-tem of both the International Brotherhood and of Subordinate Lodges and all committees not otherwise provided for, including governing boards for Subordinate Lodges whose meetings may have been suspended. . . . and be empowered to suspend their individual members, officers or Lodges when, in his judgment, the actions of such member, officer or Lodge are in violation of the International Constitution or the Subordinate Lodge Constitution, or are in violation of the declared policies of our International Brotherhood.'\n\n\"Now, gentlemen, they just gave him a dictatorial power, but they did it purposefully, intentionally, with their eyes open, in order to accomplish the purpose for which these men had banded together.\n\n\"The plaintiff prays that the defendants, their agents or representatives, be permanently restrained and enjoined from:\n\n\"First, suspending the duly elected officers;\n\n\"Second, suspending the meetings of the Lodge;\n\n\"Third, suspending the 104 Reporter;\n\n\"Fourth, from seizing, or attempting to seize, the funds, properties and records of the Lodge;\n\n\"Fifth, interfering, directly or indirectly, with the right of the lodge to manage it own affairs, and/or dispose its funds in accordance with Subordinate Lodge Constitution.\n\n\"I think, gentlemen, there is a line here, namely this: that when we come to a consideration of disciplinary action the power has been vested in the International Council and\n\nin the executive head, the President, to act when, in his judgment, conditions within the Local justify it in so acting, but he may not touch the property or the assets of the Local. That, until there is complete and final dissolution, is the property of the Local.\n\n\"My conclusion is that the prayer of the complaint as to items 1, 2 and 3 must be denied; that the prayer in item 4, restraining the International from seizing, or attempting to seize, the funds properties, books and records of Lodge 104, must be granted.\n\n\"In other words, in its disciplinary action it may appoint this governing body, but it cannot touch a cent or a penny of the funds, or take control of any of the property of the plaintiffs.\n\n\"There is within the body of this complaint a suggestion, and there is some evidence, that the defendants have suspended various and sundry members of the Local without trial.\n\n\"The order may go to this extent: that the International is restrained from suspending these persons, not as officers but as workers or as members, without first having preferred definite charges against them and having those charges heard.\n\n\"You may present this order, gentlemen.\n\n\"Mr. Bassett: I don't think Your Honor covered 5. Did Your Honor mean that 5 is included in 4? The Court: Well, I think probably that is excluded by the others. While this governing body is here there isn't anything for the officers to do. Mr. Bassett: Well, they would control the funds then, I take it? The Court: Who? Mr. Bassett: The governing body then would control the funds and disburse the funds? The Court: No, the governing body doesn't touch the funds. Mr. Bassett: Who is going to do it? The Court: I don't know. And I am not concerned. I am following the Constitution here, and I am not going any further. Mr. Chadwick: Your Honor would not speak, then, as to whether the governing body shall currently collect the dues, whether the governing body should currently pay the rent, or pay the salaries of such officers as may be involved? The Court: I don't know why the governing body is concerned with paying the rent. Mr. Chadwick: Well, just the office and maintain a service. The Court: Then they can pay it themselves. Mr. Chadwick: They will have to collect it from the members some place. They are members of this Local. The Court: Well, I am concerned about this, Mr. Chadwick: Their taking over has no terminal limit to\n\nit. They haven't stepped in and say, 'We are going to fix this up and restore the Lodge to its functions within six months, six weeks,' or something of that sort. They may be here forever. If the governing body has power to collect dues, let them collect them. This court will not cross the bridge until it gets to it. But their funds, the money, the property, the assets of the Local you may not touch them for any purpose. Mr. Chadwick: As now on hand? The Court: Yes, sir. Mr. Mills: In other words, that is as to funds of the plaintiff today? The Court: That's right, sir. Mr. Mills: I point this out to Your Honor specifically, unless those are collected and the cards sent in it would work a hardship upon the men. The Court: I think that is probably true.\n\n\"Mr. Mills: And may I point out in that same connection, this injunction as to the funds, property, books and records, that for the purpose of preserving the continuity of the dues, receipts, and the books of the office with reference to the current status of individual members, would have to be in the hands of the Governing Board. In other words, as I construe it, Your Honor's intention is to cover the funds, their bank accounts, their bonds, their stocks, all that; but certain of the books and records will be absolutely essential in order to continue -- The Court: (Interposing) You mean such a list of members? Mr. Mills: The list of members, the record as to the dates to which they are paid up as members, the minute books, and their records, and so forth. The Court: The minute books? No. I think that is the property of the Local. Mr. Chadwick: Well, if the Governing Board is given access to the membership records they will not be disturbed, of course. I mean they will not be taken from them in any way. But for the purpose of giving continuity to the members we must have them. The Court: My reason for this, gentlemen, is this, that no money shall be drawn out unless the draft is drawn by the President and Treasurer of the Local Lodge. Mr. Bassett: They have been suspended, Your Honor, under your decree. The Court: All right, they have been suspended; but, nevertheless, the money that belongs to these people goes out through that channel, and that channel only. Mr. Mills: Unless the International Secretary-Treasurer should direct otherwise. Did Your Honor see the exception on that? The Court: Well, I believe somewhere here. Mr. Mills: It is in that same Article. Mr. Chadwick: If the present funds are now set aside and not used for any purpose I feel we can work out something\n\nthat will permit of operation and it will be straightened out.\n\n\"The Court: As to anything more than the dues which these men have to pay to the International -- Mr. Bassett: (Interposing) They pay the dues to the Local and then the Local sends it in. We going to do that? Is that the Governing Board's function now or the officers'? The Court: Gentlemen, I am not going to go into the management of this organization. Mr. Bassett: I understand that, Your Honor. I am sorry Your Honor didn't hear me a little further on the one point in the case. I saw the point that was troubling you. You seemed to consider that any provision in the constitution, regardless of how dictatorial it is, or what rights it deprives the men of, or Lodge, it must be enforced. Other courts -- The Court: (Interposing) You don't believe it. Mr. Bassett: I wanted to cite two or three cases. Now, there is one case -- The Court: (Interposing) I have heard a great many of them and read others. Mr. Bassett: The Indiana case passed on this very constitution, this very organization, where they tried to do this very thing, and Your Honor has held in effect there has been no trial of the issues for which these people were suspended. You said the salaries are in the Supreme Court. We are not concerned with that. The rest they didn't hear about until May 20th. They didn't know what recommendations were being made. And, as I say, this Indiana case involved this very constitution. The Supreme Court of Indiana held that such action was void and invalid, contrary to fundamental law. Mr. Chadwick: You read that case. Mr. Bassett: Yes, I read that case. The Court: Gentlemen, I have listened to you for ten days, and not any further on this. I am concerned about this: The mechanics of any operation in the future that in anywise interferes with the right of any man to work at his trade. Mr. Bassett: I understand that, Your Honor.\n\n\"The Court: Now, I haven't closed my mind to any detail as to that. There should be, so far as these men pay dues to the parent body, the method of doing that should be left open and clear so that they don't get themselves into any condition where they are handcuffed in that regard. Now, beyond that I don't think that this International body has any right to touch the dues. Mr. Henry: Your Honor means the portion that goes to the Local should go to the Local? The Court: That's right. Mr. Henry: And not to the Governing Board? The Court: That's right. Mr. Mills: But as to the mechanics of collecting, it could be collected by the Governing Board and set aside and preserved?\n\nThe Court: That is right. Mr. Bassett: The portion that belongs to the Local comes into the Local's treasury, is that right? The Court: Yes. Mr. Mills: Through the Governing Board to the Local. Mr. Bassett: I call Your Honor's attention to the temporary injunction in this case, -- The Court: (Interposing) Yes; which concluded, I understand, at the time this trial began. Mr. Bassett: No, it wasn't. Judge Wilkins put that condition on it four or five months after it had been in force for no good reason at all, except that he said it would work a hardship on the party against whom the injunction was granted, because it would remain in force until the appeal had been taken to the Supreme Court. The statute made it so, and the Supreme Court has construed the statute and has held that it was all right to do that, that was the purpose of the statute. It was based upon good reason. Now, we feel, Your Honor, -- I am not complaining about Your Honor's -- The Court: (Interposing) I understand. I thought about this very thing, Mr. Bassett, but I don't know what I can do about it. Mr. Bassett: Can't Your Honor keep that temporary injunction in force pending an appeal? I say that for this reason: I don't think we are going to be able to operate on a practical basis. I think we are going to have more confusion than we ever had. The Court: I think you are, too. Mr. Bassett: And I have a lot of respect for what Your Honor said, you construed that constitution in that way. I believe the Supreme Court, in view of what it said in the Furniture Workers case, will say this provision that says this International can do anything -- The Court: (Interposing) Mr. Bassett, as a practical thing, go on with your appeal. What do you lose in the interim? Mr. Bassett: Well, management, and a little confusion exists, maybe a lot of confusion. Now, we have got 24 or 25 men on this Board, haven't we, this Governing Board? Those persons have lost their status, I suppose, as officers because Your Honor says they have a right to suspend them without a hearing or trial, but they have no right to suspend them as a member without a hearing or trial. The Court: That's right. Mr. Bassett: And, of course, they have got to step out. Can it elect new officers? The constitution forbids it to do that. The Court: That's right. It is the constitution, not one I made. Mr. Bassett: We are up against a very tough proposition. The Court: I realize that. Mr. Mills: We have officers protem that were appointed for the suspended officers and elected by the Governing Board as contemplated. Mr. Bassett: So far as the 104 Reporter is\n\nconcerned, no money has been used for the publication of that. The temporary injunction took care of that. It forbade the use of any funds for that purpose, and the Local has gotten along fairly well, even though the President has been appointed to the Board and the Secretary is still Acting Secretary of the Local. They have co-operated to sign the necessary checks pursuant to the temporary injunction, they have paid the overhead expenses and the salaries, and everything has remained in status quo.\n\n\"The Court: I am concerned now about this matter of the status quo. I don't see where it is particularly involved under this, Mr. Bassett. Nobody is going to walk off with anything. Mr. Bassett: Haven't these officers lost their jobs as officers? The Court: They may have as individuals. It is my opinion that the International have the right to do what they have done. Mr. Bassett: Without any trial or notice? The Court: If the Supreme Court decides contra then they have just lost nothing. They can enforce their claims. Mr. Bassett: What are we going to do when we assume that the Supreme Court decision in the other case remains the same after a rehearing? What about the salary question. Of course, we won't have any officers from now on out. This Local won't be paying any officers. We don't have any. The Court: You are making money. Mr. Bassett: Somebody is going to have to collect those dues no doubt. Who is going to collect the dues? Mr. Henry: Speaking of the status quo, the members who belong to the organization are not able to determine how that money shall be spent. Mr. Chadwick: It will remain intact. The Court: It will remain intact until this is settled. If they are not functioning as a Local while this control is on by the International their money won't rust away; it will keep. Mr. Bassett: Who is going to collect those dues initially before the division is made? The Court: I think the governing body will collect them. Mr. Bassett: And then pay us our share of it? The Court: I am quite sure they will. They want their cut out of it. Mr. Bassett: And they will pay the Local's share out of it except what the International is entitled to? The Court: All except what the International is entitled to goes to the Local's funds. Mr. Bassett: We have got to have a depository of some kind. The Court: You have them already. Mr. Chadwick: Yes, you have them. Mr. Bassett: Yes, but if they are suspended they can't act. The Court: They can be deposited to your credit at the depositories the Local has already designated.\"\n\nOn November 17, 1947, the trial judge entered the following decree:\n\n\"This matter having come on duly and regularly before the above entitled court for trial, plaintiffs appearing by Bassett \u0026 Geisness and Edward E. Henry, their attorneys, and the defendants International Brotherhood of Boilermakers, Iron Ship Builders and Helpers of America, Homer Parrish and Walter B. Toner appearing by Chadwick, Chadwick \u0026 Mills, their attorneys, the defendants Charles J. MacGowan and William Williams not having been served and not appearing, and the defendants Seattle-First National Bank and Peoples National Bank of Washington appearing of record by Emory \u0026 Howe and Graham, Green, Burnett, Howe \u0026 Dunn, their attorneys, respectively, but not participating in the trial; and the court having heard the evidence on behalf of the plaintiffs and the appearing defendants, and having heard the argument of counsel; and being fully advised in the premises, and having rendered its oral decision herein,\n\n\"Now, therefore, it is Ordered, Adjudged and Decreed that the prayer of the plaintiffs for an injunction enjoining the defendants from suspending from office the officers and representatives of Local 104, or interfering directly or indirectly with their administration of the affairs and activities of Local 104, be and the same hereby is denied.\n\n\"It is Further Ordered, Adjudged and Decreed that the prayer of plaintiffs' complaint for an injunction enjoining the defendants from suspending the meetings of Local 104 be and the same is hereby denied.\n\n\"It is Further Ordered, Adjudged and Decreed that the prayer of the plaintiffs' complaint for an injunction enjoining the defendants from suspending or otherwise interfering with the publication of the '104 Reporter' be and the same hereby is denied.\n\n\"It is Further Ordered, Adjudged and Decreed that the prayer of plaintiffs' complaint for an injunction enjoining the defendants from interfering either directly or indirectly with the right of Local 104 to manage its own affairs be and the same hereby is denied.\n\n\"It is Further Ordered, Adjudged and Decreed that the defendants International Brotherhood of Boilermakers, Iron Ship Builders and Helpers of America, Homer Parrish and Walter B. Toner be and they hereby are enjoined (subject to the right of access for the purpose of inspection in\n\nconnection with the duties of supervision, direction and audit) from seizing or attempting to seize, either by force or otherwise, the funds, properties, books and records of Local 104, save and except that the said defendants and the Governing Board as appointed for Local 104 shall be entitled to receive from Local 104 copies of membership records and records on the payment of dues and insurance and to proceed to collect from members of Local 104 dues and insurance payments and out of such payments to remit to the International Brotherhood its per capita share of dues and insurance and to remit per capita tax to the Washington State Federation of Labor, Seattle Central Labor Council, Seattle Metal Trades Council, and other like affiliated organizations to which Local 104 has heretofore regularly paid per capita taxes or contributions and to pay dues for those whom it has been the custom of Local 104 to carry on sick receipts; and further, save and except that the said defendants and the Governing Board as appointed for Local 104 shall be entitled to receive from Local 104 copies of records covering unemployment and eligibility for unemployment insurance, dispatching records and lists, records pertaining to the King County Medical Association and records to date on unemployment insurance and withholding tax payments made by Local 104, to the end that the Governing Board may proceed with the collection of dues and insurance and remittance of insurance and per capita payments and the orderly dispatching of members of Local 104 to employment, and the orderly administration of unemployment insurance and medical benefits; it being provided that all moneys received by the Governing Board in the collection of dues after the payments hereinbefore provided shall be deposited to the general account of Local 104 and that the funds, properties, books and records of Local 104, except as so specifically provided for, shall be maintained intact in their current status and said funds shall not be disbursed for any other purpose until such time as local autonomy shall have been restored by the International Brotherhood to Local 104, save and except that the officers of the Local Lodge may disburse the amount of $14,814.56 in payment of bills as rendered for costs incurred and attorneys fees.\n\n\"It is Further Ordered, Adjudged and Decreed that the International Brotherhood be and it is hereby enjoined from suspending or expelling any individual members of\n\nLocal 104 as members without notice given, charges, and the opportunity to be heard.\n\n\"Done in open court this 17 day of November, 1947.\n\n\"Robert M. Jones, Judge.\"\n\nPlaintiffs gave notice of appeal on the day the decree was entered. Defendants promptly cross-appealed.\n\nBoth parties attack the decree on a number of grounds.\n\nThe appellants contend that it does not go far enough, in that it does not permanently enjoin the Brotherhood and its officers and agents (a) from interfering with the duly elected officers of Local 104 in the administration of its affairs; (b) from suspending the meetings of Local 104; (c) from suspending or otherwise interfering with the publication of the 104 Reporter, the Local's weekly newspaper, without notice or charges or hearing; (d) from interfering, either directly or indirectly, with the right of Local 104 to manage its own affairs and disburse its own funds in accordance with the Subordinate Lodge constitution.\n\nThe appellants further contend that the court erred in entering a final decree depriving Local 104 of the right of disbursing any of its funds until such time as the Brotherhood shall restore local autonomy to Local 104. Other errors are assigned, but they are overshadowed by the contentions above listed.\n\nThe cross-appellants make five assignments of error, but their chief and all-embracing contention is that the trial court erred in entering any decree other than one summarily dismissing the action on the ground that the plaintiffs have not exhausted the remedies provided in the International constitution. We say that this is an all-embracing contention because, if approved, it would follow that the entire decree would fall, and, of course, the contentions of appellants that it was not broad enough.\n\nWe have, in our reports, decisions on both sides of this major question, and that seems to be true also of the law reports of the appellate courts of many other states. Among the first of our cases dealing with this question is Herman v. Plummer, 20 Wash. 363, 55 P. 315, a case decided by a per curiam opinion in 1898. This case did not involve a\n\nlabor union, but a branch of a national organization known as the Theosophical Society of America. The opinion reads, in part, as follows:\n\n\"At the close of plaintiff's case, on the evidence, a judgment of non-suit and dismissal was granted, and the present appeal is from that order and judgment.\n\n\"We think the order was properly made. Section 18 of the by-laws of the national society is as follows:\n\n\"'The executive committee shall be the court of final appeal in disputed questions arising between members of, in and between branches.'\n\n\"It is not pretended that any effort was made by the plaintiffs to have the questions involved in the present dispute determined by the committee mentioned in that section, and it is a well established principle, applicable to controversies like the present, that until the members have exhausted their remedy within the society the courts will not assume jurisdiction of the controversy. Oliver v. Hopkins, 144 Mass. 175 (10 N. E. 776); Lafond v. Deems, 81 N. Y. 507; Chamberlain v. Lincoln, 129 Mass. 70; Watson v. Jones, 13 Wall. 679.\"\n\nThe first of the cases cited in the final lines of the foregoing quotation, Oliver v. Hopkins, was decided on the authority of Karcher v. Supreme Lodge Knights of Honor, 137 Mass. 368, which involved a Kentucky incorporated benevolent association organized to unite fraternally all acceptable white men of every profession, business, and occupation; to give all moral and material aid in its power to its members and those depending upon its members by holding moral, instructive, and scientific lectures; and to promote benevolence and charity by establishing a widows' and orphans' benefit fund.\n\nLafond v. Deems involved the Independent Order of Rechabites. The object of that order was to secure mutual benefits in the exercise of temperance, fortitude, and justice, securing to its membership sympathy and relief in times of sickness and distress, and in the event of death the decent observance of the necessary funeral obsequies.\n\nChamberlain v. Lincoln was concerned with the Order of Good Templars, a corporation organized for promoting the cause of temperance.\n\nThe case of Watson v. Jones was a controversy between two factions of a Kentucky Presbyterian church as to which faction actually owned the church. The principal question raised was whether a Federal trial court had rightly taken jurisdiction of the cause, in view of the fact that the plaintiffs had not first exhausted their remedies in the courts of the Presbyterian church. The supreme court of the United States held that the trial court should not have taken jurisdiction, apparently upon the theory that civil courts are not qualified in ecclesiastical law, citing and discussing many cases from the Scotch and English law reports.\n\nIt was in such cases as the above that the rule contended for by the cross-appellants had its genesis; that is, cases in which persons had \"voluntarily,\" in every sense of the word, organized for some mutual, beneficial purpose, such as mutual insurance or to further some religious or moral program. It was held that, since they were not under compulsion to join the organization, but voluntarily did so, they, therefore, should comply with every rule and regulation, and especially those which bound them from seeking relief in the civil courts unless and until they had exhausted the remedies afforded them in their organization.\n\nIt appears in this record that the International Brotherhood has for some years had closed shop agreements with practically all the shipbuilding and ship repairing plants of the Pacific coast, and also with a majority of all boiler and other shops requiring skilled iron and steel workers in the states of Washington, Oregon, California, Idaho, Utah, Nevada, Arizona, and in the territory of Alaska. In those agreements, the employers agreed to employ members of the Brotherhood exclusively, and all such employees were required to be hired through the office of the local union. In short, a boilermaker had to join the union in order to work at his trade and support himself and his family. There was no other way for him to secure or retain a job. Did he join the union voluntarily, in the same sense that a man voluntarily joined a theosophical society, church, charitable organization or an organization to promote temperance or\n\na mutual insurance society? We think not. He was compelled to join in order to make a living.\n\nThe cross-appellants strongly rely on this court's comparatively recent decision in Constantino v. Moreschi, 9 Wash. 2d 638, 115 P.2d 955. In that case, it was clearly held that a local is prohibited from resorting to any local court of law or equity unless it has first exhausted the remedies provided by the constitution and by-laws of the International. In that case, however, the local and its members were expressly required by the constitution not to resort to any civil court until the remedies in the International constitution had been exhausted. The court quoted from the International constitution as follows:\n\n\"Article 13 provides in part as follows:\n\n\"'Section 1. This District Council, the officers or members thereof, and members or locals affiliated with the Council shall not resort to any court, whether in law or equity, in any matter involving a question arising out of his or its membership in this Council, in the International Hod Carriers' Building and Common Laborers' Union or in any Local affiliated with this Council until and unless he or it has first exhausted the remedies prescribed by the constitution, rules and practices of the International and the constitution and by-laws of the Council and the constitution and by-laws of the respective local.'\"\n\nIn this case, we do not find any such declaration in the International constitution. However, it does provide that the International Brotherhood has judicial powers and that its judicial powers, when not in session, are vested in the International council, which consists of the International president, assistant International president, and all of the International vice-presidents, of which there are thirteen.\n\nThere is also the following provision in  5 of Art. IV of the International constitution:\n\n\"Sec. 5. Any member, officer or Subordinate Lodge being suspended under this Article shall have the right of appeal to the International Executive Council and, if dissatisfied with the decision of the Executive Council on their appeal, they then have the right of appeal to the International\n\nConvention. The pendency of any such appeal shall not act to stay the order of suspension or revocation.\"\n\nUnder  1 of this article, the president is empowered\n\n\". . . to suspend Subordinate Lodge meetings, appoint officers pro-tem of both the International Brotherhood and of Subordinate Lodges and all committees not otherwise provided for, including governing boards for Subordinate Lodges whose meetings may have been suspended. He shall be empowered to deputize any member of the Order in good standing to perform any of the duties of his office which time and distance may prevent him from doing personally. He shall have the direction and supervision of all Subordinate and District Lodges, and be empowered to suspend their individual members, officers or Lodges when, in his judgment, the actions of such member, officer or Lodge are in violation of the International Constitution or the Subordinate Lodge Constitution, or are in violation of the declared policies of our International Brotherhood.\"\n\nWe find no requirement in the constitution that such suspensions must be preceded by notice of charges or trial or some adequate form of hearing.\n\n[1] In its oral decision, the trial court dealt with the matter now under inquiry, as follows:\n\n\"With regard to the exhaustion of the remedy before this affiliated body, which is the Council, the Courts will not require the taking of a vain and useless step. That Council selected its own committee to make an investigation. It had unanimously agreed with the findings and recommendations of that committee, and, pursuant to those findings and recommendations, had taken the action here complained of. I think it is idle, gentlemen, and vain to think that these people who feel thus aggrieved by that action should have to waste their time in arguing to that same committee.\n\n\"As to the further right of appeal to the whole Union in convention, it appears that there are six or seven hundred lodges or Locals; that the opportunity to put their case before them in advance and call their attention to it is limited, because before they may circularize the other Locals they have to get consent of the executive head, and possibly of this Executive Committee, at least of the executive head, who has already ruled on this matter.\n\nCoupled with that there is a very definite uncertainty as to when this meeting will take place, whether it will occur next year or some other time.\n\n\"I conclude that they do not have to go through that rather vain process before seeking redress in the civil courts.\"\n\nWe are in agreement with the trial court's ruling above quoted. The principal points made by the court in the foregoing statement find support in our own decisions and in the decisions of many other courts.\n\nIn a controversy between Local 104 and the International Brotherhood, that is, the same parties involved in this case, decided in 1930 (Local Lodge No. 104 etc. v. International Brotherhood of Boiler Makers etc., 158 Wash. 480, 485, 291 P. 328), this court said, among other things:\n\n\"It appears from the evidence that the international convention of appellant, which would normally have convened during the year 1928, was regularly postponed, and that no other international convention would convene until sometime during the year 1931. Under these circumstances, we think this a proper case for the application of the rule laid down in 19 R. C. L., at p. 1231,  41, to the effect that, if the procedure outlined by the constitution of the organization is so complicated, and the expense and delay incident to the invoking of such machinery are so great, as, all being considered, to amount practically to a denial of justice, and indicate clearly that the procedure provided by the organization fails to provide adequate redress, the party deeming himself aggrieved may resort to the courts of the forum in the first instance. Under the circumstances disclosed by this record, we hold that respondent was not required to present its claim to appellant's international convention, but was, at the time it instituted this action, justified in invoking the aid of the courts of this jurisdiction. This conclusion is supported by the following authorities: Brown v. Supreme Court I. O. F., 176 N. Y., 132, 68 N. E. 145; Lindahl v. Supreme Court I. O. F., 100 Minn. 87, 110 N. W. 358, 117 Am. St. 666, 8 L. R. A. (N.S.) 916.\n\n\"It is also true that the rule which requires members of voluntary associations to exhaust their remedies within the order before applying to the courts for relief, applies primarily to controversies concerning matters of internal\n\ndiscipline, and not to disputes over money or tangible property, and that, in the latter class of cases, the right to resort to the courts should be held to be waived only by an express agreement to submit such controversies to some specified method of arbitration. The sections of appellant's constitution upon which it relies in connection with its contention which we are now discussing would seen to concern matters of internal discipline only, and not controversies such as this, based upon a written indemnity agreement uttered by appellant for a valuable consideration. Under the circumstances disclosed by this record, we therefore hold that this controversy is not governed by the provisions of appellant's constitution above quoted. 19 R. C. L., 1225 ( 38); Roxbury Lodge No. 184 I. O. O. F. v. Hocking, 60 N. J. Law 439, 38 Atl. 693.\"\n\nIt is said in appellants' brief, and since it is not denied in the cross-appellants' brief later filed, and much of the statement is supplied by the evidence in the case, we accept it as true, that:\n\n\"The International Executive Council meets annually unless conditions warrant special meetings (International Constitution, Article I, Sec. 7). There is no provision in the constitution that gives any members of the brotherhood the right to call a special meeting to hear his appeal.\n\n\"The suspension of the meetings of the Lodge, the appointment of the governing board, and the suspension of the officers were made upon the recommendation of the committee of the executive council and were unanimously approved by the members of that council.\n\n\"A convention of the Brotherhood is held every four years on the first Tuesday in September unless otherwise provided for by the Brotherhood (Art. II, Sec. 1, International Constitution, Exh. 5).\n\n\"These conventions have been frequently postponed. The last four conventions were held in the following years: 1925, 1930, 1937, and 1944. Thus, only two conventions have been held since 1930. All of them have been held in Kansas City, Missouri. The next convention is scheduled to be held in September, 1948. The Executive Council, on request of the International President, is now taking steps to have that convention postponed to early 1949, to be held in Montreal, Canada, so that the International and its membership can devote their time to campaigning\n\nfor the defeat of members of congress who supported the Taft-Hartley law.\n\n\"There is no provision in the constitution which fixes a time limit for the restoration of autonomy in a lodge after the appointment of a governing board. The President presides over the Executive Council and the Convention (Constitution, Article I, Section 5, Article II, Section 6 (Ex. 5)).\n\n\"Members of the Executive Council consist of the International President, thirteen International Vice-Presidents, and the assistant International President (Constitution, Article I, Section 5, and Article III, Section 5). All of the members of the Executive Council are under the economic control of the International President. He has the power, under Article IV, Section 6, to assign work to them in any section of the country under the jurisdiction of the Brotherhood.\"\n\nIn Furniture Workers' Union v. United Brotherhood of Carpenters and Joiners of America, decided in 1940, 6 Wash. 2d 654, 663, 108 P.2d 651, this court said, in part:\n\n\"The record shows that the constitution of the appellant brotherhood, which, as we have held in Cox v. United Brotherhood of Carpenters and Joiners of America, 190 Wash. 511, 69 P.2d 148, constitutes a contract between it and its members, provides for an appeal to the general executive board by a local which deems itself wrongly or unlawfully suspended, and from that board a final appeal to the general convention. But in such an appeal no stay of proceedings is allowed. It is provided, however, as follows:\n\n\"'Section 56. A member must exhaust his resources allowed by the constitution and laws of the United Brotherhood before taking his case to the civil courts.'\n\n\"The court has found in this case, and no assignment of error is directed at the finding, that the respondent union attempted to initiate an appeal and the brotherhood paid no attention to its communications. But, wholly apart from that, the court has also found that Local 1007 was deprived of its charter and records and its property seized without any notice, charges, trial, or other opportunity to be heard.\n\n\"It is the settled law that such arbitrary action is void. From the multitude of cases which could be cited, we select only those in which this very appellant or its officers were\n\ninvolved. Cox v. United Brotherhood of Carpenters etc., supra; Reichert v. United Brotherhood of Carpenters etc., 14 N. J. Misc. 106, 183 Atl. 728; Swaine v. Miller, 72 Mo. App. 446; Neal v. Hutcheson, 160 N. Y. Supp. 1007.\n\n\"It is equally well settled that resort may be had to the courts before exhausting remedies within the organization when the act of suspension or expulsion is arbitrary, unlawful, and void. Cox v. United Brotherhood of Carpenters etc., supra; Ray v. Brotherhood of Railroad Trainmen, 182 Wash. 39, 44 P.2d 787, and cases therein cited and quoted. This court and many others have held that exhaustion of remedies within the organization is not a prerequisite to an appeal to the courts when the procedure within the organization is expensive, slow, and subject to great delay. Local Lodge No. 104 etc. v. International Brotherhood of Boiler Makers etc., 158 Wash. 480, 291 P. 328, and cases therein cited. Nor is it necessary to exhaust the remedy within the organization where it appears that such procedure would be futile and vain. In so holding in Local No. 373 etc. v. International Ass'n etc., 120 N. J. Eq. 220, 184 Atl. 531, the court said:\n\n\"'The proofs in this case show, and they are not contradicted, that protests by the members to the International were not even replied to.' (Italics ours.)\n\n\"The court's affirmative answer to the first question involved in this appeal was clearly correct.\"\n\nThe facts of that case are quite dissimilar from the facts in this. Nevertheless, the case does support the trial court's ruling in the instant case, to the effect that the plaintiffs should not be required to exhaust their remedies within the organization, since those remedies would be futile and vain.\n\nSee, also, the opinion in Washington Local Lodge No. 104 etc. v. International Brotherhood of Boilermakers etc., 28 Wash. 2d 536, 183 P.2d 504, and cases therein cited.\n\nIn their brief, appellants state that the questions involved in this appeal are:\n\n\"(1) Is a provision of the constitution of an international trade union invalid where it provides that its international president may, without notice, charges or hearing, seize control of a local union, suspend its officers, its meetings and weekly publication?\n\n\"The trial court answered negatively.\n\n\"(2) Where the constitution of an international trade union makes no provision for notice of charges against a member, a local union or its officers and no provision for affording them any hearing, and the international president, without notice, charges or hearing, seizes control of a local union, deprives it of its funds, suspends its officers, its meetings and weekly publication, are such acts and suspensions void?\n\n\"The trial court answered negatively.\"\n\nIn their brief, respondents stoutly contend that the above are false issues, and, in support of that contention, say, among other things:\n\n\" The issues in the case were limited by appellants in the course of the opening statement.\n\n\"Appellants' position was asserted as follows:\n\n\"'. . . and if in the absence of any provision providing for trial, charges, hearing, the association fails to afford such hearing or trial or prefer such charges, then the suspension is void and of no effect. . . .\n\n\"'The Court: That is the only basis upon which you are here, Mr. Bassett?\n\n\"'Mr. Bassett: That's right, that is the only basis on which we are here.'\n\n\"Again in the opening statement of counsel for the respondents it is stated:\n\n\"'The complaint originally and the complaint with its present prayer relates to the suspension of the meetings of the Local and the appointment of the Governing Board. There is no claim that it is arbitrary, that it is capricious. There is no complaint that it did not comply with the law of the association. That was eliminated in their first amended complaint.\n\n\"'In this case I want to call Your Honor's attention to the fact that not only is there no allegation that this action was in any way arbitrary or capricious, but Mr. Bassett has specifically stated into the record in this case that they do not claim that it is arbitrary, and the complaint shows that it is within and authorized by the Constitution.'\n\n\"In answer counsel for appellants stated:\n\n\"'Counsel say I admitted we didn't charge it was arbitrary. Apparently they don't know the meaning of the word 'arbitrary' as I used it.\n\n\"'You don't have to allege it is arbitrary. If you take such action without trial, notice or opportunity to be heard, that is arbitrary action.' . . .\n\n\"Again, when counsel for the respondents was attempting to introduce evidence of the complaints made to the International President by a former president of Local 104 as to strife and turmoil within Local 104 (Dfts'. Ex. 42), counsel for appellants objected to the introduction of such evidence as not within the issues and in the course thereof stated:\n\n\"'Your Honor is simply determining here whether or not under the constitution they may legally suspend the meetings of this Local, seize its funds, suppress its publication, without any charge of any offense or showing that any offense was committed against the constitution, without any charges being preferred and a trial had on those charges. Now that is the issue. Your Honor is not reviewing the wisdom of their doing this or what provoked them to do it. That is wholly beside the point.'\n\n\"Again:\n\n\"'The Court: Well, Mr. Bassett, you say, of course, that you do not contend that the action of this Executive was arbitrary.\n\n\"'Mr. Bassett: It is only arbitrary because it was unlawful.'\"\n\nAs to the major questions raised, we have, in the record, the opinions of two of the judges of the superior court of King county. The oral opinion of the Honorable Robert M. Jones, judge of the superior court of King county, who tried the cause, has already been hereinbefore stated in full. At the very outset of the litigation, the plaintiffs moved that the defendants be ordered to show cause why they should not be restrained pendente lite. The order was issued by the Honorable Donald A. McDonald, a judge of the King county superior court. During the argument following the return thereto, two principal questions were raised: (1) Defendants contended that no injunction should, or could, be legally granted, because the plaintiffs had not exhausted the remedies provided in the International constitution. In ruling on that matter, Judge McDonald said, in part:\n\n\"Under the following Washington cases the plaintiffs were entitled to resort to the courts without exhausting their remedies before the International:\n\n\" Leo v. Local Union No. 612, 126 Wash. Dec. 466\n\n\" Ray v. Brotherhood of R. R. Trainmen, 182 Wash. 39\n\n\" Again, it seems to me that any remedy the plaintiffs have by way of appeal to the International President and Executive Board is futile, illusory and vain. They have clearly prejudged the case by acting without a hearing. In such case the rule that they must first exhaust their remedies within the Union, does not apply.\n\n\"Labor Unions, Dangel and Shriber,  186, 189\n\n\" Neal v. Hutchinson, supra.\n\n\"As to the appeal to the convention, our court found this condition so burdensome as to not require a plaintiff to comply with it before resorting to the courts. This, in a case involving the identical constitution in question.\n\n\" Local Lodge No. 104 v. I. B. B. M., etc., 158 Wash. 480.\n\n\" Corregan v. Hay, 87 N. Y. S. 956, the court commented on the fact that the plaintiff would have 'the expense of going to a distant city' as being too burdensome to require such action.\"\n\nDefendants further contended that the acts sought to be enjoined, that is, (1) suspending the duly elected, qualified, and acting officers of Lodge 104, or interfering, directly or indirectly, with the administration of the affairs and activities of such lodge; (2) suspending the meetings of Lodge 104; (3) suspending, or otherwise interfering with, the publication of the 104 Reporter; (4) seizing, or attempting to seize, either by force or otherwise, the funds, properties, books and records of Lodge 104, and/or the control and management thereof; (5) interfering, either directly or indirectly, with the right of Lodge 104 to manage its own affairs and/or disburse its own funds in accordance with the Subordinate Lodge constitution, are acts that are fully authorized and warranted by  1 of Art. IV of the International constitution, which reads as follows:\n\n\"Section 1. The International President shall countersign all orders for payment of money. He shall be empowered to suspend Subordinate Lodge meetings, appoint officers pro-tem of both the International Brotherhood and of Subordinate Lodges and all committees not otherwise provided for, including governing boards for Subordinate Lodges whose meetings may have been suspended. He shall be empowered to deputize any member of the Order in good standing to perform any of the duties of his office which time and distance may prevent him from doing personally.\n\nHe shall have the direction and supervision of all Subordinate and District Lodges, and be empowered to suspend their individual members, officers or Lodges when, in his judgment, the actions of such member, officer or Lodge are in violation of the International Constitution or the Subordinate Lodge Constitution, or are in violation of the declared policies of our International Brotherhood.\"\n\nIn ruling upon this contention, Judge McDonald said, in part:\n\n\"Can the provisions of this constitution provide for the suspension of a member without a hearing or the suspension of a local lodge's charter? I regard the appointment of a Governing Board and the suspensions of meetings as equivalent to the suspension of the charter, since the necessary effect thereof is to suspend the local autonomy during the Governing Board's existence. These provisions of the constitution, which confer power to suspend summarily a member, or a lodge charter, without notice or trial, are invalid, as being violative of the 'due process of law' requirement.\n\n\"63 C. J. 686, Sec. 55\n\n\" Bricklayers' P. \u0026 S. Union v. Bowen, 183 N. Y. S. 855, 861\n\n\" Cotton Jammers' and Longshoreman's Ass'n No. 2 v. Taylor, 56 S. W. 553.\n\n\" Gilmore v. Palmer, 179 N. Y. S. 1\n\n\" Swaine v. Miller, 72 Mo. App. 446\n\n\" Neal v. Hutchinson, 160 N. Y. S. 1007\n\n\" Lysaght v. St. Louis Operative Stone-Masons' Ass'n, 55 Mo. App. 538\n\n\" Fritz v. Muck, 62 How. Pr. 69, 74\n\n\" Kennedy v. Schroeder, et al., 35 N. Y. S. (2d) 835\n\n\" United Brotherhood v. Carpenters Local Union No. 14 178 S. W. (2d) 558\n\n\" Tabovda v. Sociedad Espanola DeBeneficencia Mutua, 215 P. 673\n\n\" Ellis v. American Federation of Labor, 120 P.2d 79\n\n\" Gardner v. Newbert, 128 N. E. 704\n\n\" Local No. 373, Int'l etc. Ironworkers v. Mtl. etc. Ironworkers, 184 Atl. 531\n\n\" Mayer v. Hansen, 20 N. Y. S. (2d) 698\n\n\" Kessler v. Brotherhood, 13 N. Y. S. (2d) 892\n\n\" Mayer v. Hutcheson, 18 N. Y. S. (2d) 691\n\n\" Spayde v. Ringrock, 270 P. 67\n\n\"And in Blek v. Kirkman, 148 Misc. at p. 523, 266 N. Y. S. at page 92, Cohn, J., said:\n\n\"'Where valuable rights are at stake, justice requires the giving of notice of charges and a hearing to a member upon whom an organization desires to impose disciplinary measures. This requirement exists independently of any provision to the effect in the organic law of the organization and any by-law which assumes to dispense with notice and hearing is unreasonable and void.'\n\n\"Our own cases are likewise determinative.\n\n\" Furniture Workers' U. L. 1007 v. United B. of C. and J., 6 Wash. 2d 654\n\n\" Cox v. United B. of C. and J., 190 Wash. 511.\n\n\"In the very recent case of Mursener v. Fiorte, the Honorable H. Alfred P. Dobson, Judge of the Circuit Court of Oregon, rendered on March 3, 1947, in a well reasoned decision, held the provisions of the constitution here in question invalid and restored to the local the management of their affairs, having ousted the Governing Board. A labor union is subject to the law of the land and the law of the land demands that the requisites of due process of law be met, to-wit: notice and a right to be heard.\n\n\"Defendants contend that, if it be held that the charter provisions are invalid, in any event, the hearings and investigation of the three vice-presidents took the place of due process of law. There is no claim that the members had notice, and a hearing. It is the absolute right of a member of a trade union of a lodge of a trade union to have notice of charges, to be heard and cross-examine.\n\n\"Labor Unions, Dangel and Shriber, Sections 179, 180.\"\n\nIt will be noted from the foregoing quotation that, during the hearing of the motion for a temporary injunction, Judge McDonald said: \"There is no claim that the members had notice, and a hearing.\"\n\nWhatever may have been claimed or not claimed at that hearing, it was vigorously claimed at the trial of the cause, and it is emphatically claimed on this appeal, that the members of Local 104 had notice of charges and the right to be heard. We quote from appellant's reply brief:\n\n\"II. No Notice of Charges Was Given and Hearing Afforded. A very substantial part of respondents' brief is devoted to this subject. At pages 31 to 56 they 're-state' the facts and at pages 108 to 122 they argue the matter. Neither\n\nthere nor at any other place in their one hundred and fifty-three page brief do they quote or set out the notice of specific charges which they claim was given, nor do they point out where in the record such notice appears.\n\n\"At pages 31 to 44, inclusive, of appellants' opening brief under the caption 'Defendants' Case' we attempted to make a fair statement of the facts upon which respondents relied to establish that notice of charges and opportunity to be heard were given. We there not only referred to the testimony but also quoted all the letters of the International president relative thereto except that dated March 11 (Defendants' Exhibit 16). Because in their brief respondents seem to attach a great deal of importance to this letter, and because they have not quoted it we now quote it here for the convenience of the court:\n\n\"'March 11, 1946\n\n\"'. . . President\n\nLodge 104\n\n6th and University Street\n\nSeattle, Washington\n\nMr. Joe Clancy, Financial Corresponding\n\nSecretary-Treasurer\n\nLocal 104\n\n6th and University\n\nSeattle, Washington\n\nMr. A. F. O'Neil, Business Agent\n\nLocal 104\n\n6th and University Street\n\nSeattle, Washington\n\nMr. Dan McKillop, Assistant Business Agent\n\nLocal 104\n\n6th and University\n\nSeattle, Washington\n\n\"'Dear Sirs and Brothers:\n\n\"'Under date of January 18, 1946, I addressed a communication to Lodge 104 which, among other things, contain a series of seventeen recommendations which were the result of a detailed investigation made by Vice President Williams, all having to do with the conservation of funds of Lodge 104 without the necessity of reducing the salaries of its full time officers.\n\n\"'This letter was read at the special meeting of Lodge 104 on January 26, 1946; the entire series of recommendations by International was repudiated by the members of Lodge 104 and the recommendations of the Board of Trustees of Lodge 104, providing for salary reductions, were\n\nadopted. Since that time newspaper articles have appeared and numerous complaints have been filed with this office with respect to this action.\n\n\"I, therefore, feel obligated to present this matter to the session of the International Executive Council, which will be held in the Cosmopolitan Hotel, Denver, Colorado, beginning Monday, April 8, 1946, and in order that the Council may have all the facts, I am directing the following officers of Lodge 104 to be in attendance at the Executive Council meeting on the above mentioned date, namely:\n\n\"'The President of Lodge 104\n\n\"'Financial Secretary-Treasurer, Joe Clancy\n\n\"'Business Agent, A. F. O'Neill\n\n\"'Assistant Business Agent, Dan McKillop\n\n\"'The name of the newly elected President of Lodge 104 is not known to me because this office has not been furnished the name of the member who was elected to fill the vacancy created by the resignation of Brother Leo Miller, and I am sending his copy of this communication to Secretary Clancy with the request that it be delivered to the President. The other three letters are being mailed directly to the interested parties.\n\n\"'Trusting that this request will be complied with and that the above named officers will be in attendance at the Executive Council meeting in Denver so that we may thoroughly explore this entire situation, I am\n\n\"'Yours fraternally\n\n\"'Charles J. MacGowan\n\n\"'International President\n\n\"'cc to:\n\nWilliam Williams, International Vice President\n\nWilliam J. Buckley, International Secretary Treasurer.'\n\n\"As the court will observe this letter is devoted exclusively to the salary issue which was the subject matter of the action for declaratory judgment decided by this court en banc on February 17, 1948, in said Cause No. 30178, entitled: ' Washington Local Lodge No. 104 etc. et al., Appellants, v. International Brotherhood of Boilermakers, etc. et al., Respondents,' 129 Wash. Dec. 755 (The same letter was in evidence in that action as Exhibit 27). It contains no charges whatever against any officer or against the Local itself, and, as it expressly stated, the sole purpose of the Denver 'meeting' of April 8 was 'to thoroughly explore this entire situation.'\n\n\"Respondents next refer to Defendants' Exhibit 43, which purports to be the minutes of the Denver meeting of April\n\n8, 1946, in which it appears that at the commencement of the meeting and before the contending officers and representatives of Local 104 were permitted to make their statements concerning the salary issue the International president warned them of the power vested in him under Article IV, Section 1, whereby he is authorized to appoint a governing board to administer the affairs of a local lodge, in the event agreement was not reached on the International proposal, namely, that the salaries of the Local's officers be restored to what they had been before reduced by action of the membership of the Local. (In his subsequent letter of May 20, 1946, Defendants' Exhibit 20, he repeated this warning in extremely blunt language, quoted in appellants' brief, pp. 42-43; and this quickly precipitated the action for declaratory judgment which is the subject matter of Cause No. 30178 of the causes of this court.) True, at that meeting the contending parties were permitted to freely speak their minds not only concerning the salary issue but also concerning the so-called 'turmoil and dissension' which had been engendered thereby and also concerning the right of the Local to petition for annual elections and a variety of other things. Such extemporaneous statements, however, can scarcely be called 'notice of specific charges' against any one.\n\n\"Referring to the Denver meeting, the respondents themselves say at page 39 of their brief: 'This action attempted to settle the salary matter and election issue.' And this, it would seem, confirms everything we have said about that meeting, namely, that it was not a trial on any specific charges of which notice had been given, but an attempt to find a solution of the salary and election issues. (Indeed, the so-called 'election issue' was not an issue at all but consisted only of a petition filed by a group of members of Local 104 asking the International to permit a new election, which the International Union, under the constitution, had no alternative but to deny, and this it promptly did. The salary issue as we have seen, was finally settled by this court.)\"\n\nIn view of the cross-appellants' repeated assertions that the appellants had notice of charges, and in view of the fact that cross-appellants introduced a great number of documentary exhibits, we have been somewhat surprised at being unable to find any charges in the record other than some broad and sweeping generalizations which might,\n\nsomewhat accurately, be referred to in the vernacular as \"shotgun\" charges, such as those in the letter addressed to each of eleven members of the Local, including some of its officers, directing them to appear before the three-man investigating committee at the Stratford hotel in Seattle. One of those addressed to Nick Hughes has been hereinbefore quoted in full, and the quotation is immediately followed by a partial transcription of what occurred at the so-called Stratford hearing. We say hearing, because the three vice-presidents of the International who conducted the proceedings repeatedly said it was not a trial but merely an investigation. As we have hitherto shown, when Joe Clancy appeared at the Stratford hotel, he was expressly told that the proceedings were not a trial but merely an investigation, whereupon he said that he would not testify in his own behalf or call any witnesses, since no evidence had been adduced against him and there was nothing to refute.\n\nIt is clearly established in the record that there were no trials conducted at the Stratford hotel. The proceedings there had were referred to by the three members of the committee sometimes as \"investigations\" and sometimes as \"hearings,\" although what they meant by the word \"hearings\" is not clear.\n\nOn January 9, 1947, that committee made a long report to the International president of their investigations made in Seattle during the previous year. It is not contended that a copy of this report was sent to Local 104 or its officers. They contend that they never knew of its contents until a copy was produced during the trial of this cause and entered in the record as \"Defendants' Exhibit 53.\"\n\nAs to Joe Clancy, the committee reported, in part, as follows:\n\n\"As a result of our investigation and findings with respect to Brother Joe Clancy, Register No. 161672, Financial Secretary-Treasurer of Lodge 104, as being incompetent, untrustworthy and incapable of performing the duties of Financial Secretary and Treasurer in a proper and efficient manner, and in compliance with the Constitution and By-Laws of the International Brotherhood; . . .\"\n\nHere are specific findings that Clancy is \"incompetent, untrustworthy and incapable of performing the duties of Financial Secretary and Treasurer in a proper and efficient manner.\" They were made ex parte on January 9, 1947, not to Clancy himself but to MacGowan, the International president, on the faith of which he, on the following February 20th, suspended Clancy from his office as Financial-Corresponding Secretary and Treasurer of Local Lodge 104, and ordered Clancy to immediately turn over to his successor pro tem, thereto appointed by MacGowan,\n\n\". . . all books, records, documents, funds, accounts and properties of Local No. 104 and of Boilermakers Washington Lodge Building Association, a fully owned subsidiary of and maintained for the benefit of Local Lodge No. 104, in your possession or under your control, together with all other indicia of office, and to forthwith cease and desist from the performance of any and all functions of such office, and to fully cooperate with your successor so named in securing such transfer of the functions of your office to the end that business for Lodge No. 104 may not be disrupted.\"\n\nThis, it seems to us, must have come to Clancy as a complete surprise. At least, we can find nothing in the record that the International had in any way notified him or informed him that he would be charged with being \"incompetent, untrustworthy and incapable of performing the duties of\" his office, or that there was any intention of removing him from office.\n\nAs we have hitherto shown,  1 of Art. IV of the International constitution authorized the International president to suspend Subordinate Lodge meetings, to appoint officers pro tem, to appoint governing boards for Subordinate Lodges whose meetings may have been suspended, and to suspend the individual members or officers of lodges. There appears to be no constitutional requirement of notice or hearing.\n\n[2] Appellants contend that the president's acts of February 20, 1947, were wholly without notice or hearing, and although cross-appellants say that there was notice of charges and hearing, we feel compelled to agree with appellants\n\non this issue. There is no doubt but that the top officers in the International were, for a period of years, greatly displeased with some of the officers of Local 104, and with some of the things done by and within the Local, and that their displeasure was made known to the Local, its officers and members from time to time. The Local, its officers and members, also knew that elaborate investigations and inquiries were made throughout practically all of the year 1946, but the Local, its officers and its members were not advised what reports were made to the International president or what recommendations were made to him by his investigating committee; nor, as far as we can learn from the voluminous record in the case, was anyone connected with the local union so advised or had any knowledge that the International was about to, or was threatening to, discipline the members or officers of the Local for any reason or upon any specific charge.\n\n[3, 4] There are not only a great number of decided cases dealing with the necessity of notice of charges and of hearing, but these subjects are treated at length, with footnote citations, in several of the standard works on Labor Law. We quote a few excerpts from Martin on The Modern Law of Labor Unions:\n\n\" 309. Proceedings to discipline members -- Necessity for notice and hearing. Where valuable rights are involved the most elementary principles of justice require the giving of notice of charges and a hearing to a member upon whom the organization desires to impose disciplinary measures. This requirement exists independently of any provisions to that effect in the organic law or rules of the organization, and indeed, any by-law which assumes to dispense with notice and hearing is unreasonable and void. The right to notice and hearing, which as was said exists independently of any provisions therefor, is nevertheless frequently provided for in the constitutions and by-laws of labor unions, the purpose being to preserve the rights of the members against arbitrary action to their prejudice on the part of the organization. So far as the requirements in this respect are not waived, a substantial compliance therewith is necessary. No member can be subjected to disciplinary measures, without giving him all the opportunities for defense,\n\nprovided by the regulations having relation to proceedings for such purpose. In accordance with these views, it is uniformly held that an expulsion of a member having valuable rights, without notice, or on insufficient notice, or without notice and hearing, or without a fair and impartial hearing, is void.\" p. 384.\n\n\" 310. -- Sufficiency of notice and service of notice. The notice required, is notice that the member is to be put upon trial at a specified time upon specified charges. It must contain a complete copy of the charges, otherwise it will be insufficient, and mere service of a notice on a member summoning him to attend a meeting of the tribunal vested with power to expel is not a sufficient compliance with a requirement that a copy of the charges be served upon a member against whom proceedings for expulsion are pending.\" p. 385.\n\n\" 286. -- Applications of rule. In applying the principles stated in the preceding section it is held that any rule or by-law providing for the exercise of disciplinary measures against a member or against a local branch of the union without hearing is void as against public policy. The commonest principles of justice require that no man shall be condemned without a hearing.\" p. 364.\n\nWe quote briefly, also, from Oakes on Organized Labor and Industrial Conflicts, pp. 59, 60:\n\n\" 53. -- charges; bill of particulars. -- No member of any voluntary association may be expelled or otherwise disciplined without a specific charge of the violation of the particular rules of the association creating the offense charged; and the by-laws frequently provide for service of notice or a copy of such charges.\n\n\" 54. -- fair trial; notice and opportunity to be heard. -- 'The law insures to every member of a voluntary association a fair trial, not only in accordance with the constitution and by-laws of the association, but also with the demands of fair play, which, in the final analysis, is the spirit of the law of the land.'\n\n\"He is therefore entitled to notice and opportunity to be heard in his own defense.\"\n\nWe quote also from Labor Unions, Dangel and Shriber, 203,  178:\n\n\"The trial of union members must be conducted fairly and impartially, without prejudice. Only so long as a union, in administering disciplinary measures, pursues in good\n\nfaith the methods prescribed by its laws, such laws not being in violation of the laws of the land or any inalienable right of the member, is its sentence conclusive.\"\n\nIn beginning his oral decision in the case, the trial judge said:\n\n\"It is to be remembered that plaintiff here does not charge arbitrary or capricious action on the part of the parent organization, the plaintiff's bottom charge being the claim that what was done was unlawful as being in violation of some broad principle called the law of the land.\"\n\nDuring the trial, appellants' counsel explained that they did contend that the acts of the parent organization complained of were arbitrary, in the sense that they violated the law of the land. They evidently so contended when the matter was before Judge McDonald on the motion for a temporary injunction; for, in his memorandum decision, Judge McDonald said:\n\n\"I regard the appointment of a Governing Board and the suspension of meetings as equivalent to the suspension of the charter, since the necessary effect thereof is to suspend the local autonomy during the Governing Board's existence. These provisions of the constitution, which confer power to suspend summarily a member, or a lodge charter, without notice or trial, are invalid, as being violative of the 'due process of law' requirement.\"\n\nThis was followed by a long list of authorities. That part of Judge McDonald's opinion has been quoted in full earlier herein, and, for that reason, will not be repeated at this point. The first of the citations is 63 C. J. 685, Trade Unions,  55, which reads, in part, as follows:\n\n\"An accused member of a trade union cannot be summarily fined, suspended, or expelled. Before he may be thus punished he must be given an opportunity to be heard in his defense, that is to say, he is entitled to a trial or hearing on the charges made against him, even though the laws of the union make no provision therefor; and this is particularly true where property rights are involved. A provision of the constitution or by-laws of a union providing for the suspension or expulsion of a member without hearing is invalid. The trial or hearing must be fairly and impartially conducted, by and before the officers or board empowered,\n\nor having jurisdiction of the particular charge, the suspension of a member by a board having no jurisdiction under the union's laws being void. Where required by the laws of the union, the accused member must be given an opportunity to challenge the members of the committee to whom the trial of the charges has been referred. Although the trial or hearing must be conducted in conformity with the laws of the union, it need not be conducted in conformity with strict legal rules. A trial for the expulsion of a member, based on charges of falsely accusing officers of a union, which was fairly conducted by the appropriate body in accordance with the laws of the union, is not rendered invalid by the presence on such trial body of the officers so accused. On the other hand, the presence of such officers on the trial board coupled with the fact that the trial was conducted by the board in a spirit of reprisal rather than judicial fairness, renders the judgment of such board void. A member on trial is entitled to be present at the hearings, and confronted with the witnesses, with the right to cross-examine.\"\n\n[5] The term \"law of the land\" is a broad principle. It is said, in 16 C. J. S. 1142, Constitutional Law,  567, to be synonymous with \"due process of law\":\n\n\" Synonymous terms. The term 'due process of law' is synonymous with 'law of the land,' a phrase appearing in many of the state constitutions. Other synonymous terms are 'due course of law,' 'due course of the law of the land,' and 'course of the common law.'\n\n\"Courts have sometimes made use of expressions which would indicate a view that the term 'the law of the land,' as used in the constitutions, referred to some particular body of law has been variously held to mean a law which hears limited, for that would deny any power in the legislature to amend or repeal old laws or to enact new ones. The correct interpretation is that the term was intended to perpetuate old and well-established principles of right and justice, by securing them from abrogation or violation.\"\n\nAnd it is further said, on p. 1143:\n\n\"Whatever difficulty may be experienced in giving to the term 'due process of law' a definition which will embrace every permissible exertion of power affecting private rights, and exclude such as is forbidden, it has been said that there can be no doubt of its meaning when applied\n\nto judicial proceedings, and as so applied due process of law has been variously held to mean a law which hears before it condemns, which proceeds on inquiry, and renders judgment only after trial; law in its regular course of administration through courts of justice, in accordance with the fundamental principles of free government; a course of proceeding according to those rules and principles which have been established in our system of jurisprudence for the protection and enforcement of private rights; a prosecution or suit instituted and conducted according to the prescribed forms and solemnities for ascertaining guilt, or determining the title to property; an orderly proceeding adapted to the nature of the case, in which the citizen has an opportunity to be heard, and to defend, enforce, and protect his rights; the administration of equal laws according to established rules, not violative of the fundamental principles of private right, by a competent tribunal having jurisdiction of the case and proceeding on notice and hearing.\"\n\nIn spite of the abnormal length of this opinion, it has not expressly dealt with a number of specific assignments of error by both parties, it being our impression that the real overshadowing question presented by the appellants is: Were the plaintiffs entitled to more extensive injunctive relief than the court granted? And that the all-embracing question presented by the cross-appellants is: Should the superior court trial judges have refused to entertain the action on the ground that the plaintiffs had not exhausted their remedies within the International organization?\n\nThe cross-appellants close their brief with the following statements:\n\n\"No greater benefit can be given to the members of Local 104 and of organized labor in general than a decision upholding the right of a parent union to enforce the laws of the organization, through patient and judicial determination as evidence in this case, by suspending the meetings of the Local, suspending its officers from office only, and appointing a Governing Board to safeguard and preserve the properties, funds and rights of the Local for the benefit of all of its members until harmony can be restored.\n\n\"It is respectfully submitted that the trial court erred in denying the Governing Board and the officers of Local 104 serving under the Governing Board the right to hold, manage and administer the funds, properties, books and records\n\nof Local 104 for the benefit of under the facts and the evidence in this case Local 104 and its members, and that that portion of the decree of the trial court sustaining the International's action in suspending meetings, suspending officers, appointing a Governing Board and appointing officers pro tem for Local 104, should be affirmed.\"\n\nWith reference to the first of the paragraphs above quoted, we question whether patient and judicial determination was exercised in this case. Furthermore, some of the Local's officers not only were suspended from office, but also from membership in the International as well, and, therefore, in view of the closed shop agreements, were barred from working at their trade.\n\nJoe Clancy, the duly elected, qualified and acting secretary-treasurer of Local 104, failed to comply with the directive of the International president of the Brotherhood, issued on February 24, 1947, commanding him to turn over the records and property of Local 104 to the chairman of the Governing Board, and the International president summarily suspended him as a member of the Brotherhood, although he had been a member of Local 104 since 1918.\n\nWilliam Miller, the duly elected and functioning secretary and dispatcher of Local 104, was summarily suspended as a member of the Brotherhood by telegram dated February 24, 1947.\n\nWilliam Briest, the Local's assistant secretary-treasurer, also having failed and refused to turn over the records and property of Local 104 in compliance with the directive of the International president, was summarily suspended as a member of the Brotherhood by telegram dated February 25, 1947.\n\nAngus MacKenzie, chairman of the board of trustees of Local 104 for seven years and a member of the Local for eighteen, declined to serve as a member of the Governing Board and to turn over to the board certain records and property in his possession. He was also summarily suspended as a member of the Brotherhood.\n\nNick Hughes was summarily suspended by the International president on February 26, 1947, on the ground that\n\nhe had presided at an alleged \"unauthorized meeting\" of Local 104. Thereupon the business agent appointed by the Governing Board wrote a letter to Hughes' employer advising of his suspension, and, as a result, his employer immediately discharged him, thus complying with the agreement between the employer and the International. He was out of employment for several weeks, but was certified to his former employer upon the issuance of a temporary injunction in this case.\n\nIt is true that these men are not individually seeking relief in this action, but the facts above noted tend to support appellant's position that  1 of Art. IV of the International constitution is invalid and does not legalize the things accomplished by President MacGowan in the two directives issued by him on February 20, 1947.\n\nSeveral of the men above listed were officers of the Local. Their property rights were involved in at least two ways by the summary orders of the International president acting under  1 of Art. IV of the constitution:\n\n(1) They lost their monthly salaries as officers. These losses were substantial as may be seen by referring to the opinion in the salary case, 28 Wash. 2d 536, 539, 183 P.2d 504. It is shown, on p. 539 of 28 Wash. (2d), that the secretary-treasurer (Clancy) received a salary of four hundred dollars per month; that the recording secretary and dispatcher (William Miller) received a salary of four hundred dollars per month; and that the assistant secretary-treasurer (William Briest) received a salary of four hundred dollars per month. The salary of William MacKenzie as chairman of the board of trustees is not shown, but there is evidence in the record in this case that he received seventy-five dollars per month.\n\n(2) All of them lost their right to work as boilermakers in the Pacific coast area, since the International had closed shop contracts with practically all of the employers of boilermakers on the Pacific coast.\n\nAmong the many decisions which induced Judge McDonald to grant the temporary restraining order is Gardner v. Newbert, 74 Ind. App. 183, 128 N. E. 704. It is of particular\n\ninterest because it involves a suspension of the charter of a local lodge by the very same International, that is, the defendant in this case. It is said in the opinion:\n\n\"It is averred in the complaint that the appellees had no notice whatever of the intended suspension of their lodge and of its members until the receipt of the telegram above set out from the acting international president. It has been repeatedly held that the expulsion or suspension of a member from a fraternal benefit association without notice or opportunity to be heard is void. The suspension being void, appellees' legal status was not changed, and they were not required to prosecute an appeal within the order before resorting to the courts for relief. Fales v. Musicians', etc., Union (1917), 40 R. I. 34, 99 Atl. 823; Holmes v. Brown, supra [146 Ga. 402, 91 S. E. 408]; Hall v. Supreme Lodge, etc. (1885), 24 Fed. 450; Pratt v. Amalgamated Assn., etc. (1917), 50 Utah 472, 167 P. 830. In the case at bar the attempted suspension was of a local lodge, but such suspension, if effective, of necessity deprived appellees of their standing and benefits and property rights in the order.\"\n\nPresumably, Judge McDonald had that case in mind when he said, in his oral decision granting a temporary injunction in this case:\n\n\"Can the provisions of this constitution provide for the suspension of a member without a hearing or the suspension of a local lodge's charter? I regard the appointment of a Governing Board and the suspension of meetings as equivalent to the suspension of the charter, since the necessary effect thereof is to suspend the local autonomy during the Governing Board's existence. These provisions of the constitution, which confer power to suspend summarily a member, or a lodge charter, without notice or trial, are invalid, as being violative of the 'due process of law' requirement.\"\n\nMany other case are cited by Judge McDonald in support of the foregoing statement. These may be found in the long quotation from his oral decision made earlier in this opinion.\n\n[6] Numerous decisions could be cited from our own reports as to the necessity of complying with due process or the law of the land in dealing with property rights. In the syllabus to Jones v. Leslie, 61 Wash. 107, 112 P. 81,\n\nAnn. Cas. 1912B, 1158, 48 L. R. A. (N.S.) 893, it is said: \"The right of employment in a laboring man is property.\"\n\nIn the body of the opinion, which was prepared by the then Chief Justice R. O. Dunbar, we find the following:\n\n\"This presents a case here which is purely a question of law. It would be well to remember, in the beginning, that it is fundamental that a man has a right to be protected in his property. This was the doctrine of the common law; is, and always has been, the law in every civilized nation. It is, of necessity, one of the fundamental principles of government, the protection of property being largely one of the objects of government. For the protection of life, liberty, and property, men have yielded up their natural rights and established governments. Is, then, the right of employment in a laboring man property? That it is, we think cannot be questioned. The property of the capitalist is his gold and silver, his bonds, credit, etc., for in these he deals and makes his living. For the same reason, the property of the merchant is his goods. And every man's trade or profession is his property, because it is his means of livelihood; because, through its agency, he maintains himself and family, and is enabled to add his share towards the expenses of maintaining the government. Can it be said, with any degree of sense or justice, that the property which a man has in his labor, which is the foundation of all property and which is the only capital of so large a majority of the citizens of our country, is not property; or, at least, not that character of property which can demand the boon of protection from the government? We think not. To destroy this property, or to prevent one from contracting it or exchanging it for the necessities of life, is not only an invasion of a private right, but is an injury to the public, for it tends to produce pauperism and crime.\"\n\nAs to expulsions without notice, see State ex rel. Rowland v. Seattle Baseball Ass'n, 61 Wash. 79, 111 P. 1055.\n\nIn Furniture Workers' Union v. United Brotherhood of Carpenters \u0026 Joiners of America, 6 Wash. 2d 654, 108 P.2d 651, where the Brotherhood suspended the plaintiff local union without notice of charges and without trial, the court held the suspension void, saying, in part:\n\n\"It is the settled law that such arbitrary action is void. From the multitude of cases which could be cited, we select only those in which this very appellant or its officers were\n\ninvolved. Cox v. United Brotherhood of Carpenters, etc., supra [190 Wash. 511, 69 P.2d 148]; Reichert v. United Brotherhood of Carpenters etc., 14 N. J. Misc. 106, 183 Atl. 728; Swaine v. Miller, 72 Mo. App. 446; Neal v. Hutcheson, 160 N. Y., Supp. 1007.\"\n\nThis case is also an authority in support of the appellants' contention that they were not required to exhaust their remedies within the organization before bringing an action in the civil courts.\n\nIn the decree, the trial judge, we think quite properly, protected the local union and its members by decreeing as follows:\n\n\"It is Further Ordered, Adjudged and Decreed that the International Brotherhood be and it is hereby enjoined from suspending or expelling any individual members of Local 104 as members without notice given, charges, and the opportunity to be heard.\"\n\nThe foregoing paragraph is preceded by a long paragraph which ordered, and again we think properly, that the defendants be enjoined from seizing or attempting to seize, either by force or otherwise, funds, property, books and records of Local 104, save and except that the defendants and the governing board should be entitled to receive from Local 104 copies of membership records and records on the payment of dues and insurance and proceed to collect dues and insurance payments from members of Local 104, and out of such payments to remit to the International Brotherhood its per capita shares of dues and insurance payments and to remit such per capita tax to the Washington State Federation of Labor, Seattle Central Labor Council, Seattle Metal Trades Council, and other like affiliate organizations to which the Local had heretofore paid per capita taxes or contributions, and that such funds as the Local received, except that certain bills, then properly due and payable, were authorized to be paid, should be kept intact by the Local until local autonomy shall have been restored.\n\nAs was stated at the far-away beginning of this opinion, the cross-appellants contend that the plaintiffs should not have been awarded any injunctive relief whatsoever, asserting,\n\nalso, that, on the merits, they were not entitled to any relief, and in any event that the court had no jurisdiction to award any relief, since the plaintiffs had not exhausted the remedies within the organization.\n\nThe cross-appellants also specifically attack that portion of the decree which enjoins the governing board from seizing the funds, property, books and records of Local 104.\n\nIn this case, the trial judge was confronted with a greatly confused situation. It is apparent that he desired to avoid curtailing the authority of the International body and also to protect the Local at the same time, and particularly its property rights, which, in addition to miscellaneous lodge property, chiefly consisted of bonds and cash amounting in value to more than a half million of dollars.\n\n[7] Although subject in various ways to the disciplinary power of the International, if legally exercised, it seems to us that, generally speaking, the Local should have the right to conduct its own affairs and hold its own property, and we further think that it should have access to our courts in such a situation as was presented by the actions taken by the president of the Brotherhood on February 20, 1947. In fact, we decided those matters in a case between the same parties, frequently referred to in this case as the salary case, in an En Banc decision rendered more than a year ago, affirming a previous Departmental decision handed down July 24, 1947 (Washington Local Lodge No. 104 etc. v. International Brotherhood of Boilermakers etc., 28 Wash. 2d 536, 546, 183 P.2d 504).\n\nThe appellants' prayer for relief on appeal is as follows:\n\n\"We respectfully submit that the judgment of the trial court should be reversed with instructions to enter a decree in accordance with the prayer of the plaintiffs' complaint.\"\n\nThe appellants' principal assignments of error are as follows:\n\n\"(2) In refusing to hold invalid Article IV of the International Lodge constitution pursuant to which the International President, without notice of charges and opportunity to be heard, seized control of Local 104, deprived\n\nit of its funds, suspended its officers, its meetings and weekly publication;\n\n\"(3) In refusing to hold void said acts of the International President whereby, without notice of charges against them and opportunity to be heard, he seized control of Local 104, deprived it of its funds, suspended its officers, its meetings and weekly publication;\n\n\"(4) In refusing to enter a decree permanently enjoining and restraining the Brotherhood and its officers and agents from\n\n\"(a) Suspending, without notice of charges and hearing, the duly elected, qualified and acting officers of Local 104, and from interfering, directly or indirectly, with their administration of the affairs and activities of Local 104;\n\n\"(b) Suspending, without notice of charges and hearing, the meetings of Local 104;\n\n\"(c) Suspending or otherwise interfering with the publication of Local 104's weekly newspaper, without notice of charges and hearing;\n\n\"(d) Interfering, without notice of charges and hearing, either directly or indirectly, with the right of Local 104 to manage its own affairs and disburse its own funds in accordance with the Subordinate Lodge constitution;\n\n\"(5) In entering a final decree authorizing the Brotherhood, through the governing board appointed by the International President, to assume, for an unlimited period of time, the control and management of the affairs and activities of Local 104;\n\n\"(6) In entering a final decree depriving Local 104 of the right of disbursing any of its funds until such time as the Brotherhood shall restore local autonomy to Local 104.\"\n\nThe trial judge made it very clear, in his oral opinion, that he particularly wished to prevent the defendants from suspending members of the union without first having preferred definite charges against them and affording them a fair trial; also, that he was reluctant to leave the Governing Board in control, stating at one point:\n\n\"The Court: Well, I am concerned about this, Mr. Chadwick: Their taking over has no terminal limit to it. They haven't stepped in and say, 'We are going to fix this up and restore the Lodge to its functions within six months, six weeks,' or something of that sort. They may be here forever.\" (Italics ours.)\n\nFollowing this statement, there was a colloquy between the court and the attorneys for both parties, in which an agreement was practically arrived at covering collection and disposition of dues while the governing board remained in control of the lodge. The agreement thereby arrived at, if we may properly speak of it as an agreement, was carried into the decree, appearing in the next to the last paragraph thereof.\n\n[8] Speaking generally, it is not within the province of the courts to regulate the internal affairs of labor unions or other voluntary organizations, but it is within the powers of the courts, and indeed it is their duty, to protect the property rights of the members of such organizations, when they are threatened and endangered, without specific charges and opportunity to be heard. It is true that no individual member of Local 104 is here seeking relief, but this is a representative or class action in which every member of Local 104 is, in effect, plaintiff. In reality, we have a controversy between the International and the members of the Local, that is, a controversy between the rank and file and the top flight officers of the International, and, like all family quarrels, it is extremely difficult to deal with. The boilermakers accomplished miracles of absolutely necessary production during the late war. If, as we think, the men who actually built the ships are in danger of having the control of their own Local permanently taken away from them without due process of law, or, at least, taken from them for a wholly indefinite period, they are entitled to all the protection that the courts can properly and legally give them.\n\nWe are, therefore, of the opinion that the decree should have granted substantially all of the injunctive relief prayed for in the second amended complaint.\n\nThe decree appealed from is reversed, and the cause is remanded to the superior court of King County, with instructions to set it aside and enter a decree in accordance herewith. However, such decree may repeat and retain certain portions of the original decree not inconsistent with this opinion, and should include the following lines from\n\nthe next to the last paragraph of the original decree, which read as follows:\n\n\"It is Further Ordered, Adjudged and Decreed that the defendants International Brotherhood of Boilermakers, Iron Ship Builders and Helpers of America, Homer Parrish and Walter B. Toner be and they hereby are enjoined (subject to the right of access for the purpose of inspection in connection with the duties of supervision, direction and audit) from seizing or attempting to seize, either by force or otherwise, the funds, properties, books and records of Local 104, . . .\"\n\nThe decree should also include the final paragraph of the original decree, which read as follows:\n\n\"It is Further Ordered, Adjudged and Decreed that the International Brotherhood be and it is hereby enjoined from suspending or expelling any individual members of Local 104 as members without notice given, charges, and the opportunity to be heard.\"\n\nDisposition\n\nReversed.\n\nSimpson, J. (concurring)\n\nI concur in the result.\n\nThe legal issues present here were decided in Washington Local Lodge No. 104 etc. v. International Brotherhood of Boilermakers etc., 28 Wash. 2d 536, 183 P.2d 504. The decision in that case is binding upon me until such time as this court decides to abide by its decisions in the cases of Herman v. Plummer, 20 Wash. 363, 55 P. 315; Kelly v. Grand Circle Women of Woodcraft, 40 Wash. 691, 82 P. 1007; Local Lodge No. 104 etc. v. International Brotherhood of Boiler Makers etc., 158 Wash. 480, 291 P. 328; Cox v. United Brotherhood of Carpenters \u0026 Joiners of America, 190 Wash. 511, 69 P.2d 148, and Constantino v. Moreschi, 9 Wash. 2d 638, 115 P.2d 955.\n\n",
    "body_length": 166947,
    "citedas": [
      "203 P.2d 1019",
      "33 Wash. 2d 1"
    ],
    "attorneys": "Bassett \u0026 Geisness and Edward E. Henry, for appellants. Chadwick, Chadwick \u0026 Mills, for respondents and cross-appellants. McMicken, Rupp \u0026 Schweppe and Mary Ellen Krug, for American Civil Liberties Union, amici curiae.",
    "category": [
      "242",
      "243",
      "75",
      "213"
    ],
    "judges": "En Banc. Robinson, J. Jeffers, C. J., Beals, Mallery, and Schwellenbach, JJ., concur. Hill, J., concurs in the result. Simpson, J., concurring. Steinert, J., did not participate.",
    "citation_count": 0
  }
}
