{
  "id": "HrOgTGYBTlTomsSBNUmj",
  "document": {
    "title": "Andresen v. Maryland",
    "full_title": "PETER C. ANDRESEN v. STATE OF MARYLAND",
    "jurisdiction": "Court of Special Appeals of Maryland",
    "date": "1975-01-10T00:00:00.000Z",
    "docket": "No. 152, September Term, 1974",
    "body": "The appellant, Peter C. Andresen, is an attorney at law in Montgomery County specializing in the handling of real estate settlements. On November 1, 1972, an information was filed against him charging four counts of false pretenses. On November 16, 1972, he was indicted by the Montgomery County Grand Jury on 17 additional charges. The indictment and the information were consolidated for trial.\n\nThe Washington Post had run a series of investigative reports in the early part of 1972 exposing various \"kick-back\" schemes, unnecessary charges to buyers and unethical relationships between lawyers, real estate brokers, title companies and developers that combined to plague the unsuspecting layman at real estate settlements. The series spurred bar association action in both the Maryland and Virginia suburbs of Washington. The Bi-County Fraud Unit,\n\nunder the joint auspices of the State's Attorneys Offices of Montgomery County and Prince George's County, launched a massive investigation into such practices. Because of extensive publicity arising out of all of these activities, the appellant's case was removed, upon his motion, to Frederick County for trial.\n\nAfter a trial before a Frederick County jury, presided over by Judge Samuel W. Barrick, which lasted a week and one-half, and produced (with its pretrial motions) over 1500 pages of testimony, the appellant was convicted of three counts of fraudulent misappropriation by a fiduciary in contravention of Art. 27, § 132, and of five counts of false pretenses. He received eight concurrent two-year sentences.\n\nUpon this appeal, the appellant lays down a sweeping barrage of 28 assignments of error:\n\n(1) That the counts in the indictment charging fraudulent misappropriation by a fiduciary failed to charge an offense;\n\n(2) That the evidence was not legally sufficient to sustain the convictions for fraudulent misappropriation by a fiduciary;\n\n(3) That the counts in both the indictment and the bill of information charging false pretenses failed to charge an offense;\n\n(4) That the evidence was not legally sufficient to sustain the convictions for false pretenses;\n\n(5) That certain physical evidence should have been suppressed because the search warrants were never admitted into evidence;\n\n(6) That certain physical evidence should have been suppressed because the warrants were \"general\" and violated the particularity requirement;\n\n(7) That certain physical evidence should have been suppressed because the Plain View Doctrine should not have been applied;\n\n(8) That certain physical evidence should have been suppressed because there was no probable cause for the issuance of the warrants;\n\n(9) That certain physical evidence should have been suppressed because the so-called \"nexus\" doctrine of Warden v. Hayden was misapplied;\n\n(10) That certain physical evidence should have been suppressed because its seizure violated his Fifth Amendment right against compulsory self-incrimination;\n\n(11) That the prosecutor's remarks in closing argument and in rebuttal argument were so prejudicial as to deny him a fair and impartial trial;\n\n(12) That nineteen separate errors (to be more fully discussed hereinafter) were made in the course of the court's instructions to the jury;\n\n(13) That the testimony of an alleged accomplice, Melvin L. Clark, lacked corroboration;\n\n(14) That the court erred in admitting the testimony of Melvin L. Clark because his testimony was obtained by an \"illegal agreement\";\n\n(15) That the State knowingly used the perjured testimony of a witness, Norman Hecht;\n\n(16) That the trial judge erred in not granting the appellant's motion for a continuance, thereby denying him both his right to a fair trial and to effective assistance of counsel;\n\n(17) That the trial judge abused his discretion in denying the appellant's motion for a severance;\n\n(18) That error was committed when an irrelevant transaction with Antonelli and Caniglia was admitted into evidence;\n\n(19) That the admission of the testimony of the witness Carl Zentz amounted to reversible error;\n\n(20) That the motions for judgment of acquittal should have been granted because of the \"best evidence rule\" and because of the lack of expert testimony;\n\n(21) That the appellant was erroneously denied his reservation of certain questions for the court en banc;\n\n(22) That the admission into evidence of portions of the testimony of John C. Connally was reversible error;\n\n(23) That the jury was coerced into reaching its verdict;\n\n(24) That the appellant was denied genuine and effective assistance of counsel;\n\n(25) That the court erred in denying the appellant's motions for judgment of acquittal;\n\n(26) That the court abused its discretion in denying the motion for a new trial;\n\n(27) That the sentence should be vacated; and\n\n(28) That the misconduct of the prosecutor required reversal of the convictions.\n\n1. Adequacy of Fraudulent Misappropriation Charges\n\nWe have no difficulty in upholding the facial sufficiency of the charges of fraudulent misappropriation by a fiduciary. Art. 27, § 132, provides, in pertinent part:\n\n\"If any . . . trustee . . . or any other fiduciary shall fraudulently and wilfully appropriate to any use and purpose not in the due and lawful execution of his trust, any money or any other thing of value which may come into his hands as such . . . trustee . . . or in any other fiduciary capacity . . . he shall be deemed guilty of embezzlement . . . .\"\n\nThe three counts charging fraudulent misappropriation, varying from each other only as to date and name of victim, each contained the following critical predicate clause:\n\n\". . . did unlawfully, while acting in the capacity of a trustee and fiduciary, embezzle and fraudulently and wilfully appropriate to a use and purpose not in the due and lawful execution of his trust for and on behalf of Seth L. Warfield and Ruey Warfield, the sum of two thousand dollars ($2,000.00) current money, of the value of two thousand dollars ($2,000.00) current money, of the goods, chattels, monies and property of Seth L. Warfield and Ruey Warfield, in violation of Article 27, Section 132 of the Annotated Code of Maryland . . . .\"\n\nShorn of convoluted verbiage and \"scatter-shot\" case citation, the kernel of this contention stands naked as a bald allegation. The appellant does successfully build an appellate launching pad, but then fails to get off the pad. In neither pretrial motions nor the trial upon the merits did the appellant attack these counts in terms of their facial adequacy. He points out correctly, however, that where the issue is the alleged failure of an indictment to charge an offense, the question is of jurisdictional dimension and is subject to appellate review even though not raised below. Phenious v. State, 11 Md. App. 385, 274 A.2d 658. Ironically, having established his right to raise the contention for the first time at the appellate level, the appellant then fails further to contend. In any event, it is clear that the counts were drawn precisely in the language of § 132 and did, therefore, adequately charge the relevant offenses.\n\nThe appellant veers off on another tack, not dealing with the facial adequacy of the charges as such but seizing upon their employment of the verb \"embezzle.\" With a brace of non sequiturs, he reasons that the use of the verb \"embezzle\" in charging violations of § 132 transforms the offenses into more classic embezzlements under § 129, and that his acquittal of companion counts drawn under § 129 operates as res judicata, barring convictions upon the counts now under review. He is guilty of both bad logic and bad law.\n\nWith respect to each of three sets of victims, the appellant was charged, with the all-inclusive caution typically shown by thorough charging documents, with (1) larceny after trust, (2) garden-variety embezzlement and (3) fraudulent misappropriation by a fiduciary. The trial judge instructed the jury as to the elements of these at-times complementary and at-times overlapping offenses. He advised them that although the appellant might be found guilty of one of these offenses with respect to each transaction, he should not be found guilty of two or three related offenses arising out of a single incident. He left it to the jury to pick the offense most applicable to the facts as found by them. When, therefore, the jury returned verdicts of guilty on the three counts charging fraudulent misappropriation by a fiduciary, they\n\nappropriately refrained from judicial \"overkill\" by remaining silent as to the charges of larceny after trust and classic embezzlement. Out of our law aimed at preventing double jeopardy emerges the principle that the silence of a jury as to a particular count is the equivalent of a verdict of not guilty as to that count. That very necessary fiction, salutary enough in guarding against double jeopardy, cannot, however, by a leap of logic, be deemed to be an explicit and positive verdict operating as a res judicata acquittal on a companion charge. The logic, sound enough for one purpose, has no applicability to the other purpose. A technical acquittal, based upon a jury's restraint in not piling on multiple convictions or alternatively upon the subsuming of lesser-included charges into a greater, does not carry with it the logical implications of an affirmative acquittal upon the merits. When compassion has tempered logic for the obvious benefit of a defendant, the defendant may not then with good grace argue from the result as if that logic had operated ruthlessly in a vacuum. To escape double punishment is not to be vindicated.\n\nEven if the appellant's logic were valid, however, the law would still frustrate his argument. Even if the acquittals on the embezzlement counts could be held to be based upon affirmative findings that the elements of embezzlement had not been established by the State and that, by necessary implication, the absence of proof of such elements would preclude convictions under § 132, the law simply does not demand consistency between the various verdicts rendered by a jury. The applicable law of the Court of Appeals, of the Supreme Court and of the leading authorities throughout the common law world was summed up by us in Mason v. State, 2 Md. App. 768, 771, 238 A.2d 138:\n\n\"In Ledbetter v. State, 224 Md. 271, it was held that a conviction on one count may stand even in the face of an inconsistent acquittal on another count. To the same effect, see Williams v. State, 204 Md. 55 and Leet v. State, 203 Md. 285. See also Dunn v. United States, 284 U.S. 390, 393, where\n\nMr. Justice Holmes held that consistency in the verdict is not necessary since the verdict may have been the result of compromise or a mistake on the part of a jury; and Steckler v. United States, 7 F. 2d 59 (2d Cir.), where Judge Learned Hand observed, at page 60, that 'the most that can be said in such cases is that the verdict shows that either in the acquittal or the conviction the jury did not speak their real conclusions, but that does not show that they were not convinced of the defendant's guilt.'\"\n\nWe perceive no frailty, of omission or commission, in the counts charging fraudulent misappropriation by a fiduciary.\n\n2. Legal Sufficiency of the Evidence Fraudulent Misappropriation Charges\n\nThe gist of the three fraudulent-misappropriation-by-a-fiduciary charges is that the appellant, as settlement attorney, took money from three sets of home purchasers with the understanding that he was to deliver to them titles free and clear of all encumbrances and that he misappropriated the purchase money to other purposes.\n\nMelvin Clark was the owner of the Clark-King Construction Company (hereinafter Clark-King). In the mid-1960's, Clark-King began using the appellant as its real estate settlement attorney. He soon became the exclusive attorney for its numerous real estate settlements. The appellant, moreover, did the title search on every large tract of land that Clark-King bought for development, as well as every lesser-included title search for each lot in those developments as the lot came up for sale. The appellant handled other work as well for Clark-King, preparing virtually all of its legal papers in connection with its real estate transactions, handling the settlement of its construction loans which permitted Clark-King to build new homes, and preparing the deeds of trust given as security for those loans.\n\nWith the advent of the tight-money market in 1967,\n\nClark-King began experiencing financial difficulty. It had to find a way to keep up payments to its contractors in order to keep them working on putting up new homes in the developments. Even as these difficulties were being experienced, fewer new homes were being sold to provide money for such purposes. Clark-King found itself sometimes unable to pay off all debts on a new home in order to give a free and clear title to the home buyer. The appellant and Clark-King reached an agreement to stave off disaster, whereby the appellant would maintain \"a running account,\" ostensibly laying out money for Clark-King so that a free and clear title could be delivered. Mel Clark testified that he thought this was a lending arrangement, under which the appellant would be repaid once sales improved. Clark thought that prior debts secured by deeds of trust on the various lots were being paid off so that good titles were being delivered at the time of settlement. These deeds of trust and other encumbrances were, indeed, listed on the seller's settlement sheet. The evidence revealed, however, that these encumbrances were frequently not being released.\n\nThe Clark-King development that concerns us in this case was an area known as Potomac Woods, Section 10. That section was divided into approximately 20 lots, three of which became the subjects of the fraudulent misappropriation charges now under review.\n\nThe first pertinent encumbrance was a deed of trust to the F. O. Day Company. On September 30, 1969, the F. O. Day Company loaned Clark-King $37,000 and received in return a $37,000 note. As security for that note, a deed of trust was executed on December 13, 1969, from Clark-King to F. O. Day Company on 16 lots in the Potomac Woods subdivision, including the three key lots in this case. Provisions were made for the release of any of these particular 16 lots, as that lot would come up for sale, by the payment of $2,000 on the note with the appropriate designation that the payment was being earmarked for the partial release of a particular lot. When Mel Clark personally made payment to the F. O. Day Company without any direction that the payment be applied to one of the lots in Potomac Woods, that payment\n\nwent toward the reduction of a more general $15,000 debt owed by Clark-King to the F. O. Day Company. The payments in the precise amount of $2,000 and the release of the deed of trust on particular lots almost always came from the appellant directly, in anticipation of a particular settlement, to the F. O. Day Company. The appellant, in fact, was the trustee for this particular deed of trust.\n\nMr. and Mrs. Richard Pollitt moved from New York City to Montgomery County in the spring of 1970. They signed a contract to purchase the property at 1976 Lancashire Drive, which was Lot 12, Block S, of the Potomac Woods subdivision (hereinafter the Pollitt lot). The contract drawn up by the real estate company designated the appellant as the settlement attorney. Mr. Pollitt indicated to the real estate company that he wanted his own attorneys, Bell and Bell, to handle the settlement. He was told by the real estate agent that Clark-King insisted upon having all of its settlements done by the appellant. The Pollitts then acquiesced in that arrangement. Physically present at the settlement was George F. Paxton, an attorney who worked for the appellant. The settlement took place on May 15, 1970. Mr. Pollitt paid $225 for a title search, which was handled by the appellant's office. Mr. Pollitt paid $175.23 for a title insurance policy, which was procured through the appellant. Mr. Pollitt received assurances that, aside from the purchase money mortgage he was then executing to the Equitable Life Insurance Company, \"there would be no clouds on the title.\"\n\nAmong the settlement documents was a Notice to Buyer and Seller as to Evidence of Releases to be Furnished Them and identifying the Pollitt lot as the subject property. That notice, required by Article 21, § 142, of the Annotated Code of Maryland, provided:\n\n\"In connection with the settlement of the sale and conveyance of title in this transaction, notice is hereby given:\n\nOne. That you are entitled to be furnished by Peter C. Andresen, the settlement attorney, evidence of recorded releases of mortgages or deeds of trust to\n\nbe obtained with all or part of the funds to be disbursed within thirty days from the date of delivery of the deed conveying title to captioned property.\n\nTwo. That if the recording of the releases will be delayed beyond the thirty-day period, a letter explaining the delay shall be mailed to you by or through this law firm within the thirty-day period.\n\nThree. That the procedure of mailing a letter of explanation each thirty days is necessary until the required evidence of recorded releases is furnished to you.\n\nFour. That if the evidence of a recorded release is not furnished you within the required period of time, you or either of you, or an organized Bar Association of the State of Maryland may petition a Court of Equity to accomplish this purpose.\n\nFive. That in the event that the funds are properly disbursed by said settlement attorney within five days from the date of delivery of the deed, the law does not require that you be furnished evidence of recorded releases unless you specifically request that we do so.\n\nThis notice is given to you pursuant to Section 42, Article 21 of the Annotated Code of Maryland. You are required to acknowledge that this notice was given you prior to the execution of the deed conveying title to the property.\"\n\nThere was an additional clause at the bottom of the notice which provided:\n\n\"We hereby waive being furnished evidence of recorded releases, having been assured by said settlement attorney that all funds in this transaction will have been disbursed within five days from the date of delivery of the deed.\"\n\nThe Assistant Treasurer of Equitable Life testified that she approved the loan of $39,000 for the Pollitts to purchase\n\ntheir new home. She pointed out that company policy would have precluded the loan unless it was to be a \"first trust loan.\" Following the normal procedure in such matters, Equitable Life issued explicit written instructions to the appellant, as settlement attorney, to apply the loan funds to that settlement only upon the condition that any prior encumbrances be released so that Equitable Life would hold \"a valid first lien against the first property without exception.\" The appellant was instructed to provide title insurance for the benefit of Equitable Life. Equitable Life received, through the appellant, a title insurance policy from the Title Insurance Company of Minnesota. The title insurance policy received by Equitable Life and the copy of the buyer's settlement sheet received by Equitable Life made no mention of the deed of trust to the F. O. Day Company or, indeed, of any other prior lien.\n\nThe Pollitts, and Equitable Life, only learned of the deed of trust to the F. O. Day Company in June of 1972, when the Pollitts had agreed to resell the property and were preparing for settlement. Their then attorney, David C. Galfond, searched the title and discovered the unsuspected encumbrance.\n\nSeth and Ruey Warfield encountered a similar experience. On July 1, 1970, they purchased the property at 1890 Milborough Drive, which was Lot 25, Block R, of the Potomac Woods subdivision (hereinafter the Warfield lot). They were advised by the real estate agent that the appellant \"was handling all settlements for that area.\" Although they were told that they could bring their own attorney to the settlement, they were further \"advised that we could but that it was an unnecessary expense.\" They decided to rely exclusively upon the appellant. The appellant was not physically present at the settlement but was again represented by his associate, George Paxton. The Warfields paid $55 to the appellant as a settlement charge, $225 to the appellant to examine the title and $90 to the appellant to procure title insurance. They also signed, at the suggestion of Mr. Paxton, the waiver of notice, \"having been assured by said settlement attorney that all funds from this transaction\n\nwill have been disbursed within five days of delivery of the deed.\" They were told that the notice was \"just another formality.\" The title search, the settlement sheet and the title insurance policy indicated that there were no encumbrances upon the property other than the purchase money mortgage which they arranged with Equitable Life. The Associate Treasurer of Equitable Life testified that they received the same assurances from the appellant and issued the same directions to the appellant with respect to the Warfield lot as they had received and issued with respect to the Pollitt lot. The Warfields were oblivious to the F. O. Day Company deed of trust until June, 1972, when they were alerted to the possibility of trouble by their neighbors, the Pollitts. They then obtained their own attorney to investigate the condition of their title.\n\nSince the appellant was not physically present at the settlements involving the Pollitt lot and the Warfield lot, a word is in order as to what the testimony revealed about the role of his surrogate, George F. Paxton. Paxton was, during the summer of 1970, a two-year graduate of law school, who had been working in the appellant's office since April, 1970. His \"main responsibility was to handle law suits that came into the office\" and, as the trial man, he \"did very little with the real estate end of the practice.\" On occasions, however, when the appellant \"was called out of town or wished to be away on vacation or had another suit or something like that,\" Paxton would physically preside over the settlements. He explained that he had no role in the preparation of any of the settlement documents (that task, according to him, was always handled directly by the appellant or by one of the secretaries working directly under the appellant), but that he could go through the pro forma procedures of a settlement, seeing to it that the deeds were appropriately signed and delivered and the checks were made out in amounts dictated by the settlement sheets and handed over to the appropriate parties. In terms of the substance of the settlements, his role was completely neutral.\n\nIn terms of evidence to negate ignorance or mistake on the part of the appellant with respect to the Pollitt settlement\n\nand the Warfield settlement, the testimony of Mel Clark was significant. He related that the settlements with him (as seller) were subsequent to and apart from the settlements with the buyers. The appellant sat down personally with Clark to go over both settlements. Initially, a tentative settlement sheet was prepared for the seller, listing the amount of money coming in from the sale and then listing the various debts owed and encumbrances to be released. In these two instances, the liabilities significantly outweighed the assets. As a result, the appellant prepared amended settlement sheets for the seller, reducing the list of liabilities so that they could be handled or nearly handled with the available assets. Among the liabilities which were given priority and which, therefore, remained on the amended settlement sheets were payments to various suppliers and contractors (e.g., Standard Supply in Gaithersburg for $1,500; an air conditioner contractor for $1,000; the Maloney Concrete Company for $1,000; a lumber dealer for $2,000). In both instances, payments to the F. O. Day Company in the amount of $2,000 on each of the lots for the release of the deeds of trust for the Pollitt lot and the Warfield lot were marked \"payment deferred.\" Clark testified that it was his understanding that the appellant would pay the $2,000 in each case to secure the appropriate release in order to give good title and would then reimburse himself from the proceeds of the next settlement he handled for Clark-King.\n\nThe pattern repeated itself, with minor variations, when Robert and Joyce Holtzclaw purchased 1887 Middleborough Drive, which was Lot 7, Block T, of the Potomac Woods subdivision (hereinafter the Holtzclaw lot) on July 10, 1970. The appellant was the settlement attorney because, according to Mr. Holtzclaw, \"it was the recommendation of the realty firm.\" The appellant personally conducted that particular settlement. Mr. and Mrs. Holtzclaw signed a waiver of notice of \"recorded releases, having been assured by said settlement attorney that all funds from this transaction will have been disbursed within five days from the date of delivery of the deed.\" That waiver form was turned over to the appellant. The check for the purchase\n\nmoney was delivered to the appellant. The appellant was paid $220 for a title search and was paid $8.50 for a title insurance policy.\n\nIn order to purchase their property in Potomac Woods, the Holtzclaws borrowed $38,000, secured by a mortgage, from The Enterprise Federal Savings and Loan Association. James Spellman, the Assistant Secretary-Treasurer of Enterprise, testified that he instructed the appellant, as settlement attorney, in writing, \"You are instructed to record the Deed of Trust and use our check when you are in a position to report the title to Lot 7 Block T 'Potomac Woods', . . . good according to records in fee simple, in Robert E. Holtzclaw and Joyce Lynn Holtzclaw, his wife, as Tenants by the Entirety, subject (only) to the enclosed Deed of Trust, which is to be a first lien against said property.\" He subsequently received from the appellant a copy of the Settlement Statement for Seller, which showed Enterprise to have a first deed of trust. The Settlement Statement for Buyer, given to the Holtzclaws, showed the mortgage to Enterprise as the only encumbrance upon the property.\n\nAs the Holtzclaws discovered two years later, their property had been encumbered by not one, but three, prior deeds of trust. The Holtzclaw lot, as with the Pollitt lot and the Warfield lot, was part of an unreleased deed of trust from Clark-King to the F. O. Day Company. As with the other lots, a payment of $2,000 would have been required to obtain a partial release from the F. O. Day Company, effecting a clear title to the Holtzclaws in Lot 7T, at least with respect to the F. O. Day Company. That $2,000 was not paid by the appellant, and the release was not obtained. The Holtzclaw lot was also encumbered by a second deed of trust from Clark-King to the State National Bank of Bethesda and by a third deed of trust from Clark-King to Arthur Dale Lumsden. As with the F. O. Day Company deed of trust, the deeds of trust to both the State National Bank and Arthur Dale Lumsden were for a number of lots in the Potomac Woods subdivision. As lots were sold, a partial release for a particular lot was to be obtained from the State National Bank for $1,000 per lot and from Arthur Dale Lumsden for\n\n$1,333 per lot. After the Holtzclaw settlement, no payments were made to either the State National Bank or to Arthur Dale Lumsden, and the releases were not obtained.\n\nA release for the Holtzclaw lot was obtained from the Lumsden trust, approximately one year after the settlement, on July 27, 1971. The release of the Holtzclaw lot from the State National Bank trust and the releases of all three lots from the F. O. Day Company trust were only obtained in the summer of 1972, after the Pollitts had independently discovered the unsuspected encumbrance upon their lot and after the general investigation of the appellant's settlement activities was in full swing. The payment was made to the State National Bank trust and the release for the Holtzclaw lot was obtained on October 3, 1972.\n\nThe appellant makes the factually unsupported claim that he may have promptly paid off the various deeds of trust, the fact of payment being legally significant in terms of procuring clear title, and have simply neglected to record the releases, at most a formality. That arguable hypothetical is squarely belied by the testimony of Peter Hitchen, the Treasurer for the F. O. Day Company. Hitchen described both the record keeping and the arrangements for payment and releases entered into by the appellant and Clark-King, on the one hand, and the F. O. Day Company, on the other hand. He described how payments from the appellant would always be in precise multiples of $2,000 and would specify precisely the lot or lots to be released by such payment. He testified that payment was received and the release was given for the Pollitt lot on June 19, 1972. Payment was received and a release was given on the Warfield lot on July 7, 1972. Payment was received and a release was given on the Holtzclaw lot on July 27, 1972. On September 26, 1972, Hitchen showed to the appellant the records of the F. O. Day Company recording when payments had been received and when releases were given on all of the various lots in the Potomac Woods Subdivision, which collectively guaranteed the $37,000 note. After reviewing the records, the appellant objected only to the failure to credit him for $120 of interest\n\non one of the loans, not here relevant. In terms of the knowledge and attitude of the appellant, several exchanges between him and Hitchen are significant. When the appellant arrived to pay the $2,000 to obtain the release on the Holtzclaw lot, Hitchen greeted him with, \"It looks to me as though you've been playing the old escrow game.\" The appellant said nothing in reply. Later in the same conversation, Hitchen \"accused him of being a crook\" and the appellant again said nothing in reply.\n\nEven within the limited confines of this second of 28 contentions, the attack upon the legal sufficiency of the evidence is diffused. The appellant claims that the State failed to establish venue in Montgomery County, upon the strained theory that the situs of the fraudulent misappropriations was the undesignated spot where the escrow account was kept and not the place where the settlements occurred. Without attributing even arguable merit to the claim, we properly rely upon the fact that this issue was not raised at the trial and was not ruled upon by the trial judge. Accordingly, the point has not properly been preserved for appellate review. Maryland Rule 1085. And see Bailey v. State, 16 Md. App. 83, 294 A.2d 123; Maryland Rule 725 b.\n\nThe appellant makes the additional claim that the State has not shown him to be a \"trustee . . . or any other fiduciary\" within the contemplation of § 132. We cannot agree. Black's Law Dictionary (4th Ed., 1951), defines \"Fiduciary Capacity\" as follows:\n\n\"One is said to act in a 'fiduciary capacity' or to receive money or contract a debt in a 'fiduciary capacity,' when the business which he transacts, or the money or property which he handles, is not his own or for his own benefit, but for the benefit of another person, as to whom he stands in a relation implying and necessitating great confidence and trust on the one part and a high degree of good faith on the other part. The term is not restricted to technical or express trusts, but includes also such\n\noffices or relations as those of an attorney at law, a guardian, executor, or broker, a director of a corporation, and a public officer.\" (Emphasis supplied.)\n\nThe Maryland case law is in complete accord. In Gaggers v. Gibson, 180 Md. 609, 26 A.2d 395, the Court of Appeals said, at 180 Md. 613:\n\n\"[A] fiduciary relation exists in every case 'in which there is confidence reposed on one side and the resulting superiority and influence on the other. The relation and the duties involved in it need not be legal; it may be moral, social, domestic or merely personal'.\"\n\nSee also Gerson v. Gerson, 179 Md. 171, 177, 20 A.2d 567, and Chase v. Gray, 134 Md. 619, 107 A. 537. In Anderson v. Watson, 141 Md. 217, 118 A. 569, the Court of Appeals said, at 141 Md. 234:\n\n\"A 'fiduciary' or 'confidential' relation, when used in the same connection, exists 'in all cases where there has been a special confidence reposed in one who in equity and good conscience is bound to act in good faith and with due regard to the interests of the one reposing the confidence. The rule embraces both technical fiduciary relations, and those informal relations which exist wherever one man trusts in and relies on another; the origin of the confidence reposed is immaterial'.\"\n\nThe language of § 132 indicates to us a clear legislative intent to extend the proscription of the embezzlement laws to those who breach a fiduciary trust as above defined. In Doxen v. State, 151 Md. 118, 134 A. 166, the Court of Appeals affirmed the conviction, for classic embezzlement, of an attorney who received money from the purchaser of a property for the purpose of paying off an existing mortgage and then failed to pay it off. The Court approved a comment by the trial judge that indicated that an attorney, in\n\nhandling such property arrangements, might simultaneously be the agent of both the mortgagor and the mortgagee. Generally speaking, it is clear that an attorney does come within the proscriptive coverage of the embezzlement law under § 129. Cooke v. State, 9 Md. App. 303, 263 A.2d 620.\n\nWe hold that the evidence in this case sufficiently supports the inference that the Pollitts, the Warfields and the Holtzclaws relied upon the appellant to serve as the attorney for both them and the seller at the property settlements, reposing trust and confidence in him to represent their interests and to see that their purchase money was properly applied to obtain the release of any preexisting liens upon their properties in order to give them free and clear titles. The reassurances given by the appellant directly, and through Paxton, that all liens would be paid off within five days, thus disposing of any necessity to give notice otherwise, supports this inference. The clear instructions given to the appellant by the two lending institutions further support such an inference.\n\nThe appellant claims additionally that the evidence failed to show that he personally profited -- that he appropriated any of the funds to his own use. He reads § 132 too narrowly. What is proscribed is the fraudulent and wilful appropriation \"to any use and purpose not in the due and lawful execution of his trust.\" Where the evidence permits the inference (as it clearly did) that the purchase money entrusted to the appellant by the Pollitts, the Warfields and the Holtzclaws, respectively, for the purpose of releasing any encumbrances and providing clear titles was fraudulently and wilfully put to some other purpose, the crime is complete. It matters not whether the direct benefit of the misappropriation went to the appellant himself, to Mel Clark, to Clark-King Construction Company or to any other.\n\nThe same principle applies here as in a case of false pretenses, whereof Chief Judge Orth said for this Court in Polisher v. State, 11 Md. App. 555, 580-581, 276 A.2d 102:\n\n\"The argument fails because '[t]here is no\n\ndoctrine of lucri causa in the field of false pretenses. It is accordingly immaterial that the defendant did not gain or intend to gain any personal benefit or advantage from obtaining the property from the victim.' Id. [2 Wharton's Criminal Law (Anderson Edition)] § 583, p. 309. '[T]he defendant is responsible for his false pretense even though he did not personally gain any benefit from the goods which had been obtained thereby.' Id., § 585, p. 316. It is stated in Hochheimer, Criminal Law (2nd Ed. 1904), § 323, p. 356: 'It is sufficient that the thing has been confided to the offender, it being immaterial that he did not obtain it on his own account, nor for his own gain or benefit.'\"\n\nThe appellant attempts to negate the elements of wilfulness and fraud by postulating mere negligence or mistake. That was a question properly for the jury, and they resolved it against him. The overall pattern established in multiple transactions, the appellant's personal knowledge of prior encumbrances both as Clark-King's attorney and as trustee for the accompanying deeds of trust, his preparation of settlement sheets in his own handwriting, his preparation of separate settlement sheets and his scheduling of separate settlements for seller and buyer, his working agreement with Clark, his silence in the face of Hitchen's accusations, his subsequent obtaining of all five releases for the hidden encumbrances on the three properties two years later and only after a criminal investigation into his activities had begun all permitted the jury reasonably to infer that his conduct was wilful and fraudulent and not simply negligent. The evidence was legally sufficient to permit the three counts charging fraudulent misappropriation by a fiduciary to go to the jury. Williams v. State, 5 Md. App. 450, 459, 247 A.2d 731; Metz v. State, 9 Md. App. 15, 23, 262 A.2d 331.\n\n3. Adequacy of False Pretenses Charges\n\nFour of the five false pretenses charges allege offenses\n\nagainst the Title Insurance Company of Minnesota. As to these four counts, the appellant asserts that they fail to charge an offense in that they fatally \"omitted the element of 'intent to defraud.'\" Section 140 provides, in pertinent part:\n\n\"Any person who shall by any false pretense obtain from any other person any chattel, money or valuable security, with intent to defraud any person of the same, shall be guilty of a misdemeanor . . .\"\n\nThe underlined words clearly set out the specific intent or special mens rea of the crime. Section 609, dealing with the form of a false pretenses charge, provides:\n\n\"In any indictment, information or warrant for false pretenses, it shall not be necessary to state the particular false pretenses intended to be relied on in proof of the same and in any such indictment, information or warrant it shall be sufficient to use a formula substantially to the following effect : 'That A-B on the . . . day of . . ., 19 . . ., in the County (City) aforesaid, unlawfully and knowingly, by a certain false pretense, did obtain from C-D (here listing the articles obtained) of the goods, chattels, moneys and property of C-D, with intent then and there to defraud, in violation of Article 27, Section (here state section violated), of the Annotated Code of Maryland; contrary to the form of the Act of Assembly in such case made and provided, and against the peace, government and dignity of the State.'\" (Emphasis supplied).\n\nThe false pretenses count charging an offense against Standard-Young Associates did, between the naming of the victim and the words \"in violation of Article 27, Section 140,\" insert the words \"with intent then and there to defraud.\" The other four false pretenses charges inadvertently jumped from the naming of the victim to the\n\nwords \"in violation of Article 27, Section 140\" and omitted the seven-word prepositional phrase now in issue. The point is a nice one.\n\nThe appellant may not take succor, as he seeks, in Dunphy v. State, 13 Md. App. 671, 284 A.2d 631. The count there held to be inadequate \"completely omitted the element that any chattel, money or valuable security was obtained by the false pretense,\" id. at 13 Md. App. 674, the indispensable gravamen of the offense. It is nonetheless clear that the specific \"intent to defraud\" is an essential element of the crime of false pretenses. Polisher v. State, supra, at 11 Md. App. 560. It is true that appellant did not raise the question below, Maryland Rule 725 b, but where a charge fails to state an offense, by failing to allege all necessary elements of the crime, appellate review is not foreclosed by such failure. Phenious v. State, supra; Ward v. State, 9 Md. App. 583, 587, 267 A.2d 255. \"The validity of the legal principle redeclared in Baker [ Baker v. State, 6 Md. App. 148, 250 A.2d 677] -- that attacks upon indictments failing to charge an offense are of jurisdictional dimension and require appellate review whether or not the issue was raised below -- is beyond doubt.\" Urciolo v. State, 19 Md. App. 123, 139, 310 A.2d 165, reversed on other grounds in Urciolo v. State, 272 Md. 607, 325 A.2d 878.\n\nThe use of the adverbs \"unlawfully and knowingly\" in the counts now under review will not fill the breach, for they are descriptive of general mens rea. In Baker v. State, 6 Md. App. 148, 250 A.2d 677, Judge Orth dealt with the necessity of alleging a specific intent where it is an element of the crime, saying at 6 Md. App. 154:\n\n\"In charging the substantive offense the general rule is that the criminal intent of the accused must be alleged when the criminality of an act depends upon the intent with which it was done, as when the statute makes such intent one of the constituent elements of the offense. 4 Wharton's Criminal Procedure (Anderson) § 1773, p. 576. That is to say, when an act is by statute made criminal only if\n\ndone with a particular intent, the intent must be alleged and proved according to the terms of the statute. Joyce on Indictments, 2d Ed., p. 450. See also Hochheimer Criminal Law, 2d Ed., § 102, p. 123; 41 Am. Jur. 2d 951; 42 C.J.S. 1027. It follows that when the indictment charges an attempt to commit an offense, an essential element of which is a specific intent, the required specific intent of the offense charged as attempted must be averred. 'Specific intent to commit the offense charged in an indictment, of which intent is an essential ingredient, is not sufficiently averred by an allegation that the accused did the acts charged in an attempt to commit the offense charged, when such acts also constitute an entirely distinct and separate offense * * *.' 4 Wharton's Criminal Procedure, supra, § 1773, p. 577.\"\n\nSee also 32 Am.Jur.2d, False Pretenses, § 62, \"Indictment and Information -- Intent to defraud . . .\", p. 214: \"An indictment for obtaining something of value by means of false pretenses must allege that pretenses were made with intent to defraud.\" Accordingly, we hold the four counts charging false pretenses against the Title Insurance Company of Minnesota to have been fatally defective.\n\n4. Legal Sufficiency of Evidence on Remaining False Pretenses Charge\n\nIn reviewing the legal sufficiency of the evidence to prove false pretenses, we are left with the single count alleging the victimization of Standard-Young Associates. As we undertake to assay the sufficiency of that evidence, we measure it against the standard articulated in Polisher v. State, supra, at 11 Md. App. 560:\n\n\"The false pretense is the crux of the crime. So the crime is committed when a person:\n\n1) by making a false representation of a past or existing fact;\n\n2) with intent to defraud; and\n\n3) knowledge of its falsity;\n\n4) obtains any chattel, money or valuable security from another;\n\n5) who relies on the false representation;\n\n6) to his detriment.\"\n\nSee also Smith v. State, 237 Md. 573, 207 A.2d 493; Tumminello v. State, 10 Md. App. 612, 272 A.2d 77; Lockhard v. State, 3 Md. App. 580, 240 A.2d 312.\n\nThe false pretense perpetrated on Standard-Young Associates involved the sale of another of the lots in Section 10 of the Potomac Woods subdivision -- Lot 13, Block T (hereinafter Lot 13T). As security on a note, Clark-King had executed a deed of trust to the State National Bank on a number of Potomac Woods lots, including 13T, which deed of trust was recorded on August 2, 1968. As security on yet another note, Clark-King executed a deed of trust on a number of the Potomac Woods lots, including 13T, to an Arthur Dale Lumsden which deed of trust was recorded on October 9, 1968. The appellant was actually the trustee for the deed of trust to the State National Bank and was personally responsible thereunder for signing any releases as to individual lots.\n\nThe history of Lot 13T is significant in demonstrating facts from which the jury could reasonably infer subsequent \"knowledge of falsity\" on the part of the appellant. In November of 1969, Clark-King could not pay off two of its bricklayers -- Antonelli and Caniglia -- and in satisfaction of a $10,000 debt conveyed to them the title to Lot 13T. The appellant handled the settlement and prepared the report of title. The report of title recited that there were no outstanding mortgages or deeds of trust on 13T. The seller's settlement sheet -- prepared by the appellant for Clark-King -- listed, however, the two outstanding deeds of trust. Mel Clark testified that it was at about this time that straightened financial circumstances made it impossible for him to discharge prior deeds of trust on lots which he sold. It was at this time that he and the appellant came to an understanding whereby the appellant would procure the\n\nreleases with his own money and then be reimbursed by Clark-King at the time of the next settlement.\n\nA small memorandum-type note -- analyzed to be in the handwriting of the appellant -- was found clipped to the file of this 1969 sale of 13T from Clark-King to Antonelli and Caniglia. It read, \"Marlene, set up deferred card for Clark like Damazo's and list this case (two trusts on it).\" The years went by and the notes were never paid and the deeds of trust on 13T were not released. In 1971, the Lumsden note, secured by the deed of trust, was obtained by Clark-King and in turn pledged to the Madison National Bank as security for a $24,000 loan. Lot 13T remained deeded in trust as part of this security, although releases were obtained on other lots on a one-by-one basis.\n\nGeorge Young first came into contact with Lot 13T in the summer of 1972. He was a small builder in Montgomery County. A word is in order as to the capacity in which Young did business, since the appellant claims, among myriad other claims of legal insufficiency, that there was a fatal variance between allegata and probata as to the victim of this particular false pretenses count. The information recited that the victim was \"Young Contracting Company, Inc., a corporation, and Standard Investment Corporation, a corporation, trading as joint venturers under the name of Standard-Young Associates.\" The appellant charges that there was no evidence that either Young Contracting Company, Inc., or Standard Investment Corporation was a corporation and relies on Stackhouse v. State, 1 Md. App. 399, 230 A.2d 358, to require reversal where there is a fatal variance. The contention is without factual predicate. Young testified that he was \"connected with\" two \"building corporations\" and then identified \"Young Contracting Corporation\" and \"Standard\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Development Corporation\" by name. Young testified that he was the secretary of both corporations. Young testified further that the articles of incorporation for \"Standard\" were drawn up by a District of\n\nColumbia attorney and that the articles of incorporation for \"Young Contracting\" were drawn up by someone in the appellant's office. The proof of the corporate characters was abundant.\n\nYoung had known and worked with the appellant for several years prior to 1972. Shortly prior to July of 1972, the appellant took the initiative and approached Young about the purchase of Lot 13T. The appellant indicated that it belonged to \"some accounts of his who owned it and they needed the money and they'd love to have it sold.\" Young agreed to purchase it for $12,000. A contract of sale was signed on June 14, 1972. The appellant was listed as the settlement attorney. The contract, in the appellant's handwriting, recites, \"The property, including the aforesaid chattel, is sold free of encumbrance, except as aforesaid.\" The \"aforesaid\" references pertain to two matters not here relevant and did not allude, in any manner, to the deeds of trust held by the State National Bank or the Madison National Bank (securing the Lumsden note).\n\nThe settlement was held on July 17, 1972, presided over by the appellant. Young inquired as to whether he would need a title insurance policy, and the appellant assured him that he would not. The real estate broker, due to receive the commission on the sale, was Kensington Associates Realty, Incorporated. The minutes and stock ledger of Kensington Realty show that every share of stock in that corporation is owned by the appellant. The seller (apparently having obtained the property from Antonelli and Caniglia) was Mt. Vernon Development Corporation. The corporate records of Mt. Vernon indicated that in 1967 100 shares of stock had been issued to the appellant as \"attorney, Trustee for owners.\" There was no other indication of the ownership of Mt. Vernon.\n\nStandard-Young Associates gave $7,000 in cash and gave a note to Mt. Vernon for the additional $5,000 needed to meet the purchase price. After the settlement, Young obtained a construction loan upon the understanding that there were no superior encumbrances on the property. A title insurance\n\nbinder had to be issued to the lender guaranteeing a good title. June Stup, the appellant's secretary, was to prepare the form. She was given by the appellant as a model the earlier form from 1969 from Clark-King to Antonelli and Caniglia, showing a free and clear title. Because office files showed encumbrances, however, she personally questioned the appellant about such a certification. He told her \"to type the title insurance binder identically as it was shown on this piece of paper.\" Young began the construction of a home and sank approximately $15,000 into the project. In September, 1971, the Lumsden note was in default and Madison National Bank was no longer under an obligation to release individual lots upon partial payments. That was the situation when the appellant sold Lot 13T to Standard-Young Associates in July, 1972.\n\nIn September, 1972, Madison National Bank elected to foreclose on the deed of trust. Clark conferred with the appellant. The appellant sent Clark to Madison National Bank with a check for $2,000 drawn on his own account to try to obtain a release on Lot 13T. The bank would not agree, there being at that time only two lots left to secure a debt of $16,000. The bank gave notice to Standard Savings and Loan Association, the lender to Standard-Young Associates, and all construction on the partially completed house ground to a halt on September 12, 1972. It could not resume until November 8, 1972.\n\nYoung immediately confronted the appellant and demanded to know why the title had not been free and clear. The appellant issued Young a title insurance policy from the Title Insurance Company of Minnesota, of which the appellant was an agent. The insurance company subsequently had to purchase the Lumsden note from the Madison National Bank for $7,000 in order to give Standard-Young Associates their clear title. In October, 1972, the appellant had paid $1,000 to State National Bank to obtain a release from them as to Lot 13T.\n\nWe have no difficulty in concluding that the evidence was sufficient to have permitted the jury reasonably to infer that the appellant falsely represented to Standard-Young\n\nAssociates that there were no hidden deeds of trust on Lot 13T, that the appellant made the false representation with knowledge of its falsity and with intent to defraud, that he caused them to part with $12,000 to their detriment in reliance upon the false representation. That the victim could not place a monetary figure on the loss occasioned by the two-month halt in construction or upon the risk it unnecessarily ran above and beyond that halt is immaterial. In 2 Wharton, Criminal Law and Procedure (Anderson Edition, 1957), the following is said, at § 602, pp. 360-361:\n\n\"To constitute the offense of obtaining property by false pretenses it is necessary to show that the actions of the victim in reliance on the defendant's misrepresentations have caused the victim loss or that the victim has been prejudiced in some way. It is not necessary that the victim has sustained actual money loss. Loss is sustained even though the victim has incurred merely a conditional or future liability, such as that based on negotiable instruments. The fact that the victim has been indemnified or may possibly be indemnified for his loss, or that restoration of the property or money has been made, does not prevent the prosecution of the defendant for false pretenses.\"\n\nIn 32 Am.Jur.2d, False Pretenses, § 38, \"Injury or prejudice resulting from transfer,\" it is said, at p. 200:\n\n\"[T]he gravamen of the offense is in the making of the false pretense with intent to defraud and thereby obtaining another's property. So it is not essential that the victim suffer a permanent loss or that he sustain a pecuniary loss. The offense is complete when money or property has been obtained by false representations, and it cannot be purged by subsequent restoration or repayment. Accordingly, where a person induces another, by means of false pretenses, to part with his property, he cannot defend against a charge of obtaining property by false pretenses by showing that the\n\nperson who parted with his property had recovered in a civil action the value of the property, or by showing that the victim had recovered by other means or from other sources. Nor will the actual repayment of a loan obtained by false pretenses constitute a defense against a criminal prosecution for obtaining money by false pretenses.\"\n\nSee People v. Jones, 36 Cal. 2d 373, 224 P. 2d 353; State v. Mills, 96 Ariz. 377, 396 P. 2d 5; Pepper v. People, 75 Colo. 348, 225 P. 846.\n\nOf similar import is Perkins, Criminal Law (2d Edition, 1969), at 313-314:\n\n\"[T]here is no requirement of actual pecuniary loss on the part of the intended victim. If the false representation was with reference to the security given for money borrowed, or property purchased on credit, it is no defense to a charge of false pretenses that the debt has since been paid.\"\n\nAnd see Baskerville v. State, 23 Md. App. 439, 327 A.2d 918.\n\n5. Search and Seizure -- Introduction of Search Warrant\n\nThe appellant's claim that fruits of two simultaneous searches and seizures should be suppressed because the State failed to introduce the warrants and the applications for the warrants is fatuous. A search warrant for the appellant's law office at 3700 Decatur Avenue, with a supporting affidavit and application of thirteen tightly typed legal size pages and twenty-five additional pages of supporting exhibits, is part of the record. A search warrant for the office of the Mt. Vernon Development Corporation at 3514 Plyers Mill Road, with a supporting affidavit and application of fourteen tightly typed legal size pages and twenty-four additional pages of supporting exhibits, is also part of the record.\n\nAlso in the record is the Petition of the State, filed on April 6, 1973, to have the two original search warrants, then\n\nin the custody of the Clerk of the Court of Montgomery County, forwarded to Frederick County, to which the trial had been removed, and made a part of the record in anticipation of the then pending hearing on the appellant's motion to suppress physical evidence. On April 6, 1972, Judge Philip M. Fairbanks, of the Circuit Court of Montgomery County, signed the following order:\n\n\"ORDERED, that two original search warrants, their supporting applications and affidavits and accompanying returns, entitled 'State of Maryland vs. The Premises Known As Law Offices of Peter Christian Andresen * * * 3700 Decatur Avenue * * *' and 'State of Maryland vs. The Premises Known As Mount Vernon Development Corporation * * * Known As 3514 Plyers Mill Road * * *, executed in October, 1972, now in the possession of the Clerk of the Circuit Court for Montgomery County, be transferred by him under his seal and with his oath or affirmation as to the period of time they have been in his custody, to the Clerk of the Circuit Court for Frederick County for the purpose of their introduction into the records of Criminal Nos. 13189, 13238, 13239, and 13240 (removed to the Circuit Court for Frederick County and there known as Criminal Nos. 3100, 3101, 3102 and 3103, respectively), before April 11, 1973 at ten o'clock a.m.\"\n\nA full suppression hearing was held before Judge Barrick in Frederick on April 11 and 12, 1973. The record of that hearing runs to 375 pages. Throughout the hearing, extensive references were made on numerous occasions to the warrants and the applications. The inescapable import is that both advocates and the judge were referring to and reading from the warrants and their applications. On several occasions, Judge Barrick admonished the State not to have witnesses read from the warrant because \"the warrant speaks for itself.\"\n\nIt is clear from the suppression hearing that the search\n\nwarrant and accompanying affidavit and application for 3700 Decatur Avenue was Defendant's Exhibit #1. The court even went so far as to offer the formal document to the appellant's attorney:\n\n\"MR. LAMB: Your Honor, is there a copy of the affidavit in the file?\n\nTHE COURT: Yes.\n\nMR. LAMB: Well, let me proceed a little further. With regard to the investigation, were two affidavits prepared in support of the search warrants?\n\nA. There were two premises, two affidavits.\n\nQ. Are the affidavits in both warrants for both premises exactly the same but for the location to be searched?\n\nA. I have no idea at this time whether both were identically the same or -- or --\n\nQ. You knew at the time you signed them whether they were the same -- you read them?\n\nTHE COURT: They're here in the file, Mr. Lamb.\n\nMR. LAMB: The only problem, Your Honor, I only have my copy which has handwritten notes --\n\nTHE COURT: You're welcome to the file.\n\nMR. LAMB: I'm trying to limit it from the standpoint of, are the affidavits the same.\n\nTHE COURT: Well, they're right here, and you can determine that by looking at them -- they're right here. I'll be glad to give you the whole file.\n\nMR. LAMB: I'll use the affidavit, Your Honor, which -- Your Honor, I would ask that this be marked for purposes of the record as Movant's Number 1 -- Defendant's Number 1.\n\nDef Exh 1 thereupon marked.\n\nMR. LAMB: Agent, I show you what has been marked Defendant's Exhibit 1 and ask if you can identify that.\n\nA. Yes, sir.\n\nQ. What is it?\n\nA. Affidavit in support of search warrant.\n\nQ. What address is named therein?\n\nA. This particular address is 3700 Decatur Avenue, Kensington, Maryland.\"\n\nSpecial Agent Austin Moyer was then examined extensively about the content of the supporting application. At one point, appellant's attorney solicited from the witness information extraneous to the warrant application and was brought up short by Judge Barrick, \"Let me interrupt a moment, Mr. Lamb. As I understand the law as far as search warrants are concerned, we've got to decide it on the basis of what is within the four corners of the affidavit.\"\n\nThe central controversy swirled about the number and nature of items seized under the warrants. The \"returns\" became important and the two \"returns\" were, by general agreement, incorporated into and made a part of Defendant's Exhibits 1 and 9, which were the respective search warrants and accompanying applications. Although the magic words, \"We hereby formally introduce the search warrants as exhibits,\" may not literally have been uttered, the clear context of the entire suppression hearing makes it manifest that they were Defendant's Exhibits 1 and 9, respectively:\n\n\"MR. LAMB: Your Honor, may I point out something. We might as well make the return on the warrant part of Defendant's Exhibit 1, the return on the warrant itself for Plyers Mill Road. That's only the warrant and the application.\n\nTHE COURT: All right, put the return with it. You don't have the return?\n\nMR. LAMB: No, Your Honor, I only have my copy of it.\n\nMR. WERNER: Here it is.\n\nTHE COURT: We're putting the return with Exhibit [9] -- we're talking about -- we're connecting the report and return with the affidavit and the search warrant as Defendant's Exhibit 1.\n\nMR. LAMB: I want to be sure he's looking at --\n\nTHE COURT: Introduce the other search warrant with the affidavit -- that's [9].\n\nMR. WERNER: Nine.\n\nMR. LAMB: These are things he pulled out of the file as proffered by the State as being on the return.\n\nREDIRECT EXAMINATION\n\nBY MR. LAMB:\n\nQ. Agent, I show you what has been marked Exhibit 9 for identification and ask if you can identify it.\n\nA. Yes, sir, I can.\n\nQ. What is it?\n\nA. Affidavit -- application for search warrant, 3514 Plyers Mill Road, Kensington, Maryland.\n\nQ. With attachments and return?\n\nA. With attachments and return.\"\n\nThe ten-page Memorandum and Order of Judge Barrick, moreover, analyzes and recites extensively from the warrant applications. Under the circumstances, Duggins v. State, 7 Md. App. 486, 256 A.2d 354 (where the State declined to produce a warrant, choosing instead to rely exclusively upon the testimony of arresting officers to establish the validity of the arrest); Campofreda v. State, 15 Md. App. 693, 292 A.2d 703 (where neither a warrant nor a completed copy was offered in evidence and where the \"copy\" actually read by the court was not signed and had a number of blank spaces); and Brooks, Keaton and Patterson v. State, 13 Md. App. 151,\n\n282 A.2d 516 (where a second search warrant depended upon the validity of a first search warrant but did not incorporate the first application as a part of the second application), relied on by the appellant, are not remotely apposite.\n\n6. Search and Seizure -- No General Warrant\n\nA later contention (# 9) will deal specifically with the appellant's charge that the particularity clause of the Fourth Amendment was violated by the allegedly overbroad seizure of items during the actual executions of the two warrants. This contention confines itself to the facial character of the two warrants. It is claimed that their lack of adequate particularization in terms of \"the things to be seized\" condemns them as constitutionally forbidden general warrants, authorizing indiscriminate rummaging through the private papers of the appellant.\n\nAnimating our review, as we attempt to keep the emotionally highly-charged phrase \"general warrant\" in proper historical and semantic perspective, is Hignut v. State, 17 Md. App. 399, 417, 303 A.2d 173:\n\n\"We caution against a marked tendency of late toward a loose employment of the notion 'general warrant'. In Harris and Schmitt v. State, 17 Md. App. 484, 302 A.2d 665, Judge Scanlan traces perceptively the history of the 'general warrant' and its colonial counterpart, the 'writ of assistance'. These parallel instruments of governmental oppression aroused great furor on both sides of the Atlantic throughout the 1760's and 1770's. They were a contributing spark to the American Revolution. They were vivid in the apprehensive recollection of the constitution makers of the 1770's and 1780's, state and federal, who established protections to guard specifically against them. A decent respect for history and a careful use of language compels us to remember that the notion of a 'general warrant' did not contemplate every minor imprecision in draftsmanship giving rise to\n\nsome arguable ambiguity or fleeting confusion. The 'general warrant' was a roving commission to police agents, in seeking out certain types of crime, to search anyone or any place, at any time, anywhere. The niggling complaint at bar is antipodal to the broad issue over which we fought a Revolution. Magna Charta need not be invoked everytime a policeman dots the wrong 'i'.\"\n\nAnd see Frey v. State, 3 Md. App. 38, 46, 237 A.2d 774.\n\nThe heart of the appellant's complaint is the use of the phrase \"together with other fruits, instrumentalities and evidence of crime at this time unknown\" to conclude the catalogue of things to be seized. A reading of the warrants in full, however, makes it apparent that the suspect phrase is tied explicitly to those items which might show a violation of the false pretenses law with respect to the sale of Lot 13T.\n\nThe warrants, identical in terms of describing the things to be seized, are models of particularity. They command the executing officers to seize:\n\n\". . . the following items pertaining to sale, purchase, settlement and conveyance of lot 13, block T, Potomac Woods subdivision, Montgomery County, Maryland:\n\ntitle notes, title abstracts, title rundowns; contracts of sale and/or assignments from Raffaele Antonelli and Rocco Caniglia to Mount Vernon Development Corporation and/or others; lien payoff correspondence and lien pay-off memoranda to and from lienholders and noteholders; correspondence and memoranda to and from trustees of deeds of trust; lenders instructions for a construction loan or construction and permanent loan; disbursement sheets and disbursement memoranda; checks, check stubs and ledger sheets indicating disbursement upon settlement; correspondence and memoranda concerning disbursements upon settlement; settlement statements and settlement memoranda; fully or partially prepared deed of trust releases,\n\nwhether or not executed and whether or not recorded; books, records, documents, papers, memoranda, and correspondence, showing or tending to show a fraudulent intent, and/or knowledge as elements of the crime of false pretenses, in violation of Article 27, Section 140, of the Annotated Code of Maryland, 1957 Edition, as amended and revised, together with other fruits, instrumentalities and evidence of crime at this time unknown.\"\n\nWe read the questioned phrase as referring to \"other fruits, instrumentalities and evidence\" of the crime of false pretenses with respect to Lot 13T. (We do not intimate, by any negative implication, that the result would necessarily be otherwise even if we read the phrase more broadly. It is simply unnecessary to this decision to consider such a question.)\n\n7. Plain View Seizure of State's Exhibit 10A\n\nOf all of the items seized which were not suppressed and which ultimately were received in evidence, only one (State's Exhibit 10A) arguably was not particularly described by the warrants. It was a deed of trust prepared on March 27, 1972, conveying certain lots from Clark-King to the F. O. Day Company as security for a $47,000 loan from F. O. Day Company to Clark-King. The significance is this. The new $47,000 loan had nothing to do with an earlier $37,000 loan from F. O. Day to Clark-King, also secured by an earlier deed of trust. The appellant instructed one of his secretaries to add the following words to the deed of trust: \"Part of this deed of trust secures an existing deed in the amount of $37,000 upon which the recording tax was paid in Liber 3934, Folio 0772, therefore recording tax is due only on $12,000.\" That was not true and was nothing but an attempt to lower the recording tax due Montgomery County. Peter Hitchen, the Treasurer of the F. O. Day Company, had kept a photocopy of the original deed of trust without the added language. When he received a copy of the recorded deed of trust with the supplemental language, he noticed the\n\ndiscrepancy and notified the appellant of the impropriety. Hitchen fully informed Special Agent Joseph Lawrence of this entire matter and Agent Lawrence had this information in his recent memory when he executed one of the search warrants. In the course of his legitimate search of the files for the various particularly described items relating to Lot 13T, he came across this typed deed of trust and immediately recognized its significance. (Hitchen's copy was not sufficient because of the desire to make a typewriting analysis.) This is a classic instance of a Plain View Doctrine seizure -- a recognized exception to the warrant requirement whereunder a prior valid intrusion for one purpose will legitimate the warrantless seizure of evidence of crime inadvertently spotted in plain view. Coolidge v. New Hampshire, 403 U.S. 443, 464-473, 91 S. Ct. 2022, 29 L.Ed.2d 564, 581-587 (1971); Warden v. Hayden, 387 U.S. 294, 87 S. Ct. 1642, 18 L.Ed.2d 782 (1967); Frazier v. Cupp, 394 U.S. 731, 89 S. Ct. 1420, 22 L.Ed.2d 684 (1969); Cady v. Dombrowski, 413 U.S. 433, 93 S. Ct. 2523, 37 L.Ed.2d 706 (1973); Brown v. State, 15 Md. App. 584, 292 A.2d 762.\n\nAfter a painstaking review of the entire record of this lengthy and complicated trial, we would be derelict not to record our thoroughly deliberated alternative holding that even if there had been error in this regard (and we explicitly hold there was not), it was harmless beyond a reasonable doubt. Chapman v. California, 386 U.S. 18, 87 S. Ct. 824, 17 L.Ed.2d 705 (1967). The significance of State's Exhibit 10A went only to Counts 15, 16 and 17 of Indictment 3103, charging false pretenses upon Montgomery County, failure to pay the recordation tax and misrepresentation of a taxable consideration, respectively. These three counts were ultimately dropped by the State. The appellant, therefore, suffered no remote prejudice.\n\n8. Search and Seizure -- Probable Cause\n\nIndefatigably, the appellant has presented under the umbrella of this eighth contention, six subcontentions. Several are ingenious, even if meritless.\n\n{PA}\n\nPage 169} a. Object of the Search Warrant\n\nThe appellant points to Art. 27, § 551, Search Warrants, as authorizing a search where probable cause has demonstrated that \"any misdemeanor or felony is being committed by any individual or in any building, apartment, premises, place or thing.\" (Emphasis added) He argues that the warrant applications of October 30, 1972, focus upon an alleged crime of false pretenses that was consummated and complete, by the very allegations in the warrant applications, on July 17, 1972. He reasons that on October 30, the crime was already an act of history and was not still being committed. Inadvertently (or advertently), the appellant did not read on in § 551, wherein the very next clause sets out the additional legitimate object of a search warrant: \"or that any property subject to seizure under the criminal laws of the State is situated or located on the person of any such individual or in or on any such building, apartment, premises, place or thing.\" That any evidence of past crime -- including \"mere evidence\" in contrast to contraband, fruits or instrumentalities -- is seizable under the Fourth Amendment was made clear by Warden v. Hayden, supra. As Chief Judge Murphy also made clear in Salmon v. State, 2 Md. App. 513, 517-519, 235 A.2d 758, the Fourth Amendment to the Federal Constitution, on the one hand, and Article 26 of the Maryland Declaration of Rights along with Art. 27, § 551, on the other hand, are provisions in pari materia and protect like rights in a like manner.\n\nb. Staleness of Probable Cause\n\nThe thrust of this subcontention is that various observations of activity on the part of the appellant made significantly prior to October 30, 1972, even if such observations indicated criminal behavior then, did not yield the likelihood that evidence of such crime was still present on the appellant's two business premises as late as October 30.\n\nThe affiants upon the warrant applications were Special Investigators Austin Moyer and Joseph Lawrence. Their painstaking investigation which produced the two\n\nexemplary warrant applications before us took place throughout September and October of 1972. On October 25, they interviewed George and Audrey Young and reduced the detailed recitations of the Youngs to six typewritten pages. The Youngs had been present for the crucial settlement in the appellant's law office on July 17. The affiants checked the stock ledger sheets of Kensington Associates Realty, Inc. in late September and found that the company was owned by the appellant. At the end of September, the affiants checked the stock ledger sheets of the Mt. Vernon Development Corporation -- the seller of Lot 13T -- and found that it was controlled by the appellant. One of the search warrants was for the 3514 Plyers Mill Road office of Mt. Vernon Development Corporation. John Sivers was interviewed in early September and confirmed the appellant's ownership of Mt. Vernon for his \"own personal gain.\" Robert Freedman, the General Counsel and Director of Standard Savings and Loan Association, was interviewed in October. Deborah Nalls, a special investigator trained in real estate law, checked the land records and discovered, inter alia multa, a release from the State National Bank on Lot 13T as late as October 3, 1972. Norman Hecht, the Vice President of Madison National Bank, was interviewed on October 27 and revealed that as of that time Lot 13T had not been released from the Lumsden trust.\n\nAs an indication that files relating to the Potomac Woods lots generally and to the appellant's records for Clark-King were still in the appellant's offices in late October, 1972, the affiants interviewed William Hancock and E. Harold Patterson, owners of County-Wide Realty Company, on October 19. They related that the appellant was scheduled to handle the settlement on Lot 13S (also in the Potomac Woods subdivision) \"within the next few weeks or so.\" Peter Hitchen, the Comptroller of F. O. Day Company, was interviewed on October 19 and turned over papers prepared by the appellant relating to Lot 13S as late as September 26. Mel Clark was interviewed on October 19 and turned over the books and records of Clark-King. He indicated that as of\n\nthat time the appellant was still acting as his settlement attorney.\n\nWe cannot doubt that the probable cause was not simply abundant but vitally fresh. Taylor v. State, 17 Md. App. 536, 302 A.2d 646, relied on by the appellant, is not remotely applicable. There, a lapse of thirty days between a single observation and the issuing of a search warrant for a pool hall rendered the probable cause fatally stale. The single observation, however, had been of a hypodermic syringe being passed from one customer to another. The heart of our holding there did not go to the time factor as such but to the lack of a logical link between an isolated customer's act and the host premises:\n\n\"The sole observation by the informant of two patrons of Brownie's Pool Hall passing a hypodermic syringe between them does not, in and of itself, give rise to a rational inference that narcotics were being kept or stored in the premises any more than a single observation of a lottery slip being passed between two customers of a restaurant would give rise to a rational inference that an illegal gambling operation was being conducted in that restaurant.\" Id. at 17 Md. App. 543.\n\nThe general rule as to staleness was set forth for this Court by Judge Anderson in Johnson v. State, 14 Md. App. 721, 729-730, 288 A.2d 622:\n\n\"There is no statute in this State providing that the facts in the application, set forth to establish probable cause, must result from observations made within a designated time before the issuance of the warrant. Nor do we find any cases which lay down a rigid rule. However, the remoteness of the facts observed from the date of the issuance of the warrant is an element to be considered in each instance by the issuing authority in determining whether it appears that there was probable cause. {PA}\n\nPage 172} Clayton v. State, 1 Md. App. 500, 503. The issue, therefore, is whether this lapse of 26 days between the observation of the facts and the issuance of the warrant, was so remote, when considered in the circumstances of this case, so as to invalidate the search warrant. Clayton v. State, supra, at 504. See Varon, supra, at 322; 100 A.L.R.2d 525.\"\n\nAnd see Rosenblatt, \"'Stale' Probable Cause in Search Warrants,\" Search and Seizure Law Report, Vol. 1, No. 4, (February, 1974); State v. Edwards, 266 Md. 515, 295 A.2d 465; United States v. Johnson, 461 F. 2d 285 (10th Cir. 1972); United States v. Harruff, 352 F. Supp. 224 (E.D. Mich. 1972); United States v. Cotham, 363 F. Supp. 851 (W.D. Texas 1973); United States v. Guinn, 454 F. 2d 29 (5th Cir. 1972); United States v. Harris, 482 F. 2d 1115 (3rd Cir. 1973).\n\nThe ultimate criterion in determining the degree of evaporation of probable cause, however, is not case law but reason. The likelihood that the evidence sought is still in place is a function not simply of watch and calendar but of variables that do not punch a clock: the character of the crime (chance encounter in the night or regenerating conspiracy?), of the criminal (nomadic or entrenched?), of the thing to be seized (perishable and easily transferable or of enduring utility to its holder?), of the place to be searched (mere criminal forum of convenience or secure operational base?), etc. The observation of a half-smoked marijuana cigarette in an ashtray at a cocktail party may well be stale the day after the cleaning lady has been in; the observation of the burial of a corpse in a cellar may well not be stale three decades later. The hare and the tortoise do not disappear at the same rate of speed. The massive records and files of the appellant-attorney and his protean corporate extensions in this case are more akin to the latter than to the former. In terms of non-staleness, the probable cause here was still as the first dew of the morn.\n\nc. Attempt to Controvert Truth of Warrant Applications\n\nAlthough nothing suggested by the appellant's brief or at oral argument indicates that he ever successfully derogated\n\nby one whit either the truth or the accuracy of any of the hundreds of facts set forth in the warrant applications, the controlling answer to this subcontention is that in Maryland a reviewing court -- at the hearing level, trial level or appellate level -- may not look \"beyond the four corners of the affidavit.\" Smith v. State, 191 Md. 329, 335, 62 A.2d 287; Collins v. State, 17 Md. App. 376, 302 A.2d 693; Everhart v. State, 20 Md. App. 71, 81-82, 315 A.2d 80. The appellant's reliance upon Carter v. State, 18 Md. App. 150, 305 A.2d 856, for the proposition that a reviewing court may go \"beyond the four corners of the affidavit\" is bizarre, since in that case there was neither a warrant nor a supporting affidavit. The appellant's present use of the Court of Appeals decision in Clark-King Construction Co. and Andresen v. Salter, et al., 269 Md. 494, 307 A.2d 485, decided on July 20, 1973, not for its legal principle but as proof of a fact in an attempt to vitiate one ostensibly contrary fact in the warrant applications, is inappropriately after-the-fact. That decision came down after the warrant applications were prepared (and, indeed, after both the pre-trial suppression hearing and the trial itself had been completed).\n\nd. Probability as to the Two Locations Searched\n\nThis subcontention assumes probable cause for the existence somewhere of evidence of false pretenses but challenges the probability of either 3700 Decatur Avenue or 3514 Plyers Mill Road being that \"somewhere.\" Equating \"probable cause\" or \"probability\" with \"more likely to be true than not\" or \"a greater than 50 per cent chance,\" the appellant reasons cleverly that although probable cause may exist that the evidence sought is \"in A or B,\" who can say with the requisite degree of probability which? (If the evidence is \"probably\" at 3700 Decatur Avenue, is it not a necessary implication that it is \"probably not \" at 3514 Plyers Mill Road and vice versa? \"How could the same particular documents sought be present at two different locations?\" May a known diamond thief hold out two clenched fists, turned down as in a childhood game, and challenge the police to say with probability whether the stolen gem is in his right\n\nhand or in his left?) Leaving for another day the rich metaphysical possibilities in articulating why such an absurd but titillating proposition cannot be the law, it is enough for present purposes to hold that there was probable cause to believe that some of the evidence sought was in each of the two locations.\n\nThe settlements were held at 3700 Decatur Avenue. That was the appellant's law office and the logical (probable) repository for his files and records. We note, moreover, that at least three of the exhibits offered in support of the warrant applications show that copies were to be mailed to the appellant at 3700 Decatur Avenue.\n\nWith respect to 3514 Plyers Mill Road, that was the office of the Mt. Vernon Development Corporation, which was \"controlled\" by the appellant and which sold Lot 13T to Standard-Young Associates. The application for 3514 Plyers Mill Road contained all of the facts contained in the companion application and a few additional ones as well. On September 26, 1972, Agent Moyer went to 3514 Plyers Mill Road and there observed Charles G. Bieber conducting business at a desk and over a phone. Bieber had been the signatory for Mt. Vernon in purchasing Lot 13T from Antonelli and Caniglia and in selling Lot 13T to Standard-Young Associates. The sales contract with the former listed the \"address of the purchaser\" as 3514 Plyers Mill Road. June Stup, the appellant's secretary in his law office at 3700 Decatur Avenue, confirmed that Bieber and Mt. Vernon operated out of 3514 Plyers Mill Road. Carl Zentz, employed as a title searcher and then as a supervisor of all searchers by the appellant, confirmed that various \"title notes, title abstracts, and title rundowns prepared for\" the appellant are \"normally and typically kept\" in both locations.\n\ne. Veracity of Non-Swearing Informants\n\nThe appellant contends that little, if any, of the information in the applications comes directly from the two affiants, but rather is hearsay from a wide number of off-warrant declarants -- secondary sources -- informants.\n\nThat observation is accurate. He then challenges the veracity of these informants under Aguilar v. Texas, 378 U.S. 108, 84 S. Ct. 1509, 12 L.Ed.2d 723 (1964). The point, though ingenious, need not detain us long.\n\n\"That a different rationale must exist for establishing the reliability of citizen-informers than for establishing that of the more suspect and anonymous police informer is widely recognized in recent case law.\" King and Mobley v. State, 16 Md. App. 546, 555, 298 A.2d 446, quoted with approval in Mobley and King v. State, 270 Md. 76, 85, 310 A.2d 803. As was said in Dawson v. State, 14 Md. App. 18, 33, 284 A.2d 861 (concurring opinion):\n\n\". . . it is implicit in the Supreme Court's treating of Aguilar-Spinelli problems that the rules set out for establishing an informant's credibility are aimed primarily at unnamed police 'informers' rather than at that broad class of secondary sources who are the victims of crime, the disinterested witnesses of crime, other disinterested civilian sources of information or other law enforcement officers. The members of this broad class are generally, but not universally, named. They are not from the criminal milieu.\"\n\nIn the present case, the secondary sources of information were all named and identified. See United States v. Ventresca, 380 U.S. 102, 85 S. Ct. 741, 13 L.Ed.2d 684 (1965) and Rugendorf v. United States, 376 U.S. 528, 84 S. Ct. 825, 11 L.Ed.2d 887 (1964). George and Audrey Young were the secretary and president, respectively, of the victimized company. Ira Burdette was the general superintendent for the appellant's construction business. John Sivers was a corporation president. Robert Freedman was general counsel and director of a savings and loan association. Frank Marsalek was executive vice president of a land title corporation. Charles Bieber worked for Mt. Vernon Development Corporation. June Stup was the appellant's secretary. Carl Zentz was the appellant's title searcher. Bruce Covert and Norman Hecht were vice presidents of\n\nbanks. Deborah Nalls was a real estate law expert assigned to the Bi-County Fraud Unit. We are persuaded that none of the informants were anonymous police informers \"from the underworld milieu\" but were rather either \"victims of crime, the disinterested witnesses of crime, other disinterested civilian sources of information or other law enforcement officers.\" As we said in Dawson v. State, 11 Md. App. 694, 699, 276 A.2d 680:\n\n\"The practical distinction is that in dealing with a named source, the very naming of the source and the relationship of the source to the observed information may go a long way (or even be sufficient unto itself), under the facts of a particular case, to establish the credibility of that source or the reliability of his information.\"\n\nAnd see Moylan, Hearsay and Probable Cause: An Aguilar and Spinelli Primer, 25 Mercer L. Rev. 741 (1974), pp. 765-773, \"The Problem of the Citizen-Informer.\"\n\nf. Probable Cause to Believe Crime Committed\n\nAs his last subcontention, the appellant challenges the establishment of probable cause generally to believe that the crime of false pretenses had been committed and that evidence of it did exist. After repeatedly going over these lengthy and thorough warrant applications with their numerous supporting exhibits, we are persuaded that the evidence contained therein would probably have been legally sufficient to sustain a conviction, a fortiori adequate to establish probable cause for the issuance of search and seizure warrants.\n\n9. Search and Seizure -- The So-called \"Nexus\" Problem\n\nIn this contention, both the appellant and the State appear to be tilting at a windmill. The thrust of the appellant's argument and the counterthrust of the State's argument is that the \"Nexus Doctrine\" of Warden v. Hayden, supra, was not (according to the appellant), or was (according to the\n\nState), satisfied. We are unfamiliar with any such legal creature as a \"Nexus Doctrine,\" although we are familiar with the employment of the word \"nexus\" on a single occasion by Warden v. Hayden to describe the effect of the death of the \"Mere Evidence Rule.\"\n\nThe language of Warden v. Hayden on which both the appellant and the State are hung up is at 387 U.S. 306-307, 18 L.Ed.2d 792:\n\n\"The requirements of the Fourth Amendment can secure the same protection of privacy whether the search is for 'mere evidence' or for fruits, instrumentalities or contraband. There must, of course, be a nexus -- automatically provided in the case of fruits, instrumentalities or contraband -- between the item to be seized and criminal behavior. Thus in the case of 'mere evidence,' probable cause must be examined in terms of cause to believe that the evidence sought will aid in a particular apprehension or conviction.\"\n\nPrior to Warden v. Hayden, the Mere Evidence Rule, promulgated by Gouled v. United States, 255 U.S. 298, 41 S. Ct. 261, 65 L. Ed. 647 (1921), had restricted lawful seizures to contraband, fruits of crime and instrumentalities of crime and had forbidden the seizure of \"mere evidence,\" upon the outmoded notion that the government could not establish a superior property right in \"mere evidence.\" Under the intense prodding of the academic community, the Supreme Court in Warden v. Hayden abandoned the anachronistic distinction. The language from Warden v. Hayden quoted above simply explained how the Fourth Amendment protection had not been diluted by this abolition of the Mere Evidence Rule. It made explicit what was already implicit -- that there must (before and after the abolition) be probable cause to believe that the \"things to be seized\" were, indeed, evidence of crime. Where the \"things to be seized\" had been contraband, fruits or instrumentalities, their evidentiary value had been self-evident or, in the words of Warden v. Hayden, \"automatically provided.\" Since the character of\n\n\"mere evidence,\" by way of contrast, is at first glance more innocuous, the probable cause must establish a link which is not so apparent or \"automatic.\" The bottom line is that, whatever the former classification of the evidence may have been, the probable cause in the warrant application must establish that the particularly described \"things to be seized\" are, indeed, evidence of crime.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nFive of the approximately twelve exhibits which ultimately passed through all of the screens were seized from 3514 Plyers Mill Road. They were all seized from a folder captioned \"Potomac Woods General,\" which contained title rundowns, work sheets, deeds of easement, declarations of covenants, abstract reports, deeds of trust and title binders. One showed that Lot 13T was \"Deeded to Antonelli\" with additional notations of \"STNB\" and \"Lumsden\" (apparently referring to two pre-existing deeds of trust on the lot to the State National Bank and to Arthur Lumsden). A second item taken from the \"Potomac Woods\" file was a grantor list from Clark-King which gave a liber and folio number for an apparent deed of trust on \"13T, Section 10, Potomac Woods.\" A third item was a handwritten page from a legal pad indicating both a liber and folio reference for a deed of Lot 13T to Antonelli, but also giving the apparent number of the appellant's case file as to that particular transaction. A fourth item was captioned \"Unreleased deed of trust made by Clark-King Construction Company, Inc.,\n\nPotomac Woods . . . Updated through 4/25/72.\" It specifically indicates that a deed of trust was still outstanding to \"State NAT,\" with liber and folio number, and an additional deed of trust still outstanding to \"Lumsden,\" with liber and folio number. A fifth item did not refer to Lot 13T specifically but was an abstract dealing with the deed of trust on Potomac Woods generally, including Lot 13T, from Clark-King to F. O. Day Company. The document specified the dates of releases as to a number of the encumbered lots, with significant silence as to Lot 13T.\n\nApproximately seven additional items seized from the appellant's law office at 3700 Decatur Avenue also passed through all of the screens. One was a file labeled \"Antonelli to Mt. Vernon to Young Contracting Company 72-242\" and directly dealt with the deeds of trust on and the settlement of Lot 13T. Another file was marked \"Clark-King to Antonelli 69-351 13(t)\" and dealt exclusively with Lot 13T. One item was the ground trust from Clark-King to Equitable, which related to Lot 13T. One item was a grantor list of Clark-King. Another was a title abstract for the Potomac Woods subdivision. Another was a file showing Clark-King's transactions with the State National Bank.\n\nAll of these items fell clearly within the ambit of those particularly described \"things to be seized\" under the search warrants. The probable cause to believe that they were evidence of the false pretenses was well established. Nothing more is required.\n\nSeveral other items seized, although not relating to Lot 13T specifically, showed a general pattern of operation on the part of the appellant with respect to unreleased deeds of trust on other properties in Potomac Woods and, therefore, negated any suggestion of mere mistake or lack of knowledge on his part when it came to his false representations as to Lot 13T. Because of their bearing on the critical question of the appellant's mens rea, we hold that they too were seizable evidence under the warrants. Alternatively, they were evidence of other crimes, their character as criminal evidence obvious to the searching party by the requisite standard of probable cause, and,\n\ntherefore, seizable warrantlessly under the Plain View Doctrine.\n\nThe appellant frames a final Fourth Amendment argument not in terms of those things 1) which were not suppressed and 2) which were admitted into evidence, but in terms of that much larger quantity of items which were seized initially but which did not pass through all of the screens. (A number of items which were not suppressed were not offered as evidence by the State because they related to other indictments against the appellant which had not yet come on for trial.) The short answer to the contention is that even if other items had been unconstitutionally seized, that frailty would not mandate the suppression of the items which were constitutionally seized. If the apples remaining in the barrel when it ultimately comes to rest upon the trial table are constitutionally healthy, it matters not how many constitutionally rotten ones were discarded along the way. As we said in Spease and Ross v. State, 21 Md. App. 269, 282-283, 319 A.2d 560, 567-568:\n\n\"Whether dealing with conversations or with tangible items, the issue is one of particularity -- that language of the Fourth Amendment stating that the only valid warrants are those 'particularly describing . . . the things to be seized.' The classic case on point is Marron v. United States, 275 U.S. 192, 48 S. Ct. 74, 72 L. Ed. 231 (1927). In that case, certain ledgers and other papers not particularly described in a search and seizure warrant were held to have been improperly seized under the warrant; other items which had been particularly described, however, were admitted into evidence. More recent applications of the Marron principle, mandating only the partial suppression of things wrongfully seized and not derogating from the admissibility of those things rightfully seized, are United States ex rel. Nickens v. LaVallee, 391 F. 2d 123 (2nd Cir. 1968); United States v. Dzialak, 441 F. 2d 212 (2nd\n\nCir. 1971); and Brooks v. United States, 416 F. 2d 1044 (5th Cir. 1969).\n\nThe wiretap cases generally acknowledge the clear analogy to more general Fourth Amendment principles. United States v. LaGorga, supra, said, at 197:\n\n'It seems clear under the general law of search and seizure that if some of the items obtained satisfy the requirements of the law, the mere fact that other objects beyond the permissible ambit of the search must be suppressed, does not require that all of the evidence must be necessarily so treated.'\"\n\n10. Compulsory Self-Incrimination\n\nThe appellant's tenth claim of error is based upon a curious combination of Andresen v. Bar Association of Montgomery County, 269 Md. 313, 305 A.2d 845, and Boyd v. United States, 116 U.S. 616, 6 S. Ct. 524, 29 L. Ed. 746 (1886).\n\nThe Andresen case, standing alone, is adverse to the appellant's Fifth Amendment claim. That opinion, written by Chief Judge Murphy, dealt with a court-ordered audit of this appellant's real estate settlement accounts. The petitioner for the court order was the Bar Association of Montgomery County. The petition recited the filing of the criminal information in this case on November 1, 1972, for false pretenses. It pointed out that the appellant had \"acted as settlement attorney for the sale of properties from the Clark-King Construction Company (Clark-King) to enumerated homeowners in the Potomac Woods Subdivision,\" that \"the transactions in question involv[ed] unreleased deeds of trust pertain[ing] to lots 12 (T), 13 (T) [the Standard-Young Associates lot], 14 (S), 15 (S) and 25 (R) [the Warfield lot] of the Subdivision,\" and that \"many of the purchasers of properties in the Subdivision 'knew nothing of the named unreleased mortgages until the subject was revealed . . . to them [by the State's Attorney].'\"\n\nThe appellant there maintained that to compel him to produce his accounts for audit was in contravention of his right against compulsory self-incrimination. The Court of Appeals relied upon the \"required records doctrine\" to avoid the self-incrimination problem. It held, at 269 Md. 327-328:\n\n\"Although the facts in the instant case do not present the classic prototype of the required records doctrine -- i.e., a pervasive regulatory scheme with enforcement procedures, including periodic reporting or inspection of records required to be kept thereunder -- we think them close enough in principle to warrant application of the doctrine. . . .\n\n[I]n the course of regulating transactions involving conveyancing of real estate, the Legislature passed Article 21, § 42, supra note 1, providing a limited right of audit 'of the accounts maintained by such person for funds received in connection with real estate closing transactions in this State.' Thus, by combination of court rule and statute, the records in the instant case are required to be kept subject to audit in the narrow circumstances outlined in Article 21, § 42.\n\nWe think the ordered audit fits each of the Shapiro criteria enumerated above. First, the records required are, obviously, records customarily kept by lawyers, necessary to a proper accounting of monies held for others. Secondly, the records have 'public aspects' making them at least analogous to public records. They detail the use of monies which the lawyer holds for others in an area properly regulated by the State. In State Real Estate Commission v. Roberts, supra, the Supreme Court of Pennsylvania recognized that the escrow account records of a real estate broker were required records within the meaning of Shapiro.\"\n\nIt cited with approval United States v. Silverman, 449 F. 2d 1341, 1345 (2nd Cir. 1971):\n\n\"Appellant's fifth amendment argument is equally without merit. Records required to be kept pursuant to a reasonable regulatory scheme have 'public aspects' and may be examined for evidence of criminal conduct.\"\n\nPredicating its holding that the records were, indeed, required to be kept upon the combined effect of Article 21, § 42 (effective July 1, 1968) and Maryland Rule 1230 (effective November 2, 1970), the Court of Appeals limited the court-ordered audit to those \"accounts maintained . . . for funds received in connection with real estate closing transactions in this state occurring on or after November 2, 1970, the effective date of Maryland Rule 1230.\"\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe only comfort the appellant may take from Andresen is by arguable negative implication. Some of the documentary evidence seized from the appellant antedates November 2, 1970. All of it involves other than escrow accounts -- the precise thing subject to court-ordered audit in Andresen as a \"required record.\"\n\nThe State's position, on the other hand, is that it proceeded exclusively on a Fourth Amendment basis, whereunder probable cause will justify a court's warrant to search for and to seize incriminating evidence, and not upon a Fifth Amendment basis, whereunder a suspect is required by subpoena to present for examination his records which may be incriminating. The appellant seeks to box the State into the Fifth Amendment corner by invoking the ghost of Boyd v. United States, supra. He hangs his hat on a passing reference in Andresen, at 269 Md. 323, which characterized Boyd as \"a vintage case of continued vitality.\"\n\n{PA}\n\nPage 184} Boyd, as Andresen, dealt with producing business records under subpoena for a civil proceeding and not with a search and seizure situation based upon probable cause. It is still good law for the limited proposition that a man may not be compelled to produce the records of a testimonial nature which may incriminate him, subject only to the \"required records\" exception. The privilege not to be compelled to step forth and produce incriminating evidence against oneself has never been equated, however, with the right to foreclose the State from proceeding upon a judicially issued warrant, based upon probable cause, and particularly describing the place to be searched and the things to be seized. And see United States v. Blank, 459 F. 2d 383 (6th Cir. 1972), at 385:\n\n\"We believe that there is a valid and important distinction between records sought by subpoena and records sought by search warrant. The subpoena compels the person receiving it by his own response to identify the documents delivered as the ones described in the subpoena. The search warrant involves no such element of compulsion upon an actual or potential defendant.\"\n\nFor both its limited holding and as a rhetorical Fourth Amendment milestone -- carrying the historic stream of consciousness from Entick v. Carrington, 19 How. St. Tr. 1029 (1765) on to Weeks v. United States, 232 U.S. 383, 34 S. Ct. 341, 58 L. Ed. 652 (1914) -- Boyd is \"a vintage case of continued vitality.\" Another part of Boyd, however -- that relied upon by the appellant here -- is a quaint anachronism of no current vitality. That is its so-called \"mystic union of the Fourth and Fifth Amendments.\" That was a now outdated legal fiction by which justices and judges aggrieved at Fourth Amendment violations by the police could get around the absence of an exclusionary rule. By reading the Fourth Amendment violation as tantamount to compelled (and therefore forbidden) self-incrimination under the Fifth Amendment, exclusion was achieved. The notion was rendered obsolete in the federal courts by the adoption of an exclusionary\n\nrule as part of the Fourth Amendment in Weeks v. United States, supra, in 1914, and in the state courts by Mapp v. Ohio, 367 U.S. 643, 81 S. Ct. 1684, 6 L.Ed.2d 1081, in 1961. The divorce between the Fourth Amendment and the Fifth Amendment is now universally recognized. Gilbert v. California, 388 U.S. 263, 87 S. Ct. 1951, 18 L.Ed.2d 1178 (1967); Schmerber v. California, 384 U.S. 757, 86 S. Ct. 1826, 16 L.Ed.2d 908 (1966). Marron v. United States, 275 U.S. 192, 48 S. Ct. 74, 72 L.Ed. 231 (1927) involved the legitimate seizure of incriminating business records. The last surviving champion (other than the appellant) of the \"mystic union between the Fourth and Fifth Amendments\" was the late Justice Hugo Black (see his concurring opinion in Mapp), simply because he could not read the exclusionary rule into the words of the Fourth Amendment standing alone. Even under the \"mystic union,\" the indispensable predicate was a Fourth Amendment violation in the first instance. Here there was none. Even if the \"mystic union\" still endured, which it does not, the appellant could not prevail. As was held in State v. Bisaccia, 213 A.2d 185 (N.J. 1965), at 188:\n\n\"No doubt the Fifth Amendment and the restraints in the Fourth seek to protect related values even though the nature and extent of the protection vary. So an attempt to use against a man things taken from him in violation of the Fourth Amendment could invite the question whether the Fifth was intended to shield him from it. Mr. Justice Black took that view of the Fifth in his separate opinion in Mapp v. Ohio, 367 U.S. 643, 81 S.Ct. 1684, 6 L.Ed.2d 1081, 1093 (1961); but it is not apparent how the Fifth Amendment can make illegal a search and seizure which the Fourth Amendment permits. The Fourth has its own expressed limitations upon search and seizure; there is no reason to suppose the framers of the Amendments intended to imply through the Fifth an additional limitation upon the Fourth.\"\n\nThe State here did all the investigative work; the appellant was not compelled to do anything.\n\n11. The Prosecutor's Argument to the Jury\n\nThe appellant levels one charge at the prosecutor's closing argument to the jury and another at his rebuttal argument, the first a carefully directed shot, the second a broadside.\n\nThe state's attorney's closing argument to the jury ran to forty-five pages of transcript. In the course of placing final argument and jury deliberation in their appropriate posture in the context of the total trial, he said the following sentence, at page three of that argument:\n\n\"The evidence is before you now, because as a matter of law in this State, the Court has ruled that there is sufficient evidence by which you can find the defendant guilty of the counts with which he remains charged at this point.\"\n\nWithout making anything further of the point, the state's attorney went on to explain the various counts which the jury was to consider. Two pages further along in the transcript of argument, an unrelated break occurred, apparently to permit a juror to exercise a point of undesignated personal privilege:\n\n\"JUDGE BARRICK: Excuse me. Are you having a problem?\n\nJUROR: No, not really.\n\nJUDGE BARRICK: The jury will be excused and may retire to the jury room.\n\nThe Court thereupon recessed, at 1:42 o'clock p.m., and reconvened at 1:55 o'clock p.m.\"\n\nThe appellant seized upon the break to level an objection:\n\n\"MR. LAMB: Your Honor, I don't mean to be picky, but I would have to register a strong objection at this time regarding Mr. Werner's comment that Your Honor found sufficient\n\nevidence to go to the jury. I think this is highly objectionable and is grounds for a mistrial if the jury now considers that there is sufficient evidence in this case -- that's not proper argument to the jury.\n\nMR. WERNER: The jury is the judge of the law, and the law of the state says there must be sufficient evidence before they can determine -- Mr. Lamb can argue that.\n\nTHE COURT: Well, I'm not going to declare a mistrial, but I am going to suggest to the State that you not use that any more.\"\n\nWe see no abuse of discretion in not granting a mistrial. The mere passing reference in this case in a single sentence -- without fanfare or highlighting -- to a point of, at most, peripheral significance is simply of no consequence.\n\nThe broadside is aimed at the state's attorney's rebuttal argument. That argument ran to seventeen pages of transcript and generated no timely objections. The following occurred after the jury had entered upon its deliberations:\n\n\"(Bench conference out of presence of jury, after jury had retired to jury room following completion of arguments, at 5:07 o'clock p.m., May 29, 1973)\n\nMR. LAMB: Your Honor, I did not object during Mr. Werner's rebuttal, but I strongly object to the scope and substance of the rebuttal argument with respect to his castigating me and calling me a liar to the jury; in effect playing on the jury's -- harping on the fact that he as a lawyer is held to a higher standard than anybody else in this jurisdiction. I thought his entire rebuttal argument was wholly improper.\n\nTHE COURT: Well, it's a little late to object to it now -- there's nothing I can do about it now. But quite frankly, I thought, if you want to know the truth about the situation, that arguments in all\n\nthree respects -- of all three lawyers could have been objected to in certain respects.\n\nMR. LAMB: I recognize that, Your Honor --\n\nTHE COURT: I think it's bad when you get into personalities and when particularly you refer to it as what I think the case is. It's unimportant as lawyers what we think of the cases; it's what the evidence is to prove, and we shouldn't inject ourselves into it personally, and that goes to all three of you, I think. The Court will recess until after the jury returns.\"\n\nInitially, we agree with Judge Barrick that objection came too late. Holbrook v. State, 6 Md. App. 265, 250 A.2d 904, offers no support for the appellant's position that the jury should have been returned to the courtroom for a curative instruction. In that case, the objection, though not made when the offending remark was uttered, at least came after the speech was over but before the jury had retired. Moreover, we see no merit in the complaint, even ignoring its staleness. The two generalized grievances made to Judge Barrick are here supplemented by a bill of particulars listing thirty-two alleged improprieties. The first seventeen curiously were not even part of the rebuttal to which the tardy objection was made, but were a part of the initial closing argument. We have reviewed the rebuttal argument at length and find it unexceptionable in all regards. At the end of a hard-fought and terribly complicated trial, each of two highly competent advocates attempted so to marshal the facts and arguable inferences as to put his own case in the best possible light and his opponent's in the worst possible light. That is the quintessential function of argument. That a counterpunching prosecutor, in rebuttal, twice characterized the closing defense argument as having \"deliberately misrepresented\" facts and having deliberately misled\" the jury, when it argued that the deeds of trust were simply mechanic's liens, is not unduly unrestrained. Nor is the peroration, \"The facts have been distorted; have been distorted terribly; have been distorted desperately.\" Neither\n\ndo we find inappropriate the argument that a lawyer, entrusted by clients with their money and their legal fortunes, is, indeed, held to a higher trust and degree of responsibility than those who cannot and do not take on fiduciary obligations. The attack upon the rebuttal is both too little and too late.\n\n12. Jury Instructions\n\nUnder another umbrella contention, the appellant claims that the trial judge committed reversible error in nineteen different respects. These nineteen subcontentions break into two major categories. With respect to seven of them, specific objections were lodged and preservation for appellate review is clear. With respect to twelve others, no objections were registered at the trial level and the appellant falls back upon the defensive line of \"plain error.\"\n\nSpecific Objections:\n\na. Allusion to Failure of Appellant to Testify\n\nIn instructing the jury as to the fraudulent intent element of false pretenses, the court said:\n\n\"Since intent is subjective and without the cooperation of the accused cannot be directly or objectively proven, its presence must be shown by establishing facts which permit a proper inference of its existence.\"\n\nOut of the phrase \"without the cooperation of the accused\" the appellant reads the instruction as an unfair comment upon the fact that the appellant did not take the stand in his own defense. We simply cannot read the instruction as doing any such thing. The necessity to infer an internal mens rea from external conduct absent some confession of criminal intent is ever present. The necessity to infer such an element is a constant whether a defendant stays off the stand or takes the stand to offer self-serving denials of criminal intent.\n\n{PA}\n\nPage 190} b. Simultaneity between Making False Representation and Obtaining of Chattel, Money, Etc.\n\nThe appellant objected to the following instruction:\n\n\"The thing obtained need not be in existence at the time of the making of the pretense, in order to be said to have been obtained thereby.\"\n\nHe cites no authority and develops no argument to substantiate his position. The propriety is clear. A victim could obviously part with newly acquired monies or chattels on Tuesday in reliance upon a false representation made on Monday before those monies or chattels had come into his hands. There is no necessity that the act of falsely representing and the act of obtaining be simultaneous. The factual referent for this whole point was that the sum of money actually defrauded was not ascertainable at the time of the false representations, but only became fixed when the appellant determined how much to hold back by not applying it to proper purposes.\n\nThe appellant also objected that the immediately following instruction, unexceptionable on the merits, was twice repeated by the judge. The point is without merit. Ager v. Baltimore Transit Co., 213 Md. 414, 423, 132 A.2d 469; Marlow v. Cerino, 19 Md. App. 619, 626, 313 A.2d 505.\n\nc. Extraterritoriality of Persuasive Common Law Authority\n\nThe appellant challenges three statements about the law of false pretenses not on their merits but upon the exclusive ground that the principles stated to the jury came from Wharton's Criminal Law, 2 American Jurisprudence, and Corpus Juris Secundum, respectively, and had not been adopted verbatim by Maryland decisions. It is not necessary\n\nto belabor the bedrock characteristic of the Anglo-American legal tradition that the vast experiential reservoir of the entire common law world is available as persuasive authority to fill the gaps and interstices in our own recorded legal expressions. A judge who ignored so rich and resourceful a library would be derelict.\n\nd. Use of the words \"or to the use of another\"\n\nThe appellant objects to the instruction on the elements of embezzlement and larceny after trust to the effect that the conversion could be \"to one's own use or to the use of another.\" Without reflecting on the merits, we simply note that the point is moot since guilty verdicts were not returned on any of the embezzlement or larceny after trust counts.\n\ne. The Failure to Instruct on Immel v. State\n\nThe appellant takes umbrage at the failure of the trial court to instruct on the basis of Immel v. State, 228 Md. 566, 180 A.2d 703. We agree with the trial judge that Immel was inapposite. Immel dealt with a situation where a defendant obtained a bank credit to his account on the basis of a false pretense, but never drew upon the account so that the bank never parted with title to anything. That factual pattern had no analogue in the present case. Its only arguable significance, moreover, was to the false pretence charges against the Title Insurance Company of Minnesota, the convictions on which we have overturned for other reasons.\n\nf. Elements of Fraudulent Misappropriation by a Fiduciary\n\nThe appellant now claims that he objected to the failure of the trial court to define the elements of the crime of fraudulent misappropriation by a fiduciary, although he admits that his objection was \"inartfully worded.\" That is the most artful of\n\nunderstatements, since the confrontation consisted only of the following:\n\n\"THE COURT: . . . As far as the other objections are concerned, there are certain instructions that I gave the jury that have not come from case law, necessarily, Maryland case law, but in order to apprise the jury of the requirements under the various counts, I think it is necessary to explain to them the elements of the crime that needed to be proven, and sometimes you can't find that particular element defined; therefore you've got to go elsewhere.\n\nMR. LAMB: I would submit that that would be where the judge is the determiner of the law, but in Maryland the jury is the finder of facts.\"\n\nWe cannot glean the remotest \"inartful\" suggestion of the objection now being pressed. The judge had, moreover, read to the jury the full text of Article 27, § 132.\n\ng. Failure to Instruct under Roderick and Gordon\n\nThe appellant had filed a written request for instructions whereunder he urged several direct quotations from Roderick v. State, 9 Md. App. 120, 262 A.2d 783, and Gordon v. State, 5 Md. App. 291, 246 A.2d 623. The judge did not read those quotations directly. We see no error. Roderick was a non-jury case involving a conviction for larceny after trust. There were no convictions on the larceny after trust counts in this case. Gordon was an embezzlement case. There were no convictions on the embezzlement counts in this case. The charge actually given by Judge Barrick, moreover, fully and competently spelled out all of the necessary elements of larceny after trust, of embezzlement, and of fraudulent misappropriation by a fiduciary.\n\n{PA}\n\nPage 193} Alleged Plain Errors :\n\nThe appellant raises twelve additional assignments of error which were not objected to below but which he now alleges are noticeable under Maryland Rule 756 g as plain error.\n\nh. Failure to Instruct that Opening and Closing Arguments are not Evidence\n\ni. Failure to Instruct that Jury Could Not Determine Law from Arguments of Counsel\n\nj. Failure of the Court to Summarize the Testimony\n\nWithout reflecting on the merits of any of the above, it is enough to notice that even if there had been error in not giving such instructions, the errors would have been of omission and not of commission. Our position with respect thereto was ably put by Judge Powers in Brown v. State, 14 Md. App. 415, 422, 287 A.2d 62:\n\n\"[W]e think that as a general guide, we may say that under Rule 756 g we will take cognizance of and correct an irremediable error of commission, but not an error of omission. Of course, the error must be plain, and material to the rights of the accused, and, even then, the exercise of our discretion to correct it should be limited to those cases in which correction is necessary to serve the ends of fundamental fairness and substantial justice.\n\nThe omission here was one which the trial court could have, and undoubtedly would have, supplied by a supplementary instruction if appellant had requested it before the jury retired to consider its verdict. Reynolds v. State, supra. It does not call for us to correct it now.\"\n\nk. The \"Allen Charge\" as Part of the Initial Instruction\n\nNot simply was there no objection to this charge\n\nhaving been given, but it was, moreover, concededly proper under Kelly v. State, 16 Md. App. 533, 298 A.2d 470, affirmed by Kelly v. State, 270 Md. 139, 310 A.2d 538. The Kelly case, furthermore, made clear that it was not error to give the \"Allen Charge\" as a part of the initial instructions to the jury, rather than holding it back to \"dynamite\" a deadlock.\n\nl. Failure to Define \"Most Important Affairs\"\n\nNo objection is now made to the general instruction on reasonable doubt other than that in the course thereof, the judge did not further define the words \"most important affairs.\" That is clearly a matter of omission and not of commission.\n\nm. Failure to Instruct as to the Law of Escrow Accounts\n\nThis, again, is palpably a matter of omission and not of commission.\n\nn. Instructions as to \"Fiduciary\" and \"Misappropriation\" Incomplete\n\nThe fault, if any, was one of omission.\n\no. Instructions as to Agency and Opinion\n\nThe appellant makes the bald allegation that the \"instructions as to agency and opinion were misleading without reference to the facts.\" He does not specify how they were misleading. As we have pointed out, the trial judge is not required to review the facts. Nor is he required to give instructions on his own motion. Wilson v. State, 239 Md. 245, 210 A.2d 824.\n\np. Obtaining \"Any Sum\" as an Element of False Pretenses\n\nContrary to the appellant's position, value is of no moment in making out a case of false pretenses, provided the goods obtained be of some value. Polisher v. State, supra. Benjamin v. State, 9 Md. App. 373, 264 A.2d 490, relied on by the appellant, is inapposite. The fatal variance in that case was\n\nbetween an allegation that two thousand dollars of current money had been received and proof which Showed that no money had been received, but only the security of a bail bond. See also Urciolo v. State, supra, wherein we held that there was no meaningful variance between an allegation that $7,500 had been embezzled and proof that $1,788 had been embezzled.\n\nq. Repetition of Instruction as to the Difference Between a Mere Legal Opinion and a False Representation\n\nThe appellant here does not practice what he preaches, repeating the contention we disposed of in dealing with the latter part of subcontention b above.\n\nr. Instruction as to Detriment\n\nThe appellant claims that the judge erroneously instructed the jury that there is no necessity that the victim suffer loss as an element of false pretenses. The actual instruction was that there is no necessity that the victim suffer pecuniary loss so long as he has suffered some detriment. That is a correct statement of the law. Polisher v. State, supra.\n\ns. Instruction as to Personal Benefit to Perpetrator\n\nThe appellant claims that the judge incorrectly instructed that there need be no element of gain to sustain a false pretenses charge. The actual instruction was that it was not necessary that the perpetrator of the false pretenses derive any personal benefit from his misrepresentation. This, again, is an accurate statement of the law. Polisher v. State, supra; Baskerville v. State, supra.\n\n13. Corroboration of \"Accomplice\" Melvin Clark\n\nWe will accept, arguendo, the appellant's position that Melvin Clark was an accomplice, whose testimony needed to be corroborated in order to sustain a conviction. The\n\nappellant sharpens his focus to the element of the wrongful misappropriation on the three charges of fraudulent misappropriation by a fiduciary. It is enough to point out that the failure of the appellant to apply the purchase money received at the respective settlements to obtain the releases of preexisting deeds of trust on the Pollitt, Warfield and Holtzclaw lots is corroboration enough. To begin to catalogue the further massive corroboration would be to reiterate the great bulk of an already intolerably long opinion.\n\n14. The Admissibility of Clark's Testimony\n\nThe appellant's attack upon the testimony of Mel Clark is frenzied and diverse. An agreement was entered into between Clark and the State's Attorney's Office on October 31, 1972, whereby Clark agreed to testify as a State's witness and the State agreed not to proceed against Clark criminally. The appellant claims initially that the agreement was \"illegal\" under Bowie v. State, 14 Md. App. 567, 287 A.2d 782. Bowie, of course, did not hold that an immunity agreement is \"illegal\" but simply that it might not have binding legal effect. The point is irrelevant in any event, since the problem (if any) is that of Clark and not that of the appellant. It is not for the appellant to assert some arguable Fifth Amendment privilege for Clark. Clark was a competent witness. His agreement with the State was made known to the jury, and they could make of it what they would in assessing his credibility and weighing his testimony.\n\nThe appellant next argues that the use of Clark as a witness violated the attorney-client privilege. It is enough to point out that the privilege flows from the attorney to the client and not vice versa. The right to insist that confidential communications between attorney and client not be divulged rests exclusively in the client. The client is always free to divulge such communications. Lanasa v. State, 109 Md. 602, 617-618, 71 A. 1058.\n\nThe appellant goes on to contend that the grant of immunity to Clark was not made known to him and that this\n\namounted to the employment of Clark by the prosecutor \"as a spy to gain information in breach of the confidence of an attorney-client relationship\" for a seven-month period. This charge has no factual basis. Clark testified that he terminated his attorney-client relationship with the appellant in 1972. The record reveals no contact between Clark and the appellant after October 31, 1972. The testimony of Clark, here in issue, is all as to events antecedent to October 31, 1972. The charge made by the appellant is, therefore, irrelevant to the issue.\n\nThe appellant claims that the failure of the State to inform him of the immunity agreement until the time of trial amounted to an unconstitutional suppression of evidence under Brady v. Maryland, 373 U.S. 83, 83 S. Ct. 1194, 10 L.Ed.2d 215 (1963). The immunity agreement, we hold, was simply not exculpatory and material evidence within the contemplation of Brady, nor was it suppressed within the contemplation of Brady. Moore v. Illinois, 408 U.S. 786, 92 S. Ct. 2562, 33 L.Ed.2d 706 (1972); Younie v. State, 19 Md. App. 439, 311 A.2d 798. The appellant complains additionally that Maryland Rule 728 was violated when the State did not disclose this document to him in response to his request for all documents which the State intended to introduce at the time of trial. Aside from the fact that non-compliance with Rule 728 carries no exclusionary sanction, Jackson v. State, 8 Md. App. 260, 259 A.2d 587, the appellant asked for no delay to study the document. Obviously, none was needed. The appellant, indeed, did not object to the introduction of the immunity agreement. It was helpful to him, not harmful. The appellant's vain hope, for which he cannot find even arguable authority, was to suppress the entire testimony of Clark and not the mere documentary corroboration of the testimony that Clark was appearing for the State pursuant to a grant of immunity.\n\nThe appellant contends that after October 31, 1972, he was entitled to Miranda warnings on whatever occasions Clark engaged him in conversation. The point is moot, since no such conversations were introduced in evidence.\n\nThe appellant does not explain how his Fourth and Sixth Amendment rights were violated by Clark's testimony, and we cannot imagine how they were.\n\nThe appellant's final point in this regard is even more of a flight from reality, as reality is tied for purposes of appellate review to the trial record. He argues at one point:\n\n\"(It is significant that the investigation of appellant was carried out by virtue of an LEAA grant and that Clark's brother-in-law is Henry E. Peterson, Deputy Attorney General of the United States in charge of the Criminal Division.)\"\n\nHe argues again:\n\n\". . . this Court stated that the Miranda warnings must be given when 'questioning (is) initiated by law enforcement officials' (which Clark was at the time, his brother-in-law also being Deputy Attorney General of the U.S. Department of Justice which funded the prosecution.)\"\n\nThere is no shred of allusion in the record to such irrelevant whispers. Such flagrant and insinuating injection of extraneous fact is highly reprehensible as an appellate practice. We register the sternest disapproval.\n\n15. The Use of Allegedly Perjured Testimony\n\nThe appellant claims that the testimony of Norman Hecht, a vice president of the Madison National Bank, was perjured and that the State knowingly used such perjured testimony.\n\nThe controversy swirls essentially about Hecht's testimony that the appellant and Clark-King had not paid off the debt secured by the so-called Lumsden trust. Clark-King owed two debts to the Madison National Bank. The bank had applied several payments by Clark-King to the other debt and not to the one secured by the Lumsden trust. The bank and Mr. Hecht believed that it was the prerogative of the creditor to designate the allocation of payments where\n\nthe creditor holds more than one note. This conclusion by Hecht was reflected in his trial testimony.\n\nTwo months after the trial had been concluded, the Court of Appeals handed down its decision in Clark-King Construction Co. and Andresen v. Salter, et al., supra. Judge Miller, in the Circuit Court for Montgomery County, had ratified a foreclosure sale upon the same principle as that relied upon by Hecht and the bank. The Court of Appeals reversed his order of ratification and held that the option of allocating payment to one debt or another is in the debtor and not in the creditor.\n\nOut of those strands, the appellant spins his theory that Hecht was a \"liar\" and that his testimony at this trial, based upon his then current beliefs, was \"perjury.\" His belief in the propriety of his then legal theory, even though later overturned by the Court of Appeals, was no more \"perjured\" than was the decision by Judge Miller to ratify foreclosure, relying upon the same legal theory, \"perjured.\"\n\nThe appellant captures the State in the web of \"knowingly using perjured testimony\" with two strands. He points out that the Court of Appeals in Clark-King relied in part upon the testimony of Frank Marsalek, whose position was opposed to that of Hecht. He further points out that the State, in preparing for this trial, had the benefit of Frank Marsalek's opinion and should, therefore, have reached the same conclusion that the Court of Appeals ultimately reached. He buttresses that position by quoting from Judge Barnes' decision to the effect that his conclusion was based upon \"well established law\" and then charges the prosecutor, as \"an attorney at law,\" with \"knowledge of or at least inquiry into 'well established law.'\"\n\nWithout attempting to dissect in detail so imaginatively spun a theory, we simply hold that it has not been demonstrated to us that the testimony of Hecht was in any way perjured, State v. Devers, 260 Md. 360, 272 A.2d 794, let alone that the State knowingly used perjured testimony so as to require a reversal of the convictions.\n\n{PA}\n\nPage 200} 16. Denial of Motion for Continuance\n\nIt is settled that the grant or denial of a continuance lies within the sound discretion of the trial court. As we held in Nichols v. State, 6 Md. App. 644, 646, 252 A.2d 499:\n\n\"To show an abuse of discretion and prejudice for failure to continue a case because of the absence of a witness, the party requesting the continuance should show that the evidence of the absent witness was competent and material, that he believed the case could not be fairly tried without the evidence, that he had made diligent and proper efforts to secure the evidence, and that he had reasonable expectation of securing the evidence within some reasonable time.\"\n\nA hearing was held before Judge Barrick on May 14, 1973, on the motion for a continuance. By agreement, the transcript was referred to Judge Robert E. Clapp, Jr., the administrative judge. Judge Clapp denied the motion, stating in pertinent part:\n\n\"The complicated nature of the trial has been obvious since the filing of the indictment and the defendant has had ample time for any required preparation. The arguments of counsel do not present any extraordinary cause for postponement as required by the above Section 591 [of Article 27]. Permission for the postponement is therefore denied.\"\n\nWe see no abuse of discretion. Charges had been pending against the appellant since November 1, 1972, seven months before trial. It is evident from the trial record that appellant's counsel was intimately familiar with every nuance of this complex series of events, with the law pertaining thereto, and that he afforded the appellant a superlative defense.\n\n{PA}\n\nPage 201} 17. Denial of Motion for Severance\n\nMuch of the background necessary to understand this terribly complex set of facts was common to all of the charges. Any one incident, moreover, would probably have been relevant at the trial of any of the other incidents, to show a general pattern and scheme of conduct and to negate the defense, plausible enough in a single case, of mere careless mistake. We hold that Judge Barrick did not abuse his discretion in concluding:\n\n\"It seems to me that there is sufficient evidence as to these alleged crimes that they are related in such a way that they tend to show a scheme or intent, motive, and I do believe that at this stage, although I am not ruling on it specifically, that the evidence presented on any one of the counts can be introduced as evidence to show motive, scheme or plan as to other counts; therefore I think they should not be severed but tried together.\"\n\nSee Baumgartner v. State, 21 Md. App. 251, 255-256, 319 A.2d 592.\n\n18. Ostensibly Irrelevant Evidence\n\nThe appellant challenges the relevance of State's Exhibit 59, a homeowner's policy issued to Antonelli and Caniglia in 1969. We hold that it was very relevant. It dealt specifically with Lot 13T. It helped to establish that Lot 13T was already encumbered by two deeds of trust but that the appellant, as settlement attorney for the 1969 sale to Antonelli and Caniglia and as the person responsible for the issuance of the title insurance policy, did not then reveal the existence of the two deeds of trust. It had a direct bearing on the later history of Lot 13T, on the knowledge of the appellant as to the condition of the title to Lot 13T specifically, and as to the appellant's general modus operandi.\n\n19. Admissibility of Testimony of Carl Zentz\n\nCarl Zentz had worked for the appellant for three and one-half years as a law clerk and title examiner. He had been\n\ngraduated from law school one week before the trial. As Zentz was being called to testify, the appellant sought vicariously to assert the Fifth Amendment privilege against compulsory self-incrimination for him. Judge Barrick ruled properly that the privilege was that of the witness alone and not of the appellant.\n\nEarly in his testimony, Zentz inquired of the court whether he was required to testify, asserting an attorney-client privilege. The court ruled, again quite properly, that there was no such privilege in this case.\n\nThe appellant now urges upon us Morris v. State, 4 Md. App. 252, 242 A.2d 559, and Bieber v. State, 8 Md. App. 522, 261 A.2d 202, which hold that the attorney-client privilege extends to the employees of the attorney as well. As both Morris and Bieber make clear, however, the privilege is that of the client and not of the attorney. The principle, not here relevant, is simply that a client is secure in his confidential communications made to his attorney or to the employee of his attorney. The only clients remotely involved even with the subject matter of Zentz's testimony were Mel Clark, George Young and Robert Holtzclaw, all of whom had appeared voluntarily for the State and none of whom were asserting any attorney-client privilege as to the appellant or his office.\n\nThe privilege, moreover, goes only to confidential communications. McCormick, The Law of Evidence (1954), Ch. 10, \"The Client's Privilege: Communications between Client and Lawyer,\" § 93, \"Subject-Matter of the Privilege -- (a) Communications,\" pp. 186-188; 8 Wigmore, Evidence (McNaughten rev. 1961), Ch. 82, \"Communications between Attorney and Client,\" § 2306, \"Communications distinguished from acts,\" pp. 588-591. The testimony of Zentz did not relate, directly or indirectly, the conversations or communicative acts of anyone.\n\nHe described the general set-up of the appellant's filing system. He explained that a general basic file dealt with a whole subdivision and showed its state of title, encumbrances, releases, etc. He testified as to his work with\n\nand periodic updating of (by checking courthouse land records) the basic file on the Potomac Woods subdivision. He pointed out where his own notes and title abstracts revealed that several of the deeds of trust, relevant in this case, had not been released as of the respective settlement dates.\n\nEven absent the controlling fact that the privilege is the client's and not the attorney's, there was nothing in Zentz's testimony as to any confidential communications from clients within the contemplation of the privilege.\n\n20. The \"Best Evidence Rule\"\n\nIn making this contention, the appellant has utterly misperceived the function and utility of the \"best evidence rule.\" The thrust of his contention is that the crime of fraudulent misappropriation by a fiduciary requires \"proof of an appropriation not in the lawful execution of the trust imposed on the fiduciary\"; that all funds were disbursed by checks written on the appellant's escrow accounts; and that the \"best evidence\" of the misappropriation was, therefore, the checks themselves. He makes a similar argument with respect to the false pretenses counts: that the \"best evidence\" of the falseness of the representations as to state of title was such documentary originals as \"notes, deeds of trust, releases and statements of account.\"\n\nThe entire contention is framed in the context of the appellant's motion for judgments of acquittal, since no timely objections were made, in this regard, at the time of the introduction into evidence of the various items of allegedly \"secondary\" or \"less than best\" evidence.\n\nThe \"best evidence rule,\" of course, has nothing to do with how the State (or any other party to a case) proves any element of its case but only with how it proves the contents of a document. If the State wishes to prove the terms of a document, it must, where possible, produce the document itself. See 4 Wigmore, Evidence (Chadbourn rev. 1972), § 1174, \"'Best Evidence' principle (continued): Scope of the phrase,\" p. 400:\n\n\"The phrase about 'producing the best evidence,'\n\nthen, has long been nothing more than a loose and shifting name for various specific rules. Each of these stands upon its own basis of principle, and each of them has its own history, independent of the phrase. The rules were not created by deduction from the principle implied in the phrase; but the phrase came to be used as descriptive of the rules already existing. What were these rules?\n\n(1) Chiefly, and usually, the phrase was employed for the rule that the terms of a document must be proved by the production of the document itself, in preference to evidence about the document (§§ 1177-1282 infra). This is the use that has longest survived, and its illustrations are too numerous to need citation.\"\n\nAnd see McCormick, The Law of Evidence (1954), Ch. 23, \"The Requirement of the Production of the Original Writing as the 'Best Evidence,'\" § 197, \"The Reason for the Rule,\" p. 410:\n\n\"The policy-justification for the rule preferring the original writing lies in the facts (1) that precision in presenting to the court the exact words of the writing is of more than average importance, particularly as respects operative or dispositive instruments, such as deeds, wills and contracts, since a slight variation in words may mean a great difference in rights, (2) that there is a substantial hazard of inaccuracy in the human process of making a copy by handwriting or typewriting, and (3) as respects oral testimony purporting to give from memory the terms of a writing, there is a special risk of error, greater than in the case of attempts at describing other situations generally. In the light of these dangers of mis-transmission, accompanying the use of written copies or of recollection, largely avoided through proving the terms by presenting the writing itself, the preference for the original writing is justified.\"\n\nAnd see Wells v. State, 8 Md. App. 510, 518, 261 A.2d 181; Davis and Napier v. State, 7 Md. App. 667, 670, 256 A.2d 819; and Duggins v. State, 7 Md. App. 486, 488-490, 256 A.2d 354:\n\nIn this case, the State simply did not offer the contents of any documents via the handwritten or typewritten notes or via the oral recollection of one who had observed those documents. The \"best evidence rule\" was not in any fashion involved.\n\n21. Reservation of Question for Court En Banc\n\nThe hearing on the motion to suppress physical evidence was concluded on April 12, 1973. On April 19, 1973, Judge Barrick filed a written Memorandum and Order deciding the motion. A copy was mailed to appellant's counsel. On May 4, 1973, the appellant filed \"Exceptions to said Order of Court and a Reservation of question for the Court En Banc pursuant to Article IV, Section 22 of the Constitution of Maryland and Maryland Rule 510.\" At a hearing on this and a number of other motions on May 14, 1973, the matter was taken under advisement. On May 21, 1973, immediately before the trial began, the motion was renewed and again taken under advisement. On May 30, 1973, just prior to the reception of the verdict, the court declined to reserve the question for the court en banc on the ground that the motion had not been timely filed.\n\nArt. IV, § 22, of the Maryland Constitution, provides:\n\n\"Where any Term is held, or trial conducted by less than the whole number of said Circuit Judges, upon the decision or determination of any point, or question, by the Court, it shall be competent to the party, against whom the ruling or decision is made, upon motion, to have the point, or question reserved for the consideration of the three Judges of the Circuit, who shall constitute a court in banc for such purpose; and the motion for such reservation shall be entered of record, during the sitting, at which such decision may be made; and the several Circuit Courts shall regulate, by rules,\n\nthe mode and manner of presenting such points, or questions to the Court in banc, and the decision of the said Court in banc shall be the effective decision in the premises, and conclusive, as against the party, at whose motion said points, or questions were reserved; but such decision in banc shall not preclude the right of Appeal, or writ of error to the adverse party, in those cases, civil or criminal, in which appeal, or writ of error to the Court of Appeals may be allowed by Law. The right of having questions reserved shall not, however, apply to trials of Appeals from judgments of Justices of the Peace, nor to criminal cases below the grade of felony, except when the punishment is confinement in the Penitentiary; and this Section shall be subject to such provisions as may hereafter be made by Law.\"\n\nAs was recognized by Chief Judge Brune in State Roads Commission v. Smith, 224 Md. 537, 540, 168 A.2d 705, \"Review by a court in banc in the counties is a procedure long authorized, but rarely used.\" As to the party making the motion, \"a reservation of points or questions for consideration by the Court en banc is a substitute for an appeal to the Court of Appeals.\" Buck v. Folkers, 269 Md. 185, 187, 304 A.2d 826.\n\nIn Costigin v. Bond, 65 Md. 122, 3 A. 285, certain exceptions were taken to rulings on jury instructions on May 31, 1885. On April 2, 1885, two days later, the aggrieved party moved to have the question reserved and considered by the court en banc. The Court of Appeals held that the motion came too late, strictly construing \"sitting\" to mean the very day on which the adverse ruling was made. It said, at 65 Md. 124:\n\n\"This proceeding is in substitution of an appeal to the Court of Appeals, and makes a considerable alteration in the law on this subject. The change is not to be extended by construction beyond the terms of the Constitution. It is provided that the\n\nmotion for a reservation of the point or question decided shall be entered of record during the sitting at which the decision may be made. The word 'sitting' is not synonymous with 'term' of the Court. The exception to a ruling must properly be taken as soon as the ruling is made but this provision of the Constitution intended to give the party taking an exception the entire sitting of the Court (that is the whole time until the Court adjourned for the day) to determine whether he would have his appeal to the Court in banc, or to the Court of Appeals. It would be a very improvident construction of this section to hold that a party might have the whole term of the Court to make up his mind; and we think it was not warranted by the plain meaning of the words. As the motion was not entered of record during the sitting at which the ruling was made, the Court in banc had no jurisdiction of the appeal. As the ruling of the Court in banc was made exclusively on the bills of exception, our decision refers only to them.\"\n\nSince the Memorandum and Order of Judge Barrick here in question was mailed to appellant's attorney on April 19, we cannot say that Judge Barrick was wrong in concluding that the filing of the Motion to Reserve the Question for the Court En Banc on May 4, fifteen days later, was not accomplished \"during the sitting, at which such decision\" was made, even if allowance is made for receiving the ruling by mail. (The appellant makes no claim that the mailed order did not promptly arrive.)\n\n22. Admissibility of Testimony of John C. Connally\n\nJohn C. Connally was the Senior Vice President for the Title Insurance Company of Minnesota. A reading of his testimony does not reveal that he was offering opinion evidence \"as an expert,\" as the appellant now alleges. He testified merely as to the manner in which his company did business with the appellant. He also explained several\n\nportions of a title insurance policy issued by his company. His testimony was not improper.\n\n23. Coercion of Jury into Reaching a Verdict\n\nThe gist of this contention was the giving of the \"Allen Charge\" to the jury. We have already discussed that issue in dealing with contention 12(k) above. The appellant, however, broadens this contention that \"the jury was coerced into returning a verdict\" by pointing to the cumulative effect of the \"Allen Charge\" (given during the regular jury instructions) and two other factors. He refers to \"the hour of the day\" and the fact that \"the jury was sent off at the end of a normal working day in their lives.\" The jury actually retired to begin its deliberations at 5:07 P.M. We find that in no way remarkable or \"coercive,\" standing alone or in combination with other factors. The very reference, outside the record, to the third factor, we find inexcusable. (See contention 14 above.) The appellant recites in his brief:\n\n\"The effect of the Court's parting charge and the hour of the day, together with the information received that the jury was told that they could not leave until they reached a decision (which does not appear in the record) gives credence to the proposition that the jury departed on its deliberation under threat of coercion.\" (Emphasis added)\n\nThe appellant goes on with his unsupported (and therefore unrebuttable) accusations:\n\n\"Less than three quarters of an hour later, just after midnight, the verdict was returned. It has also since been learned that during this short period of time the jury did not know how to react, did not understand their function, the law or the facts and simply decided to reach a majority verdict as soon as possible, lest they stay all night, and decided if their decision was wrong that it would be corrected by an appellate court.\"\n\nNot simply is the point without merit, but the making of it is unconscionable appellate practice.\n\n24. Effective Assistance of Counsel\n\nThis contention that the appellant's counsel \"was so utterly ineffective in preparation of the defense that appellant was denied genuine and effective representation\" is perhaps \"the most unkindest cut of all.\" The easy answer is that the point was not raised below and is, therefore, not properly preserved for appellate review. Maryland Rule 1085; Harris v. State, 2 Md. App. 408, 234 A.2d 781. After lengthy review of this entire record, however, it behooves us to observe that appellant's counsel evidenced superb preparation in his detailed familiarity with the facts and the law (see contention 16 above) and that he conducted a bitterly-fought, last-ditch defense on every peripheral as well as central point. The cross-examination was thorough. The jury presentation was expertly organized and executed. The Sixth Amendment never contemplated more.\n\n25. Denial of Judgments of Acquittal\n\nWe have already discussed the legal sufficiency of the evidence in dealing with contentions 2 and 4 above. The appellant complains additionally that the judge himself applied the wrong test when he indicated that \"the ruling I made on motions that were previously submitted was based on my reviewing of facts most favorable to the State; and so that there is no mistake about that, that is the test that I used.\"\n\nAs we have repeatedly pointed out, in a jury trial, the test as to whether the evidence was sufficient in law to permit the trial judge properly to deny the appellant's motion for a judgment of acquittal and to submit the case to the jury is whether the admissible evidence adduced at the trial either showed directly, or circumstantially, or supported a rational inference of, the facts to be proved, from which the jury could fairly be convinced, beyond a reasonable doubt, of the appellant's guilt of the offense charged. Williams v. State, 5 Md. App. 450, 459,\n\n247 A.2d 731; Metz v. State, 9 Md. App. 15, 23, 262 A.2d 331.\n\nWe see nothing inconsistent between that law and the position taken by Judge Barrick. Since the jury, as the ultimate assessor of credibility and weigher of evidence, was free to accept the witnesses and permissible inferences most favorable to the State's cause, Judge Barrick was required to look at the evidence in the light most favorable to the State and to see whether it was legally sufficient.\n\nThe appellant's throw-away subcontention that the submission of six embezzlement and larceny after trust counts to the jury, notwithstanding the fact that \"the evidence was so lacking in this regard that the State virtually abandoned these counts in its closing argument\" somehow \"precluded [him] from taking the witness stand in his defense\" is the naked assertion of a conclusion weirdly unconnected with its premises and defying the imagination even to concoct an arguable rationale.\n\n26. The Motion for a New Trial\n\nThe appellant filed a motion for a new trial which was denied after a full hearing on October 5, 1973. Although he there pressed eight reasons for granting his motion, he now relies solely on the ground of newly discovered evidence. The newly discovered evidence he proffered was the Court of Appeals decision in Clark-King Construction Co. and Andresen v. Salter, et al., supra (see contention 15 above), which was handed down on July 20, 1973, after the trial in this case had been concluded.\n\nThe controlling law on newly discovered evidence as a ground for a new trial was well stated in Jones v. State, 16 Md. App. 472, 477, 298 A.2d 483:\n\n\"It is, of course, well established that the granting or denial of a motion for a new trial lies within the sound discretion of the trial court and the action of the trial court upon such a motion will not be disturbed on appeal except under the most extraordinary and compelling reasons . . . . On the\n\nquestion of newly or after discovered evidence, it has been said:\n\n'There must ordinarily be present and concur five verities, to wit: (a) The evidence must be in fact, newly discovered, i.e., discovered since the trial; (b) facts must be alleged from which the court may infer diligence on the part of the movant; (c) the evidence relied on must not be merely cumulative or impeaching; (d) it must be material to the issues involved; and (e) it must be such, and of such nature, as that, on a new trial, the newly discovered evidence would probably produce an acquittal.' Johnson v. United States, 32 F. 2d 127, 130 . . .\n\nIt is essentially the function of the trial judge to evaluate and assess the newly discovered evidence and where such evidence consists of testimonial evidence from a witness allegedly discovered after the trial has been concluded, it is for the trial judge to determine the materiality and the credibility of such testimony. Unless it should appear that the trial judge's findings of fact were wholly unsupported by the record and, thus, clearly erroneous, his findings will not be disturbed on appeal . . .\" (Citations omitted)\n\nWe do not consider the Court of Appeals decision in Clark-King to be newly discovered evidence. Its legal holding was simply to the effect that, absent an agreement as to allocation, the option is in the debtor to allocate his payments where two or more debts are owing the same creditor. That is the statement of a legal principle and not the creation of a fact. To the extent to which the legal principle might have been important to the appellant in this case, he was free to argue it to the jury. As a party to the litigation already briefed for the Court of Appeals, he was not in the dark as to that \"well established law,\" the responsibility for the knowledge of which he has herein imposed upon the prosecutor. (See contention 15 above.) It is\n\nnot contended that Judge Barrick gave any erroneous instruction on the law in this regard.\n\nTo the extent to which Clark-King dealt with the satisfaction of the Lumsden note and the release of the deed of trust securing it, the case is not res judicata for present purposes, even forgetting the retroactivity problem. Clark-King was a civil action not involving the same parties involved in the present litigation. The facts in the two trials were not the same, nor were the issues. In Clark-King, the Court of Appeals noted at 269 Md. 507-508, \"Indeed, the new note executed on or about June 4, 1971, for $24,000.00 by Clark-King to Madison was never introduced into evidence so that the inference may properly be drawn that this note would be adverse to the case of the appellees.\" That note was introduced in the present case, as was testimony relating thereto from both Mel Clark and Norman Hecht. Clark-King simply did not create new facts or reveal undiscovered facts; it simply afforded new legal authority with which to view preexisting facts. That is not newly discovered evidence.\n\nIt is, moreover, important to point out that the Lumsden trust was not the only preexisting and unrevealed deed of trust on Lot 13T. There was also the deed of trust to the State National Bank, which alone constituted legally sufficient evidence to sustain the false pretenses charge. The rule in this regard is well stated by 58 Am.Jur.2d, New Trial, § 175, at p. 391:\n\n\"[A] new trial will not be ordered where it appears that, eliminating the disputed testimony, there remains sufficient evidence to sustain the verdict. A new trial will not be granted on a showing that testimony was perjured, false, or mistaken unless such testimony relates to a material issue and probably influenced the verdict or judgment, so that without it a verdict or judgment cannot be sustained.\" (Emphasis supplied)\n\nThe F. O. Day Company trust, critical to the three misappropriation-by-a-fiduciary convictions with respect to the Pollitt, Warfield and Holtzclaw lots, was also unaffected\n\nby the decision in Clark-King. In denying the motion, Judge Barrick did not abuse his discretion.\n\nThe appellant's additional charges that the decision in Clark-King demonstrates 1) that the testimony of Norman Hecht was perjured, 2) that the State knowingly abetted that perjury, and 3) that the State purposely constructed the bulk of its closing argument upon this false thesis have already been disposed of in dealing with contention 15 above. The further charges that the search warrants were based upon the same false premises and that adverse pre-trial publicity and incarceration resulted from the same false premises are bald assertions and are, in any event, irrelevant on the issue of the denial of a new trial.\n\n27. The Vacating of the Sentence\n\nThere was a lengthy sentencing hearing, which ran to seventy pages of transcript, and in the course of which two witnesses were called by the appellant and \"a dozen others\" were referred to but not called. Extensive argument was made by counsel for both sides, including two attorneys for the appellant. The appellant himself addressed the court. A statement of the appellant's escrow account was submitted for the court's consideration. The judge read and took into consideration a memorandum in aid of sentencing prepared by the appellant.\n\nThe appellant's main thrust was to mount a vigorous attack upon the pre-sentence report prepared by the probation department and to move that it be stricken. The present appellate contention is based on the denial of that motion to strike. The attack was full of sound and fury -- the report was \"entirely slanted and full of lies\"; it was \"biased and one-sided and full of gossip and unethical comments by members of the grievance committee of the local bar association\"; if the probation officer had been \"under oath, he should go to jail for perjury\"; the report \"is powerful contempt.\" It was likened to the secret inquisition described by Franz Kafka.\n\nThe report was actually rather routine. Both the appellant and the prosecutor gave his version of the criminal\n\nincidents. The appellant's family background was discussed, with every descriptive adjective causing paroxysms of overreaction by the defense team. Two members of the Grievance Committee of the Montgomery County Bar Association gave information, which prompted charges of unethical conduct and violations of the professional canons.\n\nThe law is well set out in Nickens and Rhodes v. State, 17 Md. App. 284, 289, 301 A.2d 49:\n\n\"It is well settled that the sentencing judge is not limited by the strict rules of evidence, and the procedural policies of the State encourage him to consider information concerning the convicted person's reputation, habits, mental and moral propensities, and other matters that a judge ought to have before him in determining the sentence that should be imposed, Mahoney v. State, 13 Md. App. 105; Smith v. State, 5 Md. App. 633. The sentencing judge may properly consider information obtained outside the courtroom and from persons whom the defendant has not been given the opportunity to confront or cross-examine, provided the information is called to the defendant's 'attention so as to afford him an opportunity to refute or discredit it.' Baker v. State, 3 Md. App. 251.\"\n\nThe appellant was patently fully apprised of the report and rebutted it extensively. His own attorney referred to the presence of the probation officer in the hallway; yet that officer was never called and cross-examined. Judge Barrick gave the appellant every opportunity to contest the report:\n\n\"THE COURT: Well now, Mr. Hirschkop, let me suggest to you that if there is anything in the report which you feel is untrue or if there is anything you wish to comment upon, you may do so, but I suggest that you be specific. I've got your idea that you don't like the report, but if there is anything in there that is incorrect or anything you wish to tell the Court, I'd be glad to hear it.\"\n\nFalse pretenses permits a maximum sentence of ten years; the appellant received two. Fraudulent misappropriation by a fiduciary carries a term of from one to five years. The appellant received two. All sentences were made concurrent. We see no impropriety in the sentencing hearing and no demonstration of ill will, passion, prejudice or any other unworthy motive.\n\n28. Alleged Prosecutorial Misconduct\n\nThe appellant lastly claims that \"the actions of the prosecutor were so prejudicial to appellant's rights and so unjusticable [sic] that the convictions must be reversed.\" He charges \"prejudice and a vengeful purpose to convict.\" Curiously, the appellant relies on Nutter v. State, 8 Md. App. 635, 262 A.2d 80, out of which we can divine nothing bearing on prosecutorial misconduct. That case deals exclusively with the question of disclosure of confidential informants.\n\nThe appellant supports his claim with twenty-six unsupported examples of specific misconduct, \"many of which [he asserts] are shown by the record.\" That last characterization, of course, draws immediate attention to its obvious converse. Fourteen of the charges are absolutely outside the record; furthermore, would be irrelevant to the merits of this appeal in any event; and, indeed, for the most part represent a perfectly legitimate course of conduct:\n\n\"1. An abusive, full time, expensive, 3000-hour investigation, funded by an LEAA grant in excess of $200,000, which stretched over an extended period of time commencing in October of 1971 and which was instigated by Clyde Winters, Esq., attorney for another title insurance company at the time and a competitor of appellant.\"\n\n\" 2. The malicious choice by the prosecutor of appellant to investigate, when the newspaper stories precipitating such an investigation did not mention appellant but accused several other title attorneys. This violated appellant's rights to equal protection under the law.\"\n\n\"5. Appellant and his secretary were arrested without notice although the prosecutor had promised defense counsel otherwise. The prosecutor also forced appellant's original counsel and associate, George Paxton, Esq., to resign by threatening him with investigation. Most other employees of appellant resigned upon being threatened with long prison terms and exposure of their private lives by the prosecutor.\"\n\n\"6. At the appellant's bond hearing the prosecutor falsely represented to the Court that appellant had said to someone that he would \"flee the country.\" This resulted in an initially large cash bond and therefore incarceration of appellant. At the later bond reduction hearing, the prosecutor failed to appear to be confronted by the person who supposedly made the statement to him.\"\n\n\"7. No newspaper reporters were present at the bond hearing, yet a large picture-story appeared in the morning newspaper upon authority of a falsely accusatory press release authored by the prosecutor.\"\n\n\"10. The prosecutor made a trip to Minnesota, at taxpayers expense, to recommend Clyde Winters, Esq., his investigator to represent them. The title company retained Mr. Winters (not one of their approved attorneys) who meanwhile also was retained to represent Mr. Young and Madison Bank (other principals in appellant's trial) at the instigation of the prosecutor.\"\n\n\"12. Upon investigation by appellant, acting upon credible information, it was learned that someone (it was not known who) had 'bugged' appellant's telephone line. Although there is no proof that the prosecutor did this, who else would tap appellant's line?\"\n\n\"13. At the instigation of the prosecutor, a local county filed suit against appellant on a road bond\n\nwhen the road was substantially complete and permit current.\"\n\n\"14. At the instigation of the prosecutor, the Internal Revenue Service called for an audit of appellants returns for the past three years.\"\n\n\"15. The prosecutor personally visited the remaining title insurance companies appellant used and had them cease doing business with him.\"\n\n\"16. The prosecutor personally visited the several banks appellant had a credit line with and had them call in all open notes and cease further credit relations with him.\"\n\n\"18. The malicious intent of the prosecutor is obvious from the purposes of the illegal search of appellant and the numerous, unfounded indictments.\"\n\n\"22. The prosecutor instigated a suit by the Bar Association to audit the books of appellant to further hinder, prejudice and violate his rights under the Constitution. The chief investigator for the Bar Assn. was Willard Nalls, Esq., who later unethically divulged secret grievance proceedings to the pre-sentence investigator in a prejudicial and false manner.\"\n\n\"23. The prosecutor and Mr. Nalls brought simultaneous grievance charges against appellant together with their cohort, Clyde Winters, Esq.\"\n\nWe again point out the outrageous impropriety of attempting to infect and affect an appellate decision by introducing considerations foreign to the record. (See contentions 14 and 23 above.)\n\nFour of the appellant's charges of misconduct, based on the Court of Appeals decision in Clark-King Construction Co. and Andresen v. Salter, et. al., supra, have already been dealt with by us in discussing contentions 15 and 26 above:\n\n\"3. The willful placing of false information in the application and affidavit for the search warrants\n\nused to search appellant's premises by the prosecutor, and the methods used, as previously described, to evade the proper rules of evidence and the Constitution.\"\n\n\"8. The purposeful and knowing use of the perjured testimony of Norman Hecht by the prosecutor at appellant's trial.\"\n\n\"9. The suppression, non-use and demonstrated hostility by unmerciful attack, of the evidence valiantly given by Frank Marsalek (who has since also suffered serious economic and professional loss as a result of the actions of the prosecutor).\"\n\n\"26. Even as late as the hearing on the motion for a new trial and at the sentencing, the prosecutor was still attempting to further and foster the false testimony of Norman Hecht about the Madison note.\"\n\nOne of the charges of misconduct, we dealt with in discussing contention 14 above:\n\n\"11. The execution and suppression of the clandestine 'immunity' agreement with Mr. Clark by the prosecutor. Mr. Clark, the brother-in-law of Henry Peterson (of the Dept. of Justice), was used as a spy against appellant by virtue of this agreement in violation of the attorney-client privilege and Miranda decision.\"\n\nThree of the charges of alleged misconduct, we considered in dealing with the denial of the continuance (contention 16 above) and in dealing with the question of notice to the appellant as to the immunity agreement with Mel Clark (contention 14 above):\n\n\"19. The prosecutor purposely did not mail a copy of his bill of particulars as ordered to do by the Court and pleaded ignorance thereto.\"\n\n\"20. The prosecutor supplied the names of 54 to 57 witnesses, knowing he would use less than half,\n\nand withheld their proper addresses until the last moment. All of this was prejudicial to appellant's defense.\"\n\n\"21. The prosecutor gave evasive and incomplete answers in his last minute response to the bill of particulars. Another prejudicial tactic.\"\n\nOne of these subcontentions was thoroughly discussed in disposing of contention 11 above:\n\n\"25. The prosecutor's closing argument, particularly the rebuttal portion, was insulting and prejudicial to appellant.\"\n\nOne of the charges is moot as affecting the merits of this appeal, because the counts referred to in the charge were abandoned. The question of the appellant's arrest or the defamation of his professional reputation are totally outside the compass of this case:\n\n\"4. The allegations of extremely large losses (over $100,000) in the bill of information used to arrest and defame appellant while the prosecutor had full knowledge that not one penny had ever been expended much less lost by the alleged victims. The subsequent abandonment of these counts, and several other serious but unfounded charges later indicted for, emphasizes these false allegations and wrongful purposes.\"\n\nThe next to last charge of prosecutorial misconduct is that:\n\n\"17. A former employee, June Stup, who admittedly had stolen from and forged while employed by appellant, but was not prosecuted by him, continuously wrote her own checks on a closed account. She purchased a new $3,600 car with one of them. The prosecutor excused this and numerous other, sizeable bad checks in exchange for her testimony. He even arranged for her to plead nolo Page 220} contendere so that she could not be impeached by her long record.\"\n\nThere does not appear to have been any agreement concerning immunity for Miss Stup in return for her testimony. Contrary to the claim that the prosecutor thwarted impeachment, Miss Stup testified that she was \"let go\" by the appellant because of some bad checks which she had written. Miss Stup was prosecuted and entered a plea of nolo contendere. She was awaiting sentence at the time of her testimony in this case and indicated that no agreement as to sentence had been reached with the prosecutor.\n\nThe final claim of prosecutorial misconduct was:\n\n\"24. Mr. Nalls' daughter-in-law, Deborah Nalls, was an investigator for the prosecutor.\"\n\nWe can perceive no misconduct of any sort in securing the services of a skilled and highly competent individual.\n\nTwenty-six times nothing is nothing.\n\nAfter lengthy consideration of all of these twenty-eight contentions and innumerable subcontentions, it is clear that the appellant's four convictions for false pretenses against the Title Insurance Company of Minnesota must be reversed (see contention 3 above); that his conviction for false pretenses against Standard-Young Associates must be affirmed; and that his three convictions for fraudulent misappropriation by a fiduciary with respect to the Pollitt, Warfield and Holtzclaw lots must be affirmed.\n\nJudgments as to count one of Bill of Information No. 3100 and counts three, seven and eleven of Indictment No. 3103 affirmed; judgments as to count two of Bill of Information No. 3100 and counts four, eight and twelve of Indictment No. 3103 reversed; costs to be paid by appellant.\n\nDisposition\n\nJudgments as to count one of Bill of Information No. 3100 and counts three, seven and eleven of Indictment No. 3103 affirmed; judgments as to count two of Bill of Information No. 3100 and counts four, eight and twelve of Indictment No. 3103 reversed; costs to be paid by appellant.\n\n\u003cspan class=\"fn\"\u003e1. The transcript initially mistakenly referred to \"Steven\" rather than to \"Standard,\" but subsequent reference cleared up any ambiguity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Warden v. Hayden was also a first and more primitive groping toward the Plain View Doctrine exception to the warrant requirement, which doctrine ultimately received full expression in Coolidge v. New Hampshire, supra. The notion of \"nexus\" again made explicit what was theretofore merely implicit. The Plain View Doctrine provides that when there has been 1) a prior valid intrusion, one may then 2) seize any evidence of crime inadvertently spotted in plain view. The limitation is that not every object in plain view may be seized, but only those which there is probable cause to believe are evidence of crime. Stanley v. Georgia, 394 U.S. 557, 89 S. Ct. 1243, 22 L.Ed.2d 542 (1969) (concurring opinion); Dixon v. State, 23 Md. App. 19, 29-35 (and cases there cited), 327 A.2d 516, 522-525. In the case of contraband, fruits or instrumentalities, the connection is generally readily apparent. In cases of \"mere evidence,\" on the other hand, the nexus (in such cases not \"automatic\") must be established according to the recognized standard of probable cause. \"Nexus\" is just another word for \"probable cause to believe that the item in plain view is evidence of crime, and therefore, seizable.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The Court did not reach the question of whether the required records doctrine could stand on one leg as opposed to the two legs available as of November 2, 1970, saying at 269 Md. 328, n. 8: \"We need not reach the issue of whether either the statute or the rule, standing alone (e.g., a non-lawyer disbursing funds under § 42 or a lawyer's use of client funds other than in the circumstances outlined in § 42) would warrant application of the required records doctrine, for, under the facts of this case, both were in effect on and after November 2, 1970, a time period during which the non-compliance with Article 21 § 42 was alleged and proved.\"\u003c/span\u003e\n\n",
    "body_length": 169661,
    "citedas": [
      "331 A.2d 78",
      "24 Md. App. 128"
    ],
    "attorneys": "Philip J. Hirschkop, Peter C. Andresen and Frank W. Marsalek for appellant. Gilbert Rosenthal, Assistant Attorney General, with whom were Francis B. Burch, Attorney General, Andrew L. Sonner, State's Attorney for Montgomery County, Jeffrey Russell Werner, Assistant State's Attorney for Montgomery County, and Robert S. Rothenhoefer, State's Attorney for Frederick County, on the brief, for appellee.",
    "category": [
      "36",
      "75"
    ],
    "judges": "Morton, Moylan and Powers, JJ. Moylan, J., delivered the opinion of the Court.",
    "citation_count": 92
  }
}
