{
  "id": "GYkdQGYBTlTomsSBmgF2",
  "document": {
    "title": "United States v. Crawford",
    "full_title": "UNITED STATES OF AMERICA STATE OF CALIFORNIA, INTERVENOR, v. RAPHYAL CRAWFORD, AKA AARMYL CRAWFORD .",
    "jurisdiction": "Ninth Circuit",
    "date": "2004-06-21T00:00:00.000Z",
    "docket": "No. 01-50633",
    "body": "FOR PUBLICATION\n\nArgued and Submitted En Banc December 8, 2003-San Francisco, California\n\nOpinion by Judge Graber; Concurrence by Judge O'Scannlain Concurrence by Judge Trott; Concurrence by Judge Kleinfeld; Dissent by Judge W. Fletcher\n\nOPINION\n\nDefendant Raphyal Crawford appeals the district court's denial of his motion to suppress a statement that he made to law enforcement officers, arguing that the statement was taken in violation of his Fourth Amendment protection against unreasonable searches and seizures and in violation of his entitlement to Miranda warnings under the Fifth Amendment. Defendant also appeals the district court's imposition of a two-level sentence enhancement for physical restraint of a victim during the commission of the offense. We affirm Defendant's convictions, but vacate his sentence and remand for resentencing.\n\nFACTUAL AND PROCEDURAL HISTORY\n\nSometime in 1998, FBI Special Agent David Bowdich received information from an unnamed source that a person known as \"Ralphy Rabbit\" had participated in the February 10, 1998, armed robbery of a Bank of America branch on Ulrich Street in San Diego. Bowdich's subsequent investigation led him to believe that \"Ralphy Rabbit\" was an alias used by Defendant. Bowdich also learned that Defendant was currently on state parole in California. As a condition of his parole, Defendant had signed a \"Fourth Waiver,\" a document that purportedly signifies a parolee's consent to a search by any law enforcement officer, with or without cause. The \"Fourth Waiver\" states:\n\nYou and your residence and any property under your control may be searched without a warrant by an agent of the Department of Corrections or any law enforcement officer.\n\nYou agree to search or seizure by a parole officer or other peace officer at any time of the day or night, with or without a search warrant, and with or without cause.\n\nBowdich testified that it is common practice for law enforcement officers to use \"Fourth Waivers\" as a \"tool to talk\" to suspects about crimes.\n\nBowdich sought out Defendant's parole agent, Carl Berner, hoping to accompany Berner on a parole search of Defendant's residence. After Berner was obliged to cancel a previously scheduled parole search, Bowdich, after consulting with Berner, conducted the parole search himself, accompanied by four state law enforcement officers. Because the robbery had occurred more than two years earlier and because Defendant had changed residences, Bowdich did not hope to find evidence of the Ulrich Street robbery during the parole search. Rather, Bowdich intended to use the parole search as a pretext to speak to Defendant about the Ulrich Street robbery. As Bowdich explained, however, he would have approached Defendant to discuss the robbery even if the parole search had not occurred.\n\nAt 8:20 a.m. on July 27, 2000, Bowdich and the state officers arrived at Defendant's home to conduct the parole search. Defendant's sister met them at the door and informed them that Defendant was in the bedroom, asleep, with his 18month-old daughter. Bowdich and two officers entered the bedroom, with weapons drawn, and told Defendant that they were conducting a parole search.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Bowdich escorted Defendant to the living room, hoping to defuse the \"me-versus-you\" atmosphere, while the state officers conducted the parole search. Defendant remained seated on the couch, under detention, for the duration of the parole search (between 30 and 50 minutes).\n\nAfter Defendant was seated on the couch, Bowdich attempted to engage him in \"chit-chat.\" Eventually, Bowdich asked Defendant about \"an old bank robbery case.\" Defendant was not forthcoming; Bowdich attributed this reticence to the presence of the four state officers. As the state officers were completing their search, Bowdich asked Defendant whether he would prefer to speak in \"a private place\" with just Bowdich and San Diego Police Department Detective Michael Gutierrez. Defendant agreed to accompany Bowdich and Gutierrez, in Bowdich's vehicle, to the local FBI office.\n\nThe trip from Defendant's home to the FBI office took about 20 minutes. Defendant was not interrogated in the car.\n\nAt the FBI office, Defendant was placed in an interview room with Bowdich and Gutierrez. Bowdich told Defendant that he was not in custody and could leave at any time. However, \"to make it as clean as possible,\" Bowdich attempted to give Defendant the Miranda \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e warnings. Defendant stopped Bowdich, protesting that the warnings were making him nervous and that he thought he was present merely to discuss an old case. Both Bowdich and Gutierrez reassured Defendant that he was not under arrest and that he was free to leave. They made no further attempt to read the Miranda warnings to Defendant.\n\nBowdich and Gutierrez questioned Defendant for more than an hour. According to Defendant, every time he tried to terminate the interview, Gutierrez or Bowdich would ask him one or two more questions. The government's witnesses disputed this assertion, and the district court credited those witnesses' version of events. Eventually, Defendant said that he had participated in the Ulrich Street bank robbery, and he admitted having used a gun during the crime. The officers ended the interview without arresting Defendant, drove him back to his home, and left.\n\nThereafter, a grand jury indicted Defendant for armed bank robbery, in violation of 18 U.S.C. § 2113(a) and (d), and using and carrying a firearm during the commission of a crime of violence, in violation of 18 U.S.C. § 924(c)(1) and (2). Defendant moved to suppress the statement that he had made to law enforcement officers on July 27, 2000. After several evidentiary hearings, the district court denied Defendant's motion to suppress. Relying on our decision in United States v. Knights, 219 F.3d 1138 (9th Cir. 2000), later rev'd and remanded, 534 U.S. 112 (2001), the district court held that the search of Defendant's home was a violation of Defendant's constitutional rights under the Fourth Amendment. However, the district court concluded that Defendant's confession was sufficiently attenuated from the illegal search to purge the taint of the constitutional violation, rendering Defendant's statement to the law enforcement officers admissible. The district court also held that Defendant was not in custody when questioned at the FBI office and that Miranda warnings therefore were not required. The district court rejected Defendant's claim that his confession was involuntary as the result of alleged promises from Bowdich and Gutierrez that Defendant would not face imprisonment for his involvement in the Ulrich Street robbery if he cooperated with the investigation.\n\nAfter the district court ruled, Defendant entered a conditional guilty plea pursuant to Federal Rule of Criminal Procedure 11(a)(2). Defendant reserved for appeal the denial of his motion to suppress, the district court's holding that his statement was voluntary and not taken in violation of Miranda, and the district court's application of the sentencing guidelines.\n\nAt the sentencing hearing, the government offered the testimony of Louis Lopez, a security guard who was on duty during the Ulrich Street robbery. Based on Lopez' testimony, the district court imposed a two-level sentence enhancement for physical restraint of a victim, pursuant to United States Sentencing Guideline (\"U.S.S.G.\") § 2B3.1(b)(4)(B).\n\nDefendant timely appealed. A majority of the three-judge panel of this court held that the parole search of Defendant's residence was illegal under the Fourth Amendment and that there was insufficient attenuation to avoid the exclusion of Defendant's statement. United States v. Crawford, 323 F.3d 700 (9th Cir. 2003). The panel thus reversed Defendant's convictions on his first theory, without reaching any of his other assertions of error. We ordered this case to be reheard en banc, United States v. Crawford, 343 F.3d 961 (9th Cir. 2003), and we now affirm Defendant's convictions on a different ground, but vacate and remand with respect to his sentence.\n\nSTANDARDS OF REVIEW\n\nWe review de novo the denial of a motion to suppress. United States v. Fernandez-Castillo, 324 F.3d 1114, 1117 (9th Cir.), cert. denied, 124 S. Ct. 418 (2003). Whether the exclusionary rule applies to a given case is reviewed de novo, while the underlying factual findings are reviewed for clear error. United States v. Hammett, 236 F.3d 1054, 1057-58 (9th Cir. 2001).\n\nWe review de novo whether a defendant is constitutionally entitled to Miranda warnings. United States v. Butler, 249 F.3d 1094, 1098 (9th Cir. 2001). We also review de novo whether a confession is voluntary or coerced. Pollard v. Galaza, 290 F.3d 1030, 1032 (9th Cir.), cert. denied, 537 U.S. 981 (2002).\n\nThe district court's interpretation and application of the Sentencing Guidelines are reviewed de novo. United States v. Garcia, 323 F.3d 1161, 1164 (9th Cir.), cert. denied, 124 S. Ct. 842 (2003).\n\nDISCUSSION\n\nA. Convictions\n\nIn the district court, Defendant made four arguments in support of a motion to suppress his confession, three of which he renews on appeal.\n\nUnder the Fourth Amendment, he first argued that the search exceeded the scope of the \"Fourth Waiver\" because it \"was conducted for the impermissible purpose of gathering evidence against [him] in the investigation of the bank robbery.\" For that argument he relied on this court's opinion in Knights, which later was reversed by the Supreme Court. Defendant did not contend that the \"Fourth Waiver\" itself was invalid, however. Second, he asserted that, because the pretextual parole search made \"the detention . . . while this search was being conducted . . . also illegal,\" his confession \"was the product of this illegal detention.\" He concluded that \"the taint arising from the unlawful detention[ ] requir[es] suppression of the subsequent statement.\" For that argument he relied on two detention cases, Dunaway v. New York, 442 U.S. 200 (1979), and Brown v. Illinois, 422 U.S. 590 (1975).\n\nUnder the Fifth Amendment, Defendant likewise made two arguments. First, he argued that his interrogation was \"custodial in nature\" but not preceded by Miranda warnings. Second, Defendant claimed that his confession was involuntary because of a promise allegedly made by Bowdich, a claim that the district court rejected because it found that Bowdich (who denied making the alleged promise) was credible and Defendant was not. Defendant has abandoned this final argument.\n\nWe turn to a consideration of the other three theories. As to the first, we assume for purposes of our decision, but need not and do not decide, that the parole search was unlawful.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nAs to the second theory, we hold that Defendant's confession was not a product of the detention in his home and that, under New York v. Harris, 495 U.S. 14 (1990), his confession is admissible. Finally, we hold that Defendant was not entitled to Miranda warnings because the questioning at the FBI office was not custodial.\n\n1. Fourth Amendment\n\nAs we have foreshadowed, we assume, without deciding, that the parole search of Defendant's residence, and his detention during it, were illegal under the Fourth Amendment. We need not and do not decide whether \"Fourth Waivers\" are valid, what they mean, or whether suspicionless parole searches violate the Fourth Amendment. Instead, we proceed to examine the Supreme Court precedents that govern an analysis of the relationship between an illegal detention or illegal search and a defendant's confession. Under those precedents, Defendant's confession is admissible.\n\n[1] It is well established that the Fourth Amendment's exclusionary rule applies to statements and evidence obtained as a product of illegal searches and seizures. Wong Sun v. United States, 371 U.S. 471, 484-88 (1963). Evidence obtained by such illegal action of the police is \"fruit of the poisonous tree,\" warranting application of the exclusionary rule if, \"granting establishment of the primary illegality, the evidence to which instant objection is made has been come at by exploitation of that illegality or instead by means sufficiently distinguishable to be purged of the primary taint.\" Brown, 422 U.S. at 599 (internal quotation marks omitted). The exclusionary rule requires a causal connection between the illegal conduct and the evidence sought to be suppressed. \"When there is a close causal connection between the illegal seizure and the confession, not only is exclusion of the evidence more likely to deter similar police misconduct in the future, but also use of the evidence is more likely to compromise the integrity of the courts.\" Dunaway, 442 U.S. at 218.\n\n[2] Whether the twin aims of deterrence and judicial integrity warrant application of the exclusionary rule depends largely on the facts of each case. Brown, 422 U.S. at 603. In this case, three key facts guide our inquiry into whether application of the exclusionary rule to Defendant's statement is warranted. First, the police had probable cause to arrest Defendant when they entered his home. Second, the search yielded no evidence of the \"old robbery\" or of any other crime. Indeed, both Bowdich and Defendant knew from the inception of the parole search that no evidence of any crime likely would be found. Third, Defendant made no incriminating statement before reaching the FBI office and was not questioned about the robbery substantively until he reached the FBI office.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nThe analysis that applies to illegal detentions differs from that applied to illegal searches. See 5 Wayne R. LaFave, Search and Seizure 273, § 11.4(c) (3d ed. 1996) (noting that \"the two situations are quite different\"). Therefore, we begin by addressing whether the detention of Defendant in his home, which we assume was illegal, requires the suppression of his later statement at the FBI office. We then turn to an examination of what, if anything, the presumed illegal search of Defendant's home adds to this analysis.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\na. Detention\n\nDefendant's opening brief frames the issue before us as \"[w]hether [his] initial detention while an unlawful parole search was conducted at his residence was illegal, and the taint of this illegality not attenuated, requiring the suppression of his later statement at the FBI offices.\" He focuses, in other words, on the connection between his detention at home and his later confession at the FBI office.\n\nUnlike most cases involving detentions and confessions, here the officers had probable cause to arrest Defendant. Although there may have been some confusion on this point below, defense counsel clearly and expressly conceded on appeal, both in briefing and at oral argument, that when Bowdich and the state officers arrived to perform the parole search, they had probable cause to arrest Defendant for the Ulrich Street bank robbery.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e A judicial admission is binding before both trial and appellate courts. Am. Title Ins. Co. v. Lacelaw Corp., 861 F.2d 224, 226 (9th Cir. 1988).\n\nThe presence of probable cause to arrest distinguishes this case from cases such as Brown, Dunaway, and Taylor v. Alabama, 457 U.S. 687 (1982), where police officers illegally seized the defendants without having probable cause to arrest them. The Supreme Court described Taylor as a \"virtual replica of both Brown and Dunaway\" because the \"[p]petitioner was arrested without probable cause in the hope that something would turn up.\" Taylor, 457 U.S. at 690-91 (emphasis added).\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e In all three cases, the Court excluded the defendants' confessions as fruits of the illegal seizures. See also Wong Sun, 371 U.S. at 485.\n\n[3] But, as noted, in this case the FBI had probable cause to arrest Defendant by the time Bowdich contacted him. Thus, this case is governed by Harris. In Harris, police officers had probable cause to arrest the defendant, but they entered his residence without a warrant and without consent, in violation of Payton v. New York, 445 U.S. 573 (1980). Although the officers' conduct violated the Fourth Amendment, the Court held that, \"where the police have probable cause to arrest a suspect, the exclusionary rule does not bar the State's use of a statement made by the defendant outside of his home, even though the statement is taken after an arrest made in the home in violation of Payton.\" Harris, 495 U.S. at 21. In other words, despite the illegal arrest inside the defendant's home, the exclusionary rule did not bar the admission of the defendant's later statement to officers at the station house.\n\nHarris distinguished Brown, Dunaway, and Taylor on the basis of probable cause to arrest:\n\nIn each of those cases, evidence obtained from a criminal defendant following arrest was suppressed because the police lacked probable cause. The three cases stand for the familiar proposition that the indirect fruits of an illegal search or arrest should be suppressed when they bear a sufficiently close relationship to the underlying illegality.\n\nHarris, 495 U.S. at 18-19. By contrast, the Court said, although the officers' initial entry into Harris' home was illegal, \"Harris' statement taken at the police station was not the product of being in unlawful custody\" because, in the light of the officers' probable cause to arrest Harris, the custody was not unlawful. Id. at 19. The Court emphasized that \"attenuation analysis is only appropriate where, as a threshold matter, courts determine that 'the challenged evidence is in some sense the product of illegal governmental activity.' \" Id. (quoting United States v. Crews, 445 U.S. 463, 471 (1980)). Because Harris' statement \"was not the fruit of the fact that the arrest was made in the house,\" the Court held that this threshold for attenuation analysis was not met and that the exclusionary rule did not apply to Harris' later statement at the station house, although it would apply to \"any evidence found, or statements taken, inside the home.\" Id. at 20 (emphasis added).\n\nAfter Harris, the presence of probable cause to arrest has proved dispositive when deciding whether the exclusionary rule applies to evidence or statements obtained after the defendant is placed in custody. See, e.g., United States v. Villa-Velazquez, 282 F.3d 553, 556 (8th Cir. 2002) (holding that, because law enforcement officers had probable cause to arrest the defendant, \"the evidence obtained during the time that [the defendant] was in lawful custody was not tainted by the earlier unlawful entry into his residence\" (discussing Harris, 495 U.S. at 18)). Even before Harris, we acknowledged that the applicability of the exclusionary rule in Dunaway and Brown hinged on the officers' lack of probable cause to arrest. In a case in which the officers did have probable cause to arrest, we held that the exclusionary rule did not apply. United States v. Manuel, 706 F.2d 908, 911-12 (9th Cir. 1983). With a certain prescience, we distinguished Brown and Dunaway because, \"[i]n each of those cases, the defendant was arrested without probable cause,\" whereas Manuel was \"totally different from Dunaway and Brown because probable cause [to arrest] was amply established before the officers began their interrogation.\" Id. at 912. We therefore declined to apply the exclusionary rule even though the initial arrest had been illegal. Id.\n\n[4] That Defendant was detained in his home, rather than formally arrested there, does nothing to alter the Harris analysis. In both instances, the illegality was a form of detention in the home. As the Court explained in Dunaway, \"[t]he application of the Fourth Amendment's requirement of probable cause does not depend on whether an intrusion of this magnitude is termed an 'arrest' under state law.\" 442 U.S. at 212. The present case is an even weaker one for the defendant than was Harris. Although there was probable cause to arrest Defendant, he was not placed in custody either in his home or at the FBI office. Rather, after the search ended, he agreed to accompany Bowdich and Gutierrez to the FBI office. At that point, the involuntary detention ended.\n\n[5] Further, in Harris, the officers actually succeeded in obtaining the defendant's confession during the illegal entry.\n\nIn this respect as well, this case is weaker than Harris for the defendant. In Harris, officers appeared at the defendant's front door and fire escape window with their weapons drawn. People v. Harris, 532 N.E.2d 1229, 1230 (N.Y. 1988). The defendant opened the door and allowed the police to enter his apartment. The police arrested the defendant and questioned him in his home. Although no search was performed, the police obtained the defendant's confession before removing him from the apartment.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Here, however, Defendant made no confession during the presumed illegal detention, nor did substantive interrogation begin during that detention. Thus, Defendant's later statement at the FBI office is even less a \"product of being in unlawful custody\" than was the confession obtained by the police in Harris.\n\n[6] We therefore hold that Defendant's initial detention in his home does not require the suppression of his later statement at the FBI office.\n\nb. Search\n\n[7] Having determined that the presumed illegal detention in Defendant's home does not require suppression of his later statement at the FBI office, we next consider whether that statement nonetheless is a product of the presumed illegal search. We are guided by the Supreme Court's statement in Harris that, \"[f]or Fourth Amendment purposes, the legal issue is the same as it would be had the police arrested Harris on his doorstep, illegally entered his home to search for evidence, and later interrogated Harris at the station house.\" 495 U.S. at 18 (emphasis added). Indeed, we have applied Harris to allegations that a confession is the product of an illegal search, albeit under a different set of facts. In United States v. Ladum, 141 F.3d 1328 (9th Cir. 1998) (en banc), we denied a motion to suppress a statement made during a search of the defendant's business pursuant to a defective warrant. The government stipulated that the search warrant was overbroad and that the evidence obtained during that search could not be used during its case-in-chief. Id. at 1336. Nonetheless, we held that the defendant's later statement was not a product of the illegality because, notwithstanding the overbroad warrant, the police had probable cause to search the defendant's business and thus had a \"legitimate reason to be present at the time of questioning.\" Id. at 1337. We therefore held that the relationship between the illegality and the confession more closely resembled the relationship in Harris, where there was probable cause to arrest, than the one in Brown, where probable cause to arrest was lacking. Id.\n\nAlthough illuminating on the applicability of Harris in the context of a search, Ladum does not control here for two reasons. First, although the officers in this case had probable cause to arrest Defendant, they did not have probable cause to search his home. Second, and more importantly, unlike the search in Ladum, the search in this case was entirely fruitless. Indeed, as Bowdich admitted at trial, the parole search was never intended to produce evidence of the old robbery. Instead, the parole search was intended to buy time for a conversation with Defendant.\n\n[8] At most, Bowdich hoped to find evidence of a new crime or parole violation, which he could use to convince Defendant to confess to the old crime. In Bowdich's words, \"[w]e weren't looking for evidence of a bank robbery, but we were looking at potential of possibly flipping him, if we were able to find evidence of a state case.\" Had the search yielded such evidence, we would have to confront the constitutionality of the suspicionless search because the confession would have been an indirect product of the search. Because the search failed to produce any physical evidence, however, and because Defendant made no incriminating statement during the search, we fail to see how the search, as distinct from the presumed illegal detention, caused Defendant's statement in the FBI office.\n\n[9] The only two connections between the search and the confession are the officer's intent to use the search as a pretext to speak to Defendant and the fact that Defendant made a statement at the FBI office after the search. As to the former, Bowdich needed no pretext to speak to Defendant because he had probable cause to arrest him, and Bowdich testified unequivocally that he would have contacted Defendant to discuss the old bank robbery whether or not the parole search had taken place. We need not decide whether pretext would matter had there been no probable cause. As to the latter, post hoc is not necessarily propter hoc; in the light of the known fruitlessness of the search, sequence should not be confused with consequence. That a search was conducted does not in itself make a later-given confession the fruit of that search.\n\nWe are not the first court to reach this conclusion. Thompson v. United States, 821 F. Supp. 110 (W.D.N.Y. 1993), applied Harris to statements taken after a warrantless entry and an illegal search of the defendant's home. The court noted that the federal agent would have questioned Thompson regardless of the evidence uncovered by the search and that there was no evidence \"that defendant's answers to [the agent's] questions would have been different, depending on whether defendant knew of the existence of the illegal search or was confronted with the documents.\" Id. at 117. Therefore, the district court concluded, there was no causal connection between the evidence seized during the illegal search and Thompson's statements. Noting that \"[t]he Payton violation in Harris is functionally similar to the warrantless entry to search in this case,\" Thompson concluded that Harris would require suppression of any statement made by the defendant in his home during the illegal search, but would not require the suppression of a statement made outside the home. Id. at 119. The court went on to conclude that the questioning of Thompson violated Miranda, id., which (as we shall explain below) did not occur here.\n\n[10] As Thompson illustrates, the rationale and holding of Harris are not limited to the context of Payton violations. Rather, as the Eighth Circuit has held, \"Harris demonstrates that for testimony or evidence to be considered the fruit of an illegal search, it must be directly or indirectly attributable to the constitutional violation.\" United States v. Duchi, 944 F.2d 391, 395 (8th Cir. 1991).\n\nIn this case, the necessary connection between the presumed illegal parole search and Defendant's later confession at the FBI office is missing. The search, which produced no evidence whatsoever, had no bearing on the officers' decision to question Defendant; Bowdich testified that he would have spoken to Defendant with or without a search. The officers had probable cause to arrest Defendant for the bank robbery, and Defendant could not have avoided being questioned about it. Thus, the fruitless search, during which Defendant was not questioned substantively about the robbery, cannot be said to have \"caused\" Defendant's later confession.\n\n[11] \"There is no question of 'attenuation' until the connection between the primary illegality and the evidence obtained is established.\" Thompson, 821 F. Supp. at 118 (citing Harris, 495 U.S. at 17-19). Because that connection is missing in this case, the reasoning of Harris applies. The officers had probable cause to arrest Defendant when they entered his home. The search of Defendant's home yielded no evidence. The challenged statement was not made, or even sought, while Defendant was detained in his home. Mindful of Brown's admonition that the applicability of the exclusionary rule depends on the facts of each case, we hold that Defendant's confession at the FBI office does not \"bear a sufficiently close relationship to the underlying illegality\" to warrant its suppression. Harris, 495 U.S. at 19. Therefore, the district court did not err in denying Defendant's motion to suppress that confession.\n\n2. Fifth Amendment\n\nWe will address two Fifth Amendment claims, only one of which Defendant raises on appeal. First, Defendant argues that the questioning at the FBI office amounted to custodial interrogation and that he was therefore entitled to Miranda warnings. Second, the dissent implicitly asserts that Defendant's confession was involuntary due to a \"psychological advantage\" that the police gained by means of the pretextual search.\n\na. Miranda Warnings\n\n[12] \"An officer's obligation to administer Miranda warnings attaches . . . 'only where there has been such a restriction on a person's freedom as to render him \"in custody.\" ' \" Stansbury v. California, 511 U.S. 318, 322 (1994) (per curiam) (quoting Oregon v. Mathiason, 429 U.S. 492, 495 (1977) (per curiam)). Whether a suspect is in custody turns on whether there is a \" 'formal arrest or restraint on freedom of movement' of the degree associated with a formal arrest.\" California v. Beheler, 463 U.S. 1121, 1125 (1983) (per curiam) (quoting Mathiason, 429 U.S. at 495). This inquiry requires a court to examine the totality of the circumstances from the perspective of a reasonable person in the suspect's position. Berkemer v. McCarty, 468 U.S. 420, 442 (1984).\n\nDefendant's situation at the FBI office is remarkably similar to those in which the Supreme Court has held that Miranda warnings are not required. As in Mathiason, Defendant was questioned in a closed room in the office of a law enforcement agency. See Mathiason, 429 U.S. at 493-94. Although taking place in an admittedly \"coercive environment,\" such questioning does not amount to custodial interrogation where, as here, the suspect is told that he is not under arrest and is free to leave, and he does in fact leave without hindrance. See id. at 494-95.\n\nNeither does the fact that Agent Bowdich and Detective Gutierrez escorted Defendant to the FBI office after the parole search require Miranda warnings. In this regard, the present case resembles Beheler, where the suspect agreed to accompany police to the station house. 463 U.S. at 1122. In Beheler, the Court held that Miranda warnings were not required although the suspect was the target of a police investigation, had been escorted by police, and was ultimately questioned at the station house. Although adding to the coercive environment, these factors do not lead to the conclusion that a suspect is in custody. Id. at 1125.\n\nIn arguing that the actions of Bowdich and Gutierrez amounted to custodial interrogation, Defendant concentrates on what happened at his home. He argues that, because he was detained during the parole search and officers had entered his bedroom with weapons drawn, his later questioning at the FBI office amounted to custodial interrogation. However, that detention ended when Defendant agreed to go to the FBI office. The \"in custody\" determination requires us to examine the \"circumstances surrounding the interrogation,\" which did not occur in Defendant's home. Thompson v. Keohane, 516 U.S. 99, 112 (1995) (emphasis added). What took place in Defendant's home did not transform the later events at the FBI office into custodial interrogation.\n\n[13] Perhaps most significant for resolving the question of custody, Defendant was expressly told that he was not under arrest after interrupting Bowdich's attempt to recite the Miranda warnings. Bowdich testified that he read the Miranda warnings in order to make the questioning of Defendant \"as clean as possible.\" Defendant stopped him and said, \"Oh, I'm under arrest?\" Agent Bowdich answered in the negative and later repeated that Defendant was not under arrest and was free to leave. Defendant was, in fact, returned home at the end of the interview, without being arrested. Being aware of the freedom to depart, and in fact departing after questioning at a law enforcement office, suggest that the questioning was non-custodial. See United States v. LeBrun, 363 F.3d 715, 722 (8th Cir. 2004) (en banc) (concluding \"that the defendant was not in custody because, among other things, the officers told him that he was free to leave and that he would not be arrested and because he was in fact not arrested at the conclusion of the interview\").\n\n[14] Viewing the \"totality of the circumstances\" from the perspective of a reasonable person in Defendant's position, and applying the Supreme Court's guidance, we hold that the questioning of Defendant at the FBI office did not amount to custodial interrogation. The district court thus did not err in holding that Miranda warnings were not required.\n\nb. \"Psychological Advantage\"\n\nThe dissent argues that Bowdich used the pretextual search to gain a \"psychological advantage\" over Defendant that would have been unavailable had the officers simply arrested him at his doorstep. Dissent at 8331. As we have noted, Defendant does not renew his Fifth Amendment claim that his confession was involuntary. Therefore, that issue is not properly before us. Guam v. Gill, 61 F.3d 688, 695 (9th Cir. 1995). Even if it were, however, we disagree with the dissent's conclusion.\n\n[15] \"A confession is involuntary if coerced either by physical intimidation or psychological pressure.\" United States v. Haswood, 350 F.3d 1024, 1027 (9th Cir. 2003). In determining whether a defendant's confession was voluntary, \"the question is 'whether the defendant's will was overborne at the time he confessed.' \" Clark v. Murphy, 331 F.3d 1062, 1072 (9th Cir.), cert. denied, 124 S. Ct. 446 (2003) (quoting Haynes v. Washington, 373 U.S. 503, 513 (1963)). Psychological coercion invokes no per se rule. United States v. Miller, 984 F.2d 1028, 1030 (9th Cir. 1993). Therefore, \"we must consider the totality of the circumstances involved and their effect upon the will of the defendant.\" Id. at 1031 (citing Schneckloth v. Bustamonte, 412 U.S. 218, 226-27 (1973)).\n\nBeyond doubt, the police used a deceptive tactic to induce Defendant to come to the FBI office and speak about the old bank robbery. The police lied to Defendant when they said that their purpose was to look for physical evidence of a parole violation; what they really wanted was an opportunity to talk to him about the \"old bank robbery.\" \"Trickery, deceit, even impersonation do not render a confession inadmissible, certainly in non-custodial situations and usually in custodial ones as well, unless government agents make threats or promises.\" United States v. Kontny, 238 F.3d 815, 817 (7th Cir. 2001) (citing Frazier v. Cupp, 394 U.S. 731, 739 (1969)). As the First Circuit has noted,\n\ntrickery is not automatically coercion. Indeed, the police commonly engage in such ruses as suggesting to a suspect that a confederate has just confessed or that police have or will secure physical evidence against the suspect. While the line between ruse and coercion is sometimes blurred, confessions procured by deceits have been held voluntary in a number of situations.\n\nUnited States v. Byram, 145 F.3d 405, 408 (1st Cir. 1998); see also United States v. Orso, 266 F.3d 1030, 1039 (9th Cir. 2001) (en banc) (holding that an inspector's misrepresentation that a piece of evidence existed, while reprehensible, does not constitute coercive conduct); Clanton v. Cooper, 129 F.3d 1147, 1158 (10th Cir. 1997) (holding that a confession was voluntary despite the fact that an officer falsely told the defendant that physical evidence connected him to the crime).\n\nHere, the deception did not involve a misrepresentation of the strength of the case against Defendant. To the contrary, the fruitlessness of the search demonstrated to Defendant that the police lacked physical evidence of his involvement in the old bank robbery or in any other crime. The pretextual search simply gave Bowdich an opportunity to speak to Defendant about the robbery. We need not consider whether, had Defendant confessed in his home, we might be able to say that the search overbore his will and caused his confession.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e However, the pretextual search, if it influenced anything, influenced only Defendant's agreement to go to the \"more comfortable\" atmosphere of the FBI office.\n\n[16] Looking to the setting and to the totality of circumstances, we find that Defendant's confession was voluntary. The interview at the FBI office took about an hour. We have upheld as voluntary, confessions obtained after much lengthier interrogations. See Haswood, 350 F.3d at 1028 (\"Even if we assume that the interrogation lasted all day, . . . coercion typically involves far more outrageous conduct.\"). Similarly, nothing about the environment in which the statement was given or the manner in which Defendant was questioned suggests coercive conduct by the police. Defendant was not in custody when he confessed. Bowdich repeatedly told Defendant that he was not under arrest and was free to leave, and Defendant in fact did leave after the interview, without being arrested. Significantly, Bowdich \"did not misrepresent the nature or purpose of the interview, nor did he make promises or threaten [Defendant].\" Pollard, 290 F.3d at 1035. The search of his residence, while deceptive, did not amount to \"coercion sufficient to make the statement involuntary.\" Id. at 1033.\n\nB. Sentencing\n\nFinally, Defendant contends that the district court erred by imposing a two-level enhancement, pursuant to U.S.S.G. § 2B3.1(b)(4)(B), for physically restraining a victim during a robbery. That guideline states that the enhancement applies \"if any person was physically restrained to facilitate commission of the offense or to facilitate escape.\" U.S.S.G. § 2B3.1(b)(4)(B). The commentary lists several examples, such as \"where a victim was forced to accompany the defendant to another location, or was physically restrained by being tied, bound, or locked up.\" Id. at cmt. background. This commentary is merely instructive and does not set forth an exhaustive list of situations in which an enhancement for physical restraint may be appropriate. United States v. Foppe, 993 F.2d 1444, 1452 (9th Cir. 1993).\n\nThe district court correctly held that physical contact with the victim is unnecessary for imposition of the two-level enhancement under § 2B3.1(b)(4)(B). However, the court did not go on to apply United States v. Parker, 241 F.3d 1114, 1119 (9th Cir. 2001), which adopted a \"sustained focus\" standard for cases that-like the present one-do not involve forcible restraint of the victim.\n\n[17] Because the district court did not apply Parker, and did not make findings with the Parker standard in mind, we cannot tell whether Defendant had the \"sustained focus\" necessary under our precedents for imposition of this sentence enhancement. As a general matter, \"if a district court errs in sentencing, we will remand for resentencing on an open record-that is, without limitation on the evidence that the district court may consider.\" United States v. Matthews, 278 F.3d 880, 885 (9th Cir.) (en banc), cert. denied, 535 U.S. 1120 (2002). We therefore vacate Defendant's sentence and remand to the district court with instructions to determine, on an open record, whether Defendant physically restrained the security guard, in the light of the standard announced in Parker.\n\nDefendant's convictions are AFFIRMED. The sentence is VACATED; and the case is REMANDED for resentencing.\n\nO'SCANNLAIN, Circuit Judge, concurring:\n\nI join Judge Trott's concurrence in its entirety, and because I believe there was no Fourth Amendment violation in this case, I join Judge Graber's majority opinion except as to Part A.1, which assumes the contrary.\n\nTROTT, Circuit Judge, concurring, with whom O'SCANNLAIN, KLEINFELD, TALLMAN, and CLIFTON, Circuit Judges, join:\n\nAlthough I concur in Judge Graber's excellent opinion to the extent that it (1) concludes that Crawford's incriminating statements were admissible against him at his trial, and (2) affirms his conviction, I approach this case from a different perspective. I conclude that because Crawford was a California parolee and, as such, subject to random searches as well as seizures and detention, he was not the victim of any Fourth Amendment constitutional violation in the first place.\n\nI.\n\nDuring the summer of 1993, Richard Allen Davis, a violent career criminal serving a sixteen-year sentence for kidnaping, was paroled from California State Prison. Three months later, he abducted twelve-year-old Polly Klaas from her bedroom, sexually assaulted her, and eventually strangled her to death. Richard Allen Davis's vicious murder of Polly Klaas became the catalyst for Proposition 184, the \"fastest qualifying initiative in California history.\" Ewing v. California, 538 U.S. 11, 15 (2003). Proposition 184, in conjunction with Assembly Bill 971, established a life sentence for specified felons in California who accumulate over time three felonies of a certain kind. The purpose of the law is to protect \"the public safety by providing lengthy prison terms for habitual felons.\" Id.\n\nThe question in this case arises from the same concern that caused California to harden its stance against habitual criminals: whether it is \"unreasonable\" in constitutional terms for California to have made the legislative decision with a penological objective to subject convicted criminals, like Richard Allen Davis, while on parole to searches conducted by authorized law enforcement officers, so long as those searches are not \"arbitrary, capricious, or harassing.\" People v. Reyes, 968 P.2d 445, 450 (Cal. 1998). A related question is whether society is prepared to accept as \"reasonable\" a specific privacy right on the part of parolees against non-arbitrary, noncapricious, and non-harassing searches of their persons and abodes by officers lawfully authorized and commissioned by California to ensure that its parolees do not constitute a risk to public safety as they make the transition from prison to free society.\n\nMy answer to both questions is in the negative.\n\nII.\n\nOn January 18, 1989, Raphyal Crawford was convicted in federal court of conspiracy to manufacture and distribute cocaine base. He was sentenced to federal prison for 87 months. While on supervised release from this conviction, he was arrested and charged in state court in San Diego, California, with possession of a firearm by a felon and possession of marijuana for sale. He was convicted of these crimes and sentenced to state prison. In addition, his federal supervised release was revoked. As it turns out, he also committed an armed robbery of a bank while on supervised release, but this crime was not discovered until later.\n\nEventually, Crawford became a California state parolee. In this capacity, California law impressed on him a legal status that materially altered his relationship with the Fourth Amendment and its warrant requirement. The California statute on this subject is clear: \"Prisoners on parole shall remain under the legal custody of the department [of corrections] and shall be subject at any time to be taken back within the inclosure of the prison.\" Cal. Pen. Code § 3056. As the district court correctly said - before it became distracted by our mistaken decision in United States v. Knights, 219 F.3d 1138 (9th Cir. 2000), since overturned by the Supreme Court in United States v. Knights, 534 U.S. 112 (2001) - \"[U]nder California law, a parolee is in fact in the custody of the Department of Corrections . . . .\" See Latta v. Fitzharris, 521 F.2d 246, 249 (9th Cir. 1975) (en banc) (\"A California parolee is in a different position from that of an ordinary citizen.\" He is still serving his sentence.).\n\nA.\n\nBefore continuing to discuss the legal ramifications of parole status in California, however, I must discuss an error that has distracted us from an appropriate resolution of this case. It is a conceptual mistake to consider the imposition of conditions on a parolee in California as a \"waiver\" of rights. As Crawford's state parole officer correctly explained when confronted in district court by the federal prosecutor with this misleading characterization, \"I do not call them a 'Fourth waiver' . . . my understanding of the Fourth waiver applies to probationers in the county.\" This single sentence - spoken by the only state official to make an appearance in this case - speaks volumes to anyone familiar with California criminal law and procedure, but it apparently went over the heads of the federal authorities, and the trial prosecutor's mistake has unnecessarily complicated the resolution of this case ever since. In fact, California's Administrative Code says, \"The parole conditions are not a contract but are the specific rules governing all parolees whether or not the parolee has signed the form containing the parole conditions.\" Cal. Code Regs. tit. 15, § 2512(a). As the California Supreme Court has recognized:\n\nThe consent exception to the warrant requirement may not be invoked to validate the search of an adult parolee because, under the Determinate Sentencing Act of 1976, parole is not a matter of choice. The Board of Prison Terms must provide a period of parole; the prisoner must accept it. (Pen. Code § 3000 et seq.)\n\nPeople v. Reyes, 968 P.2d at 448. What this explanation means is that consent and waiver cannot be used to validate parole conditions, and neither can the lack thereof be used to invalidate them.\n\nAs far as I can tell from the record, the federal prosecutors and agents with whom this mischaracterization originated did not fully understand California law. To quote Assistant United States Attorney Hobson's exchange in the district court with her witness FBI Agent Bowdich, \"Now you called it a Fourth waiver. What are you referring to? What is it?\" Bowdich's answer was, \"It's a common term . . . under the state parole or probation system. . . . Fourth waiver just means they're waiving their right to search and seizure.\" Wrong. Wrong then, and wrong now.\n\nIn summary, I conclude that the consent/waiver doctrine is irrelevant in this context.\n\nB.\n\nCalifornia law, which regards parole not as a right but as a privilege, provides that \"The Board of Prison Terms upon granting any parole to any prisoner may also impose on the parole any conditions that it may deem proper.\" Cal. Pen. Code § 3053(a). Consequently, and according to the law, certain conditions were imposed on Crawford in connection with his release on parole in the year 2000. When Crawford was released on parole, whether he liked it or not, and whether he consented to it or not, he became subject to a search and seizure condition of parole that (1) recognized his status as still in custody, and (2) was designed appropriately to effectuate tight supervision of him.\n\nIn recognition of Crawford's status, the Department of Corrections first imposed these standard conditions on him on October 13, 1999. The document memorializing this imposition is entitled \"Notice of Conditions of Parole,\" and it reads in relevant part:\n\nNOTICE AND CONDITIONS OF PAROLE\n\nYou will be released on parole effective 2-17-2000 , 19___ for a period of 3 YEARS . This parole is subject to the following notice and conditions. Should you violate conditions of this parole, you are subject to arrest, suspension and/or revocation of your parole.\n\nYou waive extradition to the State of California from any state or territory of the United States or from the District of Columbia. You will not contest any effort to return you to the State of California.\n\nWhen the Board of Prison Terms determines, based upon psychiatric reasons, that you pose a danger to yourself or others, the Board may, if necessary for psychiatric treatment, order your placement in a community treatment facility or state prison or may revoke your parole and order your return to prison.\n\na) You and your residence and any property under your control may be searched without a warrant by an agent of the Department of Corrections or any law enforcement officer. RC\n\nPAROLEE'S INITIALS\n\nb) You agree to search or seizure by a parole officer or other peace officer at any time of the day or night, with or without a search warrant and with or without cause. RC\n\nPAROLEE'S INITIALS\n\nYou have been informed and have received in writing the procedure for obtaining a Certificate of Rehabilitation (4852.21 PC).\n\nYou have read or have had read to you this notification and the following Conditions of Parole and understand them as they apply to you.\n\n6. You shall sign the parole agreement containing the conditions of parole specified in Board of Prison Terms (BPT) Rules Section 2512 and any special conditions imposed as specified in BPT Rules Section 2513.\n\nI have read or have had read to me and understand the conditions of parole as they apply to me.\n\nCDC NUMBER PAROLEE' SIGNATURE DATE SIGNED SIGNATURE OF STAFF DATE SIGNED\n\nP27169 [Signed] 10-13-99 [Signed] 10-13-99\n\nPAROLEE'S NAME (PRINT OR TYPE) STAFF'S NAME (PRINT OR TYPE)\n\nABDULLAH, RAPHYAL [Signed] [Printed with Title]\n\nThe record demonstrates that Crawford signed a second copy of this form, this time on April 24, 2000. Once again, the search and seizure provisions were prominently repeated.\n\nThere is no doubt that Crawford understood his status as a parolee and how his rights had been affected thereby. As State Parole Agent Berner explained in his trial testimony, \"I when I have them initial the section (a) and (b) up above, I inform them that their residence and property under their control can be searched by a peace officer at any time.\" And, as Crawford told the district court in sworn testimony regarding parole officer Berner's advice to him that as a parolee he was subject to searches and seizures, \"I just, you know, just took that for granted that, you know, I'm on parole, that I don't have no rights at all.\" Thus, I conclude that Crawford had no subjective expectation of privacy whatsoever. Given the controlling laws, the appearance of the word \"agree\" under subsection (b) in Crawford's acknowledgment is essentially an acknowledgment of the force of law and an assurance he would comply with it.\n\nIII.\n\nIn Reyes, the California Supreme Court authoritatively explained the status of a parolee under California law and held that \"[w]hen involuntary search conditions are properly imposed, reasonable suspicion is no longer a prerequisite to conducting a search of the subject's person or property.\" 968 P.2d at 450 (emphasis added). As justification for its holding, the court stated that \"[t]he state has a duty . . . to protect the public, and the importance of [this interest] justifies the imposition of a warrantless search condition.\" Id. at 450. The court further held that \"[b]ecause of society's interest both in assuring the parolee corrects his behavior and in protecting its citizens against dangerous criminals, a search pursuant to a parole condition, without reasonable suspicion, does not 'intrude on a reasonable expectation of privacy, that is, an expectation that society is willing to recognize as legitimate.' \" Id. at 449 (citations omitted).\n\nThe court made it clear, however, that it was not declaring an unfettered open-season on parolees. In keeping with the principle that the permissible degree of impingement on a parolee's privacy is \"not unlimited,\" Griffin v. Wisconsin, 483 U.S. 868, 875 (1987), the Reyes court established as a requirement of a reasonable parole condition search that it must not be \"arbitrary, capricious, or harassing.\" Reyes, 968 P.2d at 450. It is equally noteworthy that California \"parolees are entitled to the benefit of the rule of announcement necessary to perfect a law enforcement officer's entry into a house.\" Latta, 521 F.2d at 248 (citing People v. Rosales, 68 Cal.2d 299, 437 P.2d 489 (1968)).\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nIn support of its well-reasoned analysis and logical conclusions, the California Supreme Court drew from and respected relevant federal constitutional law as articulated by the Supreme Court. From Griffin, the California court understood in connection with its own system of parole that a \"[s]tate's operation of a probation system, like its operation of a . . . prison . . . presents 'special needs' beyond normal law enforcement . . . .\" Reyes, 968 P.2d at 447 (quoting Griffin, 483 U.S. at 873-74). It then noted that \"although 'some quantum of individualized suspicion is usually a prerequisite to a constitutional search or seizure[,] . . . the Fourth Amendment imposes no irreducible requirement of such suspicion'.\" Id. at 449 (quoting New Jersey v. T.L.O., 469 U.S. 325, 342, n.8 (1985)).\n\nFinally, the court surveyed the United States Supreme Court's \"special needs\" cases. These cases involve hundreds of thousands of American citizens never convicted of a crime, and with respect to whom no suspicion of criminal behavior existed, and who have become subject to carefully targeted and narrowly tailored Fourth Amendment searches because, given the totality of the relevant circumstances, the searches when scrutinized through the lens of the Fourth Amendment are reasonable. With these cases in mind, the court concluded - correctly in my view - that parolees as a class are different, and that they have forfeited any right to challenge a proper parole search conducted by designated law enforcement authorities while still in constructive custody as they serve out their sentences and make the transition back into society under the regulatory control of the Department of Corrections.\n\nIV.\n\nAccording to Ferguson v. City of Charleston, 532 U.S. 67, 74 n.7 (2001), the term \"special needs\" as used in Griffin and applied in Reyes made its first appearance in Fourth Amendment jurisprudence in Justice Blackmun's concurring opinion in T.L.O., which upheld a marijuana-yielding warrantless search by school officials of a high school student's purse. As originally explained by Justice Blackmun in a passage later adopted by the full Court, the \"special needs\" category creates an exception to the Fourth Amendment's warrant requirement for searches conducted under categorical circumstances \"beyond the normal need for law enforcement\" that make the warrant and probable cause requirement \"impracticable.\" T.L.O., 469 U.S. at 351 (Blackmun, J., concurring); Griffin, 483 U.S. at 873.\n\nSubsequent Supreme Court cases give us additional guidance as to how to determine whether a public safety search falls into the \"special needs\" category. In Skinner v. Railway Labor Executives' Ass'n, 489 U.S. 602 (1989), for example, the Court approved warrantless and suspicionless blood and urine testing of railroad employees involved in major train accidents, and stated\n\nthe Fourth Amendment does not proscribe all searches and seizures, but only those that are unreasonable. What is reasonable, of course, depends on all of the circumstances surrounding the search or seizure and the nature of the search or seizure and the nature of the search or seizure itself. Thus, the permissibility of a particular practice is judged by balancing its intrusion on the individual's Fourth Amendment interests against its promotion of legitimate governmental interests.\n\nIn most criminal cases, we strike this balance in favor of the procedures described by the Warrant Clause of the Fourth Amendment. Except in certain well-defined circumstances, a search or seizure in such a case is not reasonable unless it is accomplished pursuant to a judicial warrant issued upon probable cause. We have recognized exceptions to this rule, however, when special needs, beyond the normal need for law enforcement, make the warrant and probable-cause requirement impracticable. When faced with such special needs, we have not hesitated to balance the governmental and privacy interests to assess the practicality of the warrant and probable-cause requirements in the particular context.\n\nId. at 619 (quotations marks and citations omitted).\n\nIn limited circumstances, where the privacy interests implicated by the search are minimal, and where an important governmental interest furthered by the intrusion would be placed in jeopardy by a requirement of individualized suspicion, a search may be reasonable despite the absence of such suspicion.\n\nId. at 624. Both Skinner and its companion case, National Treasury Employees Union v. Von Raab, 489 U.S. 656 (1989), which permits the warrantless urine testing of certain Customs employees, point out that specific circumstances, such as public versus private employment, can diminish and even extinguish any privacy interests that a person not in those circumstances might otherwise expect and enjoy. See O'Connor v. Ortega, 480 U.S. 709, 715 (1987) (\"[T]he reasonableness of an expectation of privacy . . . differ[s] according to context. . . .\").\n\nAs for the specific interest of a state in the management of its parole system, the Supreme Court has described that interest as \"overwhelming.\" Penn. Bd. of Prob. and Parole v. Scott, 524 U.S. 357, 365 (1998). The issue in Scott was \"whether the exclusionary rule, which generally prohibits the introduction at a criminal trial of evidence obtained in violation of a defendant's Fourth Amendment rights, applies in parole revocation hearings.\" Id. at 359. In holding that it does not, the Court said,\n\nParole is a variation on imprisonment of convicted criminals in which the State accords a limited degree of freedom in return for the parolee's assurance that he will comply with the often strict terms and conditions of his release. In most cases, the State is willing to extend parole only because it is able to condition it upon compliance with certain requirements. The State thus has an overwhelming interest in ensuring that a parolee complies with those requirements and is returned to prison if he fails to do so.\n\nId. at 365 (quotations and citations omitted).\n\nThe Court said also that it is \"averse to imposing federal requirements upon the parole systems of the States. Id. at 369.\n\nFinally, we learn from O'Lone v. Estate of Shabazz, 482 U.S. 342 (1987), that prison regulations are treated more deferentially under the Fourth Amendment than other measures. Although parole restrictions and conditions strictly speaking are not prison regulations, they are akin to that category.\n\nV.\n\nFrom my survey of these \"special needs\" cases, I conclude, as did the California Supreme Court, that they provide the appropriate framework for analyzing the issues in this case.\n\nA.\n\nThe threshold question to be answered is whether California's operation of its prisons and parole system presents a \"special need\" as defined by the Supreme Court. This question has authoritatively been answered: it does. The answer begins with Griffin, on which the California Supreme Court relied:\n\nA State's operation of a probation system, like its operation of a school, government office or prison, or its supervision of a regulated industry, likewise presents \"special needs\" beyond normal law enforcement that may justify departures from the usual warrant and probable-cause requirements.\n\n483 U.S. at 873-74. The answer ends with Scott which described a state's interest in the management of its parole system as \"overwhelming.\" Scott, 524 U.S. at 365.\n\nB.\n\nGriffin answers - albeit in the context of probation searches - the next question: whether the supervision itself of parolees is a \" 'special need' of the State permitting a degree of impingement upon privacy that would not be constitutional if applied to the public at large.\" Griffin, 483 U.S. at 875. Here, too, the answer is in the affirmative. As in the case of the supervision of probationers, supervision as described in Reyes is designed as a penological initiative to assure that parole serves (1) as a period of genuine rehabilitation and reintegration into society, and (2) as a device to see to it that \"the community is not harmed by the [parolee's] being at large.\" Id. Griffin recognized in connection with felons on probation that \"[r]ecent research suggests that more intensive supervision can reduce recidivism . . . .\" Id. I see no reason why this observation would fail to apply to parolees. If anything, it has even more force when applied to that class.\n\nMost importantly, however, California's legislature has definitively come to the same conclusion regarding the need for effective supervision:\n\nThe Legislature finds and declares that the period immediately following incarceration is critical to successful reintegration of the offender into society and to positive citizenship. It is in the interest of public safety for the state to provide for the supervision of and surveillance of parolees, including the judicious use of revocation actions, and to provide educational, vocational, family and personal counseling necessary to assist parolees in the transition between imprisonment and discharge. A sentence pursuant to Section 1168 or 1170 shall include a period of parole, unless waived, as provided in this section.\n\nCal. Pen. Code § 3000(a)(1). The legislature then implemented this finding in the statutes and regulations previously quoted that govern parole.\n\nThe Supreme Court reminded us in Ewing that federal courts have a longstanding tradition of deferring to state legislatures in making and implementing important policy decisions relating to criminals and public safety. 538 U.S. at 2425. The Court said,\n\nWhen the California Legislature enacted the three strikes law, it made a judgment that protecting the public safety requires incapacitating criminals who have already been convicted of at least one serious or violent crime. Nothing in the Eighth Amendment prohibits California from making that choice. To the contrary, our cases establish that \"States have a valid interest in deterring and segregating habitual criminals.\" Parke v. Raley, 506 U.S. 20, 27, 113 S. Ct. 517 (1992).\n\nId. at 25. It does not seem to be a stretch at all to apply this reasoning to the rational decision of California's legislature to subject all parolees to mandatory search conditions.\n\nHow daunting is the challenge in California of adequately supervising parolees, and what dangers do parolees present to society from which law abiding people deserve protection? According to the authoritative California Journal, as of August 2000, California had 158,177 inmates in its prisons. Jeremy Travis and Sarah Lawrence, California's Parole Experiment, Cal. J. (Aug. 2002). Of that population, 126,117 inmates were released on parole during that year. Id. Sadly, of that figure, 90,000 were returned to prison, either following a conviction of a new crime or for violating parole conditions. The California Criminal Justice Statistics Center's report prepared in April 2001 indicates that 68% of adult parolees are returned to prison: 55% for a parole violation and 13% for the commission of a new felony offense. California Attorney General, Crime in California, April 2001, at 37. According to the California Policy Research Center, \"70% of the state's paroled felons reoffend within 18 months - the highest recidivism rate in the nation.\" Joan Petersilia, Challenges of Prisoner Re-entry and Parole in California, 12 CPRC (June 2000).\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Crawford and Richard Allen Davis are only two of the State's paroled felons who reoffended.\n\nWe find a similar pattern of continuing criminality by parolees when we look at Federal statistics. Between 1986 and 1994, 215,263 prisoners were released on federal parole. U.S. Dept. of Justice, Bureau of Justice Statistics, Offenders Returning to Federal Prison, 1986-1987 (Sept. 2000). Of this number, 33,855 were returned to prison within three years, almost 13,000 of which were for the commission of new violent offenses. Id. \"According to a [more] recent report, approximately 67 percent of former inmates released from state prisons were charged with at least one 'serious' new crime within three years of their release.\" Ewing, 538 U.S. at 26 (referencing U.S. Dept. of Justice, Bureau of Justice Statistics, P. Langan \u0026 D. Levin, Special Report: Recidivism of Prisoners Released in 1994, p.1 (June 2002)).\n\nTo sum up the size and pressing nature of this problem, I borrow from a report from the Urban Institute, Justice Policy Center:\n\nThis year, more than 600,000 individuals will leave state and federal prisons - 1,600 a day, four times as many as left prison 25 years ago. The federal government recently announced the award of $100 million in grants to help states design new strategies to improve outcomes for prisoners returning home. A number of corrections administrators have embraced the challenge of engaging community groups in supervising the re-entry. Public health professionals, workforce development experts, housing providers, civil rights advocates, and police officials have all focused attention on the challenges and opportunities presented by record numbers of prisoners coming back into free society.\n\nJeremy Travis and Sarah Lawrence, Beyond the Prison Gates: The State of Parole in America, (Nov. 2002).\n\nIn their multi-volume ground-breaking work, The Criminal Personality, doctors Samuel Yochelson and Stanton Samenow give us a vivid idea of what society is up against in dealing with hardcore criminals and parolees such as Crawford. In this eye-opening work, which resulted from fifteen years of concentrated research, the doctors report on the incidence of crime committed by the subjects they studied. The doctors tell us that each of these men with whom they worked \"admits to having committed enough crimes to spend over 1,500 years in jail if he were convicted for all of them.\" 1 Samuel Yochelson and Stanton Samenow, The Criminal Personality 221. The doctors continue: \"If we were to calculate the total number of crimes committed by all the men with whom we have worked, it would be astronomic. However, that is not represented in crime statistics. . . . If one were to judge by official police records, he would be totally misled about the extent of criminal activity.\" Id. To make this point, the doctors arrayed the startling criminal activity of their three representative subjects. The first had committed 64,000 crimes, but apprehended only seven times. Id. at 222. The second was responsible for 200,000 crimes. Id. at 223. The third admitted over 600 crimes before he reached the age of twenty. Their report continues:\n\nWe can cite many comparable figures from the histories of others with whom we have worked. One man committed approximately 300 rapes before being arrested and charged with rape. Another snatched about 500 purses in one year, more than one a day; he was not arrested for any of these. Another molested about 1,000 children per year when he was between 17 and 22, for a total of at least 5,000 acts, and was apprehended for only one.\n\nId. at 221-225.\n\nAccording to the Supreme Court's opinion in Ewing, a study by the Sacramento Bee of 223 habitual criminal offenders in California found that they had an aggregate of 1,165 prior felonies, an average of 5 apiece.\n\nThe prior convictions included 322 robberies and 262 burglaries. About 84 percent of the 233 three strikes offenders had been convicted of at least one violent crime. In all, they were responsible for 17 homicides, 7 attempted slayings, and 91 sexual assaults and child molestations.\n\nEwing, 538 U.S. at 26.\n\nI deduce from this information, as well as from California's legislative findings, that the control and supervision of parolees as they reintegrate into society involves an arena far different from the needs of \"normal\" law enforcement. Parolees, like drunk drivers on our highways, are a discrete group that are a demonstrable menace to the safety of the communities into which they are discharged. See Mich. Dep't. of State Police v. Sitz, 496 U.S. 444, 451 (1990) (\"No one can seriously dispute the magnitude of the drunken driving problem or the States' interest in eradicating it.\"). Parolees have demonstrated by their adjudicated criminal conduct a capacity and willingness to commit crimes serious enough to deprive them of liberty. They have not yet finished serving their sentences in connection with which they do not enjoy a presumption of innocence. Moreover, their collective behavior while on parole demonstrates the truth of the axiom that past behavior is the best predictor of future behavior. As the Supreme Court observed in Scott, \"parolees . . . are more likely to commit future criminal offenses than are average citizens.\" Scott, 524 U.S. 365. Thus, I conclude that the supervision of the members of this rationally identified group is a \"special need\" of California that transcends the scope of normal, everyday law enforcement concerns.\n\nParole is first and foremost about supervising and controlling people who have demonstrated a propensity to break the law and for whom the State still has a responsibility to constrain and to mentor in connection with public safety. Like Alaska's version of \"Megan's Law\" involving the registration of sex offenders and the publication of information about them on the Internet, legislation approved by the Supreme Court in Smith v. Doe, 538 U.S. 84 (2003), the purpose here is not punitive, but to enable state government in the context of a regulatory scheme to enhance public safety. Id. at 102-03 (\"As the [Ninth Circuit] Court of Appeals acknowledged, the Act has a legitimate non-punitive purpose of 'public safety which is advanced by alerting the public to the risk of sex offenders in their community.' \").\n\nC.\n\nThe third question posed by Griffin is whether the \" 'special needs' of its parole system justify [California's] search regulation . . . as it has been interpreted by state corrections officials and state court.\" 483 U.S. at 875. With Reyes in mind as well as the magnitude of the challenge, I think it is clear that the special needs of California's parole system make the warrant requirement impracticable. I further conclude that given all the relevant facts and circumstances, California's parolee search conditions are eminently reasonable. The statistics previously described leave no room for doubt that crime by parolees is a huge problem in California that demands government attention and action - one must look no further than Crawford and Richard Allen Davis. As in the case of the probation searches approved in Griffin, a warrant requirement would interfere with the parole system of supervision, \"setting up a magistrate rather than [the parole agent] as the judge of how close a supervision [the parolee] requires.\" Id. at 876; see also Latta, 521 F.2d at 251-52 (dismissing the warrant requirement in this context as unreasonable). In addition, the delay inherent in obtaining a warrant would (1) hamper quick responses to evidence of misconduct, and (2) reduce the deterrent effect of the conditions. Griffin, 483 U.S. at 876. Furthermore, the rules that normally pertain to the quantity and quality of information needed to secure a warrant are at odds with the essence and needs of the parole system. Again, as in the case of probation, \"[t]he agency . . . must be able to proceed on the basis of its entire experience with [the parolee], and to assess probabilities in the light of its knowledge of his life, character, and circumstances.\" Id. at 879.\n\nAlthough the Supreme Court has not reached the question of whether a plenary search condition applicable to a parolee under California law so diminishes that person's expectation of privacy that a proper parole condition search is \"reasonable,\" its decision in Knights supports the California Supreme Court's conclusion. The Knights Court reminded us that \"[t]he touchstone of the Fourth Amendment is reasonableness, and the reasonableness of a search is determined 'by assessing, on the one hand, the degree to which it intrudes upon an individual's privacy and, on the other, the degree to which it is needed for the promotion of legitimate governmental interests.' \" 534 U.S. at 118-19 (quoting Wyoming v. Houghton, 526 U.S. 295, 300 (1999)). In concluding that probationers have a reduced expectation of privacy, the Court relied on the need to \"protect[ ] society from future criminal violations.\" Id. at 119. This observation has even greater force when applied to parolees.\n\nMoreover, Griffin postulates that although a parolee's right of privacy is definitely diminished as compared to the public at large, the \"permissible degree\" of such impingement \"is not unlimited.\" Griffin 483 U.S. at 875. As I see it, the law in California adequately satisfies this check. When read in the light of Reyes, California's parole search and seizure conditions do not wholly eliminate a parolee's expectation or right of privacy. To the contrary, they authorize only narrowly tailored searches by a class of authorized officials rationally related to the individual's parole status. More importantly, according to Reyes, a parolee in California retains a right of privacy against government searches and seizures that are arbitrary, a right of privacy against searches and seizures that are capricious, and a right of privacy against searches and seizures that are harassing. These restrictions are meaningful, and they represent workable standards state and federal courts apply every day in assessing the propriety of a variety of government actions. These qualifications accomplish the constitutional goal of keeping parole searches and seizures within the scope of reason demanded by the Constitution by mandating that the search or seizure be justifiably within the purpose of parole conditions at issue. See, e.g., Latta, 521 F.2d at 252 (\"In a given case, what is done may be so unreasonable as to require that the search be held to violate the Fourth Amendment. For example, harassment or intimidation is no part of a parole officer's job.\").\n\nFurthermore, the Due Process Clause provides additional protection to parolees subject to parole condition searches and seizures. Should the manner in which such a search or seizure was conducted (1) \"shock the conscience\" of our community's sense of \"decency and fairness,\" or (2) was so \"brutal\" and \"offensive\" that it did not comport with traditional ideas of fair play and decency, then the exclusionary rule as well as 28 U.S.C. § 1983 would provide both remedy and redress. See Rochin v. California, 342 U.S. 165, 172 (1952). Just as the extraction by a physician of a blood sample from an unconscious driver suspected of vehicular manslaughter - or from a railroad worker or a Customs official - does not offend these concepts, Breithaupt v. Abram, 352 U.S. 432, 435-36 (1957), neither does a California parole condition search bridled by Reyes.\n\nThis case is a good example of a search that was not arbitrary, not capricious, and not conducted to harass or to intimidate. One of Crawford's fellow armed bank robbers identified him as an accomplice. The search and the contact with Crawford that followed from that information was carried out well within the scope of that information as well as within the jurisdiction to investigate bank robberies. In addition, the peace officers who conducted the search had obtained permission from Crawford's parole officer. This was excellent police work that put a dangerous criminal where he belonged, not an unreasonable abuse of authority.\n\nMS. HOBSON: You Honor, I could represent that there was going to be a witness who was going to identify Raphyal Crawford, who was masked and wearing gloves as a gunman in the fifth robbery. He was identified as the gunman holding the lobby down.\n\nMR. McCABE (defense counsel): If that witness is Mr. Juju White, who is doing 32 years in custody, that's not exactly the best information in the world to mount a criminal prosecution based upon.\n\nTHE COURT: Okay. But I will assume for purposes of this that even though they had information that he was the gunman in the fifth robbery, they didn't have probable cause to arrest him, because he wasn't arrested. Is that sufficient?\n\nMR. McCABE: Yes, Your Honor.\n\nAs this passage demonstrates, defense counsel did not contest the proposition that the FBI's approach was for legitimate law enforcement purposes. Latta held that all that is required to make a parole condition search lawful is a reasonable belief on the part of law enforcement that the search is necessary. \"It may even be based on a 'hunch,' arising from what he had learned or observed about the behavior and attitude of the parolee.\" Id. 521 F.2d at 250.\n\nD.\n\nTwo recent cases require comment: City of Indianapolis v. Edmond, 531 U.S. 32 (2000) and Ferguson v. City of Charleston, 532 U.S. 67 (2001). In Edmond, the Supreme Court declined to confer \"special needs\" status on city-operated vehicle checkpoints established for the purpose of interdicting unlawful drugs. In distinguishing this vehicle checkpoint initiative from others approved in Delaware v. Prouse, 440 U.S. 648 (1979); United States v. Martinez-Fuerte, 428 U.S. 543 (1976); and Mich. Dep't of State Police v. Sitz, 496 U.S. 444 (1990), the Court observed that \"the primary purpose\" of the checkpoint program under scrutiny \"was to detect evidence of ordinary criminal wrongdoing.\" Edmond, 531 U.S. at 38. Thus, that checkpoint program did not qualify as a \"special need\" beyond the scope of normal law enforcement. Id. at 47-48. Similarly, in Ferguson, the Court disapproved of a combined hospital, police, and public policy to test pregnant patients for evidence of drug use and to turn over positive results to the police for prosecution. 532 U.S. at 70-73, 85-86. The basis for the Court's determination was that the purpose of this program was \"indistinguishable from the general interest in crime control.\" Id. at 81 (quoting Edmond, 531 U.S. at 44). Thus, the particulars of this policy did not satisfy the Court's test.\n\nAlthough one of the goals of the parole system certainly is to prevent crime, I see the supervision of parolees as materially different and distinguishable from the parameters of general law enforcement. First, in both Edmond and Ferguson, the groups at which the flawed initiatives were aimed were comprised of ordinary citizens going about their daily business, people cloaked with the presumption of innocence, and people certainly not in custody and serving out prison sentences. This is a cohort at full liberty and not subject to special supervision by the state, and most importantly, a class not in \"transition between imprisonment and discharge.\" Cal. Pen. Code § 3000(a)(1).\n\nSecond, the administration by California of its parole system renders it different from normal law enforcement. As we recognized in Latta,\n\nTo the extent that there is a \"law enforcement\" emphasis, it is to deter the parolee from returning to a life of crime. . . . \"When, as here, a parolee is in violation of his parole, the parole agents' higher duty is to protect the parole system and to protect the public.\" However, this feature of the parole system, important as it is, does not predominate. . . . The fact that crimes are detected during the administration of the parole system does not convert what is essentially a supervisory and regulatory program into a subterfuge for criminal investigations.\n\nLatta, 521 F.2d at 249 (citations omitted).\n\nAccordingly, Griffin and Knights provide the controlling authority for this case, not Edmond and Ferguson.\n\nE.\n\nLiterally hundreds of thousands of suspicion-free, conviction-free citizens of our nation have been made subject to limited \"special needs\" searches because of a demonstrable need transcending the boundaries of normal law enforcement. See Bd. of Educ. v. Earls, 536 U.S. 822 (2002) (drug tests for extracurriculars at school); United States v. Gonzalez, 300 F.3d 1048 (9th Cir. 2002) (searches of employee backpacks to prevent loss of inventory); Vernonia Sch. Dist. 47J v. Acton, 515 U.S. 646 (1995) (drug tests of athletes at school); Sitz, 496 U.S. 444 (highway sobriety checkpoints); Skinner, 489 U.S. 602 (1989) (railroad employees' drug tests at work); Nat'l Treasury Employees Union v. Von Raab, 489 U.S. 656 (1989) (Customs employees' drug tests at work); New York v. Burger, 482 U.S. 691 (1987) (purely administrative search of regulated business); McMorris v. Alioto, 567 F.2d 897 (9th Cir. 1978) (purely administrative search in public buildings); United States v. Martinez-Fuerte, 428 U.S. 543 (1976) (fixed checkpoint routine border search); United States v. FloresMontano, 124 S.Ct. 1582 (2004), (border searches are per se reasonable by virtue of the fact that they occur at the border).\n\nIn Katz v. United States, 389 U.S. 347 (1967) the Court rejected the idea that there is such a \"concept [as a 'constitutionally protected area' that] can serve as a talismanic solution to every Fourth Amendment problem.\" Id. 351, n.9. In fact, although the Court recognized that a private home has been acknowledged to be a constitutionally protected area, the Court cautioned against a rigid analytical reliance on this principle. Saying that the \"effort to decide whether or not a given 'area,' viewed in the abstract, is 'constitutionally protected' deflects attention from the problem presented in this case.\" Id. at 351. I certainly acknowledge the constitutional protection usually afforded to a person in that person's home. On the other hand, with the idea in mind that the Fourth Amendment protects people, not places, and given Crawford's different status, I believe it is appropriate to give his lair far less protection than it would ordinarily attain. It is the status of the person that determines the privacy to which the person is entitled even in that person's residence. Knights fully supports this idea. Moreover, bodily fluids would seem to be on par with homes, and the Court has had no problem including bodily fluid searches within the \"special needs\" category.\n\nWhat is important also to recognize from these cases is that the classes involved in them did not find their privacy rights \"wholly eliminated,\" just altered discretely and rationally to accommodate compelling public needs. That is exactly what California has done to parolees vis a vis parole searches.\n\nVI.\n\nFrom all of the above, I conclude that Crawford's statements to law enforcement officials were not preceded by any illegal search or personal seizure or by a violation of Miranda. I conclude also that the conduct of the officers was, as required by Latta, demonstrably reasonable under the \"totality of the circumstances.\" Knights, 534 U.S. at 118; Latta, 521 F.2d at 250 (A parolee and his home are subject to search by the parole officer when the officer reasonably believes that such search is necessary in the performance of his duties); see also Rise v. Oregon, 59 F.3d 1556 (9th Cir. 1995) (Oregon statute requiring felons convicted of murder or specific sexual offenses to submit blood sample for DNA bank is reasonable and therefore does not violate the Fourth Amendment); Russell v. Gregoire, 124 F.3d 1079 (9th Cir. 1997) (convicted sex offenders have no right of privacy preventing the state from requiring them to register as such and be subject to community notification of their residences). The purpose of the encounter, approved by Crawford's parole agent and wellwithin the scope of the applicable parole conditions, was not to harass or to annoy, but to investigate an armed bank robbery where Crawford had been identified by an accomplice as a participant who carried a firearm.\n\nIn sum, I, too, would affirm Crawford's conviction and remand for resentencing.\n\nCONCLUSION\n\nCalifornia's legislative decision to make parole a privilege rather than a right and to subject prison parolees to stringent supervision including searches was patently reasonable. As limited by the California Supreme Court in Reyes, and the Due Process Clause, these searches conform to the demands of the Fourth Amendment. Moreover, California's decision not to recognize a privacy right on the part of convicted felons to defeat these searches is rational and clearly not arbitrary, not capricious, not harassing, and not punitive. Crawford subjectively did not have any expectation of privacy in his residence, and any such objective expectation that any parolee might have had would not be \"one that society is prepared to recognize as reasonable.\" Bond v. United States, 529 U.S. 334, 338 (2000) (quoting Smith v. Maryland, 442 U.S. 735, 740 (1979)). The test reiterated by the Supreme Court in Minnesota v. Carter, 525 U.S. 83 (1998) is that \"in order to claim the protection of the Fourth Amendment, a defendant must demonstrate that he personally has an expectation of privacy in the place searched, and that his expectation is . . . one that has a source . . . recognized and permitted by society.\" Id. at 88. Crawford's case fails this test.\n\nSirhan Sirhan shot and killed Senator Robert F. Kennedy in 1968 while Senator Kennedy was a candidate for the Presidency of the United States. Sirhan was convicted of murder and is serving a life sentence in prison in California. He is eligible for parole. If he is released on parole, it does not seem reasonable to exempt him from parole searches until someone has a suspicion that he has broken the law again. The same holds true for all three strikes felons imprisoned in California.\n\nIf the Constitution permits life sentences for career criminals, Ewing, 538 U.S. at 15, and the \"Megan's Law\" posting on the Internet of the neighborhood addresses of registered sex offenders, see Smith v. Doe, 538 U.S. 84 (2003), it seems reasonable for a state to keep a tight rein on parolees.\n\nI would affirm Crawford's conviction.\n\nKLEINFELD, Circuit Judge, concurring:\n\nThe majority holds that, assuming without deciding that the search of Crawford's home and his detention there were illegal, the statements made by Crawford were nevertheless admissible. I agree.\n\nJudge Trott would hold that the search of Crawford's home and his detention there were constitutionally permissible, so his statements were admissible without regard to the analysis in the majority opinion. I agree.\n\nIn my view, Judge Trott's approach is preferable, because it usefully clarifies the constitutional relationship of states and parolees, and because the Supreme Court in New York v. Harris said, \"[A]ttenuation analysis is only appropriate where, as a threshold matter, courts determine that 'the challenged evidence is in some sense the product of illegal governmental activity.' \" \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e There was no illegal governmental activity here, and that is the end of it. Nevertheless, it is highly desirable that we issue a majority opinion, not merely a plurality opinion, so I have concurred in the majority opinion as well as Judge Trott's regarding the suppression of Crawford's statements.\n\nRegarding sentencing, I concur in the result reached by the majority, vacating and remanding, but disagree with the de novo standard of review the majority applies. Standard of review has not been put at issue and my view has not been argued by any party (so we as an en banc court would not do as I suggest here without inviting further briefing), and has therefore not been a focus of our attention. But the standard of review for a sentence is a threshold question, we must view the case through the lens of the proper standard of review, and recent legislation makes the de novo standard untenable. We err by declaring that the standard of review is de novo.\n\nI write separately for two reasons: (1) to clarify the distinction between parolees and probationers, and (2) to address the standard of review for application of the sentencing guidelines to the facts of the offense.\n\nI.\n\nFirst, parolees. The cases often speak to persons \"on probation or parole.\" That set includes two quite different subsets. One is entitled to less freedom than the other. Crawford himself summarized the law for parolees with near accuracy when he testified that \"I just took it for granted that, you know, I'm on parole, that I don't have no rights at all.\" The difference between parolees and probationers, who are near opposite ends of the punishment scale, illustrates both the correctness of Judge Trott's analysis and the possibility of distinguishing cases relating only to probationers.\n\nParolees are persons who have been sentenced to prison for felonies and released before the end of their prison terms. They are held in a \"variation on imprisonment\" with only a \"limited degree of freedom.\"\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e One cannot get sentenced to parole. The only way to get parole in the typical state system \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e is to commit a felony, not merely a misdemeanor, and get sentenced to prison, not merely jail, for a period of time long enough to qualify for release, eventually, on parole.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Thus, as distinguished from those not convicted of anything, those convicted of mere misdemeanors and either jailed or not jailed, and those convicted of felonies but not imprisoned for lengthy periods, parolees are persons deemed to have acted more harmfully than anyone except those felons not released on parole.\n\nProbationers are close to the other end of the harmfulness scale. The most typical use of probation is as an alternative to jail for minor offenders, most commonly misdemeanants.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nSometimes a first offender felon gets the lenience of probation rather than imprisonment.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Unlike parolees, who were sent to prison for substantial terms, probationers attain that status from a judicial determination that their conduct and records do not suggest so much harmfulness or danger that substantial imprisonment is justified.\n\nIt is perfectly reasonable, and constitutionally permissible, that persons whose conduct has been so egregious as parolees' are subject to searches on hunches, unreliable tips, general sweeps, and anything else not \"arbitrary, capricious, or harassing.\"\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Thus even if the search of Crawford's home would be violative of a probationer's right to privacy (I do not suggest that it would be), that would not settle the question whether it would violate the right to privacy, limited as it is, of a parolee. Constitutional limits on supervision of probationers may be more extensive than those limiting supervision of parolees.\n\nII.\n\nSecond, sentencing. During the Ulrich Street robbery, Crawford pointed a gun at a security guard, momentarily pressing it into his back, and said, \"This is a holdup. Face the wall, put your hands up, and don't move.\" The district court held that this exchange sufficed for imposition of the \"physical restraint\" enhancement. Applying de novo review, the majority vacates and remands on the grounds that the district court erred by not applying United States v. Parker.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Our court has historically held that the application of the physical restraint adjustment to an undisputed set of facts is reviewed de novo.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e We should correct our standard of review to \"abuse of discretion.\" I nevertheless concur in the result reached by the majority regarding sentencing.\n\nA de novo standard was widely adopted prior to the recent revision of the relevant statute.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e The theory for the de novo standard is that in reviewing application of guidelines to the facts, we are making a determination of law.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Our determinations of law, though, are so fact-based and fact-limited that they should more properly be viewed as judgments about facts. We have generated a vast number of decisions about how the guidelines apply to details of crimes so minute and so affected by context that the cases invite distinctions as often as application.\n\nThe more deferential abuse of discretion standard would prevent the proliferation of not-very-useful appellate decisions which district judges may overlook, and afford appropriate deference to the sentencing judgments of district judges. The more deferential standard would also establish needed play in the joints of the sentencing guidelines, so that district judges can smooth out the variations generated by different prosecutors and probation officers in similar cases. Most important, though the old de novo standard was a permissible construction (though I think it was erroneous) of the \"due deference\" language in the statute before the recent amendment, it cannot be squared with the statute as it now stands.\n\nCongress has provided the appellate court with statutory direction regarding the standard of review for different sentencing decisions by a district court. In 18 U.S.C. § 3742(e), we are instructed by Congress to \"give due deference to the district court's application of the guidelines to the facts.\" With the addition of the PROTECT Act amendments last year,\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e the statute expressly sorts out three different standards of review, (1) \"clearly erroneous\" for credibility determinations; (2) \"due deference\" for application of the guidelines to the facts; (3) \"de novo\" for application of guidelines to facts for \"3(A) or 3(B)\" determinations, i.e., departures for improper reasons and departures without written statements of reasons:\n\nThe court of appeals shall give due regard to the opportunity of the district court to judge the credibility of the witnesses, and shall accept the findings of fact of the district court unless they are clearly erroneous and, except with respect to determinations under subsection (3)(A) or (3)(B), shall give due deference to the district court's application of the guidelines to the facts. With respect to determinations under subsection (3)(A) or (3)(B), the court of appeals shall review de novo the district court's application of the guidelines to the facts.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nWe are erroneously applying \"de novo\" review where the statute expressly commands us to apply \"due deference\" review.\n\nThere is no way to infer that Congress meant for us to apply de novo review to all \"application of the guidelines to the facts,\" where it expressly distinguished between \"due deference\" and \"de novo\" review and explicitly limited de novo review to the designated classes of departures from the guidelines. Where we once may have been able to say that the \"deference due\" other applications of guidelines to the facts was \"none\"-and then review de novo-that interpretation is now precluded for applications of the facts to the guidelines other than for (3)(A) or (3)(B) determinations. Congress has said, in effect, review decisions in class A for clear error, class B with due deference, and class C de novo, yet we review class B as well as class C decisions de novo. That is plainly a misreading of the statute.\n\nThough \"due deference\" is a different verbal formula from \"abuse of discretion,\" it is best interpreted as meaning the same thing in a case such as Crawford's. In Koon v. United States, the Court directed appellate courts to review a district court's decision to depart from the Guidelines range for abuse of discretion rather than de novo.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e The Court acknowledged that \"the deference that is due [a district court under § 3742(e)] depends on the nature of the question presented.\"\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nWhere the appellate court \"will be in as good a position to consider the question as the district court was in the first instance,\" as when the claim on appeal is that the district court made some kind of mathematical error, \"[t]he district court may be owed no deference.\"\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nIn distinguishing the departure decision from questions of law that require no deference, the Court in Koon relied on the factual nature of departure decisions, decisions that require a district court to \"make a refined assessment of the many facts bearing on the outcome\" and that involve \"the consideration of unique factors that are little susceptible of useful generalization.\"\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e The Court reasoned that we cannot avoid the factual nature of the departure inquiry by taking it to a higher level of generality.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Rather than asking whether a factor is within the heartland as a general proposition, a court asks whether the factor is within the heartland given all the facts of the case.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nMore recently, the Supreme Court rejected a defendant's argument that because no facts were in dispute in the decision to be reviewed by the appellate court, de novo review was appropriate.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e In Buford v. United States, the Court upheld the Seventh Circuit's deferential review of the district court's decision that certain past convictions were not consolidated for sentencing when it determined that Buford was a career offender.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e Relying heavily on Koon, the Court held that \"the district court is in a better position than the appellate court to decide whether a particular set of individual circumstances demonstrates 'functional consolidation.' \"\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e Additionally, the Court pointed out that \"factual nuance may closely guide the legal decision, with legal results depending heavily upon an understanding of the significance of case-specific details.\"\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nWhether the \"physical restraint\" enhancement, § 2B3.1(b) (4)(B), applies in a given case is analogous to the kind of question for which the Supreme Court has required deference to the judgment of the district court. A comprehensive, nuanced, contextualized consideration of the crime, the criminal, and the victim, and all the surrounding circumstances, may affect the decision whether the victim was physically restrained. A raised fist might very effectively restrain an elderly, frail victim but might not at all restrain a victim larger and stronger than the perpetrator, and the effectiveness of restraint might vary with time of day, visibility of the crime to passersby, proximity of refuge, and all sorts of other things. Thus, application of the \"physical restraint\" guideline to the facts is not a question \"readily resolved by reference to general legal principles and standards alone.\"\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e Rather, it is a question \"that grows out of, and is bounded by, case-specific detailed factual circumstances . . . [which] limits the value of appellate court precedent.\"\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e We are not in as good a position as the district court to evaluate the facts in light of the record, so we should largely get out of the business of doing so, except when the district court determination, even when viewed deferentially, cannot be deferred to.\n\nOur error in applying a de novo standard of review generates a large number of cases for which our review makes no very valuable contribution. According to the United States Sentencing Commission, in fiscal year 2001, there were 14,000 Guidelines offenders sentenced in federal courts in the Ninth Circuit.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e Of that number, 935 appealed either their sentences or their sentences and convictions.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e This is almost as many cases as the number of immigration cases we handled in 2001.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e An abuse of discretion standard of review would generate far more unpublished dispositions and far fewer published opinions than a de novo standard.\n\nThe district court found that Crawford pointed a gun directly at a bank employee, told him this was a robbery, made him turn around to face the wall, and forced him to remain there during the entire robbery. The majority holds that the district court correctly held that physical contact with the victim was unnecessary, under United States v. Thompson,\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nbut that the district court could not impose the \"physical restraint\" adjustment without expressly finding, under our decision in United States v. Parker,\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e a \"sustained focus on the restrained person.\" Both cases are, in my view, unnecessary elaborations of the guidelines to which we were led by a mistaken standard of review. Were the district court simply to apply the guidelines as they are without the cases, guidance would be quite adequate, and would probably suggest not imposing the adjustment.\n\nUnder sentencing guideline § 2B3.1(b)(2), using or brandishing a firearm during a robbery gets a five or six level increase. Abduction and physical restraint are dealt with separately by four and two level adjustments in § 2B3.1(b)(4). The commentary following the guideline refers to physical restraint \"by being tied, bound, or locked up.\" We eliminated the simplicity and clarity of this arrangement by generating needless common law around it. First, we construed the physical restraint enhancement to include pointing a gun at someone in Thomspon, even though pointing a gun at someone gets the five or six level adjustment under subsection (b)(2) rather than the mere two level adjustment for physical restraint under subsection (b)(4).\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e Then we distinguished and limited Thompson in Parker by holding that just pointing a gun at someone does not amount to physical restraint without a \"sustained focus\" on the victim.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e We could have stayed out of this thicket, and left the district courts with the greater clarity of the guidelines unadorned, had we reviewed merely for abuse of discretion. This pair of cases shows how de novo review encrusts the guidelines with needless additional complexity. We did not generate a common law of sentencing before the guidelines, because sentences were generally unappealable. The guidelines are so elaborate a codification that encrustation by an extensive body of common law is unhelpful to sentencing judges and does not contribute to just sentences any more than abuse of discretion review would.\n\nThe distinctions upon which the cases have focused have salience in particular cases, but as legal generalizations they are arbitrary. Whether a gun touches a person or not is simply a silly question, since the whole idea of guns is that they can function without touching - that is why they have replaced swords. As for whether the felon spends a whole lot of time focusing on one of the individuals in the bank, that is but one of many contextual considerations that affect how restrained victims feel. A more appropriate focus of inquiry would be upon whether restraint by a gun is covered by the \"using\" and \"brandishing\" adjustments, and whether it is like the tying up, binding, or locking up examples in the application note for \"physical restraint.\" But that sensible line of inquiry is foreclosed by our needless common law.\n\nI concur in our result vacating and remanding for resentencing, though I differ as to the proper standard of review. Because we as an en banc panel can easily correct mistaken language in prior law, we should consider the effect of the PROTECT Act and revise our standard of review. Doubtless in some subsequent case the issue of standard of review will be squarely set before us by the briefs.\n\nW. FLETCHER, Circuit Judge, dissenting, with whom PREGERSON and TASHIMA, Circuit Judges, join:\n\nDuring a suspicionless search of his residence and an involuntary detention during that search, Raphyal Crawford agreed to go to the FBI office to talk. FBI Agent David Bowdich conducted the search because he hoped that he could induce Crawford to confess to a bank robbery that had taken place about two and a half years earlier. Agent Bowdich testified that he and his fellow officers had no expectation they would find any evidence of the \"old bank robbery\" during the search. Rather, he testified that he planned the search and accompanying detention as a \"tool\" to get Crawford to confess. After about an hour and a half at the FBI office, Crawford confessed to participating in the bank robbery.\n\nAt the time of the search and detention, Crawford was a California state parolee subject to explicit conditions of parole. None of these conditions, however, authorized a suspicionless search whose sole purpose was to investigate a preparole crime. I conclude that, in the absence of an explicit condition of parole, a search of a parolee's residence to investigate a pre-parole crime must be justified by at least a reasonable suspicion that evidence of that crime will be found. Because the search of Crawford's residence and accompanying detention were conducted without any such suspicion, they violated the Fourth Amendment.\n\nWhen evidence is produced by \"exploitation\" of an underlying illegality, such as a violation of the Fourth Amendment, it must be excluded from the evidence the prosecution presents at trial. Brown v. Illinois, 422 U.S. 590, 599 (1975) (quoting Wong Sun v. United States, 371 U.S. 471, 487-88 (1963)). Because Agent Bowdich and his fellow officers purposely, and successfully, used the illegal suspicionless search and accompanying detention as a \"tool\" to produce Crawford's confession, that confession should not have been admitted into evidence. I therefore respectfully dissent.\n\nI. Background\n\nOn July 27, 2000, at about 8:20 in the morning, FBI Agent Bowdich arrived with four state law enforcement officers at Crawford's residence, where he was living with his sister. As a \"courtesy,\" Agent Bowdich had notified Crawford's parole officer of his intention to search Crawford's residence, but the parole officer did not accompany Agent Bowdich. The officers knocked on the door, and Crawford's sister let them in. Agent Bowdich, Detective Gutierrez, and at least one other officer went into the bedroom where Crawford was asleep with his eighteen month-old daughter. Detective Gutierrez and Crawford testified that the officers had their guns drawn. The officers woke Crawford, took him into the living room, and seated him on the couch. Agent Bowdich testified that Crawford was \"detained\" on the couch and was not \"free to leave\" while the officers searched the residence.\n\nThe search of Crawford's residence and his accompanying detention lasted between thirty and fifty minutes. During this time, as officers searched the residence, Crawford's sister tried to get her children ready for their day. Agent Bowdich used this time to \"chit-chat\" with Crawford. Late in the conversation, Agent Bowdich asked about what he described as an \"old bank robbery.\" Agent Bowdich then suggested that Crawford might be \"more comfortable\" talking at the FBI office. Under the circumstances created by Agent Bowdich and his fellow officers - several officers searching Crawford's residence during the early morning, an accompanying detention of Crawford on the couch in the living room, Crawford's eighteen month-old daughter still sleeping in the bedroom, and Crawford's sister trying to get her children ready for the day - Crawford agreed that a conversation at the FBI office would be \"more comfortable.\"\n\nAgent Bowdich and Detective Gutierrez escorted Crawford to Agent Bowdich's car. During the twenty minute drive to the FBI office, Detective Gutierrez sat in the back seat next to Crawford. Once at the FBI office, Crawford was taken into an interview room, and the door was closed. Agent Bowdich began to read Crawford his rights under Miranda v. Arizona, 384 U.S. 436 (1966), but Crawford stopped him, asking if he was under arrest. Agent Bowdich said that he was not and discontinued reading the Miranda rights. After about an hour and a half in the interview room, Crawford confessed to the bank robbery.\n\nAgent Bowdich testified in the district court that he did not expect to find evidence of the bank robbery in his search of Crawford's residence. Rather, he sought an opportunity to talk to Crawford about the \"old bank robbery\" in a situation where Crawford would be at a psychological disadvantage. Further, he hoped that the suspicionless search of Crawford's residence might turn up evidence of violations of state law that he could use for leverage to get Crawford to confess to the robbery. Agent Bowdich testified forthrightly: \"We weren't looking for evidence of a bank robbery, but we were looking at [the] potential of possibly flipping him, if we were able to find evidence of a state case, where we would take all that evidence and give it to one of our state officers who was there for us - with us.\" Agent Bowdich repeatedly made clear in his testimony that the sole purpose of the suspicionless search of Crawford's residence and accompanying detention was to investigate the bank robbery. That robbery was, of course, committed before Crawford was released on parole.\n\nII. Fourth Amendment Violation\n\nCrawford contends that the suspicionless search of his residence, and the accompanying detention, violated the Fourth Amendment. I agree.\n\nA. Conditions of Crawford's Parole\n\nAt the time of the search and detention, Crawford was on parole from California state prison. When he was released from prison, he signed what is sometimes called a \"Fourth Waiver\" form, which imposed certain conditions during his parole. I am willing to assume for purposes of this case that these conditions of parole are valid. However, none of these conditions authorized a suspicionless search whose sole purpose was the investigation of a pre-parole crime.\n\n1. Validity of the Parole Conditions\n\nJudge Trott contends in his separate opinion that the parties in this case have misunderstood the legal status of a \"Fourth Waiver\" form. As I understand his argument, Judge Trott contends that at all relevant times California had the authority under state law to enter into an agreement with a would-be probationer, but did not have such authority with a would-be parolee. According to Judge Trott, the State unilaterally imposes conditions of parole, in contrast to conditions of probation, which are established by agreement between the State and the would-be probationer.\n\nJudge Trott relies on the decision of the California Supreme Court in People v. Reyes, 968 P.2d 445 (Cal. 1998). In explaining why consent by a would-be parolee cannot be used to validate an otherwise illegal search, the court wrote, in langauge quoted by Judge Trott:\n\nThe consent exception to the warrant requirement may not be invoked to validate the search of an adult parolee because, under the Determinate Sentencing Act of 1976, parole is not a matter of choice. The Board of Prison Terms must provide a period of parole; the prisoner must accept it. (Pen. Code § 3000 et seq.) Without choice, there can be no voluntary consent to inclusion of the search condition.\n\nId. at 448 (citation omitted) (italics indicate sentence not quoted in Judge Trott's opinion). Under this reasoning, the State has no authority to bargain with the would-be parolee, and therefore lacks the authority to threaten to withhold parole unless the parolee agrees to waive some or all of his Fourth Amendment rights. Judge Trott thus argues that what the parties in this case call a \"Fourth Waiver\" form is not an agreement under which the parolee agrees to waive his Fourth Amendment rights in order to gain parole. Rather, the \"Fourth Waiver\" form is a notification to the parolee of conditions unilaterally imposed upon him by the State.\n\nJudge Trott understands California law somewhat differently from the Deputy Attorney General representing the State as amicus, and from the Assistant United States Attorney. During oral argument to our en banc court, both attorneys represented that the conditions of parole at issue in this case were at all relevant times a matter of agreement between the State and the parolee. Both attorneys told us that if California state prisoners choose not to waive their Fourth Amendment rights as a condition of being granted parole, those prisoners do not get parole and stay in prison. The Deputy Attorney General, in particular, represented that California law has changed since the California Supreme Court's decision in Reyes. The State's brief maintains that between March 1, 2001 and October 1, 2003, sixty-seven inmates refused to sign new conditions of parole and were returned to prison.\n\nIn some circumstances, it might matter whether conditions of parole are unilaterally imposed by the State, as contended by Judge Trott, or are imposed pursuant to an agreement between the State and the parolee, as contended by the Deputy Attorney General and the Assistant United States Attorney. In this case, however, it does not matter. For the purposes of this case, I assume that the conditions contained in the \"Fourth Waiver\" form signed by Crawford are valid. They may be valid because, as Judge Trott contends, the State had the power unilaterally to impose them. Or they may be valid because Crawford agreed to them as a condition of gaining parole. Or, indeed, they may be invalid. But it makes no difference in this case, for in no event do the conditions of parole in the \"Fourth Waiver\" form authorize a suspicionless search of Crawford's residence to investigate a pre-parole crime.\n\n2. Meaning of the Parole Conditions\n\nCrawford signed the \"Fourth Waiver\" form in 2000, just before he was released from prison. There are several possible readings of the parole conditions contained in the form, but under none of these readings did these conditions authorize the suspicionless search conducted by Agent Bowdich and his fellow officers. To understand the conditions, it is helpful first to sketch out the legal background against which they were written.\n\na. Legal Background\n\nFor many years, the California Supreme Court has upheld conditions allowing suspicionless probation and parole searches. See, e.g., People v. Woods, 981 P.2d 1019, 1028 (Cal. 1999) (probation); Reyes, 968 P.2d at 448 (parole); People v. Bravo, 738 P.2d 336, 342-43 (Cal. 1987) (probation). The court has indicated that these conditions have two purposes: first, to ensure compliance with the law while on probation or parole; and, second, to ensure compliance with the terms of probation or parole. See, e.g., Woods, 981 P.2d at 1027. Probation and parole searches must be reasonably related to these two purposes. See People v. Robles, 3 P.3d 311, 316 (Cal. 2000) (\"As our decisions indicate, searches that are undertaken pursuant to a probationer's advance consent must be reasonably related to the purposes of probation.\").\n\nThe California Supreme Court has described the purpose of ensuring compliance with the law only in terms of a probationer's or parolee's current compliance, not pre-probation or pre-parole compliance. For example, in Woods, the California Supreme Court stated, \"[T]he dual purpose of a search condition [is] to deter further offenses by the probationer and to ascertain compliance with the terms of the probation.\" 981 P.2d at 1024 (emphasis added); see also Reyes, 968 P.2d at 450 (\" '[T]he purpose of an unexpected, unprovoked search of a defendant is to ascertain whether [the parolee] is complying with the terms of [parole]; to determine not only whether he disobeys the law, but also whether he obeys the law.' \") (quoting People v. Mason, 488 P.2d 630, 632 (Cal. 1971)) (emphasis added); Bravo, 738 P.2d at 342 (also quoting Mason, 488 P.2d at 632). The California Supreme Court has repeatedly upheld suspicionless parole searches for evidence of current crimes. See, e.g., Woods, 981 P.2d at 1028 (suspicionless search for evidence of current crime); Reyes, 968 P.2d at 447 (suspicionless search for evidence of current drug use); Bravo, 738 P.2d at 343 (search for evidence of current drug sales). But I am unaware of any case in which the California Supreme Court has upheld either a suspicionless search for evidence of a pre-parole crime, or a suspicionless search whose sole purpose is to investigate a pre-parole crime.\n\nIn 2000, when Crawford signed his conditions of parole, the case law of our circuit was even stricter than that of the California Supreme Court. In a long line of cases, we had repeatedly held that probation and parole searches could dispense with the ordinary requirements of a warrant and probable cause only when the search was not a subterfuge for investigation into past or current crimes. See, e.g., United States v. Ooley, 116 F.3d 370, 372 (9th Cir. 1997) (\"[W]e have long recognized that the legality of a warrantless search depends on a showing that the search was a true probation search and not an investigation search.\"); United States v. Vought, 69 F.3d 1498, 1501 (9th Cir. 1995); United States v. Watts, 67 F.3d 790, 794 (9th Cir. 1995), rev'd on other grounds, 519 U.S. 148 (1997); United States v. Harper, 928 F.2d 894, 897 (9th Cir. 1991); United States v. Butcher, 926 F.2d 811, 815 (9th Cir. 1991); United States v. Richardson, 849 F.2d 439, 441 (9th Cir. 1988); United States v. Jarrad, 754 F.2d 1451, 1454 (9th Cir. 1985); Latta v. Fitzharris, 521 F.2d 246, 249 (9th Cir. 1975) (en banc); Smith v. Rhay, 419 F.2d 160, 162-63 (9th Cir. 1969). Probable cause and a warrant were required for ordinary law enforcement investigations of probationers and parolees - of both past and present crimes - where the Fourth Amendment would otherwise so require.\n\nA year after Crawford signed his \"Fourth Waiver\" form, the Supreme Court partially overruled this line of cases in United States v. Knights, 534 U.S. 112 (2001). Relying on the California Supreme Court's decision in Woods, 981 P.2d 1019, the Court upheld an investigatory probation search, based on a California probation condition, where officers had reasonable suspicion that evidence of a current crime would be found. The Court repeated the dual justifications given by the California Supreme Court for probation searches: \"It was reasonable to conclude that the [California probation] search condition would further the two primary goals of probation rehabilitation and protecting society from future criminal violations.\" 534 U.S. at 119 (emphasis added); see also id. at 121 (\"When an officer has reasonable suspicion that a probationer subject to a search condition is engaged in criminal activity, . . . an intrusion on the probationer's significantly diminished privacy is reasonable.\") (emphasis added).\n\nThe Court in Knights addressed only the level of suspicion, or cause, required for probation searches for evidence of current crimes. It did not address the level of suspicion required to justify searches for evidence of past crimes. But for purposes of understanding Crawford's \"Fourth Waiver\" form, the question is not what Knights means or might mean. The question, rather, is what California officials understood to be the law when they presented the \"Fourth Waiver\" form to Crawford a year before Knights was decided, and what Crawford might reasonably have understood to be the meaning of that form when he signed it.\n\nb. The Parole Conditions\n\nThe \"Fourth Waiver\" form signed by Crawford contained two clauses:\n\nYou [Crawford] and your residence and any property under your control may be searched without a warrant by an agent of the Department of Corrections or any law enforcement officer.\n\nParolee's Initials\n\nYou agree to search or seizure by a parole officer or other peace officer at any time of the day or night, with or without a search warrant and with or without cause.\n\nParolee's Initials\n\nClause 1 specifies that \"you and your residence and any property under your control\" may be searched; authorizes searches by law enforcement officers and agents of the Department of Corrections; and authorizes searches \"without a warrant.\" By contrast, Clause 2 specifies only that \"you\" (Crawford) agree to be searched; authorizes searches by parole officers and other peace officers; and authorizes searches and seizures both \"with or without a search warrant,\" and \"with or without cause.\"\n\nThree different readings of the two clauses are possible. The first two readings understand the clauses as part of an integrated whole in which each clause has a distinct meaning. The third reading understands the clauses as having synonymous meanings. Under none of these readings does the \"Fourth Waiver\" form authorize a suspicionless search of Crawford's residence to investigate a pre-parole crime.\n\nThe first reading focuses on the fact that Clause 1 is narrow and relatively protective. Clause 1 specifies that it applies to searches of Crawford, his residence, and property under his control; and it dispenses only with a requirement for a warrant. By contrast, Clause 2 is general and relatively nonprotective. It does not specify any particular kind of search, and it dispenses with both a warrant and a cause requirement. The reference in Clause 1 to a search of a \"residence\" suggests that a residential search is authorized under Clause 1, but not under Clause 2. Further, the absence of a statement in Clause 1 that a search may be conducted \"with or without cause\" suggests that a search under Clause 1 requires cause, unlike Clause 2. Under this reading, Agent Bowdich's search was not authorized under either clause because Clause 1 does not authorize suspicionless searches at all, and Clause 2 does not authorize suspicionless searches of residences.\n\nThe second reading focuses on the nature of a parole search under California law. Clause 2 clearly authorizes a conventional suspicionless parole search as described and authorized under California case law. See, e.g., Bravo, 738 P.2d at 603. It allows searches at any time \"with or without a search warrant\" and \"with or without cause,\" and it specifically refers to searches by a \"parole officer.\" If Clause 1 is to have some independent meaning, it must refer to other kinds of searches. Searches to investigate pre-parole crimes, not specifically authorized by California case law, would be among these other searches. Under this reading, Agent Bowdich's search was not authorized under either clause because Clause 1 does not allow suspicionless searches at all, and because Clause 2 does not authorize suspicionless searches to investigate preparole crimes.\n\nThe third reading abandons the attempt to read the \"Fourth Waiver\" form as an integrated whole in which Clauses 1 and 2 have independent meanings. As seen above, Clause 2 authorizes a standard suspicionless parole search under California case law. Clause 1 may be read, redundantly, to authorize exactly the same type of search. In several cases, the California Supreme Court has interpreted a parole condition worded precisely as Clause 1 is worded to authorize a suspicionless parole search. See, e.g., People v. Sanders, 73 P.3d 496, 499 (Cal. 2003); Reyes, 968 P.2d at 446. In these cases, the court has interpreted the phrase \"without a warrant\" to mean not only without a warrant but also \"without cause.\" However, the court in these cases did not discuss any other parole conditions that might also have been present. I therefore do not know whether the court would interpret the phrase \"without a warrant\" to dispense with a requirement for cause if there had been an additional parole condition, comparable to Clause 2, dispensing with both warrant and cause.\n\nBut even if I read Clause 1 to dispense with a requirement for cause, I should not read the clause more broadly than the California Supreme Court has read it. The California Supreme Court has repeatedly held that the purposes of parole and probation searches are to ensure current compliance with law and with probation and parole terms. See, e.g., Woods, 981 P.2d at 1027. Given this case law, I would require a very clear statement in the Fourth Waiver form that it authorizes a suspicionless search to investigate pre-parole crimes. There is no such clarity in the form Crawford signed. Thus, under any reading consistent with California law, Agent Bowdich's search was not authorized under either Clause 1 or Clause 2, because neither clause authorizes suspicionless searches to investigate pre-parole crimes.\n\nDuring oral argument, the Deputy Attorney General told us that the \"Fourth Waiver\" form signed by Crawford is no longer used for California parolees. That fact may lessen the long-term importance of this case, but it does not change the parole conditions of which Crawford was given notice. Under any of the possible readings of the \"Fourth Waiver\" form, the form does not authorize a suspicionless search of Crawford's residence to investigate a pre-parole crime. The question posed in this case is thus whether the suspicionless search of Crawford's residence was valid in the absence of an explicit parole condition authorizing such a search.\n\nB. A Parolee's Expectation of Privacy in the Absence of a Controlling Condition of Parole\n\nWe know that a parolee has a reduced expectation of privacy, and that a State may \"condition\" parole on compliance with \"often strict terms and conditions of . . . release.\" Pa. Bd. of Prob. \u0026 Parole v. Scott, 524 U.S. 357, 365 (1998). This expectation of privacy may be reduced but not entirely eliminated. See Knights, 534 U.S. at 120-21 (balancing privacy interest of probationer). Pursuant to the \"special needs\" doctrine, a State may require, as an explicitly stated condition of probation, that a probationer's residence may be searched without a warrant. Griffin v. Wisconsin, 483 U.S. 868, 877 (1987). However, the Supreme Court has never held that a parolee can be subjected to a suspicionless search to investigate a pre-parole crime.\n\n1. United States v. Knights\n\nThe opinion closest on point is the Supreme Court's opinion in United States v. Knights, 534 U.S. 112 (2001). That opinion strongly suggests - indeed, almost compels - the conclusion that at least in the absence of an explicitly stated condition of parole providing otherwise, any search of a parolee's residence to investigate a pre-parole crime must be based on at least reasonable suspicion. A California court sentenced Knights to probation subject to the condition \"that Knights would '[s]ubmit his . . . person, property, place of residence, vehicle, personal effects, to search at anytime, with or without a search warrant, warrant of arrest or reasonable cause by any probation officer or law enforcement officer.' \" Id. at 114. Pursuant to this condition, State authorities conducted a warrantless search of Knights's apartment and found evidence of a current crime.\n\nThe search of Knights's apartment was not based on probable cause, but merely on reasonable suspicion of current criminal activity. The Court construed the terms of the explicit probation condition to permit a \"suspicionless search,\" but, because the search in the case was supported by reasonable suspicion, it did not reach the question whether such a suspicionless search condition was valid. Id. at 120 n.6. Nor did the Court reach the question whether Knights's purported consent to a search contained in the explicit conditions of probation was, in and of itself, a valid waiver of his Fourth Amendment rights. Id. at 112.\n\nThe Court did consider the condition of probation a \"salient circumstance\" under a \"totality of the circumstances\" test because it provided notice to Knights of the searches to which he might be subject. Id. at 118. Weighing the probationer's interest in privacy against the government's interest in the intrusion, the Court held that \"the balance of . . . considerations requires no more than reasonable suspicion to conduct a search of this probationer's house.\" Id. at 121 (emphasis added). Using an \"ordinary Fourth Amendment analysis,\" id. at 122, the Court concluded:\n\nAlthough the Fourth Amendment ordinarily requires the degree of probability embodied in the term \"probable cause,\" a lesser degree satisfies the Constitution when the balance of governmental and private interests makes such a standard reasonable. Those interests warrant a lesser than probable-cause standard here. When an officer has a reasonable suspicion that a probationer subject to a search condition is engaged in criminal activity, there is enough likelihood that criminal conduct is occurring that an intrusion on the probationer's significantly diminished privacy interests is reasonable.\n\nId. at 121 (citations omitted) (emphasis added).\n\nIn Knights, the probationer was subject to an explicitly stated condition of probation allowing suspicionless searches of his residence for evidence of current crimes, which the court treated as a \"salient circumstance.\" Id. at 118. In this case, by contrast, Crawford was subject to no explicit condition of parole that allowed suspicionless searches to investigate pre-parole crimes. The argument in favor of the suspicionless search in this case is thus much weaker than in Knights. Not only was Knights subject to an explicit condition of probation; he was also searched for evidence of a current crime. Both of these circumstances indicate that the balance of interests under the \"totality of the circumstances\" would require greater justification for a valid search in Crawford's case than in Knights's.\n\n2. Special Needs Doctrine\n\nJudge Trott contends that the \"special needs\" doctrine allows a suspicionless search in this case. I disagree for two reasons. First, the Supreme Court has authorized suspicionless searches only in a narrowly defined class of cases, where \"special needs\" of the state \"beyond the normal need for law enforcement\" justify the program of searches. Ferguson v. City of Charleston, 532 U.S. 67, 76 n.7 (2001) (quoting New Jersey v. T.L.O., 469 U.S. 325, 351 (1985) (Blackmun, J., concurring)). The purpose of the search here - investigation of a bank robbery that took place over two years earlier clearly served the \"normal need for law enforcement\" to solve past crimes.\n\nSecond, in addition to Knights (discussed above), Judge Trott relies on Pennsylvania Board of Probation \u0026 Parole v. Scott, 524 U.S. 357 (1998), and Griffin v. Wisconsin, 483 U.S. 868 (1987). Scott and Griffin both involved enforcement of explicit conditions of parole or probation. Neither Scott nor Griffin supports the application of a \"special needs\" analysis to uphold a suspicionless search to investigate a pre-parole crime.\n\nIn Scott, an explicit condition of parole prohibited Scott from owning or possessing firearms or other weapons. When firearms, a compound bow, and three arrows were found in his bedroom, his parole was revoked. The Court did not need to reach the question of the constitutionality of the search of Scott's bedroom because its narrow holding that the exclusionary rule did not apply in parole revocation hearings was \"sufficient to decide the case.\" Id. at 362 n.3. Without mentioning the phrase \"special needs,\" the Court wrote, \"[t]he State . . . has an 'overwhelming interest' in ensuring that a parolee complies with [conditions of parole] and is returned to prison if he fails to do so.\" 524 U.S. at 365.\n\nIn Griffin, an explicit condition of probation permitted a warrantless search of probationer Griffin's residence so long as there were \"reasonable grounds\" to believe Griffin possessed contraband. 483 U.S. at 870-71. The Court held that supervision of probationer Griffin was a \" 'special need' of the State permitting a degree of impingement upon privacy that would not be constitutional if applied to the public at large.\" Id. at 875. \"Reasonable grounds,\" as interpreted by the Wisconsin Supreme Court, required less suspicion than probable cause, but more than no suspicion. In Griffin's case, the \"reasonable grounds\" requirement was satisfied by the presence of a detective's tip that contraband might be present. The Court upheld a search of Griffin's residence:\n\nWe think it clear that the special needs of Wisconsin's probation system make the warrant requirement impracticable and justify replacement of the standard of probable cause by \"reasonable grounds,\" as defined by the Wisconsin Supreme Court.\n\nId. at 875-76.\n\nIn this case, by contrast to Scott and Griffin, the State cannot rely on an explicit condition of parole. Without such a condition in the \"Fourth Waiver\" form, we have no formal expression of need - \"special\" or otherwise - by the State. Moreover, the explicit search condition whose constitutionality was sustained in Griffin - based on the State's formal expression of its \"special need\" - did not permit a suspicionless search. It permitted only a search based on \"reasonable grounds.\" Finally, and perhaps most important, the searches in both Scott and Griffin were for evidence of current crimes. By contrast, Crawford's residence was searched because Agent Bowdich was investigating a pre-parole crime. In sum, neither Scott nor Griffin supports allowing a suspicionless search here.\n\n3. Expectation of Privacy\n\nCrawford had a sufficient subjective expectation of privacy, on the facts of this case, that he should be able to enforce the right to privacy to which he is objectively entitled. See California v. Ciraolo, 476 U.S. 207, 211 (1986) (describing a two part inquiry: \"has the individual manifested a subjective expectation of privacy\" and is \"society willing to recognize that expectation as reasonable\"); see also Kyllo v. United States, 533 U.S. 27, 33 (2001) (citing Ciraolo).\n\nCrawford's subjective understanding is somewhat unclear. On the one hand, Crawford testified that as a general matter, \"I just, you know, just took for granted that, you know, I'm on parole, that I don't have no rights at all[.]\" On the other hand, he also twice testified, specifically as to the early morning search actually conducted by Agent Bowdich and his fellow officers, that he was \"in shock\" as a result of the search. Taking these statements together, I conclude that Crawford did not expect the search and detention to which he was subjected.\n\nIt is not unrealistic to expect the State to draft language in a parole condition form with the care customarily used by a competent lawyer; nor is it unrealistic to read language drafted by the State according to the rules of construction ordinarily applied to documents having legal consequence. But it is unrealistic to use legal analysis to interpret a parolee's general oral statement that he \"has no rights at all,\" explaining his decision to acquiesce to apparent police authority, to deprive him of his otherwise applicable Fourth Amendment rights. See United States v. Sandoval, 200 F.3d 659, 660 (9th Cir. 2000) (observing that our court has \"rejected the argument that a person lacks a subjective expectation of privacy simply because he . . . could have expected the police to intrude on his privacy\").\n\n4. Comparable Treatment of Probationers and Parolees\n\nJudge Kleinfeld contends in his separate opinion that probationers and parolees should be treated differently for purposes of probation and parole searches. I disagree. The Court in Knights did not address the question of whether, for purposes of the Fourth Amendment, a probationer and a parolee should be treated comparably. However, other cases by the Court suggest that they should be. See, e.g., Griffin, 483 U.S. at 874 (\"[I]t is always true of probationers (as we have said to be true of parolees) that they do not enjoy 'the absolute liberty to which every citizen is entitled, but only . . . conditional liberty properly dependent on observance of special [probation] restrictions.' \") (quoting Morrissey v. Brewer, 408 U.S. 471, 480 (1972)) (alteration in original). The California Supreme Court invokes the same justifications for conditions of probation and parole, without differentiating between probation and parole. See, e.g., Woods, 981 P.2d at 1027 (probation); Reyes, 968 P.2d at 450 (parole). I agree with Judge Kleinfeld that for some purposes probationers and parolees can be treated differently, but I do not believe that they are different for present purposes. Indeed, we have explicitly stated that probationers and parolees are indistinguishable for purposes of the Fourth Amendment. See Harper, 928 F.2d at 896 n.1 (\"Nor do we see a constitutional difference between probation and parole for purposes of the fourth amendment.\").\n\n5. Fourth Amendment Violation\n\nThe Supreme Court in Knights has told us that the key to a Fourth Amendment analysis is a balancing of interests. \"The touchstone of the Fourth Amendment is reasonableness, and the reasonableness of a search is determined by assessing, on the one hand, the degree to which it intrudes upon an individual's privacy and, on the other, the degree to which it is needed for the promotion of legitimate governmental interests.\" 534 U.S. at 118-19 (citation omitted). Under ordinary circumstances, of course, a residential search must be justified by a warrant based on probable cause. Here, however, Crawford was a parolee, and the State therefore had a greater interest than usual in conducting searches to ensure that Crawford was obeying the law. On the other hand, the \"Fourth Waiver\" form drawn up by the State and signed by Crawford did not assert the right to conduct suspicionless searches of Crawford's residence to investigate pre-parole violations of the law. That is, not only did the State not assert that it needed to conduct such searches in order to \"promot[e] legitimate governmental interests\"; Crawford was also never given notice that he would be subjected to such searches.\n\nGiven the balance of interests - informed by the \"Fourth Waiver\" form that Crawford signed, the inapplicability of the \"special needs\" analysis, Crawford's subjective and objective expectation of privacy, and the comparable treatment of probationers and parolees under the Fourth Amendment - I conclude that Agent Bowdich and his fellow officers needed, at a minimum, \"reasonable suspicion\" to justify their search of Crawford's residence and Crawford's accompanying detention. The sole purpose of the search and detention was to investigate a pre-parole crime, and to justify that search Agent Bowdich needed at least a reasonable suspicion that he would find evidence of that crime. Because Agent Bowdich had no such suspicion, I conclude that the search of Crawford's residence, and the accompanying detention of Crawford during that search, violated the Fourth Amendment.\n\nIII. Attenuation of the Fourth Amendment Violation\n\nUnder established law, evidence obtained through the \"exploitation\" of illegal behavior by the police cannot be admitted into evidence. Brown, 422 U.S. at 599. The question under Brown was whether there had been sufficient \"attenuation\" of the illegality that the evidence obtained could be admitted. The Supreme Court stated that once an illegality has been shown, we must decide whether \"the evidence has been come at by exploitation of that illegality or instead by means sufficiently distinguishable to be purged of the primary taint.\" Id. (quoting Wong Sun, 371 U.S. at 487-88). \"[T]he purpose of this attenuated connection test is to mark the point of diminishing returns of the deterrence principle inherent in the exclusionary rule.\" United States v. Ienco, 182 F.3d 517, 526 (7th Cir. 1999).\n\nWhen the evidence at issue is a confession, the attenuation analysis determines whether the confession is the result of an exploitation of the illegality, or whether it is the result of the defendant's \"free will.\" Dunaway v. New York, 442 U.S. 200, 226 (1979). As we explained in United States v. PerezEsparza, 609 F.2d 1284, 1289 (9th Cir. 1979):\n\nThe \"free will\" of an inculpating defendant is to be considered in light of the twin policies - deterrence and judicial integrity - of the Fourth Amendment's exclusionary rule. It is not enough for Fourth Amendment attenuation that the statement be uncoerced; the defendant's \"free will\" must also be sufficient to render inapplicable the deterrence and judicial integrity purposes that justify excluding his statement.\n\nA determination that a confession was a product of a defendant's \"free will\" under an attenuation analysis is different from a determination that a confession was voluntary under the Fifth Amendment. Dunaway, 442 U.S. at 216-17. A confession can be voluntary under the Fifth Amendment and yet, at the same time, inadmissible into evidence because it is the result of an exploitation of an illegality under a Brown attenuation analysis. Id.\n\nThe Supreme Court has instructed us to look to three factors in performing an attenuation analysis: (1) \"the temporal proximity of the arrest and the confession,\" (2) \"the presence of intervening circumstances,\" and, (3) \"particularly, the purpose and flagrancy of the official misconduct.\" Brown, 422 U.S. at 603-04; see also Taylor v. Alabama, 457 U.S. 687, 690 (1982) (quoting Brown factors); Dunaway, 442 U.S. at 218 (same).\n\nAn analysis of the attenuation factors in this case leads to the conclusion that Crawford's confession should not have been admitted into evidence. The district court found that the first factor, \"temporal proximity,\" favored Crawford. I agree. The \"temporal proximity\" between the search and Crawford's detention at the residence, on the one hand, and Crawford's confession, on the other, was close. The drive to the FBI office took about 20 minutes, and Crawford confessed after about an hour and a half at the office.\n\nThe second factor, \"intervening circumstances,\" also favors Crawford. Intervening circumstances, in the case law, means intervening events. We look at \"intervening events of significance\" that \"render inapplicable the deterrence and judicial integrity purposes that justify excluding [a tainted] statement.\" Perez-Esparza, 609 F.2d at 1289 \u0026 n.3; see also United States v. Ricardo D., 912 F.2d 337, 343 (9th Cir. 1990). Examples of such events include release from custody, an appearance before a magistrate, or consultation with an attorney. See, e.g., United States v. Wellins, 654 F.2d 550, 555 (9th Cir. 1981) (\"The crucial factor in this case is that Wellins was permitted to consult with his attorney.\"). In this case, there were no intervening events. In a continuous, uninterrupted sequence, Agent Bowdich and the other officers conducted the illegal search; detained Crawford during the search; took Crawford to the FBI office; and talked to him in a closed room in the office until he confessed. Nothing else happened. This factor thus clearly cuts in favor of Crawford.\n\nFinally, the third factor, \"the purpose and flagrancy of the official misconduct\" also favors Crawford. Agent Bowdich candidly admitted that the \"purpose\" of his suspicionless search and detention was to get Crawford to confess to the pre-parole bank robbery. Agent Bowdich testified that he conducted the unconstitutional suspicionless search as a \"tool\" to obtain that confession. As we explained in Perez-Esparza, 609 F.2d at 1289, \"[w]hen police purposely effect an illegal arrest or detention in the hope that custodial interrogation will yield incriminating statements, the deterrence rationale for application of the exclusionary rule is especially compelling.\" See also Brown, 422 U.S. at 605 (finding taint of illegal arrest not attenuated when \"[t]he arrest, both in design and in execution, was investigatory. The detectives embarked upon this expedition for evidence in the hope that something might turn up.\"). Because the search was conducted with the purpose of pressuring Crawford to confess, this factor weighs heavily in favor of excluding the confession.\n\nFurther, the official misconduct was \"flagrant.\" At the time of the search, the case law in this circuit required probable cause to justify investigatory searches, whether the crimes being investigated were current or past. See discussion supra Part II.A.2.a. California Supreme Court case law did not (and still does not) authorize suspicionless parole searches to investigate past crimes. Anyone charged with a knowledge of this case law - as Agent Bowdich, an FBI agent, must be should have known at the time that a suspicionless search to investigate a pre-parole crime was not authorized under either our case law or that of the California Supreme Court. Anyone with a knowledge of the case law also should have known that the \"Fourth Waiver\" form signed by Crawford did not authorize a suspicionless search to investigate a pre-parole crime.\n\nAll three attenuation factors clearly favor Crawford. I therefore conclude that his confession, obtained as a result of the illegal suspicionless search of his residence and his accompanying illegal detention, could not properly have been admitted into evidence.\n\nIV. Majority's Analysis\n\nThe majority opinion makes two mistakes. First, it repeatedly characterizes the search by Agent Bowdich and his fellow officers as a \"parole search.\" See, e.g., maj. op. at 8245 and 8246. However, Agent Bowdich's suspicionless search for evidence of a pre-parole crime was not a parole search under California law. This first mistake is not essential to the majority's analysis, however, for the majority is willing to assume that the search and accompanying detention violated the Fourth Amendment.\n\nSecond, the majority relies on New York v. Harris, 495 U.S. 14 (1990), to conclude, incorrectly, that the modern cases in which the Court has performed an attenuation analysis - Brown, Dunaway, and Taylor - do not apply. Unlike the first mistake, this mistake is crucial.\n\nThe majority discusses the search and detention in Crawford's home as if they can be neatly separated for analysis. See, e.g., maj. op. at 8252 (\"The analysis that applies to illegal detentions differs from that applied to illegal searches.\"); id. at 8257-58 (\"Because the search failed to produce any physical evidence, however, and because Defendant made no incriminating statement during the search, we fail to see how the search, as distinct from the presumed illegal detention, caused Defendant's statement in the FBI office.\"). While analyses of illegal searches and seizures can sometimes be kept separate, there is no doubt that an illegal search and an illegal detention both violate the Fourth Amendment. See, e.g., Chandler v. Miller, 520 U.S. 305, 308-09 (1997) (illegal search); Dunaway, 422 U.S. at 287. (illegal seizure). It is a standard police practice to restrict the motion of suspects during a residential search. See, e.g., Michigan v. Summers, 452 U.S. 692, 705 (1981) (Fourth Amendment allows temporary detention of homeowner while police search the house pursuant to a warrant, so long as detention is reasonable); Franklin v. Foxworth, 31 F.3d 873, 875 (9th Cir. 1994) (describing \"custom and practice\" of Portland police to detain occupants of a residence during a search); Wellins, 654 F.2d at 552 (defendant detained while his house was searched). In this case, because the search and detention were carried out simultaneously and with the same goal, Crawford's detention was inseparable from, and ancillary to, the illegal search, and the legality of the search and detention must be analyzed together.\n\nThe attenuation analysis in Brown, Dunaway, and Taylor applies equally to illegal searches and illegal seizures. See Brown, 422 U.S. at 597 (\"In Wong Sun, the Court pronounced the principles to be applied where the issue is whether statements and other evidence obtained after an illegal arrest or search should be excluded.\"). Brown, Dunaway, and Taylor have strikingly similar facts. In all three cases, the defendants were detained without probable cause. In Brown and Taylor, the defendants were formally arrested; in Dunaway, the defendant was not formally arrested. After their illegal detentions, all three defendants confessed. In each case, the Court conducted an attenuation analysis to determine if the confession was the product of the illegal detention.\n\nIn Harris, by contrast, the defendant was arrested with probable cause. The police entered Harris's house without an arrest warrant and arrested him in the house. Because the entry into the house had been accomplished without an arrest warrant, the arrest was illegal under Payton v. New York, 445 U.S. 573 (1980). However, the Court held that since the illegal act - the arrest - had been performed with probable cause and because the illegal arrest had not produced the confession, the confession was not required to be suppressed under Brown, Dunaway, and Taylor. See Harris, 495 U.S. at 21.\n\nIt is uncontested in this case that at the time of the search Agent Bowdich had probable cause to arrest Crawford for the bank robbery. But he never arrested him. That is, he had probable cause to do what he did not do. But he had no probable cause or reasonable suspicion to justify the search and accompanying detention. That is, he had no probable cause to do what he did do. The majority opinion nonetheless concludes that because Agent Bowdich had probable cause to arrest Crawford, the suspicionless illegal search and detention are comparable to the illegal arrest in Harris. I disagree with that conclusion.\n\nFirst, in Harris, the police had probable cause to justify their illegal act - the arrest of Harris. They lacked an arrest warrant, which made Harris's arrest illegal under Payton; but they had probable cause to perform the arrest. In this case, by contrast, Agent Bowdich had no probable cause (or even reasonable suspicion) to justify his illegal acts - the search and accompanying detention. The Supreme Court in Harris stated clearly that the existence of probable cause for the illegal arrest differentiated that case from Brown, Dunaway, and Taylor, where there had been no probable cause for the illegal actions in those cases. It wrote:\n\nIn each of those cases, evidence obtained from a criminal defendant following arrest was suppressed because the police lacked probable cause. The three cases stand for the familiar proposition that the indirect fruits of an illegal search or arrest should be suppressed when they bear a sufficiently close relationship to the underlying illegality.\n\n495 U.S. at 18-19.\n\nSecond, in Harris, there was no causal link between the illegal act (the arrest without a warrant) and Harris's confession. The fact that Harris was illegally arrested in his home made it no more likely that he would confess than if he had been legally arrested with a warrant. The Court in Harris specifically noted the importance of the causal connection between the illegal conduct and the confessions in Brown, Dunaway, and Taylor. The Court wrote:\n\nWe have emphasized . . . that attenuation analysis is only appropriate where, as a threshold matter, courts determine that \"the challenged evidence is in some sense the product of illegal government activity.\" * * *. Harris' statement taken at the police station was not the product of being in unlawful custody. Neither was it the fruit of having been arrested in the home rather than someplace else. * * * We . . . hold that the station house statement in this case was admissible because Harris was in legal custody, . . . and because the statement, while the product of an arrest and being in legal custody, was not the fruit of the fact that the arrest was made in the house rather than someplace else.\n\nId. at 19-20 (citations and quotation marks omitted). In this case, as in Brown, Dunaway, and Taylor, there is a clear causal link between the illegal actions and Crawford's confession.\n\nThe majority opinion, however, concludes that there was no causal link. In part, the majority reaches this conclusion by a divide-and-conquer strategy. It treats the illegal search and detention as if they were two separate events, such that a causal relationship must be established between the illegal search and the confession, and, separately, between the illegal detention and the confession. But these illegal actions were inextricably intertwined. The question therefore must be whether these illegal actions considered together, as they occurred in the real world, were causally connected to Crawford's confession.\n\nIn part, the majority reaches its conclusion by a becausewe-say-so strategy. It simply denies that there was a causal link. But Agent Bowdich's forthright testimony contradicts that conclusion. Agent Bowdich - who was in the best position to know - clearly believed that there was a causal link. As he testified, the illegal search and detention were \"a tool\" to get Crawford to confess. Given Agent Bowdich's clear statement of purpose, as well as the factual narrative of how he accomplished that purpose, it is impossible to conclude that there was no causal link. The degree of the causal connection may be in question; but the fact of that connection cannot be denied.\n\nHarris is premised on there being no causal link at all. Once there is a some kind of a causal connection, Harris no longer governs. In the words quoted by the Court in Harris, the attenuation analysis applies when the challenged evidence is \"in some sense the product of the illegal government activity.\" Harris, 495 U.S. at 19 (citation omitted) (emphasis added). Once there is a causal connection \"in some sense,\" the degree and consequence of that connection is evaluated under the attenuation test of Brown, Dunaway, and Taylor.\n\nThird, and finally, the majority opinion relies on a sentence in Harris to conclude that an attenuation analysis is not required in this case. Maj. op. at 8255-56. I quote that sentence in context:\n\nBecause the officers had probable cause to arrest Harris for a crime, Harris was not unlawfully in custody when he was removed to the station house, given Miranda warnings, and allowed to talk. For Fourth Amendment purposes, the legal issue is the same as it would be had the police arrested Harris on his doorstep, illegally entered his home to search for evidence, and later interrogated Harris at the station house. Similarly, if the police had made a warrantless entry into Harris' home, not found him there, but arrested him on the street when he returned, a later statement made by him after proper warnings would no doubt be admissible.\n\n495 U.S. at 18 (emphasis added to indicate sentence quoted by the majority). Here, the Court is comparing the actual illegal arrest of Harris inside his home to two hypothetical situations. With these hypotheticals, the Court is making the point that there was no causal link between the illegal acts and the subsequent confession. In Harris, the illegal arrest did not produce the confession. See id. at 19 (\"Harris' statement taken at the police station was not the product of being in unlawful custody.\"). In the two hypotheticals, the illegal search and illegal entry did not produce the confession. In other words, the Court was emphasizing the necessity of a causal connection between the illegal act and the confession, and thereby differentiating Harris from Brown, Dunaway, and Taylor, in which there was such a connection. Thus, far from supporting the majority's analysis, the sentence it quotes from Harris serves only to underline the difference between this case and Harris.\n\nIn sum, Agent Bowdich gained a psychological advantage over Crawford through the illegal early morning search of his residence and the illegal detention incident to that search. This advantage would not have been available had Agent Bowdich simply waited until Crawford walked out onto the sidewalk before arresting him. Because Agent Bowdich had no probable cause (or even reasonable suspicion) to justify his illegal acts, and because those illegal acts had the purpose and effect of getting Crawford to confess, this case does not come under the rationale of Harris, but rather under the rationale of Brown, Dunaway, and Taylor. Under those cases, the illegal actions of Agent Bowdich and his fellow officers were not sufficiently attenuated to allow Crawford's confession to be admitted into evidence.\n\nV. Conclusion\n\nIn the end, this is a fairly simple case. Agent Bowdich and his fellow officers conducted a suspicionless search of parolee Crawford's residence, and accompanying detention, to investigate a pre-parole crime. This search and detention violated the Fourth Amendment. The illegal search and detention created circumstances under which Agent Bowdich invited Crawford to talk at the FBI office, where he would be \"more comfortable.\" After an hour and a half in a closed interview room at the FBI office, Crawford confessed to the bank robbery. This illegal search and detention, and subsequent course of conduct, were deliberately, and successfully, undertaken by Agent Bowdich in order to obtain Crawford's confession. That confession was therefore inadmissible.\n\nI respectfully dissent.\n\n\u003cspan class=\"fn\"\u003e1. Although the record does not reflect when the officers holstered their weapons, they apparently did so at some point.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Miranda v. Arizona, 384 U.S. 436, 444-45 (1966).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The dissent quarrels with the label \"parole search,\" which has been used throughout this litigation. Dissent at 8325. In view of the fact that those who conducted the search hoped they might find evidence of current wrongdoing, and believed that their authority to conduct the search arose from the \"Fourth Waiver\" that was a condition of Defendant's parole, see People v. Reyes, 968 P.2d 445, 452-53 (Cal. 1998), we continue to use the same label.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Defendant testified differently about the nature of the conversation in his home but, as we have noted, the district court credited Bowdich-not Defendant -\"where they do disagree\" in their testimony.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The dissent asserts that the majority insists that both an illegal seizure and an illegal search be causally connected to a confession before the exclusionary rule applies. Dissent at 8329. Not so; either kind of causal connection will do, but (as we shall explain) we see neither.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. As defense counsel explained, however, his concession that there was probable cause to arrest did not imply a concession that there was probable cause, or even reasonable suspicion, to search Defendant's home.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. In Dunaway, the defendant was not formally arrested, although the Court went on to hold that the formality of the seizure was not relevant. Dunaway, 442 U.S. at 216. The Court in later cases referred to Dunaway as having been arrested. Taylor, 457 U.S. at 693; Harris, 495 U.S. at 1819.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The officers administered Miranda warnings before questioning Harris in his home. However, as Brown clarified, Miranda warnings do not suffice to purge the taint of police conduct that violates the Fourth Amendment. Brown, 422 U.S. at 605.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. But see Oregon v. Elstad, 470 U.S. 298, 318 (1985) (holding that a later statement was admissible despite illegal detention at home).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. After Reyes, the California Supreme Court added an additional element of protection to a parolee: an officer who attempts to rely on a parole search condition to justify a search must know about that condition before having conducted the search. People v. Sanders, 31 Cal. 4th 318 (2003).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Justices Scalia and Stevens, although concurring in the result in Skinner, dissented in Von Raab. See 489 U.S. at 680. They did so because they could not find a real problem that would be solved by urine testing of Customs service employees. Id. at 686. Here, parole searches are at least a partial solution to the danger, as this case demonstrates. A parole search took an armed bank robber off the streets of San Diego and put him where he belongs.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. New York v. Harris, 495 U.S. 14, 19 (1990).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Pa. Bd. of Parole v. Scott, 524 U.S. 357, 365 (1998).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Parole was abolished in the federal system by the Sentencing Reform Act of 1984, Pub. L. No. 98-473, 98 Stat. 1987, tit. II, ch. II, § 212(a)(2).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. See, e.g., Cal. Penal Code §§ 3000, 3040 et seq. (imposing mandatory parole for persons imprisoned for more than one year).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. See, e.g., U.S.S.G. § 5B1.1 (Imposition of a Term of Probation).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. In the federal system, 18 U.S.C. § 3561(a)(1) prohibits a sentence of probation for individuals who commit Class A or B felonies. But a person who commits a lesser felony may be sentenced to probation if his offense level and criminal history level otherwise place him in Zone A of the Sentencing Table (where the applicable range is 0-6 months), or Zone B and the court also imposes a condition or combination of conditions requiring intermittent confinement, community confinement, or home detention. U.S.S.G. § 5B1.1(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. People v. Reyes, 968 P.2d 445, 450 (Cal. 1998).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. United States v. Parker, 241 F.3d 1114, 1119 (9th Cir. 2001).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. See Thompson, 109 F.3d at 640 (\"We review de novo the court's interpretation of the Guidelines, and its factual determinations for clear error.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. See Parker, 241 F.3d at 1118-19 (failing to articulate a standard of review but according no apparent deference to the district court's decision to apply the enhancement for physical restraint); Thompson, 109 F.3d at 640; see also United States v. Plenty, 335 F.3d 732, 734 (8th Cir. 2003) (\"The district court's imposition of the enhancements is based on factual findings subject to review for clear error. The district court's interpretation of the United States Sentencing Guidelines and application of those Guidelines to the facts of the case are reviewed de novo.\" (internal citations omitted)); United States v. Drew, 200 F.3d 871, 880 (D.C. Cir. 2000) (\"Because the facts on this issue are not significantly in dispute, the issue is primarily a question of law and therefore review closer to de novo is required.\"); United States v. Perkins, 89 F.3d 303, 307 (6th Cir. 1996) (\"Since Perkins challenges only whether the district court properly applied the Sentencing Guidelines and does not challenge the district court's findings of fact, the issues on appeal are questions of law, which we review de novo.\"); United States v. Jones, 32 F.3d 1512, 1517-18 (11th Cir. 1994) (\"Whether a particular Guideline applies to a given set of facts is a legal question subject to de novo review.\"); United States v. Stokley, 881 F.2d 114, 115-16 (4th Cir. 1989) (performing de novo review where the defendant did \"not really attack the factual undergirding of his sentence but rather contend[ed] that his behavior did not fall within the legal definition of the term 'physically restrained' \").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. United States v. Anglin, 169 F.3d 154, 164 (2d Cir. 1999).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Pub.L. No. 108-21, 117 Stat. 650 (Apr. 30, 2003). See United States v. Phillips, 356 F.3d 1086, 1098-1100 (9th Cir. 2004), as amended by ___ F.3d ___, 2004 Daily Journal D.A.R. 5444 (9th Cir. May 06, 2004) (holding that the PROTECT Act amendments to the standard of review apply retroactively).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. 18 U.S.C. § 3742(e).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Koon v. United States, 518 U.S. 81, 99-100 (1996).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Id. at 98.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Id. at 98, 99 (internal quotations omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Id. at 99.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Buford v. United States, 532 U.S. 59, 63-64 (2001).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Id. at 66.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Id. at 64.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Id. at 65.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Id. at 65-66.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. \"Table 2: Guidelines Offenders in Each Circuit and District, Fiscal Year 2001,\" U.S. Sentencing Commission, Sourcebook of Federal Sentencing Statistics, available at http://www.ussc.gov/ANNRPT/2001/ table2.pdf (last visited March 31, 2004).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. \"Table 55: Types of Appeals in Each Circuit and District, Fiscal Year 2001\" U.S. Sentencing Commission, Sourcebook of Federal Sentencing Statistics, available at http://www.ussc.gov/ANNRPT/2001/table55.pdf (last visited March 31, 2004).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. In the 12-month period ending September 30, 2001, the Ninth Circuit commenced 1,150 \"administrative appeals.\" See \"Table B-1 U.S. Courts of Appeals-Appeals Commenced, Terminated, and Pending, by Circuit, During the 12-Month Period Ending September 30, 2001,\" Administrative Office of the United States Courts, Judicial Business of the United States Courts: 2001 Annual Report of the Director, available at http://jnet.ao.dcn/ img/assets/4825/b01sep01.pdf (last visited March 31, 2004).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. Thompson, 109 F.3d at 641.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Parker, 241 F.3d at 1118.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Thompson, 109 F.3d at 641.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. Parker, 241 F.3d at 1118.\u003c/span\u003e\n\n",
    "body_length": 165462,
    "citedas": [
      "372 F.3d 1048",
      "2004 Daily Journal D.A.R. 7423",
      "4 Cal. Daily Op. Serv. 5393"
    ],
    "attorneys": "Counsel Michael J. McCabe, San Diego, California, for the defendant-appellant. David P. Curnow, Assistant United States Attorney, SanDiego, California, for the plaintiff-appellee. Doris A. Calandra, Deputy Attorney General, Sacramento,California, for the intervenor.",
    "category": [
      "36",
      "253"
    ],
    "judges": "Before: Mary M. Schroeder, Chief Judge, andHarry Pregerson, Alex Kozinski, Diarmuid F. O'Scannlain,Stephen S. Trott, Andrew J. Kleinfeld, A. Wallace Tashima,Susan P. Graber, William A. Fletcher, Richard C. Tallman,and Richard R. Clifton, Circuit Judges.",
    "citation_count": 170
  }
}
