{
  "id": "N4ZhP2YBTlTomsSBknfP",
  "document": {
    "title": "Equal Employment Opportunity Commission v. Sears",
    "full_title": "EQUAL EMPLOYMENT OPPORTUNITY COMMISSION CROSS-APPELLEE, v. SEARS, ROEBUCK \u0026 COMPANY CROSS-APPELLANT",
    "jurisdiction": "Seventh Circuit",
    "date": "1988-01-14T00:00:00.000Z",
    "docket": "Nos. 86-1519, 86-1621",
    "body": "WOOD, JR., Circuit Judge.\n\nThese appeals are the outgrowth of protracted litigation stemming from an EEOC commissioner's charge filed against Sears, Roebuck \u0026 Company (Sears) on August 30, 1973. After efforts at settlement and conciliation failed, the EEOC brought suit against Sears on October 22, 1979, alleging several claims of nationwide discrimination against women (and minorities, but those claims were later withdrawn) in employment practices. Before trial the district court denied Sears' motion to dismiss, which was based on several grounds including an assertion that an EEOC attorney who headed the Sears investigation had a conflict of interest because he served on the Board of Directors of the National Organization for Women Legal Defense and Education Fund (LDEF) prior to and at the time NOW filed charges against Sears with the EEOC.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e EEOC v. Sears, Roebuck \u0026 Co., 504 F. Supp. 241 (N.D. Ill. 1980) (Sears I). During the ten-month trial which began September 13, 1984, and consumed 135 trial days,\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e the EEOC sought to prove that Sears engaged in a nationwide pattern or practice of discrimination against women from March 3, 1973 to December 31, 1980, by failing to hire and promote females into commission sales positions on the same basis as males and by paying female checklist management employees less than similarly situated male employees. The district court on January 31, 1986, held for Sears on all claims and also denied the EEOC's outstanding motion for partial summary judgment.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e EEOC v. Sears, Roebuck \u0026 Co., 628 F. Supp. 1264 (N.D. Ill. 1986) (Sears II).\n\nThe EEOC appeals the district court's judgment on the disparate treatment claims and its denial of partial summary judgment regarding a provision that had existed in the Sears Personnel Manual until 1974 allowing a male employee a day off with pay when his wife gave birth.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Sears cross appeals the district court's refusal to dismiss the case on the alleged ground of conflict of interest.\n\nI. DISPARATE TREATMENT -- LEGAL PRINCIPLES\n\nA. Standards of Review\n\nThe EEOC does not challenge the district court's holding that this case involves claims of disparate treatment under Title VII ยง 703(a)(1), 42 U.S.C. ยง 2000e-2(a)(1).\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e To succeed in a claim alleging disparate treatment, the EEOC ultimately had the burden of proving by a preponderance of the evidence that Sears engaged in a \"pattern or practice\" of discrimination against female employees. Bazemore v. Friday, 478 U.S. 385, 106 S. Ct. 3000, 3009, 92 L. Ed. 2d 315 (1986) (per curiam) (Brennan, J., writing for majority, concurring in part). This includes proof of the employer's discriminatory intent, a factor not required in the disparate impact analysis. International Brotherhood of Teamsters v. United States, 431 U.S. 324, 335 n.14, 52 L. Ed. 2d 396, 97 S. Ct. 1843 (1977). Initially the EEOC, as plaintiff, had the burden of establishing a prima facie case that Sears followed an unlawful pattern or practice of discrimination. Id. \"The plaintiffs' prima facie case will thus usually consist of statistical evidence demonstrating substantial disparities in the application of employment actions as to minorities and the unprotected group, buttressed by evidence of general policies or specific instances of discrimination.\" Coates v. Johnson \u0026 Johnson, 756 F.2d 524, 532 (7th Cir. 1985) (footnote omitted).\n\nIf a plaintiff meets that initial burden, the burden then shifts, temporarily, to the \"employer to defeat the prima facie showing of a pattern or practice by demonstrating that the [plaintiffs'] proof is either inaccurate or insignificant.\" Id. The burden shifts only temporarily because, as the Supreme Court explained in Bazemore, 106 S. Ct. at 3008,\n\nif the defendants . . . have responded to the plaintiffs' proof by offering evidence of their own, the factfinder then must decide whether the plaintiffs have demonstrated a pattern or practice of discrimination by a preponderance of the evidence. This is because the only issue to be decided at that point is whether the plaintiffs have actually proved discrimination.\n\nSee also United States Postal Service Board of Governors v. Aikens, 460 U.S. 711, 715, 75 L. Ed. 2d 403, 103 S. Ct. 1478 (1983). Whether the plaintiff has done so \"will depend in a given case on the factual context of each case in light of all the evidence presented by both the plaintiff and the defendant.\" Bazemore, 106 S. Ct. at 3009. In essence, therefore, the factfinder looks at all the evidence, and does not accord any special significance to the fact that the plaintiff initially met its burden of proving a prima facie case. See Aikens, 460 U.S. at 715; Pollard v. Rea Magnet Wire Co., Inc., 824 F.2d 557, 558 (7th Cir. 1987).\n\nThe EEOC has not structured its argument to clearly fit within these principles, which gives the impression that it has a stronger case than it actually does. In presenting its hiring and promotion claims, the EEOC first argues that it has made out a prima facie case, and then contends that Sears failed to rebut that case.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e In addition, the EEOC makes statements such as \"where plaintiffs present a sound statistical prima facie case, there is a substantial burden on the defendant to respond . . . with a more probative analysis.\" Although the district court did find that the EEOC had presented a prima facie case, whether the EEOC actually presented a sound statistical case is questionable. The district court did not find that it had, and we address that issue later. The EEOC implies through the structure of its presentation and statements such as the one quoted above that Sears had a heavy burden to rebut the EEOC's evidence with more compelling evidence and even that Sears had the burden of persuasion. We find no support in the case law for those contentions. It is true that Sears had a rebuttal burden, but to meet that burden, Sears needed only to produce evidence that \"raise[d] a genuine issue of fact as to whether it discriminated.\" Texas Department of Community Affairs v. Burdine, 450 U.S. 248, 254, 101 S. Ct. 1089, 67 L. Ed. 2d 207 (1981). Sears did not have a burden of producing more compelling evidence than did the EEOC. In Teamsters, the Supreme Court stated that an \"employer's defense must . . . be designed to meet the prima facie case of the [plaintiff].\" 431 U.S. at 360 n.46. We noted in Coates that \"'the strength of the evidence the defendant must produce to prevent the plaintiff[s] from carrying the burden of persuasion . . . depends, as in any case, on the strength of the plaintiffs' proof.'\" 756 F.2d at 532 (quoting Segar v. Smith, 238 U.S. App. D.C. 103, 738 F.2d 1249, 1268 (D.C. Cir. 1984), cert. denied, 471 U.S. 1115, 105 S. Ct. 2357, 86 L. Ed. 2d 258 (1985)). Whatever the nature of the defendant's evidence, \"the defendant need not carry the burden of persuasion as to the nonexistence of a disparity.\" Segar, 738 F.2d at 1268. The EEOC could not necessarily rest on its showing of a prima facie case. As we noted above, once a defendant \"respond[s] to the plaintiffs' proof by offering evidence of [its] own,\" Bazemore, 106 S. Ct. at 3008, the fact that the plaintiff proved a prima facie case is of no continuing consequence. \"The ultimate burden of persuading the trier of fact that the defendant intentionally discriminated against the plaintiff remains at all times with the plaintiff.\" Burdine, 450 U.S. at 253; see Bazemore, 106 S. Ct. at 3008.\n\nThe district court's determination as to whether the plaintiff has proved discrimination by a preponderance of the evidence \"is subject to the clearly erroneous standard on appellate review.\" Bazemore, 106 S. Ct. at 3008. The district court's factual findings underlying that ultimate determination are also subject to the clearly erroneous standard. Under that standard, \"'[a] finding is \"clearly erroneous\" when although there is evidence to support it, the reviewing court on the entire evidence is left with the definite and firm conviction that a mistake has been committed.'\" Anderson v. City of Bessemer City, 470 U.S. 564, 573, 84 L. Ed. 2d 518, 105 S. Ct. 1504 (1985) (quoting United States v. United States Gypsum Co., 333 U.S. 364, 395, 92 L. Ed. 746, 68 S. Ct. 525 (1948)). We may have such a conviction if \"the trial judge's interpretation of the facts is implausible, illogical, internally inconsistent or contradicted by documentary or other extrinsic evidence.\" Ratliff v. City of Milwaukee, 795 F.2d 612, 617 (7th Cir. 1986). \"If the district court's account of the evidence is plausible in light of the record viewed in its entirety, the court of appeals may not reverse it even though convinced that had it been sitting as the trier of fact, it would have weighed the evidence differently.\" Anderson, 470 U.S. at 573-74. In addition \"where there are two permissible views of the evidence, the factfinder's choice between them cannot be clearly erroneous.\" Id.; see Boxhorn's Big Muskego Gun Club, Inc. v. Electrical Workers Local 494, 798 F.2d 1016, 1018 (7th Cir. 1986).\n\nThe district court in this case made a multitude of factual findings. Some of those findings rested on determinations of the credibility of various witnesses, and some were based on the district court's evaluation of statistical evidence. We accord even more deference to the district court's findings based on evaluations of those types of evidence. In Anderson, 470 U.S. at 575, the Supreme Court noted that \"when findings are based on determinations regarding the credibility of witnesses, Rule 52(a) demands even greater deference to the trial court's findings; for only the trial judge can be aware of the variations in demeanor and tone of voice that bear so heavily on the listener's understanding of and belief in what is said.\" A finding that is \"purportedly based on a credibility determination\" may be clearly erroneous, however, if documents or objective evidence \"contradict the witness' story; or the story itself may be so internally inconsistent or implausible on its face that a reasonable factfinder would not credit it.\" Id. at 575; see Wheeler v. Snyder Buick, Inc., 794 F.2d 1228, 1232 (7th Cir. 1986).\n\nWe must also defer to the district court to a certain extent regarding the court's factual findings based on statistical evidence. As the district court noted, \"virtually all the proof offered by the EEOC in this case is statistical in nature, or related to the statistical evidence.\" Sears II, 628 F. Supp. at 1285. We stated in Soria v. Ozinga Brothers, Inc., 704 F.2d 990, 995 n.6 (7th Cir. 1983), that \"especially where statistical evidence is involved, great deference is due the district court's determination of whether the resultant numbers are sufficiently probative of the ultimate fact in issue.\" In Soria, which involved, as did this case \"a Babel of competing experts, contradictory statistical demonstrations, and diametrically opposed accounts of crucial events,\" the court found it necessary to \"wholly defer to the district court's assessment of the credibility of both lay and expert witnesses and [had to] only disturb its resolution of dissonant evidence if that resolution is manifestly erroneous.\" Id. We follow suit in this case, as the district court had to resolve the \"contradictory statistical demonstrations\" proffered by the primary statistical experts for each side -- Dr. Bernard R. Siskin for the EEOC and Dr. Joan G. Haworth for Sears. These two witnesses together produced 5,275 pages of trial testimony. The judge specifically stated regarding this testimony that \"the credibility of statistical experts and the weight to be given their testimony were . . . of great importance.\"\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Sears II, 628 F. Supp. at 1279 \u0026 n.2.\n\nB. Absence of Individual Victim Testimony\n\nRegarding all major claims at issue -- hiring, promotion and compensation -- the district court found that EEOC's failure to present testimony of any witnesses who claimed that they had been victims of discrimination by Sears confirmed the weaknesses of the EEOC's statistical evidence. The EEOC, conceding it did not present any witnesses who testified to individual acts of discrimination,\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e argues that the district court gave undue weight to the absence of individual victim testimony. The EEOC cites Bazemore v. Friday, 478 U.S. 385, 106 S. Ct. 3000, 92 L. Ed. 2d 315 (1986), International Brotherhood of Teamsters v. United States, 431 U.S. 324, 52 L. Ed. 2d 396 (1977), and Hazelwood School District v. United States, 433 U.S. 299, 53 L. Ed. 2d 768, 97 S. Ct. 2736 (1977), for the proposition that individual victim testimony is unnecessary. We agree that those cases did not hold that individual victim testimony is necessary to support a finding of intentional discrimination in violation of Title VII. See Hazelwood, 433 U.S. at 307-08; Teamsters, 431 U.S. at 339. Neither did the district court in this case. We believe the district court accorded this lack of evidence the proper weight. We acknowledge that in Hazelwood School District, 433 U.S. at 307-08, the Supreme Court held that \"where gross statistical disparities can be shown, they alone may in a proper case constitute prima facie proof of a pattern or practice of discrimination.\" The Court had earlier recognized in Teamsters, 431 U.S. at 339, however, that individual victim testimony is useful to bring \"cold numbers convincingly to life.\" This court has recognized that \"examples of individual discrimination are not always required, but we think that the lack of such proof reinforces the doubt arising from the questions about validity of the statistical evidence.\" Griffin v. Board of Regents, 795 F.2d 1281, 1292 (7th Cir. 1986). Similarly, in Garcia v. Rush-Presbyterian-St. Luke's Medical Center, 660 F.2d 1217, 1225 (7th Cir. 1981), we stated:\n\nWe find very damaging to plaintiffs' position the fact that not only was their statistical evidence insufficient, but that they failed completely to come forward with any direct or anecdotal evidence of discriminatory employment practices by defendants. Plaintiffs did not present in evidence even one specific instance of discrimination. There was no individual to testify how defendant discriminated against him.\n\nSee also Rossini v. Ogilvy \u0026 Mather, Inc., 798 F.2d 590, 604 (2d Cir. 1986) (\"In evaluating all of the evidence in a discrimination case, a district court may properly consider the quality of any anecdotal evidence or the absence of such evidence.\" (citing EEOC, 628 F. Supp. at 1278 n.2)).\n\nThe district court properly recognized the value of anecdotal evidence when it determined that lack of individual victim testimony reinforced its conclusions regarding the deficiencies in the EEOC's statistical evidence. Segar v. Smith, 238 U.S. App. D.C. 103, 738 F.2d 1249, 1278 (D.C. Cir. 1984), cert. denied, 471 U.S. 1115, 105 S. Ct. 2357, 86 L. Ed. 2d 258 (1985), is not to the contrary. In Segar, the District of Columbia Circuit stated that \"when a plaintiff's statistical methodology focuses on the appropriate labor pool and generates evidence of discrimination at a statistically significant level, no sound policy reason exists for subjecting the plaintiff to the additional requirement of either providing anecdotal evidence or showing gross disparities.\" Id. at 1278. In this case the district court considered the lack of anecdotal evidence only after finding there were major problems with the EEOC's labor pool and determining that the EEOC's statistical evidence was severely flawed. This is in accord with the District of Columbia Circuit's statement in Valentino v. United States Postal Service, 218 U.S. App. D.C. 213, 674 F.2d 56, 69 (D.C. Cir. 1982), that \"when the statistical evidence does not adequately account for 'the diverse and specialized qualifications necessary for [the positions in question],' strong evidence of individual instances of discrimination becomes vital to the plaintiff's case.\" (bracketed material in original) (quoting Wilkins v. University of Houston, 654 F.2d 388, 410 (5th Cir. Unit A Dec. 1981), vacated, 459 U.S. 809, 103 S. Ct. 34, 74 L. Ed. 2d 47 (1982)). When experts disagree, as they did here, the court may need the help of live witnesses to relate their actual experiences.\n\nThe EEOC's reasons for not presenting such individual testimony are not satisfying. The EEOC argues that such evidence would be \"inappropriate\" because \"where 47,000 hires and promotions were at issue . . . it would have been impossible to present enough individual demonstrations [sic] of discrimination to meaningfully reflect on the statistics.\" We do not agree that examples of individual instances of discrimination must be numerous to be meaningful. Even a few examples would have helped bring \"cold numbers convincingly to life.\" Teamsters, 431 U.S. at 339. Furthermore, we agree with the district judge that considering the ten-year length of the lawsuit and the amount of investigation by the EEOC and information passed by Sears to the EEOC, it is difficult to see how the EEOC could fail to \"identify at least some members of the alleged huge class of victims it purports to represent.\" Sears II, 628 F. Supp. at 1325 \u0026 n.82. The EEOC also argues that an individual applicant would not know if she had been discriminated against. While this speculative argument may be more apt for the hiring situation, in which an applicant may not know whether there was a vacancy or the qualifications of other persons who were hired, we agree with the district judge that in the area of promotions and compensation at least, the number of Title VII suits filed by individuals against employers in general \"seems to fairly refute EEOC's contention.\" Id.\n\nII. DISPARATE TREATMENT -- HIRING AND PROMOTIONS\n\nThe EEOC argues that the district court erred in determining that it did not show a pattern or practice of discrimination by Sears against women in hiring and promotions into commission sales positions.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e We base our decision on the well-reasoned and comprehensive opinion of the district court, see Sears II, 628 F. Supp. at 1277, and address the principal and dispositive issues raised by the parties. Although in Coates v. Johnson \u0026 Johnson, 756 F.2d 524, 533 (7th Cir. 1985), this court briefly reviewed all the evidence in that disparate treatment case, it is not expedient or necessary to do so here, considering the variety and amount of statistical and nonstatistical evidence and the detailed summary of all the evidence by the district court in its opinion on the merits. Although we consider all the evidence, we will review the evidence here only to the extent necessary to consider the EEOC's contentions that the district court has clearly erred in reaching various factual findings.\n\nThe nature of the evidence presented by each party in this case was significantly different. It is helpful to briefly overview the types of evidence presented by the parties. The EEOC presented, almost exclusively, statistical evidence in the form of regression analyses based on information from employment applications of rejected sales applicants and Sears' computerized payroll records from 1973 through 1980. The EEOC based other regression analyses on information from Applicant Interview Guides Sears had administered at various times from 1978 through 1980 at two Sears stores in its Southwestern Territory. The EEOC attempted to bolster this statistical evidence through nonstatistical evidence regarding the subjective nature of Sears' selection process and allegedly discriminatory aspects of Sears' testing practices.\n\nSears did not respond with like regression analyses based on employment application and payroll records. Instead, most of Sears' evidence was directed at undermining two assumptions Sears claimed were faulty and fatal to the validity of the EEOC's statistical analysis -- the assumptions of equal interests and qualifications of applicants for commission sales positions. This evidence consisted of testimony by Sears store managers, personnel managers, and other store officials, a study based on interviews of women in nontraditional jobs at Sears, national surveys and polls regarding the changing status of women in American society, morale surveys of Sears employees and 1976 and 1982 job interest surveys of Sears employees, national labor force data, and an analysis of the Applicant Interview Guides that attempts to measure differences in interest among men and women. Sears also presented evidence regarding its hiring figures, general evidence regarding the characteristics of commission salespersons including a case study of all commission sales hires in all stores, based on information in personnel files of applicants who were hired and sales performance data, evidence regarding the employment milieu at Sears, especially relating to commission selling and the structure of Sears, and evidence regarding its affirmative action efforts.\n\nRegarding the claim of discrimination in promotions, the EEOC again relied almost totally on regression analyses based on female proportions of noncommission salespersons in each store at the end of a year compared with the proportion of women actually hired into commission sales. Sears again relied on the evidence relating to interest, the nature of commission sales, characteristics of commission salespeople, and its affirmative action efforts. In addition, Sears introduced further evidence of interest in the form of responses to Career Aspirations Questionnaires it had administered to noncommission salespersons, and performed various adjustments of the EEOC's statistical analysis.\n\nEach side featured one primary expert on statistical evidence -- the EEOC starred Dr. Bernard R. Siskin in this role, while Sears was represented by Dr. Joan G. Haworth.\n\nThe EEOC argues that Sears' \"generalized interest evidence\" is inadequate as a matter of law to refute the EEOC's statistical presentation. We have already partially discussed this argument in the context of the burdens of proof, but there is another aspect of this argument. The EEOC implies that Sears had the burden of responding with a more probative statistical analysis. The Supreme Court in Teamsters specifically stated, however, that \"we do not . . . suggest that there are any particular limits on the type of evidence an employer may use.\" 431 U.S. at 360 n.46. An employer may attempt to show that plaintiffs' proof is \"either inaccurate or insignificant,\" id. at 360, or the plaintiff may attempt to provide a \"nondiscriminatory explanation for the apparently discriminatory result.\" Id. at 361 n.46. Then-Justice, now Chief Justice Rehnquist, concurring in Dothard v. Rawlinson, 433 U.S. 321, 338-39, 53 L. Ed. 2d 786, 97 S. Ct. 2720 (1977), stated that defendants in a discrimination case \"may endeavor [in rebuttal] to impeach the reliability of the statistical evidence, they may offer rebutting evidence, or they may disparage in arguments or in briefs the probative weight which the plaintiffs' evidence should be accorded.\" See also Catlett v. Missouri Highway \u0026 Transportation Commission, 828 F.2d 1260, 1266 (8th Cir. 1987) (defendant may introduce evidence that a lesser interest in certain jobs on part of female applicants explains statistical disparity); Segar v. Smith, 238 U.S. App. D.C. 103, 738 F.2d 1249, 1268 (D.C. Cir. 1984) (defense \"typically . . . will focus on the integrity of the plaintiffs' statistical methodology and the significance of the results shown\"), cert. denied, 471 U.S. 1115, 105 S. Ct. 2357, 86 L. Ed. 2d 258 (1985). \"The defendants' rebuttal must . . . at least raise a genuine issue of material fact concerning the accuracy of the picture painted by the plaintiffs' statistics.\" Segar, 738 F.2d at 1268. The cases cited by the EEOC to support its argument that Sears had the burden of rebutting its statistical analysis with more \"refined, accurate and valid\" statistical evidence did not state that the defendant must produce such evidence to succeed in rebutting the plaintiffs' case. Instead, those cases indicated that a defendant could or \"was entitled to\" use such a means of rebuttal. See Shidaker v. Carlin, 782 F.2d 746, 750 (7th Cir. 1986), vacated, 481 U.S. 1001, 107 S. Ct. 1621, 95 L. Ed. 2d 195 (1987); Movement for Opportunity \u0026 Equality v. General Motors Corp., 622 F.2d 1235, 1245 (7th Cir. 1980). These cases involve disparate impact claims -- without deciding whether these principles are applicable in a disparate treatment case, we can say that EEOC misconstrues the principles. These cases suggest, and the cases we have cited above confirm, that statistical evidence is only one method of rebutting a statistical case. Cf. Teamsters, 431 U.S. at 340 (\"Statistics are not irrefutable; they come in infinite variety and, like any other kind of evidence, they may be rebutted. In short, their usefulness depends on all of the surrounding facts and circumstances.\"). We therefore reject the EEOC's contention that Sears' interest evidence, consisting of testimony of Sears' store witnesses, external labor force data, national survey data, and data from surveys of Sears' employees, is insufficient as a matter of law to undermine the EEOC's statistical evidence.\n\nBefore we discuss the specifics of the EEOC's challenges to the district court's findings regarding the EEOC's hiring and promotion claims, we address the EEOC's arguments that the district court erred as a matter of law in analyzing those claims. The EEOC contends that the district court erred as a matter of law by failing to address separately a period of liability the EEOC terms \"the early years.\" Second, the EEOC argues that the court erred by not considering its claims of discrimination regarding part-time hires separately from its claims of discrimination regarding full-time hires.\n\nA. Early Years\n\nThe EEOC argues that the district court erred as a matter of law by failing to address separately what the EEOC terms \"the earlier years\" at issue in its hiring and promotion into commission sales claims. In support of this argument, the EEOC cites various cases it says stand for the proposition that \"the law clearly requires that a defendant's employment practices prior to its taking corrective action be examined separately.\" We do not read the cases as supporting that particular proposition. Instead, we believe the cases hold, at most, that an employer's corrective action does not absolve the employer from liability based on discriminatory practices occurring before the employer took the corrective action. See Teamsters, 431 U.S. at 341-42; Rich v. Martin Marietta Corp., 522 F.2d 333, 346 (10th Cir. 1975); Parham v. Southwestern Bell Telephone Co., 433 F.2d 421, 425-26 (8th Cir. 1970); Patterson v. Youngstown Sheet \u0026 Tube Co., 440 F. Supp. 409, 412-13 (N.D. Ind. 1977) (defendant employer not permitted to combine statistics for precharge and post-charge periods, because \"actions taken subsequent to the filing of E.E.O.C. charges cannot moot issues of discrimination occurring prior to that time\"), aff'd, 659 F.2d 736 (7th Cir.), cert. denied, 454 U.S. 1100, 102 S. Ct. 674, 70 L. Ed. 2d 641 (1981); cf. Capaci v. Katz \u0026 Besthoff, Inc., 711 F.2d 647, 655-57 (5th Cir. 1983), cert. denied, 466 U.S. 927, 104 S. Ct. 1709, 80 L. Ed. 2d 182 (1984). These cases are all characterized by an assumption that employer practices in existence before some form of \"corrective action\" (usually occurring after Title VII charges were filed against the employer) were in fact discriminatory.\n\nThe district court in this case, however, never found that Sears engaged in discriminatory hiring and promotion practices before the EEOC filed charges or before Sears began affirmative action efforts. The district court also never held that Sears' later policies and programs absolved Sears of any liability for earlier discriminatory practices. Instead, the district court found that the EEOC's statistics failed to prove liability for any period at issue in this case and that Sears' affirmative action efforts began as early as 1968, well before the EEOC's August 1973 charge.\n\nThe EEOC's challenge is thus not that the district court erred as a matter of law. Its argument is more properly characterized as a claim that the court incorrectly failed to make two factual findings, either finding of which should have led the district court to consider the \"early years\" separately from the later period. One of those findings the EEOC claims the district court erred in not making was that there were significant differences between the \"early years\" and the later years in the liability period of 1973 to 1980. The second finding would have been that Sears adopted the Mandatory Achievement of Goals (MAG) affirmative action plan in response to the EEOC's charge, or that Sears designed the MAG program as a corrective action to \"bless\" earlier discriminatory practices. On review of factual findings, we will uphold the district court's findings unless they are clearly erroneous. See Anderson v. City of Bessemer City, 470 U.S. 564, 573, 84 L. Ed. 2d 518, 105 S. Ct. 1504 (1985); Andre v. Bendix Corp., 774 F.2d 786, 788 (7th Cir. 1985). We are not persuaded that the district court's failure to make either of the above findings was clear error.\n\nThe EEOC claims that during the \"early years\" \"there were fundamental changes in Sears' practices regarding the hiring and promotion of women into commission sales positions.\" The EEOC then cites statistics indicating that in various sales departments (e.g., auto accessories or furniture), percentages of commission saleswomen doubled, tripled, quadrupled, or increased up to eightfold during various \"early\" periods. Initially, we note that the district court found that all of the EEOC statistics were plagued by arbitrary and false assumptions. We discuss these statistical defects in more detail later. Because we find that the district court did not err in its criticisms of the EEOC's statistics, we cannot accept the EEOC's argument that those statistics indicated differences that the district court should have recognized by separating \"early years\" from later years.\n\nEven if the district court had found the EEOC's underlying statistics sound, we are not convinced by the EEOC's arguments that the district court should have recognized differences between \"early years\" and some later period. First, we are unsure what the EEOC means by the term \"early years,\" because the EEOC never specifically defined that term. The district court designated the liability period as beginning March 3, 1973 and ending in 1980. At various points in its argument, the EEOC suggests that the \"early years\" is a period from 1972 (the year before the EEOC charge was filed) to 1975 (two years after the charge was filed), the period before August 30, 1973 (when the EEOC filed charges), a period from 1973 to 1975, or the period before the summer of 1974 (when Sears implemented the MAG program).\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Because the EEOC ultimately wants to argue that it can show that Sears discriminated before the implementation of its affirmative action program by separating the figures before and after implementation of affirmative action, we believe the EEOC means the \"early years\" as the beginning of the liability period, which the district court found was March 30, 1973, to the implementation of the MAG program in the summer of 1974.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Assuming that this fifteen- to sixteen-month period constitutes the \"early years,\" we are not convinced by the EEOC's arguments and statistics that the district court erred by failing to recognize significant differences between this period and the years following it.\n\nThe EEOC did not emphasize this period in its complaint, nor did it present data corresponding to this fifteen- to sixteen-month period that it now claims should have been considered separately. Neither did it attempt to distinguish data for promotions and hires during this period from data for promotions and hires during the time beginning after the \"early years\" ended. Instead, the statistics it cites to us on appeal (which were also presented to the district court) as indicating \"dramatic changes\" in hiring and promotion encompass periods before and after the \"early years.\" The EEOC presented data on promotions and hires broken down by year, beginning with 1972.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Its figures for 1973 thus included two months of hires and promotions before the relevant liability period began, and its data for 1974 included five to six months of hires and promotions that occurred after the MAG plan was implemented.\n\nThe data compiled and presented to this court by the EEOC are misleading as well as imprecise. The EEOC, in citing statistics it says show \"dramatic increases\" during the \"early years,\" does not carefully recognize or refer to that time period. For example, it states that between 1972, the year before the EEOC charge was filed, and 1975, two years after the charge was filed, the female proportion of full-time commission sales hires more than tripled (from 9.9 % to 31.1 %) and in breaking down the figures by division, that in Sewing Machines, during this three-year period, the female proportion of full-time hires almost tripled (from 13.5 % to 47.9 %) and in Furniture, it more than quadrupled between 1972 and 1974 alone (8.1 % to 33.8 %) and had increased more than fivefold (to 43.0 %) by 1976. These statistics obfuscate increases that took place during the \"early years,\" before the implementation of the MAG plan. Although the EEOC claimed that the female percentage of sales hires \"more than tripled\" between 1972 and 1975, the same percentage nearly doubled between 1972 and 1973. Analysis by division of products is similarly misleading -- percentages of Sewing Machines hires that the EEOC says \"almost tripled\" between 1972 and 1975 more than doubled between 1972 and 1973 and percentages for the Furniture division that \"more than quadrupled\" between 1972 and 1974 tripled between 1972 and 1973.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nSome of the statistics the EEOC cites are for a time period that approximates the \"early years,\" but fail to support its argument that there were differences before and after implementation of the MAG plan. The EEOC claimed that between 1973 and 1974 alone, which would be during the \"early years\" period, the female percentage of hires more than tripled in Hardware and increased almost twenty times in Plumbing and Heating (the latter figure almost trebling by the next year). Other EEOC compilations of statistics are misleading for different reasons. The EEOC claims that the female percentage of commission sales hires for part-time outside the Midwestern Territory more than doubled between 1972 and 1975. A close look at the data indicates that the percentage was increasing steadily from 1972 to 1974, including during 1973-1974, which is fairly close to the \"early years\" period at issue. While some of the data seems to support the \"differences\" claimed by the EEOC -- for example, the female percentage in Auto Accessories increased more than eightfold between 1972 and 1974 and more than twelvefold between 1972 and 1975 -- the difference in percentage increases between 1972-1974 and 1974-1975 is not as great as the EEOC's compilation of data suggests. In short, the EEOC's attempts to show significant differences between pre-MAG and post-MAG percentages of female workers are insufficient to persuade us that the district court clearly erred in failing to recognize the alleged increases by considering the \"early years\" separately.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nThe second aspect of the EEOC's claim that the district court should have separately considered the \"early years\" is that the district court clearly erred in failing to find that Sears' implementation of the MAG plan was corrective action taken by Sears in response to the EEOC's charges to escape liability for its earlier discrimination. The district court found, however, that Sears' commitment to affirmative action began in 1968, Sears in 1969 set a long-term goal of 38 % women at all jobs at Sears, and in April 1970, \"Sears instituted a centralized, company-wide affirmative action program for women and minorities,\" which was revised in 1972. Sears II, 628 F. Supp. at 1293. The EEOC argues that nothing in the record supports the district court's findings that \"attracting women to commission sales at Sears has been an important priority in Sears' affirmative action program since the first affirmative action questionnaire was circulated in 1968\" and that Sears had engaged in pre-MAG efforts to hire or promote women into commission sales. Yet the EEOC acknowledges that in 1972 Sears' affirmative action plan mentioned the movement of women into commission sales positions. The year 1972 is pre-MAG, because, as the court found, MAG was implemented in mid-1974. The EEOC also fails to refute the district court's finding that Sears set a long-term goal of 38 % women at all jobs at Sears in 1969 -- presumably \"all jobs\" includes commission sales jobs.\n\nThe EEOC attempts to characterize the MAG plan as a response to its charge against Sears by quoting the remarks of Sears Chairman Arthur M. Wood at a meeting of top executives to discuss affirmative action. Wood stated:\n\nThe fact is that Sears has been identified as a target by the [Equal Employment Opportunity] Commission and we must improve our situation quickly in order to be in as defensible position as possible -- to do this I want to urge our lawyers and others working on discrimination cases to conciliate every possible claim; in short, we should stay out of court and out of direct confrontation with enforcement agencies as long as possible, giving our program of voluntary action time to show meaningful progress for minorities and women.\n\nThis remark, however, is not proof that Sears implemented MAG in response to the EEOC's charge. The remark was made May 21, 1973, more than three months before the charge was filed. On its face the remark indicates nothing more than that Sears was aware of potential EEOC action, although the EEOC claims that Wood had been informed by Ray J. Graham, Sears' Director of Equal Opportunity from 1968 through 1980, of the likelihood of the EEOC's bringing a National Programs charge against Sears. Other evidence is consistent with the court's finding that Sears' affirmative action efforts began in 1968. Graham testified, \"I can't emphasize too strongly that it was not the threat of EEOC action that caused Sears to [adopt the MAG plan],\" and stated that at the time of the meeting he had no knowledge of any EEOC \"targeting\" of Sears. Graham further testified that the MAG program was designed to \"accelerate [Sears'] progress\" and continue Sears' \"leadership\" role in affirmative action, and that Sears had \"one [affirmative action] plan from the very outset [in 1968].\" Furthermore, the EEOC never identified at trial the policies or practices of the MAG plan that allegedly changed the disparities generated by its statistical analyses. Apart from saying that MAG was \"materially different\" from earlier affirmative action programs, the EEOC does not state what the changed practices were. The EEOC has not persuaded us that the district court clearly erred in finding that Sears' affirmative action commitment began in 1968. We hold that the court did not err in not considering the \"early years\" separately.\n\nB. Part-Time\n\nThe EEOC also argues that the district court erred as a matter of law in failing to consider the EEOC's claims of discrimination regarding part-time hires separately from its claims regarding full-time hires. The EEOC cites no authority for this proposition, but argues that separate consideration of part-time from full-time is compelled by \"significant differences between part time and full time hires.\" This is not a question of law; rather, the EEOC must be arguing that the district court clearly erred in failing to find the alleged fact that differences between part-time and full-time hires were significant enough to warrant separate discussion of the part-time figures. One difference, according to the EEOC, is that the mix of products sold was different between full-and part-time, which the EEOC claims is significant because \"the court based much of its opinion on the nature of the products sold.\" The other difference mentioned by the EEOC is that Siskin's multicell analysis produced larger disparities for part-time hires than for full-time hires.\n\nThe district court did not, as the EEOC appears to suggest, ignore or never consider part-time figures. Neither did it completely subsume the part-time within the full-time case. At various points in its opinion the court referred to part-time data and disparities as distinct from full-time data and disparities. It appears that the court did refer to the full-time case more than it did the part-time case, but that may be explained by the fact that the full-time case was emphasized more at trial.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Indeed, the court explicitly stated that \"full time and part time positions . . . were . . . analyzed separately [by the parties]. The court will structure its analysis accordingly.\" Sears II, 628 F. Supp. at 1288.\n\nAlthough the EEOC analyzed part-time figures separately from full-time figures, it employed the same mode of analysis to part-time and full-time data. Thus the part-time statistics were subject to the same criticisms by the district court as were the full-time statistics. We address these flaws recognized by the district court in more detail later. At this point it is sufficient to note that the part-time analyses, like the full-time analyses, are fraught with design flaws as well as a failure to capture differences in male and female interests and qualifications. In addition, Sears' defense of affirmative action applied to both full- and part-time analyses. To the extent that the part-time figures as well as the full-time figures are misleading and imprecise, the EEOC's claim that differences between part-time and full-time disparities were significant enough to warrant separate consideration of the part-time disparities is without merit.\n\nThe EEOC also argues that the district court impermissibly failed to recognize a distinction between part-time and full-time hires based on differences in product lines. The EEOC criticizes two of the district court's statements that give the impression, according to the EEOC, that the district court believed commission selling involved solely \"big ticket\" items such as major appliances. Such an impression would lead to false conclusions according to the EEOC, because commission selling involved smaller items like shoes as well as big ticket items like furnaces, and \"big ticket\" product lines were a small part of part-time hires compared with smaller product lines like shoes.\n\nWe are unconvinced that the district court clearly erred in failing to recognize a distinction between part-time and full-time figures based on certain product lines in commission sales. First, we do not believe as the EEOC claims, \"the court based much of its opinion on the nature of the products sold.\" The two statements cited by the EEOC in support of its claim are \"commission selling usually involved 'big ticket' items, meaning high-cost merchandise, such as major appliances, furnaces, air conditioners, roofing, tires, sewing machines, etc.,\" Sears II, 628 F. Supp. at 1289, and \"the product lines into which 95 percent of Sears' full time commission salespersons were hired included such items as hardware, building supplies, paint and appliances.\" Id. at 1313 n.58. These statements do not exclude product lines in which the EEOC claims there was a more persuasive part-time case. Second, these statements are insufficient to convince us that the nature of the products sold was crucial to the district court's reasoning. These are two statements in a seventy-six-page published opinion. We do not believe that the district court failed to address the EEOC's claims of discrimination against part-time employees.\n\nC. Hiring\n\nThe district judge found a plethora of problems in the statistical analyses that the EEOC had offered to support the claim that Sears discriminated against women in hiring into commission sales positions from 1973 to 1980. Before addressing the EEOC's specific challenges to the district court's criticisms of its statistical evidence, it is helpful to discuss three key findings made by the district court, which we believe are not clearly erroneous. Those findings are that during the period at issue in this case (1973-1980): (1) commission selling was significantly different from noncommission selling at Sears; (2) women were not as interested in commission selling as were men; and (3) women were not as qualified for commission selling as were men.\n\nThe finding that colors the district court's entire treatment of the EEOC's hiring as well as its promotion claims is that selling on commission at Sears is a very different job from \"regular,\" or noncommission selling at Sears. We cannot say that finding is clearly erroneous. The court's description of commission and noncommission selling at Sears indicates that the two forms of selling differed in the type of merchandise sold, the risk involved, which was reflected in the manner of compensation, and the technical knowledge, expertise, and motivation involved. The district court describes the differences at length, see Sears II, 628 F. Supp. at 1289-90, thus we need only mention major differences. As the district court found, commission selling at Sears usually involved selling \"big ticket\" items, which are high-cost merchandise such as major appliances, furnaces, roofing, and sewing machines. Merchandise sold on a noncommission basis understandably was generally low-cost and included apparel, paint, and cosmetics. Commission selling involved some risk, especially before 1977. During that period commission salespersons generally received a commission ranging from 6 % to 9 % percent plus a \"draw\" each week. The draw usually did not exceed 70 % of average or estimated earnings, but was subject to reduction if the employee's commission did not equal the amount of the draw. There was always a risk that the employee could lose some of the draw if the commissions did not equal the amount of the draw.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e After 1977, commission salespersons no longer faced deficits. In what the court noted was an effort \"to reduce the financial risk of selling on commission in an effort to attract more women to commission sales,\" Sears paid commission salespersons a nominal salary plus a 3 % commission. Id. at 1289. Noncommission salespersons were paid on a straight hourly rate, and full-time salespersons received 1 % commission on all sales until January 1979 when the practice was discontinued. The district court found that commission selling often required salespersons to be available after the normal working hours of 8:00 a.m. to 5:00 p.m., sometimes required that they sell in people's homes, might require a license depending on the products sold, and required qualities usually not as necessary in regular selling, including a high degree of technical knowledge, expertise, and motivation.\n\nThe court's next two major findings, that there were different interests and qualifications among men and women for commission selling, were grounded in part on the court's recognition of differences between noncommission and commission selling at Sears. The court based these findings on the large amount of evidence presented by Sears on these issues. The court extensively discusses this evidence. Id. at 1305-15. Again, we cannot say that these findings are clearly erroneous.\n\nRegarding the question of differing interests in general among men and women in commission selling, we have already briefly reviewed the types of evidence presented by Sears to the district court on this issue. We need only highlight some significant findings of the court in support of our determination that the court's finding was not clearly erroneous. The court found that \"the most credible and convincing evidence offered at trial regarding women's interest in commission sales at Sears was the detailed, uncontradicted testimony of numerous men and women who were Sears store managers, personnel managers and other officials, regarding their efforts to recruit women into commission sales.\" Id. at 1306. These witnesses testified to their only limited success in affirmative action efforts to persuade women to sell on commission, and testified that women were generally more interested in product lines like clothing, jewelry, and cosmetics that were usually sold on a noncommission basis, than they were in product lines involving commission selling like automotives, roofing, and furnaces. The contrary applied to men. Women were also less interested in outside sales which often required night calls on customers than were men, with the exception of selling custom draperies. Various reasons for women's lack of interest in commission selling included a fear or dislike of what they perceived as cut-throat competition, and increased pressure and risk associated with commission sales. Noncommission selling, on the other hand, was associated with more social contact and friendship, less pressure and less risk. This evidence was confirmed by a study of national surveys and polls from the mid-1930's through 1983 regarding the changing status of women in American society, from which a Sears' expert made conclusions regarding women's interest in commission selling; morale surveys of Sears employees, which the court found \"demonstrate[] that noncommission saleswomen were generally happier with their present jobs at Sears, and were much less likely than their male counterparts to be interested in other positions, such as commission sales,\" id. at 1310; a job interest survey taken at Sears in 1976;\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e a survey taken in 1982 of commission and noncommission salespeople at Sears regarding their attitudes, interests, and the personal beliefs and lifestyles of the employees, which the court concluded showed that noncommission salesmen were \"far more interested\" in commission sales than were noncommission saleswomen, id. at 1312; and national labor force data.\n\nThe court recognized the EEOC's expert witness testimony regarding women's general interests in employment, which essentially was that there were no significant differences between women and men regarding interests and career aspirations. We cannot determine the district court clearly erred in finding the evidence not credible, persuasive or probative. These expert witnesses used small samples of women who had taken traditional jobs when opportunities arose. Larger samples would have been more persuasive. In addition as the court found, \"none of these witnesses had any specific knowledge of Sears.\" Id. at 1314. The court found Sears' evidence clearly more persuasive on the issue of different interest in commission selling between men and women. The court also found significant Sears' evidence that women became increasingly willing to accept commission sales positions between 1970 and 1980 due to, among other things, changes in commission sales positions from mostly full-time and largely part-time (more women preferred part-time), change in compensation to salary plus commission (which eliminated a lot of risk), increased availability of day care, and a group of successful saleswomen who served as role models.\n\nThe EEOC attacks the court's findings on interest on various grounds. We have already refuted the EEOC's basic argument that Sears' nonstatistical interest evidence is insufficient as a matter of law to successfully attack the EEOC's statistical case. The EEOC further argues that its analysis of the Applicant Interview Guides (AIGs) quantified interest and provided more persuasive evidence of interest than Sears' evidence on interest. According to the EEOC, the AIG analysis showed that while women were over 60 % of full-time sales applicants and approximately 40 % of the persons who considered themselves most ready, willing and able to sell installed home improvements jobs at Sears, women only comprised 1.7 % of full-time commission sales hires in 1973 and between 10.5 % and 5.3 % thereafter. Sears argues in response that some of its evidence regarding interest, in the form of survey and labor force data, was indeed quantified. The district court gave little weight to the EEOC's AIG analysis -- we discuss our decision that the district court's finding was not clearly erroneous in more detail at a later point. In short, the district court found that although neither the EEOC's nor Sears' analysis of the AIGs was entitled to much weight, Sears' analysis was more helpful on the question of differences in interest for commission selling among men and women.\n\nThe EEOC next argues that Sears maintained as part of its affirmative action program data on women refusing commission sales positions and that this would have provided an easy way of substantiating Sears' interest arguments, but Sears did not introduce any of this evidence. Sears had introduced exhibit 25, however, which was a collection of documents on refusals and indications of lack of interest in commission sales from the Eastern Territory. The EEOC notes that this contains only eight instances of female outside applicants refusing positions throughout the period at issue. The court nonetheless found that this exhibit corroborated Sears' witnesses' testimony that there were sincere and extensive efforts to recruit women into commission sales. Furthermore, we find the district court did not clearly err in crediting the testimony of Sears' store management witnesses regarding efforts to encourage women to take commission sales positions and women's lack of interest in those positions.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nThe EEOC bases another argument on the court's finding that although the surveys and testimony preserved by Sears related primarily to the interests of women already employed by Sears, the evidence was also \"a good indication of the interest of women applying for sales positions at Sears.\" Sears II, 628 F. Supp. at 1312 n.56. The EEOC argues that there is no basis in the record for this inference that noncommission sales employees' interests were the same as those of women who applied for sales positions. But as we later discuss regarding the applicant pool, applicants' interests were not clear and the EEOC did not distinguish among applicants who were interested in commission as opposed to noncommission selling. Furthermore, the EEOC's own expert Siskin testified that fewer interested and qualified applicants for commission sales were to be expected in the applicant pool.\n\nIf it is argued that there was no interest in commission selling only because there were no opportunities, which disputes Sears' argument that there was instead an actual lack of interest in the existing opportunities, we are faced with the problem of which comes first, interest or opportunity, a chicken-egg problem. This is again an area where EEOC might have called a representative group of disappointed witnesses who preferred commission selling, but were rebuffed. It did not.\n\nIn short, we hold that the district court did not clearly err in finding that women were not as interested in commission sales positions as were men.\n\nWe similarly find that the district court did not clearly err in concluding that women applicants had different qualifications than did men applicants. The court noted that the EEOC's Commission Sales Report indicated that \"on average, female applicants in the 'sales' pool were younger, less educated, less likely to have commission sales experience, and less likely than male applicants to have prior work experience with the products sold on commission at Sears.\" Sears II, 628 F. Supp. at 1315. The EEOC does not challenge this finding.\n\nAll three of the court's findings discussed above -- that commission selling is significantly different from noncommission selling, that women were not equally interested with men in commission selling at Sears, and that women applicants were not equally qualified with men for commission selling at Sears -- form the bases for the court's criticisms of the EEOC's statistics regarding hiring at Sears.\n\n1. Applicant Pool\n\nThe EEOC challenges the district court's characterization of its applicant pool, which was the source of the EEOC's hiring statistics, as \"inflated.\" The EEOC's expert Siskin constructed this applicant pool from the employment applications of 33,000 rejected sales applicants from 33 randomly selected Sears stores, and the applications of approximately 1,920 persons hired into full-time and part-time commission sales positions between 1973 and 1980 at approximately 210 stores. With the data Siskin attempted to determine the characteristics of male and female applicants by coding information from the applications onto computer tapes; in addition, the EEOC attempted to estimate the female proportion of sales applicants at all Sears stores on a nationwide and territorial basis. To identify all commission sales hires and promotions for 1973 through 1980, the EEOC also analyzed Sears' computerized payroll records for all Sears employees for those years.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e See Sears II, 628 F. Supp. at 1294.\n\nUsing the payroll records, Siskin estimated the female proportion of full-time and part-time commission sales hires in the nation and each territory for each year from 1973 through 1980. To arrive at figures for the female proportion of full-time and part-time commission sales applicants, Siskin analyzed the sample of applications of nonhired applicants and counted as commission sales applicants all applicants who had applied for any job at Sears except those persons who requested only a nonsales job. The application, however, did not distinguish between commission and noncommission sales jobs. Siskin then compared the estimated percentages of women commission sales hires (\"actual percent female\") with the percent of women in the \"sales\" applicant pool (\"expected percent female\"), on a nationwide and territorial basis for each year from 1973 through 1980.\n\nThe district court found that \"these comparisons resulted in large disparities between EEOC's actual and expected percent of female commission sales hires on a national and territorial basis for all years,\" with the z values, or number of standard deviations between the actual and expected figures, in a \"highly statistically significant\" range nationwide as well as in individual territories.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Sears II, 628 F. Supp. at 1295-96.\n\nThe court initially criticized the EEOC's applicant sales pool as \"inflated\" because Siskin included in the pool of applicants for sales positions anyone who had not checked \"nonsales jobs only.\" This meant that the EEOC considered as an applicant for a commission sales position anyone who had checked either \"sales,\" \"any of the above,\" or \"sales\" and another type of job (possibly including \"nonsales\" jobs). Furthermore, the court found that assuming \"arbitrarily\" that all members of the \"sales\" pool were applying for all commission sales positions at Sears in all divisions was \"one of the most serious flaws pervading all of EEOC's statistical analyses.\" Id. at 1301. We agree with the district court's conclusion that this led to an overinclusive sales pool, because it did not distinguish between commission selling and noncommission selling or account for differences in interests or qualifications among applicants. We also agree with the court's conclusion that the EEOC \"offered no credible evidence to support\" either the assumption that all applicants who indicated any interest in sales were specifically interested in commission sales or the assumption that all members of the sales pool were applying for all commission sales positions at Sears in all divisions, and that Sears' evidence proved that both assumptions were false. Id. at 1305. Based on the court's findings that women were differently qualified and interested in commission selling at Sears than were men, the court found women were disproportionately represented in the EEOC's commission sales applicant pool and thus were overestimated in the EEOC's expected percentage of women hires, which had been based on that applicant pool. The EEOC does not seriously challenge this conclusion,\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e and we do not find it is clearly erroneous.\n\n2. Adjusted Analyses\n\nThe EEOC's basic argument is that the district court's criticism of its applicant pool is superfluous. The EEOC contends that its regression analyses took into account differences in applicant interest and qualifications and still showed significant disparities between the expected and actual percentages of female commission sales hires. The district court found a myriad of flaws in these analyses, however, and thus determined that they could not be given any weight.\n\nWe briefly summarize the regression analyses. Siskin performed various multiple regression analyses to determine if the disparities between expected and actual female percentage of commission sales hires could be explained by differences in characteristics among male and female applicants.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e He chose six factors that he believed might affect an applicant's chance of being hired: (1) job applied for; (2) age; (3) education; (4) job type experience; (5) product line experience; and (6) commission product sales experience. Siskin coded information on each of these characteristics (from the applications) for each person in the hired and nonhired sample groups, and grouped each characteristic into various categories. He then performed various multiple regression analyses designed to demonstrate that discrimination rather than any of the six characteristics accounted for disparities in hiring of female applicants. The EEOC relied for the most part on the results of two regression analyses. In a weighted logit regression analysis, the EEOC measured the impact of each independent variable (e.g., age) on the dependent variable of whether or not the person is hired, controlling for the impact of other independent variables. In the multivariate cross-classification, or multicell analysis, Siskin's model allowed all the variables to interact, as there was a separate cell for each possible combination of all the different values for all of the independent variables, or characteristics. As the district court explained, this method of analysis \"calculates the expected percent female by comparing the number of hires with any given combination of characteristics, with the number of female non-hires with that particular combinations [sic] of characteristics.\" Sears II, 628 F. Supp. at 1297.\n\nAs the district court noted, the logit and multivariate analyses reduced the disparities between expected and actual female commission sales hires. The logit analysis reduced the nationwide expected proportion of female commission sales hires for 1973 through 1980 from 61.1 % to 49.5 % for full-time and from 66.2 % to 63.3 % for part-time. The multivariate analysis reduced the expected percentage of female full-time hires nationwide for all years from 61.1 % to 40.3 % (later reduced to 37.2 %),\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e and the disparity for part-time hires was reduced from 66.2 % to 60.5 %. The court also noted that the z values were below 3 for a number of years in various territories and that the EEOC had admitted that those disparities were not statistically significant, but also recognized the EEOC's claim that statistically significant disparities existed nationwide and by territory for several years in which the z value exceeded 3.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nThe EEOC conducted another multivariate analysis for full-time hires for each of ten product line groupings (e.g., home furnishings, appliances) separately on a nationwide basis for the years 1973 through 1975, and 1976 through 1980. The court noted that there were statistically significant disparities in several of the product line groupings.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e The EEOC conducted a similar analysis for the part-time case, except that fourteen instead of ten product line groupings were used and the Midwestern Territory was analyzed separately from the combination of the other territories because of apparent differences in hiring patterns.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nThe district court's major criticism of the EEOC's regression analyses is that the six characteristics chosen by the EEOC's expert Siskin were \"simplified\" and inadequate to account for applicant differences in interest and qualifications. Sears II, 628 F. Supp. at 1302, 1305 n.35a. The EEOC contends that these characteristics did indeed contemplate differences in interest and qualifications. The court first criticized the EEOC's choice of characteristics. The court found, and the EEOC does not challenge this, that the six factors chosen by Siskin were the result of his opinion as to what factors would be important for commission selling. The court further found it could give little weight to Siskin's opinion in this regard because Siskin \"is not an expert in labor economics, has no expertise in the area of retail sales, and has no direct knowledge of Sears.\" Id. at 1302. We must accord great deference to such credibility-based factual determinations. See Anderson v. City of Bessemer City, 470 U.S. 564, 575, 84 L. Ed. 2d 518, 105 S. Ct. 1504 (1985).\n\nThe court also determined that the \"EEOC presented no credible evidence\" to support Siskin's choice of the particular six factors as important to commission selling at Sears. Instead, the court found \"all the evidence offered at trial indicates . . . that a number of important factors were not included in the EEOC's analysis.\" Sears II, 628 F. Supp. at 1302. The most critical factor \"intentionally excluded by EEOC\" according to the court was \"the applicant's interest in commission sales and in the product to be sold.\" Id. The EEOC contends on appeal that four of its characteristics, Job-Applied-For and the three experience variables (job type experience, product line experience, and commission product sales experience), \"were highly correlated with interest.\" It cites nothing, however, either on the record or outside the record, to support this statement. The case is thus unlike that of Bazemore v. Friday, 478 U.S. 385, 106 S. Ct. 3000, 3008, 92 L. Ed. 2d 315 (1986), in which the Supreme Court noted that the type of independent variables used in plaintiffs' regression analyses were selected based on discovery testimony by one of defendants' officials that certain factors were determinative of the dependent variable salary. Although this rationale for choice of the independent variables did not preclude questioning of the comprehensiveness of these variables, see Bazemore, 106 S. Ct. at 3008-09, the Court rejected the court of appeals' conclusion that the analyses were unacceptable because they did not include all variables that might have an effect on salary -- the Court stated that the analyses should be given some probative value. We think that the EEOC's failure to support its choice of variables in this case casts a shadow on the probative value of the regression analyses incorporating those variables. Furthermore, if those four variables were indeed \"highly correlated with interest,\" the EEOC still does not explain, satisfactorily, how the analyses incorporating those variables adequately controlled for interest.\n\nInterest was not the only factor affecting an applicant's chance of being hired that the court found was not controlled for in the EEOC's regression analyses. The EEOC challenges the district court's conclusion that its regression analyses did not adequately adjust for differences in qualifications. As the district court found, the EEOC's Commission Sales Report itself demonstrated that, \"on average, female applicants in the 'sales' pool were younger, less educated, less likely to have commission sales experience, and less likely than male applicants to have prior work experience with the products sold on commission at Sears.\" Sears II, 628 F. Supp. at 1315. The EEOC counters that its experience variables took those differences into account. The EEOC's three experience variables would seem to account for differences in the \"experience\" aspect of qualifications. The court found that other characteristics, however, such as \"physical appearance, assertiveness, the ability to communicate, friendliness, and economic motivation,\" factors Sears managers had identified as desirable for commission salespersons, \"could be determined only from an interview, not from the written application.\" Id. at 1303. The court recognized that these characteristics are not easily quantified and this data would not be generally available from the application forms, but found that to the extent the EEOC's regression analyses did not incorporate these factors, they were entitled to less weight. We cannot say that this finding, going to the probative value rather than the relevancy of the regression analyses, is clearly erroneous. See Bazemore, 106 S. Ct. at 3008-09.\n\nWe believe the district court accorded its findings regarding the failure to include independent variables such as interest and aspects of qualifications in the regression analyses the proper evidentiary weight. The district court cited the Fourth Circuit case Bazemore v. Friday, 751 F.2d 662, 672 (4th Cir. 1984), aff'd in part and rev'd in part, 478 U.S. 385, 106 S. Ct. 3000, 92 L. Ed. 2d 315 (1986), for the principle that in a meaningful regression analysis, all independent variables that significantly affect the dependent variable should be included. The Supreme Court later reversed the Fourth Circuit on this issue, holding that the Court of Appeals erred in determining that a regression analysis was \"'unacceptable'\" because it did not include \"'all measurable variables'\" that could affect the dependent variable. Bazemore, 106 S. Ct. at 3009 (quoting opinion of court of appeals). The Court noted that the regression analysis accounted for the major factors and in that situation failure to include variables normally goes to probativeness, not admissibility. Id. The district court in this case did not make the Fourth Circuit's fatal mistake. It is clear from the district court's opinion that it did not determine that the EEOC's analyses were inadmissible or irrelevant because of the failure to include variables -- instead, the court determined that the analyses were not probative because of the omissions. Although we do not believe the court found the regression analyses totally unacceptable, the court's criticisms of the analyses are so pervasive that the court may have believed that the regressions were what the Bazemore Court termed \"so incomplete as to be inadmissible as irrelevant,\" which would be an exception to the general rule established in Bazemore.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Bazemore, 106 S. Ct. at 3009 n.10.\n\nThe district court's other criticisms of the regression analyses go to the coding of the factors the EEOC did include in the regressions. The court found that the coding of several factors was \"clearly inadequate to properly adjust\" for those factors. Sears II, 628 F. Supp. at 1303. The court noted that regarding the characteristic of prior job experience, the EEOC did not adjust for various forms of job experience. The court gave the example of the prior job experience of commission selling -- women were more likely than men to have been cashiers on a commission-selling basis, and thus in actuality did not have experience in commission selling as it was done at Sears. The EEOC responds that its expert Siskin performed a multicell regression separating out all persons who had been cashiers with \"trivial impact\" on the results.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e Although cashiers may not have been the best example of earlier job experience, we do not believe the court's emphasis on prior job experience was implausible on this record. The district court found other infirmities in the coding of the experience variables; namely, that Siskin did not code the amount of prior experience, interruptions in work history, or other relevant experience (the latter of which was on the application). These inadequacies in coding of the experience variables led the court to conclude that \"because of the nature of these coding deficiencies, women are credited with greater amounts of experience at higher levels than they actually had. The effect of all these inadequacies is to inflate the percent of women the statistical models estimate should be hired.\" Id. at 1304. The EEOC responds to some, but not all of these criticisms, mainly relying on its argument that the court did not cite actual data to support the criticisms. We do not believe the court's criticisms of the coding of experience variables are clearly erroneous.\n\nWe agree with the EEOC that one of the district court's criticisms of the coding was misplaced. The court concluded that Siskin had not recoded the Job-Applied-For variable after discovering an error in the coding, and that there was thus an overestimation of the expected female proportion of commission sales hires. Siskin had, however, recorded the variable for the \"overlapping sample\" of twenty-nine stores and reported in court that there was no impact on the analysis.\n\nThe EEOC argues that none of the court's other criticisms of its regression analyses are of consequence. The district court found that by creating artificial national and territorial pools of applicants, without taking into account likely variations in the quality of applicants at individual stores or even whether openings actually existed at stores, the \"EEOC did not analyze the hiring situations actually confronted by Sears managers.\" Id. at 1316. The court thus accorded the statistical analyses less weight. We believe that on this record such a finding is plausible.\n\nBased on the above findings, the district court determined that the z values both for the unadjusted comparisons of expected and actual female hires, and for the regression analyses, did not constitute statistically significant disparities. Regarding the unadjusted analysis, the court found that because the EEOC never controlled for interest or qualifications, there were no meaningful comparisons between actual and expected female hires and thus the \"z values prove[d] nothing.\" Id. The court also found that the EEOC's attempts to adjust for differences among applicants, mainly interest and qualifications, were woefully inadequate as discussed above, so that the EEOC did not achieve \"fair estimates\" of the expected female hires. In such a case, the court concluded, the z statistics connected with the comparison of actual and expected female hires \"have little value.\" Id. The court further credited Sears' incorporation of \"variances\" into calculation of the z statistics to account for the difference between the proportion of women in the nationwide pool and the proportion of women in each store pool. After taking into account the variances, the court noted, the z statistics were \"significantly lower,\" so that \"for EEOC's nationwide multicell analysis of full time commission sales hires, z values exceed 3 in only two years.\"\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Id. at 1317. The court then concluded that because these z values did not take into account differences in male and female interest in commission sales, an analysis incorporating those differences would not produce statistically significant disparities.\n\nThe EEOC challenges the above findings, arguing that its regression analyses did indeed show statistically significant disparities that satisfied its burden of proving discrimination as articulated by the Supreme Court in Bazemore, 106 S. Ct. at 3009: \"A plaintiff in a Title VII suit need not prove discrimination with scientific certainty; rather, his or her burden is to prove discrimination by a preponderance of the evidence.\" The Bazemore Court went on to note, however, that \"whether, in fact, such a regression analysis does carry the plaintiffs' ultimate burden will depend in a given case on the factual context of each case in light of all the evidence presented by both the plaintiff and the defendant.\" Id. We have not as yet discussed all of the EEOC's evidence, but we need only briefly consider that other evidence because the EEOC's primary focus was its regression analyses and with one exception (the AIGs), the EEOC casts that evidence as supporting its regression analyses in allegedly showing hiring discrimination. We believe the district court's treatment of the EEOC's regression analyses was consistent with Bazemore -- the court did not require the EEOC to show disparities with scientific certainty, but rather considered all the evidence in determining that it could not rely on the EEOC's purported disparities.\n\n3. AIGs\n\nTo support the results of the regression analyses, the EEOC statistically analyzed responses to Sears' Applicant Interview Guides (AIGs) that had been used in certain stores in the Denver, Colorado, area in 1978-1980, and in Waco, Texas, in 1980. Siskin analyzed these applicants' ratings, found in the Guides, on a scale of one to five of their own interests and experience with regard to four of forty-five categories chosen by Siskin as closely approximating four product line groups at Sears: appliances, automotive, home building materials, and home improvements. This analysis did not incorporate any of the characteristics used in the other regression analyses, and was completely independent from those analyses. The district court noted that Siskin estimated that the expected proportion of female commission sales hires was higher based on this analysis than it was based on the multivariate regression analysis.\n\nThe EEOC's main argument is that its AIG analysis supports the regression analyses. It also implies, however, that even considered on its own, the AIG analysis proves Sears' intentional hiring discrimination. We reject both contentions. The district court explicitly stated that he ascribed little weight to the AIG analyses, whether analyzed by the EEOC or Sears, and we agree with this conclusion. The AIGs have a very limited scope, coming from only two stores in Sears' Southwest Territory. In addition, the Guides at one store were administered only in 1978, while in the other they were administered from 1978 to 1980. The Guides simply cannot serve as a basis for proving the EEOC's claim of nationwide discrimination for the years 1973 to 1980.\n\nThe EEOC nonetheless claims that the AIGs were corroborative of its multicell analyses because after the EEOC adjusted its \"sales\" pool using the interest and experience responses on the AIGs, there were statistically significant disparities. The court found that this analysis was tainted because of the flawed \"sales\" pool, which we discussed above, and because the adjustments were incomplete, not taking into account age and education or more than just a few product line groupings. While we may not agree that factors such as age were crucial to this analysis, we cannot find that the court's conclusion regarding the value of this evidence, especially considering its limited scope, was clearly erroneous.\n\nFurthermore, it is apparent that the district court found Sears' analysis relatively more helpful regarding the separate issue of differences in male and female interest in commission sales. The court found that this evidence, which showed that men were more interested in jobs usually associated with commission sales positions at Sears while women were disproportionately interested in noncommission-type jobs, corroborated Sears' survey evidence regarding differences in male and female interests. Sears' expert Dr. Joan Haworth had analyzed the AIGs by \"normalizing\" the scores that applicants gave themselves in interest, skill and experience, considering that some applicants might inflate their scores to increase their chances of being hired. Haworth, like Siskin, chose categories roughly corresponding with Sears' product lines and adjusted the EEOC's expected percentage of women commission sales hires based on \"normalized\" responses in the Guides. She also adjusted the expected percentage based on figures indicating that one of every 250 job applicants is selected for commission sales. After these adjustments, disparities were greatly reduced for the period of 1976 to 1980. The EEOC criticizes the validity of Haworth's analysis on several grounds and argues that the district court gave the analysis too much weight, especially in light of the court's criticisms of the EEOC's AIG analysis. We disagree. The court noted various deficiencies in Haworth's analysis, explicitly stated it had not given it \"substantial weight,\" and it is clear that the weight the court did accord this evidence was not in the more specific sense of Haworth's product line comparisons, which was the counterpoint to the EEOC's analysis, but rather regarding women's relative lack of interest in commission selling at Sears. Sears II, 628 F. Supp. at 1323-24. We cannot say the district court clearly erred in attributing to this evidence the limited significance that it did.\n\n4. External Labor Force Data\n\nThe EEOC claims that the external labor force data introduced by Sears on the issue of differences in male and female interest, which the court found \"corroborate[d] Sears' strong evidence of female lack of interest in commission sales and in . . . particular product lines,\" id. at 1314, instead supports the EEOC's claim that Sears discriminated against women in hiring. The EEOC cites various nationwide statistics for female percentages of salespeople in various product lines and compares those figures with the smaller figures at Sears. Sears responds that these comparisons are inaccurate because the nationwide data does not reflect the breakdown of noncommission versus commission salespersons depending on product line existing at Sears. According to Sears, the product line data \"included vast numbers of department store clerks who did not sell on commission and whose jobs in no way resembled those of commission salespeople at Sears,\" and other data for retail commission salespersons failed to indicate product line differences so that it included saleswomen selling items like fashions and furs which are \"seldom sold on commission on Sears.\" It is unclear whether the EEOC actually presented this argument to the district court. Indeed, EEOC expert Siskin rejected reliance on external labor force data in constructing his analyses. Issues not presented in district court are waived on appeal. See DeValk Lincoln Mercury v. Ford Motor Co., 811 F.2d 326, 338 (7th Cir. 1987). In any event, considering the inaccuracies likely present in a comparison of the nationwide data with Sears data on this particular question, we cannot find that the district court erred in not concluding that external labor force data indicated hiring discrimination by Sears.\n\nThe EEOC attacks the court's conclusion that certain nationwide external labor force data for all employed commission salespersons reflected a lower female availability for commission sales positions during the years 1976 to 1980 than the EEOC estimated were available based on its \"sales\" pool. The EEOC argues that it is \"inappropriate to compare a nationwide static work force figure with Sears' hiring figures for various years.\" We agree that such a comparison can be misleading. As noted by this court in Movement for Opportunity \u0026 Equality v. General Motors Corp., 622 F.2d 1235, 1345 (7th Cir. 1980), such cumulative \"snapshot\" statistics include hiring decisions for the past twenty to thirty years. Thus the statistics mask past discriminatory hiring decisions and should not be compared with female availability for commission sales positions during a recent four-year period. See id.; United States v. City of Chicago, 549 F.2d 415, 435 (7th Cir. 1977) (\"it is no defense to a charge of discrimination that not everyone else is in compliance with the law\").\n\nNonetheless, we believe that the main purpose of this evidence according to the district court was not to show overall female availability for commission sales positions, but rather to further corroborate differences in male and female interest by product line. The court found that this national labor force data did corroborate female lack of interest in selling particular product lines, and we cannot say that this finding is clearly erroneous. To the extent that the usefulness of this static labor force evidence is subject to the same criticism of incorporating past discrimination, which we find doubtful when the evidence is used for the purpose of showing differences in men's and women's interest in particular product lines, we note that some of the evidence that the court found most significant related to comparisons of male- and female-owned businesses, which would not seem to be as subject to discrimination.\n\n5. Hiring Practices\n\nThe EEOC maintains that the district court erred in determining that none of its evidence regarding the subjective nature of Sears' hiring process or regarding Sears' testing practices supported the EEOC's statistical analyses or provided any credible proof of discrimination by Sears. With respect to the subjectivity of Sears' hiring process, the EEOC argued that there was no formal training and a lack of written instructions for Sears' interviewers regarding the qualities to look for in commission sales applicants. In addition, the EEOC pointed to what it referred to as a \"highly masculine\" description of a commission salesperson found in the Retail Testing Manual, which included phrases such as \"active,\" \"has a lot of drive,\" possesses \"considerable vigor,\" and \"likes work which requires physical energy.\" The EEOC also notes that a Sears official admitted that this reflected characteristics that \"on average more men possess than women.\" The EEOC cites numerous cases for the proposition that a lack of objective standards regarding employment decisions can be a discriminatory practice because such a system with its lack of safeguards may easily be subject to abuse. See Davis v. Weidner, 596 F.2d 726, 732 (7th Cir. 1979) (court noted \"absence or extreme generality of any predetermined standards for selecting employees, the failure to record evaluations of job applicants, and the absence of minorities on the employment decisionmaking bodies can add credence of the claim of an aggrieved employee, especially when the employer does not rely on objective, easily measured criteria for his employment decision\"); Stewart v. General Motors Corp., 542 F.2d 445, 450-51 (7th Cir. 1976) (court found discriminatory promotion practices where a process was \"highly subjective and loosely structured,\" the supervisory recommendations being important but there were no safeguards and no written guidelines regarding promotion criteria), cert. denied, 433 U.S. 919, 97 S. Ct. 2995, 53 L. Ed. 2d 1105 (1977); see also Carmichael v. Birmingham Saw Works, 738 F.2d 1126, 1131 (11th Cir. 1984) (subjective procedures in context of promotion included word of mouth regarding openings and informal review procedures); Harris v. Birmingham Board of Education, 712 F.2d 1377, 1383 (11th Cir. 1983) (\"lack of objective hiring standards contributed to [plaintiff's] establishment of a prima facie case\" of racial discrimination in hiring); Williams v. Colorado Springs School District, 641 F.2d 835, 842 (10th Cir. 1981) (observing that subjective promotion and employment criteria afford possibilities of abuse); Rowe v. General Motors Corp., 457 F.2d 348, 358-59 (5th Cir. 1972) (discriminatory promotion/transfer procedures where foreman's recommendation is most important factor in promotion process, foremen are given no written instructions regarding qualifications necessary for promotion, controlling standards were \"vague and subjective,\" hourly employees not notified of promotion opportunities and no safeguards).\n\nSears concedes that its hiring process was subjective, but argues that subjectivity is a necessary part of the hiring process and it does not follow that because a hiring process is subjective, it is necessarily discriminatory. Cf. Movement for Opportunity \u0026 Equality v. General Motors Corp., 622 F.2d 1235, 1277 (7th Cir. 1980) (court noted that subjectivity was inherent in promotion system, but evidence established that system contained checks and balances and, in addition, the promotion system included procedures to fulfill affirmative action obligations); Mozee v. Jeffboat, Inc., 746 F.2d 365, 371, 372 (7th Cir. 1984) (\"subjective and other intangible factors may influence employment decisions and . . . even subjective misjudgments may not necessarily be the basis for Title VII liability,\" in addition, \"the probative value of statistical evidence may be diminished where an employer genuinely relies on subjective factors in making decisions and where data are incomparable\" (emphasis in original)); Williams v. Colorado Springs School District, 641 F.2d 835, 842 (10th Cir. 1981) (subjective definitions of employment selection and promotion criteria not unlawful per se, because some subjectivity cannot realistically be avoided in making hiring and promotions decisions). Sears argues that subjectivity is especially important in its affirmative action efforts. Cf. Movement for Opportunity \u0026 Equality, 622 F.2d at 1277.\n\nThe question, then, is how much subjectivity is permissible. We agree with the Ninth Circuit that a court must consider \"an employer's use of subjective criteria . . . with the other facts and circumstances of the case.\" Casillas v. United States Navy, 735 F.2d 338, 345 (9th Cir. 1984). While it may have been better policy for Sears to have had written instructions and formal training for interviewers regarding qualities to look for in commission sales applicants, we cannot say on this record that Sears exercised so much subjectivity as to engage in a discriminatory practice. In addition, the court's finding regarding Sears' affirmative action efforts appears to obviate impermissible subjectivity on the part of Sears' interviewers.\n\nRegarding the description of commission salespersons found in the Retail Testing Manual, the EEOC argues that this instruction was reflected in oral instructions to interviewers. The district court found that there was \"no evidence that this historical description had any influence on hiring decisions, particularly during the years in question,\" that Sears managers \"often paid no attention to information in the manual,\" and that \"there is no basis in the record for concluding that this description had any negative impact on the selection of women for commission sales.\" Sears II, 628 F. Supp. at 1318. After consulting the record, we conclude that the court did not clearly err in this finding.\n\nThe EEOC also argues that the district court erred in finding that one aspect of Sears' testing practices was not discriminatory. The EEOC contends that a \"vigor\" scale, one of seven scales on the Thurstone Temperament Schedule, contained questions that would more likely be answered affirmatively by men, such as \"Have you played on a football team?\" The district court agreed that these questions would more likely be answered affirmatively by men, but chose to believe Sears' witnesses, who testified that many Sears applicants were not tested, or if they were tested, it was not until after they were hired. The court also believed Sears' managers, who testified that the test had little impact on any decision to hire and that test scores were adjusted for women. The EEOC argues that it is implicit in the district court's phrasing of the impact of the test that it had at least some impact. In light of the court's conclusion that there was no credible evidence that a woman's vigor score ever prevented her from being hired for commission sales at Sears, however, we find the court did not clearly err in determining this aspect of Sears' testing did not have enough impact, on its own, to prove a case of discrimination.\n\n6. Past Discrimination\n\nThe EEOC contends that the court erred in not mentioning hiring data for 1972 because, although it was before the liability period began, it would constitute evidence of past discrimination. The EEOC cites Bazemore v. Friday, 478 U.S. 385, 106 S. Ct. 3000, 3010, 92 L. Ed. 2d 315 (1986), in which the Supreme Court stated that \"'proof that an employer engaged in racial discrimination prior to the effective date of Title VII might in some circumstances support the inference that such discrimination continued, particularly where relevant aspects of the decisionmaking process had undergone little change.'\" (quoting Hazelwood School District v. United States, 433 U.S. 299, 309-10 n.15, 53 L. Ed. 2d 768, 97 S. Ct. 2736 (1977)).\n\nThe EEOC cannot prevail with this argument, however, because based on the district court's findings, which we have held are not clearly erroneous, it has not proved that Sears discriminated against women in hiring in 1972. The EEOC cites various statistics that are products of the same analyses we have described above, and argues that they show discrimination. These analyses, however, are subject to the same defects the district court found fatal to the statistics of later years. Furthermore, these statistics may likely be even less reliable than those of the later years. The EEOC's expert Siskin testified that these 1972 figures were \"at best an estimate.\" Because we cannot say that these statistics provide proof of past discrimination, we need not determine whether the statistics support an inference of later discrimination.\n\nD. Promotions\n\nAccording to the district court, the EEOC relied \"almost exclusively on statistical analyses\" to prove its claim that Sears discriminated against women in promotions from noncommission sales jobs to commission sales jobs.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e Sears II, 628 F. Supp. at 1300. The EEOC's expert Siskin estimated the expected proportion of female promotions for each year by looking to the female proportion of noncommission salespersons in each store at the end of a year (year-end store pool). He compared these figures with the proportion of women actually promoted into commission sales, and came up with z values that exceeded 3 in all but one year in one territory. To account for the possibility that persons in a division in which a promotion occurred would have a greater chance at the promotion than a salesperson outside the division, Siskin performed a second analysis of this data. He estimated the expected female proportion of promotions by looking to the female proportion of noncommission salespersons on the basis of division (year-end division pool). The z values for this analysis exceeded 3 in all years and territories except for one territory in one year.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nAs it did with the EEOC's hiring statistics, the court criticized the EEOC's promotion statistics at two levels: (1) the statistics were based on the false assumptions that all those noncommission sales employees, who composed the pool for promotions, were equally qualified and that they were equally interested in promotions from noncommission to commission selling; (2) even if the EEOC's promotion statistics were valid, the disparities created by those statistics were significantly reduced or even eliminated after Sears' adjustments for differences in interest, and other adjustments.\n\nWe do not think that the burden initially was on the EEOC to adjust its promotion statistics for interest and qualifications. After Sears introduced data regarding interest and qualifications, however, the EEOC used a careful litigation strategy in attempting to show that interest and qualifications would have little bearing on its disparities, or at least would not eliminate them. The question is whether the EEOC's disparities remained statistically significant after taking into account adjustments for differences in men's and women's interest in commission selling, for differences in qualifications, and other considerations (such as affirmative action and the lack of individual victim testimony).\n\nInitially, we note that the court gave some credence to a Sears \"Product Line\" adjustment of the EEOC's promotion analysis that resulted in reducing the expected female proportions of promotions from noncommission to commission sales from EEOC's division pool analysis for the 1974-1980 period from 68.6 % for full-time and 73.8 % for part-time to 60.8 % for full-time and 64.5 % for part-time. That adjustment was not even entitled to the little credence the court gave it, however, because this product line adjustment was subject to the same criticisms the court made of Sears' \"Division Feeder Pool\" adjustment of the promotion data.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e We therefore assign this adjustment no weight in determining whether the district court erred in determining that Sears successfully produced probative evidence to undermine the EEOC's promotion disparities. The district court recognized that this analysis tended to overreduce the EEOC's disparities, and apparently only gave the adjustment weight for the principle that adjustments could reduce the disparities.\n\n1. Interest\n\nSears' general evidence regarding differences in men's and women's interest in commission selling that we discussed in the context of the hiring claim applies to the promotion claim as well. Sears also adjusted the EEOC's promotion data based on interest measurements. The district court concluded that Sears' analysis of some of that evidence \"demonstrates that interest alone can account for the disparities computed under EEOC's analysis.\" Sears II, 628 F. Supp. at 1326. The EEOC contends on appeal, however, that it did take into account \"major adjustments for interest\" and statistically significant disparities still remained for both part-time and full-time throughout the period at issue.\n\nAfter analyzing the record regarding both parties' evidence concerning interest and promotions, we conclude that the district court did not clearly err in determining that Sears' interest evidence substantially reduced (and indeed almost eliminated) the EEOC's alleged promotion disparities.\n\nWe first address the EEOC's contention that it did take into account major adjustments for interest and that significant disparities remained after those adjustments. The EEOC points us to two purported interest adjustments. In the first adjustment, the EEOC picked two years, 1973 and 1977, and estimated the expected proportion of female promotions if noncommission salesmen were 1.5, 2, or 3 times as interested in commission sales than were noncommission saleswomen. For the 1973 figures, the expected proportion of female promotions was reduced, but it was still greater than the actual proportion at all three interest levels. For the 1977 figures, disparities existed except when the proportion of noncommission salesmen was three times the proportion of noncommission saleswomen -- then the disparities between the proportions of expected and actual female promotions were eliminated.\n\nThese adjustments are meaningless in a vacuum, however. The EEOC does not point to any evidence on which it based its assumption that the proportion of interested noncommission salesmen was only 1.5, 2, or 3 times as great as the proportion of interested noncommission saleswomen. The district court might well have concluded, based on Sears' evidence regarding differences in male and female interest, that more than three times the proportion of noncommission salesmen as of noncommission saleswomen was interested in commission selling. Indeed, this adjustment seems probative of Sears' argument that differences in interest can account for disparities.\n\nThe EEOC's other interest adjustment at least was based on some quantified data regarding different interest levels. The EEOC as well as Sears relied on responses to the 1982 National Timecard Nonsupervisory Special Survey (NTNSS), which was administered to incumbent noncommission and commission salespeople by Sears in 1982. The EEOC's expert Siskin analyzed responses to question 13C of the NTNSS\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e to achieve quantified levels of interest and came up with a 1.78 ratio of male to female full-time noncommission interest in commission selling, and a 1.56 ratio of male to female part-time interest. Siskin adjusted the original expected female proportions of promotions based on these interest responses and found that the disparities were significantly reduced, although the EEOC argues that statistically significant disparities remained.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nThe EEOC's NTNSS interest adjustment reduced the disparities between expected and actual proportions of female promotions by one-half. If the adjustment were considered valid, the EEOC is correct in arguing that there would nonetheless remain disparities that are above the statistically significant z level of 3 for both full-time and part-time promotions. For a variety of reasons, however, we think the district court did not clearly err in not crediting this interest adjustment by the EEOC and thus not determining that statistically significant disparities remained even after taking interest into account.\n\nFirst, the NTNSS was administered in 1982, but the EEOC applied that 1982 interest ratio to each year and all years from 1973 to 1980. The district court found, however, and we have previously determined that finding was not clearly erroneous, that women's interests changed substantially over the decade of the 1970's. It is significant that after the EEOC's interest adjustment for full-time promotions, the significance of the disparities declined during the 1970's so that in 1979 the disparity was 2.9 (less than statistically significant), and in 1980, the z level was 3.6 (barely statistically significant). The district court noted women's changing interests in addressing some of Sears' interest adjustments, finding it important that \" even in 1982-1983, noncommission salesmen were three times as likely as noncommission saleswomen to be interested in moving to commission sales.\" Sears II, 628 F. Supp. at 1326 (emphasis added).\n\nIt is also a bit incongruous that the EEOC chooses to rely on the NTNSS interest adjustment on appeal, because in district court, the EEOC criticized the reliability of the responses to that survey. The EEOC argued that noncommission salespeople could not adequately be identified from responses to the survey, and that the effect of that imprecision was to reduce the expected female proportion of promotions after adjustments for interest. The district court recognized that although there were some \"flaws in the design and administration of the NTNSS, they are not significant enough to undermine the essential validity of the results,\" Sears II, 628 F. Supp. at 1312, and also determined that Sears was adequately able to identify noncommission salespersons. It would seem that any imprecision would also tend to cut against the EEOC if the EEOC is relying on these statistics.\n\nPerhaps the biggest problem with the EEOC's interest adjustment is that it relied on responses to question 13C of the NTNSS, whereas the district court found that question 42 of that survey,\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e the responses to which Sears relied on in its interest adjustment, was a better indicator of real interest in commission selling. The court determined that question 42 was a better measure of interest because in answering that question, the respondent had to affirmatively choose commission selling rather than other forms of selling. Question 13C, on the other hand, merely required the respondent to answer whether he or she would accept a commission sales position if it were offered. Sears' interest adjustment of the EEOC's promotion data based on responses to question 42 reduced the expected female proportion of promotions so as to virtually eliminate any disparities between expected and actual female proportion of promotions in both the full-time and part-time cases for the \"all years\" period of 1974 to 1980.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nThe EEOC argues that the question 42 interest adjustment still results in statistically significant disparities in full-time and part-time 1973 promotions (the z levels were 6.1 for full-time and 11.5 for part-time in 1973). We do not think that the court erred in not reaching the conclusion suggested by the EEOC. As we noted above, women's interests changed over the 1970's. It is therefore questionable to apply 1982 interest levels to 1973 promotion statistics. Sears' expert Haworth specifically stated changing women's interest levels as one reason why she had not applied the 1982 data to promotion statistics for the earliest years at issue. Furthermore, both Haworth and the EEOC's expert Siskin acknowledged that data underlying the 1973 promotion statistics were unreliable.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nThe EEOC also contends that the court erred in not noting the implications of a \"combined analysis\" based on responses to questions 13C and question 42. The EEOC notes that the court approved a Sears' witness's suggestion that perhaps the best measurement of interest would be achieved by combining responses to questions 13C and 42. The EEOC then presents an adjustment of its Division Pool results based on this \"combined analysis.\" Although it may have been helpful to have had the benefit of this combined analysis, we may not consider these statistics on appeal because they were not presented to the district court. The EEOC contends that we may consider this adjustment because the district court accepted the Sears' witness's testimony that this analysis would be the best method, and that the EEOC has done the analysis through \"simple mathematics that is fully explained.\" Even the results of simple math are inappropriate for this court to consider on appeal, however, if the results were not initially presented to the district court. See Ohio-Sealy Mattress Manufacturing Co. v. Sealy Inc., 776 F.2d 646, 650 n.1 (7th Cir. 1985) (rejecting plaintiff's argument that because summaries were \"simply tools to aid [the] court in understanding the record,\" court of appeals could consider \"summaries of voluminous materials\" although they had not been presented to the district court); Rebuck v. Vogel, 713 F.2d 484, 486 (8th Cir. 1983); Fed. R. App. P. 10(a). Because the EEOC's combined analysis resulted in new percentages not presented to the district court, we may not consider that analysis on appeal.\n\nPerhaps because the district court recognized some imprecision in the NTNSS survey responses, the court chose to rely on the evidence of interest expressed in responses to Career Aspiration Questionnaires (CAQs) administered by Sears at stores in the EEOC's nonhired applicant sample in 1982-1983. The court concluded that \"Sears' analysis of these questionnaires demonstrates that interest alone can account for the disparities computed under EEOC's analysis.\" Sears II, 628 F. Supp. at 1326. The EEOC attacks the court's reliance on and conclusions from these questionnaires in several respects. Although we find some troubling aspects of reliance on this data,\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e we do not agree that the district court's conclusion that adjustments for interest can virtually eliminate the EEOC's disparities is clearly erroneous.\n\nThe EEOC contends that the results from the CAQs are unreliable because Sears' expert Haworth combined full-time with part-time responses regarding interest in commission sales to achieve the results that the proportion of men interested in commission sales was approximately three times the proportion of women interested in commission sales. The district court recognized this criticism but determined that \"there is no indication that the part time responses do not fairly reflect female interest in commission sales.\" Id. We do not believe that this reasoning is faulty. The EEOC argues that career aspirations of full-time and part-time salespersons differ and product lines in which those persons work are usually distinct. Commission sales positions at Sears are not available only to full-time salespersons, however, thus the question of interest in commission sales seems to cut across the line between full-time and part-time.\n\nThe EEOC also suggests that the district court relied on the results of the CAQs and not the results from the NTNSS because the results of the NTNSS did not totally eliminate the promotion disparities while the results of the CAQs did. As we noted earlier, the court questioned the reliability of the NTNSS on several grounds, and even the EEOC questioned the reliability of the NTNSS. Furthermore, the court did not discount the results of the NTNSS; the court instead found that the results from the NTNSS were similar to and corroborated the results of the CAQs. It is clear that the court did not place sole reliance on the CAQs as the one interest survey that eliminated promotion disparities. The court found that two other surveys, the 1976 Job Interest Survey and the NTNSS, although they involved some reliability problems, yielded similar results on the question of interest.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Furthermore, the court expressed that several factors aside from interest caused it to determine that the EEOC's promotion disparities did not prove a case of intentional discrimination. Those factors, which we discuss in more detail later, include differences in qualifications between men and women, Sears' affirmative action efforts, and a lack of individual victim testimony.\n\nThe EEOC also questions the reliability of the CAQs based on the sample size of the CAQ responses. The CAQs were distributed to 1,220 female and 357 male full-time and part-time noncommission salespersons. Of that number, there were fifty responses of an interest in commission sales, four of which were from full-time noncommission salespersons.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e Although it would have been helpful to have had more responses to analyze, we are not convinced that the small number of responses to this question are not indicative of interest in commission sales, especially in light of the significant numbers of respondents (63.4 % of women and 50.1 % of men) who answered \"no\" to the question of whether they were interested in transfer or promotion. This question immediately preceded and headed the question regarding interest in commission sales. See D. Baldus \u0026 J. Cole, Statistical Proof of Discrimination ยง 4.123, at 53 (Supp. 1986) (\"Sample size, of course, affects the validity of actual applicant data, but this should not lead the court to disregard it altogether. Even a small sample of applicant flow data sheds some light on the [employer's] actual operation.\").\n\nThe EEOC argues that applying the CAQ male to female interest ratio of 3.19 still results in disparities in 1973. As we noted above regarding applying NTNSS survey results from 1982 to the 1973 promotion data, it is questionable to apply results of 1982 or 1983 survey data to 1973 statistics because women's interests had changed during the 1970's. In addition, the 1973 promotion statistics were based on unreliable promotion data.\n\nEven considering the reliability problems of some of the interest survey data, we think the court did not err in determining that the interest evidence significantly, if not almost totally, reduced the promotion disparities.\n\n2. Qualifications\n\nRegarding the issue of differences in qualifications among male and female noncommission salespersons, the district court concluded that \"all evidence regarding qualifications shows that males at Sears were more qualified for commission sales positions than [were] females.\" Id. The EEOC complains that the court did not state what evidence it purported to rely upon in reaching this conclusion, and assumes along with Sears that the court was referring to noncommission salespersons' experience and background before entering noncommission sales at Sears. Both parties dig into the record for evidence to refute or support the proposition that prior experience can have an impact on chances of promotion from noncommission sales to commission sales.\n\nPrior experience is only one aspect of qualifications, however, and we believe the district court was referring to the performance aspect of a noncommission salesperson's qualifications for a promotion to commission sales. In discussing Sears' data on sales performance in the hiring context, the court also referred to Sears' data on sales performance by commission salespersons during their first year after promotion. The court found that among full-time and part-time commission salespeople, the sales performance rates of the males exceeded the rates of the females. The court determined that the men Sears hired and promoted into commission sales were more successful salespeople, and inferred that they had more of the true qualifications for commission sales than did the women. The court found this true for all new hires and promotions, among the top 10 % of the commissions salesmen and saleswomen, and among the bottom 10 % of commission salespersons.\n\nThe EEOC, in response to the performance issue in the hiring context, states that only the bottom 10 % of the hires or promotions are important to a discrimination claim because if Sears did discriminate against women, it was to be expected that women still should have lower performance rates than men on average and in the top 10 %. Sears cites expert witness testimony in claiming that it is not to be expected that women would have lower performance rates than men.\n\nIt is true that in their first year after being promoted, men outperformed women each year from 1974 to 1980 in the full-time case overall, and in the top 10 % of salespersons. In the bottom 10 %, the performance of men and women was relatively equal, although men still outperformed women slightly. In the part-time case, there was a smaller sample, but men clearly outperformed women in the top 10 % and usually outperformed women overall. The performance rates in the part-time case were about the same. Based on this data, we cannot say that the judge clearly erred in determining that men usually possessed more of the qualifications for commission selling (even though, as the EEOC argues, Sears has not identified in this data whether the promotions have come from noncommission sales). The EEOC's criticisms go to the hiring figures, and even if they are applied to the promotion data, we do not believe they undermine the essential validity of those figures. We conclude that the judge did not err in inferring from these performance figures that men usually possessed more of the qualifications for commission sales jobs than did women.\n\n3. Conclusion-Promotions\n\nThe district court's conclusions regarding the promotion claim also incorporated its decisions regarding the absence of individual victim testimony and Sears' affirmative action efforts.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e We have previously determined that these considerations were justified in the context of the claim of hiring discrimination, and see no reason not to apply them to the promotion context as well. Indeed, we think that the absence of individual victim testimony is even more difficult to understand in the promotion context.\n\nAlthough there may have been some reliability problems in Sears' interest adjustments, the question is not whether the interest adjustments alone totally eliminate the promotion disparities. The question is rather whether the court clearly erred in determining that interest adjustments along with other considerations such as differences in qualifications, the lack of individual victim testimony, and Sears' affirmative action efforts negate any inferences of intentional discrimination against women in promotions to commission selling. We conclude that the district court did not clearly err.\n\nIII. DISPARATE TREATMENT -- WAGE DISCRIMINATION\n\nThe EEOC attempted to prove, again almost solely by statistical (multiple regression) analyses, that Sears discriminated against women employed in checklist management positions by paying them less than men with similar jobs. Checklist employees at Sears are salaried executive management, professional, and administrative employees.\n\nAlthough the EEOC originally brought wage discrimination claims under both the Equal Pay Act and Title VII, it later dropped its claims under the Equal Pay Act. A preliminary issue is whether the district court correctly held that the EEOC in this case had to meet the equal work standard of the Equal Pay Act\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e to prove a case of Title VII sex discrimination in pay. The EEOC claims that the district court incorrectly interpreted County of Washington v. Gunther, 452 U.S. 161, 68 L. Ed. 2d 751, 101 S. Ct. 2242 (1981), in which the Supreme Court held that a Title VII plaintiff could in certain circumstances bring a claim of wage discrimination without meeting the equal work standard of the EPA. The EEOC argues that the district court mistakenly held that this case was not within the purview of Gunther, and therefore erred in requiring it to prove that men and women had substantially equal jobs in its Title VII pay discrimination claim. We believe the district court accurately recognized the limited scope of Gunther and correctly determined that this case fell outside that scope.\n\nBefore Gunther, courts determined that to construe Title VII harmoniously with the EPA in addressing wage discrimination claims, Title VII plaintiffs alleging discrimination in pay would have to meet the equal work standard of the EPA. See Plemer v. Parsons-Gilbane, 713 F.2d 1127, 1131 (5th Cir. 1983); see, e.g., DiSalvo v. Chamber of Commerce, 568 F.2d 593, 596 (8th Cir. 1978); Orr v. Frank R. MacNeill \u0026 Son, 511 F.2d 166, 171 (5th Cir.), cert. denied, 423 U.S. 865, 96 S. Ct. 125, 46 L. Ed. 2d 94 (1975); Ammons v. Zia Co., 448 F.2d 117, 119-20 (10th Cir. 1971).\n\nIn Gunther, female prison guards could not meet the equal work standard of the EPA because their jobs involved guarding substantially fewer female prisoners than male prison guards guarding male prisoners, and female prisoners were less dangerous than male inmates. The Supreme Court found it significant, however, that the female guards alleged that a comparable worth study commissioned by Washington County showed the female guards should be paid 95 % of what male guards were paid. The female guards also alleged that they were only paid 70 % of what the male guards received, and that this difference in treatment constituted intentional sex discrimination. The Court held that in such a case, the female guards did not have to meet the equal work standards of the EPA to prove intentional sex discrimination in pay under Title VII. Gunther, 452 U.S. at 180-81.\n\nThe EEOC argues that the district court erred in refusing to relax the EPA equal work standard by not applying Gunther to this case. Our reading of Gunther and subsequent interpretations of that case convinces us, however, that the district court correctly determined that this Title VII wage discrimination claim does not fall within the scope of Gunther.\n\nThe district court did not, as the EEOC suggests, limit Gunther to its facts by recognizing that the Gunther court was careful to limit the scope of its own decision. This is evident at several passages of the Gunther opinion. The Gunther court \"emphasize[d] at the outset the narrowness of the question before [it] in [that] case,\" which was whether the female prison guards' claim, based on direct evidence that \"their wages were depressed because of intentional sex discrimination,\" (not a comparable worth claim), precluded their proceeding under Title VII because they could not meet the equal work standard of the EPA. Gunther, 452 U.S. at 166 \u0026 n.8. That intentional sex discrimination, according to the Court, consisted of \"setting the wage scale for female guards, but not for male guards, at a level lower than its own survey of outside markets and the worth of the jobs warranted.\" Id. at 166. The Court ended its opinion by emphasizing that its decision did not threaten the wage structure of every employer by allowing Title VII plaintiffs to compare job content and pay \"'between any job predominantly performed by women and any job predominantly performed by men,'\" because the suit in that case did \"not require a court to make its own subjective assessment of the value of the male and female guard jobs, or to attempt by statistical technique or other method to quantify the effect of sex discrimination on the wage rates.\" Id. at 180-81 (quoting petitioners' brief).\n\nThis court analyzed the contours of Gunther in American Nurses' Association v. State of Illinois, 783 F.2d 716, 720-22 (7th Cir. 1986). We emphasized the narrowness of that holding, stating that\n\nall that [ Gunther ] seems to mean, as the dissenting Justices pointed out, is \"that even absent a showing of equal work, there is a cause of action under Title VII when there is direct evidence that an employer has intentionally depressed a woman's salary because she is a woman. The decision today does not approve a cause of action based on a comparison of the wage rates of dissimilar jobs.\"\n\nId. at 721 (quoting Gunther, 452 U.S. at 204 (emphasis in original)). We also discussed American Federation of State, County and Municipal Employees v. Washington, 770 F.2d 1401 (9th Cir. 1985) (AFSCME), as an example of a case in which there was insufficient evidence to establish Title VII sex discrimination in wages for different work.\n\nIn AFSCME, the state paid prevailing market rates as wages to its employees and after commissioning comparative worth studies, discovered that employees in jobs held mainly by women were paid approximately 80 % of wages received by employees in predominantly male jobs considered to be of comparable worth. The AFSCME sued the state, alleging that the state discriminated against women by not having a compensation system based on comparative worth. The Ninth Circuit held that \"job evaluation studies and comparable worth statistics alone are insufficient to establish the requisite inference of discriminatory motive,\" that it was not discriminatory to pay salaries at the prevailing wage rates, and that the state was not \"committed to implement a new system of compensation based on comparable worth as defined by the study\" it had commissioned. Id. at 1406-08.\n\nThe EEOC contends that the key distinction between AFSCME and Gunther is that in AFSCME, the employer had not adopted the comparable worth study,\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e but in Gunther, the employer had adopted it (and, as the Gunther Court found, paid women employees at a rate less than the comparable worth study had valued the job). The EEOC argues that this case is like Gunther because Sears had made a comparable worth study in the form of the Hay evaluations and had adopted the results of the study in its Executive Compensation Program. We do not think the distinction turns on whether an employer has adopted a compensation program in response to a comparable worth study. That factor may be part of the consideration, but the key distinction is whether the implementation of the compensation program in response to the study reflects discriminatory intent. As we noted in American Nurses ', \"the critical thing lacking in AFSCME was evidence that the [employer] decided not to raise the wages of particular workers because most of those workers were female.\" 783 F.2d at 722 (emphasis in original); see also Plemer v. Parsons-Gilbane, 713 F.2d 1127, 1133-34 (5th Cir. 1983) (Fifth Circuit found it significant that in Gunther \"it was shown that the employers unexplainedly departed from objective pay criteria they had adopted\"). Thus a comparable worth study is relevant in proving sex discrimination because \"it may provide the occasion on which the employer is forced to declare his intentions toward his female employees.\" American Nurses ', 783 F.2d at 721; see also Merrill v. Southern Methodist University, 806 F.2d 600, 606 (5th Cir. 1986) (court hesitated to find intentional discrimination because evidence was not like that in Gunther, i.e., plaintiff did not suggest that employer failed to abide by preannounced (or otherwise adopted) objective pay criteria).\n\nWe believe that this case does not fit within the contours of Gunther because although Sears implemented its Executive Compensation Program after the Hay job evaluations, the EEOC has not alleged or proved that this implementation evidenced Sears' discriminatory motive or intent. The EEOC never argued in district court that Sears' 1976 implementation of the Executive Compensation Program was discriminatory. The district court found that Sears' witnesses \"testified very convincingly that sex was not a factor in establishing the Executive Compensation Program with Hay Associates in 1976, or in determining at any time the pay of checklist employees.\" Sears II, 628 F. Supp. at 1352. Furthermore, the court found no evidence of discriminatory intent.\n\nThe EEOC also argues that the district court improperly required it to show direct evidence of discriminatory intent, because the circumstantial evidence provided by statistics was sufficient to indicate Sears' intent to discriminate against women in pay. As we discuss later, we do not find clearly erroneous the district court's decision that the EEOC's pay statistics did not prove discrimination. Even if we agreed that the statistics showed discrimination, we are not at all sure that this type of indirect, statistical evidence of discriminatory intent would be sufficient under Gunther. The evidence in Gunther was clear and straightforward. The comparable worth study results valued women's guard jobs at 95 % of men's guard jobs, but women guards were paid at 70 % of men guards' salaries. The Gunther court emphasized that its holding was limited to such \"direct evidence\" and that it was not a case in which a court would have to subjectively determine the value of male and female jobs\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e \"or to attempt by statistical technique or other method to quantify the effect of sex discrimination on the wage rates.\" Gunther, 452 U.S. at 180-81. The dissenting Justices in Gunther saw the case as creating a cause of action under Title VII \"when there is direct evidence that an employer has intentionally depressed a woman's salary because she is a woman. The decision today does not approve a cause of action based on a comparison of the wage rates of dissimilar jobs.\" Id. at 204 (Rehnquist, J., dissenting) (emphasis in original and added).\n\nWe believe that the district court correctly determined that the EEOC did not show the type of direct evidence of intentional sex discrimination in pay contemplated by the Gunther Court, and thus the EEOC had to meet the equal pay standard of the EPA to prove its Title VII sex discrimination in wages claim.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\n\nA brief overview of Sears' compensation practices for employees in checklist pay positions during the period at issue is helpful to our discussion of whether the EEOC met the equal work standard in its claim of sex discrimination in wages.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e Sears had two different compensation systems for checklist employees during the period 1973 to 1980. From 1973 to 1975, job content, salaries, and bonuses varied significantly among different geographic regions and facilities due to Sears' high decentralization and emphasis on individual store autonomy. Initially, Sears had job titles called \"C\" codes, but those codes did not reflect job content during 1973-1975 because the codes were imprecise from the first, and because unit managers had assigned different and additional duties over the years depending on work and the checklist employees' talents. Checklist employees' salaries and bonuses depended to a great extent on the discretion and generosity of the managers at the local levels. Regarding salaries, although there were some salary guidelines, store managers usually negotiated with employees, and made recommendations to regional managers who usually accepted those recommendations.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e Because of Sears' policy of paying the person and not the position, salaries were based on a number of factors including the employee's prior work history and salary, potential with the company, job performance, and the number of times an employee relocated (the latter of which involved substantial salary increases). Virtually all checklist employees were eligible for annual bonuses, the size of which depended greatly on the generosity of regional managers which \"varied widely,\" as well as on the employee's performance and total earnings. The court found that all of the above factors influencing the compensation of checklist employees \"caused substantial differences in compensation among checklist employees of both sexes.\"\n\nIn 1976 Sears introduced a new Executive Compensation Program, which the district court found was in response to checklist employees' perceptions of the system as \"inequitable and unwieldy\" and reflected management's desire for a system that \"would be competitive in the marketplace, have internal equity, and reward individual performance.\" Sears II, 628 F. Supp. at 1336. This Program was the culmination of two years of Sears' cooperation with Hay Associates in evaluating Sears' compensation practices. Sears used the Hay Guide Chart-Profile Method of Evaluation to evaluate jobs. The manner in which evaluators actually assessed jobs is important to determining whether the EEOC met the equal work standard, so we will go into more detail on this point.\n\nHay consultants and Hay-trained Sears employees wrote position descriptions based on the duties of an \"average\" performer of the job, for each position at Sears. Committee members, drawn from various levels at Sears, analyzed the position descriptions and systematically evaluated the content of those positions, attempting to incorporate Sears' changes in job content and structure which were part of the new system along the way, so that the positions were not actually analyzed as they were performed before or at the time of evaluation. The committees assigned each position points for the know-how, problem solving, and accountability it entailed. Sears structured salary ranges in which positions were compensated according to relative evaluation points. Sears set salary ranges with a minimum, midpoint, and maximum (going from 75 % to 120 % of a midpoint salary) for each position in 1976, and modified annually.\n\nThe court found that even after the implementation of the Executive Compensation Program and its set salary ranges, other factors such as performance evaluations, previous job history, number of relocations, seniority, geographic location, and the individual discretion of managers regarding timing and size of salary increases still influenced the salaries of individual checklist employees. The court also found that the process of phasing in the new program took several years because of Sears' policy of not reducing an employee's pay. Salary increases for employees above the maximum were cut until they came within the range. The court found that not only were salaries not standardized for \"several years\" after implementation of the Executive Compensation Program, but the company did not formally change actual job structures immediately upon implementing the program. The court found that \"Sears gradually communicated changes to employees over a period of years.\" Sears II, 628 F. Supp. at 1337. Job activities were standardized through an informal communication of changes to employees that involved changes in job evaluations and creation of new job categories.\n\nThe EEOC had the burden of meeting the equal work standard of the Equal Pay Act. EEOC v. Mercy Hospital and Medical Center, 709 F.2d 1195, 1197 (7th Cir. 1983). That standard provides that an employer may not discriminate on the basis of sex by paying unequal wages for \"equal work on jobs the performance of which requires equal skill, effort, and responsibility, and which are performed under similar working conditions.\" 29 U.S.C. ยง 206(d)(1). To succeed, the EEOC \"must establish, based upon 'actual job performance and content -- not job titles, classifications or descriptions' that the work performed . . . is substantially equal.\" Mercy Hospital, 709 F.2d at 1197 (quoting Gunther v. County of Washington, 623 F.2d 1303, 1309 (9th Cir. 1979), aff'd, 452 U.S. 161, 101 S. Ct. 2242, 68 L. Ed. 2d 751 (1981)).\n\nThe district court found that the EEOC, in attempting to prove substantial equality of the jobs at issue, did not introduce any credible evidence of job performance or content.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e Instead, the EEOC relied on the job descriptions that emanated from Sears' Hay Guide Chart-Profile Method of job evaluations to prove substantial equality. The EEOC contended that the factors measured by the Hay Method -- problem solving, know-how, and accountability -- were the equivalent of the EPA factors skill, effort, and responsibility, and that if Sears jobs received an equal number of points (for problem solving, know-how, and accountability), which would then place those jobs in the same salary range, the jobs would be \"substantially equal\" under the EPA's equal work standard. The district court found, \"EEOC therefore relies on Sears' own analysis of its job categories and codes completed in 1976 as proof that the persons in each 1976 job code were performing substantially similar work.\" Sears II, 628 F. Supp. at 1338.\n\nThe EEOC's method of comparing jobs from 1973-1975 was somewhat different. The EEOC recognized that it could not rely on the \"C\" codes assigned to various jobs, because those codes were not valid indicators of job content. The EEOC thus worked backward from the 1976 job codes, trying to develop \"correspondences\" between \"C\" job codes and 1976 job codes. Because there were many 1976 job codes associated with one \"C\" code, the process of determining correspondences involved subjective judgments by the EEOC, based on patterns of movement among jobs without any knowledge of job content. Many employees were left out of the 1973-1975 analyses because the EEOC worked backwards, comparing the 1976 job codes of persons who had not been promoted or transferred in 1976 with \"C\" job codes of those persons at year-end in 1975. To be counted in 1974, for example, an employee had to have been in the same \"C\" job code in 1974 and in 1975.\n\nThe district court found that the EEOC failed to prove by the above methods substantial equality of the jobs at issue for any year. We may not disturb this finding unless we determine that it is clearly erroneous. See Epstein v. Secretary, United States Department of the Treasury, 739 F.2d 274, 277 (7th Cir. 1984); Mercy Hospital, 709 F.2d at 1198. Because we have reviewed all the evidence and are not \"left with the definite and firm conviction that a mistake has been committed,\" United States v. United States Gypsum Co., 333 U.S. 364, 395, 92 L. Ed. 746, 68 S. Ct. 525 (1948), we affirm the district court's finding that the EEOC did not meet the equal work standard.\n\nThe EEOC argues that the district court improperly held as a matter of law that job evaluations such as the Hay Method are not probative of job equality. The EEOC has mischaracterized the district court. The court actually found that\n\nalthough the Hay evaluation of the position description developed by committees would be helpful in determining whether jobs are substantially equal, they are not a substitute for proof of actual performance. . . . Without proof of actual job performance and content, the Hay evaluations of position descriptions are inadequate to prove equal skill, effort and responsibility.\n\nSears II, 628 F. Supp. at 1342.\n\nThe EEOC cites numerous cases in support of its contention that job titles and descriptions are probative of job equality even without any corroborative evidence of job content or job performance. We recognize that language in the cases cited suggests that job titles and descriptions are probative and even \"may, in some instances, be highly probative of equal work because one would expect that actual responsibilities would, to some extent, conform to a job description.\" Epstein, 739 F.2d at 277 n.6; see also Pearce v. Wichita County, 590 F.2d 128, 133 (5th Cir. 1979) (\"Although job titles are entitled to some weight in the assessment of comparative responsibility,\" a comparison of actual duties is controlling.); Brennan v. Owensboro-Daviess County Hospital, 523 F.2d 1013, 1017 (6th Cir. 1975) (\"Although job descriptions should not be accorded as much weight as that given to the duties actually performed by employees in determining whether two jobs are substantially equal, nevertheless, we believe that they may be helpful, particularly where the descriptions of the jobs to be compared are similar and were written by the very employer who claims that wage differentials are not based on an impermissible criterion.\"), cert. denied, 425 U.S. 973, 96 S. Ct. 2170, 48 L. Ed. 2d 796 (1976); Brennan v. Victoria Bank \u0026 Trust Co., 493 F.2d 896, 899 (5th Cir. 1974) (\"the controlling factor . . . has to be job content, not the job description prepared by the employer, [but] the employer's rating of jobs [should not] be ignored simply because the employer made it, especially where, as here, the rating came after an extensive study of comparative qualifications, degrees of responsibility, and chances of loss to the Bank.\" (emphasis in original)).\n\nNone of these cases, however, supports the EEOC's contention that job titles and descriptions alone, without any corroborating evidence of job content or job performance, can prove job equality. In each case, the court recognized that job content was the controlling factor and believed it was necessary to go beyond job titles and/or descriptions to compare and contrast actual duties and job content. See Epstein, 739 F.2d at 278-80; Pearce, 590 F.2d at 133-34; Owensboro-Daviess, 523 F.2d at 1015-28; Victoria Bank, 493 F.2d at 899-900. In some cases, the court of appeals went through an extended analysis of the differences and similarities in duties and job content. See Owensboro-Daviess, 523 F.2d at 1025-28 (comparing duties of hospital aides and orderlies); Victoria Bank, 493 F.2d at 899-900 (contrasting duties of exchange tellers and note tellers); see also EEOC v. Kenosha Unified School District No. 1, 620 F.2d 1220, 1225-26 (7th Cir. 1980) (contrasting duties of predominantly female cleaners and predominantly male custodians); Horner v. Mary Institute, 613 F.2d 706, 713-15 (8th Cir. 1980) (contrasting duties of male and female physical education teachers). As we noted in Epstein, 739 F.2d at 277 n.6, \"similar job descriptions alone . . . do not require a finding of substantial equality of jobs under the Equal Pay Act.\" Indeed, identical or similar job titles can be deceiving because they do not reflect the actual duties underlying the title. See Horner, 613 F.2d at 714-15 (although \"superficially identical,\" male and female physical education jobs not substantially equal in terms of skill or responsibility); see also Angelo v. Bacharach Instrument Co., 555 F.2d 1164, 1172 (3d Cir. 1977) (\"'mechanical and surface similarities' are inadequate to establish the equality of two positions\" (quoting 109 Cong. Rec. 9196 (1963) (remarks of Rep. Frelinghuysen))); Victoria Bank, 493 F.2d at 899-900 (duties dissimilar between bank's note tellers and exchange tellers).\n\nThe EEOC argues that producing individual comparisons of job performance and content at trial was \"not feasible\" considering the size of the record and that the trial took six months of the district court's docket time. This is an unconvincing excuse, especially in light of the substantial body of case law involving the equal work standard in which courts have invariably gone beyond job descriptions to analyze, often in-depth, actual job duties and job performance. The EEOC implies that it might have wasted the court's time by introducing such evidence. The case might actually have been shorter and more effective, however, if the EEOC had introduced the right kind of evidence or tried the case in accordance with precedent. As it turns out, the EEOC's failure to introduce any evidence of actual job content or job performance is fatal to its sex discrimination in wages claim in light of Sears' evidence regarding differences in job content.\n\nThe EEOC appears to suggest that Sears had the burden of showing the inequality of job content. This line of argument is similar to that which we recognized in Epstein, 739 F.2d at 278: \"Plaintiff would, it seems, have us infer equal work from the defendants' failure to prove otherwise.\" We responded that this argument\n\nignores the elementary fact that the burden for proving the prima facie case is on the plaintiff. The plaintiff has not pointed to any record evidence, except the job descriptions, which would tend to show equal work, and on our review of the record we agree with the district court that the record is devoid of any such evidence.\n\nId. Unlike the defendant in Epstein, however, Sears did introduce evidence of differences in job content. The court found that \"Sears has shown through credible testimony that there were differences in job content of employees with the same job code.\" Sears II, 628 F. Supp. at 1342. The court also found that Sears showed the Hay Method evaluated \"idealized position descriptions,\" but in actuality job changes were phased in over a period of years after implementation of the Executive Compensation Program, and indeed, differences in job content and performance existed in early 1986. Neither of these findings are clearly erroneous.\n\nThe district court concluded that because the EEOC did not respond to Sears' evidence of differences in job content with any evidence of job performance or content to show that the differences were not significant, the EEOC did not sustain its burden of proving substantial equality of the jobs analyzed. We find ample support in the record for this conclusion. The rule is \"well established\" that \"the application of the equal pay standard depends on actual job requirements and job performance.\" Angelo v. Bacharach Instrument Co., 555 F.2d 1164, 1173 (3d Cir. 1977); see 51 Fed. Reg. 29,822 (1986) (to be codified at 29 C.F.R. ยง 1620.13(e)) (\"Application of the equal pay standard is not dependent on job classifications or titles but depends rather on actual job requirements and performance.\"). The EEOC asserts that the test is substantial equality, and argues that we should not make \"overly fine distinctions in the tasks at issue.\" Brennan v. South Davis Community Hospital, 538 F.2d 859, 861 (10th Cir. 1976). The EEOC has produced no evidence of job content or performance that would even permit us to draw distinctions between jobs. Such evidence would have allowed the district court to compare jobs in terms of the Equal Pay Act factors of skill, effort, and responsibility. Because the EEOC introduced no job content evidence, it in essence asks us to speculate whether the differences in job content brought out by Sears are minor or significant. We may not do so when the EEOC has the burden of proving in the district court the substantial equality of the jobs at issue. Job content evidence would also have indicated whether the Hay Method factors of accountability, problem solving, and know-how are actually equivalents of the Equal Pay Act factors of skill, effort, and responsibility.\n\nWe need not determine whether job descriptions based on a job evaluation such as the Hay Method can alone, without any corroborating evidence of actual job content, establish substantial job equality, because we hold in light of Sears' unrebutted evidence of unequal job content, the district court's finding that the EEOC had not sustained its burden of proving substantial equality is not clearly erroneous.\n\nAssuming that job descriptions could have persuasive value in the face of Sears' credible evidence of differences in job content, we agree with the district court that the job descriptions resulting from the Hay Method job evaluations in the circumstances of this case lacked probative value as evidence of \"substantial equality\" under the EPA's equal work standard.\n\nThe Hay Method, which evaluates jobs on the basis of \"accountability,\" \"know-how,\" and \"problem solving,\" \"does not measure jobs in terms of the statutory [EPA] standards of skill, effort, responsibility, and equal working conditions.\"\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e Marshall v. J. C. Penney Co., 464 F. Supp. 1166, 1191 (N.D. Ohio 1979); see Wheeler v. Armco Steel Corp., 471 F. Supp. 1050, 1052 (S.D. Tex. 1979) (Hay system \"is not evidence of a job being equal in skill, effort and responsibility\"). Federal regulations state that \"the fact that jobs . . . may have the same total point value under an evaluation system in use by the employer does not in itself mean that the jobs concerned are equal according to the terms of the statute.\" 51 Fed. Reg. 29,822 (1986) (emphasis added) (to be codified at 29 C.F.R. ยง 1620.13(e)). On appeal, the EEOC asserts that the Hay factors are \"virtually identical to the statutory factors,\" but cites to nothing in the record where it attempted to equate the two sets of factors, showing how the point values in the Hay evaluation system could be equivalent to an analysis using the statutory factors.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\n\nIn addition, the district court found that the Hay Method was an inaccurate means of measuring job equality \"in a number of instances\" in this case because of various errors by Sears in the evaluation process. Sears II, 628 F. Supp. at 1342. These errors, which resulted in employees classified into job codes that did not correspond to their duties, led the court to conclude that the EEOC, who relied on Sears' faulty analysis of these jobs, had not proved substantial equality of jobs in four of the fifty-one job codes. We cannot say that finding is clearly erroneous.\n\nThe failure of EEOC's reliance on job descriptions emanating from the Hay Evaluation Method in proving substantial equality is exacerbated in the years 1973 to 1975. Sears' label \"artificial workforce,\" used to describe the results of the EEOC's tracing back method, is not altogether inappropriate. The record amply supports the district court's findings that the \"correspondences\" between various \"C\" code jobs and 1976 job codes were based on patterns of movement without taking job content into consideration. The EEOC introduced no other credible evidence regarding job content for those years, and because of the EEOC's \"tracing back\" method, substantial numbers of employees (those who transferred, left Sears, or were promoted, even to \"corresponding\" jobs), were excluded from the analysis. The court did not clearly err in concluding that the EEOC failed to prove substantial equality during 1973-1975, and even if it could prove substantial equality, its analysis failed to create a reasonable inference of a nationwide pattern or practice of sex discrimination by Sears.\n\nOur analysis of the EEOC's claim of Title VII sex discrimination in wages for checklist employees at Sears can end here because the EEOC has failed to satisfy its burden of proof regarding the equal work standard. See Spaulding v. University of Washington, 740 F.2d 686, 700 (9th Cir.), cert. denied, 469 U.S. 1036, 105 S. Ct. 511, 83 L. Ed. 2d 401 (1984) (\"We will not . . . infer intent merely from the existence of wage differences between jobs that are only similar.\"); cf. Horner v. Mary Institute, 613 F.2d 706, 715 (8th Cir. 1980) (if plaintiff has failed to establish substantial equality, any wage disparity is irrelevant under the Equal Pay Act). We also note, however, that the district court's finding that the EEOC had not proved sex discrimination in wages through its flawed multiple regression analyses is not clearly erroneous.\n\nAlthough EEOC's expert Siskin performed two multiple regression analyses incorporating different sets of variables, he relied on only one regression analysis to support his conclusion that significant wage disparities existed. The district court held that \"EEOC's statistical analyses [were] so flawed that they lack[ed] any persuasive value.\" Sears II, 628 F. Supp. at 1342. We reiterate that the court's findings regarding statistical evidence are accorded even more deference than typical findings of fact, which are subject to the clearly erroneous standard of review. Soria v. Ozinga Brothers, Inc., 704 F.2d 990, 995 n.6 (7th Cir. 1983).\n\nThe EEOC states on appeal that the district court's conclusions regarding its regression analyses exhibit \"an irrational belief that statistical proof is not adequate to model Sears' 'complex' decision making process.\" We disagree. We believe that the district court correctly recognized the limits of regression analysis. Our review of the court's careful and considered discussion of the EEOC's statistical evidence reveals that the court was not overawed by the results of the statistical analysis, but instead had a healthy distrust of the ability of regression analyses to explain the factors involved in management salary decisions. Such a skepticism \"may be justified.\" Coates v. Johnson \u0026 Johnson, 756 F.2d 524, 539 (7th Cir. 1985); see Lewis v. Bloomsburg Mills, Inc., 773 F.2d 561, 578 (4th Cir. 1985) (remanding case for a more complete factual finding, court stated it was \"not suggest[ing] that there may not be a plausible basis for rejecting . . . statistical evidence or . . . finding it not sufficiently probative of the claim\"); Mozee v. Jeffboat, Inc., 746 F.2d 365, 371 (7th Cir. 1984) (court noted that \"frequently subjective and other intangible factors may influence employment decisions and that even subjective misjudgments may not necessarily be the basis for Title VII liability\" (emphasis in original)); Allen v. Prince George's County, 737 F.2d 1299, 1305 (4th Cir. 1984) (\"Courts have not always admitted multiple regression [salary] analyses, and when admitted, they have sometimes been used as an aid to the understanding of the parties' position, rather than as probative of what they purport to show.\"); Fisher, Multiple Regression in Legal Proceedings, 80 Colum. L. Rev. 702, 714 (1980) (multiple regression analysis may be helpful in certain circumstances, but \"it is not a substitute for thought\"). The court definitely did not show an outright hostility toward statistics, as the EEOC suggests.\n\nThe court recognized two specific limitations, among others, that we believe illustrate the court's careful consideration of the limitations of regression analyses and which we cannot say are clearly erroneous. First, the court noted that if important variables are omitted from the model, \"the effect of sex on compensation estimated by the model will be artificially inflated\" because the dependent variable sex will reflect not only any effect of sex, but also the residual effect of the omitted variables that affect salary. Sears II, 628 F. Supp. at 1344. Second, the court found significant a Sears case study that compared the salaries of two male checklist employees with very similar employment histories. The salaries of these employees differed by as much as $600 per month, but Sears' multiple regression model could not explain the difference in salary. The court noted, \"if these employees had been of different sexes, much of this salary disparity would have been attributed to sex discrimination.\" Id. at 1348.\n\nWe also believe the district court appropriately considered the statistical analyses according to the spirit of the Supreme Court's recent opinion Bazemore v. Friday, 478 U.S. 385, 106 S. Ct. 3000, 92 L. Ed. 2d 315 (1986). The district court here did not, as the Bazemore Court found deficient in that court of appeals' treatment of a regression analysis, hold a regression analysis \"unacceptable as evidence\" solely because it \"did not include 'all measurable variables thought to have an effect on salary level.'\" Id. at 3009. The district court here found several defects, which we discuss briefly below, that \"affect[ed] the analysis' probativeness, not its admissibility.\" Id.; see Griffin v. Board of Regents, 795 F.2d 1281, 1290 n.16 (7th Cir. 1986) (\"Multiple regression analysis is likely to be inappropriate . . . unless the model includes all of the major variables likely to have an effect on the dependent variable.\"); Eastland v. TVA, 704 F.2d 613, 623 (11th Cir. 1983), cert. denied, 465 U.S. 1066, 104 S. Ct. 1415, 79 L. Ed. 2d 741 (1984). As the Supreme Court noted, \"whether, in fact, such a regression analysis does carry the plaintiffs' ultimate burden will depend in a given case on the factual context of each case in light of all the evidence presented by both the plaintiff and the defendant.\" Bazemore, 106 S. Ct. at 3009 (emphasis added). The court did consider all the evidence and properly took into account the limits and probative value of the statistical analyses.\n\nWe hold that the district court's findings underlying its conclusions that the EEOC's regression analysis was flawed are not clearly erroneous. We briefly address the EEOC's most serious criticisms of those findings. First, the court found that the data base underlying EEOC's regression analysis was inaccurate. The EEOC challenges this finding by asserting that the data were \"unavailable.\" Sears showed, however, that some of the data were indeed available to the EEOC (on paper records regarding individual Sears employees instead of on Sears' computerized personnel tapes, on which the EEOC exclusively relied) and that the EEOC for some unexplained reason did not analyze the paper records. In addition, Sears demonstrated that the data indeed made a difference in the results of the regression analyses. The district court did not clearly err in determining that the EEOC's regression analysis was entitled to less weight because of the inaccurate and incomplete data underlying that analysis.\n\nThe EEOC argues that certain variables the court found the EEOC should have included in its regression analyses were not job related or correlated with salary. Although we will not go so far as to say that the EEOC should have included the factor of pre-Sears experience, because data on that were not available to either Sears or the EEOC, we agree with the district court that prior timecard responsibility and the number of employee relocations were variables that the EEOC should have included in its analysis. There is ample evidence, including testimony in the record, and also case law, indicating that these omitted factors have a bearing on salary. The EEOC refers to one of its exhibits that purports to show that certain variables do not correlate with salaries because they do not, individually, have a bearing on the statistical analysis. This may be an acceptable method of testing the correlation of a variable with salary. See Coates v. Johnson \u0026 Johnson, 756 F.2d 524, 546 (7th Cir. 1985) (\"'the size and statistical significance of the controversial qualification will illuminate the question of whether the qualification was in fact considered'\" (quoting D. Baldus \u0026 J. Cole, Statistical Proof of Discrimination ยง 8.23, at 100 (Supp. 1984)); Gwartney, Asher, Haworth \u0026 Haworth, Statistics, the Law and Title VII: An Economist's View, 54 Notre Dame Law. 633, 657 (1979) (\"If a potential skill factor is not related to the employment opportunities offered by the employer, the variable will be statistically unrelated to earnings. In contrast, when statistical analysis illustrates a consistent link between the skill factor and higher earnings, this constitutes evidence that the skill factor is job-related.\"). Sears has identified a problem with this reasoning, however, and we have our own doubts. Sears contends that it is misleading to identify the effect of individual variables on salary, because some variables jointly contributed to influence salary. Furthermore, the EEOC appears to argue that because a factor is not job related, it must be gender-correlated and therefore skews the results because the variable diminishes the effect the sex variable would otherwise have had. However, the EEOC cites no part of the record that would support that idea. It seems to us that even if a factor was gender-correlated, if it is a neutral, legitimate factor such as the number of job relocations (which proportionately more men than women had), and evidence indicated that that factor had an effect on salary, that factor should be included in the regression.\n\nThe EEOC attempts to sidestep the district court's finding regarding defects in the EEOC's regression model, arguing that Sears' model had similar and even greater defects. We need only address one aspect of the court's criticisms of the EEOC's model to affirm the court's finding. The district court found that the most important flaw in the EEOC's model is that it aggregated data nationwide (because only a few employees occupied some jobs on a more local level), when salary decisions at Sears were made at the local level and decisionmakers at that level had considerable discretion. Sears' analyses showed that wage disparities differed by territory. The EEOC argues that every salary decision had to be approved by the territorial office, but Sears refuted this contention. The court did not clearly err in this determination. The EEOC could have analyzed local salary decisions through a case study approach, but it chose not to do so.\n\nBriefly, we note that we also do not consider clearly erroneous the district court's finding that it was significant again in this wage claim that the EEOC produced no individual testimony of acts of wage discrimination. Neither did the court clearly err in finding important the Sears' management witness testimony that Sears did not discriminate regarding compensation in the period at issue.\n\nWe need not discuss the court's treatment of Sears' regression analyses, except to the extent that it identified the problems in the EEOC's analysis (for example, Sears' stepwise regressions demonstrated that inclusion of variables reduced disparities to the point that they were not statistically significant). The court also used Sears' evidence from its cohort analyses to conclude that EEOC's regression analyses did not \"accurately reflect Sears' complex, nondiscriminatory decision-making processes.\" Sears II, 628 F. Supp. at 1352. In the cohort analyses, Sears compared the increases in salary among checklist male and female employees, with the result that women were treated as favorably or more so than men. The EEOC argues that these cohort analyses are invalid because \"results showed that men were given higher initial checklist salaries in 74 % of the job-years analyzed,\" and \"disparities in starting checklist salaries were statistically significant in two of the five years when tested individually.\" Sears did a cohort analysis, however, that indexed salary for men and women in cohorts from 1973 through 1979 and set the index for women at a value that reflected the initial difference in pay estimated by Sears' multiple regression analysis. Men were indexed at 100, and women were indexed at 91 in 1974 -- by 1979, women were indexed at more than 97. The results again showed that women were just as favorably or more favorably treated than were men in salary increases. We do not find clearly erroneous the court's conclusion that the cohort analyses were \"the most complete evidence in this case regarding Sears' treatment of similarly situated checklist men and women.\" Id. Although the EEOC's argument is appealing at first glance, it assumes that sex is the only factor accounting for the differences in initial checklist pay between men and women. The mere fact that EEOC felt the need to do a multiple regression analysis, acknowledging that at least some variables other than sex affect salary, shows that the EEOC knows better than to claim that differences in initial checklist pay between men and women are solely due to sex. The EEOC does not challenge Sears' indexing of the initial salaries.\n\nWe conclude that the district court did not clearly err in determining that the EEOC's regression analyses were not probative of sex discrimination in wages of checklist employees at Sears.\n\nIV. AFFIRMATIVE ACTION\n\nThe district court concluded that Sears' affirmative action evidence demonstrated that Sears had no intent to discriminate against women in either hiring, promotions, or pay. The EEOC argues that the district court erred in this determination, and clearly erred in finding that Sears had an affirmative action program since 1968 that made the movement of women into commission sales a priority.\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e A district court's finding regarding intent to discriminate is a finding of fact subject to the clearly erroneous standard. See Pullman-Standard v. Swint, 456 U.S. 273, 289, 72 L. Ed. 2d 66, 102 S. Ct. 1781 (1982). This finding is thus clothed with a \"strong presumption of validity.\" Hillsborough County v. Automated Medical Laboratories, Inc., 471 U.S. 707, 721, 85 L. Ed. 2d 714, 105 S. Ct. 2371 (1985).\n\nWe cannot say that the district court's finding that Sears had no intent to discriminate against women in hiring or promotions into commission sales is clearly erroneous. The EEOC contends that the existence of an affirmative action program is not enough to support a finding of no intent to discriminate. Cf. EEOC v. Keco Industries, Inc., 748 F.2d 1097, 1101 (6th Cir. 1984) (\"Compliance with the affirmative action requirements of one federal agency does not automatically translate into compliance with Title VII.\"). The Second Circuit has noted, however, that\n\nthe existence of a comprehensive affirmative action program is the antithesis of a pattern and practice of discrimination based on sex. Such a program is evidence of an intent to eliminate gender as an employment criteria [sic] and to root out subtle forms of discrimination. It thus directly controverts a claim that discrimination is the \"standard operating procedure.\"\n\nCoser v. Moore, 739 F.2d 746, 751 (2d Cir. 1984) (quoting International Brotherhood of Teamsters v. United States, 431 U.S. 324, 336, 52 L. Ed. 2d 396, 97 S. Ct. 1843 (1977)).\n\nThe EEOC essentially argues that the evidence of affirmative action is weak and cannot support a finding of no intent to discriminate. EEOC maintains that \"in a typical affirmative action program, an employer will set a long range goal for a group's representation in a certain job category, e.g., 40 %, then by hiring the group at a rate considerably above 40 % enable itself to reach the 40 % goal sooner than if it simply hired at 40 %.\" It cites as an example United Steelworkers v. Weber, 443 U.S. 193, 199, 61 L. Ed. 2d 480, 99 S. Ct. 2721 (1979), in which the company set hiring goals equal to the percentage of blacks in the local labor forces, the work force in one area was 39 %, and the company mandated that 50 % of new trainees in craft openings would be black until the percentage of blacks in that division approximated 39 %. The EEOC then argues that although according to Sears it had set a long range goal of 38 % as early as 1969, \"at no time prior to the full implementation of the MAG program (nor for some time thereafter) did the full time hiring rate for women even approach 38 %, much less exceed it.\"\n\nWe nonetheless find the district court's finding that Sears actually had \"a long and serious commitment to affirmative action\" was not clearly erroneous. Sears II, 628 F. Supp. at 1324. The type of affirmative action plan in Weber may be laudable, but it is not the only valid form of plan. The district court in this case found that \"attracting women to commission sales at Sears has been an important priority in Sears' affirmative action programs since . . . 1968.\" Id. at 1306. The EEOC argues that this finding is clear error, but the record evidences support for the court's finding. For example, Sears' first Equal Opportunity Director, Ray J. Graham, whose testimony the court found \"highly credible and entitled to great weight,\" id. at 1292 n.11, testified that \"since 1968, increasing the number of women in commission sales has been part of Sears' affirmative action program,\" and at another point, that \"Sears was aggressively seeking women in commission sales in the early '70s . . . before the adoption of the MAG plan.\" This testimony was corroborated by other evidence.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e The EEOC may be arguing that there is no documentary evidence regarding the initiation of this policy, but the district court found the testimony credible, and we must accord that finding even more deference, unless it is internally inconsistent, than we do noncredibility factual findings. See Anderson v. City of Bessemer City, 470 U.S. 564, 575, 84 L. Ed. 2d 518, 105 S. Ct. 1504 (1985).\n\nRegarding Sears' affirmative action program during the period of the charges at issue (roughly 1972 to 1980), the court relied on the description of the Mandatory Achievement of Goals (MAG) affirmative action program, fully implemented in 1974, and \"the testimony of the Sears' officials and employees, whom the court found to be highly credible witnesses,\" Sears II, 628 F. Supp. at 1294, who testified based on their own personal experiences how Sears tried to recruit women into commission sales positions. We do not find the court's findings that the requirements of Sears' affirmative action programs \"highly influenced\" all aspects of the hiring process or that the testimony of Sears' witnesses reflected the \"sincere dedication and commitment of Sears management at all levels to affirmative action,\" id. at 1294, to be clearly erroneous.\n\nIn short, the district court's finding of no intent to discriminate based on its findings that Sears was committed to affirmative action is not clearly erroneous.\n\nV. DAY'S LEAVE WITH PAY PROVISION\n\nThe EEOC contends that the district court erred in denying partial summary judgment\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e on its claim\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e that Sears discriminated against women in violation of Title VII because during an eighteen-month period ending October 1, 1974, a provision in the Sears Personnel Manual allowed a male employee a day of paid leave when his wife gave birth.\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e There was no equivalent provision for female employees allowing them a day's pay when they gave birth.\n\nOur review of a district court's summary judgment determination is de novo, and we apply the same standards as those applied by the district court. See Roman v. United States Postal Service, 821 F.2d 382, 385 (7th Cir. 1987); In re Colonial Discount Corp., 807 F.2d 594, 596 (7th Cir. 1986), cert. denied, 481 U.S. 1029, 107 S. Ct. 1954, 95 L. Ed. 2d 526 (1987); 6 J. Moore \u0026 J. Wicker, Moore's Federal Practice para. 56.27[1] (1987 \u0026 Cum. Supp. 1986-1987). We must first determine whether there are any genuine issues of material fact, drawing all reasonable inferences in favor of the non-movant Sears. If we find no genuine issues of material fact, we then must determine whether the EEOC is entitled to summary judgment as a matter of law. See DeValk Lincoln Mercury, Inc. v. Ford Motor Co., 811 F.2d 326, 329 (7th Cir. 1987); Fed. R. Civ. P. 56(c).\n\nFurthermore, we must consider the burden on the movant EEOC. Rule 56(c) provides that the party moving for summary judgment has the \"burden of showing the absence of a genuine issue as to any material fact,\" Adickes v. S. H. Kress \u0026 Co., 398 U.S. 144, 157, 26 L. Ed. 2d 142, 90 S. Ct. 1598 (1970), and that he or she is entitled to judgment as a matter of law, see Fed. R. Civ. P. 56(c). \"'Where the evidentiary matter in support of the motion does not establish the absence of a genuine issue, summary judgment must be denied even if no opposing evidentiary matter is presented.'\"\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e Adickes, 398 U.S. at 160 (quoting Fed. R. Civ. P. 56(e) advisory committee note (1963)) (emphasis added by Supreme Court); Big O Tire Dealers, Inc. v. Big O Warehouse, 741 F.2d 160, 163 (7th Cir. 1984).\n\nThe district court held that the EEOC failed to meet its burden because it did not establish a prima facie case that the day's-leave-with-pay provision amounted to an enforced discriminatory policy. We cannot say that the district court erred in this conclusion.\n\nThe EEOC does not dispute the district court's determination that a plaintiff in a Title VII disparate treatment action must present a prima facie case of discrimination, whether in attempting to defeat a defendant's motion for summary judgment or to prevail on a summary judgment motion. See Parker v. Federal National Mortgage Association, 741 F.2d 975, 979-80 (7th Cir. 1984); Kephart v. Institute of Gas Technology, 630 F.2d 1217, 1219 (7th Cir. 1980), cert. denied, 450 U.S. 959, 101 S. Ct. 1418, 67 L. Ed. 2d 383 (1981); Weahkee v. Perry, 190 U.S. App. D.C. 359, 587 F.2d 1256, 1265 (D.C. Cir. 1978). The EEOC instead disputes what the district court stated such a showing of a prima facie case entails.\n\nThe district court relied on the standard established in International Brotherhood of Teamsters v. United States, 431 U.S. 324, 360, 52 L. Ed. 2d 396, 97 S. Ct. 1843 (1977) and followed by this court in Coates v. Johnson \u0026 Johnson, 756 F.2d 524, 532 (7th Cir. 1985), that plaintiffs in a pattern-or-practice government or class discrimination claim have the initial burden of showing that the unlawful discrimination was the employer's regular policy. A plaintiff must \"establish a prima facie case that such a [discriminatory] policy existed.\" Teamsters, 431 U.S. at 360. In other words, a plaintiff would have to prove \"by a preponderance of the evidence that [the] discrimination was the company's standard operating procedure -- the regular rather than the unusual practice.\" Id. at 336.\n\nThe EEOC argues that it met this burden by showing that the allegedly discriminatory day's-leave-with-pay provision existed in the Sears Personnel Manual for an eighteen-month period. The district court rejected the EEOC's statement that \"'absent evidence by Sears that the policies were not implemented, the necessary presumption is that the policies were implemented and did affect individuals.'\" Sears II, 628 F. Supp. at 1275 (quoting EEOC's reply brief). The court held that the existence of the provision alone was not enough to show a prima facie case that a discriminatory policy existed, and that to show such a prima facie case the EEOC would have had to provide some evidence that the provision was enforced. According to the court, the EEOC could have done this either by identifying \"some victims\" or by producing \"some valid direct or circumstantial evidence to show that Sears actually followed the polic[y] in its treatment of employees.\" Id. at 1276.\n\nWe think the district court applied a fair interpretation of the case law and properly took into account summary judgment considerations in determining that the EEOC did not show a prima facie case of discrimination and thus was not entitled to summary judgment. The judge properly determined that the EEOC had to show more than the allegedly discriminatory provision alone to establish a prima facie case that the provision was a regular policy rather than an unusual practice. The district court cited Durant v. Owens-Illinois Glass Co., 517 F. Supp. 710 (E.D. La. 1980), aff'd, 656 F.2d 89 (5th Cir. 1981) (per curiam), in support of this holding. In Durant, the plaintiffs produced an allegedly discriminatory maternity leave provision that had been set out in the employer's \"Production and Maintenance Contract\" in an effort to show the employer discriminated against women. The district court held that the plaintiffs had not met their burden of showing the existence of a discriminatory policy because they were \"unable to show that anyone was affected by the attacked provision, which was never enforced and which ceased to be a part of the collective bargaining agreement six years ago.\" Id. at 723; cf. Tuma v. American Can Co., 373 F. Supp. 218, 230 (D.N.J. 1974) (employer's policy barred job to females, but female employees had not bid for the job so could not show any impact on them stemming from the illegal policy); Kuck v. Berkey Photo, Inc., 85 F.R.D. 39, 43 (S.D.N.Y. 1979) (\"absence of a showing of injury in fact to the plaintiff has generally been held to bar all judicial intervention in a case\"). The Durant case is some (although perhaps weak) authority for the proposition that an allegedly discriminatory provision is not automatically the equivalent of a discriminatory policy for purposes of establishing a prima facie case of discrimination absent some showing of enforcement or application of the provision. The EEOC has cited no cases to the contrary, and our research has disclosed no such cases. Furthermore, the language of Teamsters and Coates suggests that to establish a prima facie case of discrimination, a plaintiff must show more than just one instance of discrimination (which was not even shown here) -- the plaintiff must show that the policy was \"standard operating procedure -- the regular rather than the unusual practice.\"\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e Cf. Cooper v. Federal Reserve Bank, 467 U.S. 867, 878, 81 L. Ed. 2d 718, 104 S. Ct. 2794 (1984) (in determining pattern-or-practice liability, observing that \"a class plaintiff's attempt to prove the existence of a company-wide policy, or even a consistent practice within a given department, may fail even though discrimination against one or two individuals has been proved\"); General Telephone Co. v. Falcon, 457 U.S. 147, 159 n.15, 102 S. Ct. 2364, 72 L. Ed. 2d 740 (1982) (finding that an individual employee's claim of discriminatory treatment did not necessarily qualify the employee as an adequate class representative of individuals who allegedly had similar claims and stating that \"it is noteworthy that Title VII prohibits discriminatory employment practices, not an abstract policy of discrimination\" (emphasis in original)). The district court was faced with deciding whether the EEOC had shown the absence of a genuine issue as to any material fact. See Adickes v. S. H. Kress \u0026 Co., 398 U.S. 144, 157, 26 L. Ed. 2d 142, 90 S. Ct. 1598 (1970). The court legitimately could have determined that an issue of fact remained regarding whether the day's-leave-with-pay provision was ever enforced. The EEOC did not show any examples of enforcement or application of the provision, and thus showed no evidence of actual injury of the type Title VII was designed to remedy.\n\nThe EEOC attempts to distinguish Durant, noting that in Durant the defendant presented testimony that the allegedly discriminatory policy was never enforced, but that in this case Sears offered no such evidence. At another point, the EEOC complains that the district court improperly required that the EEOC prove that Sears complied with a provision in its personnel manual when Sears had not contested that it had not complied, or even raised a genuine issue of material fact. These arguments reflect the EEOC's confusion regarding its responsibility as a party moving for summary judgment. The EEOC implies that Sears, the nonmoving party, had the burden of raising a genuine issue of material fact when it actually was the EEOC's burden to establish that no genuine issue as to any material fact existed and that the EEOC was entitled to summary judgment as a matter of law. See Wilmes v. United States Postal Service, 810 F.2d 130, 131-32 (7th Cir. 1987); see also Watts v. United States, 703 F.2d 346, 347 (9th Cir. 1983) (\"summary judgment is neither a method of avoiding the necessity for proving one's case nor a clever procedural gambit whereby a claimant can shift to an adversary the burden of proof on one or more issues\"). We agree with the district court that the EEOC failed to meet this burden and thus was not entitled to summary judgment on its contention that the day's-leave-with-pay provision violated Title VII.\n\nVI. CROSS APPEAL\n\nSears cross appeals from the district court's failure to dismiss the EEOC's suit after determining that the statutorily mandated preconditions to suit were conducted amidst alleged conflicts of interest. In view of our affirmance of this case on the merits there is less need to resolve this cross appeal, but it nevertheless deserves consideration.\n\nThis part of the case was decided by Judge Grady before the balance of the case for decision on the merits was reassigned to Judge Nordberg in May 1982. EEOC v. Sears, Roebuck \u0026 Co., 504 F. Supp. 241 (N.D. Ill. 1980). Judge Grady dealt with this conflicts issue extensively and resolved it in favor of the EEOC by denying the motion to dismiss. In doing so, however, he found that certain alleged abuses of the EEOC were not controverted, and that \"the appearance of partiality on the part of the Commission [was] palpable.\" Id. at 251. He also expressed some misgivings as to the possible effect his ruling denying the motion might have on the future conduct of the EEOC and its employees. He therefore made it clear that he was not condoning the conduct of the EEOC and certain of its personnel. One of his reasons for not dismissing was that he anticipated de novo review during the trial on the merits, which he considered would render the preliminary improprieties harmless. Again Judge Grady warned, however, that de novo review could not always be counted on to render the preliminary errors harmless. We join in those admonitions. Since then the Supreme Court has decided Young v. United States ex rel. Vuitton et Fils S.A., 481 U.S. 787, 107 S. Ct. 2124, 95 L. Ed. 2d 740 (1987), which Sears argues makes dismissal even more appropriate.\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e\n\nWe affirm Judge Grady's denial of the motion to dismiss which would have been, as he called it, the \"extreme sanction,\" but we likewise do so with considerable misgivings. Young, which we will consider in more detail, is not sufficient to tip the balance in the particular circumstances of this case. The results reached in Young and in this case are different, but the messages are the same. \"We must have assurance that those who would wield this power will be guided solely by their sense of public responsibility for the attainment of justice.\" Young, 107 S. Ct. at 2141. It cannot be said any better than that. With the hindsight afforded to us after the trial our misgivings are perhaps even greater than were Judge Grady's. Judge Grady was rightly concerned with the harm that might result to the \"real parties in interest,\" not Sears, but its employees. As it turned out, however, none of the \"real parties in interest\" were produced as witnesses by the EEOC. The \"real parties in interest\" could only be glimpsed in the shadows of the statistical analysis of the EEOC's expert witness. Before considering Judge Grady's opinion and the import of Young it is necessary to briefly review the factual background of this problem to fully appreciate its insidious effect, an effect that may be evident in the weaknesses of the EEOC's case. In any event it has had an impact on the judicial system as well as on the parties. To permit such conflicts to exist can only harm the good causes which EEOC seeks to promote.\n\nSeldom in a statistical evidence case do we find a problem similar to the one in this case. Here a high-ranking lawyer in the EEOC, David A. Copus, was motivated in his official duties more by his devotion to the National Organization for Women , than he was by the high calling of his government position. To this conflict also was added a personal relationship which compounded the problem. We will tell the story, but only briefly.\n\nThe story begins in 1972, when NOW set as one of its goals a \"major national action against a large chain retailer.\" NOW's Compliance and Enforcement Task Force was at the same time considering what could be done about Sears on a nationwide basis. At NOW's 1973 national convention, Copus, a member of that Task Force, recommended an effort to \"demand\" a settlement from a large, highly visible corporation, a corporation conscious of its image that employed women in traditional female jobs. At the convention NOW conducted a workshop about how to demonstrate against the target, \"Snears-Doebuck.\" Later that spring an urgent message appeared in the newsletter of the District of Columbia chapter of NOW calling for volunteers to join the campaign by calling Copus at the EEOC or at his home, giving both numbers and advising to keep trying to reach him because time was of the essence. In the spring of 1973 Copus, who reported directly to the EEOC Chairman, was given the responsibility of heading the EEOC's National Programs Division (NPD), and in particular was put in charge of the Sears investigation. By August 1973, Copus was well underway, assisted by other NOW members whom he had hired. Copus and staff produced the Commissioner's charge against Sears, which Copus signed. He then led the investigation of Sears. In November 1973 Copus became a member of the Board of Directors of the NOW Legal Defense and Education Fund (LDEF), NOW's legal arm.\n\nEarly in 1974 the Chairman of the EEOC hired a Special Assistant, Whitney M. Adams, also a member of the Board of Directors of NOW. The district court found that there was little to indicate that Adams was directly involved in the Sears action, but she had strong feelings about it and undoubtedly some influence. In responding to a questionnaire at the 1974 NOW convention she indicated her support of the NOW investigation of Sears and revealed her EEOC position. Copus and Adams not only had an interest in the Sears case, but also in each other. Judge Grady regarded the alleged conjugal relationship between Copus and Adams as \"relatively trivial.\" We will also pass it by.\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e Whatever the relationship between them may have been and whatever prejudicial impact it may have had on the conduct of this case, it adds no more prejudice than does Copus' conduct alone.\n\nDuring NOW's national convention in the spring of 1974 NOW's Chicago chapter filed with the EEOC a formal charge against Sears. Copus incorporated that charge with the EEOC charge. At the convention NOW adopted a formal resolution condemning Sears. NOW also issued a document entitled \"A Litigation Strategy for NOW,\" which bore the names of Copus and Adams.\n\nA few days later the Chairman of the EEOC, John H. Powell, Jr., asked for the opinion of his general counsel, William Carey, concerning the propriety of Copus also serving on the NOW LDEF Board. Both Powell and Carey denied at trial knowing of NOW's campaign against Sears although both Copus and Adams, on the EEOC staff and with direct lines to Powell, were actively involved. In July 1974, after receiving Carey's opinion, the Chairman asked Copus to give up his NOW position. Copus delayed doing so, however, until September 1974. It is significant that Copus was not relieved of his leadership role in the EEOC Sears investigation. That was where the conflict and the prejudice would have been exposed.\n\nNOW began engaging in demonstrations and other activities at Sears stores in various locations in the country. At NOW's 1975 convention there was a \"Sears Action . . . victory celebration.\" T-shirts were popular which on the front carried the message \"N.O.W. Sears Action Task Force.\" On the back was the motto, \"100 Million and Nothing Less.\" Copus and Adams were on the program and jointly presented two employment law \"compliance\" workshops.\n\nCopus outdid the T-shirt motto, seeking a \"predetermination settlement\" from Sears in excess of $600 million. He argued that the settlement was important to \"outside groups.\" When Sears declined that offer Copus supervised and participated in the production of the Commission's reasonable cause decision. The decision, handed down on April 19, 1977, eighteen days after Copus left the EEOC, was adopted by a 2 to 1 vote. Sears endeavored to have the Commission reconsider alleging as justification the conflicts of interest, but the request was denied.\n\nThe next procedure following the decision was statutorily mandated presuit conciliation.\u003cspan class=\"fnref\"\u003e60\u003c/span\u003e Copus drafted the regulations that governed that conciliation attempt. Conciliation efforts failed as the Commission would not discuss any of the sixty-nine claims individually involving race, national origin, and sex discrimination charges. It did, however, reduce its demand from $600 million to $54.5 million. The excuse for the continuing large monetary demand was that \"outside interest groups had to be satisfied.\" Sears declined the conciliation offer. The EEOC therefore badly abused the investigation, predetermination settlement, and conciliation statutory prerequisites to suit, all of which are \"intimately related\" in Title VII's enforcement structure. EEOC v. Allegheny Airlines, 436 F. Supp. 1300, 1306 (W.D. Pa. 1977); see EEOC v. Container Corp., 352 F. Supp. 262, 265 (M.D. Fla. 1972).\n\nThe EEOC then filed this lawsuit. The individual charges were trimmed from sixty-nine to thirty-five. The charges that NOW had filed were incorporated. Sears responded with a motion to dismiss alleging these conflicts of interest, as Sears expressed it, created by Copus' and Adams' simultaneous activities with NOW, the EEOC, each other, and the Sears case. We need not restate Judge Grady's published analysis, upon which we partially rest our decision, but we need to consider Young in more detail against the particular factual background of this case.\n\nYoung began as a civil lawsuit, but later developed into a criminal proceeding. Initially, a well-known French leather goods manufacturer sought a permanent injunction prohibiting certain individuals operating a family-owned leather goods manufacturing business in this country from infringing its trademark. A settlement resulted in which damages were paid to the French company, and the American company consented to the entry of a permanent injunction generally prohibiting it from manufacturing and selling leather products imitating the French product.\n\nAbout a year later the French firm, suspecting that the injunction was not being observed, retained an investigation firm to conduct an undercover \"sting\" operation, which was very effective. Two of the French firm's attorneys requested that the district court appoint them as special counsel to prosecute the developing criminal contempt action. They were appointed and authorized to proceed with the investigation. Substantial incriminating evidence, including audio and video tapes, was gathered. Trial and conviction followed. The only issue on appeal that is relevant to the present case is whether the district court erred in appointing the attorneys for the French firm, plaintiff in the civil action, as prosecutors of the criminal contempt charge against their civil adversary, the American firm.\n\nA plurality of the Supreme Court reversed, adopting a categorical rule prohibiting the appointment of an interested prosecutor. Young, 107 S. Ct. at 2141. Justice Blackmun, concurring, would have gone further and held it a due process violation to appoint an interested party's counsel to prosecute for criminal contempt. Id. Justice Scalia concurred, but would have reached the plurality's result by holding that the federal courts \"have no power to prosecute contemnors . . . and no derivative power to appoint an attorney to conduct criminal contempt prosecutions.\" Id. at 2146. Justice Powell, with whom the Chief Justice and Justice O'Connor joined, would not adopt a categorical rule and instead would have remanded the case to determine whether or not the error was harmless. Id. at 2148. Justice White dissented on the basis that a fair trial was conducted, although he did not embrace the appointment of counsel of an interested party to prosecute a contempt case. Id.\n\nIt is apparent that although the Justices varied in their analyses of the conflicts problem, they unanimously disapproved of the practice of appointing the counsel of an interested party to prosecute a criminal contempt case. We similarly do not condone what happened in the present case, far from it, but we do not read Young, a criminal contempt prosecution, to reach quite so far as to require reversal in this case.\n\nSome distinctions between Young and the present case are obvious. Young was a criminal proceeding involving the public interest in vindication of the court's own authority. Id. at 2136. In a case such as Young, liberty itself could be at stake. Id. at 2139. The Court considered that under those circumstances the harmless error rule was not equal to the task of assuring public confidence in the official's conduct. Id. at 2141. Although we acknowledge the great public and private importance of the discrimination issues involved in the present case, it was a civil case without the potential to adversely affect liberty interests or the court's authority. The EEOC conflicts occurred before trial, although it is possible that their influence at least to some extent carried over into the trial. Copus, however, did not try the case. All the issues were fairly aired in their entirety before two impartial judges, and the EEOC in spite of its early conflicts lost on the merits. We leave the matter there. If serious issues of this nature arise in the future, each with its own peculiarities, the trial judge in his or her sound discretion is nevertheless left to consider the \"extreme sanction\" of dismissal as the appropriate remedy if the conflict is found to have infected the whole judicial process.\n\nThe performance of EEOC was disappointing and did a disservice not only to Sears, but also to the public and even to NOW and its causes.\n\nThe EEOC remedy of merely requiring Copus to resign from NOW showed a total lack of appreciation of the serious conflicts problem. If the EEOC officials making that decision were truly unaware of the extent of the conflicts problem existing in the Chairman's own office, then that too is indefensible. Not only should Copus have been required to relinquish his NOW connections, but he should have been totally separated from the Sears case, and new EEOC counsel appointed. New counsel should have then carefully reviewed the development of the case under Copus. The conflict was between Copus and Sears, not Copus and NOW. Copus, although without his NOW office, was left in charge of the Sears case with his conflicts and partiality remaining. The EEOC remedy was facial only and unworthy of a government agency which in apparent pursuit of its important public responsibilities rendered a disservice in doing so unfairly. In seeking to eliminate alleged discrimination at Sears the EEOC was itself guilty of discrimination against Sears.\n\nWe affirm Judge Grady on the issue of this cross appeal.\n\nVII. CONCLUSION\n\nIt appears from the record that this has been a war between two parties that both profess commitment to equality for employees regardless of sex. If Sears in fact did not have such a commitment during 1973-1980, then the EEOC has simply failed to prove that lack of commitment, which was the burden it had assumed. We defer, as we must, to the trial court's factual findings unless they are clearly erroneous. We also defer to the trial court's judgment of the credibility of the witnesses heard and observed by it, and not by us. We view this as a difficult case which was as well-handled by the trial court as was reasonably possible. Had it not been for the unfortunate Copus bias in the early stages, the case might have been terminated at the investigatory stage or by presuit conciliation. Whatever the result of that might have been, each party has now had the chance to offer up at trial whatever it had, and EEOC has been found lacking. We hope this determination will not be considered all loss and will instead assist the EEOC in various ways in the future pursuit of its worthy objectives.\n\nAFFIRMED.\n\nDisposition\n\nAffirmed.\n\nCUDAHY, Circuit Judge, concurring in part and dissenting in part:\n\nIt is extremely difficult to distinguish superficial blemishes from structural defects in this oversized and confusing case. Although its efforts are impressive and, in many respects, commendable, the majority has been only partially successful. Its opinion properly identifies some important shortcomings in the EEOC's case; but it overstates the significance of others and seems to overlook entirely certain equally serious flaws in Sears' argument. Thus, it is true that the EEOC's internal machinations in initiating this case deserve condemnation. It is equally true that the EEOC as much as gave the case away by failing to produce any flesh and blood victims of discrimination. Regression statistics by themselves only demonstrate correlations between variables; to move from correlation to causation, there must be some independent theory about the causal relationships of the variables. See, e.g., D. Baldus \u0026 J. Cole, Statistical Proof of Discrimination ยง 9.4 at 320 (1980). In this case, much of the dispute centers on whether crucial independent variables have been omitted or misspecified. Therefore, the parties' causal theories, substantiated most convincingly through first-hand accounts, take on particular importance. Hence, the EEOC's failure to present first-hand evidence makes Sears' lopsided victory far easier to understand. I would reiterate, however, that key elements in Sears' case have escaped critical examination.\n\nPerhaps the most questionable aspect of the majority opinion is its acceptance of women's alleged low interest and qualifications for commission selling as a complete explanation for the huge statistical disparities favoring men. The adoption by the district court and by the majority of Sears' analysis of these arguments strikes me as extremely uncritical. Sears has indeed presented varied evidence that these gender-based differences exist, both in our society as a whole and in its particular labor pool. But it remains a virtually insuperable task to overcome the weight of the statistical evidence marshalled by the EEOC or the skepticism that courts ought to show toward defenses to Title VII actions that rely on unquantifiable traits ascribed to protected groups.\n\nI start with the expectation that commission salespeople generally see themselves as the elite of the sales force. They make more money than noncommission sales people and obtain their positions through a more selective hiring process. As a consequence, they enjoy greater prestige. They are people with confidence in their ability to captivate customers and move merchandise. I would expect them to look with condescension, if not contempt, upon retail clerks working as order-takers for a straight wage. I do not therefore quarrel with the majority's proposition that retail order-taking is a \"different\" task from commission selling. But I would expect that the jobs are most often seen in a vertical alignment with commission selling on top. Whether or not the perspective that gives rise to this hierarchical ranking is commendable, it is certainly pervasive. I think my view differs from that of the majority, who seem to believe that the tasks are perceived as coequally not as occupying distinct tiers in a vertical pecking order.\n\nThese perspectives are important because the majority's more benign view tends to minimize the significance of Sears' contentions that women lack the interest and qualifications to sell on commission. Women, as described by Sears, the district court and the majority, exhibit the very same stereotypical qualities for which they have been assigned low-status positions throughout history. The majority states that\n\n[the] reasons for women's lack of interest in commission selling included a fear or dislike of what they perceived as cut-throat competition, increased pressure and risk associated with commission sales. Noncommission selling, on the other hand, was associated with more social contact and friendship, less pressure and less risk.\n\nSupra at 320-21.\n\nThe district court found\n\nthat noncommission saleswomen were generally happier with their present jobs at Sears, and were much less likely than their male counterparts to be interested in other positions, such as commission sales. . . .\n\n628 F. Supp. at 1313.\n\nThese conclusions, it seems to me, are of a piece with the proposition that women are by nature happier cooking, doing the laundry and chauffeuring the children to softball games than arguing appeals or selling stocks. The stereotype of women as less greedy and daring than men is one that the sex discrimination laws were intended to address. It is disturbing that this sort of thinking is accepted so uncritically by the district court and by the majority. Perhaps they have forgotten that women have been hugely successful in such fields as residential real estate, door-to-door and other direct outside merchandising. There are abundant indications that women lack neither the desire to compete strenuously for financial gain nor the capacity to take risks.\n\nSears, the district court and the majority hang much of their refutation of the EEOC's hiring and promotion claims on the putative difference between men's and women's interest in undertaking commission sales. Huge statistical disparities in participation in various commission selling jobs are ascribed to differences in \"interest.\" Yet there is scarcely any recognition of the employer's role in shaping the \"interests\" of applicants. See, e.g., Catlett v. Missouri Highway and Transp. Comm'n, 828 F.2d 1260, 1265-66 (8th Cir. 1987). Even the majority is willing to concede that lack of opportunity may drive lack of interest, but dismisses the matter as a \"chicken-egg\" problem. Supra at 322. I concede that the government's case would be stronger if it had produced even a handful of women willing to testify that Sears had frustrated their childhood dreams of becoming commission sellers of roofing, sewing machines or air conditioners. However, even absent flesh and blood victims, I find the willingness of the district court and the majority to accept the interest defense uncritically, and without recognition of its close parallel to the stereotypes that Title VII seeks to eradicate, perplexing and unacceptable.\n\nIn any event, if we are to wrestle with the ambiguous quality of interest, we must honestly assess the EEOC's claim that significant gender-based disparities remain after appropriate adjustments are made to control for interest. In the analysis of hiring data, EEOC's logit and cross-classification analyses (see Sears II, 628 F. Supp. at 1296-99) adjusted initial estimates of the expected proportion of female hires to account for six factors that might legitimately affect an applicant's odds of selection. Four of these factors, \"job applied for,\" \"job type experience,\" \"product line experience\" and \"commission sales experience,\" can be viewed as imperfect proxies for interest, and, to a lesser extent, for subjective qualifications. These adjustments brought down the expected proportions of female hires. The cross-classification method, for example, reduced the expected proportion of women hired into full-time commission sales nationwide for the entire liability period from 61.1 % to 37.2 %. But statistically significant disparities between expected and actual hiring rates remained in a majority of years for every region. Sears II at 1297-98.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThese adjusted findings derive independent support from the EEOC's analysis of Sears' Applicant Interview Guides. This analysis shows that women were more than sixty percent of the full-time sales applicants surveyed (EEOC Exhibit A) and forty percent of the persons who considered themselves most ready, willing and able to sell installed home improvements at Sears (EEOC Exhibit A 30). But women comprised only 1.7 % of full-time commission sales hires in 1973 and between 5.3% and 10.5% thereafter. See EEOC Exhibit 1 Supp. Table 10. \"Interest\" may be the valid -- even crucial -- factor in the assignment of applicants to positions that Sears asserts it to be, but it hardly accounts for the vast statistical discrepancies involved here. Sears, the district court and the majority contend that the adjustments made by the EEOC understate for various reasons the true effects of differences in interest. These criticisms, however, are not serious enough to explain away the enormous disparities that remain after the adjustments are made.\n\nThe majority also approves the district court's finding that Dr. Siskin's regression analyses failed to adjust adequately for subjectively assessed qualifications. Supra, slip op. at 38-43. The majority even goes so far as to approve the district court's finding that the regressions failed to take into account characteristics such as \"'physical appearance, assertiveness, the ability to communicate, friendliness, and economic motivation.'\" Id. at 327 (quoting Sears II, 628 F. Supp. at 1303), which had been mentioned as \"desirable\" traits for commission salespersons. I think a critique based on such obviously unquantifiable and peripheral considerations is inordinately critical of the statistical evidence being presented. In Bazemore the Supreme Court rejected the Fourth Circuit's determination that a regression analysis was \"unacceptable\" because it did not include \"all measurable variables.\" Bazemore v. Friday, 478 U.S. 385, 106 S. Ct. 3000, 3009, 92 L. Ed. 2d 315 (1986). Here, there is no claim that the EEOC failed to include any relevant, measurable variable. The EEOC loses because, in the eyes of the district court and the majority, it has not carried the still heavier burden of disproving the enormous significance that Sears attributes to unmeasurable variables. Cf. Caviale v. Wisconsin Dep't of Health \u0026 Social Serv., 744 F.2d 1289, 1294 (7th Cir. 1984) (\"rule requiring members of the comparison pool to possess subjective qualifications would render a plaintiff's burden of production nearly insurmountable\").\n\nThe majority's uncritical acceptance of the inordinate explanatory power that Sears ascribes to interest and subjectively assessed qualifications may be most apparent in its rejection of the EEOC's \"early years\" argument. The EEOC contends that the early years of the liability period (from the beginning of the period in March 1973, through the implementation of the Mandatory Achievement of Goals (\"MAG\") plan in June or July 1974) should be analyzed separately from the later years (from the implementation of the MAG plan through 1980). The majority declines to consider the two periods separately, primarily because it claims the EEOC's \"arbitrary and false assumptions\" deprive its statistics of probative value with respect to either period. Supra, slip op. at 17. In the alternative, the majority holds that even if the EEOC's basic statistical analysis were sound, separate consideration of the early years would be unnecessary because the EEOC has not established that the two periods are distinct. Id., slip op. at 18-19. Neither rationale for declining to analyze the early years separately withstands scrutiny.\n\nFor the majority, the EEOC's failure to account adequately for claimed differences in interest and subjectively assessed qualifications makes it unnecessary to consider the early years separately. In insisting that the EEOC establish the validity of its basic findings before proceeding with its discussion of the differences between the pre-MAG and post-MAG periods, however, the majority misunderstands the significance of the EEOC's argument. Separate consideration of the early period not only focuses attention on the largest disparities, it also underscores the dramatic difference in the representation of women in commission sales before and after the MAG program. The sharp decline in gender-based disparities seems far more suggestive of a discrete change in hiring practices than of more gradual changes in women's aspirations and qualifications. The logical implication is that the MAG plan removed barriers to women in Sears' hiring practices.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Viewed in this light, the analytic distinction between the earlier and later periods is not some elaborate extension of the EEOC's argument, valid only if the EEOC's basic statistical model is presumed valid. Instead, this distinction is an additional means of assessing the coherence of Sears' and the EEOC's conflicting interpretations of the numbers. Given the slipperiness of the interest and qualifications variables on which Sears relies so heavily, the court should employ every available means of assessing Sears' explanation. Instead, the majority uses its conclusions as blinders to block inconvenient arguments from view.\n\nI am also unpersuaded by the majority's alternative argument for declining to consider the early period separately. The majority temporarily suspends its disbelief in the EEOC's overall statistical approach to consider whether the disparity between pre-MAG and post-MAG statistics, if validly measured, would justify separate consideration of the early years. In this respect, the majority approves the district court's finding that the EEOC failed to establish either that Sears adopted the MAG program in response to the EEOC's enforcement efforts or that significant disparities actually exist between the earlier and later periods. I find the discussion of motives peripheral and the effort to minimize the difference over time unconvincing.\n\nIn my view, Sears' precise motives for implementing the MAG plan have little bearing on the appropriateness of separate treatment. The MAG plan, whether prompted by the threat of enforcement or by Sears' disinterested dedication to the ideal of equal opportunity, was clearly intended to increase the numbers of women in male-dominated jobs. See Sears II, 628 F. Supp. at 1293. This objective provides a reasonable basis for looking at the differences in hiring rates between the two periods. A sharp improvement in the success of women applicants after the implementation of a change in hiring practices conveys valuable information, whether or not Sears left evidence that a guilty conscience motivated the change.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nIn assessing the significance of the MAG plan, I find that the numbers clearly show a sharp increase in women applicants' commission sales jobs after 1974. For example, women represented 9.9% of full-time commission sales hires nationwide in 1973, and 17.6 % in 1974; the corresponding annual figures for the period from 1974 through 1980 ranged from 30.7% to 40.5%. EEOC Exhibit 1 at 13, Table 1. Similar differences are reflected in the data on part-time hires for four of Sears' five regions.\n\nThe majority questions the EEOC's comparisons between the earlier and later period on two grounds. First, the majority observes that the data for calendar years 1973 and 1974 do not correspond to the \"early period,\" which ran from March 1973, through June or July 1974. The best available numbers for the \"early years\" therefore include two months of 1973 that antedated the liability period and five or six months of 1974 that followed full implementation of the MAG plan. Precise numbers for the sixteen to seventeen month period in question would no doubt strengthen the EEOC's argument for separate treatment. I do not see, however, how this mismatch can by any stretch of the imagination negate the sharp differences between the two periods, particularly since including the late-1974 months in the early years should only reduce the disparities between the earlier and later periods.\n\nThe majority also observes that some of the specific comparisons presented by the EEOC tend to overstate the differences between the earlier and later periods. Supra, slip op. at 20. I agree that the EEOC's presentation on this point is not a model of clarity. However, the undeniable differences between the two periods (differences that are probably understated by the implementation of the MAG Plan well before the end of the 1973-74 period) appear to me to compel a conclusion that something fundamental occurred. The district court attributed the increase in women hires during the liability period to changes that made these jobs more attractive to women, including an increase in part-time commission sales jobs, the introduction of base salaries for the commission sales force, increasing availability of female \"role models\" in commission sales jobs and the increased availability of day care. Sears II, 633 F. Supp. at 1309. The sharp differences over time cannot be explained by these four factors (three of which did not appear until 1977) or by the broad social changes that Sears claims affected women's role in the work force during the 1970's.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The majority has vested the unmeasured differences in interest and subjectively assessed qualifications with the power to explain both vast disparities and sharp swings in those disparities. The majority thus seems to credit Sears with having devised an all-purpose deus ex machina, invulnerable to refutation by any argument from quantifiable factors.\n\nWith respect to promotions, the majority again attempts to dismiss the inexorable numbers by falling back on highly dubious assumptions about the disparate levels of \"interest\" of men and women in commission selling. The EEOC tried to meet the \"interest\" objection by adjusting for greater male interest to the extent of 1.5, 2, or even 3 times female interest. The majority seeks to denigrate the proof emerging from these adjustments by arguing that men may be more than three times as interested in commission selling as women. Supra, slip op. at 59. At least, the majority puts the burden on the EEOC to show that the interest differential is not more than three to one. Id. This approach vividly illustrates the virtually insurmountable obstacle that the differential interest defense can place in the way of proof in a case of this sort. \"Interest\" by its very nature is a fuzzy quality which hardly lends itself to mathematical demonstration. To say that men are three times as interested as women in commission selling is a rough attempt to describe a dynamic social phenomenon; it is hardly a matter susceptible of precise delineation. A factor of three seems to be near the limits of plausibility and the majority's demand that the EEOC rule out the possibility of multipliers greater than three rather than Sears proving these greater disproportions strikes me as absurd. In addition, the admittedly changing levels of feminine \"interest\" during the 1970's -- noted by the district court and the majority -- make the majority's objections to the EEOC's promotion statistics seem nitpicking and unrealistic. If what passed for lack of interest in the early 1970's was really lack of opportunity, the subsequent shift in the numbers should hardly redound to the benefit of Sears. See Catlett, 828 F.2d at 1265-66.\n\nTwo other aspects of the majority opinion, the treatment of the pregnancy leave issue and the wage discrimination claim, warrant brief comment. The Sears Personnel Manual granted a day of paid leave to male employees when their wives gave birth but denied this benefit to female employees giving birth. The district court held that the Personnel Manual did not make out a prima facie case of discrimination without a further showing that these provisions were actually implemented. Sears II, 628 F.2d at 1275-76. The majority affirms this reasoning. Supra, slip op. at 97-102.\n\nThe majority concedes that the authority of Durant v. Owens-Illinois Fiberglass, 517 F. Supp. 710 (E.D. La. 1980), the principal support for the startling result reached here, is \"perhaps weak.\" I would characterize Durant's authority as virtually nonexistent since the defendant employer in that case presented evidence that contract provisions, which appeared to establish stricter guidelines for pregnancy leave than for sick leave brought on by illness, were routinely subordinated to recommendations of women's personal physicians. Id. at 723. Sears presented no analogous evidence. The majority's insistence that the EEOC prove that Sears implemented its official written policies illustrates how the majority heightens its demands on the EEOC beyond reason and common sense.\n\nFinally, on the wage discrimination claim, I would agree that under existing case law the Hay Method job descriptions are probably not adequate to show substantial equality of the jobs for purposes of Equal Pay Act analysis. Therefore, this claim must fail. I would, however, take sharp exception to the majority's view that the EEOC's regression failed to take account of enough independent variables. Assuming basic comparability of the jobs, the EEOC took account of every reasonably arguable variable and the results still showed women decisively the losers.\n\nIn summary, this case was tainted in its origins and was tried without recourse to flesh and blood victims. The statistical evidence is nonetheless quite strong and the majority has misconstrued and grossly overstated its frailties.\n\nI must therefore respectfully dissent as to the matters I have discussed.\n\n\u003cspan class=\"fn\"\u003e1. We discuss the facts underlying the conflict of interest claim, which also illuminate the investigative, settlement, and conciliation history of the case and are the most interesting part of this otherwise statistical case, in our discussion infra of the conflict of interest cross appeal brought by Sears.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The trial involved 20,000 pages of transcripts. During the trial, the court heard the testimony of 49 witnesses and admitted 2,172 exhibits (1,080 for the EEOC totaling 9,377 pages and 1,092 for Sears totaling 12,858 pages).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The EEOC brought this partial summary judgment motion February 3, 1982, and subsequently informed the district court that it would not pursue the issues in that motion at trial if the court ruled against the EEOC on that motion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The motion for partial summary judgment contained four other claims. The EEOC withdrew two of those claims before the court ruled on the motion, and decided not to pursue on appeal the court's denial of relief regarding the two other claims, which involved pregnancy policies.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The district court recognized that the EEOC had also alluded to a disparate impact theory of discrimination. The court held, however, that the EEOC had failed to make out a disparate impact case (because it had not identified any specific, facially neutral Sears policy that disproportionately excluded women from the jobs at issue), and indeed, had waived its right to pursue a disparate impact theory of discrimination. The EEOC does not challenge that holding. The EEOC does, however, urge us to consider cases involving disparate impact theories and methods of analysis in arguing that Sears has discriminated against women in hiring and promotion, because, according to the EEOC, \"how the inquiry [whether disparate impact or disparate treatment] is characterized ought not to importantly affect the outcome of a case such as this, since when the plaintiff makes a sound statistical prima facie case, the defendant has a substantial burden of responding to plaintiff's evidence.\" We reject the EEOC's suggestion that characterization is unimportant -- among other distinctions in the methods of proof for those theories, a showing of disparate treatment requires proof of discriminatory intent, while proof of disparate impact does not. See Teamsters, 431 U.S. at 335 n.14; Griffin v. Board of Regents, 795 F.2d 1281, 1287 (7th Cir. 1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. For example, the EEOC's headings in its appellate brief regarding the hiring claim state \"The EEOC Presented a Compelling Case of Discrimination in Hiring That Was Not Rebutted,\" and \"Sears Failed to Rebut the EEOC's Statistical Case.\" Regarding the promotion claim, the headings read \"The EEOC Presented a Compelling Case of Discrimination in Promotions That Was Not Rebutted,\" and \"Sears Did Not Offer Reliable Evidence that Could Rebut the EEOC's Promotion Claim.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The court also heard testimony of various nonstatistical expert witnesses -- ten for EEOC and nine for Sears, and heard four lay witnesses for EEOC and twenty-four lay witnesses for Sears. The court stated that \"the testimony of nonstatistical witnesses was as important as the testimony of the statistical experts.\" Sears II, 628 F. Supp. at 1279 \u0026 n.2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Although the EEOC claims that two of its witnesses \"testified in rebuttal that [they were] definitely interested in a commission sales position at the time [they] applied,\" the district court found, we believe correctly, that neither witness provided any evidence that Sears discriminated against women. Each witness was called to rebut testimony of a Sears witness regarding coding of applications. EEOC, for that matter, does not claim that either witness offered credible testimony that Sears discriminated against her -- one applied at a store in which applications for full-time commission sales were not usually processed because the store had done so little hiring outside of Sears for commission sales, while Sears showed that the store to which the other witness applied had hired two other women who had better qualifications than the witness.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The EEOC contends that it proved discrimination because it met its burden of showing, through statistical evidence, prima facie cases of discrimination in hiring and promotions and Sears failed to rebut those prima facie cases. Based on the Bazemore analysis noted above, we believe it is more appropriate to cast the dispositive issue as whether the district court clearly erred in determining that the EEOC did not prove by a preponderance of the evidence a pattern or practice of discrimination against women in either hiring or promotion. See Bazemore, 106 S. Ct. at 3008. This method of analysis eliminates the false inference engendered by the EEOC's statement of the burdens, which is that if Sears did not produce more compelling evidence than did the EEOC, the EEOC has automatically proven a case of discrimination. As we noted in our discussion of the standard of review, the EEOC as plaintiff had the ultimate burden of persuasion. Burdine, 450 U.S. at 253. As this court stated in Pollard v. Rea Magnet Wire Co., Inc., 824 F.2d 557, 558 (7th Cir. 1987), \"once the trial in a disparate treatment case is over . . . the rules governing prima facie cases, order of proof, responses, and so on no longer matter.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Initially, the EEOC suggests that the \"early years\" is the period \"before Sears had fully implemented the Mandatory Achievement of Goals Program.\" At another point, the EEOC states that \"there were striking increases in the female proportion of full time hires from 1973 to 1975, the years before and after the mid-1974 implementation of the MAG program,\" acknowledging that the district court found that MAG was implemented by the summer of 1974. In citing statistics in support of its \"fundamental changes\" argument, the EEOC cites charges in periods ranging from 1972, the year before the EEOC charge was filed, to 1975, two years after the charge was filed, generally focusing on the changes between 1972 to 1974, suggesting that this period is the \"early years.\" The cases the EEOC cites in support of its argument that courts should distinguish between early periods of discrimination and corrective action use as the cutoff point the date when charges are filed against an employer, which in this case was August 30, 1973. See, e.g., International Brotherhood of Teamsters v. United States, 431 U.S. 324, 341-42, 52 L. Ed. 2d 396, 97 S. Ct. 1843 (1977); Rich v. Martin Marietta Corp., 522 F.2d 333, 346 (10th Cir. 1975). This suggests the \"early years\" is the period before that filing of charges.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Although the cases cited by the EEOC indicate that the relevant cutoff point for discriminatory action is the time the charges are filed, they all assume that corrective action is taken after that point, and so we may use the EEOC's cutoff point which is the date of implementation of the MAG program (what the EEOC would term \"corrective action\"). See, e.g., International Brotherhood of Teamsters v. United States, 431 U.S. 324, 341-42, 52 L. Ed. 2d 396, 97 S. Ct. 1843 (1977); Rich v. Martin Marietta Corp., 522 F.2d 333, 346 (10th Cir. 1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The parties quibble over the reliability of the 1972 and 1973 hiring figures. Sears states that because Sears' computerized personnel/payroll system was in the process of being implemented during 1972 to 1973, \"even simple counts of hires and promotions were less reliable for those years than for later years.\" In addition, Sears notes that the EEOC's expert Siskin described his figures for 1972 hires as \"at best an estimate.\" The EEOC recognizes this and counters that Sears provided no contrary estimate. The EEOC also claims that Sears did not question the 1973 figures at trial, and did not seriously question the 1972 hiring figures.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. In Stoves, figures that \"almost tripled\" between 1972 and 1974 more than doubled between 1972 and 1973. In Floor Coverings, what had \"almost quadrupled between 1972 and 1974\" and increased almost eightfold by 1975, had more than doubled, and almost tripled, between 1972 and 1973.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The EEOC argues that the district court recognized some increases in female representation among female commission sales hires and promotions, but clearly erred in attributing these increases to the increased willingness of women to accept commission sales positions rather than to Sears' post-charge implementation of the MAG plan. As we have indicated above, the EEOC's compilation of statistics does not support its claim that increases in female hires and promotions were due to the implementation of the MAG plan. The EEOC attacks the validity of the reasons the court mentioned in support of its finding of women's increased willingness to accept commission sales positions. The EEOC claims that three of the four reasons mentioned by the court -- that commission sales jobs changed from being almost exclusively full-time to largely part-time and more women preferred to work part-time; that compensation for commission sales changed from draw versus commission to salary plus commission; and that there was increased availability of day care -- did not occur until at least 1977 and so could not apply to increased interest of women during the \"early years.\" Regarding the final reason noted by the court, which was that there were more incumbent women serving as role models, the EEOC states this factor \"can hardly serve to account for the dramatic changes of one to three years.\" The district court did not say that these reasons were exclusive, however. In any event, even if the court's finding regarding the increased willingness of women to work could not be supported for the period of the \"early years,\" it would not show that the court clearly erred in failing to hold that the increases in female percentages of commission hires and promotions were due to Sears' implementation of the MAG plan.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Although the EEOC claims that more time was devoted to the full-time case because \"so much of Sears' defense pertained only to full time,\" EEOC's counsel stated during closing arguments: And we perhaps have not given that much attention to the part time case as it should have been given, given the remaining enormous disparities we have particularly with regard to these four territories. Acknowledgedly we are talking about more hires in full time, at least compared to these four territories. Also, of course, these full time jobs mean a lot more money to people, because they are full time, because people stay there longer. So, full time is more important, but this is important as well to the people who are affected. So, we ought not to lose -- entirely focus on the full time case, although I will by and large when talking about this case refer to these [full-time] figures for purposes of simplicity. Whatever the reason, the fact remains that the focus appeared to lie with the full-time case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. If the salesperson's commission did not equal the amount of the draw, he or she would carry over a deficit to the next week. If the deficit was not eliminated with an excess draw by the next week, it would be cleared. Failing to meet draw over a period of time was cause for firing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The court recognized that the EEOC attacked this job interest survey on several bases, but we agree with the court that these criticisms do not \"affect the essential validity of the results.\" See Sears II, 628 F. Supp. at 1310 \u0026 n.49.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The EEOC attacks the court's acceptance of Sears' store witness testimony regarding interest, arguing that Sears' store witnesses were \"unable to identify a single specific instance where an outside applicant refused the offer of a commission sales position.\" There is no basis for the EEOC's statement. As Sears notes, Sears witnesses testified to more than 60 instances of refusals or expressions of lack of interest in commission selling. The EEOC also specifically attacks the court's acceptance of the testimony of Sears' witness Juliet Brudney, who is a writer on women's employment issues and in 1980 conducted interviews of women service technicians and auto mechanics at Sears and their supervisors. EEOC argues that the court assigned an inordinate amount of weight to her testimony regarding women's attitudes toward commission sales because that aspect of her testimony was based on interviews with women outside of Sears. The court did not state, however, that that aspect of her testimony was based on the Sears interviews. Furthermore, the court clearly relied on several expert witnesses regarding women's interest, and did not rely exclusively on Brudney's testimony.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The court noted that although the EEOC and Sears disagreed over the actual numbers of commission sales hires and promotions, it need not resolve that issue because both experts admitted that the percentage of female hires and promotions identified by each side did not vary significantly.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The court noted that the z values for the nationwide comparisons were \"all very large, ranging from 11.9 to 45.1.\" The z values for the territories were \"somewhat lower, but still in the 'highly statistically significant' range.\" Sears II, 628 F. Supp. at 1295-96. The court also found that when the analysis was performed by product division, the estimated z values were lower still, \"but most had values above 5.0.\" Id. at 1296. As this court noted in Coates v. Johnson \u0026 Johnson, 756 F.2d 524, 537 n.11 (7th Cir. 1985), the \"standard deviation\" is a number that quantifies the degree to which disparities spread out above and below the mean of distribution, thus describing the probability that chance is responsible for any difference between an expected outcome and the observed outcome in a sample consisting of two groups (a binomial distribution). The greater the number of standard deviations, the less likely it is that chance is the cause of any difference between the expected and observed results. The Supreme Court noted in Castaneda v. Partida, 430 U.S. 482, 51 L. Ed. 2d 498, 97 S. Ct. 1272 (1977), that under a \"two-tail\" test of statistical significance, \"as a general rule for . . . large samples, if the difference between the expected value and the observed number is greater than two or three standard deviations, then the hypothesis that a [disparity] was random would be suspect to a social scientist.\" Id. at 497 n.17. The general rule should be applied with caution, however, and its particular applicability may vary from case to case. See D. Baldus \u0026 J. Cole, Statistical Proof of Discrimination ยง 9.03, at 293-97 (1980), 108-12 (Supp. 1984); see also [EEOC] v. American National Bank, 652 F.2d [1176,] at 1190-93 [(4th Cir. 1981)]. In accordance with the above principles, the district court assumed that \"differences between actual and expected values that exceed 3 standard deviations may be statistically significant.\" Sears II, 628 F. Supp. at 1287. As the district court noted, \"standard deviation and other measures of statistical significance merely attempt to eliminate chance as the reason for the results. They do not prove what in fact caused the results.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The EEOC argues that there is \"no quantitative basis\" for the court's conclusion that the sales applicant pool was inflated. A criticism of the assumptions underlying statistics, however, does not have to be quantified to be valid. Furthermore, there is some quantitative basis for the court's conclusion because it accepted the conclusion of Sears' expert Haworth that of those applicants who indicated a written preference for commission sales, over 75 % were men. It is worth noting that the EEOC did not define the female percentage of commission sales applicants as those who indicated a preference for commission sales on the application form. The EEOC stated it did not do this because \"far less than half of the positions go to such persons.\" Sears argues that the group of applicants who had indicated a preference for commission sales in writing on the application was predominantly male, and the EEOC did not base the expected percentage of female commission sales hires on the numbers of females who had written a preference for commission sales because if it had, there would have been no disparities. Whatever the reasons for not considering females' expressed preferences for commission sales on application forms, the court found that most of the essential qualities for commission selling \"could be determined only from an interview, not from a written application.\" Sears II, 628 F. Supp. at 1303.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Multiple regression analyses, designed to determine the effect of several independent variables on a dependent variable, which in this case is hiring, are an accepted and common method of proving disparate treatment claims. See Bazemore v. Friday,478 U.S. 385, 106 S. Ct. 3000, 3008-09, 92 L. Ed. 2d 315 (1986); Campbell, Regression Analysis in Title VII Cases: Minimum Standards, Comparable Worth, and Other Issues Where Law and Statistics Meet, 36 Stan. L. Rev. 1299 (1984); Finkelstein, The Judicial Reception of Multiple Regression Studies in Race and Sex Discrimination Cases, 80 Colum. L. Rev. 737 (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The court noted that this disparity was later reduced to 37.2 %, and that Siskin arrived at an estimate of expected female proportion of full-time commission sales hires at 40 % after considering possible biases in the multivariate analysis and the higher expected proportion from the logit analysis. The district court noted that Siskin had explained that the multivariate analysis was possibly subject to fragmentation bias and proxy bias, either of which could cause an underestimate of the expected proportion of female commission sales hires. Fragmentation bias can occur because the larger the number of cells relative to the number of applicants, the greater the number of cells in which there are no applicants, but only hires. Then \"the sexual composition of the expected hires tends simply to become the sexual composition of the actual hires, possibly masking the size of any disparities on the basis of sex.\" Sears II, 628 F. Supp. at 1298. The court noted that Siskin attempted to reduce this bias by collapsing various categories in the six characteristics and rerunning the multicell analysis, and Siskin claimed he had eliminated most of the fragmentation bias at the risk of losing precision in the model. Proxy bias may occur when a characteristic possessed disproportionately by men, such as automobile experience in automotives, is associated with success in hiring. This association may mask the greater success of men in general, presumably due to discrimination. As the district court explained, \"if there is in fact discrimination in favor of men, characteristics more commonly held by men would appear in the analysis to be more closely correlated with success than characteristics held by women.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The district court stated that the years and territories in which the EEOC claimed statistically significant disparities are as follows: Full time: Nationwide -- 1973-1977, 1980 Eastern -- 1973-1974 Midwestern -- 1973-1977 Pacific Coast -- 1976-1978, 1980 Southern -- 1973-1977 Southwestern -- 1973-1978, 1980 Part time: Four Territo- ries -- 1973-1980 Eastern -- 1973-1979 Midwestern -- 1973-1974, 1976-1980 Pacific Coast -- 1976-1980 Southern -- 1973-1980 Southwestern -- 1973-1980\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The court noted that in the 1973-1975 period, z values exceeded 3 in all product line groupings except women's apparel, but in 1976-1980 the disparities were reduced and were not statistically significant in 3 of 10 groupings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The court noted that z values exceeded 3 in 8 of 14 product line groupings in the combination of four territories for the periods 1973-1975 and 1976-1980. Z values exceeded 3 in the Midwestern Territory for 8 of 14 product line groupings for 1973-1975, and in 7 of 14 product line groupings for 1976-1980.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. The Bazemore Court found some of the district court's conclusions regarding omitted variables \"inexplicable in light of the record.\" Bazemore, 106 S. Ct. at 3011 n.15. These conclusions included finding fault with a regression because it did not contain a particular variable, when in other regressions that included the variable there were statistically significant disparities; stating that one variable was key to determining salaries, and failing to mention that one regression analysis included that variable and showed an even greater disparity. In addition, the Court noted that while the district court had listed nine variables as not accounted for in the regressions, many of the \"missing\" variables related to other variables which were included. Id. We find none of these infirmities in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. The expected proportion of female hires was reduced by 0.9 percentage points for full-time and 0.2 percentage points for part-time. Siskin explained that the analysis likely did not show much of an impact because persons who were cashiers likely had other traits that put them in cells where their selection was unlikely.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The z values after taking into account variances were 4.12 in 1973 and 3.86 in 1974.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The EEOC only analyzed movement from full-time noncommission sales to full-time commission sales and from part-time noncommission sales to part-time commission sales.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. The disparities between expected and actual female promotions from full-time noncommission to full-time commission positions using the EEOC's Division Pool analysis nationwide from 1973 to 1980 were as follows: Percent Female Number Female Year Total Exp. Act. Exp. Act. Diff. Z 1973 825 70.4 29.1 581 240 341 9.21974 1016 65.5 37.9 665 385 280 20.71975 732 70.8 47.7 518 349 169 15.11976 819 72.8 51.5 596 422 174 14.51977 1099 68.4 43.9 752 483 269 20.51978 934 68.0 48.2 635 450 185 14.51979 419 63.7 42.5 267 178 89 11.21980 238 71.8 47.5 171 113 58 9.5AllYears 6082 68.8 43.1 4185 2620 1565 32.9The disparities for part-time for the Eastern, Pacific Coast, Southern, and Southwestern territories from 1973 to 1980 were as follows: Percent Female Number Female Year Total Exp. Act. Exp. Act. Diff. Z 1973 206 72.3 24.3 149 50 99 15.41974 308 67.2 38.1 207 117 90 10.91975 361 70.4 50.7 254 183 71 8.21976 426 70.0 44.6 298 190 108 11.41977 546 67.9 39.4 371 215 156 14.31978 815 69.7 48.8 568 398 170 13.01979 549 72.7 53.9 399 296 103 9.91980 438 73.7 53.4 323 234 89 9.7AllYears 3649 70.5 46.2 2573 1683 890 32.3The disparities for part-time for the Midwestern Territory from 1973 to 1980 were as follows: Percent Female Number Female Year Total Exp. Act. Exp. Act. Diff. Z 1973 251 86.9 45.4 218 114 104 22.61974 348 79.9 59.2 278 206 72 11.01975 380 83.9 67.9 319 258 61 9.71976 317 80.1 61.2 254 194 60 9.41977 916 76.0 60.2 696 551 145 12.41978 372 78.8 52.4 293 195 98 13.51979 360 75.8 51.1 273 184 89 11.71980 207 71.5 49.8 148 103 45 7.4AllYears 3151 78.7 57.3 2479 1805 674 32.6\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. In both the division feeder pool analysis and the product line analysis, Sears' expert Haworth attempted to adjust the expected proportion of female promotions by determining the proportion of female promotions that came from a particular division or product line and weighting that proportion according to the proportion of total promotees that came from that \"feeder\" division or product line. The district court criticized the division feeder pool analysis because the court found that Sears had not shown that experience in the feeder divisions was related to the type of selling required in the division with the opening. Apparently the court believed the product line analysis weighted the proportion of promotions from different divisions within the same product line, because the court found that the product line analysis was valid since the adjustments for divisions in the same product line might reflect related experience. According to Haworth's explanation of the product line analysis, the analysis was not confined to the same product line but instead weighted the proportion of promotions from different feeder product lines. In that respect it is constructed just like the Division Feeder Pool analysis, and is thus subject to the same criticisms as that analysis.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Question 13C of the NTNSS asked: \"If you were asked to become a commission salesperson would you accept?\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Siskin's original division pool analysis for full-time promotions from noncommission to commission sales for the period 1973 to 1980 yielded an expected percentage of female promotions of 68.8 %, compared with the actual percentage of 43.1 %, for a z value of 32.9. After adjusting for interest based on responses to question 13C, the expected percentage of female promotions was reduced to 55.4 % for all years, for a z value of 19.3. The original expected proportion of female promotions from part-time noncommission to part-time commission sales based on the division pool analysis was 70.5 % in all territories but the Midwestern Territory, and 78.7 % in the Midwestern Territory, compared with the actual percentages of 46.2 % in all territories but the Midwestern (z level of 32.3), and 57.3 % in the Midwestern Territory (z level of 32.6). After the question 13C adjustment, the expected proportion of part-time promotions reduced to 64.9 %, for a z level of 23.5.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Question 42 of the NTNSS listed 26 different types of timecard jobs and asked respondents: \"Considering all the field and headquarters Timecard assignments listed below, mark the three Timecard assignments that you want to be considered for next.\" (emphasis in original).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Sears' question 42 interest adjustment reduced the expected female proportions of promotions for the years 1974 to 1980 (1973 figures were not included because of Sears' expert Haworth's doubts as to the reliability of those promotion figures) to 40.1 % for full-time and 53.6 % for part-time. When compared with the actual proportion of promotions from the EEOC's analysis, which was 43.1 % for full-time and 46.2 % or 57.3 % for the part-time case during the years 1973-1980, it is clear that the disparities are eliminated. Sears did not conduct a year-by-year analysis, as the EEOC had done with question 13C, because Haworth did not think it appropriate to compare early years with 1982 data when there were changing interest levels during the 1970's.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Sears' expert Haworth testified that there were no promotion counts for 1973 that she found to be accurate. The EEOC's expert Siskin stated that figures for 1972 hires (on which the year-end counts for promotions were based in part) were \"at best an estimate.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. The EEOC complains that the CAQs were not distributed to two facilities among 29 of the EEOC's sample that were in the Chicago or Detroit groups, where there had traditionally been higher female representation in commission sales (because there were more part-time commission sales hires in those stores). Sears states that the questionnaires were not administered at those stores, and the EEOC argues that because Sears gave no explanation for not distributing the CAQs at those stores, Sears must have had improper motives in not doing so. Whatever the reason Sears may have had for not administering the surveys at those facilities, we will not assume that the CAQs are unreliable because two facilities were not included. Twenty-seven facilities were included, and the EEOC would have us speculate as to the possible impact of the data from the two facilities that were not included.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. The EEOC alleges that the district court evidenced a mathematical misunderstanding of the results of morale surveys and other survey data. The EEOC notes that at one point, the court concluded that noncommission salesmen were two times more interested than noncommission saleswomen but did not take into account that women were 75 % of the noncommission sales pool, so that in actual numbers, more than two times as many women as men were interested in commission sales. This is a nitpicking argument. At other times in the opinion, the district court used more precise language such as \"twice the percentage of female . . . as male.\" Sears II, 628 F. Supp. at 1309. The language is not always as precise as it could be, but it is clear from the context that the judge understood the significance of the percentages.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. The percentages of male and female responses based on these numbers constituted 6.7 % of male responses and 2.1 % of female responses expressing an interest in commission selling.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. The EEOC incorporated its claims regarding Sears' alleged subjective employment practices and alleged past discrimination, which we discussed in the context of the hiring claim, in its promotion claim. For the reasons we note in our treatment of these claims, we reject those claims in the promotion context as well.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. The equal work standard of the Equal Pay Act of 1963 is set forth at 29 U.S.C. ยง 206(d)(1) which provides in part: (d)(1) No employer having employees subject to any provisions of this section shall discriminate, within any establishment in which such employees are employed, between employees on the basis of sex by paying wages to employees in such establishment at a rate less than the rate at which he pays wages to employees of the opposite sex in such establishment for equal work on jobs the performance of which requires equal skill, effort, and responsibility, and which are performed under similar working conditions, except where such payment is made pursuant to (i) a seniority system; (ii) a merit system; (iii) a system which measures earnings by quantity or quality of production; or (iv) a differential based on any other factor other than sex.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. The state later passed legislation implementing a wage system based on comparable worth that would take effect over a decade. AFSCME, 770 F.2d at 1403.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. The EEOC argues that comparable worth concerns are not implicated here and that there is no need to subjectively assess the value of differing jobs. The district court found that the EEOC's claim was requesting just that, and we cannot say that finding was clearly erroneous. Furthermore, a major issue regarding this claim was whether the checklist jobs were indeed similar. As we discuss later, the court eventually decided that they were not similar.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. The district court believed that the EEOC's claim fell within the traditional claim of unequal pay for equal work. The court went so far as to suggest that the EEOC attempted to avoid the standards of proof in the traditional EPA claim by relying on Gunther because the EEOC was having difficulty establishing the substantial equality of the jobs at issue. We do not comment on the court's conclusions regarding the EEOC's motives in attempting to rely on Gunther. We do agree with the court's general observations that the Gunther Court, by allowing a Title VII remedy for women who had jobs never held by men, appeared to be particularly concerned with providing a remedy for claims outside the traditional equal pay analysis. See Gunther, 452 U.S. at 179 n.19. Furthermore, we agree that the EEOC's wage discrimination claim was more on the order of a classic unequal pay for equal work claim than it was the type of exceptional/unusual situation of Gunther.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. The district court discusses Sears' compensation practices in more detail. See Sears II, 628 F. Supp. at 1334-37.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. Salaries for checklist employees in credit operations were an exception. Those decisions were generally made at the territorial (group of regions) level.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. The district court found that the only evidence introduced by the EEOC regarding job content was the testimony of a former partner of Hay Associates, Jon Laking. We do not find clearly erroneous the district court's findings that this testimony, discussing relationships between \"C\" codes for jobs before 1976, was entitled to little if any weight and was not credible because the EEOC's experts did not rely on this testimony and Laking had reason to be biased against Sears.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. We have acknowledged that the Hay Method is a \"widely accepted method\" of job evaluation. McGrath v. Zenith Radio Corp., 651 F.2d 458, 469 (7th Cir.), cert. denied, 454 U.S. 835, 102 S. Ct. 136, 70 L. Ed. 2d 114 (1981). We have not, however, suggested that it establishes job equality.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. Sears points to various portions of the record in which witnesses for the EEOC [and Sears] testified that \"accountability\" measured different aspects of a job than did \"responsibility.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. Although our rulings that the EEOC failed to prove that Sears discriminated against women employees in hiring, promotions, or compensation make this discussion of the court's affirmative action findings less necessary, we nonetheless briefly consider the EEOC's challenges to those findings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. Another Sears witness testified that \"since 1968, Sears' clearly enunciated, universally understood, and regularly followed policy was to undertake affirmative action to encourage more women to enter and to succeed in commission sales.\" Sears also introduced written memoranda of February 1973 and August 1972 indicating emphasis on recruiting women to commission sales.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. The parties and the district court characterized this motion as one for partial summary judgment. This label may be confusing because in legal parlance, the phrase \"partial summary judgment\" is typically a misnomer used to describe a pretrial order under Fed. R. Civ. P. 56(d) specifying which facts are controverted and which are established. Such an order is definitely interlocutory and nonappealable. See C. Wright, A. Miller \u0026 M. Kane, Federal Practice and Procedure ยง 2737, at 463 (2d ed. 1983). Instead, the court treated the motion as one for summary judgment as to some of the claims. The court did not, however, expressly employ Fed. R. Civ. P. 54(b) and treat the motion as a judgment on one or more but fewer than all claims and make an express determination and direction to that effect.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. The EEOC had moved for partial summary judgment on five claims of discrimination that were based on certain provisions regarding in Sears' Personnel Manual, on a general Sears' policy regarding hiring of pregnant applicants, and on Sears' alleged adherence to state protective laws. The EEOC informed the court that it would not try those issues even if it were denied summary judgment. The EEOC withdrew two of those claims before the court ruled, and after the court denied summary judgment on the other three claims chose not to appeal two of those claims.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. Neither party addressed the question of whether this denial of summary judgment is appealable. Because the question goes to our jurisdiction over this particular appeal, we believe it is necessary briefly to consider this issue. Generally, denials of summary judgment are interlocutory and thus nonappealable. See United States v. Florian, 312 U.S. 656, 656, 85 L. Ed. 1105, 61 S. Ct. 713 (1941) (per curiam) (reversing, for want of a final judgment, a court of appeals decision hearing the appeal of a denial of summary judgment after the district court had disclosed the denial as a final decision); Ardoin v. J. Ray McDermott \u0026 Co., 641 F.2d 277, 278 (5th Cir. 1981); American National Bank \u0026 Trust Co. v. Certain Underwriters at Lloyd's of London, 444 F.2d 640, 642 (7th Cir. 1971); 6 J. Moore, B. Ward \u0026 J. Lucas, Moore's Federal Practice para. 56.21[2], at 56-1276 (2d ed. 1987). In the typical case, the parties will proceed to try the issue and the question of the validity of the denial of summary judgment in effect becomes moot. This, however, is a rare case, because the EEOC informed the court that if the court chose to deny summary judgment on this and other claims (see supra note 54), the EEOC would not try those issues and would ask the court to dismiss those claims with prejudice. The question then becomes whether the EEOC has waived appeal of this claim in addition to waiving its right to try this claim. We think not. As with other interlocutory orders that arise during the course of a case, denials of summary judgment are merged into a final judgment and then may be appealed. 9 Moore para. 110.07, at 108-09 (denials of summary judgment are \"subject to review only on appeal after the entry of a judgment terminating the action, into which the interlocutory rulings are merged\"); see C. Wright, A. Miller \u0026 M. Kane, Federal Practice and Procedure ยง 2715, at 636-38 (2d ed. 1983); see also Morgan Guaranty Trust Co. v. Martin, 466 F.2d 593, 599-600 \u0026 n.9 (7th Cir. 1972) (dictum); cf. Smith v. Illinois Bell Telephone Co., 270 U.S. 587, 588-89, 70 L. Ed. 747, 46 S. Ct. 408 (1926) (interlocutory injunction merged into final decree of permanent injunction and thus appealable). This comports with the policy of avoiding piecemeal appeals, which is the main policy consideration underlying the general rule against appellate review of denials of summary judgment. See Switzerland Cheese Association v. E. Horne's Market, Inc., 385 U.S. 23, 24-25, 17 L. Ed. 2d 23, 87 S. Ct. 193 (1966); Matterhorn, Inc. v. NCR Corp., 727 F.2d 629, 633 (7th Cir. 1984). This is a situation of first impression in that the specific claim underlying the denial of summary judgment was not tried and thus was not a part of the final judgment terminating the action. We do not believe that allowing appellate review in this instance undermines the policy against piecemeal appeals. This denial of summary judgment was not in essence an interlocutory order because it had the effect of ending any consideration of the claim in district court. The denial also differed from a pretrial adjudication in that the district court released the order denying summary judgment on the same day that it released the opinion on the merits of the case. Thus there were no outstanding claims in connection with the action and the action had been terminated by a final judgment. In addition, we believe it is appropriate to hear this appeal because if we were to deny jurisdiction on this claim we would in effect be foreclosing all avenues of appeal, unless, of course, the judge were to certify the claim as an appealable interlocutory order under 28 U.S.C. ยง 1292. Counsel pursues a risky trial strategy by determining before submitting a summary judgment motion that it will not opt to try an issue if the motion is denied. Our research has disclosed no cases employing such a strategy. It is, however, a legitimate tactic, especially in a large case such as this when the claim underlying the summary judgment motion is minor and attempting to prove it at trial might confuse other issues and cause extensive expenditure of resources. That the strategy is novel does not mean that a party should be denied all avenues of appeal. The EEOC made a conscious decision to stand by its contention that Sears' Personnel Manual provision was discriminatory and that it was entitled to summary judgment on that issue. We will hear this appeal. Cf. Tabacalera Severiano Jorge, S.A. v. Standard Cigar Co., 392 F.2d 706, 716 (5th Cir. 1968) (reversing trial court's denial of summary judgment, noting that denial of summary judgment was not appealable as such but there was no material issue of any relevant fact and both parties had \"more than ample time to develop pleadings and fact issues\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. In Celotex Corp. v. Catrett, 477 U.S. 317, 106 S. Ct. 2548, 2552-53, 91 L. Ed. 2d 265 (1986), the Supreme Court held that Rule 56(c) mandates the entry of summary judgment \"against a party who fails to make a showing sufficient to establish the existence of an element essential to that party's case, and on which that party will bear the burden of proof at trial.\" Because Sears, the defendant, did not have the burden of proof on this discrimination claim, this statement in Celotex does not apply.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. Sears' response to the EEOC's motion for summary judgment suggests that the day's leave with pay may have been an unusual practice -- Sears stated that \"men were not required to utilize this provision, and in many instances would have fulfilled their domestic obligations when they were not scheduled for work or rearranged their work schedules so that time off was not necessary.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. After oral argument the court allowed Sears' motion for additional briefing on Young, and each party thereafter filed supplemental briefs.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. Copus and Adams subsequently married.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. 42 U.S.C. ยง 2000e-5(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The EEOC obtained similar results when it performed these adjustments on figures for expected hires disaggregated by product line. See EEOC Exhibit 1 at 41A, Table 15. Even if one accepts the overly restrictive assumption that only disparities of greater than three standard deviations are significant, Sears II, 628 F. Supp. at 1287, the adjusted figures still reveal significant disparities for most product lines in most years. I do not mean, however, to imply that I accept the three standard deviation cutoff employed by the district court, id. at 1287, and implicitly approved by the majority, supra at 323 n.20. Statistical convention ascribes significance to findings that have only a five percent probability or lower of having resulted from chance factors. The translation of this five-percent chance of erroneously ascribing significance to chance results into standard deviation terms (also known as determining \"the ninety-five percent confidence interval\") depends upon the type of distribution at issue. For a normal distribution, this five-percent level corresponds to a 1.96 standard deviation threshold for a \"two-tailed\" test, designed to test the hypothesis that a variable has no explanatory power (e.g., that being female neither increases nor reduces an applicant's odds of landing a commission sales job), and a 1.65 standard deviation threshold for a \"one-tailed\" test, designed to test the hypothesis that a particular variable does not influence outcomes in one direction (e.g., that being female does not reduce the odds of landing a commission sales job). See generally Palmer v. Shultz, 259 U.S. App. D.C. 246, 815 F.2d 84, 92-97 (1987) (discussing one-tailed and two-tailed tests of statistical significance); D. Baldus and J. Cole, Statistical Proof of Discrimination ยง 9.221 (1980 \u0026 Supp. 1986) (describing differences and, in supplement, advocating use of less restrictive one-tailed test \"if the possibility of intentional discrimination favoring the protected group can be ruled out\"). The Z statistics calculated by the EEOC are based on a binominal distribution, which approaches a normal distribution for selection processes involving large numbers. Thus, the probability of obtaining a Z of 3.0 or greater in the EEOC study due to chance events is very close to the probability of randomly selecting an observation three standard deviations or more above the mean from a normal distribution -- about.001. This is substantially lower than the probability of obtaining a Z of 2.0, which is very close to the probability of selecting an observation two standard deviations above the mean of a normal distribution -- about.023. There is some authority for courts' applying a stricter standard of significance than the five-percent convention favored by social scientists, see, e.g., Hazelwood School Dist. v. United States, 433 U.S. 299, 307-08, 97 S. Ct. 2736, 53 L. Ed. 2d 768 (1978); Coates v. Johnson \u0026 Johnson, 756 F.2d 524, 547 n.22 (7th Cir. 1985), but I find none for a per se rule that any disparity of less than three standard deviations is to be disregarded. See, e.g., Castaneda v. Partida, 430 U.S. 482, 497 n.17, 97 S. Ct. 1272, 51 L. Ed. 2d 498 (1977) (differences \"greater than two or three standard deviations significant to social scientists\"); Palmer, 815 F.2d at 92 (surveying case law on confidence levels).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. It is possible, of course, that the MAG plan did not eliminate discrimination, but instead replaced an evenhanded process with one that affirmatively favored women. Sears' strongest evidence for this interpretation is its data comparing job performance for male and female commission sales people. Sears Exhibit 6-3-2. Both the district court and the majority rely on these figures in their acceptance of Sears' qualifications argument. Sears II, 628 F. Supp. at 1320-22; supra, slip op. at 67-68. I find these data unpersuasive. Sears' expert conceded that only comparisons between men and women in the bottom ten percent of candidates who are hired provide persuasive evidence of affirmative action. Tr. 14,616-19, 18,494 (testimony of Dr. David A. Wise). Sears' data compare the bottom ten percent of performers, however, not the bottom ten percent of candidates as assessed at the time of hiring. Inferior performance among the bottom ten percent of women commission sellers would imply affirmative action in the hiring process only if Sears knew which candidates would become low performers. Sears assumed an almost perfect correlation of.99 between assessed qualifications and performance. Its results do not hold if more realistic correlations are assumed. EEOC Exhibit, Siskind's Rebuttal Testimony at 21-22 (written testimony of Dr. Bernard R. Siskind); Tr. at 17,407-09 (trial testimony of Dr. Siskind).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Nothing in the cases cited by the majority on the separate periods issue suggests that a plaintiff seeking to distinguish periods before and after a corrective action must demonstrate that the employer acknowledged past illegality when it implemented the changes. See, e.g., Teamsters v. United States, 431 U.S. 324, 341-42, 52 L. Ed. 2d 396, 97 S. Ct. 1843 (1977) (corrective action does not excuse prior discrimination); Rich v. Martin Marietta Corp., 522 F.2d 333, 346 (10th Cir. 1975) (improvement after filing of charges does not prove lack of pre-filing discrimination).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Sears accuses the EEOC of \"refuting the entire women's movement\" by refusing to accept social change during the 1970's as a complete account for women's improved prospects at Sears. Appellee's Brief at 98. The factors Sears cites include changes in women's attitudes toward home life and the work place and the increased availability of birth control. Important as these factors may have been, I do not think that they account for two to three years of sharp improvements followed by a gradual leveling off.\u003c/span\u003e\n\n",
    "body_length": 263070,
    "citedas": [
      "839 F.2d 302"
    ],
    "attorneys": "Jeffrey Bannon \u0026 James P. Scanlan, E.E.O.C., for Plaintiff. Charles Morgan, Jr., Morgan Assoc; Pamela S. Morowitz, Paul F. Colarulli, Howard T. Anderson, for Defendant.",
    "category": [
      "128",
      "75"
    ],
    "judges": "Wood, Jr., and Cudahy, Circuit Judges, and Eschbach, Senior Circuit Judges.",
    "citation_count": 118
  }
}
