{
  "id": "jKWNSGYBTlTomsSB0716",
  "document": {
    "title": "04/12/84 OFFICE PEOPLE'S COUNSEL v. PUBLIC SERVICE",
    "full_title": "OFFICE OF PEOPLE'S COUNSEL v. PUBLIC SERVICE COMMISSION POTOMAC ELECTRIC POWER COMPANY, INTERVENOR. WASHINGTON GAS LIGHT COMPANY, INTERVENOR",
    "jurisdiction": "District of Columbia Court of Appeals",
    "date": "1984-04-12T00:00:00.000Z",
    "docket": "No. 83-947",
    "body": "PER CURIAM: In its petition for review, the Office of People's Counsel (OPC) asks this court to reverse the refusal of the Public Service Commission (PSC or Commission) to hold a status conference in its proceeding to promulgate rules to govern OPC assessment requests, and to direct the Commission to proceed with formal rulemaking. The Commission and intervenors move to dismiss the petition. We deny the motion to dismiss and hold that D.C. Code § 43-612(a) (1981) does not provide the Commission with authority to assess the utilities for (a) the fees of private attorneys engaged by the OPC to conduct the OPC's legal business before the PSC and the courts, and (b) certain extraordinary episodic operating expenses incurred by the OPC in connection with particular proceedings not provided for in the normal appropriations process. To the extent that the proposed rules would permit such assessments, they would be ultra vires of PSC's authority; therefore, rather than ordering the Commission to go forward with these proposed rules, we order it to revise its rules in accordance with this opinion.\n\nI\n\nOn May 6, 1980, in PSC Formal Case No. 718, the Commission asserted its jurisdiction to promulgate rules governing OPC assessments for its expenses against the utilities under D.C. Code § 43-612(a). On July 2, 1982, because of its Conclusion \"that it is appropriate to develop rules to guide us in determining whether to issue an assessment or deposit order in a particular instance,\" 29 D.C. Reg. 2818 (1982), the Commission published its Notice of Proposed Rulemaking in this case. The Commission defined the scope of these proposed regulations as to \"delineate[ ] the types of expenses for which OPC may seek reimbursement through an assessment order from an affected utility.\" 29 D.C. Reg. 2819 (to be codified at 14 DCRR § 801.1) (proposed July 2, 1982). The proposed regulations would permit the OPC to petition for reimbursement of \"ordinary\" and extraordinary\" expenses arising from a proceeding pending before the Commission, provided they are incurred in connection with that proceeding. The proposed rule defined \"extraordinary\" expenses as \"those that are episodic, and are not provided for by the appropriations process. However, they may in some instances include the cost of services, and equipment which are of the same or similar nature as those covered by appropriations. Such expenses may not be established by using cost accounting techniques to allocate basic operating expenses and salaries to various proceedings before the Commission.\" 29 D.C. Reg. 2819 (1982) (to be codified at 14 DCRR § 801.1(a)(2)) (proposed July 2, 1982). The proposed regulation provided that \"an expense is ordinary if: (a) The expense is exclusively for personal services; and (b) The natural person that provides the personal service is a 'consultant' within the meaning of this Chapter; and (c) The services provided by the consultant correspond to the expertise or formal training of that consultant.\" 29 D.C. Reg. 2819 (1982) (to be codified at 14 DCRR § 802.1(a)(1)) (proposed July 2, 1982). It also stated that \" consultant is any natural person that furnishes or will furnish services to OPC. A consultant should have either formal training or expertise in a profession including, but not limited to: (a) An attorney who meets the qualifications set forth in § 110.3 or a paralegal working under the direct supervision of such an attorney.\" 29 D.C. Reg. 2820 (1982) (to be codified at 14 DCRR § 802.2(a)) (proposed July 2, 1982). \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nII\n\nThe Commission received comments concerning these proposed assessment regulations, but did not promulgate final rules. Therefore, on April 8, 1983, the OPC filed a motion requesting the Commission to convene immediately a conference about the status of the proposed assessment regulations. On April 29, 1983, the Commission issued Order No. 7811, in which it rejected the request to hold a status conference.\n\nThe OPC appeals this denial, and the Commission, supported by intervenors, moves to dismiss for lack of jurisdiction because the refusal to hold a status conference is not a final appealable order. The Commission also claims that it should be awarded damages and double costs because this appeal is frivolous.\n\nIt is true, as the Commission argues, that a procedural decision made in the course of administrative proceedings, such as the refusal to hold a status conference, would not normally be immediately appealable. Washington Urban League, Inc. v. Public Service Commission, 295 A.2d 906, 908 (D.C. 1972). However, this case fits within a well-recognized exception to the final judgment rule that allows a court to review non-final agency action when such action is clearly beyond the agency's jurisdiction. Leedom v. Kyne, 358 U.S. 184, 3 L. Ed. 2d 210, 79 S. Ct. 180 (1958). Here, because the Commission clearly lacks authority to promulgate these proposed rules, this court has jurisdiction of this appeal.\n\nOur jurisdictional Conclusion follows from our interpretation of D.C. Code § 43-612(a) and its legislative history. It is evident from the legislative history of the 1975 Act that Congress expected the OPC to have a limited, narrowly defined role in the process of utility regulation. We find nothing in either the language or the history of the Act to indicate that Congress intended to single out the OPC among government agencies for preferential treatment and to provide such broad authority for the assessment of OPC expenses outside the usual legislative appropriations process. Thus our examination of that statute leads us to the Conclusion that Congress, when it created the OPC in 1975 with specific authority to hire a legal staff, did not intend to allow the OPC to supplement its staff of lawyers by hiring outside counsel and passing on the cost of such counsel to the utilities; nor did Congress intend to permit the Commission to assess the utilities for the OPC's extraordinary incremental operating expenses. Because the proposed rule contemplated both of these actions which are clearly beyond the Commission's authority, we have jurisdiction to rule on the merits of these proposed rules. Therefore, we must deny the motion to dismiss. As we decline the Commission's invitation to dismiss this appeal, we must also reject its request for damages and double costs.\n\nIII\n\nThe 1975 Act creating the Office of the People's Counsel \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e consisted of three sections. The first \"established within the Public Service Commission of the District of Columbia... an office to be known as the 'Office of the People's Counsel'\" and provided \"at the head of such office[,] the People's Counsel,\" who was \"authorized to employ... such employees, including attorneys, as are necessary to perform the functions vested in him....\" Those functions were spelled out in the Act. The People's Counsel must \"represent and appeal for the people of the District of Columbia at hearings of the Commission and in judicial proceedings involving the interests of users of the products of or services furnished by public utilities....\" The People's Counsel may represent petitioners before the PSC who complain \"in matters of rates or services;\" may investigate services, rates, and property valuations of public utilities; and may develop means, such as providing technical, consultative, and information services to the public, to assure that the interests of users are adequately represented before the Commission.\n\nThe second section of the 1975 Act provided for the amendment of D.C. Code § 43-412 (1973) (now D.C. Code § 43-612(a) (1981)) as follows, in pertinent part, to add reference to the Office of the People's Counsel:\n\nThe expenses including the expenses of the Office of the People's Counsel of any investigation, valuation, revaluation, or proceeding of any nature by the Public Service Commission of or concerning any public utility operating in the District of Columbia, and all expenses of any litigation, including appeals, arising from any such investigation, valuation, revaluation, or proceeding, or from any order or action of the Commission, shall be borne by the public utility investigated, valued, revalued, or otherwise affected as a special franchise tax... and such expenses with interest... may... be allowed for in the rates to be charged by such utility. [Emphasis added.]\n\nThe final section of the 1975 Act authorized appropriations \"to carry out the purposes of act [creating the Office of the People's Counsel]\" at a maximum of $100,000 for each fiscal year following 1975. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nIt is the meaning of the word expenses, as used in the second section of the 1975 Act (hereinafter \"section 612 (a)\") which we are called upon to construe in this case. The Commission, in proposing a rule to permit assessment of the OPC's outside counsel fees, has apparently concluded that Congress, in enacting the 1975 Act, intended to place OPC on equal footing with the PSC by enabling OPC to have its counsel fees for services related to PSC proceedings borne by the utilities as well.\n\nThe Commission and OPC would apparently argue that, because the services of independent attorneys are essential to OPC's vigorous representation of consumer interests, and because expenses is a broad and inclusive term, not expressly limited by Congress in the 1975 legislation, § 612(a) must be read to permit the PSC to assess the utilities for the costs of OPC's outside counsel and for additional administrative expenses required for any particular proceeding, subject only to the restraint of a finding by the PSC that any such \"expenses\" are reasonable.\n\nIV\n\nIn determining the meaning of the word expenses in the 1975 Act, we are mindful of the maxim that we must look first to the language of the statute and, if it is clear and unambiguous, give effect to its plain meaning. 2A SUTHERLAND, STATUTES AND STATUTORY CONSTRUCTION §§ 46.01, 46.04, at 48-51, 54-56 (C. Sands 4th ed. 1973); Petry v. Block, 225 U.S. App. D.C. 279, 281, 697 F.2d 1169, 1171 (1983). See Varela v. Hi-Lo Powered Stirrups, Inc., 424 A.2d 61 (D.C. 1980) (en banc). \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e On its face, the term expenses in § 612(a) is generic and unmodified. Section 612(a) further refers generally to \"all expenses of any litigation.\"\n\nYet, no matter how broad the everyday meaning of the word expenses may be, when such a word is considered in a legal sense, it is not free of ambiguity because it is inextricably linked with words such as costs and fees, which historically have been limited in meaning so as to exclude certain items, particularly attorney's fees. See Alyeska Pipeline Service Co. v. Wilderness Society, 421 U.S. 240, 44 L. Ed. 2d 141, 95 S. Ct. 1612 (1975); see 20 Am. Jur. 2d Costs § 72 (1965) (general terms like costs and expenses are not ordinarily construed to include attorney's fees). \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nMoreover, section 612(a) may be read literally in more than one way. We note that the 1975 Act added mention of the OPC only following the word expenses in the first clause of § 612(a), and not in the second clause referring to expenses of litigation. The omission of any reference to the OPC following the latter use of the word expenses suggests literally that the 93d Congress had a different intention as to OPC expenses in matters before the Commission than as to expenses of litigation, including appeals -- that OPC was authorized to assess the former but not the latter. Even if this reading of § 612(a) is not accepted, as the Supreme Court has explained, \"words are inexact tools at best, and for that reason there is wisely no rule of law forbidding resort to explanatory legislative history no matter how 'clear the words may appear on \"superficial examination.\"'\" Harrison v. Northern Trust Co., 317 U.S. 476, 479, 87 L. Ed. 407, 63 S. Ct. 361 (1943) (citations omitted); see Citizens Ass'n of Georgetown v. Zoning Commission, 392 A.2d 1027, 1033 (D.C. 1978) (en banc). This is particularly so when the broader yet permissible other literal reading of the statute would produce a result contrary to the manifest intent of Congress, as we conclude it would in this case. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nWe are also bound to consider the literal language of § 612(a) in context of the 1975 Act as a whole and in light of its objectives. Howard v. Riggs National Bank, 432 A.2d 701, 709 (D.C. 1981); In re T.L.J., 413 A.2d 154, 158 (D.C. 1980); Don't Tear It Down, Inc. v. Pennsylvania Avenue Development Corp., 206 U.S. App. D.C. 122, 128, 642 F.2d 527, 533 (1980); 2A SUTHERLAND, (supra) , § 46.05. We must give effect to all of the provisions of the Act, so that no part of it will be either redundant or superfluous. Weinberger v. Hynson, Westcott \u0026 Dunning, Inc., 412 U.S. 609, 633, 37 L. Ed. 2d 207, 93 S. Ct. 2469 (1973); Tuten v. United States, 440 A.2d 1008, 1010 (D.C. 1982), aff'd, 460 U.S. 660, 103 S. Ct. 1412, 75 L. Ed. 2d 359 (1983); In re Surface Mining Regulation Litigation, 201 U.S. App. D.C. 360, 376, 627 F.2d 1346, 1362 (1980); 2A SUTHERLAND, (supra) , § 46.06. However inclusive the general language of a statutory provision, it will not apply to matters specifically dealt with in another part of the enactment. Maiatico v. United States, 112 U.S. App. D.C. 295, 301, 302 F.2d 880, 886 (1962) (quoting Ginsberg \u0026 Sons v. Popkin, 285 U.S. 204, 208, 76 L. Ed. 704, 52 S. Ct. 322 (1932)). When a statute creates one funding mechanism, we may not read another into it if to do so would render the stated mechanism useless.\n\nAccordingly, it follows that we must read the word expenses in light of the third section of the 1975 Act, providing for funds to be appropriated for the operating expenses of the OPC, and the first section, giving the OPC express authority to \"employ... employees, including attorneys, as are necessary,\" whose salaries were to be paid from appropriated funds. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e An interpretation of the Act which would permit the OPC to recover the costs of administrative expenses and of hired attorneys through the assessment procedure of § 612(a) would render these other provisions of the Act inoperative, since al of the OPC's statutory functions, mandatory and discretionary, relate in some way to proceedings of the PSC. The language of the statute provides no distinction between routine administrative expenses and staff attorney work assignments, on the one hand, and extraordinary expenses and attorney work related to a particular proceeding, on the other hand. Under the construction needed to support these proposed rules, all of the OPC's operating expenses might be charged directly to the utilities under § 612(a), and the appropriations authorization set forth in the statute would no longer be needed. Furthermore, the People's Counsel is an appointed official, required to be an attorney, whose mission is to serve as an advocate for the people of the District of Columbia. The 1975 Act contained no provisions authorizing the People's Counsel to delegate that mission other than to his salaried employees; thus a construction of § 612(a) which would permit the People's Counsel to delegate his advocacy responsibilities to outside counsel would reduce his role to that of an administrator and undermine those provisions of the Act setting forth his personal duties.\n\nApplying the aforementioned canons of statutory construction to § 612(a), then, we cannot say that the meaning of the word expenses, viewed in the context of the other provisions of the 1975 Act, is so clear and unambiguous such that we should adopt the construction needed to support the proposed rules. Accordingly, we must examine the legislative history of the 1975 Act to ascertain congressional intent.\n\nV\n\nIn reviewing the legislative history in this case, the single most difficult question to be resolved is whether the 1975 Congress, in adopting the language of the 1927 Act originally authorizing assessments against the utilities, fully intended to confer upon the OPC authority identical in scope to that which the 1927 Congress apparently intended to confer upon the Commission. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Although the committee reports on the 1927 Act specifically explain that assessment authority was needed to provide direct funding for, among other things, \"legal assistance,\" \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e which appears to support the rules, we conclude that Congress in 1975 did not intend to give such authority to OPC.\n\nFirst of all, it is not entirely clear that, by referring to \"legal assistance\" and \"legal assistants,\" the 69th Congress contemplated the hiring of outside legal counsel. Nowhere in the reports are the words lawyer or attorney used. Also, the references in the committee reports to the need for \"legal assistance\" \"to... represent the public\" and \"to... present evidence\" might refer, not to the hiring of private attorneys to perform those functions for the Commission, but rather to the hiring of law clerks, legal stenographers, hearing officers, expert witnesses, or investigators to assist the Corporation Counsel in performing its duties as general counsel to the PSC. This view is somewhat strengthened by the fact that, as enacted in 1927, the assessment legislation covered only the expenses of investigations, valuations, revaluations, and other proceedings \"made by\" the PSC; it did not include the second clause of § 43-612(a) covering \"all expenses of any litigation.\" \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nThe legislative history of the 1927 Act contained no significant references whatsoever to operating expenses. Further, the assessment legislation received only summary consideration in Congress, and its immediate purpose was to provide technical assistance in investigations for several imminent and important valuations. It appears that the House committee did not hold hearings on the assessment legislation and did not develop a companion bill; it simply adopted the Senate report as its own. H.R. REP. No. 2240, 69th Cong. 2d Sess. (1927). Both houses of Congress passed the assessment bill with virtually no debate and no mention of legal fees or operating expenses. 67 CONG. REC. 9078 (1926); 68 CONG. REC. 5121 (1927). Rather, the 1927 Act focused primarily on providing accountants, engineers, and expert witnesses to assist the PSC in the forthcoming valuations, for which the utilities had already spent $100,000 to justify requested increases of at least 33%, and the Commission had only $150 with which to obtain information to counter that presented to it by the utilities.\n\nEven if we assume, however, that the specific references to \"legal assistance\" in the reports on the 1927 Act reflect an intention on the part of the original authors of § 612(a) that the word expenses be read broadly with respect to the PSC, we are not required to reach the same Conclusion with respect to the OPC. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Although the legislative history of the 1927 Act is certainly a factor to be considered, our primary focus in determining the scope of the word expenses in § 612(a) as applied to the OPC is on the intent of the 93d Congress in 1974.\n\nThere is every indication in the legislative history of the 1975 Act that Congress envisioned a limited role for the OPC. The committee reports, referring to the 1926 Act authorizing the appointment of a People's Counsel, state that the committees \" upon the original thinking and concerns of Congress when it initially enacted this law.\" H.R. REP. No. 1485, 93d Cong., 2d Sess. 2 (1974); S. REP. No. 1349, 93d Cong., 2d Sess. 3 (1974). The very brief committee report on the original OPC Act \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e states simply that the Corporation Counsel (then representing the PSC) was unable to give the proper time to present complaints of the people to the Commission and the courts, and that \"an officer\" should be appointed, within the PSC and in place of the one attorney then provided to the Commission, \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e to speak for the people in matters of rates and services.\n\nLike the 1926 Act, the original House bill introduced in 1974 to re-establish the OPC \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e called for the appointment of a single counsel, within the PSC, with no express hiring authority and no assessment authority. It was only as the House bill moved through the legislative process that the original concept was expanded to provide for staff, including attorneys, to authorize separate appropriations for the OPC, and to provide assessment authority. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nEven then, it was made clear in the committee reports \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e and during the committee hearings \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e that, because it would be impossible for the OPC to seek redress for all of the many divergent concerns of its constituency, broad intervention by private citizens would continue to be permitted and encouraged after the OPC was established. Had the Congress intended the People's Counsel to have virtually unlimited operating resources and unlimited numbers of private attorneys available to him under § 612, subject only to a PSC determination of \"reasonableness\" in a given case, it would not have expected the People's Counsel to have to use great selectivity in serving as the consumers' advocate; and it would not have emphasized the continuing need for intervenors in PSC proceedings. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nMoreover, the bill was viewed as noncontroversial. During the House debate on the 1975 Act, Representative Adams, House sponsor and manager of the bill, explained: \"I do not think this bill is controversial.... It reenacts a section that was previously in the District of Columbia Code.\" 120 CONG. REC. 37265 (1974). Further, the principal sponsors of the 1975 Act estimated assessments for OPC under § 612 would range from only \"$25,000 to $50,000 in assessments per year.\" H.R. REP. No. 1485, (supra) at 9; S. REP. No. 1349, (supra) at 9. Nearly all of these legislators -- Senators Eagleton and Mathias, Representatives Adams, Breckinridge, and Fraser -- were experienced attorneys and were surely well aware of the fees charged by Washington law firms. Had they intended the OPC to have extensive access to the services of Washington law firms under § 612(a), their estimates of the level of OPC assessments would have been higher, and they would have considered the bill controversial. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nThe level of attention given by the Congress to the 1975 Act likewise indicates that it was not viewed as being as sweeping in scope as the Commission and OPC believe. The 1975 Act was introduced and considered entirely within the last three months of the 93d Congress (during which a full month's recess was taken for congressional elections); and final congressional action on it took place on the last day -- December 20, 1974 -- of the lame-duck session. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e The Senate passed the bill with absolutely no debate during a Saturday session. The legislative history indicates that the OPC proposal was shepherded through the 93d Congress in its final days because of concern among members of the House Committee on the District of Columbia that residential utility customers might not be represented in PSC proceedings scheduled for the following month on rate increases requested by all three major local utilities. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nConsidering the haste in which Congress enacted the 1975 legislation, there is no reason to believe that any Members of Congress ever read the references to \"legal assistance\" in the committee reports on the 1927 Act, or understood the assessment provisions they adopted for OPC to cover any legal fees and operating expenses. The only judicial opinion concerning the coverage of § 612(a) available to the 93d Congress made no mention of either legal fees or operating costs. It held only that the most traditional of court costs -- \"the costs of printing the record and the brief... upon... appeal\" -- were within the pure view of the assessment provision. Washington Ry. \u0026 Electric Co. v. District of Columbia, supra, 64 App. D.C. at 246, 77 F.2d at 369.\n\nWe know from the legislative history only that Congress knew the Commission assessed for expert witnesses and accountants, heard Maryland's People's Counsel speak at length about the need for adequate funding for expert witnesses and consultants, \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e and believed that the new OPC would need independent authority to obtain \"such expert witnesses.\" 120 CONG. REC. 37267 (1974).\n\nThe then Chairman of the PSC testified at the committee hearings only that Commission used its assessment authority in rate cases, to employ accountants and to engage \"outside experts\" on technical matters and on industry economics \"to look into... allocation factors,... rate of return rate of design questions.\" Hearings on H.R. 16782, (supra) at 14, 31. Not a word was said about the PSC then following a practice of assessing for outside legal counsel or for any operating expenses. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nAccordingly, the House and Senate committee reports simply stated (tracking the PSC Chairman's testimony) that OPC would be able to assess for the same kinds of expenses as the committees understood were assessed by the PSC: \"the costs of expert witnesses, special accountants, or other extra costs incurred as a result of particular proceeding....\" H.R. REP. NO. 1485, (supra) at 4; S. REP. NO. 1349, (supra) at 5 (emphasis added). There is no indication that Congress was told that the Commission construed § 612(a) to include assessments for legal fees (or that the Congress would ever have been so advised, in view of the Commission's conceded practice at that time of relying instead upon D.C. Code § 43-606 (1973) to assess legal fees). Congress would have had no reason whatever to believe that the Commission had a practice of assessing for any of its operating expenses.\n\nMoreover, all of the references in the 1974-75 legislative history to OPC's legal staff and operating expenses suggest a dichotomy between the items covered by appropriations and the items covered by assessments, and suggests that attorney work and operating expenses would be covered by the standard appropriations process. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e The original House bill provided for the services of only one attorney, presumably to be funded through PSC appropriations. When the Senate committee amended the bill to make the OPC independent of the PSC, its hiring of staff (including additional attorneys) was still limited by the overall authorization ceiling for appropriations.\n\nDuring the debate on the bill in the House, the bill's sponsor, in explaining that the cost of the bill was essentially the cost of hiring one lawyer and one secretary, made no mention whatsoever of the possibility of outside legal counsel being hired. He simply stated: \"They are not hiring more than one and not going into an elaborate staff.\" 120 CONG. REC. 37267. When the House considered the Senate amendments, the following colloquy took place on the House floor:\n\nMr. McClory: ... is it limited as far as who the People's Counsel can employ or is it unlimited as far as additional staff?\n\nMr. Diggs: A limitation is imposed by the authorization level for the operation of this office.\n\n120 CONG. REC. 41849. In addition, the principal supporter of the House bill explained that the People's Counsel was given a \"regular salary,\" \"carefully separated... from the expenses,\" so that he would \"not have to go out to get business in order to be paid,\" 120 CONG. REC. 37267, again emphasizing that the bill was designed for limited purposes and that the OPC was meant to serve a limited role.\n\nBoth the committee reports indicated that \"the basic expenses of the Office of People's Counsel, including salaries, rent, supplies, telephones, and equipment\" would be covered by \"the standard appropriations process.\" H.R. REP. NO. 1485, (supra) at 4, 7-8; S. REP. NO. 1349, (supra) at 6-7. Such reports went on to explain the kinds of items to be funded \"in addition to these basic expenses,\" through the assessment provisions, \"would include, for example, the costs of hiring expert witnesses, rate design economists, safety engineers and other specialized consultants in specific rate cases.\" Id. at 9. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e During initial House consideration of the bill, in distinguishing the appropriated funds from those to be assessed, the bill's sponsor again explained that \"the expenses that may be incurred for the various cases such as for expert witnesses, court costs, and so forth\" were not to be appropriated (but assessed) 120 CONG. REC. 37267. It is reasonable to conclude that the kinds of expenses Congress intended OPC to assess under § 612(a) must be in nature similar to those specifically mentioned in the legislative history.\n\nAt one point in the debate, Representative Gude made a comment which appears to suggest that the utilities should be assessed for OPS's incremental operating expenses related to particular proceedings:\n\nThe bill provides that the operating expenses of the People's Counsel in any investigation or procedure incident to the operations of the Public Service Commission in connection with a public utility operating in the District of Columbia shall be borne by the public utility itself.\n\n120 CONG. REC. 37268 (1974) (emphasis added). However, Representative Gude, who was not one of the co-authors of the bill, went on to state that the appropriation of $100,000 per year \"is to defray such expenses as salaries, office rental, equipment, and the like.\" Id. Thus it is not clear what he meant by his earlier reference to operating expenses, and we do not find it persuasive since it conflicts with other indications in the legislative history that operating expenses were to be funded from appropriations, not through assessments.\n\nNotably, the appropriations provisions were added to the bill because it was brought to the attention of the Senate committee that the House-passed bill, including the assessment provisions, did not provide funding for administrative expenses. Then-Mayor Washington wrote:\n\nH.R. 17450 does not provide for payment of the administrative or overhead expenses of the office of the People's Counsel.... It would authorize the assessment against public utility companies only of the expenses of the Public Service Commission (and the People's Counse) which are directly related to a specific proceeding (usually involving a rate-setting process) on a case-by-case basis. The general operating expenses of the Public Service Commission are budgeted and handled through the normal appropriation processes.... Likewise, the administrative overhead of the People's Counsel, which will not be net by the pass-through provisions of H.R. 17450, should be subject to annual appropriation. We recommend, accordingly, the inclusion of a provision in the bill to authorize such appropriations specifically for the office of the People's Counsel.\n\nS. REP. NO. 1349, (supra) at 11-12 (emphasis added). \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nOrdinarily, Congress may be presumed to know the construction which has been given to prior statutory provisions, and to know their history, when it incorporates them into later legislation. Lorillard v. Pons. 434 U.S. 575, 578, 55 L. Ed. 2d 40, 98 S. Ct. 866 (1978); Burns v. Equitable Life Assurance Society of the United States, 696 F.2d 21, 23 (2d Cir. 1982). However, for this doctrine to come into play, Congress must have been aware of the prior construction and must give some affirmative indication of a like intent. Commissioner v. Glenshaw Glass co., 348 U.S. 426, 431-32, 99 L. Ed. 483, 75 S. Ct. 473 (1955); see United States v. Sheffield Board of Commissioners, 435 U.S. 110, 134, 98 S. Ct. 965, 55 L. Ed. 2d 148 (1978); Association of American Railroads v. ICC, 184 U.S. App. D.C. 1, 8, 564 F.2d 486, 493 (1977). Where, as here, there was no prior judicial construction directly addressing this question concerning the assessment provision, no evidence that Congress in 1974 knew of its earlier history or any agency construction specifically including attorney's fees or operating expenses, and considerable evidence of a contrary intent, the language in the 1927 committee reports, (supra) at 10-11, is not decisive. This is particularly so since the incorporating and incorporated statutes were distant in time, and he borrowed statute was adopted in its entirety. Cf. Burns v. Equitable Life Assurance Society of the United States, supra, 696 F.2d at 23. We are persuaded instead that the 1974 legislative history requires a more limited construction of § 612(a) which does not include the fees of outside counsel and extraordinary operating expenses.\n\nVI\n\nFinally, we address the policy question of whether we should construe § 612(a) to allow direct assessments for attorney's fees and certain operating expenses because OPC requires such preferential treatment to fulfill its statutory mandate. Such an interpretation is impossible in view of the limited role which the 93d Congress perceived the OPS would assume. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e As we have discussed, the Congress in creating the OPC in 1975 recognized its limitations and never intended that it be able to provide legal representation to every divergent consumer interest. Active participation by intervenors was contemplated. Moreover, now that the OPC no longer has any limitations on its appropriations, under the People's Counsel Authorization Act of 1979, (supra) note 3, there are no arbitrary monetary restraints on OPC's hiring of staff, including attorneys, to represent the public as vigorously as it wishes. It need only satisfy legislative scrutiny in the appropriations process.\n\nLike courts in other jurisdictions, \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e we are loath to impose a tax upon a utility, subject only to a PSC determination of reasonableness, absent clear legislative authorization. We do not find in the 1975 Act reviving the Office of People's Counsel any authorization for the assessment of OPC's incremental operating expenses and the fees of outside counsel retained by OPC in connection with Commission proceedings.\n\nWe therefore conclude that § 612(a) does not authorize the PSC to assess the utilities it regulates for the fees of private attorneys retained by the OPC in connection with PSC proceedings, or for the OPC's extraordinary incremental operating expenses incurred in connection with such proceedings, in lieu of obtaining legislative appropriations in the usual way as all other government agencies do. The Commission is directed to revise its proposed rules accordingly. The motion to dismiss is denied.\n\nSo Ordered.\n\nFERREN, Associate Judge, Dissenting: I respectfully Dissent for the reasons set forth in Part IV of Chief Judge NEWMAN's opinion for the division majority, affirming the Commission's order, in Washington Gas Light Co. v. Public Service Commission of the District of Columbia, 477 A.2d 1093 (1982), ship op. at 28. That opinion was vacated and the case reheard en banc. On September 30, 1983, the en banc court affirmed the Commission's order by an equally-divided court, without opinions.\n\nI attach hereto as an appendix the division opinion and Dissent, as well as the en banc order, in Washington Gas Light, supra, as these have not yet been published beyond this court's slip opinion series.\n\nAPPENDIX\n\nDISTRICT OF COLUMBIA COURT OF APPEALS\n\nNo. 81-302\n\nWASHINGTON GAS LIGHT CO., PETITIONER, v. PUBLIC SERVICE COMMISSION OF THE DISTRICT OF COLUMBIA, RESPONDENT, OFFICE OF PEOPLE'S COUNSEL OF THE DISTRICT OF COLUMBIA, POTOMAC ELECTRIC POWER CO., CHESAPEAKE \u0026 POTOMAC TELEPHONE CO., INTERVENORS.\n\nNo. 81-303\n\nOFFICE OF PEOPLE'S COUNSEL OF THE DISTRICT OF COLUMBIA, PETITIONER, v. PUBLIC SERVICE COMMISSION OF THE DISTRICT OF COLUMBIA, RESPONDENT, WASHINGTON GAS LIGHT CO., POTOMAC ELECTRIC POWER CO., CHESAPEAKE \u0026 POTOMAC TELEPHONE CO., INTERVENORS.\n\nNo. 81-305\n\nPOTOMAC ELECTRIC POWER CO., PETITIONER, v. PUBLIC SERVICE COMMISSION OF THE DISTRICT OF COLUMBIA, RESPONDENT, WASHINGTON GAS LIGHT CO., OFFICE OF PEOPLE'S COUNSEL OF THE DISTRICT OF COLUMBIA, CHESAPEAKE \u0026 POTOMAC TELEPHONE CO., INTERVENORS.\n\nPetitions for Review of an Order of the Public Service Commission of the District of Columbia\n\nArgued September 1, 1981\n\nDecided October 4, 1982\n\nCarl W. Belcher, with whom Lewis Carroll and Abraham R. Spalter were on the brief, for petitioner and intervenor Washington Gas Light Co.\n\nLloyd N. Moore, Jr., General Counsel, for respondent Public Service Commission.\n\nJoseph H. Sharlitt, with whom Brian Lederer, People's Counsel, Elizabeth Noel, Deputy People's Counsel, and Harley Daniels were on the brief, for petitioner and intervenor Office of People's Counsel.\n\nWilliam Dana Shapiro, with whom Edward A. Caine and Betty K. Cauley were on the brief, for petitioner and intervenor Potomac Electric Power Co.\n\nLee A. Satterfield, with whom Robert A Levetown, William L. Leonard, and Dwight G. Duncan were on the brief, for intervenor Chesapeake and Potomac Telephone Co.\n\nBefore NEWMAN, Chief Judge, and KERN and MACK, Associate Judges.\n\nOpinion for the court by Chief Judge NEWMAN.\n\nOpinion Concurring in part and Dissenting in part by Associate Judge KERN at p. 43.\n\nNEWMAN, Chief Judge: This case arises from petitions submitted to the District of Columbia Public Service Commission (\"PSC\" or \"Commission\") by Washington Gas Light Co. (\"WGL\") and Potomac Electric Power Co. (\"PEPCO\") challenging the Office of People's Counsel's (\"OPC\") practice of directing the utilities, without PSC approval, to reimburse certain of its expenses. The PSC hearing on the petitions and subsequent order dealt with two types of issues. The first concerns the respective roles of the OPC and the PSC in ordering utility payments for OPC expenses. The second group involves the types of expenses that are properly assessable, and the purposes for which those expenditures may be made. The PSC ruled that: (1) The PSC, and not OPC, has the sole statutory authority to order regulated utilities to make payments for the purpose of covering OPC expenses. (2) In the course of making such assessments, the PSC is required to review the reasonableness of OPC's requests for expense funds. (3) Reimbursement is limited to expenses incurred due to OPC's involvement in proceedings and investigations of the Commission. Accordingly, independent OPC investigations that have not ripened into action before the PSC must be funded out of OPC's budget appropriations. (4) Potentially reimbursable items include the fees of private attorneys and \"extraordinary incremental expenses,\" but not basic operating expenses. The fact that certain items are similar to other items that are funded by appropriation does not preclude the former from being assessable. The People's Counsel now appeals the rulings summarized under (1) and (2). PEPCO and WGL, joined by intervenor Chesapeake \u0026 Potomac Teleophone (\"C\u0026P\"), appeal the decisions on points (3) and (4). We affirm on all counts.\n\nWe begin with a brief review of the institutional and statutory background of the case, followed by a summary of its procedural history. After a Discussion of the scope of review, the issues for decision are analyzed in four parts, corresponding to the rulings noted (supra) . Parts I and II deal with the respective authority of the PSC and OPC with regard to the assessment of OPC expenses against the utilities. In Part I we conclude that the D.C. Code authorizes the PSC, not OPC, to order expense payments. In Part II, we consider the PSC's authority and responsibility to review the reasonableness of OPC requests for expense payments. The last two parts consider statutory limits on the expenses for which payments may be ordered. In Part III, we conclude that OPC expenditures are assessable only if employed for the purpose of participation in PSC activities, such as Commission hearings and investigations; independent OPC investigations are excluded. Part IV focuses not on the kind of OPC project for which financial support may be sought, but on the types of items which may be funded. We conclude that the PSC is authorized to order utilities to bear the fees of private attorneys retained by OPC, as well as other reasonable incremental expenses not provided for in appropriations.\n\nIn its early years, the PSC, represented through the Corporation Counsel, was the only public institution advancing ratepayer interests in matters of utility regulation. Perceiving the need for a publicly funded consumer advocate with a large measure of independence from the decisionmaking body, Congress created the Office of the People's Counsel in 1926. Act of Dec. 15, 1926, Pub. L. No. 69-529, Ch. 8, § 3, 44 Stat. 921 (1926). It was subsequently abolished, Reorganization Plan No. 5 of 1952, § 2(b), 66 Stat. 824 (1952), but was recreated in 1975 by amendment of the D.C. Code, Act of Jan. 2, 1975, Pub. L. No. 93-614, 88 Stat. 1975 (1975), codified at D.C. Code 1981, § 43-406(a). It is charged with representing the interests of District of Columbia residents who use the services of utilities regulated by the PSC. Not surprisingly, much of this representation function is performed in proceedings before the Commission. However, the OPC is not limited to participation in matters initiated by, or pending before, the PSC. It is authorized to investigate \"the services given by, the rates charged by, and the valuation of the properties of, the public utilities under the jurisdiction of the Commission,\" and to provide certain services to consumers, including \"public information dissemination, consultative services, and technical assistance.\" D.C. Code 1981, § 43-406(d).\n\nLike the Congress that originally created the OPC, the Ninety-third Congress was apparently convinced that the substantial segregation of the PSC's advocacy and adjudicative roles would improve the utility regulation process. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e The legislative history of the 1975 amendments indicates a concern for maintaining the independence of OPC from PSC supervision. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e As ultimately enacted, the amendments included several provisions that foster the independence of OPC. For example, the People's Counsel is appointed by the Mayor for a fixed term of three years. D.C. Code 1981, § 43-406(b). While the statute states that the OPC exists within the PSC, D.C. Code 1981, § 43-406(a), the two organizations receive separate appropriations. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e D.C. Code 1981, § 43-406(a).\n\nHowever, appropriations cover only a part of the cost of utility regulation. Utility consumers have always borne the cost of advocacy of the utilities' interests before the Commission, which are paid out of rate revenues. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Since 1927, the utilities have been required to bear the PSC's non-appropriated expenses of investigation and regulation. Act of Mar. 3, 1927, Pub. L. No. 69-707, 44 Stat. 1351 (1927), codified at D.C. Code 1981, § 43-612(a). In 1975 Congress decide that the expenses of adjudication, investigation, and advocacy incurred by OPC should also be charged to the utilities, and ultimately financed by utility charges \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e rather than tax levies. The 1975 amendments added language (italicized here) that extended the scope of the expense provisions to cover costs incurred by the OPC.\n\nThe expenses, including the expenses of the Office of the People's Counsel, of any investigation, valuation, revaluation, or proceeding of any nature by the Public Service Commission... and all expenses of any litigation, including appeals, arising from any such investigation, valuation, revaluation, or proceeding, or from any order or action of the Commission, shall be borne by the public utility investigated, valued, revalued, or otherwise affected as a special franchise tax.... [D.C. Code 1978 Supp., § 43-612(a).] \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nThe combined expenses of the PSC and the People's Counsel in any valuation or rate case may not exceed one-half of one percent of the utility's existing valuation. The combined expenses for all other investigations are limited to one tenth of a percent per year. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Id.\n\nThe same section outlines a procedure for the collection and disbursement of expenses borne by the utilities, which was also modified in 1975 to provide a role for the OPC.\n\nWhen any such investigation, valuation, revaluation, or other proceeding is begun the said Public Service Commission may call upon the utility in question for the deposit of such reasonable sume or sums as in the opinion of said commission, it may deem necessary... the money so paid to be deposited in the treasury of the United States to the credit of the appropriation account known as \"miscellaneous trust fund deposit...\" and to be disbursed in the manner provided for by law for other expenditures... for such purposes as may be approved by the Public Service Commission; or certified by the People's Counsel with respect to his expenses. [ Id. (italics indicate language added in 1975).]\n\nShortly after the Office of the People's Counsel was reinstituted, it began submitting \"assessment orders\" directly to utilities, without PSC approval. These demands were complied with, but, as People's Counsel concedes, OPC's asserted authority to make legally binding orders was never acknowledged by the utilities. Then, in 1978, PEPCO challenged this alleged authority before the PSC by means of a motion to quash an assessment order. In Formal Case 685, the Commission denied the motion on the ground that the PSC had no jurisdiction to review OPC expense assessments. Hearing, Formal Case 685, p. 187 et seq. (February 21, 1978). No appeal was taken.\n\nThe challenge to OPC's alleged assessment power which forms the basis of the present appeal was initiated by Washington Gas Light. On April 4, 1979, WGL submitted to the PSC a Petition for a Declaratory Order to Remove Uncertainty, pursuant to D.C. Code 1981, § 1-1508. The petition asserted that the PSC rather than the OPC has sole authority to make binding assessments (in the form of orders to make deposits into the miscellaneous trust fund). It also argued that utilities may not be required to bear the cost of certain categories of expenditures. On April 25, PEPCO petitioned the PSC in Formal Cases 680 and 706 to rule on the legality of two assessment orders growing out of those cases, which PEPCO had refused to pay. On August 10, 1979, the Commission consolidated all pending disputes concerning OPC expense assessments into Formal Case 718. The Chesapeake \u0026 Potomac Telephone Co. was permitted to intervene in support of the stands taken by the other utilities. A prehearing conference was held at which nine issues were formulated for decision.\n\n1. Whether, in the absence of an order of the Commission, People's Counsel may require a utility to deposit funds for use by the Office of the People's Counsel (OPC).\n\n2. Whether the Commission has the authority, on a petition from a utility, to review the reasonableness of an assessment request made by the OPC.\n\n3. Whether the Commission can lawfully enforce an assessment order of the OPC without reviewing the reasonableness of the requested assessment.\n\n4. Whether a utility is required to pay the fees of independent attorneys engaged by the People's Counsel to perform legal services.\n\n5. Whether a utility is required to pay a proportional share of the costs of supplies, services and other basic operating expenses of OPC.\n\n6. Whether a utility is required to pay a proportional share of the salaries of employees of OPC.\n\n7. Whether a utility is required to pay the costs of an investigation initiated and conducted by People's Counsel when such investigation is not pending before the Commission.\n\n8. To what extent may the Commission, on a complaint from a utility, inquire into the method and manner in which the OPC expends the funds paid to it as a result of the issuance of a miscellaneous deposit trust fund order by the People's Counsel or by an order by the Commission upon certification of actual expenditures or anticipated expenditures by OPC.\n\n9. Assuming that the Commission finds that the assessment process currently in effect is unlawful either as operated by the People's Counsel or as permitted by the Commission, what, if any, relief can the Commission grant?\n\nAfter briefing and argument, the Commission presented its answers to these questions in Order 7211. It ruled that:\n\n1. The People's Counsel has no authority to\n\nrequire a utility to deposit funds for OPC use\n\nwithout a Commission order. PSC Order\n\n7211 at 4 (Nov. 13, 1980).\n\n2.\u00263. The PSC may review the reasonableness of\n\nan OPC request for funds at the request of\n\na utility, and must do so before enforcing an\n\nOPC request. Id. at 4-5.\n\n4. Utilities may be required to pay the cost of\n\nprivate attorneys engaged by the OPC. Id.\n\nat 5.\n\n5.\u00266. \"Basic operating expenses or salaries\"\n\nalready financed through appropriations may\n\nnot be assessed against utilities even when\n\nthey are incurred in connection with a\n\nCommission proceeding. However, \"extraordinary\n\nincremental expenses incurred by OPC\n\nin connection with a proceeding before this\n\nCommission,\" which \"may... include the\n\ncosts of services, equipment and salaries\n\nwhich are of the same or similar nature as\n\nthose covered by appropriation,\" are assessable.\n\nTo be classified as an \"extraordinary\n\nincremental expense\" an expenditure must\n\nbe episodic and not provided for in the\n\nappropriations process. Id. at 6.\n\n7. Utilities are not required to pay the costs of\n\nOPC investigations that are not pending\n\nbefore the PSC. Id. at 6.\n\n8. While the Commission has responsibility for\n\nordering deposits into the trust fund, it may\n\nnot inquire into the\n\nmanner of disbursement or expenditure\n\nof monies drawn from the\n\nfund. OPC certification of past or anticipated\n\nexpenditures covered by fund deposits\n\nis made not to the PSC but to the public\n\nauthority that administers the trust fund. Id.\n\nat 7.\n\n9. The PSC may grant prospective relief. Id.\n\nat 7.\n\nThe Commission ordered that all OPC assessment requests be forwarded to it along with supporting documentation, to be reviewed in accord with its rulings.\n\nOPC submitted an Application for Reconsideration of points 2, 3, 5, 6, and 7. The utilities filed similar motions seeking reconsideration of rulings 4, 5, and 6. In Order 7243 (January 12, 1981), the Commission denied the motions. Having thus paved the way for judicial review, OPC appeals the decisions regarding Commission authority to review assessment requests and the non-assessability of independent investigation expenses (numbers 2, 3 and 7). WGL and PEPCO appeal the rulings on questions 4, 5, and 6, which concern the assessability of private attorneys' fees and \"extraordinary incremental expenses.\" By an Order of March 26, 1981, these appeals were consolidated and the petitioner in each was made an intervenor in the others. In addition, C\u0026P was permitted to intervene in all three appeals. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nBefore proceeding to a Discussion of the merits, a word about the scope of review is in order. The statute governing review of PSC decisions draws a sharp distinction between agency determinations of matters of law and fact. The former are subject to review, while the latter are to be set aside only if unreasonable, arbitrary, or capricious. D.C. Code 1981, § 43-906. The Commission maintains that it has primary responsibility for determining questions arising under the Public Service Commission Law, subject only to \"limited review\". However, PEPCO argues that the issues presented on appeal are solely matters of law, and that Commission interpretations of the statutes in question are \"neither controlling nor entitled to special deference.\"\n\nIn cases involving construction of the Public Utilities Act, this court has accorded substantial weight to the views of the PSC. \"Although the ultimate responsibility for determining the correct interpretation of a statute rests with the courts [citing FTC v. Texaco, 393 U.S. 223, 226, 21 L. Ed. 2d 394, 89 S. Ct. 429 (1968)], 'it is settled that the courts should give great weight to any reasonable construction of a regulatory statute adopted by the agency charged with the enforcement of that statute'\" (quoting Investment Co. Institute v. Camp, 401 U.S. 617, 626-27, 28 L. Ed. 2d 367, 91 S. Ct. 1091 (1971)). Watergate Improvement Associates v. Public Service Commission, D.C.App., 326 A.2d 778, 785 (1974). \"An appellate court should give 'great deference to the interpretation given the statute by the... agency charged with its administration'\" (quoting Udall v. Tallman, 380 U.S. 1, 16, 13 L. Ed. 2d 616, 85 S. Ct. 792 (1965)). Chesapeake \u0026 Potomac Telephone Co. v. Public Service Commission, D.C.App., 378 A.2d 1085, 1089 (1977). Thus while this court retains the ultimate authority to establish what the statute means, the PSC's view is \"a substantial factor to be considered.\" Youakim v. Miller, 425 U.S. 231, 235, 47 L. Ed. 2d 701, 96 S. Ct. 1399 (1976).\n\nI. AUTHORITY TO ORDER UTILITIES TO MAKE EXPENSE PAYMENTS\n\nThe PSC ruled that \"OPC does not have the power to issue assessment orders; this Commission has the exclusive authority to issue orders....\" \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e PSC Order 7211 at 5. It based this result on its interpretation of § 43-612(a) in light of the complete statutory scheme.\n\nSection 43-612(a) states that OPC's expenses for certain of its activities \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e shall be borne by the public utility involved. It provides a means for the collection of these funds from the utilities and their disbursement to OPC. The PSC is authorized to require utilities to make payments into a fund known as \"miscellaneous trust fund deposit.\" As no distinction is made between deposits for the expenses of the Commission and those of the People's Counsel, it is clear that the same mechanism applies in both cases. The only OPC role mentioned regards the disbursement of money from the fund. It may withdraw money by certifying its expenses. Neither the PSC nor the utilities contend that such certification must be made to the Commission or approved by it.\n\nNo other procedure for the funding of OPC expenses (other than appropriation) is mentioned in § 43-612 or elsewhere in the statute. OPC, however, contends that this omission is merely an oversight on the part of Congress, which intended that the statutory assessment mechanism be merely optional. People's Counsel would have the court imply OPC authority to make direct assessments against the utilities from the statutory mandate that its expenses \"shall be borne\" by the utilities. That suggestion is untenable. OPC, like the Commission and other government institutions, is a creature of statute and has only such powers as are given by statute. Cf. Chesapeake \u0026 Potomac Telephone Co. v. Public Service Commission, supra at 1089 (referring to the PSC's powers). See A. PRIEST, PRINCIPLES OF PUBLIC UTILITY REGULATION 10 (1969). \"In the absence of persuasive evidence to the contrary, we are not empowered to look beyond the plain meaning of a statute's language in construing legislative intent.\" United States v. Stokes, D.C.App., 365 A.2d 615, 618 (1976). District of Columbia v. National Bank of Washington, D.C.App., 431 A.2d 1, 4 (1981). OPC concededly is not explicitly given the authority to order payments. This in itself is not conclusive, since the Public Service Commission Law is to be liberally construed to carry out its purposes. D.C. Code 1981, § 43-103. But only in the absence of any express funding mechanism would an implied power be required in order to carry out the intent that expenses be borne by the utilities. When Congress has clearly established one method and not indicated that it is merely optional or suggested, we are not at liberty to invent a procedure of our own.\n\nOf course the presumption of exclusivity could be overcome by convincing evidence in the legislative record that Congress in fact intended otherwise. Only one of the statements cited by OPC in support of its position directly addresses the issue of the assessment procedure. It was made not by a Member of Congress, but by then Chairman Stratton of the PSC, in a letter to Senator Eagleton regarding the proposed amendments.\n\nUnder this section as it now stands, the Commission may assess the utility involved for the expenses incurred by the Commission in connection with any of its proceedings. These assessments are deposited into a trust fund and disbursed upon the authority of the Commission.\n\nUnder the bill the People's Counsel would have independent authority to assess the utility for his expenses of participation in a Commission proceeding, and disbursements would be made upon his certification and would not be subject to the approval of the Commission. This is as we prefer to have it: the Commission should not impose prior approval over activities of the People's Counsel nor have a veto power over his expenses. We believe the independence of that office requires that the incumbent have the authority and responsibility for its activities, including the expenditure of ratepayers' funds in conducting the case in their behalf. [S. REP. NO. 1349, 93d Cong., 2d Sess. 20 (1974).]\n\nThe Chairman was not the originator or even a proponent of the OPC plan. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e No other testimony expressed like views, and there is no evidence that Congress adopted them. Inferring approval from congressional silence is a dubious enterprise; the lack of comment is equally likely to be due to inattention, preoccupation with other matters, or other reason. Our refusal to find an unstated congressional intent is reinforced by the fact that the position expressed by Chairman Stratton apparently is different from that now advocated by OPC, and conflicts with the statutory language. When he refers to the OPC's \"independent authority to assess\", he apparently uses the term \"assess\" in the same sense as in the preceding paragraph. At that point, he clearly meant the power to order payments into the trust fund. OPC does not contest the Commission's exclusive power to order such payments, as Chairman Stratton seems to have done in his letter. The writer neither advocated nor even showed he had considered OPC's present position -- that the trust fund mechanism is optional and that it has the authority to order direct payments to itself. His reference to \"disbursements\" indicates the contrary: that he referred to trust fund transactions rather than direct transfers from the utilities.\n\nDue to the lack of specific support for its view of its assessment power, OPC relies heavily on more general principles that it finds embodied in the statutory language and legislative history. It argues that a prime purpose of Congress in creating the OPC was to ensure its independence from PSC control. It cites the fixed tenure and Mayoral appointment of its head, its separate appropriation, and numerous statements in the legislative record as evidence of this concern. It argues that the existence of certain areas of OPC autonomy, such as the certification of expenses, proves that OPC must also be completely independent in other areas such as issuance of assessment orders. But this is a non sequitur, resting on the false premise that independence is an all-or-nothing proposition. As the People's Counsel puts it, \"Independence is very much like pregnancy. It either exists or it does not. There are no partial states of either condition known to man.\" It is perfectly conceivable that Congress would have concerns in addition to that of independence, which might in some ways conflict with it and force an accommodation. For all that appears, that is what occurred here. For example, Congress might have been concerned with the fairness to the utilities and ratepayers of allowing OPC an unfettered discretion to set its own budget, and therefore preferred that a more neutral and adjudicative (rather than adversarial) body like the PSC make assessments. Regardless of the underlying motivation, we find nothing inconsistent in a statutory scheme giving OPC a very large degree of autonomy, but retaining limited areas where it must rely on Commission action.\n\nII. PSC AUTHORITY AND DUTY TO ASSESS THE REASONABLENESS OF OPC REQUESTS BEFORE ORDERING EXPENSE DEPOSITS\n\nRelying on § 43-612, \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e the Commission ruled that, before exercising its power to order expense deposits, it must review the reasonableness of the OPC requests.\n\nDisposition of this issue is governed by the language of § 43-612(a). The Commission is there authorized to \"call upon the utility in question for the deposit of such reasonable sum or sums as in the opinion of said Commission, it may deem necessary....\" D.C. Code 1981. Orders may thus be made only if they are reasonable. Someone must make that determination. Congress clearly intended the PSC to be more than a rubber stamp or conduit for OPC requests. If, as the People's Counsel contends, Congress meant OPC's view to be conclusive on the Commission, it chose a highly obscure way of saying it. The term \"reasonable\" is used in connection with a definition of the Commission's function of ordering deposits. If Congress had in fact meant OPC to have the final say, it could easily have expressed that intent by such words as \"such sums as the People's Counsel shall certify as reasonable and necessary.\" By far the more convincing reading of the statute is that the Commission must satisfy itself that any sums ordered are reasonable. This Conclusion is reinforced by the words \"as in the opinion of said Commission, it may deem necessary.\" In light of this clause, it is implausible that OPC's judgment as to the reasonableness of its requests would be conclusive.\n\nOPC argues that freedom from PSC review of the substance of its expense applications is essential to its congressionally-mandated independence. The reasoning is the same as that used in support of an independent assessment power. The shortcomings of this approach, discussed in Part I, need not be repeated.\n\nPeople's Counsel further maintains that PSC approval of requests for deposit orders is inconsistent with the disbursement procedures in which all parties concede the PSC plays no role. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e \"Whenever possible a statute should be interpreted as a harmonious whole\" and \"one part of a statute must not be construed so as to render another part meaningless.\" In re T.L.J., D.C.App., 413 A.2d 154, 158 (1980). No such inconsistency exists here. Having exercised its limited review power at the point when funds are deposited, there is no need for it to repeat the process when they are disbursed. As PSC concedes, disbursement is essentially a ministerial process, involving no substantive review. Of course, OPC could not rightfully certify and receive money for expenses for which no deposits were approved.\n\nOPC, of course, must attempt to reconcile its position with the fact that the statute requires the amounts deposited to be \"reasonable\" and \"necessary.\" Initially, as indicated above, it took the position that the People's Counsel's judgment as to the reasonableness of its requests would be conclusive. Presumably he would refrain from submitting requests he found unreasonable. In the Office's reply brief, it takes the tack that the determinations of \"reasonableness\" and \"necessity\" are indeed for the Commission, but that these requirements concern only the timing of deposit orders, not their substance or total amount. According to OPC, this procedure does not amount to a power of approval over OPC requests, but only an authorization for the exercise of \"management discretion\" as to when deposits should be made in the trust fund account. Neither the Commission nor we find this interpretation persuasive. It is true that the statute states that deposits may be ordered \"from time to time\" at any point after the commencement of the investigation or proceeding for which expenses are sought. But it is the sums ordered to be deposited which must be \"reasonable\" and \"deemed necessary\" by the Commission. It is difficult to conceive how the spreading of the amounts over the course of the proceeding could be reasonable, if the expenses themselves are excessive, or perhaps should not have been incurred at all. It is also hard to imagine that the Congress was concerned with the reasonableness of the timing of payments and not with the reasonableness of their substance. We will not impose such a strained interpretation without convincing evidence in the legislative record to support it. None has been cited, nor have we found any.\n\nOPC attaches significance to the statutes of other states that have officials who perform a function similar to that of the People's Counsel. The Conclusion that these statutes were used as \"models\" for OPC when it was first created in 1926 is based upon the following statement in the Senate Report:\n\nMany States require the cost of operation of their public utilities commissions to be borne by the companies under their jurisdiction. This is effected either by imposing a franchise tax or license fee of a percentage of the income of the companies; by penalty in case of decision against the companies in proceedings instituted relating to their charges; or by the method proposed in the bill hereby reported -- a direct assessment of cost against the company, to be charged to their operating expenses and eventually paid by their customers. Such a provision is contained in the statutes of Michigan, Minesota, and Missouri. [S. REP. N O. 644, 69th Cong., 1st Sess. 4 (1926).]\n\nOPC then quotes the statutes of two of the three states mentioned, and emphasizes that they do not contain the word \"reasonable.\" Even if one makes the assumptions that the details of these statutes shed substantial light on the meaning of the D.C. Code, and that those provisions in fact preclude their respective utility commissions from overseeing the reasonableness of assessed expenses, they hinder rather than aid OPC's case. The fact that Congress chose to insert the word \"reasonable,\" even though it does not appear in its \"models,\" serves, if anything, to emphasize that Congress meant what it said.\n\nWe conclude that the statute requires the PSC to consider the reasonableness of OPC requests. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Therefore, we need not rule on the utilities' contention that the power of OPC to make independent or final assessments, subject only to potential subsequent court review, would violate due process.\n\nIII. THE ASSESSABILITY OF EXPENSES OF OPC INVESTIGATIONS NOT PENDING BEFORE THE COMMISSION\n\nThe PSC determined that the utilities are required to bear only those OPC expenses that are incurred in connection with matters pending before the PSC or investigations initiated by it. PSC Order 7211 at 6. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Unrelated OPC investigations are thus excluded. In so holding, it relied on the language of § 43-612(a) italicized here.\n\nThe expenses, including the expenses of the Office of the People's Counsel, of any investigation, valuation, revaluation, or proceeding of any nature by the Public Service Commission of or concerning any public utility operating in the District of Columbia, and all expenses of any litigation, including appeals, arising from any such investigation, valuation, revaluation, or proceeding, or from any order or action of the Commission, shall be borne by the public utility.... [D.C. Code 1981.]\n\nOn its face, the section clearly specifies that expenses must be related to the activities of the \"Commission.\" A colorable argument could be made that in this instance \"Commission\" should be read to include the OPC, thereby bringing independent OPC investigations within the section. According to the section creating the OPC, the Office exists \"within the Commission.\" D.C. Code 1981, § 43-406(a). But as used in other instances within § 43-612, it is clear that \"Commission\" and \"Office of the People's Counsel\" are employed in a mutually exclusive fashion. A somewhat stronger argument for the inclusion of OPC investigations is that Congress' failure to make clear such an intent is due to inadvertence in amending the section. Prior to 1975, advocacy functions of the kind now performed by OPC were entirely the province of the PSC, represented through the Corporation Counsel. Arguably the intent of the amendments was simply to transfer a major part of this function to an independent office, without affecting the scope of reimbursable expenses. Since an OPC investigation of a utility under the jurisdiction of the PSC might perform essentially the same role as an earlier investigation \"of the Commission,\" its costs arguably ought to be covered. However, in the absence of persuasive evidence that this was Congress' intent, this possibility must be rejected.\n\nOPC points to only a single sentence in the legislative record, italicized below, which it says indicates an intent to include independent OPC investigations. However, when read in context, it provides at best weak support.\n\nSection 2 of H.R. 17450 amends the D.C. Code to provide that the expenses of the People's Counsel in any investigation, valuation, revaluation, litigation, appeal, or proceeding of the Public Service Commission concerning a public utility operating in the District of Columbia, shall be borne by the public utility involved. Subsection 2b states that these expenses must be certified prior to payment. Present law provides that the expenses of the Public Service Commission itself for investigations, valuations, revaluations or other proceedings of utilities shall be assessed against the utility involved. These include the costs of expert witnesses, special accountants, or other extra costs incurred as a result of that particular proceeding or investigation. The basic salaries and expenses of the Public Service Commission are paid through the standard appropriations process....\n\nUnder the provisions of Section 2, these same types of costs incurred by the People's Counsel as a result of investigative or rate casework could be assessed against the utility. The basic salaries and expenses of the People's Counsel Office would be covered by the current authorization for appropriations for the Public Service Commission.[S. REP. NO. 1349, 93d Cong., 2d Sess. 5-6]\n\nIn referring to the \"same types of costs\", the Report contrasts \"costs of expert witnesses, special accountants, or other extra costs incurred as a result of that particular proceeding or investigation,\" with \"basic salaries and expenses.\" It does not indicate that these types of items would be reimbursable if incurred in a matter not connected with a PSC investigation or proceeding. OPC has also suggested that the very existence of its authority to conduct investigations without awaiting Commission action requires, or at least strongly supports, the assessability of their cost. But that is not the case, since such investigations may be funded out of appropriations, albeit not at the level which OPC might prefer.\n\nWe thus conclude that the Commission interpreted the statute correctly. The draftsmen of the 1975 amendments had to insert new language at several junctures to account for the reestablishment of the OPC. If Congress had intended for completely independent OPC investigations to be funded by the utilities, it could easily have expressed that intent by such words as \"or investigations by the Office of People's Counsel\". In the absence of a legislative record indicating otherwise, we cannot assume their omission was inadvertent.\n\nIV. THE ASSESSABILITY OF PRIVATE ATTORNEYS' FEES AND \"EXTRAORDINARY INCREMENTAL EXPENSES\"\n\nSection 43-612(a) reads:\n\nThe expenses, including the expenses of the Office of People's Counsel, of any investigation, valuation, revaluation, or proceeding of any nature by the Public Service Commission of or concerning any public utility operating in the District of Columbia, and all expenses of any litigation, including appeals.... [D.C. Code 1981.]\n\nThe question is whether certain categories of expenditures are covered by the term \"expenses\" and thus assessable against the utilities.\n\nA. Private Attorneys' Fees\n\nThe Commission ruled that the fees of private attorneys engaged by OPC to assist it in particular proceedings must be paid by the utilities. PSC Order 7211 at 5.It relied on the lack of express statutory limitation on kinds of expenses and on the long-standing PSC practice of assessing under the same statute for private attorneys hired by the Commission. The Commission reasoned that when Congress amended the section in 1975, it was aware of the prevailing administrative interpretation and would have added qualifying language if it intended to place stricter limits on OPC's authorized expenses.\n\nThe language of the statute is broad and inclusive. No particular exclusions are enumerated or even alluded to. No qualifications are placed on the term \"expenses\" except those of reasonableness and relationship to a pending proceeding. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e The phrase \"all expenses of any litigation\" is particularly instructive, because attorneys' fees are the archetypical litigation expense. It would be rather anomalous if, as the utilities maintain, Congress included this expansive phrase while expecting all litigation to be performed by salaried staff attorneys paid out of appropriations.\n\nNothing in the legislative history of the original section or of the 1975 amendments indicates that \"all expenses of any litigation\" was understood to mean \"all litigation expenses except lawyers.\" The few references to lawyers that appear suggest the contrary: that their cost was understood to be included. In justifying expense assessment, the Senate report on the bill creating § 43-612 specifically invoked the need for additional lawyers.\n\nThe Public Utilities Commission, as at present constituted, is not prepared to undertake an extensive and thorough valuation for the reason that its accounting, engineering, and legal assistants are so limited in number that they could not conclude a valuation within a reasonable time without neglecting their other duties. Last year there was a revaluation of the properties of the telephone company, and it was manifest that the company's case was presented very much more comprehensively and effectively before the Public Utilities Commission itself, as well as in the court to which appeal was taken, than was that of the public.\n\nUnless funds are provided during the present session of Congress, the commission will have to proceed in the gas companies' case as it did last year in the telephone case, with the aid of assistants already overtaxed and with practically no funds available for a proper check of the accounts and physical inventory of the utilities.\n\nLegal assistance is necessary to properly present evidence not only before the commission itself but also, in case of appeal from its valuation or rate decision, to adequately represent the public before the courts in a highly technical proceeding. [S. REP. NO. 644, 69th Cong., 1st Sess. 2-3 (1926) (emphasis added).]\n\nThe need for more legal assistance would have been irrelevant if expense assessments were not meant to provide funding for legal services. The same report cited an instance in which the Commission attempted and failed to get a special appropriation for \"special valuation counsel\" as evidence that there should be a separate non-appropriation funding procedure to finance such expenses. Selection of that example suggests that the Senate committee intended special counsel to be funded through expense assessment. Id. at 4. Testimonial letters appended to the report also called for the funding of attorneys. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nWhether Congress was aware of the Commission practice of hiring outside lawyers when the section was extended to cover the OPC in 1975 is less clear. The PSC states that, at least since 1973, it has hired private attorneys to perform investigative work, and assessed utilities for their cost. When the 1975 amendments were under consideration by the Senate, the PSC Chairman informed the Committee on the District of Columbia of the Commission's \"liberal use\" of § 43-612, which enabled it \"to engage experts and undertake special investigative work.\" S. REP. No. 1349, 93d Cong., 2d Sess. 20 (1974) (letter of William R. Stratton). However, he did not specifically refer to attorneys.\n\nThe utilities maintain that other provisions of the Public Service Commission Law modify what would otherwise be the scope of § 43-612. They correctly suggest that various parts of a statutory scheme should be construed harmoniously so as to avoid unnecessary inconsistency. In re T.L.J., supra.\n\nD.C. Code 1973, § 43-204, as enacted concurrently with § 43-612, \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e authorized the Corporation Counsel to advise and represent the PSC. It states that an annual fee in compensation for this service will be paid out of PSC appropriations. It further provides that:\n\nThe commission may, if at any time it deems necessary, employ other attorneys at law as additional assistants to the said general counsel for the performance of such extraordinary legal services for or in behalf of the commission at such special compensation for such additional assistants as the commission may prescribe, which said compensation shall be paid out of the appropriations provided for the expenses of the commission. [ Id. ]\n\nThis section does not govern legal representation for the OPC, which is covered in the succeeding section. Subsection (a) of § 43-406 requires that the People's Counsel himself be a lawyer admitted to practice before this court. D.C. Code 1981. Subsection (c) makes it quite clear that the Office of the People's Counsel may hire its own inhouse legal staff.\n\nThe People's Counsel is authorized to employ and fix the compensation of such employees, including attorneys, as are necessary to perform the functions vested in him by this Act, and prescribe their authority and duties.\n\nAccording to the utilities, this statutory scheme contemplates that legal representation will be performed exclusively by staff attorneys hired through appropriations. Accordingly, the expense assessments of § 43-612 for litigation costs would only be available for expenditures other than attorneys' fees.\n\nPEPCO contends that the unqualified authorization for OPC to hire attorneys contained in § 43-406(c) should be read as confined to the extent of appropriations authorized in § 43-406(a). Since OPC may not hire attorneys except as financed by appropriations, attorney expenses cannot be assessed under § 43-612. It contrasts this interpretation with its view of the Commission's power to engage attorneys. Under this view, the Commission has two independent sources of authority to hire attorneys. The first, contained in § 43-405, explicitly authorizes the hiring of lawyers and provides that they are to be paid from appropriated funds. Section 43-606 authorizes the hiring of \"agents\" to assist in the Commission's work, without any limitation on the source of compensation. Although lawyers are not explicitly mentioned, no one disputes that they may be hired under the section and compensated from funds assessed under § 43-612. This enables PEPCO to ascribe some meaning to the explicit inclusion of litigation expenses in § 43-612, while insisting that OPC attorneys cannot be funded thereunder.\n\nLike the Commission, we find this line of argument unpersuasive. No express condition on the hiring of OPC attorneys is contained in either § 43-406(a) or (c). The more reasonable explanation for the specific mention of attorneys in § 43-406 is to make clear that, unlike the Commission, the People's Counsel may appear on his own behalf rather than call on the Corporation Counsel for representation. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e The mere fact that subsections dealing with two subjects involved in the creation of OPC -- appropriations and hiring of staff -- happen to be collected in a single section does not imply that one is silently conditioned by the other. If anything, the invocation of § 43-406 strengthens the Conclusion that the hiring of attorneys by OPC is not limited by appropriations. The section contains a very clear and express limitation on the source of funding, notably absent in § 43-406. Neither is there evidence that the mode of funding was meant somehow to carry over from one section to the other.\n\nThe legislative history provides no evidence of a dichotomy between the kinds of expenses assessable by OPC and the PSC, or between administrative and appellate expenses. Language in both the House and Senate Reports -- which PEPCO cites elsewhere -- confirms the contrary: that assessable OPC expenses include judicial appeals.\n\nSection 2 of H.R. 17450 amends the D.C. Code to provide that the expenses of the People's Counsel in any investigation, valuation, revaluation, litigation appeal, or proceeding of the Public Service Commission concerning a public utility operating in the District of Columbia, shall be borne by the public utility involved. [H.R. REP. No. 1485, 93d Cong., 2d Sess. 4 (1974), App. at 114; S. REP. No. 1349, 93d Cong., 2d Sess. 5 (1974), (emphasis added.] \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nThe utilities attempt to bolster their argument by quoting excerpts from the legislative record which indicate that OPC would employ its own legal staff to represent consumer interests. But these citations only establish what is undisputed: that Congress meant OPC to maintain its own legal staff. They do not establish the proposition for which they are quoted, that OPC was to be limited to this means of engaging legal services. There is nothing inconsistent in the provision of two means of obtaining legal counsel and representation. The flaw in the utility position is that they implicitly assume the contrary: that one express form of funding legal assistance denies any others even if expressly provided elsewhere in the statute.\n\nThe utilities make much of an analogy to the judicial award of attorneys' fees to prevailing private litigants. Under the \"American rule,\" a court may generally not grant fees to a prevailing party absent express statutory authorization. Alyeska Pipeline Service v. Wilderness Society, 421 U.S. 240, 248-72, 44 L. Ed. 2d 141, 95 S. Ct. 1612 (1975). Moreover, a general term like \"costs\" in such statutes is not ordinarily construed to cover attorneys' fees. 20 AM. JUR. 2d Costs § 72 (1965). The utilities would have us transplant this body of doctrine without modification to the context of administrative assessments to finance a public institution. While there are some parallels, the two areas differ significantly. The private civil litigant normally sues to vindicate his own interest and seeks damages, out of which he can cover his litigation expenses. It is worth noting that the possibility of the funding of private parties on a case-by-case basis was considered as an alternative to creation of the OPC and rejected. OPC, in contrast, works on behalf of ratepayers and does not receive a direct benefit by virtue of its success. All of its expenses are publicly funded; the only issue is whether particular costs may come from an assessment -- a franchise tax -- or only from an appropriation. With this as background, there is little if any basis for an a priori presumption that general language regarding expenses does not include attorneys' fees. The word \"attorney\" is not such a magic formula that Congress' failure to invoke it must defeat the legislative purpose. The statutory language explicitly goes beyond the narrow sense of \"expenses\" used in the court award statutes, by referring to costs related to investigations. The utilities themselves concede that such items as consultants are covered. Even if we accepted the premise that § 43-612 was meant to have a narrow scope, its language does not provide a basis for choosing what items to exclude. Thus we conclude that the Commission's broader reading of \"expenses\" is not in error.\n\nFinally, the utilities quote recitations in the legislative record of various kinds of services for which expense assessments were contemplated.\n\nPresent law provides that the expenses of the Public Service Commission itself for investigations, valuations, revaluations or other proceedings of utilities shall be assessed against the utility involved. These include the costs of expert witnesses, special accountants, or other extra costs incurred as a result of that particular proceeding or investigation.\n\nUnder the provisions of Section 2, these same types of costs incurred by the People's Counsel as a result of investigative or rate casework could be assessed against the utility. The basic salaries and expenses of the People's Counsel Office would be covered by the current authorization for appropriations for the Public Service Commission.... [S. REP. No. 1349, 93d Cong., 2d Sess. 5-6 (1974).]\n\nIn addition to these basic expenses, the D.C. People's Counsel will be permitted to assess expenses incurred in specific utility proceedings against the company involved. These would include, for example, the costs of hiring expert witnesses, rate design economists, safety engineers and other specialized consultants in specific rate cases.[ Id. at 9, App. at 96; H.R. REP. No. 1485, 93d Cong., 2d Sess. 9 (1974).]\n\nFrom the listing of such expenses as expert witnesses and consultants, without the concurrent mention of lawyers, they infer that the latter were meant to be excluded. But the examples cited appear to be illustrative, not exclusive. It may have been the case that Members of Congress and the witnesses before them generally believed that the greatest need for assessments was in the area of non-legal consultants, such as economists or engineers. But even if true, that belief does not amount to an understanding that assessments were to be legally confined to particular categories of services.\n\nB. The Assessability of \"Extraordinary Incremental Expenses\"\n\nLike the question of the assessability of private attorneys' fees, this issue calls for a construction of the term \"expenses\" as used in § 43-612. The Commission ruled that a utility need not pay basic operating expenses or salaries already covered by appropriations even when those costs are incurred in connection with a pending proceeding. PSC Order 7211 at 5-6. However, it must pay a proportional share of any \"extraordinary incremental expenses\" associated with participation in a pending proceeding. Thus there are two defining characteristics of this category of assessable expenses: (1) they are not already covered by an appropriation, and (2) they are episodic, rather than ongoing, i.e., associated with a particular proceeding or investigation. The type of item included (e.g., paper, legal advice, secretarial services) as contrasted with its use (e.g., to prepare testimony for a particular rate hearing), is not decisive.\n\nAs discussed in subpart A, (supra) , the expense assessment statute includes no express limits on the kinds of items that are reimbursable. However, the clauses \"of\" or \"arising from\" \"any investigation, valuation, revaluation, or proceeding\" clearly place a limit on the purposes for which funded items may be used. The legislative history is consistent with the interpretation made by the PSC. For example, S. REP. No. 1349, 93d Cong., 2d Sess. 7 (1974) states:\n\nThe basic expenses of the Office of People's Counsel, including salaries, rent, supplies, telephones, and equipment, will be appropriated by Congress under the authorization contained in the bill; that authorization is for a maximum budget of $100,000 for this office for each fiscal year....\n\nCertainly Congress did not mean for assessments to be made for items already paid for. But it does not follow that the kinds of items listed could never be other than \"basic.\" The same report states that assessable expenses \"include the costs of expert witnesses, special accountants, or other extra costs incurred as a result of the particular proceeding or investigation.\" Id. at 5. Certainly \"extra costs\" could well include supplies or equipment, kinds of items which are also components of \"basic expenses\" or overhead.\n\nMoreover, in explaining the bill on the House floor, one of its chief sponsors indicated that \"operating expenses\" associated with particular investigations or proceedings would be subject to assessment.\n\nI understand that the estimate of the cost to the city of the Office of People's Counsel will be some $100,000 per year, a figure which is approximately the same as has been the experience in Maryland for that same office. I wish to point out, however, that not all the actual cost will be borne by the public as included in that figure. The bill provides that the operating expenses of the People's Counsel in any investigation [or proceeding] \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e incident to the operations of the Public Service Commission in connection with a public utility operating in the District of Columbia shall be borne by the public utility itself. This is consistent with the provision in present law that expenses of the Public Utilities Commission itself involving investigations, evaluations and other proceedings of utilities are to be assessed against the utilities concerned. [93 CONG. REC. 37268 (1974) (remarks of Congressman Gude) (emphasis added).]\n\nIn contrast to the PSC's conception of the distinction between assessable and non-assessable expenses, based on their use, the utilities propose an approach that focuses on the type of item involved. If a certain kind of item is included in appropriations, it could not also appear in an expense request. This thesis proves far too much. Any kind of item is capable of being funded by appropriation, including those which are clearly allocable to particular proceedings. If this approach were taken to its logical Conclusion, no item would be assessable, a result which Congress obviously did not intend. It is indisputable that Congress meant the assessment provisions to increase the total amount of funds available to OPC and the Commission. The utilities would prefer to have assessment limited to a small number of items, such as certain expert witnesses. But there is no justification for such a limitation, nor a reasonable basis for determining, as a matter of law, what items are includable. The statute makes no enumeration. As noted above, the examples cited in the legislative history are clearly indicative, not exclusive.\n\nPEPCO urges that the salaries of People's Counsel employees can under no circumstances be considered extraordinary (and therefore assessable), even as respects work performed on particular Commission proceedings. It reasons that representation of the People's Counsel before the PSC is a normal and ongoing function and that associated staff work is by definition not an incremental cost. The Commission decision did not draw such a distinction between independent contractors and salaried employees. It indicated that both \"costs of services\" and \"salaries\" were potentially assessable items. PSC Order 7211 at 6. The Commission's view is a reasonable interpretation of the statute. There is no indication that Congress intended to fix limits on the type of employment relationship to be maintained between OPC and persons hired with assessed funds. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Certainly from the point of view of the utility or ratepayer paying the bill, it should make no difference whether the economist or legal advisor being funded is paid with a payroll check or through a bill for services rendered. In some instances, it may even be in the utilities' interest that OPC be permitted to choose between hiring outside consultants or additional employees to work on particular proceedings. That would be the case if a staff person would perform a given task more efficiently than an outsider, due to the experience or familiarity which comes from working full time on particular, or related, regulatory matters. Of course, salaries for OPC positions funded by appropriation could not be assessed.\n\nUnderlying the utilities' position is a fear that without firm boundaries on OPC's expense assessments its total budget will be excessive or harbor wasteful expenditures. But there are adequate safeguards to address those risks without the imposition of arbitrary limits on the particular items which may be assessed. The PSC has already put the People's Counsel on notice that the Commission will not allow the fixed expenses of operating the Office to be apportioned to particular proceedings by means of artful accounting, thereby increasing the total cost borne by the utilities. PSC Order 7211 at 6. As to the expenses of particular proceedings not already financed by appropriation, our holdings in Parts I and II, (supra) , confirm the power of the Commission to prevent extravagance and waste on the part of OPC, by verifying the reasonableness of expense requests.\n\nWe conclude that the Commission was correct in ruling that it may assess independent attorneys' fees and other reasonable OPC expenses incurred in connection with a particular PSC investigation or proceeding, unless they are already covered by an appropriation. Assessable expenses are not otherwise confined to specific categories of items.\n\nAffirmed.\n\nKERN, Associate Judge, Concurring in part and Dissenting in part: Although I agree with the majority's affirmance generally, I am unable to accept its Conclusion that the Office of People's Counsel (OPC) may hire independent attorneys to carry out OPC's duties and then bill the utilities and their customers for such costs.\n\nThe late Adlai E. Stevenson in one of the pearls of speeches he cast before the electorate in his memorable 1952 campaign for President recounted -- in order to make a point -- an anecdote involving the Duke of Wellington. The Iron Duke, according to the Governor, commented to a companion after inspecting his troops in full array:\n\nThey may not frighten the enemy, by gad sir, they frighten me.1a\n\nSo it is that the OPC has hired a remarkable array of Washington law firms to do legal battle with the Public Service Commission (PSC) and the local utilities on behalf of the utilities' customers. While the former may not be frightened by the legions of lawyers thus assembled by OPC, the latter -- the utilities' customers who will ultimately pay the legal bills in the form of higher rates -- certainly should be frightened. The bills recently presented by OPC's legal shock troops for services rendered are electrifying: For example, Pepco, alone, received bills for the services of independent attorneys retained by OPC, and related expenses, in the amount of more than $1,000,000 in less than three months of 1981. As stated, these bills are made a part of the rate base and passed on to the consumer in the form of higher rates.\n\nThe Public Service Commission (PSC), in its Order No. 7243, ruled that the utilities are \"required to pay the fees of independent attorneys engaged by People's Counsel to perform legal services.\" PSC's reason for so ordering was \"because the Congress meant them to be.\" However, there is nothing in the statute or its legislative history that bespeaks an intent on the part of Congress to authorize OPC to retain independent legal counsel to carry out its duties. Rather, Congress authorized People's Counsel to hire his own legal staff with appropriations obtained in the usual budgetary way which every publicly-founded agency is required to follow.\n\nPSC was in large measure impelled to its surprising Conclusion by what it characterized as its own \"long-standing practice\" to engage for substantial fees independent attorneys to carry out its statutory duties. Proceeding from this premise PSC found \"no basis\" to conclude that Congress, when creating OPC, meant to deny OPC what PSC, in its own view, already had: authority to hire independent attorneys and bill the utilities and ultimately their customers -- which is to say the residents of the District of Columbia.2a\n\nIn this time of tight government budgets and declining appropriations it is easy to see why PSC would express concern, as it did in Order No. 7243, over the \"difficulties inherent in a system for engaging lawyers that depended solely upon appropriations.\" In short, PSC perceives that obtaining appropriations for lawyers for itself and for OPC by the traditional budgetary process through the Council and then the Congress is far more arduous than simply billing the utilities and its customers. No reasonable man could disagree with this perception. However, as is inevitable under our form of government, Congress made the ultimate decision that OPC must rely for the funding of its legal operations upon appropriation -- the course normally followed by publicly funded agencies such as OPC.\n\nThe legislative history of OPC's creation demonstrates the inaccuracy of PSC's premise in its opinion under review here that Congress \"well knew\" of the practice of PSC to hire for fee attorneys and then assess the utilities and their customers for the legal bills rendered.\n\nPSC's testimony concerning its own practice at the hearing on the proposal in 1974 to create OPC is most revealing. The then Chairman of PSC testified with precision as to the size of the PSC staff as follows (App. at 147):\n\nFive... people are in our securities division, which regulates the brokerage industry here in Washington; three... are engaged in the testing and calibration of meters; there is an engineer...\n\nWe have a person... handling consumer complaints. We have... six or seven people in... stenography, filing, keeping the records appropriately maintained.\n\nWe have two [full time] attorneys who are delegated to us from the corporation counsel's office.\n\nAnd then we have an accounting bureau, of whom four members are paid through funds that we raise by assessment against the utilities. We keep a resident... accountant in each utility, insuring... a uniform system of accounting.\n\nWe have a chief accountant who is a GS-15.\n\nAnd then the array of six accountants who work for him. (Emphasis added.)\n\nIt may be seen that PSC Chairman Stratton made no reference at all in his detailed description of the PSC staff to any practice of retaining independent lawyers and assessing their cost to the utilities. In answer to the question whether PSC had an adequate staff, he replied (App. at 147):\n\nI think some modest increases in staffing are in order, and we are going to recommend them... in the budget process this year. (Emphasis added.)\n\nCongressman Breckinridge then asked the PSC Chairman: to whom did PSC look \"for advice in the area of economics in the industry\"? The Chairman responded (App. at 147):\n\nhere we engage outside experts. It is usually in the context of a rate case.... In recent years we have always had rate cases from just about every utility, so we have had an expert available to us within that context to look into... allocation factors... among the jurisdictions, rate of return questions, rate of design questions. That kind of stuff. (Emphasis added.)\n\nThere ensued the following colloquy (App. at 147):\n\nMR. BRECKINRIDGE. You suffer from no financial limitations or inhibitions in regard to the acquisition of those expert services?\n\nMR. STRATTON. No, sir; because we do that in the context of a rate case by assessment against the utility.\n\nThere is a limitation in the statute as to how much to assess over the years, but we haven't reached that.\n\nMR. BRECKINRIDGE. That is a routine part of your practice in any rate case?\n\nMR. STRATTON. Absolutely. (Emphasis added.)\n\nThus, the PSC practice at the time Congress created OPC was to use the assessment process to \"engage outside experts... to look into... allocation factors,... rate of return rate of design questions.\" Not a word was said by the PSC Chairman in his painstaking description of PSC's assessment practice about retaining independent attorneys for legal work and then billing the utilities thereafter.3a\n\nNeither the Senate nor the House Report (App. at 92-3; 114-15) accompanying the proposed legislation to create an Office of People's Counsel ever mentioned any practice by PSC of hiring attorneys and then assessing their fees to the utilities. Rather, the Reports noted the \"present law... that the expenses of the Public Service Commission itself for investigations, valuations, revaluations or other proceedings of utilities shall be assessed against the utility involved. These include the costs of expert witnesses, special accountants, or other extra costs incurred as a result of that particular proceeding or investigation. The basic salaries and expenses of the Public Service Commission are paid through the standard appropriations process.\" It is worthy of note that the congressional reference to PSC's practice of assessing for \"expert witnesses\" and \"special accountants\" simply tracked the testimony of the then PSC Chairman that the use of assessment was for \"outside experts\" on allocation, rate of return and rate design questions and for the special accountants resident in each of utilities.\n\nThe congressional committees went on to note in their reports (App. at 92-3; 114-15) that under the Act creating OPC \" these same type of costs incurred by the People's Counsel as a result of investigative or rate casework could be assessed against the utility. The basic salaries and expenses of the Office of People's Counsel would be covered by the current authorization for the appropriations for the Public Service Commission.\" (Emphasis added.)\n\nThe majority's explanation for the reference in the Committee Reports to the assessability of expenses only for \"expert witnesses\" and \"special accountants\" is that such reference was \"illustrative, not exclusive.\" But, the majority's Conclusion to ignore what the Committee Reports say ascribes a considerable ignorance of the real world to the principal sponsors of the OPC legislation -- Senator Eagleton, Senator Mathias, Congressman Adams and Congressman Breckinridge. These legislators were all experienced attorneys and were well aware of the fees of Washington law firms. Were the cost of such legal fess to be assessed in addition to expert witnesses and the accountants residing in the utilities, they never would have estimated in their reports to the Congress that \"People's Counsel would incur only $25,000, to $50,000 in assessments per year.\" (App. at 96; 119.)4a\n\nOn the floor of the House Mr. Adams, the manager of the Bill, explained (App. at 121):\n\nI do not believe it [the bill creating OPC] is controversial. Any sections that were controversial were removed by the Committee during its deliberations.\n\nHad this legislation been intended to enable OPC to inflict upon the consumers of the District a million dollars worth of legal fees in three months by assessing that amount to a utility and thereby increasing its rate base, the sponsors would have made at least a single solitary reference to attorney fees as an assessable cost.\n\nThe ever-watchful Congressman Gross queried Congressman Adams (App. at 123) in floor debate as to the extent of any assessment against a utility company possible under the bill. Mr. Adams, in response, distinguished between \"expenses\" and \"salaries in a rate case.\" He stated (App. at 123):\n\nWe have estimated that if the expenses were paid in any case it would not exceed the largest amount... in recent years which was between $75,000 and $100,000. This amounts to about 50 cents per residential user, if such expert witnesses are necessary to testify. (Emphasis added.)\n\nHe went on to explain that the People's Counsel \"has a regular salary and appears before the Commission... ow we cannot use the Corporation Counsel's office because the Corporation Counsel represents the Public Service Commission... the cost of such counsel is the same as though they were going to hire a lawyer. We are not talking about the expenses that may be incurred for the various cases such as for expert witnesses, court costs and so forth, but the cost of an individual who is going to represent the people....\"\n\nAfter the Senate added a proviso to the Bill which established a three-year term for the People's Counsel and fixed the maximum of a GS-16 for the salary of his office, House District Committee Chairman Diggs explained (App. at 128) that People's Counsel \"would be responsible for representing the people of the District of Columbia at hearings of the Commission and in judicial proceedings involving the interest of consumers regarding public utility services.\" Again, not a single mention was made to the House that OPC was authorized to engage outside attorneys. However, Chairman Diggs did point out (App. at 128) that People's Counsel \"was authorized to employ and fix compensation of employees necessary to perform the functions vested in him.\" An authorization of $100,000 was fixed for the fiscal year 1976.\n\nThe pernicious effect of the majority's decision is to transmogrify the People's Counsel from \"a representative of the people,\" as envisioned by the congressional creators of the Office, into the paymaster of law firms and private attorneys within the District. According to the briefs, OPC is participating in many different proceedings and has retained by fee arrangement scores of lawyers to participate in such proceedings. Even given the concededly considerable ability of the People's Counsel, he cannot at one and the same time hire and oversee the legal work in so many different cases of so many different attorneys who are not on his staff and also represent \"the people of the District of Columbia at hearings of the Commission and in judicial proceedings\" -- to use Chairman Diggs' phrase of explanation to the House of the function of People's Counsel. Since the Congress clearly did not intend such a result, I respectfully Dissent.5a\n\nDISTRICT OF COLUMBIA COURT OF APPEALS\n\nNos. 81-302, 81-303, and 81-305\n\nWASHINGTON GAS LIGHT COMPANY, OFFICE OF PEOPLE'S COUNSEL, POTOMAC ELECTRIC POWER COMPANY, PETITIONERS, v. PUBLIC SERVICE COMMISSION OF THE DISTRICT OF COLUMBIA, RESPONDENT, CHESAPEAKE \u0026 POTOMAC TELEPHONE COMPANY, INTERVENOR.\n\nON PETITIONS FOR REHEARING EN BANC\n\nArgued March 14, 1983\n\nDecided September 30, 1983\n\nBefore NEWMAN, Chief Judge, KERN,* NEBEKER, MACK, FERREN, PRYOR, BELSON, and TERRY, Associate Judges, and** KELLY, Associate Judge, Retired.\n\nJUDGMENT\n\nThe petitions of appeal from an order of the Public Service Commission of the District of Columbia (the \"Commission\") came before the court sitting en banc upon the certified administrative record and the pleadings and briefs of the parties and were argued by counsel. On consideration thereof, it is\n\nORDERED and ADJUDGED that Order 7211 of the Commission is affirmed by an equally-divided court.\n\nFOR THE COURT:\n\n/s/ Alan I. Herman\n\nALAN I. HERMAN, Clerk\n\n\u003cspan class=\"fn\"\u003e1. 14 DCRR § 110.3 provides that \" person may be represented in any proceeding before the Commission by an attorney at law admitted to practice before the District of Columbia Court of Appeals; or by any attorney admitted to practice before the highest court of any state upon the granting by the Commission of a motion for special appearance, provided that such attorney does not maintain an office within the District of Columbia for the practice of law.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Pub. L. No. 93-614, 88 Stat. 1975 (1975) (codified as amended at D.C. Code §§ 43-406, -407, -612 (1981)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. This ceiling on appropriations was eliminated by the People's Counsel Authorization Act of 1979, D.C. Law 3-34 (1979) (now codified at D.C. Code § 43-407 (1981)). There are now authorized to be appropriated for the OPC \"such sums as may be necessary.\" Legislation has also been enacted requiring that \"all amounts appropriated for the Public Service Commission and the Office of the People's Counsel for each fiscal year... shall be repaid during such fiscal year by the public utilities... as a reimbursement fee.\" Reimbursement Fee Act of 1980, D.C. Law 3-88 (1980) (now D.C. Code § 43-612(b) (1981)). Thus, our decision will not affect OPC's ability to obtain the legal services it needs, and to have the costs of those services and incremental operating expenses borne by the utilities (and ultimately by the consumers it serves); rather, it will determine whether those expenses are to be recouped by direct PSC assessment against the utilities or through the appropriations process.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Of course, as the Supreme Court has explained, \"generalities about statutory construction... are not rules of law but merely axioms of experience.\" United States v. Universal C.I.T. Credit Corp., 344 U.S. 218, 221, 97 L. Ed. 260, 73 S. Ct. 227 (1952).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Technically, the word expenses is broader than costs or fees and may be used to refer to all the expenditures made by a litigant in connection with a proceeding. 10 WRIGHT, MILLER \u0026 KANE, FEDERAL PRACTICE AND PROCEDURE: CIVIL 2D § 2666 (1983); 6 J. MOORE, MOORE'S FEDERAL PRACTICE P54.70[1] (1982). However, costs and expenses have been used, even by some courts, as if interchangeable. E.g., Bowers v. Fulton County, 227 Ga. 814, 816, 183 S.E.2d 347, 348 (1971); Tracy v. T \u0026 B Construction Co., 85 S.D. 337, 340, 182 N.W.2d 320, 322 (1970); Wolf v. Mutual Benefit Health and Accident Ass'n, 188 Kan. 694, 700, 366 P.2d 219, 224 (1961); Hayman v. Morris, 37 N.Y.S.2d 884, 891 (Sup. Ct. 1942). Thus, when either word is used in a statute, its scope is subject to question.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. See, e.g., Lawrence v. Staats, 205 U.S. App. D.C. 341, 640 F.2d 427 (1981). \" evident purpose of a statute is an implied limitation on the sense of general terms....\" 2A SUTHERLAND, (supra) , § 46.05 at 57. \"'In the exposition of a statute the intention of the lawmaker will prevail over the literal sense of the terms... when the words are not explicit, the intention is to be collected from the context;... from the mischief felt and the remedy in view....'\" Id., quoting Kent's Comm. 462 (13th ed. 1884).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. It could be argued that under D.C. Code § 43-204 (1973), in effect when the assessment provision was enacted, the Commission also had the authority to employ attorneys who were to be compensated from appropriated funds. However, as discussed (infra) Part V, it is not at all clear that the Congress in 1974-75 knew that the PSC hired private attorneys and paid their fees from assessments under § 612(a). Since the lawyers the PSC was authorized to hire under § 204 were to be engaged as necessary to perform \"extraordinary legal services,\" see infra n.10, supplemental to the basic legal services provided PSC at the time by the Corporation Counsel and also funded from the PSC's appropriations, it is reasonable to infer that the 93d Congress, if it were aware of § 204, understood that all of the PSC's legal work was to be performed by legal staff paid from appropriated funds.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Pub. L. No. 69-707, 44 Stat. 1351 (1927). In establishing the OPC in 1975, Congress simply revived, with revisions, an enactment which had expired many years before.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Specifically, both the House and Senate reports contain the following statements:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eLegal assistance is necessary to properly present evidence not only before the commission itself but also, in case of appeal from its valuation or rate decision, to adequately represent the public before the courts in a highly technical proceeding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eS. REP. No. 644, 69th Cong., 1st Sess. 3 (1926); H.R. REP. No. 2240, 69th Cong., 2d Sess. 3 (1927) (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe , as at present constituted, is not prepared to undertake an extensive and thorough valuation for the reason that its accounting, engineering and legal assistants are so limited in number....\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eId. at 2 (emphasis added). In addition, the reports cite as an \"instance of the impracticability... direct appropriations\" an earlier unsuccessful attempt by the PSC to obtain funds for \"special valuation counsel.\" Id. at 4.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. At that time, the most significant expense of litigation might well have been the fees of consultants and experts since new evidence was permitted to be presented on appeal. Eight years later, the assessment provisions were construed to cover certain expenses of appeals. Washington Ry. \u0026 Elec. Co. v. District of Columbia, 64 App. D.C. 243, 246, 77 F.2d 366, 369 (1935). The second clause was added the same year as part of a bill eliminating de novo review of appeals from Commission decisions. Pub. L. No. 74-349, § 3, 49 Stat. 882, 884 (1935). One brief statement in the House report on the 1935 bill explains this amendment as simply a restatement of then-existing law. H.R. REP. No. 665, 74th Cong., 1st Sess. 4 (1935). However, there is no indication that the 1935 Congress understood the 1927 Act to permit assessments for attorney's fees or any operating expenses. We note also that the 1927 Act did not specifically include the Office of the People's Counsel; and even though hearings were held on both the assessment legislation and the OPC bill in 1926, there is no cross-reference in the legislative history of either Act to the other. (The OPC had been created less than three months earlier, on December 15, 1926. Pub. L. No. 69-529, 44 Stat. 920 (1926).)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Our decision in limited to the assessability of OPC's expenses. We do not, and need not, determine the scope of the PSC's authority to assess for its own expenses under § 612.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. H.R. REP. No. 967, 69th Cong., 1st Sess. (1926).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The 1926 Act provided for the appointment of a People's Counsel \"in lieu of the attorney at law provided for the ....\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. H.R. 16782, 93d Cong., 2d Sess. (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The separate appropriations and assessment powers were intended to grant the OPC some measure of independence from the Commission. But even with these changes, OPC's hiring authority was not as extensive as the Commission's, since it was not authorized, as was the Commission under § 606, to hire agents with no express limitation that they be compensated from appropriated funds.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. H.R. REP. N o. 1485, (supra) , at 4; S. REP. No. 1349, (supra) , at 4-5.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Utility Rates and People's Counsel For the Public Service Commission: Hearings on H.R. 16782 Before the House Committee on the District of Columbia, 93d Cong., 2d Sess. 12-13, 22-23 (1974) (statements of William R. Stratton, Chairman, Public Service Commission of the District of Columbia, and H. Mason Neely, Vice Chairman). The Commission recommended, as an alternative to the OPC proposal, legislation to extend the scope of § 612 to permit assessments for the expenses of private intervenors in PSC proceedings. The bill's sponsors were favorably inclined to accept the Commission's recommendation, in addition to reestablishing the OPC, and introduced a new bill for that purpose. H.R. 17450, 93d Cong., 2d Sess. (1974). However, the additional provisions for assessments for expenses of private intervenors were deleted when the Committee reported the bill to the full House.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. It seems likely that the assessment authority for intervenors was deleted from the final committee bill because of concerns about its cost and the controversy it might generate; of course, these are the same kinds of concerns that would have discouraged enactment of the assessment provisions to encompass operating expenses and the fees of outside counsel for OPC. See infra n.19. In his opening remarks to the full House concerning the bill, Representative Adams explained that \"any sections that were controversial were removed by the committee during its deliberations.\" 120 CONG. REC. 37265 (1974). Both the House and Senate committee reports contain language to the effect that, because the laws relating to the PSC must be liberally construed, specific intervenor assessment provisions were unnecessary. However, the House report also stated that the City Council should take prompt action to clarify the scope of § 612 with respect to intervenors. H.R. REP. No. 93-1485, (supra) at 5-6; S. REP. No. 93-1349, (supra) at 6. We do not regard this report language as indicative of an intent on the part of the 93d Congress that § 612 should be read in the broadest of terms. Rather, the logical inference, particularly in view of the sense of urgency in which this legislation was enacted ((infra) at 19-20), is that the committee members left this controversial issue for the City Council to resolve, realizing that its inclusion in the text of the bill would impede its passage. The report language was very likely the result of a compromise on the issue among committee members. Nor do we view the specific reference by Representative Smith to counsel fees for intervenors ((infra) n.19) as an indication that counsel fees were among the expenses Congress intended to be assessed for OPC, since there was no appropriation mechanism for counsel for intervenors, as there was for OPC.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. It was apparent from their Discussion of the proposal to fund intervenors that the committee members were aware of the controversy and expense involved in public interest litigation affecting such a large class of consumers. A colloquy which took place during the hearings suggests that the intervenor proposal may have been rejected because of concern about its potential cost and controversy:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMr. Smith: hat are your thoughts about reimbursing private counsel of intervenors? ... if there were no limitations, I would think that almost every single resident of the District of Columbia might want to come in and intervene if his counsel fees were going to be paid....\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMr. Stratton: It might even be as high as his electric bill.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMr. Smith: If legislation were to give authority to the Commission to do this,... regulations could be adopted in order to draw some sort of reasonable limitation on the number of counsel or intervenors that could appear.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMr. Stratton: Absolutely.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMr. Smith: Not only in the amount of money but in the amount of time because your hearings might go on forever.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMr. Stratton: Absolutely.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMr. Smith: I think that these would all be sort of difficult questions....\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eHearings on H.R. 16782, (supra) at 22. Following this colloquy, one of the committee members asked the Commission to submit proposed statutory provisions to set some limitation on intervention, to \"minimize the cost.\" Id. at 26. He expressed concern as to whether it would be possible to draft language adequate to \"handle these problems.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Hearings on H.R. 16782, (supra) (September 26, 30, 1974); 120 CONG. REC. 37265, 37269 (November 25, 1974) (House passage); 120 CONG. REC. 39914 (1974) (Senate passage, with amendments); 120 CONG. REC. 41848 (December 20, 1974) (House concurrence in Senate amendments). The Act was signed into law on January 2, 1975. The Congress was in adjournment from the close of business on October 17, 1974 until November 18, 1974. 120 CONG. REC. 36104 (October 17, 1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. H.R. REP. No. 1485, (supra) at 3-4; S. REP. No. 1349, (supra) at 4 (\"Reasons For Immediate Congressional Action\"). The committees explained in their reports that the PSC had indicated it would complete action on the rate hike requests in January 1975, just as the new D.C. Home Rule government took office, and that the new government would be unable to enact such legislation in time to be of assistance to local residents.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Hearings on H.R. 16782, (supra) at 67-79. In Maryland, the People's Counsel office consisted of two attorneys, employed on a part-time basis. The Maryland People's Counsel, like the OPC, was funded at nearly $100,000 per year, including salaries. The committee heard testimony that the largest single budget item in Maryland was consultant's fees, and that the Maryland People's Counsel was seeking additional funds for outside consultants. Since the committee reports in the 1975 Act state that the $100,000 for OPC was \"in line with the operating costs of the Maryland State office,\" H.R. REP. NO. 1485, (supra) at 8; S. REP. NO. 1349, (supra) at 7, it is reasonable to infer that the $100,000 was intended to provide for salaries and operating costs, and the assessment provision to cover the additional, less predictable expenses for specialized consultants.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. In fact, the then Chairman and Vice Chairman of the PSC mentioned outside counsel during the 1974 hearings only in expressing their doubts that § 612(a) applied to the fees charged by intervenors. Hearings, (supra) at 23-24.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The argument could also be made that Congress did not expressly limit the hiring of attorneys by the OPC to appropriated funds, as it knew how to do, since under D.C. Code § 43-204 (1973), the hiring of attorneys by the Commission had been thus limited. However, it was necessary to specify that the Commission's additional attorneys might be paid from funds appropriated to the Commission since at the time it was represented by the Corporation Counsel and had no staff attorneys.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Of the five states used for cost comparison purposes in both the committee reports, only two provided any direct assessment authority either to their utilities commissions or to their consumer advocates, and those two which did so based the assessment upon a set percentage of the utilities' gross revenues. With respect to each of those five states, the reports explicitly mentioned whether, and if so, how, outside consultant fees were funded. Thus, since Congress chose an altogether different type of assessment authority for OPC, the committee had no useful models in these other states for the particular kinds of expenses to be assessed. Yet it is apparent from this section of the committee report that the primary focus was the provision of expert consultants.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Likewise a letter to the Senate committee from one of the utilities stated that clarifying language was needed to avoid unnecessary litigation as to the meaning and intent of the assessment provision. The letter pointed out that a literal reading would presuppose that OPC's basic salaries and administrative costs would be borne by the utilities. Remarking that the House report stated those items were to be covered by appropriations, the letter concluded, \"We assume that Congress would want to retain supervision of the operation of the People's Counsel through the appropriations process.\" S. REP. NO. 1349, (supra) at 17.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. As we have mentioned, (supra) , n.15, Congress did intend that the OPC be, to some extent, independent of the Commission. Our decision is consistent with that objective, since the OPC's operating expenses and expenses for legal counsel will be subject directly to legislative oversight, rather than to Commission scrutiny.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. E.g., United Gas Pipe Line Co. v. Louisiana Pub. Serv. Commission, La. , 279 So.2d 195 (1973) (expenses of special counsel retained by Commission not within statutory assessment authorization); State v. Newark, 87 N.J. Super. 38, 207 A.2d 719 (Law Div. 1965), aff'd, 90 N.J. Super. 68, 216 A.2d 246 (App. Div. 1966) (municipality held not within statute authorizing imposition of charges upon utilities); State v. Pacific Tel. \u0026 Tel. Co., 27 Wash. 2d 893, 181 P.2d 637 (1947) (legal fees and litigation expenses upon appeal held not within assessment statute).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 The House committee report on the 1975 amendments states:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn developing and enacting this legislation in 1913, the Congress recognized that the responsible regulatory commission must in many instances act in a judicial fashion, balancing in an independent manner the varying viewpoints of public groups appearing before it. This necessarily independent posture has inhibited the Commission from vigorously protecting the consumers' viewpoints and needs in rate proceedings. Their function has been rather to insure the development of a full and complete record which presents the facts and other ratemaking considerations relative to a fair and meaningful determination of the complex issues involved. As such, the 1926 amendment created a separate office, with legal counsel, to advocate the views and needs of local consumers with regard to utility rates, distribution of these rates, service levels, fuel costs, and other utility operations.... The local utility regulatory commission had served admirably in its role as the independent judicial body responsible for making comprehensive and detailed decisions on complex rate procedures. However, it has not been able to serve simultaneously as the vigorous defender of local consumer interests. [H.R. REP. NO. 1485, 93d Cong., 2d Sess. 2-3 (1974).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Senate report indicates that in reestablishing OPC, Congress was motivated by those same concerns.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe original legislation which established the Public Utilities Commission in 1913... was amended in 1926 to provide for appointment of additional counsel in the Public Service Commission called the People's Counsel to intervene at hearings or judicial proceedings in matters concerning services provided by public utilities. However, the People's Counsel was abolished through Reorganization Plan No. 5, approved in 1952. The bill as reported by this Committee, re-enacts Title 43, Section 205, of the D.C. Code, drawing upon the original thinking and concerns of Congress when it initially enacted the law. [S. REP. NO. 1349, 93d Cong., 2d Sess. 3 (1974).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 In testimony before the House committee, Maryland's People's Counsel emphasized the importance of independence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOf course, I would have one caveat that I would urge either on the Committee or subsequent District of Columbia agencies that the financial commitment to adequately fund the independent office has to go along with creating the office also. I think that even if we did not save one nickel for the consumers, that the system itself of having an independent representative of the public within the Commission, operating independently, is most important. [ Utility Rates and People's Counsel for the Public Service Commission: Hearings on H.R. 16782 Before the House Comm. on the District of Columbia, 93d Cong., 2d Sess. 73 (1974) (statement of Gary R. Alexander).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe same theme reappeared in response to questioning.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Chairman: Does that suggest that under the counterpart bill, that People's Counsel should be answerable to the Public Service Commission or to be independent? What would you suggest?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMr. Alexander: It has to be independent of the Public Service Commission. There is no question about that, so that you may want to consider a specific term. Merely the fact that he is appointed by the Mayor may not lead to any conflict within the Commission itself. I think the important point is to have the People's Counsel position independent within the Commission. [ Id. at 74-75.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Committee stated that the bill would \"insure that there is an adequate, independent process for allowing the public and its interests to become a proper party in these proceedings.\" H.R. REP. NO. 1485, 93d Cong., 2d Sess. 10 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Senate committee concurred in that point of view.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn order to truly function, the People's Council must be independent. An effective consumer advocate must be able to argue his case on the merits and support the interests he is protecting. By the very nature of his function as an advocate, the People's Counsel will be continually taking positions in controversial matters. [S. REP. NO. 1349, 93d Cong., 2d Sess 5 (1975).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 While he and the Public Service Commission may wish to utilize the same personnel, share offices or otherwise cooperate, the specific authorization contained in the bill is intended to provide the People's Counsel with protection against any problems that might arise from his taking positions which he believes to be in the people's interest and which are effectively contesting the decisions of the Public Service Commission. [S. REP. NO. 1349, 93d Cong., 2d Sess. 5 (1975).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 In his Concurring and Dissenting opinion, Judge Kern objects strenuously to the fact that consumers are required to bear substantial legal fees for the representation of their own interests before the Commission. However, no objection is made to the fact that ratepayers are required to bear the legal costs of those with opposing interests (i.e., an interest in higher utility charges) -- the utilities and their shareholders. Certainly Congress is permitted to redress the balance through a legislative judgment that there should be a public consumer advocate independent of the PSC, and that its legal and other costs should be borne by its beneficiaries. Our job is to determine the scope of what Congress has done, not to interpose our own preferences. See note 5 (infra).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 Expense payments, plus six percent interest, may be charged to utility operating expenses and provided for in the rates charged to customers. D.C. Code 1981, 43-612(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 Due to a recent amendment contained in the Public Utilities Reimbursement Fee Act of 1980, Act 3-206, D.C. Reg. 3004 (July 11, 1980), codified at D.C. Code 1981, § 43-612, the cost of appropriations for the PSC and OPC are now also borne by the utilities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7 In light of the fact that Congress has fixed the limit on overall costs of the regulatory process, and this limit has not been exceeded, Judge Kern's view that these costs are too high is not relevant to the task at hand. When Congress has spoken, it is not for us to interpose a different opinion. Under the congressional scheme, the upper limit is fixed, while the Commission -- not this court -- is delegated the responsibility to determine the actual expenditure level within those bounds through its expense assessment decisions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8 PEPCO also filed a motion to strike four of OPC's grounds for review, which is denied.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9 The Commission also stated that it has the exclusive authority to seek judicial enforcement of assessment orders, a matter that is not presented on appeal. PSC Order 7211 at 5.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10 The question of which of its activities may be financed by assessments is addressed in Part III, (infra).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11 He preferred public funding of consumer intervenors as a means of promoting ratepayer advocacy. S. REP. NO. 1349, 93d Cong., 2d Sess. 22 (1974) (statement of William R. Stratton).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12 The Commission also cites two cases in a footnote, but these are not directly on point, since neither involved a challenge based on the \"unreasonableness\" of an assessment. Chesapeake and Potomac Telephone Co. v. Public Serv. Comm'n. D.C.App., 339 A.2d 710 (1975); Washington Ry. \u0026 Electric Co. v. District of Columbia, 64 App.D.C. 243, 77 F.2d 366 (1935)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13 Certification of expenses by OPC is not made to the Commission, but to the custodians of the trust fund deposits. See PSC Order 7211 at 7.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14 OPC's several subsidiary arguments can be rejected without lengthy Discussion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ePeople's Counsel asserts that PSC review is a regulatory redundancy due to the existence of other checks such as expense certification, D.C. audit procedures, and the G.A.O. audit. See D.C. Code 1981, § 47-411. Such is not the case, since these procedures serve accounting functions designed to maintain fiscal integrity rather than to review the appropriateness of expenditures.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ePeople's Counsel maintains that the PSC has no expertise in the assessment of OPC expenses and lacks standards for decision. Even assuming this were true, it would not justify judicial repeal of the statutory scheme. Moreover, the Commission does have experience in determining the reasonableness of utility budgets and affirms that it is currently developing standards for expense requests.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWe also reject the contention that review of expenses would require prejudgment of cases pending before the Commission. It is perfectly possible to consider the reasonableness of hiring attorneys or consultants without passing on the theories or opinions they may ultimately present before the PSC.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ePeople's Counsel raises the spectre of the unwarranted discovery by the utilities of OPC's prehearing work product in the course of expense disputes. Until we see evidence to the contrary, we are confident that the PSC will take adequate steps to oversee the proceedings so as to protect the interests of all involved. If the possibility raised by OPC should ever come to pass, there will be adequate opportunity to deal with it at that time.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOPC notes that it and the PSC are subject to two common ceilings on the combined total of expenses. It contends that it is unfair for the PSC to review OPC expenses because the Commission has an interest in drawing upon the same funds. But this does not support nonreviewability of OPC requests, for OPC could then control the amount of funds available to PSC, which would be equally \"unfair.\" In fact, the existence of a common ceiling militates in favor of having a single body review expenses for both the Commission and the OPC, so as to avoid conflicting assessments.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eFinally, People's Counsel stresses that the PSC reached a contrary and unappealed decision in another case about fourteen months earlier. See Hearing, PSC Formal Case 685 (Feb. 21, 1978). However, the Commission is not constrained by that decision. It is entitled to change its mind, so long as it provides an explanation for its departure from its own precedent. See 2 K. DAVIS, ADMINISTRATIVE LAW § 8.9 at 198 (2d ed. 1979). \"An agency changing its course must supply a reasoned analysis indicating that prior policies and standards are being deliberately changed, not casually ignored....\" Greater Boston Television Corp. v. Federal Communications Comm'n, 143 U.S. App. D.C. 383, 444 F.2d 841, 852 (D.C. Cir. 1977). The original PSC order and the order on reconsideration provide an adequate indication of a deliberate and considered change in course.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15 This is the only issue as to which there was disagreement within the Commission. Commissioner Long Dissented.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16 See Parts II \u0026 III, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17 \"The Commission should also have funds available to employ expert legal assistance for the purpose of preparing and presenting this case to the courts.\" S. REP. NO. 644, 69th Cong., 1st Sess. 5 (1926) (letter of J.F. Bell, Commission Chairman).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eTo present adequately and properly the side of the public in this case the following are needed:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThird. The finest legal assistance available to take charge of the case from the very beginning, so that the evidence presented to the commission will be complete, adequate, and in proper form to be presented to the court,... exhausting all legal measures to see that Justice is done to the public as well as to the company. [ Id. at 6 (letter of William E.R. Covell).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18 This arrangement has now been altered by the Public Service Commission General Counsel Act of 1980, Act 3-331, 28 D.C. Reg. 90 (Dec. 22, 1980). Under the new system, legal advice and representation for the PSC is provided by its own staff rather than the Corporation Counsel. See D.C. Code 1981, § 43-405.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19 Since the enactment of § 43-406, the section dealing with legal representation of the PSC has been modified. See note 16, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20 WGL's statutory analysis differs somewhat from that of PEPCO, but arrives at similar Conclusions as regards OPC. It does not stress a distinction between litigation expenditures and other expenses. It would deny assessments for legal representation both to OPC and the PSC, on the theory that the in-house legal staffs of each were intended by Congress to be their sole advocates before the Commission and the courts. WGL concedes that the PSC may hire attorneys as \"agents\" under § 43-606 and assess for their cost, but insists that such lawyers may serve only as advisors or investigators, not representatives. \"All expenses of any litigation\" would apparently thus be limited to such items as court filing fees. This theory differs from PEPCO's only as to the extent of the Commission's hiring authority, which is not at issue here. As concerns OPC, we reject it for the same reasons.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21 In place of the bracketed words, the Congressional Record reports \"of procedure.\" Whether Mr. Gude misspoke or the recorder misunderstood, it is clear in light of the bill's language that the intended words were \"or proceeding.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22 WGL cites an exchange on the floor of the House as evidence that staff could only be employed through the use of appropriated funds.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMr. McCLORY. Further reserving the right to object, is it limited as far as who the People's Counsel can employ or is it unlimited as far as additional staff?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMr. DIGGS. A limitation is imposed by the authorization level for the operation of this office.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMr. McCLORY. How much is that?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMr. DIGGS. For the first months of 1975, it is $50,000 and there is $100,000 limitation for subsequent fiscal years. [93 CONG. REC. 41849 (1974).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eHowever, when read in context, it becomes apparent that the focus of attention was not the extent of utility liability under § 43-612, but the cost of OPC staff to the Treasury. The original bill had provided only for an individual People's Counsel with a specified salary grade. The Senate amended the bill to authorize the hiring of staff in addition to the People's Counsel himself, and provided a budget authorization for the Office. The concern expressed on the floor was apparently centered on the fiscal effect, not the impact on the utilities. This is shown by the remarks of Congressman Guide, a sponsor of the bill, which immediately followed the portion of the record quoted by WGL.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSome may be concerned about the wording of section 3 of the bill authorizing a $50,000 appropriation for fiscal year 1975 and not to exceed $100,000 for the fiscal year 1976. This language did not appear in the House version of the bill, inasmuch as the funding for the People's Counsel over and above that which would be borne by the public utilities investigated, valued, revalued, or otherwise effected as a special franchise tax would have been included in the budget of the Public Service Commission. The Senate version of section 3, presumably because it establishes an Office of the People's Counsel, sets a limitation for the expenses to be appropriated for that office. Certainly it is the intent of Congress that these funds authorized to be appropriated are not to be Federal funds, but rather they are authorized to be appropriated out of money in the Treasury credited to the District of Columbia. [93 CONG. REC. 41849 (1974) (emphasis added)].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1a Stevenson had been chided by various Republican speakers campaigning on behalf of General Eisenhower for \"bad judgment\" in testifying as to the reputation of Alger Hiss in the latter's sensational trial for perjury. In the Governor's October 23rd speech in Cleveland he recalled the anecdote and observed \"to the General that although his troops do not frighten us they ought to frighten him .\" Major Campaign Speeches of Adlai E. Stevenson (Random House 1952) p. 274.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2a PSC has indeed billed significant sums to the utilities and their customers for the attorneys it has retained on a fee basis to carry out its own duties. For example, during an 11-month period, PSC billed the utilities and their customers slightly less than $1,000,000 for services rendered by almost 15 different lawyers and lar firms and similar entities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3a In Order No. 7211, PSC acknowledged that the statute authorizing OPC to assess against the utilities \"certain\" of its expenses \"does not specifically refer to fees for independent attorneys as an assessable expense.\" However, PSC went on to opine that the authority to so assess is \"a reasonable reading of the statute\" since \"the sheer volume of legal work necessary to represent adequately the public interest may be beyond the capabilities of the People's Counsel and the OPC staff attorneys.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhile it has been said that necessity is the mother of invention, this innovative reading of the statute conflicts with the legislative history of OPC's creation. The Senate Committee recognized (App. at 91) that \"People's Counsel... will not be able to represent all interests of all consumers.\" (Emphasis added.) People's Counsel was expected to use some selectivity in the exercise of his responsibility on behalf of consumers; as the then PSC Chairman commented in a statement affixed to the Senate Report (App. at 110):\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThere will be cases, and they will come very early in the career of the People's Counsel, in which a selection will have to be made from among the many causes who seek his representation. He will have to make choices, not only because he can't represent every interest no matter how vast his resources, but because these interests are often themselves in conflict.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4a This estimate was predicated on the cost of the PSC practice, which as noted, was to engage and then assess for (1) outside expert witnesses for rate cases and (2) the four resident accountants. \"Normally,\" according to these sponsors of OPC legislation (App. at 96, 119), assessments by PSC \"are under $100,000\" and the \"highest amount the PSC has ever assessed was $224,500.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5a Moreover, I note that the legislative history (App. at 94) indicates that \"the basic expenses of the Office of People's Counsel, including salaries, rent, supplies, telephones, and equipment\" will be covered by appropriations. Thus, I disagree with the Conclusion of the majority in Part IV.B of its opinion also that utilities and their customers must pay \"extraordinary incremental expenses\" of a pending proceeding when they are \"episodic\" expenses. Apparently, we must rely upon the ability of PSC to employ the same kind of instinctive test Mr. Justice Stewart suggested in Jacobellis v. Ohio, 378 U.S. 184, 194, 12 L. Ed. 2d 793, 84 S. Ct. 1676 (1964) (concurring), for determining what is pornography: PSC will know an extraordinary incremental expense when it sees it. Needless to say, Congress, in appropriating public monies for operating PSC and OPC and all other governmental agencies, never intended that PSC could determine so casually what expenses OPC may inflict upon District consumers.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e* Judge Nebeker did not participate in the decision of these cases.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e** Judge Kelly was an Associate Judge of the court at the time of oral argument. Her status changed to Associate Judge, Retired, on March 31, 1983.\u003c/span\u003e\n\n",
    "body_length": 145221,
    "citedas": [
      "477 A.2d 1079"
    ],
    "attorneys": "Brian J. H. Lederer and Elizabeth A. Noel for petitioner. Lloyd N. Moore, Jr. for respondent. William Dana Shapiro for intervenor Potomac Electric Power Company. Lewis Carroll for intervenor Washington Gas Light Company.",
    "category": [
      "243"
    ],
    "judges": "Before Nebeker, Ferren, and Terry, Associate Judges, in chambers. Dissenting opinion by Associate Judge Ferren at p. 28.",
    "citation_count": 38
  }
}
