{
  "id": "x4ClPWYBTlTomsSB32Ho",
  "document": {
    "title": "United States v. Margiotta",
    "full_title": "UNITED STATES OF AMERICA v. JOSEPH M. MARGIOTTA",
    "jurisdiction": "Second Circuit",
    "date": "1982-07-27T00:00:00.000Z",
    "docket": "No. 82-1025, No. 1238 -- September Term, 1981",
    "body": "KAUFMAN, Circuit Judge:\n\nThe significant role played by political parties in municipal government has been an often noted characteristic of American urban life. Some critics, contributing to the prevailing mythology that machine politics have controlled the corridors of local government,\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e have highlighted the opportunities available to those who hold the strings of political power\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e for defrauding the citizenry and reaping personal gain, through the sale of public office and other favors. Other commentators, however, have asserted that local party leaders have often served important functions of political representation and association. In cities fragmented into diverse social and economic groups, it has been argued, party organizations have played a salutary role in organizing large numbers of people, and fulfilling their desires with patronage, jobs, services, community benefits, and opportunities for upward social mobility.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e In sum, the line between legitimate political patronage and fraud on the public has been difficult to draw.\n\nToday, not unmindful of these competing visions of political history, we must consider where such lines may be drawn in the context of a criminal prosecution for mail fraud\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e and extortion.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Specifically, we are asked to determine, inter alia, when, if ever, a political party leader who holds no official government office but who participates substantially in the governance of a municipality owes a fiduciary duty to the general citizenry, and what conduct violates such a fiduciary duty. The issues before us arise out of a criminal prosecution against Joseph M. Margiotta, long-time Chairman of the Republican Committees of both Nassau County and the Town of Hempstead, New York. The Government charges Margiotta with one count of mail fraud in violation of 18 U.S.C. § 1341 (1976)\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e and five counts of extortion in violation of 18 U.S.C. § 1951 (1976)\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e for activities in connection with the distribution of insurance commissions on municipal properties to Margiotta's political allies. The Government presented \"evidence of a scheme of fraud spun into a web of political power\"\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e at a trial before Judge Sifton, at which nearly seventy witnesses testified during a period of three weeks. After deliberating for eight days, the jury announced it was hopelessly deadlocked, and the trial judge declared a mistrial.\n\nUpon a request by the Government, in anticipation of a retrial, Judge Sifton reconsidered a number of legal and evidentiary rulings made at the trial. The trial judge entered an order in which he stated that the challenged rulings would be followed at Margiotta's second trial. The Government then appealed to this Court for review of Judge Sifton's order prior to the retrial. We found those portions of Judge Sifton's order indicating the court would abide by certain jury instructions at retrial were not appealable pursuant to 18 U.S.C. § 3731 (1976)\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e and, accordingly, dismissed the Government's appeal in that respect. While the portions of the order concerning the judge's evidentiary rulings were appealable, we concluded that the district court had acted well within its discretion, and affirmed the order on the evidentiary rulings.\n\nMargiotta's retrial before Judge Sifton proved to be another closely fought contest. Following a trial lasting three weeks, the jury deliberated conscientiously for three days. It returned a verdict of guilty on all six counts, including the one count of mail fraud in violation of 18 U.S.C. § 1341 (1976) and the five counts of extortion in violation of 18 U.S.C. § 1951 (1976). Judge Sifton sentenced Margiotta to concurrent terms of imprisonment of two years on each count.\n\nMargiotta appeals to this Court from the judgment of conviction entered by Judge Sifton. On appeal, he raises a number of claims, several of which involve novel issues. Margiotta argues that his conviction of mail fraud must be reversed and the indictment dismissed on the grounds that the federal mail fraud statute, 18 U.S.C. § 1341 (1976), does not embrace a theory of fiduciary fraud by individuals who participate in the political process but who do not occupy public office, and that Margiotta owed no fiduciary duty to the general citizenry of Nassau County and the Town of Hempstead under federal or state law. Moreover, he asserts that the evidence was insufficient to support a finding of fiduciary duty even if it were held that the trial court's instructions were not erroneous as a matter of law. In addition, Margiotta claims that the indictment and conviction violate his First Amendment rights of freedom of expression, association and petition, and that the mail fraud statute is impermissibly vague on its face and as applied to him on the facts of this case. Furthermore, he asserts that he did not fail to disclose material information in violation of the mail fraud statute. Margiotta also claims that his conviction of five counts of extortion in violation of the Hobbs Act, 18 U.S.C. § 1951 (1976), should be reversed and the indictment dismissed because he did not commit extortion \"under color of official right\" or through the wrongful use of \"fear,\" and because the district court's allegedly improper instructions on the mail fraud count prejudiced the jury's consideration of the Hobbs Act charges. Finally, Margiotta argues that Judge Sifton erred by admitting Richard A. Williams's hearsay account of his father's alleged agreement with Margiotta. For the reasons stated below, we reject Margiotta's contentions, and affirm the judgment of conviction in all respects.\n\nI. Background\n\nSince the conduct at issue in this case involves an intricate scheme of fraud, we must set forth the facts in detail. As noted above, Joseph M. Margiotta, was at all relevant times the Chairman of the Republican Committee of both Nassau County and the Town of Hempstead, New York. Although he held no elective office, his positions as County and Town Republican Chairman, according to the Government, afforded him sufficient power and prestige to exert substantial control over public officials in Hempstead and Nassau County who had been elected to office as candidates of the Republican Party. This control, it was charged, enabled Margiotta to exercise influence over the appointees of these elected officials as well. The spread of his political tentacles over the governments of Town and County allegedly offered Margiotta the opportunity to engage in a highly remunerative fraudulent design involving the distribution of insurance commissions on municipal properties to his political associates.\n\nThe responsibility of the Nassau County Executive and the Presiding Supervisor of the Town of Hempstead in maintaining the properties owned and operated by their respective jurisdictions was at the crux of this artifice. The holders of these public offices were responsible for obtaining insurance coverage for the properties owned by the Town and County. As a matter of practice, the authority for obtaining insurance on municipal properties was delegated to a Broker of Record designated by the entities and serving at their pleasure. The Broker of Record was the only individual who acted on behalf of these jurisdictions in placing insurance policies. The Broker received as compensation for his services commissions consisting of a portion of the monies paid by the municipalities for the insurance policies.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nAccording to the Government, this municipal insurance activity was transformed into a scheme to defraud the citizens of Hempstead and Nassau County in 1968. At that time, Margiotta allegedly contrived the appointment of Richard B. Williams \u0026 Sons, Inc., an insurance agency, (hereinafter the \"Williams Agency\" or \"Agency\"), as Broker of Record for the Town of Hempstead. Richard B. Williams determined to have the Agency designated as Broker of Record for the Town, a position then held by one Mortimer Weis. Williams allegedly met with Margiotta and Weis to strike a secret \"deal\": The Williams Agency would be named Broker of Record for the Town of Hempstead, and Weis would become a $10,000 a year consultant to the Town. In return for the appointment, the Williams Agency would set aside 50% of the insurance commissions and other compensation it received, to be distributed to licensed insurance brokers and others designated by Margiotta. Shortly thereafter, Ralph Caso, the Presiding Supervisor of Hempstead, appointed the Williams Agency as Hempstead's Broker of Record based on Margiotta's recommendation. In 1969, the Williams Agency began to write insurance for the Town of Hempstead, and commenced making \"kickbacks\" to brokers selected by political leaders of local election districts in the Town who were loyal to the appellant.\n\nIn 1970 Caso was elected County Executive of Nassau County. After his election, Richard B. Williams met with Margiotta to discuss the possibility of the Williams Agency acting as Broker of Record for Nassau County. On January 1, 1971, the day on which he took office, Ralph Caso designated the Williams Agency as Broker of Record for Nassau County based on Margiotta's recommendation. Soon thereafter, the Williams Agency commenced to distribute 50% of the commissions it earned on Nassau County properties to brokers and others politically allied with Margiotta. Between 1969 and 1978, according to the Government, the compensation paid the Broker of Record in connection with this arrangement totalled in excess of two million, two hundred thousand dollars. Among the recipients of more than five hundred thousand dollars in kickbacks were numerous insurance brokers who performed no legitimate work, lawyers and other friends of Margiotta who rendered no services in return for their compensation, and the appellant himself. The concealment of this fraudulent scheme, according to the Government, was fostered through the preparation of fictitious property inspection reports. As a result, it was made to appear that the recipients of the insurance commission kickbacks were legitimately earning their commissions. Moreover, the Government has charged, the insurance activities were disguised by Margiotta through false and misleading testimony during the course of an investigation by the New York State Investigation Commission.\n\nIn November, 1980, a federal grand jury indicted Margiotta on one count of mail fraud, in violation of 18 U.S.C. § 1341 (1976), and five counts of extortion, in violation of 18 U.S.C. § 1951 (1976). The mail fraud count (Count One) was based on a scheme to defraud the Town of Hempstead, Nassau County, New York State, and their citizens (1) of the right to have the affairs of the Town, County and State conducted honestly, free from corruption, fraud and dishonesty, and (2) of the right to Margiotta's honest and faithful participation in the governmental affairs of the Town, County and State. The factual predicate underlying Count One was the above-described insurance commission ruse in which, pursuant to a secret agreement, Margiotta arranged the appointment of the Williams Agency as Broker of Record for the Town and County in return for the Agency's payment of kickbacks to insurance brokers and others designated by Margiotta. Counts Two through Six charged Margiotta with violating the Hobbs Act by inducing the Williams Agency to make the payments of the insurance commissions under color of official right and by means of the wrongful use of fear. Count Two charged Margiotta with extortion in connection with the payments to the insurance brokers who were political allies. Count Three set forth a Hobbs Act violation based on Margiotta's actions in obtaining monthly payments in the amount of $2,000 from the Williams Agency to attorneys William Cahn and his son Neil Cahn between 1974 and 1975. Count Four was predicated on a $10,000 payment by the Williams Agency to one Robert Dowler, who allegedly entered into an agreement to pay one-half of the money to Margiotta. Count Five described a Hobbs Act offense arising from a series of payments totalling more than $60,000 to Joseph M. Reilly, a New York State Assemblyman, and Count Six charged Margiotta with extortion in connection with payments by the Williams Agency to Henry W. Dwyer, a New York State Assemblyman and consultant to the Nassau County Republican Committee.\n\nThe first of the appeals spawned by this indictment arose from the pretrial maneuvering of the parties. On January 6, 1981, Margiotta filed a pretrial motion to dismiss Count One,\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e alleging, inter alia, that Count One failed to state an offense pursuant to 18 U.S.C. § 1341, that the Count was duplicitous, and that it was unconstitutionally vague. In response, the Government submitted an affidavit describing hundreds of items sent through the mails upon which a charge of fraudulent use of the mail could be based. Judge Sifton ruled that Count One stated an offense under § 1341, but ordered the Government to elect a single mailing to submit to the jury. The Government appealed Judge Sifton's order to this Court, which held that the order was appealable and that the Government was not required to elect among the numerous specified mailings. United States v. Margiotta, 646 F.2d 729 (2d Cir. 1981). Trial commenced on March 27, 1981. While the Government presented evidence to prove that Margiotta's involvement in the insurance activities was a scheme to defraud, Margiotta offered a defense of good faith. He attempted to prove that he had no secret agreement with the Williams Agency for the distribution of insurance commissions as a quid pro quo for securing the appointment of the Agency as Broker of Record. Admitting that he recommended the Agency to be Broker of Record for both the Town and the County and that he directed the distribution of insurance commissions, he argued that this behavior was merely a longstanding political patronage arrangement practiced for decades by Republicans and Democrats alike. As noted above, after deliberating carefully for more than a week, the jury announced that it could not agree on a verdict, and a mistrial was declared.\n\nThis court's second review of the Margiotta case followed Judge Sifton's declaration of the mistrial. In anticipation of another hotly contested battle at the retrial, the Government sought reconsideration of a number of legal and evidentiary rulings Judge Sifton had made at the first trial. The Government challenged Judge Sifton's instruction to the jury that for the Government to show Margiotta had defrauded the citizens of Nassau County and the Town of Hempstead of the right to have the affairs of those entities conducted honestly, free from corruption, fraud and dishonesty, in violation of the mail fraud statute as charged in Count One, the jury had to find that Margiotta owed some kind of special fiduciary duty to the citizenry.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e The Government also sought reconsideration of the district court's related instruction that a violation of mail fraud under Count One required an additional showing of willful concealment.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Moreover, the Government contended that the district court erred in declining to instruct the jury that Margiotta could be found guilty, as a principal, of extortion under color of official right in violation of 18 U.S.C. § 1951. Instead, Judge Sifton instructed that Margiotta could be found guilty of extortion pursuant to 18 U.S.C. § 2(b) only if the jury found that he had caused public officials acting under color of official right to induce a victim to part with money.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e The Government also took issue with certain evidentiary rulings made by Judge Sifton at the first trial.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e The Government appealed from Judge Sifton's order stating that he would follow these rulings at the second trial. This Court affirmed the order on the evidentiary rulings and dismissed the appeal with respect to the challenged jury instructions, on the ground that those portions of the order relating to the jury instructions were not appealable by the Government pursuant to 18 U.S.C. § 3731. United States v. Margiotta, 662 F.2d 131 (2d Cir. 1981). In dismissing the Government's appeal with respect to the jury instructions, we explicitly stated we intended to express no views on the merits of those claims.\n\nAt the second trial, the Government again sought to prove that Margiotta's participation in the insurance activities amounted to an elaborate scheme of fraud in violation of the federal mail fraud and extortion statutes rather than a mere political patronage system. The Government presented evidence to show that Margiotta had deeply insinuated himself into the affairs of government in the Town of Hempstead and Nassau County, to the point that he was in effect undertaking the business of government and not simply the activities of the Republican Party. This evidence was provided by testimony of Ralph Caso, who was the Presiding Supervisor of the Town of Hempstead until 1971 and Nassau County Executive until 1977. Caso stated that prior to his \"break\" with Margiotta in 1976, he was \"controlled\" by Margiotta in \"the basic responsibilities that [he] was to carry out,\" including appointments to offices and positions such as the Broker of Record.\n\nWhile Caso's successor, Francis Purcell, who still holds the office of Nassau County Executive, did not describe the same relationship of dominance over the affairs of government in Town and County, the testimony of Margiotta himself and those who carried out his directives established that the appellant exercised a vise-like grip over the basic governmental functions in Hempstead and Nassau County. In explaining his role in the selection of the Williams Agency for the position of Broker of Record, Margiotta testified that Richard B. Williams, an active participant in the political affairs of the Town of Hempstead and Nassau County, had approached him in 1968 and asked to replace Mortimer Weis as Broker of Record for the Town of Hempstead. Margiotta determined that the Williams Agency should replace Weis as the Broker of Record, and this decision was implemented by Caso. In 1971, after Ralph Caso was elected Nassau County Executive, Mr. Williams again approached Margiotta to express his desire to become Broker of Record for Nassau County. Margiotta testified that he determined the Williams Agency \"deserved it above anybody else [he] thought was capable of handling it.\" On January 1, 1971, the day on which he took office, Ralph Caso designated the Williams Agency as Broker of Record for Nassau County based on Margiotta's recommendation.\n\nMoreover, Margiotta's participation in the \"governmental administration of insurance affairs\" involved more than the selection of the Broker of Record. Margiotta himself testified that on one occasion he was directly involved in discussions concerning efforts to obtain insurance for the Nassau County Coliseum and the Veterans Hospital, and that he was consulted by Alphonse D'Amato, then Presiding Supervisor of the Town of Hempstead, about the possibility of adopting a self-insurance plan following inquiries by the New York State Investigation Commission. Insurance brokers Dowler and Curran corroborated this evidence of Margiotta's dominance in municipal insurance activities. They stated that when they sought the Town and County business, they undertook discussions with Margiotta, not with the public officials. After Margiotta declined their offers, they did not appeal to the public officials because, as broker Curran testified, \"there was no place else to go.\" Margiotta's version of these discussions does not put the lie to the assertion he told Curran that \"in view of [Williams's] party service I had no intention of taking any insurance away from him.\" Similarly, after Richard B. Williams, the founder of the Williams Agency, died in 1978, Margiotta testified that Williams's son, Richard A. Williams, approached him to ask whether the death of his father would affect their insurance arrangement. Margiotta stated that he would always \"retain and recommend\" the Williams Agency as Broker of Record. Moreover, Margiotta conceded that if the Williams Agency ever refused to follow his instructions concerning the distribution of portions of the insurance commissions, he would have convened a meeting of the Executive Committee of the Republican Party, and would have recommended that the Williams Agency be replaced as the Broker of Record.\n\nThe municipal insurance activities were not Margiotta's sole concern in participating in municipal government. Margiotta also played a substantial role in making hiring and promotion decisions. Margiotta's activities as a de facto Department of Personnel for Nassau County were described at trial by Alfred G. Riehl, the program staffing officer of Nassau County, and Donald Woolnough, the Republican headquarters functionary who was Margiotta's administrative assistant. Mr. Riehl assumed his duties as program staffing officer following a meeting with Margiotta, at which the appellant directed Riehl to see Donald Woolnough. Riehl and Woolnough discussed the procedure for handling requests for employment, promotions and raises. In essence, Riehl was informed that whenever a position not covered by applicable civil service regulations became available, Riehl should notify Woolnough. Woolnough testified that he would \"disseminate\" those jobs paying less than $15,000 to local Republican Party leaders unless a number of jobs were made available at one time, in which case Margiotta would instruct Woolnough on which local political districts should receive the employment opportunities. According to both Woolnough and Margiotta himself, while Woolnough would interview applicants for positions as clerks, electricians and other types of laborers to be hired by the municipal government, Margiotta would interview individuals who were applying for the higher level positions, such as candidates for County or Town Attorneys and department heads. Riehl testified that he contacted Woolnough on all cases involving hiring, requests for promotions, and salary increases in excess of $1,500. Woolnough stated that he would convey the information to Margiotta, who would often direct him to check with the local leader. Margiotta would also personally approve or disapprove promotions and salary increases for Nassau County positions. According to Woolnough, Margiotta's approval would be based upon the individual's \"political activity.\" If a request for a raise or promotion was denied, Riehl would simply inform the appropriate department head of the decision, but would not proffer any reasons for the denial.\n\nMargiotta played a similar role in the government of the Town of Hempstead. Muriel DeLac, the Director of Personnel for the Town of Hempstead stated that she followed the \"unvarying practice\" of seeking approval of raises and promotions concerning positions with the Town of Hempstead by forwarding a request to Donald Woolnough at the Republican Committee. The requests would be returned with the notations, \"approved\" or \"denied.\" According to Ms. DeLac, the only individuals approved for hiring were those referred by the leaders of the Republican Party. One of Woolnough's responsibilities was to obtain lists from Nassau County and the Town of Hempstead showing the names of all employees and the salary they earned. Armed with this information, Margiotta and his associates would study the relationship between the amount of money earned by an individual and the amount of money contributed to the Republican Party before approving or denying a request for a raise or promotion.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e In short, Margiotta's role in the affairs of Nassau County and the Town of Hempstead may be summarized in the words of Donald Woolnough: \"everything went through his hands.\"\n\nAccording to the Government, Margiotta converted this control over the governments of Town and County into a scheme to defraud relating to the municipal insurance activities. The tale of Margiotta's allegedly corrupt agreement was recounted at trial by Richard A. Williams, son of Richard B. Williams, the founder of the Williams Agency and close political associate of Margiotta. In 1968 Williams accompanied his father to a meeting attended by Margiotta and Mortimer Weis. The younger Williams waited outside the meeting room. Later, Williams was advised by his father that the Williams Agency would be named Broker of Record for the Town of Hempstead and that the Agency had agreed to split its commissions on a \"50-50 basis.\" Margiotta has conceded that this meeting was held. Moreover, the testimony of Williams that his father had agreed to set aside 50% of his commissions was corroborated by documents prepared by Williams and his father in 1969. These documents specified the amounts of commissions the Williams Agency had received, and showed, under a column labeled \"50% of commissions,\" that the funds had been divided in half. The younger Williams testified that his father had a conversation with Margiotta prior to the appointment of the Williams Agency as Broker of Record for Nassau County. The Williams Agency continued to set aside 50% of the commissions it earned on Nassau County properties for distribution to Margiotta's political allies.\n\nThrough his control over the appointment process and other aspects of municipal government, Margiotta had thus generated a \"slush fund,\" the proceeds of which could be distributed to purchase party loyalty, to assist friends, or, for purposes he designated, in his words, \"whenever the spirit moved [him].\" For example, attorney William Cahn, a former district attorney for Nassau County, was \"retained\" by the Williams Agency at a fee of $2,000 per month beginning in January, 1975 after Margiotta asked whether the Williams Agency could \"see its way clear to retain [Cahn].\" The Williams Agency paid William Cahn $24,000 per year in 1975 and 1976, and continued to pay $2,000 per month in 1977. In April, 1977, the Agency began making the payments to Cahn's son, Neil, after William Cahn told Margiotta that he wanted his son to receive the money. The Williams Agency deducted the payments to the Cahns from the amount allocated from the commissions earned by placing insurance on Nassau County properties. Neither William nor Neil Cahn rendered any legal services on behalf of the Williams Agency.\n\nAnother beneficiary of the insurance scheme was Michael D'Auria, a former State Supreme Court Justice who was ultimately disbarred. Following Margiotta's approval, the Williams Agency made a series of payments totalling approximately $16,000 between 1971 and 1975 to D'Auria, who did no compensable legal work. Moreover, John Sutter, a Nassau County criminal lawyer, received payments derived from the insurance proceeds. Sutter represented Williams and several others, including Margiotta, William Cahn, Nassau County Executive Purcell, New York State Assemblyman Joseph Reilly, and Deputy Nassau County Executive Henry Dwyer, following inquiries by the New York State Investigation Commission and a grand jury into state insurance practices in 1977. Sutter never billed Margiotta or any of the other clients except the Williams Agency and Nassau County. Moreover, it appears that Sutter billed the Williams Agency for work incurred in representing one John Hansen in an unrelated state criminal matter, pursuant to instructions from Margiotta. Furthermore, the Government presented evidence that Margiotta had arranged for a payment of $5,000 to himself. Robert Dowler testified that Margiotta and Dowler agreed to split a payment of $10,000 made by the Williams Agency to Dowler.\n\nTo support its theory that the insurance arrangement was a scheme to defraud rather than a good faith patronage practice, the Government sought to prove that Margiotta tried to conceal the practice by directing the preparation of falsified property inspection reports by recipients of the kickback payments who did no meaningful work. According to the younger Williams, Margiotta convened a meeting with Williams in 1975, responding to the growing concern that the public exposure of the insurance activities would cause embarrassment to the Republican Party. As a result, from 1975 to 1978, the insurance brokers who received portions of the commissions earned by the Williams Agency were directed to make useless inspections of properties and to write unnecessary reports. Thus, it was made to appear that the recipients of the insurance proceeds were legitimately earning their commissions. In addition, the Government presented evidence showing that Margiotta attempted to disguise the insurance practices by misleading the State Investigation Commission when it inquired into the propriety of the insurance scheme in 1977 and 1978. Many of the recipients of the kickbacks, represented by a group of attorneys whose fees were paid by the Nassau County Republican Committee, misrepresented to the Commission the reason they were receiving the payments. The witnesses stated that they worked and performed services for the money they received. Margiotta himself testified that his conversation with Williams concerning the sharing of commissions in 1971 was motivated in part by the workload facing the brokers.\n\nAt trial, Margiotta maintained that, although he recommended the designation of the Williams Agency as Broker of Record and expected the Agency to continue the insurance patronage system, his recommendation was not made contingent upon a secret agreement to split the commissions on a \"50-50 basis.\" Margiotta asserted that his practice of commission sharing among brokers was a good faith continuation of a long-standing and widely-known political patronage arrangement in New York. Margiotta argued that until 1978, no New York law prohibited the sharing of municipal commissions among non-working brokers.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e He emphasized that the insurance patronage scheme was discontinued after Governor Carey proposed a new State regulation requiring the performance of services by brokers receiving commissions. John F. English, former Nassau County Chairman of the Democratic Party, Palmer Farrington, past Presiding Supervisor of the Town of Hempstead, testified that the distribution of insurance commissions on municipal properties to non-working brokers was a patronage system practiced by both Democrats and Republicans in the County for decades. Margiotta further asserted that he was not responsible for the preparation of fictitious property inspection reports, and that he did not lie to the State Investigation Commission. After deliberating for several days, the jury empanelled for his second trial convicted Margiotta of mail fraud and five counts of extortion. We have set forth at some length the factual contentions of the Government and Margiotta so that the points raised on appeal may be considered against the background of the bitterly contested trial.\n\nOn appeal, Margiotta raises a cluster of arguments in support of his claims that his mail fraud and Hobbs Act convictions should be reversed and indictment dismissed. Moreover, he asserts that the trial court erred by admitting into evidence Richard A. Williams's account of his father's alleged agreement with Margiotta. We turn now to the merits of Margiotta's claims.\n\nII. Mail Fraud\n\nMargiotta asserts that his conviction of mail fraud (Count One) must be reversed and the indictment dismissed on the grounds that the federal mail fraud statute, 18 U.S.C. § 1341 (1976), does not embrace a theory of fiduciary fraud by private participants in the political process, and that Margiotta owed no fiduciary duty to the general citizenry of Nassau County or the Town of Hempstead upon which a mail fraud offense could be based. Count One alleged that Margiotta devised a scheme to defraud Nassau County and the Town of Hempstead, New York State, and the citizens of these jurisdictions, (1) of the right to have the affairs of those entities conducted honestly, free from corruption, fraud and dishonesty, and (2) of the honest and faithful participation of Margiotta in the governmental affairs of those entities. The basic factual predicate underlying Count One was the allegation that Margiotta, who participated extensively in the selection of public officeholders in Hempstead and Nassau County, had entered into a secret agreement pursuant to which the Williams Agency was designated Broker of Record on the understanding that the Agency would kick back a substantial portion of its commissions in accordance with Margiotta's instructions. Margiotta argues that an alleged deprivation of an \"intangible right\" to a defendant's honest and faithful services forms a predicate for a federal mail fraud violation only where the defendant shares a fiduciary relationship with the putative victim. Asserting that a fiduciary duty to the general citizenry requiring honest and faithful participation in governmental affairs has been recognized only in cases involving defendants who are public officials, Margiotta concludes that the novel application of the mail fraud statute on an \"intangible rights\" theory to a non-office holder such as Margiotta represents an untenable and improper extension of the mail fraud statute beyond its permissible bounds.\n\nIn construing the elements of the mail fraud statute in this case of first impression, we tread most cautiously. As we have noted in another context, see United States v. Barta, 635 F.2d 999, 1005-06 (2d Cir. 1980), cert. denied, 450 U.S. 998, 68 L. Ed. 2d 199, 101 S. Ct. 1703 (1981), § 1341 is seemingly limitless on its face. We are not unaware of the time-honored tenet of statutory construction that ambiguous laws which impose penal sanctions are to be strictly construed against the Government. Id. at 1001. See also United States v. Wiltberger, 18 U.S. (5 Wheat.) 76, 5 L. Ed. 37 (1820). Concomitantly, it is indisputable that there are situations in which the legislature has intended to define broadly the scope of criminal liability. Our task today is complicated because the broad provisions of the mail fraud statute have been applied in a context implicating two conflicting sets of values, both of which merit stringent protections. On the one hand, the prosecution under § 1341 of those who simply participate in the affairs of government in an insubstantial way, or exercise influence in the policymaking process, poses the danger of sweeping within the ambit of the mail fraud statute conduct, such as lobbying and party association, which has been deemed central to the functioning of our democratic system since at least the days of Andrew Jackson. On the other hand, an unduly restrictive reading of § 1341, leading to the formulation of a rule that precludes, as a matter of law, a finding that a person who does not hold public office owes a fiduciary duty to the citizenry, regardless of that individual's de facto control of the processes of government, eliminates a potential safeguard of the public's interest in honest and efficient government. While we conclude that there are limitations on the application of the mail fraud statute to violations of the intangible right to \"good government,\" we believe that the statute reaches the conduct evidenced by the appellant in this case.\n\nA. The applicability of the mail fraud statute.\n\nMargiotta argues that the mail fraud statute cannot, as a matter of law, embrace a theory of fiduciary fraud by private participants in the political process. Specifically, he emphasizes that although § 1341 has been applied to fiduciaries in both the public and private sectors, the fiduciary duty associated with the public's intangible right to an individual's honest and faithful participation in governmental affairs has been accepted only where the defendant is a public official. See, e.g., United States v. Mandel, 591 F.2d 1347, 1358 (4th Cir.), aff'd en banc in relevant part, 602 F.2d 653 (1979), cert. denied, 445 U.S. 961, 100 S. Ct. 1647, 64 L. Ed. 2d 236 (1980); United States v. Brown, 540 F.2d 364, 374 (8th Cir. 1976). We reject Margiotta's claim. In the private sector, it is now a commonplace that a breach of fiduciary duty in violation of the mail fraud statute may be based on artifices which do not deprive any person of money or other forms of tangible property. See United States v. Barta, supra, 635 F.2d at 1005-06 (deprivation of employer's right to employee's honest and faithful services); United States v. Buckner, 108 F.2d 921 (2d Cir.), cert. denied, 309 U.S. 669, 84 L. Ed. 1016, 60 S. Ct. 613 (1940). Fraudulent schemes designed to cause losses of an intangible nature clearly come within the terms of the statute. See United States v. Bronston, 658 F.2d 920 (2d Cir. 1981), cert. denied, 456 U.S. 915, 102 S. Ct. 1769, 72 L. Ed. 2d 174 (1982). A close reading of the statute supports this result. Section 1341 prohibits \"any scheme or artifice to defraud, or for obtaining money or property by means of false or fraudulent pretenses, representations or promises\"\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e (emphasis added). Accordingly, the prohibition against schemes or artifices to defraud is properly interpreted to be independent of the clause \"for obtaining money or property.\" See United States v. States, 488 F.2d 761, 764 (8th Cir. 1973), cert. denied, 417 U.S. 909, 94 S. Ct. 2605, 41 L. Ed. 2d 212, (1974). But see Comment, The Intangible-Rights Doctrine and Political Corruption Prosecutions Under the Federal Mail Fraud Statute, 47 U. Chi. L. Rev. 562 (1980) [hereinafter \"Comment -- Intangible Rights \"].\n\nIn the public sector, as the appellant correctly points out, the mail fraud statute has been employed in prosecutions of public officials who have allegedly deprived the citizenry of such intangible rights as the right to good government, or the right to the honest and loyal services of its governmental officers. A number of courts have approved the prosecution of allegedly corrupt politicians who did not deprive the citizens of anything of readily identifiable economic value. See, e.g., United States v. Mandel, supra; United States v. Keane, 522 F.2d 534 (7th Cir. 1975), cert. denied, 424 U.S. 976, 47 L. Ed. 2d 746, 96 S. Ct. 1481 (1976); United States v. States, supra. From these cases, a basic principle may be distilled: a public official may be prosecuted under 18 U.S.C. § 1341 when his alleged scheme to defraud has as its sole object the deprivation of intangible and abstract political and civil rights of the general citizenry. The definition of fraud is thus construed broadly to effectuate the statute's fundamental purpose in prohibiting the misuse of the mails to further fraudulent enterprises of all kinds. See United States v. States, supra, 488 F.2d at 764. See also Comment -- Intangible Rights, supra, at 564.\n\nThe instant case raises the novel issue whether an individual who occupies no official public office but nonetheless participates substantially in the operation of government owes a fiduciary duty to the general citizenry not to deprive it of certain intangible political rights that may lay the basis for a mail fraud prosecution. In the private sector cases, a formal employer-employee relationship is not a prerequisite to a finding that a fiduciary duty is owed. See, e.g., Oil \u0026 Gas Ventures -- First 1958 Fund Ltd. v. Kung, 250 F. Supp. 744, 749 (S.D.N.Y. 1966) (Weinfeld, J.) (fiduciary relation may be founded upon dominance). Similarly, we do not believe that a formal employment relationship, that is, public office, should be a rigid prerequisite to a finding of fiduciary duty in the public sector. Cf. United States v. Del Toro, 513 F.2d 656, 663 \u0026 n.4 (2d Cir.), cert. denied, 423 U.S. 826, 96 S. Ct. 41, 46 L. Ed. 2d 42 (1975) (prosecution for conspiracy to defraud the United States in violation of 18 U.S.C. § 371).\n\nThe drawing of standards in this area is a most difficult enterprise. On the one hand, it is essential to avoid the Scylla of a rule which permits a finding of fiduciary duty on the basis of mere influence or minimum participation in the processes of government. Such a rule would threaten to criminalize a wide range of conduct, from lobbying to political party activities, as to which the public has no right to disinterested service. On the other hand, the harm to the public arising from the sale of public office and other fraudulent schemes leads us to steer a course away from the Charybdis of a rule which bars on all occasions, as a matter of law, a holding that one who does not hold public office owes a fiduciary duty to the general citizenry even if he in fact is conducting the business of government.\n\nAlthough there is no precise litmus paper test, two time-tested measures of fiduciary status are helpful: (1) a reliance test, under which one may be a fiduciary when others rely upon him because of a special relationship in the government, and (2) a de facto control test, under which a person who in fact makes governmental decisions may be held to be a governmental fiduciary. See Coffee, From Tort to Crime: Some Reflections on the Criminalization of Fiduciary Breaches and the Problematic Line Between Law and Ethics, 19 Am.Crim. L. Rev. 117, 147 (1981) [hereinafter \"Coffee, From Tort to Crime \"]; Cheese Shop Int'l, Inc. v. Steele, 303 A.2d 689, 691 (Del. Ch.), rev'd on other grounds, 311 A.2d 870 (Del. Sup. 1973); Mobil Oil Corp. v. Rubenfeld, 72 Misc.2d 392, 399-400, 339 N.Y.S.2d 623, 632 (Civ. Ct. 1972), aff'd, 77 Misc.2d 962, 357 N.Y.S.2d 589 (1974), rev'd on other grounds, 48 A.D.2d 428, 370 N.Y.S.2d 943 (2d Dep't. 1975), aff'd mem. 40 N.Y.2d 936, 390 N.Y.S.2d 57, 358 N.E.2d 882 (1976); In re Jennings Estate, 335 Mich. 241, 244, 55 N.W.2d 812, 813 (1952) (no fiduciary relationship absent a showing of confidence, trust and reliance); Trustees of Jesse Parke Williams Hospital v. Nisbet, 191 Ga. 821, 841, 14 S.E.2d 64, 76 (1941) (fiduciary status based on position of dominance and control); Miranovitz v. Gee, 163 Wis. 246, 249, 157 N.W. 790, 792 (1916) (reliance on superior knowledge of fiduciary); see also United States v. Mazzei, 521 F.2d 639 (3d Cir.) (en banc), cert. denied, 423 U.S. 1014, 46 L. Ed. 2d 385, 96 S. Ct. 446 (1975). These tests recognize the important distinction between party business and government affairs, permitting a party official to act in accordance with partisan preferences or even whim, up to the point at which he dominates government. Accordingly, the reliance and de facto control tests carve out a safe harbor for the party leader who merely exercises a veto power over decisions affecting his constituency. See Coffee, From Tort to Crime, supra, at 147.\n\nIn light of these guidelines, the prosecution of Margiotta under the mail fraud statute was permissible, notwithstanding the fact that the appellant held no official public office. It cannot be gainsaid that Margiotta had a stranglehold on the respective governments of Nassau County and the Town of Hempstead. According to Donald Woolnough, one of Margiotta's principal assistants, \"everything went through his hands.\" The evidence established not only that he was responsible for the administration of the municipal insurance activities, but also that he acted as a virtual Department of Personnel, with substantial power over decisions concerning hiring, promotions and salary increases. Others relied upon him for the rendering of important governmental decisions, and he dominated governmental affairs as the de facto public leader. As a result, the federal mail fraud statute properly supported a prosecution for Margiotta's breach of at least a minimum duty not to sell his substantial influence and control over governmental processes.\n\nMoreover, Judge Sifton's charge to the jury was consistent with the limitations we have delineated on the application of the mail fraud statute to participants in the political process who hold no public office. Judge Sifton did not simply instruct that the jury could find that Margiotta owed a fiduciary duty if he participated or had influence in Nassau County and the Town of Hempstead. Instead, the trial court charged that the jury should determine whether Margiotta's work \"was in substantial part the business of Government, rather than being solely party business and that his performance of that work was intended by him and relied on by others in Government as part of the business of Government. . . .\" This charge was harmonious with the guidelines we have articulated today, and ensured that the jury's consideration of the mail fraud count was properly channelled. Cf. Penato v. George, 52 A.D.2d 939, 942, 383 N.Y.S.2d 900 (2d Dep't 1976) (reliance is an important factor in determining existence of fiduciary relationship), appeal dismissed, 42 N.Y.2d 908, 397 N.Y.S.2d 1004, 366 N.E.2d 1358 (1977); Ahern v. Board of Supervisors of Suffolk County, 17 Misc.2d 164, 171, 184 N.Y.S.2d 894 rev'd on other grounds, 7 A.D.2d 538, 185 N.Y.S.2d 669 (2d Dep't 1959) (Party chairman participates in governmental function when nominating Commissioner of Elections).\n\nMargiotta's argument that the legislative history does not support the application of the mail fraud statute to private participants in the political process, regardless of the extent to which they dominate the affairs of government, is unavailing. While the mail fraud statute, originally enacted as § 301 of the Act of June 8, 1872, ch. 335, 17 Stat. 283, 323, resulted from a recommendation of a committee of postal officials for legislation \"to prevent the frauds which are perpetrated by lottery swindlers through the mails,\"\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e § 1341 has never been limited to this narrow purpose. See Coffee, From Tort to Crime, supra, at 123. Yet no legislative history exists to suggest that Congress has intended the mail fraud statute to deal only with schemes to defraud involving money or property, see United States v. States, supra, 488 F.2d at 764, let alone to be subject to a hard-and-fast distinction between public officeholders and dominant non-public officeholders in cases involving intangible political rights. Accordingly, our construction of § 1341 furthers the basic purpose of the statute in proscribing the use of the mails to promote fraudulent enterprises. See Durland v. United States, 161 U.S. 306, 40 L. Ed. 709, 16 S. Ct. 508 (1896). See generally Intent, Clear Statements, and the Common Law; Statutory Interpretation in the Supreme Court, 95 Harv. L.Rev. 892, 893 (1982) (instrumental approach is one technique of statutory interpretation).\n\nFurthermore, Margiotta's prosecution does not exceed the permissible bounds of the statutory language. More than five decades ago, the Supreme Court stated that the phrase \"scheme to defraud\" extends to \"a great variety of transactions.\" Fasulo v. United States, 272 U.S. 620, 629, 71 L. Ed. 443, 47 S. Ct. 200 (1926). In his brief, appellant has conceded that a deprivation of an intangible right to a defendant's honest and faithful services properly forms the basis for a mail fraud violation where the defendant owes a fiduciary duty to the alleged victim. As a result, while the question remains whether Margiotta owed a fiduciary duty to the general citizenry of the Town of Hempstead and Nassau County, there is no merit to Margiotta's claim that the language of the federal mail fraud statute cannot embrace a theory of fiduciary fraud by one, like the appellant, who has de facto control over the processes of government and is relied upon by others in the rendering of essential governmental decisions.\n\nB. Fiduciary Duty.\n\nMargiotta argues that, even assuming the applicability of the statute to his role in the insurance scheme, he owed no fiduciary duty to the general citizenry under federal or state law upon which a mail fraud violation could be predicated. At the outset, we reject his contention that absent a showing of a violation of New York statute or a duty imposed by New York law, a defendant may not be found guilty of using the mails in furtherance of a scheme to defraud on the basis of a breach of a fiduciary duty to the citizenry. The mail fraud statute was enacted to prohibit the use of the mails for promoting schemes deemed contrary to federal public policy. Early in the history of § 1341's interpretation, the Supreme Court stated that \"Congress may forbid any such act done in furtherance of a scheme that it regards as contrary to public policy, whether it can forbid the scheme or not,\" since \"the overt act of putting a letter into the post office of the United States is a matter that Congress may regulate.\" Badders v. United States, 240 U.S. 391, 393, 60 L. Ed. 706, 36 S. Ct. 367 (1916). Accordingly, a violation of local law is not an essential element of a scheme to defraud in contravention of 18 U.S.C. § 1341. See, e.g., United States v. States, supra, 488 F.2d at 767; United States v. Mandel, supra, 591 F.2d at 1362. This principle applies to the question of fiduciary duty as well. In United States v. Barta, supra, 635 F.2d at 1007, we stated that an employee's duty to disclose material information to his employer need not be imposed by state or federal statute. Rather, the duty not to conceal, and in fact to reveal, material information could be deemed to arise from the employment relationship itself. Id. See generally United States v. Bush, 522 F.2d 641, 646 n.6 (7th Cir. 1975) (a conviction for mail fraud is not dependent upon a violation of state law), cert. denied, 424 U.S. 977, 47 L. Ed. 2d 748, 96 S. Ct. 1484 (1976). But cf. Santa Fe Industries, Inc. v. Green, 430 U.S. 462, 479-80, 51 L. Ed. 2d 480, 97 S. Ct. 1292 (1977) (\"There may well be a need for uniform federal fiduciary standards . . . but those standards should not be supplied by judicial extension of § 10b and Rule 10b-5 [of the federal securities acts]. . . .\"). Similarly, we need not examine state law to determine whether Margiotta's relationship of dominance in municipal government gives rise to certain minimum duties to the general citizenry. Justice Holmes once wrote that \"men must turn square corners when they deal with the Government.\" Rock Island, A. \u0026 L.R. Co. v. United States, 254 U.S. 141, 143, 41 S. Ct. 55, 65 L. Ed. 188 (1920). It requires little imaginative leap to conclude that individuals who in reality or effect are the government owe a fiduciary duty to the citizenry. Moreover, such a conclusion merely construes the elements of a mail fraud violation and does not contravene the principle that there is no \"federal common law of crimes.\" Parratt v. Taylor, 451 U.S. 527, 531, 68 L. Ed. 2d 420, 101 S. Ct. 1908 (1981).\n\nTheoretically, the application of the federal mail fraud statute to state and local political participants without reference to state law principles of fiduciary duty raises federalism concerns. Indeed, Margiotta has argued that if New York State does not require individuals who are not public officeholders to act in a disinterested manner, a federal court's application of such a requirement constitutes an improper intrusion into the governmental affairs of New York State, as well as the county and local governments. See generally National League of Cities v. Usery, 426 U.S. 833, 49 L. Ed. 2d 245, 96 S. Ct. 2465 (1976). We need not reconcile the principles of federalism with the mandate of the mail fraud statute because Margiotta owed a fiduciary duty to the citizenry of Hempstead and Nassau County under New York law.\n\nIt has been held in the New York courts that \"the county committee [of the Republican Party] and its chairman are . . . trustees of party interests for the registered voters of the party in that county.\" In re Application of Roosevelt, 9 Misc.2d 205, 160 N.Y.S.2d 747, 749-750 (Sup. Ct.), aff'd, 3 A.D. 2d 988, 163 N.Y.S.2d 403 (1st Dep't 1957), aff'd, 4 N.Y.2d 19, 171 N.Y.S.2d 841, 148 N.E.2d 895 (1958). The primary function of the Republican Party Committees is \"the promotion of Republican candidates and policies. . . .\" Seergy v. Kings County Republican County Committee, 459 F.2d 308, 310 (2d Cir. 1972). Margiotta argues that his fiduciary duty to the Republican Party, which arises from his position as a party officer, would be impaired by a finding of a fiduciary duty to the citizenry requiring disinterested conduct. But while his party position may have been the springboard to control of the municipal governments, it is his participation in government, not his party position, which creates his fiduciary duty to the citizens. New York law clearly distinguishes between \"public officers\" and \"party officers.\" See People ex rel. McMahon v. Clampitt, 34 Misc.2d 766, 767, 222 N.Y.S.2d 23, 25 (Ct.Spec.Sess. City of New York 1961). The cases cited by Margiotta do not involve the question whether dominance over the affairs of government by an individual who is a party officer may create a fiduciary duty to the citizenry with respect to those affairs. In concluding that effective control over the processes of government may transform a mere party functionary into a public fiduciary under New York law, we are directed to § 3-502(2) of the New York Election Law. Under this section, the Chairman of the Nassau County Democratic and Republican Committees are given the authority to nominate a Commissioner of the Nassau County Board of Elections. In construing this section, one New York court has concluded that since, in making the nomination, the County Chairman participates in a governmental function, he is \"to that extent a governmental officer and is subject to the same mandatory power of this court when he fails to perform a duty imposed upon him by law.\" Ahern v. Board of Supervisors of Suffolk County, supra, 17 Misc.2d at 171, 184 N.Y.S.2d at 901. Accordingly, New York law supports the position that a party officer, who owes a duty to his party and its followers, may owe certain minimum duties to the public as well, as a result of the other obligations he assumes.\n\nWhile Cardozo described the standard of behavior governing a fiduciary as \"the punctilio of an honor the most sensitive,\" Meinhard v. Salmon, 249 N.Y. 458, 464, 164 N.E. 545, 546 (1928), such rhetoric does not assist in determining when a fiduciary duty arises. Judge Sifton, in his charge to the jury on the nature of the participation the jury had to find in deciding whether Margiotta had a special duty to disclose the corrupt agreement, adopted a standard consistent with two measures of fiduciary duty recognized under New York law. As noted above, the district court instructed the jury that it must determine whether the work done by Margiotta was \"in substantial part the business of government, rather than being solely party business and that his performance of that work was intended by him and relied on by others in Government as part of the business of Government.\" This instruction reflects the concepts of reliance, and de facto control and dominance, which are at the heart of the fiduciary relationship. See, e.g., Penato v. George, supra, 52 A.D.2d at 942, 383 N.Y.S.2d at 904-05; Mobil Oil Corp. v. Rubenfeld, supra, 72 Misc.2d at 399-400, 399 N.Y.S.2d at 632; Ahern v. Board of Supervisors of Suffolk County, supra. See generally Coffee, From Tort to Crime, supra, at 147. Accordingly, the jury could properly find that Margiotta owed a special duty to the electorate under New York law.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nMoreover, these instructions did not differ to an impermissible extent from the prosecution's \"theory\" charged in the indictment, in violation of the Fifth Amendment principle mandating reversal when the grand jury indicts on one theory, and the petit jury convicts on another. See, e.g., Stirone v. United States, 361 U.S. 212, 4 L. Ed. 2d 252, 80 S. Ct. 270 (1960). The Government's theory in the indictment, encapsulated in the two prongs of the charging paragraph, was that a finding of Margiotta's guilt could be predicated on his entering into an agreement which defrauded Nassau County and the Town of Hempstead of the right to have their affairs administered honestly. In response to the defendant's motion to dismiss, the Government contended that an individual who knowingly and in fact undertakes the business of governing a particular jurisdiction owes a duty of loyalty to the citizens just as does one who is formally elected to public office. As noted above, Judge Sifton did not simply charge that mere participation in government, in the form of consultation or recommendations concerning appointments or salary increases, was sufficient to create such a fiduciary duty. Instead, he charged that the jury had to find that the \"work done by [Margiotta] was in substantial part the business of Government rather than being solely party business and that the performance of that work was intended by him and relied on by others in Government as part of the business of Government in order to carry forward its affairs as a whole.\" This charge did not depart from the Government's \"theory of the case.\" Indeed, having been put on notice by Judge Sifton prior to the second trial that the district court intended to charge as it did, Margiotta raised no objection that he would be tried on a theory never presented to the grand jury.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e See United States v. Garguilo, 554 F.2d 59 (2d Cir. 1977). Since Judge Sifton's charge to the jury did not permit conviction \"upon theories and evidence that were not fairly embraced in the charges made in the indictment,\" id. at 63, Margiotta did not suffer any prejudicial variance warranting reversal.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nC. Sufficiency of the evidence of fiduciary duty.\n\nMargiotta argues that the evidence was insufficient to support a finding of fiduciary duty to disclose his secret agreement to the public even under the trial court's instructions to the jury. His claim that the Government did not present sufficient evidence that he assumed governmental functions concerning municipal insurance affairs is plainly without merit. While one author has stated that those who \"govern most make the least noise,\"\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e the Government introduced ample evidence that Margiotta was deeply involved in governmental affairs. The detailed proof adduced at trial reveals more than a limited role in giving political clearance for certain high-level appointments, such as County or Town attorneys and deputy department heads. Indeed, the evidence, including the testimony of Margiotta himself, supports a reasonable inference that Margiotta dominated the administration of several basic governmental functions, including the municipal insurance activities and the selection of individuals to fill positions in government. As Donald Woolnough, one of Margiotta's principal assistants, testified, everything relating to hiring, salaries and promotions \"went through his hands.\" Moreover, the testimony of Margiotta and the insurance brokers demonstrates that Margiotta wielded similar power with respect to the selection of the Broker of Record and the distribution of insurance commissions to political allies. Williams met with Margiotta to arrange for the designation of the Williams Agency as Broker of Record. Insurance brokers approached Margiotta, not the individuals who officially held public office, to seek the municipal insurance business. From the selection of the Broker of Record, to such matters as obtaining insurance for particular municipal facilities and approving an alteration in the methods of obtaining insurance, as well as designation of the recipients of the insurance commissions generated on municipal properties, it was reasonable to infer that Margiotta undertook the business of government in administering the insurance and other affairs of Hempstead and Nassau County.\n\nFurthermore, Margiotta claims that the evidence was insufficient to prove that he made any \"impartial\" undertaking that could lay the basis for a breach of fiduciary duty. Admitting that he always acted in a strictly partisan political role, and that his sole responsibility was to promote the election of Republican candidates and the health of the Republican Party, Margiotta asserts that there was a complete failure of proof to show that in recommending the Williams Agency as the Broker of Record, he made any representation that his decision was disinterested, impartial, or the result of a determination based on merit. This argument is misdirected. The breach of fiduciary duty on which his mail fraud prosecution has been predicated is not his failure to make decisions on the basis of merit, or on any misrepresentation or omission concerning his partiality. Rather, the crux of Margiotta's impropriety is the secret scheme, pursuant to which his recommendation of the Williams Agency was made on the understanding that the Agency would kick back a portion of its compensation to Margiotta's political allies. Ample evidence, including the testimony of Richard A. Williams and Margiotta himself, supports the Government's contention that this secret deal was struck and followed over the course of several years.\n\nFinally, Margiotta argues that even if it could be found that he was a fiduciary and this arrangement with the Williams Agency existed, the evidence did not establish that he had an affirmative duty to disclose information to County or Town officials concerning the basis for his recommendation of the Agency as Broker of Record. The district court instructed the jury that in order to decide that Margiotta breached his fiduciary duty, it had to find that Margiotta had concealed \"from those in Government who rely on his participation\" material information concerning his entry into a corrupt agreement \"to influence him in the performance of his governmental functions.\" It is undisputed that a defendant's breach of a fiduciary duty may be a predicate for a violation of the mail fraud statute where the breach entails the violation of a duty to disclose material information. See, e.g., United States v. Newman, 664 F.2d 12 (2d Cir. 1981); United States v. Barta, supra, 635 F.2d at 1006; United States v. Bush, supra, 522 F.2d at 648 (city employee could be convicted of mail fraud for depriving city and its citizens of his honest and faithful services when such deprivation is combined with material misrepresentations and active concealment). An affirmative duty of disclosure need not be explicitly imposed, but may be implicit in the relationship between the parties. In Barta, this Court stressed that an employee's duty to disclose material information to his employer need not be the creation of a state or federal statute. On the contrary, the employment relationship itself may give rise to an obligation on the part of an employee not to conceal, and in fact to reveal information material to his employer's business. United States v. Barta, supra, at 1007. See also United States v. Bush, supra.\n\nIn this case, an affirmative duty to disclose could reasonably be inferred from the de facto employer-employee relationship Margiotta enjoyed with the municipal government. Margiotta regularly participated in the selection of persons for public positions in Nassau County. Having undertaken basic functions of government, he owed at least a duty to disclose material information or give notice of his conflict of interest to those in the government who relied upon him, just as an employee, under Barta, may owe his employer a duty to disclose material information. In addition to the evidence of non-disclosure of Margiotta's agreement with the Williams Agency, the Government presented evidence that Margiotta failed to disclose the corrupt arrangement during the State Investigation Commission's inquiries, during which he portrayed the artifice as an ordinary patronage practice. As a result, ample evidence supports a finding that Margiotta assumed an affirmative duty of disclosure, and breached it by his failure to disclose material information.\n\nD. Alleged First and Fourteenth Amendment limitations on the mail fraud conviction.\n\nMargiotta argues that the trial court's fiduciary doctrine impairs important rights of free expression and association, as well as the right to petition government to effect political or social change. He asserts that Judge Sifton's instructions apply to all persons influencing government. As a result, Margiotta argues, the trial court's construction of § 1341 brings within the statute's ambit \"the entire spectrum of political participation\" in governmental affairs, and thus criminalizes a substantial amount of constitutionally protected conduct. See Grayned v. Rockford, 408 U.S. 104, 114-15, 33 L. Ed. 2d 222, 92 S. Ct. 2294 (1972). Such overbroad regulation, Margiotta continues, carries the potential of significant chill arising from the likelihood of criminal prosecution. See Broadrick v. Oklahoma, 413 U.S. 601, 37 L. Ed. 2d 830, 93 S. Ct. 2908 (1973). Furthermore, according to the appellant, requiring a political party or its chairman to act as a \"disinterested fiduciary\" for the general citizenry abridges the cherished right of freedom of political association. See Citizens Against Rent Control/Coalition for Fair Housing v. Berkeley, 454 U.S. 290, 102 S. Ct. 434, 436, 70 L. Ed. 2d 492 (1981). Moreover, Margiotta alleges, the imposition of criminal liability pursuant to the district court's fiduciary doctrine eviscerates the right of petition by interfering with the efforts of political party leaders freely to lobby government officials on behalf of their supporters. See generally United Mine Workers v. Pennington, 381 U.S. 657, 670, 14 L. Ed. 2d 626, 85 S. Ct. 1585 (1965) (First Amendment protects concerted efforts to influence public officials).\n\nIf the indictment and prosecution of Margiotta for mail fraud on the basis of his breach of a fiduciary duty to the citizenry meaningfully implicated First Amendment interests, we would be loathe to approve such an application of the mail fraud statute. One of the essential purposes of the First Amendment is to protect the unfettered discussion of governmental affairs, see Mills v. Alabama, 384 U.S. 214, 218-19, 16 L. Ed. 2d 484, 86 S. Ct. 1434 (1966), and the activities of lobbyists and others who seek to exercise influence in the political process are basic in our democratic system. The First Amendment concerns raised by Margiotta, however, are a chimera. Count One of the indictment and the pertinent jury instructions do not address mere participation in the political process or protected conduct such as lobbying or party association. Rather than resting on a generalized breach of duty to render disinterested services on the part of one who participates in the political process in some unspecified way, the indictment and prosecution focused on whether Margiotta's corrupt agreement breached a fiduciary duty which Margiotta owed as a result of his significant role in the governance of Hempstead and Nassau County. Since the conduct charged in the Indictment was within the power of the United States Government to proscribe and there is no indication that the application of the mail fraud statute in this specific case would deter protected political activities in other contexts, the prosecution of Margiotta under Count One did not violate the First Amendment. See Broadrick v. Oklahoma, supra, 413 U.S. at 615. Moreover, there is simply no authority for the proposition that a conviction should be reversed and an indictment dismissed because the underlying \"theory\" of the case may be misused in other situations and misapplied to constitutionally protected conduct.\n\nEn passant, in response to Margiotta's contention that other political leaders are in jeopardy of prosecution, we believe his argument overlooks our narrow construction of the mail fraud statute. The necessity of meeting our restricted tests for the existence of a duty as a government fiduciary on the part of those who technically hold no public office precludes the use of § 1341 for dragnet prosecutions of party officials.\n\nWe need only briefly consider Margiotta's argument that the mail fraud statute is impermissibly vague both on its face and as applied to the facts of this case. Section 1341 has withstood repeated challenges which have raised the claim that it does not provide fair notice and warning of the conduct proscribed by the statute. See, e.g., United States v. Louderman, 576 F.2d 1383, 1388 (9th Cir.), cert. denied, 439 U.S. 896, 58 L. Ed. 2d 243, 99 S. Ct. 257 (1978). The broad language of the statute, intended by Congress to be sufficiently flexible to cover the wide range of fraudulent schemes mankind is capable of devising, is not unconstitutionally vague because § 1341 contains the requirement that the defendant must have acted willfully and with a specific intent to defraud. See Screws v. United States, 325 U.S. 91, 101-02, 89 L. Ed. 1495, 65 S. Ct. 1031 (1945); United States v. Manfredi, 488 F.2d 588, 602 (2d Cir. 1973), cert. denied sub nom., LaCosa v. United States, 417 U.S. 936, 94 S. Ct. 2651, 41 L. Ed. 2d 240 (1974). Judge Sifton appropriately charged the jury on this element of the offense. Moreover, Margiotta knew that the conduct reached was likely to be contrary to law, since he conceded at trial that a corrupt agreement pursuant to which he recommended the Williams Agency on the condition that the Agency kick back fifty percent of its commissions could be illegal. In light of the inclusion of payments to non-brokers in the scheme, the application of the mail fraud statute to his artifice should have come as no surprise. As a result, although he may not have anticipated the precise legal theory according to which the insurance ruse was deemed fraudulent, Margiotta was given fair warning that his activities could cause him to run afoul of the federal mail fraud statute.\n\nE. Material Information.\n\nMargiotta argues that he did not fail to disclose material information in violation of the mail fraud statute. Since the violation of an affirmative duty to disclose material information coupled with a breach of fiduciary duty violates § 1341, see United States v. Newman, supra, 664 F.2d at 19; United States v. Barta, supra, 635 F.2d at 1006, Margiotta claims that his conviction must be reversed because the information concerning the insurance scheme he allegedly failed to disclose was not material, for, as he asserts, any broker would not and could not reduce commissions. This assertion simply flies in the face of the evidence. The Williams Agency obviously was willing to work for less than the amount of the commissions paid by the municipalities, since it was relinquishing portions of the commissions as kickbacks to be distributed to Margiotta's political allies. If responsible officials in the Town and County had known of the secret deal, the concealment of which excluded potential bidders whose competition might have lowered the price to the public, the municipalities could have derived significant savings. Since the concealment of the insurance arrangement deprived the public of a potential\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e reduction in the costs of owning property, the information withheld by Margiotta was material. Accordingly, this case is unlike United States v. Ballard, 663 F.2d 534, 542 (5th Cir. 1981), in which the court decided that the information withheld by the alleged \"fiduciaries\" was not material on the ground that \"the price paid would have been unaffected by . . . disclosure.\"\n\nMoreover, Margiotta's reliance upon § 188 of the New York Insurance Law is misplaced. That section prohibits a broker from rebating any portion of his commission directly to the insured. New York Insurance Law § 188 (McKinney 1966). In this case, the issue is not whether a broker would have rebated a part of his commission to the insured, the municipality, but whether it was possible that the responsible officials could have found a broker who would have been willing to accept a lower commission. On appeal, Margiotta has conceded that \"a broker could theoretically agree to accept a lower commission,\" although he emphasizes that a witness, one Alfred Jaffee, testified at trial that a broker would not reduce its premium rate for only one municipality within a particular rate classification. On cross-examination, Jaffee admitted that a broker's commission could be reduced, and Richard A. Williams himself testified that on a few occasions, he reduced the commissions on policies written for the Town of Hempstead or Nassau County. Accordingly, the information concerning Margiotta's special arrangement appears to have been highly material.\n\nSince all of Margiotta's claims concerning the mail fraud count are without merit, we affirm the judgment of conviction of mail fraud in violation of 18 U.S.C. § 1341.\n\nIII. Hobbs Act Convictions.\n\nA. Extortion.\n\nMargiotta argues that his conviction under Counts Two through Six charging violations of the Hobbs Act, 18 U.S.C. § 1951, should be reversed and the indictment dismissed. Section 1951 proscribes various kinds of extortionate interference with interstate commerce, and defines \"extortion\" as \"the obtaining of property from another, with his consent, induced by wrongful use of actual or threatened force, violence, fear, or under color of official right.\" 18 U.S.C. § 1951(b) (2) (1976). Margiotta was charged with violating the Act by inducing the Williams Agency to make payments by means of wrongful use of \"fear,\" and alternatively, \"under color of official right.\" Judge Sifton instructed the jury that it could find Margiotta guilty if it decided that he had employed one of these two methods. We find no error infecting Margiotta's conviction on five counts of extortion.\n\nB. Extortion \"under color of official right.\"\n\nExtortion \"under color of official right\" is committed when a public official makes wrongful use of his office to obtain money not due him or his office. United States v. French, 628 F.2d 1069, 1072 (8th Cir.), cert. denied, 449 U.S. 956, 66 L. Ed. 2d 221, 101 S. Ct. 364 (1980); United States v. Trotta, 525 F.2d 1096, 1100 n.7 (2d Cir. 1975), cert. denied, 425 U.S. 971, 48 L. Ed. 2d 794, 96 S. Ct. 2167 (1976). The public officer's misuse of his office supplies the necessary element of coercion, and the wrongful use of official power need not be accompanied by actual or threatened force, violence, or fear. See United States v. Mazzei, supra, 521 F.2d at 644. The district court concluded that although Margiotta was not a public official, he could be found guilty of extortion \"under color of official right\" pursuant to 18 U.S.C. § 2(b), which provides:\n\n(b) Whoever willfully causes an act to be done which if directly performed by him or another would be an offense against the United States, is punishable as a principal.\n\nJudge Sifton charged the jury that if it determined \"that the defendant willfully and knowingly caused officials of the Town of Hempstead and County of Nassau under color of office to contribute in a substantial way to inducing the Williams Agency to consent to pay out the moneys . . . then the defendant is as responsible for the official action as if he was himself the public official concerned and had performed the action directly.\"\n\nMargiotta asserts that the district court erred in applying 18 U.S.C. § 2(b) to this case because it was not shown that Margiotta had caused a public official to commit extortion \"under color of official right\" in violation of the Hobbs Act and because the trial court's instructions were improper. We disagree, and conclude that the requirements of 18 U.S.C. § 2(b) were met. This section is based on the precept that an individual with the requisite criminal intent may be held liable as a principal if he is a cause in fact in the commission of a crime, notwithstanding that the proscribed conduct is achieved through the actions of innocent intermediaries.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e United States v. Kelner, 534 F.2d 1020, 1022 (2d Cir.), cert. denied, 429 U.S. 1022, 50 L. Ed. 2d 623, 97 S. Ct. 639 (1976). See also United States v. Giles, 300 U.S. 41, 48-49, 81 L. Ed. 493, 57 S. Ct. 340 (1937). It is unnecessary that the intermediary who commits the act have a criminal intent. United States v. Kelner, supra, 534 F.2d at 1023; United States v. Bryan, 483 F.2d 88, 92 (3rd Cir. 1973) (en banc). In causing the innocent intermediary to commit the challenged actions, the individual adopts both the intermediary's act and his capacity. See, e.g., United States v. Ruffin, 613 F.2d 408, 415 (2d Cir. 1979); United States v. Wiseman, 445 F.2d 792, 795 (2d Cir.), cert. denied, 404 U.S. 967, 30 L. Ed. 2d 287, 92 S. Ct. 346 (1971). Section 2(b) has been broadly interpreted to cover not only the voluntary acts of a defendant's agents, but also involuntary conduct on the part of his victims. See United States v. De Cavalcante, 440 F.2d 1264, 1268 (3rd Cir. 1971). These principles are consistent with Congressional intent. The House Report accompanying an earlier version of § 2(b) stated that one of the principal purposes of the section was to eliminate any doubt that an individual who \"causes the commission of an indispensable element of the offense by an innocent agent or instrumentality, is guilty as a principal,\" in accord with such judicial decisions as United States v. Giles, supra. H.Rep. No. 304, 80th Cong., 1st Sess. 2448-49 (1949). See generally United States v. Ruffin, supra, 613 F.2d at 412-16.\n\nIn light of these guidelines, Margiotta could be found guilty of extortion pursuant to 18 U.S.C. § 2(b). One of the indispensable elements in the extortion kickbacks from the Williams Agency was the official act of Ralph Caso and other public officials of Nassau County and the Town of Hempstead in appointing and retaining the Williams Agency as Broker of Record. Had that conduct, which the jury could reasonably find from the evidence was caused by Margiotta, never occurred, the Williams Agency would not have been in a position to make the challenged payments. If the public officials were aware that the Agency was making the kickbacks at the direction of Margiotta as a result of their exercise of official power in designating and retaining the Agency as Broker, the public officials could have been found guilty of extortion as principals, for unlawfully obtaining the consent to the payments under color of official right. See, e.g., United States v. Butler, 618 F.2d 411 (6th Cir.), cert. denied, 447 U.S. 927, 65 L. Ed. 2d 1121, 100 S. Ct. 3024 (1980); United States v. Trotta, supra. In light of Ralph Caso's testimony that he was unaware of any commission sharing by the Williams Agency and the absence of proof, or contention by the Government, that Caso was party to the secret understandings concerning the designation of the Agency as Broker of Record for Town and County, it is likely that the public officials could not be found guilty of a Hobbs Act violation under color of official right, since it could not be established they were aware that Margiotta had caused them to exercise their power in a manner which induced the Williams Agency to make the kickbacks. Nonetheless, the defendant who caused them to act in this way is viewed as having \"adopt[ed] not only [their] act but [their] capacity\" as well. United States v. Ruffin, supra, 613 F.2d at 415. See also United States v. Wiseman, supra, (defendants, who were private process servers, could be found guilty of 18 U.S.C. § 242, which prohibits those acting \"under color of any law\" from depriving citizens of their civil rights, by operation of 18 U.S.C. § 2(b), where the defendants had caused a state employee, the Clerk of the New York City Civil Court, to enter judgments against third persons, although the Clerk did not know that the judgments were fraudulently obtained); United States v. Lester, 363 F.2d 68 (6th Cir. 1966), cert. denied, 385 U.S. 1002, 17 L. Ed. 2d 542, 87 S. Ct. 705 (1967). Since Margiotta could reasonably be found to have caused a public official to commit the act necessary for inducing the Agency's consent to make the kickback payments, he could be convicted of extortion pursuant to the provisions of 18 U.S.C. § 2(b), even though the public official may have been a mere innocent intermediary, and did not participate in all aspects of the extortionate enterprise that is the subject matter of the criminal offense. See United States v. Wiseman, supra. These principles were reflected in Judge Sifton's careful jury instruction, that the jury would have to find that Margiotta had \"caused officials of the Town of Hempstead and Nassau County under color of office to contribute in a substantial way to inducing the Williams Agency to consent to pay out the monies referred to in Counts Two through Six.\"\n\nIn short, the jury could reasonably find that Margiotta had caused public officials in Hempstead and Nassau County to appoint and retain the Williams Agency as Broker of Record, a prerequisite step in the process of extorting insurance payments. The insurance commissions simply could not have been generated but for this official action. Moreover, this conclusion is not undercut by Margiotta's other arguments in support of his claim that he could not be found guilty of obtaining money under color of official right pursuant to 18 U.S.C. § 2(b). His contention that there is no proof that the Presiding Supervisor of the Town of Hempstead or the Nassau County Executive attempted to induce the Williams Agency to make the payments or that the Agency was motivated to make the kickbacks as a result of \"the assertion of pressure\" by the public officials is unavailing. Affirmative pressure in the form of force, fear, or direct solicitation of money may transform an official's act into a violation of the Hobbs Act, but it is the utilization of the power of public office to induce consent to the payments that is the gist of an offense of obtaining money \"under color of official right.\" See, e.g., United States v. Jannotti, 673 F.2d 578 (3rd Cir.) (Hobbs Act covers actions by public officials under color of official right even when payment is not obtained by force, threats or use of force), cert. denied, 457 U.S. 1106, 102 S. Ct. 2906, 73 L. Ed. 2d 1315, 50 U.S.L.W. 3963 (1982). The use of public office, with the authority to grant or withhold benefits, takes the place of pressure or threats. In this case, the appointment and retention of the Agency as Broker of Record thus satisfies the requirement of a use of public office or action \"under color of official right.\" Moreover, it is clear that the victim's \"motivation for the payment\" of portions of the insurance commissions focused on the public officials' power of office. United States v. Braasch, 505 F.2d 139, 151 (7th Cir. 1974), cert. denied, 421 U.S. 910, 95 S. Ct. 1561, 43 L. Ed. 2d 775 (1975). It is reasonable to conclude that the Williams Agency consented substantially for the reason that the positions held by the public officials, who were controlled by Margiotta, gave the officials the power to choose another as Broker of Record if the Agency did not consent to the payments. See United States v. Hedman, 630 F.2d 1184, 1194 n.4 (7th Cir. 1980), cert. denied, 450 U.S. 965, 67 L. Ed. 2d 614, 101 S. Ct. 1481 (1981).\n\nFurthermore, it is not necessary to support a Hobbs Act charge by showing that a public official offer a quid pro quo in the form of some specific exercise of the powers of his office or a forbearance to carry out a duty; a public official may be guilty of obtaining money under color of official right if the payments are motivated as a result of his exercise of the powers of his public office and he is aware of this fact. United States v. Trotta, supra, 525 F.2d at 1100. While the lack of awareness on the part of the public officials may have relieved them of criminal liability for extortion under color of official right, it does not relieve Margiotta of criminal responsibility, for, pursuant to 18 U.S.C. § 2(b), he could be found guilty of having caused the public officials unknowingly to use their power of office in such a manner that would induce the payments. See United States v. Wiseman, supra. In addition, Margiotta may not seek refuge in the claim that Ralph Caso and the other public officials were not themselves the recipients directly or indirectly of payments by the Williams Agency, and therefore did not make \"wrongful use of [public office] to gain personal financial reward.\" United States v. Butler, supra, 618 F.2d at 419. A Hobbs Act prosecution may lie where the extorted payments are transferred to third parties, including political allies and political parties, rather than to the public official who has acted under color of official right. See United States v. Trotta, supra, 525 F.2d at 1098 n.2. Finally, the focus of the prosecution on the actions of Margiotta in causing public officials unknowingly to use their power in such a way as to induce the Williams Agency to make kickbacks to Margiotta's political allies and the carefully drawn instructions of the district court ensured that Margiotta's prosecution under the Hobbs Act did not draw within its ambit conduct that has traditionally been viewed as legitimate lobbying and political activity. Since Judge Sifton specifically charged that Margiotta could be convicted only if the jury found that he had acted with the requisite criminal intent, the application of the Hobbs Act's proscription of extortion \"under color of official right\" by operation of 18 U.S.C. § 2(b) in this case does not open a Pandora's box of liability in connection with lobbying or other legitimate political activities.\n\nC. Extortion through wrongful use of \"fear.\"\n\nAs noted above, Judge Sifton alternatively instructed the jury that it could find Margiotta had violated the Hobbs Act by extortion through wrongful use of fear. Margiotta claims that the evidence was insufficient as a matter of law to establish that the payments made by the Williams Agency were induced by the wrongful use of fear. In light of the overwhelming evidence that the principals of the Williams Agency understood the Agency would lose its position as Broker of Record for Town and County if it ceased making the payments specified in Counts Two through Six, Margiotta's claim is plainly without merit.\n\nRichard A. Williams first testified about his state of mind when he was called as a witness before the New York State Investigation Commission. When asked what would happen if he did not make the payments to other insurance brokers, Williams responded that he believed the municipal insurance business would be distributed to someone else, and that he would be \"excluded.\" Williams's testimony at trial concerning his state of mind in making the challenged payments was generally consistent with this prior testimony, and was sufficient for a reasonable jury to find that the principals of the Williams Agency had reasonably been induced to fear that the Agency's participation as Broker of Record would be terminated if it did not make the payments in accordance with Margiotta's directions. See, e.g., United States v. Brown, 540 F.2d 364, 373 n.6 (8th Cir. 1976); United States v. Provenzano, 334 F.2d 678, 687 (3rd Cir.), cert. denied, 379 U.S. 947, 13 L. Ed. 2d 544, 85 S. Ct. 440 (1964). Proof that the Williamses' fear was reasonable includes Margiotta's own statement that he would convene a meeting of the Executive Committee of the Republican Party in the event that the Agency ceased making payments. Moreover, putting the victim in fear of economic loss can satisfy the element of fear required by the Hobbs Act. See United States v. Brecht, 540 F.2d 45, 52 (2d Cir. 1976), cert. denied, 429 U.S. 1123, 51 L. Ed. 2d 573, 97 S. Ct. 1160 (1977). Since the parties to the agreement understood this would be the result, Margiotta was able to exploit the fear of the brokers and thereby wrongfully obtain portions of their insurance commissions with their \"consent.\" See United States v. Furey, 491 F. Supp. 1048, 1061 (E.D.Pa.), aff'd without opinion, 636 F.2d 1211 (3rd Cir. 1980), cert. denied, 451 U.S. 913, 101 S. Ct. 1987, 68 L. Ed. 2d 304 (1981). That the Agency concealed its practice of reducing the amount of kickbacks as the size of the commissions increased corroborates the finding that the Agency feared the loss of the municipal insurance business if Margiotta learned that the Agency was reneging on the secret deal to divide the commissions on a \"50-50 basis.\"\n\nWe note that the evidence is particularly compelling as to Count Three which charged extortion in connection with the payments to William and Neil Cahn, and Count Five, which set forth a Hobbs Act violation arising from payments to former Assemblyman Reilly. Margiotta directed a series of monthly payments in the amount of $2,000 to attorneys William Cahn and his son, as an alleged legal retainer by the Williams Agency. Margiotta admitted that payments to lawyers were not part of any prior patronage system. Moreover, on several occasions, Richard A. Williams approached Margiotta to determine whether the Agency could stop making payments to Cahn. In 1976, Williams asked Margiotta if the Agency should continue to make the payments, and Margiotta responded in the affirmative. Later, in 1978, after continuing to pay the monthly $2,000 kickbacks, Williams again sought Margiotta's permission to halt the payments. Although Margiotta initially agreed, Cahn appealed to Margiotta, and Williams was directed to commence making the payments again. After Williams's third request, in 1979, Margiotta gave his permission to cease making payments to the Cahns. At trial, Margiotta admitted that his recommendation was relevant to Williams's decision to continue to make the monthly payments. Although Williams testified that he had a high opinion of Neil Cahn's legal abilities, he stated that the work done by William Cahn for the Williams Agency was \"insubstantial.\" Accordingly, ample evidence supports the inference that the Cahn payments were induced by a reasonable fear stemming from Margiotta's power to ensure the Williams Agency would suffer adverse consequences if it did not follow his directions.\n\nCount Five was based upon a series of payments totalling approximately $50,000 to Assemblyman Reilly in 1979 and 1980, after Margiotta allegedly terminated the practice upon which he and Williams had agreed many years earlier. In 1978, according to Margiotta himself, he met with Williams to determine whether Williams \"could see his way clear\" to continue Reilly as an employee at a salary of $25,000 each year. During the several years Reilly was paid by the Agency, he performed no meaningful work, and generated only a few hundred dollars in commissions. Williams testified that he understood the Agency could lose the municipal insurance business if the Agency did not continue to make the payments to Reilly.\n\nIn light of this evidence, the jury could reasonably find that the principals of the Williams Agency were induced to make the payments by the fear they would lose their position of Broker of Record if they did not comply with Margiotta's instructions. The jury could properly disbelieve Williams's isolated answer of \"no\" in response to a question whether he had \"any state of mind of fear at the time [he] made any of these payments,\" and that, instead, he distributed portions of the commissions earned by the Agency because he understood that he had \"to live up to\" a verbal contract between the elder Williams and Margiotta. In his testimony, Williams repeatedly made clear his belief that the Agency would have lost the municipal insurance commissions if it had breached its secret agreement with Margiotta. Moreover, the jury could reasonably infer that Williams did not believe he was carrying out a \"valid contract\" from the evidence of Williams's participation in the creation of fictitious property inspection reports, his dissembling testimony before the New York State Investigation Commission, and the decision to reduce the portions of the commissions distributed from the agreed upon fifty percent. Cf. United States v. Barber, 668 F.2d 778, 783 n.2 (4th Cir. 1982) (falsification of documents amply supports inference that donations were compelled, not voluntary, campaign contributions).\n\nFurthermore, there is no merit to Margiotta's claim that he could not have induced the Williams Agency to consent to the payments through the wrongful use of fear because the Williams Agency initially approached him to secure the positions of Broker of Record for Hempstead and Nassau County and therefore was a \"willing collaborator.\" See United States v. Rabbitt, 583 F.2d 1014, 1027 (8th Cir. 1978), cert. denied, 439 U.S. 1116, 59 L. Ed. 2d 75, 99 S. Ct. 1022 (1979). Margiotta relies upon dictum in United States v. Brecht, supra, 540 F.2d at 51, in which the court stated that extortion under the Hobbs act \"involves initiative on the part of the defendant and coercion on the part of the victim.\" The court made this statement for the purpose of distinguishing bribery and extortion, not for the purpose of holding that a defendant cannot be guilty of extortion when the victim has taken the initiative, even if the victim was induced by fear to make the initial approach. We believe extortion under the Hobbs Act encompasses just such a situation, and well-reasoned precedent confirms our view. See United States v. Duhon, 565 F.2d 345, 351 (5th Cir.) (agreement of putative victims to offer union leaders money to remove pickets prior to meeting with the union leaders does not preclude a finding that the defendants intended to obtain money from the victims through wrongful use of fear; \"the extortionist need not explicitly demand property before it is offered\"), cert. denied, 435 U.S. 952, 55 L. Ed. 2d 802, 98 S. Ct. 1580 (1978); United States v. Hathaway, 534 F.2d 386 (1st Cir.) (although the victim may have initiated the subject of payments, the jury could find that such approach arose from a reasonable fear that without paying he would not be considered by the authority), cert. denied sub nom., Baptista v. United States, 429 U.S. 819, 50 L. Ed. 2d 79, 97 S. Ct. 64 (1976). In this case, the elder Williams was aware that kickbacks were essential for the Williams Agency to secure and retain the position of Broker of Record. Indeed, \"prior practice\" was Margiotta's principal defense to the charge of mail fraud in Count One. Moreover, Margiotta acknowledged that the Williams Agency faced the prospect of losing the municipal insurance business if it ceased making the payments. The jury could reasonably find that in this atmosphere of coercion, the Williams Agency labored under a well-founded fear that without agreeing to pay, and continuing to pay once appointed Broker, it would not be considered by the \"authority\" representing the Town and County: Joseph Margiotta. In short, as appellant's counsel stated at oral argument, the elder Williams agreed to the secret kickback arrangement because he was \"doing what he had to do to get the business.\" Accordingly, the evidence is sufficient to support a finding that Margiotta was guilty of extortion in violation of 18 U.S.C. § 1951 through the wrongful use of \"fear.\"\n\nSince the jury could properly have found Margiotta guilty on Counts Two through Six either by a theory of extortion under color of official right or by a theory of extortion through the wrongful use of fear, both of which were included by Judge Sifton in his jury instructions, it is not necessary to consider Margiotta's argument that reversal of the jury's verdict is required unless both were correct as a matter of law and supported by the record. See United States v. Ballard, 663 F.2d 534 (5th Cir. 1981). Moreover, the district court's instructions on the mail fraud count, which we believe were correct in all respects, did not prejudice the jury's consideration of the extortion charges in Counts Two through Six. Margiotta argues that Judge Sifton, in charging on the mail fraud count, instructed the jury that Margiotta was essentially a public official with a public official's fiduciary duty to render honest and loyal services to the general citizenry, and that this impaired his defense that he was not acting \"under color of official right,\" under the Hobbs Act. This claim is without merit. Judge Sifton's charge on Count One did not state that Margiotta was essentially a public official. Moreover, in its instructions on Counts Two through Six, the district court explained that Margiotta was not a public official and the liability on the Hobbs Act counts could only be based on 18 U.S.C. § 2(b).\n\nIV. Admission of Williams's hearsay statements.\n\nMargiotta's final claim is that the trial court erred by admitting into evidence Richard A. Williams's hearsay account of his father's alleged agreement with Margiotta. Since the alleged secret agreement was forged at a 1969 meeting attended by the elder Williams, now deceased, Margiotta and Weis, the Government sought to prove the existence of this agreement in large part through the testimony of the younger Williams, who had waited outside the meeting room. At trial, the district court permitted Williams to describe his father's (the declarant's) purported account of the agreement reached at the meeting, over objection by Margiotta's counsel. Williams first recounted his father's plan to offer fifty percent of the Williams Agency's commissions to Margiotta if the latter secured the Town of Hempstead's insurance business for Williams. Judge Sifton admitted this hearsay testimony pursuant to the \"state of mind\" exception to the hearsay rule, Federal Rules of Evidence, Rule 803(3),\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e as a statement of the decedent's \"design\" or \"plan.\" See also United States v. Annunziato, 293 F.2d 373, 377 (2d Cir.), cert. denied, 368 U.S. 919, 7 L. Ed. 2d 134, 82 S. Ct. 240 (1961). Margiotta asserts, however, that the district court improperly admitted Williams's testimony that his father reported to him that an agreement had been reached concerning the municipal insurance business. Since the statement was offered to prove that Margiotta had engaged in a past act, the formation of an unlawful secret agreement, the state of mind exception of Fed. R. Evid. 803(3) was not available. Instead, Judge Sifton admitted this testimony on the co-conspirator exception to the hearsay rule, Fed. R. Evid. 801(d)(2)(E), which provides that \"a statement by a co-conspirator of a party during the course and in furtherance of the conspiracy\" is not hearsay. We believe Judge Sifton did not commit error.\n\nThe law is well-settled that declarations that are otherwise hearsay may nonetheless be provisionally admitted pursuant to Rule 801(d) (2) (E), subject of course to ultimate connection of the defendant with the conspiracy alleged in the indictment, if the trial court determines that the defendant and the declarant participated in the conspiracy, by a fair preponderance of the evidence independent of the hearsay utterances. See, e.g., United States v. Cambindo-Valencia, 609 F.2d 603, 630 (2d Cir. 1979), cert. denied, 446 U.S. 940, 100 S. Ct. 2163, 64 L. Ed. 2d 795 (1980); United States v. Geaney, 417 F.2d 1116, 1120 (2d Cir. 1969), cert. denied, 397 U.S. 1028, 90 S. Ct. 1276, 25 L. Ed. 2d 539 (1970). In this case, sufficient evidence independent of the challenged hearsay statements established that a conspiracy existed, that it was in existence at the time the statement was made, that the declarations were made in furtherance of the conspiracy, and that both the elder Williams and Margiotta participated in the conspiracy. See, e.g., United States v. Lyles, 593 F.2d 182, 194 (2d Cir.), cert. denied, 440 U.S. 972, 59 L. Ed. 2d 789, 99 S. Ct. 1537 (1979); United States v. Cafaro, 455 F.2d 323, 326 (2d Cir.), cert. denied sub nom., Schulman v. United States, 406 U.S. 918, 32 L. Ed. 2d 117, 92 S. Ct. 1769 (1972). This evidence includes Margiotta's own admissions concerning his approach by, and meeting with Richard B. Williams. Margiotta testified that during the meeting, Williams stated that he would \"continue\" the \"system\" carried on by Mortimer Weis, the Broker of Record for Hempstead at that time. Moreover, Margiotta testified that if the Williams Agency should ever have ceased distributing portions of its commissions, he would have convened a meeting of the Executive Committee of the Republican Party, and would have \"probably\" voted to replace Williams. Margiotta stated that he never told Ralph Caso, or other public officials, about the arrangement to share commissions on a \"50-50 basis.\"\n\nFurthermore, the non-hearsay evidence showed that as soon as the Williams Agency obtained the Town's insurance business following its designation as Broker of Record, the Agency, which had been sharing approximately ten percent of the commissions generated by placement of policies on properties owned by the Town of Oyster Bay, began setting aside fifty percent of the commissions earned. This evidence included ledger sheets dating from 1969 which contained a column labelled \"50% of commissions,\" and a list of recipients sent by Margiotta's office to the Williams Agency designating amounts which totalled exactly 50% of the amount of the commissions shown on the ledger sheet as of the date of that list. The Williams Agency paid 50% of the commissions to the persons whose names appeared on the list. Indeed, ample evidence also supported a finding that Margiotta and Williams understood that their illicit arrangement should remain secret. In addition to Margiotta's admission that he did not disclose the terms of the arrangement to Ralph Caso or other officials, the recipients of the kickbacks were ultimately directed to assist in the creation of falsified property inspection reports to make it appear they had performed work in exchange for the money they received. In the case of William Cahn, the parties to the agreement devised an arrangement of a legal retainer. Moreover, as noted above, numerous individuals associated with the municipal insurance scheme provided dissembling testimony to the State Investigation Commission. In short, the non-hearsay evidence was sufficient to show that a conspiracy existed, that it was in existence at the time the statement was made, and that both Williams and Margiotta participated in the agreement. Furthermore, since the parties to the agreement desired to keep the terms of the pact secret, and Richard A. Williams would necessarily participate in the distribution of insurance commissions, the elder Williams's declaration to his son can reasonably be considered to have been made \"in furtherance of\" the conspiracy. See United States v. Lyles, supra, 593 F.2d at 194.\n\nMargiotta claims that despite this evidence, the trial court erred in admitting the challenged hearsay statements because it did not explicitly make the findings articulated in United States v. Geaney, supra, and its progeny. This Court has never required a district court to use any talismanic words when admitting testimony under the co-conspirator exception to the hearsay rule. In United States v. Cambindo-Valencia, supra, 609 F.2d at 631, appellant Cambindo-Valencia argued that the trial judge failed to make an explicit finding of sufficient independent evidence. This Court rejected his claim as a ground of reversible error, noting that it was possible to \"infer that the finding was made implicitly when the court admitted the statements over the defense's objections.\" Id. In light of Judge Sifton's familiarity with this evidence after the completion of the first trial, this inference seems especially warranted on the facts of this case. See also United States v. Rosenstein, 474 F.2d 705, 711-12 (2d Cir. 1973).\n\nIn any event, in explaining the admission of Richard A. Williams's hearsay account of his father's secret agreement, Judge Sifton observed that there was \"a fairly substantial showing that at least as an initial matter there was a starting point of 50/50,\" and that there was \"a sufficient basis\" for inferring that there was \"some agreed upon arrangement made in advance.\" Such language makes clear that Judge Sifton made the requisite Geaney findings, if not in haec verba. Finally, in stating that there was a sufficient basis to present Williams's testimony to the jury \"for them to decide whether to accept\" it or not, Judge Sifton was not permitting the jury to decide whether the co-conspirator exception was available. Rather, he was merely noting that once the hearsay account was admitted, the jury could accept or reject the testimony. As a result, the district court did not violate the principle that determining the admissibility of challenged testimony is a function for the court, not the jury. See United States v. Rosenstein, supra, 474 F.2d at 712. For all these reasons, the district court did not err in admitting Richard A. Williams's hearsay account of his father's statements.\n\nV. Conclusion.\n\nSince our unravelling of the tangled skein of Margiotta's fraudulent artifice and analysis of his claims has taken us on a lengthy journey, we briefly set forth our conclusions. While the line between legitimate political patronage and fraud on the public has always been difficult to draw, we believe that the application of the mail fraud statute is permissible on the facts of this case. In the context of a mail fraud prosecution, we reject a per se rule precluding, as a matter of law, the finding of a fiduciary duty to the citizenry to render honest and faithful services on the part of individuals who technically hold no official public office yet participate substantially in the governance of communities. We hold that as an individual who was a de facto leader of government and who was relied upon by individuals in government for the administration of governmental affairs, Margiotta could properly be found to owe a fiduciary duty to the general citizenry of Hempstead and Nassau County, the breach of which duty could lay the predicate for a violation of the mail fraud statute. Moreover, the evidence was sufficient to support a finding that Margiotta assumed a fiduciary duty to disclose his secret agreement. Properly circumscribed as it was here, the indictment and prosecution of Margiotta for mail fraud did not violate his First Amendment rights of freedom of expression, association and petition, and we reject his claim that § 1341 is impermissibly vague on its face or as applied to the facts of the instant case. In addition, ample evidence supports the finding that Margiotta failed to disclose material information in violation of the mail fraud statute.\n\nAddressing ourselves to the Hobbs Act convictions, we hold that Margiotta, having caused public officials to take actions which induced the consent of the Williams Agency to make the payments, could reasonably be found to have met the requirements of 18 U.S.C. § 2(b). As a result we conclude that the Government satisfied all the elements for convicting Margiotta of extortion \"under color of official right.\" Moreover, the evidence was sufficient to support a verdict that the appellant had committed extortion through wrongful use of \"fear.\" Finally, the trial court properly admitted Richard A. Williams's hearsay account of his father's statements concerning the secret agreement.\n\nAccordingly, the judgment of conviction is affirmed in all respects.\n\nDisposition\n\nAffirmed\n\nWINTER, Circuit Judge (concurring in part and dissenting in part):\n\nWhile I do not agree in every particular with the majority's analysis of the conviction rendered under the Hobbs Act, I concur in the result. Margiotta was not the instrument of a party organization executing well understood patronage practices but instead exercised personal discretion in each case as to the recipients of kickbacks, including payments to himself. This, I believe, is sufficient to characterize the entire kickback scheme as extortionate.\n\nI dissent, however, as to the mail fraud count. The majority's use of mail fraud as a catch-all prohibition of political disingenuousness expands that legislation beyond any colorable claim of Congressional intent and creates a real danger of prosecutorial abuse for partisan political purposes.\n\nI\n\nIt should be emphasized at the outset that, while a kickback scheme\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e is relevant to Margiotta's conviction for mail fraud, it is not essential. Nor is the government required to prove any loss whatsoever to taxpayers or a violation of New York law. Reduced to essentials, the majority holds that a mail fraud conviction will be upheld when a politically active person is found by a jury to have assumed a duty to disclose material facts to the general citizenry and deliberately failed to do so. Margiotta's conviction is based upon his failure as a partisan political leader with great influence to disclose to the citizens of the Town of Hempstead and Nassau County his knowledge that the Williams Agency would have been willing to act as Broker of Record for considerably smaller commissions than were actually paid. Because those citizens might have compelled the municipalities to reduce these costs had they been given this information, it is a material fact.\n\nThe kickback scheme is relevant to Margiotta's conviction because it proves (i) that the Williams Agency would have been willing to procure insurance for commissions considerably smaller than those actually paid and (ii) that Margiotta knew it. Had Margiotta secured Williams' appointment because of past political support knowing that the size of the commissions far exceeded the value of services to be performed, the fraud would have been as complete. Moreover, Judge Sifton charged, and the majority agrees, that the government need not prove that actual savings to taxpayers would have resulted from disclosure. Finally, although Margiotta is a local partisan political leader and the scheme involves municipal funds, no violation of state or local law\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e is necessary to support the federal mail fraud conviction since a jury is free to find a federal duty to disclose material facts.\n\nThe majority pays lip service to construing the criminal law against the government but then gives the mail fraud statute a more sweeping interpretation than any court which has addressed the statute to date. Given that this statute has occasioned a number of courts to comment apprehensively in the past about its steady expansion,\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e that is no mean feat.\n\nThe indictment itself demonstrates the scope of the theory underlying Margiotta's conviction. It charged him with defrauding the State, the Town of Hempstead and Nassau County and their citizens (i) \"of the right to have [their] affairs . . . conducted honestly, impartially, free from bribery, corruption, fraud, dishonesty, bias, and deceit\" and (ii) \"of the honest and faithful participation of [Margiotta] in [their] affairs.\" Given this sweeping charge and the majority opinion, no amount of rhetoric seeking to limit the holding to the facts of this case can conceal that there is no end to the common political practices which may now be swept within the ambit of mail fraud. Since the doctrine adopted by the majority applies to candidates as well as those holding office, United States v. States, 488 F.2d 761 (8th Cir. 1973), cert. denied, 417 U.S. 909, 94 S. Ct. 2605, 41 L. Ed. 2d 212 (1974), a candidate who mails a brochure containing a promise which the candidate knows cannot be carried out is surely committing an even more direct mail fraud than what Margiotta did here. An elected official who for political purposes performs an act imposing unnecessary costs on taxpayers is guilty of mail fraud if disclosure is not made to the public. A partisan political leader who throws decisive support behind a candidate known to the leader to be less qualified than his or her opponent because that candidate is more cooperative with the party organization, is guilty of mail fraud unless that motive is disclosed to the public. A partisan political leader who causes elected officials to fail to modernize government to retain jobs for the party faithful is guilty of mail fraud unless that fact is disclosed. In each of these cases the undisclosed fact is as \"material\" as the facts which Margiotta failed to disclose, the harm to the public is at least as substantial as the harm resulting from Margiotta's scheme, and the dishonesty, partiality, bias and deceit in failing to disclose those facts is equally present. This is not to say that Margiotta's conduct as a whole is not more odious than the conduct described in these hypotheticals. That is not the issue. The point is that the actions taken by Margiotta deemed relevant to mail fraud by the majority are present in each case: a relationship calling for disclosure, a material fact known to the candidate, official or party leader, and a failure to disclose it.\n\nThe majority is quite simply wrong in brushing aside the First Amendment issues. The theory they adopt subjects politically active persons to criminal sanctions based solely upon what they say or do not say in their discussions of public affairs. The majority explicitly bottoms Margiotta's mail fraud conviction on his failure to say something. Its logic would easily extend to the content of campaign literature. Indeed, it takes no great foresight to envision an indictment framed on the theory adopted by the majority and alleging mail fraud based on public speeches.\n\nII\n\nMy brethren are not striking out on their own in pushing the mail fraud statute to limits far exceeding any Congressional intent.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e To the contrary, much of what they say has substantial and direct precedent. For example, the statutory proscriptions are not limited to common law fraud or deceit but extend to dishonest schemes generally. United States v. Barta, 635 F.2d 999, 1005-06 (2d Cir. 1980), cert. denied, 450 U.S. 998, 68 L. Ed. 2d 199, 101 S. Ct. 1703 (1981). It also seems well established that dishonest actions by an employee which violate the employee's fiduciary obligations to an employer can be a basis for a mail fraud conviction. United States v. George, 477 F.2d 508, 512-14 (7th Cir.), cert. denied, 414 U.S. 827, 94 S. Ct. 49, 38 L. Ed. 2d 61 (1973). Moreover, loss or concrete harm need not be shown beyond the fact that the employer was deprived of information which might have affected his or her judgment. Barta, supra.\n\nOne can, with seeming logic, move from those propositions to the proposition that a person holding governmental employment is bound by the same standards. United States v. Bush, 522 F.2d 641, 646-49 (7th Cir. 1975), cert. denied, 424 U.S. 977, 47 L. Ed. 2d 748, 96 S. Ct. 1484 (1976); United States v. Brown, 540 F.2d 364, 374 (8th Cir. 1976); United States v. DelToro, 513 F.2d 656 (2d Cir.), cert. denied, 423 U.S. 826, 96 S. Ct. 41, 46 L. Ed. 2d 42 (1975). From that it seems a small leap to apply these principles to those who hold elective as well as appointed office. United States v. Mandel, 591 F.2d 1347 (4th Cir. 1979), cert. denied, 445 U.S. 961, 64 L. Ed. 2d 236, 100 S. Ct. 1647 (1980); United States v. Isaacs, 493 F.2d 1124 (7th Cir.), cert. denied, 417 U.S. 976, 94 S. Ct. 3183, 41 L. Ed. 2d 1146 (1974). We then arrive at a rule that elected officials have a duty to disclose material facts concerning their conduct of public affairs. Any official who fails to disclose such facts is guilty of mail fraud without regard to whether actual loss occurred or to whether local law was violated.\n\nMuch of what the majority says thus has direct precedential support. They add only one seemingly small element to these precedents: a jury may find that a politically active person has sufficient influence and power over the acts of elective officials to be subjected to the same duty as those officials so far as those acts are concerned. The failure of such a person to disclose material information to the public can thus constitute mail fraud.\n\nHowever logical this growth of the law may seem, it leads to a result which is not only greater than, but is roughly the square of, the sum of the parts. The proposition that any person active in political affairs who fails to disclose a fact material to that participation to the public is guilty of mail fraud finds not the slightest basis in Congressional intent, statutory language or common canons of statutory interpretation. This wholly impermissible result is brought about, I believe, by drawing an erroneous analogy between fiduciary relationships involving private parties based on express or implied contract and relationships between politically active persons and the general citizenry in a pluralistic, partisan, political system.\n\nMr. Justice Frankfurter quite appropriately underlined the fact that\n\nto say that a man is a fiduciary only begins an analysis; it gives direction to further inquiry. To whom is he a fiduciary? What obligations does he owe as a fiduciary? In what respect has he failed to discharge these obligations? And what are the consequences of his deviation from duty?\n\nSecurities and Exchange Commission v. Chenery Corp., 318 U.S. 80, 85-86, 87 L. Ed. 626, 63 S. Ct. 454 (1943). The words fiduciary duty are no more than a legal conclusion and the legal obligations actually imposed under that label vary greatly from relationship to relationship. Nevertheless, because fiduciary relationships in the private sector have been the subject of centuries of common law development, there is a considerable body of law based on implied or express contract governing whether particular behavior is legal. Its most notable feature, however, is the degree to which fiduciary obligations vary from relationship to relationship. Partners, employees, trustees and corporate directors are all fiduciaries, yet their legal obligations may be wholly dissimilar. While an hourly employee usually may quit a job without fearing legal action even though he leaves at a time which makes it difficult for the employer to continue business, a trustee may not so easily abandon his beneficiaries. While a trustee's actions are void or voidable if tainted by a conflict of interest, the corporate officer generally can act even if he is personally interested so long as the action is fair to the corporation.\n\nTo transfer this complex, variable body of law to the political context, simply by mouthing the word fiduciary, makes the very mistake underlined by Mr. Justice Frankfurter in Chenery. Although the courts have, with precious little analysis, brought virtually all participants in government and politics under the rubric fiduciary, the obligations imposed are wholly the creation of recent interpretations of the mail fraud statute itself. A reading of the cases in this area, however, shows how little definition there is to these newly created obligations which carry criminal sanctions. For all one can find in the case law, no distinction is made between the fiduciary obligations of a civil servant, political appointee, elected official, candidate or partisan political leader. Juries are simply left free to apply a legal standard which amounts to little more than the rhetoric of sixth grade civics classes. One searches in vain for even the vaguest contours of the legal obligations created beyond the obligation to conduct governmental affairs \"honestly\" or \"impartially,\" to ensure one's \"honest and faithful participation\" in government and to obey \"accepted standards of moral uprightness, fundamental honesty, fair play and right dealing.\" Mandel, 591 F.2d at 1361. The present case is no exception. While there is talk of a line between legitimate patronage and mail fraud, there is no description of its location. With all due respect to the majority, the quest for legal standards is not furthered by reference to \"the right to good government\" and the duty \"to act in a disinterested manner.\"\n\nOf course, we should all hope that public affairs are conducted honestly and on behalf of the entire citizenry. Nevertheless, we should recognize that a pluralistic political system assumes politically active persons will pursue power and self-interest. Participation in the political process is not limited to the pure of heart. Quite frankly, I shudder at the prospect of partisan political activists being indicted for failing to act \"impartially\" in influencing governmental acts.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Where a statute, particularly a criminal statute, does not regulate specific behavior, enforcement of inchoate obligations should be by political rather than criminal sanctions. Where Congress has not passed legislation specifying particular acts by the politically active as criminal, our reliance rather should be on public debate, a free press and an alert electorate. In a pluralistic system organized on partisan lines, it is dangerous to require persons exercising political influence to make the kind of disclosure required in public offerings by the securities laws.\n\nIII\n\nMy concerns in this case thus extend far beyond a disagreement over statutory interpretation. The limitless expansion of the mail fraud statute subjects virtually every active participant in the political process to potential criminal investigation and prosecution. It may be a disagreeable fact but it is nevertheless a fact that political opponents not infrequently exchange charges of \"corruption,\" \"bias,\" \"dishonesty,\" or deviation from \"accepted standards of . . . fair play and right dealing.\" Every such accusation is now potentially translatable into a federal indictment. I am not predicting the imminent arrival of the totalitarian night or the wholesale indictment of candidates, public officials and party leaders. To the contrary, what profoundly troubles me is the potential for abuse through selective prosecution and the degree of raw political power the freeswinging club of mail fraud affords federal prosecutors.\n\nMargiotta's crimes were carried out in the name of Nassau County Executive Ralph Caso. Without his authority, the mail fraud described here could not have been committed. Caso testified that he was controlled by Margiotta and did not know that the Williams Agency would have procured insurance for smaller commissions or that there was a kickback scheme involved. Even if he lacked that specific knowledge, however, surely he did not think that Margiotta's interest in naming the Broker of Record stemmed from intellectual curiosity about the application of actuarial principles. And surely the fact Caso appointed the Williams Agency solely at the behest of Margiotta and without regard to cost of insurance was a material fact which should have been disclosed by Caso, the County Executive, to the citizens of Nassau County. Yet Caso was not indicted.\n\nEven as to the partisan distribution of insurance commissions, the government concedes that Margiotta's conduct, so far as relevant to mail fraud, was hardly unique; in fact, it was a statewide practice. For example, Margiotta's Democratic counterpart in Long Island diverted commissions to brokers recommended by him when he was in power. One presumes he made no public announcement that he was doing so even though the practice imposed unnecessary costs on taxpayers. And the government brief states, as to insurance purchased by the State, \"New York State employees performed all the work that a broker of record would perform; when policies were awarded, a politically designated broker was named the broker for each particular policy and received the commission.\" While the government seeks to distinguish this scheme by saying there was no sale of office -- a point irrelevant to the theory of the mail fraud count\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e -- the New York State scheme was, if anything, more harmful so far as the taxpayers were concerned. In Nassau County, the Williams Agency did perform some services in return for the commissions. The state practice was to pay state employees to do the work and distribute the commissions to brokers who did nothing at all. Notwithstanding the statewide existence of what in the majority's view was mail fraud, only Margiotta was indicted.\n\nIn arguing this case, the United States Attorney left no doubt that he prosecuted Margiotta for political corruption generally.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e The problem is that in stretching the mail fraud statute to fit this case, we create a crime which applies equally to persons who have not done the evil things Margiotta is said to have done, a catch-all political crime which has no use but misuse. After all, the only need served by resort to mail fraud in these cases is when a particular corruption, such as extortion, cannot be shown or Congress has not specifically regulated certain conduct. But that use creates a danger of corruption to the democratic system greater than anything Margiotta is alleged to have done. It not only creates a political crime where Congress has not acted but also lodges unbridled power in federal prosecutors to prosecute political activists. When the first corrupt prosecutor prosecutes a political enemy for mail fraud, the rhetoric of the majority about good government will ring hollow indeed.\n\n\u003cspan class=\"fn\"\u003e* Of the United States District Court for the Southern District of New York, sitting by designation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. See J. Robertson, American Myth, American Reality 265-66 (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. See J. Bryce, The American Commonwealth (2d ed. 1891).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. See J. Robertson, supra note 1, at 265. For an amusing description, and justification, of the operation of a political machine, see W. Riordon, Plunkitt of Tammany Hall (E. P. Dutton 1963).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. 18 U.S.C. § 1341 (1976) provides in pertinent part: Whoever, having devised or intending to devise any scheme or artifice to defraud, or for obtaining money or property by means of false or fraudulent pretenses, representations or promises . . . for the purpose of executing such scheme or artifice or attempting so to do, places in any post office or authorized depository for mail matter, any matter or thing . . . or takes or receives therefrom any such matter or thing, or knowingly causes to be delivered by mail . . . any such matter or thing, shall be fined not more than $1,000 or imprisoned not more than five years, or both.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. 18 U.S.C. § 1951 (1976) provides in pertinent part: (a) Whoever in any way or degree obstructs, delays, or affects commerce or the movement of any article or commodity in commerce by . . . extortion or attempts or conspires so to do, commits or threatens physical violence to any person or property in furtherance of a plan or purpose to do anything in violation of this section shall be fined not more than $10,000 or imprisoned not more than twenty years, or both. (b) As used in this section -- (2) The term \"extortion\" means the obtaining of property from another, with his consent, induced by wrongful use of actual or threatened force, violence, or fear, or under color of official right.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. See note 4, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. See note 5, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. United States v. Margiotta, 662 F.2d 131, 135 (2d Cir. 1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. 18 U.S.C. § 3731 (1976) provides in pertinent part: In a criminal case an appeal by the United States shall lie to a court of appeals from a decision, judgment, or order of a district court dismissing an indictment or information as to any one or more counts, except that no appeal shall lie where the double jeopardy clause of the United States Constitution prohibits further prosecution. An appeal by the United States shall lie to a court of appeals from a decision or order of a district court supressing or excluding evidence or requiring the return of seized property in a criminal proceeding, not made after the defendant has been put in jeopardy and before the verdict or finding on an indictment or information. . . . The provisions of this section shall be liberally construed to effectuate its purposes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Moreover, it appears that Nassau County also occasionally compensated the Broker of Record through personal services contracts not subject to competitive bidding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Margiotta's pretrial motion to dismiss was filed under a prior indictment that was superseded by an indictment filed on January 15, 1981. The principal change in the superseding indictment was the addition of the word \"secret\" before the description of the alleged fraudulent agreement between Margiotta and the Williams Agency. This superseding indictment has been the predicate for all subsequent proceedings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The district court declined to adopt the Government's requested charge that a special fiduciary relationship need not be established for it to prove the first \"prong\" of Count One, which charged that Margiotta's scheme to defraud the citizens of Nassau County and the Town of Hempstead deprived them of the right to have the affairs of those entities conducted honestly, free from corruption, fraud, and dishonesty. The Government's requested instruction would have permitted the jury to find the defendant guilty of mail fraud simply on the basis of a determination that Margiotta had agreed to recommend the Williams Agency as Broker of Record in return for the Agency's participation in the kickback scheme, without reference to the question of a breach of a fiduciary relationship by the defendant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. See United States v. Margiotta, 662 F.2d 131, 137 (2d Cir. 1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. 18 U.S.C. § 2(b) (1976) provides in pertinent part: Whoever willfully causes an act to be done which if directly performed by him or another would be an offense against the United States, is punishable as a principal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. At the first trial, Judge Sifton had excluded (1) evidence that Margiotta's conduct violated New York law; (2) evidence of a prior similar act involving the dependence of employee salary increases on their agreement to contribute one percent of their salaries to the Republican Party; and (3) certain statements of appellant's attorneys in a memorandum submitted to the Attorney General in an attempt to persuade the Department of Justice that Margiotta should not be indicted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. According to Andrew Parise, the Chief Executive Assistant to the Presiding Supervisor of the Town of Hempstead, it was \"common knowledge\" that an employee was expected to contribute one percent of his salary to the Republican Party. This expectation was enforced by the Party's control of the process governing raises and promotions. At the first trial the district judge had precluded the Government from describing the one percent system in detail on the ground that its probative value was exceeded by its prejudicial impact. As noted at page , after declaring a mistrial, Judge Sifton stated in an order that he would follow this evidentiary ruling at the second trial. On hearing the Government's appeal from this order, this Court affirmed on the ground that Judge Sifton acted well within his discretion in balancing the probative value and prejudicial impact. United States v. Margiotta, supra, 662 F.2d at 142.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Moreover, Margiotta has called attention to an informal opinion rendered in 1943 by the General Counsel of the State Insurance Department concluding that a municipality could require a broker who placed municipal insurance to share his commissions with other brokers in the community. In response, the Government has noted a 1950 Insurance Department memorandum stating that commission sharing was desirable \"in order to avoid political or other kinds of favoritism.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. See note 4, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Report of the Committee of Post Office Officials, 19-20 (March 30, 1870). See Comment, The Intangible Rights Doctrine and Political-Corruption Prosecutions Under the Federal Mail Fraud Statute, 47 U. Chi. L. Rev. 562, 567-68 (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Moreover, the Government has contended that a fiduciary duty was created by New York Election Law § 17-158 (McKinney 1978), which proscribes the payment or receipt of valuable consideration in connection with \"any nomination or appointment for any public office or place,\" and by New York Penal Law § 200.50 (McKinney 1975), which makes it unlawful for a public official or party leader to solicit or accept money in connection with nominations or appointments to \"public office.\" Judge Sifton concluded that the position of Broker of Record for the Town of Hempstead and the County of Nassau is not a \"public office.\" Judge Sifton concluded that the position of Broker of Record for the Town of Hempstead and the County of Nassau is not a \"public office\" or \"place\" within the meaning of the New York statutes, and excluded evidence that Margiotta's conduct violated these statutes. On appeal by the Government prior to the second trial, we held that even if the position of Broker of Record for the Town of Hempstead or Nassau County were a \"public office or place,\" Judge Sifton acted well within his discretion in concluding that the probative value of the evidence was outweighed by the danger of unfair prejudice and confusion of the issues. United States v. Margiotta, supra, 662 F.2d at 143. On this appeal, we decline to hold that Judge Sifton erred in concluding that the Broker of Record is not a \"public office or place,\" but note that even if the Broker does not meet the definition of that phrase, these statutes provide analogous authority for a finding of fiduciary duty.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. We note that the Government did raise objections to the propriety of the charge on a number of other grounds.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Margiotta raises an additional variance objection to Judge Sifton's jury instructions relating to Count One in which the jury was charged that if the Williams Agency were found to be a fiduciary based on its \"participation in Governmental affairs\" and if Margiotta had been a co-schemer with Williams in the breach of that duty, Margiotta could be convicted of mail fraud as a result of the non-disclosure of the corrupt agreement. We do not believe this instruction subjected Margiotta to any prejudicial variance. See United States v. Garguilo, 554 F.2d 59, 63 (2d Cir. 1977). The charging paragraph of Count One detailed the participation of others, including the Williams Agency, in the fraudulent scheme to which Margiotta was a party in breach of a fiduciary duty to the citizenry. Moreover, Count One specifically referred to 18 U.S.C. § 2. While the Government principally focused on Ralph Caso in attempting to prove liability pursuant to 18 U.S.C. § 2, the Government throughout the trial emphasized the role of the Williams Agency in municipal insurance affairs. Accordingly, aiding and abetting of others, such as the Williams Agency, to breach a fiduciary duty owed by them to the public was a separate basis on which the charges in Count One could properly have been submitted to the jury. Furthermore, a finding that the Williams Agency breached a fiduciary duty owed to the public as a result of an undisclosed corrupt agreement with Margiotta has support in the law, since the Broker for Nassau County and the Town of Hempstead, like any broker, is an agent of his principal, in this case the municipalities, see Bohlinger v. Zanger, 306 N.Y. 228, 231, 117 N.E.2d 338, 339 (1954); New York Insurance Law § 111(2) (McKinney 1981 Supp.), and owes a duty of loyalty and good faith to this principal, including an obligation to exercise good faith and reasonable diligence in procuring insurance on the best terms he can. See generally 29 N.Y.Jur., Insurance § 468.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. J. Selden, Table-Talk: Power-State.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. There is no requirement that the public actually suffer a tangible harm, see United States v. Barta, 635 F.2d 999, 1006 (2d Cir. 1980), cert. denied, 450 U.S. 998, 68 L. Ed. 2d 199, 101 S. Ct. 1703 (1981); the prosecution need only prove that some actual harm or injury was contemplated, see United States v. Dixon, 536 F.2d 1388, 1399 n.11 (2d Cir. 1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. As a result, 18 U.S.C. § 2(b) accomplishes a different result from that intended through 18 U.S.C. § 2(a) (1976), which provides in pertinent part: (a) Whoever commits an offense against the United States or aids, abets, counsels, commands, induces or procures its commission, is punishable as a principal. One cannot aid and abet another to do an innocent act within the meaning of § 2(a). See United States v. De Cavalcante, 440 F.2d 1264, 1268 (3rd Cir. 1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Federal Rules of Evidence, Rule 803(3) provides, in pertinent part, that the following statements are \"not excluded by the hearsay rule:\" (3) Then existing mental, emotional, or physical condition. A statement of the declarant's then existing state of mind, emotion, sensation, or physical condition (such as intent, plan, motive, design . . .), but not including a statement of memory or belief to prove the fact remembered or believed. . . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. My use of \"kickback scheme\" includes what has been referred to as a \"sale of office.\" While that phrase serves as useful window dressing for the majority, it is not clear whether they are referring to the post of Broker of Record or Republican County Chairman. Judge Sifton ruled that the former is not a public officer under New York law, while the latter seems a fortiori a private position. It does not matter, however, since the crux of the majority's theory is non-disclosure of a material fact, i.e., the excessive nature of the insurance commissions. Whether these offices are either \"public\" or \"sold\" is irrelevant under that theory.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The majority cites no New York authority establishing the duties they impose on political activists or public officials. They argue that Margiotta's ability to influence official action renders him subject to the same obligations under state law as are borne by the official having de jure power to take such action. Even assuming that state law would treat Margiotta as a public officer -- an assumption not supported by New York authority -- there is nothing to indicate that such officers have legal obligations under state law such as those imposed on Margiotta by the majority. The majority's assertions to the contrary are thus sheer ipse dixit. Since New York law is, as the majority itself notes, irrelevant to a federal mail fraud conviction, I fail to understand why they take such pains to make a patently inadequate argument.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. See, e.g., United States v. Rabbitt, 583 F.2d 1014, 1024 (8th Cir. 1978) (\"Every case of breach of public trust and misfeasance in office in connection with which some mailing has occurred does not and cannot fall within the confines of the mail fraud statute.\"), cert. denied, 439 U.S. 1116, 99 S. Ct. 1022, 59 L. Ed. 2d 75 (1979); United States v. Louderman, 576 F.2d 1383, 1388 (9th Cir.) (\"The [mail fraud] statute should be carefully and strictly construed to avoid extension beyond the limits intended by Congress.\"), cert. denied, 439 U.S. 896, 58 L. Ed. 2d 243, 99 S. Ct. 257 (1978); United States v. McNeive, 536 F.2d 1245, 1252 (8th Cir. 1976) (Government attempt to prosecute \"tipping\" or payment of gratuities to official of a city agency \"would effect a further extension of § 1341 so as to cover all actions which might offend the Government's sense of personal propriety. . . . The Government here is attempting to criminalize cupidity and we do not believe § 1341 can be extended to that extreme without a showing of additional facts which clearly bring the conduct within § 1341. Section 1341 is a penal statute with limitations as to its scope, which limitations were grossly exceeded in the present case.\"); United States v. Edwards, 458 F.2d 875, 880 (5th Cir.) (\"A narrow, careful construction is especially appropriate where, as here, the [mail fraud] statute threatens to reach criminal conduct in the field of domestic relations which the state can, and should, effectively and appropriately control.\"), cert. denied, 409 U.S. 891, 93 S. Ct. 118, 34 L. Ed. 2d 148 (1972); United States v. Kelem, 416 F.2d 346, 347 (9th Cir. 1969), cert. denied, 397 U.S. 952, 25 L. Ed. 2d 134, 90 S. Ct. 977 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The legislative history of the mail fraud statute gives no indication that the statute was ever intended by Congress as an all-purpose weapon against political corruption. The current statute, 18 U.S.C. § 1341, had its origin in Section 301 of the Act of June 8, 1872, Ch. 335, § 301, 17 Stat. 323, and was part of a broad recodification of the postal laws and aimed at \"prevent[ing] the frauds which are perpetrated by lottery swindlers through the mails,\" Report of the Postal Committee, March 30, 1870, 19-20. Congressman Farnsworth, sponsor of the legislation, stated that the mail fraud provisions were needed \"to prevent the frauds which are mostly gotten up in the large cities . . . by thieves, forgers, and rapscallions generally, for the purposes of deceiving and fleecing the innocent people in the country,\" Cong. Globe, 41st Cong., 3d Sess. 35 (1870) (remarks of Rep. Farnsworth). In 1889, Congress amended the mail fraud statute by adding specific prohibitions against a type of \"counterfeit money fraud\" called the \"sawdust swindle\" which dealt in \"green articles,\" \"green coin,\" \"bills,\" \"paper goods,\" \"spurious Treasury notes,\" \"United States goods,\" or \"green cigars.\" Act of March 2, 1889, Ch. 393, § 1, 25 Stat. 873; see S. Rep. No. 2566, 50th Cong., 2d Sess. 2-4 (1889). In 1909, in the course of a general revision of the penal code, the phrase \"or for obtaining money or property by means of false or fraudulent pretenses, representations, or promises,\" was added to the statute as a clarification of the original phrase \"any scheme or artifice to defraud.\" Act of March 4, 1909, Ch. 321, § 215, 35 Stat. 1130; see 42 Cong. Rec. 1026 (1908) (remarks of Sen. Heyburn). In 1948, the statute was modified to delete \"the obsolete argot of the underworld\" added in 1889 and other language considered \"surplusage,\" \"without change of meaning\" in the provision. H.R. Rep. No. 304, 80th Cong., 1st Sess. A100 (1948); Act of June 25, 1948, Ch. 645, § 1341, 62 Stat. 763. In 1949 the term \"dispose of\" was substituted for \"dispose or,\" Act of May 24, 1949, Ch. 139, § 34, 63 Stat. 89, and in 1970 \"Postal Service\" was substituted for \"Post Office Department,\" Postal Reorganization Act, Pub. L. No. 91-375, § 6(j) (11), 84 Stat. 719 (1970). None of these changes indicates any intent to fashion a statute with limitless parameters. Indeed, the addition of the \"underworld argot\" in 1889 arguably indicates that the original intent of the statute was not broad enough to cover even that most obvious of private frauds. Moreover, the addition to the statute of the phrase \"false or fraudulent pretenses, representations, or promises\" appears aimed at common law rulings which held false promises insufficient to gain a conviction for fraud. Indeed, it appears that Congress, in so modifying the legislation, was simply codifying the Supreme Court decision in Durland v. United States, 161 U.S. 306, 40 L. Ed. 709, 16 S. Ct. 508 (1896), which had previously rejected the common law rule. None of these changes indicates that the Congress considered mail fraud to be an appropriate statute for prosecuting political corruption and deception. Even if there were not a canon of construction calling upon us to avoid broad construction of criminal statutes, the recent extension of mail fraud by judicial fiat would be unwarranted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Among the truths assumed by the founders was that self-interest would be a major generating force in democratic politics. The concern over \"faction\" motivated by \"passion . . . adverse . . . to the interests of the community\" appears again and again in The Federalist Papers. The Federalist No. 10, at 54 (J. Madison) (Modern Lib. ed. 1937,); see also, e.g., id. No. 9 (A. Hamilton); id. No. 14, at 79-80 (J. Madison); id. No. 37, at 225, 228, 232 (J. Madison). The founders suffered under no illusion that only \"enlightened statesmen\" would hold the reins of power. Id. No. 10, at 57 (J. Madison). They sought safety in checks and balances and a separation of powers which would prevent the assertion of too much power in a single hand. See id. No. 47 (J. Madison); id. No. 48 (J. Madison); id. No. 49 (J. Madison or A. Hamilton); id. No. 50 (J. Madison or A. Hamilton); id. No. 51 (J. Madison or A. Hamilton). The majority decision vests federal prosecutors with largely unchecked power to harass political opponents. It may be that we should expect only \"enlightened statesmen\" to hold such office, but, with Madison, I would prefer not to take such a risk.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. See note 1, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. During oral argument, there were comparisons to \"Leonid Brezhnev\" and \"systems that are alien to our country,\" statements such as \"in Mineola, not Moscow,\" and a reference to \"a former District Attorney who was supposed to be enforcing the law gets convicted, he's paid off $2,000 a month to make sure that the skeletons stay in the closet.\"\u003c/span\u003e\n\n",
    "body_length": 146570,
    "citedas": [
      "688 F.2d 108"
    ],
    "attorneys": "Irving Younger, Washington, District of Columbia, (Edward Bennett Williams, Robert L. Weinberg, John J. Buckley, Jr., Gerson A. Zweifach, Williams \u0026 Connolly, Washington, District of Columbia, of Counsel), for Appellant. Edward R. Korman, United States Attorney for the Eastern District of New York, Brooklyn, New York (Vivian Shevitz, Larry J. Silverman, Assistant United States Attorneys for the Eastern District of New York, Brooklyn, New York, of Counsel), for Appellee.",
    "category": [
      "243",
      "75"
    ],
    "judges": "Kaufman and Winter, Circuit Judges, and Ward, District Judge.*fn* Winter, Circuit Judge (concurring in part and dissenting in part).",
    "citation_count": 146
  }
}
