{
  "id": "y7TdTGYBTlTomsSBlA3G",
  "document": {
    "title": "06/10/80 TOUSSAINT v. BLUE CROSS \u0026 BLUE SHIELD",
    "full_title": "TOUSSAINT v. BLUE CROSS \u0026 BLUE SHIELD OF MICHIGAN; EBLING V. MASCO CORPORATION",
    "jurisdiction": "Michigan Supreme Court",
    "date": "1980-06-10T00:00:00.000Z",
    "docket": "Docket Nos. 60917, 60907",
    "body": "Charles Toussaint brought an action for wrongful discharge from his employment by Blue Cross and Blue Shield of Michigan. The plaintiff testified that on the day he was hired in 1967 he was given a \"Supervisory Manual\" and a pamphlet of \"Guidelines\", which contained the defendant's personnel policies and procedures, including certain grounds and procedures for discipline of employees and termination of their employment. The plaintiff argues that these documents constitute a written part of his otherwise oral employment contract with the defendant and that, under the terms of the Supervisory Manual, he could be discharged \"for just cause only\", after warnings, notice, a hearing and other procedures provided in the Supervisory Manual. The plaintiff testified that in 1972 he was called into his supervisor's office and told to resign. His employment with the defendant eventually ended after review of the decision by the defendant's personnel department, company president, and chairman of the board of trustees, but the plaintiff was not given the benefit of all of the procedures in the Supervisory Manual. A jury in Wayne Circuit Court, John D. O'Hair, J., returned a verdict for the plaintiff of approximately $73,000 after the trial court denied the defendant's motion for a directed verdict of no cause of action. The Court of Appeals, D.C. Riley, P.J., and Bashara and Mahinske, JJ., reversed and instructed the trial court to enter a judgment for the defendant (Docket No. 28888). Plaintiff appeals.\n\nWalter Ebling brought an action for wrongful discharge from his employment as Director of Marketing for Molloy Manufacturing Division of Masco Corporation. The plaintiff alleged that his oral contract of employment provided that the defendant employer could discharge him only for cause after review by the defendant's Executive Vice President, and that the defendant discharged him before the third anniversary of his employment in order to prevent his exercise of a stock option which by then had appreciated substantially in value. A jury in Wayne Circuit Court, Thomas J. Brennan, J., returned a verdict for the plaintiff of $300,000 plus interest and costs. The trial court denied the defendant's motion for judgment notwithstanding the verdict. The Court of Appeals, R.M. Maher, P.J., and N.J. Kaufman and Borchard, JJ., affirmed in a per curiam opinion (Docket No. 29916). Defendant appeals. In an opinion by Justice Levin, joined by Justices Kavanagh, Williams, and Moody, the Supreme Court held :\n\n1. Contracts for \"permanent\" or \"life\" employment have in general been construed, in the absence of distinguishing features or provisions or a consideration in addition to the services to be rendered, as indefinite hirings terminable at the will of either party. The general rule is not a substantive limitation on the enforceability of employment contracts but a rule of construction: because the parties begin with complete freedom, courts will presume that they intended to obligate themselves to a relationship at will. The enforceability of a contract depends on consideration and not on mutuality of obligation. The proper inquiry is whether the employee has given consideration for the promise of employment.\n\n2. If no definite time of employment is expressed, the court must construe the agreement by assessing or allowing the jury to assess the evidence to determine the intent of the parties. The issue in these cases is whether, assuming a contract for employment for an indefinite term, the employment must be terminable at the will of the employer so that he could not enter into a legally enforceable agreement to terminate the employment only for cause. No authority has been cited for the proposition that where an employer has agreed that an employee hired for an indefinite term shall not be discharged except for cause the employer may, nevertheless, terminate the employment without cause.\n\n3. The plaintiffs contend that the agreements not to discharge them \"as long as I did my job\" or \"[I was] doing the job\" were agreements not to discharge except for good cause. The issues submitted to the jury in each case without objection in this regard was whether there was an agreement to terminate employment only for good cause and whether the employee had been discharged for good cause. In the light of the verdicts for the plaintiffs, the analysis must proceed on the basis that the contract provided that the employee would not be discharged except for good cause. There is no reason an employment contract which does not have a definite term -- the term is \"indefinite\" -- cannot legally provide job security. When a prospective employee inquires about job security and the employer agrees that the employee shall be employed as long as he does his job, a fair construction is that the employer has agreed to give up his right to discharge at will without assigning cause and may only discharge for cause (good or just cause). The result is that such an employee, if discharged without good or just cause, may maintain an action for wrongful discharge.\n\n4. Where the employment is for a definite term it is implied, if not expressed, that the employee cannot be discharged except for good cause, and collective bargaining agreements often provide that discharge shall be only for good or just cause. There is thus no public policy against providing job security or prohibiting an employer from agreeing not to discharge employees except for good or just cause. That being the case, there is no reason that such a provision in a contract having no definite term of employment with a single employee should necessarily be unenforceable and should be regarded, in effect, as being against public policy and beyond the power of the employer to contract. The plaintiffs were hired for responsible positions, and they negotiated specifically with regard to job security with the persons who did the interviewing and hiring. If the defendant employers had desired, they could have established a company policy of requiring prospective employees to acknowledge that they served at the will or pleasure of the company and thus have avoided the misunderstandings that generated this litigation.\n\n5. Plaintiff Toussaint's testimony was sufficient to create a question of fact for the jury whether there was a mutual understanding that it was company policy not to discharge an employee as long as he did his job (discharge for just cause only), and that this policy, expressed in documents which Toussaint asserted were handed to him when he was hired, would apply to him as to other Blue Cross employees. However, the Conclusion that the jury could properly find that the employer's policy manual created contractual rights does not rest solely on the plaintiff's testimony concerning his conversation with the executive who interviewed and hired him. An employer may choose to establish personnel policies or practices and make them known to its employees, presumably to enhance the employment relationship. No pre-employment negotiations need take place and the parties' minds need not meet on the subject; nor does it matter that the employee knows nothing of the particulars of the employer's policies and practices or that the employer may change them unilaterally. It is enough that the employer chooses, presumably in its own interest, to create an environment in which the employee believes that, whatever the personnel policies and practices, they are established and official at a given time, purport to be fair, and are applied consistently and uniformly to each employee. The employer has then created a situation instinct with an obligation.\n\n6. Blue Cross offered no evidence that the supervisory manual and guidelines are not what they purport to be, statements of company policy on the subjects there addressed, including discipline and termination. The manual by its terms purports to apply to all employees who have completed a probationary period. The inference that the policies and procedures applied to Toussaint is supported by his testimony that he was handed the manual in the course of a conversation in which he inquired about job security.\n\n7. Although Toussaint's employment was for an indefinite term, the jury could find that the relationship was not terminable at the will of Blue Cross. Blue Cross had established a company policy to discharge for just cause only, pursuant to certain procedures, had made that policy and the procedures known to Toussaint, and had thereby committed itself to discharge him only for just cause in compliance with the procedures. There were thus, on this separate basis alone, special circumstances sufficient to overcome the presumptive construction that the contract was terminable at will.\n\n8. A right to continued employment absent cause for discharge may, because of the employer's stated policies and established procedures, be enforceable in contract, as are rights to bonuses, pensions and other forms of compensation under Michigan law, where the employer contemplated mutual adherence to stated company policies and goals and derived benefits from a cooperative and loyal work force. An employer who establishes no personnel policies instills no reasonable expectations of performance, and employers can make known to their employees that personnel policies are subject to unilateral changes by the employer, so that the employees would have no legitimate expectation that any particular policy will remain in force. Employees could, however, legitimately expect that policies in force at any given time will be uniformly applied to all; if there is in effect a policy to dismiss for cause only, the employer may not depart from that policy at whim simply because it was under no obligation to institute the policy in the first place. Having announced the policy, presumably with a view to obtaining the benefits of its effect on employees' attitudes and behavior, the employer may not treat its promise as illusory.\n\n9. The question whether the terminations of the plaintiffs' employment was in breach of the contract, i.e., whether the terminations were for cause and in compliance with the defendants' procedures, was also one for the jury. A declaration that the employee was discharged for unsatisfactory work is subject to judicial review: the jury may decide whether the employee was, in fact, discharged for unsatisfactory work. The promise to terminate employment for cause only would be illusory if the employer is permitted to be the sole Judge and final arbiter of the propriety of the discharge. There must be some review of the employer's decision if the \"cause\" contract is to be distinguished from the \"satisfaction\" contract. The factual issues for the jury will differ in each case depending upon the specific cause the employer asserts for the discharge. However, the jury is always permitted to determine the employer's true reason for discharging the employee. In addition, the jury should, where such a promise was made, decide whether the employee was discharged for good cause. In so doing, it should be permitted to decide whether the reason for discharge amounts to good cause: Is it the kind of thing that justifies terminating the employment relation? Does it demonstrate that the employee was no longer doing the job?\n\n10. An employer which enters into a \"cause\" contract must be permitted to establish its own standards for job performance and dismiss employees for failure to adhere to those standards although another employer or the jury might have established lower standards. An employer who agrees to discharge only for cause need not lower its standard of performance. The employer has promised employment only so long as the employee does the job required by the employment contract. The employer's standard of performance can be made part of that contract. Breach of the employer's uniformly applied rules is a breach of the contract and cause for discharge. In such a case, the question for the jury is whether the employer actually had a rule or policy and whether the employee was discharged for violating it. An employer who only selectively enforces rules or policies may not rely on the principle that a breach of a rule is a breach of the contract, there being in practice no real rule. An employee discharged for violating a selectively enforced rule or policy would be permitted to have the jury assess whether his violation of the rule or policy amounted to good cause. Rules and policies uniformly applied are, however, as much a part of the \"common law of the job\" and a part of the employment contract as a promise to discharge only for cause. In addition, the employer could avoid the perils of an assessment by the jury by providing for an alternative method of resolution of disputes. A written agreement, for a definite or indefinite term, to discharge only for cause could, for example, provide for binding arbitration on the issues of cause and damages.\n\nJustice Ryan, joined by Chief Justice Coleman and Justice Fitzgerald, wrote an opinion to affirm the decision of the Court of Appeals in Ebling, and a separate opinion to affirm the decision of the Court of Appeals in Toussaint. As to Ebling, Justice Ryan wrote:\n\n1. The general rule is that, in the absence of distinguishing features or provisions, or consideration in addition to the services to be rendered, contracts for life or permanent employment are indefinite hirings which are terminable at the will of either party. Sufficient consideration flowing to the employer from the employee is an indispensable requisite to the enforceability of the employer's promise of secure employment. However, the argument that the employee's promise to work is illusory in that it does not legally limit his future action and that there is therefore no mutuality of obligation, although it has validity with respect to bilateral contracts, does not apply to the typical employment contract and, in particular, to the agreement in this case.\n\n2. The typical employment agreement is unilateral. Generally, the employer makes an offer or promise which the employee accepts by performing the act upon which the promise is expressly or impliedly based. The employer's promise constitutes, in essence, the terms of the employment agreement; the employee's action or forbearance in reliance upon the employer's promise constitutes sufficient consideration to make the promise legally binding. In such circumstances, there is no contractual requirement that the promisee do more than perform the act upon which the promise is predicated in order to legally obligate the promisor. Consequently, the enforceability of the employer's promise is not limited to those cases in which the employee provides some consideration in addition to the service to be rendered.\n\n3. Courts generally construe the term \"permanent\" or \"lifetime\" employment to mean that the employment shall be of a steady rather than a temporary nature, and shall continue indefinitely until one of the parties wishes to sever the relationship. The relationship is said to be terminable at the will of either party. However, there are two exceptions to the general rule. First, where an employee gives additional consideration in exchange for his employment and employment security, that fact supports a Conclusion that the parties intended an employment relationship in which the employer had relinquished his unfettered discretionary right to terminate the employment at will. Second, where the employment agreement includes some distinguishing feature or provision to preclude the construction of employment at will, e.g., a collective bargaining agreement with a provision that an employee shall be discharged only for cause, the employer's freedom to terminate the service is limited by the contract. The second exception also applies to oral employment contracts with distinguishing features or provisions which limit the employer's freedom to terminate the employee's service.\n\n4. The testimony in this case made an issue for the jury on whether the parties made an oral contract which included the distinguishing feature or provision that the plaintiff's employment was not terminable at will but only for cause. The parties do not disagree that the oral contract of employment included provisions for the plaintiff's participation in a stock option plan after the third anniversary of the commencement of his employment. The plaintiff testified that the terms of the contract were that if his supervisor found his performance unsatisfactory, the defendant could terminate his employment only if its Executive Vice President personally reviewed the plaintiff's performance, he was given a chance to correct the things his supervisor found unsatisfactory, and the Executive Vice President concluded thereafter that the plaintiff was not \"doing the job\". The trial court properly instructed the jury that it was required to decide whether such distinguishing features or provisions were part of the agreement between the parties, and whether they amounted to an agreement to discharge the plaintiff only for cause; determination of the terms of the employment contract was for the jury, not for the court, to decide. The jury answered in the plaintiff's favor, as it was free to do in the light of the evidence.\n\n5. Whether the plaintiff's services were satisfactorily performed, i.e., whether there existed \"cause\" to discharge him, is to be determined by the defendant employer, not by the jury. However, the jury may address the claim that dissatisfaction expressed by the employer is insincere, in bad faith, dishonest, or fraudulently claimed by the defendant as a subterfuge. The plaintiff alleged that the defendant's real purpose in terminating his employment prior to the third anniversary was to prevent him from exercising his stock option. Sufficient evidence was introduced to permit the jury to infer, if it believed the evidence, that the defendant's decision to discharge the plaintiff was not for cause or because he was not \"doing the job\". The evidence, taken in a light most favorable to the plaintiff, shows that a bargained-for term of the employment contract was a limitation on the right to discharge the plaintiff at will.\n\nAs to Toussaint, Justice Ryan wrote:\n\n1. The only direct evidence bearing on the plaintiff's claim that the defendant's Supervisory Manual and Guidelines constituted the written portion of the plaintiff's employment contract was the plaintiff's testimony that he was given the documents when he was hired and that he \"felt\" they were a part of his employment contract. Nowhere in the documents is there a reference to the plaintiff, his specific job, or an employment contract of any kind. Neither document is signed by the plaintiff or a representative of the defendant, nor is a place provided for signatures. The manual repeatedly declares that it is a statement of company policy, and pages of the manual are regularly added and deleted by the defendant without notice to any employee. The plaintiff did not learn of its existence until after he was hired, which is in keeping with the testimony of defendant's witnesses that the Supervisory Manual is given to supervisors as an aid in supervising their subordinate employees, and not as declaring the terms of an employment contract. Although circumstances could exist in which an employer's written policies might be incorporated by reference into an oral employment contract, the record in this case is wholly devoid of evidence to justify a Conclusion that the parties agreed that the Supervisory Manual would become a part of the plaintiff's employment contract.\n\n2. The defendant's manual of personnel policies cannot become its employment contract with some or all of its employees by the company's inadvertence and inattention, or by accident. The question whether a contract has been made, and what are its terms, is for the jury, but the question cannot be put to the jury unless there is some evidence from which a reasonable juror would be warranted in finding a contract. An examination of the record in this case, made in the light most favorable to the plaintiff, does not show any evidence whatever from which a jury was free to conclude that the parties agreed, expressly or by implication, that the defendant's Supervisory Manual or Guidelines would be included in the plaintiff's employment contract.\n\n3. Employment contracts, like other binding agreements are the product of informed understanding and mutual assent. The relationship is a product of a meeting of the minds expressed by some offer by one to employ, or to work for, the other, and an acceptance of the offer. Nothing in the evidence in this case establishes that the trier of fact was entitled to conclude that there was a meeting of the minds on whether the defendant's Supervisory Manual and Guidelines would constitute terms of the plaintiff's employment contract. The cases which the plaintiff cites on this issue are inapposite because they concern ancillary obligations of an employer to pay bonus and pension benefits, based on a theory of promissory estoppel, rather than limitations on the employer's right to discharge the plaintiff from his employment. The plaintiff in this case has not pleaded a claim of promissory estoppel, but, even if he had, the record is without evidence that the plaintiff relied on any statements contained in the Supervisory Manual and Guidelines concerning the duration of his employment, notice of termination, or warnings prior to termination as an inducement to accept employment with the defendant or to remain there.\n\n4. The record in this case only shows an oral employment contract for permanent service of an unspecified duration. In the absence of distinguishing features or provisions, or special consideration from the employee, such hirings are generally regarded as indefinite hirings terminable at the will of either party. The plaintiff does not claim that his discharge from employment was for reasons of bad faith, malice, or retaliation, or for his refusing to do that which public policy forbids or condemns; nor is there any evidence in the record to suggest that this is such a case. Neither is this a case in which an employee relied on his substantial longevity of employment to claim that an employer cannot terminate a long-term employment contract without cause. Here the employment relationship lasted for five years, and the plaintiff relies upon a claim of an express contract that his discharge from his employment would be only for just cause. The plaintiff has failed to present a prima facie case in support of his claim. Therefore, the trial court erred in denying the defendant's motion for a directed verdict of no cause of action.\n\nCharles Toussaint was employed in a middle management position with Blue Cross and Walter Ebling was similarly employed by Masco. After being employed five and two years, respectively, each was discharged. They commenced actions against their former employers, claiming that the discharges violated their employment agreements which permitted discharge only for cause. A verdict of $72,835.52 was rendered for Toussaint and a verdict of $300,000 for Ebling whose discharge left him ineligible to exercise a stock option. Different panels of the Court of Appeals reversed Toussaint and affirmed Ebling.\n\nIn Toussaint we reverse the judgment of the Court of Appeals and reinstate the jury verdict; we affirm Ebling.\n\nI\n\nIn Lynas v Maxwell Farms \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e this Court said that \" for permanent employment or for life have been construed by the courts on many occasions. In general it may be said that in the absence of distinguishing features or provisions or a consideration in addition to the services to be rendered, such contracts are indefinite hirings, terminable at the will of either party\". (Emphasis supplied.)\n\nThe Court of Appeals in Toussaint read Lynas as requiring reversal and said \"a contract for permanent employment or employment for life is a contract for an indefinite period and terminable at the will of either party\" and \" cannot be made other than terminable at will by a provision that states that an employee will not be discharged except for cause\". \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e (Emphasis supplied.)\n\nAnother panel held that Ebling's bargaining for an agreement that he would not be discharged if he was doing his job removed his case \"from the general rule that a contract for indefinite employment is terminable at will,\" and brought it within the exception mentioned in Lynas \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e for \"distinguishing features or provisions or a consideration in addition to the services to be rendered\". \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nLynas indicates, our colleague states, and we agree, that the \"general\" rule there set forth concerning the terminability of a hiring deemed to be for an indefinite term is not a substantive limitation on the enforceability of employment contracts but merely a rule of \"construction\".\n\nIn Ebling our colleague concludes that the evidence presented an issue for the jury whether the parties made an oral contract that was not terminable at will but only for cause. In Toussaint, he concludes that it did not.\n\nThese cases are not factually distinguishable. Both Toussaint and Ebling inquired regarding job security when they were hired. Toussaint testified that he was told he would be with the company \"as long as I did my job\". Ebling testified that he was told that if he was \"doing the job\" he would not be discharged. Toussaint's testimony, like Ebling's, made submissible to the jury whether there was an agreement for a contract of employment terminable only for cause. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nToussaint's case is, if anything, stronger because he was handed a manual of Blue Cross personnel policies which reinforced the oral assurance of job security. It stated that the disciplinary procedures applied to all Blue Cross employees who had completed their probationary period and that it was the \"policy\" of the company to release employees \"for just cause only\".\n\nOur colleague acknowledges that, apart from an express agreement, an employee's legitimate expectations grounded in an employer's written policy statements have been held to give rise to an enforceable contract. He states, however, that the cases so holding are distinguishable because they concern deferred compensation (termination pay, death benefits and profit-sharing benefits) that \"the employers should reasonably have expected would induce reliance by the employee in joining or remaining in the employer's service\". He does not explain why an employer should reasonably expect that a promise of deferred compensation would induce reliance while a promise of job security would not.\n\nAlthough the manual of personnel policies was handed to Toussaint in response to his inquiry regarding job security, our colleague concludes that the record is without \"any evidence whatever that Mr. Toussaint relied\" upon its provisions.\n\nWe hold that\n\n1) a provision of an employment contract providing that an employee shall not be discharged except for cause is legally enforceable although the contract is not for a definite term -- the term is \"indefinite,\" and\n\n2) such a provision may become part of the contract either by express agreement, oral or written, or as a result of an employee's legitimate expectations grounded in an employer's policy statements.\n\n3) In Toussaint, as in Ebling, there was sufficient evidence of an express agreement to justify submission to the jury.\n\n4) A jury could also find for Toussaint based on legitimate expectations grounded in his employer's written policy statements set forth in the manual of personnel policies.\n\nII\n\nMasco and Blue Cross contend\n\n1) It is settled Michigan law that employment contracts for an indefinite term are terminable at the will of either party unless the employee has furnished consideration to his employer other than his services. A promise by an employer to discharge only for an obviously determinable cause represents such a departure from firmly established doctrines of contract formation and the normal expectations accompanying an indefinite employment relationship that it should require separate and distinct consideration in order to be enforceable. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\n2) Where a definite term of employment is specified, each party has furnished consideration by limiting his right to terminate the relationship at will, but where one party (the employer) obligates himself to continue the relationship as long as the other desires and the other (the employee) reserves the right to terminate at will, there is no mutuality of obligation and so the agreement must fail for lack of consideration.\n\nSo explained, the Lynas \"rule\" for which the employers contend appears to be a principle of substantive contract law rather than a rule of construction.\n\nThe enforceability of a contract depends, however, on consideration and not mutuality of obligation. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e The proper inquiry is whether the employee has given consideration for the employer's promise of employment.\n\nThe \"rule\" is useful, however, as a rule of construction . Because the parties began with complete freedom, the court will presume that they intended to obligate themselves to a relationship at will.\n\nTo the extent that courts have seen the rule as one of substantive law rather than construction, they have misapplied language and principles found in earlier cases where the courts were merely attempting to discover and implement the intent of the parties.\n\nA\n\nIf no definite time is expressed, the court must construe the agreement. Early cases took several approaches. Some followed the English rule that the term was presumed to be a year. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Others looked to the period of payment and designated that the term. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e If payment was monthly, the contract was monthly, renewable each month as the relationship continued. Other courts, including the Michigan Court, assessed or allowed a jury to assess the evidence and determine the intent of the parties. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nIn Franklin Mining Co v Harris \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e this Court concluded that the jury could find that the hiring, although for an indefinite term, was \"for at least a year.\"\n\nShortly thereafter, Horace Gay Wood wrote in his treatise on master-servant relations:\n\n\"With us the rule is inflexible, that a general or indefinite hiring is prima facie a hiring at will, and if the servant seeks to make it out a yearly hiring, the burden is upon him to establish it by proof. A hiring at so much a day, week, month or year, no time being specified, is an indefinite hiring, and no presumption attaches that it was for a day even, but only at the rate fixed for whatever time the party may serve.\" \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nFranklin Mining was one of the four American cases cited by Wood as authority. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e To the extent the issue of the term of employment was even present in these cases, the juries were permitted to determine the duration of the contract from written or oral communications between the parties, usages of trade, the type of employment, and other circumstances. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Like many rules, however, Wood's rule was quickly cited as authority for another proposition. Some courts saw the rule as requiring the employee to prove an express contract for a definite term in order to maintain an action based on termination of the employment. The \"rule\" was applied in cases where the claim was one of \"permanent\" or lifetime employment, a term of employment inherently indefinite.\n\nPerry v Wheeler \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e concerned a minister who was elected permanent rector of a church. The minister became involved in a dispute with the congregation and almost all communication between the parties ceased. An ecclesiastical review board determined that the relationship should be dissolved and recommended terms for settlement. The minister insisted he had a right to remain. The Kentucky Supreme Court held that although he had been elected \"permanent rector\", \"it was intended he should continue to hold the place until one or the other of the contracting parties should desire to terminate the connection, in which case the dissatisfied party was to have the right to be relieved of further obligations to the other, upon fair and equitable terms, and after reasonable notice\". To hold otherwise would \"result in compelling an unwilling pastor to remain with his congregation, or a dissatisfied congregation to retain and pay an unpopular and distasteful minister after the feeling of estrangement had become so intense that the continuance of the pastoral relation would tend to tear down and destroy rather than to preserve or build up the cause of Christianity\". (Emphasis supplied.)\n\nLord v Goldberg \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e followed Perry's holding that the \"permanent\" tenure there did not mean lifetime employment but indefinite employment. In Lord it was agreed that the plaintiff, who represented that he could secure certain customers and bring $2,000 to $3,000 of business to his employer each month, would have permanent employment as solicitor \"so long as he should use his best efforts to extend [the defendant's] business.\" After four months, the plaintiff had brought in a total of only $1,700, and the employer notified him that the relationship could continue only on altered terms. The plaintiff refused. The California Supreme Court found it \"clear that plaintiff's employment was not intended to be for life, or for any fixed or certain period. It was to be 'permanent', but that only meant that it was to continue indefinitely, and until one or the other of the parties should wish, for some good reason, to sever the relation\". (Emphasis supplied.) The plaintiff had misrepresented his abilities. \"Under these circumstances, and after trying the experiment for about twenty weeks, the defendants were justified \" in refusing to continue the relationship unless the plaintiff accepted less money. (Emphasis supplied.)\n\nLord has been cited, by this and other courts, for the proposition that permanent employment is indefinite employment and, therefore, terminable at will. This, of course, attributes to the case a holding not there made. To be sure, the Lord court said \"permanent\" did not mean \"lifetime\" but merely indefinite employment, terminable by either party. But the court spoke of \"good cause\" and \"justified\" refusal, and nowhere implied that the relationship was terminable at will without good reason.\n\nIn Sullivan v Detroit, Y \u0026 AA R Co, \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e this Court considered a contract for permanent employment. Sullivan had helped incorporate the railroad in exchange for a promise from the incorporators that he would be \"permanent attorney of the road \". After incorporation, he was employed for one year and then the relationship was severed by the railroad.\n\nThe railroad argued that the one year employment was \"a permanent employment within the true intent and meaning of the parties, and that it operated as a complete accord and satisfaction of his claim \", citing Perry, Lord, Elderton v Emmens \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e and Louisville \u0026 N R Co v Offutt. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Sullivan cited other cases where permanent employment was construed to mean \"continuous or indefinite employment, not terminable at the will of either party\". The Court, citing 2 Bouvier Law Dictionary and 20 American \u0026 English Encyclopedia of Law (2d ed), stated that \"permanent employment\" means \"employment for an indefinite time, which may be severed by either party\", and \" contracts, in the absence of special considerations, conditions and circumstances, are not construed to continue indefinitely, but are terminable at any time by either party\".\n\nLord and Perry were described by the Court as cases where the contract was held to be terminable at the will of either party. No mention was made of the \"good reasons\" requirement in Lord and the true holding of Perry that the rector did not have the right to retain his position for life and withhold possession of the rectory and grounds and that the relationship was severable by the parties \"upon fair and equitable terms\" and with the concurrence or approval of ecclesiastical authority.\n\nSullivan relied on cases where an injured employee gave up a tort claim against his employer in exchange for a promise of employment. He also cited Carnig v Carr \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e where an enameler agreed to give up his business and join the defendant in the same occupation in exchange for permanent employment at stipulated wages. After several months the plaintiff was discharged. The Supreme Judicial Court of Massachusetts said:\n\n\"To ascertain what the parties intended by 'permanent employment,' it is necessary to consider the circumstances surrounding the making of the contract, its subject, the situation and relation of the parties, and the sense in which, taking these things into account, the words would be commonly understood.\"\n\nThe court found that permanent employment meant employment so long as the defendant had enameling work which the plaintiff was able to perform.\n\nThe opinion in Sullivan, making its own assessment of the facts, found that \" gave up no occupation or business, as did plaintiff in Carnig v Carr. On the contrary, he maintained his law business the same as usual, during the same time, at the same place, and in the same office. He gave up none of his other work. He released no claim and gave no past consideration for the contract, as was done in \"other cases relied on by Sullivan.\n\nStating that the life of the corporation was 30 years and the contract was either binding for 30 years or terminable at the will of either party, the Court found it \"impossible to conclude that the parties who made this contract contemplated that the plaintiff was to be employed for thirty years, or as long as he was able to do the legal work of the defendant\". Unquestionably, the Court saw its task as construing the term \"permanent\" in a manner consistent with the parties' intent. This is all that had been done in the cases cited by the parties in Sullivan and all that the Sullivan Court did. Nowhere did the Court indicate that if the parties had, in fact, agreed to employment other than at will the bargain would be unenforceable unless Sullivan gave some consideration in addition to his services.\n\nIn Lynas the employee alleged a contract for permanent employment as long as his services were satisfactory to defendant. The Court spoke of contracts for permanent employment generally, noting that \"permanent\" is generally construed as meaning indefinite employment terminable at will but that when there are distinguishing features the contract may be construed otherwise.\n\nLynas attempted to analogize his case to Carnig but the Court was not persuaded that his selling a business operated in his wife's name brought the case within the purview of Carnig and similar cases because, in the Court's view, Lynas's action in disposing of the business was not \"considered by the parties as a part of the performance.\" Because Lynas was employed permanently so long as his services were satisfactory and his services were found to be unsatisfactory, his employment could be terminated without obligation. Again, the Court assessed the facts and construed the meaning of the agreement.\n\nIn Adolph v Cookware Co of America this Court did seem to state a rule, \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e but, as formulated, it carried previous cases beyond their holdings. Lynas was erroneously cited for the proposition that, unless there is consideration other than the promise of services, permanent employment is terminable at will, and, along with Lord, for the additional proposition that plaintiff's giving up his profession was but an incident necessary to place himself in a position to accept and perform the contract and not a price or consideration for the contract of employment. It is unclear whether the latter proposition was a holding on the facts of Adolph or intended to be a statement of law. Lynas was decided on its facts and announced no general principles of substantive law. Lord held only that permanent employment does not mean lifetime employment which cannot be terminated even for good cause.\n\nIn all events, the issue in all these cases was whether, assuming a contract for \"permanent\" employment, that employment was terminable at the will of the employer, not whether, as here, assuming an employment contract for an indefinite term, the employment must be terminable at will so that the employer could not enter into a legally enforceable agreement to terminate the employment only for cause.\n\nThe court's task in the cited cases was to construe \"permanent\" consistent with the circumstances surrounding the formation of the contract; where the parties appeared to intend only steady employment, the general rule that the relationship is terminable at will was applied.\n\nNo authority is cited by Blue Cross, Masco or our colleague for the proposition that where an employer has agreed that an employee hired for an indefinite term shall not be discharged except for cause the employer may, nevertheless, terminate the employment without cause.\n\nB\n\nThe amici curiae argue in support of the employers that permitting the discharge of employees hired for an indefinite term only for cause will adversely affect the productivity and competency of the work force.\n\nEmployers are most assuredly free to enter into employment contracts terminable at will without assigning cause. We hold only that an employer's express agreement to terminate only for cause, or statements of company policy and procedure to that effect, can give rise to rights enforceable in contract.\n\nC\n\nToussaint and Ebling contend that their employers' agreement not to discharge \"as long as I did my job \" or \"[I was] doing the job \" was an agreement not to discharge except for good cause. The issues submitted to both juries, without objection in this regard, were whether there was an agreement to terminate employment only for good cause and whether the employee had been discharged for good cause. In light of the jury verdicts we proceed on the basis that the contracts provided that the employee would not be discharged except for good cause.\n\nWe see no reason why an employment contract which does not have a definite term -- the term is \"indefinite\" -- cannot legally provide job security. When a prospective employee inquires about job security and the employer agrees that the employee shall be employed as long as he does the job, a fair construction is that the employer has agreed to give up his right to discharge at will without assigning cause and may discharge only for cause (good or just cause). The result is that the employee, if discharged without good or just cause, may maintain an action for wrongful discharge.\n\nSuppose the contracts here were written, not oral, and had provided in so many words that the employment was to continue for the life of the employee who could not be discharged except for cause (including as a cause, if you will, his attaining the company's mandatory retirement age). To construe such an agreement as terminable at the will of the employer would be tantamount to saying, as did the Court of Appeals in Toussaint, that a contract of indefinite duration \" cannot be made other than terminable at will by a provision that states that an employee will not be discharged except for cause\" \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e (emphasis supplied) and that only in exceptional circumstances, where there are \"distinguishing features or provisions or a consideration in addition to the services to be rendered\", would an employee be permitted to bargain for a legally enforceable agreement providing job security.\n\nWhere the employment is for a definite term -- a year, five years, ten years -- it is implied, if not expressed, that the employee can be discharged only for good cause \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e and collective bargaining agreements often provide that discharge shall only be for good or just cause. There is, thus, no public policy against providing job security or prohibiting an employer from agreeing not to discharge except for good or just cause. That being the case, we can see no reason why such a provision in a contract having no definite term of employment with a single employee should necessarily be unenforceable and regarded, in effect, as against public policy and beyond the power of the employer to contract.\n\nToussaint and Ebling were hired for responsible positions. They negotiated specifically regarding job security with the persons who interviewed and hired them. If Blue Cross or Masco had desired, they could have established a company policy of requiring prospective employees to acknowledge that they served at the will or the pleasure of the company and, thus, have avoided the misunderstandings that generated this litigation. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nIII\n\nWe have already indicated that we do not agree with our colleague's Conclusion in Toussaint that \"the record is wholly devoid of evidence, direct or circumstantial, to justify the Conclusion that the parties agreed that the manual\" \"would become the plaintiff's contract of employment\".\n\nToussaint's testimony was sufficient to create a question of fact for the jury whether there was a mutual understanding that it was company policy not to discharge an employee \"as long as did job\", and that this policy, expressed in documents (which said \"for just cause only\"), assertedly handed to Toussaint when he was hired, would apply to him as to other Blue Cross employees.\n\nWe do not, however, rest our Conclusion that the jury could properly find that the Blue Cross policy manual created contractual rights solely on Toussaint's testimony concerning his conversation with the executive who interviewed and hired him.\n\nWhile an employer need not establish personnel policies or practices, where an employer chooses to establish such policies and practices and makes them known to its employees, the employment relationship is presumably enhanced. The employer secures an orderly, cooperative and loyal work force, and the employee the peace of mind associated with job security and the conviction that he will be treated fairly. No pre-employment negotiations need take place and the parties' minds need not meet on the subject; \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e nor does it matter that the employee knows nothing of the particulars of the employer's policies and practices or that the employer may change them unilaterally. It is enough that the employer chooses, presumably in its own interest, to create an environment in which the employee believes that, whatever the personnel policies and practices, they are established and official at any given time, purport to be fair, and are applied consistently and uniformly to each employee. The employer has then created a situation \"instinct with an obligation\". \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nBlue Cross offered no evidence that the manual and guidelines are not what they purport to be -- statements of company policy on the subjects there addressed, including discipline and termination.\n\nThe jury could properly conclude that the statements of policy on those subjects were applicable to Toussaint although the manual did not explicitly refer to him. The manual, by its terms, purports to apply to all employees who have completed a probationary period. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e The inference that the policies and procedures applied to Toussaint is supported by his testimony that he was handed the manual in the course of a conversation in which he inquired about job security.\n\nAlthough Toussaint's employment was for an indefinite term, the jury could find that the relationship was not terminable at the will of Blue Cross. Blue Cross had established a company policy to discharge for just cause only, pursuant to certain procedures, had made that policy known to Toussaint, and thereby had committed itself to discharge him only for just cause in compliance with the procedures. There were, thus, on this separate basis alone, special circumstances sufficient to overcome the presumptive construction that the contract was terminable at will.\n\nWe hold that employer statements of policy, such as the Blue Cross Supervisory Manual and Guidelines, can give rise to contractual rights in employees without evidence that the parties mutually agreed that the policy statements would create contractual rights in the employee, and, hence, although the statement of policy is signed by neither party, can be unilaterally amended by the employer without notice to the employee, and contains no reference to a specific employee, his job description or compensation, and although no reference was made to the policy statement in pre-employment interviews and the employee does not learn of its existence until after his hiring.\n\nThe previous decisions of this Court enforcing contractual rights grounded in an employee's legitimate expectations based on an employer's statements of policy are not inapposite. Here, as in those cases, the employer contemplated mutual adherence to stated company policies and goals and derived benefits from a cooperative and loyal work force.\n\nIn Cain v Allen Electric \u0026 Equipment Co, \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e the employer adopted a \"supervisory and office personnel policy\" declaring:\n\n\"The keynote of our policy as herein related is an endeavor to achieve fairness with due consideration for the feelings of the employees to whom this is directed, and will be of particular assistance to new or temporary employees.\"\n\n\"When it becomes necessary to terminate the services of an office employee on a permanent basis, such individual will be paid separation pay [in?] lieu of notice as stated in table given to each employee.\"\n\nAn executive having 5 to 10 years employment was entitled to two months separation pay.\n\nLess than four months after the policy announcement, Cain tendered his resignation, effective in two months. He was immediately discharged, without notice, and sought two months' separation pay. The employer appealed a judgment awarding such pay arguing that its declarations of personnel policy \"were not of a promissory or contractual nature and did not constitute an offer capable of acceptance * * * but were a mere gratuitous statement of policy or intention\".\n\nThis Court asked: \"Is it the fact that dismissal compensation is purely a gift? That there is no consideration to the company from the adoption and operation of such a plan?\", canvassed the literature and case law on the subject, and concluded:\n\n\"We cannot agree that all we have here is a mere gratuity, to be given, or to be withheld, as whim or caprice might move the employer. An offer was made, not merely a hope or intention expressed. The words on their face looked to an agreement, an assent. The cooperation desired was to be mutual. * * * The essence of the announcement was precisely that the company would conduct itself in a certain way with the stated objective of achieving fairness, and we would be reluctant to hold under such circumstances that an employee might not reasonably rely on the expression made and conduct himself accordingly. As for consideration, that element setting apart the enforceable from the unenforceable, we hazard no definition. Suffice in this respect, * * * to point out that not only were there rewards to the employee, but, in addition, substantial rewards to the employer, arising, in part, out of the accomplishment of 'the daily work of the organization in a spirit of cooperation and friendliness.' In short, the adoption of the described policies by the company constituted an offer of a contract. This offer, as the trial court correctly held, 'the plaintiff accepted * * * by continuing in its employment beyond the 5-year period * * *.'\" (Emphasis supplied.)\n\nThe Blue Cross Manual, too, promised that the company would conduct itself in a certain way with the stated objective of achieving fairness. \"The cooperation desired was to be mutual\" -- both employer and employee were to adhere to stated procedures, and no doubt those policies contributed to a \"spirit of cooperation and friendliness\". Since Blue Cross published and distributed a 260-page manual establishing elaborate procedures promising \" provide for the administration of fair, consistent and reasonable corrective discipline\" and \"to treat employees leaving Blue Cross in a fair and consistent manner and to release employees for just cause only \", its employees could justifiably rely on those expressions and conduct themselves accordingly.\n\nRecognition that contractual obligations can be implicit in employer policies and practices is not confined to cases where compensation is in issue. Corbin's observation \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e that the law of employment is undergoing rapid change was soon substantiated in Perry v Sindermann, \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e concerning a claim of a right to continued employment absent sufficient cause for discharge. The United States Supreme Court observed:\n\n\"A written contract with an explicit tenure provision clearly is evidence of a formal understanding that supports a teacher's claim of entitlement to continued employment unless sufficient 'cause' is shown. Yet absence of such an explicit contractual provision may not always foreclose the possibility that a teacher has a 'property' interest in re-employment. For example, the law of contracts in most, if not all, jurisdictions long has employed a process by which agreements, though not formalized in writing, may be 'implied.' Explicit contractual provisions may be supplemented by other agreements implied from 'the promisor's words and conduct in the light of the surrounding circumstances.' And, meaning of [the promisor's] words and acts is found by relating them to the usage of the past.'\n\n\"A teacher, like the respondent, who has held his position for a number of years, might be able to show from the circumstances of this service -- and from other relevant facts -- that he has a legitimate claim of entitlement to job tenure. Just as this Court has found there to be a 'common law of a particular industry or of a particular plant' that may supplement a collective-bargaining agreement, so there may be an unwritten 'common law' in a particular university that certain employees shall have the equivalent of tenure. This is particularly likely in a college or university, like Odessa Junior College, that has no explicit tenure system even for senior members of its faculty, but that nonetheless may have created such a system in practice.\n\n\"In this case, the respondent has alleged the existence of rules and understandings, promulgated and fostered by state officials, that may justify his legitimate claim of entitlement to continued employment absent 'sufficient cause.'\" (Citations omitted.)\n\nThis court adopted this analysis in another context. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nThe right to continued employment absent cause for termination may, thus, because of stated employer policies and established procedures, be enforceable in contract just as are rights so derived to bonuses, pensions and other forms of compensation as previously held by Michigan courts. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nOne amicus curiae argues that large organizations regularly distribute memoranda, bulletins and manuals reflecting established conditions and periodic changes in policy. These documents are drafted \"for clarity and accuracy and to properly advise those subject to the policy memo of its contents\". If such memoranda are held by this Court to form part of the employment contract, large employers will be severely hampered by the resultant inability to issue policy statements.\n\nAn employer who establishes no personnel policies instills no reasonable expectations of performance. Employers can make known to their employees that personnel policies are subject to unilateral changes by the employer. Employees would then have no legitimate expectation that any particular policy will continue to remain in force. Employees could, however, legitimately expect that policies in force at any given time will be uniformly applied to all. If there is in effect a policy to dismiss for cause only, the employer may not depart from that policy at whim simply because he was under no obligation to institute the policy in the first place. Having announced the policy, presumably with a view to obtaining the benefit of improved employee attitudes and behavior and improved quality of the work force, the employer may not treat its promise as illusory.\n\nIV\n\nOur colleague states in Ebling that the question whether \"Ebling's services were satisfactorily performed -- whether there existed 'cause' to discharge him -- was a question to be determined by the defendant, not the jury\". He continues that while \"the reasonableness of the employer's judgment in a 'satisfaction' contract is not subject to jury review, the jury may address the claim that the dissatisfaction expressed is insincere, in bad faith, dishonest or fraudulently claimed as a subterfuge\". He concludes that sufficient evidence was introduced that Masco's \"real purpose in terminating his employment was to prevent him from exercising his stock option\" so that the jury could infer that Masco's \"decision to discharge the plaintiff was not for cause or because he was not 'doing the job'\". He acknowledges that the case was not submitted to the jury on that basis. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nIn the cases cited by our colleague the employer promised employment only so long as the employee's services were satisfactory to him. Such a promise is not, as here, a promise to discharge for cause or good or just cause only.\n\nWe conclude -- having already decided that the juries could properly find that Blue Cross and Masco had entered into express agreements to discharge Toussaint and Ebling only for cause and that the Blue Cross Manual and Guidelines of personnel practices and procedures established contractual rights in Toussaint to be disciplined and discharged only in accordance with the procedures there set forth -- that the question whether termination of employment was in breach of the contract (whether Toussaint and Ebling were discharged for cause and in compliance with the procedures) was also one for the jury.\n\nWe all agree that where an employer has agreed to discharge an employee for cause only, its declaration that the employee was discharged for unsatisfactory work is subject to judicial review. The jury as trier of facts decides whether the employee was, in fact, discharged for unsatisfactory work. A promise to terminate employment for cause only would be illusory if the employer were permitted to be the sole Judge and final arbiter of the propriety of the discharge. There must be some review of the employer's decision if the cause contract is to be distinguished from the satisfaction contract. \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nThe role of the jury will differ with each case. Where the employer claims that the employee was discharged for specific misconduct -- intoxication, dishonesty, insubordination -- and the employee claims that he did not commit the misconduct alleged, the question is one of fact for the jury: did the employee do what the employer said he did? \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nWhere the employer alleges that the employee was discharged for one reason -- excessive tardiness -- and the employee presents evidence that he was really discharged for another reason -- because he was making too much money in commissions -- the question also is one of fact for the jury. \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e The jury is always permitted to determine the employer's true reason for discharging the employee.\n\nWhere an employee is discharged for stated reasons which he contends are not \"good cause\" for discharge, the role of the jury is more difficult to resolve. If the jury is permitted to decide whether there was good cause for discharge, there is the danger that it will substitute its judgment for the employer's. If the jurors would not have fired the employee for doing what he admittedly did, or they find he did, the employer may be held liable in damages although the employee was discharged in good faith and the employer's decision was not unreasonable.\n\nWhile the promise to terminate employment only for cause includes the right to have the employer's decision reviewed, it does not include a right to be discharged only with the concurrence of the communal judgment of the jury. Nevertheless, we have considered and rejected the alternative of instructing the jury that it may not find a breach if it finds the employer's decision to discharge the employee was not unreasonable under the circumstances.\n\nSuch an instruction would transform a good-cause contract into a satisfaction contract. The employer may discharge under a satisfaction contract as long as he is in good faith dissatisfied with the employee's performance or behavior. The instruction under consideration would permit the employer to discharge as long as his dissatisfaction (cause) is not unreasonable. The difference is minute.\n\nWhere the employee has secured a promise not to be discharged except for cause, he has contracted for more than the employer's promise to act in good faith or not to be unreasonable. An instruction which permits the jury to review only for reasonableness inadequately enforces that promise.\n\nIn addition to deciding questions of fact and determining the employer's true motive for discharge, the jury should, where such a promise was made, decide whether the reason for discharge amounts to good cause: \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e Is it the kind of thing that justifies terminating the employment relationship? Does it demonstrate that the employee was no longer doing the job?\n\nThe amici curiae and employers express fears that enforcing contracts requiring cause for discharge will lead to employee incompetence and inefficiency. First, no employer is obliged to enter into such a contract. Second, those who do, we agree, must be permitted to establish their own standards for job performance and to dismiss for non-adherence to those standards although another employer or the jury might have established lower standards.\n\nAn employer who agrees to discharge only for cause need not lower its standard of performance. It has promised employment only so long as the employee does the job required by the employment contract. The employer's standard of job performance can be made part of the contract. Breach of the employer's uniformly applied rules is a breach of the contract and cause for discharge. \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e In such a case, the question for the jury is whether the employer actually had a rule or policy and whether the employee was discharged for violating it.\n\nAn employer who only selectively enforces rules or policies may not rely on the principle that a breach of a rule is a breach of the contract, there being in practice no real rule. An employee discharged for violating a selectively enforced rule or policy would be permitted to have the jury assess whether his violation of the rule or policy amounted to good cause. Rules and policies uniformly applied are, however, as much a part of the \"common law of the job\" and a part of the employment contract as a promise to discharge only for cause.\n\nAdditionally, the employer can avoid the perils of jury assessment by providing for an alternative method of dispute resolution. A written agreement for a definite or indefinite term to discharge only for cause could, for example, provide for binding arbitration on the issues of cause and damages.\n\nWe have considered the jury instructions and have concluded that they were adequate and consistent with the scope of its inquiry. \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nWe affirm Ebling and remand Toussaint to the trial court with instructions to reinstate the verdict.\n\nEbling v Masco Corp\n\nRyan, J.\n\nIn August of 1967, defendant Masco Corporation was interested in hiring a marketing director for its Molloy Manufacturing Division. To that end, Masco retained the services of an employment consultant and recruiter who put Masco in contact with plaintiff, Walter Ebling. Several meetings were arranged at which Ebling; Charles Janjikian, General Manager of Masco's Molloy Manufacturing Division; and Richard Manoogian, Executive Vice President of Masco, discussed the prospect of Ebling's employment for the position in question.\n\nAt the several meetings Ebling expressed a strong desire to work for Masco but was somewhat apprehensive about a potential personality conflict between himself and Mr. Janjikian, who would be his immediate superior. At trial, Mr. Ebling testified that he expressed this concern to the Vice President, Mr. Manoogian, who assured him that there would be no problem. Mr. Ebling testified:\n\n\"And the other thing that I was very concerned about was the fact that I liked Mr. Janjikian, who was the man that I would have to work for, but I had some serious reservations about him. Not that I didn't think he was a nice man, but we had some philosophical differences as to marketing in the sense of the business direction and he assured me that Mr. Janjikian was a very good man. I said, well, the problem I'm having is, you are primarily interviewing me. We agree on what is needed. I believe he really wants a heavy sales type, whatever it takes to get the other type. You're the boss, so he has -- now believes in what you want. But I do not want to get in a situation where -- in any school of hiring, you always want to work for the guy that hires you, and I was sensitive to this problem. In a situation where, if he doesn't like me, he could let me go and Richard assured me, he was a very fine man, which I assume he is, and I said -- he said, well, we will know in six months whether you are doing the job or not, and in addition to that, I would personally assure you that if anything comes up between you and Mr. Janjikian that is detrimental relative to your performance that you will be reviewed by myself before anything happens and given a chance to correct these things, and, if you are doing the job, you can be assured that you will not be discharged. And with these assurances, both, in the salary and some, I believe, protection from the man I was going to work for at least, I shook his hand and accepted the position.\"\n\nEbling terminated his position at Xerox Corporation in order to accept employment with Masco for a $22,000 per year salary plus fringe benefits, including participation in a stock option plan.\n\nThe stock plan enabled Mr. Ebling to purchase 2,000 shares of Masco stock at a highly advantageous price. The option was exercisable to the extent of 1,000 shares upon the third anniversary of the commencement date of plaintiff's employment and the other 1,000 shares upon the fourth anniversary. The plan required that Mr. Ebling be continuously employed by Masco to within three months of the exercise of the option.\n\nOn December 15, 1969, after slightly more than two years with Masco, Ebling's employment was terminated by the defendant.\n\nIn June of 1972, plaintiff filed suit in Wayne Circuit Court alleging that his employment agreement with Masco provided that the employer could fire him only for \"cause\" and that he was discharged without cause in breach of that agreement. Plaintiff sought an award of damages based largely upon the fact that as a consequence of his alleged improper discharge, he was not eligible to exercise his stock option. The case was tried to a jury in October and November of 1975. At the close of plaintiff's proofs, defendant moved unsuccessfully for a directed verdict. After the jury returned a verdict in favor of the plaintiff in the amount of $300,000, plus interest and costs, defendant moved for a judgment notwithstanding the verdict. Once again the trial court denied the motion.\n\nDefendant appealed the trial court's ruling and on November 9, 1977, the Court of Appeals affirmed the lower court decision in a per curiam opinion. 79 Mich App 531; 261 NW2d 74 (1977). We granted defendant leave to appeal. 402 Mich 950j (1978).\n\nI\n\nThe stated issue is whether an employee is required to furnish the employer consideration in addition to his services as employee to successfully restrict the employer's ability to discharge the employee when the contract is for an indefinite term.\n\nThe answer is that such additional consideration is not always required and that this is a case in which it is not.\n\nFirmly established in Michigan is the general rule that in the absence of distinguishing features or provisions, or a consideration in addition to the services to be rendered, contracts for life or permanent employment are indefinite hirings terminable at the will of either party. Lynas v Maxwell Farms, 279 Mich 684; 273 NW 315 (1937); \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Adolph v Cookware Co of America, 283 Mich 561; 278 NW 687 (1938); McLaughlin v Ford Motor Co, 269 F2d 120 (CA 6, 1959).\n\nWhile the rule is often cited and has been consistently recognized in Michigan jurisprudence as a keystone principle in employment contract cases (see Hackett v Foodmaker, Inc, 69 Mich App 591; 245 NW2d 140 [1976]; Hernden v Consumers Power Co, 72 Mich App 349; 249 NW2d 419 [1976]; McMath v Ford Motor Co, 77 Mich App 721; 259 NW2d 140 [1977]; Toussaint v Blue Cross \u0026 Blue Shield of Michigan, 79 Mich App 429; 262 NW2d 848 [1977]), care must be taken that it not be read or applied too narrowly. The rule is susceptible of various interpretations, two of which are advanced on this appeal.\n\nPlaintiff-appellee claims that specific oral assurances of job security made to him by Mr. Manoogian constitute \"distinguishing features or provisions\" under the rule in Lynas v Maxwell Farms, supra, thereby excepting the hiring in question from the general proposition that such hirings are terminable at the will of either party.\n\nDefendant-appellant, on the other hand, construes the rule to require that an employee furnish consideration in addition to the services to be rendered in order to limit the employer's unfettered right to terminate the hiring. In support of its construction of the rule, defendant focuses narrowly upon the traditional contract law requirements of consideration and mutuality of obligation. Defendant argues that an employee's promise to work as long as he chooses to does not purport to put any limitation on the freedom of the employee and, consequently, does not constitute consideration sufficient to support any promise the employer might make. Defendant emphasizes that such a promise on the part of an employee is illusory in that it leaves his future action subject to his own future whim. Concerning the contract requirement of mutuality of obligation, defendant concludes that an employer's promises or assurances of secure employment are gratuitous and not contractually binding absent some consideration from the employee in addition to the services to be rendered.\n\nII\n\nIn first addressing defendant's claim, it is appropriate to note that we agree with the premise that legally sufficient consideration flowing to the employer from the employee is an indispensable requisite to the enforceability of the employer's promise. Although in agreement with this premise, we reject the manner in which defendant would apply it to the typical employment contract and, in particular, to the agreement at issue in this case.\n\nEssentially, defendant claims that the employee's promise to work is illusory in that it does not legally limit his future action and since the employee's promise to work does not constitute consideration to support any promise the employer might make, the employer is not legally bound to his promises because of a lack of mutuality of obligation.\n\nWhile defendant's analysis has validity with respect to bilateral contracts or agreements, we note that the typical employment agreement is unilateral in nature. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Generally, the employer makes an offer or promise which the employee accepts by performing the act upon which the promise is expressly or impliedly based. The employer's promise constitutes, in essence, the terms of the employment agreement; the employee's action or forbearance in reliance upon the employer's promise constitutes sufficient consideration to make the promise legally binding. In such circumstances, there is no contractual requirement that the promisee do more than perform the act upon which the promise is predicated in order to legally obligate the promisor. See Adolph v Cookware Co of America, supra, 567.\n\nConsequently, we reject defendant's claim that the element of consideration, essential to the formation of a contract, limits the enforceability of the employer's promise to those instances in which the employee provides some consideration in addition to the services to be rendered.\n\nInstead of describing a substantive limitation upon the enforceability of employment contracts, we perceive Lynas to announce a rule of construction. Essentially, courts construe the term \"permanent\" or \"lifetime\" employment to mean that the employment shall be of a steady rather than a temporary nature, and shall continue indefinitely until one or the other of the parties wishes to sever the relationship. Since the employer, in the absence of an employment contract which provides otherwise, has virtually unfettered discretion with respect to terminating an employment relationship of indefinite duration and the employee possesses an identical right, the relationship is said to be terminable at the will of either party.\n\nWhile favoring flexibility in employment relationships, the rule in Lynas recognizes two exceptions to the general assumption that the parties intend an indefinite relationship to be terminable at will.\n\nThe first exception comprises those circumstances in which an employee gives consideration, in addition to the services to be rendered, in exchange for a promise of permanent employment. In these instances, the assumption that parties who did not make a specific agreement concerning the matter intended an indefinite hiring to be terminable at the employer's will is obviated by the fact that the employee gave additional consideration in return for the employer's implicit assurance of a special type of permanent employment relationship. Essentially, the fact that the employee gave additional consideration in exchange for his position and employment security in connection therewith supports the Conclusion that the parties intended to enter into an employment relationship in which the employer had relinquished his discretionary right to terminate the hiring at will. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe second exception to the general rule consists of those instances in which the employment agreement includes some \"distinguishing or \", as the Court put it in Lynas, supra, so as to preclude a construction of employment at will. A classic example of this type modification of an indefinite hiring is the modern collective bargaining agreement in which there is often included a provision that an employee shall be discharged only for cause. Provisions of this nature clearly and forcefully indicate a mutual intention to limit the employer's discretion in terminating the employment relationship.\n\nThus, the Lynas rule is not limited only by formalized collective bargaining agreements, but is limited as well by the application of \"distinguishing features or provisions\" of simple oral contracts of hire in which the parties limit or restrict the employer's freedom to terminate the employee's service at will.\n\nThe determinative question before us is whether this is such a case.\n\nThe plaintiff, Ebling, pleaded an oral contract of employment in which he claimed inter alia :\n\n\"9. Plaintiff further shows unto this court that the aforesaid contract of employment could only be terminated for cause; that the defendant without cause and with malice did terminate the aforesaid contract of employment on or about the 18th day of December, 1969; that the purpose for such termination was to deprive the plaintiff to exercise his rights set forth in the option agreement known as Exhibit A.\"\n\nIn support of his claim that the oral employment agreement permitted discharge only for cause and not at will, plaintiff testified that defendant's Executive Vice President, Mr. Manoogian, expressly agreed, in the course of contractual negotiations and as an inducement to plaintiff, that he would personally review plaintiff's job performance and that plaintiff would not be discharged \"if you are doing the job\".\n\nThe question is whether that testimony made a jury-submissible issue on whether the parties made an oral contract which included the \"distinguishing or \" that plaintiff's employment was not terminable at will but only for cause.\n\nWe think it did.\n\nThere is evidence in the record, and the parties do not disagree, that the oral contract of hire included provisions relating to the plaintiff's participation in a stock option plan.\n\nThe terms of the plan provided that plaintiff would be permitted to exercise the first half of the option after being employed by defendant for three years and the second half upon being employed four years, with the entire option to be exercised within five years.\n\nIt was plaintiff's theory, supported by his own testimony, that the defendant discharged him prior to the third anniversary of his employment in order to prevent him from exercising his option which by then had appreciated in value substantially. Defendant denied any such purpose, creating, we think, a jury question on the further issue whether, if he could be discharged only for cause, his employment was in fact terminated for that reason .\n\nUnder the terms of the contract of hire, as claimed by the plaintiff, if his performance was thought to be unsatisfactory by his supervisor, Mr. Janjikian, defendant could terminate his employment only if:\n\n1. Mr. Manoogian reviewed personally plaintiff's performance, and\n\n2. Plaintiff was \"given a chance to correct things\" Mr. Janjikian found unsatisfactory, and\n\n3. Mr. Manoogian concluded thereafter that plaintiff was not \"doing the job\".\n\nThe trial Judge properly instructed the jury that it was required to decide whether such \"distinguishing features or provisions\" were part of the agreement between the parties and whether, as such, they amounted to an agreement to discharge only for cause. In so doing, the court recognized that determination of the terms of the employment contract was a jury question and not one for the court to decide.\n\nThe jury answered in the plaintiff's favor, as it was free to do in light of the evidence of record.\n\nThe question whether Mr. Ebling's services were satisfactorily performed -- whether there existed \"cause\" to discharge him -- was a question to be determined by the defendant, not the jury.\n\n\"It is settled law that, where a person contracts to do work to the satisfaction of his employer, the employer is the Judge, and the question of the reasonableness of his judgment is not a question for the jury.\" Koehler v Buhl, 94 Mich 496, 500; 54 NW 157 (1893).\n\n\"Under the rule as settled in this State, the reasons for, or Justice of, the defendant's satisfaction, cannot be inquired into.\" Sax v Detroit, G H \u0026 M R Co, 125 Mich 252, 256; 84 NW 314 (1900).\n\nSee also Isbell v Anderson Carriage Co, 170 Mich 304, 314; 136 NW 457 (1912); Schmand v Jandorf, 175 Mich 88, 95; 140 NW 996 (1913).\n\nHowever, while the reasonableness of the employer's judgment in a \"satisfaction\" contract is not subject to jury review, the jury may address the claim that the dissatisfaction expressed is insincere, in bad faith, dishonest or fraudulently claimed as a subterfuge. Isbell v Anderson Carriage Co, supra.\n\nAs indicated, the plaintiff alleged that defendant's real purpose in terminating his employment was to prevent him from exercising his stock option. Sufficient evidence was introduced upon the subject to permit the jury to infer, if it believed the evidence, that the defendant's decision to discharge the plaintiff was not for cause or because he was not \"doing the job\". \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nWe concur with the judgment of the Court of Appeals that:\n\n\"The evidence, taken in a light most favorable to plaintiff, shows that a bargained-for term of the employment contract was a limitation on the right to discharge plaintiff at will.\" 79 Mich App 531, 533.\n\nThe decision of the Court of Appeals is affirmed. Costs to appellee.\n\nToussaint v Blue Cross-Blue Shield\n\nRyan, J.\n\nThis is a suit for breach of an employment contract. The plaintiff was awarded a judgment in the amount of $72,835.52 upon the verdict of a jury. The Court of Appeals reversed. 79 Mich App 429; 262 NW2d 848 (1977).\n\nI\n\nCharles Toussaint sought the assistance of an employment agency to obtain suitable employment and in early 1967 the agency referred him to defendant, Blue Cross and Blue Shield of Michigan (hereinafter, Blue Cross). After several interviews, Mr. Toussaint was hired by Blue Cross on May 1, 1967 as an assistant to the company treasurer. His duties consisted primarily in analyzing and preparing certain financial reports.\n\nIn early 1971, plaintiff was assigned the duty of administering the company car program. According to some Blue Cross employees who testified at the trial, plaintiff was having difficulty in satisfactorily administering the program and upper-level management had begun to receive some complaints. One such complaint involved the claim that someone had \"set back\" the odometers on several company cars while the vehicles were under plaintiff's control. Mr. William Flaherty, Blue Cross Executive Vice President, requested various reports and documents concerning the matter and ultimately called a meeting in an attempt to resolve the problems. Plaintiff and his supervisor, Leonard Visosky, attended the meeting and were asked to explain why they had been unable to administer the company car program without recurring complaints from those involved in the use of company cars. Apparently dissatisfied with the answers received, shortly after the meeting defendant's management decided to request Mr. Toussaint's resignation and that of his supervisor, Mr. Visosky.\n\nOn May 7, 1972, Allen R. Schaedel, defendant's treasurer, notified the plaintiff of the decision to terminate his employment and immediately requested his resignation in return for a severance pay arrangement whereby plaintiff would continue to receive his salary for six months or until he found other employment. At plaintiff's request, the decision to request his resignation was reviewed by defendant's Personnel Department, the company president, and by the chairman of the Board of Trustees. Upon review, Blue Cross held firmly to its determination that it would be in the best interests of all the parties to terminate the employment relationship with plaintiff.\n\nOn November 20, 1972, plaintiff filed a complaint against Blue Cross in the Third Judicial Circuit Court alleging wrongful termination of his employment contract.\n\nII\n\nPlaintiff's claim is that he has an employment contract with defendant which is partly oral and partly written. It is claimed that the oral portion was made in the course of several pre-employment interviews with Blue Cross representatives. The written portion is claimed to consist of a document entitled, \"Supervisory Manual -- Personnel Practices and Procedures, Michigan Blue Cross\", and a pamphlet entitled, \"Guidelines for Michigan Blue Cross Employees\".\n\nIt is understandable that both the trial court and the Court of Appeals had difficulty in determining precisely what Mr. Toussaint claimed was the agreement concerning the duration of his employment.\n\nThe complaint, while alleging the terms of the agreement concerning the plaintiff's duties, the amount of compensation to be paid him and other details, does not allege a specific term of employment. It does, however, allege in paragraph 5 that \" contract of plaintiff's employment is, in part, set forth in defendant's policy manual entitled, 'Supervisory Manual -- Personnel Practices and Procedures'\". Paragraph 6 of the complaint then incorporates by reference Section VII of the Supervisory Manual entitled Terminations wherein is found paragraph III which states:\n\n\" Policy : It is the policy of the company to treat employees leaving Blue Cross in a fair and consistent manner and to release employees for just cause only.\" (Emphasis added.)\n\nThus it appears to be the plaintiff's claim that he has a contract with Blue Cross for permanent employment terminable not at will but \"for just cause only\".\n\nWe are fortified in drawing that Conclusion by the plaintiff's allegations that Blue Cross violated the alleged employment agreement by terminating Mr. Toussaint's service \"without just cause\" and without according him the requisite warnings, notice, hearing and other termination procedures as provided in the Blue Cross Supervisory Manual. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nWe are satisfied that there is not before this Court, as there was not before the trial court or the Court of Appeals, any claim of employment for a specific term of years or for employment terminable when plaintiff reached age 65, and thus no justiciable issue concerning the application of the statute of frauds. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nIn proof of the oral portion of the employment agreement, Mr. Toussaint testified that he was hired by Blue Cross following a number of meetings with company representatives, including a session of psychological testing and an interview with Mr. Schaedel. When asked upon direct examination if he knew the purpose of the meeting with Mr. Schaedel, Mr. Toussaint testified:\n\n\" A. Yes, because he was the party I was going to be working for and he wanted to meet all qualified applicants for the position; get his feel, whether he felt we would have worked out on the job, that was the purpose of the interview; meet us and see if we were compatible, if we had the proper background, to fill the position.\n\n\" Q. As a result of all this, were you hired?\n\n\" A. Yes, I was.\n\n\" Q. That was May 1?\n\n\" A. May 1st, of '67.\n\n\" Q. Do you recall your starting terms of employment?\n\n\" A. Yes.\n\n\" Q. What was that?\n\n\" A. Well, the salary; which I don't recall the exact dollar amount, I started for, that to do my job, that I would be there until I would reach the age of 65, \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e which then I would have to retire, 'cause they had a mandatory retirement program of which you had to leave on the last day of the month of which you became 65. Mr. Schaedel had indicated to me that as long as I did my job, that I would be with the company for that period of time; showed me a number of documents -- I had asked the question about how secure a job it was and he said that if I came to Blue Cross, I wouldn't have to look for another job because he knew of no one ever being discharged.\" \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e (Footnotes added.)\n\nIn support of his claim that the employment contract was partly written, Mr. Toussaint testified upon cross-examination as follows:\n\n\" Q. Did you have an employment contract?\n\n\" A. I certainly felt I did.\n\n\" Q. Is it your testimony that the three sections of the 'Supervisory Manual' which I have given you were your contract?\n\n\" A. No, not all of my contract, but part of it.\n\n\" Q. Did you sign a document that was entitled or had some title similar to employment contract?\n\n\" A. Not that I recall.\n\n\" Q. Did you ever receive a signed document from the corporation entitled such an employment contract?\n\n\" A. Now that you're phrasing it, I don't believe so.\"\n\nThe \"three sections\" of the Supervisory Manual to which Mr. Toussaint made reference as constituting a part of his employment contract were portions of Sections VII, XII-A and XII-B of the manual entitled, \"Terminations\", \"Employee Complaint Procedures\" and \"Disciplinary Procedures\", respectively.\n\nThus it is clear that at trial the success of the plaintiff's claim that he had a contract for employment terminable only for \"just cause\" and then only if certain specific termination procedures were honored depended upon his success in sustaining the burden of proving that the Supervisory Manual, and particularly the foregoing \"three sections\" were a part of his employment contract, since the termination for just cause language, and termination procedures alleged to have been violated, are to be found in those sections.\n\nWe turn then to examine the record, including the documents in question, to determine whether the plaintiff has sustained that burden. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nThe manual is a large three-ring looseleaf notebook entitled: \"Supervisory Manual -- Personnel Practices and Procedures\". It contained, at the time of trial, 250 pages of material divided among 11 separate tabbed headings labeled:\n\n\"I. Hiring \u0026 Induction\n\n\"II. Supervisory, Adm., Tec., Pay Administration\n\n\"III. Clerical Pay, Administration\n\n\"IV. Vacations\n\n\"V. Leave of Absence\n\n\"VI. Bank Time\n\n\"VII. Terminations\n\n\"VIII. Hours of Work and Overtime\n\n\"IX. General Policy\n\n\"X. Emergency Procedure\n\n\"XII. Complaint and Disciplinary Procedures\". \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nWithin each part are found statements, labeled as policy, touching the whole spectrum of typical personnel policy concerns on virtually every aspect of employee-employer relations likely to be encountered by supervisory personnel and their subordinates in a large business enterprise. Also included are sample printed forms for intra-company job transfer requests, personnel evaluation reports, attendance records, payroll change records, funeral reimbursement requests, flower fund solicitation forms, maternity leave request forms and others.\n\nThe Guidelines is a 32-page three-colored illustrated pamphlet which the plaintiff accurately described as \"somewhat of a summary of what is contained in manual\", with caricature-like drawings on nearly every page as an aid to understanding the text.\n\nThe only direct evidence in the record bearing on the plaintiff's claim that the Supervisory Manual and the Guidelines constituted the written portion of his employment contract is Mr. Toussaint's testimony that the documents were handed to him on the day he was hired, and his testimony that he \"felt\" he had an employment contract and that three portions of the manual described in his complaint were \"part of it\".\n\nNowhere, either in the manual or the Guidelines pamphlet, is there to be found any reference to Mr. Toussaint, by name or otherwise, to his specific duties, job description or the compensation to be paid him. The documents contain no reference to a contract of employment of any kind. Neither document is signed by the plaintiff or any representative of the defendant, nor is a place provided for such signatures.\n\nRepeatedly throughout the manual notebook there appears the declaration that the document is a statement of company policy on the subjects addressed. Pages of the manual are regularly added and deleted by company officials unilaterally, under the supervision of the Blue Cross Personnel Department, without notice to any employee.\n\nThe record bears no evidence that during Mr. Toussaint's several pre-employment interviews any reference was made either to the manual or Guidelines, or even to the subject of a written employment contract. Mr. Toussaint did not learn of the existence of the manual and Guidelines until they were handed to him after he was hired on May 1, 1967. That is in keeping with the testimony of defendant's witnesses that the manual is given to supervisory level employees as an aid in supervising persons in their charge and not as declarative of the contract terms of an employee's hire.\n\nIt is evident that the manual, standing alone, is not an employment contract at all, but instead is what it purports to be: a manual reciting Blue Cross's personnel policies, practices and procedures provided to supervisory level personnel for their use in dealing with employees under their supervision, concerning the entire panoply of subjects germane to corporate personnel relations. While we would be justified to conclude as much as a matter of law from an examination of the document itself, it is unnecessary to do so in light of the uncontradicted testimony of defendant's Executive Vice President, Mr. Flaherty, who testified as follows:\n\n\" Q. Blue Cross has a 'Supervisory Manual' is that right?\n\n\" A. Yes, it has.\n\n\" Q. The 'Supervisory Manuals' were prepared for some person?\n\n\" A. Initially it's a guide for new supervisors and others of their kind.\n\n\" Q. Employee relations?\n\n\" A. That's correct and other matters.\n\n\" Q. The term supervisor manual encompasses the type of work Mr. Toussaint had?\n\n\" A. They principally went to the clerical position, rather than the positions that were so close to management; top management or experienced management.\"\n\nWe have no doubt that circumstances could exist in which an employer's written policies, including those of the defendant, might be incorporated by reference, expressly or impliedly, into an otherwise oral employment contract and thus become a declaration of the employment agreement. This, however, is not such a case. Here the record is wholly devoid of evidence, direct or circumstantial, to justify the Conclusion that the parties agreed that the manual or the Guidelines, or either of them, would become the plaintiff's contract of employment.\n\nDefendant's 250-page manual of personnel policies cannot become its employment contract with some or all of its employees by reason of the company's inadvertence and inattention, or by accident. Neither can defendant be chargeable with incorporating by reference some or all of the terms of its manual into an oral employment agreement with plaintiff simply because a copy of the manual was handed to the plaintiff after he was hired or because the policy manual speaks in general terms to many of the same subjects with which a contract of employment would be concerned, such as sick benefits, vacation time, hours of work and similar provisions.\n\nWhile it is elemental that the question whether a contract has been made, and if so its terms, is for jury determination, \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e it is equally elemental that the question cannot be put to the jury unless there is some evidence produced from which a reasonable juror would be warranted in finding a contract. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nWe have examined the record evidence in the light most favorable to the plaintiff and we are unable to conclude that there was produced any evidence whatever from which a jury was free to conclude that the parties agreed, either expressly or by implication, that the defendant's manual or guidelines, or any part of either, would constitute the plaintiff's contract of employment.\n\nThere is an abundance of evidence in the record concerning the policies and procedures to be followed when an employee's services are thought to be unsatisfactory and his discharge is contemplated. Extensive testimony was taken upon both direct and cross-examination to show the extent to which plaintiff was accorded the benefit of such procedures. That evidence went to the particulars of plaintiff's claim of wrongful termination as alleged in paragraph 8 of the complaint. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e It is clear that plaintiff was given the benefit of some of those procedures and denied others. What is wholly missing from the record, however, is any evidence from which a jury was entitled to conclude that the plaintiff's contract of employment included the Supervisory Manual and particularly that part of it which includes the disciplinary, complaint and termination procedures, as the plaintiff claimed.\n\nEmployment contracts, like other binding agreements, are the product of informed understanding and mutual assent as to the subject matter. As stated by Justice Cooley in the early case of McDonald v Boeing, 43 Mich 394, 396; 5 NW 439 (1880):\n\n\" contract of employment must always be a voluntary act on the part of the employer and of the employed, coinciding in a common understanding.\"\n\nAs plaintiff so appropriately points out in his brief on appeal:\n\n\"The principles [governing formation of an employment contract] are described in 53 Am Jur 2d, [Master and Servant],  15 [p 93], in the following manner:\n\n\"'The formation of the relationship of * * * employer and employee is in general determined by the principles governing the formation of other contracts. The relationship is a product of mutual assent, that is, of a meeting of minds expressed by some offer on the part of one to employ or to work for the other and an acceptance on the part of such other.'\"\n\nNothing in the evidence on the record before us establishes a factual issue, either directly or circumstantially, from which the trier of fact was entitled to conclude that the requisite mutual assent or meeting of minds occurred on the proposition that the defendant's manual or Guidelines, or any part of either, would constitute the plaintiff's employment contract as claimed.\n\nIII\n\nPlaintiff invites our attention to a line of cases which are cited for the proposition that an employee's \"legitimate expectations\" which \"were grounded upon the employer's written policy statements\" \"ought to be enforceable by contract\". The cases are: Cain v Allen Electric \u0026 Equipment Co, 346 Mich 568; 78 NW2d 296 (1956); Psutka v Michigan Alkali Co, 274 Mich 318; 264 NW 385 (1936); Gaydos v White Motor Corp, 54 Mich App 143; 220 NW2d 697 (1974); Clarke v Brunswick Corp, 48 Mich App 667; 211 NW2d 101 (1973); and Couch v Administrative Committee of the Difco Laboratories, Inc, Salaried Employees Profit Sharing Trust, 44 Mich App 44; 205 NW2d 24 (1972).\n\nUpon careful examination of each of the cited cases, we are convinced they are all inapposite to the issues before us. Each of the cases deals not with a complaint for wrongful termination of a contract of employment, but with an employee's entitlement to benefits under bonus or pension plans as deferred compensation for services rendered. The cases are concerned with claims for termination pay (Cain) ; death benefits (Psutka) ; severance pay (Gaydos and Clarke) ; and profit-sharing benefits (Couch). They stand for the familiar proposition that an employee may enforce ancillary contractual obligations of the employer to pay bonus and pension benefits upon performance by the employee of services required as a condition for eligibility, and that entitlement to such benefits cannot be defeated by termination of the claimant's employment.\n\nIn each of the cases cited, policy statements by the employer announced the existence of bonus, profit-sharing or pension benefits and the employer or the claimant-employee satisfied the burden of proof that work already performed was in consideration of the announced benefit and that what was sought was merely deferred compensation. In none of the cases was the employer's right to discharge the claimant questioned. The benefits involved in each case were properly regarded by the courts as inducements extended to employees to become employed or remain employed by the defendant employers.\n\nThe cases are therefore wholly distinguishable from the controversy before us not only upon their facts, but also because the specific policy statements involved concerning employee deferred compensation were of the kind that the employers should reasonably have expected would induce reliance by the employee in joining or remaining in the employer's service.\n\nThe legal theory upon which the employer in such cases is held bound is known as promissory estoppel. It has been defined as follows:\n\n\"A promise which the promisor should reasonably expect to induce action or forbearance on the part of the promisee or a third person and which does induce such action or forbearance is binding if inJustice can be avoided only by enforcement of the promise. The remedy granted for breach may be limited as Justice requires.\" Restatement Contracts, 2d (Tentative Draft No. 2, 1965),  90, p 165.\n\nA comment to  90 adds:\n\n\"The promisor is affected only by reliance which he does or should foresee, and enforcement must be necessary to avoid inJustice. Satisfaction of the latter requirement may depend on the reasonableness of the promisee's reliance, on its definite and substantial character in a relation to the remedy sought, on the formality with which the promise is made, on the extent to which the evidentiary, cautionary, deterrent and channeling functions of form are met by the commercial setting or otherwise, and on the extent to which such other policies as the enforcement of bargains and the prevention of unjust enrichment are relevant.\" Id.,  90, Comment b, p 166.\n\nWhile the plaintiff in this case has not pleaded a claim of promissory estoppel concerning his wrongful termination claim, even if one be assumed, the record before us is without any evidence whatever that Mr. Toussaint relied upon any policy statements contained in the Supervisory Manual or the Guidelines concerning the duration of his employment, notice of termination or entitlement to written or oral warnings prior to termination either as an inducement to become employed by or to remain in the employment of the defendant.\n\nIV\n\nIn view of the plaintiff's failure to present a jury-submissible case on the claim that the Supervisory Manual or the Guidelines, or portions of them, constituted all or part of his employment contract, and the withdrawal by plaintiff's counsel of any claim that the duration of employment was until age 65, the record before us is one of an oral employment contract for permanent service for an unspecified duration. It is well settled that in the absence of distinguishing features or provisions, or special consideration, such contracts are generally regarded as indefinite hirings terminable at the will of either party. Lynas v Maxwell Farms, 279 Mich 684; 273 NW 315 (1937); Ebling v Masco Corp, ante, p 625 (Ryan, J.).\n\nIn Prussing v General Motors Corp, 403 Mich 366; 269 NW2d 181 (1978), we recognized the existence of a line of authorities holding that even in an employment contract terminable at will, discharge of an employee for reasons motivated by bad faith, malice, or based on retaliation or for refusing \"to do that which public policy forbids or condemns\" is actionable. Monge v Beebe Rubber Co, 114 NH 130; 316 A2d 549 (1974). Plaintiff does not claim this is such a case nor is there any evidence in the record to suggest it is. Consequently this is not the proper occasion to consider whether we wish to jurisprudentially align this state with those authorities; neither is this a case in the Prussing mode in which an employee of 29 years service relied upon his \"substantial longevity of employment\" in urging us to adopt the even broader rule that \"an employer cannot terminate a long-term employment contract without cause\".\n\nHere the employment relationship lasted for a period of five years and the plaintiff relied not upon equitable principles derived from \"the evolution of the modern employer-employee relationship\", but upon a claim of an express contract, partly oral and partly written, specifically providing for discharge only for just cause, a claim we hold he has not proved.\n\nWe agree with the Court of Appeals that the trial court erred in failing to grant the defendant's motion for directed verdict, but for the different reason that the plaintiff failed to present a prima facie case in support of his claim that the contract of employment was partly written as alleged.\n\nThe decision of the Court of Appeals is affirmed. Costs to appellee.\n\nAppendix\n\n\"Section XII-B\n\n\"Disciplinary Procedure\n\n\"I. Purpose -- To provide for the administration of fair, consistent and reasonable corrective discipline within Michigan Blue Cross.\n\n\"II. Scope -- All Michigan Blue Cross employees who have completed their new hire probationary period. For the policy covering employees who have not completed their new hire probationary period see Section I of this manual.\n\n\"III. Policy -- It is the policy of the company that:\n\n\"A. Good discipline and acceptable social behavior will prevail at all times among employees.\n\n\"B. Whenever the work performance or personal behavior of an employee does not meet department standards, a series of progressive, corrective measures will be applied. However, before discipline is applied the employee should be counseled about (1) what the standard of performance or behavior is, (2) how he or she is not meeting that standard, (3) what he or she should do to correct the performance or behavior, and (4) what action the supervisor will take if the performance or behavior is not corrected.\n\n\"C. Within the corrective system, discipline will be given only for cause, and that any disciplinary action will fit the problem it is designed to correct.\n\n\"D. For serious problems of behavior which threaten or disrupt company operations and/or other employees, an employee will be suspended.\n\n\"E. Any disciplinary action taken will be properly documented using the Employee Discipline Report (2539 Nov. 71).\n\n\"F. All matters of discipline between a supervisor and an employee will be treated with strict confidence.\n\n\"G. If the problem behavior repeats itself between six months and one year, the last disciplinary action will be applied; and if the behavior repeats itself after one year, it will be treated as a new occurrence.\n\n\"IV. Procedure -- Whenever normal coaching and counseling have failed to correct an employee's problem behavior, or in the case of spontaneous unacceptable behavior the official Disciplinary Procedure should be started.\n\n\"All disciplinary action under this section should be documented using the Employee Discipline Report (2539 Nov. 71), and each section of the report should be discussed with the employee. The employee should then sign the form to indicate his acknowledgement, but if the employee refuses to sign, a notation of that fact will suffice. Copies of the report should then be distributed as indicated.\n\n\"A. Normal Disciplinary Sequence -- The following steps represent the normal sequence of disciplinary action for most types of problem behavior. When the nature of the problem warrants it, however, the sequence should be initiated at an advanced step.\n\n\" 1. Verbal Warning -- The term 'verbal warning' as used in this procedure is used in its conventional sense of 'first warning' as opposed to its literal sense of 'by word of mouth'. The conventional usage is preferred since the verbal warning must be documented and hence might be confused with a written warning which is the second step in the disciplinary sequence. The term 'verbal warning' should also be distinguished from the normal coaching and counseling of an employee which should always precede the institution of the official Disciplinary Procedure.\n\n\" 2. Written Warning -- If the unacceptable behavior continues after an employee has received a documented verbal warning, or if the nature of the behavior warrants it, a written warning to the employee should be issued.\n\n\" 3. Disciplinary Probation.\n\n\"a. Disciplinary probation is defined as a specific reasonable period of time given to the employee to correct problem performance or behavior. Consequently, all due care should be exercised when determining the period of the probation so that it is reasonable in view of the problem behavior sought to be corrected.\n\n\" Note : It is imperative that the employee understand that the probationary period is the maximum amount of time allowed for improvement of the problem behavior and the lack of noticeable improvement for a recurrence of the problem behavior can result in termination at any time prior to the expiration of the probationary period.\n\n\"b. In most cases the probationary period should not exceed 90 days.\n\n\"c. The employee's; next scheduled merit increase should take into account the period of probation and in no event should an increase be granted during the period of probation.\n\n\"d. At any time prior to the expiration of the probationary period, the department finds that the employee's behavior or performance has improved to a satisfactory level, they may at their discretion either reduce or remove the probation.\n\n\" 4. Termination.\n\n\"a. If the performance or behavior which causes the disciplinary probation is not corrected within the period specified, the employee should be terminated. Only in cases of serious possible inJustice should the probationary period be extended but if extended it should not exceed the length of the original probationary period.\n\n\"b. Examples of reasons for termination without prior corrective discipline are covered in Section VII of this manual. Please note, however, that in such cases the employee should first be suspended according to the procedure set forth in paragraph C below.\n\n\" Note : Because of the serious nature of disciplinary terminations, it is recommended that supervisors review the case with their manager and the personnel assistant assigned to the department before notice of the termination is given to the employee.\n\n\"B. Disciplinary Suspension.\n\n\"1. A disciplinary suspension is a method of corrective discipline whereby an employee is given time off without pay for misconduct which, although serious enough to warrant immediate disciplinary action, is not so serious as to warrant termination. (See 'Suspension Pending Discharge' Paragraph C below.)\n\n\"2. At the time the employee is suspended, he is to be informed by his supervisor that he should leave the building immediately and should not return before the date specified by the supervisor.\n\n\"3. Documentation of the incident will be prepared by the supervisor using the Employee Discipline Report and the Employee Copy given to the suspended employee prior to his departure from the building. The date the employee is to return to work should be clearly indicated in the report so as to avoid any possible misinterpretation by the employee.\n\n\"4. Normally a disciplinary suspension should not exceed three days.\n\n\"5. A disciplinary suspension should not be used if it exceeds the magnitude of discipline appropriate for the problem behavior.\n\n\"C. Suspension Pending Discharge -- (This paragraph applies to all proposed terminations except those which are a result of application of the Normal Disciplinary Sequence.)\n\n\"1. When an employee's misconduct is such as to warrant immediate termination under Section VII of this manual, the employee should first be suspended. A suspension provides the necessary time to make proper assessment of the situation and to determine the appropriate course of action.\n\n\"2. At the time the employee is suspended he is to be informed by the supervisor that he should leave the building and that he will be notified if and when he is to return to work.\n\n\"3. Documentation of the incident will be prepared by the supervisor using the Employee Discipline Report. If possible the Employee Copy should be given to the suspended employee prior to his departure from the building.\n\n\"4. It is the responsibility of the department manager to consult with the personnel assistant assigned to the department in order to determine the appropriate course of action and to notify the employee of the Disposition of his case within a maximum of three working days.\n\n\"5. Suspension will normally be without pay; however, an employee shall be paid for time lost due to a suspension if after investigation the employee is allowed to return to work and a penalty less than Disciplinary Suspension is approved.\n\n\"D. Appeal -- An employee who has received disciplinary action and feels that such action is not justified may use the Employee Complaint Procedure defined in Section XII-A of this manual.\n\n\"E. Questionable Cases -- If at any time there is a question about disciplinary procedure or about how to handle a case for which there is no known precedent, the manager should call the personnel assistant assigned to the department for counsel before any action is taken.\"\n\n\"Section VII\n\n\"Terminations\n\n\"I. Purpose -- To define Michigan Blue Cross employee termination policies and procedures.\n\n\"II. Scope -- All Michigan Blue Cross Areas, Divisions and Departments.\n\n\"III. Policy -- It is the policy of the company to treat employees leaving Blue Cross in a fair and consistent manner and to release employees for just cause only.\n\n\"IV. Procedure.\n\n\"A. Notice of Termination.\n\n\" 1. Employee Terminations -- Employees who have completed one year or more service with Michigan Blue Cross are expected to give two week's notice of their intention to terminate. For employees with less than one year's service, but who have completed 90-days of employment, one week notice is expected.\n\n\" 2. Employee Released by Company -- Employees who are released by the organization for such reasons as unsatisfactory work performance or excessive absence and/or tardiness are given 2 weeks notice if the employee has passed the new hire probation period (clerical -- 3 months, S.A.T. -- 6 months). Disciplinary probation in writing will constitute notice if it indicates that the employee will be released if the problem is not corrected. (See Section XII-B, Disciplinary Procedure.)\n\n\"B. Types of Terminations -- Terminations fall into the following categories:\n\n\" 1. Voluntary Terminations -- As a general rule, employees who give notice to resign continue to work until their termination date. If, for good reason, the department manager feels that an earlier termination is advisable, such termination may be arranged after consultation with the Personnel Department. Payment in lieu of notice will be made according to the employee's length of service (Paragraph A above).\n\n\" 2. Involuntary Terminations -- Release of employees from the organization can fall into one of the following categories:\n\n\" a. Release With Notice -- A release with notice for Such Reasons as unsatisfactory work performance or excessive absenteeism and/or tardiness may be given when the employee has completed the employment probationary period. Any such release with notice must be preceded by a disciplinary probation period for the employee. (See Section XII-B, Disciplinary Procedure.)\n\n\" b. Release Without Notice -- In extremely serious situations employees may be released without notice; however, such an employee should be suspended (Section XII-B, Disciplinary Procedure), prior to release. Such suspension will give the supervisor an opportunity to discuss the situation with the personnel assistant assigned to the department to review details of the case. If after this consultation the reasons are serious enough to warrant release, such action can be taken without embarrassment to the supervisor. If the situation is not serious enough to warrant immediate release, other disciplinary measures can be determined.\n\n\"The following types of situations may be the basis for immediate suspension and release.\n\n\"* Misconduct, such as fighting, gambling or use of profane or abusive language toward fellow employees or others.\n\n\"* Furnishing information such as subscriber or confidential employee record to unauthorized persons or agents.\n\n\"* Reporting for work or engaging in company business if mobility or judgment are impaired due to influence of intoxicants or drugs.\n\n\"* Illegal possession or sale of alcohol, drugs, numbers slips or illegal gambling devices.\n\n\"*Dishonesty, including falsification of employee's own or other employee's time cards, falsification of company records, falsification of employment application or medical history, or theft.\n\n\"* Refusal to obey direct orders from the immediate superior or refusal to perform work assigned without valid reasons. (Insubordination.)\n\n\"* Willful damage to property owned, rented, leased or used by the company.\n\n\"* Engaging in a business likely to conflict with or become involved with the business of the company without permission of the Department Manager. (The Manager should consult with the company's General Counsel.)\n\n\"* Failure to notify supervisor or manager during three successive working days of absence. Special Note: If the employee does not notify supervision within the three day period, the employee should be terminated by the Department. A registered letter should be sent to the employee's home notifying him of the termination. A Notice of Termination, unsigned by the employee, should be sent to the Personnel Department. Care should be exercised by the supervisor so that calls to an employee's home regarding the absence cannot be interpreted as the employee's notice of absence.\n\n\"C. Terminal Vacation Pay.\n\n\" 1. Terminations and Releases -- Employees who terminate or are released from the organization will receive terminal vacation pay accrued to the date of termination up to a maximum of three weeks for employees who have not completed five years of service and up to a maximum of four weeks for employees who have completed five years or more. Terminal vacation pay will be received along with the employee's final check.\n\n\" 2. Maternity Absence -- Employees eligible for maternity absence must leave at the end of seven months of pregnancy. Terminal vacation pay will be made to them according to C-1 above. When the employee returns from the maternity absence, an adjusted date of hire will be given. Time worked before the maternity absence will be counted towards the accrual of the next vacation unit or bonus vacation unit.\n\n\" 3. Terminations for Pregnancy -- Employees who stop work for reasons of pregnancy may be eligible for a Maternity Absence, as discussed in Section V. Employees who are not eligible for maternity absence will be terminated. In the case of maternity absence, a doctor's statement indicating the date of delivery should be submitted to the supervisor as soon as possible, but no later than the end of the third month of pregnancy. It is expected that this statement will be obtained during a regular visit to the doctor. The supervisor will attach the doctor's statement to the completed 'Notice of Termination' form and send them to the Personnel Department at least three weeks in advance of the termination date.\n\n\" Note : Also see Section V of this manual regarding Maternity Leave Policy.\n\n\" 4. Termination During Initial Employment Probationary Period -- For employees who have not completed the initial probationary period, refer to Section I-H.\n\n\" 5. Retirement -- (See Section II-E.)\n\n\"D. Termination Form -- 'Notice of Termination', Form No. 2-16R4, * * * will be completed for all employees terminating from the payroll following notice to the Department or District Manager. In all cases the original of the form will be signed by the employee and the Manager.\n\n\"1. The 'Notice of Termination', Form No. 2-16R4, will be completed in duplicate by all departments. The original will be sent to the Personnel Department as soon as possible after notification of termination. The copy is to be retained for the department file.\n\n\"2. The Personnel Department will contact the department and make an appointment for an exit interview with the employee, usually several days prior to the termination.\n\n\"E. Exit Interview -- Every termination, whether a dismissal or resignation, calls for a confidential interview by the Personnel Department. During the exit interview the employee is informed concerning:\n\n\"1. The final check. As a general rule, the final check for a terminated employee in the Home Office and Detroit District Offices will be available on the date of termination. This commitment, however, cannot always be met due to certain schedules or demands on the Payroll Department. Final checks that cannot be made available on the date of termination will be mailed to the employee's home.\n\n\"Checks for employees terminating in the District Offices (other than Detroit area) will be mailed following the receipt of the final records (Time Card, Attendance Record, etc.).\n\n\"2. Disposition of all other employee benefits.\n\n\"3. Surrender to the company of passes, HSI licenses and company property.\n\n\"F. Employee Records -- It is important that the Attendance and Bank Time sheet and time card of a terminating employee be in the Personnel Department in time for the Payroll Department to prepare the final check.\n\n\" 1. Home \u0026 Detroit District Offices -- For those employees terminating on Friday, the Attendance and Bank Time sheet and time card should be in the Personnel Department by Thursday morning (the day before the last day worked). If an employee is released without notice, the Notice of Termination along with backup memos, time cards and attendance sheets should be sent to the Personnel Department immediately.\n\n\" 2. District Offices -- Attendance and Bank Time sheet and time card for a terminating employee must be sent to arrive in the Personnel Department in the Home Office on the day before termination. Notice of Termination with backup memos, time cards and attendance sheet should be sent to the Personnel Department immediately for employees who are released without notice.\n\n\"G. Vacation and Pension Rights -- Employees terminating for any reason, except for Maternity Absence or Military Leave, lose all rights to length of service and will be considered as a new employee in the event of rehire. Eligibility for vacation and pension plan will be calculated from the date of rehire.\"\n\n\"Section XII-A\n\n\"Employee Complaint Procedure\n\n\"I. Purpose. To provide all employees with a means of resolving personal complaints regarding their work or working relationships. Nothing in this procedure is intended to prevent employees from continuing to discuss problems with the Personnel Department staff.\n\n\"II. Scope. This policy applies to all employees of Michigan Blue Cross.\n\n\"III. Policy. Generally, employee complaints relating to any aspect of employment with Michigan Blue Cross should be resolved between the employee and his immediate Supervisor. However, if the complaint is not resolved to the satisfaction of both parties, recourse may be sought at higher levels of management with the help of the Personnel Department. It is understood that any employee who follows this procedure will be treated courteously and that his case will be handled confidentially at all levels. Moreover, he will not be subject to disciplinary action or reproach in any form for utilizing the Employee Complaint Procedure. Documentation of complaints will not be placed in an employee's file, but will be held by the Personnel Department as a basis for future decisions in resolving complaints.\n\n\"The Personnel Department will provide confidential counseling service for personal employee problems as required.\n\n\"IV. Procedure.\n\n\"A. Steps to Resolve a Complaint --\n\n\"1. The employee should discuss any complaint with his immediate Supervisor. If the employee is not satisfied with the results, he may request further consideration at the next step. If the nature of the complaint is such that the employee does not wish to discuss it with the Supervisor, the employee may initiate the complaint through step number two. If the employee makes no further appeal within ten working days after receiving the decision, it will be assumed that the complaint has been resolved to the employee's satisfaction.\n\n\"2. The employee may request a conference with his Supervisor's immediate Supervisor, or he may contact the Employee Relations Coordinator in the Personnel Department. In case the employee elects to contact the Employee Relations Coordinator, an appropriate staff member of the Personnel Department may be appointed to discuss the situation with the employee in an attempt to resolve the complaint. In either case, the employee may be accompanied by another employee of his choice, if he so desires.\n\n\"3. If the employee or the Personnel Department is still not satisfied with the Disposition of the complaint at this point, either the employee or the Personnel Department may appeal the decision up through the appropriate levels of management. Opportunity for Discussion will be provided 'up the line' of management, and if necessary, to the Employee Relations and Compensation Committee and the Company President.\n\n\"B. Responsibility of Management -- Documentation and Response Time.\n\n\" 1. Documentation -- When discussing a complaint with an employee, the immediate Supervisor may inform the employee verbally of the decision or answer. Except for very minor complaints which are resolved immediately, each complaint and the decision or answer must be documented and forwarded to the Employee Relations Coordinator at each step of the Procedure.\n\n\" 2. Response Time -- As a general rule, the employee should not have to wait more than two or three working days to receive an answer or decision from the Supervisor. In no case should an employee have to wait more than ten working days for an answer at any step.\n\n\"C. Responsibility for Action -- Fact finding, policy interpretation, written documentation, and follow-up will be the responsibility of the Supervisor at the first step, the Personnel Department or Manager at the second step, and the appropriate management person at succeeding steps.\n\n\"D. Employee Counseling -- It is important to realize that problems which affect performance or work relationships may be discussed confidentially with the Personnel Department staff. There are many instances when this helpful consultation serves an employee's needs apart from the Employee Complaint Procedure. Employees are encouraged to utilize this less formal counseling service as the need arises.\"\n\n\u003cspan class=\"fn\"\u003e1. Lynas v Maxwell Farms, 279 Mich 684, 687; 273 NW 315 (1937).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Toussaint v Blue Cross \u0026 Blue Shield of Michigan, 79 Mich App 429, 434-435; 262 NW2d 848 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Court further concluded that the jury's verdict could not be sustained as an oral contract for a specified term because such a contract would violate the provision of the statute of frauds concerning contracts which cannot be performed within one year. Id., pp 435 -439.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Lynas, supra, p 687.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. It said that \"distinguishing features, promises, or consideration in addition to services to be rendered remove a case from the general rule\". Ebling v Masco Corp, unreported opinion (Docket No. 29916, November 9, 1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Ebling had pleaded an oral contract of employment which he claimed could only be terminated for cause. In support of that claim he testified that an officer of Masco had agreed in the course of negotiations and as an inducement to Ebling that he would personally review his job performance and that he would not be discharged if he was doing his job.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eToussaint testified that he had been interviewed by and, on the date of his hire, met with an officer of Blue Cross who \"indicated to me that as long as I did my job that I would be with the company\" until mandatory retirement at age 65. The officer gave him a Supervisory Manual. Toussaint asked \"how secure a job it was and [the officer] said that if I came to Blue Cross, I wouldn't have to look for another job because he knew of no one ever being discharged\". On cross- examination he was asked \" you have an employment contract?\" and responded \"I certainly felt I did\", and that the pertinent sections of the Supervisory Manual were part of \"my contract\".\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. It might be said that there is no contract at all, for the refusal to perform or accept services is not a breach but merely the exercise of a reserved power to terminate. Of course, each party is bound to perform to the extent wages or services have been accepted from the other party. 1 Corbin on Contracts,  96, pp 419-420.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. See Restatement Contracts, 2d (Tentative Draft No. 2, 1965),  81, p 64. 1A Corbin on Contracts,  152, pp 2-6. Stauter v Walnut Grove Products, 188 NW2d 305, 311 (Iowa, 1971) (employment contract invalid only if lack of mutuality amounts to lack of consideration).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. See The King v Inhabitants of Hampreston, 5 TR 205; 101 Eng Rep 116 (1793); Fawcett v Cash, 5 Barn \u0026 Ad 904; 110 Eng Rep 1026 (KB, 1834); Anno: Duration of contract of hiring, 11 ALR 469.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. See Moline Lumber Co v Harrison, 128 Ark 260; 194 SW 25; 11 ALR 466 (1917); Jones v Trinity Parish, 19 F 59 (CC WDNC, 1883); Pinckney v Talmage, 32 SC 364; 10 SE 1083 (1890).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. See Graves v Lyon Bros \u0026 Co, 110 Mich 670; 68 NW 985 (1896); Chamberlain v Detroit Stove Works, 103 Mich 124; 61 NW 532 (1894); Jones v Manhattan Horse Manure Co, 91 NJL 406; 103 A 984 (1918).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. In Franklin Mining Co v Harris, 24 Mich 115 (1871), the question was whether it was error for the trial Judge to refuse the requested charge:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"There is no evidence in this case of a contract made by the company to employ the plaintiff for a definite period, and the jury must find for the defendant.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Court concluded:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\" are inclined to agree with the circuit Judge that there was some evidence from which the jury might infer that the employment of Harris as mining captain was for at least a year.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eHarris testified that he hesitated to give up his existing position, apparently a permanent one, for uncertain employment, that he told the agent negotiating the employment for the company that \"the Franklin mine management changed so often he did not know what might happen\", that the agent replied, \"there was no fear of that; he would see the plaintiff all right\", that they talked about salary and the agent agreed to pay $200 more than originally offered saying \"he would not let [$100] or [$200] stand in the way of getting the man he wanted\".\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Court concluded:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\" think the jury were not wholly unwarranted in finding from it that the minds of the parties met upon an engagement which was not to be terminated under a year.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Wood, Master \u0026 Servant (Albany: Parsons, 1877),  134, p 272.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Also cited were Tatterson v Suffolk Mfg Co, 106 Mass 56 (1870); Wilder v United States (Wilder's Case), 5 U.S. Ct Clms 462 (1869); DeBriar v Minturn, 1 Cal 450 (1851).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. In Franklin Mining the jury was permitted to infer the contract duration from the circumstances surrounding its formation. (See fn 11, (supra) .)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn Tatterson the plaintiff alleged a hiring by the year, and the employer a hiring by the quarter. The Court said:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"There was no express stipulation, either written or oral, which fixed the time for the continuance of the employment of the plaintiff by the defendant. That element of their contract depended upon the understanding and intent of the parties; which could be ascertained only by inference from their written and oral negotiations, the usages of the business, the situation of the parties, the nature of the employment, and all the circumstances of the case. It was an inference of fact, to be drawn only by the jury. The whole question, What was the contract existing between the parties, at the time the defendants undertook to terminate the employment? was properly submitted to the jury.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn DeBriar the plaintiff was hired as a barkeeper for a monthly wage and the use of a room while employed. No definite period of employment was stated. He was discharged and notified that he must vacate his room at the end of the month. He refused, was ejected, and brought an action for damages for being so ejected. The jury's award in his favor was reversed, the Court ruling that he had no cause of action as he had no right to remain in the room and the employer did not use excessive force in evicting him.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWilder's Case was not an employment case at all. The claimant's assignors contracted with the United States Army to transport rations across the country at certain prices which varied according to the time of year. The agreement specified no period of duration. They acted under the contract for two years and then entered into a new contract with a government quartermaster. The government refused to pay under the new contract on the ground that the former one had not been terminated by reasonable notice. The Court of Claims found in favor of the claimants.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eTwo Scotch cases were also cited by Wood. In Mitchell v Smith, 14 SC Sess Cas (1st Series) 358 (1836), the question was whether the dismissal of a bank manager under contract at the pleasure of the directors was justified under the circumstances.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eFosdick v North British R Co, 23 Scot, Jur 118; 13 SC Sess Cas (2d Series) 281 (1850), is described in 1 Labatt, Master and Servant (Rochester, NY: Lawyers' Cooperative Publishing Co, 2d ed, 1913),  201, p 633, fn 2:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Where it was stipulated that a servant might be dismissed at the pleasure of his employer, and without reason assigned, on receiving a fortnight's warning or a fortnight's wages, and he was dismissed on a charge made against him by a coemployee, which he alleged to be unfounded, it was held that he could not recover damages on the ground of having been dismissed, but based on the theory that the employer had authorized or adopted the proceedings of the co-employee who had brought the charge against him.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Perry v Wheeler, 75 Ky 541 (1877).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Lord v Goldberg, 81 Cal 596; 22 P 1126 (1889).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Sullivan v Detroit, Y \u0026 AA R Co, 135 Mich 661; 98 NW 756; 64 LRA 673 (1904).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Elderton v Emmens, 4 CB 479; 136 Eng Rep 594 (1847), rev'd on other grounds 6 CB 160; 136 Eng Rep 1213 (1848); aff'd 4 HLC 624; 10 Eng Rep 606; 13 CB 495; 138 Eng Rep 1292 (1853).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe facts in Elderton were similar to those in Sullivan. The Court of Common Pleas said \" that [the expression 'permanent attorney and solicitor'] means an employment for life, or so long as the company shall exist, or what, we have no means of judging\". It held that \"permanent\" as used in the resolution appointing him meant general employment as opposed to special or occasional employment and that if the parties had intended otherwise, the agreement would have included other provisions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Louisville \u0026 N R Co v Offutt, 99 Ky 427; 36 SW 181 (1896), involved a strikebreaker who claimed he was promised that, after the strike ended, he would be reinstated in a position from which he had earlier been discharged for good cause. After the strike, he was kept on the payroll for two months with directions to wait until a place was found for him. He was then discharged. The court found that the evidence failed to support any contract except for employment during the strike. It went on, however, to state \" if it be conceded that there was a contract for regular * * * 'work * * * so long as plaintiff did faithful and honest work' \", it was \"indefinite as to time or term of employment or service, and was, therefore, subject to be terminated at any time at the discretion of either party.\" Wood on Master \u0026 Servant was cited for the proposition that \"when the term of service is left discretionary with either party, or when it is not definite as to time,\" either party may terminate at any time and \"no cause therefor need be alleged or proved\". As discussed in text this attributes to Wood a stricter rule than actually espoused in his treatise.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Carnig v Carr, 167 Mass 544; 46 NE 117; 35 LRA 512 (1897).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. \"Plaintiff's proofs, taken as true, showed a contract for permanent employment. Such a contract is for an indefinite period and, unless for a consideration other than promise of services, the employment was terminable at the will of either party. Lynas v Maxwell Farms, 279 Mich 684, and cases there cited.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The action of plaintiff in giving up the practice of his profession was but an incident necessary on his part to place himself in a position to accept and perform the contract and not a price or consideration paid to defendant for the contract of employment. Lynas v Maxwell Farms, supra; Lord v Goldberg, 81 Cal 596; 22 P 1126; 15 Am St Rep 82 [1889].\" Adolph v Cookware Co of America, 283 Mich 561, 568; 278 NW 687 (1938).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Toussaint v Blue Cross \u0026 Blue Shield of Michigan, supra, p 435.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. See Jones v Graham \u0026 Morton Transportation Co, 51 Mich 539; 16 NW 893 (1883); 53 Am Jur 2d, Master \u0026 Servant,  49, p 123.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. There is indeed a practical difference between definite and indefinite hirings. A contract for a definite term has been generally regarded to be within the section of the statute of frauds concerning an \"agreement that, by its terms, is not to be performed within 1 year from the making thereof \", MCL 566.132; MSA 26.922, while an agreement for an indefinite term is generally regarded as not being within the proscription of the statute of frauds. See 2 Corbin, (supra) ,  446-447, pp 549- 556; Hobbs v Brush Electric Light Co, 75 Mich 550; 42 NW 965 (1889); Sax v Detroit, GH \u0026 M R Co, 125 Mich 252, 255-256; 84 NW 314 (1900); Adolph v Cookware Co of America, supra. Employers are thus protected from an entirely oral agreement for a definite term in excess of one year but are not so protected against jury resolution of a claim of an oral agreement for an indefinite term.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIt is not contended that the statute of frauds requires that an employment contract providing for job security must be in writing but, rather, that such a provision in an employment contract for an indefinite term is not legally enforceable because where the term is indefinite the contract is, despite such a provision, terminable at will.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhere the employer has not agreed to job security, it can protect itself by entering into a written contract which explicitly provides that the employee serves at the pleasure or at the will of the employer or as long as his services are satisfactory to the employer.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIt may indeed not be practicable to enter into a written contract in many kinds of hirings, and there is a risk that a claimed oral promise of job security may be false. Most lawsuits, civil and criminal, however, depend largely, often entirely, on testimonial evidence. Only a few kinds of claims cannot be proven solely by testimony. A promise of job security is not a claim barred unless in writing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. It was therefore unnecessary for Toussaint to prove reliance on the policies set forth in the manual.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Wood v Lucy, Lady Duff-Gordon, 222 NY 88; 118 NE 214 (1917); McCall Co v Wright, 133 AD 62; 117 NYS 775 (1909).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Disciplinary Procedure\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"II. Scope -- All Michigan Blue Cross employees who have completed their new hire probationary period.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Terminations\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"II. Scope -- All Michigan Blue Cross Areas, Divisions and Departments.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28 Cain v Allen Electric \u0026 Equipment Co, 346 Mich 568; 78 NW2d 296 (1956).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29 3A Corbin, (supra) ,  674, pp 205-206.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30 Perry v Sindermann, 408 U.S. 593, 601-603; 92 S Ct 2694; 33 L Ed 2d 570 (1972).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31 In holding that \"the interest of a licensee in obtaining a renewal of his liquor license is very much like the property interest of Sindermann\", this Court commented on that decision:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Although there was no official tenure system, the Court in Sindermann found that a quasi-tenure system had been created in practice and that something approaching a mutual understanding existed since teachers in Sindermann's situation were rehired from year to year as long as they continued to perform their duties successfully. Also the Court found that the teachers had legitimately relied on this practice.\" Bundo v Walled Lake, 395 Mich 679, 693; 238 NW2d 154 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32 See Cain v Allen Electric \u0026 Equipment Co, supra; Psutka v Michigan Alkali Co, 274 Mich 318; 264 NW 385 (1936); Gaydos v White Motor Corp, 54 Mich App 143; 220 NW2d 697 (1974); Clarke v Brunswick Corp, 48 Mich App 667; 211 NW2d 101 (1973); and Couch v Administrative Committee of the Difco Laboratories, Inc, Salaried Employees Profit Sharing Trust, 44 Mich App 44; 205 NW2d 24 (1972).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33 Ebling v Masco Corp, post, p 636, fn 4, opinion of Ryan, J.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34 In Schmand v Jandorf, 175 Mich 88; 140 NW 996 (1913), Schmand was hired as a candy maker for a year, subject to the control and satisfaction of Jandorf. A directed verdict was entered in his suit for wrongful discharge because the Judge found there was no question that Jandorf was dissatisfied with his work. This Court affirmed, following Koehler v Buhl, 94 Mich 496; 54 NW 157 (1893); Sax v Detroit GH \u0026 M R Co, 125 Mich 252; 84 NW 314 (1900); and other satisfaction cases, and said:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Had it been the intention that the contract should continue, in case plaintiff should 'perform all of his duties as a candy maker and shall serve said first party diligently and according to his best ability in all respects,' it would have been quite unnecessary to have added the clause as to the satisfaction of the defendant, and it would then have been a question for a jury whether plaintiff had performed his contract or not.\" (Emphasis supplied.) See Stauter v Walnut Grove Products, supra, pp 308-309.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35 See Martin v Southern R Co, 240 SC 460; 126 SE2d 365 (1962); Ogden v George F Alger Co, 353 Mich 402; 91 NW2d 288 (1958) (employee denied material breaches of obligations assumed by him; question of breach was for jury).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36 See Ward v Consolidated Foods Corp, 480 SW2d 483 (Tex Civ App, 1972) (employer claimed discharge was for failure to correct sanitation deficiencies; employee claimed he performed duties and discharge was to prevent his exercise of stock option and so that new president could bring in his own men. Question of cause was for jury).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37 See Strahm v Aetna Casualty \u0026 Surety Co, 285 So 2d 679 (Fla App, 1973) (jury question whether plaintiff's refusal to accept reassignment or to resign was insubordination and whether discharge was \"for cause \"). Rochester Capital Leasing Corp v McCracken, 156 Ind App 128; 295 NE2d 375 (1973); Mason v Lyl Productions, 69 Cal 2d 79; 69 Cal Rptr 769; 443 P2d 193 (1968); Dixie Glass Co v Pollak, 341 SW2d 530; 91 ALR2d 662 (Tex Civ App, 1960).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38 See Martin v Southern R Co, supra; Mash v Missouri P R Co, 341 SW2d 822 (Mo, 1960).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39 Blue Cross maintained that there was no oral contract, its supervisory manual did not establish a contract and Toussaint was discharged because of personality conflicts with other employees and insubordination in a meeting with Blue Cross executives inquiring into his alleged mismanagement of the company's car pool. Toussaint denied the allegations.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe question of cause for discharge was thus properly one for the jury. It was for the jury to resolve the factual issues whether there was a contract and whether there were personality conflicts and Toussaint was insubordinate, and further, because there was no allegation that Toussaint had otherwise breached the employment contract, to decide whether there was cause for discharge.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn Ebling, Masco alleged that there was no agreement to discharge only for cause and after review, and that Ebling was, in fact, discharged only after review and for good cause -- poor judgment in hiring personnel, firing a manufacturer's representative before securing legal advice as instructed, delivering goods on consignment against company policy, causing customer complaints, and giving his secretary's phone number to a customer. Ebling alleged that he was guilty of no misconduct, there had been no complaints about his work, and that he was discharged without hearing and the agreed- upon review, an opportunity to correct the situation, and cause, and thereby denied the opportunity to exercise his stock option.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe evidence was conflicting on whether Ebling was guilty of the alleged misconduct, whether there was good reason to find his performance inadequate and whether he was discharged for any specific conduct or, rather, because his immediate supervisor did not like him and he would soon be eligible to exercise the stock option. Thus, the issues of actual motivation and good cause were submissible to the jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eCONCURRING FOOTNOTES\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 In Lynas, defendant prevailed upon plaintiff to sell his restaurant business in Detroit, which he did at a loss, and to become manager of defendant's Birmingham store. It was understood that plaintiff was to have a \"permanent lifetime position with the defendant\". Plaintiff was discharged after approximately 14 months. He sued, claiming damages for breach of a contract to be employed \"permanently\" and \"for life\". It was in that context that this Court stated:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Contracts for permanent employment or for life have been construed by the courts on many occasions. In general it may be said that in the absence of distinguishing features or provisions or a consideration in addition to the services to be rendered, such contracts are indefinite hirings, terminable at the will of either party. Illustrative of this type of case are the following: Lord v Goldberg, 81 Cal 596; 22 P 1126; 15 Am St Rep 82 [1889]; Rape v Mobile \u0026 O R Co, 136 Miss 38; 100 So 585; 35 ALR 1422 [1924]; Arentz v Morse Dry Dock \u0026 Repair Co, 249 NY 439; 164 NE 342; 62 ALR 231 [1928]. A similar view has likewise been adopted by this Court in Sullivan v Detroit, Y \u0026 AA R Co, 135 Mich 661; 64 LRA 673; 106 Am St Rep 403 [98 NW 756 (1904)].\" Lynas, supra, 687-688.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 The exchange for the promise is something other than a promise. 1 Restatement Contracts,  12, 52, pp 10-12, 58-59.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 In Lynas, immediately after the sentences quoted in fn 1, the Court said:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"On the other hand, there is to be found that class of cases where permanent employment has been offered for a special consideration other than the services to be performed by the employee. Typical examples thereof are those cases in which the employee releases a claim held by him against the one offering the employment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Plaintiff directs our attention to the following decisions, all of which fall within the classification last mentioned. Brighton v Lake Shore \u0026 M S R Co, 103 Mich 420 [61 NW 550 (1894)]; Stearns v Lake Shore \u0026 M S R Co, 112 Mich 651 [71 NW 148 (1897)]; Sax v Detroit, G H \u0026 M R Co, 125 Mich 252; 84 Am St Rep 572 [84 NW 314 (1900)]; Carnig v Carr, 167 Mass 544; 46 NE 117; 35 LRA 512; 57 Am St Rep 488 [1897]. In each of the cited cases there is to be found an element of consideration in addition to the services for which the contract was made.\" Lynas, supra, 688.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 The defendant registered no objection to the court's instruction to the jury concerning its duty to determine whether the plaintiff was discharged for cause and, in fact, specifically requested that the court instruct the jury to return a verdict for plaintiff if it found a \"discharge for cause\" contract and a discharge by defendant without cause.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 Paragraph 8 of plaintiff's complaint states:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"8. Said termination was wrongful and contrary to the contract of employment between the parties as set forth in the policy manual for the following reasons:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"A. Plaintiff was terminated without just cause. (Section VII, paragraph III);\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"B. Defendant failed to provide plaintiff with notice of termination. (Section VII, paragraph IV-A); and\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"C. Defendant failed to provide plaintiff with written or oral warnings. (Section 9.131 and 9.132.)\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe parenthetical references are to sections of the Supervisory Manual.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 While plaintiff made no specific allegation in his complaint concerning the duration of his employment contract, he testified that defendant's treasurer, Mr. Schaedel, assured him that he would be employed until age 65.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOn closing argument, however, plaintiff's counsel stated:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The defendant also wants to tell you that my client claims that he had a permanent contract and that he was guaranteed employment until the age 65. You never heard me say that. It's as simple as that.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"We are not on a claim that the claimant was guaranteed for life and that it was breached. We are here because a contract was made that said we're going to fire only if there is just cause, that you're going to be allowed fair hearings, and that after doing something wrong there's going to be progressive disciplinary procedures. That's what was breached and because of that breach, we're claiming certain damages that flow from that.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 See fn 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 This testimony is not evidence which would permit a finding of a distinguishing feature or provision qualifying the employer's right to terminate the employment contract at will. Compare Ebling v Masco Corp, ante, p 625 (Ryan, J.), wherein there was evidence from which it could be found that the parties negotiated over, and agreed to, certain qualifications concerning the employer's right to terminate the employment contract.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 Because these three sections are alleged to constitute a significant part of plaintiff's employment contract and because they are illustrative of the general tenor of the language which appears throughout the Supervisory Manual, we reluctantly burden the case report with a reproduction of them as an appendix to the opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 The exhibit contained no tabbed Section XI.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7 McIntyre v Smith-Bridgman \u0026 Co, 301 Mich 629; 4 NW2d 36 (1942); Hall v Detroit, 383 Mich 571; 177 NW2d 161 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8 Leslie v Mendelson, 302 Mich 95, 104; 4 NW2d 481 (1942).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9 See fn 1.\u003c/span\u003e\n\n",
    "body_length": 152079,
    "citedas": [
      "292 N.W.2d 880",
      "408 Mich. 579"
    ],
    "attorneys": "Gottlieb \u0026 Goren, P.C., for plaintiff Toussaint. Harry Riseman for plaintiff Ebling. Long, Preston, Kinnaird \u0026 Avant (by Grady Avant, Jr., and Joseph F. Page, III) for defendant Blue Cross \u0026 Blue Shield of Michigan. Cross, Wrock, Miller \u0026 Vieson (by W. Robert Chandler and Michael A. Holmes) for defendant Masco Corporation. Amici Curiae: William B. Daniel for Chrysler Corporation. Beaumont, Smith \u0026 Harris (by Dwight H. Vincent) for Employers Association of Detroit.",
    "category": [
      "243",
      "252"
    ],
    "judges": "Levin, J. (for reversal in Toussaint and affirmance in Ebling). Kavanagh, Williams, and Blair Moody, Jr., JJ., concurred with Levin, J. Ryan, J. Coleman, C.j., and Fitzgerald, J., concurred with Ryan, J. Ryan, J., Dissenting. Coleman, C.j., and Fitzgerald, J., concurred with Ryan, J.",
    "citation_count": 13
  }
}
