{
  "id": "YIOdPmYBTlTomsSBnMXs",
  "document": {
    "title": "Loftin and Woodard Inc. v. United States",
    "full_title": "LOFTIN AND WOODARD, INC., K.C. LOFTIN AND MARIE LOFTIN, E. A. WOODARD AND VIRGINIA WOODARD CROSS-APPELLEES, v. UNITED STATES OF AMERICA CROSS-APPELLANT",
    "jurisdiction": "Fifth Circuit",
    "date": "1978-08-09T00:00:00.000Z",
    "docket": "No. 76-1839",
    "body": "JAMES LAWRENCE KING, District Judge.\n\nTaxpayers appeal the decision of the district court in which deficiencies were assessed against them, after a full trial,\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e as follows:\n\n(i) against the Loftin and Woodard Corporation for fiscal years 1963, 1964 and 1966;\n\n(ii) against K.C. and Marie Loftin, as joint taxpayers, for calendar years 1962, 1963 and 1964; and\n\n(iii) against E.A. and Virginia Woodard, as joint taxpayers, for calendar years 1963 and 1964.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nIn addition, the district court found Loftin liable for fraud as to tax years 1963 and 1964.\n\nAt the same time, we are confronted with a cross-appeal lodged by the Government. In essence, the Government asserts that the district court's failure to find fraud as to the Loftin \u0026 Woodard Corporation was incorrect. Further, the cross-appeal focuses on the district court's decision not to utilize a late filing penalty to diminish the refund found to be owing to the corporation on the basis of an audit of its 1961 return.\n\nI. THE FACTUAL BACKGROUND:\n\nThe factual context of this case is quite complex.\n\nWe have before us three sets of taxpayers: K.C. and Marie Loftin [hereafter \"Loftin\"]; E.A. and Virginia Woodard [hereafter \"Woodard\"]; and the Loftin and Woodard Corporation [hereafter the \"Corporation\"]. The Loftins filed a joint return on a calendar year accounting basis, as did the Woodards. The Corporation filed its return on a fiscal year interval beginning on June 1 of each year.\n\nLoftin and Woodard were the sole stockholders of the Corporation. K.C. Loftin owned a 65% interest. The remaining 35% was under Woodard's control. The Corporation was created primarily for the purpose of clearing land. It was this task to which it turned most of its efforts in the tax years at issue on this appeal - that is, 1961-1967.\n\nThe central transaction in this appeal involves the purchase by the Corporation of over nine thousand acres of wooded land in Yazoo County, Mississippi on April 17, 1963. Prior to the corporate purchase, Loftin and Woodard contemplated the formation of a partnership for the consummation of the transaction. However, because the partnership would have been unable to secure adequate funds in the requisite period of time, the would-be partners decided that the Corporation would have to serve as the purchasing entity.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e On April 17, the Corporation secured title to the first six thousand acres of the Yazoo property at a cost of $225,542.30.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Prior to the closing, the Corporation adopted a resolution emphasizing its intention to sell the land to the partnership once the partnership secured the requisite funds.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e The transfer eventually occurred on November 1, 1963 - almost five months after the Corporation's purchase. At this time, the partnership paid the Corporation the amount that the latter entity had paid on April 17.\n\nIt is significant that prior to the November 1 transfer, the Corporation began its clearing operation on the property. These operations were performed pursuant to the authorization of the partnership. Although no actual clearing was done prior to November 1, the Corporation did repair several structures already on the land; clear boundary lines; and establish further drainage facilities, all in preparation for the eventual clearing operation. In fact, no land was cleared in fiscal year 1963.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e By the end of fiscal year 1964, eight hundred acres of the Yazoo land had been cleared. By 1967, over nine thousand, six hundred acres were cleared.\n\nIn arriving at a more complete understanding of the nature of this land clearing operation, one must understand the manner in which the taxpayers reflected it on paper.\n\nIt is uncontested that the expenses incurred in the initial stages of the operation - that is, from April 17, 1963 to May 31, 1964 (the end of fiscal 1964) - were not registered in a separately labeled category on the corporate ledger. Instead, these expenses were spread among some of the other corporate expense accounts in existence at that time. It was not until the end of the corporate fiscal year 1965, when 5,700 acres had been cleared, that the corporate ledger carried a separate category for Yazoo related expenses.\n\nThe record of payments made by the partnership is equally ambiguous in the early stages of the clearing operation. The partnership ledger reflects a payment to the Corporation on the final day of the partnership's tax year, December 31, 1964.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Payments by the partnership to the Corporation were consummated on paper by the entry of credits to an account receivable due from the Corporation.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nThe remainder of the 9,620 acres within the control of the partnership by May 31, 1967 was cleared in fiscal 1966 and 1967. Thus, payments for the land clearing operation progressed, on paper, as follows:\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nDATE PARTNERSHIP CORPORATE\n\nACCT. ACCT.\n\nRECEIVABLE PAYABLE\n\n12/31/64 -$250,000\n\n5/31/65 +$325,000\n\n12/31/65 -$196,000 +$121,000\n\n12/31/66 -$35,000\n\n5/31/67 +$35,000\n\n-$481,000 +$481,000\n\nCredits entered in the partnership account receivable theoretically reflected payments made by the partnership to the Corporation. Receipt of those payments by the Corporation was reflected by a debit to its account payable. As is apparent on the face of these transactions, the Corporation habitually made its entries on the final day of its respective tax year and the partnership did likewise. The one exception to this habit, the corporate entry on December 31, 1965, was occasioned ostensibly by a desire to equalize the recordation of payments made and received up to and including that date.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nAt the same time that the payments for these operations were being recorded, the Corporation incurred expenses that exceeded, in toto, the payments made.\n\nThis, then, is the material from which the district court fashioned the constructive dividend contested herein. The district court, after an extensive trial, decided that a constructive dividend accrued to Loftin and to Woodard on the basis of the work performed by the Corporation for the partnership. The unreported income embodied in the constructive dividend finding formed the core of the deficiency asserted by the district court against both taxpayers for 1963, 1964 and 1966.\n\nAt the same time, the lower court decided that several expenditures made by the Corporation on behalf of Loftin and Woodard were not business related and were, therefore, also in the nature of constructive dividends. These other expenses centered on trips taken by the taxpayers; advances received by them; and the payment of personal insurance premiums, political campaign expenses, and football tickets by the Corporation for Loftin and/or Woodard. The taxability of these items in terms of the constructive dividend question is not on appeal. However, their relationship to the finding of fraud made as to taxpayer Loftin is hotly contested and is the subject of Section III, infra.\n\nFinally, there is one further aspect of the land clearing operation with which we must concern ourselves on this appeal - the expenses incurred by the Corporation. While this issue is at the core of the constructive dividend question, it poses an additional problem for our consideration. The district court found that the corporate expenses incurred in the land clearing operation were, for the most part, non-deductible as ordinary and necessary business expenses. The ultimate resolution of this issue is highly dependent upon the determinations we make with regard to the constructive dividend issue.\n\nThe only other issue with which we are confronted on this appeal does not stem from the land clearing operation. As will be discussed in greater detail in a later portion of this opinion, this final matter is related to an audit of the Corporate return filed for 1961.\n\nIn sum, we are confronted with a factual context which may be viewed from a tripartite perspective. First, there is the relationship of the land clearing operation to the issue of a constructive dividend. Second, there is the relationship of the land clearing operation to the corporate decision to deduct expenses arising therefrom. And third, there is the relationship of (i) the constructive dividend, found to have arisen from the land clearing operation, along with the corporate payment of several expenses incurred by the taxpayers to (ii) the intent of the taxpayers in not declaring these payments as income. An additional issue, unrelated to the above, centers on the Corporation's 1961 return.\n\nThis is a complex case, admitting of no simple answers. An excellent trial record, along with lengthy and effective appellate briefs and argument have made our task much easier. The record clearly reflects that Judge Hunter diligently and relentlessly pursued the clarification of this factual ticket.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e In the end, we are \"mere mortals unendowed with cosmic tax wisdom. We have performed our task as well as our fallible mentalities and compositions will permit.\" Cornelius v. Commissioner of Internal Revenue, 494 F.2d 465, 472 (5th Cir. 1974).\n\n1107 pages of record; 264 pages of briefs; and almost two hours of oral argument later, these are our conclusions.\n\nII. THE CONSTRUCTIVE DIVIDEND ISSUE:\n\nWhen a corporation confers an economic benefit upon a shareholder, in his capacity as such, without an expectation of reimbursement, that economic benefit becomes a constructive dividend, taxable to the respective shareholder. This benefit is taxable to the shareholder whether or not the corporation intended to confer a benefit upon him. See, Crosby v. United States, 496 F.2d 1384 (5th Cir. 1974); Gibbs v. Tomlinson, 362 F.2d 394 (5th Cir. 1966).\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nSection 61(a) of the Internal Revenue Code directs that a dividend shall be included in a taxpayer's gross income. Section 316(a) indicates that a dividend encompasses \"any distribution of property made by a corporation to its shareholders\" from earnings and profits accumulated after 1913 or from earnings and profits of the taxable year. That the provision of services by a corporation is cognizable under the concept of \"property\" is assured by Regulation 1.317-1.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nSimply stated,\n\na taxpayer can be charged with disguised or constructive dividend income even though the corporation has not observed the formalities of dividend declaration, and has not made a pro rata distribution to the entire class of stockholders, and even though neither the corporation nor the shareholder intended a dividend and the corporation did not record the distribution as a dividend for bookkeeping purposes.\n\nCrosby, 496 F.2d at 1388.\n\nIn the context of a closely held corporation, the potential presence of a constructive dividend is a perennial problem.\n\nInstances of 'constructive' or 'disguised' distributions are commonly encountered in the context of closely held corporations whose dealings with their stockholders are, more often than not, characterized by informality.\n\nBittker \u0026 Eustice, Federal Income Taxation of Corporations and Shareholders (3d ed.), P7.05, p. 7-24.\n\nIn the case sub judice, the district court determined that Loftin and Woodard received constructive dividends as a result of the land clearing operation undertaken by the Corporation on their behalf.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nThe determination of a constructive dividend is a question of fact, reviewable by this court under the clear error criterion. Hardin v. United States, 461 F.2d 865 (5th Cir. 1972); Lengsfield v. Commissioner of Internal Revenue, 241 F.2d 508 (5th Cir. 1972); Lengsfield v. Commissioner of Internal Revenue, 241 F.2d 508 (5th Cir. 1957). Under the clear error standard, we must decide whether the district court's findings of fact are without substantial evidentiary support or are premised on that court's misapprehension of the effect of the evidence before it. Rewis v. United States, 445 F.2d 1303, 1304 (5th Cir. 1971). See, Commissioner of Internal Revenue v. Duberstein, 363 U.S. 278, 291-92, 80 S. Ct. 1190, 4 L. Ed. 2d 1218 (1960).\n\nAs the Gibbs court noted, \"the determination of when the obligation is no longer owing or whether it was to be paid is, of course, a question of fact to be resolved by the trial judge. Such findings will not be set aside unless they are without substantial evidence to support them, or the court misapprehended the effect of the evidence, or whether on reviewing the entire evidence the court is left with the definite and firm conviction that a mistake has been committed.\" 362 F.2d at 397.\n\nThis is the standard by which we are guided in our review of the factual determination of whether an economic benefit was provided without expectation of repayment.\n\nA. THE FAILURE TO DETERMINE THE EXISTENCE OF A CONSTRUCTIVE DIVIDEND\n\nWe begin our review of this finding by noting that the determination of a constructive dividend entails two separate inquiries. First, the trial court must determine whether a constructive dividend was conferred. Then, and only then, need the trial court focus on a computation of the amount of such a dividend. United Aniline Company v. Commissioner of Internal Revenue, 316 F.2d 701 (1st Cir. 1963); Challenge Manufacturing Co. v. Commissioner, 37 T.C. 650 (1962).\n\nWhile these determinations necessarily are entwined to a degree, it is impermissible to find the presence of a constructive dividend simply because the value of a benefit conferred exceeds the payments made in compensation. One of the underlying problems with the district court's treatment of the constructive dividend issue in the present case is its apparent failure to demonstrate that it performed both segments of this two part operation.\n\n\"Not every corporate expenditure incidentally conferring economic benefit on a shareholder is a constructive dividend.\" Crosby, 496 F.2d at 1388. Before determining the amount of a constructive dividend, the court must determine whether \"the distribution was primarily for shareholder benefit.\" Sammons v. Commissioner of Internal Revenue, 472 F.2d 449 (5th Cir. 1972). Unfortunately, the line between \"primarily for shareholder benefit\" and \"primarily for corporate benefit\" is one not susceptible to easy delineation. Crosby, 496 F.2d at 1389.\n\nAn example of the danger attendant to a failure to undertake both parts of this inquiry is provided by Gibbs, supra. There, the court dissected a transaction in which stockholders leased their property to their corporation. A portion of the lease required the corporation, at its own expense, to make certain improvements on the property. The corporation was to be paid from the rental payments due under another lease in which an unrelated corporation was the lessee. The court began by explicitly splitting the determination into two parts: the existence of a dividend and secondly, its amount. As to the first determination, the Gibbs court noted that\n\nthe crucial consideration with regard to whether a dividend resulted to taxpayer is whether it was intended that taxpayer was to pay the corporation for the work.\n\nGibbs, 362 F.2d at 397. In accordance with this principle, the court decided that the transaction at issue embodied a constructive dividend since stockholder's corporation only would receive payments for the construction work done if the unrelated corporation did not default on its lease payments. Because the linkage of lease payments with payment for improvements was not placed in the improvements contract until after the unrelated corporation had defaulted, the court found that there was no expectation of repayment sufficient to stave off a finding of a constructive dividend.\n\nAnother example of the fundamental importance of the initial determination may be found in Benes v. Commissioner, 42 T.C. 358 (1964). Confronted with a stockholder whose corporation had undertaken a series of improvement on a piece of property eventually serving as his residence, the court first decided that these expenditures were primarily for the stockholder's benefit. This presented a close question in that the property, at the time the improvements were made, ostensibly was not being utilized for his purposes. Had the court merely assumed the existence of a constructive dividend because of a difference between the value of the improvements made and the payments rendered by the stockholder on a piece of property connected with the stockholder's name, it would have overlooked the possibility that the improvements were not conferred for his benefit.\n\nFinally, in Crosby, the court dissected the transactions which allegedly served as the basis for constructive dividend treatment from the required two part perspective. Here, the corporation made improvements on its stockholder's land after the stockholder had conveyed the land by deed to the corporation. In pursuit of the primary determination that must be made in a constructive dividend suit - whether a benefit was conferred primarily for the stockholder's benefit - the court discovered that the only property right which the corporation had accrued through the transfer of the deed was the limited right to sell the property. An investigation of the substance of this transaction convinced the court that the underlying purpose of the improvements made was the provision of a stockholder benefit. Had the Crosby court merely accepted this transaction at face value, it would have overlooked the existence of an economic benefit conferred by the corporation without expectation of repayment and, as a result, overlooked a potential constructive dividend.\n\nIt is clear from Benes, Gibbs and Crosby that the comparison of the value of the benefit conferred and the payments made in reimbursement cannot serve as the predicate for the finding of a constructive dividend. A prerequisite to the measurement of a dividend is the determination of its existence. The importance of this prerequisite is underscored by the apparent failure of the district court in the present case to have satisfied it. The court measured and determined the dividend simultaneously. It proceeded on a year by year basis, comparing payments made with costs incurred. Leaving aside the question of whether this was the proper method for computing the dividend herein,\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e it is clear that such an approach will elicit the presence of a dividend whenever payment is made in a year other than the one in which the costs relating thereto are incurred. In a contract requiring the rendering of services over a period of several years, the use of this method of measurement as the means by which the court determines the preliminary issue of whether a benefit was conferred primarily for stockholder benefit without expectation of repayment can produce an ill-conceived result.\n\nIn the case sub judice, the lower court reasoned that the absence of a payment (or sufficient payments) by the partnership in a particular year signaled that the corporation did not expect repayment. As a result, a constructive dividend was assessed. This is the reasoning which appears to have been the predicate, albeit a sub silentio predicate, for the district court's determination of a dividend.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nWe believe that this reasoning places the cart before the horse. By reasoning in this manner, the district court was measuring the dividend prior to determining that one had been conferred. The district court stated that it operated upon the premise that a \"constructive dividend occurs when a corporation confers an economic benefit on its shareholders without expectation of repayment.\" App. 180-181. On its face, this would appear to satisfy the obligation of the district court with regard to the primary determination entailed in a constructive dividend suit. However, it is clear from an examination of the record that this statement was made only in relation to the numerous cash withdrawals made by stockholders Loftin and Woodard - not in relation to the land clearing operation. As to this operation, which constituted the major part of the constructive dividend finding, the court was silent on the question of whether it performed the required first-part determination. And the classification of the cash withdrawals as constructive dividends - the subject of the court's statement - is not before us on this appeal.\n\nThus, in contrast to the clarity with which the court approached the dividend issue in relation to the cash withdrawals is the treatment it accorded to the dividend issue in relation to the land clearing operation. It does not appear from the record that the district court ever determined that the land clearing operation was a \"distribution\" conferred primarily for shareholder benefit. Instead, it appears that the district court assumed that in any year when the payments made by the partnership did not match the costs incurred by the corporation, a distribution was made primarily for the partners' benefit.\n\nThe danger of not maintaining a separation between the two parts of the constructive dividend determination cannot be overstated.\n\nIt might be argued that the non-expectation of repayment was demonstrated with such clarity that there was no need for an explicit finding in this regard. While such an argument might succeed in a limited number of cases, we are not pointed to any facts which support such an approach here.\n\nFor example, the initial spreading of costs by the Corporation among its other projects and the failure to make a payment until December 31, 1964 are cited as significant in this regard. In addition, the Government emphasizes the failure of the stockholders to be guided by the advice of their own accountant with regard to the constructive dividend that would arise from the benefits accruing from the land clearing operation.\n\nAs to the use of the \"spreading of costs\" as a fact indicating that the district court made the required first-part determination, this does not demonstrate that the Corporation did not expect repayment.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Testimony at trial indicated that the initial spreading of the costs incurred at Yazoo among the general expenses of a corporation the size of this corporation was not highly unusual.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e We cannot disregard the fact that the Corporation did begin expensing the land clearing costs to a separately identifiable category once the project was in full swing. Indeed, this change occurred prior to the time that the IRS began its initial audit.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Thus, the change was not undertaken in an effort to cover corporate tracks.\n\nAs to the advice rendered by the Corporation's accountant, Savage, it is true that he advised the stockholders not to authorize the Corporation to clear the land prior to the transfer of that land to the partnership because of the possibility of a constructive dividend arising therefrom. However, Savage was not concerned with the type of constructive dividend that arises when the value of the services rendered exceed the payments made for such services - that is, the constructive dividend at issue here. Rather, Savage was concerned over the possibility that the corporate clearing efforts would enhance the value of the property so much that when the Corporation transferred the property to the partnership, the incremental appreciation of the land's value would be fully taxable at that time.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nIn sum, it is unclear whether the district court determined that a constructive dividend was conferred prior to the court's measurement of such a dividend. Given the guidance of Benes, Gibbs, and Crosby, this is a determination which must be made. The district court is instructed to make this determination consistent with this opinion.\n\nWhile this would be sufficient, alone, to support a remand for reconsideration of the deficiencies assessed against taxpayers on the basis of the Yazoo clearing, we believe that there are other problematic aspects of the district court's approach to this issue. In the interest of justice and judicial efficiency, we discuss them now.\n\nB. THE EQUATION OF VALUE WITH COSTS\n\nThe second aspect of the district court's treatment of the constructive dividend issue which we find troublesome centers on its theory of measurement.\n\nIf we assume that a dividend is found to exist - the subject of discussion and remand in the preceding section - the district court must then compute the amount of the benefit conferred. Section 301 of the Code directs that the amount of a distribution of property to a noncorporate shareholder shall be measured as follows: \"the amount of the money received, plus the fair market value of other property received.\" (emphasis added). Thus, in determining the amount of taxable income embodied within a constructive dividend the court must diminish the value of the benefit conferred by the amount of any payment made by the shareholder in return.\n\nThe sticking point, for present purposes, is the concept of fair market value. The district court measured the value of the benefit conferred by computing the costs incurred by the corporation in supplying the benefit. Leaving aside, for a moment, the types of expenses included by the district court in the computation of costs, we first focus on the correctness of the equation of value and cost.\n\nThere is ample authority to support the use of costs as an equivalent of \"value\" for the purposes of a constructive dividend determination. See, for example, Walker v. Commissioner of Internal Revenue, 362 F.2d 140 (7th Cir. 1966), cert. den. 385 U.S. 865, 87 S. Ct. 124, 17 L. Ed. 2d 92 (1966). However, a careful reading of this line of authority raises grave questions concerning the propriety of such an action in the present case.\n\nOne of the primary motivations behind the district court's use of costs as an equivalent of value was its apparent belief that the Corporation would not have undertaken the land clearing project unless such a project was profitable. In essence, this position provides that had the district court utilized the fair market value established by the taxpayers' witnesses, such a value, multiplied by the number of acres cleared, would have been less than the costs incurred by the Corporation, as those costs were computed by the district court.\n\nThere are two serious problems with the district court's rationale. We agree that corporations are, for the most part, governed by the profit motive in their choice of undertakings. However, in the land clearing business, the price of a project is determined prior to the accrual of expenses. That is, in the land clearing business, a bid is made on a project on the basis of projected expenses, long before those expenses ultimately are incurred.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Notwithstanding the fact that in the case sub judice, we are confronted with a closely held corporation, the structure of the land clearing industry suggests that a project might, upon completion, yield less revenue than initially had been anticipated. In fact, testimony indicated that this was not a unique occurrence.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e This might be particularly true in a project of several years duration.\n\nSecondly, the district court decided the project was unprofitable because it compared the fair market value figures testified to at trial with direct and indirect costs. Included in the category of indirect costs were a pro rata share of overhead and of the depreciation attributable to the machines involved in the Yazoo project. Without commenting on whether indirect costs belong in the computation of a constructive dividend, we suggest that their inclusion in the determination of the profitability of this operation may have produced a skewed resulting interpretation of profitability.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nThe Yazoo project was particularly large. The Corporation's indirect costs essentially were fixed. That is, the Corporation would incur certain costs whether or not the Yazoo project was undertaken. Salaries and depreciation would not be altered by the presence or absence of a further project unless the project was so large that it required the Corporation to hire further personnel and/or machines. Thus, the decision to undertake the Yazoo project for payments which exceeded the direct costs incurred, although less than the sum of indirect and direct costs, might have been premised on a concept of marginal profitability.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Although the concept of marginal profitability necessarily entails the presumption that there were no other jobs of a nature similar to the Yazoo project but of greater profitability, we offer the concept as an indication of the potential inaccuracy of the district court's premise.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nGiven the above two criticisms of the district court's premise, we suggest that its assumptions about profitability, without more, would not support an otherwise unsupportable decision to utilize costs as the measurement of the fair market value of a benefit conferred. By the above discussion, we do not intend to require a district court to undertake, in every case, the complex albeit elusive, determinations alluded to above. However, when a court assumes that a corporation was involved in an unprofitable venture without such further inquiry, that assumption may be incorrect. Without such further inquiry here, it was an inappropriate premise upon which to structure the treatment of the transaction in the present case because this untested premise was the basis for the trial court's decision to use costs as a measure of value - an equation which is the exception rather than the norm.\n\nWe believe that the cases which have utilized \"costs\" as a measurement of \"fair market value\" in the constructive dividend context are distinguishable.\n\nThe cases supporting the use of costs stand for the proposition that cost is an acceptable measure of value when there is no credible evidence of fair market value or when evidence of fair market value exists but is clearly rebutted. We analyze them in detail because they shed much light on the inexplicable quality of the district court's decision to disregard the expert testimony provided in the present case. As the court stated in United Aniline, supra, it is permissible to measure the value of the benefit conferred as a constructive dividend through a computation of costs \" in the absence of any direct evidence of fair value.\" 316 F.2d at 705. And, in Walker, supra, the court justified the use of costs where there was sufficient expert testimony rebutting the taxpayer's assertions of fair market value. 362 F.2d at 143.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nThe other cases cited for their use of costs as a measure of value similarly are distinguishable. First, in Goldstein v. Commissioner of Internal Revenue, 298 F.2d 562 (9th Cir. 1962), the evidence of fair market value introduced by taxpayer was exceedingly weak. The selling price of the property at issue was in excess of even the most persuasive evidence of fair market value. Although there was some expert testimony supporting the stockholder's fair market valuation, its validity was seriously undercut by the circumstances of the underlying transaction. The stockholder, himself, had paid far less for the property only three weeks prior to the sale to the corporation. In addition, the corporation, prior to the purchase, was leasing the land under a sale-leaseback arrangement which, in toto, would invest eventual ownership in the corporation at a price far below the price it decided to pay the stockholder. Finally, and of equal significance, the stockholder's experts did not demonstrate that their opinions were predicated on the existence of the above recited circumstance. In essence, \"appellant neglect[ed] to explain the lack of any direct evidence that either of these valuations took the effect of the lease into consideration.\" 298 F.2d at 567.\n\nSecond, the Tax Court case of Lester E. Dellinger, 32 T.C. 1178 (1959), further strengthens our suspicions concerning the district court's treatment of valuation in the case sub judice. In Dellinger, costs were utilized because fair market value did not accurately reflect value in light of the fact that the shareholder himself sold the property in question for an amount greater than the value suggested by his evidence as to fair market value. 32 T.C. at 1183, 1184. Moreover, taxpayer's evidence of fair market value consisted of \"only the vague testimony of the petitioner himself. Not only is it clear that he had no qualifications to express an acceptable opinion as to such values, but, in addition, his testimony was inherently improbable and unreasonable.\" 32 T.C. at 1185-6. Compounding these problems from the court's perspective was the failure of taxpayer to offer, as a witness in support of his valuation, the real estate appraiser best qualified to testify as to the value of the land in issue. 32 T.C. at 1186. Clearly, taxpayer had not met his burden of proof. See, also, Honigman v. Commissioner of Internal Revenue, 466 F.2d 69 (6th Cir. 1972).\n\nFinally, perhaps the classic example of the relationship of costs and valuation is found in Commissioner of Internal Revenue v. Riss, 374 F.2d 161 (8th Cir. 1967). There, the court was confronted with a constructive dividend comprised of a residence occupied by the stockholder's family; insurance and operating costs of cars utilized by stockholder's family; club bills; and a trip to Puerto Rico.\n\nAs to the residence, the court, in opposition to the Tax Court's decision in Riss, computed its value on the basis of the expenses and depreciation related thereto - that is, costs. Significantly, evidence of the fair market value of the residence was not provided to the Tax Court. Compounding this problem was the fact that a qualified real estate expert testified that the high cost of maintaining this property made it difficult to rent at any price. Further, rentals of comparable residences indicated that the value chosen by the Tax Court was wholly inconsistent with the little evidence of fair rental value that could be ascertained. In short, the Tax Court's fair rental figure was decidedly unsupported by all credible evidence and that evidence of fair market value which did relate to this residence, albeit tangentially, supported a figure arrived at on the basis of cost.\n\nThus, the Riss court determined that cost was a more reliable measurement of value when there was an absence of direct evidence of fair market value and a presence of evidence suggesting the inappropriateness of fair market value as the mode of measurement. This interpretation was borne out by the Riss court's treatment of the benefit embodied in the personal car provided for the stockholder. Because evidence of fair market value was introduced as to this item and because \" no evidence was introduced with respect to the total operating cost of the car,\" the court's decision to utilize fair market value instead of costs was entirely consistent with its overall approach to valuation in that case. 374 F.2d at 170 (emphasis added).\n\nIt is noteworthy that the favored place of \"fair market value\" in the hierarchy of modes of valuation is bolstered by the Code itself. Regulation 1-301.1(j) delineates the concept of a constructive dividend in terms of \"fair market value\". Likewise, I.R.C. ยง 301(b)(1)(A) speaks of distributions of property to non-corporate distributees in terms of the fair market value of the property received.\n\nThe equation of value with costs is, therefore, not the norm but the exception. With this in mind, we focus on the present case.\n\nIn determining the current value of the economic benefit conferred, it is \"clear that the taxpayer never loses the burden of proving the Commissioner's determination erroneous.\" Crosby, 496 F.2d at 1390.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Loftin and Woodard do not argue for the adoption of a contrary proposition. Instead, appellants suggest that the evidence they introduced in support of the valuation of $50 per acre was sufficiently strong that the district court's failure to utilize such a valuation can only be explained by a disregard for the appropriate legal standard - a standard favoring the use of fair market value over the use of cost for purposes of valuation.\n\nThe evidence relating to value which was before the district court consisted of the testimony of three \"expert\" witnesses, all provided by the taxpayers.\n\nAs a preliminary matter, we note that while the weight attributable to the opinions of these witnesses is hotly contested, the fact that they are experts is not. The district court permitted these witnesses to offer their opinions in the land clearing field after an objection to their qualifications to render such testimony.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e App. 483-85. While this action did not determine the weight which should attach to their testimony nor its credibility, it did establish that their testimony was admissible as the testimony of experts in the relevant area. F.R.Ev. 702; 3 Weinstein's Evidence, P702[01].\n\nThe three witnesses who testified at trial - Bill Moore, W. G. Boykin and W. B. Holloway - all rendered opinions as to the fair market value of the land clearing operation.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e No evidence was offered by the Government in rebuttal. Instead, it relied on cross-examination.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nThe first witness, Moore, testified that he was familiar with the land in question before and after the clearing operation was completed.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Moore was himself a land clearer whose operations were proximate to the Yazoo clearing in time and geography. His typical clearing operation consisted of shearing, piling, burning, cleaning and discing.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e He explicitly indicated that stumps would not be removed in a clearing effort; instead, they would be cut down to the surface.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e When asked to estimate the fair market value of the work performed by the Corporation, he emphatically stated that $50 per acre would be the maximum compensation a land clearer could and would expect to receive for the Yazoo clearing.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e According to Moore, the economic environment surrounding the land clearing business in the years in question was intensely competitive. Thus, a typical clearer would be delighted to receive such a price for the efforts required at Yazoo at that time.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nThe second witness, Boykin, was involved primarily in the land clearing business also in the period and geographic area present in this case.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Like Moore, Boykin's clearing experience included cutting, piling, sweeping, burning and ditching.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e He too emphasized that stumps were not removed.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e Although he noted that the performance of ditching and discing at a site was dependent on the party's wishes, as reflected in a contract, he also clearly indicated that his fair market value estimate was predicated on an understanding of the condition of the land prior to and subsequent to the clearing operation. To infer that he may have taken into account any discing and ditching done would not be unwarranted.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e There is no evidence to suggest otherwise. Like Moore, Boykin placed the maximum value for such clearing at $50 per acre, noting, as had Moore, that the cost per acre would only decrease as the number of acres to be cleared increased.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nTaxpayers' final witness was Holloway, the accountant whose clientele included several substantial land clearing entities that had cleared land near the Yazoo project during the years in question.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e When asked about his familiarity with the work actually performed on the Yazoo site, Holloway testified that he had seen the property and that the clearing performed amounted to a \"normal\" operation.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e Once again, he considered $50 per acre to be top dollar for that operation.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e Indeed, he expressly indicated that the only clearing jobs which would command a better price would be those involving a very small amount of acreage.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\nWe offer this synopsis of the expert testimony not in an effort to assess their credibility - a job exclusively within the province of the district court. Rather, we offer it because our review of its content leaves us puzzled as to the rationale underlying the district court's decision to utilize costs as a measure of value instead of the fair market value.\n\nThe Government did not introduce a shred of affirmative evidence to contradict the above testimony. Cross-examination revealed only that these \"experts\" were not wholly familiar with the precise work done in the clearing operation. While this could have been important, we believe that its edge was blunted by testimony in the record which suggested that the operation was not unusual in nature - that unrebutted testimony being provided by the above witnesses and the taxpayers themselves.\n\nMoreover, the Government did not introduce evidence suggesting that the operation was unusual.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e Indeed, two of the three witnesses had done a fair amount of clearing themselves in and around Yazoo and, therefore, were familiar with the types of operations performed in the course of a clearing project in that area. The court's speculation that tree stumps may have been removed, thereby increasing the cost per acre, is without any support in the record.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e Significantly, the testimony of the three witnesses was that it would be highly unusual for such an action to be undertaken.\n\nIt is difficult to understand the motivation of the Government and the court in suggesting that \"something\" special was done on the Yazoo property. Just because a closely held corporation was performing work for its stockholders does not mean, ipso facto, that the work was customized. The record indicates that the only work performed of an unusual nature was that which was done prior to the actual clearing. In essence, this work consisted of the repair of cabins already in existence on the land and the establishment of a better drainage network. The outside figure for this work was set at $22,000.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e This hardly would be a decisive piece of work in a project which cost, under the Government's own estimate, $500,000. Furthermore, Woodard's own testimony indicated that he wanted the corporation to clear the land \"fairly well\" so that he could sell it. This statement, which is asserted by the Government in support of its belief that special work was done on this land of which the expert witnesses were not aware, is equally susceptible to a contrary interpretation. This was not a piece of property which the buyers were seeking to have custom crafted for their own personal enjoyment. It was, instead, a piece of property which they eventually would seek to sell.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\nThere were other criticisms leveled at the \"deficiency\" of the expert testimony in this matter.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e It is true, as the Government contends, that none of the witnesses bid on this land. However, no one could bid on this land because it was never opened to competitive bidding. Indeed, if the Government's criticism was accepted, no witness could have qualified as an expert in this matter.\n\nIt is also true, as the Government asserted, that none of these witnesses had cleared property of such grand proportions. However, the applicability of this criticism also is highly suspect given the uncontradicted testimony in the record compelling the conclusion that the costs of clearing only decrease as the amount of acreage grows larger.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\n\nFinally, perhaps the most incomprehensible criticism leveled by the Government at the expert testimony is that it was all irrelevant because the existence of a contract between the taxpayers and their corporation prior to 1965 was never proven. The testimony as to value was offered in order to determine the value of the benefit conferred, not the accuracy of any price agreed upon by the parties.\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e A valuation had to be performed for constructive dividend purposes, irrespective of the existence of a contract. Indeed, the existence of a contract setting the price at $50 per acre - the figure taxpayers seek to establish - would not have been conclusive even on taxpayers' behalf.\n\nAt the same time that the Government was criticizing the taxpayers' offerings, it inadequately explained its own shortcomings in this area. When questioned by taxpayers' attorney as to its failure to introduce rebuttal evidence on the issue of value, the Government Agent responded that\n\nto have taken the fair market value, we would have had to call in an engineer agent and a forestry agent and have them come in and value it. We decided not to do it.\n\nApp. 1051-52.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e Are we to conclude that the only reason the Government did not attempt to measure the value of the benefit conferred in fair market value terms was that it was inexpedient to do so? Surely, this would not pass as an ample justification for the court's ultimate determination on the valuation issue given that taxpayers have offered substantial testimony on this issue.\n\nIn sum, value is the overriding concept in the measurement of a constructive dividend. While the vagaries of any competitive situation often render elusive the measurement of value, there was a substantial amount of unshaken expert testimony produced at trial by the taxpayers. The testimony offered by the taxpayers produced a factual context far different from those cases in which courts correctly chose to equate value with costs. Taxpayers' witnesses in the case sub judice were fairly knowledgeable with regard to the land clearing business and the actual land in question, unlike the witnesses offered in cases like Goldstein, supra. The district court's decision to utilize costs to measure value in light of the presence of such testimony and the Government's failure to contradict that testimony, suggests that the lower court was operating either under an improper construction of the pertinent legal standard or under a belief that the witnesses were not credible.\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e\n\nTaxpayers had the burden of proof on the value issue. However, unlike United Aniline or Walker, supra, taxpayers did act to meet that burden.\n\nWhether the district court traversed the incorrect legal path or incorrectly traversed the correct legal path is a matter which is not susceptible to determination by this court at this time. Therefore, we direct the district court to reconsider the manner of measuring value that it employed should it decide first, on remand, that an economic benefit was conferred on a shareholder in his capacity as such without expectation of repayment.\n\nC. THE USE OF AN ANNUAL ACCOUNTING PERIOD\n\nThe final problematic aspect of the district court's treatment of the constructive dividend issue centers on that court's decision to utilize a calendar year period for the measurement of the amount of the constructive dividend. That is, in reaching a figure for the value of the constructive dividend arising from the clearing operation, the lower court compared the costs incurred by the Corporation in a given calendar year with the payments received from the partnership in that same calendar year.\n\nThere are two time frames within which the district court could have measured the constructive dividend, assuming one was properly found to exist - the time frame of annual units (fiscal or calendar) or the time frame beginning with the commencement of the project and ending with the project's termination. It appears, from the district court's findings, that it assumed that the only proper manner of computation was the calendar year basis. In support, the Government asserts that the use of any period but an annual period would cut against the notion of annual accounting ingrained in our tax laws. We disagree.\n\n26 U.S.C. ยง 446 outlines the permissible methods of accounting under the tax law. One of the methods recognized as acceptable is the completed contract approach. When a taxpayer operates under this approach, he reports taxable income from a project upon its completion. Daley v. United States, 243 F.2d 466 (9th Cir. 1957), cert. den. 355 U.S. 832, 78 S. Ct. 46, 2 L. Ed. 2d 44, Reg. 1.451-3; Reg. 118, ยง 39.42-4; and Reg. 111, ยง 29.42-4. The concept of the completed contract method of accounting was alluded to as far back as Burnet v. Sanford, 282 U.S. 359, 51 S. Ct. 150, 75 L. Ed. 383 (1931).\n\nWhile this method is recognized as an acceptable mode of accounting for tax purposes, it cannot be utilized capriciously by a taxpayer. A corporation must request permission from the Commissioner in order to utilize it. See, Reg. 1.451-3(c); Wright Contracting Co. v. Commissioner of Internal Revenue, 316 F.2d 249 (5th Cir. 1963), cert. den. 375 U.S. 879, 84 S. Ct. 147, 11 L. Ed. 2d 110. Because taxpayers did not seek such consent here, they cannot argue that this method must be used to evaluate their clearing operation in terms of its tax consequences. However, the Commissioner is invested with the discretion to utilize such a method in rendering his computation of the taxpayers' tax liability. 26 U.S.C. ยง 446(b).\n\nUnder 26 U.S.C. ยง 446(b), the Commissioner is directed, in auditing a taxpayer's return, to use the method chosen by the taxpayer to measure income.\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e But,\n\nif the method used does not clearly reflect income, the computation of taxable income shall be made under such method as, in the opinion of the Secretary or his delegate, does clearly reflect income.\n\n26 U.S.C. ยง 446(b). See, Commissioner of Internal Revenue v. Hansen, 360 U.S. 446, 79 S. Ct. 1270, 3 L. Ed. 2d 1360 (1959); Burck v. Commissioner of Internal Revenue, 533 F.2d 768 (2d Cir. 1976); Stephens Marine, Inc. v. Commissioner of Internal Revenue, 430 F.2d 679 (9th Cir. 1970).\n\nGiven the discretion with which the Commissioner is invested to choose a method of measurement most capable of accurately reflecting a transaction, blind adherence to the accounting method chosen by the taxpayers or the corporation performing the work would not be consistent with the overriding spirit of the law. \"Consistency alone in the accounting method used by a taxpayer cannot satisfy the requirement that there be a clear reflection of income.\" Photo Sonics Inc. v. Commissioner of Internal Revenue, 357 F.2d 656 (9th Cir. 1966). The discretion with which the Commissioner is invested may not be abused. Whitaker v. Commissioner of Internal Revenue, 259 F.2d 379 (5th Cir. 1968).\n\nUnderlying the entire fabric of the tax structure is a desire to accurately portray the events that have transpired. Indeed, even a combination of accounting methods is permitted under the tax law if such a hybrid approach more clearly reflects income. Reg. 1.446-1(c)1(iv).\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e\n\nWhile abuse of this discretion by the Commissioner must be proven by a clear showing, Wood v. Commissioner of Internal Revenue, 245 F.2d 888 (5th Cir. 1957), it would seem that such a showing could be predicated upon a decision to use an accounting method that is inaccurate under the circumstances. While we express no opinion as to the manner in which the district court ultimately should resolve this issue, we do note that in the present case, the measurement of the dividend on an annual basis appears to produce a patently unjust result. If most purchasers of land clearing services do not pay for these services until the project is completed,\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e then the use of an annual accounting method to measure a constructive dividend arising from such services would work a severe hardship on the beneficiary of a clearing operation that spanned several years. The unjust nature of this choice of measurement method is underscored by the fact that it is the Corporation that chooses the date on which to declare its costs. If it has chosen the completed contract method, then the taxpayer is benefitted. But if it has not, then costs will be registered on an annual basis, in all likelihood, and payments will not be registered until the completion of the operation, years later. Given that the excess payment in one year is not transferrable to offset a prior year's costs, the taxpayer will not be able to recover from the corporation's choice.\n\nThere is much authority supporting an approach which breaks free from the moorings of annual accounting in the present case. That authority prescribes that the lodestar by which the court must be guided in its treatment of the measurement issue is the pursuit of substance over form. \"The basic tenet of tax requires . . . a substance-over-form practical construction - 'it is the underlying essence of a transaction that determines its taxability.'\" Crosby, 496 F.2d at 1389 (cit. omit.).\n\nAn application of this tenet may be found in Gibbs, supra. Gibbs provides an example of the pursuit of accuracy that reached fruition in a cumulative approach to the measurement issue. In this case, Judge Bell emphasized that the proper manner in which to measure the constructive dividend arising from property improvements was to focus on \"the sale price of the alterations and improvements less payments made, if any.\" 362 F.2d at 398. This formula, which rests on a cumulative approach to measurement, was tailored to the factual context confronting the Gibbs court - one in which the subject of the constructive dividend was leasehold improvements made over a period exceeding one year. It is, in short, a formula premised on accuracy; a formula which takes cognizance of a series of events which are not neatly confined to an annual span.\n\nAn application of this tenet which produced a different result precisely because the factual circumstances were different may be found in Benes v. Commissioner, 42 T.C. 358, aff'd 355 F.2d 929 (6th Cir. 1966). In Benes, the focus on substance-over-form supported the measurement of a constructive dividend on an annual basis because the court found that the stockholder had no intention of ever paying his corporation for the cost of the improvements rendered by it on property found to have been built primarily for his benefit. Thus, the use of an annual accounting period in Benes was wholly consistent with the overriding judicial desire to choose a method of measurement most capable of accurately depicting the essence of the underlying transaction.\n\nA final noteworthy example of the continuing effort to procure a more accurate treatment of the measurement question is provided by the court's management of the constructive dividend issue in Honigman, supra. In Honigman, a piece of property was sold to stockholder's corporation by a corporation in which stockholder possessed a 35% interest. The court found a constructive dividend and measured it as the excess of the property's fair market value over the purchase price, where the purchase price was calculated as a lump sum figure. This lump sum characteristic is particularly important because the payments comprising it were not made within one year's time. The purchase was consummated via the assumption of a mortgage on the property; the assumption of a $21,000 tax liability; and the payment of $50,000 cash. Significantly, the fact that the taxpayer was not following a completed contract method of accounting did not prevent the court from explicitly recognizing the piecemeal quality of the transaction and from measuring the \"payment\" component of the constructive dividend in a cumulative manner.\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e\n\nWe urge the district court to reconsider the propriety of utilizing an annual accounting method in a situation where the parties do not intend to match costs and payments on an annual basis.\n\nIn a judicial determination of tax liability, the value of consistency cannot be disregarded, but the value of accuracy must be foremost. \"Whatever method is used must be followed in reporting and determining taxable income, unless some adjustment of the method used is required in the particular case in order to clearly reflect income.\" 2 Mertens, Law of Federal Income Taxation (1974 rev.) ยง 12.02. In this regard, we cannot disregard the advice of an eminent tax authority who has unequivocally indicated that in the reporting of income from a long-term contract, the completed contract method is essential. Id., ยง 12-130-135.\n\nThe court has discretion to utilize that method of accounting most apt to render an accurate narration of the tax events that transpired. The completed contract method, or a comparable cumulative approach, is best suited for a transaction spanning several years where payment is not expected concurrent with the accrual of costs and the constructive receipt of income by the taxpayer is established on the basis of the accounting scheme chosen by the corporate entity. Notwithstanding the failure of the parties to have utilized such a method in reflecting this transaction on paper, the district court must consider whether the determination of a deficiency in the context sub judice mandated an examination from a non-annual perspective.\n\nD. THE STIPULATION\n\nAssuming, on remand, that the district court finds that a constructive dividend was conferred; determines the proper measurement for value; and determines the proper interval in which to calculate the amount of the constructive dividend, one major problem with the district court's approach still remains.\n\nThis problem centers on the decision of the lower court to disregard, sub silentio, a stipulation entered into by the taxpayers and the Government. That stipulation stated that:\n\nLoftin and Woodard, Partnership, made certain payments to Loftin and Woodard, Inc. for clearing land. These payments are reflected by entries on the partnership books crediting accounts receivable from Loftin and Woodard, Inc. . . .\n\nThe following entries reflect the payments made:\n\nDATE L \u0026 W Partnership\n\n(Credit Accts.\n\nRec. L. \u0026 W. Inc.)\n\n12/31/64 $250,000\n\nWe quote the above stipulation at length because we deem the language susceptible to no other interpretation than that which appears on its face. While we do not quarrel with the district court's right to disregard any stipulation, we do not understand its decision to do so in the present case - especially in light of the court's failure to explain its action.\n\nThis stipulation is pivotal in the constructive dividend determination because, as noted above, the district court measured the constructive dividend by comparing costs incurred and payments received within a calendar year period. The calendar year was utilized rather than the fiscal year because the shareholders were the recipients of the dividend and they were on a calendar year accounting program. As to calendar 1964, the year to which the stipulation pertained, the district court approved a major deficiency, assessed against the taxpayers with regard to the land clearing operation, on the basis of a comparison of costs incurred by the Corporation and payments received in compensation in that year. Had the court followed the stipulation, the difference between payments made and costs incurred would have been minimal in that year, if not non-existent.\n\nThe justification tendered by the Government for the court's decision to disregard the stipulation is that the entries made on the Corporation's books were inherently more reliable than those made on the partnership books. Therefore, the Government argues that the court was justified in marking the date of the first payment by referring to the date the Corporation used to enter income received rather than by referring to the partnership entry relating to the date on which a payment was made.\n\nWe do not believe this is a tenable explanation. No showing was made to the district court of the \"manifest injustice\" which would have resulted had the stipulation been followed. Henry v. Commissioner of Internal Revenue, 362 F.2d 640 (5th Cir. 1966). Yet \"stipulations entered into freely and fairly shall not be set aside except to avoid manifest injustice.\" Henry, 362 F.2d at 640.\n\nSimply stated, the district court was entitled to disregard the stipulation if to accept it would have been manifestly unjust or if the evidence contrary to the stipulation was substantial. We disregard completely the Government's argument that the terms of the stipulation can be read to support the position of the district court. To engage in such semantic soft shoe would serve to diminish the honored place accorded to stipulations reached by the solemn efforts of opposing parties.\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e In addition, according to the testimony of the Corporation's bookkeeper and accountant, the Corporation operated on a percentage of completion method in its recordation of income. In other words, it would make income entries on its books by tallying the number of acres cleared at the end of its fiscal year and then multiplying this by $50 per acre - the alleged contract price agreed upon by the partnership and the Corporation. The Government contends that these entries are inherently more reliable because they produced immediate tax consequences for the Corporation. That is, whenever the Corporation entered income on its books, it understood that it would incur income tax consequences commensurate with such an entry in the respective year.\n\nGiven the Corporation's own explanation for the basis of those entries, we cannot understand how they would be any more reliable than those made by the partnership. The Corporation was not reflecting the date when a partnership payment was made if it made entries on a percentage of completion method. Moreover, had the partnership been cognizant of the Government's own theory of the proper method of measuring a constructive dividend, the partnership would have understood the equally serious tax consequences connected with the entry of payments made by it. That is, under the Government's own constructive dividend theory, the partnership clearly would want to accurately enter payments in the year incurred in order to avoid the predicament into which it fell under the district court's treatment of this matter on a calendar year-by-calendar year basis.\n\nE. CONCLUSION:\n\nIn sum, we remand the entire constructive dividend question to the district court for reconsideration in light of this opinion. The redetermination may involve the district court in a reconsideration of one or several issues: (a) whether an economic benefit was conferred on the shareholder in his capacity as such without expectation of repayment; (b) whether the value of such a benefit should be predicated on costs incurred; (c) whether the proper time frame for the measurement of a constructive dividend here is annual, cumulative, or other; and (d) what role the stipulation properly should be assigned. We remand for reconsideration of these issues from a desire \"to avoid any chance of an unjust result.\" Gibbs, 362 F.2d at 398.\n\nThe constructive dividend issue is highly complex and we commend the district court for its diligence in ferreting out the factual background of this lengthy transaction. However, under the clear error standard which guides this court in its review of the factual determinations rendered by the trial court, we must set aside those factual findings if they are \"without substantial evidence to support [them], or the district court misapprehended the effect of the evidence.\" Lentz v. Metropolitan Life Insurance Co., 428 F.2d 36, 39 (5th Cir. 1970). See, Lee v. United States, 466 F.2d 11, 14 (5th Cir. 1972).\n\nWe find that the district court's conclusions on the constructive dividend issue suffer from the court's failure to utilize the correct legal standards and its misapprehension of evidence.\n\nIII. THE DEDUCTIBILITY OF CORPORATE EXPENSES:\n\nAn income tax concomitant of the land clearing operation beyond the constructive dividend issue already discussed entails the propriety of the Corporation's deduction of expenses incurred thereon as ordinary and necessary business expenses under 26 U.S.C. ยง 162. The district court decided that the expenses incurred by the Corporation prior to the transfer of the property to the partnership were wholly non-deductible because they represented permanent improvements to land, or capital expenditures.\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e See, 26 U.S.C. ยง 263; Rev.Rul. 59-42; 1959-1 Cum.Bull. 47.\u003cspan class=\"fnref\"\u003e60\u003c/span\u003e As to the expenses incurred subsequent to the transfer of title - the majority of the expense deductions at issue - the district court permitted deductions only for that amount of those expenses which did not exceed the payments made by the partnership in the year in which the expenses were incurred.\n\nWe affirm the pre-transfer finding and vacate and remand as to the post-transfer finding.\n\nA. PRE-TRANSFER EXPENSES:\n\nThe deductibility of the pre-transfer expenses hinges on a determination of which entity was the true owner in interest of the property at the time the expenses were incurred.\u003cspan class=\"fnref\"\u003e61\u003c/span\u003e If the Corporation was the owner, the expenses were capital in nature and incorrectly deducted as ordinary and necessary business expenses.\n\nIt is undisputed that the Corporation actually purchased the land. The partnership could not obtain the funds necessary to close the deal within the time constraints imposed by the vendor. Because it could not obtain the necessary financing in time, it looked to the Corporation to make the initial purchase. Indeed, according to Loftin, the partnership was not even in existence at the time of the initial purchase.\u003cspan class=\"fnref\"\u003e62\u003c/span\u003e However, the taxpayers assert that the Corporation was, in truth, only a purchasing agent - that is, that the partnership was the true owner in interest at the April 17 purchase date.\n\nThe district court's finding to the contrary is supported by the record. First, the Corporation adopted a resolution prior to its purchase of the land on behalf of the partnership. That resolution explicitly indicated that the Corporation was purchasing the land in order to sell it to the partnership at such time as the partnership could arrange the necessary financing. Thus, the intention of the Corporation was to sell, not merely to make a nominal transfer. In fact, on November 1, 1963 - the date the land was sold to the partnership - the Corporation received consideration equal to that which it had paid to the original vendor in April.\n\nIt simply is not enough that the taxpayers \"intended\" to purchase the land from the Corporation at the earliest possible date. In this regard, there was a five month delay between the corporate purchase and the ultimate transfer, despite the fact that the partnership had the capacity to \"repurchase\" this property at an earlier time. Although the failure to arrange for the transfer was explained by Woodard as being due to carelessness,\u003cspan class=\"fnref\"\u003e63\u003c/span\u003e the district court was entitled to assign little weight to the Corporation's purported intention to immediately transfer the land to the partnership. Moreover, even had the trial court accepted this explanation, the assertion of an \"intent\" to transfer is insufficient here to support a finding of beneficial ownership. See, McBride v. Commissioner, 23 T.C. 901 (1955).\n\nSecond, in making the initial purchase, the Corporation committed its coffers to full potential liability for repayment. In addition, the Corporation listed the property as an asset on its fiscal 1963 tax return. Yet, once the land was sold to the partnership, the asset no longer appeared on the subsequent corporate tax returns.\n\nIn short, the district court did not commit clear error in concluding that these transactions were tantamount to a purchase by the Corporation with an eventual resale to the partnership.\n\nAs we have noted above, we do not believe in exalting form over substance. However, in this instance, we cannot permit this adage to be utilized as the last grasp toward extrication. To quote from our learned Brother Goldberg:\n\nWe can indulge in no presumption to penalize even an errant taxpayer, but we do not believe that this tutelage interdicts us to forego ineluctable inferences and common sense.\n\nWebb v. Commissioner of Internal Revenue, 394 F.2d 366, 380 (5th Cir. 1968).\n\nIn essence, while taxpayers seek to pierce \"the paper armor of . . . [their] characterization of a particular transaction,\" Cornelius v. Commissioner of Internal Revenue, 494 F.2d 465, 471 (5th Cir. 1974), they offer no explanation which could support a decision to do so.\n\nB. POST-TRANSFER EXPENSES:\n\nThe issue of post-transfer expenses presents a more difficult problem. As was noted above, the district court did not deny deductibility as to the full amount of these expenses. Instead, the Corporation was permitted to deduct that portion which did not exceed the payments made to it in each respective year.\n\nThe predicate for this denial was the district court's resolution of the constructive dividend issue. Because expenses incurred in conferring a dividend, constructive or otherwise, are not deductible and because the district court determined that expenses incurred in excess of payments received by the Corporation represented constructive dividends to the shareholders, the excess was deemed to be non-deductible by the Corporation. See, United States v. Smith, 418 F.2d 589, 596 (5th Cir. 1969).\n\nWe note, at the outset, that our decision to vacate as to the constructive dividend issue necessarily mandates that we vacate and remand as to the deduction of post-transfer expenses because the former is an essential predicate of the latter. However, in addition to this overriding problem, we are troubled with a further aspect of the district court's treatment of the post-transfer expenses which we discuss now in an effort to avoid further delays in the resolution of this matter.\n\nThe district court chose to measure the deductions on a fiscal year basis. That is, the court arrived at a determination of the non-deductible excess of costs over payments by matching costs and payments in each of the Corporation's fiscal years. At first glance, this is appealing given that the Corporation, which was the entity seeking the deductions, had selected a fiscal tax year for reporting its income. However, the choice of a fiscal year period is less convincing when one considers that the district court chose to link the issue of the deductibility of costs with the issue of the constructive dividend. The constructive dividend was measured on a calendar year and if the deductibility of a portion of the expenses was denied because those expenses represented a constructive dividend, as determined on a calendar year basis, it would appear to be inconsistent to measure the excess portion within a different time frame for purposes of resolving the deduction issue.\n\nThus, if the district court, on remand, decides that a constructive dividend was conferred on the basis of the land clearing operation, it must measure the portion of non-deductible expenses related thereto in a manner consistent with its measurement of the constructive dividend should they remain inextricably related, as they are under the present approach of the district court.\n\nIV. THE ISSUE OF FRAUD:\n\nThe district court found Loftin liable for fraud for the deficiencies in income assessed in calendar years 1963 and 1964. Contrary to the Commissioner's determinations, the district court did not find Woodard or the Corporation fraudulent for any of the years in question. The Government has raised the issue of corporate fraud on its cross-appeal.\n\nAt the outset, we note that we are obligated to affirm the district court's findings if we find that fraud taints any aspect of the deficiency for the year under review. Thus, the Government need only prove that some part of the underpayment in a particular year was fraudulent. Ruidoso Racing Association, Inc. v. Commissioner of Internal Revenue, 476 F.2d 502 (10th Cir. 1973).\u003cspan class=\"fnref\"\u003e64\u003c/span\u003e\n\nDuring the years at issue on this appeal, Loftin and Woodard did a fair amount of traveling, ostensibly in pursuit of corporate objectives. In the course of these trips, the Corporation provided the taxpayers with cars, credit cards, and reimbursements for food, lodging, and expenses of a similar nature. In addition, both taxpayers periodically withdrew cash from the corporate coffers prior to embarking upon these trips.\n\nAt trial, neither taxpayer proffered an accounting of the uses made of these advances or any explanation of a connection between those payments made, for which they were reimbursed, and proper corporate objectives.\u003cspan class=\"fnref\"\u003e65\u003c/span\u003e However, this, in itself, only supports a finding that such payments were not properly deductible as business expenses of the Corporation and/or that they constituted constructive dividends.\n\nIn pursuing a resolution of this matter, we note that it is clear that the Government bears the burden of proving, by clear and convincing evidence, that the taxpayer intended to evade a tax he believed to be owing to the Government. Carter v. Campbell, 264 F.2d 930 (5th Cir. 1959). \"Fraud is a question of fact. Determination of fraud must be supported by substantial evidence.\" Jaeger Motor Car Company v. Commissioner of Internal Revenue, 284 F.2d 127 (7th Cir. 1960). However, it is incumbent upon Loftin to prove to this court on review that the evidence of fraudulent intent placed before the district court did not cross the \"clear and convincing\" threshold. Webb v. Commissioner of Internal Revenue, 394 F.2d 366, 377-78 (5th Cir. 1968).\n\nThe Government's assertion of fraud against Loftin rests primarily upon four categories of expenditures: (i) the constructive dividend arising from the land clearing operation; (ii) the political campaign contributions received by Loftin for his ill-fated campaign; (iii) the Corporation's payments of family medical bills, insurance premiums, and improvements to residential real estate; and (iv) the corporate advances secured prior to certain trips, the corporate payment of travel expenses, and the corporate provision of college football tickets. We discuss these seriatim as we turn now to a consideration of the facts underlying the deficiencies in Loftin's 1963 and 1964 returns.\n\nA. THE LAND CLEARING OPERATION:\n\nThe Government asserts that Loftin knew that if the Corporation cleared the land under the procedures established by the partnership, as it eventually did, a constructive dividend would accrue to the taxpayers, taxable to them.\n\nOne of the primary pieces of evidence cited by the Government in support of this assertion is a conversation between John Savage, the Corporation's accountant, and Loftin at an early stage of the clearing operation. In that conversation, Savage voiced his concern that the commencement of land clearing operations prior to the transfer of the property to the partnership might produce a constructive dividend, taxable to the stockholders. However, this statement, though seemingly supportive of the Government's position, is susceptible to an entirely different interpretation when one considers the context within which the advice was rendered. Savage was not concerned in general over the possibility of a constructive dividend arising from the land clearing work. He was concerned specifically with the dividend which could arise if the Corporation cleared part of the land prior to the sale to the partnership and that clearing enhanced the value of the land at sale, thereby producing an appreciation taxable to the Corporation upon such sale.\u003cspan class=\"fnref\"\u003e66\u003c/span\u003e Such a statement hardly could be construed as evidence that Loftin knew that the land clearing operation would produce the constructive dividend eventually assessed against him on the basis of a comparison of the costs incurred and payments received by the Corporation for its clearing efforts.\n\nIn essence, Savage was concerned over one of two things. Either the Corporation would incur a tax on the sale of the property to the partnership at a price reflecting the increase in value of the land due to the clearing performed prior to transfer, or, if the Corporation did not increase the selling price over the price it had paid, the partnership eventually would incur a constructive dividend equivalent to the appreciated value purchased at no additional cost. App. 796-97. Thus, Savage's advice is hardly applicable to the facts that underlie the district court's constructive dividend finding.\n\nThe Government does offer further evidence of fraudulent intent though. It is clear, from the record, that Loftin directed the accountant and/or bookkeeper to \"conceal\" the initial expenses of the clearing operation on the corporate books by spreading them among ongoing accounts.\n\nThere can be no question that from April 17, 1963 through May 31, 1965, a separate ledger category for expenses relating to the Yazoo project was not maintained. This evidence, viewed alone, might compel an inference that Loftin was attempting to conceal the entire project from public exposure in order to avoid the assessment of a constructive dividend. There are, however, several mitigating circumstances in this instance.\u003cspan class=\"fnref\"\u003e67\u003c/span\u003e\n\nFirst, it is difficult to reconcile a purported desire to hide an entire operation with the fact that numerous entries were made on the corporate and partnership books after May 31, 1965. Indeed, as early as December 31, 1964 - one year after the partnership secured title to the property - a payment was registered on the partnership books, according to the stipulation of both parties.\u003cspan class=\"fnref\"\u003e68\u003c/span\u003e Moreover, it is especially significant that this initial entry was made prior to the commencement of the first I.R.S. audit. This was hardly the action of an individual furtively covering his tracks to avoid the snare of an investigator.\u003cspan class=\"fnref\"\u003e69\u003c/span\u003e\n\nSecond, Loftin explained that he failed to record the initial expenses in a separate category because the amount cleared prior to the first entry - and the expenses attendant thereto - were not worth \"saying grace over.\"\u003cspan class=\"fnref\"\u003e70\u003c/span\u003e The amount cleared prior to the first entry totaled eight hundred acres. Although this would seem to be sufficiently sizeable to prompt an entry on the ledger, Loftin's belief to the contrary is not implausible given the total amount of acreage which was in fact cleared on this project: 9,617 acres.\u003cspan class=\"fnref\"\u003e71\u003c/span\u003e At the very least, Loftin and Woodard contemplated the clearing of over six thousand acres at the time Loftin made this statement. We do not suggest that the district court was incorrect in the conclusions drawn from these circumstances. Rather, we suggest that independently, or in combination, these circumstances do not rise to the level of \"clear and convincing evidence\" of fraudulent intent - the standard of proof which must be met before a finding of fraud can be made.\n\nAt the same time, we do not deny that the subjective aspect of fraud may often dominate the objective.\u003cspan class=\"fnref\"\u003e72\u003c/span\u003e The natural intractability of a determination of fraudulent intent has been tamed gradually by the introduction of factual checklists which provide a framework that courts may use \"to avoid deciding each case viscerally.\" Webb, 394 F.2d at 378. These criteria make the necessarily subjective trek more feasible, despite its being \"obstacle-pocked because we have no cinematography of the mind . . . .\" Id. A titration of the many standards developed for the determination of tax fraud produces the following distillate of fraud indicia:\n\n1. Intentional understatement of income, substantial in amount . . . .\n\n2. Intentional overstatement of deductions, substantial in amount . . . .\n\n3. Recurrence of the understatement of income or overstatement of deductions for more than one tax year.\n\n4. Secret bank deposits for income . . . .\n\n5. Undisclosed source of income from other than taxpayer's regular business . . . .\n\n6. Undisclosed income derived from illegal business . . . .\n\n7. Lack of adequate books and records which one would expect of the particular taxpayer, based on his business experience, education, knowledge of books and records, etc.\n\n8. False entries and other falsifications in books . . . .\n\n9. No reasonably acceptable explanation made by the taxpayer . . . as to why falsity appeared in the return . . . .\n\n10. Conviction of the taxpayer on criminal evasion . . . .\n\nWebb, 394 F.2d at 378, n. 11 adopting criteria set forth in Balter, Tax Fraud and Evasion (3rd ed. 1963), pp. 8-54 and 8-55.\n\nOf these ten criteria, only numbers one, two, three and seven truly are applicable herein. The lack of any substantial attempt to hide the clearing operation from public scrutiny and the fact that record-keeping was begun prior to the initiation of the audit suggests that those criteria relating to a concerted cover-up - criteria five, six, eight and nine - are inapposite to a consideration of Loftin's actions. Clearly, criteria four and ten are inapplicable on their face.\n\nCriterion three - the recurrence of an understatement subsumes criteria one and two for present purposes. It is vitiated largely because the understatement recurred here for only three years and the existence of a constructive dividend in those years is now uncertain. For both 1963 and 1964, the bulk of the understatement was comprised of the constructive dividend found in connection with the clearing operation. That is why, for the most part, there was no deficiency in 1965. Under the district court's analysis, payments exceeded costs in that year. Thus, the ambiguity which presently surrounds the constructive dividend issue undercuts its use as a significant component of a finding of fraud. If Loftin honestly believed that the value of the clearing performed would be established at fifty dollars per acre (i.e. the fair market value testified to at trial), there would have been no constructive dividend in this case and, therefore, the use of the constructive dividend as a foundation for the finding of fraud would have been rendered nugatory.\n\nSecondly, we note that two years in succession do not a pattern make. In any event, case law does not indicate that consistent and substantial understatement of income is sufficient, by itself, to support a finding of fraud.\n\nThe mere understatement of income, standing alone, is not enough to carry the burden cast upon the Commissioner in seeking to recover fraud penalties. But each case is to be considered in the light of its own facts. Consistent and substantial understatement of income is by itself strong evidence of fraud. This proof, coupled with the showing that the records were both incomplete and inaccurate, and that the petitioner did not supply the bookkeeper with all of the data necessary for maintaining complete and accurate records, is enough to warrant the Tax Court in finding fraud.\n\nMerritt, 301 F.2d at 487. (emphasis added). Ours is not the type of situation which the courts meant to encompass within a rule linking a finding of fraud to the consistent and substantial understatement of income by a taxpayer. See, Merritt v. Commissioner of Internal Revenue, 301 F.2d 484 (5th Cir. 1962); Holland v. United States, 348 U.S. 121, 75 S. Ct. 127, 99 L. Ed. 150 (1954).\n\nThus, only criterion number seven remains in our review of the propriety of the fraud finding in connection with the constructive dividend. It is true that the books kept by the taxpayers were not as thorough as they should have been. However, given the custom of this taxpayer to defray initial corporate expenses of a project among ongoing expense categories from other projects, this point is somewhat blunted. Very little work was performed from January 1, 1963 to December 31, 1963 - the first of two calendar years utilized by the lower court in support of its finding of fraud; and by the end of 1964, the only other year in which the district court found Loftin to be fraudulent, an entry already had been made upon the partnership books.\n\nIn short, Loftin and Woodard do not fit within the mold cast by the courts in this area, as may be seen by comparing this case to Estate of Upshaw v. Commissioner of Internal Revenue, 416 F.2d 737 (7th Cir. 1969). There, fraud was found only after taxpayer had consistently and materially understated his income; had failed to maintain adequate books; and had made a material mis-statement to an Internal Revenue Agent. The only similarity to Upshaw that may be found in the present case is taxpayer's failure to declare a significant amount of income for three tax years - and even this is not present if the constructive dividend found to have arisen atop the land clearing operation is deleted on remand. Loftin and Woodard were keeping records of these operations. Though those records were not impeccable, they did not reflect a concerted effort to conceal the nature of these operations. Even the failure to declare the initial expenses and income was explicable as part of a consistent pattern of conduct engaged in by the corporation on almost every project it undertook. In addition, the understatement of income, even with the presence of the constructive dividend from the land clearing operation, was not consistent. Finally, unlike Upshaw, neither taxpayer made material misstatements to the Internal Revenue Service.\n\nThus, we conclude that the clearing operation and the constructive dividend found in relation thereto cannot supply the foundation to support a finding of fraud as to any part of the deficiency for 1963 and 1964, given the record as it now stands. There are, however, other sources of undeclared income in those two years which must be considered in assessing the propriety of the district court's finding.\n\nB. THE REMAINING EXPENDITURES:\n\nAbsent the constructive dividend as a potential support for the finding of fraud, we must focus on the remainder of the expenditures in question: the travel expenses; advances; political campaign contributions; and premium payments received by Loftin from corporate funds. In all likelihood, proof of fraud as to any one of these items would mandate approval of the district court's finding of fraud as to the entire deficiency in which it appeared. Webb, 394 F.2d at 378. However, such proof is not present herein.\n\nFirst, Woodard was the recipient of all but one of these expenditures in the years at issue - the political campaign contributions. Yet, the district court did not find Woodard liable for fraud in any of these years. Unless there is evidence supporting a distinction between Loftin and Woodard as to their intent in not reporting the income connected with the assorted funds received by each from corporate coffers or there is evidence supporting a finding of fraud as to the expenditure received by Loftin alone, we must remand on the issue of fraud.\n\nOne possible explanation for the decision to find only Loftin liable is that the district court believed that as to the expenditures received by both Loftin and Woodard, Loftin intended to evade the tax known to be owing while Woodard did not. While this could be a plausible explanation, it is not so here because there is no basis in the record or in the district court's findings to support such a distinction.\u003cspan class=\"fnref\"\u003e73\u003c/span\u003e In fact, the record suggests that as to the corporate expenditures received by both taxpayers, Loftin and Woodard should be treated in pari materia on the issue of intent.\n\nPerhaps, then, the court's distinction between the two taxpayers for 1963 and 1964 was based on the fact that Loftin had not declared income arising from the political campaign contributions he received from the Corporation - an item that Woodard did not receive.\u003cspan class=\"fnref\"\u003e74\u003c/span\u003e The political contributions for his race for the Louisiana legislature totaled slightly over $4,000. Although it is unclear whether these payments were received in both 1963 and 1964,\u003cspan class=\"fnref\"\u003e75\u003c/span\u003e that they were received in at least one of those years is beyond peradventure.\n\nWere the state of the law as to political contributions clear in 1963, there would be little problem in resolving this matter. However, such is not the case.\n\nLouisiana law, as of 1963, dictated that contributions by a corporation to a political party or person were prohibited. La.R.S. 18:1483. There is no question, then, that this contribution may have been impermissible as a matter of law. But this fact stands independent from an inquiry into whether the recipient, Loftin, should have known that the receipt of the contribution was a taxable event and whether his failure to declare that contribution was willful. In this regard, it is significant that while the dividend statute generally indicates that if the distribution is to a shareholder and it is out of earnings, it is a dividend, not all such distributions are in fact found to be constructive dividends.\n\nThere is no dearth of case law refusing to designate certain corporate distributions as constructive dividends. See, John Kelley Co. v. Commissioner of Internal Revenue, 326 U.S. 521, 66 S. Ct. 299, 90 L. Ed. 278 (1946); Bogardus v. Commissioner of Internal Revenue, 302 U.S. 34, 58 S. Ct. 61, 82 L. Ed. 32 (1937); Limericks, Inc. v. Commissioner of Internal Revenue, 165 F.2d 483 (5th Cir. 1948); and Paramount-Richards Theatres, Inc. v. Commissioner of Internal Revenue, 153 F.2d 602 (5th Cir. 1946). The nature of the distribution only can be decided within the factual context of each case.\n\nSimply stated,\n\nWhether or not a corporate distribution is a dividend or something else, such as a gift, compensation for services, repayment of a loan, or payment of property purchased, presents a question of fact to be determined in each case.\n\nLengsfield v. Commissioner of Internal Revenue, 241 F.2d 508 (5th Cir. 1957). See, Hoover v. Commissioner, 1968 T.C. Memo 49, 27 T.C.M. 226 (1968).\n\nInstances of corporate distributions which were not found to be \"dividends\" are numerous. For example, when an interest payment is made by a corporation to a stockholder, the court must decide whether the relationship of the stockholder to the corporation is one of creditor and debtor.\n\nThis is mandatory, despite the fact that such a payment from the corporation would fit within the language of 26 U.S.C. ยง 301, the statute describing a dividend. See, McSorley's Inc. v. United States, 323 F.2d 900 (10th Cir. 1963). The basic tenet underlying the decision not to categorize corporate distributions as dividends, despite their appearance to the contrary, is embodied in Regulation ยง 1.301-1(c). This regulation makes ยง 301, which sets forth \"rules applicable with respect to distributions of money and other property[,] . . . not applicable to an amount paid by a corporation to a shareholder unless the amount is paid to the shareholder in his capacity as such.\" Thus, interest paid to a stockholder who is a bona fide creditor is not a dividend nor are payments made to a stockholder who is a bona fide lessor.\n\nIn a similar vein, Loftin may have believed that the political contributions made to him were not income as long as he utilized them for political purposes. The state of the law at that time does not preclude such a conclusion. In line with this, it is clear from the record that Loftin explained that his failure to declare these amounts as income rested upon a belief that he was acting in a manner beneficial to the Corporation since his election would redound to its benefit. See, testimony of IRS Agent French, App. 1043.\n\nIt is significant, in this regard, that by 1963, taxpayers still were bound by the guidance provided in Revenue Ruling 54-80:\n\nWhere a political gift is received by an individual or political organization and it is held or used for the purposes intended, i.e., for present or future expenses of a political campaign or for some similar purpose, it is not taxable income to the recipient.\n\n1954-1 Cum.Bull. 11. At the same time, the ruling cautions, unlike its 1939 precursor, that funds diverted to personal use must be declared as taxable income.\n\nThis ruling provided a foundation for the court's opinion in O'Dwyer v. Commissioner of Internal Revenue, 266 F.2d 575 (4th Cir. 1959), a case concluding, under Ruling 54-80, that had the taxpayer not diverted political contributions to personal use, he would not have incurred taxable income therefrom. The O'Dwyer court decided, in 1959, that Revenue Ruling 54-80 \"was declaratory of judicial interpretation of existing law.\" O'Dwyer, 266 F.2d at 586. In United States v. Jett, a case involving a charge of criminal tax evasion premised on facts comparable to those found in the case sub judice, Revenue Ruling 54-80 was established as the reigning legal principle as of 1961. 352 F.2d 179, 182 (6th Cir. 1965). This trend was carried through at least as far as 1970 by United States v. Miriani, 422 F.2d 150, 152 (6th Cir. 1970) - a date subsequent to the time frame at issue in this case.\n\nThus, in 1963, Loftin rightfully could have relied on Revenue Ruling 54-80 in seeking guidance with regard to the proper tax treatment of political contributions. According to this ruling, the receipt of the contribution, without more, did not signal a taxable event. The advice of this ruling, in combination with the fact that not all corporate distributions to shareholders were and are constructive dividends, suggest that an inference of fraudulent intent could not be supported atop the political campaign contribution alone.\n\nThe income tax characteristics of the political contributions received by Loftin are and were too uncertain to support a finding of fraud without more direct evidence that Loftin knew that he had an obligation to report such funds. This is not Webb, supra, where the taxpayer was found liable for fraud because he persistently failed to supply the proper information to the tax authorities after being warned to do so several times. Webb, 394 F.2d at 380. Nor is the present case comparable to Benes, supra, where the taxpayer did not admit to his accountant until the year in which his corporation completed its work for him - four years after the work in question had been commenced - that he may have withheld certain information from him. Finally, we are not faced here with the type of fraudulent taxpayer present in Merritt - a taxpayer whose consistent and substantial understatement of income was accompanied by a failure to maintain complete and accurate records and by a decision to withhold from the bookkeeper a substantial amount of vital data needed in the maintenance of complete and accurate records. Indeed, the testimony that we have before us indicates that Loftin was cooperative and forthright in the course of the audit of these potentially fraudulent deficiencies.\n\nIn sum, while the Corporation would have been remiss had it taken deductions for the contributions made, both from the perspective of Revenue Ruling 54-80 and the Louisiana law prohibiting such contributions, this fact has no bearing on the issue of Loftin's fraud as an individual taxpayer. His involvement with potential corporate fraud in requesting certain deductions cannot support a finding of fraud on his individual tax return in this instance.\u003cspan class=\"fnref\"\u003e76\u003c/span\u003e\n\nThe evidence before us does not substantially support a finding of fraudulent intent as to Loftin. The trial court is directed to reconsider this issue on remand in a manner consistent with the above instructions.\n\nC. THE CORPORATION'S FRAUD:\n\nA final matter, raised by the Government's cross-appeal, concerns the failure of the district court to find the Corporation liable for fraud. As noted above, we are unable to discern the reason behind the district court's decision to distinguish between Loftin and the Corporation on the issue of fraud. While Loftin's actions as President of the Corporation and its majority stockholder are, at best, tangentially available as foundations for Loftin's fraud as an individual taxpayer, they are quite relevant to the issue of the Corporation's fraud.\n\nLoftin \u0026 Woodard, Inc. was controlled completely by Loftin and Woodard. They were the sole shareholders. In addition, they were the sole executive employees - president and vice-president respectively.\n\nIn investigating the issue of corporate fraud, the court must determine whether the conduct and intentions of the corporation's officers and/or agents may be imputed to the entity itself. Hicks Co. v. Commissioner, 56 T.C. 982 (1971), aff'd 470 F.2d 87 (1st Cir. 1972); Benes, supra. It is difficult to perceive how the actions of Loftin and Woodard could not have been attributable to the corporate entity in almost every instance. If Loftin and/or Woodard were fraudulently culpable for their actions with respect to the cash advances etc., it would be difficult to justify the district court's failure to impute the same motive to the Corporation. The Corporation benefitted from the expenses it paid on behalf of Loftin and Woodard in that those expenses were translated into deductions each year. More to the point, the very manner in which the Corporation was conducted by Loftin and Woodard suggests that the corporate entity had become their alter ego - a fact in itself capable of providing a sufficient basis for the imputation of fraud. See, Ruidoso, supra.\u003cspan class=\"fnref\"\u003e77\u003c/span\u003e Indeed,\n\nwhere fraud is alleged against a corporate taxpayer, the requisite proof of fraudulent intent is to be found in the acts of its officers, inasmuch as the corporation, being an artificial person created by law, can have no separate intent of its own apart from those who direct its affairs.\n\nBenes, 42 T.C. at 382.\n\nThus, should the district court find Loftin liable for fraud on remand, it should reconsider the issue of corporate fraud in connection with those fraudulent elements of the deficiency which benefitted the Corporation in some fashion.\u003cspan class=\"fnref\"\u003e78\u003c/span\u003e\n\nD. CONCLUSION:\n\nFraud is not easily shown. It implies bad faith, intentional wrongdoing, and a sinister motive. . . . Negligence, whether slight or great, is not equivalent to the fraud with intent to evade tax named in the statute. The fraud meant is actual, intentional wrongdoing, and the intent required is the specific purpose to evade a tax believed to be owing. . . . Added to this is the burden placed upon the Commissioner.\n\nLee v. United States, 466 F.2d 11, 14, n.5 (5th Cir. 1972).\n\nThe district court's decision to distinguish between Loftin and Woodard for purposes of fraud leads us to believe that a finding of fraud as to Loftin is not sufficiently supported by the record. To predicate fraud upon that portion of Loftin's deficiency attributable to the land clearing constructive dividend is not acceptable while that issue remains in limbo on remand. Second, the presence of similar components in Loftin and Woodard's deficiencies (including the constructive dividend, since it was received by both) - save one - eliminates these similar components as potential supports for the finding of fraud given the absence of evidence distinguishing the intent of Loftin from Woodard with regard to them. Thus, at the present time, we are left with only one component of the initial deficiencies for consideration as a support - the political contributions which Loftin received and Woodard did not. However, given the unsettled nature of the law at the time that the contributions were received, this too is inadequate.\n\nIn short, we must remand the issue of fraud for further proceedings consistent with this opinion,\u003cspan class=\"fnref\"\u003e79\u003c/span\u003e for\n\nboth Government and Taxpayer are entitled to a trial of the hotly contested inferences by a court consciously applying the correct legal standards. They will not have had such a trial merely by our undertaking to say that had the standard been applied, the evidence would have warranted the result. Trials are committed to trial courts. Our function is limited and circumscribed.\n\nCarter v. Campbell, 264 F.2d 930, 941 (5th Cir. 1959).\n\nThe record does not provide clear and convincing evidence that Loftin intentionally avoided paying a tax that he knew to be owing.\n\nV. THE DELINQUENCY PENALTY SET-OFF ON THE 1961 RETURN:\n\nThe final issue before us on appeal is unrelated to the preceding three issues. It poses an intriguing question concerning an audit of the Corporation's 1961 tax return initiated at the Corporation's own request.\n\nIn 1961, the Corporation filed its tax return late. In doing so, it incurred a 10% delinquency penalty, pursuant to ยง 6651(a) of the Code. The following year, the Corporation filed for a refund on its 1961 return because of a claimed carryback of 1962 losses.\n\nIn auditing the 1961 return, the Commissioner reevaluated it in its entirety, as permitted by law. See, Lewis v. Reynolds, 284 U.S. 281, 52 S. Ct. 145, 76 L. Ed. 293 (1932). This reevaluation resulted in the disallowance of several deductions originally asserted by the Corporation. These disallowed deductions amounted to $34,000 in income that should have been declared at the time the 1961 return was filed. Because that return was filed late, that extra increment of income, generated by the disallowed deductions, would have produced an additional late filing tax because of the application of the 10% delinquency penalty to that increment.\n\nIn the course of performing this audit of the 1961 return, the Commissioner also determined that the loss carryback arising from 1962 corporate losses was applicable to the 1961 return. Altogether, that loss carryback, diminished by the newly found deductions that were improperly asserted, would have produced a refund of $5,854 from the 1961 return. However, the Commissioner then reduced this refund by an amount derived from applying the 10% late filing penalty to the additional increment in income that arose from the deductions which were improperly asserted in the late filed 1961 return. Offsetting that amount - $3400 (10% X disallowed deductions) - produced a net refund slightly over $2000.\n\nThus, the Commissioner used the additional late filing penalty as a set-off against a refund determined several years after the 1961 return was filed. Both parties agree that no additional tax can be asserted by the Government against a taxpayer once three years have elapsed after the return in question is filed. 26 U.S.C. ยง 6501(a). The parties disagree as to whether the increase in the delinquency penalty, which penalty initially was asserted in a timely manner as to the 1961 return, constituted the imposition of an \"additional\" tax. The district court struck down the imposition of this increment by the Commissioner. We disagree.\n\nIn conducting an audit for the purpose of determining the refund due a taxpayer, the Commissioner is guided by the Supreme Court's decision in Lewis, supra. Lewis permits the Commissioner to reopen the prior return to determine whether there were any deficiencies in that return which were undetected at the time it was filed. At the same time, the Commissioner is not permitted to assess a new tax.\n\nIn performing the audit, the Commissioner did find deductions that were improperly asserted. Had these deficiencies been discovered at the time the 1961 return was filed, they would have increased the amount of income tax that the Corporation owed the Government. Because of this, they would have increased the additional amount owed to the Government from the 10% delinquency penalty since the amount owed under that penalty increases as the amount of income tax owed for the year to which it applies increases. It is undisputed that this delinquency penalty was assessed in a timely fashion initially when taxpayers delayed in filing their 1961 corporate return.\n\nPrior to the filing of the 1962 return, the 1961 return represented an independent entity. That is, prior to the 1962 return, the amount of income tax owed for 1961 was calculated entirely on the basis of the 1961 return. Had that return been filed without the improper deductions, more income tax would have been owing for that year. Thus, the amount owing under the 10% delinquency penalty would have been increased a commensurate amount. The fact that in 1962, losses sufficient to trigger a loss carryback arose, does not alter the amount of tax that was owing in 1961 prior to the filing of the 1962 return. Simply stated, the net operating loss carryback which arose from the 1962 return was not in existence at the time the Commissioner calculated the amount owing under the application of the delinquency penalty to the 1961 return.\n\nIn an audit of the 1961 return, the net operating loss carryback of 1962 cannot be utilized to disturb the amount that would have been found due had the delinquency penalty been applied to a return that had been completed properly. This proposition derives support from Manning v. Seeley Tube \u0026 Box Co. of New Jersey, 338 U.S. 561, 70 S. Ct. 386, 94 L. Ed. 346 (1950). See, also, Kingston Products Corp. v. United States, 368 F.2d 281, 287, 177 Ct.Cl. 471 (1966).\n\nIn Manning, deficiencies were assessed by the Commissioner with regard to the return of a corporate taxpayer. In addition, the Commissioner required the taxpayer to pay the interest due on the deficiency from the date on which the tax initially should have been paid to the date on which the assessment was made. As in the case sub judice, the taxpayer had a subsequent net operating loss which it chose to carry back to the year in question. This loss, when carried back, was sufficiently large to eliminate any tax and interest found owing. However, if the interest was permitted as a set-off, taxpayer's refund would be correspondingly reduced.\n\nThe problem before the Supreme Court was \"whether the interest on a validly assessed deficiency is abated when the deficiency itself is abated by the carry-back of a net operating loss.\" 338 U.S. at 565, 70 S. Ct. at 389. The Court decided that it was not.\n\nFrom the date the original return was to be filed until the date the deficiency was actually assessed, the taxpayer had a positive obligation to the United States: a duty to pay its tax.\n\n338 U.S. at 565, 70 S. Ct. at 389. Absent a clear legislative indication to the contrary, the right to possess money owed the Government for the period in which it is owed must reside with the Government. This formed the predicate for the Court's decision in Manning. It is equally cogent in the present case.\n\nThe Manning analysis of the relationship between the carryback provisions and the interest provision is quite helpful here. Chief Justice Vinson found that the Government's authority to charge interest on funds withheld by the taxpayer was legislated prior to the enactment of the carryback provision of 1942. The adoption of the carryback provision did not alter the taxpayer's obligation to file a timely return and to render timely payment thereon.\u003cspan class=\"fnref\"\u003e80\u003c/span\u003e This proposition was quite clear in the Court's mind. Indeed, a contrary conclusion would have rendered 26 U.S.C. ยง 3771(e) inexplicable for that provision stated that a taxpayer cannot claim interest from the Government on amounts refunded after an audit is performed on the basis of net operating loss carrybacks.\n\nThe interest payment in Manning was asserted against taxpayer because he failed to fully report his income. See, 26 U.S.C. ยง 271(a). In like fashion, the delinquency penalty in the present case was assessed against taxpayer because it failed to report its income on time. There is no reason that either assessment should be nullified by a subsequent net operating loss carryback - a factor which does not in any way relate to taxpayer's prior failure to fully or timely report his income.\n\nIn sum, the delinquency penalty already was in existence prior to the 1962 return because the 1961 return was filed late. It did not arise because the Commissioner, in 1967, suddenly discovered items that had not been reported properly. Had those items been discovered in 1961, the amount owing under the late filing penalty would have been increased. That they were discovered later does not alter this fact. Their assessment, as a set-off against a refund, does not represent the imposition of an additional, or new tax.\n\nThis is the import of Lewis. For although the statute of limitations may have barred the assessment and collection of any additional sum, it does not obliterate the right of the United States to retain payments already received when they do not exceed the amount which might have properly been assessed and demanded.\n\nLewis, 284 U.S. at 283, 52 S. Ct. at 146 (emphasis added). See, also, Patterson v. Belcher, 302 F.2d 289, 295 (5th Cir. 1962).\n\nWe reverse the district court's determination on this final issue.\n\nTherefore:\n\nAs to the deficiencies assessed primarily on the basis of the constructive dividend found in connection of the land clearing operation we VACATE AND REMAND to the District Court.\n\nAs to the deductibility of expenses by the corporation prior to the transfer of the land to the partnership we AFFIRM; as to the deductibility of expenses after the transfer of land we VACATE AND REMAND.\n\nAs to the finding of fraud made as to Loftin we VACATE AND REMAND.\n\nAs to the use of the increase in the delinquency penalty as a set-off against the 1961 return we REVERSE.\n\n\u003cspan class=\"fn\"\u003e* United States District Judge for the Southern District of Florida, sitting by designation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Taxpayers chose to proceed in the district court in this matter. See, 28 U.S.C. ยง 1346; 26 U.S.C. ยง 7421 for alternative procedures available for the pursuit of such challenges.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The appeals arise from eleven consolidated suits instituted by the corporate and individual taxpayers for the refund of $480,503.78 in taxes, interest and penalties.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The terms of the sale were for cash payment. Loftin and Woodard recognized soon after the property became available for purchase that only their corporation would have a sufficient credit rating to obtain a purchase money loan in the requisite time period. Indeed, the partnership entity had not come into legal existence at the time the purchase was eventually consummated by the corporation. App. 628 (deposition testimony of K.C. Loftin).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The remaining three thousand plus acres of property eventually cleared by the corporation were purchased in increments over the next five years.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Prior to the purchase, on April 1, 1963, the corporation adopted the following resolution:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. That is, no actual farm clearing was done from April 17, 1963, (the date of purchase), to May 31, 1963, the termination of the corporation's tax year. See, App. 323 (testimony of E.A. Woodard).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. A stipulation was entered into by all parties before trial. This stipulation indicated that the first payment in compensation for the land clearing efforts was made by the partnership on the final day of its own tax year - December 31, 1964. As will be discussed later, the Government contends, on this appeal, that the stipulation cannot be read to have the meaning one would ascribe to a literal reading of its terms.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The partnership secured a long term commitment from the Connecticut General Insurance Company in order to finance the clearing operation itself. As the operation proceeded, the partnership received loans from the insurance company. Thus, funds were received under this procedure once the clearing was begun, not before. The partnership would then tender funds received in this manner to the Corporation, reflecting this by way of an accounts receivable entry on the partnership books.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The total of $481,000 paid by the partnership for the land clearing represents, according to the taxpayers, a payment of $50 per acre. Taxpayers contend that this figure is the value of the land clearing efforts as performed by the corporation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Stipulations to these transactions were entered into at trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. As Judge Hunter noted toward the end of the trial, I want the record to show that I have been pushing the lawyers to try this case, personally, for three to four years even though it is not my case. We have waited this long, I want to get all the evidence in that might be pertinent and I am not going to stand on technicalities. App. 1031.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The concept of a constructive dividend can be traced to the assessment of a constructive receipt of income taxable to an individual whose corporate employer agrees to pay his tax bill. Old Colony Trust Company v. Commissioner of Internal Revenue, 279 U.S. 716, 49 S. Ct. 499, 73 L. Ed. 918 (1929). Since then, however, the Internal Revenue Code has provided an even more graphic basis from which to trace the contours of this tax concept.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Regulation ยง 1.317-1 reads as follows: The term 'property', for purposes of part 1, subchapter C, chapter 1 of the Code, means any property (including money securities, and indebtedness to the corporation) other than stock, or rights to acquire stock, in the corporation making the distribution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The District Court determined that the constructive dividends for the two years at issue - 1963 and 1964 - were quite substantial: Calendar Year Constructive Dividend (determined by comparing expenses of the clearing operation with payments made by partnership 1963 $160,898.80 1964 83,609.22Taxpayers do not contest the district court's finding as to certain expenditures made by the corporation on their behalf in their capacity as shareholders. One such expenditure involved the provision of cash advances to the taxpayers on trips taken by them ostensibly for business purposes. Taxpayers concede that their inability to establish a sufficient business connection concerning these expenses renders futile any challenge to their status as constructive dividends. These expenditures, which are small in relation to the constructive dividend assessed on the basis of the land clearing operation alone, are not, therefore, the focus of the constructive dividend portion of the taxpayers' appeal. They are, however, involved in our subsequent discussion of the fraud findings made by the district court, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The issue of whether annual accounting periods were the appropriate time frames within which to measure the constructive dividend is the subject of a lengthy discussion in section II-C, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Explanations for the failure to render payment immediately may be found in the testimony of Lester Harrell, the corporation's accountant who posted entries on the corporate books monthly and made adjusting entries at year's end, and E. A. Woodard, vice president and one of the two shareholders of the corporation. Harrell indicated that payments did not occur upon the commencement of the clearing operation because expenses always ran ahead of income recognition on a clearing job. App. 420-421. Woodard explained that both the corporation and the partnership were extremely low on funds initially. App. 349-50. Finally, there is much testimony from witnesses familiar with the land clearing industry that payments on such jobs did not occur until the jobs were well underway, if not completed. See, n. 2, section II-C, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Nell Burton - secretary-treasurer of the corporation and its informal bookkeeper - spread the initial expenses of all jobs undertaken by the corporation among categories established for ongoing jobs. App. 358. Indeed, she testified that she never told either Loftin or Woodard that she was spreading the Yazoo expenses initially and she noted that as far as she knew, neither taxpayer was aware that this was occurring. This practice was confirmed by Lester Harrell, who testified as follows: It was our policy that if we had a small job going to not set up another column before, you know, to just charge it to another job because in the end result, it didn't make any difference, really. I mean, it was expense anyway. Because when I give John [Savage, the tax accountant] a trial balance under tractor expense I add all the tractor expense together and get one tractor expense and as far as the income on the corporation it would make no difference, see. App. 409. Again, toward the end of the trial Harrell explained, in justification of his directing Nell Burton to spread initial expenses, well, in other cases where we had jobs like, well, not such as this, this is the only job we had like this, I assume, but it was common for us to do that, to spread costs to other jobs a lot of times because in our bookkeeping system, it really doesn't make that much difference. All costs was cost. App. 940. See, also, App. 941. Thus, it appears that the corporation's practice was to spread initial expenses until those expenses amounted to a substantial amount. Harrell testified that the first entry of costs in an identifiable category was delayed because they were not \"enough to fool with, I didn't think.\" App. 395. As John Savage explained, when he asked Loftin and Woodard if anything had been done on the land prior to May 31, 1964 so that he would be guided as to the need to establish a separate category, \"they said nothing, not enough to say grace over, is my term.\" App. 798. As to the delay in the recordation of entries on the partnership books, Harrell offered that it was not until 1964 that the partnership had any books at all. App. 394. The partnership's payments to the corporation eventually were reflected by entry of a debit to the account receivable predicated on the advances from the partnership to the corporation that had been made possible by the loans made by the insurance company to the partnership. According to Woodard, because the partnership did not receive any loans until some clearing had been accomplished and because only 800 acres were cleared prior to the end of fiscal 1964, the absence of an entry of payment until December 31, 1964 is not surprising. App. 318-20. Further Harrell explained that while an entry would be made on December 31, this was an adjusting entry and did not preclude the fact that a payment had been made and received prior to this date (though in the same accounting period). App. 414.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. See, n. 1 and n. 6, supra, re. cost spreading.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The entries made by the partnership on their books are of added significance when one recognizes that they were not the product of a taxpayer's effort to disguise the transaction from public scrutiny. The partnership entries and the corporation's first entries were made prior to the initiation of the audit which culminated in the assessments at issue. These entries do not appear to have been made to allay the suspicions of the Internal Revenue Service. Thus, the district court should consider, in connection with the determination of whether an economic benefit was conferred without expectation of repayment, that the partnership entity was not conducting itself in a manner which suggests an attempt to obfuscate the clearing operation on paper. Once the clearing operation was in full swing, the books of the partnership and corporation reflect expenses and payments quite clearly. As Harrell explained, even though the corporation does not reflect a recognition of income by the end of Fiscal 1964, the income due for efforts in that span is fully reflected by the time of the entry in Fiscal 1965, prior to the initiation of the crucial audit. App. 419-20. It should be noted that the audit was begun in May of 1965 on the basis of an informer's tip. A criminal investigation of the corporation and its officers terminated in 1967 at which time the IRS set up an assessment against the taxpayers. App. 302. Toward the end of the trial, French, one of the most active IRS agents involved in this case, testified that when he began his examination he only had the 1963 and 1964 tax returns to review. The 1965 return and the adjusting entries for that year were not on file when French first stepped into the corporation's office. Thus, while no costs had been entered in an identifiable category by the time of the initial audit, a major payment had been registered on the partnership books, but it was not until the audit was almost completed that French discovered these books. App. 1052-55. Further evidence of the absence of an intent to hide the operation from public scrutiny is provided by the fact that the land clearing operation was memorialized in the corporation's minutes, according to Savage. App. 978.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Savage managed the corporation's tax returns starting in 1962; the partnership's returns starting in 1964; and the individual's returns starting in 1965. The \"dividend\" advice with which he provided the stockholders was that they should make clear that the corporation was purchasing the land for the stockholders so that no dividend would arise on a subsequent transfer in that such transfer would not invest the partnership with anything which it did not already own. Therefore, there would be no taxable event. If the taxpayers did not make this clear, Savage feared that any clearing done by the corporation prior to the transfer would enhance the value of the land and spawn a constructive dividend to the stockholders if their partnership was permitted to purchase the land at the price the corporation paid prior to the clearing. App. 550-51; 795-97.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. That the clearing industry operated on a bid system which, because of its preliminary nature, could result in substantial losses is supported by the testimony of Woodard to the effect that the corporation had \"grossly underbid\" on other jobs prior to the Yazoo effort. App. 312. Woodard further testified that the corporation would not know how much a job would cost until it was complete. Thus it would not have known, during 1963-65, whether it cost more to clear the land than the alleged contract price had anticipated at $50 per acre. App. 351-53; App. 719-20; App. 942-43. It is noteworthy that Savage explained that there was no advantage to be gained by the corporation in having the partnership pay less than the costs the corporation incurred. In fact, an advantage would have accrued had the partnership overpaid in that the basis of the property, with regard to a future sale by the partnership, would have been increased. The presence of the bid factor, along with testimony indicating that the taxpayers anticipated a bid of $50 per acre with regard to this particular project (App. 942-43 and 719-20), suggest that the district court may have been overly hasty in assuming that the loss of money on this operation, derived from a comparison of the sum of direct and indirect costs with payments made, was explicable only if one assumed that the partnership intended to underpay the corporation ab initio.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. App. 351-53; 719-20; and 942-43.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. There are several troubling aspects of the manner in which the district court calculated the costs of the Yazoo project. First, several expenses included in the Yazoo project were not incurred as a result of it. Much of the farm equipment used at Yazoo came and went. That is, much of it was used on other jobs and was repaired at the Yazoo site. App. 990; 476. Agent French himself indicated he did not have time to sort out these non-Yazoo related expenses, though he ordinarily would have done so, because he was under the constraint of time imposed by the presence of a statute of limitations whose expiration tolled the end of the period for deficiency assessment. App. 1035-37. French could not determine which expenses were farm related and which were not during the course of the audit. App. 1052. In addition, in 1966, expenses from several small clearing jobs undertaken in that year were shifted to the Yazoo project. Second, the district court's decision to include indirect costs, such as depreciation and a pro-rata share of overhead, in the constructive dividend calculus is not without objection. Although some form of indirect cost inclusion probably was mandatory (see testimony of Savage at App. 739-42), the Government's reliance on United Aniline may not be altogether justified. While it is true that the United Aniline court did include depreciation and insurance costs in the calculation of the economic benefit attached to the item provided by that corporation to the shareholders, the item involved therein was not the service or product from which the corporation derived its livelihood. In the present case, land clearing - the primary subject of the constructive dividend analysis - was the raison d'etre of the corporation. This might alter the propriety of the indirect cost calculation undertaken by the district court. Finally, we are troubled by the apparent reliance of the district court on the report of an IRS Agent in the determination of the costs for the years 1963 and 1964. The court's figures for those two years were different from those proposed by the Government or the taxpayers. It is striking that the court's figures matched, to the penny, those derived by the Agent and listed in his report - a report which was never entered into evidence. Thus, a hearsay problem may have infected the correctness of those cost findings. See, n.1, section I-D, infra, for further discussion of this point.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. See, Horgren, Cost Accounting: A Managerial Emphasis, at 378.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. In support of the applicability of the differential value theory is the fact that the Yazoo project was unique within the context of the projects undertaken by the corporation in that period of time. Savage noted that the corporation had fairly large operating losses in 1962 and 1963, ranging as high as $89,000 in fiscal 1963. App. 814-15. In line with this, Woodard testified that the corporation did not have any other jobs of the magnitude of the Yazoo project from 1959-1966. Thus, the Government's theory that cost is the only correct measure of the value of the clearing operation because a fair market value of $50 would lead to losses is undercut. Simply stated, the corporation may have been involved in a profitable venture even though costs, indirect and direct, exceeded payments received because the differential value of the project may have been such that the Yazoo operation was profitable when viewed from the direct cost perspective alone. Fixed costs would have been incurred whether or not the Yazoo project was undertaken. To diminish the overall loss that the corporation would have incurred whether it had another job or not, the corporation rationally could have decided to undertake a project which provided income sufficient to cover direct costs, if not a little more. We do not mean to indicate that this was the motivation behind the corporation's decision to do the Yazoo clearing. Rather, we raise it in order to display the weakness in the assumption which the Government offers as the primary predicate for the district court's decision to overlook the fair market value offered by the taxpayers. It is clear that a differential value inquiry is one not easily made. Such a theory loses much force when the corporation has before it other jobs of equivalent magnitude and income prospects. However, the difficulty of such an inquiry cannot be permitted to serve as the catalyst for the choice of an otherwise untenable premise upon which an entire tax assessment of great magnitude is constructed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. In Walker, the court utilized out-of-pocket expenses and costs as the measurement of the value of the benefit conferred on the stockholder - the summer house utilized by the stockholder and his family. The taxpayer challenged this valuation as being improper and the court responded by noting that \"there was expert testimony that the lodge facilities had a 'fair rental value' of $16,500.00 per annum\" - a fair market value in excess of the value proffered by taxpayer himself. Thus, the evidence of fair market value even exceeded the taxpayer's own asserted value. Indeed, the overwhelming majority of the evidence of fair market value introduced at the trial coincided with the ultimate measure of value chosen by the court: out-of-pocket expenses (i.e. costs).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Crosby was a case involving land improvements made by a corporation for a stockholder - a context similar to that presently before this court. There, the court limited the value of the dividend to the fair rental value of the improvements made.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. App. 483-85.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. An eminent tax authority indicates that the weight to be given to an expert opinion on the subject of fair market value depends on the expert's qualifications; the expert's peculiar knowledge of the facts under consideration; and the reasons the expert tenders in support of his conclusion. 10 Mertens Law of Federal Income Taxation (1974 rev.) ยง 59.03. In the present case, the three experts made some showing in each of these three areas.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. See, generally, App. 480-543.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. App. 495-96. Moore had walked the land in question before and after the clearing operation. In addition, he claimed to be familiar with its condition prior to the commencement of the operations and subsequent thereto.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. App. 495-96.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. App. 498-99. In fact, Moore testified that he had done much clearing at this price and at lower prices. $50 per acre was the maximum price that he felt the job warranted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. App. 504; 515-18. Boykin also had walked the land before and after the clearing and testified to being familiar with its condition prior to and subsequent to the clearing operation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. App. 511-15.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Id. Woodard testified that the Yazoo clearing proceeded in three general phases: (i) cutting of timber, (ii) decking, (iii) burning and clean up. App. 346. The lack of clarity surrounding the precise nature of the Yazoo operation may not have been purposely induced in order to disguise the true cost entailed. Woodard explained that in the corporation's clearing of farm land, no set of specifications would be drawn up generally, although a written contract would be. As he noted, I have never heard of a specification being drawed [sic] up for a farm clearing job. It was just kind of an agreement between two parties. Q. Even that big a job? A. That's right. Never have I heard of it. Now, if you would go to work for the pipeline people or the Corps of Engineers, they had a set of specifications for you but a farmer, not to my knowledge, ever had a set. Q. . . . would a farmer, at least, put down in writing the various steps he wanted taken to his land? A. No. Q. To make sure you both understood what kind of deal you were talking about? A. No. App. 1000-1001.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. In addition, while Boykin indicated that ditching generally was done only when the contract required it (App. 517), he said that Loftin and Woodard's land was ditched. As to whether discing was done, Boykin testified that discing would have to be done in order for the land to be farmable. Thus, in addition to his expressed familiarity with the land in question before and after clearing, Boykin implied that ditching and discing were performed too. This was the predicate upon which Boykin's estimate of $50 per acre was based. It is by no means a clearly delineated predicate. Yet, at the same time, Boykin's testimony did not produce inferences contrary to those which would have been essential to a proper estimate of fair market value. While direct examination did not flesh out the full details of Boykin's knowledge of this land, cross-examination did not undercut the strong possibility that such details were present in Boykin's mind.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. Testimony of Moore, App. 497-98. Accord, testimony of Boykin, App. 506.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. App. 524-25. Holloway, the third of taxpayers' three witnesses, was a certified public accountant who represented about a dozen land clearers from 1963-1967. During the same period, he represented 150 land owners with timbered property proximate to the Yazoo clearing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. App. 527-29. Holloway also was familiar with the Yazoo land on a first hand basis before and after the clearing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. App. 529. Also, Holloway indicated that a general clearing operation, as far as he could gather from his clients, included cutting (with nothing left standing); burning; windrowing; and discing, although the last component depended on whether the contract required it. Holloway labeled the Yazoo operation as \"normal\", suggesting that it was like the general operation he described in his testimony. In addition, many of Holloway's clients charged less than$50 per acre for work done and he knew of clearing actually done for the$50 per acre price.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. App. 539. A small job was one totaling less than one hundred acres.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. See, generally, App. 480-543.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Judge Hunter speculated that as to the pulling up of roots, \"maybe that was done here and maybe it wasn't,\" but if it was, it would definitely increase the price of the contract. While we agree with Judge Hunter as to the increased costs which would attend stump removal, we note that the only evidence bearing on stump removal in the entire record is that provided by taxpayers' own witnesses and they unanimously testified that the removal of stumps was not undertaken in clearing projects because it was quite costly and because it was inessential to the preparation of farmable land. In short, there is simply no evidence that stump removal was performed at the Yazoo site and the trial court's conjecture to the contrary cannot properly enter into our assessment of the trial court's decision to disregard the testimony of the taxpayers' experts.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. The preliminary operations performed on the land consisted of the repair of houses already standing; the opening of slews for drainage; and the setting of boundaries in certain portions. App. 319 (testimony of Woodard). While the trial court and the Government indicated that these additional operations could have deprived the experts' valuations of their validity, the testimony as to the cost of the preliminary operations suggests otherwise. Woodard stated that the drainage cost, which was the highest of the three preliminary costs, was at most $22,000. App. 992-93. The cost of the cabins was paid directly by the partnership and the corporation did not, therefore, incur this cost in the clearing operation. App. 997. Finally, the setting of boundaries apparently was minimal. The total expenditures connected with these items would not have exceeded $25,000 - not a large amount in a project which, under the Government's own estimates, cost over $500,000 to perform. Moreover, there is no indication that the experts were not aware of the fact that these preliminary operations were performed when they developed their fair market value estimates.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. With regard to the quality of the job done on the Yazoo land, Woodard testified that \"we were going to do a farm clearing job because our intent was to sell the land and we knew we had to have it in just fairly good shape to sell it.\" App. 998. Nothing in the record indicates that something special was done in relation to this land. In fact, it does not appear that the taxpayers sought to have this land custom crafted for their own comfort, especially in light of their pronounced desire to sell.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. One further criticism leveled by the Government at the testimony of taxpayers' expert witnesses was especially deserving of judicial castigation. The Government suggested in the record and suggests still in their briefs that Loftin and Woodard Corporation had cleared land near Yazoo for $65 per acre. However, there is no evidence of this having ever occurred. In fact, the only positive mention of such a figure was that provided by the Government itself in the form of rhetorical questions to several witnesses. App. 519, 539. The only witness who responded to that question was Woodard himself who noted that the figure of $65 per acre did not represent a land clearing price paid by a land holder to the Loftin and Woodard Corporation. Rather, it represented the price paid by the partnership for the purchase of some acreage from L. G. Montgomery, a local land owner. App. 1010.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. See, n. 14 and App. 480-543.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. The determination of a constructive dividend is not dependent on the existence of a contract. Thus, it is difficult to understand the bearing such a contract would have on the admissibility or relevance of evidence offered as to the value of the benefit embodied within such a constructive dividend. The expert testimony was offered by taxpayers in order to measure the value of the benefit conferred (assuming the existence of such a benefit was proven) - not to establish that a contract existed or that the price in the contract was the fair one. While the existence of a contract may be determinative, in the court's mind, of whether a benefit was conferred without expectation of repayment (the part one determination in a constructive dividend trial), it has no finality with regard to the value of such a dividend given that the trial court must attempt to find the value which most closely approximates the true fair market value of the benefit conferred. It is fair market value, not contract price, which is determinative in the end. See, Regulation ยง 1.301-1-(c).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. Agent French admitted that fair market value at the date of the distribution of the benefit is usually used as the measure of a constructive dividend. It was not, in the present case, because to have taken the fair market value, we would have to call in an engineer agent and a forestry agent and have them come in and value it. We decided not to do it. Q. Now, if you had called in a forester and an engineering agent and they had valued the clearing at eighty dollars an acre, then that is the figure that you would have used, am I correct? A. Right. Cost was utilized here, it appears not because it better approximated fair market value but because the derivation of fair market value figures by the IRS would have been too time consuming and/or costly in the present situation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. The possibility that the district court may have viewed the testimony from an improper perspective is heightened by a colloquy between the Government's attorney, Mr. Grabicki, the taxpayers' attorney, Mr. Kirkpatrick, and the court midway through the trial. The colloquy proceeded as follows: Mr. Grabicki: I feel that the primary question that the court is concerned with, with respect to the farm job, is whether these costs that were incurred by the plaintiffs exceeded the amount of income that they took in. That's the primary question. Mr. Kirkpatrick: That's the Government's theory, Your Honor. Mr. Grabicki: That's the question, if the costs exceeded the amount of income Mr. Loftin and Mr. Woodard took in their corporation, they have got . . . constructive dividends . . . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. According to Savage, the corporation's accountant, the corporation accounted for its Yazoo land clearing transaction in the following manner. Expenses were deducted when incurred. Income was recognized as acreage was completed and accepted. Payment, in the case of the Yazoo clearing, was made gradually by way of the partnership advancing money to the corporation to perform the work as some acreage was completed (i.e. the partnership could not secure the funds from the creditor insurance company to make such advances until some of the work had been completed). Finally, income was reflected by asking, at the end of the fiscal year, how many acres were cleared. This figure was multiplied by $50 per acre and eventually was debited to the payables owed by the corporation to the partnership.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. In effect, we suggest a hybrid approach to the present situation. Though ยง 446(c) of the Internal Revenue Code does not explicitly refer to hybrid methods of accounting, it permits \"any combination of the foregoing methods permitted under regulations prescribed by the Secretary\" in calculating the amount of tax properly owing. In addition, the legislative history of this provision explicitly authorizes hybrid accounting methods.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. The record contains evidence indicating that payments were not required, in land clearing projects, until the project was completed. In those projects which were of unusual magnitude, payments might be required after two thirds of the project had been completed. See, App. 509 (testimony of Boykin); App. 529 (testimony of Holloway). It is significant that the corporation had created separate expense categories identified with the Yazoo project prior to the completion of two thirds of that project. In a similar fashion, the partnership registered its first payments to the corporation long before that point too.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. Another case supporting the use of cumulative accounting in the measurement of constructive dividends on long term projects is Cornelius v. Commissioner of Internal Revenue, 494 F.2d 465 (5th Cir. 1974). Here, loan transactions between a stockholder and his corporation were treated as separate transactions. Taxpayers argued that this was improper and that the loans should be viewed as part of an open account whose fluctuations would be accumulated for measurement at the end of a tax year. However, taxpayers failed to show that the loan transactions were indeed part of an \"open account\" - especially in light of their appearance, facially, as separate transactions. In contrast, the present case provides us with a diligent showing by taxpayers that land clearing is not a unit by unit transaction. Rather, it is an ongoing, \"open\" transaction, where payment most often does not occur until the termination of the clearer's efforts. To penalize the individual taxpayer for the corporation's failure to account for this transaction on a \"completed contract\" basis would be to exalt procedural consistency over the substance of the transaction. This clearly is not the type of legal reaction which the tax law contemplates.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. Taxpayers rely on the rule against hearsay in a further criticism of the district court's decision concerning the date on which costs were incurred and payments were made. For 1963 and 1964, the court's findings as to clearing costs do not jibe with either the Government or taxpayers' proposed findings. Because the court's figures match the Commissioner's figures to the penny for those years and because the report of the Commissioner was never introduced into evidence, taxpayers suggest that there is a major evidentiary problem with the district court's cost findings - findings which were crucial to the measurement of the constructive dividend under the approach pursued by the district court. The relevant figures are as follows: FISCAL COMMISSIONER'S COURT'S TAXPAYER'S GOVERNMENT'S YEAR NOTICE OF DEFICIENCY FIGURES FIGURES FIGURES SETTING CLEARING COSTS RE. COSTS RE. COSTS RE. COSTS 5/31/63 $20,383.97 $20,383.97 $8,554.00 $18,546.005/31/64 $212,586.55 $212,586.55 $80,848.00 $116,623.005/31/65 $218,410.00 $269,195.005/31/66 $258,413.13 $227,179.00 $163,979.00 $227,179.005/31/67 $24,969.00With regard to the report containing the Commissioner's computation, the Government did not present the testimony of the agent who prepared the report nor did the Government attempt to independently prove the figures therein. While it is unclear whether the district court did rely on those figures, instead of deriving its figures from an independent inquiry, it is sufficient, at the present time, to note that should this problem arise on remand, the district court would be in error if it were to utilize the figures in that report in reaching its conclusions on the constructive dividend issue unless those figures are introduced into evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. The district court's determinations of the deductibility of the expenses incurred by the corporation in the Yazoo clearing may be summarized as follows: FISCAL DIRECT \u0026 INDIRECT PAYMENTS RECEIVED NONDEDUCTIBLE YEAR EXPENSES EXPENSES 1963 $20,383.97 $20,383.971964 $212,586.55 $212,586.551966 $227,129.00 $121,000.00 $106,179.00Further, as explained in the body of this opinion, the district court utilized the fiscal year for a comparison of expenses incurred and payments received because the corporation was the entity requesting the deduction and it was on a fiscal year tax period. This is in contrast to the calendar year period chosen as the time frame for the comparison of expenses and payments in the measurement of the constructive dividend. Deductibility for expenses incurred after the corporation had transferred the land to the partnership was determined by comparing expense incurred with payments received. The excess of expenses was deemed to be non-deductible because it embodied a constructive dividend.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. Section 263 of the Code states that \"No deduction shall be allowed for - (1) * * * betterments made to increase the value of any property or estate * * *.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. The taxpayers argue that they, not the corporation, were the true owners of the land from the very beginning, despite the fact that the corporation physically made the initial purchase. Even if the district court had held this to be so, it would not have significantly altered the deduction determinations. If the partnership was considered to be the true owner in interest from the start, then under the district court's theory of constructive dividend measurement, those expenses incurred by the corporation in excess of payments received in the pre-transfer period would have been constructive dividends and have been non-deductible because of this status. Because no payments were made by the partnership to the corporation in the pre-transfer period, the full amount of the expenses would have been non-deductible under the district court's approach to the constructive dividend issue. This is the same result the district court reached in finding the corporation to be the true owner pre-transfer.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. It is striking, in this regard, that the corporation purchased the land prior to the formation of the partnership. App. 628 (deposition testimony of Loftin).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. According to Woodard, the reason that the corporation waited several months before it transferred the land to the partnership was that \"we were just busy and didn't get around to it.\" App. 320.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. While 26 U.S.C. ยง 6653(b) states that a finding of fraud can be made whenever \"any part of any underpayment\" is due to fraud, case law suggests that very small underpayments of income which are tainted with fraud probably will not be sufficient to support such a finding. See, Cohen v. Commissioner of Internal Revenue, 266 F.2d 5 (9th Cir. 1959); Webb, supra. See, also, 10 Mertens, Federal Income Taxation, ยง 55.10 et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. Several of the personal expenses which the corporation paid on behalf of the individual taxpayers were paid back to the corporation by these individuals. App. 377-78 (testimony of Nell Burton).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. See, n. 9, section I-A, supra (testimony of Savage).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. Expenses were spread regularly by the corporation during the initial stages of many of its jobs. See, n. 6, section I-A, supra. It should also be noted that neither Woodard nor Loftin provided the tax accountant, Harrell, with the information eventually filled in on the corporation's tax returns. This was Nell Burton's job. App. 584 (testimony of Savage); App. 704 (deposition testimony of Loftin). In addition, both Loftin and Woodard claim that they did not tell Nell Burton or Lester Harrell how to make any of the specific entries that were made on the ledgers. App. 706 and 711. At the same time, Agent French, the agent primarily responsible for the conduct of the audit, testified that there was no indication that Nell Burton was attempting to hide any of the figures involved in the farm clearing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. See, section I-D, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. See, n. 8, section I-A, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. See, n. 6, section I-A, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71. The court notes, with regard to the question of whether the taxpayers attempted to disguise this transaction, that the testimony of the agent who worked quite closely with the audit, Agent French, suggests they did not. French testified that there was no indication that Nell Burton was disguising the transaction or failing to report figures which would have exposed the transaction to public scrutiny. See, n. 3, supra. Further, French testified that Loftin was quite cooperative as the audit progressed. When the agents found evidence of a political contribution, Loftin told Nell Burton to help Agent French work up the amount of the contribution. In addition, French stated that Loftin told us exactly how to go through and identify the various tickets. Court: He did say that he had done it? A. Yes, sir. App. 1029, 1042-43.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72. It must be remembered that a taxpayer who honestly but erroneously claims a deduction or fails to declare income is not liable for fraud. Rogers Recreation Co. v. Commissioner of Internal Revenue, 103 F.2d 780 (2nd Cir. 1939). In this vein, we note that Agent French testified that the statute of limitations would have run on the audit conducted had the fraud finding not been entered when it was - a factor which, according to this agent, entered into his fraud recommendation. App. 1020-21.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73. It is disturbing, in this regard, that the court appears to have considered Loftin's actions from a different perspective than that utilized in its consideration of Woodard's actions. Judge Hunter noted that \"it is awfully hard for me to believe that a man operating a business as big as this couldn't know you couldn't charge those things off through the corporation. It is difficult for me to believe that. I have difficulty believing it. Now, Mr. Woodard, I find in a different situation.\" App. 1029-30. However, Judge Hunter never revealed the reasons underlying his decision to distinguish between two taxpayers who were both in positions of substantial corporate control. For example, Loftin took a trip to California and returned via Las Vegas. Woodard took essentially the same trip. Instead of traveling to Las Vegas, he and his family went to Sacramento on an excursion unrelated to the business. App. 716-18. Further, the record reveals that both Loftin and Woodard received the benefit of corporate payment for many of their auto expenses and personal expenses. App. 893-96; 923-27. Finally, while it may have been improper for the corporation to register the deductions it did, the decision to take such deductions cannot support a finding of fraud as to Loftin's individual tax return. The statement of Judge Hunter recited above suggests that the distinction between these two areas of action may not have been maintained throughout the full proceeding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74. Our conclusion that the political contributions were the pivotal source of income in the finding of fraud as to Loftin, given the failure of the district court to indicate that Loftin and Woodard differed in intent as to those funds received by both of them (e.g. the funds relating to the constructive dividend), may be deduced from the following comparison: YEAR LOFTIN'S EXPENSES WOODARD'S EXPENSES 1962 n.* 1. withdrew $2,200 in cash withdrew $1,720 in cash advances advances 2. car expenses and car insurance paid by the corporation to the extent of $3,125.22 1963 1. withdrew $6,061 in withdrew $4,400 in cash cash advances advances 2. trip out to L.A. with trip to Maryland with stop in stop in Las Vegas New York financed by financed by corporation corporation at $500 3. constructive dividend from constructive dividend from land clearing of $104,584.22 land clearing of $56,304.58 4. political campaign contributions received to- taling $4,474.13 n.** 1964 1. withdrew $4,200 in withdrew $2,950 in cash cash advances advances 2. constructive dividend constructive dividend from from land clearing of land clearing of $29,263.23 $54,345.99 3. trips to LSU football games trips to LSU football games 4. car insurance car insuranceApp. 237, 245, 251, 265, 270, 293-95, 297-98, 905-908. n.* Loftin was not found fraudulent with regard to his 1962 return n.** it is unclear whether the political campaign contributions spanned both 1963 and 1964 or occurred only in one of the two years The above comparison is by no means a complete catalogue of all the possible sources of undeclared income involved in this suit. However, of all the expenditures made by the corporation on the taxpayers' behalf, the only substantial one received by Loftin and not by Woodard was the political campaign contributions. In fact, this was the one expenditure which prompted Judge Hunter's expression of incredulity, quoted above in note 10.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e75. It is unclear whether the political campaign contributions were received in 1963 and/or 1964. App. 905-907 (testimony of Nell Burton); R. 972 (testimony of John Savage).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e76. The court indicated that if Loftin was fraudulent in having the corporation pay the campaign expenses and then spread them over the books as cost, it might follow \"that there was fraud for the entire year of income taxes.\" We note that the use of the corporate action as the main support for the finding of fraud as to the individual return of the president of that corporation would not have been correct. See, n. 10, above.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e77. Ruidoso, 476 F.2d at 506. The alter ego concept developed in Ruidoso whereby fraud of the individual is imputed to the corporation when the latter is the alter ego of the former, may be applicable to many of the expenditures in question in this case. Except for the political contribution, most of the other corporate expenditures received by Loftin were not specifically disapproved by Woodard. In fact, Woodard himself received many of the same or similar ones.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e78. While Loftin's fraud need not be imputed to the corporation were it contrary to the express wishes of Woodard, this is an issue with which the trial court is better suited to grapple.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e79. To reiterate, should the district court again find fraud as to Loftin and/or Woodard, it then must reconsider the question of corporate fraud.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e80. The purpose of the carryback provision, as stated by the Supreme Court, is that it permits an adjustment of an earlier liability upon the basis of subsequent events. It contemplates that the initial tax obligation was not incorrectly or mistakenly imposed but was actually due, but that an adjustment may be made upon the basis of the taxpayer's gain or loss in the succeeding year or years. Bulova Watch Company v. United States, 365 U.S. 753, 81 S. Ct. 864, 6 L. Ed. 2d 72 (1961).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e* * * * BOARD OF DIRECTORS MEETING OF LOFTIN AND WOODARD, INC. April 1, 1963 at 10:00 a.m. The Board of Directors of Loftin and Woodard, Inc. met at the corporation's office in Delhi, Louisiana. In attendance were K.C. Loftin, President, E.A. Woodard, Vice President and Nell Burton, Secretary-Treasurer, comprising the complete Board of Directors. Upon motion by E.A. Woodard, seconded by Nell Burton, Loftin and Woodard, Inc. is hereby authorized to purchase 6,177 acres of land in Northern Mississippi. This land is to be purchased for the benefit of Messrs. K.C. Loftin and E.A. Woodard and the Corporation is to sell them this land as soon after purchase as it will take them to arrange individual financing. It is not the intention of Loftin and Woodard, Inc. to hold this land but it is being purchased through the Corporation so that the Corporation's borrowing ability may be availed of. This motion was unanimously approved by the Board. There being no further business the meeting was adjourned by President Loftin. App. 286-87.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e* * * * Mr. Kirkpatrick: . . . it is simply a theory. The Court: Well, Mr. Grabicki says it is the law. Mr. Grabicki: I think it has some basis in the Fifth Circuit. Mr. Kirkpatrick: I think Mr. Grabicki is mistaken. The Court: Well, of course, that is something I will have to go into later. App. 542-44. Nothing further was said by the court on this issue.\u003c/span\u003e\n\n",
    "body_length": 158896,
    "citedas": [
      "577 F.2d 1206"
    ],
    "attorneys": "Paul K. Kirkpatrick, Jr., Monroe, Louisiana, for Appellant. Donald E. Walter, U.S. Atty., Shreveport, Louisiana D. H. Perkins, Jr., AUSA, Shreveport, Louisiana Lawrence L. Jones, AUSA, Shreveport, Louisiana Myron C. Baum, Act. Asst. Atty. Gen., Tax Div., U.S. Dept. of Justice, Michael L. Paup, Atty-Washington, District of Columbia Joseph L. Liegl, Atty., Tax Div., U.S. Dept. of Justice, Michael L. Paup, Atty-Washington, District of Columbia Gilbert E. Andrews, Act. Chief, Appellate Sect., U.S. Dept. of Justice, Washington, District of Columbia Fleming DeGraffenreid, Atty., Tax Div., Dept. of Justice, Dallas, Texas, for Appellee.",
    "category": [],
    "judges": "Coleman and Fay, Circuit Judges, and James Lawrence King, District Judge.*fn*",
    "citation_count": 38
  }
}
