{
  "id": "5KWhSGYBTlTomsSB2fEk",
  "document": {
    "title": "01/29/85 ALDEN SMITH AND JOHN W. GOSSELIN v. JEROME",
    "full_title": "ALDEN SMITH AND JOHN W. GOSSELIN BELOW v. JEROME W. VAN GORKOM, BRUCE S. CHELBERG, WILLIAM B. JOHNSON, JOSEPH B. LANTERMAN, GRAHAM J. MORGAN, THOMAS P. O'BOYLE, W. ALLEN WALLIS, SIDNEY H. BONSER, WILLIAM D. BROWDER, TRANS UNION CORPORATION, A DELAWARE CORPORATION, MARMON GROUP, INC., A DELAWARE CORPORATION, GL CORPORATION, A DELAWARE CORPORATION, AND NEW T. CO., A DELAWARE CORPORATION BELOW .",
    "jurisdiction": "Supreme Court of Delaware",
    "date": "1985-01-29T00:00:00.000Z",
    "docket": "No. 255, 1982",
    "body": "This appeal from the Court of Chancery involves a class action brought by shareholders of the defendant Trans Union Corporation (\"Trans Union\" or \"the Company\"), originally seeking rescission of a cash-out merger of Trans Union into the defendant New T Company (\"New T\"), a wholly-owned subsidiary of the defendant, Marmon Group, Inc. (\"Marmon\"). Alternate relief in the form of damages is sought against the defendant members of the Board of Directors of Trans Union, New T, and Jay A. Pritzker and Robert A. Pritzker, owners of Marmon. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nFollowing trial, the former Chancellor granted judgment for the defendant directors by unreported letter opinion dated July 6, 1982. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Judgment was based on two findings: (1) that the Board of Directors had acted in an informed manner so as to be entitled to protection of the business judgment rule in approving the cash-out merger; and (2) that the shareholder vote approving the merger should not be set aside because the stockholders had been \"fairly informed\" by the Board of Directors before voting thereon. The plaintiffs appeal.\n\nSpeaking for the majority of the Court, we conclude that both rulings of the Court of Chancery are clearly erroneous. Therefore, we reverse and direct that judgment be entered in favor of the plaintiffs and against the defendant directors for the fair value of the plaintiffs' stockholdings in Trans Union, in accordance with Weinberger v. UOP, Inc., Del.Supr., 457 A.2d 701 (1983). \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nWe hold: (1) that the Board's decision, reached September 20, 1980, to approve the proposed cash-out merger was not the product of an informed business judgment; (2) that the Board's subsequent efforts to amend the Merger Agreement and take other curative action were ineffectual, both legally and factually; and (3) that the Board did not deal with complete candor with the stockholders by failing to disclose all material facts, which they knew or should have known, before securing the stockholders' approval of the merger.\n\nI.\n\nThe nature of this case requires a detailed factual statement. The following facts are essentially uncontradicted: \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nA\n\nTrans Union was a publicly-traded, diversified holding company, the principal earnings of which were generated by its railcar leasing business. During the period here involved, the Company had a cash flow of hundreds of millions of dollars annually. However, the Company had difficulty in generating sufficient taxable income to offset increasingly large investment tax credits (ITCs). Accelerated depreciation deductions had decreased available taxable income against which to offset accumulating ITCs. The Company took these deductions, despite their effect on usable ITCs, because the rental price in the railcar leasing market had already impounded the purported tax savings.\n\nIn the late 1970's, together with other capital-intensive firms, Trans Union lobbied in Congress to have ITCs refundable in cash to firms which could not fully utilize the credit. During the summer of 1980, defendant Jerome W. Van Gorkom, Trans Union's Chairman and Chief Executive Officer, testified and lobbied in Congress for refundability of ITCs and against further accelerated depreciation. By the end of August, Van Gorkom was convinced that Congress would neither accept the refundability concept nor curtail further accelerated depreciation.\n\nBeginning in the late 1960's, and continuing through the 1970's, Trans Union pursued a program of acquiring small companies in order to increase available taxable income. In July 1980, Trans Union Management prepared the annual revision of the Company's Five Year Forecast. This report was presented to the Board of Directors at its July, 1980 meeting. The report projected an annual income growth of about 20%. The report also concluded that Trans Union would have about $195 million in spare cash between 1980 and 1985, \"with the surplus growing rapidly from 1982 onward.\" The report referred to the ITC situation as a \"nagging problem\" and, given that problem, the leasing company \"would still appear to be constrained to a tax break-even \" The report then listed four alternative uses of the projected 1982-1985 equity surplus: (1) stock repurchase; (2) dividend increases; (3) a major acquisition program; and (4) combinations of the above. The sale of Trans Union was not among the alternatives. The report emphasized that, despite the overall surplus, the operation of the Company would consume all available equity for the next several years, and concluded: \"As a result, we have sufficient time to fully develop our course of action.\"\n\nB\n\nOn August 27, 1980, Van Gorkom met with Senior Management of Trans Union. Van Gorkom reported on his lobbying efforts in Washington and his desire to find a solution to the tax credit problem more permanent than a continued program of acquisitions. Various alternatives were suggested and discussed preliminarily, including the sale of Trans Union to a company with a large amount of taxable income.\n\nDonald Romans, Chief Financial Officer of Trans Union, stated that his department had done a \"very brief bit of work on the possibility of a leveraged buy-out.\" This work had been prompted by a media article which Romans had seen regarding a leveraged buy-out by management. The work consisted of a \"preliminary study\" of the cash which could be generated by the Company if it participated in a leveraged buy-out. As Romans stated, this analysis \"was very first and rough cut at seeing whether a cash flow would support what might be considered a high price for this type of transaction.\"\n\nOn September 5, at another Senior Management meeting which Van Gorkom attended, Romans again brought up the idea of a leveraged buy-out as a \"possible strategic alternative\" to the Company's acquisition program. Romans and Bruce S. Chelberg, President and Chief Operating Officer of Trans Union, had been working on the matter in preparation for the meeting. According to Romans: They did not \"come up\" with a price for the Company. They merely \"ran the numbers\" at $50 a share and at $60 a share with the \"rough form\" of their cash figures at the time. Their \"figures indicated that $50 would be very easy to do but $60 would be very difficult to do under those figures.\" This work did not purport to establish a fair price for either the Company or 100% of the stock. It was intended to determine the cash flow needed to service the debt that would \"probably\" be incurred in a leveraged buy-out, based on \"rough calculations\" without \"any benefit of experts to identify what the limits were to that, and so forth.\" These computations were not considered extensive and no Conclusion was reached.\n\nAt this meeting, Van Gorkom stated that he would be willing to take $55 per share for his own 75,000 shares. He vetoed the suggestion of a leveraged buy-out by Management, however, as involving a potential conflict of interest for Management. Van Gorkom, a certified public accountant and lawyer, had been an officer of Trans Union for 24 years, its Chief Executive Officer for more than 17 years, and Chairman of its Board for 2 years. It is noteworthy in this connection that he was then approaching 65 years of age and mandatory retirement.\n\nFor several days following the September 5 meeting, Van Gorkom pondered the idea of a sale. He had participated in many acquisitions as a manager and director of Trans Union and as a director of other companies. He was familiar with acquisition procedures, valuation methods, and negotiations; and he privately considered the pros and cons of whether Trans Union should seek a privately or publicly-held purchaser.\n\nVan Gorkom decided to meet with Jay A. Pritzker, a well-known corporate takeover specialist and a social acquaintance. However, rather than approaching Pritzker simply to determine his interest in acquiring Trans Union, Van Gorkom assembled a proposed per share price for sale of the Company and a financing structure by which to accomplish the sale. Van Gorkom did so without consulting either his Board or any members of Senior Management except one: Carl Peterson, Trans Union's Controller. Telling Peterson that he wanted no other person on his staff to know what he was doing, but without telling him why, Van Gorkom directed Peterson to calculate the feasibility of a leveraged buy-out at an assumed price per share of $55. Apart from the Company's historic stock market price, \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e and Van Gorkom's long association with Trans Union, the record is devoid of any competent evidence that $55 represented the per share intrinsic value of the Company.\n\nHaving thus chosen the $55 figure, based solely on the availability of a leveraged buy-out, Van Gorkom multiplied the price per share by the number of shares outstanding to reach a total value of the Company of $690 million. Van Gorkom told Peterson to use this $690 million figure and to assume a $200 million equity contribution by the buyer. Based on these assumptions, Van Gorkom directed Peterson to determine whether the debt portion of the purchase price could be paid off in five years or less if financed by Trans Union's cash flow as projected in the Five Year Forecast, and by the sale of certain weaker divisions identified in a study done for Trans Union by the Boston Consulting Group (\"BCG study\"). Peterson reported that, of the purchase price, approximately $50-80 million would remain outstanding after five years. Van Gorkom was disappointed, but decided to meet with Pritzker nevertheless.\n\nVan Gorkom arranged a meeting with Pritzker at the latter's home on Saturday, September 13, 1980. Van Gorkom prefaced his presentation by stating to Pritzker: \"Now as far as you are concerned, I can, I think, show how you can pay a substantial premium over the present stock price and pay off most of the loan in the first five years. * * * If you could pay $55 for this Company, here is a way in which I think it can be financed.\"\n\nVan Gorkom then reviewed with Pritzker his calculations based upon his proposed price of $55 per share. Although Pritzker mentioned $50 as a more attractive figure, no other price was mentioned. However, Van Gorkom stated that to be sure that $55 was the best price obtainable, Trans Union should be free to accept any better offer. Pritzker demurred, stating that his organization would serve as a \"stalking horse\" for an \"auction contest\" only if Trans Union would permit Pritzker to buy 1,750,000 shares of Trans Union stock at market price which Pritzker could then sell to any higher bidder. After further Discussion on this point, Pritzker told Van Gorkom that he would give him a more definite reaction soon.\n\nOn Monday, September 15, Pritzker advised Van Gorkom that he was interested in the $55 cash-out merger proposal and requested more information on Trans Union. Van Gorkom agreed to meet privately with Pritzker, accompanied by Peterson, Chelberg, and Michael Carpenter, Trans Union's consultant from the Boston Consulting Group. The meetings took place on September 16 and 17. Van Gorkom was \"astounded that events were moving with such amazing rapidity.\"\n\nOn Thursday, September 18, Van Gorkom met again with Pritzker. At that time, Van Gorkom knew that Pritzker intended to make a cash-out merger offer at Van Gorkom's proposed $55 per share. Pritzker instructed his attorney, a merger and acquisition specialist, to begin drafting merger documents. There was no further Discussion of the $55 price. However, the number of shares of Trans Union's treasury stock to be offered to Pritzker was negotiated down to one million shares; the price was set at $38 -- 75 cents above the per share price at the close of the market on September 19. At this point, Pritzker insisted that the Trans Union Board act on his merger proposal within the next three days, stating to Van Gorkom: \"We have to have a decision by no later than Sunday [evening, September 21] before the opening of the English stock exchange on Monday morning.\" Pritzker's lawyer was then instructed to draft the merger documents, to be reviewed by Van Gorkom's lawyer, \"sometimes with Discussion and sometimes not, in the haste to get it finished.\"\n\nOn Friday, September 19, Van Gorkom, Chelberg, and Pritzker consulted with Trans Union's lead bank regarding the financing of Pritzker's purchase of Trans Union. The bank indicated that it could form a syndicate of banks that would finance the transaction. On the same day, Van Gorkom retained James Brennan, Esquire, to advise Trans Union on the legal aspects of the merger. Van Gorkom did not consult with William Browder, a Vice-President and director of Trans Union and former head of its legal department, or with William Moore, then the head of Trans Union's legal staff.\n\nOn Friday, September 19, Van Gorkom called a special meeting of the Trans Union Board for noon the following day. He also called a meeting of the Company's Senior Management to convene at 11:00 a.m., prior to the meeting of the Board. No one, except Chelberg and Peterson, was told the purpose of the meetings. Van Gorkom did not invite Trans Union's investment banker, Salomon Brothers or its Chicago-based partner, to attend.\n\nOf those present at the Senior Management meeting on September 20, only Chelberg and Peterson had prior knowledge of Pritzker's offer. Van Gorkom disclosed the offer and described its terms, but he furnished no copies of the proposed Merger Agreement. Romans announced that his department had done a second study which showed that, for a leveraged buy-out, the price range for Trans Union stock was between $55 and $65 per share. Van Gorkom neither saw the study nor asked Romans to make it available for the Board meeting.\n\nSenior Management's reaction to the Pritzker proposal was completely negative. No member of Management, except Chelberg and Peterson, supported the proposal. Romans objected to the price as being too low; \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e he was critical of the timing and suggested that consideration should be given to the adverse tax consequences of an all-cash deal for low-basis shareholders; and he took the position that the agreement to sell Pritzker one million newly-issued shares at market price would inhibit other offers, as would the prohibitions against soliciting bids and furnishing inside information to other bidders. Romans argued that the Pritzker proposal was a \"lock up\" and amounted to \"an agreed merger as opposed to an offer.\" Nevertheless, Van Gorkom proceeded to the Board meeting as scheduled without further delay.\n\nTen directors served on the Trans Union Board, five inside (defendants Bonser, O'Boyle, Browder, Chelberg, and Van Gorkom) and five outside (defendants Wallis, Johnson, Lanterman, Morgan and Reneker). All directors were present at the meeting, except O'Boyle who was ill. Of the outside directors, four were corporate chief executive officers and one was the former Dean of the University of Chicago Business School. None was an investment banker or trained financial analyst. All members of the Board were well informed about the Company and its operations as a going concern. They were familiar with the current financial condition of the Company, as well as operating and earnings projections reported in the recent Five Year Forecast. The Board generally received regular and detailed reports and was kept abreast of the accumulated investment tax credit and accelerated depreciation problem.\n\nVan Gorkom began the Special Meeting of the Board with a twenty-minute oral presentation. Copies of the proposed Merger Agreement were delivered too late for study before or during the meeting. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e He reviewed the Company's ITC and depreciation problems and the efforts theretofore made to solve them. He discussed his initial meeting with Pritzker and his motivation in arranging that meeting. Van Gorkom did not disclose to the Board, however, the methodology by which he alone had arrived at the $55 figure, or the fact that he first proposed the $55 price in his negotiations with Pritzker.\n\nVan Gorkom outlined the terms of the Pritzker offer as follows: Pritzker would pay $55 in cash for all outstanding shares of Trans Union stock upon completion of which Trans Union would be merged into New T Company, a subsidiary wholly-owned by Pritzker and formed to implement the merger; for a period of 90 days, Trans Union could receive, but could not actively solicit, competing offers; the offer had to be acted on by the next evening, Sunday, September 21; Trans Union could only furnish to competing bidders published information, and not proprietary information; the offer was subject to Pritzker obtaining the necessary financing by October 10, 1980; if the financing contingency were met or waived by Pritzker, Trans Union was required to sell to Pritzker one million newly-issued shares of Trans Union at $38 per share.\n\nVan Gorkom took the position that putting Trans Union \"up for auction\" through a 90-day market test would validate a decision by the Board that $55 was a fair price. He told the Board that the \"free market will have an opportunity to Judge whether $55 is a fair price.\" Van Gorkom framed the decision before the Board not as whether $55 per share was the highest price that could be obtained, but as whether the $55 price was a fair price that the stockholders should be given the opportunity to accept or reject. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nAttorney Brennan advised the members of the Board that they might be sued if they failed to accept the offer and that a fairness opinion was not required as a matter of law.\n\nRomans attended the meeting as chief financial officer of the Company. He told the Board that he had not been involved in the negotiations with Pritzker and knew nothing about the merger proposal until the morning of the meeting; that his studies did not indicate either a fair price for the stock or a valuation of the Company; that he did not see his role as directly addressing the fairness issue; and that he and his people \"were trying to search for ways to justify a price in connection with such a [leveraged buy-out] transaction, rather than to say what the shares are worth.\" Romans testified:\n\nI told the Board that the study ran the numbers at 50 and 60, and then the subsequent study at 55 and 65, and that was not the same thing as saying that I have a valuation of the company at X dollars. But it was a way - a first step towards reaching that Conclusion.\n\nRomans told the Board that, in his opinion, $55 was \"in the range of a fair price,\" but \"at the beginning of the range.\"\n\nChelberg, Trans Union's President, supported Van Gorkom's presentation and representations. He testified that he \"participated to make sure that the Board members collectively were clear on the details of the agreement or offer from Pritzker;\" that he \"participated in the Discussion with Mr. Brennan, inquiring of him about the necessity for valuation opinions in spite of the way in which this particular offer was couched;\" and that he was otherwise actively involved in supporting the positions being taken by Van Gorkom before the Board about \"the necessity to act immediately on this offer,\" and about \"the adequacy of the $55 and the question of how that would be tested.\"\n\nThe Board meeting of September 20 lasted about two hours. Based solely upon Van Gorkom's oral presentation, Chelberg's supporting representations, Romans' oral statement, Brennan's legal advice, and their knowledge of the market history of the Company's stock, \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e the directors approved the proposed Merger Agreement. However, the Board later claimed to have attached two conditions to its acceptance: (1) that Trans Union reserved the right to accept any better offer that was made during the market test period; and (2) that Trans Union could share its proprietary information with any other potential bidders. While the Board now claims to have reserved the right to accept any better offer received after the announcement of the Pritzker agreement (even though the minutes of the meeting do not reflect this), it is undisputed that the Board did not reserve the right to actively solicit alternate offers.\n\nThe Merger Agreement was executed by Van Gorkom during the evening of September 20 at a formal social event that he hosted for the opening of the Chicago Lyric Opera. Neither he nor any other director read the agreement prior to its signing and delivery to Pritzker.\n\nOn Monday, September 22, the Company issued a press release announcing that Trans Union had entered into a \"definitive\" Merger Agreement with an affiliate of the Marmon Group, Inc., a Pritzker holding company. Within 10 days of the public announcement, Dissent among Senior Management over the merger had become widespread. Faced with threatened resignations of key officers, Van Gorkom met with Pritzker who agreed to several modifications of the Agreement. Pritzker was willing to do so provided that Van Gorkom could persuade the dissidents to remain on the Company payroll for at least six months after consummation of the merger.\n\nVan Gorkom reconvened the Board on October 8 and secured the directors' approval of the proposed amendments -- sight unseen. The Board also authorized the employment of Salomon Brothers, its investment banker, to solicit other offers for Trans Union during the proposed \"market test\" period.\n\nThe next day, October 9, Trans Union issued a press release announcing: (1) that Pritzker had obtained \"the financing commitments necessary to consummate\" the merger with Trans Union; (2) that Pritzker had acquired one million shares of Trans Union common stock at $38 per share; (3) that Trans Union was now permitted to actively seek other offers and had retained Salomon Brothers for that purpose; and (4) that if a more favorable offer were not received before February 1, 1981, Trans Union's shareholders would thereafter meet to vote on the Pritzker proposal.\n\nIt was not until the following day, October 10, that the actual amendments to the Merger Agreement were prepared by Pritzker and delivered to Van Gorkom for execution. As will be seen, the amendments were considerably at variance with Van Gorkom's representations of the amendments to the Board on October 8; and the amendments placed serious constraints on Trans Union's ability to negotiate a better deal and withdraw from the Pritzker agreement. Nevertheless, Van Gorkom proceeded to execute what become the October 10 amendments to the Merger Agreement without conferring further with the Board members and apparently without comprehending the actual implications of the amendments.\n\nSalomon Brothers' efforts over a three-month period from October 21 to January 21 produced only one serious suitor for Trans Union -- General Electric Credit Corporation (\"GE Credit\"), a subsidiary of the General Electric Company. However, GE Credit was unwilling to make an offer for Trans Union unless Trans Union first rescinded its Merger Agreement with Pritzker. When Pritzker refused, GE Credit terminated further Discussions with Trans Union in early January.\n\nIn the meantime, in early December, the investment firm of Kohlberg, Kravis, Roberts \u0026 Co. (\"KKR\"), the only other concern to make a firm offer for Trans Union, withdrew its offer under circumstances hereinafter detailed.\n\nOn December 19, this litigation was commenced and, within four weeks, the plaintiffs had deposed eight of the ten directors of Trans Union, including Van Gorkom, Chelberg and Romans, its Chief Financial Officer. On January 21, Management's Proxy Statement for the February 10 shareholder meeting was mailed to Trans Union's stockholders. On January 26, Trans Union's Board met and, after a lengthy meeting, voted to proceed with the Pritzker merger. The Board also approved for mailing, \"on or about January 27,\" a Supplement to its Proxy Statement. The Supplement purportedly set forth all information relevant to the Pritzker Merger Agreement, which had not been divulged in the first Proxy Statement.\n\nOn February 10, the stockholders of Trans Union approved the Pritzker merger proposal. Of the outstanding shares, 69.9% were voted in favor of the merger; 7.25% were voted against the merger; and 22.85% were not voted.\n\nII.\n\nWe turn to the issue of the application of the business judgment rule to the September 20 meeting of the Board.\n\nThe Court of Chancery concluded from the evidence that the Board of Directors' approval of the Pritzker merger proposal fell within the protection of the business judgment rule. The Court found that the Board had given sufficient time and attention to the transaction, since the directors had considered the Pritzker proposal on three different occasions, on September 20, and on October 8, 1980 and finally on January 26, 1981. On that basis, the Court reasoned that the Board had acquired, over the four-month period, sufficient information to reach an informed business judgment on the cash-out merger proposal. The Court ruled:\n\nThe Court of Chancery made but one finding; i.e., that the Board's conduct over the entire period from September 20 through January 26, 1981 was not reckless or improvident, but informed. This ultimate Conclusion was premised upon three subordinate findings, one explicit and two implied. The Court's explicit finding was that Trans Union's Board was \"free to turn down the Pritzker proposal\" not only on September 20 but also on October 8, 1980 and on January 26, 1981. The Court's implied, subordinate findings were: (1) that no legally binding agreement was reached by the parties until January 26; and (2) that if a higher offer were to be forth-coming, the market test would have produced it, \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e and Trans Union would have been contractually free to accept such higher offer. However, the Court offered no factual basis or legal support for any of these findings; and the record compels contrary Conclusions.\n\nThis Court's standard of review of the findings of fact reached by the Trial Court following full evidentiary hearing is as stated in Levitt v. Bouvier, Del. Supr., 287 A.2d 671, 673 (1972):\n\n[In an appeal of this nature] this court has the authority to review the entire record and to make its own findings of fact in a proper case. In exercising our power of review, we have the duty to review the sufficiency of the evidence and to test the propriety of the findings below. We do not, however, ignore the findings made by the trial Judge. If they are sufficiently supported by the record and are the product of an orderly and logical deductive process, in the exercise of judicial restraint we accept them, even though independently we might have reached opposite Conclusions. It is only when the findings below are clearly wrong and the doing of Justice requires their overturn that we are free to make contradictory findings of fact.\n\nApplying that standard and governing principles of law to the record and the decision of the Trial Court, we conclude that the Court's ultimate finding that the Board's conduct was not \"reckless or imprudent\" is contrary to the record and not the product of a logical and deductive reasoning process.\n\nThe plaintiffs contend that the Court of Chancery erred as a matter of law by exonerating the defendant directors under the business judgment rule without first determining whether the rule's threshold condition of \"due care and prudence\" was satisfied. The plaintiffs assert that the Trial Court found the defendant directors to have reached an informed business judgment on the basis of \"extraneous considerations and events that occurred after September 20, 1980.\" The defendants deny that the Trial Court committed legal error in relying upon post-September 20, 1980 events and the directors' later acquired knowledge. The defendants further submit that their decision to accept $55 per share was informed because: (1) they were \"highly qualified;\" (2) they were \"well-informed;\" and (3) they deliberated over the \"proposal\" not once but three times. On essentially this evidence and under our standard of review, the defendants assert that affirmance is required. We must disagree.\n\nUnder Delaware law, the business judgment rule is the offspring of the fundamental principle, codified in 8 Del.C. § 141 (a), that the business and affairs of a Delaware corporation are managed by or under its board of directors. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Pogostin v. Rice, Del. Supr., 480 A.2d 619, 624 (1984); Aronson v. Lewis, Del.Supr., 473 A.2d 805, 811 (1984); Zapata Corp. v. Maldonado, Del. Supr., 430 A.2d 779, 782 (1981). In carrying out their managerial roles, directors are charged with an unyielding fiduciary duty to the corporation and its shareholders. Loft, Inc. v. Guth, Del. Ch., 23 Del. Ch. 138, 2 A.2d 225 (1938), aff'd, Del. Supr., 23 Del. Ch. 255, 5 A.2d 503 (1939). The business judgment rule exists to protect and promote the full and free exercise of the managerial power granted to Delaware directors. Zapata Corp. v. Maldonado, (supra) at 782. The rule itself \"is a presumption that in making a business decision, the directors of a corporation acted on an informed basis, in good faith and in the honest belief that the action taken was in the best interest of the company.\" Aronson, (supra) at 812. Thus, the party attacking a board decision as uninformed must rebut the presumption that its business judgment was an informed one. Id.\n\nThe determination of whether a business judgment is an informed one turns on whether the directors have informed themselves \"prior to making a business decision, of all material information reasonably available to them.\" Id. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nUnder the business judgment rule there is no protection for directors who have made \"an unintelligent or unadvised judgment.\" Mitchell v. Highland-Western Glass, Del. Ch., 19 Del. Ch. 326, 167 A. 831, 833 (1933). A director's duty to inform himself in preparation for a decision derives from the fiduciary capacity in which he serves the corporation and its stockholders. Lutz v. Boas, Del. Ch., 39 Del. Ch. 585, 171 A.2d 381 (1961). See Weinberger v. UOP, Inc., (supra) ; Guth v. Loft, (supra) . Since a director is vested with the responsibility for the management of the affairs of the corporation, he must execute that duty with the recognition that he acts on behalf of others. Such obligation does not tolerate faithlessness or self-dealing. But fulfillment of the fiduciary function requires more than the mere absence of bad faith or fraud. Representation of the financial interests of others imposes on a director an affirmative duty to protect those interests and to proceed with a critical eye in assessing information of the type and under the circumstances present here. See Lutz v. Boas, (supra) ; Guth v. Loft, (supra) at 510. Compare Donovan v. Cunningham, 5th Cir., 716 F.2d 1455, 1467 (1982); Doyle v. Union Insurance Company, Neb. Supr., 202 Neb. 599, 277 N.W.2d 36 (1979); Continental Securities Co. v. Belmont, N.Y. App., 206 N.Y. 7, 99 N.E. 138, 141 (1912).\n\nThus, a director's duty to exercise an informed business judgment is in the nature of a duty of care, as distinguished from a duty of loyalty. Here, there were no allegations of fraud, bad faith, or self-dealing, or proof thereof. Hence, it is presumed that the directors reached their business judgment in good faith, Allaun v. Consolidated Oil Co., Del. Ch., 16 Del. Ch. 318, 147 A. 257 (1929), and considerations of motive are irrelevant to the issue before us.\n\nThe standard of care applicable to a director's duty of care has also been recently restated by this Court. In Aronson, supra, we stated:\n\nWhile the Delaware cases use a variety of terms to describe the applicable standard of care, our analysis satisfies us that under the business judgment rule director liability is predicated upon concepts of gross negligence. (footnote omitted)\n\n473 A.2d at 812.\n\nWe again confirm that view. We think the concept of gross negligence is also the proper standard for determining whether a business judgment reached by a board of directors was an informed one. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nIn the specific context of a proposed merger of domestic corporations, a director has a duty under 8 Del.C. § 251 (b), \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e along with his fellow directors, to act in an informed and deliberate manner in determining whether to approve an agreement of merger before submitting the proposal to the stockholders. Certainly in the merger context, a director may not abdicate that duty by leaving to the shareholders alone the decision to approve or disapprove the agreement. See Beard v. Elster, Del.Supr., 39 Del. Ch. 153, 160 A.2d 731, 737 (1960). Only an agreement of merger satisfying the requirements of 8 Del.C. § 251 (b) may be submitted to the shareholders under § 251 (c). See generally... Aronson v. Lewis, (supra) at 811-13; see also Pogostin v. Rice, (supra) .\n\nIt is against those standards that the conduct of the directors of Trans Union must be tested, as a matter of law and as a matter of fact, regarding their exercise of an informed business judgment in voting to approve the Pritzker merger proposal.\n\nIII.\n\nThe defendants argue that the determination of whether their decision to accept $55 per share for Trans Union represented an informed business judgment requires consideration, not only of that which they knew and learned on September 20, but also of that which they subsequently learned and did over the following four-month period before the shareholders met to vote on the proposal in February, 1981. The defendants thereby seek to reduce the significance of their action on September 20 and to widen the time frame for determining whether their decision to accept the Pritzker proposal was an informed one. Thus, the defendants contend that what the directors did and learned subsequent to September 20 and through January 26, 1981, was properly taken into account by the Trial Court in determining whether the Board's judgment was an informed one. We disagree with this post hoc approach.\n\nThe issue of whether the directors reached an informed decision to \"sell\" the Company on September 20, 1980 must be determined only upon the basis of the information then reasonably available to the directors and relevant to their decision to accept the Pritzker merger proposal. This is not to say that the directors were precluded from altering their original plan of action, had they done so in an informed manner. What we do say is that the question of whether the directors reached an informed business judgment in agreeing to sell the Company, pursuant to the terms of the September 20 Agreement presents, in reality, two questions: (A) whether the directors reached an informed business judgment on September 20, 1980; and (B) if they did not, whether the directors' actions taken subsequent to September 20 were adequate to cure any infirmity in their action taken on September 20. We first consider the directors' September 20 action in terms of their reaching an informed business judgment.\n\nA\n\nOn the record before us, we must conclude that the Board of Directors did not reach an informed business judgment on September 20, 1980 in voting to \"sell\" the Company for $55 per share pursuant to the Pritzker cash-out merger proposal. Our reasons, in summary, are as follows:\n\nThe directors (1) did not adequately inform themselves as to Van Gorkom's role in forcing the \"sale\" of the Company and in establishing the per share purchase price; (2) were uninformed as to the intrinsic value of the Company; and (3) given these circumstances, at a minimum, were grossly negligent in approving the \"sale\" of the Company upon two hours' consideration, without prior notice, and without the exigency of a crisis or emergency.\n\nAs has been noted, the Board based its September 20 decision to approve the cash-out merger primarily on Van Gorkom's representations. None of the directors, other than Van Gorkom and Chelberg, had any prior knowledge that the purpose of the meeting was to propose a cash-out merger of Trans Union. No members of Senior Management were present, other than Chelberg, Romans and Peterson; and the latter two had only learned of the proposed sale an hour earlier. Both general counsel Moore and former general counsel Browder attended the meeting, but were equally uninformed as to the purpose of the meeting and the documents to be acted upon.\n\nWithout any documents before them concerning the proposed transaction, the members of the Board were required to rely entirely upon Van Gorkom's 20-minute oral presentation of the proposal. No written summary of the terms of the merger was presented; the directors were given no documentation to support the adequacy of $55 price per share for sale of the Company; and the Board had before it nothing more than Van Gorkom's statement of his understanding of the substance of an agreement which he admittedly had never read, nor which any member of the Board had ever seen.\n\nUnder 8 Del.C. § 141 (e), \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e \"directors are fully protected in relying in good faith on reports made by officers.\" Michelson v. Duncan, Del. Ch., 386 A.2d 1144, 1156 (1978); aff'd in part and rev'd in part on other grounds, Del. Supr., 407 A.2d 211 (1979). See also Graham v. Allis-Chalmers Mfg. Co., Del.Supr., 41 Del. Ch. 78, 188 A.2d 125, 130 (1963); Prince v. Bensinger, Del. Ch., 244 A.2d 89, 94 (1968). The term \"report\" has been liberally construed to include reports of informal personal investigations by corporate officers, Cheff v. Mathes, Del. Supr., 41 Del. Ch. 494, 199 A.2d 548, 556 (1964). However, there is no evidence that any \"report,\" as defined under § 141 (e), concerning the Pritzker proposal, was presented to the Board on September 20. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Van Gorkom's oral presentation of his understanding of the terms of the proposed Merger Agreement, which he had not seen, and Romans' brief oral statement of his preliminary study regarding the feasibility of a leveraged buy-out of Trans Union do not qualify as § 141 (e) \"reports\" for these reasons: The former laked substance because Van Gorkom was basically uninformed as to the essential provisions of the very document about which he was talking. Remans' statement was irrelevant to the issues before the Board since it did not purport to be a valuation study. At a minimum for a report to enjoy the status conferred by § 141 (e), it must be pertinent to the subject matter upon which a board is called to act, and otherwise be entitled to good faith, not blind, reliance. Considering all of the surrounding circumstances -- hastily calling the meeting without prior notice of its subject matter, the proposed sale of the Company without any prior consideration of the issue or necessity therefor, the urgent time constraints imposed by Pritzker, and the total absence of any documentation whatsoever -- the directors were duty bound to make reasonable inquiry of Van Gorkom and Romans, and if they had done so, the inadequacy of that upon which they now claim to have relied would have been apparent.\n\nThe defendants rely on the following factors to sustain the Trial Court's finding that the Board's decision was an informed one: (1) the magnitude of the premium or spread between the $55 Pritzker offering price and Trans Union's current market price of $38 per share; (2) the amendment of the Agreement as submitted on September 20 to permit the Board to accept any better offer during the \"market test\" period; (3) the collective experience and expertise of the Board's \"inside\" and \"outside\" directors; \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e and (4) their reliance on Brennan's legal advice that the directors might be sued if they rejected the Pritzker proposal. We discuss each of these grounds seriatim:\n\n(1)\n\nA substantial premium may provide one reason to recommend a merger, but in the absence of other sound valuation information, the fact of a premium alone does not provide an adequate basis upon which to assess the fairness of an offering price. Here, the judgment reached as to the adequacy of the premium was based on a comparison between the historically depressed Trans Union market price and the amount of the Pritzker offer. Using marker price as a basis for concluding that the premium adequately reflected the true value of the Company was a clearly faulty, indeed fallacious, premise, as the defendants' own evidence demonstrates.\n\nThe record is clear that before September 20, Van Gorkom and other members of Trans Union's Board knew that the market had consistently undervalued the worth of Trans Union's stock, despite steady increases in the Company's operating income in the seven years preceding the merger. The Board related this occurrence in large part to Trans Union's inability to use its ITCs as previously noted. Van Gorkom testified that he did not believe the market price accurately reflected Trans Union's true worth; and several of the directors testified that, as a general rule, most chief executives think that the market undervalues their companies' stock. Yet, on September 20, Trans Union's Board apparently believed that the market stock price accurately reflected the value of the Company for the purpose of determining the adequacy of the premium for its sale.\n\nIn the Proxy Statement, however, the directors reversed their position. There, they stated that, although the earnings prospects for Trans Union were \"excellent,\" they found no basis for believing that this would be reflected in future stock prices. With regard to past trading, the Board stated that the prices at which the Company's common stock had traded in recent years did not reflect the \"inherent\" value of the Company. But have referred to the \"inherent\" value of Trans Union, the directors ascribed no number to it. Moreover, nowhere did they disclose that they had no basis on which to fix \"inherent\" worth beyond an impressionistic reaction to the premium over market and an unsubstantiated belief that the value of the assets was \"significantly greater\" than book value. By their own admission they could not rely on the stock price as an accurate measure of value. Yet, also by their own admission, the Board members assumed that Trans Union's market price was adequate to serve as a basis upon which to assess the adequacy of the premium for purposes of the September 20 meeting.\n\nThe parties do not dispute that a publicly-traded stock price is solely a measure of the value of a minority position and, thus, market price represents only the value of a single share. Nevertheless, on September 20, the Board assessed the adequacy of the premium over market, offered by Pritzker, solely by comparing it with Trans Union's current and historical stock price. (See (supra) note 5 at p. 8.)\n\nIndeed, as of September 20, the Board had no other information on which to base a determination of the intrinsic value of Trans Union as a going concern. As of September 20, the Board had made no evaluation of the Company designed to value the entire enterprise, nor had the Board ever previously considered selling the Company or consenting to a buy-out merger. Thus, the adequacy of a premium is indeterminate unless it is assessed in terms of other competent and sound valuation information that reflects the value of the particular business.\n\nDespite the foregoing facts and circumstances, there was no call by the Board, either on September 20 or thereafter, for any valuation study or documentation of the $55 price per share as a measure of the fair value of the Company in a cash-out context. It is undisputed that the major asset of Trans Union was its cash flow. Yet, at no time did the Board call for a valuation study taking into account that highly significant element of the Company's assets.\n\nWe do not imply that an outside valuation study is essential to support an informed business judgment; nor do we state that fairness opinions by independent investment bankers are required as a matter of law. Often insiders familiar with the business of a going concern are in a better position than are outsiders to gather relevant information; and under appropriate circumstances, such directors may be fully protected in relying in good faith upon the valuation reports of their management. See 8 Del.C. § 141 (e). See also Cheff v. Mathes, (supra) .\n\nHere, the record establishes that the Board did not request its Chief Financial Officer, Romans, to make any valuation study or review of the proposal to determine the adequacy of $55 per share for sale of the Company. On the record before us: The Board rested on Romans' elicited response that the $55 figure was within a \"fair price range\" within the context of a leveraged buy-out. No director sought any further information from Romans. No director asked him why he put $55 at the bottom of his range. No director asked Romans for any details as to his study, the reason why it had been undertaken or its depth. No director asked to see the study; and no director asked Romans whether Trans Union's finance department could do a fairness study within the remaining 36-hour \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e period available under the Pritzker offer.\n\nHad the Board, or any member, made an inquiry of Romans, he presumably would have responded as he testified: that his calculations were rough and preliminary; and, that the study was not designed to determine the fair value of the Company, but rather to assess the feasibility of a leveraged buy-out financed by the Company's projected cash flow, making certain assumptions as to the purchaser's borrowing needs. Romans would have presumably also informed the Board of his view, and the widespread view of Senior Management, that the timing of the offer was wrong and the offer inadequate.\n\nThe record also establishes that the Board accepted without scrutiny Van Gorkom's representation as to the fairness of the $55 price per share for sale of the Company -- a subject that the Board had never previously considered. The Board thereby failed to discover that Van Gorkom had suggested the $55 price to Pritzker and, most crucially, that Van Gorkom had arrived at the $55 figure based on calculations designed solely to determine the feasibility of a leveraged buy-out. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e No questions were raised either as to the tax implications of a cash-out merger or how the price for the one million share option granted Pritzker was calculated.\n\nWe do not say that the Board of Directors was not entitled to give some credence to Van Gorkom's representation that $55 was an adequate or fair price. Under § 141 (e), the directors were entitled to rely upon their chairman's opinion of value and adequacy, provided that such opinion was reached on a sound basis. Here, the issue is whether the directors informed themselves as to all information that was reasonably available to them. Had they done so, they would have learned of the source and derivation of the $55 price and could not reasonably have relied thereupon in good faith.\n\nNone of the directors, Management or outside, were investment bankers or financial analysts. Yet the Board did not consider recessing the meeting until a later hour that day (or requesting an extension of Pritzker's Sunday evening deadline) to give it time to elicit more information as to the sufficiency of the offer, either from inside Management (in particular Romans) or from Trans Union's own investment banker, Salomon Brothers, whose Chicago specialist in merger and acquisitions was known to the Board and familiar with Trans Union's affairs.\n\nThus, the record compels the Conclusion that on September 20 the Board lacked valuation information adequate to reach an informed business judgment as to the fairness of $55 per share for sale of the Company. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\n(2)\n\nThis brings us to the post-September 20 \"market test\" upon which the defendants ultimately rely to confirm the reasonableness of their September 20 decision to accept the Pritzker proposal. In this connection, the directors present a two-part argument: (a) that by making a \"market test\" of Pritzker's $55 per share offer a condition of their September 20 decision to accept his offer, they cannot be found to have acted impulsively or in an uninformed manner on September 20; and (b) that the adequacy of the $17 premium for sale of the Company was conclusively established over the following 90 to 120 days by the most reliable evidence available -- the marketplace. Thus, the defendants impliedly contend that the \"market test\" eliminated the need for the Board to perform any other form of fairness test either on September 20, or thereafter.\n\nAgain, the facts of record do not support the defendants' argument. There is no evidence: (a) that the Merger Agreement was effectively amended to give the Board freedom to put Trans Union up for auction sale to the highest bidder; or (b) that a public auction was in fact permitted to occur. The minutes of the Board meeting make no reference to any of this. Indeed, the record compels the Conclusion that the directors had no rational basis for expecting that a market test was attainable, given the terms of the Agreement as executed during the evening of September 20. We rely upon the following facts which are essentially uncontradicted:\n\nThe Merger Agreement, specifically identified as that originally presented to the Board on September 20, has never been produced by the defendants, notwithstanding the plaintiffs' several demands for production before as well as during trial. No acceptable explanation of this failure to produce documents has been given to either the Trial Court or this Court. Significantly, neither the defendants nor their counsel have made the affirmative representation that this critical document has been produced. Thus, the Court is deprived of the best evidence on which to Judge the merits of the defendants' position as to the care and attention which they gave to the terms of the Agreement on September 20.\n\nVan Gorkom states that the Agreement as submitted incorporated the ingredients for a market test by authorizing Trans Union to receive competing offers over the next 90-day period. However, he concedes that the Agreement barred Trans Union from actively soliciting such offers and from furnishing to interested parties any information about the Company other than that already in the public domain. Whether the original Agreement of September 20 went so far as to authorize Trans Union to receive competitive proposals is arguable. The defendants' unexplained failure to produce and identify the original Merger Agreement permits the logical inference that the instrument would not support their assertions in this regard. Wilmington Trust Co. v. General Motors Corp., Del. Supr., 29 Del. Ch. 572, 51 A.2d 584, 593 (1974); II Wigmore on Evidence § 291 (3d ed. 1940). It is a well established principle that the production of weak evidence when strong is, or should have been, available can lead only to the Conclusion that the strong would have been adverse. Interstate Circuit v. United States, 306 U.S. 208, 226, 59 S. Ct. 467, 83 L. Ed. 610 (1939); Deberry v. State, Del.Supr., 457 A.2d 744, 754 (1983). Van Gorkom, conceding that he never read the Agreement, stated that he was relying upon his understanding that, under corporate law, directors always have an inherent right, as well as a fiduciary duty, to accept a better offer notwithstanding an existing contractual commitment by the Board. (See the Discussion (infra), part III B (3) at p.55.)\n\nThe defendant directors assert that they \"insisted\" upon including two amendments to the Agreement, thereby permitting a market test: (1) to give Trans Union the right to accept a better offer; and (2) to reserve to Trans Union the right to distribute proprietary information on the Company to alternative bidders. Yet, the defendants concede that they did not seek to amend the Agreement to permit Trans Union to solicit competing offers.\n\nSeveral of Trans Union's outside directors resolutely maintained that the Agreement as submitted was approved on the understanding that, \"if we got a better deal, we had a right to take it.\" Director Johnson so testified; but he then added, \"And if they didn't put that in the agreement, then the management did not carry out the Conclusion of the Board. And I just don't know whether they did or not.\" The only clause in the Agreement as finally executed to which the defendants can point as \"keeping the door open\" is the following underlined statement found in subparagraph (a) of section 2.03 of the Merger Agreement as executed:\n\nThe Board of Directors shall recommend to the stockholders of Trans Union that they approve and adopt the Merger Agreement ('the stockholders' approval') and to use its best efforts to obtain the requisite votes therefor. GL acknowledges that Trans Union directors may have a competing fiduciary obligation to the shareholders under certain circumstances.\n\nClearly, this language on its face cannot be construed as incorporating either of the two \"conditions\" described above: either the right to accept a better offer or the right to distribute proprietary information to third parties. The logical witness for the defendants to call to confirm their construction of this clause of the Agreement would have been Trans Union's outside attorney, James Brennan. The defendants' failure, without explanation, to call this witness again permits the logical inference that his testimony would not have been helpful to them. The further fact that the directors adjourned, rather than recessed, the meeting without incorporating in the Agreement these important \"conditions\" further weakens the defendants' position. As has been noted, nothing in the Board's Minutes supports these claims. No reference to either of the so-called \"conditions\" or of Trans Union's reserved right to test the market appears in any notes of the Board meeting or in the Board Resolution accepting the Pritzker offer or in the Minutes of the meeting itself. That evening, in the midst of a formal party which he hosted for the opening of the Chicago Lyric Opera, Van Gorkom executed the Merger Agreement without he or any other member of the Board having read the instruments.\n\nThe defendants attempt to downplay the significance of the prohibition against Trans Union's actively soliciting competing offers by arguing that the directors \"understood that the entire financial community would know that Trans Union was for sale upon the announcement of the Pritzker offer, and anyone desiring to make a better offer was free to do so.\" Yet, the press release issued on September 22, which the authorization of the Board, stated that Trans Union had entered into \"definitive agreements\" with the Pritzkers; and the press release did not even disclose Trans Union's limited right to receive and accept higher offers. Accompanying this press release was a further public announcement that Pritzker had been granted an option to purchase at any time one million shares of Trans Union's capital stock at 75 cents above the then-current price per share.\n\nThus, notwithstanding what several of the outside directors later claimed to have \"thought\" occurred at the meeting, the record compels the Conclusion that Trans Union's Board had no rational basis to conclude on September 20 or in the days immediately following, that the Board's acceptance of Pritzker's offer was conditioned on (1) a \"market test\" of the offer; and (2) the Board's right to withdraw from the Pritzker Agreement and accept any higher offer received before the shareholder meeting.\n\n(3)\n\nThe directors' unfounded reliance on both the premium and the market test as the basis for accepting the Pritzker proposal undermines the defendants' remaining contention that the Board's collective experience and sophistication was a sufficient basis for finding that it reached its September 20 decision with informed, reasonable deliberation. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Compare Gimbel v. Signal Companies, Inc., Del. Ch., 316 A.2d 599 (1974), aff'd per curiam, Del. Supr., 316 A.2d 619 (1974). There, the Court of Chancery preliminarily enjoined a board's sale of stock of its wholly-owned subsidiary for an alleged grossly inadequate price. It did so based on a finding that the business judgment rule had been pierced for failure of management to give its board \"the opportunity to make a reasonable and reasoned decision.\" 316 A.2d at 615. The Court there reached this result notwithstanding the board's sophistication and experience; the company's need of immediate cash; and the board's need to act promptly due to the impact of an energy crisis on the value of the underlying assets being sold -- all of its subsidiary's oil and gas interests. The Court found those factors denoting competence to be outweighed by evidence of gross negligence; that management in effect sprang the deal on the board by negotiating the asset sale without informing the board; that the buyer intended to \"force a quick decision\" by the board; that the board meeting was called on only one-and-a-half days' notice; that its outside directors were not notified of the meeting's purpose; that during a meeting spanning \"a couple of hours\" a sale of assets worth $480 million was approved; and that the Board failed to obtain a current appraisal of its oil and gas interests. The analogy of Signal to the case at bar is significant.\n\n(4)\n\nPart of the defense is based on a claim that the directors relied to legal advice rendered at the September 20 meeting by James Brennan, Esquire, who was present at Van Gorkom's request. Unfortunately, Brennan did not appear and testify at trial even though his firm participated in the defense of this action. There is no contemporaneous evidence of the advice given by Brennan on September 20, only the later deposition and trial testimony of certain directors as to their recollections or understanding of what was said at the meeting. Since counsel did not testify, and the advice attributed to Brennan is hearsay received by the Trial Court over the plaintiffs' objections, we consider it only in the context of the directors' present claims. In fairness to counsel, we make no findings that the advice attributed to him was in fact given. We focus solely on the efficacy of the defendants' claims, made months and years later, in an effort to extricate themselves from liability.\n\nSeveral defendants testified that Brennan advised them that Delaware law did not require a fairness opinion or an outside valuation of the Company before the Board could act on the Pritzker proposal. If given, the advice was correct. However, that did not end the matter. Unless the directors had before them adequate information regarding the intrinsic value of the Company, upon which a proper exercise of business judgment could be made, mere advice of this type is meaningless; and, given this record of the defendants' failures, it constitutes no defense here. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nWe conclude that Trans Union's Board was grossly negligent in that it failed to act with informed reasonable deliberation in agreeing to the Pritzker merger proposal on September 20; and we further conclude that the Trial Court erred as a matter of law in failing to address that question before determining whether the directors' later conduct was sufficient to cure its initial error.\n\nA second claim is that counsel advised the Board it would be subject to lawsuits if it rejected the $55 per share offer. It is, of course, a fact of corporate life that today when faced with difficult or sensitive issues, directors often are subject to suit, irrespective of the decisions they make. However, counsel's mere acknowledgement of this circumstance cannot be rationally translated into a justification for a board permitting itself to be stampeded into a patently unadvised act. While suit might result from the rejection of a merger or tender offer, Delaware law makes clear that a board acting within the ambit of the business judgment rule faces no ultimate liability. Pogostin v. Rice, (supra) . Thus, we cannot conclude that the mere threat of litigation, acknowledged by counsel, constitutes either legal advice or any valid basis upon which to pursue an uninformed course.\n\nSince we conclude that Brennan's purported advice is of no consequence to the defense of this case, it is unnecessary for us to invoke the adverse inferences which may be attributable to one failing to appear at trial and testify.\n\nB\n\nWe now examine the Board's post-September 20 conduct for the purpose of determining first, whether it was informed and not grossly negligent; and second, if informed, whether it was sufficient to legally rectify and cure the Board's derelictions of September 20. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\n(1)\n\nFirst, as to the Board meeting of October 8: Its purpose arose in the aftermath of the September 20 meeting: (1) the September 22 press release announcing that Trans Union \"had entered into definitive agreements to merge with an affiliate of Marmon Group, Inc.;\" and (2) Senior Management's ensuing revolt.\n\nTrans Union's press release stated:\n\nFOR IMMEDIATE RELEASE:\n\nCHICAGO, IL -- Trans Union Corporation announced today that it had entered into definitive agreements to merge with an affiliate of The Marmon Group, Inc. in a transaction whereby Trans Union stockholders would receive $55 per share in cash for each Trans Union share held. The Marmon Group, Inc. is controlled by the Pritzker family of Chicago.\n\nThe merger is subject to approval by the stockholders of Trans Union at a special meeting expected to be held sometime during December or early January.\n\nUntil October 10, 1980, the purchaser has the right to terminate the merger if financing that is satisfactory to the purchaser has not been obtained, but after that date there is no such right.\n\nIn a related transaction, Trans Union has agreed to sell to a designee of the purchaser one million newly-issued shares of Trans Union common stock at a cash price of $38 per share. Such shares will be issued only if the merger financing has been committed for no later than October 10, 1980, or if the purchaser elects to waive the merger financing condition. In addition, the New York Stock Exchange will be asked to approve the listing of the new shares pursuant to a listing application which Trans Union intends to file shortly.\n\nCompleting of the transaction is also subject to the preparation of a definitive proxy statement and making various filings and obtaining the approval or consents of government agencies.\n\nThe press release made no reference to provisions allegedly reserving to the Board the right to perform a \"market test\" and to withdraw from the Pritzker Agreement if Trans Union received a better offer before the shareholder meeting. The defendants also concede that Trans Union never made a subsequent public announcement stating that it had in fact reserved the right to accept alternate offers, the Agreement notwithstanding.\n\nThe public announcement of the Pritzker merger resulted in an \"en masse\" revolt of Trans Union's Senior Management. The head of Trans Union's tank car operations (its most profitable division) informed Van Gorkom that unless the merger were called off, fifteen key personnel would resign.\n\nInstead of reconvening the Board, Van Gorkom again privately met with Pritzker, informed him of the developments, and sought his advice. Pritzker then made the following suggestions for overcoming Management's dissatisfaction: (1) that the Agreement be amended to permit Trans Union to solicit, as well as receive, higher offers; and (2) that the shareholder meeting be postponed from early January to February 10, 1981. In return, Pritzker asked Van Gorkom to obtain a commitment from Senior Management to remain at Trans Union for at least six months after the merger was consummated.\n\nVan Gorkom then advised Senior Management that the Agreement would be amended to give Trans Union the right to solicit competing offers through January, 1981, if they would agree to remain with Trans Union. Senior Management was temporarily mollified; and Van Gorkom then called a special meeting of Trans Union's Board for October 8.\n\nThus, the primary purpose of the October 8 Board meeting was to amend the Merger Agreement, in a manner agreeable to Pritzker, to permit Trans Union to conduct \"a market test.\" \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Van Gorkom understood that the proposed amendments were intended to give the Company an unfettered \"right to openly solicit offers down through January 31.\" Van Gorkom presumably so represented the amendments to Trans Union's Board members on October 8. In a brief session, the directors approved Van Gorkom's oral presentation of the substance of the proposed amendments, the terms of which were not reduced to writing until October 10. But rather than waiting to review the amendments, the Board again approved them sight unseen and adjourned, giving Van Gorkom authority to execute the papers when he received them. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nThus, the Court of Chancery's finding that the October 8 Board meeting was convened to reconsider the Pritzker \"proposal\" is clearly erroneous. Further, the consequence of the Board's faulty conduct on October 8, in approving amendments to the Agreement which had not even been drafted, will become apparent when the actual amendments to the Agreement are hereafter examined.\n\nThe next day, October 9, and before the Agreement was amended, Pritzker moved swiftly to off-set the proposed market test amendment. First, Pritzker informed Trans Union that he had completed arrangements for financing its acquisition and that the parties were thereby mutually bound to a firm purchase and sale arrangement. Second, Pritzker announced the exercise of his option to purchase one million shares of Trans Union's treasury stock at $38 per share -- 75 cents above the current market price. Trans Union's Management responded the same day by issuing a press release announcing: (1) that all financing arrangements for Pritzker's acquisition of Trans Union had been completed; and (2) Pritzker's purchase of one million shares of Trans Union's treasury stock at $38 per share.\n\nThe next day, October 10, Pritzker delivered to Trans Union the proposed amendments to the September 20 Merger Agreement. Van Gorkom promptly proceeded to countersign all the instruments on behalf of Trans Union without reviewing the instruments to determine if they were consistent with the authority previously granted him by the Board. The amending documents were apparently not approved by Trans Union's Board until a much later date, December 2. The record does not affirmatively establish that Trans Union's directors ever read the October 10 amendments. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nThe October 10 amendments to the Merger Agreement did authorize Trans Union to solicit competing offers, but the amendments had more far-reaching effects. The most significant change was in the definition of the third-party \"offer\" available to Trans Union as a possible basis for withdrawal from its Merger Agreement with Pritzker. Under the October 10 amendments, a better offer was no longer sufficient to permit Trans Union's withdrawal. Trans Union was now permitted to terminate the Pritzker Agreement and abandon the merger only if, prior to February 10, 1981, Trans Union had either consummated a merger (or sale of assets) with a third party or had entered into a \"definitive\" merger agreement more favorable than Pritzker's and for a greater consideration -- subject only to stockholder approval. Further, the \"extension\" of the market test period to February 10, 1981 was circumscribed by other amendments which required Trans Union to file its preliminary proxy statement on the Pritzker merger proposal by December 5, 1980 and use its best efforts to mail the statement to its shareholders by January 5, 1981. Thus, the market test period was effectively reduced, not extended. (See (infra) note 29 at p.56.)\n\nIn our view, the record compels the Conclusion that the directors' conduct on October 8 exhibited the same deficiencies as did their conduct on September 20. The Board permitted its Merger Agreement with Pritzker to be amended in a manner it had neither authorized nor intended. The Court of Chancery, in its decision, overlooked the significance of the October 8-10 events and their relevance to the sufficiency of the directors' conduct. The Trial Court's letter opinion ignores: the October 10 amendments; the manner of their adoption; the effect of the October 9 press release and the October 10 amendments on the feasibility of a market test; and the ultimate question as to the reasonableness of the directors' reliance on a market test in recommending that the shareholders approve the Pritzker merger.\n\nWe conclude that the Board acted in a grossly negligent manner on October 8; and that Van Gorkom's representations on which the Board based its actions do not constitute \"reports\" under § 141 (e) on which the directors could reasonably have relied. Further, the amended Merger Agreement imposed on Trans Union's acceptance of a third party offer conditions more onerous than those imposed on Trans Union's acceptance of Pritzker's offer on September 20. After October 10, Trans Union could accept from a third party a better offer only if it were incorporated in a definitive agreement between the parties, and not conditioned on financing or on any other contingency.\n\nThe October 9 press release, coupled with the October 10 amendments, had the clear effect of locking Trans Union's Board into the Pritzker Agreement. Pritzker had thereby foreclosed Trans Union's Board from negotiating any better \"definitive\" agreement over the remaining eight weeks before Trans Union was required to clear the Proxy Statement submitting the Pritzker proposal to its shareholders.\n\n(2)\n\nNext, as to the \"curative\" effects of the Board's post-September 20 conduct, we review in more detail the reaction of Van Gorkom to the KKR proposal and the results of the Board-sponsored \"market test.\"\n\nThe KKR proposal was the first and only offer received subsequent to the Pritzker Merger Agreement. The offer resulted primarily from the efforts of Romans and other senior officers to propose an alternative to Pritzker's acquisition of Trans Union. In late September, Romans' group contacted KKR about the possibility of a leveraged buy-out by all members of Management, except Van Gorkom. by early October, Henry R. Kravis of KKR gave Romans written notice of KKR's \"interest in making an offer to purchase 100\" of Trans Union's common stock.\n\nThereafter, and until early December, Romans' group worked with KKR to develop a proposal. It did so with Van Gorkom's knowledge and apparently grudging consent. On December 2, Kravis and Romans hand-delivered to Van Gorkom a formal letter-offer to purchase all of Trans Union's assets and to assume all of its liabilities for an aggregate cash consideration equivalent to $60 per share. The offer was contingent upon completing equity and bank financing of $650 million, which Kravis represented as 80% complete. The KKR letter made reference to Discussions with major banks regarding the loan portion of the buy-out cost and stated that KKR was \"confident that commitments for the bank financing * * * can be obtained within two or three weeks.\" The purchasing group was to include certain named key members of Trans Union's Senior Management, excluding Van Gorkom, and a major Canadian company. Kravis stated that they were willing to enter into a \"definitive agreement\" under terms and conditions \"substantially the same\" as those contained in Trans Union's agreement with Pritzker. The offer was addressed to Trans Union's Board of Directors and a meeting with the Board, scheduled for that afternoon, was requested.\n\nVan Gorkom's reaction to the KKR proposal was completely negative; he did not view the offer as being firm because of its financing condition. It was pointed out, to no avail, that Pritzker's offer had not only been similarly conditioned, but accepted on an expedited basis. Van Gorkom refused Kravis' request that Trans Union issue a press release announcing KKR's offer, on the ground that it might \"chill\" any other offer. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Romans and Kravis left with the understanding that their proposal would be presented to Trans Union's Board that afternoon.\n\nWithin a matter of hours and shortly before the scheduled Board meeting, Kravis withdrew his letter-offer. He gave as his reason a sudden decision by the Chief Officer of Trans Union's rail car leasing operation to withdraw from the KKR purchasing group. Van Gorkom had spoken to that officer about his participation in the KKR proposal immediately after his meeting with Romans and Kravis. However, Van Gorkom denied any responsibility for the officer's change of mind.\n\nAt the Board meeting later that afternoon, Van Gorkom did not inform the directors of the KKR proposal because he considered it \"dead.\" Van Gorkom did not contact KKR again until January 20, when faced with the realities of this lawsuit, he then attempted to reopen negotiations. KKR declined due to the imminence of the February 10 stockholder meeting.\n\nGE Credit Corporation's interest in Trans Union did not develop until November; and it made no written proposal until mid-January. Even then, its proposal was not in the form of an offer. Had there been time to do so, GE Credit was prepared to offer between $2 and $5 per share above the $55 per share price which Pritzker offered. But GE Credit needed an additional 60 to 90 days; and it was unwilling to make a formal offer without a concession from Pritzker extending the February 10 \"deadline\" for Trans Union's stockholder meeting. As previously stated, Pritzker refused to grant such extension; and on January 21, GE Credit terminated further negotiations with Trans Union. Its stated reasons, among others, were its \"unwillingness to become involved in a bidding contest with Pritzker in the absence of the willingness of [the Pritzker interests] to terminate the proposed $55 cash merger.\"\n\nIn the absence of any explicit finding by the Trial Court as to the reasonableness of Trans Union's directors' reliance on a market test and its feasibility, we may make our own findings based on the record. Our review of the record compels a finding that confirmation of the appropriateness of the Pritzker offer by an unfettered or free market test was virtually meaningless in the face of the terms and time limitations of Trans Union's Merger Agreement with Pritzker as amended October 10, 1980.\n\n(3)\n\nFinally, we turn to the Board's meeting of January 26, 1981. The defendant directors rely upon the action there taken to refute the contention that they did not reach an informed business judgment in approving the Pritzker merger. The defendants contend that the Trial Court correctly concluded that Trans Union's directors were, in effect, as \"free to turn down the Pritzker proposal\" on January 26, as they were on September 20.\n\nApplying the appropriate standard of review set forth in Levitt v. Bouvier, (supra) , we conclude that the Trial Court's finding in this regard is neither supported by the record nor the product of an orderly and logical deductive process. Without disagreeing with the principle that a business decision by an originally uninformed board of directors may, under appropriate circumstances, be timely cured so as to become informed and deliberate, Muschel v. Western Union Corporation, Del. Ch., 310 A.2d 904 (1973), \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e we find that the record does not permit the defendants to invoke that principle in this case.\n\nThe Board's January 26 meeting was the first meeting following the filing of the plaintiffs' suit in mid-December and the last meeting before the previously-noticed shareholder meeting of February 10. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e All ten members of the Board and three outside attorneys attended the meeting. At that meeting the following facts, among other aspects of the Merger Agreement, were discussed:\n\n(a) The fact that prior to September 20, 1980, no Board member or member of Senior Management, except Chelberg and Peterson, knew that Van Gorkom had discussed a possible merger with Pritzker;\n\n(b) The fact that the price of $55 per share had been suggested initially to Pritzker by Van Gorkom;\n\n(c) The fact that the Board had not sought an independent fairness opinion;\n\n(d) The fact that, at the September 20 Senior Management meeting, Romans and several members of Senior Management indicated both concern that the $55 per share price was inadequate and a belief that a higher price should and could be obtained;\n\n(e) The fact that Romans had advised the Board at its meeting on September 20, that he and his department had prepared a study which indicated that the Company had a value in the range of $55 to $65 per share, and that he could not advise the Board that the $55 per share offer made by Pritzker was unfair.\n\nThe defendants characterize the Board's Minutes of the January 26 meeting as a \"review\" of the \"entire sequence of events\" from Van Gorkom's initiation of the negotiations on September 13 forward. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e The defendants also rely on the testimony of several of the Board members at trial as confirming the Minutes. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e On the basis of this evidence, the defendants argue that whatever information the Board lacked to make a deliberate and informed judgment on September 20, or on October 8, was fully divulged to the entire Board on January 26. Hence, the argument goes, the Board's vote on January 26 to again \"approve\" the Pritzker merger must be found to have been an informed and deliberate judgment.\n\nOn the basis of this evidence, the defendants assert: (1) that the Trial Court was legally correct in widening the time frame for determining whether the defendants' approval of the Pritzker merger represented an informed business judgment to include the entire four-month period during which the Board considered the matter from September 20 through January 26; and (2) that, given this extensive evidence of the Board's further review and deliberations on January 26, this Court must affirm the Trial Court's Conclusion that the Board's action was not reckless or improvident.\n\nWe cannot agree. We find the Trial Court to have erred, both as a matter of fact and as a matter of law, in relying on the action on January 26 to bring the defendants' conduct within the protection of the business judgment rule.\n\nJohnson's testimony and the Board Minutes of January 26 are remarkably consistent. Both clearly indicate recognition that the question of the alternative courses of action, available to the Board on January 26 with respect to the Pritzker merger, was a legal question, presenting to the Board (after its review of the full record developed through pre-trial discovery) three options: (1) to \"continue to recommend\" the Pritzker merger; (2) to \"recommend that the stockholders vote against\" the Pritzker merger; or (3) to take a noncommittal position on the merger and \"simply leave the decision to shareholders.\"\n\nWe must conclude from the foregoing that the Board was mistaken as a matter of law regarding its available courses of action on January 26, 1981. Options (2) and (3) were not viable or legally available to the Board under 8 Del.C. § 251 (b). The Board could not remain committed to the Pritzker merger and yet recommend that its stockholders vote it down; nor could it take a neutral position and delegate to the stockholders the unadvised decision as to whether to accept or reject the merger. Under § 251 (b), the Board had but two options: (1) to proceed with the merger and the stockholder meeting, with the Board's recommendation of approval; or (2) to rescind its agreement with Pritzker, withdraw its approval of the merger, and notify its stockholders that the proposed shareholder meeting was cancelled. There is no evidence that the Board gave any consideration to these, its only legally viable alternative courses of action.\n\nBut the second course of action would have clearly involved a substantial risk -- that the Board would be faced with suit by Pritzker for breach of contract based on its September 20 agreement as amended October 10. As previously noted, under the terms of the October 10 amendment, the Board's only ground for release from its agreement with Pritzker was its entry into a more favorable definitive agreement to sell the Company to a third party. Thus, in reality, the Board was not \"free to turn down the Pritzker proposal\" as the Trial Court found. Indeed, short of negotiating a better agreement with a third party, the Board's only basis for release from the Pritzker Agreement without liability would have been to establish fundamental wrongdoing by Pritzker. Clearly, the Board was not \"free\" to withdraw from its agreement with Pritzker on January 26 by simply relying on its self-induced failure to have reached an informed business judgment at the time of its original agreement. See... Wilmington Trust Company v. Coulter, Del. Supr., 41 Del. Ch. 548, 200 A.2d 441, 453 (1964), aff'g... Pennsylvania Company v. Wilmington Trust Company, Del. Ch., 40 Del. Ch. 567, 186 A.2d 751 (1962).\n\nTherefore, the Trial Court's Conclusion that the Board reached an informed business judgment on January 26 in determining whether to turn down the Pritzker \"proposal\" on that day cannot be sustained. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e The Court's Conclusion is not supported by the record; it is contrary to the provisions of § 251 (b) and basic principles of contract law; and it is not the product of a logical and deductive reasoning process.\n\nUpon the basis of the foregoing, we hold that the defendants' post-September conduct did not cure the deficiencies of their September 20 conduct; and that, accordingly, the Trial Court erred in according to the defendants the benefits of the business judgment rule.\n\nIV.\n\nWhether the directors of Trans Union should be treated as one or individually in terms of invoking the protection of the business judgment rule and the applicability of 8 Del.C. § 141 (c) are questions which were not originally addressed by the parties in their briefing of this case. This resulted in a supplemental briefing and a second rehearing en banc on two basic questions: (a) whether one or more of the directors were deprived of the protection of the business judgment rule by evidence of an absence of good faith; and (b) whether one or more of the outside directors were entitled to invoke the protection of 8 Del.C. § 141 (e) by evidence of a reasonable, good faith reliance on \"reports,\" including legal advice, rendered the Board by certain inside directors and the Board's special counsel, Brennan.\n\nThe parties' response, including reargument, has led the majority of the Court to conclude: (1) that since all of the defendant directors, outside as well as inside, take a unified position, we are required to treat all of the directors as one as to whether they are entitled to the protection of the business judgment rule; and (2) that considerations of good faith, including the presumption that the directors acted in good faith, are irrelevant in determining the threshold issue of whether the directors as a Board exercised an informed business judgment. For the same reason, we must reject defense counsel's ad hominem argument for affirmance: that reversal may result in a multi-million dollar class award against the defendants for having made an allegedly uninformed business judgment in a transaction not involving any personal gain, self-dealing or claim of bad faith.\n\nIn their brief, the defendants similarly mistake the business judgment rule's application to this case by erroneously invoking presumptions of good faith and \"wide discretion\":\n\nThis is a case in which plaintiff challenged the exercise of business judgment by an independent Board of Directors. There were no allegations and no proof of fraud, bad faith, or self-dealing by the directors . . . .\n\nThe business judgment rule, which was properly applied by the Chancellor, allows directors wide discretion in the matter of valuation and affords room for honest differences of opinion. In order to prevail, plaintiffs had the heavy burden of proving that the merger price was so grossly inadequate as to display itself as a badge of fraud. That is a burden which plaintiffs have not met.\n\nHowever, plaintiffs have not claimed, nor did the Trial Court decide, that $55 was a grossly inadequate price per share for sale of the Company. That being so, the presumption that a board's judgment as to adequacy of price represents an honest exercise of business judgment (absent proof that the sale price was grossly inadequate) is irrelevant to the threshold question of whether an informed judgment was reached. Compare Sinclair Oil Corp. v. Levien, Del. Supr., 280 A.2d 717 (1971); Kelly v. Bell, Del. Supr., 266 A.2d 878, 879 (1970); Cole v. National Cash Credit Association, Del. Ch., 18 Del. Ch. 47, 156 A. 183 (1931); Allaun v. Consolidated Oil Co., (supra) ; Allen Chemical \u0026 Dye Corp. v. Steel \u0026 Tube Co. of America, Del. Ch., 14 Del. Ch. 1, 120 A. 486 (1923).\n\nV.\n\nThe defendants ultimately rely on the stockholder vote of February 10 for exoneration. The defendants contend that the stockholders' \"overwhelming\" vote approving the Pritzker Merger Agreement had the legal effect of curing any failure of the Board to reach an informed business judgment in its approval of the merger.\n\nThe parties tacitly agree that a discovered failure of the Board to reach an informed business judgment in approving the merger constitutes a voidable, rather than a void, act. Hence, the merger can be sustained, notwithstanding the infirmity of the Board's action, if its approval by majority vote of the shareholders is found to have been based on an informed electorate. Cf. Michelson v. Duncan, Del. Supr., 407 A.2d 211 (1979), aff'g in part and... rev'g in part, Del. Ch., 386 A.2d 1144 (1978). The disagreement between the parties arises over: (1) the Board's burden of disclosing to the shareholders all relevant and material information; and (2) the sufficiency of the evidence as to whether the Board satisfied that burden.\n\nOn this issue the Trial Court summarily concluded \"that the stockholders of Trans Union were fairly informed as to the pending merger. . . .\" The Court provided no supportive reasoning nor did the Court make any reference to the evidence of record.\n\nThe plaintiffs contend that the Court committed error by applying an erroneous disclosure standard of \"adequacy\" rather than \"completeness\" in determining the sufficiency of the Company's merger proxy materials. The plaintiffs also argue that the Board's proxy statements, both its original statement dated January 19 and its supplemental statement dated January 26, were incomplete in various material respects. Finally, the plaintiffs assert that Management's supplemental statement (mailed \"on or about\" January 27) was untimely either as a matter of law under 8 Del.C. § 251 (c), or untimely as a matter of equity and the requirements of complete candor and fair disclosure.\n\nThe defendants deny that the Court committed legal or equitable error. On the question of the Board's burden of disclosure, the defendants state that there was no dispute at trial over the standard of disclosure required of the Board; but the defendants concede that the Board was required to disclose \"all germane facts\" which a reasonable shareholder would have considered important in deciding whether to approve the merger. Thus, the defendants argue that when the Trial Court speaks of finding the Company's shareholders to have been \"fairly informed\" by Management's proxy materials, the Court is speaking in terms of \"complete candor\" as required under Lynch v. Vickers Energy Corp., Del. Supr., 383 A.2d 278 (1978).\n\nThe settled rule in Delaware is that \"where a majority of fully informed stockholders ratify action of even interested directors, an attack on the ratified transaction normally must fail.\" Gerlach v. Gillam, Del. Ch., 37 Del. Ch. 244, 139 A.2d 591, 593 (1958). The question of whether shareholders have been fully informed such that their vote can be said to ratify director action, \"turns on the fairness and completeness of the proxy materials submitted by the management to the . . . shareholders.\" Michelson v. Duncan, (supra) at 220. As this Court stated in Gottlieb v. Heyden Chemical Corp., Del. Supr., 33 Del. Ch. 177, 91 A.2d 57, 59 (1952):\n\nhe entire atmosphere is freshened and a new set of rules invoked where a formal approval has been given by a majority of independent, fully informed stockholders. . . .\n\nIn Lynch v. Vickers Energy Corp., (supra) , this Court held that corporate directors owe to their stockholders a fiduciary duty to disclose all facts germane to the transaction at issue in an atmosphere of complete candor. We defined \"germane\" in the tender offer context as all \"information such as a reasonable stockholder would consider important in deciding whether to sell or retain stock.\" Id. at 281. Accord Weinberger v. UOP, Inc., (supra) ; Michelson v. Duncan, (supra) ; Schreiber v. Pennzoil Corp., Del. Ch., 419 A.2d 952 (1980). In reality, \"germane\" means material facts.\n\nApplying this standard to the record before us, we find that Trans Union's stockholders were not fully informed of all facts material to their vote on the Pritzker Merger and that the Trial Court's ruling to the contrary is clearly erroneous. We list the material deficiencies in the proxy materials:\n\n(1) The fact that the Board had no reasonably adequate information indicative of the intrinsic value of the Company, other than a concededly depressed market price, was without questions material to the shareholders voting on the merger. See Weinberger, (supra) at 709 (insiders' report that cash-out merger price up to $24 was good investment held material); Michelson, (supra) at 224 (alleged terms and intent of stock option plan held not germane); Schreiber, (supra) at 959 (management fee of $650,000 held germane).\n\nAccordingly, the Board's lack of valuation information should have been disclosed. Instead, the directors cloaked the absence of such information in both the Proxy Statement and the Supplemental Proxy Statement. Through artful drafting, noticeably absent at the September 20 meeting, both documents create the impression that the Board knew the intrinsic worth of the Company. In particular, the Original Proxy Statement contained the following:\n\nalthough the Board of Directors regards the intrinsic value of the Company's assets to be significantly greater than their book value . . ., systematic liquidation of such a large and complex entity as Trans Union is simply not regarded as a feasible method of realizing its inherent value. Therefore, a business combination such as the merger would seem to be the only practicable way in which the stockholders could realize the value of the Company.\n\nThe Proxy stated further that \"in the view of the Board of Directors . . ., the prices at which the Company's common stock has traded in recent years have not reflected the inherent value of the Company.\" What the Board failed to disclose to its stockholders was that the Board had not made any study of the intrinsic or inherent worth of the Company; nor had the Board even discussed the inherent value of the Company prior to approving the merger on September 20, or at either of the subsequent meetings on October 8 or January 26. Neither in its Original Proxy Statement nor in its Supplemental Proxy did the Board disclose that it had no information before it, beyond the premium-over-market and the price/earnings ratio, on which to determine the fair value of the Company as a whole.\n\n(2) We find false and misleading the Board's characterization of the Romans report in the Supplemental Proxy Statement. The Supplemental Proxy stated:\n\nAt the September 20, 1980 meeting of the Board of Directors of Trans Union, Mr. Romans indicated that while he could not say that $55,00 per share was an unfair price, he had prepared a preliminary report which reflected that the value of the Company was in the range of $55.00 to $65.00 per share.\n\nNowhere does the Board disclose that Romans stated to the Board that his calculations were made in a \"search for ways to justify a price in connection with\" a leveraged buy-out transaction, \"rather than to say what the shares are worth,\" and that he stated to the Board that his Conclusion thus arrived at \"was not the same thing as saying that I have a valuation of the Company at X dollars.\" Such information would have been material to a reasonable shareholder because it tended to invalidate the fairness of the merger price of $55. Furthermore, defendants again failed to disclose the absence of valuation information, but still made repeated reference to the \"substantial premium.\"\n\nON MOTIONS FOR REARGUMENT\n\nSubmitted: March 4, 1985\n\nMarch 14, 1985, Decided\n\nFollowing this Court's decision, Thomas P. O'Boyle, one of the director defendants, sought, and was granted, leave for change of counsel. Thereafter, the individual director defendants, other than O'Boyle, filed a motion for reargument and director O'Boyle, through newly-appearing counsel, then filed a separate motion for reargument. Plaintiffs have responded to the several motions and this matter has now been duly considered.\n\nThe Court, through its majority, finds no merit to either motion and concludes that both motions should be denied. We are not persuaded that any errors of law or fact have been made that merit reargument.\n\nHowever, defendant O'Boyle's motion requires comment. Although O'Boyle continues to adopt his fellow directors' arguments, O'Boyle now asserts in the alternative that he has standing to take a position different from that of his fellow directors and that legal grounds exist for finding him not liable for the acts or omissions of his fellow directors. Specifically, O'Boyle makes a two-part argument: (1) that his undisputed absence due to illness from both the September 20 and the October 8 meetings of the directors of Trans Union entitles him to be relieved from personal liability for the failure of the other directors to exercise due care at those meetings, see Propp v. Sadacca, Del. Ch., 40 Del. Ch. 113, 175 A.2d 33, 39 (1961), modified on other grounds, Bennett v. Propp, Del.Supr., 41 Del. Ch. 14, 187 A.2d 405 (1962); and (2) that his attendance and participation in the January 26, 1981 Board meeting does not alter this result given this Court's precise findings of error committed at that meeting.\n\nWe reject defendant O'Boyle's new argument as to standing because not timely asserted. Our reasons are several. One, in connection with the supplemental briefing of this case in March, 1984, a special opportunity was afforded the individual defendants, including O'Boyle, to present any factual or legal reasons why each or any of them should be individually treated. Thereafter, at argument before the Court on June 11, 1984, the following colloquy took place between this Court and counsel for the individual defendants at the outset of counsel's argument:\n\nCOUNSEL: I'll make the argument on behalf of the nine individual defendants against whom the plaintiffs seek more than $100,000,000 in damages.\n\nThat is the ultimate issue in this case, whether or not nine honest, experienced businessmen should be subject to damages in a case where --\n\nJUSTICE MOORE: Is there a distinction between Chelberg and Van Gorkom vis-a-vis the other defendants?\n\nCOUNSEL: No, sir.\n\nJUSTICE MOORE: None whatsoever?\n\nCOUNSEL: I think not. Two, in this Court's Opinion dated January 29, 1985, the Court relied on the individual defendants as having presented a unified defense. We stated:\n\nThe parties' response, including\n\nreargument, has led the majority of the\n\nCourt to conclude: (1) that since all of\n\nthe defendant directors, outside as well\n\nas inside, take a unified position, we are\n\nrequired to treat all of the directors as\n\none as to whether they are entitled to the\n\nprotection of the business judgment rule. . .\n\nThree, previously O'Boyle took the position that the Board's action taken January 26, 1981 -- in which he fully participated -- was determinative of virtually all issues. Now O'Boyle seeks to attribute no significance to his participation in the January 26 meeting. Nor does O'Boyle seek to explain his having given before the directors' meeting of October 8, 1980 his \"consent to the transaction of such business as may come before the meeting.\" It is the view of the majority of the Court that O'Boyle's change of position following this Court's decision on the merits comes too late to be considered. He has clearly waived that right.\n\nThe Motions for Reargument of all defendants are denied.\n\nMcNEILLY and CHRISTIE, Justices, Dissenting:\n\nWe do not disagree with the ruling as to the defendant O'Boyle, but we would have granted reargument on the other issues raised.\n\n(3) We find misleading the Board's references to the \"substantial\" premium offered. The Board gave as their primary reason in support of the merger the \"substantial premium\" shareholders would receive. But the Board did not disclose its failure to assess the premium offered in terms of other relevant valuation techniques, thereby rendering questionable its determination as to the substantiality of the premium over an admittedly depressed stock market price.\n\n(4) We find the Board's recital in the Supplemental Proxy of certain events preceding the September 20 meeting to be incomplete and misleading. It is beyond dispute that a reasonable stockholder would have considered material the fact that Van Gorkom not only suggested the $55 price to Pritzker, but also that he chose the figure because it made feasible a leveraged buy-out. The directors disclosed that Van Gorkom suggested the $55 price to Pritzker. But the Board misled the shareholders when they described the basis of Van Gorkom's suggestion as follows:\n\nSuch suggestion was based, at least in part, on Mr. Van Gorkom's belief that loans could be obtained from institutional lenders (together with about a $200 million equity contribution) which would justify the payment of such price, . . .\n\nAlthough by January 26, the directors knew the basis of the $55 figure, they did not disclose that Van Gorkom chose the $55 price because that figure would enable Pritzker to both finance the purchase of Trans Union through a leveraged buy-out and, within five years, substantially repay the loan out of the cash flow generated by the Company's operations.\n\n(5) The Board's Supplemental Proxy Statement, mailed on or after January 27, added significant new matter, material to the proposal to be voted on February 10, which was not contained in the Original Proxy Statement. Some of this new matter was information which had only been disclosed to the Board on January 26; much was information known or reasonably available before January 21 but not revealed in the Original Proxy Statement. Yet, the stockholders were not informed of these facts. Included in the \"new\" matter first disclosed in the Supplemental Proxy Statement were the following:\n\n(a) The fact that prior to September 20, 1980, no Board member or member of Senior Management, except Chelberg and Peterson, knew that Van Gorkom had discussed a possible merger with Pritzker;\n\n(b) The fact that the sale price of $55 per share had been suggested initially to Pritzker by Van Gorkom;\n\n(c) The fact that the Board had not sought an independent fairness opinion;\n\n(d) The fact that Romans and several members of Senior Management had indicated concern at the September 20 Senior Management meeting that the $55 per share price was inadequate and had stated that a higher price should and could be obtained; and\n\n(e) The fact that Romans had advised the Board at its meeting on September 20 that he and his department had prepared a study which indicated that the Company had a value in the range of $55 to $65 per share, and that he could not advise the Board that the $55 per share offer which Pritzker made was unfair.\n\nThe parties differ over whether the notice requirements of 8 Del.C. § 251 (c) apply to the mailing date of supplemental proxy material or that of the original proxy material. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e The Trial Court summarily disposed of the notice issue, stating it was \"satisfied that the proxy material furnished to Trans Union stockholders . . . fairly presented the question to be voted on at the February 10, 1981 meeting.\"\n\nThe defendants argue that the notice provisions of § 251 (c) must be construed as requiring only that stockholders receive notice of the time, place, and purpose of a meeting to consider a merger at least 20 days prior to such meeting; and since the Original Proxy Statement was disseminated more than 20 days before the meeting, the defendants urge affirmance of the Trial Court's ruling as correct as a matter of statutory construction. Apparently, the question has not been addressed by either the Court of Chancery or this Court; and authority in other jurisdictions is limited. See Electronic Specialty Co. v. Int'l Controls Corp., 2d Cir., 409 F.2d 937, 944 (1969) (holding that a tender offeror's September 16, 1968 correction of a previous misstatement, combined with an offer of withdrawal running for eight days until September 24, 1968, was sufficient to cure past violations and eliminate any need for rescission); Nicholson File Co. v. H.K. Porter Co., D.R.I., 341 F. Supp. 508, 513-14 (1972), aff'd, 1st Cir., 482 F.2d 421 (1973) (permitting correction of a material misstatement by a mailing to stockholders within seven days of a tender offer withdrawal date). Both Electronics and Nicholson are federal security cases not arising under 8 Del.C. § 251 (c) and they are otherwise distinguishable from this case on their facts.\n\nSince we have concluded that Management's Supplemental Proxy Statement does not meet the Delaware disclosure standard of \"complete candor\" under Lynch v. Vickers, (supra) , it is unnecessary for us to address the plaintiffs' legal argument as to the proper construction of § 251 (c). However, we do find it advisable to express the view that, in an appropriate case, an otherwise candid proxy statement may be so untimely as to defeat its purpose of meeting the needs of a fully informed electorate.\n\nIn this case, the Board's ultimate disclosure as contained in the Supplemental Proxy Statement related either to information readily accessible to all of the directors if they had asked the right questions, or was information already at their disposal. In short, the information disclosed by the Supplemental Proxy Statement was information which the defendant directors knew or should have known at the time the first Proxy Statement was issued. The defendants simply failed in their original duty of knowing, sharing, and disclosing information that was material and reasonably available for their discovery. They compounded that failure by their continued lack of candor in the Supplemental Proxy Statement. While we need not decide the issue here, we are satisfied that, in an appropriate case, a completely candid but belated disclosure of information long known or readily available to a board could raise serious issues of inequitable conduct. Schnell v. Chris-Craft Industries, Inc., Del. Supr., 285 A.2d 437, 439 (1971).\n\nThe burden must fall on defendants who claim ratification based on shareholder vote to establish that the shareholder approval resulted from a fully informed electorate. On the record before us, it is clear that the Board failed to meet that burden. Weinberger v. UOP, Inc., (supra) at 703; Michelson v. Ducan, (supra) .\n\nFor the foregoing reasons, we conclude that the director defendants breached their fiduciary duty of candor by their failure to make true and correct disclosures of all information they had, or should have had, material to the transaction submitted for stockholder approval.\n\nVI.\n\nTo summarize: we hold that the directors of Trans Union breached their fiduciary duty to their stockholders (1) by their failure to inform themselves of all information reasonably available to them and relevant to their decision to recommend the Pritzker merger; and (2) by their failure to disclose all material information such as a reasonable stockholder would consider important in deciding whether to approve the Pritzker offer.\n\nWe hold, therefore, that the Trial Court committed reversible error in applying the business judgment rule in favor of the director defendants in this case.\n\nOn remand, the Court of Chancery shall conduct an evidentiary hearing to determine the fair value of the shares represented by the plaintiffs' class, based on the intrinsic value of Trans Union on September 20, 1980. Such valuation shall be made in accordance with Weinberger v. UOP, Inc.,... supra at 712-715. Thereafter, an award of damages may be entered to the extent that the fair value of Trans Union exceeds $55 per share.\n\nREVERSED and REMANDED for proceedings consistent herewith.\n\nMcNeilly, Justice, Dissenting:\n\nThe majority opinion reads like an advocate's closing address to a hostile jury. And I say that not lightly. Throughout the opinion great emphasis is directed only to the negative, with nothing more than lip service granted the positive aspects of this case. In my opinion Chancellor Marvel (retired) should have been affirmed. The Chancellor's opinion was the product of well reasoned Conclusions, based upon a sound deductive process, clearly supported by the evidence and entitled to deference in this appeal. Because of my diametrical opposition to all evidentiary Conclusions of the majority, I respectfully Dissent.\n\nIt would serve no useful purpose, particularly at this late date, for me to Dissent at great length. I restrain myself from doing so, but feel compelled to at least point out what I consider to be the most glaring deficiencies in the majority opinion. The majority has spoken and has effectively said that Trans Union's Directors have been the victims of a \"fast shuffle\" by Van Gorkom and Pritzker. That is the beginning of the majority's comedy of errors. The first and most important error made is the majority's assessment of the directors' knowledge of the affairs of Trans Union and their combined ability to act in this situation under the protection of the business judgment rule.\n\nTrans Union's Board of Directors consisted of ten men, five of whom were \"inside\" directors and five of whom were \"outside\" directors. The \"inside\" directors were Van Gorkom, Chelberg, Bonser, William B. Browder, Senior Vice-President-Law, and Thomas P. O'Boyle, Senior Vice-President-Administration. At the time the merger was proposed the inside five directors had collectively been employed by the Company for 116 years and had 68 years of combined experience as directors. The \"outside\" directors were A. W. Wallis, William B. Johnson, Joseph B. Lanterman, Graham J. Morgan and Robert W. Reneker. With the exception of Wallis, these were all chief executive officers of Chicago based corporations that were at least as large as Trans Union. The five \"outside\" directors had 78 years of combined experience as chief executive officers, and 53 years cumulative service as Trans Union directors.\n\nThe inside directors wear their badge of expertise in the corporate affairs of Trans Union on their sleeves. But what about the outsiders? Dr. Wallis is or was an economist and math statistician, a professor of economics at Yale University, dean of the graduate school of business at the University of Chicago, and Chancellor of the University of Rochester. Dr. Wallis had been on the Board of Trans Union since 1962. He also was on the board of Bausch \u0026 Lomb, Kodak, Metropolitan Life Insurance Company, Standard Oil and others.\n\nWilliam B. Johnson is a University of Pennsylvania law graduate, President of Railway Express until 1966, Chairman and Chief Executive of I.C. Industries Holding Company, and member of Trans Union's Board since 1968.\n\nJoseph Lanterman, a Certified Public Accountant, is or was President and Chief Executive of American Steel, on the Board of International Harvester, Peoples Energy, Illinois Bell Telephone, Harris Bank and Trust Company, Kemper Insurance Company and a director of Trans Union for four years.\n\nGraham Morgan is a chemist, was Chairman and Chief Executive Officer of U.S. Gypsum, and in the 17 and 18 years prior to the Trans Union transaction had been involved in 31 or 32 corporate takeovers.\n\nRobert Reneker attended University of Chicago and Harvard Business Schools. He was President and Chief Executive of Swift and Company, director of Trans Union since 1971, and member of the Boards of seven other corporations including U.S. Gypsum and the Chicago Tribune.\n\nDirectors of this caliber are not ordinarily taken in by a \"fast shuffle\". I submit they were not taken into this multi-million dollar corporate transaction without being fully informed and aware of the state of the art as it pertained to the entire corporate panoroma of Trans Union. True, even directors such as these, with their business acumen, interest and expertise, can go astray. I do not believe that to be the case here. These men knew Trans Union like the back of their hands and were more than well qualified to make on the spot informed business judgments concerning the affairs of Trans Union including a 100% sale of the corporation. Lest we forget, the corporate world of then and now operates on what is so aptly referred to as \"the fast track\". These men were at the time an integral part of that world, all professional business men, not intellectual figureheads.\n\nThe majority of this Court holds that the Board's decision, reached on September 20, 1980, to approve the merger was not the product of informed business judgment, that the Board's subsequent efforts to amend the Merger Agreement and take other curative action were legally and factually ineffectual, and that the Board did not deal with complete candor with the stockholders by failing to disclose all material facts, which they knew or should have known, before securing the stockholders' approval of the merger. I disagree.\n\nAt the time of the September 20, 1980 meeting the Board was acutely aware of Trans Union and its prospects. The problems created by accumulated investment tax credits and accelerated depreciation were discussed repeatedly at Board meetings, and all of the directors understood the problem thoroughly. Moreover, at the July, 1980 Board meeting the directors had reviewed Trans Union's newly prepared five-year forecast, and at the August, 1980 meeting Van Gorkom presented the results of a comprehensive study of Trans Union made by The Boston Consulting Group. This study was prepared over an 18 month period and consisted of a detailed analysis of all Trans Union subsidiaries, including competitiveness, profitability, cash throw-off, cash consumption, technical competence and future prospects for contribution to Trans Union's combined net income.\n\nAt the September 20 meeting Van Gorkom reviewed all aspects of the proposed transaction and repeated the explanation of the Pritzker offer he had earlier given to senior management. Having heard Van Gorkom's explanation of the Pritzker's offer, and Brennan's explanation of the merger documents the directors discussed the matter. Out of this Discussion arose an insistence on the part of the directors that two modifications to the offer be made. First, they required that any potential competing bidder be given access to the same information concerning Trans Union that had been provided to the Pritzkers. Second, the merger documents were to be modified to reflect the fact that the directors could accept a better offer and would not be required to recommend the Pritzker offer if a better offer was made. The following language was inserted into the agreement:\n\n\"Within 30 days after the execution of this Agreement, TU shall call a meeting of its stockholders (the 'Stockholder's Meeting') for the purpose of approving and adopting the Merger Agreement. The Board of Directors shall recommend to the stockholders of TU that they approve and adopt the Merger Agreement (the 'Stockholders' Approval') and shall use its best efforts to obtain the requisite vote therefor; provided, however, that GL and NTC acknowledge that the Board of Directors of TU may have a competing fiduciary obligation to the Stockholders under certain circumstances.\" (Emphasis added)\n\nWhile the language is not artfully drawn, the evidence is clear that the intention underlying that language was to make specific the right that the directors assumed they had, that is, to accept any offer that they thought was better, and not to recommend the Pritzker offer in the face of a better one. At the Conclusion of the meeting, the proposed merger was approved.\n\nAt a subsequent meeting on October 8, 1981 the directors, with the consent of the Pritzkers, amended the Merger Agreement so as to establish the right of Trans Union to solicit as well as to receive higher bids, although the Pritzkers insisted that their merger proposal be presented to the stockholders at the same time that the proposal of any third party was presented. A second amendment, which became effective on October 10, 1981, further provided that Trans Union might unilaterally terminate the proposed merger with the Pritzker company in the event that prior to February 10, 1981 there existed a definitive agreement with a third party for a merger, consolidation, sale of assets, or purchase or exchange of Trans Union stock which was more favorable for the stockholders of Trans Union than the Pritzker offer and which was conditioned upon receipt of stockholder approval and the absence of an injunction against its consummation.\n\nFollowing the October 8 board meeting of Trans Union, the investment banking firm of Salomon Brothers was retained by the corporation to search for better offers than that of the Pritzkers, Salomon Brothers being charged with the responsibility of doing \"whatever possible to see if there is a superior bid in the marketplace over a bid that is on the table for Trans Union\". In undertaking such project, it was agreed that Salomon Brothers would be paid the amount of $500,000 to cover its expenses as well as a fee equal to 3/8ths of 1% of the aggregate fair market value of the consideration to be received by the company in the case of a merger or the like, which meant that in the event Salomon Brothers should find a buyer willing to pay a price of $56.00 a share instead of $55.00, such firm would receive a fee of roughly $2,650,000 plus disbursements.\n\nAs the first step in proceeding to carry out its commitment, Salomon Brothers had a brochure prepared, which set forth Trans Union's financial history, described the company's business in detail and set forth Trans Union's operating and financial projections. Salomon Brothers also prepared a list of over 150 companies which it believed might be suitable merger partners, and while four of such companies, namely, General Electric, Borg-Warner, Bendix, and Genstar, Ltd. showed some interest in such a merger, none made a firm proposal to Trans Union and only General Electric showed a sustained interest. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e As matters transpired, no firm offer which bettered the Pritzker offer of $55 per share was ever made.\n\nOn January 21, 1981 a proxy statement was sent to the shareholders of Trans Union advising them of a February 10, 1981 meeting in which the merger would be voted. On January 26, 1981 the directors held their regular meeting. At this meeting the Board discussed the instant merger as well as all events, including this litigation, surrounding it. At the Conclusion of the meeting the Board unanimously voted to recommend to the stockholders that they approve the merger. Additionally, the directors reviewed and approved a Supplemental Proxy Statement which, among other things, advised the stockholders of what had occurred at the instant meeting and of the fact that General Electric had decided not to make an offer. On February 10, 1981 the stockholders of Trans Union met pursuant to notice and voted overwhelmingly in favor of the Pritzker merger, 89% of the votes cast being in favor of it.\n\nI have no quarrel with the majority's analysis of the business judgment rule. It is the application of that rule to these facts which is wrong. An overview of the entire record, rather than the limited view of bits and pieces which the majority has exploded like popcorn, convinces me that the directors made an informed business judgment which was buttressed by their test of the market.\n\nAt the time of the September 20 meeting the 10 members of Trans Union's Board of Directors were highly qualified and well informed about the affairs and prospects of Trans Union. These directors were acutely aware of the historical problems facing Trans Union which were caused by the tax laws. They had discussed these problems ad nauseam. In fact, within two months of the September 20 meeting the board had reviewed and discussed an outside study of the company done by The Boston Consulting Group and an internal five year fore-cast prepared by management. At the September 20 meeting Van Gorkom presented the Pritzker offer, and the board then heard from James Brennan, the company's counsel in this matter, who discussed the legal documents. Following this, the Board directed that certain changes be made in the merger documents. These changes made it clear that the Board was free to accept a better offer than Pritzker's if one was made. The above facts reveal that the Board did not act in a grossly negligent manner in informing themselves of the relevant and available facts before passing on the merger. To the contrary, this record reveals that the directors acted with the utmost care in informing themselves of the relevant and available facts before passing on the merger.\n\nThe majority finds that Trans Union stockholders were not fully informed and that the directors breached their fiduciary duty of complete candor to the stockholders required by Lynch v. Vickers Energy Corp., Del. Supr. 383 A.2d 278 (1978) [Lynch I], in that the proxy materials were deficient in five areas.\n\nHere again is exploitation of the negative by the majority without giving credit to the positive. To respond to the Conclusions of the majority would merely be unnecessary prolonged argument. But briefly what did the proxy materials disclose? The proxy material informed the shareholders that projections were furnished to potential purchasers and such projections indicated that Trans Union's net income might increase to approximately $153 million in 1985. That projection, what is almost three times the net income of $58,248,000 reported by Trans Union as its net income for December 31, 1979 confirmed the statement in the proxy materials that the \"Board of Directors believes that, assuming reasonably favorable economic and financial conditions, the Company's prospects for future earnings growth are excellent.\" This material was certainly sufficient to place the Company's stockholders on notice that there was a reasonable basis to believe that the prospects for future earnings growth were excellent, and that the value of their stock was more than the stock market value of their shares reflected.\n\nOverall, my review of the record leads me to conclude that the proxy materials adequately complied with Delaware law in informing the shareholders about the proposed transaction and the events surrounding it.\n\nThe majority suggests that the Supplemental Proxy Statement did not comply with the notice requirement of 8 Del.C. § 251(c) that notice of the time, place and purpose of a meeting to consider a merger must be sent to each shareholder of record at least 20 days prior to the date of the meeting. In the instant case an original proxy statement was mailed on January 18, 1981 giving notice of the time, place and purpose of the meeting. A Supplemental Proxy Statement was mailed January 26, 1981 in an effort to advise Trans Union's shareholders as to what had occurred at the January 26, 1981 meeting, and that General Electric had decided not to make an offer. The shareholder meeting was held February 10, 1981 fifteen days after the supplemental Proxy Statement had been sent.\n\nAll § 251(c) requires is that notice of the time, place and purpose of the meeting be given at least 20 days prior to the meeting. This was accomplished by the proxy statement mailed January 19, 1981. Nothing in § 251(c) prevents the supplementation of proxy materials within 20 days of the meeting. Indeed when additional information, which a reasonable shareholder would consider important in deciding how to vote, comes to light that information must be disclosed to stockholders in sufficient time for the stockholders to consider it. But nothing in § 251(c) requires this additional information to be disclosed at least 20 days prior to the meeting. To reach a contrary result would ignore the current practice and would discourage the supplementation of proxy materials in order to disclose the occurrence of intervening events. In my opinion, fifteen days in the instant case was a sufficient amount of time for the stockholders to receive and consider the information in the supplemental proxy statement.\n\nCHRISTIE, Justice, Dissenting:\n\nI respectfully Dissent.\n\nConsidering the standard and scope of our review under Levitt v. Bouvier, Del. Supr., 287 A.2d 671, 673 (1972), I believe that the record taken as a whole supports a Conclusion that the actions of the defendants are protected by the business judgment rule. Aronson v. Lewis, Del. Supr., 473 A.2d 805, 812 (1984); Pogostin v. Rice, Del. Supr., 480 A.2d 619, 627 (1984). I also am satisfied that the record supports a Conclusion that the defendants acted with the complete candor required by Lynch v. Vickers Energy Corp., Del. Supr., 383 A.2d 278 (1978). Under the circumstances I would affirm the Judgment of the Court of Chancery.\n\n\u003cspan class=\"fn\"\u003e1. The plaintiff, Alden Smith, originally sought to enjoin the merger; but, following extensive discovery, the Trial Court denied the plaintiff's motion for preliminary injunction by unreported letter opinion dated February 3, 1981. On February 10, 1981, the proposed merger was approved by Trans Union's stockholders at a special meeting and the merger became effective on that date. Thereafter, John W. Gosselin was permitted to intervene as an additional plaintiff; and Smith and Gosselin were certified as representing a class consisting of all persons, other than defendants, who held shares of Trans Union common stock on all relevant dates. At the time of the merger, Smith owned 54,000 shares of Trans Union stock, Gosselin owned 23,600 shares, and members of Gosselin's family owned 20,000 shares.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Following trial, and before decision by the Trial Court, the parties stipulated to the dismissal, with prejudice, of the Messrs. Pritzker as parties defendant. However, all references to defendants hereinafter are to the defendant directors of Trans Union, unless otherwise noted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. It has been stipulated that plaintiffs sue on behalf of a class consisting of 10,537 shareholders (out of a total of 12,844) and that the class owned 12,734,404 out of 13,357,758 shares of Trans Union outstanding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. More detailed statements of facts, consistent with this factual outline, appear in related portions of this Opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The common stock of Trans Union was traded on the New York Stock Exchange. Over the five year period from 1975 through 1979, Trans Union's stock had traded within a range of a high of $39 1/2 and a low of $24 1/4. Its high and low range for 1980 through September 19 (the last trading day before announcement of the merger) was $38 1/4 - $29 1/2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Van Gorkom asked Romans to express his opinion as to the $55 price. Romans stated that he \"thought the price was too low in relation to what he could derive for the company in a cash sale, particularly one which enabled us to realize the values of certain subsidiaries and independent entities.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The record is not clear as to the terms of the Merger Agreement. The Agreement, as originally presented to the Board on September 20, was never produced by defendants despite demands by the plaintiffs. Nor is it clear that the directors were given an opportunity to study the Merger Agreement before voting on it. All that can be said is that Brennan had the Agreement before his during the meeting.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. In Van Gorkom's words: The \"real decision\" is whether to \"let the stockholders decide it\" which is \"all you are being asked to decide today.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The Trial Court stated the premium relationship of the $55 price to the market history of the Company's stock as follows:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. We refer to the underlined portion of the Court's ultimate Conclusion (previously stated): \"that given the market value of Trans Union's stock, the business acumen of the members of the board of Trans Union, the substantial premium over market offered by the Pritzkers and the ultimate effect on the merger price provided by the prospect of other bids for the stock in question, that the board of directors of Trans Union did not act recklessly or improvidently . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. 8 Del.C. § 141 provides, in pertinent part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(a) The business and affairs of every corporation organized under this chapter shall be managed by or under the direction of a board of directors, except as may be otherwise provided in this chapter or in its certificate of incorporation. If any such provision is made in the certificate of incorporation, and powers and duties conferred or imposed upon the board of directors by this chapter shall be exercised or performed to such extent and by such person or persons as shall be provided in the certificate of incorporation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. See Kaplan v. Centex Corporation, Del. Ch., 284 A.2d 119, 124 (1971), where the Court stated:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eApplication of the [business judgment] rule of necessity depends upon a showing that informed directors did in fact make a business judgment authorizing the transaction under review. And, as the plaintiff argues, the difficulty here is that the evidence does not show that this was done. There were director-committee-officer references to the realignment but none of these singly or cumulative showed that the director judgment was brought to bear with specificity on the transactions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Compare Mitchell v. Highland-Western Glass, (supra) , where the Court posed the question as whether the board acted \"so far without information that they can be said to have passed an unintelligent and unadvised judgment.\" 167 A. at 833. Compare also Gimbel v. Signal Companies, Inc., 316 A.2d 599, aff'd per curiam Del.Supr., 316 A.2d 619 (1974), where the Chancellor, after expressly reiterating the Highland-Western Glass standard, framed the question, \"Or to put the question in its legal context, did the Signal directors act without the bounds of reason and recklessly in approving the price offer of Burmah?\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. 8 Del.C. § 251 (b) provides in pertinent part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(b) The board of directors of each corporation which desires to merge or consolidate shall adopt a resolution approving an agreement of merger or consolidation. The agreement shall state: (1) the terms and conditions of the merger or consolidation; (2) the mode of carrying the same into effect; (3) such amendments or changes in the certificate of incorporation of the surviving corporation as are desired to be effected by the merger or consolidation, or, if no such amendments or changes are desired, a statement that the certificate of incorporation of one of the constituent corporations shall be the certificate of incorporation of the surviving or resulting corporation; (4) the manner of converting the shares of each of the constituent corporations . . . and (5) such other details or provisions as are deemed desirable . . . . The agreement so adopted shall be executed in accordance with section 103 of this title. Any of the terms of the agreement of merger or consolidation may be made dependent upon facts ascertainable outside of such agreement, provided that the manner in which such facts shall operate upon the terms of the agreement is clearly and expressly set forth in the agreement of merger or consolidation. (underlining added for emphasis)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Section 141 (e) provides in pertinent part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA member of the board of directors . . . shall, in the performance of his duties, be fully protected in relying in good faith upon the books of accounts or reports made to the corporation by any of its officers, or by an independent certified public accountant, or by an appraiser selected with reasonable care by the board of directors . . ., or in relying in good faith upon other records of the corporation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. In support of the defendants' argument that their judgment as to the adequacy of $55 per share was an informed one, the directors rely on the BCG study and the Five Year Forecast. However, no one even referred to either of these studies at the September 20 meeting; and it is conceded that these materials do not represent valuation studies. Hence, these documents do not constitute evidence as to whether the directors reached an informed judgment on September 20 that $55 per share was a fair value for sale of the Company.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. We reserve for Discussion under Part III hereof, the defendants' contention that their judgment, reached on September 20, if not then informed became informed by virtue of their \"review\" of the Agreement on October 8 and January 26.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Romans' department study was not made available to the Board until circulation of Trans Union's Supplementary Proxy Statement and the Board's meeting of January 26, 1981, on the eve of the shareholder meeting; and, as has been noted, the study has never been produced for inclusion in the record in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. As of September 20 the directors did not know: that Van Gorkom had arrived at the $55 figure alone, and subjectively, as the figure to be used by Controller Peterson in creating a feasible structure for a leveraged buy-out by a prospective purchaser; that Van Gorkom had not sought advice, information or assistance from either inside or outside Trans Union directors as to the value of the Company as an entity of the fair price per share for 100% of its stock; that Van Gorkom had not consulted with the Company's investment bankers or other financial analysts; that Van Gorkom had not consulted with or confided in any officer or director of the Company except Chelberg; and that Van Gorkom had deliberately chosen to ignore the advice and opinion of the members of his Senior Management group regarding the adequacy of the $55 price.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. For a far more careful and reasoned approach taken by another board of directors faced with the pressures of a hostile tender offer, see Pogostin v. Rice, (supra) at 623-627.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Trans Union's five \"inside\" directors had backgrounds in law and accounting, 116 years of collective employment by the Company and 68 years of combined experience on its Board. Trans Union's five \"outside\" directors included four chief executives of major corporations and an economist who was a former dean of a major school of business and chancellor of a university. The \"outside\" directors had 78 years of combined experience as chief executive officers of major corporations and 50 years of cumulative experience as directors of Trans Union. Thus, defendants argue that the Board was eminently qualified to reach an informed judgment on the proposed \"sale\" of Trans Union notwithstanding their lack of any advance notice of the proposal, the shortness of their deliberation, and their determination not to consult with their investment banker or to obtain a fairness opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Nonetheless, we are satisfied that in an appropriate factual context a proper exercise of business judgment may include, as one of its aspects, reasonable reliance upon the advice of counsel. This is wholly outside the statutory protections of 8 Del.C. § 141 (e) involving reliance upon reports of officers, certain experts and books and records of the company.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. As will be seen, we do not reach the second question.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. As previously noted, the Board mistakenly thought that it had amended the September 20 draft agreement to include a market test.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA secondary purpose of the October 8 meeting was to obtain the Board's approval for Trans Union to employ its investment advisor, Salomon Brothers, for the limited purpose of assisting Management in the solicitation of other offers. Neither Management nor the Board then or thereafter requested Salmon Brothers to submit its opinion as to the fairness of Pritzker's $55 cash-out merger proposal or to value Trans Union as an entity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThere is no evidence of record that the October 8 meeting had any other purpose; and we also note that the Minutes of the October 8 Board meeting, including any notice of the meeting, are not part of the voluminous records of this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. We do not suggest that a board must read in haec verba every contract or legal document which it approves, but if it is to successfully absolve itself from charges of the type made here, there must be some credible contemporary evidence demonstrating that the directors knew what they were doing, and ensured that their purported action was given effect. That is the consistent failure which cast this Board upon its unredeemable course.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. There is no evidence of record that Trans Union's directors ever raised any objections, procedural or substantive, to the October 10 amendments or that any of them, including Van Gorkom, understood the opposite result of their intended effect -- until it was too late.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. This was inconsistent with Van Gorkom's espousal of the September 22 press release following Trans Union's acceptance of Pritzker's proposal. Van Gorkom had then justified a press release as encouraging rather than chilling later offers.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. The defendants concede that Muschel is only illustrative of the proposition that a board may reconsider a prior decision and that it is otherwise factually distinguishable from this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. This was the meeting which, under the terms of the September 20 Agreement with Pritzker, was scheduled to be held January 10 and was later postponed to February 10 under the October 8-10 amendments. We refer to the document titled \"Amendment to Supplemental Agreement\" executed by the parties \"as of\" October 10, 1980. Under new Section 2.03 (a) of Article A VI of the \"Supplemental Agreement,\" the parties agreed, in part, as follows:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The solicitation of such offers or proposals [i.e., 'other offers that Trans Union might accept in lieu of the Merger Agreement'] by TU . . . shall not be deemed to constitute a breach of this Supplemental Agreement or the Merger Agreement provided that . . . [Trans Union] shall not (1) delay promptly seeking all consents and approvals required hereunder . . . shall be deemed [in compliance] if it files its Preliminary Proxy Statement by December 5, 1980, uses its best efforts to mail its Proxy Statement by January 5, 1981 and holds a special meeting of its Stockholders on or prior to February 10, 1981 . . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIt is the present intention of the Board of Directors of TU to recommend the approval of the Merger Agreement to the Stockholders, unless another offer or proposal is made which in their opinion is more favorable to the Stockholders than the Merger Agreement.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. With regard to the Pritzker merger, the recently filed shareholders' suit to enjoin it, and relevant portions of the impending stockholder meeting of February 10, we set forth the Minutes in their entirety:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Board then reviewed the necessity of issuing a Supplement to the Proxy Statement mailed to stockholders on January 21, 1981, for the special meeting of stockholders scheduled to be held on February 10, 1981, to vote on the proposed $55 cash merger with a subsidiary of GE Corporation. Among other things, the Board noted that subsequent to the printing of the Proxy Statement mailed to stockholders on January 21, 1981, General Electric Company had indicated that it would not be making an offer to acquire the Company. In addition, certain facts had been adduced in connection with pretrial discovery taken in connection with the lawsuit filed by Alden Smith in Delaware Chancery Court. After further Discussion and review of a printer's proof copy of a proposed Supplement to the Proxy Statement which had been distributed to Directors the preceding day, upon motion duly made and seconded, the following resolution was unanimously adopted, each Director having been individually polled with respect thereto:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eRESOLVED, that the Secretary of the Company be and he hereby is authorized and directed to mail to the stockholders a Supplement to Proxy Statement, substantially in the form of the proposed Supplement to Proxy Statement submitted to the Board at this meeting, with such changes therein and modifications thereof as he shall, with the advice and assistance of counsel, approve as being necessary, desirable, or appropriate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Board then reviewed and discussed at great length the entire sequence of events pertaining to the proposed $55 cash merger with a subsidiary of GE Corporation, beginning with the first Discussion on September 13, 1980, between the Chairman and Mr. Jay Pritzker relative to a possible merger. Each of the Directors was involved in this Discussion as well as counsel who had earlier joined the meeting. Following this review and Discussion, such counsel advised the Directors that in light of their Discussions, they could (a) continue to recommend to the stockholders that the latter vote in favor of the proposed merger, (b) recommend that the stockholders vote against the merger, or (c) take no position with respect to recommending the proposed merger and simply leave the decision to stockholders. After further Discussion, it was moved, seconded, and unanimously voted that the Board of Directors continue to recommend that the stockholders vote in favor of the proposed merger, each Director being individually polled with respect to his vote.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. In particular, the defendants rely on the testimony of director Johnson on direct examination:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. Was there a regular meeting of the board of Trans Union on January 26, 1981?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. Yes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. And what was discussed at that meeting?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. Everything relevant to this transaction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eYou see, since the proxy statement of the 19th had been mailed, see, General Electric had advised that they weren't going to make a bid. It was concluded to suggest that the shareholders be advised of that, and that required a supplemental proxy statement, and that required authorization of the board, and that led to a total review from beginning to end of every aspect of the whole transaction and all relevant developments.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSince that was occurring and a supplemental statement was going to the shareholders, it also was obvious to me that there should be a review of the board's position again in the light of the whole record. And we went back from the beginning. Everything was examined and reviewed. Counsel were present. And the board was advised that we could recommend the Pritzker deal, we could submit it to the shareholders with no recommendation, or we could recommend against it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe board voted to issue the supplemental statement to the shareholders. It voted unanimously -- and this time we had a unanimous board, where one man was missing before -- to recommend the Pritzker deal. Indeed, at that point there was no other deal. And, in truth, there never had been any other deal. And that's what transpired: a total review of the GE situation, KKR and everything else that was relevant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. To the extent the Trial Court's ultimate Conclusion to invoke the business judgment rule is based on other explicit criteria and supporting evidence (i.e., market value of Trans Union's stock, the business acumen of the Board members, the substantial premium over market and the availability of the market test to confirm the adequacy of the premium), we have previously discussed the insufficiency of such evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The pertinent provisions of 8 Del.C. § 251 (c) provide:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(c) The agreement required by subsection (b) shall be submitted to the stockholders of each constituent corporation at an annual or special meeting thereof for the purpose of acting on the agreement. Due notice of the time, place and purpose of the meeting shall be mailed to each holder of stock, whether voting or non-voting, of the corporation at his address as it appears on the records of the corporation, at least 20 days prior to the date of the meeting. . . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 Shortly after the announcement of the proposed merger in September senior members of Trans Union's management got in touch with KKR to discuss their possible participation in a leverage buyout scheme. On December 2, 1980 KKR through Henry Kravis actually made a bid of $60.00 per share for Trans Union stock on December 2, 1980 but the offer was withdrawn three hours after it was made because of complications arising out of negotiations with the Reichman family, extremely wealthy Canadians and a change of attitude toward the leveraged buyout scheme, by Jack Kruzenga, the member of senior management of Trans Union who most likely would have been President and Chief Operating Officer of the new company. Kruzenga was the President and Chief Operating Officer of the seven subsidiaries of Trans Union which constituted the backbone of Trans Union as shown through exhaustive studies and analysis of Trans Union's intrinsic value on the market place by the respected investment banking firm of Morgan Stanley. It is interesting to note that at no time during the market test period did any of the 150 corporations contacted by Salomon Brothers complain of the time frame or availability of corporate records in order to make an independent judgment of market value of 100% of Trans Union.\u003c/span\u003e\n\n",
    "body_length": 144320,
    "citedas": [
      "488 A.2d 858"
    ],
    "attorneys": "William Prickett (argued) and James P. Dalle Pazze, of Prickett, Jones, Elliott, Kristol \u0026 Schnee, Wilmington, and Ivan Irwin, Jr. and Brett A. Ringle, of Shank, Irwin, Conant \u0026 Williamson, of Dallas, Texas, of counsel, for plaintiffs below, appellants. Robert K. Payson (argued) and Peter M. Sieglaff of Potter, Anderson \u0026 Corroon, Wilmington, for individual defendants below, appellees. Lewis S. Black, Jr., A. Gilchrist Sparks, III (argued) and Richard D. Allen, of Morris, Nichols, Arsht \u0026 Tunnell, Wilmington, for Trans Union Corporation, Marmon Group, Inc., GL Corporation and New T. Co., defendants below, appellees.",
    "category": [
      "124",
      "252"
    ],
    "judges": "Horsey, Justice (for the majority). Herrmann, C.j., and McNeilly, Moore and Christie, JJ., constituting the Court En Banc.",
    "citation_count": 0
  }
}
