{
  "id": "04C9PWYBTlTomsSBwLTt",
  "document": {
    "title": "Register.com",
    "full_title": "REGISTER.COM, INC. v. VERIO, INC. .",
    "jurisdiction": "Second Circuit",
    "date": "2004-01-23T00:00:00.000Z",
    "docket": "Docket No. 00-9596",
    "body": "Argued: January 21, 2001\n\nDefendant, Verio, Inc. (\"Verio\") appeals from an order of the United States District Court for the Southern District of New York (Barbara S. Jones, J.) granting the motion of plaintiff Register.com, Inc. (\"Register\") for a preliminary injunction. The court's order enjoined Verio from (1) using Register's trademarks; (2) representing or otherwise suggesting to third parties that Verio's services have the sponsorship, endorsement, or approval of Register; (3) accessing Register's computers by use of automated software programs performing multiple successive queries; and (4) using data obtained from Register's database of contact information of registrants of Internet domain names to solicit the registrants for the sale of web site development services by electronic mail, telephone calls, or direct mail. We affirm.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nBACKGROUND\n\nThis plaintiff Register is one of over fifty companies serving as registrars for the issuance of domain names on the world wide web. As a registrar, Register issues domain names to persons and entities preparing to establish web sites on the Internet. Web sites are identified and accessed by reference to their domain names.\n\nRegister was appointed a registrar of domain names by the Internet Corporation for Assigned Names and Numbers, known by the acronym \"ICANN.\" ICANN is a private, non-profit public benefit corporation which was established by agencies of the U.S. government to administer the Internet domain name system. To become a registrar of domain names, Register was required to enter into a standard form agreement with ICANN, designated as the ICANN Registrar Accreditation Agreement, November 1999 version (referred to herein as the \"ICANN Agreement\").\n\nApplicants to register a domain name submit to the registrar contact information, including at a minimum, the applicant's name, postal address, telephone number, and electronic mail address. The ICANN Agreement, referring to this registrant contact information under the rubric \"WHOIS information,\" requires the registrar, under terms discussed in greater detail below, to preserve it, update it daily, and provide for free public access to it through the Internet as well as through an independent access port, called port 43. See ICANN Agreement § II.F.1. Section II.F.5 of the ICANN Agreement (which furnishes a major basis for the appellant Verio's contentions on this appeal) requires that the registrar \"not impose terms and conditions\" on the use made by others of its WHOIS data \"except as permitted by ICANN-adopted policy.\"\n\nIn specifying what restrictions may be imposed, the ICANN Agreement requires the registrar to permit use of its WHOIS data \"for any lawful purposes except to: . . . support the transmission of mass unsolicited, commercial advertising or solicitations via email (spam); [and other listed purposes not relevant to this appeal].\" (emphasis added).\n\nAnother section of the ICANN Agreement (upon which appellee Register relies) provides as follows,\n\nNo Third-Party Beneficiaries: This Agreement shall not be construed to create any obligation by either ICANN or Registrar to any non-party to this Agreement . . . .\n\nICANN Agreement § II.S.2. Third parties could nonetheless seek enforcement of a registrar's obligations set forth in the ICANN Agreement by resort to a grievance process under ICANN's auspices.\n\nIn compliance with § II.F.1 of the ICANN Agreement, Register updated the WHOIS information on a daily basis and established Internet and port 43 service, which allowed free public query of its WHOIS information. An entity making a WHOIS query through Register's Internet site or port 43 would receive a reply furnishing the requested WHOIS information, captioned by a legend devised by Register, which stated,\n\nBy submitting a WHOIS query, you agree that you will use this data only for lawful purposes and that under no circumstances will you use this data to . . . support the transmission of mass unsolicited, commercial advertising or solicitation via email.\n\nThe terms of that legend tracked § II.F.5 of the ICANN Agreement in specifying the restrictions Register imposed on the use of its WHOIS data. Subsequently, as explained below, Register amended the terms of this legend to impose more stringent restrictions on the use of the information gathered through such queries.\n\nIn addition to performing the function of a registrar of domain names, Register also engages in the business of selling web-related services to entities that maintain web sites. These services cover various aspects of web site development. In order to solicit business for the services it offers, Register sends out marketing communications. Among the entities it solicits for the sale of such services are entities whose domain names it registered. However, during the registration process, Register offers registrants the opportunity to elect whether or not they will receive marketing communications from it.\n\nThe defendant Verio, against whom the preliminary injunction was issued, is engaged in the business of selling a variety of web site design, development and operation services. In the sale of such services, Verio competes with Register's web site development business. To facilitate its pursuit of customers, Verio undertook to obtain daily updates of the WHOIS information relating to newly registered domain names. To achieve this, Verio devised an automated software program, or robot, which each day would submit multiple successive WHOIS queries through the port 43 accesses of various registrars. Upon acquiring the WHOIS information of new registrants, Verio would send them marketing solicitations by email, telemarketing and direct mail. To the extent that Verio's solicitations were sent by email, the practice was inconsistent with the terms of the restrictive legend Register attached to its responses to Verio's queries.\n\nAt first, Verio's solicitations addressed to Register's registrants made explicit reference to their recent registration through Register. This led some of the recipients of Verio's solicitations to believe the solicitation was initiated by Register (or an affiliate), and was sent in violation of the registrant's election not to receive solicitations from Register. Register began to receive complaints from registrants. Register in turn complained to Verio and demanded that Verio cease and desist from this form of marketing. Register asserted that Verio was harming Register's goodwill, and that by soliciting via email, was violating the terms to which it had agreed on submitting its queries for WHOIS information. Verio responded to the effect that it had stopped mentioning Register in its solicitation message.\n\nIn the meantime, Register changed the restrictive legend it attached to its responses to WHOIS queries. While previously the legend conformed to the terms of § II F.5, which authorized Register to prohibit use of the WHOIS information for mass solicitations \"via email,\" its new legend undertook to bar mass solicitation \"via direct mail, electronic mail, or by telephone.\"\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Section II.F.5 of Register's ICANN Agreement, as noted above, required Register to permit use of the WHOIS data \"for any lawful purpose except to . . . support the transmission of mass unsolicited solicitations via email (spam). Thus, by undertaking to prohibit Verio from using the WHOIS information for solicitations \"via direct mail . . . or by telephone,\" Register was acting in apparent violation of this term of its ICANN Agreement.\n\nRegister wrote to Verio demanding that it cease using WHOIS information derived from Register not only for email marketing, but also for marketing by direct mail and telephone. Verio ceased using the information in email marketing, but refused to stop marketing by direct mail and telephone.\n\nRegister brought this suit on August 3, 2000, and moved for a temporary restraining order and a preliminary injunction. Regsiter asserted, among other claims, that Verio was (a) causing confusion among customers, who were led to believe Verio was affiliated with Register; (b) accessing Register's computers without authorization, a violation of the Computer Fraud and Abuse Act, 18 U.S.C. § 1030; and, (c) trespassing on Register's chattels in a manner likely to harm Register's computer systems by the use of Verio's automated robot software programs. On December 8, 2000, the district court entered a preliminary injunction. The injunction barred Verio from the following activities:\n\n1. Using or causing to be used the \"Register.com\" mark or the \"first step on the web\" mark or any other designation similar thereto, on or in connection with the advertising, marketing, or promotion of Verio and/or any of Verio's services; 2. Representing, or committing any act which is calculated to or is likely to cause third parties to believe that Verio and/or Verio's services are sponsored by, or have the endorsement or approval of Register.com;\n\n3. Accessing Register.com's computers and computer networks in any manner, including, but not limited to, by software programs performing multiple, automated, successive queries, provided that nothing in this Order shall prohibit Verio from accessing Register.com's WHOIS database in accordance with the terms and conditions thereof; and\n\n4. Using any data currently in Verio's possession, custody or control, that using its best efforts, Verio can identify as having been obtained from Register.com's computers and computer networks to enable the transmission of unsolicited commercial electronic mail, telephone calls, or direct mail to the individuals listed in said data, provided that nothing in this Order shall prohibit Verio from (i) communicating with any of its existing customers, (ii) responding to communications received from any Register.com customer initially contacted before August 4, 2000, or (iii) communicating with any Register.com customer whose contact information is obtained by Verio from any source other than Register.com's computers and computer networks.\n\nRegister.com, Inc. v. Verio, Inc., 126 F. Supp. 2d 238, 255 (S.D.N.Y. 2000). Verio appeals from that order.\n\nDISCUSSION\n\nStandard of review and preliminary injunction standard\n\nA grant of a preliminary injunction is reviewed on appeal for abuse of discretion, see SEC v. Cavanagh, 155 F.3d 129, 132 (2d Cir. 1998), which will be found if the district court \"applies legal standards incorrectly or relies upon clearly erroneous findings of fact,\" id., or \"proceed[s] on the basis of an erroneous view of the applicable law,\" Donovan v. Bierwirth, 680 F.2d 263, 269 (2d Cir. 1982).\n\nVerio advances a plethora of arguments why the preliminary injunction should be vacated. We find them to be without merit. We address the most substantial of Verio's arguments.\n\n(a) Verio's enforcement of the restrictions placed on Register by the ICANN Agreement\n\nVerio conceded that it knew of the restrictions Register placed on the use of the WHOIS data and knew that, by using Register's WHOIS data for direct mail and telemarketing solicitations, it was violating Register's restrictions. Verio's principal argument is that Register was not authorized to forbid Verio from using the data for direct mail and telemarketing solicitation because the ICANN Agreement prohibited Register from imposing any \"terms and conditions\" on use of WHOIS data, \"except as permitted by ICANN-adopted policy,\" which specified that Register was required to permit \"any lawful purpose, except . . . mass solicitation[] via email.\"\n\nRegister does not deny that the restrictions it imposed contravened this requirement of the ICANN Agreement. Register contends, however, that the question whether it violated § II.F.5 of its Agreement with ICANN is a matter between itself and ICANN, and that Verio cannot enforce the obligations placed on Register by the ICANN Agreement. Register points to § II.S.2 of the ICANN Agreement, captioned \"No Third-Party Beneficiaries,\" which, as noted, states that the agreement is not to be construed \"to create any obligation by either ICANN or Registrar to any non-party.\" Register asserts that Verio, a non-party, is asking the court to construe § II.F.5 as creating an obligation owed by Register to Verio, and that the Agreement expressly forbids such a construction.\n\nICANN intervened in the district court as an amicus curiae and strongly supports Register's position, opposing Verio's right to invoke Register's contractual promises to ICANN. ICANN explained that ICANN has established a remedial process for the resolution of such disputes through which Verio might have sought satisfaction. \"If Verio had concerns regarding Register.com's conditions for access to WHOIS data, it should have raised them within the ICANN process rather [than] simply taking Register.com's data, violating the conditions [imposed by Register], and then seeking to justify its violation in this Court . . . . [Verio's claim was] intended to be addressed only within the ICANN process.\"\n\nICANN asserted that the No Third-Party Beneficiary provision, barring third parties from seeking to enforce promises made by a registrar to ICANN through court proceedings, was \"vital to the overall scheme of [its] various agreements.\"\n\nThis is because proper expression of the letter and spirit of ICANN policies is most appropriately achieved through the ICANN process itself, and not through forums that lack the every day familiarity with the intricate technical and policy issues that the ICANN process was designed to address.\n\nICANN's brief went on to state:\n\n[E]nforcement of agreements with ICANN [was to] be informed by the judgment of the various segments of the internet community as expressed through ICANN. In the fast-paced environment of the Internet, new issues and situations arise quickly, and sometimes the language of contractual provisions does not perfectly match the underlying policies. For this and other reasons, hard-and-fast enforcement [by courts] of the letter of every term of every agreement is not always appropriate. An integral part of the agreements that the registrars . . . entered with ICANN is the understanding that these situations would be handled through consultation and consideration within the ICANN process . . . . Allowing issues under the agreements registrars make with ICANN to be diverted from [ICANN's] carefully crafted remedial scheme to the courts, at the behest of third parties . . . , would seriously threaten the Internet community's ability, under the auspices of ICANN, to achieve a proper balance of the competing policy values that are so frequently involved.\n\nWe are persuaded by the arguments Register and ICANN advance. It is true Register incurred a contractual obligation to ICANN not to prevent the use of its WHOIS data for direct mail and telemarketing solicitation. But ICANN deliberately included in the same contract that persons aggrieved by Register's violation of such a term should seek satisfaction within the framework of ICANN's grievance policy, and should not be heard in courts of law to plead entitlement to enforce Register's promise to ICANN. As experience develops in the fast changing world of the Internet, ICANN, informed by the various constituencies in the Internet community, might well no longer consider it salutary to enforce a policy which it earlier expressed in the ICANN Agreement. For courts to undertake to enforce promises made by registrars to ICANN at the instance of third parties might therefore be harmful to ICANN's efforts to develop well-informed and sound Internet policy.\n\nVerio's invocation of the ICANN Agreement necessarily depends on its entitlement to enforce Register's promises to ICANN in the role of third party beneficiary. The ICANN Agreement specified that it should be deemed to have been made in California, where ICANN is located. Under § 1559 of the California Civil Code, a \"contract, made expressly for the benefit of a third person, may be enforced by him.\" Cal. Civ. Code § 1559. For Verio to seek to enforce Register's promises it made to ICANN in the ICANN Agreement, Verio must show that the Agreement was made for its benefit. See Am. Home Ins. Co. v. Travelers Indemnity Co., 175 Cal. Rptr. 826, 834 (Cal. App. 1981). Verio did not meet this burden. To the contrary, the Agreement expressly and intentionally excluded non-parties from claiming rights under it in court proceedings.\n\nWe are not persuaded by the arguments Judge Parker advanced in his draft. Although acknowledging that Verio could not claim third party beneficiary rights to enforce Register's promises to ICANN, Judge Parker nonetheless found three reasons for enforcing Verio's claim: (i) \"public policy interests at stake,\" (ii) Register's \"indisputable obligations to ICANN as a registrar,\" and (iii) the equities, involving Register's \"unclean hands\" in imposing a restriction it was contractually bound not to impose. We respectfully disagree. As for the first argument, that Register's restriction violated public policy, it is far from clear that this is so.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e It is true that the ICANN Agreement at the time ICANN presented it to Register permitted mass solicitation by means other than email. But it is not clear that at the time of this dispute, ICANN intended to adhere to that policy. As ICANN's amicus brief suggested, the world of the Internet changes rapidly, and public policy as to how that world should be governed may change rapidly as well. ICANN in fact has since changed the terms of its standard agreement for the accreditation of registrars to broaden the uses of WHOIS information that registrars may prohibit to include not only mass email solicitations but also mass telephone and fax solicitations. See ICANN Registrar Accreditation Agreement § 3.3.5 (May 18, 2001). It is far from clear that ICANN continues to view public policy the way it did at the time it crafted Register's agreement. In any event, if Verio wished to have the dispute resolved in accordance with public policy, it was free to bring its grievance to ICANN. Verio declined to do so. ICANN included the \"No Third-Party Beneficiary\" provision precisely so that it would retain control of enforcement of policy, rather than yielding it to courts.\n\nAs for Judge Parker's second argument, Register's \"indisputable obligation to ICANN as a registrar\" to permit Verio to use the WHOIS information for mass solicitation by mail and telephone, we do not see how this argument differs from Verio's claim of entitlement as a third party beneficiary, which § II.S.2 explicitly negates. The fact that Register owed a contractual obligation to ICANN not to impose certain restrictions on use of WHOIS information does not mean that it owed an obligation to Verio not to impose such restrictions. As ICANN's brief in the district court indicates, ICANN was well aware of Register's deviation from the restrictions imposed by the ICANN Agreement, but ICANN chose not to take steps to compel Register to adhere to its contract.\n\nNor are we convinced by Judge Parker's third argument of Register's \"unclean hands.\" Judge Parker characterizes Register's failure to honor its contractual obligation to ICANN as unethical conduct, making Register ineligible for equitable relief. But Register owed no duty in that regard to anyone but ICANN, and ICANN has expressed no dissatisfaction with Register's failure to adhere to that term of the contract. Verio was free to seek ICANN's intervention on its behalf, but declined to do so, perhaps because it knew or suspected that ICANN would decline to compel Register to adhere to the contract term. Under the circumstances, we see no reason to assume on appeal that Register's conduct should be considered unethical, especially where the district court made no such finding.\n\n(b) Verio's assent to Register's contract terms\n\nVerio's next contention assumes that Register was legally authorized to demand that takers of WHOIS data from its systems refrain from using it for mass solicitation by mail and telephone, as well as by email. Verio contends that it nonetheless never became contractually bound to the conditions imposed by Register's restrictive legend because, in the case of each query Verio made, the legend did not appear until after Verio had submitted the query and received the WHOIS data. Accordingly, Verio contends that in no instance did it receive legally enforceable notice of the conditions Register intended to impose. Verio therefore argues it should not be deemed to have taken WHOIS data from Register's systems subject to Register's conditions.\n\nVerio's argument might well be persuasive if its queries addressed to Register's computers had been sporadic and infrequent. If Verio had submitted only one query, or even if it had submitted only a few sporadic queries, that would give considerable force to its contention that it obtained the WHOIS data without being conscious that Register intended to impose conditions, and without being deemed to have accepted Register's conditions. But Verio was daily submitting numerous queries, each of which resulted in its receiving notice of the terms Register exacted. Furthermore, Verio admits that it knew perfectly well what terms Register demanded. Verio's argument fails.\n\nThe situation might be compared to one in which plaintiff P maintains a roadside fruit stand displaying bins of apples. A visitor, defendant D, takes an apple and bites into it. As D turns to leave, D sees a sign, visible only as one turns to exit, which says \"Apples - 50 cents apiece.\" D does not pay for the apple. D believes he has no obligation to pay because he had no notice when he bit into the apple that 50 cents was expected in return. D's view is that he never agreed to pay for the apple. Thereafter, each day, several times a day, D revisits the stand, takes an apple, and eats it. D never leaves money.\n\nP sues D in contract for the price of the apples taken. D defends on the ground that on no occasion did he see P's price notice until after he had bitten into the apples. D may well prevail as to the first apple taken. D had no reason to understand upon taking it that P was demanding the payment. In our view, however, D cannot continue on a daily basis to take apples for free, knowing full well that P is offering them only in exchange for 50 cents in compensation, merely because the sign demanding payment is so placed that on each occasion D does not see it until he has bitten into the apple.\n\nVerio's circumstance is effectively the same. Each day Verio repeatedly enters Register's computers and takes that day's new WHOIS data. Each day upon receiving the requested data, Verio receives Register's notice of the terms on which it makes the data available - that the data not be used for mass solicitation via direct mail, email, or telephone. Verio acknowledges that it continued drawing the data from Register's computers with full knowledge that Register offered access subject to these restrictions. Verio is no more free to take Register's data without being bound by the terms on which Register offers it, than D was free, in the example, once he became aware of the terms of P's offer, to take P's apples without obligation to pay the 50 cent price at which P offered them.\n\nVerio seeks support for its position from cases that have dealt with the formation of contracts on the Internet. An excellent example, although decided subsequent to the submission of this case, is Specht v. Netscape Communications Corp., 306 F.3d 17 (2d Cir. 2002). The dispute was whether users of Netscape's software, who downloaded it from Netscape's web site, were bound by an agreement to arbitrate disputes with Netscape, where Netscape had posted the terms of its offer of the software (including the obligation to arbitrate disputes) on the web site from which they downloaded the software. We ruled against Netscape and in favor of the users of its software because the users would not have seen the terms Netscape exacted without scrolling down their computer screens, and there was no reason for them to do so. The evidence did not demonstrate that one who had downloaded Netscape's software had necessarily seen the terms of its offer.\n\nVerio, however, cannot avail itself of the reasoning of Specht. In Specht, the users in whose favor we decided visited Netscape's web site one time to download its software. Netscape's posting of its terms did not compel the conclusion that its downloaders took the software subject to those terms because there was no way to determine that any downloader had seen the terms of the offer. There was no basis for imputing to the downloaders of Netscape's software knowledge of the terms on which the software was offered. This case is crucially different. Verio visited Register's computers daily to access WHOIS data and each day saw the terms of Register's offer; Verio admitted that, in entering Register's computers to get the data, it was fully aware of the terms on which Register offered the access.\n\nVerio's next argument is that it was not bound by Register's terms because it rejected them. Even assuming Register is entitled to demand compliance with its terms in exchange for Verio's entry into its systems to take WHOIS data, and even acknowledging that Verio was fully aware of Register's terms, Verio contends that it still is not bound by Register's terms because it did not agree to be bound. In support of its claim, Verio cites a district court case from the Central District of California, Ticketmaster Corp. v. Tickets.com, Inc., No. CV99-7654, 2000 WL 1887522 (C.D. Cal. Aug. 10, 2000), in which the court rejected Ticketmaster's application for a preliminary injunction to enforce posted terms of use of data available on its website against a regular user. Noting that the user of Ticketmaster's web site is not required to check an \"I agree\" box before proceeding, the court concluded that there was insufficient proof of agreement to support a preliminary injunction. Id. at *5.\n\nWe acknowledge that the Ticketmaster decision gives Verio some support, but not enough. In the first place, the Ticketmaster court was not making a definitive ruling rejecting Ticketmaster's contract claim. It was rather exercising a district court's discretion to deny a preliminary injunction because of a doubt whether the movant had adequately shown likelihood of success on the merits.\n\nBut more importantly, we are not inclined to agree with the Ticketmaster court's analysis. There is a crucial difference between the circumstances of Specht, where we declined to enforce Netscape's specified terms against a user of its software because of inadequate evidence that the user had seen the terms when downloading the software, and those of Ticketmaster, where the taker of information from Ticketmaster's site knew full well the terms on which the information was offered but was not offered an icon marked, \"I agree,\" on which to click. Under the circumstances of Ticketmaster, we see no reason why the enforceability of the offeror's terms should depend on whether the taker states (or clicks), \"I agree.\"\n\nWe recognize that contract offers on the Internet often require the offeree to click on an \"I agree\" icon. And no doubt, in many circumstances, such a statement of agreement by the offeree is essential to the formation of a contract. But not in all circumstances. While new commerce on the Internet has exposed courts to many new situations, it has not fundamentally changed the principles of contract. It is standard contract doctrine that when a benefit is offered subject to stated conditions, and the offeree makes a decision to take the benefit with knowledge of the terms of the offer, the taking constitutes an acceptance of the terms, which accordingly become binding on the offeree. See, e.g., Restatement (Second) of Contracts § 69 (1)(a) (1981) (\"[S]ilence and inaction operate as an acceptance . . . [w]here an offeree takes the benefit of offered services with reasonable opportunity to reject them and reason to know that they were offered with the expectation of compensation.\"); 2 Richard A. Lord, Williston on Contracts § 6:9 (4th ed. 1991) (\"[T]he acceptance of the benefit of services may well be held to imply a promise to pay for them if at the time of acceptance the offeree has a reasonable opportunity to reject the service and knows or has reason to know that compensation is expected.\"); Arthur Linton Corbin, Corbin on Contracts § 71 (West 1 vol. ed. 1952) (\"The acceptance of the benefit of the services is a promise to pay for them, if at the time of accepting the benefit the offeree has a reasonable opportunity to reject it and knows that compensation is expected.\"); Jones v. Brisbin, 41 Wash. 2d 167, 172 (1952) (\"Where a person, with reasonable opportunity to reject offered services, takes the benefit of them under circumstances which would indicate, to a reasonable man, that they were offered with the expectation of compensation, a contract, complete with mutual assent, results.\"); Markstein Bros. Millinery Co. v. J.A. White \u0026 Co., 151 Ark. 1 (1921) (buyer of hats was bound to pay for hats when buyer failed to return them to seller within five days of inspection as seller requested in clear and obvious notice statement).\n\nReturning to the apple stand, the visitor, who sees apples offered for 50 cents apiece and takes an apple, owes 50 cents, regardless whether he did or did not say, \"I agree.\" The choice offered in such circumstances is to take the apple on the known terms of the offer or not to take the apple. As we see it, the defendant in Ticketmaster and Verio in this case had a similar choice. Each was offered access to information subject to terms of which they were well aware. Their choice was either to accept the offer of contract, taking the information subject to the terms of the offer, or, if the terms were not acceptable, to decline to take the benefits.\n\nWe find that the district court was within its discretion in concluding that Register showed likelihood of success on the merits of its contract claim.\n\n(c) Irreparable harm\n\nVerio contends that an injunction is not appropriate to enforce the terms of a contract. It is true that specific relief is not the conventional remedy for breach of contract, but there is certainly no ironclad rule against its use. Specific relief may be awarded in certain circumstances.\n\nIf an injury can be appropriately compensated by an award of monetary damages, then an adequate remedy at law exists, and no irreparable injury may be found to justify specific relief. Borey v. Nat'l Union Fire Ins. Co., 934 F.2d 30, 34 (2d Cir. 1991). But, irreparable harm may be found where damages are difficult to establish and measure. Ticor Title Ins. Co. v. Cohen, 173 F.3d 63, 69 (2d Cir. 1999). We have found, for example, that injunctive relief is appropriate where it would be \"very difficult to calculate monetary damages that would successfully redress the loss of a relationship with a client that would produce an indeterminate amount of business in years to come.\" Id. at 69.\n\nThe district court found it impossible to estimate \"with any precision the amount of the monetary loss which has resulted and which would result in the future from the loss of Register.com's relationships with customers and co-brand partners,\" by reason of Verio's actions. Register.com, 126 F. Supp. 2d at 248. In our view, the district court did not abuse its discretion in finding that, unless specific relief were granted, Verio's actions would cause Register irreparable harm through loss of reputation, good will, and business opportunities.\n\n(d) Trespass to chattels\n\nVerio also attacks the grant of the preliminary injunction against its accessing Register's computers by automated software programs performing multiple successive queries. This prong of the injunction was premised on Register's claim of trespass to chattels. Verio contends the ruling was in error because Register failed to establish that Verio's conduct resulted in harm to Register's servers and because Verio's robot access to the WHOIS database through Register was \"not unauthorized.\" We believe the district court's findings were within the range of its permissible discretion.\n\n\"A trespass to a chattel may be committed by intentionally . . . using or intermeddling with a chattel in the possession of another,\" Restatement (Second) of Torts § 217(b) (1965), where \"the chattel is impaired as to its condition, quality, or value,\" id. § 218(b); see also City of Amsterdam v. Goldreyer Ltd., 882 F. Supp. 1273, 1281 (E.D.N.Y. 1995) (citing the Restatement definition as New York law).\n\nThe district court found that Verio's use of search robots, consisting of software programs performing multiple automated successive queries, consumed a significant portion of the capacity of Register's computer systems. While Verio's robots alone would not incapacitate Register's systems, the court found that if Verio were permitted to continue to access Register's computers through such robots, it was \"highly probable\" that other Internet service providers would devise similar programs to access Register's data, and that the system would be overtaxed and would crash. We cannot say these findings were unreasonable.\n\nNor is there merit to Verio's contention that it cannot be engaged in trespass when Register had never instructed it not to use its robot programs. As the district court noted, Register's complaint sufficiently advised Verio that its use of robots was not authorized and, according to Register's contentions, would cause harm to Register's systems.\n\n(e) Lanham Act\n\nOn Register's claim for trademark infringement and unfair competition under the Lanham Act, the district court enjoined Verio from using Register's marks, including \"Register.com\" and \"first step on the web,\" as well as from committing acts \"calculated to or . . . likely to cause third parties to believe that Verio\" is sponsored, endorsed or approved by Register. By letter submitted after oral argument, Register agreed to the deletion of the prohibition concerning use of \"first step on the web.\" See Letter from William Patry, Counsel for Register, to the U.S. Court of Appeals for the Second Circuit (May 22, 2001). We accordingly direct the district court to modify the preliminary injunction by deleting the prohibition of use of \"first step on the web.\"\n\nVerio contends there was no adequate basis for the portion of the injunction based on the Lanham Act. We disagree. In our view, the injunction was within the scope of the court's permitted discretion.\n\nThe district court found two bases for the injunction. The first was that in its early calls to recent registrants to solicit the sale of web site development services, Verio explicitly referred to the registrant's registration with Register. The evidence showed that a number of registrants believed the caller was affiliated with Register. The evidence further showed that Verio's marketers, calling registrants almost immediately following their registration, left messages saying they were calling \"regarding your recently registered domain name,\" and asked to be called back. Register.com, 126 F. Supp. 2d at 254. The district court found that the script was misleading. It noted that Verio in fact was not calling \"regarding the recently registered domain name,\" but was rather calling regarding the registrant's establishment of a web site for which Verio wanted to offer services. Evidence presented to the district court showed that registrants who received such calls were prompted to call back immediately because the message led them to believe the call indicated some problem with Register's registration of the domain name, and that they assumed from the nature of the message that the entity calling was affiliated with Register.\n\nWe believe Register has shown an adequate basis to support the district court's exercise of discretion in issuing the injunction. Verio's use of Register's name alone was sufficient basis for the injunction. Notwithstanding that Verio had agreed, prior to the initiation of the suit, to cease using Register's name, Verio had previously used Register's mark in its solicitation calls. The fact that it had agreed to cease doing so was a factor that might have led the court to decline to issue the injunction, but it did not prevent the court from considering Verio's previous infringing behavior as a justification for the injunction.\n\nThe district court was also within its discretion in concluding that Verio's script for the solicitation calls was misleading. Verio's calls, while prompted by the recent registration of the domain name, were not \"regarding your recently registered domain name.\" Verio's interest was not in the domain name but in the opportunity to offer web services to the owner of a new site. The district court was within its discretion in finding that the reference to the recently registered domain name misleadingly induced registrants to call back, believing the registration of their domain name had encountered a problem, and that the calling party was affiliated with the registration. Verio could easily change the text of its message so as to avoid the misleading implication, without detriment to its legitimate efforts to solicit business. We conclude that there was adequate basis for the issuance of the injunction.\n\nNor does the mere fact that Verio's representatives identified themselves as \"calling from Verio\" preclude a finding of misleading practice. The statement that the solicitor was \"calling from Verio\" did not prevent customers from assuming that Verio was connected with the registrar of their domain names. Compare Arrow Fastener Co. v. Stanley Works, 59 F.3d 384, 395 (2d Cir. 1995) (presentation of a mark in conjunction with a house mark may lessen the likelihood of confusion); W.W.W. Pharmaceutical Co., v. Gillette Co., 984 F.2d 567, 573 (2d Cir. 1992) (same), limited on other grounds by Deere \u0026 Co. v. MTD Prods., Inc., 41 F.3d 39, 46 (2d Cir. 1994); McGregor-Doniger, Inc. v. Drizzle Inc., 599 F.2d 1126, 1133-34 (2d Cir. 1979) (same), superseded by rule on other grounds as stated in Bristol-Myers Squibb, Co. v. McNeil-P.P.C., Inc., 973 F.2d 1033 (2d Cir. 1999), with A.T. Cross Co. v. Jonathan Bradley Pens, Inc., 470 F.2d 689, 692 (2d Cir. 1972) (citing Menendez v. Holt, 128 U.S. 514, 521 (1888)) (the addition of a house mark or trade name may aggravate the likelihood of confusion if \"a purchaser could well think [one party] had licensed [the other] as a second user\").\n\nWe reject Verio's contention that the district court had no adequate basis for the Lanham Act injunction.\n\n(f) Other claims\n\nThe rulings outlined above justify the affirmance of the preliminary injunction, without need to discuss the other contentions raised.\n\nCONCLUSION\n\nThe ruling of the district court is hereby AFFIRMED, with the exception that the court is directed to delete the reference to \"first step on the web\" from paragraph one of its order.\n\nAPPENDIX\n\nDraft Opinion of Judge Fred I. Parker\n\nF.I. PARKE R, Circuit Judge:\n\nDefendant-Appellant, Verio, Inc. (\"Verio\") appeals from the December 11, 2000 order of the United States District Court for the Southern District of New York (B arbara S. Jo nes, Judge) granting the motion of Plaintiff-21 Appellee Register.com, Inc. (\"Register.com\") for a preliminary injunction enjoining Verio from (1) using Register.com's trademarks; (2) representing or otherwise suggesting to third parties that Verio's services have the sponsorship, endorsement, or approval of Register.com; (3) accessing Register.com's computers in any manner, except in compliance with Register.com's terms and cond itions; and (4) using data obtained from Register.com's database for marketing activities. In its complaint, Register.com alleged Lanham Act violations, Computer Fraud and Abuse Act (\"CFAA\") violations, and unfair competition in violation of New York statutory law, along with trespass to chattels, breach of contract, tortious interference with contract, and tortious interference with potential business relations in violation of New York common law. After extensive briefing, including an amicus brief from the Internet Corporation for Assigned Names and Numbers (\"ICANN\")\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e , and a hearing on Register.com's motion, the district court concluded that Register.com had demonstrated both a likelihood of success on the merits and the potential for irreparable harm with respect to its breach of contract, CFAA, trespass to chattels, and Lanham Act claims. On appeal, Verio challenges the district court's conclusions regarding each of these claims.\n\nWe affirm the district court on the trespass to chattels claim but find that the district court committed various errors in assessing Register.com's likelihood of success on the merits of its CFAA claim and the propriety of injunctive relief on Register.com's contract claim. With respect to the contract claim, we conclude that (1) Register.com cannot demonstrate the potential for irreparable harm necessary for an injunction, (2) Register.com has not demonstrated a sufficient likelihood of success on the merits because a contract may not have been formed between Verio and Register.com, (3) granting an equitable remedy preventing Verio from using the WHO IS information under these circumstances would be inappropriate, therefore Register.com is not entitled to a preliminary injunction on its contract claim.\n\nWith respect to the CFAA claims, we find it unlikely that Register.com could show that Verio's use of Register.com's computer systems resulted in monetary damages of $5,000 or more as required to maintain a civil action under the CFAA. Finally, with respect to Register.com's trademark claims, we find moot Verio's appeal of the district court's grant of preliminary injunctive relief concerning Verio's use of Register.com's marks because (1) Verio has agreed by letter sent to Register.com not to use the \"register.com\" mark (or any similar mark) and (2) Register.com has agreed by letter submitted to this Court to allow the reference to the \"first on the web\" mark to be stricken from the first paragraph of the preliminary injunction. W e also find that the district court erred in its assessment of Register.com's likelihood of success on the merits of its trademark claim pertaining to Verio's solicitations to Register.com's customers, which did not involve the use of Register.com's marks, because the court failed to identify \"actionable conduct\" on Verio's behalf. Accordingly, we affirm in part, dismiss the appeal in part as moot, and vacate and remand the judgment of the district court.\n\nI. BACKGROUND\n\nThis appeal raises a number of important issues that require us to look carefully at the context within which the dispute between Register.com and Verio has arisen. To briefly explain, the dispute between Register.com and Verio arises from Verio's use of information obtained by Verio by accessing Register.com's database. Register.com is a \"registrar\" of domain names on the Internet. As a registrar, Register.com secures on behalf of end-users (i.e., individuals, corporate entities, etc.) exclusive rights over the use of domain names to designate the \"location\" of end-users' on-line information. Register.com also provides additional services to end-users who have registered a dom ain nam e, such as web site hosting and development. Although the defendant in this case, V erio, is not a registrar, it competes with Register.com in the provision of these additional \"downstream\" services. As a registrar, Register.com has a competitive advantage over non-registrars in marketing these downstream services because it has contact with and obtains information about potential customers as an integral part of the registration process. In order to compete effectively with Register.com, Verio first collects the contact information (\"WH OIS\" information) of the end-users who have registered new domain nam es with Register.com and other registrars, and then markets its services directly to those end-users. Verio utilizes a software program to automate the process of collecting WH OIS information. T his program sends numerous queries to Register.com's W HO IS database on a daily basis.\n\nRegister.com alleges in this suit that Verio's use of WHO IS information gained in these daily electronic explorations of Register.com's database to market Verio's own downstream services violates terms of use that Register.com imposed on the information, giving rise to the host of claims noted above.\n\nThis dispute raises several thorny issues concerning the extent to which an entity such as Register.com may gain a competitive advantage over others by restricting access to and/or use of the information obtained during the registration process. The complexity of the dispute is increased by the nature of WH OIS information and the obligations imposed on Register.com by virtue of its contractual relationship with ICANN .\n\nBasically, W HO IS information is public information that no one owns.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Free public access to WHOIS information serves two important public policies: first, it facilitates the resolution of trademark, cybersquatting, and other domain name-related disputes; and second, it facilitates competition among downstream service providers such as Register.com and Verio.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e ICANN, a quasi-governmental entity created to take over significant responsibilities from the federal government as part of the privatization of the domain name system (\"DNS\"),\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e requires Register.com, like every other registrar, to maintain and provide free public access to its WHOIS database. ICANN also limits the types of restrictions that Register.com, and every other registrar, may place on the use of WHOIS information.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Because of these underlying complexities, we must grapple with the workings of the DNS, its privatization, the creation of ICANN and its role in DNS governance, and the relationships between ICANN, Register.com, and Verio in order to analyze the equitable issues related to the contract claim, as well as the trespass to chattels and CFA A claim s presented to us on appeal. Our treatment of these background issues is limited in purpose to putting this particular dispute between Register.com and Verio in context and is by no means a comprehensive history. Furthermore, we need not and therefore do not reach legal questions related to the propriety of the privatization process or ICA NN 's operations.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\n1. What the domain name system is and how it works\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThe Internet is comprised of numerous interconnected communications and computer networks connecting a wide range of end-users to each other. See Reno v. Am. Civil Liberties Union, 521 U.S. 844, 849 (1997). Every end-user's computer that is connected to the Internet is assigned a unique Internet Protocol number (\"IP add ress\"), such as 123.456.78.90, that identifies its location (i.e., a particular computer-to-network connection) and serves as the routing address for email, pictures, requests to view a web page, and other data sent across the Internet from other end-users.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e This IP address routing system is essential to the basic functionality of the Internet, in a similar fashion as mailing addresses and telephone numbers are essential to the functionality of the postal service and telecommunications system.\n\nA. The Domain Name System (\"DNS\")\n\nA \"domain name\" is an alphanumeric text representation (often a word) that identifies a numerical IP address, thus making it easier to remember. While every end-user's computer connected to the Internet is assigned an IP address, not every IP address has a corresponding domain name. Instead, a domain name is associated with a particular IP address (or group of IP addresses) only when an end-user registers the domain name. The primary purpose of domain names is to \"mak[e] it easier for users to navigate the Internet; the real networking is done through the IP numbers.\" PGM edia, Inc. v. Network Solutions, Inc., 51 F. Supp. 2d 389, 408 (S.D.N.Y . 1999), aff'd sub nom. Name.Space, Inc. v. Network Solutions, Inc., 202 F.3d 573 (2d Cir. 2000). Domain names consist of various segments separated by periods, such that \"[t]he left-to-right string of name components proceeds from the most specific to the most general, that is, the root of the tree, . . . , is on the right.\" Rony \u0026 Rony, The Domain Name Handbook, at 105 (quoting Zaw-Sing Hu \u0026 Jon Postel, The Domain Naming Convention for Internet User Applications, RFC 819 (Aug. 1982), available at http://www.ietf.org/rfc/rfc0819.txt?number=819). The \"Top Level Domain\" (\"TLD\") refers to the final segment of the name (i.e., the \".gov\" in \"www.uscourts.gov\"). There are three letter, general purpose TLDs (\"gTLDs\"), such as \".com,\" \".edu,\" \".gov,\" and \".org,\" as well as two-letter country code TLDs (\"ccTLDs\") that are available to end-users in particular geographic/political locations. The \"Second Level Domain\" (\"SLD\") refers to the second-to-last segment of the web address (i.e., the \"uscourts\" in \"www.uscourts.gov\") and generally corresponds to an organization.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e These segments each indicate a particular level within a hierarchical database. See Name.Space, Inc. v. Network Solutions, Inc., 202 F.3d 573, 577 (2d C ir. 200 0). This hierarchical database, which maps do main names to IP addresses, is distributed across multiple computers that manage particular parts (or \"zones\") of the database and are openly accessible via the Internet. The information maintained by each of these computers is stored in what is commonly referred to as the \"zone file.\" Rony \u0026 Rony, The Domain Name Handbook, at 61-62. Generally, Internet service providers (\"ISPs\")\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e utilize \"domain name servers\" to translate domain names into numerical IP addresses, based on (1) queries to Root, TLD and SLD \"name servers,\"\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e or (2) cached data obtained from those servers, which is typically kept for the web sites requested most frequently by their end-users. See Froo mkin, Wrong Turn in Cyberspace, 50 D uke L.J. at 38-39, 44. Essentially, when an end-user types a domain name into her browser, for example, her ISP receives it and, after translating it through the domain name server, forwards a request for data to the IP address corresponding to the domain name the end-user typed in.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e The recipient of that request may then respond by send ing the requested data to the requestor's IP address. See, e.g., Thomas v. Network Solutions, Inc., 176 F.3d 500, 503-04 (D.C. Cir. 1999) (describing the process of accessing \"bettyandnicks.com\"); Rony \u0026 Rony, The Domain Name Handbook, at 72-74.\n\n2. Privatization of the DNS\n\nAs did many other components of the Internet infrastructure, the D NS originated under government grants. See, e.g., Nat'l A-1 Adver., Inc. v. Network Solutions, Inc., 121 F. Supp. 2d 156, 159 (D .N.H. 2000) (discussing \"The Government's Role in the Evolution of the Internet\"). In the Internet's infancy, a unique, authoritative list of IP addresses and their corresponding hosts was maintained by the late D r. Jon Postel. Under government contract, Postel began managing the list as a graduate student at UCLA in the 1970s and continued to do so at the University of Southern California's Information Science Institute (\"USC-ISI\") after obtaining his P h.D. Id. \"In October 1983, Postel and his colleague, Joyce Reynolds, authored RFC 920, 'an official policy statement' of the Internet Architecture Board (a private Internet standards body) and the Defense Advanced Research Projects Agency (DARPA). This official policy of the government and the Internet standards bod y defined most of the TLD s in use to this day.\" Froomkin, Wrong Turn in Cyberspace, 50 Duke L.J. at 53 (footnotes om itted). Over the next ten years, Postel and colleagues were intimately involved in the development and management of the DNS, although formal respo nsibility for the system was allocated to different entities through a series of government contracts. See Dep't of Commerce Policy Statement on Mgmt. of Internet Names and Addresses, 63 Fed. Reg. 31741, 31741-42 (June 10, 199 8) ( hereinafter, \"White Paper\"), available at http://www.icann.org/general/white-paper-05jun98.htm; Rony \u0026 Rony, The Domain Name H andboo k, at 113-27; Froomkin, Wrong Turn in Cyberspace, 50 D uke L.J. at 53-55.\n\nPursuant to authority granted to it by the 1991 High-Performance Computing Act, Pub. L. No. 102-194, 105 Stat. 1594 (December 9, 1991) (codified at 15 U.S.C. § 5501 et seq.); see 15 U.S.C. § 5521, the National Science Foundation (\"NSF\") \"assumed responsibility for coordinating and funding the management of the non-military portion of the Internet infrastructure,\" including responsibility for the registration of do main names in 1991. White Paper, 63 Fed. Reg. at 3174 2; see, e.g., Rony \u0026 Rony, The Domain Name Handbook, at 125-27. \"NSF solicited competitive proposals to provide a variety of infrastructure services, including domain name registration services.\" White Paper, 63 Fed. Reg. at 31742. In late 1992, the NSF entered into an exclusive five-year cooperative agreement with Network Solutions, Inc. (\"NSI\") for the registration of new domain names.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Id. Thereafter, NSI performed \"key registration, coordination, and maintenance functions of the Internet domain system,\" including registering domain names in the generic TLDs, such as .com, .edu, etc., on a first come, first served basis, and \"operat[ing] the 'A' root server, which maintains the authoritative root database and replicates changes to the other root servers on a daily basis.\" Id. NSI also maintained the authoritative database of Internet registrations (i.e., the list of who owns what domain name and their contact information), called the WH OIS database.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Id.\n\nIn June 1998, the United States Department of Commerce (\"DOC\") published a policy statement entitled \"Management of Internet Names and Add resses,\" commonly known as the \"W hite Paper,\" that proposed the creation of a private, not-for-profit entity to coordinate the technical management of the Internet's domain name system.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e 63 Fed. Reg. 31741. Specifically, the D OC stated that:\n\n[T]he U.S. Government is prepared to recognize, by entering into agreement with, and to seek international support for, a new, not-for-profit corporation formed by private sector Internet stakeholders to administer policy for the Internet name and address system. Under such agreement(s) or understanding(s), the new corporation would undertake various responsibilities for the administration of the domain name system now performed by or on behalf of the U.S. Government or by third parties under arrangements or agreements with the U.S. Government. The U.S. Government would also ensure that the new corporation has appropriate access to needed databases and software developed under those agreements.\n\nSee id. at 31749 .\n\nSoon thereafter, ICANN was \"incorporated as a non-profit public benefit corporation in California, in order to assume the management of the DNS as contemplated in the White Paper.\" Name.Space, Inc. v. Network Solutions, Inc., 202 F.3d 573, 579 (2d Cir. 2000). ICANN's Articles of Incorporation state that ICANN\n\nshall, . . . , pursue the charitable and public purposes of lessening the burdens of government and promoting the global public interest in the operational stability of the Internet by (i) coordinating the assignment of Internet technical parameters as needed to maintain universal connectivity on the Internet; (ii) performing and overseeing functions related to the coordination of the Internet Protocol (\"IP\") address space; (iii) performing and overseeing functions related to the coordination of the Internet domain name system (\"DNS\"), including the development of policies for determining the circumstances under which new top-level domains are added to the DNS root system; (iv) overseeing operation of the authoritative Internet DNS root server system; and (v) engaging in any other related lawful activity in furtherance of items (i) through (iv).\n\nICANN Articles of Incorporation (As Revised Nov. 21, 1998), ¶ 3, available at http://www.icann.org/general/articles.htm. As ICANN has stated, the reason for its existence is \"to carry out the Internet's central coordination functions for the public good\" as part of a \"public trust\" established by the W hite Pap er and resulting privatization process. ICANN , ICP-3: A Unique, Authoritative Root for the DNS, (July 9, 200 1), available at http://www.icann.org/icp/icp-3.htm.\n\nIn September 1998, the DOC and the NSF entered into a \"memorandum of agreement\" transferring \"responsibilities for the cooperative agreement with [NSI]\" to the DOC. The NSI-DOC cooperative agreement was then amended \"to specify that [NSI] operates the authoritative root server under the direction of the [DOC].\" DOC Relationship with ICANN, GAO/O GC-00-33R, at 7-8; see Nat'l A-1 Adver., 121 F. Supp. 2d at 162. Furthermore, Amendment 11 to the NSI-DOC cooperative agreement required N SI to take various steps towards the creation of a \"Shared Registration System,\" essentially a competitive registration system for SLDs in the TLDs maintained by NSI. See Cooperative Agreem ent No. NCR-921874 2, Am endment 11 (O ct. 7, 1998), available at http://www.icann.org/nsi/coopagmt-amend11-07oct98.htm; Name.Space, Inc. v. Network Solutions, Inc., 202 F.3d 573, 579 (2d Cir. 2000) (discussing Amendment 11). Accordingly, NSI agreed with the DOC to recognize the entity created in response to the White Paper and formally recognized by DOC (deemed \"NewCo\" in Amend ment 11), and to work with that entity to facilitate the transition from a single registrar system to a competitive system. See Amendment 11, supra; see also infra note 20.\n\nIn November 1998, ICANN received formal recognition from the DOC in a Memorandum of Understanding (\"MO U\") and entered into both a cooperative research and development agreement to study the root server system and a so le source contract to perform specific technical functions. See Memorandum of Understanding Between the U.S. Dep 't of Commerce and Internet Corp. for Assigned Names and Numbers (\"MOU \"), http://www.icann.org/general/icann-mou-25nov98.htm (Nov. 25, 1998).\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Notably, the DOC retains considerable oversight authority concerning ICANN activities. See, e.g., MOU , at §§ V .B.7, V.B .8 (DOC agrees to \"[p]rovide general oversight of activities conducted pursuant to this Agreement\" and to \"[m]aintain oversight of the technical management of DNS functions currently performed either directly, or subject to agreements with the U.S. Government, until such time as further agreement(s) are arranged as necessary, for the private sector to undertake management of specific DNS technical management functions.\"); id., Amendment 1, ¶ 5, available at http://www.icann.org/nsi/amend1-jpamou-04nov99.htm (Nov. 10, 1999) (\"If DOC withdraws its recognition of ICANN or any successor entity by terminating this MOU , ICANN agrees that it will assign to DOC any rights that ICANN has in all existing contracts with registries and registrars.\"); id. at 1 (\"The Agreement entitled 'Registry Agreement' between ICANN and [NSI] with Effective Date November 10, 1999, and relating to the provision of registry services for the .com, .net and .org TLD s is hereby approved by DOC. ICANN will not enter into any amendment of, or substitute for, said agreement, nor will said agreement be assigned by ICANN, without the prior approval of DO C\"); id. at 2 (\"ICANN shall not enter into any agreement with any successor registry to NSI for the .com, .net, and .org TLD s without the prior approval by DO C of the successor registry and the provisions of the agreement between the registry and ICANN .\"). In fact, IC ANN has submitted four status reports to the DOC to document its progress in implementing its responsibilities under the MOU . See ICANN's Major Agreements and Related Reports, at http://www.icann.org/general/agreements.htm (providing links to, inter alia, the status reports).\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nDespite the oversight responsibilities of the DOC, ICANN has considerable discretion and power under the MOU , which requires ICANN , inter alia, to provide expertise and advise on DN S management and, more generally, to collaborate with D OC on a series of issues. See MOU , at § V.C; see also id. § V.A (general shared obligations). The MOU can be amended only by mutual agreement and terminated by either party with 120 days written notice to the other party. Id. § VII.\n\nAs a result of the privatization process, ICANN no w coordinates, sets policy for, and oversees the D NS. Among other things, ICANN is responsible for coordinating the assignment of domain names, IP numbers, and other parameters that allow the D NS to function as well as coordinating the root server system's operation. See, e.g., ICANN homepage, http://www.icann.org/. ICANN also has coordinated, with the approval of DOC , the introduction of new TLDs, such as .biz and .info. See ICANN , Third Status Report Under ICANN /US Government Mem orandum of Understanding, (submitted to DO C on July 3, 2001), http://www.icann.org/general/statusreport-03jul01.htm.\n\nOf the coordination functions perform ed by ICANN , perhaps the most visible and important, both generally and to this case specifically, is the registration of domain names. ICANN policies regarding domain name registrations \"are mainly implemented through ICANN 's entry of agreements with domain-name registries and registrars.\" ICA NN , Second Status Report Under ICAN N/US G overnment Memorandum of Understanding, (subm itted to D OC on Jun. 30, 2000), available at http://www.icann.org/general/statusreport-30jun00.htm.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e While NSI still operates and maintains the TLD name servers and zone files that enable the other entities to access the DNS and to transmit domain name registration information for the .com, .net, and .org top level domain names to the System,\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e many comp eting entities, called \"registrars,\" have received contractual authorization from ICANN to register new SLD names within particular T LDs.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e One such entity is Register.com.\n\nThe registration process essentially works as follows:\n\nWhen an individual or an organization desires to register a domain name, it may do so through any accredited registrar . . . . The applicant first chooses one of the TLDs offered by the registrar and then creates an accomp anying SLD name, thereby fashioning a potential domain nam e, which is then sub mitted electronically to the registrar for approval. However, no two SLD names within a given TLD can be identical. Accordingly, if someone submits an application for a particular domain name that already exists in the Registry WHO IS database by virtue of a prior registration, that name cannot be registered again, and the applicant is advised that the sought domain name is unavailable. The applicant may then choose to sub mit an application for an alternate domain name, either by changing or adding or subtracting a letter(s) or number(s) or a dash(es) to his initially submitted SLD name within the same TLD , or by going to another TLD where the initially submitted SLD name is still available. If there is no existing registration for a given SLD name within a given TLD, that domain name is considered available and generally may be registered on a first-come, first served basis.\n\nSmith v. Network Solutions, Inc., 135 F. Supp. 2d 1159, 1161-62 (N.D. Ala. 2001) (footnote omitted) (emp hasis added). Thus, while one goal of the privatization process was to create a competitive market in registration services, competing registrars (and registrants) must be able to determine whether a particular domain name has already been registered, which necessarily requires coordination. Accordingly, in order to obtain authorization to compete, every registrar, including Register.com, must enter into a contractual relationship with ICANN governed by a uniform Registrar Accreditation Agreement (\"ICANN Agreement\" or \"RAA\"). The ICANN Agreement resulted from extensive public comment and was approved by the Department of Comm erce and NSI as part of a package of agreements.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e See Registrar Accreditation Agreement, (Nov. 4, 1999), http://www.icann.org/nsi/icann-raa-04nov99.htm.\n\nHaving provided a general overview of the manner in which the DNS operates, its privatization, and ICANN , we now narrow our focus on the particular issues central to this dispute.\n\n3. The ICANN Agreement and WHOIS Information\n\nUnder the terms of the ICA NN Agreement, each registrar must, among many other things, maintain its own on-line, interactive WHO IS database for those domain names it registers and make the database publicly available, in the way specified by the agreement. Specifically, the database must contain, inter alia, the names and contact information--postal address, telephone number, electronic mail address and in some cases facsimile numb er--for customers who register domain names through the registrar. ICANN Agreement, § II.F.1. Notably, neither the registrar nor the registrant has the option of prohibiting access to the registrant's contact information. Each registrar is obligated under the ICANN Agreement to make its WHOIS database freely and publicly accessible, and all registrants are obligated under their agreements with registrars to allow registrars to do so . See id.; id. § II.J.7.c (requiring registrar to enter into agreement with registrant whereby registrant consents to WHOIS information provisions).\n\nThe Agreement expressly requires each registrar to make its database freely accessible to the pub lic via its web page and through an independent access port called port 43. Id. § II.F.1 (\"At its expense, Registrar shall provide an interactive web page and a port 43 W hois service providing free public query-based access to up-to-date (i.e. updated at least daily) data concerning all active SLD registrations sponsored by Registrar in the registry for the .com, .net, and .org T LDs.\"). T hese query-based channels of access to the W HO IS database allow end-users to collect registrant contact information for one domain name at a time. Section II.F.4 notes that registrars must comp ly with any ICANN policy req uiring \"registrars to cooperatively implement a distributed capability that provides query-based [WHO IS] search functionality across all registrars.\" Id. Section II.F.5 of the ICANN Agreement requires that:\n\nIn providing query-based public access to registration data as required by Sections II.F.1 and II.F.4, Registrar shall not impose terms and conditions on use of the data provided except as permitted by ICANN -adopted policy. Unless and until ICANN adopts a different po licy, Registrar shall permit use of data it provides in response to queries for any lawful purposes except to: (a) allow, enable, or otherwise support the transmission of mass unsolicited, commercial advertising or solicitations via e-mail (spam); or (b) enable high volume, automated, electronic processes that apply to Registrar (or its systems).\n\nThis provision expressly permits (and may even require) registrars to impose use restrictions of type (a) and (b), and at the same time, expressly prohibits any other use restrictions.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nThe ICA NN Agreement also obligates each registrar to provide third parties with bulk access to the same WHO IS information pursuant to a license agreement. Id. § II.F.6. The bulk access license entitles the licensee to receive weekly--in one transmission--an electronic copy of the same WHO IS information that is provided continuously through the registrar's web page and its access port 43. Id. § II.F.6.a. The registrar may charge a $10,000 yearly fee for the license. Id. § II.F.6.b. The ICANN Agreement states that each bulk license agreement between the registrar and a third party \"shall require the third party to agree not to use the data to allow, enable, or otherwise support the transmission of mass unsolicited, commercial advertising or solicitations via e-mail (spam).\" Id. § II.F.6.c. The ICANN Agreement also allows a registrar to enable individual registrants to choose not to have their WHOIS information made available through bulk access for marketing purposes by implementing an \"opt-out\" policy. If a registrar creates an opt-out po licy, its bulk license agreements must include provisions requiring third parties to abide by the opt-out policy, and the registrar will also be unab le to use the W HO IS information to market its products or services. Id. § II.F.6.f.\n\nAs the W hite Paper makes clear, free public access to WHO IS information, as req uired by the database provisions of the ICAN N Agreement, has two purposes. The primary purpose is to provide necessary information in the event of domain name disputes, such as those arising from trademark infringement or cybersquatting. See White Paper, 63 Fed. Reg. at 31750. A second purpose, which the DO C felt \"would also benefit dom ain nam e holders,\" is to \"m ak[e] it less expensive for new registrars and registries to identify potential customers, enhancing competition and lowering prices.\" Id. at 31750 n.21.\n\nIt is important to recognize that in contrast with the registrar's computer systems (including the datab ase housing W HO IS information), which the registrar undoubtedly owns, W HO IS information is public information that is not owned by anyone: W HO IS information cannot be copyrighted, see, e.g., Feist Publications, Inc. v. Rural Telephone Serv. Co., 499 U.S. 340, 361 (1991) (\"bits of [name, address, and telephone number] information are uncopyrightable facts\"), patented, see, e.g., 35 U.S.C. § 101 (listing patentable subject matter), or protected as a trade secret or confidential information under state law, see, e.g., Ivy Mar Co. v. C.R. Seasons Ltd., 907 F.Sup p. 547, 556 (E.D.N .Y. 1995 ) (\"The single most important factor in determining whether particular information is a trade secret is whether the information is kept secret.\") (citing Lehman v. Dow Jones \u0026 Co., 783 F.2d 285, 298 (2d C ir. 1986)).\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Register.com (and other registrars) must make WHOIS information publicly accessible from the registrar's site and generally \"free as the air to common use.\" Int'l News Serv. v. Associated Press, 248 U.S. 215, 250 (1918) (Brandeis, dissenting).\n\nB. The dispute between Register.com and Verio\n\nThe district court made extensive findings of fact that, for the most part, are not disputed. Accordingly, we borrow substantially from that section of the district court opinion. See Register.com, Inc. v. Verio, Inc., 126 F. Supp. 2d 238, 241-45 (S.D.N.Y. 2000).\n\n1. Register.com\n\na. General background\n\nRegister.com is one of over fifty domain name registrars for customers who wish to register a name in the .com, .net, and .org top-level domains. As a registrar it contracts with these SLD name holders and a registry, collecting registration data about the SLD holder and submitting zone file information for entry in the registry database. In addition to its domain name registration services, Register.com offers to its customers, both directly and through its more than 450 co-branded and private label partners, a variety of other related services, such as (i) web site creation tools; (ii) web site hosting; (iii) electronic mail; (iv) dom ain nam e hosting; (v) domain name forwarding, and (vi) real-time domain nam e management.\n\nRegister.com provides its customers with the opportunity to \"opt-in\" during the domain name registration process to receiving sales and marketing com munications from Register.com or its co-brand or private label partners, thus giving its customers some degree of control over their receipt of commercial solicitations. Customers who do not opt-in to such communications are not solicited by Register.com or its co-brands. Register.com's co-brand and private label partners have contracted with Register.com for the right to have their services featured on the www.register.com website.\n\nId. at 241.\n\nb. Submitting a WHOIS query at register.com\n\nTo register a domain name, a person need only visit Register.com's home page at www.register.com.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e There, an end-user is presented with, among others things such as advertisements, an invitation to check on the availability of a domain name by entering a query into an empty text box. [JA 1058 (first page with \"check it\" invitation)] Notably, there are no terms or conditions posted in proximity to this invitation or the text box. [JA 1058] Upon entering a query and clicking on \"check it,\" the query is submitted to Register.com's and other registrars' databases, and the visitor receives a search results page that indicates whether the domain name is already taken. If a domain name is taken, the end-user may find out the name and contact information for the entity that has registered the domain name by clicking on a hyperlink. [Oral Arg. Tr. at 23, lines 6-8; JA 1141 (WH OIS results page)]\n\nThe process by which end-users interact with Register.com's computer systems is important. When an end-user accepts Register.com's invitation to submit a query, the end-user's computer sends a query to Register.com's servers, Register.com's computer systems \"process\" the query and send a response to the end user's computer, and the end-user's computer (generally) displays the response as a web page in his or her browser.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e In all cases, information possessed by Register.com (or another registrar) is sent to the end-user requesting the information; as soon as the end-user receives the response from Register.com, the end-user also possesses the information. With respect to WHOIS information for domain names registered by Register.com, the information is sent along with Register.com's \"terms of use.\" The parties do not dispute that the terms of use appear only upon receipt of the W HO IS query results. [Red 30 (Terms of use \"appear at the very top of every W HO IS record provided by register.com.\"); Reply 7 (\"Register.com's use restrictions appear only after a party has submitted a WHOIS inquiry.\")]\n\nFor example, if an end-user submits a W HO IS query regarding \"register.com,\" the end-user is informed that the domain name is registered to Register.com, Inc. and is sent Register.com's contact information. At the top of the page are Register.com's terms and conditions. Originally, Register.com's terms and conditions were substantially the same as permitted by section II.F.5 of the ICANN Agreement (quoted supra). In April 2000, however, Register.com implemented the following more restrictive terms of use for its WHOIS database:\n\nBy submitting a W HO IS query, you agree that you will use this data only for lawful purposes and that, under no circumstances will you use this data to: (1) allow, enable, or otherwise support the tran smission of m ass unsolicited, comm ercial advertising or solicitations via direct mail, electronic mail, or by telephone; or (2) enable high volume, automated, electronic processes that apply to Register.com (or its systems). The compilation, repackaging, dissemination or other use of this data is expressly prohibited without the prior written consent of Register.com. Register.com reserves the right to modify these terms at any time. By submitting this query, you agree to abide by these terms.\n\nRegister.com has imposed the same mass marketing prohibition on the use of the bulk license data. In its amicus submission to the district court dated September 22, 2000, ICANN stated that:\n\nTo the extent that Register.com is using this legend to restrict otherwise lawful use of the data for mass unsolicited, commercial advertising or solicitations by direct mail or telephone (and not just by electronic m ail), it is ICANN 's position that Registrar.com [(sic)] has failed to comply with the promise it made in Section II.F.5 of the Registrar Accreditation Agreem ent.\n\nICANN Amicus Br. at 10-11 (footnotes omitted).\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e [JA-2885]\n\n2. Verio\n\na. General background\n\nDefendant Verio is one of the largest operators of web sites for businesses and a leading provider of comprehensive Internet services. Although not a registrar of domain names, Verio directly competes with Register.com and its partners to provide registration services and a variety of other Internet services including website hosting and development.\n\n126 F. Supp. 2d at 241.\n\nb. Verio's Project H enhouse\n\nIn late 1999, to better target their marketing and sales efforts toward customers in need of web hosting services and to reach those customers more quickly, Verio developed an automated software program or \"robot.\" W ith its search robot, Verio\n\naccessed the WHO IS database maintained by the accredited registrars, including Register.com, and collected the contact information of customers who had recently registered a domain name.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Then, despite the marketing prohibitions in Register.com's terms of use, Verio utilized this data in a marketing initiative known as Project Henhouse and began to contact and solicit Register.com's customers, within the first several days after their registration, by e-mail, regular mail, and telephone.\n\nId. at 243 (footnote omitted and footnote added).\n\nc. Verio's Search R obo ts\n\nIn general, the process worked as follows: First, each day Verio downloaded, in compressed format, a list of all currently registered domain nam es, of all registrars, ending in .com, .net, and .org. That list or database is maintained by NSI and is published on 13 different \"root zone\" servers. The registry list is updated twice daily and provides the domain name, the sponsoring registrar, and the nameservers for all registered names. Using a computer program, Verio then compared the newly do wnloaded NSI registry with the NSI registry it downloaded a day earlier in order to isolate the domain names that had been registered in the last day and the names that had been removed. After do wnloading the list of new domain names, only then was a search robot used to query the NSI database to extract the name of the accredited registrar of each new name.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e That search robot then automatically made successive queries to the various registrars' W HO IS databases, via the port 43 access channels, to harvest the relevant contact inform ation for each new domain name registered. Once retrieved, the WH OIS data was deposited into an information database maintained by Verio. The resulting database of sales leads was then provided to Verio's telemarketing staff.\n\nId.\n\n3. Origins of the dispute\n\nBeginning in January, 2000, R egister.com learned that Verio was e-mailing its customers to solicit business. Register.com complained to Verio, advised Verio that an e-mail sent by Verio to a Register.com customer had misled the customer into thinking that Verio had an affiliation with or sponsorship from Register.com,\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e and Verio replied that the email resulted from a \"system problem,\" which Verio promised to correct.\n\nRegister.com continued to get co mplaints about e-mail and telephone solicitations by Verio from its customers and co-brand partners through January. In March 2000, Register.com again contacted Verio to complain that Register.com was still receiving numerous complaints, including that a number of telephone messages similar to the following were left with Register.com customers: \"This is [name of telemarketer] calling from Verio regarding the registration of [customer's domain name]. Please contact me at your earliest convenience.\" (Ex. 44 to Pl.'s Sept. 8, 2000 Motion).\n\nOn M ay 5, 2000 Register.com's lawyers wrote to Verio's General Counsel requesting that Verio immediately cease and desist from this marketing conduct. Register.com complained generally that the use of its mark [and] the timing of the solicitations [were] harming its good will and specifically warned V erio that it was violating the term s of use it had agreed to in submitting its WHO IS queries by sending \"mass unsolicited, commercial advertising or solicitations via e-mail (spam).\"\n\nOn M ay 9, 2000 Verio, through an Associate Counsel, communicated that it had stopped using the Register.com mark or any other similar mark or phrase which would lead to confusion and had ceased accessing the WHOIS database for the purpose of marketing through e-mail. In an effort to confirm settlement of the dispute, Register.com's lawyers sent Verio a terms letter for it to sign and acknowledge. In that letter Register.com specifically required V erio to cease use of the W HO IS database for not just e-mail marketing, but also direct mail and telemarketing. Verio refused to sign and although it ceased e-mail solicitation, it continued to use the WHO IS contact information for telemarketing purposes into July 2000.\n\nId. at 243-44.\n\n4. District court proceeding\n\nRegister.com filed its complaint on August 3, 2000. In the complaint, Register.com alleged Lanham Act violations, Computer Fraud and Abuse Act (\"CFAA\") violations, unfair competition in violation of New York statutory law, and trespass to chattels, breach of contract, tortious interference with contract, and tortious interference with potential business relations in violation of New Y ork common law. Register.com moved for a temporary restraining order and preliminary injunction. On August 4, 2000, Verio sought expedited discovery and agreed on August 9, 2000 to enter into a stipulated temporary restraining order with Register.com preventing it from accessing Register.com's W HO IS database by using a search robot and from using any data obtained from Register.com to solicit Register.com's customers.\n\nAfter extensive briefing and a hearing, the district court granted Register.com's motion for a preliminary injunction in a memorandum and order dated December 11, 2000, concluding that Register.com had demonstrated likelihood of success and irreparable harm with respect to its breach of contract, CFAA, trespass to chattels, and Lanham Act claims.\n\nThe court enjoined Verio from the following actions:\n\n1. Using or causing to be used the \"Register.com\" mark or the \"first step on the web\" mark or any other designation similar thereto, on or in connection with the advertising, marketing, or promotion of Verio and/or any of Verio's services;\n\n2. Representing, or committing any act which is calculated to or is likely to cause third parties to believe that Verio and/or Verio's services are sponsored by, or have the endorsement or approval of Register.com;\n\n3. Accessing Register.com's computers and computer networks in any manner, including, but not limited to, by software programs perform ing multiple, automated, successive queries, provided that nothing in this Order shall prohibit Verio from accessing Register.com's WH OIS database in accordance with the terms and conditions thereof; and\n\n4. Using any data currently in Verio's possession, custody or control, that using its best efforts, Verio can identify as having been obtained from Register.com's computers and comp uter networks to enable the transmission of unsolicited commercial electronic mail, telephone calls, or direct mail to the individuals listed in said data, pro vided that nothing in this Order shall prohibit Verio from (i) communicating with any of its existing customers, (ii) responding to communications received from any Register.com customer initially contacted before August 4, 2000, or (iii) communicating with any Register.com customer whose contact information is obtained by Verio from any source other than Register.com's computers and computer networks.\n\nId. at 255.\n\nThis appeal followed.\n\nII. DISCUSSION\n\nA. Jurisdiction and the Standard of Review\n\nThis is an interlocutory appeal from the grant of a preliminary injunction, which means that our jurisdiction derives from 28 U .S.C. §129 2(a)(1). T he issue properly before us is whether the district court abused its discretion in granting preliminary injunctive relief to Register.com. See, e.g., University of Texas v. Camenisch, 451 U.S. 390 (1981).\n\nHowever, an injunction is an equitable remedy, and as we review the particular conclusions reached by the district court with respect to Register.com's likelihood of success on the merits of its claims and its showing of irreparable harm, we are mindful that:\n\n[t]he essence of equity jurisdiction has been the power of the Chancellor to do equity and to mould each decree to the necessities of the particular case. Flexibility rather than rigidity has distinguished it. The qualities of mercy and practicality have made equity the instrument for nice adjustment and reconciliation between the public interest and private needs as well as between competing private claims.\n\nHecht Co. v. Bowles, 321 U.S. 321, 329 (1944). Therefore, we consider both whether the grant of a preliminary injunction was an abuse of discretion and also whether the grant was \"contrary to some rule of equity.\" Meccano v. Wanamaker, 253 U.S. 136, 141 (1920); see also Coca-Cola Co. v. Tropicana Products, Inc., 690 F.2d 312, 315 (2d C ir. 1982).\n\nIn this review, we give significant deference to the district court's preliminary factual determinations, disturbing them only where error is clear, but give no deference to the district court's conclusions of law, which we review de novo. See, e.g., Latino Officers Ass'n v. Safir, 196 F.3d 458, 462 (2d Cir. 1999), cert. denied, 528 U.S. 115 9 (2000 ); Forest City Daly Hous., Inc. v. Town of N. Hempstead, 175 F.3d 144, 149 (2d Cir. 1999); Charette v. Town of Oyster Bay, 159 F.3d 749, 755 (2d Cir. 1998); Malkentzos v. DeB uono, 102 F.3d 50, 54 (2d Cir. 1996).\n\nIn this case, the district court rendered its decision after briefing and a hearing, and, as set forth above, the court made extensive factual findings that, for the most part, are not disp uted. M any of the issues presented on app eal, therefore, are pure issues of law for which de novo review is appropriate.\n\nB. Preliminary Injunction Standard\n\n\"In ord er to obtain a preliminary injunction, a party must demonstrate: 1) that it is subject to irreparable harm; and 2) either a) that it will likely succeed on the merits or b) that there are sufficiently serious questions going to the merits of the case to make them a fair ground for litigation, and that a balancing of the hardships tips 'decided ly' in favor of the moving party.\" Genesee Brewing Co. v. Stroh Brewing Co., 124 F.3d 137, 141 (2d C ir. 1997) (citing Warner-Lambert Co. v. Northside Dev. Corp., 86 F.3d 3, 6 (2d Cir. 1996)). With respect to each of Register.com's claims, the district court concluded that Register.com would likely be irreparably harmed absent an injunction and was likely to succeed on the merits.\n\nVerio argues that the district court erred by not considering the \"public interest\" before granting injunctive relief. Specifically, Verio asserts that the injunction is anti-competitive and in conflict with stated DOC and ICANN policy, and that, in light of these considerations, the injunction should have been denied. [Blue 19-22] \"Although this Circuit's settled preliminary injunction standard does not explicitly mention the public interest, as do other Circuits' standards, we have recognized that, as a court of equity, we 'may go much further both to give or to withhold relief in furtherance of the public interest than where only private interests are involved.'\" Standard \u0026 Poor's Corp. v. Commodity Exch., Inc., 683 F.2d 704, 711 (2d Cir. 1982)\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e (quoting Brown \u0026 W illiamson Tobacco Corp. v. Engman, 527 F.2d 1115, 1121 (2d C ir. 1975)); see also Greenwood Utils. Comm'n v. Hodel, 764 F.2d 1459, 1462 (11th Cir. 1985) (citing Standard \u0026 Poor's with approval); United States v. Marine Shale Processors, 81 F.3d 1329 , 1359 (5th Cir. 1996) (observing the \"extraordinary weight courts of equity place upon the public interests in a suit involving more than a mere private dispute.\"). More recently, in Brody v. Village of Port Chester, this Court held that\n\n[w]henever a request for a preliminary injunction implicates pub lic interests, a court should give some consideration to the balance of such interests in deciding whether a plaintiff's threatened irreparable injury and probability of success on the merits warrants injunctive relief. Otherwise a claim that appears meritorious at a preliminary stage but is ultimately determined to be unsuccessful will have precipitated court action that might needlessly have injured the public interest.\n\nBrody v. Vill. of Port Chester, 261 F.3d 288, 290 (2d Cir. 2001) (quoting Time Warner Cable v. Bloomberg L.P., 118 F.3d 917, 929 (2d Cir. 1997)). The language in both Standard \u0026 Poor's and Brody suggests that a district court deciding whether to grant equitab le relief should consider and balance private and public interests whenever public interests are implicated. With the exception of Standard \u0026 Poor's, however, such a rule has not been applied in suits between private parties. Generally, the rule applies in situations where a plaintiff seeks a preliminary injunction against government action taken in furtherance of a regulatory or statutory scheme, which is presumed to be in the public interest; in such situations, a plaintiff must meet a \"more rigorous likelihood-of-success standard.\" Wright v. Giuliani, 230 F.3d 543, 547 (2d C ir. 2000) (quoting Beal v. Stern, 184 F.3d 117, 122 (2d Cir. 1999)). See, e.g., Brody, 261 F.3d 288 (eminent domain proceeding); Carpenter Tech. Corp. v. City of Bridgeport, 180 F.3d 93, 97 (2d Cir. 199 9); Rodriguez v. DeB uono, 175 F.3d 227, 233 (2d Cir. 1999).\n\nC. Breach of contract claim\n\nRegister.com asserts a breach of contract claim against Verio, and seeks to enjoin Verio's use of WH OIS information obtained from Register.com's database. The pertinent facts are undisputed. Verio's search robot autom atically made successive queries to Register.com's W HO IS database via the port 43 access channel to ob tain WH OIS information for each new domain name registered.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e Once retrieved, the WH OIS information was deposited into an information database maintained by Verio and used by V erio's telemarketing staff. It is undisputed that Verio knew of and did no t abide by the mass marketing restriction in Register.com's terms of use.\n\nVerio first argues that it was not bo und by the restriction because it never manifested assent to Register.com's terms. In other words, Verio argues that it did not form a contract with Register.com when its search robot collected information from Register.com's WH OIS database. Verio next argues that a contract was not formed because there was no consideration exchanged between the parties. Verio also asserts that Register.com cannot be irreparably harmed by Verio's use of the WH OIS information which is not improper under the terms of the ICANN Agreement between Register.com and ICANN. Finally, Verio argues that even if it did enter into a contract with Register.com, it was not bound by the mass marketing restriction because the restriction itself was impermissible under the ICANN Agreement and against public policy.\n\nAcknowledging that it is obligated to provide public access to its customers' contact information pursuant to § II.F.5 of the ICAN N Agreement, Register.com argues that Verio assented to and is bound by the mass marketing restriction and is not entitled to rely on the ICANN Agreement in any fashion because that Agreement constitutes a contract between private parties (ICANN and Register.com) and expressly states that it is not intended to create third party beneficiary rights. See ICANN Agreement, § II.S (\"No Third-Party Beneficiaries. This Agreement shall not be construed to create any obligation by either ICAN N or Registrar to any non-party to this Agreement, including any SLD holder.\"). As ICANN's amicus brief puts it, \"enforcement of these promises should be done within the ICANN process rather than through co urt proceedings initiated by third parties.\" JA-2894 (emphasis added). Both Register.com and ICANN urge that Verio should address its concerns over Register.com's terms of use to ICANN rather than engaging in self-help by disregarding the terms altogether. Appellee's Br., at 51 n.21; ICANN Amicus Br., at 12-13. [JA-2895-96] We note that the present action was not initiated by Verio attempting to assert third party rights. Rather, this suit was brought by Register.com seeking the court's assistance in enforcing term s which violate Register.com's obligations as a registrar of W HO IS information.\n\nRegister.com urges that Verio's continued violations would subject Register.com to irreparable harm, and therefore looks to the court for equitable relief enforcing the terms of the contract through a preliminary injunction. As noted above, the district court granted a preliminary injunction barring Verio from continuing such solicitations.\n\n1. Irreparable harm\n\nIn order to properly obtain the extraordinary rem edy of a preliminary injunction to enforce its contract, Register.com must demonstrate that (1) Register.com will suffer irreparable harm without the injunction; and (2) Register.com will likely prevail on the merits of its contract claim. We will not need to delve too deeply into the merits of the contract claim, because we find that the district court abused its discretion when it held that without a preliminary injunction restraining Verio from continuing its solicitations, Register.com would suffer irreparable injury. However, as discussed in the next section, we also doubt that Register.com is likely to succeed on the merits of its contract claim.\n\nAs the district court acknowledged, \"[t]he classic remedy for breach of contract is an action at law for monetary damages. If the injury complained of can be compensated by an award of monetary damages, then an adequate remedy at law exists and no irreparable injury may be found as a matter of law.\" Moreover, \"when a party can be fully compensated for financial loss by a money judgment, there is simply no compelling reason why the extraordinary equitable remedy of a preliminary injunction should be granted.\" Borey v. National Union Fire Insurance Co., 934 F.2d 30, 34 (2d Cir. 1991).\n\nWhen the district court heard this case, a critical part of Register.com's complaint and alleged exposure to future harm arose from consumer confusion about whether the telemarketing and spam e-mails were sponsored by Register.com. Because Verio has agreed to stop its use of Register.com's trademarks, the confusion (and potential damage to consumer goodwill) is much less likely to arise.\n\nNonetheless, the court reasoned that an injunction was warranted because the damages in this case would be difficult to quantify due to the fact that the claimed harm is from the loss of potential customers. The case that the district court cited in support of this proposition, Ticor Title Ins. Co. v. Cohen, 173 F.3d 63 (2 d Cir. 1999) is easily distinguishable.\n\nIn Ticor, an insurance company obtained a permanent injunction against a former vice president who had signed and then breached a non-compete covenant which specified that in the event of a such a breach, the company would be entitled to an injunction.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Because the defendant's services were unique, we found that irreparable harm was likely and affirmed the grant of a perm anent injunction enforcing the non-comp ete agreement. Here, the information that Register.com seeks to protect - far from being unique - is a matter of public record that Register.com has contracted to make freely available. No provision exists in the alleged contract between V erio and Register.com to indicate that Verio assented to an injunction in the event of a breach. Moreover, this case involves a preliminary injunction and speculation as to the eventual adjudication of the contract claim, not the permanent injunction of Ticor.\n\nThe district court also relied on Gulf \u0026 Western Corp. v. Craftique Productions, Inc., 523 F. Supp. 603, 607 (S.D.N.Y. 1981), for the proposition that \"even in situations where damages are available, irreparable harm may be found if damages are 'clearly difficult to assess and measure.'\" (citing Danielson v. Local 275, Laborers Int'l Union of North America, 479 F.2d 1033, 1037 (2d Cir. 1973). In Danielson, we found the possibility of irreparable harm when picketers had been picketing (perhaps unlawfully) for months, and continued pickets would have further delayed construction of a housing complex, preventing rentals and tenants' access.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e Unlike Danielson, damages calculations based on Register.com's lost business opportunities, although potentially complicated, is the type of calculation commonly required in contract disputes. See United States ex rel. Evergreen Pipeline Constr. Co. v. Merritt Meridian Construction Corp., et al, 95 F.3d 153, 161 (2d Cir. 1996)(quoting Kenford Co. v. County of Erie, 67 N.Y.2d 257, 261 (N.Y. 1986) (per curiam)(\"Loss of future profits as damages for breach of contract have been permitted in New York under long-established and precise rules of law.\")).\n\nBy contrast, \"[i]rreparable injury is one that cannot be redressed through a monetary award. Where money damages are adequate compensation a preliminary injunction should not issue.\" JSG Trading Corp. v. Tray-Wrap, Inc., 917 F.2d 75, 78 (2d Cir. 1990). The district court's finding that Register.com's potential damages were impossible to calculate constitutes clear error, and its grant of an injunction based on the possibility of irreparable harm was an abuse of discretion.\n\n2. Success on the M erits of the Contract Claim\n\nEven if Register.com could demonstrate the possibility of irreparable harm absent an injunction, to prevail in obtaining a preliminary injunction, it must also establish a likelihood of success on the merits of its claim. \"To form a valid contract under New York law, there must be an offer, acceptance, consideration, mutual assent and intent to be bound.\"\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e See e.g., Louros v. Cyr, 175 F. Supp. 2d 497, 512 n.5 (S.D.N .Y. 2001 ). See generally Restatement (Second) of Co ntracts, § 17 (1981). Assent, in particular, requires special attention in our analysis.\n\na. Legal principles\n\nUnder N ew York law, \"[m]utual assent is essential to the formation of a contract and a party cannot be held to have contracted if there was no assent or acceptance.\" See, e.g., Maffea v. Ippolito, 247 A.D.2d 366, 367, 668 N.Y.S.2d 653, (2d Dep't 1998) (citing 22 NY Jur 2d, Contracts, § 29). \"The manifestation or expression of assent necessary to form a contract may be by word, act, or conduct which evinces the intention of the parties to contract.\" Id. (citing 22 NY Jur 2d, Contracts, § 29) (em phasis added). See generally Restatement (Second) of Contracts, § 18 (1981) (\"Manifestation of mutual assent to an exchange requires that each party either make a promise or begin or render a perform ance.\"); id. at § 19(2) (The conduct of a party may manifest assent only if \"he intends to engage in the conduct and knows or has reason to know that the other party may infer from his conduct that he assents.\"); E. Allan Farnsworth, Farnsworth on Contracts § 3.1 (2d ed. 2000 ).\n\nIn recent years, the proliferation of mass market standardized contracts (i.e., where sellers and buyers do not bargain over terms on an individualized basis) has forced the courts to pay particular attention to the issue of assent. In particular, the case law concerning \"shrinkwrap\" licenses provides helpful guidance on the manner in which contract principles have been applied in situations analogous to this case. Despite some similarities, we nonetheless find the arrangement in this case is easily distinguished from \"shrinkwrap,\" as well as \"clickwrap\" and \"browsewrap,\" licenses.\n\nA shrinkwrap license typically involves (1) notice of a license agreement on product packaging (i.e., the shrinkwrap), (2) presentation of the full license on documents inside the package, and (3) prohibited access to the product without an express indication of acceptance.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Generally, in the shrinkwrap context, the consumer does not manifest assent to the shrinkwrap terms at the time of purchase; instead, the consumer manifests assent to the terms by later actions. See, e.g., Brower v. Gateway 2000, Inc., 246 A.D.2d 246, 250-51, 676 N.Y.S.2d 569, 571-72 (1st Dep't 199 8) (not seeking a refund within a specified period of time); Hill v. Gateway 2000, Inc., 105 F.3d 1147, 1148 (7th Cir. 1997) (same); ProCD, 86 F.3d at 1452 (clicking on a button indicating acceptance after \"forced\" exposure to the terms (i.e., during the set-up process for a software program)); cf. Step-Saver Data Sys., Inc. v. Wyse Tech., 939 F.2d 91, 98, 100, 103-04 (3d Cir. 1991) (concluding that (1) the parties' conduct including a telephone order followed by delivery of and payment for software products evinced the existence of a contract, (2) UCC-207 applies to determine whether shrinkwrap license terms prevail over existing contract terms agreed to by the parties, and (3) the shrinkwrap terms were not assented to by the licensee despite the licensee's use of the product); Klocek v. Gateway, Inc., 104 F. Supp. 2d 13 32, 1338-1341 (D. K an. 2000) (rejecting ProCD and Hill approach, applying UCC § 2-207, and finding insufficient evidence of notice of and assent to shrinkwrap terms at the time of purchase).\n\nThe arrangement in this case is distinguishable from a shrinkwrap license in important ways. In contrast with the shrinkwrap license, which prohibits access to the product without manifestation of assent, a person (or software robot) who submits a WH OIS query (via the web interface or port 43) is given immediate access to the product (Register.com's database). As a result of such access, the requested WHOIS information is transmitted from Register.com's computer systems to the end-user's computer system(s). Upon receipt of the information, the end-user simultaneously receives notice and presentation of the proposed terms. Besides the fact that querying Register.com's WHOIS database in not a \"pay now, terms later\" transaction or even a consumer purchase,\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e access to Register.com's database, which is the \"product\" that Register.com provides to end-users,\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e is given prior to notice of proposed terms and an opportunity to review them.\n\nNotably, Register.com does not withhold access to the WH OIS information until an end-user manifests assent to the terms by means of a \"clickwrap\" license, which presents the potential licensee (i.e., the end-user) \"with a message on his or her com puter screen, requiring that the user manifest his or her assent to the terms of the license agreement by clicking on an icon.\" Specht v. Netscape Communications Corp., 150 F. Supp. 2d 585, 593-94 (S.D.N.Y. 200 1) (footnote omitted).\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e Essentially, under a clickwrap arrangement, potential licensees are presented with the proposed license terms and forced to expressly and unambiguously manifest either assent or rejection prior to being given access to the product. This case is distinguishable from the clickwrap license cases because no such dynamic exists.\n\nFinally, it has been suggested that the arrangement in this case is similar to a \"browsewrap\" license. See Specht, 150 F. Supp. 2d at 594 n.13. \"[A] browse wrap license is part of the web site[, e.g., license terms are posted on a site's home page or are accessible by a prominently displayed hyperlink,] and the user assents to the contract when the user visits the web site. No reported cases have ruled on the enforceability of a browse wrap license.\" Pollstar v. Gigmania Ltd., No. CIV-F-00-5671, 2000 W L 33266437 (E.D. Cal. Oct. 17, 2000). While there are some similarities between Register.com's arrangement and a browsewrap license, we find the browsewrap label does not fit. Unlike the situation in Pollstar, no hyperlink is provided where one could view the proposed license terms. Instead, only upon receiving the WH OIS query results from Register.com's database is an end-user exposed to Register.com's proposed terms.\n\nb. Bases for finding assent in this case\n\nThere are two argued bases for finding that Verio manifested assent to Register.com's terms. The first basis is the fact that the terms themselves state that an end-user agrees to be bound by Register.com's terms upon submission of a single query.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e The second basis is Verio's course of conduct: Verio admits that it knew of Register.com's terms, and V erio repeatedly submitted queries to Register.com's W HO IS database. W e find neither basis sufficient to sustain a likelihood of success by Register.com on this claim.\n\nIn discussing this issue, the district court wrote:\n\nNor can Verio argue that it has not assented to Register.com's terms of use. Register.com's terms of use are clearly posted on its website. The conclusion of the terms paragraph states \"[b]y submitting this query, you agree to abide by these terms.\" (Ex. 27 to Pl.'s Sept. 8, 2000 Motion). Verio does not argue that it was unaware of these terms, only that it was not asked to click on an icon indicating that it accepted the terms. However, in light of this sentence at the end of Register.com's terms of use, there can be no question that by proceeding to sub mit a W HO IS query, Verio manifested its assent to be bound by Register.com's terms of use, and a contract was formed and subsequently breached.\n\n126 F. Supp. 2d at 248. W e note that although the district court found that \"Register.com's terms of use are clearly posted on its website,\" which, in a sense, is correct because the terms are \"clearly posted\" along with each WHOIS query result, we do not believe that fact is dispositive as to whether a party that submits a query has manifested assent to be bound by the terms. Whether a party submits a query at the Register.com website or via the port 43 access channel, the terms are not encountered prior to or at the time of submission. Instead, the terms are only provided to end-users after the query has been submitted, Register.com's database has processed and responded to the query submission, and the WHO IS information has been provided to the end-user.\n\nIn this case, submission of a single query does not manifest assent to be bound by the terms of use even though the terms themselves say otherwise. A party cannot manifest assent to the terms and conditions of a contract prior to having an opportunity to review them; a party must be given some opportunity to reject or assent to proposed terms and co nditions prior to forming a contract.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e An end-user who submits a WHOIS query does so without notice of the existence of terms and conditions and thus without an opportunity to reject them. Upon receipt of the WHOIS information, the end-user is presented with Register.com's terms of use, one of which suggests that the end-user has previously agreed to the proposed terms by submitting a query. Actually, there has been no prior agreement to the undisclosed terms.\n\nBy the time Register.com presents its proposed terms, it has already given away that which it \"owns\" - access to its WHOIS database. (Register.com concedes, as it must, that it has no ownership right over the WHOIS information. See supra I.A.3.) Thus, in the single subm ission scenario, an end-user would have had no oppo rtunity to reject Register.com's terms and would be bound to comply with them irrespective of actual assent. Therefore, we find the submission of a W HO IS query prior to the presentation of Register.com's prop osed terms insufficient to constitute a manifestation of assent.\n\nAlthough the first (or first few) query submissions are clearly insufficient to create a contract for the reasons discussed above, repeated exposure to the terms and conditions (via repeated submissions) would have put Verio on notice of both the general terms and the specific term stating that \"By submitting this query, you agree to abide by these terms.\" In fact, Verio admits that it knew of Register.com's terms when it submitted queries. Register.com argues that Verio's course of conduct - rep eatedly submitting queries while being aware of the proposed terms - objectively demonstrates its assent to be bound by Register.com's terms and that Verio's conduct would reasonably lead R egister.com to infer Verio's assent. See Restatement (Second) of Co ntracts, § 19. O n the other hand, Verio argues that even though it knew of the terms, it rejected them and never manifested assent. Based on the circumstances of this case, especially (1) the manner in which the WH OIS database is made accessible by Register.com, (2) Register.com's obligations under the terms of the IC ANN Agreem ent, and (3) the public domain nature of the WHO IS information (i.e., no one owns the information), we find Verio's argument convincing.\n\nWe do not believe that one can reasonably infer that Verio assented to R egister.com's proposed terms simply because Verio submitted multiple queries with knowledge of those terms. Verio (and every other end-user) may repeatedly submit WHOIS queries to Register.com based on an (accurate) understanding that Register.com does not own WH OIS information and that such information must be made freely and publicly available (with two specified restrictions) pursuant to the ICANN Agreement. Viewed in this manner, Register.com's repeated proposals that terms not authorized by the ICANN A greement be adopted could reasonably have been repeatedly rejected by Verio. There is no basis to infer that Verio in fact assented to Register.com's mass marketing restriction. Cf. Step-Saver Data Sys., Inc. v. Wyse Tech., 939 F.2d 91, 103-04 (3d Cir. 1991); accord Expeditors Int'l of Washington, Inc. v. The Official Creditors C omm . (In re CFLC , Inc.), 166 F.3d 1012, 1017 (9th Cir. 1999) (\"Course of dealing analysis is not proper in an instance where the only action taken has been the repeated delivery of a particular form by one of the parties.\").\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\n\nFinally, we note that Register.com's position is undercut by the fact that WHO IS information is public information owned by no one. See supra I.A.3. Register.com does not \"own\" the information, but it does own the datab ase housing W HO IS information for domain names it has registered and hypothetically, i.e., absent the ICANN Agreem ent, could pro hibit access to its database.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e Register.com did not prohibit access to its database, however. Instead, when an end-user submits a WH OIS query, access is granted, the query is processed, and the WHOIS information is sent to the end-user. By the time an end-user receives the WHO IS information and Register.com's proposed terms, Register.com's WH OIS database has already been accessed and the information has already been delivered to the end-user. Absent an ownership right in the information itself, which might allow some use restrictions despite disclosure, there is nothing to prevent an end-user from simply rejecting Register.com's proposed terms and then proceeding to use the information in any desired manner.\n\nIn conclusion, because (1) Register.com did not condition access to its database on acceptance of its terms but instead granted access, thereby giving Verio possession of the WH OIS information, and (2) Register.com's terms were an attempt to unilaterally impose use restrictions not authorized by the ICANN Agreement on information that Register.com does not own, Register.com has failed to establish a sufficient likelihood of success on the merits of its contract claim.\n\n3. Equitable Principles\n\nAny preliminary injunction, including the one sought by Register.com, should be granted only to avoid an inequitable result. In assessing the equities of this case, we cannot igno re Register.com's agreement with the quasi public entity of ICANN , which provides, inter alia, that (1) the information at issue is not owned by Register.com and (2) the public is entitled to access and use the WHO IS information freely, subject to specific limitations set out by ICANN in the agreement, not limitations adopted on an ad hoc basis by registrars such as Register.com. \"For 'several hundred years,' courts of equity have enjoyed 'sound discretion' to consider the 'necessities of the public interest' when fashioning injunctive relief.\" United States v. Oakland Cannabis Buyers' Coop., 532 U.S. 483, 496 (2001)(quoting Hecht Co. v. Bowles, 321 U.S. 321, 329-330 (1944)). Because of the nature of WH OIS information and the contractual relationship between Register.com and ICANN,\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e we believe the dispute between Register.com and Verio involves significant public interests that should have been considered carefully by the district court before granting injunctive relief. \"In exercising their sound discretion, courts of equity should pay particular regard for the public consequences in employing the extraordinary remedy of injunction.\" Weinberger v. R omero-Barcelo, 456 U.S. 305, 312 (1982). To assess whether the district court's failure to do so amounts to an abuse of discretion, we incorporate public interest considerations into our analysis below as appropriate.\n\na. Implications of the ICANN Agreement\n\nAlthough ICANN is a not-for-profit corporation, ICANN is not an ordinary private actor and the ICANN Agreement is not an ordinary contract between private parties. See supra I.A.2, I.A.3. The Agreement acts very much like a franchise agreem ent between a private corporation and a quasi-governmental entity, authorizing registrars to provide registration services to the public in exchange for, inter alia, the obligation to maintain and make publicly available at its expense the WHO IS database, which ultimately benefits the Internet community and the public generally. Although the Agreement expressly disavows any third-party beneficiary rights, it nonetheless embodies important public policies and imposes obligations on registrars for the direct benefit of third-parties and the furtherance of policy goals.\n\ni. ICANN is not simp ly a private entity and the ICANN Agreem ent is more than a simple contract between private parties.\n\nRegister.com argued below and on appeal that the ICANN Agreement is merely an agreement between private parties, and that granting it any additional consideration would run directly counter to the entire purpose behind privatizing the D NS--getting the U.S. government out of the business of regulating the DNS. [Red 53-54] \u003cspan class=\"fnref\"\u003e48\u003c/span\u003e The DNS requires centralized coordination, management and policy-making in order to function efficiently, which is now provided primarily through ICA NN . See generally White Paper, 63 Fed. Reg. 31741 .\n\nWe agree with Register.com that the U.S. government undertook the process of privatizing the DNS in order to get out of the business of regulating the DNS and to shift significant policy-making responsibilities from the U.S. government to a private organization, IC ANN. See id. While the U.S. government may no longer be orchestrating DN S policy directly,\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e ICANN certainly is and must continue to do so. P rivatization of the D NS entails a change in who makes policy decisions. Public policy rem ains an essential co mpo nent of DN S management and is integral to ICANN's agreements with both registrars and registries and to ICANN's very purpose for existing.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e Based on (1) the flurry of oversight activities engaged in by Congress, DOC, and other government agencies, (2) the continued force of government contracts with ICANN (and other relevant entities such as NSI), (3) the structure and very purpose of ICANN, (4) the fact that ICANN performs various regulatory functions previously performed by (or on behalf of) the U.S. government, (5) the fact that the ICANN Agreement (i) is not a product of private negotiations between ICANN and Register.com, but rather was subject to public comment and approval by DOC and NSI as part of a package of agreements concerning DNS management and (ii) is imposed uniformly on registrars seeking ICANN accreditation, and (6) the entire background of the privatization process, we find Register.com's waving of the privatization flag unconvincing.\n\nAccordingly, we reject the district court's conclusion that the ICANN Agreem ent simply \"represents a private bargain\" between private parties; instead, for the purpo ses of analyzing Register.com's claims and Verio's defenses, we view ICANN as a quasi-governmental entity\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e and the ICANN Agreement as the equivalent of a franchise agreement.\n\nii. Although the third-party beneficiary provision precludes Verio from enforcing the ICANN Agreement, equitable principles bar Register.com's attempt to impose unauthorized conditions.\n\nThe third-party beneficiary provision of the ICANN Agreement expressly states that the ICANN Agreement \"shall not be construed to create any obligation by either ICANN or Registrar to any non-party to this Agreement, including any SLD holder.\" ICANN Agreem ent, at § II.S.2. Register.com and V erio debate the scope of this provision. On one hand, Verio argues that it only precludes third-parties from exercising affirmative rights under the ICANN Agreement and that the provision does not preclude third-parties from relying on the Agreem ent as a defense. On the other hand, Register.com argues that the third-party beneficiary provision precludes third-parties from relying on the Agreement in any fashion.\n\nThere can be little doubt that the ICANN Agreement as a whole confers significant benefits on the public, and that the WHO IS information provisions in particular primarily and directly benefit third-parties, such as trademark owners and downstream service providers (i.e., competitors of Register.com) rather than ICANN or Register.com.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e See supra I.B.3. While some courts have recognized third-party beneficiary rights despite express disclaimers in analogous situations,\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e we need not and therefore do not go so far.\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e Rather, we note that because of the demonstrated public policy interests at stake and Register.com's indisputable obligations to ICANN as a registrar, the equities in this case weigh against legitimizing Register.com's improper restrictions by enjoining Verio's use of public information.\n\nMoreover, \"the interference of the court by injunction being founded on pure equitable principles, a man who comes to the court must be able to show that his own conduct in the transaction has been consistent with equity.\" T.B. Harms \u0026 Francis, Day \u0026 Hunter v. Stern, 231 F. 645, 649 (2d Cir. 1916). Register.com cannot show that it has exhibited such conduct regarding these use restrictions it has attempted to impose on public information; Register.com is contractually obligated to a quasi-governmental entity to allow most of the uses which it seeks to enjoin. The injunction sought by Register.com would prohibit Verio's use of information that Register neither owns, nor can rightfully regulate.\n\nIn the interests of equity, and because Register.com did not sufficiently demonstrate either the possibility of irreparable harm or the likelihood of success on the merits of its contract claim, we conclude that the grant of an injunction on this claim was an abuse of discretion.\n\nNone of the forgoing analysis conflicts with the third-party beneficiary disclaimer as written, because we are not construing the ICANN Agreement in a manner that \"creates an obligation\" owed by Register.com to Verio in a contractual sense. ICANN Agreement, at § II.S.2. Rather, we are simply holding that when a plaintiff seeks the extraordinary remedy of a preliminary injunction, relief may be unavailable when, as here, (1) there is an insufficient showing of irreparable harm; (2) a contract may not even have been form ed; and (3) the plaintiff is not in a position to obtain equitable relief. See, e.g., Precision Instrument Mfg. Co. v. Automotive Maintenance Mach. Co., 324 U.S. 806, 814 (1945)(denying injunctive relief when plaintiff's claim of rights to an invention were false)(\"The guiding doctrine in this case is the equitable maxim that \"he who comes into equity must come with clean hands. . .[which] is a self-impo sed ordinance that closes the doors of a court of equity to one tainted with inequitableness or bad faith relative to the matter in which he seeks relief\").\n\nFor these reasons, we reverse the district court's judgment with respect to this claim and vacate the fourth paragraph of the district court's preliminary injunction insofar as it restricts Verio from using WH OIS information obtained from Register.com for telephone and direct mail marketing.\n\nWe leave intact the portion of the injunction that enjoins Verio from transmitting unsolicited commercial electronic mail for two reasons. First, Verio appears to have conceded the point and agreed to be bound by that restriction. [Appellee's Br. at 12 n.13 (Verio has \"discontinued all marketing uses of e-mail addresses derived solely from WHO IS data\" and \"now [only] uses e-mail to contact customers and potential customers when specifically requested by the customer . . .\"); 126 F. Supp. 2d at 244 (Verio told Register.com that it had \"ceased accessing the WHO IS database for the purpose of marketing through e-mail;\" Verio \"ceased e-mail solicitation.\").] Second, on appeal, Verio challenges the marketing restrictions not authorized by the ICANN Agreem ent but does not directly challenge the e-mail marketing restriction. [Appellee's Br. at 1-2, 4, 10-11, 12 n.13, 13-14, 19, 25, 31; Appellee's Reply B r. at 1, 2, 7, 9, 11; see also Appellee's Br. at 18-19 (\". . . Verio relied on the terms of the [ICANN Agreement] in implementing its marketing program using WHOIS data. Register's public assent to those terms estops it from enforcing contradictory use restrictions.\"); id. at 31 (conceding that Register.com is entitled to limit Verio's use of WH OIS data in conformance with ICANN Agreement); but cf. id. at 22-25 (generally challenging restrictions on the use of data based on intellectual property principles); Appellee's Reply Br. at 15-19 (same).]\n\nD. Trespass to Chattels\n\nFollowing the lead of a few courts that have breathed new life into the common law cause of action for trespass to chattels by finding it viable online,\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e Register.com urges this Co urt to do the same. T he issue before us is whether the district court abused its discretion in awarding Register.com preliminary injunctive relief based on its trespass to chattels claim.\n\nThe pertinent facts are as follows: (1) Verio intentionally employed its search robot to make successive queries to Register.com's WHOIS database; (2) the search robot \"used\" Register.com's computer systems and WHOIS datab ase, and thereby consumed some capacity of those systems; (3) the systems have finite capacity;\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e and (4) since at least the initiation of this lawsuit, Verio was not authorized to use its search robot to access Register.com's computer systems.\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e\n\nThe trespass to chattels tort action in New York is based upon principles set forth in the Restatement (Second) of Torts. \"A trespass to chattel occurs when a party intentionally damages or interferes with the use of property belonging to another.\" City of Amsterdam v. Goldreyer, Ltd., 882 F. Supp. 1273, 1281 (E.D.N.Y. 1995) (citing Restatement (Second) of Torts, §§ 217-221 (1965)) (emphases added). Interference may be accomplished by \"dispossessing another of the chattel\" or \"using or intermeddling with a chattel in the possession of another.\" Restatement (Second) of Torts, § 217. Traditionally, courts have drawn a distinction between interference by dispossession, Restatement (Second) of Torts, § 217(a), which does not require a showing of actual damages, id., § 218 cmt. d,\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e and interference by unauthorized use or intermeddling, id., § 217(b), which requires a showing of actual damages, id., § 218 cmt. e.\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e See City of Amsterdam, 882 F. Supp. at 1281 (\"'One who uses a chattel with the consent of another is subject to liability in trespass for any harm to the chattel which is caused by or occurs in the course of any use exceeding the consent, even though such use is not a conversion.'\") (quoting Restatement (Second) of Torts, § 256 ) (emp hasis added); see generally Restatement (Second) of Torts, §§ 218-220 and comm ents thereto (indicating when a trespasser may be held liable).\n\nHere, Verio likely committed a trespass by using a search robot to access Register.com's computer systems without authorization to do so, consuming the comp uter systems' capacity. By virtue of its use of a software rob ot, coupled with the probability of like use by others, Verio could interfere with Register.com's use of its own systems. Relying on the eBay decision for the proposition that any interference with an owner's use of a po rtion of its property causes injury to the owner, the district court concluded that \"evidence of mere possessory interference is sufficient to demonstrate the quantum of harm necessary to establish a claim for trespass to chattels.\" Register.com, 126 F. Supp. 2d at 250 (citing eBay, 100 F. Supp. 2d at 1071);\u003cspan class=\"fnref\"\u003e60\u003c/span\u003e see also CompuServe, 962 F. Supp. at 1022-23 (\"[A]ny value CompuServe realizes from its computer equipment is wholly derived from the extent to which that equipment can serve its subscriber base.\").\u003cspan class=\"fnref\"\u003e61\u003c/span\u003e Unauthorized consumption of Register.com's computer systems' capacity depletes the capacity available at a given time for authorized end-users, which may \"diminish[] the condition, quality, or value\" of the systems. eBay, 100 F. Supp. 2d at 1071 (citing CompuServe, 962 F.Supp. at 1022). More importantly, as the district court found, Verio's unauthorized use of its software robot poses risks to the integrity of Register.com's systems due to potential congestion and overload problems. Register.com has demonstrated to the district court that these risks are real and potentially disruptive of its operations, and that, absent injunctive relief, there is a strong probability that various entities not party to the litigation would engage in similar trespassory activity. We have no reason to disturb these findings.\n\nTherefore, we hold that the district court acted within its discretion in granting preliminary injunctive relief on this claim because (1) Register.com's computer systems are valuable resources of finite capacity, (2) unauthorized use of such systems depletes the capacity available to authorized end-users, (3) unauthorized use of such systems by software robot creates risks of congestion and overload that may disrupt Register.com's operations, and (4) the district court found a strong likelihood that Register.com would suffer irreparable harm absent such relief. See Register.com, 126 F. Supp. 2d at 250-51; see also eBay, 100 F. Supp. 2d at 1071-72 (same). The last factor is central to our holding.\n\nAccordingly, we affirm the district court's issuance of a preliminary injunction on this claim to the extent that the injunction prohibits Verio from accessing Register.com's computer systems by unauthorized use of a software robot. On remand, we direct the district court to modify the third paragraph of its injunction to enjoin Verio only from \"Accessing Register.com's computers and comp uter networks by unauthorized software programs performing multiple, automated, successive queries.\" We do not believe the trespass to chattels claim supports the broader language employed by the district court in that paragraph of the injunction.\n\nE. Computer Fraud and Abuse Act Claims\n\nRegister.com also brought claims under the Computer Fraud and Abuse Act, 18 U.S.C. § 1030 et seq. (\"CFAA\"), arguing that both Verio's use of software robots to access Register.com's WHO IS database and its use of the information obtained with those robots for marketing purposes violated 18 U.S.C. §§ 1030(a)(2)(C) and (a)(5)(C).\u003cspan class=\"fnref\"\u003e62\u003c/span\u003e As the district court properly stated:\n\nBoth §§ 1030(a)(2)(C ) and (a)(5)(C) require that the plaintiff prove that the defendant's access to its computer system was unauthorized, or in the case of § 1030(a)(2)(C) that it was unauthorized or exceeded authorized access. However, although each section requires proof of some degree of unauthorized access, each addresses a different type of harm. Section 1030(a)(2)(C) requires Register.com to prove that Verio intentionally accessed its computers without authorization and thereby obtained information. Section 1030(a)(5)(C ) requires Register.com to show that Verio intentionally accessed its computer without authorization and thereby caused damage.\n\n126 F. Supp. 2d at 251 (emphases removed). The district court concluded that Register.com was likely to succeed on the merits of both claims. We disagree.\n\nRegister.com has not shown that it is likely to satisfy the $5,000 injury threshold for maintaining a civil action under the CFAA. Specifically, to succeed on the merits of a CFAA claim, Register.com m ust prove \"damage or loss\" of at least $5,000 attributable to an alleged violation of the CFAA . See 18 U.S.C. § 1030(g)(\"[A]ny person who suffers damage or loss . . . may maintain a civil action . . . for compensatory damages and injunctive relief or other equitable relief.\"); id. § 1030(e)(8) (defining \"damage\" as \"any impairment to the integrity or availability of data, a program, a system, or information that . . . causes loss aggregating at least $5,000 in value during any 1-year period to one or more individuals . . . .\"). We agree with the (near) unanimous view that any civil action under the CFAA involving \"damage or loss,\" id. § 1030(g), must satisfy the $5,000 threshold, id. § 1030(e)(8)(A). See In re DoubleClick Inc. Privacy Litig., 154 F. Supp. 2d 497, 520-23 (S.D.N.Y. 2001) (excellent statutory construction analysis and thorough exploration of legislative history) [notice of appeal filed 6/28/2002]; accord EF Cultural Travel BV v. Explorica, Inc., 274 F.3d 577, 585 (1st Cir. 20 01); Chance v. Ave. A, Inc., 165 F. Supp. 2d 1153, 1159-60 (W .D. W ash. 20 01); see also United States v. Middleton, 231 F.3d 1207, 1211 (9th Cir. 2000) (applying threshold); Christian v. Sony Corp. Of America, 152 F. Supp. 2d 1184, 1187 (D. M inn. 2001) (same); In re America Online, Inc., 168 F. Supp. 2d 1359, 1374-75 (S.D . Fla. 2001)) (same); Shurgard Storage Ctrs., Inc. v. Safeguard Self Storage, Inc., 119 F. Supp. 2d 1121, 1126-27 (W .D. W ash. 20 00) (same); AOL v. LCGM, 46 F. Supp. 2d 444, 450 (E.D. Va. 1998) (same). But cf. In re Intuit Privacy Litigation, 138 F. Supp. 2d 1272, 1280-81 (C.D. Cal. 2001) (acknowledging that claims for economic damages must satisfy the $5,000 threshold but concluding that \"loss\" means irreparable injury and that non-economic damages may be recovered under 18 U.S.C. §§ 1030(e)(8)(B ) and (C)).\n\nThe district court only addressed this threshold with respect to Register.com's 1030(a)(5)(C) claim.\u003cspan class=\"fnref\"\u003e63\u003c/span\u003e The court noted that on the record before it, Register.com had demonstrated a slight diminishment in capacity, the possibility of a diminishment in response time to customers' queries, and the high probability that other entities not party to the suit would engage in similar conduct as V erio if such conduct were permitted . See 126 F. Supp. 2d at 251-52.\u003cspan class=\"fnref\"\u003e64\u003c/span\u003e The court then concluded: \"If the strain on Register.com's resources generated by robotic searches becomes large enough, it could cause Register.com's computer systems to malfunction or crash. Such a crash would satisfy § 1030(a)(5)(C)'s threshold requirement that a plaintiff demonstrate $5000 in economic damages.\" Id. at 252.\n\nTaking the district court's assessment of the record as accurate, injunctive relief is nevertheless unavailable. To maintain a cause of action under the CFAA against Verio, Register.com must demonstrate the Verio violated the CFAA in a manner that has caused Register.com damages or losses of at least $5,000. There is nothing in the record to suggest that this has occurred. To obtain preliminary injunctive relief on the basis of a CFAA claim, Register.com must demonstrate that it will likely be able to make such a showing. Therefore, accepting the facts as found by the district court, we find it unlikely that Register.com will be successful in showing that it has suffered $5,000 in actual damages or losses as a result of an alleged CFAA violation by Verio.\n\nF. Lanham Act Claims\n\nSection 43(a) of the Lanham Act creates civil liability for certain com mercial actions that are likely \"to cause confusion, or to cause mistake, or to deceive as to the affiliation, connection, or association\" of the defendant with the plaintiff, \"or as to the origin, sponsorship, or approval\" of the defendant's \"goods, services, or commercial activities\" by the plaintiff. See 15 U.S.C. § 1125(a)(1). In this case, the district court concluded \"on the current record that Register.com is likely to succeed on the merits\" of (1) its unfair competition and false designation of origin claims under § 43(a) of the Lanham Act with respect to any e-mail, telephone, or direct mail solicitation that uses the \"Register.com\" or \"first step on the W eb\" marks or any similar marks; and (2) its Lanham Act claims based on Verio's solicitations that suggest that Verio is calling with regard to the registration of the domain name or a problem arising from that registration. See 126 F. Supp. 2d at 255. Based on these conclusions, the district court enjoined Verio from (1) using the \"Register.com\" or \"first step on the web\" marks and (2) representing, or committing any act which is calculated to or is likely to cause third parties to believe that Verio and/or Verio's services are sponsored by, or have the endorsem ent or approval of Register.com. See id.\n\n1. Use of marks\n\nWe find that Verio's appeal of the first paragraph of the district court's injunction is moot for two reasons. First, by a letter dated M ay 9, 2000 , Verio agreed no t to refer to the Register.com mark or any other similar mark in its future solicitations. Enjoining Verio from using the Register.com mark or any other similar mark simply gives effect to Verio's promise and need not be based on the Lanham Act.\n\nSecond, at oral argument, we asked counsel for Register.com whether the company would be amenable to agreeing to the deletion of the part of the preliminary injunction referring to the \"first step on the web\" mark. In a letter submitted by Register.com's counsel the day after oral argument, Register.com agreed to the proposed amendment. Letter from William Patry, Counsel for Register.com, to the Honorable Pierre N. Leval, U.S. Court of Appeals for the Second Circuit (May 22, 2001).\n\nAccordingly, we need not and therefore do not address the district court's preliminary assessment of Register.com's Lanham Act claims insofar as the claims pertain to the use of the \"Register.com,\" \"first step on the web\" or similar marks. We dismiss this part of Verio's appeal and remand for modification the first paragraph of the injunction by deleting the reference to the \"first step on the web\" mark.\n\n2. Actionable conduct not involving marks\n\nVerio used the information it acquired from Register.com's WHOIS database to call up and offer its services to newly registered persons; when a person was not home, the telemarketer would leave a message referring to the person's recent registration and indicating that the caller would call back. Putting aside the questions addressed elsewhere in this opinion concerning how Verio obtained the information and whether its marketing efforts constituted a breach of contract, we must determine whether the district court abused its discretion in concluding that Verio's solicitations likely violate the Lanham Act.\n\nTo be successful on its Lanham Act claims based on Verio's phone calls, Register.com must demonstrate first that Verio engages in actionable conduct, either (1) the use in commerce of a word, term, name, symbol, or device, or any combination thereof; (2) false designation of origin; (3) false or misleading description of fact; or (4) false or misleading representation of fact, see 15 U.S.C. § 1125(a)(1); and second, that such conduct gives rise to a likelihood of confusion, defined as a \"'likelihood that an appreciable number of ordinarily prudent purchasers are likely to be misled, or indeed simply confused, as to the source of the goods in question,' or ... confusion as to plaintiff's sponsorship or endorsem ent\" of the defendant's goods or services. Hormel Foods Corp. v. Henson Prods., Inc., 73 F.3d 497, 502 (2d Cir. 1996) (quoting Mushroom Makers, Inc. v. R.G. Barry Corp., 580 F.2d 44, 47 (2d Cir. 1978)).\n\nThe allegedly actionable conduct involves Verio's telemarketing practices. In their briefs, both parties provide the following representative example of a telemarketing script used by Verio when leaving a voice message:\n\nHello, this message is for John Smith. John, this is Erik Lacy calling from Verio regarding the registration of johnsmithrules.com. Please contact me at your earliest convenience at 800-226-7996, extension 5158 . If I don't hear back from you in a couple of days, I will call back. Again, this is Erik Lacy calling regarding johnsmithrules.com at 800-226-799 6, extension 5158. Thank you.\n\n[Blue 44, Red 22] J.A. 1218 -19 (telemarketing script); see also 126 F. Supp. 2d at 254 (quoting Exs. 44 \u0026 45 to Pl.'s Sept. 8, 2000 M ot.). Acknowledging that whether Verio's solicitations violate the Lanham Act is a close call, the district court found that the \"phrasing\" of the solicitations gives the impression that the call is related to some problem with the registration and that such an impression might lead to confusion as to whether the caller was affiliated with Register.com.\u003cspan class=\"fnref\"\u003e65\u003c/span\u003e While we give significant deference to the district court's factual determinations and are inclined to agree with the district court that Verio's solicitations might lead to some confusion, we believe the court erred in its determination that the so licitations constitute actionable conduct within the meaning of the Lanham Act.\n\nTo be actionable, Verio's solicitations must have included misleading descriptions or representations of fact that are \"calculated to be misunderstood\" in a manner that causes a likelihood of confusion as to whether Verio was in some way affiliated with Register.com.\u003cspan class=\"fnref\"\u003e66\u003c/span\u003e See 15 U.S.C. § 1125(a)(1). There is no evidence to support a finding that Verio's solicitations involved any literal falsehoods--the calls certainly \"regarded\" recent registrations. As recognized in our case law, section 43(a) of the Lanham Act prohibits literally true but nonetheless deceptive representations.\n\nThat Section 43(a) of the Lanham Act encompasses more than literal falsehoods cannot be questioned. . . . Were it otherwise, clever use of innuendo, indirect intimations, and ambiguous suggestions could shield the advertisement from scrutiny precisely when protection against such sophisticated deception is most needed.\n\nAm. Home Prods. Corp. v. Johnson \u0026 Johnson, 577 F.2d 160, 165 (2d Cir. 1978) (citations omitted). Register.com argues that the telemarketing script was designed to falsely lead customers to think that there was a problem with their registration. Yet the only \"representations of fact\" that Register.com can point to in support of this argument are the following generic and truthful statements: \"[T]his is Erik Lacy calling from Verio regarding the registration of johnsmithrules.com\" and \"Again, this is Erik Lacy calling regarding johnsmithrules.com . . .\" The statements are generic in the sense that there are many reaso nable impressions that a listener may perceive upo n hearing them. While the telemarketing script may be vague and thus confusing as to the specific purpose for the call (i.e., to market Verio's downstream services), we find it unlikely that such ambiguity was designed to suggest an affiliation between Verio and Register.com. Furthermore, the script begins with an express identification of the caller: \"Hello, this message is for John Smith. John, this is Erik Lacy calling from Verio regarding the registration of johnsmithrules.com.\" This truthful statement further supports Verio's contention that the script was not intended to be deceptively suggestive of an affiliation between Verio and Register.com.\n\nIn our view, the district court erroneously applied section 43(a) in a manner that eliminates \"false\" and \"misleading\" from the statutory text, such that generic statements likely to cause (some) confusion would give rise to civil liability and entitle a plaintiff to injunctive relief. Based on the record before us and giving as much deference as possible to the district court's factual determinations, we conclude that Verio's telemarketing script is devoid of \"clever use of innuend o, indirect intimations, . . . amb iguous suggestions,\" and other forms of deception designed to cause confusion as to an affiliation between Register.com and Verio; the limited evidence of actual confusion does not indicate otherwise. Therefore, because Verio's telemarketing script did not contain a misleading description or representation of fact, that constituted actionable conduct under the Lanham Act, and because Register.com did not demonstrate a likelihood of success on the merits of this claim, we find no adequate basis for the court's order and vacate the second paragraph of the injunction.\n\nIII. MODIFICATIONS TO THE INJUNCTION\n\nAs a result of the conclusions in this decision, the terms of the preliminary injunction as issued by the district court, see supra, will have to be modified in the following ways on remand.\n\nRegister.com has agreed to striking the part of paragraph one which prohibits Verio's use of the term \"first on the web,\" and the injunction should reflect this concession. The prohibition in paragraph one of Verio's use of the \"Register.com\" mark may stand, since Verio has agreed in a letter to Register.com to cease any use of the mark and thus mooted its appeal of that provision. Because we find that Register.com failed to demonstrate a likelihood of success on its Lanham Act claims, paragraph two is vacated. In regard to the trespass to chattels claim, we direct the district court to modify the third paragraph of its injunction to enjoin Verio only from \"Accessing Register.com's computers and comp uter networks by unauthorized software programs performing multiple, automated, successive queries.\" With respect to our reversal of the district court's judgment regarding Register.com's contract claim, we vacate the fourth paragraph of the district court's preliminary injunction insofar as it restricts Verio from using WH OIS information obtained from Register.com for telephone and direct mail marketing, but leave intact the portion enjoining Verio from using the information to enable the transmission of unsolicited commercial electronic mail.\n\nIV. CONCLUSION\n\nFor the forgoing reasons, we (1) affirm the district court judgment with respect to the trespass to chattels claim, (2) reverse the judgment with respect to the breach of contract and CFAA claims as well as the Lanham Act claim not involving the use of marks, (3) dismiss as moot Verio's appeal of the Lanham Act claim involving marks, (4) vacate the second paragraph of the district court's preliminary injunction, (5) rem and for modification of the first, third, and fourth paragraphs of the district court's preliminary injunction (as set forth above), and (6) remand to the district court for further proceedings consistent with this opinion. T he parties shall bear their own costs.\n\nEnd of Draft Opinion of Judge Fred I. Parker\n\n\u003cspan class=\"fn\"\u003e1. The Honorable John F. Keenan, United States District Judge for the Southern District of New York, sitting by designation. The Honorable Fred I. Parker was a member of the panel but died on August 12, 2003. Judge Parker would have voted to reverse the district court's order. This appeal is being decided by the two remaining members of the panel, who are in agreement. See Local Rule § 0.14(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Judge Parker was not in agreement with this disposition. Deliberations have followed an unusual course. Judge Parker initially was assigned to prepare a draft opinion affirming the district court. In the course of preparing the draft, Judge Parker changed his mind and propo sed to rule in favo r of the defendant, overturning the injunction in most respects. Judge Parker's draft opinion, however, failed to convince the other members of the panel, who adhered to the view that the injunction should be affirmed. Judge Parker died shortly thereafter, prior to the circulation of a draft opinion affirming the injunction, from which Jud ge Parker presumably would have dissented. We attach Judge Parker's draft opinion as an Appendix. W e do so for two reasons: One is to expose Judge Parker's views, which would have been set forth in a dissenting op inion, but for his death; the second is because his opinion contains an exceptionally thorough, detailed and useful statement of facts, including a comprehensive description of the functioning of the domain name system. W e have stated the facts more briefly, mentioning only those points necessary to the arguments discussed, inviting the reader to consult Judge Parker's very thorough fact statement for a more detailed account.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The new legend stated: By submitting a WHOIS query, you agree that . . . under no circumstances will you use this data to . . . support the transmission of mass unsolicited . . . advertising or solicitations via direct mail, electronic mail, or by telephone.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. We note in passing, Judge Parker's characterization of the public policy - that WHOIS information should be \"free as air\" - is a rhetorical oversimplification; the public policy as set forth in the ICANN Agreement expressly contemplated that the WHOIS data not be available for use in mass email solicitation. It also imposed another restriction not pertinent to this appeal and expressly reserved the possibility that further restrictions might be imposed if and when \"ICANN adopts a different policy.\" ICANN Agreement § II.F.5.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Because this opinion will use several acronyms in the course of discussing somewhat complicated technology, we will provide a glossary at the outset to define the most important terms. DNS - Domain Name System. The system which provides the parameters for internet addresses, facilitating organization in a way similar to the way that the system of country and area codes organizes telephone num bers. ICANN - Internet Corporation for Assigned Names and Numbers. A private, non-profit public benefit corporation, authorized by the U .S. government to, am ong other things, administer the internet do main name system. IP Address - Internet Protocol number. The unique identification of the location of an end-user's computer, the IP address serves as a routing address for email and other data sent to that computer over the Internet from other end-users. ISP - Internet Service Provider. An entity which connects individual users to the internet, e.g., America Online, Uunet. NSF - National Science Foundation. The entity to which Congress initially gave the responsibility of soliciting proposals for Internet infrastructure services. NSI - Network Solutions Incorporated. The entity NSF contracted with, to develop and maintain the authoritative database of Internet registrations, the WH OIS database. TLD - Top Level Domain. TLD refers to the final segment of a domain name (e.g., the \".gov\" in \"www.uscourts.gov\"), while a Second Level Domain (\"SLD\") refers to the second to last segment in a name (e.g., \"uscourts\" in the earlier example). URLs - Uniform Resource Locators. Sequences of letters that identify resources in the web, such as documents, images, downloadable files, services, and electronic mailboxes. The URL is the address of the resource, and contains the protocol of the resource (e.g., \"http://\" or \"ftp://\"), the domain names for the resource, and additional information that identifies the location of the file on the computer that hosts the website. WHO IS - A database which is a telephone boo k-like listing of various internet addresses and their holders.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. See infra I.A.3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. See infra I.A.3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. See infra I.A.2, II.C.1.a.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. See infra I.A.3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Numerous courts, including this Court, have discussed the history and operations of the Internet and the DN S in a variety of different contexts. See, e.g., Am. Civil Liberties Union v. Reno, 929 F. Supp. 824, 830-45 (E.D. Pa. 1996 ), aff'd, 521 U.S. 844 (1997); Name.Space, Inc. v. Network Solutions, Inc., 202 F.3d 573, 576-79 (2d Cir. 200 0); Thomas v. Network Solutions, Inc., 176 F.3d 500, 502-04 (D.C. Cir. 1999); In re DoubleClick Inc. Privacy Litig., 154 F. Supp. 2d 497, 501-02 (S.D.N .Y. 2001 ); Smith v. Network Solutions, Inc., 135 F. Supp. 2d 1159, 1160-62 (N.D . Ala. 2001 ); America Online, Inc. v. Huang, 106 F. Supp. 2d 848, 850-53 (E .D. V a. 2000); Nat'l A-1 Adver., Inc. v. Network Solutions, Inc., 121 F. Supp. 2d 156, 159-63 (D .N.H . 2000); Lockheed M artin Corp. v. Network Solutions, Inc., 985 F. Supp. 949, 951-53 (C.D. Cal. 1997 ), aff'd, 194 F.3d 980 (9th Cir. 1999). W e nonetheless find it necessary to tackle these background issues in varying degrees of detail to place this dispute in context.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. This section provides a simplified explanation of the DNS system and its operation. For more extensive background, see Ellen Rony \u0026 P eter Rony, T he Domain Name H andboo k: High Stakes and Strategies in Cyberspace (1998 ); Paul Albitz \u0026 Cricket Liu, DNS and B IND § 2.1 (3d ed. 1998 ), available at http://www.oreilly.com/catalog/dns3/chapter/ch02.html; A. Michael Froomkin, Wrong Turn in Cyberspace: Using ICANN to Route Around the APA and the Constitution, 50 Duke L.J. 17 (200 0).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. This note provides a brief, simplified explanation of how data travels across the Internet. Digital files, or \"content,\" are divided into data packets; each packet is given a destination IP address; the packets are dispersed across the various networks, interconnection nodes, and other resources that make up the Internet's physical infrastructure; while the packets may take different routes based on congestion and other technological considerations, they all have the same destination where the files are eventually reconfigured. See In re DoubleClick Inc. Privacy Litig., 154 F. Supp. 2d 497, 501-02 (S.D.N .Y. 2001 ) (describing packet switching and dynam ic routing). Standardized software protocols, such as Transmission Control Protocol / Internet P rotocol (comm only referred to as TCP/IP), that make up the Internet's logical infrastructure allow data packets to be sent in an efficient manner across different physical resources, despite differences in, inter alia, bandwidth, delay, and error properties. See, e.g., Transmission Control Protocol: DARPA Internet Program Protocol Specification, IET F RFC 793 (Sept. 198 1), available at http://www.ietf.org/rfc/rfc079 3.txt?numb er=7 93 (formally describing T CP); Internet Protocol: DARPA Internet Program Protocol Specification, IET F RFC 791 (Sept. 1981), available at http://www.ietf.org/rfc/rfc0791.txt?number=791 (formally describing IP).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Third and Fourth Level Domains refer to segments further to the left and accordingly correspond to more specific resources, such as a local area network (\"LAN\") and a particular computer within the LAN.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. \"An ISP is an entity that provides access to the Internet; examples include America Online, UUN ET and Juno. Access to the Internet is the service an ISP provides.\" In re DoubleClick Inc. Privacy Litigation, 154 F. Supp. 2d 497, 508 (S.D.N.Y . 2001) (em phasis remo ved). \"[A]ll people and entities that utilize Internet access subscribe to ISPs or are ISPs. Although the vast majority of people who sign-up for Internet access from consumer-focused ISPs such as America Online and Juno are individuals, every Web site, company, university, and government agency that utilizes Internet access also subscribes to an ISP or is one.\" Id. at 509.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The process of \"resolving\" domain names can be quite complicated. For a description, see Name.Space, Inc. v. Network Solutions, Inc., 202 F.3d 573, 577 (2d Cir. 2000); Froomkin, Wrong Turn in Cyberspace, 50 Duke L.J. at 43; Rony \u0026 Rony, The Domain Name Handbook, at 58-86.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Of course, there are complications that we have sidestepped in our example. Actually, an end-user generally will type in a uniform resource locator, commonly referred to as a URL, which includes additional protocol information (e.g., \"http\" or \"ftp\") to the left of the domain name and file-specific information (e.g., /document2.txt) to the right of the domain name. See America Online, Inc. v. Huang, 106 F. Supp. 2d 848, 851 n.5 (E.D.Va. 200 0).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. On the NSF-NSI Cooperative Agreement, see Nat'l A-1 Adver., Inc. v. Network Solutions, Inc., 121 F. Supp. 2d 15 6, 161-63 (D.N.H. 2000).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. In early 1999, there was some controversy over the manner in which NSI managed the WHO IS database; the controversy centered on competition concerns and allegations that NSI restricted access to the database in order to preserve its monopo ly position. As Richard Form an, CEO of Register.com, was quoted as stating in oppo sition to NSI's claim to ownership of WHOIS information it had collected, \"The InterNIC and the W HOIS database were almost like the U.S. Postal Service. It was quasi-public and had a lot of trust built up in it. It was a public entity that people had trust in, and now they've [NSI] turned it into a private vehicle.\" Elizabeth W asserman, Just Whose InterN IC Is It Anyway?, Industry Standard (Mar. 26, 1999), http://www.thestandard.com/article/0,1902 ,4009,00.html.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The DOC originally issued a Request for Comments on DNS administration and after considering over 430 comments, issued a Notice of Proposed Rulem aking on February 20, 1998. See Proposed Rule, Improvement of Technical Mgmt. of Internet Names and Addresses, 63 Fed. Reg. 8826 (Feb. 20, 1998) (commonly referred to as the \"Green Paper\"); Nat'l A-1 Adver., Inc. v. Network Solutions, Inc., 121 F. Supp. 2d 156, 160 (D.N.H. 2000) (discussing these events). However, after receiving more than 650 comments, it ended the rulemaking proceeding and published the White Paper, which essentially responded to the comments and adopted many of the ideas put forth in the Green Paper, but was promulgated as a general statement of policy rather than as a rule. See Name.Space, Inc. v. Network Solutions, Inc., 202 F.3d 573, 578 (2d Cir. 2000); GAO, Dep't of Commerce: Relationship with the Internet Corp. for Assigned Names and N umbers, GAO/OGC-00-33R, at 7 (Jul. 7, 2000), available at http://www.gao.gov/new.items/og00033r.pdf (\"DOC Relationship with ICANN\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The MOU has been amended four times and extended most recently until September 30, 2003. See ICANN 's Major Agreements and Related Reports, http://www.icann.org/general/agreements.htm (providing links to, inter alia, the MOU and its amendments).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. In addition, Congressional com mittees have held various oversight hearings. See, e.g., The Accuracy and Integrity of the WHO IS Database: Hearing Before the Subcomm. on Courts, the Internet and Intellectual Property of the House Comm. on the Judiciary, 107th Cong. (M ay 22, 2002); ICANN Governance: Hearing Before the Communications Subcomm. of the Senate Commerce, Science and Transportation Comm., 107th Cong. (Feb 14, 200 1); Domain Name System Privatization: Is ICANN Out of Control?: Hearing Before the Subcomm. on Oversight and Investigations of the House Comm. on Commerce, 106th Cong. (July 22, 1999 ); H.R. 2417, the Dot Kids N ame Act of 2001: Hearing Before the Subcomm. on Telecommunications and the Internet of the House Comm. on Energy and Commerce, 107th Cong. (Nov. 1, 2001); Oversight Hearing on ICANN, New gT LDS, and the Protection of Intellectual Properties: Hearing B efore the Sub comm. on Courts, the Internet and Intellectual Property of the House Comm . on the Judiciary, 107th Cong. (M ar. 22, 2001); Is ICA NN 's New Generation of Internet Domain Name Selection Process Thwarting Competition?: Hearing Before the Subcomm. on Telecommunications and the Internet of the House Comm. on Energy and Commerce, 107th Cong. (Feb. 8, 2001).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. A registrar is the entity through which end users apply to register domain names. A registry is the entity that maintains the authoritative list of SLD registrations within a particular TLD. W e are not concerned here with ICANN's various agreements with registries, such as its agreement with Societe Internationale de Telecom munications A eronautiques SC (\"SIT A\") under which SITA sponsors the .aero T LD or its agreement with Dot Cooperation LLC (\"D CLLC\") under which DCLLC sponsors the .coop TLD. See ICANN 's Major Agreements and Related Reports, at http://www.icann.org/general/agreements.htm (providing links to, inter alia, the ICANN registry agreements). Although ICANN's relationship with registries is an important part of DNS governance scheme and another indicator of ICANN 's status within the scheme, our focus is on ICANN's agreements with registrars. It is worth noting, however, that ICANN accreditation is essential to registrars in large part because ICANN coordinates the relationships between registrars and registries through its contractual relationships with both sets of entities, as well as other important entities like the DOC.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. \"[A]s part of the transition to a competitive system, NSI's domain name registration service was divided into two separate units: a registrar and a registry.\" Smith v. Network Solutions, Inc., 135 F. Supp. 2d 1159, 1161 (N.D. Ala. 2001). \"The registry unit [renamed VeriSign Global Registry Services] . . . maintains the centralized WHO IS database of all registered SLD names in the .com, .org, and .net TLDs, compiled from the registrations in those TLDs submitted by all registrars, including NSI's registrar unit. Thus, the Registry directly interacts with and serves registrars, rather than end-users of the Internet.\" Id. (internal quotation marks omitted). This centralized WHOIS database is distinct from the distributed system of WH OIS databases maintained by ICANN-accredited registrars. Id. at 1163 n.6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. For a list of ICA NN -accredited registrars, see http://www.icann.org/registrars/accredited-list.html.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The ICANN Agreement was endorsed by ICANN, DOC, and NSI as part of a package of agreements that also included a Registry Agreement between ICANN and NSI, a general purpose agreement (like the ICANN Agreement) to be used by NSI and registrars, an amendment to the Cooperative Agreement between DO C and NSI, and an amendment to the M OU . See Press Release, DOC, U.S. Secretary of Commerce W illiam M. Daley Announces Agreements on Domain Name M anagement, (Sep. 28, 1999 ), available at http://www.ntia.doc.gov/ntiahom e/domainname/agreements/92899secpr.htm; Press Release, ICANN , Press Release on ICANN-D oC-NSI Tenative Agreem ents, (Sep. 28, 1999 ), available at http://www.icann.org/announcements/icann-pr28sept99.htm. The agreements were posted for comment on each party's website. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Thus, pursuant to the ICANN Agreem ent, a registrar must provide, at the very least, free public querybased access to WHOIS information subject to both types of permissible restrictions. If a registrar provides free public access subject to both types of perm issible restrictions but also attempts to impose impermissible restrictions, it provides less than req uired under the ICANN Agreem ent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Register.com conceded during oral argument below that it is not attempting to assert any proprietary rights in the W HO IS information. See Tr. at 38-39 (S.D .N.Y . Sep. 15, 2000 ); see also id. (colloquy between the district court and Register.com's counsel during which Register.com agrees that W HO IS information is equivalent to \"a customer list that is public information.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. By using an automated process to query Register.com's W HO IS database through the port 43 channel, Verio avo ided the point-and-click process described in this subsection. Port 43 access is functionally equivalent to web-based access; the primary difference is that web-based access is designed to be user-friendly. We nonetheless provide this brief illustration to better understand Register.com's contract claim and for the following additional reasons: (1) the district court notes that Register.com's terms of use are clearly posted on its site; (2) the parties include and reference copies of Register.com's webpages in the appendix; (3) the parties argue whether a clickthrough mechanism is necessary for contract formation (requiring that we analyze the web-based access); and (4) the web-based illustration provides an easily understandable example of how the WHOIS information and terms generally are obtained from registrars' databases.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. This description of the communications between an individual and Register.com is obviously simplified. For a slightly more detailed discussion, see supra note 8 and I.A.1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Interestingly, ICANN subsequently revised the Registrar Accreditation Agreement to permit restrictions on the use of WH OIS information to \"allow, enable, or otherwise support the transmission by e-mail, telephone, or facsimile of mass, unsolicited, commercial advertising or solicitations to entities other than the data recipient's own existing customers.\" Registrar Accreditation Agreement (\"Revised ICANN Agreement\"),§ 3.3.5 (May 17, 2001), http://www.icann.org/registrars/ra-agreement-17may01.htm. We do not consider this revision material to the instant dispute, however.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Instead of using the search robot, V erio could have obtained bulk access licenses from the registrars to gather the same WHO IS information, but then it would have had to wait for weekly delivery and pay up to $10,000 annually per license.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Although Register.com and ICANN have also criticized Verio's use of its search robot to collect the registrar names from NSI's computer system, see ICANN Amicus Br., at 15 [JA-2885], that issue is not before us.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Register.com cited an e-mail received by a customer which identified Verio as the sender but stated \"[b]y now you should have received an email from us confirming the registration of your domain name(s) ... you have taken the first step towards having your own website ... the next step is to set up a hosting account ...\" E x. 4 to P l.'s Sept. 8, 2000 M otion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. In his concurrence, Judge Newman stated, \"I fully agree that the public interest concerns expressed by Judge Pierce weigh heavily in favor of maintaining the status quo pending prompt resolution of the merits, and for that reason concur in the result.\" Standard \u0026 Poor's, 683 F.2d at 712. District Judge Knapp concurred \"for the reasons expressed by Judge Newman.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. As noted above, Verio did not proceed through Register.com's interactive webpage but did receive query results along with Register.com's terms of use.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. The Ticor court noted that the contract provision allowing for an injunction in the event that the defendant breached the non-compete \"might arguably be viewed as an admission by [the defendant] that plaintiff will suffer irreparable harm were he to breach the contract's non-compete provision.\" Ticor, 173 F.3d at 69.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. The court in Danielson reasoned that \"it is inescapable that the initial deliberate blockage of supplies and vandalism have a continued delaying effect upon the completion of the project, its availability to tenants and a postponement of rentals. The picketing concededly continues and there is reasonable cause to b elieve that it is unlawful. We do not agree therefore that it is just and proper to withhold equitable relief simply because the picketing has failed to shut down the operation but only delays performance which results in the incurring of expenses and prevention of profits.\" 479 F.3d at 1037.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. The parties do not disp ute that N ew York law governs Register.com's breach of contract and trespass to chattels claims.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. The leading case holding such a licensing arrangement enforceable as a matter of contract law is ProCD, Inc. v. Zeidenberg, 86 F.3d 1447 (7th Cir. 1996) (applying Wisconsin law and UCC § 2). In ProCD, the plaintiff compiled \"information from more than 3,000 telephone directories into a computer database\" and distributed the datab ase as a commercial product on CD-ROM . Id. at 1449. A consumer that purchased one of ProCD's CD-ROMs was given (1) notice of the license on the product packaging and (2) an oppo rtunity to review the terms and conditions once the package was opened and the CD-ROM was placed in a computer, and (3) was \"forced\" to either accept the license by proceeding to use the database or reject the license by declining to proceed, in which case (4) the consumer could return the CD-ROM and obtain a refund. See id. at 1452 (\"[T]he software [on the ProCD CDROM] splashed the license on the screen and wo uld not let [Zeidenberg] proceed without indicating acceptance.\"). The Seventh Circuit held that the shrinkwrap licence was an acceptable means of creating an enforceable contract, at least where the elements noted above are present. Id. at 1452-53.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. As the Seventh Circuit noted in ProCD, there are many examples of situations in which consumers buy something prior to viewing or being given (proposed) terms and co nditions. See id. at 1451-52 (analyzing various \"money now, terms later\" consumer purchases such as insurance, airline tickets, concert tickets, radios, drugs, and software). Importantly, however, in such situations the consumer, on one hand, has surrendered some consideration ex ante in anticipation of an exchange and with notice that some terms will apply, and on the other hand, has the opportunity, after being given the terms but not access to the desired product, to reject them and obtain a refund of the consideration surrendered. See id.; Hill v. Gateway 2000, Inc., 105 F.3d 1147, 1148 (7th Cir. 1997) (same).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. While Register.com owns its WHO IS database and various computer systems that allow the database to be accessed, Register.com does not own the WHO IS information. See supra I.A.3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. For a description of a clickwrap license, see Specht, 150 F. Supp. 2d at 593-94; Casp i v. The Microsoft Network, L.L.C.,323 N.J. Super. 118, 122, 732 A.2d 528, 530 (N.J. Super. Ct. App. D iv. 199 9). \"The few courts that have had occasion to consider click-wrap contracts have held them to be valid and enforceable.\" Specht, 150 F. Supp. 2d at 594 (citing In re RealNetworks, Inc. Privacy Litig., No. 00C1366, 2000 WL 631341 (N.D. Ill. May 8, 200 0); Hotmail Corp. v. Van$Money Pie, Inc., No. C-98 JW PVT ENE, C 98-20064 JW, 1998 WL 388389 (N.D. Cal. April 16, 1998)); see Compuserve, Inc. v. Patterson, 89 F.3d 1257 , 1260 (6th Cir. 1996 ); I.Lan Sys., Inc. v. Netscout Serv. Level Corp., 183 F. Supp. 2d 328, 338 (D. M ass. 2002).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. The first and last sentence of Register.com's terms of use begin with \"By submitting this query, you agree . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. Courts have found the timing of contract formation to be extremely important and have held that a party may manifest assent only after being given some oppo rtunity to review the terms. See, e.g., ProCD, 86 F.3d at 1451-52; Hill v. Gateway 2000, 105 F.3d at 1148; see also Step-Saver Data Sys., 939 F.2d at 103-04 (same principles but approaching the shrinkwrap situation as a proposed modification of an existing agreement). Notably, the \"assent first, terms later\" arrangement employed by Register.com is distinguishable from \"pay now, terms later\" arrangements. ProCD and its progeny generally rely on the proposition that a contract is formed not at the time of purchase or earlier but rather when the purchaser either rejects by seeking a refund or assents by not doing so within a specified time, providing the purchaser with an opportunity to review the proposed terms. See, e.g., Brower v. Gateway 2000, Inc., 246 A.D.2d at 251 (following ProCD approach).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. As the Ninth Circuit noted in adopting the Step-Saver approach: The Step-Saver court gave two reasons for refusing to extend course of dealing analysis to a situation where the parties had not previously taken any action with respect to the matters addressed by the disputed terms. See [Step-Saver, 939 F.2d] at 104. First, the repeated exchange of forms merely indicated the seller's desire to have these terms included. The failure to obtain the purchaser's express assent to those terms indicates the seller's agreement to do business on other terms--those expressly agreed upon by the parties. Second, a seller in multiple transactions will typically have the oppo rtunity to negotiate the precise terms of the parties' agreement. The seller's unwillingness or inability to obtain a negotiated agreem ent reflecting its desired terms strongly suggests that those terms are not a part of the parties' commercial bargain. See id. In re CFLC, Inc., 166 F.3d at 1017.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. As noted above, if Register.com opted to prohibit access to its W HO IS database, Verio has conceded that it would be unable to assert any third-party rights under the ICANN Agreement to compel Register.com to provide access. Verio would have to rely on ICANN's procedures. See supra II.C.1.b.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. See supra I.A.2-3 and infra II.C.1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. Essentially, the U.S. government (as well as other governments and the Internet community) has attempted to safeguard public interests throughout the privatization process by incorporating protections in the ICANN decision making process and in ICANN 's agreements with registries and registrars. See supra I.A.2 (discussing privatization); I.A.3 (d iscussing ICANN Agreement); see generally Green Paper, 63 Fed. Reg. 8826; White Paper, 63 Fed. Reg. 31741. To read various public interest provisions out of the ICANN Agreement would unravel much of what has already been accomplished.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. Whether the U.S. government is in fact orchestrating DNS policy is a complicated question that we need not reach.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. As described in the background section above, ICANN took over key governance responsibilities from the U.S. government and was formed in direct response to the DOC W hite Paper's call. ICANN's Articles of Incorporation and Bylaws evince a clear understanding that the private corporation was created to orchestrate DNS policy to serve the public.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. Many courts have implied or noted in passing that ICANN perform s quasi-governmental functions. See, e.g., Sallen v. Corinthians Licenciamentos LTDA, 273 F.3d 14, 20 (1st Cir. 2001) (noting that ICAN N \"administers the domain name system pursuant to\" the M OU with the D OC); Bird v. Parsons, No. 00-4556, 2002 WL 1012175, at *2 (6th Cir. M ay 21, 2002) (noting that ICANN regulates domain name registration); Nat'l A-1 Adver., Inc. v. Network Solutions, Inc., 121 F. Supp. 2d 156, 163 (D.N.H. 2000) (\"[DOC] designated [ICANN] as the body responsible for DNS po licy. . . . ICANN assumed responsibility for . . . establishing DNS policy, IP address space allocation, protocol number parameter assignments, and root server system management functions\"); Parisi v. Netlearning, Inc., 139 F. Supp. 2d 745, 747 (E.D.Va. 2001) (\"ICANN exerts quasi-governmental sway over the growth and administration of the Internet\"); Weber-Stephen Prod. Co. v. Armitage Hardware and Bldg. Supply, Inc., No. 00 C 1738, 2000 W L 562470, at *1 (N.D. Ill. May 03, 2000) (\"ICANN is a new, quasi-governmental internet-regulating body.\"). But cf. Thomas v. Network Solutions, Inc., 176 F.3d 500, 510-11 \u0026 n.18 (D.C. Cir. 1999) (finding that domain name registration itself is not a government service).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. See Koch v. Consolidated Edison Co., 62 N.Y.2d 548, 559 (1984) (agreements between PASNY and Con Edison were made \"precisely\" for the benefit of third-party plaintiffs as evidenced by the service agreement which contained the express ob ligation to \"operate and maintain all the facilities necessary to deliver power to Astoria-Indian Point Customers [which included plaintiffs] in accordance with good utility operating practice\"); Cutler v. Hartford Life Ins. Co., 22 N.Y.2d 245, 253 (1968) (\"[T]he true beneficiary of the insurance was the wife, despite the nominal designations in the certificate of insurance and the group policies of Crosby as the recipient of the insurance proceeds. It was the wife who wo uld reap eco nomic benefit from the insurance rather than Crosby . . . . In truth, as between Crosby and the wife, the wife is the intended beneficiary, or, at least, the ultimate intended beneficiary.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. See Twin City Constr. Co. v. ITT Industrial Credit Co., 358 N.W.2d 716, 718-19 (Minn. Ct. App. 1984) (defendant intended to benefit third-party plaintiff despite contract provision stating \"N o third party is entitled to rely on any provisions in this agreement.\"); Versico, Inc. v. Engineered Fabrics Corp., 520 S.E.2d 505, 508 (Ga. Ct. App. 1999) (finding contract ambiguity in similar circumstances and resolving ambiguity in favor of third-party).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. Both parties agree that, due to the express disclaimer in § II.S.2, Verio cannot compel compliance or seek damages for benefits not delivered by bringing a cause of action against either Register.com or ICANN for breaching the ICANN Agreement. We need not and therefore do not address whether the parties' shared view on this point is accurate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. See, e.g., eBay, Inc. v. Bidder's Edge, Inc., 100 F. Supp. 2d 1058 (N.D. Cal. 2000) (holding that Internet auction aggregating site that used software robot to harvest pricing information was liable to Internet auction site for trespass and that aggregating site's conduct was likely to cause irreparable harm); Oyster Software Inc. v. Forms Processing Inc., No. C-00-0724 JCS, 2001 W L 17363 82 (N.D . Cal. 2001 ) (deciding no t to dismiss trespass to chattels claim where defendant allegedly used a software robot to copy metatag information); America Online, Inc. v. LCGM, Inc. (\"AOL v. LCGM\"), 46 F. Supp. 2d 444 (E.D. Va. 1998) (sending unsolicited bulk e-mail constituted trespass to chattels); America Online, Inc. v. IMS, 24 F. Supp. 2d 548 (E.D . Va. 1998 ) (same); CompuServe, Inc. v. Cyber Promotions, Inc., 962 F. Supp. 1015 (S.D. Ohio 1997) (same); Intel Corp. v. Hamidi, 114 Cal. Rptr. 2d 244, 94 C al. App. 4th 325 (Cal. Ct. App. 2001) (same), pet. for rev. granted, 43 P .3d 587 (Mar. 27, 2002); see also Thrifty-Tel, Inc. v. Bezenek, 54 Cal. Rptr. 2d 468, 46 Cal. App. 4th 1559 (Cal. Ct. App. 1996) (ap plying trespass to chattels where two teenagers hacked into the equipment of a long-distance telephone provider.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. To be clear, the chattels in question are Register.com's computer systems, and the alleged trespass is Verio's intentional, unauthorized consumption of the capacity of those systems to handle, process and respond to queries. W e do not believe that system capacity is itself a chattel \"possessed\" by Register.com or those that use Register.com's computer systems. Rather, \"capacity\" describes the amount of use (or potential use) that a resource can sustain. For example, capacity may describe the data processing potential of a computer system, the data storage potential of a comp uter system, and/or the information carrying potential of telecommunications facilities. See, e.g., Academic Press Dictionary of Science and Technology (Hartcourt 2002)(defining capacity as \"the maximum rate at which a computer system can process work;\" \"the total amount of data that a computer memory component can store\"), available at http://www.harcourt.com/dictionary/def/1/7/0/0/1700500.html; Newton's Telecom Dictionary 149 (16th ed. 2000) (explaining the different capacity measurements for different facilities, such as data lines, switches, and coaxial cables); see generally Meriam-W ebster's Collegiate Dictionary 168 (10th ed. 2000) (defining capacity as \"the potential or suitability for holding, storing, or accommodating\" and also as \"the facility or power to produce, perform, or deploy: CAP ABILIT Y \").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. As discussed in more detail elsewhere in this opinion, Verio was authorized to access Register.com's WHO IS database through either the web interface or the port 43 access channel. At mo st, Verio exceeded its authorization by using its robot after being told by Register.com not to do so. The district court indicated that V erio knew that it lacked authorization since at least the initiation of this lawsuit, 126 F. Supp. 2d at 249 (emphasis added), implying that Verio may have known at an earlier date. We do not disturb this finding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. Trespass to chattels by dispossession \"action will lie although there has been no impairment of the condition, quality, or value of the chattel, and no other harm to any interest of the possessor.\" Id., § 218 cmt. d.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. As noted in comment e to § 218: The interest of a possessor of a chattel in its inviolability, unlike the similar interest of a possessor of land, is not given legal protection by an action for nominal damages for harmless intermeddlings with the chattel. In order that an actor who interferes with another's chattel may be liable, his conduct must affect some other and more important interest of the possessor. Therefore, one who intentionally intermeddles with another's chattel is subject to liability only if his intermeddling is harmful to the possessor's materially valuable interest in the physical condition, quality, or value of the chattel, or if the possessor is deprived of the use of the chattel for a substantial time, or some other legally protected interest of the possessor is affected . . . . Id. § 218 cmt. e.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. eBay, a search robot case, relied on CompuServe, an unsolicited bulk email case. See eBay, 100 F. Supp. 2d at 1071-72.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. The CompuServe court ultimately relied on allegations, supported by affidavit, that CompuServe \"suffered several types of injury as a result of defendants' conduct.\" 962 F. Supp. at 1022-23.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. 18 U .S.C. § 1030 provides, in pertinent part: § 1030. Fraud and related activity in connection with computers (a) W hoever-- . . . (2) intentionally accesses a computer without authorization or exceeds authorized access, and thereby obtains-- . . . (C) information from any protected computer if the conduct involved an interstate or foreign com munication; . . . (5) . . . (C) intentionally accesses a protected computer without authorization, and as a result of such conduct, causes damage; . . . shall be punished as provided in subsection (c) of this section.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. With respect to the 1030(a)(2)(C) claim, the district court found only that Verio's \"harvesting and subsequent use of [the WHOIS] data has caused and will cause Register.com irreparable harm.\" 126 F. Supp. 2d at 253.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. The district court rejected Register.com's contention that \"lost revenue [and goodwill] from Verio's exploitation of the WH OIS data for marketing purposes\" constitute \"damage or loss\" within the meaning of the CFAA. Id. at 252 n.12. Register.com has not challenged this ruling on appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. While some of Register.com's customers may be confused upon hearing Verio's message and get the impression that there is a problem with their registrations, there are other equally if not more probable impressions that they co uld get, particularly given the fact that they knew that their information would beco me publicly available in the W HO IS database. For example, John Smith, the fellow in Verio's script, might believe that Verio represents another John Smith concerning a domain name dispute or possibly seeking to purchase the domain name. He also might conclude accurately that Verio is a telemarketer.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. Black's Law Dictionary defines \"misleading\" as \"delusive; calculated to be misunderstood.\" Black's Law Dictionary 1015 (7th ed. 1999).\u003c/span\u003e\n\n",
    "body_length": 183394,
    "citedas": [
      "356 F.3d 393",
      "69 U.S.P.Q.2d 1545"
    ],
    "attorneys": "William F. Patry, New York, NY (Kenneth A.Plevan, Scott D. Brown, Paul M. Fakler, on thebrief), for Appellee. Michael A. Jacobs, San Francisco, Ca,(James E. Hough, Mark David McPherson, on thebrief) for Appellant.",
    "category": [
      "251",
      "252"
    ],
    "judges": "Before: Leval, Circuit Judge, and J. F. Keenan, District Judge.*fn1",
    "citation_count": 306
  }
}
