{
  "id": "TYHtPWYBTlTomsSBzV-n",
  "document": {
    "title": "Cipollone v. Liggett Group",
    "full_title": "ANTONIO CIPOLLONE, INDIVIDUALLY AND AS EXECUTOR OF THE ESTATE OF ROSE D. CIPOLLONE IN 88-5784 v. LIGGETT GROUP, INC., A DELAWARE CORPORATION; PHILIP MORRIS INCORPORATED, A VIRGINIA CORPORATION, AND LORILLARD, INC., A NEW YORK CORPORATION, PHILIP MORRIS, INC. IN 88-5771, LORILLARD, INC. IN 88-5770, LIGGETT GROUP, INC. IN 88-5732",
    "jurisdiction": "Third Circuit",
    "date": "1990-01-05T00:00:00.000Z",
    "docket": "Nos. 88-5732, 88-5770, 88-5771, 88-5784",
    "body": "Opinion OF THE COURT\n\nBECKER, Circuit Judge.\n\nI. INTRODUCTION\n\nThis appeal is from a final judgment in a protracted products liability case in which the plaintiff, Antonio Cipollone, seeks to hold Liggett Group, Inc., Lorillard, Inc., and Philip Morris, Inc., three of the leading firms in the tobacco industry, liable for the death from lung cancer of his wife, Rose Cipollone, who smoked cigarettes from 1942 until her death in 1984. Jurisdiction is founded on diversity of citizenship, 28 U.S.C. § 1332, and New Jersey law applies. In an earlier opinion in the case, Cipollone v. Liggett Group, Inc., 789 F.2d 181 (3d Cir. 1986), cert. denied, 479 U.S. 1043, 107 S. Ct. 907, 93 L. Ed. 2d 857 (1987), we held that the Federal Cigarette Labeling and Advertising Act (\"Labeling Act\"), 15 U.S.C. §§ 1331-1340 (1982 \u0026 Supp. II 1984), which became effective January 1, 1966, preempted claims arising from smoking after January 1, 1966 (hereinafter post-1965) based upon the cigarette companies' advertising or promotion of cigarettes or upon the adequacy of their warnings as to the hazards of smoking.\n\nFollowing that opinion, which stemmed from an interlocutory appeal, see 28 U.S.C. § 1292(b), the case proceeded to a four-month long trial. At the conclusion of the trial, the jury, answering a series of special interrogatories, returned a verdict in the sum of $400,000.00 for the plaintiff in his individual capacity on the breach of express warranty claim. The jury also found the defendants strictly liable for failing to warn adequately of the hazards of their products, but returned a verdict in their favor on that claim because of Mrs. Cipollone's comparative fault. More precisely, the jury apportioned 80% of the responsibility for Mrs. Cipollone's injuries to her because of its finding that she knew and appreciated the damages of cigarette smoking and voluntarily chose to smoke.\n\nBoth sides have appealed, raising a plethora of issues. The prime defendant is Liggett Group, Inc. (\"Liggett\"), whose cigarettes Mrs. Cipollone smoked from 1942 to 1968. The briefs focus primarily on alleged errors in the district court's charge to the jury and on specific jury findings that may have preclusive effect. Considerable attention was also devoted to ancillary issues: the viability of the plaintiff's generic risk-utility theory of liability (the district court granted summary judgment for the defendants thereon); the failure of the district court to award plaintiff prejudgment interest; the district court's grant to plaintiff of partial summary judgment on defendants' statute of limitations defense; and the effect of our preemption decision on plaintiff's intentional tort claims (the district court held them to be preempted).\n\nThe most problematic issue on this appeal lies in the skewing effect on the trial of our interlocutory preemption decision, which created an artificial (although legally binding) time constraint on the determination of causation and liability. Under the aegis of that decision, the jury was forbidden to consider the effect of the defendants' post-1965 conduct and, concomitantly, could only consider whether a pre-1966 breach of warranty and failure to warn was the proximate cause of Mrs. Cipollone's smoking and death. However, the district court allowed the jury to consider Mrs. Cipollone's post-1965 smoking, on the theory that her post-1965 behavior was relevant to a comparative fault defense.\n\nWe conclude that the district court erred in permitting the jury to make a comparative fault determination based on Mrs. Cipollone's post-1965 behavior. Rather, the jury should have been instructed that Mrs. Cipollone's post-1965 conduct bore only on the apportionment of damages, but not on her comparative fault for her own injuries. Although in some respects the fairest and most natural approach would be to let the jury consider both sides' post-1965 conduct to the extent that it bears on apportionment of damages, that result would impermissibly impinge on the immunity from suit afforded the cigarette companies by the Labeling Act. Still, permitting the defendants to take advantage of Mrs. Cipollone's post-1965 conduct to escape liability altogether, particularly in the face of plaintiff's allegations that defendants engaged in post-1965 conduct designed to reassure smokers, creates an unacceptable imbalance.\n\nThe only way to give effect to our preemption decision and yet ensure fairness in the trial is to limit the evidence going to Mrs. Cipollone's comparative fault to her pre-1966 conduct. We find this result to be consistent with, and indeed compelled by, the New Jersey Supreme Court decision in Ostrowski v. Azzara, 111 N.J. 429, 545 A.2d 148 (1988). Thus, Mr. Cipollone is entitled to a new trial on his failure to warn claim.\n\nLiggett's appeal on the express warranty claim presents an abstruse question about the nature of the reliance interest required by U.C.C. section 2-313, N.J.S.A. § 12A:2-313. The attention we pay to this issue on appeal is somewhat ironic, given that the extensive trial focused on other theories of liability, particularly strict liability. The jury's verdict for the plaintiff on an express warranty theory makes our analysis necessary, however.\n\nWe conclude that the express warranty charge was flawed and that that portion of the verdict must also be set aside. Primarily, the district court erred to the extent that it prevented Liggett from proving, by a preponderance of the evidence, that Mrs. Cipollone did not believe the advertisements. The advertisements constitute an express warranty as long they constitute a basis of the bargain, that is, as long as Mr. Cipollone can prove that Mrs. Cipollone was aware of the advertisements and as long as Liggett does not prove that she disbelieved them.\n\nWe conclude that the district court did not err in barring a comparative fault defense to the express warranty claim because, on the facts of this case, it would have been impossible for Mrs. Cipollone to have known of the dangers of smoking and still have believed enough in Liggett's advertisements for them to constitute a warranty. In essence, the comparative fault issue collapses into the basis of the bargain issue. We further conclude that the district court did not err in denying Liggett's motion for judgment n.o.v., because there was sufficient evidence in the record to support conclusions that a warranty existed and was breached and that breach of that warranty proximately caused Mrs. Cipollone's cancer.\n\nWe reverse the district court's grant of summary judgment to defendants on plaintiff's generic risk-utility claim. Although our holding on this issue is subject to instant modification by the New Jersey Supreme Court, which presently has the issue before it, we find that the district court improperly granted defendant's motion for a directed verdict. Thus, plaintiff still has live claims against all three defendants in this case; although Mrs. Cipollone did not smoke cigarettes made by Lorillard and Philip Morris until after 1965 (hence absolving them from liability on the breach of express warranty and failure to warn claims), they remain potentially liable on the risk-utility claim, which does not implicate advertising, promotion or warnings. We also conclude that if Mr. Cipollone prevails on an express warranty claim on retrial, he is entitled to prejudgment interest. We reverse the district court's grant of partial summary judgment for the plaintiff on the statute of limitations issue because we conclude that there was a genuine issue of material fact as to whether, within the meaning of the New Jersey discovery rule, Mrs. Cipollone should have discovered the facts giving rise to her claim earlier. Finally, we agree with the district court that plaintiff's intentional tort claim is preempted by our previous decision.\n\nII. THE RELEVANT FACTS ADDUCED AT TRIAL\n\nRose Cipollone was born in 1925 and began to smoke in 1942. She smoked Chesterfield brand cigarettes, manufactured by Liggett, until 1955. In her deposition, introduced into evidence at the trial, she stated that she smoked the Chesterfield brand to be \"glamorous,\" to \"imitate\" the \"pretty girls and movie stars\" depicted in Chesterfield advertisements, and because the advertisements stated that Chesterfield cigarettes were \"mild.\" Mrs. Cipollone stated that she understood the description of Chesterfield cigarettes as \"mild\" to mean that the cigarettes were safe.\n\nMrs. Cipollone also testified that she was an avid reader of a variety of magazines, frequently listened to the radio, and often watched television during the years that she smoked the Chesterfield brand. Although she could not specifically remember which Chesterfield advertisements she saw or heard during those years, Chesterfield advertisements appeared continuously in those media during that period. Several of these advertisements were introduced into evidence. The following copy appeared commonly in Chesterfield magazine advertisements during the year 1952:\n\nPLAY SAFE Smoke Chesterfield.\n\nNOSE, THROAT, and Accessory Organs not Adversely Affected by Smoking Chesterfields. First such report ever published about any cigarette. A responsible consulting organization has reported the results of a continuing study by a competent medical specialist and his staff on the effects of smoking Chesterfield cigarettes. A group of people from various walks of life was organized to smoke only Chesterfields. For six months this group of men and women smoked their normal amount of Chesterfields -- 10 to 40 a day. 45% of the group have smoked Chesterfields continually from one to thirty years for an average of 10 years each. At the beginning and at the end of the six-months period each smoker was given a thorough examination, including X-ray pictures, by the medical specialist and his assistants. The examination covered the sinuses as well as the nose, ears and throat. The medical specialist, after a thorough examination of every member of the group, stated: \"It is my opinion that the ears, nose, throat and accessory organs of all participating subjects examined by me were not adversely affected in the six-month period by smoking the cigarettes provided.\"\n\n5 J.A. 21, 22 (c. 1952).\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e The defendants stipulated that Mrs. Cipollone had seen many of these advertisements.\n\nTelevision advertisements for the Chesterfield brand were also introduced into evidence. The Chesterfield cigarette was described as having \"ingredients that make Chesterfield the best possible smoke as tested and approved by scientists from leading universities,\" 5 J.A. 37 (undated), and being manufactured with \"electronic miracle\" technology that makes \"cigarettes . . . more better [sic] and safer for you.\" 5 J.A. 39 (c. 1955). One advertisement stated \"now Chesterfield is the first cigarette to present this scientific evidence on the effects of smoking -- a medical specialist making regular bi-monthly examinations of a group of people from various walks of life -- 45% of this group have smoked Chesterfield's for an average of over 10 years -- after 8 months, the medical specialist reports that he observed no adverse effects to the nose, throat and sinuses of the group who were smoking Chesterfield. I'd say that means real mildness.\" 5 J.A. 36 (undated).\n\nMrs. Cipollone testified that she frequently listened to the radio show \"Arthur Godfrey and His Friends,\" sponsored by the Chesterfield brand. The Chesterfield brand was marketed on the show as follows (text read by Mr. Godfrey):\n\nYou saw me read this last week but a lot of folks didn't and it's a very important message -- especially those of you who smoke Chesterfields -- you probably been wonderin' about this. You hear stuff all the time about \"cigarettes are harmful to you\" this and that and the other thing . . . .\n\nHere's an ad, you've seen it in the papers -- please read it when you get it. If you smoke it will make you feel better, really.\n\n\"Nose, throat and accessory organs not adversely affected by smoking Chesterfield. This is the first such report ever published about any cigarette. A responsible consulting organization has reported the results of a continuing study by a competent medical specialist and his staff on the effects of smoking Chesterfield cigarettes.\n\n\"A group of people from various walks of life was organized to smoke only Chesterfields. For six months this group of men and women smoked their normal amount of Chesterfields -- 10 to 40 a day. 45% of the group have smoked Chesterfields continually from one to thirty years for an average of 10 years each.\n\n\"At the beginning and at the end of the six months period each smoker was given a thorough examination, including X-Ray pictures, by the medical specialist and his assistants. The examination covered the sinuses as well as the nose, ears and throat.\"\n\nNow -- here's the important thing. \"The medical specialist, after a thorough examination of every member of the group, stated: 'It is my opinion that the ears, nose, throat and accessory organs of all participating subjects examined by me were not adversely affected in the six-months period by smoking the Chesterfield cigarettes provided.'\"\n\nNow that ought to make you feel better if you've had any worries at all about it. I never did. I smoke two or three packs of these things every day. I feel pretty good. I don't know, I never did beliee they did you any harm and now, we've got the proof. So -- Chesterfields are the cigarette for you to smoke, be they regular size or king-size.\n\n5 J.A. 156 (Sept. 24, 1952).\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nIn 1955, Mrs. Cipollone stopped smoking Chesterfield cigarettes and began to smoke L \u0026 M filter cigarettes, also made by Liggett. In response to a question as to why she switched to the L \u0026 M brand, Mrs. Cipollone stated that \"well, they were talking about the filter tip, that it was milder and a miracle it would keep the stuff inside a trap, whatever.\" When asked why she desired the filter tip, she testified that \"it was the new thing and I figured, well, go along[, and that] it was better [because the] bad stuff would stay in the filter then.\" When asked whether concern about the \"bad stuff\" was due to a concern about her health, she stated \"not really. . . . It was the trend. Everybody was smoking the filter cigarettes and I changed, too.\"\n\nShe also stated that although she could not remember any specific advertisements, she did \"recall the ads and . . . remember the tips [and] the messages of a filter, a safer, something to that effect. . . . That it would filter the nicotine and the tar and the tobacco[, and] that it would be a cleaner and fresher smoke.\" Mrs. Cipollone also stated that she \"recall[ed] seeing an ad that said doctors recommend you smoke . . . I think it was L \u0026 M's. . . . Through advertising, I was led to assume that they were safe and they wouldn't harm me. . . . There was lots of advertising. There was advertising everywhere. There was advertising in magazines, on billboards, in newspapers.\"\n\nMr. Cipollone also introduced evidence as to how the L \u0026 M brand was marketed during the years that Mrs. Cipollone smoked that brand. One series of advertisements that appeared on television and in magazines at the outset of L \u0026 M's introduction to the public stated that L \u0026 M \"miracle tip\" filters were \"just what the doctor ordered!\"; the \"just what the doctor ordered\" phrase often appeared in a large bold typescript in magazine advertisements. The \"miracle tip\" was advertised as \"remov[ing] the heavy particles, leaving you a Light and Mild smoke.\"\n\nIn 1968, Mrs. Cipollone stopped smoking the L \u0026 M brand and started smoking the Virginia Slims brand, manufactured by Philip Morris. She stated that she switched \"because it was very glamorous and very attractive ads and it was a nice looking cigarette. That persuaded me.\" In the 1970's, Mrs. Cipollone switch to the Parliament brand, also manufactured by Philip Morris. She testified that this brand was advertised as having a \"recessed\" filter and that she thought that this made it healthier. In 1974, she changed from the Parliament to the True brand, a cigarette manufactured by Lorillard, Inc. (\"Lorillard\") and advertised as low tar, upon the advice of her doctor, who had told her son to stop smoking.\n\nFrom 1942 until the early 1980's, Mrs. Cipollone smoked between one pack and two packs of cigarettes per day. The only exception to this pattern was that, at the urging of her husband, Mrs. Cipollone substantially reduced her smoking during her first pregnancy in the 1940's. In 1981, Mrs. Cipollone was diagnosed as having lung cancer, but even though her doctors advised her to stop smoking, she was unable to do so. Mrs. Cipollone continued to smoke until June of 1982 when her lung was removed. Even after that, she smoked occasionally, in secret. She testified that she was \"addicted\" to cigarette smoking and that it was terribly difficult for her to give it up. She stopped smoking in 1983 after her cancer had spread widely and she had become terminally ill. Mrs. Cipollone died on October 21, 1984.\n\nEvidence was also introduced on the subject of Mrs. Cipollone's awareness of the health consequences of smoking cigarettes. Some of that evidence has already been alluded to: she switched to the L \u0026 M brand in part because she thought that brand safer than the Chesterfield brand, and she later switched to the Parliament and True brands out of concern for her health. In addition, from the beginning of the Cipollones' marriage in 1947, Mr. Cipollone repeatedly told his wife that she should stop smoking because it was unlady-like and bad for her health. When reports linking smoking with cancer and heart disease began to appear in the media, Mr. Cipollone repeatedly brought them to his wife's attention. Other members of the Cipollone family also told her that cigarette smoking was dangerous to her health and could cause cancer. After January 1, 1966, every package of cigarettes purchased by Mrs. Cipollone bore the Congressionally mandated warning labels.\n\nThere is also evidence that Mrs. Cipollone feared that her cigarette smoking would damage her health. When she developed a bad cough, her concern about the possible effect of smoking on her health led her, apparently prior to 1966, to make novenas to Saint Jude asking his intercession on her behalf to prevent her from developing cancer. There is also evidence, however, that Mrs. Cipollone disbelieved the reports linking cigarette smoking to cancer and other health problems. As explained above, there is evidence that she read the cigarette companies' advertisements, understood them as representing that the cigarettes were safe, and thus, as she put it, \"was led to assume that [the cigarettes that I purchased] wouldn't harm me.\" She stated that she had often read cigarette company or Tobacco Institute statements, reported in articles about the health consequences of smoking or reproduced in advertisements, stating that the link between smoking and disease has not been proven. She also testified that because she found it so difficult to stop smoking, she \"maybe . . . didn't want to believe\" the reports that she heard that smoking caused cancer or other diseases and that she \"didn't believe\" that her smoking would cause her to contract lung cancer. In addition, Mrs. Cipollone stated that she believed that \"tobacco companies wouldn't do anything that was really going to kill you.\"\n\nIII. PROCEDURAL HISTORY\n\nOn August 1, 1983, Mr. and Mrs. Cipollone filed a complaint in the district court for the District of New Jersey, founded on diversity of citizenship, seeking damages against Liggett, Philip Morris, and Lorillard for the suffering and monetary losses resulting from Mrs. Cipollone's lung cancer. The complaint alleged that the lung cancer resulted from Mrs. Cipollone's smoking of cigarettes manufactured by the named defendants.\n\nOn May 31, 1985, following Mrs. Cipollone's death, and suing in his capacity as Mrs. Cipollone's executor and on his own behalf, Mr. Cipollone filed a third amended complaint, upon which the case was tried. The third amended complaint included damages claims against each defendant based on the following theories of liability:\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\n1. Strict liability in tort (and negligence) on the theory that the defendants' failed to warn adequately (or negligently failed to warn adequately) of the health effects of smoking (\"the failure to warn claim\");\n\n2. Strict liability in tort on the theory that the defendants marketed defectively designed cigarettes rather than alternatively designed, safer cigarettes (\"the design defect claim\");\n\n3. Strict liability in tort on the theory that the health risks of the defendants' cigarettes exceeded their social utility (\"the generic risk-utility claim\");\n\n4. Breach of express warranty regarding the health effects of smoking (\"the express warranty claim\");\n\n5. Fraud and misrepresentation in the advertising and promotion of cigarettes from 1940 to 1983 (\"the fraudulent misrepresentation claim\");\n\n6. Conspiracy to defraud the public regarding the health effects of smoking (\"the conspiracy to defraud claim\");\n\nThe defendants moved for summary judgment on the ground that the plaintiff's claims were preempted by the Federal Cigarette Labeling and Advertising Act, Pub.L. No. 89-92, 79 Stat. 282 (1965)(codified as amended at 15 U.S.C. §§ 1331-1340 (1982 \u0026 Supp. II 1984)), a statute enacted in 1965 in the wake of the Surgeon General's historic report on the hazards of cigarette smoking. The Act required health warnings, as set forth in the statute and subsequently strengthened by statutory amendments, to be placed on cigarette packages. The effective date of the statute was January 1, 1966. See Pub.L. No. 89-92, § 11, 79 Stat. at 284.\n\nThe district court held that the statute did not have preemptive effect, but certified the preemption question for interlocutory review by this court pursuant to 28 U.S.C. § 1292(b) (1982). We assumed jurisdiction over the appeal and concluded that the Act impliedly preempted some of the plaintiff's claims, holding as follows:\n\nThe Act preempts those state law damage actions relating to smoking and health that challenge either the adequacy of the warning on cigarette packages or the propriety of a party's actions with respect to the advertising and promotion of cigarettes. . . . Where the success of a state law damage claim necessarily depends on the assertion that a party bore the duty to provide a warning to consumers in addition to the warning Congress has required on cigarette packages, such claims are preempted as conflicting with the Act.\n\n789 F.2d at 187 (footnote omitted). We remanded the case to the district court so that it might determine which claims were preempted.\n\nThe district court interpreted our decision as preempting the plaintiff's failure to warn, express warranty, fraudulent misrepresentation, and conspiracy to defraud claims to the extent that they sought to challenge the defendants' advertising, promotional, and public relations activities after January 1, 1966. See 649 F. Supp. 664, 669, 673-75 (D.N.J. 1986). Because Mrs. Cipollone did not smoke cigarettes manufactured by Philip Morris or Lorillard before January 1, 1966, the district court granted judgment on the pleadings on the failure to warn and express warranty claims as to those defendants. However, the district court held that the plaintiff's design defect and risk-utility claims were not preempted. See id. at 669-72.\n\nIn another pretrial ruling, the district court struck the plaintiff's generic risk-utility claim on the ground that it was barred through the retroactive application of the New Jersey Products Liability Act, 1987 N.J. Sess. Law Serv. ch. 197, 188-93 (West) (codified at N.J.S.A. §§ 2A:58C-1 to -7 (West 1987)). See Dist. Ct.Op. 1-6 (Oct. 27, 1987).\n\nAfter five years of discovery and numerous pretrial motions, the case proceeded to trial on plaintiff's failure to warn, design defect, express warranty, fraudulent misrepresentation, and conspiracy claims, and on defendants' comparative fault and statute of limitations defenses. On April 21, 1988, at the close of plaintiff's proofs, the district court struck the design defect claim on the ground that plaintiff had failed to present sufficient evidence that defendants' failure to market an alternatively designed cigarette when it became feasible to do so in the mid-1970s was a proximate cause of Mrs. Cipollone's illness and death. See 683 F. Supp. 1487, 1493-95 (D.N.J. 1988). This ruling has not been challenged on appeal.\n\nAs a result of the district court's rulings, jury deliberations were limited to the fraudulent misrepresentation claim against each defendant, the conspiracy to defraud claim against each defendant, the failure to warn claim against Liggett, and the express warranty claim against Liggett. The district court also took the defendants' statute of limitations defense from the jury by granting partial summary judgment for the plaintiff on this issue. See Dist. Ct.Op. (Dec. 21, 1987).\n\nAfter a four-month trial, the jury deliberated for four and one half days and returned its verdict in the form of answers to special interrogatories. See Fed.R.Civ.P. 49(a). The interrogatories and the jury's answers are as follows:\n\n1. Has plaintiff proven all of the elements necessary to establish fraudulent misrepresentation or concealment by defendant Liggett, prior to 1966, of material facts concerning significant health risks associated with cigarette smoking?\n\nYes\n\nNo X\n\n2. Has plaintiff proven all of the elements necessary to establish fraudulent misrepresentation by defendant Philip Morris, prior to 1966, of material facts concerning significant health risks associated with cigarette smoking?\n\nYes\n\nNo X\n\n3. Has plaintiff proven all of the elements necessary to establish fraudulent misrepresentation by defendant Lorillard, prior to 1966, of material facts concerning significant health risks associated with cigarette smoking?\n\nYes\n\nNo X\n\n4. Was there a conspiracy prior to 1966 to fraudulently misrepresent and/or conceal material facts concerning significant health risks associated with cigarette smoking?\n\nYes\n\nNo X\n\n5. If you answered \"yes\" to question #4, were any of the defendants members of that conspiracy?\n\nLiggett Group, Inc. Yes No\n\nPhilip Morris Incorporated Yes No\n\nLorillard, Inc. Yes No\n\n6. If you answered \"yes\" to question number 5, has plaintiff proven all of the elements necessary to establish fraudulent misrepresentation or concealment, prior to 1966, by any member of the conspiracy?\n\nYes\n\nNo\n\n7. Should Liggett, prior to 1966, have warned consumers regarding health risks of smoking?\n\nYes X\n\nNo\n\n8. If you answered \"yes\" to question 7, was that failure to warn prior to 1966 a proximate cause of all or some of Mrs. Cipollone's smoking?\n\nYes X\n\nNo\n\n9. If you answered \"yes\" to question 8, was such smoking a proximate cause of Mrs. Cipollone's lung cancer and death?\n\nYes X\n\nNo\n\n10. If you answered \"yes\" to question 9, did Mrs. Cipollone voluntarily and unreasonably encounter a known danger by smoking cigarettes?\n\nYes X\n\nNo\n\n11. If you answered \"yes\" to question 10, was this conduct by Mrs. Cipollone a proximate cause of her lung cancer and death?\n\nYes X\n\nNo\n\n12. If you answered \"yes\" to question 11, what is the percentage of responsibility for Mrs. Cipollone's injuries attributable to each of the following parties:\n\nMrs. Cipollone 80%\n\nLiggett Group, Inc. 20%\n\n.\n\n13. Did Liggett make express warranties to consumers regarding the health aspects of its cigarettes?\n\nYes X\n\nNo\n\n14. If you answered \"yes\" to question 13, did any Liggett products used by Mrs. Cipollone breach that warranty?\n\nYes X\n\nNo\n\n15. If you answered \"yes\" to question 14, was Mrs. Cipollone's use of these products a proximate cause of her lung cancer and death?\n\nYes X\n\nNo\n\n16. If you answered \"yes\" to any of the following questions: 1, 2, 3, 6, 9 or 15, what damages did Mrs. Cipollone sustain?\n\n$none\n\n17. If you answered \"yes\" to any of the following questions: 1, 2, 3, 6, 9, or 15, what damages did Mr. Cipollone sustain?\n\n$400,000\n\n18. If you answered \"yes\" to any of the following questions: 1, 2, 3, 6 or 9, is plaintiff entitled to punitive damages against one or more of the defendants?\n\nYes\n\nNo X\n\n19. If you answered \"yes\" to question 18, to what amount is plaintiff entitled?\n\n20. If you awarded a sum under question 19, what amount of this total is attributable to each of the following parties?\n\nLiggett Group, Inc. $Philip Morris Incorporated $Lorillard, Inc. $As the answers to the interrogatories indicate, the jury rejected the fraudulent misrepresentation claims and the conspiracy to defraud claims against all defendants. As to the failure to warn claim against Liggett, the jury concluded that Liggett breached its duty to warn of the health hazards of smoking before 1966, that this breach was a proximate cause of Mrs. Cipollone's smoking, and that Mrs. Cipollone's smoking was a proximate cause of her death. No damages were awarded on the failure to warn claim, however, because New Jersey's comparative fault law bars a plaintiff from recovering damages if she is more than 50% at fault for the injury, and the jury found that Mrs. Cipollone \"voluntarily and unreasonably encounter[ed] a known danger by smoking cigarettes\" and in so doing bore 80% of the responsibility for her injuries. As to the express warranty claim, the jury found that Liggett had breached an express warranty made to consumers. The jury awarded Mr. Cipollone $400,000 to compensate him for damages that he sustained from Liggett's breach of warranty; the jury awarded Mrs. Cipollone's estate no damages on the breach of warranty claim.\n\nOn June 29, 1988, the plaintiff moved for a new trial on the limited issue of Mrs. Cipollone's damages and to amend the judgment to include prejudgment interest pursuant to New Jersey Court Rule 4:42-11(b). On July 1, 1988, Liggett moved for judgment n.o.v. and, in the alternative, for a new trial on account of alleged error in the district court's jury instructions on express warranty and in its special interrogatories. On August 24, 1988, the district court denied all of the post-trial motions. See 693 F. Supp. 208 (D.N.J. 1988). The defendants and Mr. Cipollone filed timely notices of appeal.\n\nIn its appeal, Liggett contends that the district court made the following prejudicial errors in its jury instructions: (1) it failed to instruct the jury that Mrs. Cipollone's nonreliance on the Liggett advertisements would preclude her recovery on the express warranty claim; (2) it failed to instruct the jury that a buyer's actual knowledge of a warranty-breaching condition bars recovery on an express warranty claim under the doctrine of assumption of risk or contributory fault; and (3) it erroneously instructed the jury in several respects on the failure to warn claim, most significantly by failing to impose a but-for causation requirement.\n\nLiggett also contends that the district court erred in failing to grant its motion for judgment n.o.v. on the express warranty claim on the grounds that (1) the jury's finding that Mrs. Cipollone \"voluntarily and unreasonably encounter[ed] a known danger by smoking cigarettes\" established lack of proximate causation as a matter of law; (2) the plaintiff offered no evidence that Mrs. Cipollone's lung cancer was proximately caused by any claimed breach of express warranty; and (3) the evidence cannot support a finding that any Liggett advertisement made a warranty covering health effects in the future from forty years of smoking. Liggett also contends that the district court erred by granting plaintiff partial summary judgment on defendants' affirmative defenses based on the statute of limitations.\n\nIn his appeal, Mr. Cipollone contends that (1) the district court's jury charge and interrogatories on the failure to warn issue erroneously and unfairly allowed the jury to consider Mrs. Cipollone's post-1965 smoking in determining her percentage of comparative fault; (2) the district court erred in applying the New Jersey Products Liability Act to strike the risk-utility claim; (3) the district court's refusal to award prejudgment interest contravenes New Jersey Court Rule 4:42-11(b); and (4) the district court erred in applying our preemption decision to the intentional tort claims (i.e. the fraudulent misrepresentation and conspiracy to defraud claims). Mr. Cipollone also announced that if the verdict in his favor on the breach of express warranty claim and his contention that he is entitled to prejudgment interest were upheld, he would not press his other contentions.\n\nIn its protective cross-appeal, Philip Morris contends that Mr. Cipollone's intentional tort claims are preempted, and that, in any event, these claims are mooted by the jury's findings. In its protective cross-appeal, Lorillard asserts that, in view of Mr. Cipollone's concession that he would be satisfied to accept the breach of express warranty verdict plus prejudgment interest, our assumption of jurisdiction over Mr. Cipollone's appeal relative to the claims against it and Philip Morris would violate the \"case or controversy\" requirement of Article III of the United States Constitution.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Lorillard also contends that the intentional tort claims are preempted by the Labeling Act.\n\nIV. SHOULD MRS. CIPOLLONE'S POST-1965 CONDUCT HAVE BEEN CONSIDERED IN DECIDING HER COMPARATIVE FAULT ON THE FAILURE TO WARN CLAIM?\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nThe New Jersey Comparative Fault Act, N.J.S.A. 2A:15-5.1, states that:\n\nContributory negligence shall not bar recovery in an action by any person . . . to recover damages for negligence resulting in death or injury to person or property, if such negligence was not greater than the negligence of the person against whom recovery is sought. . . . Any damages sustained shall be diminished by the percentage sustained of negligence attributable to the person recovering.\n\nThe Comparative Fault Act can apply to strict liability actions if the plaintiff's conduct can be found to constitute contributory negligence. See Suter v. San Angelo Foundry \u0026 Machine Co., 81 N.J. 150, 164, 406 A.2d 140, 147 (1979). Thus, if Mrs. Cipollone were more than 50% responsible for her own smoking, as the jury found her to be, plaintiff would be barred from recovering under his failure to warn claim. As we have noted, the interplay between New Jersey's comparative fault scheme and the preemptive effect of the Labeling Act produced an anomalous situation at trial. The district court did not distinguish between Mrs. Cipollone's pre-1966 and post-1965 conduct when instructing the jury to consider the degree to which she was at fault pursuant to New Jersey comparative fault law.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nThe wording of special verdict interrogatories 10, 11, and 12 was to the same effect,\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e permitting the jury to consider Mrs. Cipollone's fault to the extent it believed that she acted unreasonably in continuing to smoke after 1965. However, the court instructed the jury not to consider Liggett's post-1965 conduct. Mr. Cipollone contends that the jury instructions were inconsistent with Ostrowski v. Azzara, 111 N.J. 429, 545 A.2d 148 (1988), in which the New Jersey Supreme Court held that once a legal wrong has occurred, plaintiff's conduct after that time bears only on mitigation of damages (even if some of plaintiff's injuries have not yet manifested themselves). Such conduct does not, however, bear on whether plaintiff's comparative fault falls above or below the 50% threshold.\n\nMr. Cipollone also contends that the district court's jury instructions were asymmetrical and unfair because they permitted the jury to use Mrs. Cipollone's post-1965 conduct to bar her claim even though the post-1965 marketing practices of the defendant were free from scrutiny. He points out that the jury was required to bar Mrs. Cipollone's failure to warn claim in its entirety if it believed that she was 80% responsible for her injury in light of her smoking from 1942 to 1983 even if it believed that Liggett's failure to warn was, for example, 67% responsible for Mrs. Cipollone's smoking from 1942 to 1966.\n\nBecause the facts and reasoning of Ostrowski are so important to our resolution of the issue of Mrs. Cipollone's post-1965 conduct, we recount them in some detail. Mrs. Ostrowski was a patient whose diabetes, poor diet, and cigarette smoking caused her to have severe blood circulation problems. She went to her podiatrist to complain of soreness in her left toe. After several visits, and after considering her representation (which proved to be false) that she had seen her internist regarding her diet and insulin dosage, the podiatrist recommended that the toe nail on the sore toe be removed to allow drainage. After the surgery, the plaintiff continued to smoke, despite advice that she should stop (because smoking greatly increases the blood circulation problems caused by diabetes). Several weeks after the surgery, it became clear that the blood flow to the toe was insufficient to heal the toe; the plaintiff was left with a non-healing, pre-gangrenous wound. Mrs. Ostrowski had to undergo three different by-pass surgeries to increase blood circulation to the toe. The last operation involved a vein transplant from one leg to the other.\n\nMrs. Ostrowski sued the podiatrist, contending that the podiatrist was negligent in her initial decision to remove the toe nail, that the toe nail should not have been removed, and that her subsequent problems with her leg were proximately caused by the podiatrist's negligence. The podiatrist contended that the plaintiff was at fault in both her pre-surgery and post-surgery conduct and that this conduct contributed to her injuries. The jury found that the podiatrist had acted negligently in removing the plaintiff's toenail but found that plaintiff's fault, based on both her pre- and post-surgery conduct, exceeded that of the podiatrist (51% to 49%). The plaintiff's recovery was therefore barred by the trial court under New Jersey comparative fault law because her fault exceeded 50%.\n\nThe Appellate Division of the Superior Court affirmed, but the Supreme Court of New Jersey reversed. Because the podiatrist's negligence was in performing the toe surgery, the Court conceptualized the plaintiff's behavior after treatment had begun but before the toe surgery as relevant to comparative fault. However, the Court concluded that her post-surgery behavior was relevant only to avoidable consequences.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e On remand, the jury was instructed to arrive at two percentage figures regarding plaintiff's conduct: first, the degree to which her conduct after treatment had begun was responsible for the toe surgery, and second, the degree to which her conduct after treatment had begun -- considering her conduct both before and after the toe surgery -- was responsible for her ultimate injury, the bypass surgery. If the first percentage (the plaintiff's fault for the toe surgery) was less than the physician's fault for the toe surgery, the plaintiff would recover. Her recovery, however, would be offset by the second percentage times the damages suffered (which reflects plaintiff's total responsibility for her ultimate injury).\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e If the first percentage was greater than the physician's fault for the surgery, plaintiff's recovery would be barred by the Comparative Fault Act.\n\nThe Court distinguished between the plaintiff's conduct before and after the toe surgery on the ground that \"avoidable consequences . . . come[] into action when the injured party's carelessness occurs after the defendant's legal wrong has been committed\" but \"contributory negligence . . . comes into action when the injured party's carelessness occurs before defendant's wrong has been committed or concurrently with it.\" 111 N.J. at 438, 545 A.2d at 152.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e In explaining why it thought that the jury should arrive at two percentages to measure plaintiff's fault, the Court reasoned that \"it would be the bitterest irony if the rule of comparative negligence, designed to ameliorate the harshness of contributory negligence, should serve to shut out any recovery to one who would otherwise have recovered under the law of contributory negligence [because her contributory conduct was relevant to avoidable consequences rather than contributory negligence].\" Id. at 441-42, 545 A.2d at 154.\n\nThe Court held that the plaintiff's conduct before treatment had begun was irrelevant to both the comparative fault and avoidable consequence inquiries, under the doctrine that the \"'defendant \"must take the plaintiff as he finds him.\"'\" Id. at 438, 545 A.2d at 152 (citation omitted). Nevertheless, the Court made clear that the plaintiff's conduct before treatment had begun was not totally irrelevant to the case: that conduct was relevant to determining what damages were a proximate result of the defendant's negligence, because, as we have noted, some of the damage to the plaintiff's leg could have been caused not by the defendant's negligence but by the plaintiff's pre-treatment condition. See id. at 448, 545 A.2d at 157.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nWe agree with Mr. Cipollone's contention that it is appropriate to conceptualize our preemption decision as imposing an automatic cut-off date for imposition of liability. We further agree with Mr. Cipollone that, in light of the preemption decision, the doctrines set out in Ostrowski should have been applied in this case. As Liggett emphasizes throughout its brief, its post-1965 marketing practices could not form the basis for any tort or warranty claim as a matter of law; hence, Liggett's arguably tortious conduct was completed as of January 1, 1966. Therefore, Mrs. Cipollone's post-1965 conduct should have been considered as relevant to avoidable consequences, possibly reducing her damages but not foreclosing liability.\n\nWe reject Liggett's contention that \"application of plaintiff's interpretation of Ostrowski would require this court to hold that the case overruled the New Jersey Supreme Court's [product liability] decisions in Suter v. San Angelo Foundry \u0026 Machine Co., 81 N.J. 150, 406 A.2d 140 (1979); Maiorino v. Weco Products Co., 45 N.J. 570, 214 A.2d 18 (1965) and Cintrone v. Hertz Truck Leasing, 45 N.J. 434, 212 A.2d 769 (1965). Liggett's Br. at 43 n.50. Liggett's argument apparently is that the instant case is no different from the typical toxic tort case in which there may be a significant interval between the time of defendant's wrongful act (the sale of or exposure to the defective product) and the time plaintiff's injury from use of the product manifests itself. Therefore, according to Liggett, all of the plaintiff's pre-injury conduct should bear on comparative fault. Our preemption decision renders this analogy inapposite, however. In the more typical case, the jury considers all of the defendant's pre-injury conduct also. Because that cannot happen here, we find it unfair and impermissible for the jury to consider Mrs. Cipollone's comparative fault during the period (1966-1981) for which Liggett's conduct is unjudgable.\n\nWe have no way of knowing how much of the 80% fault that the jury ascribed to Mrs. Cipollone is attributable to her pre-1966 smoking and how much to her post-1965 smoking. The judgment entered on the jury verdict in Liggett's favor on the failure to warn claim must therefore be reversed (the error is obviously not harmless) and the case remanded for a new trial on that issue.\n\nWe do not dispute Liggett's contention that we could analyze the case differently. However, we believe that the artificial cut-off so skews the normal balance that only the Ostrowski avoidable consequences analysis can mitigate the unfairness and disruption to state tort law wrought by our preemption decision. We acknowledge that the retrial must proceed, to some extent, with an artificial distinction between conduct before and after January 1, 1966, and that the expert witnesses will face a difficult task on allocating the consequences of pre-1966 and post-1965 conduct. However, that result is forced upon us by the circumstances. This will not be the first time, nor the last, that a legal construct will have constrained a trial. We are confident that the extremely able lawyers and the distinguished trial judge in whose hands this case rests will do it justice.\n\nOn retrial, the jury should be asked whether Liggett's pre-1966 failure to warn caused Mrs. Cipollone to smoke cigarettes.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e The jury must consider the relative degrees to which Mrs. Cipollone and Liggett were at fault for Mrs. Cipollone's pre-1966 smoking. If Mrs. Cipollone is thought to have been more than 50% at fault than Liggett for her pre-1966 smoking, then the failure to warn claim ends there, and Mrs. Cipollone's recovery is barred on that claim. If, however, the jury finds that Mrs. Cipollone's pre-1966 fault for her smoking is 50% or less (and that that smoking was a proximate cause of her cancer), the jury must then consider the issue of avoidable consequences, considering Mrs. Cipollone's conduct both before and after January 1, 1966. The jury may not evaluate the propriety of the defendants' cigarette marketing practices after 1965, because the defendants have been absolved from liability for otherwise tortious and unfair marketing practices by the Labeling Act.\n\nV. DID THE DISTRICT COURT OTHERWISE ERR IN INSTRUCTING THE JURY ON THE FAILURE TO WARN CLAIM?\n\nLiggett contests several facets of the district court's jury charge on the failure to warn claim. Had the verdict on the failure to warn claim not been set aside on the grounds set forth in Part IV, we would have had to address these arguments in connection with Liggett's contention that the jury's answers to interrogatories 7, 8 and 9, in which it found that Liggett's failure to warn was a proximate cause of Mrs. Cipollone's injuries, should be set aside. We nonetheless discuss most of these issues because they are important for a proper retrial.\n\nFirst, Liggett contends that it was under no duty to warn of the dangers of cigarettes because their dangers were commonly understood. We find that there is no basis for so holding as a matter of law, and that as a matter of fact the jury found otherwise.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nLiggett next argues that (1) the district court erred in instructing the jury on Liggett's duty to disclose the results of its scientific tests and (2) the district court's use of the word \"obviousness\" confused the jury. We find both of these contentions to be without merit. Under New Jersey law, Liggett had a duty to conduct research, and to disclose significant dangers discovered as a result of that research. See Feldman v. Lederle Laboratories, 97 N.J. 429, 453-55, 479 A.2d 374, 386-88 (1984). Moreover, there was nothing confusing about the district court's use of the word \"obvious.\" The jury had no reason to think that it might be deciding an \"open and obvious\" danger case, see, e.g., Shaffer v. AMF, Inc., 842 F.2d 893 (6th Cir. 1988), and therefore it could not have been prejudicially confused.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nLiggett's more substantial contention has to do with the district court's instruction on causation, which defines proximate cause\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e as follows:\n\na cause which necessarily set the other causes in motion and was a substantial contributing factor in bringing about the injury. Proximate cause is defined as a cause which naturally and probably led to and might have been expected to produce the result complained of.\n\n2 J.A. 91-92. The district court also instructed the jury that \"there may be two or more concurrent and directly cooperative and efficient proximate causes of an injury\" if the defendant was \"a substantial contributing factor\" in the plaintiff's injuries. 2 J.A. 93.\n\nIt is not exactly clear what fault Liggett finds with this instruction. Liggett claims that: \"Plaintiff was required to prove that 'but for' Liggett's claimed failure to warn Mrs. Cipollone would not have been injured -- that had Liggett provided a warning prior to 1966 Mrs. Cipollone would have quit smoking or never started smoking, and by doing so, Mrs. Cipollone would have avoided lung cancer in 1981.\" Liggett Br. at 50. There are three possible interpretations of Liggett's objection.\n\nFirst, Liggett may be arguing that, even if plaintiff proves by a preponderance of the evidence that the totality of Liggett's violation of legal norms -- its failure to warn and breach of warranty -- was a \"but for\" cause of Mrs. Cipollone's lung cancer, the jury could not find for the plaintiff with respect to any individual Liggett violation unless the plaintiff demonstrated by a preponderance of the evidence that that individual violation caused Mrs. Cipollone's lung cancer. This bifurcation of Mr. Cipollone's lawsuit into two independent claims might allow Liggett to escape liability for the totality of its wrongful conduct. We find this argument untenable.\n\nAs a substantive matter, Liggett is liable if its behavior proximately caused Mrs. Cipollone's cancer. For pleading purposes, Mr. Cipollone divided Liggett's conduct up into different pre-established legal categories, i.e. a tort-based failure to warn claim and a contract-based express warranty claim. Although the elements of proof necessary to prove liability under these two legal theories differ, the procedural pleading and proof requirements do not transform Mr. Cipollone's allegations into two completely different lawsuits. Thus, Mr. Cipollone does not have to prove that each legal violation proximately caused his wife's cancer. He need only prove that the totality of Liggett's wrongful behavior, which as doctrinal matter is divided into a tort and contract claim, proximately caused her cancer.\n\nSecond, Liggett may be arguing that Mrs. Cipollone's conduct would have caused her cancer no matter what Liggett did, and that therefore Liggett's conduct cannot be considered the cause of Mrs. Cipollone's injury. This argument is plainly inconsistent with the established jurisprudence of concurrent causation. The \"substantial factor\" test has traditionally been used in concurrent cause cases, i.e. cases in which there are two or more causes each of which is sufficient to cause the injury.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e See Keeton et. al., Prosser and Keeton on The Law of Torts 266-68 (5th ed. 1984). Our preemption decision makes this case quite comparable to a concurrent cause situation. Liggett's pre-1966 behavior might have been enough, by itself, to cause Mrs. Cipollone's cancer, and its post-1965 behavior might also have been enough to cause the cancer. Thus, just as it is unfair to let one tortfeasor completely escape liability for his fire merely because another tortfeasor caused another fire, so it is unfair to let Liggett completely escape liability for its pre-1966 behavior merely because its post-1965 behavior (or that of its codefendants), which was immunized from scrutiny at the trial, might also have caused enough damage, by itself, to kill her.\n\nThird, Liggett may be arguing that Mr. Cipollone had to prove, to a greater degree of certainty than the district court's instruction required, that Liggett's failure to warn caused her injuries. Under this theory, the fact that defendant's conduct might have been a substantial factor in causing Mrs. Cipollone's cancer would not be enough; rather, Mr. Cipollone would have had to prove, by a preponderance of the evidence, that if Liggett had not breached its warranty and if it had warned consumers of the dangers of smoking, Mrs. Cipollone would not have contracted cancer. In other words, Liggett argues that plaintiff had to prove that \"but for\" Liggett's conduct, the injury would not have occurred.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e We find this argument to be inconsistent with New Jersey law.\n\nLiggett cites Campos v. Firestone Tire and Rubber Co., 98 N.J. 198, 485 A.2d 305 (1984), which it claims rejected the substantial factor test and instead require a \"but for\" test in failure to warn situations. In Campos, the New Jersey Supreme Court found that the plaintiff had the burden of proving that a proper warning would have prevented the injury caused by a tire assembly explosion. The plaintiff was arguably aware of the need to protect himself by keeping the tire in a safety cage, but he reached into the cage and was injured when the assembly exploded. The court quoted with approval from an article by Dean Keeton:\n\nIf the basis for recovery under strict liability is inadequacy of warnings or instruction about dangers, then plaintiff would be required to show that an adequate warning or instruction would have prevented the harm.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nHowever, the court in Campos did not reverse the jury's verdict for the plaintiff. Instead, it remanded noting that \"there may be some question whether plaintiff sustained his burden of proving causation, see Brown v. United States Stove Co., [98 N.J. 155, 484 A.2d 1234 (1984)].\" Campos, 98 N.J. at 211, 485 A.2d at 312. Brown seems to endorse a substantial factor test: \"a tortfeasor will be held answerable if its 'negligent conduct was a substantial factor in bringing about the injuries.'\" Brown, 98 N.J. at 171, 484 A.2d at 1243 (citations omitted). Thus, although the language quoted from Deen Keeton's article in Campos suggests that New Jersey might endorse a \"but for\" test in failure to warn cases, the citation to Brown indicates to the contrary. Subsequent New Jersey cases interpreting Campos also indicate to the contrary.\n\nIn Hull v. Getty Refining \u0026 Marketing Co., 202 N.J. Super. 461, 467, 495 A.2d 445, 448 (App.Div. 1985), and Vallillo v. Muskin Corp., 212 N.J. Super. 155, 159-60, 514 A.2d 528, 530 (App.Div. 1986), the New Jersey Superior Court cited Campos to support a substantial factor test. Determining proximate causation requires determining \"whether [the] breach of a duty enforceable within strict product liability against any defendant constituted a substantial factor in the causation of plaintiff's accident.\" Hull, 202 N.J.Super. at 467, 495 A.2d at 448. Describing why it was overturning a plaintiff's verdict (not remanding, as the court did in Campos), the Vallillo court reasoned that in Campos \"[a] jury could have determined that the lack of a proper warning to rely on the cage's protection and to keep his arm out of the cage was at least a factor materially contributing to the happening of the accident.\" 212 N.J.Super. at 160, 514 A.2d at 530. In the case at bar, a jury could determine that Liggett's violations constituted a factor materially contributing to her injury.\n\nNew Jersey has also used the substantial factor test in nonfeasance situations. In Evers v. Dollinger, 95 N.J. 399, 471 A.2d 405 (1984), the New Jersey Supreme Court held that it was error to enter judgment for a doctor who failed to operate on a tumor for seven months. The court reasoned that, although the doctor's conduct did not cause the cancer, the seven-month delay could have been a substantial factor in causing the condition from which the plaintiff eventually suffered. In Hake v. Manchester Township, 98 N.J. 302, 486 A.2d 836 (1985), the same court held that plaintiff could establish causation in a wrongful death action by showing that defendant's negligent conduct negated a substantial possibility that plaintiff might have been saved after attempting to kill himself. Neither of these was a concurrent causation case and in neither case would defendant's conduct by itself have caused the injury. Yet, each defendant's conduct substantially increased the probability of the plaintiff's injury. In such situations the New Jersey courts have allowed recovery.\n\nIn light of these cases, we conclude that the district court did not erroneously instruct the jury as to the proximate cause requirement in Mr. Cipollone's failure to warn claim. The district court should again give a \"substantial factor\" charge on retrial.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nVI. DID THE DISTRICT COURT ERR IN FAILING TO INSTRUCT THE JURY THAT MRS. CIPOLLONE'S NONRELIANCE ON LIGGETT'S SAFETY ADVERTISEMENTS WOULD PREVENT HER FROM RECOVERING ON HER EXPRESS WARRANTY CLAIM?\n\nWe turn now to another major area of dispute between the parties, one that implicates the conceptual basis of express warranty law. Mr. Cipollone brought his express warranty claim under U.C.C. § 2-313(1), which provides:\n\n(1) Express warranties by the seller are created as follows:\n\n(a) Any affirmation of fact or promise made by the seller to the buyer which relates to the goods and becomes part of the basis of the bargain creates an express warranty that the goods shall conform to the affirmation or promise.\n\n(b) Any description of the goods which is made part of the basis of the bargain creates an express warranty that the goods shall conform to the description.\n\nN.J.S.A. § 12A:2-313(1) (emphases added). With respect to this issue, the district court gave the following instructions to the jury:\n\nPlaintiff must prove . . . that Liggett, prior to 1966, made one or more of the statements claimed by the plaintiff and that such statements were affirmations of fact or promises by Liggett . . . [and] that such statements were part of the basis of the bargain between Liggett and consumers like Rose Cipollone. . . .\n\nThe law does not require plaintiff to show that Rose Cipollone specifically relied on Liggett's warranties.\n\nOrdinarily a guarantee or promise in an advertisement or other description of the goods becomes part of the basis of the bargain if it would naturally induce the purchase of the product and no particular reliance by the buyer on such statement needs to be shown. However, if the evidence establishes that the claimed statement cannot fairly be viewed as entering into the bargain, that is, that the statement would not naturally induce the purchase of a product, then no express warranty has been created.\n\n4 J.A. at 232-34.\n\nLiggett contends that this interpretation of \"part of the basis of the bargain\" is flawed because the jury should also have been instructed that Mrs. Cipollone's nonreliance on the advertisements would preclude those advertisements from becoming \"part of the basis of the bargain.\" Liggett argues that the express warranty verdict must therefore be set aside. Although our interpretation of the precise meaning of \"reliance\" differs somewhat from Liggett's, we agree.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nA.\n\nAuthority on the question whether reliance is a necessary element of section 2-313 is divided. Although a few courts have held that reliance is not a necessary element of section 2-313,\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e the more common view has been that it is, and that either a buyer must prove reliance in order to recover on an express warranty or the seller must be permitted to rebut a presumption of reliance in order to preclude recovery.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Some treatise writers support this interpretation.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e No New Jersey court or panel of this court has squarely addressed the question.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nThe history of section 2-313(1)(a), although informative, fails to give a clear answer as to whether reliance is required. Section 2-313(1)(a) is an adaptation of section 12 of the Uniform Sales Act.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e A comparison of the two sections reveals that they are substantially the same except for the replacement of section 12's express reliance requirement with section 2-313(1)(a)'s basis of the bargain requirement. The district court reasoned that the omission of the word \"reliance\" from section 2-313(1)(a), in light of section 12's use of that word, implied that reliance was no longer an element of express warranties. See 693 F. Supp. at 213. Liggett contends that \"if U.C.C. § 2-313 wrought the radical change in New Jersey warranty law that the trial court has read into it,\" then \"one would think that the New Jersey Study Comments would have at least made reference to it.\" Liggett Br. at 19. We note in this regard that the New Jersey Study Comment One to section 12A:2-313 states that \"this section of the Code is comparable to section 12 of the Sales Act (N.J.S.A. 46:30-18), except that it characterized the warranties of sample and description as express warranties.\" There is no reference to the reliance issue.\n\nLiggett argues that reliance must have some place in the \"basis of the bargain\" determination. Thus, even if reliance should be assumed, based on what \"would reasonably induce the purchase of a product,\" a defendant must have an opportunity to prove non-reliance. This position finds some support in the U.C.C. comments. U.C.C. Official Comment 3 states:\n\nIn actual practice affirmations of fact made by the seller about the goods during a bargain are regarded as part of the description of those goods; hence no particular reliance on such statements need be shown in order to weave them into the fabric of the agreement. Rather, any fact which is to take such affirmations, once made, out of the agreement requires clear affirmative proof. The issue normally is one of fact. (Emphasis added).\n\nMoreover, comment 8 states that \"all of the statements of the seller [become part of the basis of the bargain] unless good reason is shown to the contrary.\" (Emphasis added) The plain language of these comments supports Liggett's position, at least to the extent it indicates that a defendant must be given some opportunity to show that the seller's statements were not meant to be part of the basis of the bargain.\n\nThis court has interpreted comment 3 before, in another tobacco case, Pritchard v. Liggett \u0026 Myers Tobacco Co., 350 F.2d 479 (3d Cir. 1965) (applying Pennsylvania law). In a footnote to a concurring opinion, Judge Freedman stated the following:\n\nThe comment by the drafters of the [U.C.C.] make it clear that what was formerly described as reliance [under § 12 of the Uniform Sales Act] is now absorbed as a factor which is made a basis of the bargain. Comment 3 to § 2-313 states that where a statement is made during a bargain no particular evidence of reliance need be shown, but that it remains a question of fact whether evidence introduced by the defendant is sufficient to show non-reliance.\n\n350 F.2d at 491 n. 7 (Freedman, J., concurring).\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Pritchard therefore reads the last sentence in comment 3 (\"Any fact which is to take such affirmations, once made, out of the agreement requires clear affirmative proof.\") as qualifying the sentence that precedes it (\"No particular reliance need be shown.\"). In other words, even though \"no particular reliance need be shown,\" the seller can \"take [an] affirmation . . . out of the agreement\" by showing that the buyer did not rely.\n\nThis interpretation of comment 3 appears consistent with that of the New Jersey Supreme Court. In Gladden v. Cadillac Motor Car Division, 83 N.J. 320, 416 A.2d 394 (1980), the Court held that a manufacturer's attempted limitation of its damages for breach of its express warranty could be given no effect in light of the \"linguistic maze\" of the warranty. See Id. at 333, 416 A.2d at 401. The Court cited Comment 3, stating that \"particular reliance on such statements of description or quality need not be shown.\" Id. at 325, 416 A.2d at 396. The Court thus expressly rejected the view that the plaintiff has the burden of proving reliance on the seller's affirmation of fact, promise or description. Nonetheless, the statement that \"particular reliance need not be shown,\" made in the context of a discussion about Comment 3, does not imply that a defendant cannot defeat a warranty claim by showing that the affirmation of fact, promise or description was not part of the basis of the bargain. We believe that Gladden states not that reliance is irrelevant, but only that the plaintiff need not prove reliance.\n\nA final argument in support of a reliance requirement is found in the amicus brief. Without a reliance requirement, one runs the risk of draining the term \"basis of the bargain\" of all meaning, because the buyer's subjective state of mind becomes completely irrelevant. The district court instructed the jury that a statement could be considered part of the basis of the bargain if it \"would naturally induce the purchase of the products.\" This instruction is completely objective and would permit a buyer to sue for breach of express warranty even if the seller's warranties were advertisements made in another state or country, and even if the buyer did not hear of the claims in these advertisements until the day that she walked into an attorney's office to bring suit for personal injury. It strains the language to say that a statement is part of the \"basis\" of the buyer's \"bargain,\" when that buyer had no knowledge of the statement's existence.\n\nThe above arguments notwithstanding, it is possible to read the \"basis of the bargain\" requirement as requiring some subjective inducement of the buyer, without requiring a reliance finding. Requiring that the buyer rely on an advertisement, whether by imposing this burden initially on the buyer bringing suit, or by allowing the seller to rebut a presumption of reliance, puts a heavy burden on the buyer -- a burden that is arguably inconsistent with the U.C.C. as a whole, with other comments to section 2-313 in particular, and with several commentators' suggestions in this area.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nThe reliance requirement does not comport well with U.C.C. Official Comment 7 to section 2-313. Comment 7 states that \"if language is used after the closing of the deal . . . the warranty becomes a modification, and need not be supported by consideration if it is otherwise reasonable and in order . . . .\" N.J.S.A. § 12A:2-313 U.C.C. Comment 7. If a post-closing promise --on which, by definition, a seller cannot rely in deciding to make a purchase -- can create a warranty, then it is difficult to see why a pre-closing promise can create a warranty only if relied upon.\n\nAdditionally, a reliance requirement seems inconsistent with U.C.C. Official Comment 4 to section 2-313. Comment 4 states that \"the whole purpose of the law of warranty is to determine what it is that the seller has in essence agreed to sell.\" N.J.S.A. § 12A:2-313 U.C.C. Comment 4. Reliance is irrelevant to what a seller agrees to sell.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nIn light of these seemingly inconsistent mandates on the reliance question, some might argue that it is foolish to try to reconcile what is patently inconsistent. We reject this suggestion however, because we find it feasible to reconcile the competing arguments, and we believe that the New Jersey Supreme Court would want us to try. We believe that the most reasonable construction of section 2-313 is neither Liggett's reliance theory, which fails to explain how reliance can be relevant to \"what a seller agreed to sell,\" or the district court's purely objective theory, which fails to explain how an advertisement that a buyer never even saw becomes part of the \"basis of the bargain.\" Instead, we believe that the New Jersey Supreme Court would hold that a plaintiff effectuates the \"basis of the bargain\" requirement of section 2-313 by proving that she read, heard, saw or knew of the advertisement containing the affirmation of fact or promise.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Such proof will suffice \"to weave\" the affirmation of fact or promise \"into the fabric of the agreement,\" U.C.C. Comment 3, and thus make it part of the basis of the bargain.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e We hold that once the buyer has become aware of the affirmation of fact or promise, the statements are presumed to be part of the \"basis of the bargain\" unless the defendant, by \"clear affirmative proof,\" shows that the buyer knew that the affirmation of fact or promise was untrue. We believe that by allowing a defendant to come forward with proof that the plaintiff did not believe in the warranty,\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e we are reconciling, as the New Jersey Supreme Court would want us to, the U.C.C. comments, the U.C.C. case law, and traditional contract principles, which serve as the background rules to the U.C.C.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nAs indicated above, Comment 4 and Comment 7, as well as the largely dominant objective theory of contracts, militate in favor of an interpretation of express warranty that ignores the buyer's subjective state of mind. Under the extreme version of this theory apparently adopted by the district court, all the buyer should have to show is what the seller agreed to sell. In other words, an express warranty would be created when a seller makes statements to the public at large that would induce a reasonable buyer to purchase the product, even if the actual buyer never heard those statements.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e We find this result untenable, however. First, as mentioned above, this interpretation drains all substantive meaning from the phrase \"basisof the bargain,\" and would allow a seller to collect even if that seller was unaware of the warranty until she walked into her attorney's office to file suit. Second, this interpretation is difficult, if not impossible, to square with other comments to the U.C.C. As discussed above, Comment 3 states that \"no particular reliance on such statements need be shown. . . Rather, any fact which is to take such affirmations, once made, out of the agreement requires clear affirmative proof.\" Comment 8 states that \"all of the statements of the seller [become part of the basis of the bargain] unless good reason is shown to the contrary.\" Clearly, both Comment 3 and Comment 8 envision some mechanism for overcoming the presumption that the seller's statements, even if heard by the actual buyer, are a basis of the bargain.\n\nMuch of the case law supports this \"belief\" principle. A statement in the bill of sale that the goods are new does not constitute an express warranty when both the buyer and the seller knew that the statement was false. See Coffee v. Ulysses Irrigation Pipe Co., 501 F. Supp. 239 (N.D. Tex. 1980). When a buyer has operated trucks before and knows that they need repairs, he cannot sue in express warranty on the seller's statement that the trucks were in good condition. See Janssen v. Hook, 1 Ill. App. 3d 318, 272 N.E.2d 385 (1971). \"The same representation that could have constituted an express warranty early in the series of transactions, might not have qualified as an express warranty in a later transaction if the buyer had acquired independent knowledge as to the fact asserted.\" Royal Business Machines v. Lorraine Corp. 633 F.2d 34, 44 (7th Cir. 1980). See also Overstreet v. Norden Laboratories, Inc., 669 F.2d 1286, 1291 (6th Cir. 1982) (\"[A] statement known to be incorrect cannot be an inducement to enter a bargain.\"); Wendt v. Beardmore Suburban Chevrolet, Inc., 219 Neb. 775, 782, 366 N.W.2d 424, 429 (1985) (Car dealer's statements were not a basis of the bargain when plaintiff suspected that the car had been in an accident and had his mechanic inspect it.).\n\nAlthough these cases reject, to a certain extent, one traditional contract principle, that terms should be construed objectively, they embrace another traditional contract principle, that of looking at the intention of the parties in light of the surrounding circumstances. See 3 R. Anderson, Uniform Commercial Code § 2-313:36, at 29 (1983 \u0026 Supp. 1987). The relevant intent is that the statement be part of the basis of the bargain, and that, \"as in the case of any contract term, is a question of the intent of the parties.\" Id. at 30.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nB.\n\nApplying our interpretation of section 2-313 to the case at bar, we conclude that the district court's jury instructions were erroneous for two reasons. First, they did not require the plaintiff to prove that Mrs. Cipollone had read, seen, or heard the advertisements at issue. Second, they did not permit the defendant to prove that although Mrs. Cipollone had read, seen, or heard the advertisements, she did not believe the safety assurances contained therein. We must therefore reverse and remand for a new trial on this issue.\n\nThere is ample evidence from which a jury could conclude that Mrs. Cipollone saw, read, or heard the advertisements. She frequently listened to the Arthur Godfrey show, and frequently read magazines that contained the advertisements. Thus, the awareness question is not problematic. However, there is also evidence that family members brought the hazards of smoking to her attention. Thus Liggett might be able to prove that she did not believe the advertisements that she saw.\n\nLiggett contends that in light of the jury's answers to special verdict questions 10 and 12, which addressed Mrs. Cipollone's cigarette use notwithstanding knowledge of the hazard, a new trial is inappropriate because it is entitled to a verdict in its favor on the express warranty claim as a matter of law.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e We disagree. First, as explained above in part IV, the district court's jury instructions with respect to questions 10 and 12 did not limit the inquiry into Mrs. Cipollone's conduct to the pre-1966 period. Because the only potential warranties at issue in this case are Liggett's pre-1966 advertisements, in order to find no warranties the jury must find that Mrs. Cipollone disbelieved Liggett's pre-1966 advertisements, and it did not have an opportunity to do so.\n\nQuestions 10 and 12 also do not ask specifically whether Mrs. Cipollone knew that the advertisements were false. The jury's answers indicate that Mrs. Cipollone should have known that cigarettes were harmful, despite Liggett's failure to warn. That does not mean that she actually knew that cigarettes were harmful, when Liggett was advertising to the contrary. The jury must be asked whether she disbelieved the advertisements. This is an inquiry distinct from (1) whether she should have disbelieved the advertisements,\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e and (2) whether it would have been unreasonable to smoke had Liggett not been advertising that smoking was safe. Consequently, Liggett is not entitled to rely on the jury's answers to these questions to preclude a new trial on the question whether its advertisements constituted express warranties.\n\nVII. DID THE DISTRICT COURT ERR IN FAILING TO INSTRUCT THE JURY THAT COMPARATIVE FAULT PRINCIPLES APPLY TO AN EXPRESS WARRANTY CLAIM?\n\nA.\n\nLiggett contends that New Jersey law permits a manufacturer to assert a comparative fault defense to an express warranty products liability suit and that the district court consequently erred in failing to so instruct the jury. We agree that comparative fault principles may be applicable in some express warranty cases, but we do not believe that they are applicable here.\n\nIn Cintrone v. Hertz Truck Leasing \u0026 Rental Service, 45 N.J. 434, 212 A.2d 769 (1965), the plaintiff alleged that the brakes on his employer's leased truck failed, causing an accident. Cintrone sued the lessor, alleging that the defendant had breached its \"warranty that the vehicle was fit and safe for use. (Whether the alleged warranty was express or implied was not specified.).\" Id. at 438, 212 A.2d at 771. The defendant asserted that the plaintiff could not recover because the problem with the truck's brakes was known to the plaintiff before the accident. The New Jersey Supreme Court held that on the facts of the case the jury could have concluded that the plaintiff \"with knowledge of the danger presented by the defective brakes failed to take the care for his own safety which a reasonably prudent person would have taken under the circumstances. Therefore, it would have been improper for the trial court to have removed the defense of contributory negligence from jury consideration.\" Id. at 459, 212 A.2d at 783.\n\nIn Maiorino v. Weco Products Co., 45 N.J. 570, 214 A.2d 18 (1965) (per curiam), the New Jersey Supreme Court also held that contributory fault was a defense to a breach of warranty suit. In that case, the plaintiff injured himself while attempting to open the glass container on his newly purchased toothbrush. The plaintiff sued the manufacturer charging negligence and breaches of implied warranties of merchantability and fitness of the product for use. The Supreme Court held that a contributory fault defense was properly submitted to the jury:\n\nAs we pointed out in Cintrone, the authorities in various jurisdictions are in confusion and seeming conflict on the subject of availability of the defense of contributory negligence in products liability cases based on breach of express or implied warranty of fitness. The various texts and cases referred to therein reveal that most jurisdictions bar plaintiff's recovery where his misuse or abuse of the product in combination with a defect in the product, brings about his personal injury, or where he continued to use the product with knowledge, actual or constructive, of its defective condition. . . .\n\nId. at 573, 214 A.2d at 19.\n\nThe issue before us, whether comparative fault is available in an express warranty action, was not addressed in either Cintrone or Maiorino. Neither of those cases clearly involved express warranties.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e The last time we were faced with this issue was in a case involving the same defendant and, indeed, many of the same warranties. In Pritchard v. Liggett \u0026 Myers Tobacco Co., 350 F.2d 479, 485 (3d Cir. 1965), interpreting Pennsylvania law, we found that the doctrine of assumption of risk, in its primary sense, was available as an affirmative defense in an express warranty claim.\n\nCrucial to our analysis in Pritchard was the distinction between primary and secondary assumption of risk. In its primary sense, assumption of risk involves a voluntary exposure to a known danger, which negates liability. \"Under this concept recovery is barred because the plaintiff is assumed to have relieved the defendant of any duty to protect him.\" Id. at 484. In its secondary sense, assumption of risk is synonymous with contributory negligence -- a plaintiff is barred from recovery because of her departure from reasonable standards of care, despite the negligence of the defendant. Id.\n\nIn Pritchard, we concluded that assumption of risk in the sense of contributory negligence is not available in a breach of warranty action. We then concluded that \"a person who voluntarily exposes himself to a danger of which he has knowledge, or has had notice, assumes the attendant risk.\" Id. at 485. This reading is in accord with Dean Prosser's view:\n\nThe plaintiff['s] . . . failure . . . to take precautions against [the] possible existence [of a product's danger does] not . . . bar . . . an action for breach of warranty. . . . But if he discovers the defect, or knows the danger arising from it, and proceeds nevertheless deliberately to encounter it by making use of the product, his conduct is the kind of contributory negligence which overlaps assumption of risk; and on either theory his recovery is barred.\n\nProsser, The Fall of the Citadel (Strict Liability to the Consumer), 50 Minn.L.Rev. 791, 838-39 (1966).\n\nWe reversed the jury verdict for the defendant in Pritchard because we found that under the more narrow, primary definition of assumption of risk, the jury could not have concluded that the plaintiff voluntarily exposed himself to a known danger. We found that the jury instructions \"were inadequate and confusing in that they failed to differentiate between the primary and secondary concepts [of assumption of risk].\" 350 F.2d at 486. In reaching that conclusion we noted that \"the defendant's advertisements carried factual affirmations, professedly based on medical research [and that the advertisements] were calculated to overcome any fears the potential consumers might have had as to the harmful effects of cigarettes, and particularly Chesterfields. Under the circumstances it is difficult to perceive how the plaintiff, a cabinetmaker with no scientific background, could have been charged with notice or knowledge of a danger, which the defendant, with its professed superior knowledge, extensively advertised did not exist.\" Id. Pritchard, however, which involves Pennsylvania law, does not control this case.\n\nThe New Jersey cases, Cintrone and Maiorino, do not speak to whether a comparative fault defense is available in an express warranty action. Even Pritchard's previous interpretation of Pennsylvania's express warranty law indicates that comparative fault is available only to the extent that a plaintiff voluntarily exposes herself to a danger of which she had specific knowledge. In order to answer Liggett's contention that comparative fault -- in the sense of primary assumption of risk -- should be available as a defense to this express warranty claim, we turn to an analysis of the warranty involved here.\n\nAs is discussed in Part VI, in order to make out a prima facie express warranty claim, Mr. Cipollone must show that Liggett's affirmations were part of the basis of the bargain. As long as the plaintiff can show that Mrs. Cipollone knew of Liggett's affirmations of fact, those affirmations are presumed to be a basis of the bargain unless Liggett can prove that she did not believe those advertisements. Arthur Godfrey referred to the fears about smoking as \"applesauce.\" 5 J.A. 158.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e If Mrs. Cipollone believed him, she could not have had the subjective knowledge about the harms of smoking that would permit a jury to conclude that she voluntarily assumed a known risk.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nIn theory, the comparative fault defense is available to Liggett to the extent that it can prove that after having believed the advertisements, Mrs. Cipollone learned that they were untrue and continued to smoke the cigarettes that the advertisements had caused her to buy. The court must recognize, however, that any cigarettes that plaintiff bought after she ceased believing in defendant's affirmations would not, as a matter of law, be cigarettes smoked in breach of the warranty. The warranty would not exist as to those cigarettes because Mrs. Cipollone would not have believed Liggett's affirmations when she bought them. Thus, although it would be theoretically possible for the defendants to win on a comparative fault defense that did not involve misuse or abuse, as a practical matter it would be almost impossible. If the jury finds that the cigarettes that Mrs. Cipollone smoked in breach of the express warranty proximately caused her cancer, then it is implicitly finding that she believed the advertisements when she bought those cigarettes.\n\nIf she bought some cigarettes while believing in the advertisements and then learned that the advertisements were false and smoked those previously purchased cigarettes anyway, then she would have been assuming a known risk when she smoked the previously purchased, warranted cigarettes. We conclude that under such circumstances, she could be barred, by reason of contributory fault, from recovering on an express warranty claim. But that would require a jury finding that it was those specific cigarettes, bought while believing the advertisements but smoked after she knew that the ads were false, that caused her cancer. No reasonable jury could find this unless Mrs. Cipollone bought vast amounts of cigarettes in bulk, and there is no evidence in the record that she did.\n\nLiggett's defense is thus more appropriate in the more typical U.C.C. case. For instance, if a tire purchaser relied on the affirmations of the seller, then discovered that the seller's affirmation was false, and then used the tire anyway, she could be barred from recovering on an express warranty claim under an assumption of risk theory. Because the purchaser believed the affirmations when she purchased the tire, the tire would be warranted. Still the law would not allow her to collect on that warranty if she used the tire after she learned that the seller's affirmations were false. This scenario is inapplicable in the cigarette context because the few cigarettes used after learning of a warranty's falsity cannot cause the kind of harm that one defective tire can.\n\nIn sum, we find that a comparative fault defense is available in an express warranty action, but only to the extent that the defendant can show that the buyer misused or abused the product or used the product after learning that the warranty was false. We do not think that that would be possible in this case. There is no evidence that Mrs. Cipollone misused cigarettes. To the extent that she knew cigarettes were bad for her and hence did not believe Liggett's advertisements to the contrary, she cannot collect on an express warranty theory, but not because she assumed the risk of the cigarettes. If she did not believe the advertisements, then they could not have formed a basis of the bargain in the first place, and the jury could not find an express warranty.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nB.\n\nThe same rationale that overcomes Liggett's comparative fault defense overcomes Liggett's contention that Mrs. Cipollones knowledge of the advertisements' falsity breaks the chain of causation linking Liggett's breach to Mrs. Cipollone's injury. Liggett contends that the district court erred in failing to instruct the jury that if a buyer uses a product with knowledge of its warranty-breaching defect, any personal injuries arising from that use did not proximately result from the breach of warranty. Arguably, section 2-715 of the U.C.C., which provides that \"consequential damages resulting from the seller's breach include . . . injury to person . . . proximately resulting from any breach of warranty,\" required such an instruction. See N.J.S.A. § 12A:2-715.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\n\nLiggett relies on U.C.C. Official Comment 5 to section 2-715 (\"If [the injured person] discover[ed] the defect prior to his use, the injury would not proximately result from the breach of warranty.\") and New Jersey Study Comment 1 to § 2-715 (\"If the buyer's own fault or negligence contributes to the injury (e.g., by using the goods with knowledge of their defects), he cannot recover consequential damages, because such damages are not proximately due to the breach of warranty.\"). Both of these comments imply that the buyer's knowledge of a defect breaks the chain of proximate causation because, in effect, the plaintiff's behavior is an intervening cause. The seller could not reasonably foresee that a buyer would use a product once that buyer learned that the product was defective.\n\nLike the comparative fault defense, however, the knowledge-as-intervening-cause argument applies in the kind of case represented in the tire hypothetical outlined above, not the cigarette sales at issue in this case. If a buyer uses a tire after having discovered a warranty-breaching condition that makes use of that tire unreasonable, then she cannot collect consequential damages under the warranty. In the instant case, however, once the plaintiff discovered that Liggett's advertisements were false, the cigarettes she purchased after that time must, as a matter of law, have been unwarranted, and therefore would not be considered by a jury asked to determine whether the cigarettes she smoked that were in breach of Liggett's warranty proximately caused her lung cancer.\n\nThus, both the comparative fault and the causal chain arguments fail to defeat the express warranty claim because both contentions depend on Liggett's proving that Mrs. Cipollone knew that the advertisements were false. But the basis of the bargain provision in N.J.S.A. § 12A:2-313 requires that the buyer believe the advertisements. If Liggett proves that she did not believe their advertisements, then there is no warranty in the first place. In other kinds of cases, subsequently acquired knowledge and use may constitute either comparative fault or an intervening cause sufficient to bar recovery, but in those cases there is sufficient time for the plaintiff to buy the product while believing in the warranty, subsequently learn of the warranty's falsity, and proceed to use the product nonetheless. If that subsequent use results in serious damage, the buyer cannot recover. No serious damage could result from a comparable kind of \"subsequent use\" in this case because Mrs. Cipollone could not have been seriously hurt from cigarettes bought while believing in the advertisements but smoked after learning of the advertisements' falsity.\n\nLiggett must be given the opportunity at the outset to prove that at some point prior to January 1, 1966, Mrs. Cipollone ceased to believe, or never believed, Liggett's advertisements. If the jury finds such disbelief, they must be instructed to find that the advertisements could not have formed the basis of the bargain for cigarettes she purchased after that date. As to cigarettes purchased and smoked before that date, however, for which the advertisements would constitute a basis of the bargain, Liggett should not be given another opportunity to prove what they failed to prove in the first instance, i.e. that Mrs. Cipollone did not believe the advertisements.\n\nVIII. WAS THERE SUFFICIENT EVIDENCE TO SUPPORT A JURY FINDING THAT MRS. CIPOLLONE'S INJURY WAS CAUSED BY LIGGETT'S BREACH OF EXPRESS WARRANTY?\n\nLiggett contends that it is entitled to judgment n.o.v. on the express warranty claim because the record contains insufficient evidence to support a jury verdict for Mr. Cipollone on this point. At the outset, we note that the express warranty provision of the Uniform Commercial Code, section 2-313, makes clear that no formality or magic words are required to create an express warranty. \"It is not necessary to the creation of an express warranty that the seller use formal words such as 'warrant' or 'guarantee' or that he have a specific intention to make a warranty. . . .\" N.J.S.A. § 12A:2-313(2) (1970). The seller may be liable if its representation regarding the goods takes the form of newspaper, magazine, radio or television advertisements. See Collins v. Uniroyal, Inc., 126 N.J. Super. 401, 405, 315 A.2d 30, 33 (App.Div. 1973) (per curiam), aff'd, 64 N.J. 260, 315 A.2d 16 (1974) (per curiam); Drayton v. Jiffee Chemical Corp., 591 F.2d 352, 358 (6th Cir. 1978); J. White \u0026 R. Summers, Uniform Commercial Code 335-36 (2d ed. 1980). Consequently, Mr. Cipollone was free to rely, as he did, on advertisements to prove the existence and scope of Liggett's warranty.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nA.\n\nLiggett contends that the record contains insufficient evidence to support a finding that Liggett breached any warranty in the instant case. More specifically, Liggett maintains that there is insufficient evidence \"to support a finding that Liggett made any express warranty warranting against serious health effects in the future from long term cigarette use.\" Liggett Br. at 34-35. Although the question whether a particular set of representations made by the seller amounts to an express warranty is normally one of fact, and consequently for the jury to decide, see Gladden v. Cadillac Motor Car Division, 83 N.J. 320, 325, 416 A.2d 394, 396 (1980), a judgment n.o.v. may be granted under Fed.R.Civ.P. 50(b) if the record is \"'\"critically deficient of that minimum quantity of evidence from which a jury might reasonably afford relief.\"'\" Powell v. J.T. Posey Co., 766 F.2d 131, 133-34 (3d Cir. 1985) (citations omitted). This question is one of law, over which our review is plenary. See id. at 134.\n\nMany Chesterfield and L \u0026 M advertisements were submitted to the jury. Liggett contends that \"none of them could constitute to a reasonable person a warranty covering serious health effects in the future from long term use of cigarettes.\" Liggett's Br. at 35. We disagree.\n\nOne Chesterfield advertisement stated, without qualification, that \"NOSE, THROAT, and Accessory Organs [are] not Adversely Affected by Smoking Chesterfields.\" See supra at 548. The advertisement discussed a \"study by a competent medical specialist and his staff on the effects of smoking Chesterfield cigarettes\" on a study group that included \"men and women\" who had \"continually\" smoked \"10 to 40\" cigarettes per day for \"one to thirty years.\" Members of the study group were \"given a thorough examination, including X-ray pictures\" at \"the beginning and at the end of\" a \"six-month[] period.\" According to the advertisement, \"the medical specialist, after a thorough examination of every member of the group,\" concluded that \"the ears, nose, throat and accessory organs of all participating subjects examined . . . were not adversely affected in the six-month period by smoking the cigarettes provided.\"\n\nIn a radio commercial, Arthur Godfrey related the story of another of these \"six-month[] period\" studies involving thirty-year chain smokers and stated that the study was \"proof\" of the proposition that Chesterfield cigarettes \"never . . . did you any harm.\" See supra at 549. Mr. Godfrey also told his listeners that he could not remember ever seeing a \"gravestone\" stating that the buried individual had \"smoked too much.\" See supra note 2. One magazine advertisement declared in a bold typescript that the consumer should \"PLAY SAFE\" and \"Smoke Chesterfield.\" See supra at 548. A series of television and magazine advertisements for the L \u0026 M brand stated that the cigarettes were \"just what the doctor ordered.\" See supra at 550.\n\nWe hold that a reasonable jury could conclude from these advertisements, and the many others entered into evidence, that Liggett had represented to the consumer that the long-term smoking of Chesterfield or L \u0026 M cigarettes would not endanger the consumer's health, and that these warranties were untrue. Liggett cannot be granted judgment n.o.v. on the ground that the advertisements represented only that short-term smoking was safe. A reasonable jury could infer that an unqualified representation that smoking is safe creates a warranty that smoking for a long period of time is safe.\n\nFurthermore, several of the purported \"studies\" conducted by \"medical specialists\" from \"a responsible consulting organization\" involved smokers who, the advertisements took care to note, smoked heavily for up to thirty years. A reasonable jury could interpret the inclusion of persons who had smoked heavily for thirty years in the studies as representing that smoking for a long period of time was safe. \"Broad general assertions of quality, and particularly those of safety, as for example that . . . cigarettes are . . . 'harmless' or 'safe to smoke,' may readily be found by the jury to include a representation that there is nothing to make the product unsafe.\" W. Prosser, Handbook of the Law of Torts 653 (4th ed. 1971). Indeed, the last time we reviewed the Liggett advertisements at issue in this case, we concluded that \"the evidence compellingly points to an express warranty, for the defendant, by means of various advertising media, not only repeatedly assured [the consumer] that smoking Chesterfields was absolutely harmless, but in addition the jury could very well have concluded that there were express assurances of no harmful effect on the lungs.\" Pritchard v. Liggett \u0026 Myers Tobacco Co., 295 F.2d 292, 296 (3d Cir. 1961). The district court did not err in refusing to grant judgment n.o.v. on the ground that Mr. Cipollone failed to introduce sufficient evidence to uphold the jury verdict with respect to the scope of Liggett's express warranty.\n\nB.\n\nNeither do we find, as Liggett contends, that there was insufficient evidence to prove that Mrs. Cipollone's smoking caused her cancer. In its opinion denying Liggett's motion for a judgment n.o.v., the district court concluded that Liggett's \"no adverse effects\" Chesterfield advertisements began to run in 1952, see 693 F. Supp. at 214 \u0026 n. 8, a conclusion supported by the evidence discussed above and which the plaintiff has not challenged in its brief. The evidence also supports the conclusion that the L \u0026 M \"just what the doctor ordered\" advertisements began before Mrs. Cipollone switched to that brand in 1955. Hence the jury could have found that Mrs. Cipollone smoked cigarettes that were in breach of warranty from 1952 until as late as 1966 (the date at which the express warranty claim is cut off by our interlocutory preemption decision).\n\nThe jury found that Mrs. Cipollone's smoking of cigarettes that were in breach of the warranty proximately caused her lung cancer and death. See Special Verdict Question 15 (quoted supra at 554). Liggett contends that the record does not contain sufficient evidence to support this finding and that the district court consequently erred in declining to grant judgment n.o.v. on this point. Although a great deal of evidence was introduced that Mrs. Cipollone's cancer was caused by her 40 years of smoking, Liggett contends that there is no evidence that demonstrates that her cancer was caused by her smoking from the years 1952 to 1966. We disagree. As previously noted, a judgment n.o.v. may be granted only if the record is \"'\"critically deficient of that minimum quantity of evidence from which a jury might reasonably afford relief.\"'\" Powell, 766 F.2d at 133-34 (citations omitted).\n\nThe statistical correlation between heavy smoking and lung cancer is well-documented.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e The plaintiff presented expert testimony from qualified witnesses that smokers are much more likely to contract lung cancer than non-smokers, especially non-smokers such as Mrs. Cipollone, for whom there is no evidence of exposure to any cancer causing agent other than cigarette smoke. In addition, these experts testified that Mrs. Cipollone's early years of smoking contributed more -- on a year-to-year basis--than her later years of smoking because the lung injury produced from smoking early on is an injury that has many more years of potential to develop cancer than the injury incurred later in life.\n\nThe district court instructed the jury that it could find proximate cause in a case in which \"there may be two or more concurrent and directly cooperative and efficient proximate causes of an injury\" if the defendant was \"a substantial contributing factor in [causing the plaintiff's] injuries.\" As we have explained, these instructions were correct. Under these instructions, the jury could have reasonably concluded from the foregoing evidence that Mrs. Cipollone's smoking from 1952 to 1966 proximately caused her lung cancer. Her smoking from 1952 to 1966 could clearly have been found to be \"a substantial contributing factor\" in the development of her lung cancer. Liggett has not challenged the jury instructions' definition of proximate cause on appeal with respect to the express warranty claim.\n\nMr. Cipollone presented sufficient evidence concerning the causal link between Mrs. Cipollone's lung cancer and her smoking between 1952 and 1966 that a grant of judgment n.o.v. on this issue under Fed.R.Civ.P. 50(b) would not have been appropriate.\n\nIX. THE RISK-UTILITY CLAIM\n\nThe District Court ruled that the New Jersey Products Liability Act, N.J.S.A. § 2A:58C (hereafter \"The Act\") operated in this case to bar plaintiff's risk-utility claim.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e Section 3(a)(2) of the Act provides that if the plaintiff asserts a design defect claim against a manufacturer, the manufacturer shall not be liable if:\n\nThe characteristics of the product are known to the ordinary consumer or user, and the harm was caused by an unsafe aspect of the product that is an inherent characteristic of the product and that would be recognized by the ordinary person who uses or consumes the product with the ordinary knowledge common to the class of persons for whom the product is intended. . . .\n\nTo the extent that the Act imposed new rules with regard to the imposition of liability, it purported only to apply to actions filed after the date of its enactment. Section 8 of the Act provides that the act \"shall take effect immediately except that provisions of this act that establish new rules with respect to burden of proof or the imposition of liability in product liability actions shall apply only to product liability actions filed on or after the date of enactment.\" In its October 27, 1987, opinion, however, the district court found that, based on the New Jersey Assembly Insurance Committee's report, the New Jersey legislature intended section 3(a)(2) to be a codification of existing common law and hence that the legislature intended that section to be applied retroactively. Although the district court disagreed with the legislature on the question whether section 3(a)(2) was a codification of existing law, the court nonetheless held that section 3(a)(2) applied to the Cipollone case, even though it was filed before the Act became law, because the legislature's belief that it was not a new rule reflected an intent that the rule be applied retroactively.\n\nThe applicability of section 3(a)(2) to claims like this is currently before the New Jersey Supreme Court in another tobacco case, Dewey v. Brown \u0026 Williamson Tobacco Corp., 225 N.J. Super. 375, 542 A.2d 919 (App.Div.), certif. granted, 113 N.J. 379, 550 A.2d 481 (1988). We think it highly unlikely that the issue will not be resolved definitively by the time the instant case is re-tried. Therefore, we will not dwell at length on the issue.\n\nWe do not believe that section 3(a)(2) was a codification of existing common law, although it may have been a clarification of New Jersey law. See N.J.S.A. 2A:58C-1, Senate Judiciary Committee Report at 464-65 (\"These sections [2-4] are intended to establish clear rules with respect to specific matters as to which the decisions of the courts in New Jersey have created uncertainty.\"). See also Whitehead v. St. Joe Lead Co., 729 F.2d 238 (3d Cir. 1984) (the levels at which lead exposure becomes dangerous are not generally known, but general public knowledge of danger is relevant to the risk-utility injury); O'Brien v. Muskin Corp., 94 N.J. 169, 463 A.2d 298 (1983) (generalized knowledge of above ground swimming pools did not prevent a risk-utility claim from going to the jury).\n\nAs a clarification, the provision was meant to be applied retroactively, because section 8's \"prospective only\" provision applies only to new rules. Nonetheless, we cannot affirm the district court's decision to deny, as a matter of law, plaintiff's generic risk-utility claim because, applying the language of the Act, we cannot find, and we do not think that there was sufficient evidence for the district court to find, that the \"inherent[ly] [dangerous] characteristic[s]\" of cigarettes were known to the \"ordinary consumer or user,\" prior to 1966. This is an issue of fact for the jury.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\n\nOur view is in accord with what the Appellate Division of the Superior Court held in Dewey. That court wrote: \"we have no quarrel with defendant's proposition that plaintiff may not recover if a factfinder concludes that the death of her decedent was caused in large measure from exposure to the danger inherent in all cigarettes, a danger acknowledged to be within his contemplation as an ordinary consumer.\" 275 N.J.Super. at 386, 542 A.2d at 925 (emphasis added). No such ordinary consumer knowledge has been acknowledged in this case, and it is up to the jury to determine what the ordinary consumer knew. Therefore we will remand on this issue, and, if the New Jersey Supreme Court has not written expansively enough to dispose of this issue before the case is retried, the plaintiff should be allowed to proceed on his generic risk-utility claim.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\n\nX. PREJUDGMENT INTEREST\n\nThe district court denied plaintiff's request for prejudgment interest because the jury awarded the plaintiff contract, not tort damages. New Jersey Court Rule 4:42-11(b) reads as follows:\n\n(b) Tort Actions. Except where provided by statute . . . the court shall, in tort actions, including products liability actions, include in the judgment simple interest. . . .\n\nThe district court declined to follow Collins v. Uniroyal, Inc. 130 N.J. Super. 169, 325 A.2d 854 (Law Div. 1974), in which the New Jersey Superior Court awarded prejudgment interest on an express warranty claim, because the court found that Collins was \"contrary to the plain language of the provision.\" 693 F. Supp. 208, 221 (1988). The district court also found that there was no equitable basis for awarding prejudgment interest and that one of the purposes behind such an award, complete compensation of the plaintiff, would not be furthered because, theoretically, part of Mr. Cipollone's recovery on the express warranty claim was for loss of future services from his wife. Id. at 222.\n\nOf course, the availability of prejudgment interest may be mooted on retrial because a new jury may not grant an award on the basis of breach of express warranty.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e If the new jury does grant such an award, however, we believe that the plaintiff should be entitled to some prejudgment interest. Unlike the district court, we do not find that the holding and logic of Collins is contrary to the plain language of the rule.\n\nAs the court in Collins pointed out, the language of the rule (\"in tort actions, including products liability actions\") indicates that the drafters wanted to include actions in addition to just those sounding in tort. Otherwise, the inclusion of the \"products liability\" language would be superfluous. Collins, 130 N.J.Super. at 172-73, 325 A.2d at 855. This is, of course, a products liability case. The court in Collins also emphasized that the policy underlying the rule is to inhibit delay and encourage settlement. 130 N.J.Super. at 173, 325 A.2d at 856. These policy concerns seem particularly applicable in the case at bar, which has already been the source of seven district court opinions, four of them published, and three published opinions by this court. Furthermore, Collins, a fifteen year old decision, has not been significantly questioned or challenged. We think it appropriate to defer to the New Jersey court's interpretation of the New Jersey Rule and therefore conclude that the district court erred to the extent that it held that prejudgment interest is never available on an express warranty products liability claim.\n\nNeither do we believe that the New Jersey prejudgment interest is wholly inapplicable to future compensation awards. Rule 4:42-11(b) states that prejudgment interest is appropriate except in \"exceptional cases.\" The district court reasoned that prejudgment interest was inappropriate, in part, because Mr. Cipollone's award was based on loss of future services. Nonetheless, the New Jersey Supreme Court, albeit in dictum, has said: \"the applicability of a compensation rationale for prejudgment interest may be questionable in the case of future losses, since it can be argued that those damages accrue after the judgment. However, the public interest in encouraging settlements is an adequate independent basis for the application of the prejudgment interest rule in this case.\" Ruff v. Weintraub, 105 N.J. 233, 245, 519 A.2d 1384, 1391 (1987). In light of the protracted nature of this litigation, we believe that the New Jersey Supreme Court would opt to follow their prescriptions in Ruff. See also Salas by Salas v. Wang, 846 F.2d 897, 908-910 (3d Cir. 1988). Thus, in the absence of further guidance from the New Jersey courts on the point, which we would welcome, we do not believe that the post-judgment compensation element of an award in this case constitutes an \"exceptional\" circumstance that should \"suspend the running of . . . prejudgment interest.\" Rule 4:42-11(b).\n\nXI. DID THE DISTRICT COURT ERR IN GRANTING PARTIAL SUMMARY JUDGMENT FOR MR. CIPOLLONE WITH RESPECT TO THE DEFENDANTS' STATUTE OF LIMITATIONS DEFENSE?\n\nNew Jersey has a two year statute of limitations for personal injury actions, see N.J.S.A. § 2A:14-2, and has adopted the discovery rule. Under this doctrine, a cause of action will be held not to accrue until the injured party \"'learns, or reasonably should learn, the existence of that state of facts which may equate in law with a cause of action.'\" Vispisiano v. Ashland Chemical Co., 107 N.J. 416, 426, 527 A.2d 66, 71 (1987) (per curiam) (citation omitted) (emphasis in original). Stated differently, a cause of action will be held not to accrue until the injured party \"'discovers, or by the exercise of reasonable diligence and intelligence should have discovered[,] that he may have a basis for an actionable claim.'\" Id. at 419, 527 A.2d at 67 (citation omitted).\n\nMrs. Cipollone's lawsuit was filed on August 1, 1983. The district court granted (partial) summary judgment against the defendants on their statute of limitations defense, holding that no reasonable jury could conclude that Mrs. Cipollone discovered, or by the exercise of reasonable diligence should have discovered, the facts giving rise to her claims prior to August 1, 1981. Liggett contends that the evidence in the record was sufficient to support a jury finding that Mrs. Cipollone discovered or should have discovered the facts giving rise to her claim before August 1, 1981.\n\nSummary judgment should be granted if the pleadings, depositions, answers to interrogatories, and admissions on file, together with the affidavits, if any, show that there is no genuine issue of material fact. Our review is de novo. See Celotex Corp. v. Catrett, 477 U.S. 317, 91 L. Ed. 2d 265, 106 S. Ct. 2548 (1986).\n\nThe relevant facts are as follows. Mrs. Cipollone went to Dr. Alfred Lowy on July 23, 1981 for her regular medical checkup and x-ray. At that time, Dr. Lowy told her that he had discovered a spot on her lung. Mrs. Cipollone believed that this spot could be cancer caused by her smoking. She testified:\n\nQ: When Dr. Lowy told you you had a spot on your lung, you got scared? A: Yes.\n\nQ: You got scared because you knew what the significance of that could be, didn't you? A: Yes.\n\nQ: You were afraid that it could mean lung cancer? A: That's right.\n\nQ: You knew that cigarette smoking had been connected with cancer as you told us? A: Yes.\n\nQ: So you were afraid right then and there that you could have lung cancer from cigarette smoking, isn't that a fact? A: Right.\n\nThere is also ample evidence in the record from which the jury could conclude that Mrs. Cipollone knew that lung cancer was often caused by smoking.\n\nDr. Lowy did not tell Mrs. Cipollone that she might have lung cancer, but advised Mrs. Cipollone to see a lung specialist immediately. He recommended Dr. Seriff, whom Mrs. Cipollone went to see the next day. Dr. Seriff inquired about Mrs. Cipollone's smoking history and advised her, as he advises all of his patients, to stop smoking. Although Dr. Seriff formulated five differential diagnoses of her condition, one of which was primary lung cancer,\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e \"based on the appearance of Mrs. Cipollone's x-rays, [he] initially believed she had a pneumonia or viral infection and treated her with antibiotic medications.\" Dr. Seriff did not tell her that there was a possibility that she had lung cancer, but upon leaving Dr. Seriff's office, Mrs. Cipollone quit smoking for the first time in twenty-four years.\n\nDr. Seriff saw Mrs. Cipollone for the second time on July 30, 1981. He later affirmed that \"there was no definite change in her x-ray as a result of the antibiotic medication, therefore I began to feel it was less likely that she had a slowly resolving pneumonia causing the shadow.\" He still did not inform her that she might have cancer; he told her that his \"impression\" was that she had a viral infection.\n\nAt this point, Mrs. Cipollone certainly did not know that she had lung cancer. However, by this time, she knew that she had a spot on her lung and believed that the spot could be cancer caused by smoking. Indeed, she must have feared that she might get lung cancer from smoking, having made repeated novenas to St. Jude over the years in the hopes of avoiding it. She could have asked Dr. Seriff whether she might have cancer. Thus, although we think that the question is close, we conclude that a reasonable jury could find that Mrs. Cipollone \"'by the exercise of reasonable diligence and intelligence should have discovered'\" that she \"'may have [had] a basis for an actionable claim'\" prior to July 30, 1981.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e Vispisiano, 107 N.J. at 419, 527 A.2d at 67.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\n\nMr. Cipollone argues, in essence, that if Dr. Seriff did not know with reasonable medical certainty by August 1, 1981 that Mrs. Cipollone had lung cancer from smoking, then it would be unreasonable to expect Mrs. Cipollone to know this information. The problem with this argument is that it misstates the applicable legal test. The statute of limitations did not start running when Mrs. Cipollone knew that she had cancer from smoking; it started to run when she, by exercising reasonable diligence, should have known that she might have had cancer from smoking. Accordingly the issue will have to be tried.\n\nWe do not, of course, hold that Mr. Cipollone's claims are barred by the two year statute of limitations. We hold only that a jury could conclude that they are and that summary judgment was therefore inappropriate on this issue.\n\nXII. DID THE DISTRICT COURT ERR IN HOLDING THAT FEDERAL LAW PREEMPTED PLAINTIFF'S INTENTIONAL TORT CLAIMS?\n\nMr. Cipollone contends that the district court misconstrued our decision on the preemptive effect of the Federal Cigarette Labeling and Advertising Act (\"Labeling Act\") by holding that it preempts post-1965 intentional tort claims.\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e As amended, the Labeling Act states:\n\nIt is . . . the purpose of this chapter . . . to establish a comprehensive Federal program to deal with cigarette labeling and advertising with respect to any relationship between smoking and health, whereby --\n\n(1) the public may be adequately informed about any adverse health effects of cigarette smoking by inclusion of warning notices on each package of cigarettes and in each advertisement of cigarettes; and\n\n(2) commerce and the national economy may be (A) protected to the maximum extent consistent with this declared policy and (B) not impeded by diverse, nonuniform, and confusing cigarette labeling and advertising regulations with respect to any relationship between smoking and health.\n\n15 U.S.C. § 1331 (1982 \u0026 Supp. II 1984).\n\nIn our preemption decision, we applied the doctrine of implied preemption and held that in light of section 1331's declaration of Congressional purpose\n\nthe Act preempts . . . state law damage actions relating to smoking and health that challenge either the adequacy of the warning on cigarette packages or the propriety of a party's actions with respect to the advertising and promotion of cigarettes. . . . Where the success of a state law damage claim necessarily depends on the assertion that a party bore the duty to provide a warning to consumers in addition to the warning Congress has required on cigarette packages, such claims are preempted as conflicting with the Act.\n\n789 F.2d at 187.\n\nOn remand, the district court interpreted our preemption decision as barring the plaintiff's failure to warn, fraudulent misrepresentation, express warranty, and conspiracy to defraud claims to the extent that they sought to challenge the defendants' advertising, promotional, and public relations activities after January 1, 1966. See 649 F. Supp. at 668, 675. Mr. Cipollone contends on appeal that the district court erred in construing our preemption decision to stand for \"the extreme and untenable proposition that all of plaintiff's claims based on intentional tort, fraud and misrepresentation were preempted for the post-1966 period.\" Cipollone Br. at 43. Mr. Cipollone contends that \"there is obviously a logical distinction between failure to warn, which derives from a breach of existing duty, and intentional misrepresentation, which emanates from defendants' affirmative and gratuitous undertaking to misrepresent facts to the public\" because \"liability imposed for intentional tort would not impose requirements on defendants with respect to the warnings contained on the label or in cigarette advertisements.\" Id. at 44-45.\n\nWe disagree. Our prior decision stated an unequivocal holding that \"the Act preempts those state law damage actions relating to smoking and health that challenge . . . the propriety of a party's actions with respect to the advertising and promotion of cigarettes.\" 789 F.2d at 187. Plaintiff's intentional tort claim is founded on an allegation that defendants \"intentionally, wil[l]fully, and wantonly, through their advertising, attempted to neutralize the [federally mandated] warnings that were given regarding the adverse effects of cigarette smoking.\" 649 F. Supp. at 673 (quoting count 6 of plaintiff's complaint). The plaintiff's claim manifestly \"challenge[s] . . . the propriety\" of the defendants' \"actions with respect to the advertising and promotion of cigarettes.\" 789 F.2d at 187. The district court did not err in construing our preemption decision.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e\n\nXIII. CONCLUSION\n\nFor the foregoing reasons we will:\n\n(1) affirm the district court's order dismissing plaintiff's post-1965 failure to warn, express warranty, and intentional tort claims against the defendants Liggett, Lorillard, and Philip Morris;\n\n(2) reverse the district court's order in favor of defendants Liggett, Lorillard, and Philip Morris, barring plaintiff's generic risk-utility claim as a matter of law;\n\n(3) reverse the district court's judgment in favor of defendant, Liggett, and against plaintiff on plaintiff's failure to warn claim;\n\n(4) reverse the district court's judgment in favor of plaintiff and against defendant, Liggett, on plaintiff's express warranty claim;\n\n(5) reverse the district court's order granting plaintiff's motion for summary judgment striking defendants' affirmative defenses based on the statute of limitations; and\n\n(6) reverse the district court's order denying prejudgment interest; and\n\n(7) remand for a new trial.\n\nGIBBONS, Chief Judge, concurring:\n\nI join in the opinion of the court. I write separately to observe that the enormous complications which arose during the trial of this complex case are largely due to the interlocutory ruling of this court in Cipollone v. Liggett Group, Inc., 789 F.2d 181 (3d Cir. 1986), cert. denied, 484 U.S. 976, 108 S. Ct. 487, 98 L. Ed. 2d 485 (1987), to the effect that some state law claims were preempted by the Federal Cigarette Label and Advertising Act (Labeling Act), 15 U.S.C. § 1331 (1982 \u0026 Supp. II, 1984). That ruling was made in a case in which this court granted leave to appeal pursuant to 28 U.S.C. § 1292(b) (1982). With the benefit of hindsight it seems clear to me that permission to appeal was improvidently granted. The case was legally and factually complicated, and our interlocutory ruling was made in the absence of a factual record which would have sharpened the issues and permitted a more informed application of the Labeling Act to the case. When a case involves multiple theories of liability, the application of which depends on what facts are found, it will rarely be true that an interlocutory appeal will \"materially advance the ultimate termination of the litigation.\" Certainly that was not the effect of the interlocutory appeal in this case. The requirement in 28 U.S.C. § 1292(b) that the Court of Appeals give permission for a section 1292(b) appeal is intended to permit that court to avoid the kinds of indeterminate rulings which were made here and which do not materially advance anything but the lawyers' time meter.\n\nMore fundamentally, I believe that our interlocutory ruling on the preemptive effect of the Labeling Act, to the extent that we reached a definitive ruling, was wrong as a matter of law, and should be overruled by the court in banc. Had the district court proceeded to trial before presenting us with an opportunity to confuse things by an indeterminate and erroneous ruling on preemption, this case would today be far closer to resolution. Instead there will now be a new trial, and a new appeal, and the Supreme Court may still tell the parties that our views on preemption are wrong, and they should try again. See Goodyear Atomic Corp. v. Miller, 486 U.S. 174, 108 S. Ct. 1704, 1712, 100 L. Ed. 2d 158 (1988); International Paper Co. v. Ouellette, 479 U.S. 481, 107 S. Ct. 805, 93 L. Ed. 2d 883 (1987); Silkwood v. Kerr-McGee Corp., 464 U.S. 238, 78 L. Ed. 2d 443, 104 S. Ct. 615 (1984).\n\nThus, while I join in Part XII of the opinion of the court, I do so only because this panel is bound by what I believe to be an erroneous opinion of the Court.\n\n\u003cspan class=\"fn\"\u003e1. Chesterfield magazine advertisements during this period also contained the following messages: Chesterfield contains only ingredients that give you the Best Possible Smoke -- as tested and approved by scientists from leading universities. 5 J.A. 21 (c. 1952). [Chesterfield cigarettes contain] PURE, COSTLY MOISTENING proved by over 40 years of continuous use in U.S.A. tobacco products as entirely safe for use in the mouth -- chemically pure, far most costly glycerol and pure sugars which are natural to tobacco -- nothing else. . . . Scientists from Leading Universities Make Sure that Chesterfield Contains Only Ingredients that Give You the Best Possible Smoke. 5 J.A. 26 (c. 1952). AND NOW -- CHESTERFIELD FIRST TO GIVE YOU SCIENTIFIC FACTS IN SUPPORT OF SMOKING. A responsible consulting organization reports a study by a competent medical specialist and staff on the effects of smoking Chesterfields. For six months a group of men and women smoked only Chesterfield -- 10 to 40 day -- their normal amount. 45 percent of the group have smoked Chesterfields from one to thirty years for an average of ten years each. At the beginning and end of the six-months, each smoker was given a thorough examination including X-rays, and covering the sinuses, nose, ears and throat. After these examinations, the medical specialist stated . . . \"It is my opinion that the ears, nose, throat and accessory organs of all participating subjects examined by me were not adversely affected in the six-months period by smoking the cigarettes provided.\" 5 J.A. 23 (c. 1952).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Many similar Arthur Godfrey advertisements were also introduced into evidence, including the following three: You know you hear all this applesauce about -- you'd better quit smoking, pal, or you won't be here long and stuff. Listen to this. [At this point Mr. Godfrey told his listeners about the same \"medical\" study that he had related on September 24.] There's the story. Were not adversely affected. Chesterfield is the right -- [now addressing Tony Marvin, the announcer] Will you hold that over there for me? -- Chesterfield -- you've been smoking 'em, gosh, Tony, how many do you smoke a day? [Mr. Marvin:] I run about 2 1/2 packs a day, Arthur. [Mr. Godfrey:] 2 1/2 packs a day. If he wasn't so tight, he'd smoke 3. LAUGHTER. They're wonderful cigarettes, in either size, you know, king-size, this size here, or the regular size, they're the same tobacco. Go ahead and smok'em and enjoy'em, they're wonderful. 5 J.A. 158 (Oct. 1, 1952). [I have] a client here, the Chesterfield people, Liggett and Myers are their names. The firm . . . is an honorable one, a trustworthy one. For years and years and years that they have been advertising, you never heard them make an unsubstantiated claim -- ever! Certainly not during the time that I've been with 'em. They came out, not so long ago, with a report by an eminent physician -- it's a good report -- I suppose there are those who wonder about it. If you believe in me, and over the 23 years I've been in the radio, you know that I have never yet misled you with advertising. Nobody has been able to buy me enough to do that. If you believe in me, then you take my word that I know this -- that the Liggett and Myers people don't make statements that they can't substantiate. And when they say that after this test that they made with the doctor, that after he made it, he comes up and say, quote -- 'It is my opinion that the ears, nose, throat, and accessory organs of all participating subjects examined by me, were not adversely affected in the six-months period by smoking the cigarettes provided.' And they mean what they say -- that specialist said it. Liggett and Myers have substantiated it. Remember that when you're wondering about cigarettes. Smoke Chesterfields -- they're good. 5 J.A. 161 (Nov. 5, 1952). [A] medical specialist is making . . . examinations . . . every two months. Now they've gone, I think, as far as 8 months. That's so far, 8 months. What they did was get a group of people from various walks of life. . . . And 45% of this group smoked Chesterfields for an average of over 10 years. After 8 months, the medical specialist reports he has observed no adverse effects whatever on the noses, the throat, the sinuses, the ears, or other organs from smoking Chesterfields. That's -- that seems to me to [mean] mildness, real mildness. You've been wondering about whether or not smoking does things to you which you don't want to do? Well, why don't you smoke Chesterfields. Here's a guy watchin' a lot of people and nothin' happened to them yet. We've been smokin 'em a long time. Of course, we were always this way. You can't judge by us. But they're good, very fine, and I never recall seein' on anybody's gravestone -- He Smoked Too Much, did you? I never did. So Chesterfield's for you, regular or king size. 5 J.A. 171 (Jan. 8, 1953).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The third amended complaint contained 14 counts; we have therefore summarized the salient points.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. We find this contention to be without even colorable merit and dispose of it summarily. Unlike the plaintiffs in Granfield v. Catholic University of America, 174 U.S. App. D.C. 183, 530 F.2d 1035 (D.C.Cir.), cert. denied, 429 U.S. 821, 50 L. Ed. 2d 81, 97 S. Ct. 68 (1976), we think that there is no question regarding Mr. Cipollone's \"wholehearted contrariety,\" 530 F.2d at 1045, to the defendants' position. Neither do we find applicable the mootness concerns motivating the decision in In re Coordinated Pretrial Proceedings in Petroleum Products Antitrust Litigation, 830 F.2d 198 (Emerg.Ct.App.), cert. denied, 484 U.S. 969, 108 S. Ct. 466, 98 L. Ed. 2d 405 (1987). In Petroleum Products, a pending decision before the Ninth Circuit -- over which the Emergency Court of Appeals had no control -- might have mooted, as a matter of law, the proceedings before, or decision of, that court. See id. at 202-04. Here, by contrast, we address the intentional tort claims simultaneously with our rejection of Mr. Cipollone's position on the express warranty claim. Thus, we have no reason to believe that Mr. Cipollone's position lacks, or will lack, \"wholehearted contrariety\" to Lorillard's on the intentional tort claims. Moreover, the fact that plaintiff is willing to settle for less than he might get does not mean that his position is not contrary to the defendants. For all of these reasons, we have no problem finding a case or controversy under Article III.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Although Mr. Cipollone was prepared to forego pursuit of this claim in the event that his breach of express warranty verdict was upheld, that has not happened. See infra Part VI.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The district court instructed the jury as follows: Defendant, Liggett, has the burden to prove by a preponderance of the believable evidence that Rose Cipollone had a complete understanding and appreciation of the nature and extent of the health risks of cigarette smoking, and further that her use of cigarettes was voluntary and unreasonable. . . . In determining whether Rose Cipollone should be held responsible for her injuries, you must consider the cigarettes which Rose Cipollone smoked and the health risks which they have been alleged to have. If you have determined that the use of those cigarettes involved any significant health risk, you must then decide whether Rose Cipollone had knowledge and appreciation of those risks and, having such knowledge and appreciation, voluntarily and unreasonably proceeded to encounter those risks by smoking cigarettes and by failing to quit smoking. . . . If you decide that by continuing to smoke Rose Cipollone voluntarily and unreasonably encountered a known risk, you must then decide whether that conduct was a proximate cause of Rose Cipollone's injuries. However, if you find that she did not do so voluntarily or acted reasonably then defendants have not met their burden as to this defense. 2 J.A. 108-10.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Interrogatory 10 asked whether \"Mrs. Cipollone voluntarily and unreasonably encounter[ed] a known danger by smoking cigarettes. \" Interrogatory 11 asked whether \"this conduct by Mrs. Cipollone [was] a proximate cause of her lung cancer and death.\" Interrogatory 12 asked the jury to apportion responsibility between Mrs. Cipollone and Liggett based upon its answers to the preceding questions 10 and 11. See supra at 554.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Avoidable consequences is the name given to the damage that plaintiff causes to herself by breaching her duty to mitigate damages.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. An example may help to clarify. Suppose the jury finds that the plaintiff suffered $100,000 in damages from the bypass surgery. Suppose also the jury finds that, after plaintiff had begun treatment with the podiatrist, her conduct before the toe surgery was 10% responsible for her ultimate injury (the first percentage), but that her conduct before and after the toe surgery combined were 80% responsible (the second percentage). Thus the podiatrist's conduct (before the toe surgery) must have been 20% responsible for the ultimate injury. On these facts, even though the plaintiff's total conduct was more responsible for her injury then the podiatrist's (80% versus 20%), she would recover, because her conduct before the toe surgery was less responsible for her ultimate injury than the podiatrist's conduct during that time (10% versus 20%). However, her ultimate recovery would be only $20,000 (because the podiatrist was only 20% responsible for the ultimate injury).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The Court noted, however, that this timeline approach to dividing the plaintiff's conduct into that relevant to contributory fault and that relevant to avoidable consequences will not work in every case. See 111 N.J. at 438 n. 2, 545 A.2d at 152 n. 2 (citing Waterson v. General Motors Corp., 111 N.J. 238, 544 A.2d 357 (1988), which found that failure to use a seat belt, although not a cause of the automobile accident that resulted in injury, was a cause of avoidable consequences).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The Court also noted that \"it is often difficult to determine how much of the plaintiff's injury is due to the preexisting condition and how much the aggravation is caused by the defendant\" and that the defendant should bear the burden of separating the two so that any damage not separable is borne by the defendant. 111 N.J. at 439, 545 A.2d at 152.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. As is indicated by the jury's answer to special interrogatory number 7, Liggett owed a duty to warn consumers of the health effects of smoking prior to 1966. This issue should not be re-tried; the existence of this duty has been properly established. See infra at 560.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The district court's charge instructed the jury to: consider the extent to which ordinary consumers prior to 1966 were aware that cigarette smoking posed significant health risks. . . . The obviousness of a product's danger -- as measured by such general consumer knowledge, not by a particular plaintiff's knowledge -- is one element to be considered in order for you to determine whether a duty to warn exists. 2 J.A. 105-06.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Liggett also contends that the factors listed by the district court as relevant to determining whether a duty to warn exists were superfluous and prejudicial. We find this argument to be frivolous.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. As the district court carefully instructed, this case involves two distinct causal inquiries: first, whether Liggett's violation of legal norms caused Mrs. Cipollone to smoke, and second, whether the cigarettes that Mrs. Cipollone smoked as a result of Liggett's violations proximately caused her cancer.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. For example, two fires merge and the combined fire destroys the plaintiff's property, although either fire would have done so alone. See Anderson v. Minneapolis, St. Paul \u0026 Sault Ste. Marie Ry., 146 Minn. 430, 179 N.W. 45 (1920). In such a case, one has to assign responsibility to either fire or no liability would be assigned because each defendant could prove, individually, that plaintiff's property would have been destroyed even if he had acted non-tortiously. Thus, liability is assigned even though each defendant's conduct could be seen as irrelevant to the ultimate outcome.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Some decisions and commentators have used statistics to elaborate on the meaning of \"but for\" causation, see, e.g., In re Agent Orange Prod. Liab. Litigation, 597 F. Supp. 740, 833-42 (E.D.N.Y. 1984), Orloff, Theories of Cancer and Rules of Causation, 27 Jurimetrics 255 (Spring 1987). This approach defines \"but for\" causation as at least a 50% chance that the defendant's conduct caused the injury in question. It is not clear to us that this is the instruction that Liggett is requesting. Nor is it clear to us that this is the only way to define \"but for\" causation. The leading hornbook on Torts states that \"[the] question of [causation in] 'fact' is one upon which all the learning, literature and lore of the law are largely lost. It is a matter upon which lay opinion is quite as competent as that of the most experienced court. For that reason, in the ordinary case, it is peculiarly a question for the jury.\" Keeton, et al., Prosser and Keeton on The Law of Torts 264-65 (5th ed. 1984). By seeking to define causation more numerically (i.e., at least 50% probability), the statistics-oriented commentators may be advocating a substantive change that New Jersey would not endorse. We are not convinced that when a jury determines that \"but for\" a defendant's conduct, the injury would not have occurred, it is determining that the chances of that injury being the result of defendant's conduct are 50% or greater. Traditionally, jury instructions have been in words, not numbers. Prosser and Keeton seems to suggest that a jury's determination of causation defies numerical analysis, and New Jersey may want to keep it that way. Thus, with some trepidation, but with considerable support, we offer the following discussion of causation without an airtight definition of what \"but for\" causation is. For purposes of the discussion, it is sufficient that the reader recognize that a \"but for\" test requires more direct linkage between defendant's conduct and the injury than does the \"substantial factor\" instruction given by the district court. See also Calabresi, Concerning Cause and the Law of Torts: An Essay for Harry Kalven Jr., 43 U.Chi.L.Rev. 69, 84-91 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Keeton, Products Liability -- Inadequacy of Information, 48 Tex.L.Rev. 398, 414 (1979).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. We note that, notwithstanding our preemption decision, if plaintiff argues an addiction theory, a jury might be able to consider Mrs. Cipollone's post-1965 smoking as well as her pre-1966 smoking for purposes of determining whether Liggett's tortious conduct caused Mrs. Cipollone's injury. If the jury believes that Liggett's pre-1966 conduct proximately caused Mrs. Cipollone to smoke cigarettes pre-1966 and that Mrs. Cipollone became addicted as a result of that smoking, then those post-1965 cigarettes smoked as a result of the addiction should be considered in discerning whether Liggett's conduct proximately caused Mrs. Cipollone's lung cancer. The Surgeon General has recently concluded that \"scientists in the field of drug addiction now agree that nicotine, the principal pharmacologic agent that is common to all forms of tobacco, is a powerfully addicting drug.\" U.S. Dep't Health \u0026 Human Serv., The Health Consequences of Smoking: Nicotine Addiction -- A Report of the Surgeon General (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Initially, we emphasize that a representation made by a seller is not an express warranty if it is made in such a manner that both the seller and the buyer should understand to be a representation upon which the buyer will not rely. \"All descriptions by merchants must be read against the applicable trade usages. . . .\" N.J.S.A. § 12A:2-313 U.C.C. Comment 5. A representation made in a manner that is generally recognized not to be a basis upon which purchasers make a decision to purchase goods cannot be a warranty when read against \"applicable trade usages.\" This requirement is in accord with the traditional common law \"puffing\" exception in the law of contracts. See H. Hunter, Modern Law of Contracts: Breach and Remedies para. 4.02[3], at 4-7 to 4-8 (1986 \u0026 Supp. 1989). But Liggett has not contended, and we do not think it could, that its advertisements to consumers are generally recognized as not forming the basis upon which cigarette purchasing decisions are made. If such were the case, Liggett would not have spent millions of dollars on advertising.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. See, e.g., Winston Indus., Inc. v. Stuyvesant Ins. Co., 55 Ala. App. 525, 317 So. 2d 493 (Civ.App.Ala.) (purchaser permitted to sue under § 2-313 for breach of a warranty that he never received), cert. denied, 294 Ala. 775, 317 So. 2d 500 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. See, e.g., Royal Typewriter Co. v. Xerographic Supplies Corp., 719 F.2d 1092, 1101 (11th Cir. 1983) (\"Absence of reliance will negate the existence of an express warranty.\"); Scaringe v. Holstein, 103 A.D.2d 880, 477 N.Y.S.2d 903 (1984) (notice that shift did not work demonstrated that plaintiff could not have relied on an alleged warranty that the used car was in \"excellent condition\"); Indust-Ri-Chem Lab., Inc. v. Par-Pak Co., 602 S.W.2d 282, 293 (Tex.Ct.App. 1980) (\"Obviously, if the buyer knows that a representation of the seller is untrue, that representation cannot be a part of the basis of the bargain.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. See, e.g., 1 J. White \u0026 R. Summers, Uniform Commercial Code § 9-5, at 448, 455 (3d ed. 1988); W. Hawkland, Uniform Commercial Code Series § 2-313:05, at 299-300 (1983 \u0026 Supp. 1987). Professor White has written an amicus brief on this issue, consistent with his treatise position, on behalf of Lorillard, Philip Morris, R.J. Reynolds, American Tobacco Co. and Brown \u0026 Williamson Tobacco Co.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. In their briefs, the parties discuss five New Jersey and Third Circuit cases: Jackson v. Muhlenberg Hospital, 96 N.J. Super. 314, 232 A.2d 879 (Law Div. 1967), rev'd on other grounds, 53 N.J. 138, 249 A.2d 65 (1969) (per curiam); Collins v. Uniroyal, Inc., 126 N.J. Super. 401, 315 A.2d 30 (App.Div. 1973) (per curiam), aff'd, 64 N.J. 260, 315 A.2d 16 (1974) (per curiam); Gladden v. Cadillac Motor Car Division, 83 N.J. 320, 416 A.2d 394 (1980); Pritchard v. Liggett \u0026 Myers Tobacco Co., 350 F.2d 479 (3d Cir. 1965); and Henry Heide, Inc. v. WRH Products Co., 766 F.2d 105 (3d Cir. 1985). We discuss Gladden and Pritchard in the text. See infra at 566. We do not find the other cases to be particularly helpful. In Jackson, the Superior Court held that a hospital patient who contracted hepatitis from infected blood supplied by a blood bank could sue the blood bank for its breach of express warranty to the hospital. Mr. Cipollone stresses the sentence stating that \"the patient . . . probably never saw the label [constituting the warranty] on the container of blood [that infected her].\" 96 N.J.Super. at 330, 232 A.2d at 888. The case, however, is inapposite because the patient in that case was suing not under section 2-313 but under N.J.S.A. § 12A:2-318, which permits third party beneficiaries to sue for breach of express warranty. Jackson did not say that the hospital's reliance was irrelevant, yet that is the operative question. That a third party beneficiary may sue for breach of express warranty even if she did not rely on the affirmation of fact does not imply that the affirmation would constitute a warranty even if the buyer had not relied on it. In Collins, the Superior Court held that a tire manufacturer's effort to limit a breach of express warranty remedy to replacement of the tires was unconscionable and hence unenforceable. The limitation on remedy was contained in a written warranty that also guaranteed the tires against \"road hazards.\" The court did not discuss the meaning of \"the basis of the bargain\" but focused on the unconscionability of the remedy limitation. The Superior Court deemed one of the tire manufacturer's advertisements relevant to the case, in part because \"the advertisement helped to explain the scope and intent of the 'road hazard' part of the warranty.\" 126 N.J.Super. at 408, 315 A.2d at 34. Mr. Cipollone contends that Collins supports his position that reliance is not an element of section 2-313 because the court never discussed whether the buyer relied on the written warranty; the court merely stated that \"the warranty . . . was given to [the buyer] at the time he bought the tires.\" Id. at 405, 315 A.2d at 33. Despite Mr. Cipollone's request, we decline to base our decision on the New Jersey Superior Court's failure to discuss an issue. Liggett contends that Collins supports its position because the Superior Court, immediately before its discussion about the advertisements stated that \"the jury could have inferred . . . that [the buyer had] relied\" on the advertisement. Id. at 408, 315 A.2d at 34. We hesitate to place too much weight on this remark for three reasons. First, as noted above, the Superior Court did not discuss the relevance of the buyer's reliance; it merely noted that the jury could have inferred that the buyer had relied and then continued with its discussion in a new sentence that began, \"More importantly, the advertisement helped to explain the scope and intent of the 'road hazard' part of the warranty. . . .\" Id. Second, the issue in Collins that the Superior Court discussed was whether the remedy limitation was unconscionable; that the buyer's reliance on an advertisement making broad claims about the safety of the product was thought relevant to the issue of unconscionability does not necessarily imply that the buyer's nonreliance on a reasonable advertisement would have precluded the advertisement from becoming part of the manufacturer's express warranty. Third, the New Jersey Supreme Court in its short per curiam opinion affirming the Superior Court further muddied the waters. In a statement obliquely favorable to Mr. Cipollone's position, the Supreme Court addressed the issue in terms of what would be \"the natural reliance and the reasonable expectation of the purchaser flowing from the warranty,\" 64 N.J. at 263, 315 A.2d at 18, thus suggesting, as Mr. Cipollone argues, that the significant factor is what a purchaser would reasonably infer from the affirmation of fact or promise rather than what the purchaser in the case-at-bar actually inferred, and hence relied on. However, the Supreme Court also discussed what \"the purchaser of a tire buying it because \" of the warranty would think, id. (emphasis added), hence suggesting that reliance had some role to play in discerning whether the warranty was unconscionable. In light of all of these offsetting considerations, we do not believe that Collins is helpful in analyzing the issue before us. In Heide, the issue was whether a chemical company's specification sheet, which listed several physical properties of the company's plastic, constituted an express warranty. This court analyzed the issue as follows: The facts as stipulated show that the . . . sheet was not the basis of any bargain between [the chemical company and the manufacturer. The chemical company] gave no express warranty in this case that the [plastic] would conform to the . . . sheet, and thus [the plaintiff] cannot be the beneficiary of any such warranty. 766 F.2d at 112. The court did not say why it was holding that the sheet did not constitute an express warranty. The word \"reliance\" enters the opinion only through a recital of the chemical company's contention. Id. We therefore glean little guidance from Heide.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Section 12 of the Sales Act provides: Any affirmation of fact or any promise by the seller relating to the goods is an express warranty if the natural tendency of such affirmation or promise is to induce the buyer to purchase the goods, and if the buyer purchases the goods relying thereon. No affirmation of the value of the goods, nor any statement purporting to be a statement of the seller's opinion only shall be construed as a warranty.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The court explicitly noted that Judge Freedman's concurrence represented \"the majority view on the question of reliance,\" Pritchard, 350 F.2d at 487.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. See, e.g., Shanker, The Seller's Contractual Obligation Under U.C.C. 2-313 to Tell the Truth, 38 Case W.Res.L.Rev. 40 (1987-88); Heckman, \" Reliance\" or \"Common Honesty of Speech\": The History and Interpretation of Section 2-313 of the Uniform Commercial Code, 38 Case W.Res.L.Rev. 1 (1987-88); Coffey, Creating Express Warranties Under the U.C.C.: Basis of the Bargain -- Don't Rely on It, 20 U.C.C.L.J. 115 (1987); Lewis, Toward a Theory of Strict \"Claim\" Liability: Warranty Relief for Advertising Representations, 47 Ohio St.L.J. 671 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. For example, imagine a tire merchant describing a tire to three different prospective purchasers, each listening to his sales talk at the same time. The seller guarantees that the tire will (1) be safe for use even in heavily loaded vehicles; (2) last at least 20,000 miles; and (3) be the same style tire sold with a Rolls Royce. The first purchaser buys the tire relying on the seller's safety warranty. The second buys the tire relying on the seller's durability warranty. The third buys the tire relying on the seller's style warranty. None of the purchasers communicates to the seller the reason why he or she is purchasing one of the tires, although the reason for the purchase is communicated to the buyer's spouse, who will later come forward to testify truthfully regarding what the buyer relied on when making the purchase. It is implausible that each buyer has a different warranty, and that the second buyer, but not the first or third buyers, can sue if the tire wears out before 20,000 miles.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The burden that we place on the plaintiff stems in part from the fact that this case involves neither a written warranty delivered to the purchaser in connection with a sale nor an oral affirmation of fact or promise made to the purchaser in person by the seller. In both of those situations there is no question that the plaintiff has knowledge that the alleged warranty exists.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. This interpretation of section 2-313 is also consistent with decisions of courts that have held that section 2-313 does \"not . . . require a strong showing of reliance.\" Sessa v. Riegle, 427 F. Supp. 760, 766 (E.D.Pa. 1977), aff'd, 568 F.2d 770 (3d Cir. 1978). Because the district court's decision in Sessa was affirmed by judgment order, and not by a reported opinion, the decision is not binding precedent on this Court. See Third Circuit IOP Chapter 8C.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. If the defendant proves that the buyer did not believe in the warranty, the plaintiff should then be given the opportunity to show that the buyer nonetheless relied on the warranty. It is possible to disbelieve, but still rely on, the existence of a warranty. In this sense, the buyer can \"buy\" a lawsuit. Thus, if the buyer disbelieved the warranty, but could prove that she was relying on it when she bought the product, she could return the product for stipulated damages -- for example, a refund -- or economic damages -- the difference between \"the value of the goods accepted and the value of the goods would have had if they had been warranted,\" U.C.C. § 2-714. Such a buyer could not recover consequential damages, however. She would be barred by both U.C.C. § 2-715 (\"If [the injured person] discover[s] the defect prior to his use, the injury would not proximately result from the breach of warranty.\"), and traditional contract principles, under which a buyer has a duty to mitigate damages and cannot recover for damages that she \"could have avoided without undue risk, expense or humiliation,\" Restatement (Second) of Contracts § 350(1) (1965). Other courts have noticed the distinction between knowledge and reliance as well. See Royal Business Machines v. Lorraine Corp., 633 F.2d 34, 44 (7th Cir. 1980) (\"The situation of the parties, their knowledge and reliance, may be expected to change. . . .\" (emphasis added)). We emphasize that we are not adopting Liggett's rebuttable presumption of reliance theory. Reliance only comes into play if, after the defendant has proved non-belief, the plaintiff then tries to prove reliance despite non-belief. The burden is on the plaintiff to prove reliance despite non-belief, and if she meets that burden she can collect economic damages.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. N.J.S.A. 12A:1-103 states: Unless displaced by the particular provisions of this Act, the principles of law and equity, including the law merchant and the law relative to capacity to contract, principal and agent, estoppel, fraud, misrepresentation, duress, coercion, mistake, bankruptcy or other validating or invalidating cause shall supplement its provisions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The district court's interpretation of the \"basis of the bargain\" requirement is also objective in the weaker sense that in order to constitute an express warranty, a seller's statements must \" naturally induce the purchase of the product,\" 4 J.A. 234 (emphasis added). To that extent, we agree with the district court. However, for reasons explained in the text, we do not believe that either New Jersey or the drafters of the U.C.C. intended the buyer's awareness of, or belief in, the statements to be completely irrelevant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Although we have emphasized the relevance of a buyer's belief, our construction of section 2-213 can be read as simply fleshing out the more commonly discussed reliance requirement with a framework of shifting presumptions and burdens of proof. Thus, in the context of advertisements claimed to be warranties, a plaintiff buyer must first prove that she saw the advertisements. This raises a (rebuttable) presumption of belief, which in turn raises an irrebuttable presumption of reliance. Next, a defendant seller may rebut the presumption of reliance, but only by proving that the plaintiff disbelieved the advertisement. Cf. supra note 28. Successfully proving disbelief creates a new rebuttable presumption of nonreliance. Finally, the plaintiff may rebut this presumption by proving reliance directly. See supra note 31. Whether our holding is read as imposing a \"belief\" requirement or a \"reliance\" requirement thus is probably just a question of semantics, not substance.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Liggett invokes the doctrine of \"estoppel by verdict.\" For the reasons explained in the text, we do not find that doctrine applicable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. We note that if she should have disbelieved the advertisements it is not likely that the advertisements would naturally induce the purchase of the product.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. The differences between express and implied warranties are significant in this context. Implied warranties involve societal standards imposed by law. Express warranties involve standards that the seller promises to deliver. If implied warranties hold sellers responsible for legally imposed duties of care, it only seems fair that buyers are held responsible to similar legally imposed standards of due care. Thus, the New Jersey Supreme Court has held that comparative fault principles should apply in implied warranty cases. However, the legally enforced obligation to honor express warranties stems from society's interest in enforcing promises. See Spring Motors Distributors, Inc. v. Ford Motor Co., 98 N.J. 555, 579, 489 A.2d 660, 672 (1985). It is not nearly as clear that what the buyer does should be relevant in determining whether the law will hold the seller liable for what it has promised. Thus, because Maiorino involved only implied warranties and Cintrone did not specify whether there was any express warranty involved, we do not read those cases to stand for the proposition that comparative fault principles automatically apply in express warranty cases.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Defendant has not argued, nor do we believe that they could argue, that belief in their advertisements was unreasonable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Defendants could prevent Mr. Cipollone's recovery on the express warranty claim if, despite finding the warranty, the jury finds that the plaintiff misused or abused the cigarettes. There is no evidence of misuse or abuse in this record, however. Plaintiff was using the cigarettes just as Liggett advertised that she should.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. As an alternative basis for declining to grant Liggett's motion for a new trial or judgment n.o.v. on this issue, the district court held that Liggett had failed to object to the jury charge on the issue of contributory fault with respect to the express warranty claim and had therefore waived it pursuant to Fed.R.Civ.P. 51. Although this issue is now no longer relevant, both because there will be a new trial and because of our finding that comparative fault could not be applicable in this case unless Liggett can prove abuse or misuse, we are satisfied that Liggett did adequately object to the district court's ruling on this issue. See Defendant's Objections and Exceptions to Jury Charge and Interrogatories as Given, 2 J.A. 130-31.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. In its opinion denying Liggett judgment n.o.v., the district court held that Liggett had waived this point by failing to object to jury instructions at trial. See Fed.R.Civ.P. 51. As in the district court's waiver determination in the comparative fault context, the waiver issue is no longer relevant because there will be a new trial. Nonetheless, given the complexity of the case, and the potential importance of this issue on retrial, we think it important to give the district court the benefit of our views on this aspect of the matter.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Liggett commences its argument by pointing out that to recover on an express warranty claim, the plaintiff must show a breach of an express warranty. We agree. A suit cannot be maintained on an express warranty theory if the injury complained of resulted from an occurrence or product characteristic outside the scope of the express warranty. If a tire manufacturer, for example, warrants against blowouts when its tires are \"used in normal passenger car service,\" a suit cannot be maintained on an express warranty theory if the blowout complained of occurred while the car was not being used in normal passenger car service. See Collins, 126 N.J.Super. at 405, 315 A.2d at 33-34. The manufacturer may, however, make warranties that go far beyond promising that the goods will be free from defect, and if it does so, the freedom of the product from defect is irrelevant to an express warranty claim. See Collins, 64 N.J. at 262, 315 A.2d at 17. As our discussion makes clear, however, we think that there is sufficient evidence of both (1) the existence of a warranty that cigarettes were safe and (2) breach of that warranty.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. In 1984, Congress mandated rotating warnings on cigarette packages; one of these warnings states \"SURGEON GENERAL'S WARNING: Smoking Causes Lung Cancer. . . .\" 15 U.S.C. § 1333(a)(1) (Supp. II 1984). The Surgeon General has concluded that \"'the case for cigarette smoking as the principal cause of lung cancer is overwhelming.'\" U.S. Dep't Health \u0026 Human Serv., The Health Consequences of Smoking: Nicotine Addiction -- A Report of the Surgeon General 11 (1988) (quoting U.S. Public Health Service, The Health Consequences of Smoking: A Public Service Review -- 1967 (rev. ed. 1968)). See also U.S. Dep't Health \u0026 Human Serv., The Health Consequences of Smoking: Cancer -- A Report of the Surgeon General (1982); U.S. Dep't Health \u0026 Human Serv., The Health Consequences of Smoking for Women: A Report of the Surgeon General (1980); U.S. Dep't Health, Educ. \u0026 Welfare, Smoking and Health: A Report of the Surgeon General (1979); U.S. Dep't Health, Educ. \u0026 Welfare, Smoking and Health: Report of the Advisory Committee to the Surgeon General of the Public Health Service (1964).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. The risk-utility claim alleged that the risk of cigarettes outweighed their social utility. See Plaintiff's Third Amended Complaint, 1 J.A. 39, 42.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. The district court (in an unpublished opinion of October 27, 1987) apparently relied on comment i to Section 402A of the Restatement (Second) of Torts, which the drafters of the Product Liability Act meant to incorporate. See N.J.S.A. 2A:58C-1, Senate Judiciary Committee Report at 465. Comment i says that \"good tobacco is not unreasonably dangerous merely because the effects of smoking may be harmful.\" As the Appellate Division of the Superior Court did in Dewey, 542 A.2d at 925, we reject the applicability of comment i in this situation. The fact that the New Jersey legislature endorsed comment i in 1987 does not mean that the ordinary consumer must have known about the harms of smoking in, for example, 1958.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. The district court granted a directed verdict for the defendants on the plaintiff's alternative design claim. See 683 F. Supp. 1487, 1493-95 (D.N.J. 1988). This decision has not been appealed and thus the plaintiff will not be free to advance this claim again. However, we note that because the Federal Labeling Act, which formed the basis of our preemption decision, does not preempt design defect claims, plaintiff may (as of this writing) proceed against co-defendants Philip Morris and Lorillard, as well as Liggett, on the risk-utility claim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. It is not disputed that if there is a failure to warn award, prejudgment interest will be appropriate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. Dr. Seriff's affidavit states that \"my impression [on July 24, 1981] included the following possibilities: A. Resolving pneumonia; B. Primary lung cancer; C. Dog parasite (difillaria immitus) -- giving a round area of inflammation; D. Carcinoid of the lung; E. Metastatic lung tumor -- unlikely.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. If July 30, 1981, the date of Mrs. Cipollone's second visit to Dr. Seriff, was the first day on which she should have known that she might have lung cancer, her suit was timely filed because July 30, 1983 was a Saturday. Under New Jersey law, the limitations period extends to the first day on which legal business can be transacted, which was August, 1, 1983, the day she filed her suit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. The Vispisiano case provides the legal standard by which we judge this issue, but we do not find the facts or the language of that case particularly helpful. The touchstone of Vispisiano is that the causal connection between toxic chemicals in the marketplace and cancer is not generally known. This is not so with smoking and cancer. Second, the language of Vispisiano can be used to argue either side of this case. Although Vispisiano found that medical confirmation was not necessary to start the statute running, 107 N.J. at 437, 527 A.2d at 77, the court also held that the statute could not start running until a plaintiff had \"reasonable medical information\" on which to base her belief that she might have a claim, id. at 435, 527 A.2d at 76. As of July 30, 1981, Mrs. Cipollone's knowledge that she might have lung cancer was based solely on her own suspicions after one visit to her general practitioner and one visit to a lung specialist who told her that she had a viral infection. However, taking into account the procedural posture of Vispisiano (a reversal of summary judgment for the defendants), we read that case's ambiguous language to mean that these fact bound inquiries should be left to the jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. Mr. Cipollone also contends that our preemption decision was erroneous in order to preserve this issue for later review. The prior decision of this court is binding on this panel. See IOP Chapter 8C.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. Lorillard argues in its brief that Mr. Cipollone's risk-utility claim is also barred, impliedly, by the Labeling Act. As the language quoted in text indicates, however, the Labeling Act was meant to apply to cigarette companies' actions with respect to the advertising and promotion of cigarettes. The risk-utility claim involves the basic decision to market the product. See supra Part IX. As we held in our earlier preemption decision, \"we cannot say that the scheme created by the Act is 'so pervasive' or 'so dominant' as to eradicate all of the Cipollone's claims. Nor are we persuaded that the object of the Act and the character of obligations imposed by it reveal a purpose to exert exclusive control over every aspect of the relationship between cigarettes and health.\" 789 F.2d at 186. We are also mindful of federalism concerns, which mandate a presumption that \"Congress did not intend to displace state law.\" Maryland v. Louisiana, 451 U.S. 725, 746, 68 L. Ed. 2d 576, 101 S. Ct. 2114 (1981). See also Florida Lime \u0026 Avocado Growers, Inc. v. Paul, 373 U.S. 132, 142, 10 L. Ed. 2d 248, 83 S. Ct. 1210 (1963). (\"Federal regulation of a field of commerce should not be deemed preemptive of state regulatory power in the absence of persuasive reasons -- either that the nature of the regulated subject matter permits no other conclusion, or that the Congress has unmistakably so ordained.\"). In light of this binding precedent, we cannot interpret the Labelling Act in such a way as to bar Mr. Cipollone's risk-utility claim.\u003c/span\u003e\n\n",
    "body_length": 163698,
    "citedas": [
      "893 F.2d 541"
    ],
    "attorneys": "Marc Z. Edell (Argued), Cynthia A. Walters, Budd Larner Gross Picillo, Rosenbaum Greenberg \u0026 Sade, P.C., Short Hills, New Jersey, Alan M. Darnell, Wilentz, Goldman \u0026 Spitzer, Woodbridge, New Jersey, Attorneys for Appellant in 88-5784, Antonio Cipollone. Thomas E. Silfen (Argued), Brown \u0026 Connery, Westmont, New Jersey, Arnold \u0026 Porter, Washington, District of Columbia, Shook, Hardy \u0026 Bacon, Kansas City, Missouri, Attorneys for Appellant in 88-5771, Philip Morris, Inc. Robert E. Northrip (Argued), Rhonda E. Fawcett, W. Edward Reeves, Shook, Hardy \u0026 Bacon, Kansas City, Missouri, William S. Tucker, Jr., Stryker, Tams \u0026 Dill, Newark, New Jersey, Attorneys for Appellant in 88-5770, Lorillard, Inc. Donald J. Cohn (Argued), James V. Kearney, Webster \u0026 Sheffield, New York, New York, Alan S. Naar, Greenbaum, Rowe, Smith, Ravin, Davis \u0026 Bergstein, Woodbridge, New Jersey, Attorneys for Appellant in 88-5732, Liggett Group, Inc.",
    "category": [
      "3",
      "252",
      "188"
    ],
    "judges": "Gibbons, Chief Judge, Becker, and Nygaard, Circuit Judges. Gibbons, Chief Judge, concurring.",
    "citation_count": 95
  }
}
