{
  "id": "saWKSGYBTlTomsSBwbQy",
  "document": {
    "title": "05/07/75 LAVERNE F. GORHAM v. UNITED STATES",
    "full_title": "LAVERNE F. GORHAM v. UNITED STATES ; CHESTER WILLIAMS, JR. V. UNITED STATES",
    "jurisdiction": "District of Columbia Court of Appeals",
    "date": "1975-05-07T00:00:00.000Z",
    "docket": "Nos. 5992, 5995",
    "body": "GALLAGHER, Associate Judge: These cases were consolidated for trial \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and on appeal. After a panel of this court had issued a decision in Franklin v. United States (D.C.App.No. 5960) the court en banc vacated that decision sua sponte and consolidated these appeals therewith for reargument before the court sitting en banc. The basic issue presented is whether a criminal defendant charged with possession of heroin for personal use or possession of implements of crime (narcotics paraphernalia) may raise an affirmative defense of lack of common law criminal responsibility due to heroin addiction.\n\nIt is necessary, at the outset, to relate what this case actually involves and where appellants' contention leads us. We are considering heroin addiction in the context of crime. During the past several years it has become increasingly evident that \"the problem of urban crime is largely a problem of heroin addiction.\" \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Once a user becomes an addict, \" is then bound to a treadmill that requires increasing amounts of heroin to feel healthy and increasing amounts of criminal activity to obtain the heroin.\" \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e It has been reported that \" criminal court Judges have found that 75 percent of all the cases they try involve defendants with a history of heroin abuse.\" \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Other estimates \"attribute 33 percent to 50 percent of the hold-ups, burglaries, muggings and thefts committed in the nation's 34 major urban centers to heroin addicts.\" \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Whatever the accurate prevailing percentage may be, the argument advanced does not have the limited impact of a holding concerning a rare claim of duress, or the occasional defense of insanity, \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e rather, it would cut deeply into the enforcement effort on a massive amount of crime in this city.\n\nThe defense sought to be asserted has been explored inch by inch and rejected in a recent en banc decision by the Circuit Court in this jurisdiction in United States v. Moore, 158 U.S.App.D.C. 375, 486 F.2d 1139, cert. denied, 414 U.S. 980, 38 L. Ed. 2d 224, 94 S. Ct. 298 (1973), with which we agree. The plurality opinion and the concurrence by Judge Leventhal searched all the nooks and crannies in this issue. Consequently, there is no point in retracing that ground. We will confine ourselves for the most part to the peculiarities of this case and a Discussion of additional considerations.\n\nI. PROCEDURAL HISTORY\n\nPursuant to the procedure suggested in Watson v. United States, 141 U.S.App.D.C. 335, 346-47, 439 F.2d 442, 453-54 (1970), the defendants made a pretrial motion to dismiss under Super.Ct.Cr.R. 12 and the trial court received extensive testimony from appellants and experts on their behalf which was directed at establishing that their addiction precluded prosecution for the charged offenses under the Eighth Amendment. In an order issued on March 14, 1971, the motion was denied. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e There is no contention here on the Eighth Amendment issue, as will appear. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nBefore trial appellants sought leave to introduce evidence to establish that because of their addiction they were not criminally responsible, under common law principles, for possession of narcotics. They made a proffer of evidence and proposed jury instructions in support of their request which was denied by a pretrial order entered on May 18, 1971. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e At trial the court again denied appellants' motions to introduce evidence to establish an affirmative defense based on heroin addiction.\n\nAppellant Gorham was found guilty of possession of heroin \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e and possession of implements of crime (narcotics paraphernalia) \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e while appellant Williams was found guilty only of the latter crime. They contend it was error to deny the motions wherein they sought to establish an affirmative defense of lack of common law criminal responsibility due to heroin addiction.\n\nII. THE RECORD\n\nAppellant Gorham was arrested on August 4, 1970. that morning her room was entered and searched by Metropolitan Police Department officers pursuant to a search warrant. The officers discovered a quantity of white powder containing heroin and various narcotics paraphernalia which contained traces of heroin. On these facts was found guilty with imposition of sentence suspended and probation imposed. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nAppellant Williams was arrested July 16, 1970, when a police officer discovered him seated on the floor in an abandoned house in this city surrounded by various narcotics paraphernalia, all of which contained traces of heroin. On these facts he was found guilty with imposition of sentence suspended and conditions imposed. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nBecause these cases were tried upon stipulated facts appellants' personal histories as to narcotic usage were not developed on the record now before us. However, Judge Belson's comprehensive memorandum opinion and order (appendix A) disposing of appellants' pretrial motion to dismiss sets out these facts concisely at pp. 10-14.\n\nIII. THE PROFFERED DEFENSES\n\nAppellants, unsuccessful in their attempt to prevail on the motion to dismiss, made an extensive proffer of evidence and jury instructions to the trial court. The proffer, boiled down to its essentials, is as follows:\n\nDefendants offer to prove, through their own testimony, the testimony of psychologists and psychiatrists who have interviewed, examined, and diagnosed them, and through the testimony of expert witnesses who have substantial reputations in the field of drug dependence, that each defendant was a heroin dependent person at the time of arrest; that as such each was unable to restrain from further use of injectable heroin; that each had an overpowering desire or need to continue taking the drug and to obtain it by any means either because of the psychic dependence or the physical dependence on the drug, or both; that this dependence took the form of an overpowering and irresistible craving or compulsion to continue taking the drug and to obtain it by any means; that this dependence resulted in such an overwhelming involvement with the use of heroin and the securing of its supply that their need to obtain and use it was the central feature of their lives; and that it resulted in a substantial impairment of their behavior controls and lack of choice or control and directly caused the acts with which they are presently charged.\n\nConcomitantly, appellants proffered that they were \"so far addicted to the use of such habit-forming narcotic drugs as to have lost the power of self-control with reference to addiction,\" D.C. Code 1973, § 24-602, 28 U.S.C. § 2901(a) (1970), and that they were \"drug dependent person(s)\" in that each was using heroin and was in \"a state of psychic or physical dependence, or both, arising from the use of that substance on a continuous basis\" and were under \"a strong compulsion to take the substance on a continuous basis in order to experience its psychic effects or to avoid the discomfort caused by its absence.\" 42 U.S.C. § 201(q) (1970).\n\nAppellants then proffered a series of jury instructions which boil down to an instruction that the jury must acquit the accused unless it is convinced beyond a reasonable doubt that he was not heroin dependent at the time of the offense or that his possession of heroin or narcotics paraphernalia was not a direct product of his heroin dependence. The jury was to be instructed that a person is heroin dependent if, by reason of long and intensive use of heroin, the ability to refrain from using heroin is substantially impaired.\n\nAlthough the proffer is in the language of federal and local statutes relating to drug addiction in a medical sense, appellants' proposed defense is based upon common law doctrines of criminal responsibility which they seek to have extended to provide a defense for the heroin addicted individual who is charged with possession of heroin or possession of implements of crime (narcotics paraphernalia) and whose possession is for personal use only. Simply put, they argue the heroin dependent individual is compelled to commit the crimes of possession of heroin and the narcotics paraphernalia necessary to administer it by reason of addiction.\n\nThe trial court declined to permit appellants to develop the evidence to support their theory of defense when it ruled as a matter of law that their proffered test of criminal responsibility was not in accord with existing precedent because it was not framed in terms of the insanity defense. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e It is from this ruling that this appeal is mainly taken.\n\nThe United States Supreme Court has stated that \" contention that an injury can amount to a crime only when inflicted by intention is no provincial or transient notion. It is as universal and persistent in mature systems of law as a belief in freedom of the human will and a consequent ability and duty of the normal individual to choose between good and evil.\" Morissette v. United States, 342 U.S. 246, 250, 96 L. Ed. 288, 72 S. Ct. 240 (1952) (footnote omitted). In this jurisdiction, as in most others, criminal responsibility is discussed most frequently in the area of insanity. what we are asked to do in this case is to develop a new limited doctrine of criminal responsibility because, according to appellants, its time has come. the process of adjustment of the common law, to fit the times, has traditionally been the province of the states. Powell v. Texas, 392 U.S. 514, 536, 20 L. Ed. 2d 1254, 88 S. Ct. 2145 (1968) (plurality opinion).\n\nWe must determine at the threshold, however, whether congress' treatment of the subject precludes us from establishing a new rule of criminal responsibility in the area of drug addiction, if we were so inclined.\n\nIV. THE LEGISLATIVE SCHEME\n\nUnlike the Judges who were questioned by the House of Lords in M'Naghten's case, \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e we are not confronted with a legislative vacuum in the area of drug abuse as they were in determining whether the insane should be held responsible for their acts. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Congress, as well as most moderately informed persons in this country, has long been aware that heroin is highly addictive and that most heroin users are, or are likely to become, drug addicts. Every recent congressional enactment relating to narcotic drug abuse recognizes the large addict population in this country. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Moreover, by providing for treatment instead of, or in addition to, incarceration in a penal facility, Congress recognized that addicts are subject to criminal penalties.\n\ncongress has been concerned with the problem of narcotic drug abuse since 1909 when it enacted the Jones-Miller Act. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e This was followed by the Harrison Narcotics Act \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e which was enacted in 1914. This legislation had a long and variegated history of enforcement. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e After examining various studies dealing with drug abuse, congress in 1970 responded with the Drug Control Act which reduced, but nonetheless retained, criminal penalties for simple possession of narcotic drugs. this demonstrates to us that Congress knew of, and intended, the prosecution and conviction of all persons, whether or not drug dependent, for the violation of federal narcotic laws.\n\nWhat we see in the current federal legislative scheme is an effort by Congress to provide federal law enforcement agencies with a comprehensive and flexible vehicle for diminution of the drug abuse problem confronting this country. It is most unlikely that congress intended anything less for the District of Columbia, i.e., one standard for the district of Columbia and another to be applied through federal prosecutions here and in the states. Congress recognized, as we all do, that there is no simple solution to drug abuse. It must be attacked by educating the young to its perils; by curtailing the illegal importation of drugs into the country; and by prosecuting those who trade upon misery by trafficking in drugs. Perhaps the last, but nonetheless important, line of offense is enforcement control by the prosecution, but not necessarily the imprisonment, of the nontrafficking addict. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e It is a part of the overall drug enforcement scheme to pursue narcotics into the hands of the users. This is an investigative method and fits into the entire law enforcement effort in relation to narcotics.\n\nCourts are not empowered to supersede the legislative will. As we will show, what we have been asked to do here is to engage in legislative activity, purely and simply. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e This is not the court's function.\n\nThe Federal Statutory Scheme\n\nNARA \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e and the Drug Abuse Office and Treatment Act, \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e recent federal legislation, persuade us that Congress has expressed a preference for a flexible approach for dealing with narcotic addiction both in and out of the federal criminal system. Under NARA certain addicts charged with crime are eligible for commitment for treatment in lieu of prosecution, \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e although the criminal charge is held in abeyance pending the result of treatment. Other addicts are eligible for treatment in lieu of imprisonment if they have been convicted of a federal crime, \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e and addicts not charged with a crime are eligible for civil commitment. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nThe Drug Control Act of 1970 provides, inter alia, for criminal penalties for simple possession of narcotics, \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e enlightened Disposition for first offenders, \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e and imposes heavy penalties for more serious offenses such as unauthorized manufacture or distribution of controlled substances. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Although the Act distinguishes between traffickers and nontraffickers, \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e the distinction relates only to the gravity of the proscribed conduct, not to whether a particular class of offenders can be convicted for their acts.\n\nThe recent Drug Abuse Office and Treatment Act of 1972 \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e establishes an office for coordinating the various federal narcotic programs, provides funding for a national commitment for controlling drug abuse, and demonstrates Congress' concern over the marginal success of existing civil and criminal narcotic rehabilitation efforts.\n\nThese enactments rely on judicial or prosecutorial discretion, or, in the case of the 1972 Drug Abuse Office and Treatment Act, executive discretion, for invoking their provisions. Although emphasizing rehabilitation where possible, they also show beyond dispute that Congress intended drug users, like anyone else, to come under the statute prohibiting narcotics possession. United States v. Moore, supra.\n\nThe Local Statutory Scheme\n\nOur local statutory scheme is not unlike the federal. Possession of heroin is a criminal offense, D.C. Code 1973, § 33-402, and treatment is statutorily available to drug addicts. D.C. Code 1973, § 24-601 et seq. This latter statute, the Narcotic Rehabilitation Act, demonstrates clearly that Congress did not intend treatment to substitute for conviction for possession by addicts of heroin but rather that addicts be given no exemption from conviction:\n\nThe purpose of sections 24-601 to 24-611 is to protect the health and safety of the people of the District of Columbia from the menace of drug addiction and to afford an opportunity to the drug user for rehabilitation. The Congress intends that Federal s shall be enforced against drug users as well as other persons, and [the Act] shall not be used to substitute treatment for punishment in cases of crime committed by drug users. D.C. Code 1973, § 24-601.\n\nPrior to the passage of the Narcotic Rehabilitation Act in 1953, the only available treatment was as part of a criminal sentence. With the passage of the Act addicts not charged with a crime could seek treatment through civil procedures. As Congressman Miller, the author and floor manager of the bill, explained:\n\nThe purpose of the Narcotic Rehabilitation Act was only to provide a civil commitment procedure for drug users. The Act operates independently of the criminal system. \"[The federal] NARA went further and provided for civil commitment even of persons charged with crimes, in the case of crimes deemed related to drug abuse (with certain exceptions),\" United States v. Moore, supra at 407, 486 F.2d at 1171 (Leventhal, J., Concurring), whereas those addicts in the local criminal Justice system are treated at penal institutions or through conditions of probation \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e and parole. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e This statute contemplates full enforcement of the s against habitual drug users as well as other persons.\n\nIn the absence of impelling constitutional considerations it is not our role to supplant the legislative judgment. Congress' avowed intent to prosecute and convict drug users where indicated for all crime necessarily nullifies this court's authority to formulate a new common law rule of criminal responsibility which would insulate those same drug users from criminal punishment, even if we were so inclined which, for reasons that will appear, we are not.\n\nV. EASTER v. DISTRICT OF COLUMBIA\n\nAppellants place considerable reliance upon the decision in Easter v. District of Columbia, 124 U.S.App.D.C. 33, 361 F.2d 50 (1966). This reliance is misplaced. DeWitt Easter was a chronic alcoholic who was arrested, tried and convicted upon a charge of public drunkenness. \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e He asserted three reasons why his conviction could not stand: 1) Congress, by enacting the Alcoholic Rehabilitation Act, had precluded punishing chronic alcoholics for public drunkenness, 2) the common law rules of criminal responsibility precluded a conviction, and 3) the Eighth Amendment prohibition against cruel and unusual punishment barred any punishment from being imposed.\n\nOnly the first view, that Congress did not intend the punishment of chronic alcoholics for public drunkenness, commanded a majority of the court. Easter v. District of Columbia, supra at 43-44, 361 F.2d at 60-61. It is asserted here, however, that the 1947 statute involved in Easter closely resembles the 1953 D.C. Narcotic Rehabilitation Act, discussed (supra) , and that Congress thereby intended to do the same thing for narcotic addicts as the 1947 statute did for alcohol-dependent persons, and that the Easter rationale precludes punishing addicts for possession of heroin.\n\nEaster, however, rested on a finding that Congress had excluded chronic alcoholics from the class of persons who could be criminally convicted for public drunkenness. In the D.C. Narcotics Rehabilitation Act, on the other hand, Congress has required that narcotics laws be enforced against drug users as well as other persons.\n\nThe Circuit Court did not base its decision on any particular provision of the Alcoholic Rehabilitation Act, but rather examined the Act as a whole:\n\nThe full flavor of the enlightened treatment of the subject by Congress, demonstrating its intention that the chronic alcoholic be subjected to civil processes when found intoxicated in public, rather than convicted as a criminal, can be gathered only by perusal in full of the Act of 1947. [ Easter v. District of Columbia, supra at 34 n.2, 361 F.2d at 51 n.2.]\n\nThe two provisions of the Alcoholic Rehabilitation Act which the court focused on were the definition of chronic alcoholic, which is similar to the definition of a drug user in section 24-602(a), and the purpose of the Act:\n\nThe purpose of this chapter is . . . to substitute for jail sentences for drunkenness medical and other scientific methods of treatment which will benefit the individual involved and more fully protect the public. D.C. Code 1961, § 24-501.\n\nIn contrast, the purpose of the Narcotic Rehabilitation Act demonstrates that Congress did not intent treatment to substitute for conviction for possession by addicts of heroin but rather that addicts be given no exemption from conviction:\n\nThe Congress intends that Federal s shall be enforced against drug users as well as other persons, and [the Act] shall not be used to substitute treatment for punishment in cases of crime committed by drug users. \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nMoreover, a provision of the Narcotic Rehabilitation Act, conspicuously absent from the Alcoholic Rehabilitation Act, makes the former inapplicable to any person\n\ncharged with a criminal offense, whether by indictment, information, or otherwise, or if the said person is under sentence for a criminal offense, whether he is serving the sentence, or is on probation or parole, or has been released on bond pending appeal. \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\nThere are valid and rational differences between addiction to heroin and alcohol. The first is obvious: alcohol is legal, although regulated, while heroin is prohibited. The second is more complex and is fairly stated as follows:\n\nAlcohol, some will say, has consequences for many individuals and for society at least as destructive as those of heroin, yet no one would propose returning to a system of prohibition. Alcohol and heroin are different problems, however, both medically and legally. A far smaller proportion of alcohol users than of heroin users become addicted in any meaningful sense of that term; the risks to the average individual of experimentation are accordingly far less in the former than in the latter case. And of those \"addicted\" to alcohol, there have been a larger proportion of \"cures,\" though not as many as one would wish. Finally, alcohol use is so widespread as to be nearly universal, while heroin use remains an exotic habit of relatively few, and thus presents easier problems of control. Perhaps because of this, while no advanced society has been able to eliminate alcohol use, virtually every society but ours has been able to eliminate, or keep to trifling proportions, heroin use. Wilson, Moore \u0026 Wheat, The Problem of Heroin, 29 THE PUBLIC INTEREST 26-27 (1972).\n\nMoreover, Congress, in light of Easter, has made unmistakable its agreement with that decision. As amended in 1968, the statute now reads, in part:\n\npublic officials in the District of Columbia shall take cognizance of the fact that public intoxication shall be handled as a public health problem rather than as a criminal offense, and that a chronic alcoholic is a sick person who needs, is entitled to, and shall be provided appropriate medical, psychiatric, institutional, advisory, and rehabilitative treatment services of the highest caliber for his illness. D. C. Code 1973, § 24-521.]\n\nIt is not permissible to apply the congressional intent underlying one statutory scheme to another, significantly different, statutory scheme. The statutes are mutually exclusive. Both deal with problems of human conduct that have a disabling impact on society in general. Congress, the legislative voice of societal attitudes, has made its judgment clear. Two forms of addiction, medically distinguishable, are to be handled in different ways when they re accompanied by criminal conduct. Once that legislative judgment is apparent, our role ends unless there is unconstitutionality.\n\nVI. THE OVERWHELMING COMPULSION TO POSSESS AND USE HEROIN\n\nThe pivotal fact in appellants' position is that heroin addiction causes or creates in them an \"overwhelming compulsion\" to possess and use heroin. They posit that the \"compulsion\" negates \"free will\" thus removing any meaningful choice, in the legal sense, to refrain from possession or use of narcotics.\n\nEven accepting these propositions as valid, and we do not do so, we have concluded that the affirmative defense urged upon us should not receive the sanction of this court.\n\nAddiction in its Proper Context\n\nIt is important to recognize at the outset that we are dealing here with heroin addiction in the context of crime. Congress has made it a crime to possess heroin, D. C. Code 1973, § 33-402, despite the recognition that narcotic drug users, the primary possessors of heroin, might from a medical viewpoint be addicted. In addition, society and its judicial system is confronted with heroin addiction in the context of other crimes, those against person, property, and community.\n\nDrug addiction is an individual medical characteristic. The degree of an individual's addiction predicts the amount of heroin required to support his or her craving for the drug. But the drug is not free and it is not cheap. Heroin is priced on the market at a level that is set by the available supply, the amount of demand and the ability of a monopolistic market structure to exact as high a price as possible for the commodity. This results, for most addicts, in a daily dollar requirement for heroin that is greater than their income if they have any. Unless the addict can afford it, he turns to the community to support his addiction.\n\nThe community does not support addiction willingly. Two sources of income for the addict are available: 1) directly through street crime, or, 2) by the sale of small amounts of drugs to other addicts. \"It is well known that most addicts support their habits through criminal activities.\" \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e It is dubious, therefore, to view this purely as a \"victimless crime\", if there is such a thing in a profound sense. In the long run the sales from addicts to addicts is self-perpetuating as older addicts service new addicts. Thus the addict who cannot support his habit through legal means contributes to the misery of the community in two distinct ways: through the commission of crimes against person or property or through perpetuation, if not enlargement, of the addict population.\n\nIt is reported through statistical analysis that in New York City a \"10 percent increase in the price of heroin is predicted to lead to a 3.6 percent increase in robberies, a 1.8 percent increase in burglaries, a 2.0 percent increase in larceny under $50, and a 2.5 percent increase in auto theft.\" G. BROWN and L. SILVERMAN, THE RETAIL PRICE OF HEROIN: ESTIMATION AND APPLICATIONS 36 (The Drug Abuse Council, Inc. 1973). \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e Moreover, \"predicted increases in . . . murder [5.3 percent] and aggravated assault [1.5 percent], may be attributed either . . . to increases in violence within the addict population and distribution system as a result of high prices, or to peculiarities in crime-recording. Larger numbers of murders might, in fact, be the result of an increase in robberies, burglaries, and other revenue-raising crimes, some of which lead to murder.\" Id.\n\nAnother researcher estimates that only 3.8 percent of the money used to purchase heroin is raised though legal sources including welfare payments, while shoplifting accounts for 12 percent, burglary for 14.2 percent, pickpocket and con games for 5.2 percent, armed robbery and mugging for 1.8 percent. The bulk of income is derived from providing the community with illegal services: dealing in the drug, 46.5 percent, and prostitution, 16.5 percent. See Moore, Econmics of Heroin Distribution, in 3 POLICY CONCERNING DRUG ABUSE IN NEW YORK STATE 65 (Hudson Inst., 1972).\n\nStill another researcher has noted that since 1937 observers of the criminogenic effects of opioid use have noted \"the necessity to resort to crime in order to support an addiction.\" Tinklenberg, Drugs and Crime, in 1 TECHNICAL PAPERS OF THE SECOND REPORT OF THE NATIONAL COMMISSION ON MARIHUANA AND DRUG ABUSE 242, 262 (1973). He also notes that there are studies indicating that \"when opioid use decreases by treatment or other means, so does criminal behavior.\" Id.\n\nJudicial Intervention\n\nWhat we are asked to do in this case is to change the course of settled principles of criminal responsibility to uncharted seas by validating a limited defense (to personal possession offenses) based upon an addict's overwhelming compulsion to possess heroin. Such a course cannot be lightly taken. As was stated in United States v. Moore, supra at 416, 486 F.2d at 1180:\n\nOnly in limited areas have the courts recognized a defense to criminal responsibility, on the basis that a described condition establishes a psychic incapacity negativing free will in the broader sense. These are areas where the courts have been able to respond to a deep call on elemental Justice, and to discern a demarcation of doctrine that keeps the defense within verifiable bounds that do not tear the fabric of the as an instrument of social control. [Leventhal, J., Concurring.]\n\nAccepting that proposition as a concise statement of when a court should recognize a defense such as that asserted here, we will undertake an examination of whether the premises for such action are met in this case.\n\nElemental Justice\n\nWhen we consider the general concept of Justice we must address the process as a whole insofar as it relates to drug addiction and the personal possession offenses. The basic question would be whether it is fundamentally unfair to deny the defense asserted here. We have discussed the community's interest by placing addiction in its proper context so we turn now to the individual addict.\n\nThe penalties for possession are substantial \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e but our local law has never required the mandatory penalties that caused the federal statues to be carefully reexamined. See United States v. Moore, supra at 402-10, 486 F.2d 1166-74 (Leventhal, J., Concurring). A probational Disposition coupled with a requirement that the defendant seek and remain in a treatment program is available in all cases at the discretion of the trial court and was in fact utilized in these cases under review. See nn. 12 and 13, (supra) .\n\nMoreover, the Superior Court has recently inaugurated a pilot pretrial diversion program for drug abusers called The Narcotics Diversion Project which is available to those charged with possession of narcotics. It operates as follows:\n\nThe services available are extensive:\n\nThe Narcotics Diversion Project enjoys the status of a \"cooperative program\" with the Narcotics Treatment Administration. Thus, multimodality narcotics treatment - methadone maintenance, methadone detoxification or abstinence - is available. Participants will retain the status of clients of NTA while in the Project. However, all counseling, job development and supportive services will be provided by Project staff, who are employees of the Superior Court. Project participants will report to Project counselors, stationed at an existing NTA outpatient facility, several times weekly.\n\nHigh-intensity individual counseling on a small case-load basis is an integral feature of the Project. Group and family counseling, remedial education, job development and placement services, assistance with food stamps, housing and medicare will also be provided. Initial failure to report for counseling sessions or appointments will result in outreach by Project staff to locate delinquent participants, identify the reasons for their absences, and encourage them to return to active participation.\n\nThe Project, during its first year, will be a small carefully monitored pilot program. A staff of a dozen professionals and paraprofessionals, including two full-time job developers and four counselors, will serve an estimated 100-150 participants. Once intake warrants it, the services of skilled volunteers will be actively sought in order to augment the regular Project staff. \u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\n\nWe think this is a promising approach in an attempt to accommodate humanitarian aspects of this problem with the criminal Justice system. Diversion, probation and incarceration are the methods that the community has now chosen in reaction to the crime of heroin possession. At a minimum, criminalization forces the nontrafficking addict who will not seek out treatment into the treatment facilities made available through the criminal Justice system. This is to the good of all concerned. The addict who is able to refrain from heroin usage after he has been processed through this system has benefitted personally as has the community which will no longer have to support his self-destructive habit which carries with it a harmful effect on society.\n\nBecause we have concluded that the existing criminal Justice system as it pertains to the heroin possession offense comports, on balance, with our concepts of elemental Justice, we need not consider the issue of whether the defense asserted here could be kept within verifiable grounds, a factor viewed with skepticism in United states v. Moore, supra at 417-21, 486 F.2d at 1181-85 (Leventhal, J., Concurring). If the Dissent's affirmative defense were judicially recognized the actuality is that to establish addiction one would need only show habitual use accompanied by an assertion of compulsion to use it, a proposition within the control of the defendant and by its nature not likely to be rebutted by evidence available to the government. With this prospect, there would be little point to the arrest or prosecution of known users for possession. Viewing it realistically, this would amount to legalization of possession of the narcotic. what would society through the government be telling the citizenry and especially the young? In the eyes of the young, there would no longer be governmental, that is to say, societal, restriction on possession or use of narcotics.\n\nThe Dissent says that individuals who are most likely to become addicts are not deterred by the punishment of nontrafficking possessors. One might say with just as much significance that individuals who are most apt to rob are not deterred by the robbery statute. Even though criminalizing possession of narcotics has hardly stopped narcotics addiction it would be a worse thing for society, and especially the young society, if the government were to remove even these barriers. It would be undiscerning to think that if this were done it would not be considered by the youth as, in effect, tacit approval. How much worse this would be.\n\nIt is the trend in this jurisdiction to approach the problem humanely and to utilize the criminal Justice system not primarily as a means to punish addicts for possession of the substance but as a method to control its distribution and also locate addicts and bring them into the system where, in many instances, they are shunted into treatment opportunities with the incentive of escaping imprisonment by cooperating, which in turn provides a strong deterrent. We consider that this entire problem requires a pragmatic approach and we are inclined to observe the results of current experience resulting from studies of the recent narcotic epidemic. \u003cspan class=\"fnref\"\u003e44\u003c/span\u003e See Fingarette, Addiction and Criminal Responsibility, 84 Yale L.J. 413 (1975), for a penetrating analysis of the problem.\n\nWe know of no appellate decision that has approved this affirmative defense. Interestingly the National Commission on Marihuana and Drug Abuse recommends that \" primary purpose of enforcement of the possession laws should be the detection and selection of those persons who would benefit by treatment or prevention services.\" \u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\n\nVII. CONCLUSION\n\nWe are dealing with heroin addiction in the context of criminal activity. Had Congress left it available to us to \"legalize\", in effect, the possession of heroin by nontrafficking addicts, which it has not, our doing so might well upset the delicate balance of efforts in this community that has had marked success over the past several years in reducing heroin addiction here. We are of the opinion that the continuation of this city's efforts on heroin addiction through law enforcement and treatment may, in the long run, serve the community well. We would not now upset the balance of this multi-pronged effort even if it were open to the court to do so, which statutorily it is not.\n\nAffirmed.\n\nAPPENDIX A\n\nSUPERIOR COURT OF THE DISTRICT OF\n\nCOLUMBIA - CRIMINAL DIVISION\n\nNos. 28001-70, 29895-70, 42860-70\n\nUNITED STATES OF AMERICA v. CHESTED WILLIAMS, ARNOLD GREGORY SMITH, LAVERNE FLORENCE GORHAM\n\nMEMORANDUM ORDER\n\nThese consolidated cases come before the Court upon the defendants' motions to dismiss the informations. The three defendants are charged with one or more of the following offenses: possession of a narcotic drug, heroin, in violation of the Uniform Narcotic Act, D.C. Code § 33-402 (1967); possession of the implements of crime, to wit, narcotic paraphernalia, in violation of D.C. Code § 22-3601 (1967); and possession of a dangerous drug, desoxyn, in violation of 21 U.S.C. §§ 331(q)(3)(B) and 360a(c)(2).1a The defendants ground their motion to dismiss on the contention that at the times pertinent to these charges they were narcotics addicts who did not traffic in narcotics but who were under a compulsion to possess and use the drugs in question and who, therefore, under the Cruel and Unusual Punishment Clause of the Eighth Amendment of the United States Constitution, cannot be held criminally responsible for their actions. Their motions are denied.\n\nI.\n\nIn attacking the informations by motion to dismiss, the defendants have followed the procedural and substantive suggestions of the United States Court of Appeals for the District of Columbia Circuit set forth in Watson v. United States (No. 21,186, July 15, 1970). Although limiting its holding to the matter of the eligibility of the defendant for sentencing under Title II of the Narcotic Addict Rehabilitation Act of 1966, 18 U.S.C. §§ 4251-55, the United States Court of Appeals in Watson discussed at great length the origins of the defense raised here. In essence, the defendants' contentions are proffered as a necessary corollary to the holding of the United States Supreme Court in Robinson v. California, 370 U.S. 660, 8 L. Ed. 2d 758, 82 S. Ct. 1417 (1962), that the State of California was barred by the Cruel and Unusual Punishment Clause from prosecuting a heroin addict for his \"status\" of addiction. The U.S. Court of Appeals summarized its review of the matter as follows:\n\n\"So it is that, if Robinson's deployment of the Eighth Amendment as a barrier to California's making addiction a crime means anything, it must also mean in all logic that (1) Congress either did not intend to expose the non-trafficking addict possessor to criminal punishment, or (2) its effort to do so is as unavailing constitutionally as that of the California legislature.\" Watson, supra at 19.\n\nThe first meaning ascribed by the U.S. Court of Appeals to Robinson has limited relevance to the case at bar since these defendants are not being prosecuted, as was Watson, for violations of the Harrison Narcotics Act, 26 U.S.C. § 4704(a), or the Jones-Miller Act, 21 U.S.C. § 174. Those statutes do not make mere possession of a narcotic drug a substantive offense. Rather, they are so constructed that proof of the possession of the narcotic drug makes possible the conviction of a defendant for a variety of other prohibited acts, such as selling or dispensing narcotics upon which appropriate taxes have not been paid. In the locally applicable Uniform Narcotic Act, however, the Congress, with knowledge of the existence of the phenomenon of addiction, specifically made it a crime to possess heroin. Accordingly, it is to the second meaning which the U.S. Court of Appeals ascribed to Robinson that the defendants in this Court have directed their arguments.\n\nAgain following the course suggested in Watson, the defendants have made an extensive record embracing the testimony of all three defendants, their counselors at the narcotic treatment programs in which they are presently enrolled, and two psychiatrists. The government countered by adducing the testimony of a psychiatrist and, in response to a request by the Court, arranging for the presence of three court witnesses who testified concerning various aspects of local drug programs.2a\n\nII.\n\nThere was substantial agreement among both the psychiatric and lay witnesses that narcotic addiction has two main components - the physiological dependence and the psychological dependence upon or attraction for the drug. The physiological aspect of addiction is characterized by a strong physical craving for the narcotic drug, the onset of withdrawal symptoms if that craving is not satisfied, and the phenomenon of tolerance, which means that the addict becomes used to a certain level of dosage of a drug and must raise it to a higher level in order to experience the sought-after \"high\" or \"rush,\" a brief feeling of intense pleasure which is obtainable by the intravenous injection of drugs of the opiate family and is obtainable to the highest degree through the use of heroin.\n\nThe second principal component of addiction is the psychological dependence or attraction which the addict has with regard to the drug. The psychological aspect exists part from the physiological and remains with an addict even after he has gone through withdrawal or has been detoxified and is, therefore, no longer physiologically dependent.3a There was substantial agreement that a strong pull of an emotional or psychic nature is exerted upon the addict and that constituents of that pull or attraction are the need for the \"rush\" and also the need for the feeling of euphoria or tranquility which follows the rush. There was also testimony that a third constituent of the psychological dependence was the presence of psychic tensions which existed and demanded amelioration through the use of a drug.\n\nThe witnesses agreed that there is a cross-tolerance between certain drugs. Important to this case is the fact that heroin and methadone are cross-tolerant. As a result, a heroin addict's physiological craving, dependence or need for heroin can be satisfied by the administration of methadone. While the latter can be administered intravenously, it is taken orally by persons in drug abuse programs. When so administered, methadone does not produce a \"high.\" One administration of methadone every 24 hours protects the heroin addict from withdrawal and its severe attendant discomfort, which approximates the symptoms of a severe case of influenza. with dosages of methadone which are gradually diminished over a period of time ranging from 5 to 30 days and thus be detoxified with minimal discomfort. He then is no longer physiologically addicted. Alternatively, an addict can be \"maintained\" on methadone for an extended period or indefinitely and thus never experience withdrawal. The use of methadone in an amount which is sufficient, in view of the addict's prior level of heroin use, will not only avoid withdrawal; but it will also prevent the addict from experiencing a \"rush\" if he should use heroin during the period the methadone does is effective. The practice in maintenance is to increase gradually the dosage of methadone to such a level that it makes the amount of heroin needed by the addict to experience a \"rush\" so great, and accordingly so expensive, that it is beyond the reach of most addicts. This practice is referred to as the administration of a \"blocking\" of \"blockading\" dose.4a\n\nThe parties also stipulated to terminology concerning customary measurements of heroin on the Washington, D.C. market, as set forth in the footnote.5a To the extent that the foregoing facts underlie generally the Conclusions reached by this Court in disposing of these motions, they are to be considered findings of fact.\n\nMr. Louis Dogoloff, Deputy Director of the Narcotic Treatment Administration (hereinafter \"NTA\"), testified that there are approximately 10,400 addicts in the District of Columbia. He stated that as of July 30, 1971 (the time period pertinent to these motions) every such addict had access to methadone through NTA.6a Almost 2,000 persons were actively enrolled in NTA's programs, 80 percent of whom came in voluntarily and the remainder through referral from the court or corrections systems.\n\nNTA was not the only source of methadone available to the heroin addict as of the time of the offenses charged here or as of the time of the hearings. The Blackman's Development Center also operated a highly publicized and intensive campaign against drug abuse through its four centers located in various parts of the city. The chief judicial officer of the Blackman's Center estimated that they had at one time or another enrolled 17,000 addicts in some aspect of their programs as of the time of his testimony, and roughly approximated the Washington area's addict population at 30,000. Over 1,000 were actively enrolled as of the time of his testimony. The Blackman's Center has supplied addicts with methadone in connection with a detoxification regimen and has buttressed that approach with person-to-person motivation which has proven markedly successful in some cases, for example, that of the defendant Smith.\n\nA third source of methadone generally available to addicts in the city, and apparently widely known, has been through prescription by private physicians. In sum, methadone was widely available and its availability well known in the addict community as of the time of the offenses charged against the three defendants in these cases.\n\nApart from the matters of general agreement discussed above, the psychiatrists who testified held widely varying views of important aspects of addiction. The first psychiatrist called by the defense was Dr. Harold Kaufman, a 1957 graduate of Harvard Law School and a 1964 graduate of the Medical School of the University of California at San Francisco. He testified that he does not believe that addiction is a mental illness. Rather, he believes that it is a physical illness which has psychological components. He is also of the belief that a person who is merely psychically dependent on drugs, but not physiologically dependent, may act under a compulsion. Specifically with respect to the defendant Laverne Gorham, he testified that on the basis on her psychic dependency alone she had an \"overwhelming compulsion\" to use heroin on the day of her arrest. He was of that opinion even though (1) she was not then using heroin on a regular basis but was using it intermittently, (2) she was using methadone to block her physiological craving, and (3) she had obtained some degree of control over her actions. He testified that the word \"compulsion,\" as he used it, covers a wide variation \"ranging from inclinations on the one hand, and the inability to resist in the face of death on the other.\" He also testified that an addict who had no other source of drugs other than to obtain money would be compelled to obtain money. He acknowledged that the invoking of the legal process to force an individual to go through with a program to cure his addiction is sometimes beneficial and in the case of some addicts is the only way to achieve that result.\n\nThe second psychiatrist called by the defense was Dr. Leon Wurmser. The Court attaches considerable weight to his testimony. Dr. Wurmser testified that drug addiction is not in itself an emotional disorder or mental illness, but rather that there is in his experience almost invariably an underlying emotional pathology which predisposes one toward addiction. He favored the use of methadone for the following reasons:\n\n(1) It copes with the addict's physical dependence upon heroin.\n\n(2) It deals to a considerable extent with the psychological dependency, substantially eliminating or greatly reducing the craving which one experiences even after physical dependence has been removed.\n\n(3) It eliminates the addict's emotional dependency upon heroin.\n\nDr. Wurmser stressed, however, that the methadone as administered by drug programs cannot give the \"rush.\" He shares the general view that a program which merely administered methadone but did not give more, such as counselling, would not be an effective drug cure program.\n\nEven more explicitly than Dr. Kaufman, Dr. Wurmser stated that one cannot separate the compulsion to take a drug from the compulsion to steal or rob to obtain funds to purchase the drug. He also testified that the legal barrier prevents the existence of an even greater number of heroin addicts and explained that the more illegal the activity in question the more compelling must be the motivation to induce one to transgress the legal barrier.\n\nDr. Wurmser also stated his opinion that an addict can have an overwhelming compulsion to take heroin on the basis of psychic dependency alone, even where he is not physiologically dependent upon the drug. He qualified that opinion by noting the tremendous fluctuations in the amount of compulsion facing each individual. He also stated that if an addict is taking a blocking dose of methadone he will not in most cases have an overwhelming compulsion to take heroin for a high, although some could have such a compulsion even under those circumstances.\n\nDr. Richard Phillipson, a psychiatrist called by the government, stated the opinion that an addict has some freedom of choice with respect to his further use of narcotics and to support his position cited the fact that thousands of addicts have made the requisite decision and have stopped using narcotics. He testified that addicts have a choice unless they are insane, that is, are suffering from a \"disease of the mind\" or a \"defect of reason.\" He testified further that there is no such thing as an \"overwhelming compulsion\" to use narcotics, and he based that statement in part on his conversations with addicts concerning the extent of their ability to stop using narcotics.\n\nDr. Phillipson also stated that the use of methadone not only eliminates the physiological aspects of the addiction, but also takes care of the addict's psychological dependency in a sense, but qualified that \"you can't separate the body from the mind that plainly.\" In his opinion, however, it is very much easier for an addict to resist psychic dependence alone than to resist combined physiological and psychological dependence.\n\nIII.\n\nBefore treating of the legal issues raised here, it is appropriate to describe in more detail the circumstances surrounding the charges against the three defendants. Chester Williams, Jr., is charged with possession of the implements of crime, to wit, narcotic paraphernalia, in violation of D.C. Code § 22-3601 and possession of a dangerous drug, to wit, desoxyn, in violation of 21 U.S.C. §§ 331(a)(3)(B) and 360a(c)(2). Both offenses are alleged to have occurred on July 16, 1970. Mr. Williams is now 35 years of age and has been using heroin since 1965. He has supplemented heroin with desoxyn or \"Bam\" since 1968. His heroin habit had reached the 30 capsule per day level during the two to three months prior to his arrest. He testified that when he was arrested he had just completed preparations for an intravenous administration of heroin and that when he realized he was about to be arrested he disposed of the contents of the syringe. The narcotic paraphernalia were in his possession to facilitate the injection he was about to make, and the desoxyn tablets in his possession were to be used to boost the \"high\" which he sought. He testified also that at the time of his arrest he was already beginning to feel the symptoms of withdrawal because some 5 1/2 hours had elapsed since his last injection of heroin.\n\nMr. Williams testified that he had made various efforts to overcome his heroin habit prior to his arrest. He had placed himself in a two-week detoxification program at St. Elizabeth's Hospital which involved the administration of gradually reduced amounts of methadone. Thereafter he was placed at Lexington, Kentucky for a 60-day period of evaluation, after which he was given a one-year term in prison. Following his release therefrom in July of 1968 he returned to the use of heroin. He had also placed himself in the program of the Blackman's Development Center from June to September of 1969, the first two weeks of which involved another methadone detoxification program and the balance of which consisted of supportive counselling. Following his jail term but prior to his enrollment with the Blackman's Development Center, Mr. Williams had two \"consultations\" with a private physician who prescribed dolophine (methadone) for him. The \"consultations\" cost $10, and a prescription of 21 tablets of dolophine cost an additional $2.75.\n\nMr. Williams stated that while in prison he had no physical craving for heroin, but only a mental or psychological craving for it. Similarly, he acknowledged that while using methadone he had no craving for heroin. He stated that he took heroin to get a high or a feeling of relaxation but takes methadone to achieve \"just a feeling of being normal.\"\n\nMr. Williams testified that he had never engaged in any criminal activity to secure the money he needed to support his heroin habit.\n\nOn July 29, 1970, Arnold Gregory Smith was arrested and charged with unlawful entry and possession of implements of crime, to wit, narcotic paraphernalia, the latter in violation of D. C. Code § 22-3601. His motion to dismiss is directed only to the charge of possession of implements of crime. Mr. Smith, who is now 22 years of age, first began to use heroin in March of 1966. His habit grew rapidly, as is evidenced by his testimony that he has on occasion used as much as two spoons or 30-50 capsules in a single injection. As of July 1970 his average consumption was 1 1/2 spoons per day, administered in the course of three or four injections. He testified that he would ordinarily begin to feel \"bad\" some four hours after an administration of heroin and that his discomfort would become severe after eight or nine hours. He tried unsuccessfully to break his habit in the Spring of 1970. His attempt consisted of two days of participation in the methadone program at D. C. General Hospital, after which he returned directly to the use of heroin. Following his arrest on the offenses involved here, he was released to the Blackman's Development Center and as a part of their program took methadone for one day. For the following two weeks he returned to the use of heroin and took no methadone. Then, resolving to break the habit, he took progressively smaller doses of methadone for four to five days under the auspices of the Blackman's Development Center. Since then, he testified, he has used neither heroin nor methadone.\n\nMr. Smith testified that curing one's self of addiction is a matter of making up your mind that you are bigger than the drug. It is \"the idea of wanting to be a man.\" He freely admitted that before he broke the habit he supported it by robbing and stealing.\n\n\"Q. Why did you do those things?\n\n\"A. Because I needed the money.\n\n\"Q. Did you feel compelled to do them, did you have any choice?\n\n\"A. No, sir, not really.\"\n\n\"Q. Was your compulsion to rob to get the money any different from your compulsion to shoot up itself?\n\n\"A. No.\"\n\nLaverne Gorham is charged with possession of heroin in violation of D.C. Code § 33-402 and possession of the implements of crime, to wit, narcotic paraphernalia, in violation of D.C. Code § 22-3601. Both offenses are alleged to have occurred on August 4, 1970. Miss Gorham is 26 years old and has been injecting heroin since the age of 19. Her habit had grown from a mere 1 1/2 pills or capsules to four spoons per day. She administered the four spoons, which amounts to 60-100 capsules, over the course of four injections per day and, except to the extent of her substitution of methadone as described below, had remained at that level for more than one year prior to her arrest.\n\nShe testified that she now has no urge to take heroin and has been on a methadone maintenance program of increasing dosage for some five or six months.\n\nMiss Gorham had enrolled in the methadone maintenance program at D.C. General Hospital prior to her arrest and was taking what was supposed to have been a \"blocking\" or \"blockading\" dosage of methadone. Although she testified that as of the time of her arrest she acquired no high from heroin because of the amount of methadone she was taking and was using little or no heroin as of that time for that reason, she explained that the methadone was not totally satisfying and she still used heroin at times to keep from felling bad. She finally indicated that at the time of her arrest she was not getting a high. She further clarified that since the time of her arrest her methadone dosage has been increased even further and that it has now taken away the craving for heroin. She had 81 heroin pills on her person when arrested. She first indicated that she had those for the purpose of selling them but later indicated that they were for her own use. The clear import of her testimony as a whole was that she had at times engaged in the sale of heroin for a profit, although that profit appears to have been utilized mainly to support her own heroin habit.\n\nIV.\n\nWe turn now to the legal issue whether Congress is forbidden by the Cruel and Unusual Punishment Clause of Eighth Amendment from imposing criminal penalties on the nontrafficking addict's possession and use of heroin under the circumstances presented by the cases before the Court. In Robinson, supra, the Supreme Court stated unequivocally that the state can impose criminal sanctions upon the unauthorized possession of narcotics. It made it clear that the California statute in question ran afoul of the Eighth Amendment because California was attempting to punish the addict merely for his \"Status\" of being an addict and entirely apart from his having performed any specific criminal act.\n\n\"The broad power of a State to regulate the narcotic drugs traffic within its borders is not here in issue. More than forty years ago, in Minnesota ex rel. Whipple v. Martinson, 256 U.S. 41, 65 L. Ed. 819, 41 S. Ct. 425, this Court explicitly recognized the validity of that power: 'There can be no question of the authority of the State in the exercise of its police power to regulate the administration, sale, prescription and use of dangerous and habit-forming drugs . . . . The right to exercise this power is so manifest in the interest of the public health and welfare, that it is unnecessary to enter upon a Discussion of it beyond saying that it is too firmly established to be successfully called in question.' 256 US at 45.\" d. at 664.\n\nIn the somewhat analogous area of chronic alcoholism, the U.S. Court of Appeals for the District of Columbia Circuit held in 1966 that chronic alcoholism is an illness and that a chronic alcoholic cannot be punished for being drunk in public. Easter v. District of Columbia, 124 U.S.App.D.C. 33, 361 F.2d 50 (1966). The Court of Appeals based its holding alternatively (1) on the Eighth Amendment and (2) on the congressional intent evinced in the Rehabilitation of Alcoholics Act of 1947, D.C. Code §§ 24-501, et seq. (1961), which authorized the courts of the District of Columbia to \"take judicial notice of the fact that a chronic alcoholic is a sick person and in need of proper medical, institutional, advisory and rehabilitative treatment. . . .\" The Eighth Amendment grounds for Easter were placed in substantial doubt by the Supreme Court opinion in Powell v. Texas, 392 U.S. 514, 20 L. Ed. 2d 1254, 88 S. Ct. 2145 (1968), discussed below, with the result that the Easter holding remains the law of the District of Columbia, with certainty at least, only because of the alternative legislative basis for the holding.\n\nPowell affords the Supreme Court's most recent Discussion of the problems involved in the case at bar. There an almost evenly divided Court upheld a Texas statute which made public drunkenness a crime. Mr. Justice Marshall announced the judgment of the Court and delivered an opinion which was concurred in by Chief Justice Warren and Associate Justice Black and Harlan. Mr. Justice Marshall stated:\n\n\"The entire thrust of Robinson's interpretation of the Cruel and Unusual Punishment Clause is that criminal penalties may be inflicted only if the accused has committed some act, has engaged in some behavior, which society has an interest in preventing, or perhaps in historical common law terms, has committed some actus reus. It thus does not deal with the question of whether certain conduct cannot constitutionally be punished because it is, in some sense, 'involuntary' or 'occasioned by a compulsion.'\" Id. at 533.\n\nAfter discussing such factors as the lack of adequate facilities for the public treatment of inebriates, the absence of any coherent approach to the problem of the treatment of alcoholics, the desirability of removing the helpless and sometimes dangerous inebriate from the streets to a place where he can sober up, and the limitations upon a period of incarceration which accompany the use of criminal as opposed to \"civil commitment\" proceedings, Mr. Justice Marshall concluded:\n\n\" is difficult to say in the present context that the criminal process is utterly lacking in social value. This Court has never held that anything in the Constitution requires that penal sanctions be designed solely to achieve therapeutic or rehabilitative effects . . . .\" Id. at 530.7a\n\nRecognizing that an extension of Robinson beyond \"status\" to embrace \"compelled\" acts would involve the creation of a new constitutional doctrine of criminal responsibility, Mr. Justice Marshall asked what the scope and content of that doctrine would be. The question of where to draw the line if the compulsion of addiction provided of itself the basis for a defense is shown by the testimony on these motions to be extremely troublesome. Defendant Smith stated that his compulsion to rob to finance his habit was no different than his compulsion to shoot heroin. Psychiatrists Dr. Wurmser and Dr. Kaufman testified to the same effect.\n\nThe Dissenting Justices in Powell suggested that the defense be available to exempt only conduct which is \"a characteristic and involuntary part of the pattern of the disease as it afflicts\" the person in question. Powell, supra, Dissent at 559. The defense in these motions suggests that the proper policy might be to permit the defense of compulsion by reason of addiction as to crimes against property but not as to crimes against persons.\n\nOn the basis of the record before this Court it is clear that the same logic which would extend Robinson beyond the status of addiction to acts of possession, purchase and use by a nontrafficking addict would extend it still further to other criminal acts, such as theft, burglary and robbery, committed by typically impecunious addicts. As Mr. Justice Marshall stated, any curtailment of that logic would be \"limitation by fiat.\" Id. at 534.\n\nThe ultimate question for this Court is not whether, if it were sitting in the capacity of a legislature, it would direct the use of civil commitment instead of criminal prosecution for the nontrafficking heroin addict as is proposed by the defendants or would prefer to make civil commitment an alternative to prosecution, as was proposed by the Report of the President's Commission on Crime in the District of Columbia, Chapter 7, § IV at 577-85 (1966). Rather, the question is whether under the Constitution Congress has the power to make criminal proceedings the primary means of proceeding against persons in this jurisdiction who possess or administer heroin, even if they are addicts not engaged in heroin traffic. Stated otherwise, it is whether the use of the criminal process for that purpose is precluded because it is cruel and unusual or because its use is without social value.\n\nIn answering the question, as last stated, in the negative, the Court considers several values inherent in the use of the criminal process which must be weighed in determining whether such legislation is valid. Its use discourages trafficking in narcotics by making criminal the very act of serving as the final repository for the commodity. It is probable that heroin traffic would be aided if the courts were to remove the pressure of the from the final step of the series of transactions which brings heroin from foreign sources to our community's addict-consumers. If the courts legalize possession by the nontrafficking addict, we must logically legalize his purchase of the heroin, his administration of heroin to himself, presumably in public or in private, and sales between nontrafficking addicts which are not for profit but merely for convenience or mutual support. The legislature has the function of weighing the value of keeping all of the foregoing acts illegal so that the pressure of the will continue to bear against them and, through them, against the entire heroin trade.8a\n\nA second value of the use of the criminal process is that individuals are discouraged from becoming addicts by the very facts that to possess or administer heroin is illegal. The testimony of defendant Williams and Dr. Wurmser makes it clear that the threat of criminal sanctions not only inhibits the use of heroin but also saves some persons from addiction.\n\nIt is clear, thirdly, that the use of the criminal process provides the occasion for a potent and beneficial intervention in the life of the addict. The three defendants before the Court in these cases are mute testimony themselves to that value since all three, following their arrest on the pending charges, were successfully enrolled in drug abuse programs. Persons on probations from offenses such as charged here are frequently required to participate in drug abuse programs; and their participation may, in the case of some individuals, be strongly encouraged by the direct threat of a jail term which would ensue if they should fail to make reasonable efforts to cooperate with the program.\n\nFourthly, there is the undoubted value of getting the addict off the street, a consideration referred to in the analogous context of alcoholism by Mr. Justice Black in his Concurring opinion in Powell, supra at 539, and of even greater importance in the context of an addiction which leads persons to steal and rob.\n\nObviously, the legislative assessment of such values as the foregoing should be entitled to great weight in considering a challenge of the type made by the defense here. The fact that Congress has made mere possession a crime in the District of Columbia might itself be regarded as expressing the legislature's assessment of those values which inhere in the use of the criminal process. It is worthy of note, however, that in the recently enacted Controlled Substances Act9a Congress, after a thorough study of the nation's drug problem, which included consideration of the recommendations of the Prettyman and Katzenbach Commissions, concluded that \"simple possession\" of heroin and certain other substances should be prosecuted as a misdemeanor and provided special sentencing alternatives for first offenders.10a\n\nTurning to another facet of the cruel and unusual punishment issue, it seems apparent that the permissibility of a statutory scheme which permits criminal prosecution for mere possession must be examined also in the light of the criminal penalties imposable. Importantly, there is no mandatory minimum sentence which must be imposed on one charged with possession of heroin in this jurisdiction. Further, addicts charged only with possession may qualify for treatment under the Narcotic Addict Rehabilitation Act.11a In this respect the instant cases are distinguishable from Watson, the author of which acknowledged with respect to the use of that statute:\n\n\"Although the act cannot be a final solvent of some of the claims not irrationally rooted in Robinson, it is true that, as amicus says in its brief, 'the problem in this case would in large measure be obviated if appellant could be treated under the Narcotic Addict Rehabilitation Act, from which he is excluded as a twice previously convicted offender.'\" Watson, supra at 29, fn. 15.\n\nA Judge of this Court may sentence one convicted of possession of heroin to a period of probation with a condition of cooperation in a drug abuse program. On the other hand, the Judge may in his discretion impose a term of confinement where he deems such to be appropriate, e.g., in the case of a nontrafficking addict who had previously failed to make reasonable efforts to cooperate in such a program as a part of a sentence or as a term of pretrial release. Watson, therefore, is distinguishable in that the statutes in question there are not directed at possession, per se, and in that the scheme of penalties imposable under those statutes is substantially different from those imposable for the crimes charged here.\n\nThe availability of methadone to the defendants is an important part of the overall context in which these defendants come before the Court. They had available in methadone a means of avoiding withdrawal and neutralizing the physiological aspect of their addiction. Any compulsion to use illegal heroin was limited to a purely psychological dependence, the product in large measure of remembered pleasures. Mr. Justice Marshall's opinion in Powell stated:\n\n\"It is one thing to say that if a man is deprived of alcohol his hands will begin to shake, he will suffer agonizing pains and ultimately he will have hallucinations; it is quite another to say that a man has a 'compulsion' to take a drink, but that he also retains a certain amount of 'free will' with which to resist. It is simply impossible, in the present state of our knowledge, to ascribe a useful meaning to the latter statement. This definitional confusion reflects, of course, not merely the undeveloped state of the psychiatric art but also the conceptual difficulties inevitably attendant upon the importation of scientific and medical models into a legal system generally predicated upon a different set of assumptions.\" Powell, supra at 526\n\nIt is concluded, then, that entirely apart from the matter of limiting the prohibition of Robinson to criminal charges based on status, the absence of true physiological compulsion dictates that these defendants' motions be denied.\n\nV.\n\nA humane concern for the plight of the victim of the heroin trade should not impel this Court to adopt novel judicial concepts which in the long run would ill serve both the general public and those individuals who will be exposed to the blandishments of the heroin pusher. The concept of compulsion advanced by the defendants, whether applied through the Eighth Amendment or through an alteration of the test of criminal responsibility,12a will, if accepted, lead by inexorable logic to the excusing not only of narcotic possession but also of \"compelled\" theft, burglary, robbery, and even felony murder.\n\nThe legal issues presented by these motions should not be confused or distorted by the desirability of well-funded, carefully conceived, diversified programs to assist drug abusers. Those goals should be sought through legislation and ought not to be accomplished by altering sound judicial concepts.\n\nFINDINGS OF FACT\n\n(1) It is found that on the day of his arrest for the instant charges defendant Williams was a nontrafficking heroin addict. It is further found that he was aware that methadone was available for the purpose of satisfying his physiological craving for heroin through the program at D.C. General Hospital, from a private physician at a relatively nominal cost, or possibly through a reapplication to the Blackman's Development Center. There is not evidence of record which would support a finding that this defendant was addicted to desoxyn. At most the record would support a finding that he craved the enhanced \"high\" that desoxyn afforded.\n\n(2) It is found that defendant Smith was a nontrafficking heroin addict at the time of his arrest. It is also found that he was aware that methadone was available for the purpose of satisfying his physiological craving for heroin and that he also knew how to obtain it.\n\n(3) It is found that defendant Gorham was a heroin addict at the time of her arrest. Unless the term trafficking includes sales made to support one's own habit (as opposed to more extensive sales which would return, apart from her own habit, a net profit to the addict), she is found on the present record to be a nontrafficking addict. It is further found that as of the time of her arrest she was not only aware of the availability of methadone, which could be used effectively to satisfy her physiological need for heroin, but that she was also being supplied at no expense to herself with a substantial amount of methadone daily, which had the effect of eliminating her physical need for heroin in whole or in substantial part and the further effect of reducing her psychological need for heroin.\n\n(4) Each defendant was at the time of arrest physiologically dependent upon heroin or a cross-tolerant drug such as methadone.\n\n(5) Each defendant was at the time of arrest psychically dependent upon heroin, but that dependency was subject to reduction through the use of methadone.\n\n(6) Each defendant was at the time of arrest suffering from a substantial diminution of his ability to abstain from a further dose of heroin or of a cross-tolerant drug.\n\n(7) The defendants were not at the time of their arrests entirely without control or power of decision with respect to whether to abstain from the use of heroin, irrespective of the availability of methadone.\n\n(8) In the case of each defendant, the use of the available methadone would not only have substantially or fully satisfied his physiological dependence, but would have also reduced his psychological dependence upon heroin.\n\n(9) The remaining constituents of the psychological attraction present in each of the defendants has not been shown to be appreciably different from attractions toward other types of remembered past pleasures which are commonly experienced by human beings. The psychological attraction was, of itself, substantially less than the combined physiological and psychological attraction which is faced by the addict who does not have available to him the use of a cross-tolerant drug such as methadone and which in the cases before the Court was in fact faced by the defendants Smith and Williams only because, as of the time of their arrests, they chose not to take advantage of the availability of methadone.\n\n(10) While each of the defendants had experienced a substantial diminution of his power to abstain from the use of narcotic drugs, at the time of arrest each defendant was substantially free to choose between the use of heroin and the use of a cross-tolerant drug such as methadone.\n\nConclusionS OF LAW\n\n(1) The Uniform Narcotics Act and the Dangerous Drug Act do not punish the defendants for their status as addicts, trafficking or nontrafficking, but rather for specific criminal acts and, accordingly, are not unconstitutional as violative of the Eighth Amendment's proscription against cruel or unusual punishments. The use of the statute prohibiting the possession of implements of crime to punish the addict for his possession of narcotic paraphernalia survives the same challenge.\n\n(2) Assuming that a nontrafficking addict is exempt from punishment for the possession of heroin or the implements of its use if his possession thereof is found to be compelled by his addiction, the three defendants before the Court are not so exempt because they had a knowing, effective, free choice between using illegally obtained heroin and legally obtainable cross-tolerant methadone to satisfy their physiological need for a narcotic drug and to avoid the symptoms of withdrawal but chose the illegal heroin. Viewed apart from physiological compulsion, and itself subject to relief in part by the use of methadone, the psychological aspect of addiction does not give rise to a compulsion which can serve as a basis for exempting the defendants from the criminal statutes under which they are prosecuted. To punish them under these circumstances is not violative of the Cruel and Unusual Punishment Clause.\n\nNo other grounds justifying dismissal having been advanced by defendants, their motions to dismiss are denied.\n\n/s/ James A. Belson\n\nJAMES A. BELSON, JUDGE\n\nMarch 4, 1971\n\nAPPENDIX B SUPERIOR COURT OF THE DISTRICT OF COLUMBIA CRIMINAL DIVISION\n\nNos. 28001-70 29895-70 42860-70\n\nUNITED STATES OF AMERICA v. CHESTER WILLIAMS ARNOLD GREGORY SMITH LAVERNE FLORENCE GORHAM\n\nPRETRIAL ORDER\n\nThese cases have come before the Court for two pretrial hearings upon the request of the defendants that they be informed in advance of trial whether they will be permitted to place before the trier of fact a defense of non-responsibility based upon narcotic addiction which does not rest in any part upon a showing that they have an abnormal condition of the mind.1b They propose what is described in Watson v. United States2b as a \"new defense of involuntariness for addicts not equatable to the traditional insanity defense.\"\n\nFor the purpose of placing the matter before the Court prior to trial, defendants filed a proffer of evidence and a wide range of suggested jury instructions, all of which were carefully constructed so as to avoid any reference to the adducing of evidence of a mental or emotional disease or defect, heretofore a threshold requirement for the creation of an issue of non-responsibility pursuant to the Durham-McDonald line of cases.3b\n\nCounsel for defendants have briefed and argued the matter diligently, and their development of the argument that their request is justified as a new but logical application of the concept of mens rea cannot lightly be rejected. At the same time, however, it is apparent that there are weighty considerations which countervail defendants' request and which suggest that the novel and sweeping approach defendants espouse ought not be adopted by this trial court.\n\nIf the Court were to eliminate the requirement of a predicate of emotional or mental disease or defect, a serious problem would arise with respect to the Disposition to be made of defendants if they should be found not guilty on that basis. In several instances appellate Judges in this jurisdiction have suggested by way of dictum that courts faced with a defense of the type raised here might use procedures analogous to those employed in connection with the traditional insanity defense.4b It is at best doubtful, however, that it would be appropriate to commit one to a mental institution unless he has been acquitted by reason of mental illness. It is equally unclear that following such commitment the so-called Bolton5b hearing as to eligibility for release would involve the application of criteria appropriate to such person. The result might well be that persons seriously in need of treatment would receive none.\n\nA most troubling aspect of the proposed new test of criminal responsibility is the extent to which the proffered defense would be available to defendants charged not with mere possession of narcotics but with theft, burglary, robbery or indeed any drug-related offense, including murder.6b Once the availability of such a defense were established by the courts on the basis suggested by defendants, there would be no logical means of curtailing its application to relatively minor offenses of the type now before this Court.\n\nThe only readily apparent means of attaining the objectives here sought for nontrafficking addicts without incurring a heavy risk of extending a defense to all crimes committed by addicts would appear to be through action by the legislature. That branch, if it saw fit, could undertake by statute to limit the availability of the defense to cases involving mere possession or charges of similar gravity committed by persons who were not trafficking in narcotics, could prescribe post-trial commitment and the criteria for release therefrom, and could determine and provide for the type of facilities made necessary by such a policy. The legislative branch can give special treatment to narcotic offenses committed by nontrafficking users without sacrificing the application of well-established legal principles to more serious offenses. In fact, the Congress has recently accorded mere users such special treatment, including the opportunity to serve probation without verdict and, in certain cases, expungement of arrest records.7b\n\nUnder all the circumstances this Court declines to apply in these cases the new test of criminal responsibility proposed by defendants but instead will adhere to existing precedents. The defendants may undertake to establish that they are not responsible by reason of insanity pursuant to the test developed in the Durham-McDonald line of cases. They will be required to make a threshold showing in order to raise the issue8b and they will, pursuant to recent enactment9b , be required to establish that defense by the preponderance of the evidence.\n\nOnce they have properly raised the issue10b , they will be permitted to adduce evidence concerning the physiological11b as well as the psychological components of addiction.12b Should that defense succeed, they will be committed pursuant to statute13a but will be accorded by this Court a prompt hearing for the purpose of determining their suitability for conditional or unconditional release.\n\n/s/ James A. Belson/JAMES A. BELSON, JUDGE\n\nMay 18, 1971\n\ncc: Counsel\n\nNEBEKER, Associate Judge, Concurring: I concur in this result and almost all of its underlying rationale. Our judgment is necessarily a pragmatic one. We should not delude ourselves that present or past treatment efforts to solve our drug problem have proven sufficiently effective to form a basis for allowing addiction as a legal defense. (Majority opinion at 28.)\n\nWe have looked to legislation and concluded it has preempted the field. We have distinguished appellants' most forceful precedents and have reviewed the social and physical consequences of heroin. In my judgment we have also, by implication at least, recognized the logic of the unaffordable proposition that addiction can substantially impair capacity to control behavior respecting drug-related conduct.\n\nIt is noted that the Narcotics Diversion Project (NDP) treats threshold offenders. The well-entrenched offender, who feeds his habit, in part, by recruiting new users or threshold offenders to buy from him, remains a problem. There is no known expectedly successful way to protect the community from these people except imprisonment. Until a better means can be developed it would be the height of folly to experiment with society by adopting a rule of exoneration which would leave drug users where they assuredly would continue to destroy the parts of civilized existence which they contact.\n\nTherefore, with or without programs like NDP, and legal paradox notwithstanding, we must retain a law enforcement apparatus whereby addicts as well as traffickers who commit crime must be removed from society. This truth is recognized virtually world-wide in responsible law enforcement. We should not do otherwise.\n\nFICKLING, Associate Judge, with whom KERN, Associate Judge, joins, Dissenting: In my opinion the question squarely presented by these cases is whether the court below erred in refusing to accept appellants' proffered test of criminal liability. Appellants contend that this court should recognize an affirmative defense based upon drug dependence to two crimes only, i.e., illegal possession of heroin, D.C. Code 1973, § 33-402(a), and possession of implements of crime (narcotic paraphernalia), D.C. Code 1973, § 22-3601 (hereinafter, PIC). Rather than considering appellants' contention in the light of the long established fundamental principle of of the doctrine of mens rea, the majority opinion ignores this principle and rejects appellants' contention on the basis of doctrines not supported by the law.\n\nI will first present when I believe to be an accurate description of the common law doctrine of mens rea and its relation to the judicial process, and then to demonstrate why the majority opinion is not supported by the pertinent legal doctrines.\n\nI. The Development of Mens Rea \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nAs early as the twelfth century, the emphasis of in England had begun to shift from criminal liability based solely upon the doing of a prohibited act to crime as a compound consisting of the objective physical act - the actus reus (\"evil act\") - and a subjective mental element. Legal scholars of the era reasoned that every act was the result of interaction between a human being's mind and body. The mind \"willed\" the act and the body performed the act. This reasoning together with the pervasive influence of canon law, with its insistence upon moral guilt as a condition precedent to punishment, led to the establishment of a morally blameworthy state of mind as an essential element of crime. A slightly modified Latin maxim began to be used as a convenient label for this new idea of a connection between crime and a mental element leading to moral blameworthiness. That maxim was \" actus non facit reum, nisi mens sit rea\" (\"an act does not make [the doer of it] guilty, unless the mind be guilty\"). The maxim was quickly shortened to simply \"mens rea.\"\n\nBy the time of Coke, \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e the requirement of a guilty state of mind - at least for serious crimes - was well established, and by the eighteenth century the idea of a mental element of crime was so firmly rooted that Blackstone flatly stated that for there to be a crime there must first be a \"vicious will.\" \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nA concomitant to the development of the doctrine of mens rea was the development of various excuses from criminal liability. Because punishment was premised upon a free actor willfully and knowingly choosing to do evil rather than good, it was considered wrong to punish someone for doing an evil act if he did not do so knowingly and willfully. Moreover, even as theories of criminal liability evolved from pure retribution for the doing of moral wrongs to the utilitarian grounds of deterrence of the offender and of the general public, isolation, reformation, and reinforcement of general community norms, excuses continued to be recognized. The rationales for excuses under these utilitarian theories paralleled their justifications. For example, just as the retributivist would excuse persons who were not morally blameworthy, the utilitarian, believing that punishment can be justified only when, on balance, it would be useful, \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e would excuse persons who are beyond being deterred and whose punishment would neither deter others nor reinforce community norms.\n\nConsequently, Blackstone \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e and Bentham \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e presented a similar list of situations in which punishment is not justified because the mental element necessary for criminal liability is not present. These lists included excuses based upon \"a defect of understanding\" including infancy, insanity, and involuntary intoxication; defenses of \"misfortune and chance\"; defenses of compulsion, duress, and \"inevitable necessity.\"\n\nThe United States Supreme Court traced the development of the concept of mens rea and its concomitant excuses in American law in the following statement:\n\nThe contention that an injury can amount to a crime only when inflicted by intention is no provincial or transient notion. It is as universal and persistent in mature systems of law as belief in freedom of the human will and a consequent ability and duty of the normal individual to choose between good and evil. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e A relation between some mental element and punishment for a harmful act . . . has afforded the rational basis for a tardy and unfinished substitution of deterrence and reformation in place of retaliation and vengeance as the motivation for public prosecution. . . .\n\nCrime, as a compound concept, generally constituted only from concurrence of an evil-meaning mind with an evil-doing hand, was congenial to an intense individualism and took deep and early root in American soil. As the states codified the common law of crimes, even if their enactments were silent on the subject, their courts assumed that the omission did not signify disapproval of the principle but merely recognized that intent was so inherent in the idea of the offense that it required no statutory affirmation. Courts, with little hesitation or division, found an implication of the requirement as to offenses that were taken over from the common law. The unanimity with which they have adhered to the central thought that wrongdoing must be conscious to be criminal is emphasized by the variety, disparity and confusion of their definitions of the requisite but elusive mental element. However, courts of various jurisdictions, and for the purposes of different offenses, have devised working formulae, if not scientific ones, for the instruction of juries around such terms as \"felonious intent,\" \"criminal intent,\" \"malice aforethought,\" \"guilty knowledge,\" \"fraudulent intent,\" \"wilfulness,\" \" scienter,\" to denote guilty knowledge, or \" mens rea,\" to signify an evil purpose or mental culpability. By use or combination of these various tokens, they have sought to protect those who were not blameworthy in mind from conviction of infamous common-law crimes. [ Morissette v. United States, 342 U.S. 246, 250-52, 96 L. Ed. 288, 72 S. Ct. 240 and n.4 (1952).\n\nAmong the excuses from criminal liability which have been accepted by American courts are mental disease or defect, \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e infancy, \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e compulsion (duress), \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e coercion, \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e epilepsy, \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e kleptomania, \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e delirium tremens, \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e the effect of medication, \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e sleepwalking, \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e and, most recently, alcohol dependence. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nthis review of the historical development of mens rea leads to certain well documented Conclusions. First:\n\nseems clear that mens rea, the mental factor necessary to prove criminality, has no fixed continuing meaning. The conception of mens rea has varied with the changing underlying conceptions and objectives of criminal Justice. [Sayre, Mens Rea, 45 HARV.L.REV. 974, 1016 (1932).]\n\nSecondly:\n\nprinciple [ mens rea ] is derived entirely from case law. Although there was a considerable body of statutory at the time when these authors wrote [Coke, Hale, Blackstone, etc.], it is nowhere suggested by them, nor has it ever been suggested to my knowledge, that the principle is dependent on the direction of the legislative body. Indeed, much of the case law has evolved by way of implied exceptions (that is, implied by the Judges) to apparently express and precise statutory commands. [P. BRETT, AN INQUIRY INTO CRIMINAL GUILT 40 (1963).]\n\nFinally, the changing conceptions of mens rea have often been closely related to advances in medical science which increased the courts' understanding of human conduct and relationships. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nII. Appellants' Contention\n\nHaving briefly traced the development of the doctrine of mens rea, I turn to appellants' contention.\n\nAppellants contend that because a fundamental postulate of common law jurisprudence is that criminal punishment may be imposed only upon a defendant who, at the time of the act charged, possessed the free will to refrain from committing the act, this court should hold that:\n\ndefendant charged with nontrafficking possession of heroin and the implements of its administration raise as an affirmative defense that, because of long-standing dependence on the use of injectable heroin, he cannot be held criminally responsible for the acts with which he was charged. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nThe majority opinion rejects this contention for the following reasons:\n\n(1) \"Courts are not empowered to supersede the legislative will. . . . we have been asked to do here is to engage in legislative activity, purely and simply.\" \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\n(2) The contention of appellants, if accepted, would cut deeply into the government's anti-crime enforcement efforts. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\n(3) Elemental Justice does not require recognition of the affirmative defense. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\n(4) \"The process of adjustment of the common law, to fit the times, has traditionally been the province of the states.\" \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\n(5) The majority agrees with the decision in United States v. Moore, 158 U.S.App.D.C. 375, 486 F.2d 1139, cert. denied, 414 U.S. 980, 38 L. Ed. 2d 224, 94 S. Ct. 298 (1973), particularly Judge Leventhal's Concurring opinion. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nIII. Congressional Preemption and Judicial \"Legislation\"\n\nIt is hornbook law that a statute is presumed to be consistent with the common law, and such a presumption is rebuttable only by an affirmative expression of legislative will to alter the common law. Morissette v. United States, supra; Easter v. District of Columbia, 124 U.S.App.D.C. 33, 43, 361 F.2d 50, 60 (1966) (en banc); 2A SUTHERLAND, STATUTORY CONSTRUCTION § 50.05 (4th ed.C. Sands ed. 1973).\n\nThis court has held that the two statutes at issue in this case, D.C. Code 1973, §§ 33-402(a) and 22-3601, are not \"strict liability\" \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e type statutes which require only the commission of forbidden acts or omissions. Rosser v. United States, D.C.App., 313 A.2d 876, 879 (1974); McKoy v. United States, D.C.App., 263 A.2d 649, 651 (1970); see United States v. Weaver, 148 U.S.App.D.C. 3, 458 F.2d 825 (1972).\n\nIn fact, this court recently suggested that trial courts use the following jury instruction for simple possession of narcotics, Carver v. United States, D.C.App., 312 A.2d 773, 775 n.5 (1973):\n\nYou may find that the defendant knowingly and intentionally possessed the [narcotic drug] if he did so consciously, voluntarily and purposely, and not because of mistake, inadvertence or accident. [D.C. Bar Association, Young Lawyer's Section, Criminal Jury Instructions for the District of Columbia, Instruction 4.31 at 116 (2d ed. 1972)\n\nGiven the facts that there is no affirmative prohibition in the pertinent legislation of the suggested drug dependence defense (a point which the government conceded in the Moore case \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e and conceded in its original brief \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e in these cases), and that this court has read the existing common law defenses into the statutes, one might reasonably ask where the majority opinion finds the clear expression of legislative intent to prohibit the affirmative defense of drug dependence. The answer is: in other statutes and in a misconception of the roles of the legislature and the courts.\n\nA. Statutory Construction\n\nAfter tracing the evolution of various federal narcotics statutes, which, of course, are not at issue in these cases, the majority concludes that it is \"beyond dispute that Congress intended drug users, like anyone else, to come under the statute prohibiting narcotics possession\" \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e because there are criminal penalties for simple possession of narcotic drugs.\n\nThere are three principal flaws in this reasoning. First, the Controlled Substances Act is not at issue in these cases and, whatever the intent behind it, it is not dispositive of the District of Columbia legislation. If this were not obvious under rules of statutory construction, it is obvious in light of the fact that attempts in 92d \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e, and 93d \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Congresses to pass a \"District of Columbia Controlled Substances Act\" similar to the federal statute were unsuccessful.\n\nSecond, assuming arguendo that the federal statutes are relevant to appellants' contention, a congressional intent to deny an affirmative defense based upon drug dependence is not evident in these statutes. The House report on the 1970 Act states that the Act combines both the punitive and rehabilitative approaches to the problem of drug dependence, and quotes with approval the following statement from the Report of the President's Advisory Commission on Narcotic and Drug Abuse (Prettyman Commission) discussing the underlying philosophy involved in this dual approach as opposed to the two rejected extreme attitudes - the punitive and the permissive.\n\nThis commission does not accept either of these extreme attitudes, but it subscribes to certain aspects of each. Rehabilitation is the humanitarian ideal, to be sought wherever possible. But rehabilitation is not simple. It requires the skills of many disciplines and the efforts of many agencies. The drug abuser who steals or who sells drugs to finance his habit is guilty of a crime. Like any other citizen, he should face the consequences. Whether he can be held criminally responsible can only be decided in the courts, case by case. The Commission cannot assert a general rule that every confirmed drug abuser is so impelled by his habit that he is not accountable for his acts under . \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nOn the next page of the House Report, the following statement of the Prettyman Commission is quoted.\n\nDrug users who violate the law by small purchases or sales should be made to recognize what society demands of them. In these instances, penalties should be applied according to the principles of our present code of Justice. When the penalties involve imprisonment, however, the rehabilitation of the individual, rather than retributive punishment, should be the major objective. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nThus, it is clear that Congress intended to follow the Prettyman Commission's dual approach philosophy and that it had no intention of intervening in the normal application of common law principles by the courts in individual cases.\n\nThe government argued in its brief, \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e and the majority implicitly accepts the argument, that the words \"any person\" in 21 U.S.C. § 844(a) (1970) \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e are affirmative evidence of a congressional intent to prohibit recognition of a drug dependence affirmative defense.\n\nThe speciousness of this argument is easily discernible. If such a literal interpretation of the words \"any person\" is adopted, then Congress intended that all persons - infants, insane, epileptic, unknowing, compelled, etc. - be punished for possession.\n\nIt is surely significant that the various excuses recognized by the have been made by the Judges without help from the legislature. Legislatures perform the task of considering conduct at large and passing judgment on it; they make broad general statements, such as \"no one must kill\" or \"no one must steal\". It has never been thought necessary for them to spell out in detail the qualifications of these statements for individual cases. For example, they say, \"no one must kill\", but they do not need to say, \"a person may of course kill to save his own life or his child's, or if he is the public hangman.\" Of course, they may, on occasion, spell out qualifications of their general statements; but they do not feel themselves bound to do so. They expect the courts, in the application of these commands to individual cases, to formulate the qualifications in the light of the case at bar. And the courts have acted accordingly. [P. BRETT, AN INQUIRY INTO CRIMINAL GUILT, (supra) at 72.]\n\nThe third flaw in the majority's reasoning on the congressional preemption issue involves interpretation of the D.C. Narcotic Rehabilitation Act of 1953, D.C. Code 1973, $S24-601 et seq. The majority reads the preamble to the statute \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e as supplying the affirmative evidence of congressional intent necessary to rebut the presumption that the statute is consistent with the common law. That contention is simply incorrect. The words used by Congress are \"shall be enforced,\" and the only reasonable interpretation of those words, in my view, is that Congress intended that individuals suspected of violating federal s be arrested and prosecuted. However, arrest and prosecution are not synonymous with conviction. It is submitted that what Congress intended was that \"drug users\" be made to go through the criminal Justice system when accused of crime rather than automatically being diverted into the rehabilitation scheme. This interpretation is borne out by a section of the same statute that provides that the procedures in the statute shall not be used for those persons \"charged with a criminal offense . . . or . . . under sentence for a criminal offense.\" \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e This may be evidence of a congressional intent not to \"legalize\" possession of narcotics or other crimes, however, it is in no way inconsistent with appellants' contention that at trial they be permitted to raise an affirmative defense to the charges of possession and PIC. If a defendant fails to raise such an affirmative defense or does raise the defense and is unsuccessful in his assertion of it, then in accordance with the statute he may be convicted and sentenced to a penal institution rather than placed in a hospital. On the other hand, an individual may be convicted of possession or PIC only upon proof of all elements of the crime, including - as per the jury instruction approved by this court \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e - that he possessed the drug \"voluntarily.\"\n\nIn addition, I reject the majority's interpretation of the 1953 Act because the government does not strictly adhere to the majority's interpretation that the federal s be enforced against drug dependent persons.\n\nminor drug cases [ i.e., non-traffickers] the United States Attorney often agrees to drop the prosecution if the addict consents to civil commitment. [PRESIDENT'S COMMISSION ON CRIME IN THE DISTRICT OF COLUMBIA, FINAL REPORT 571 (1967). ] \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nB. Judicial \"Legislation\"\n\nThere being no affirmative evidence of a congressional intent to prohibit an affirmative defense of drug dependence, I turn to the majority's concomitant argument that for this court to recognize a new common law mens rea defense based upon drug dependence would be \"legislative activity.\" The majority opinion implies that such \"legislative activity\" would be improper. That implication demonstrates an erroneous view of the nature of the judicial process. The following analysis by Mr. Justice Cardozo of the proper nature of the judicial process had long been considered the proper formulation:\n\nMy analysis of the judicial process comes then to this, and little more: logic, and history, and custom, and utility, and the accepted standards of right conduct, are the forces which singly or in combination shape the progress of the law. Which of these forces shall dominate in any case must depend largely upon the comparative importance or value of the social interests that will be thereby promoted or impaired. One of the most fundamental social interests is that law shall be uniform and impartial. There must be nothing in its action that savors of prejudice or favor or even arbitrary whim or fitfulness. Therefore in the main there shall be adherence to precedent.\n\nUniformity ceases to be a good when it becomes uniformity of oppression. The social interest served by symmetry or certainty must then be balanced against the social interest served by equity and fairness or other elements of social welfare. These may enjoin upon the Judge the duty of drawing the line at another angle, of staking the path along new courses, of marking a new point of departure from which others who come after him will set out upon their journey.\n\nIf you ask how he is to know when one interest outweighs another, I can only answer that he must get his knowledge just as the legislator gets it, from experience and study and reflection; in brief, from life itself. Here, indeed, is the point of contact between the legislator's work and his. The choice of methods, the appraisement of values, must in the end be guided by like considerations for the one as for the other. Each indeed is legislating within the limits of his competence. No doubt the limits for the Judge are narrower. He legislates only between gaps. He fills the open spaces in the law. [B. CARDOZO, THE NATURE OF THE JUDICIAL PROCESS 112-13 (1921) (Yale paperback ed.)\n\nForty years earlier Oliver Wendell Holmes wrote that:\n\nsubstance the growth of the law is legislative. And this in a deeper sense than that what the courts declare to have always been the law is in fact new. It is legislative in its grounds. [O. HOLMES, THE COMMON LAW 31 (1881) (N. HOWE paperback ed.).]\n\nThese quotations and my earlier Discussion of the development of the doctrine of mens rea demonstrate, in my opinion, that the constant reexamination and readjustment of the concept of mens rea and its application to specific cases is one of the basic duties of a Judge. This process involves judicial \"legislation\" and such \"legislation\" has long been one of the keystones of our legal system. Therefore, the majority's condemnation of the recognition of a new mens rea defense on the ground of judicial \"legislation\" involves a fundamental misconception of the nature of the judicial process.\n\nIV. The Drug Dependence Defense and Anti-Crime Law Enforcement\n\nThe strongest theme that continually reappears in the majority opinion is that to recognize a mens rea defense based upon drug dependence would \"cut deeply into the law enforcement effort.\" \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e We are never told how or why law enforcement efforts would be hampered although there is much space devoted to addiction-related crime.\n\nEven though the premise that drug dependence is one of the significant root causes of crime is not without challenge, Marshall v. United States, 414 U.S. 417, 426, 38 L. Ed. 2d 618, 94 S. Ct. 700 (1974), appellants have not contended that crime and drug dependence are unrelated.\n\nThe majority chooses to imply that the recognition of an affirmative defense of drug dependence presents the danger of \"legalizing\" possession of heroin. Appellants have not asked that possession of heroin be legalized, and the original panel decision in the companion case of Franklin v. United States, D.C.App. (No. 5960, Feb. 27, 1973, vacated), contained several statements such as, \" wish to emphasize that we are not legalizing the possession of narcotic drugs.\" Id. at 42. Nevertheless, I shall endeavor to set out below an analysis of why the recognition of an affirmative defense based upon drug dependence would not hamper law enforcement efforts.\n\nOf the various legally accepted purposes of punishment for violation of a - (1) deterrence of the offender and/or others; (2) isolation of the offender from society; (3) reformation or rehabilitation of the offender; and (4) retribution for the commission of a morally blameworthy act - the purposes of deterrence and isolation are most closely related to general law enforcement.\n\nA. Deterrence: Drug Dependent Persons\n\nWill non-recognition of a drug dependence mens rea defense deter drug dependent persons or others from the commission of crime? In the case of persons who are already drug dependent, the overwhelming majority of experts agree that the threat of criminal punishment has no deterrent value. The Prettyman Commission stated that:\n\nThe Bureau of Narcotics maintains that the present severe penalties act as a powerful deterrent. The commission does not agree. As the Commission pointed out in its introduction, it is difficult to believe that a narcotic addict who is physically and psychologically dependent on a drug will forego satisfaction of his craving for fear of a long prison sentence. . . . The weakness of the deterrence position is proved every day by the fact that the illicit traffic in narcotics and marijuana continues. \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nAll available statistics show an increase of epidemic proportions in the use of abusable drugs during the last twenty years despite vigorous prosecution of addicts. \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e The explanation of these statistics is concisely stated in the report of the ABA's Special Committee on Crime Prevention and Control:\n\nThe demand [for heroin] is created not by economic considerations but by an insatiable physiological craving of the addicts, who must obtain large and frequent doses of heroin to maintain a semblance of physical normality. As a result, the addicts' incessant efforts to obtain heroin are undeterred by the threat of harsh punishment for illegal drug possession or by the black markets exorbitant prices. \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\n\nBy relying almost exclusively on law enforcement and penal sanctions, the government has ignored the medical realities of addiction and the economic realities of the black market. The evidence is that the addict's overwhelming desire to consume heroin cannot be discouraged by prolonged jailing, involuntary abstinence or the drug's exorbitant cost in the city streets. Denying addicts a legal narcotics source without substituting an effective treatment program simply drives them into the black market, where the pushers are solely interested in selling as much heroin as possible at the highest obtainable price. \u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nDeterrence: Non-Drug Dependent Persons\n\nIf those who are already drug dependent will not be deterred from continued drug dependence or dependence-related crimes by nonapproval of the affirmative defense of drug dependence, the only other plausible deterrence argument is that other persons will be deterred from using narcotics at all or from becoming drug dependent once they begin using drugs. The facts do not support this latter deterrence argument. Experts agree that where are two recruitment patterns for new addicts. One, which accounts for a small number of addicts, is a person who was given narcotics for medical and therapeutic purposes and who became addicted as a result of this medication. \u003cspan class=\"fnref\"\u003e43\u003c/span\u003e The second and most common recruitment pattern is socioeconomic. The addict population is \"overwhelmingly black, young, poor, and concentrated in the big city ghetto areas.\" \u003cspan class=\"fnref\"\u003e44\u003c/span\u003e Dr. Jerome Jaffe, former President Nixon's Special Advisor on Drug Abuse, has written that \" would be difficult to overestimate the effects of social organization on the incidence of drug abuse.\" \u003cspan class=\"fnref\"\u003e45\u003c/span\u003e A combination of factors including culture, occupation, fashion, childhood environment, and psychopathology that antedates drug use, etc., combine to lead an individual to begin using drugs. Most addicts come from depressing environments where drug use is acceptable, drugs are available, and future prospects are pessimistic. They often try drugs out of curiosity, frustration, or boredom, and quickly become dependent. \u003cspan class=\"fnref\"\u003e46\u003c/span\u003e Because of these factors, individuals who are most likely to become addicts are not deterred by the punishment of nontrafficking possessors because that punishment does not remove the causes of the new user's interest in and desire to experiment with drugs. Moreover, the stigma of a criminal conviction is meaningless to these individuals in their environment. A recent survey of addicts in Washington, D.C., revealed that 52 percent of the addicts began heroin use after 1965, and 65 percent after 1963, i.e., a period of strong anti-drug laws, mandatory sentences, etc. \u003cspan class=\"fnref\"\u003e47\u003c/span\u003e Those drug users who do not use heroin, i.e., college students who use barbiturates and hallucinogens, do so not because of criminal sanctions which exist for the drugs that they do use, but because they fear heroin's physically debilitating effects. In short, \" is the despair that follows in the wake of social decay and poverty that triggers the addiction-crime cycle.\" \u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\nMoreover, so long as lengthy civil commitment of addicts is sustained by courts \u003cspan class=\"fnref\"\u003e49\u003c/span\u003e and permitted under statutes, \u003cspan class=\"fnref\"\u003e50\u003c/span\u003e \"the prospect of extended civil confinement would probably deter most persons from becoming addicts as effectively as would criminal sanctions.\" \u003cspan class=\"fnref\"\u003e51\u003c/span\u003e\n\nA final point in connection with this aspect of the deterrence argument is to keep in mind the distinction between deterrence based upon the existence of a criminal statute and deterrence based upon recognizing an excuse from liability under that statute. Despite the majority's contentions to the contrary, we are concerned here with the latter and not the former. In this connection, it is interesting to note that the Second Report of the National Commission on Marihuana and Drug Abuse recommended the retention of s prohibiting possession of illegal drugs \u003cspan class=\"fnref\"\u003e52\u003c/span\u003e and simultaneously stated that: \"The primary purpose of enforcement of the possession laws should be the detection and selection of those persons who would benefit by treatment or prevention services.\" \u003cspan class=\"fnref\"\u003e53\u003c/span\u003e\n\nB. Isolation of the Offender\n\nWhile incarceration in prison does isolate the offender from society, incarceration in a rehabilitation facility, often located in the same prison, equally isolates the offender from the public. It is doubtful that the prospect of isolation by civil commitment would lead to the commission of more crimes than the prospect of incarceration in a penal facility.\n\nC. Reformation and Rehabilitation\n\nIncarceration in a penal facility neither reforms nor rehabilitates a drug dependent person beyond the immediate termination of drug use.\n\nThe only method used today in this country to deal with hard-core addicts is to incarcerate them after criminal conviction. That technique temporarily renders the addict harmless to society, for he can commit no new crimes while in prison. However, imprisonment only interrupts - and does not end-the addict's addiction. More than 90 percent of such addicts return to addiction and street crime upon release from prison. \u003cspan class=\"fnref\"\u003e54\u003c/span\u003e\n\nIn addition, imprisonment may be harmful since withdrawal without medical attention, a traumatic experience both psychologically and physiologically, may result in lasting damage to the personality of the addict. \u003cspan class=\"fnref\"\u003e55\u003c/span\u003e\n\nD. Retribution\n\nRetributive theory, unlike utilitarian theory, does not depend on punishment serving any socially useful purpose. Punishment is imposed because the actor is morally blameworthy, and if the actor is not blameworthy, he must be excused from criminal liability. An act is considered blameworthy only if it is the product of a \"free\" will, and the will of one who is the victim of a disease, compulsion, or other defect, is no longer free. If the act is the product of an overpowering compulsion, the actor is not morally blameworthy and therefore should not be punished.\n\nSuch a denial [that criminal liability is based on blameworthiness] would shock the moral sense of any civilized community; or to put it another way, a law which punished conduct which would not be blameworthy in the average member of the community would be too severe for that community to bear. [O. HOLMES, THE COMMON LAW, (supra) at 42.]\n\nFifty years ago, the Supreme Court recognized that addicts are sick persons and are \"proper subjects for . . . treatment.\" Linder v. United States, 268 U.S. 5, 18, 69 L. Ed. 819, 45 S. Ct. 446 (1925). All of our subsequent advances in medical knowledge confirm that diagnosis. Robinson v. California, 370 U.S. 660, 667, 8 L. Ed. 2d 758, 82 S. Ct. 1417 (1962). My review of the development of the common law has demonstrated that the fundamental requirement of all criminal liability is that the act of the accused must be a voluntary expression of his will. We are concerned with a \"guilty mind,\" \"vicious will,\" \"evil mind,\" etc. Thus, as Professor H.L.A. Hart has explained, mens rea is really a catalogue of excusing conditions relating to individual cases. Society, or more particularly its Judges, have said that the individual will not be subject to punishment and loss of dignity or stigmatization through the unless he violates the law for reasons which were in his power to prevent, i.e., the fundamental moral principle that \"persons should not be punished if they could not have done otherwise, i.e., had neither the capacity nor a fair opportunity to act otherwise.\" \u003cspan class=\"fnref\"\u003e56\u003c/span\u003e Since several means of treatment are available for the addict's illness, conformity with this fundamental moral principle, not to mention concepts of fundamental fairness in due process of law, \u003cspan class=\"fnref\"\u003e57\u003c/span\u003e dictates that we seek treatment rather than punishment for nontrafficking addict possessors.\n\nE. Preventing Illegal Drug Traffic\n\nOf course a can also be justified on the ground that it protects the public from some harm. Thus, the existence of s prohibiting possession or sale of illegal drugs can be said to protect the general public against drug trafficking. In fact, the sponsor of the Controlled Substances Act, 21 U.S.C. § 801 et seq. (1970), stated that the principal purpose of the bill was to stop drug traffic by concentrating law enforcement efforts on importers, manufacturers, and distributors, rather than on users. \u003cspan class=\"fnref\"\u003e58\u003c/span\u003e\n\nThe majority ignores two exhibits attached to Appellants' Supplemental Reply Brief on Rehearing which pertain to the effect of the recognition of a drug dependence defense on law enforcement efforts. Exhibit \"A\" is a letter from the Mayor's Advisory Committee on Narcotics Addiction, whose members include the Chief of Police, which states that the Committee supports the recognition of a drug dependence defense for nontrafficking addicts and adds:\n\nThe Committee believes further, that the recognition of the defense, coupled with effective, intelligent and meaningful use of the civil commitment statute for drug dependents could substantially improve the city's response to the problems of addiction by offering a meaningful treatment alternative to bare incarceration.\n\nExhibit \"B\" is a letter from the Deputy General Counsel of the Metropolitan Police Department stating that the police department has no objection to the\n\nAppellants' Supplemental Reply Brief on Rehearing refers to this letter and notes:\n\nThe Police Department acceptance of the defense is conditioned on a \"virtually mandatory\" civil commitment program. Appellants have urged throughout this case that such a virtually mandatory program can and should be used upon acquittal, by implementing the 1953 Act.\n\nEven assuming that criminal penalties imposed for possession of illegal drugs assist the effort to stop the flow of illegal drugs by giving the police a bargaining their source of supply, \u003cspan class=\"fnref\"\u003e59\u003c/span\u003e this benefit to society does not justify penal incarceration rather than treatment of the drug dependent person, and the benefit in no way affects the free will or lack thereof of the drug dependent person. Moreover, the threat of civil commitment for treatment may well be as effective a lever as the threat of penal incarceration.\n\nIn sum, there is no plausible explanation for the majority opinion's unsupported assertion that approval of the affirmative defense of drug dependence would hinder law enforcement efforts.\n\nV. Elemental Justice\n\nThe majority also contends that elemental Justice does not necessitate recognition of a drug dependence defense because local laws penalizing unlawful possession of narcotics do not provide for mandatory sentences, and because the Superior Court has a partially successful pilot pretrial diversion program for drug dependent persons. The government not only made a similar contention in its Briefs, but added a specific objection to the validity of references to due process of law made in the majority opinion in the panel decision in Franklin v. United States, supra. \u003cspan class=\"fnref\"\u003e60\u003c/span\u003e Although I realize that appellants have not raised a claim specifically based upon the constitutional guarantee of due process of law and that this decision is therefore not dispositive of such a claim, I cannot let these contentions pass unchallenged.\n\nIf an individual is arrested for homicide, is medically examined, and is found to have been insane at the time he committed the homicide, the majority's reasoning leads to the Conclusion that to convict that individual of murder and to sentence him to prison would not violate principles of elemental Justice because there is no local mandatory penalty for murder and because medical treatment is available before trial for some of those found to be insane. The only difference between the insane individual and the drug dependent person is that the former has the benefit of a recognized affirmative defense and the latter does not.\n\nI can think of few ideas which are \"so rooted in the traditions and in the conscience of our people as to be ranked as fundamental,\" Snyder v. Massachusetts, 291 U.S. 97, 105, 78 L. Ed. 674, 54 S. Ct. 330 (1934); which embrace \"common and fundamental ideas of fairness and right,\" Betts v. Brady, 316 U.S. 455, 473, 86 L. Ed. 1595, 62 S. Ct. 1252 (1942); or whose denial \"shocks the conscience,\" Rochin v. California, 342 U.S. 165, 172, 96 L. Ed. 183, 72 S. Ct. 205 (1952), as the idea that a person should not be punished if he did not have a fair opportunity to refrain from doing what he did. As Professor Hart has cogently noted, refusal to recognize this idea sometimes \"represents an obstinate refusal to recognize that human beings may not be able to control their conduct though they know what they are doing.\" \u003cspan class=\"fnref\"\u003e61\u003c/span\u003e\n\nVI. The Process of Adjusting the Common Law\n\nThe majority opinion citing Powell v. Texas, 392 U.S. 514, 536, 20 L. Ed. 2d 1254, 88 S. Ct. 2145 (1968), states that \" process of adjustment of the common law, to fit the times, has traditionally been the province of the states.\" The precise intent behind this statement is unclear, however, it appears to imply that \"states,\" rather than this court, should recognize new excuses under common law doctrines. Such an implication is, of course, specious. At the cited page in the Powell opinion, Mr. Justice Marshall is discussing why the United States Supreme Court has not articulated a general constitutional doctrine of mens rea. He points out that the doctrines of actus reus, mens rea, and various excuses, have continually evolved and that if the Supreme Court defined them in constitutional terms, fruitful experimentation in various jurisdictions and the concomitant productive dialogue between law and psychiatry would be halted and forced into a rigid constitutional mold. A careful reading of the Powell opinion makes it clear that there was an intent to encourage, not discourage, experimentation with the common law concept of criminal liability by local courts and by local legislatures rather than merely by legislatures acting alone.\n\nVII. United States v. Moore\n\nThe majority opinion specifically states that its authors agree \u003cspan class=\"fnref\"\u003e62\u003c/span\u003e with the decision of the United States Court of Appeals for the District of Columbia Circuit in United States v. Moore, 158 U.S.App.D.C. 375, 486 F.2d 1139, cert. denied, 414 U.S. 980, 38 L. Ed. 2d 224, 94 S. Ct. 298 (1973).\n\nRather than repeat each argument made in that 121-page decision, I shall merely state that I agree with the views expressed by Judge Wright and his fellow Dissenters. Moreover, it is important to note that the present vitality of the 5-4 Moore decision is extremely suspect. Of the five Judges who voted to affirm the conviction for possession, only three did so on the ground that the proffered drug dependence defense was invalid. \u003cspan class=\"fnref\"\u003e63\u003c/span\u003e The other two Judges who voted to affirm the conviction, Judges McGowan and Leventhal, \u003cspan class=\"fnref\"\u003e64\u003c/span\u003e did not reach the issue of the validity of the proffered defense because they believed that Congress had decided that treatment for drug dependence was to be handled as a matter of Disposition under the Narcotic Addict Rehabilitation Act of 1966 (NARA). subsequently the United States Supreme Court held that NARA's exclusion from treatment of those persons with two prior felony convictions \u003cspan class=\"fnref\"\u003e65\u003c/span\u003e is constitutional. \u003cspan class=\"fnref\"\u003e66\u003c/span\u003e Because a large number of drug dependent persons have two prior convictions and would thus be excluded from treatment, \u003cspan class=\"fnref\"\u003e67\u003c/span\u003e it may be now that the two Judges who voted against recognizing the drug dependence defense, on the ground that treatment under NARA was available, would not vote the same way if the issue were presented to them again.\n\nVIII. Drug Dependence, Free Will and Mens Rea\n\nThe majority opinion accurately notes that \" pivotal fact in appellants' position is that heroin addiction causes or creates in them an 'overwhelming compulsion' to possess and use heroin. They posit that the 'compulsion' negates 'free will' thus removing any meaningful choice, in the legal sense, to refrain from possession or use of narcotics.\" Then without any explanation or reference to supporting material, the majority baldly states that it does not agree with appellants' position. \u003cspan class=\"fnref\"\u003e68\u003c/span\u003e\n\nAlthough the precise etiology of drug dependence (addiction), an interaction of complex psychological, physiological, and sociological components, is not yet known, virtually all experts \u003cspan class=\"fnref\"\u003e69\u003c/span\u003e accept the World Health Organization's (WHO) definition of \"drug dependence\" as authoritative. That definition is:\n\n\" Drug dependence\" : A state, psychic and sometimes also physical, resulting from the interaction between a living organism and a drug, characterized by behavioral and other responses that always include a compulsion to take the drug on a continuous or periodic basis in order to experience its psychic effects, and sometimes to avoid the discomfort of its absence. Tolerance may or may not be present. A person may be dependent on more than one drug. [WORLD HEALTH ORGANIZATION EXPERT COMMITTEE ON DRUG DEPENDENCE, NINETEENTH REPORT, WHO TECH. REP. SER. No. 526, at 16 (1973).]\n\nThe WHO definition of \"dependence-producing drug\" includes both heroin and alcohol. \u003cspan class=\"fnref\"\u003e70\u003c/span\u003e Drug dependence of the \"opiate type,\" which includes heroin and morphine, is ranked as the most intensive form of drug dependence \u003cspan class=\"fnref\"\u003e71\u003c/span\u003e and is described as\n\na state arising from repeated administration of morphine, or an agent with morphine-like effects, on a periodic or continuous basis. Its characteristics include:\n\n(1) an overpowering desire or need to continue taking the drug and to obtain it by any means; the need can be satisfied by the drug taken initially or by another with morphine-like properties;\n\n(2) a tendency to increase the dose owing to the development of tolerance;\n\n(3) a psychic dependence on the effects of the drug related to a subjective and individual appreciation of those effects; and\n\n(4) a physical dependence on the effects of the drug requiring its presence for maintenance of homeostasis and resulting in a definite, characteristic, and self-limited abstinence syndrome when the drug is withdrawn. [WHO TECH. REP. SER. No. 273, at 13 (1964).]\n\nCongress has clearly accepted this definition because it has repeatedly defined an \"addict\" as:\n\nindividual who habitually uses any narcotic drug so as to endanger the public morals, health, safety, or welfare, or who is so far addicted to the use of narcotic drugs as to have lost the power of self-control with reference to his addiction. [21 U.S.C. § 802(1) (1970).] \u003cspan class=\"fnref\"\u003e72\u003c/span\u003e\n\nThe same definition is used for \"drug user\" in the D.C. Narcotic Rehabilitation Statute, D.C. Code 1973, § 24-602(a).\n\nSince Congress and medical experts agree that drug dependence is characterized by \"a strong compulsion\" which reaches the level of loss of \"the power of self-control\" with reference to the individual's drug dependence, the question for us is whether this compulsion is strong enough to negate mens rea as to possession and PIC for the addict's own use. Appellants contend that the compulsion experienced by a narcotic addict is at least as strong as the compulsion felt by other persons in situations where the law now permits an affirmative defense. I agree.\n\nCompulsion was recognized as a defense as early as the fourteenth century. \u003cspan class=\"fnref\"\u003e73\u003c/span\u003e Like the other common law defenses, it was based on the premise that without a free exercise of will, there can be no guilty mind, i.e., if an individual is forced to choose a given course of conduct through a reasonable fear of death or serious bodily harm, he cannot be said to have a blameworthy mind. However, on policy grounds, early common law did not recognize any compulsion, even the threat of death, as a sufficient excuse for the intentional killing of an innocent person. \u003cspan class=\"fnref\"\u003e74\u003c/span\u003e\n\nOver the centuries the law has come to recognize a number of situations where an individual lacks \"free will\" and is therefore not to be held criminally liable for knowingly engaging in prohibited conduct.\n\nThe most recent development in this continual evolutionary process is the recognition of an affirmative defense based upon alcohol dependence. In 1966 the United States Court of Appeals for the Fourth Circuit held:\n\nalthough his misdoing objectively comprises the physical elements of a crime [public intoxication], nevertheless no crime has been perpetrated because the conduct was neither actuated by an evil intent nor accompanied with a consciousness of wrongdoing, indispensable ingredients of a crime. Morissette v. United States, 342 U.S. 246, 250-252, 72 S. Ct. 240, 96 L. Ed. 288 (1952). Nor can his misbehavior be penalized as a transgression of a police regulation - malum prohibitum - necessitating no intent to do what it punishes. The alcoholic's presence in public is not his act, for he did not will it. It may be likened to the movements of an imbecile or a person in a delirium of a fever. None of them by attendance in the forbidden place defy the forbiddance. [ Driver v. Hinnant, 356 F.2d 761, 764 (4th Cir. 1966).]\n\nSee also Fultz v. United States, 365 F.2d 404, 407-08 (6th Cir. 1966); Lewis v. Celebrezze, 359 F.2d 398, 399-400 (4th Cir. 1966); Sweeney v. United States, 353 F.2d 10, 11 (7th Cir. 1965); Weaver v. Finch, 306 F. Supp. 1185, 1194 (W.D.Mo. 1969); state v. Fearon, 283 Minn. 90, 166 N.W.2d 720 (1969).\n\nThe leading case on this point in our jurisdiction is Easter v. District of Columbia, supra at 35, 361 F.2d at 52, where the court stated:\n\nAn essential element of criminal responsibility is the ability to avoid the conduct specified in the definition of the crime. Action within the definition is not enough. To be guilty of the crime a person must engage responsibly in the action. Thus, an insane person who does the act is not guilty of the crime. The law, in such a case based on morals, absolves him of criminal responsibility. So, too, in case of an infant. In case of a chronic alcoholic Congress has dealt with his condition so that in this jurisdiction he too cannot be held to be guilty of the crime of being intoxicated because, as the Act recognizes, he has lost the power of self-control in the use of intoxicating beverages. In his case an essential element of criminality, where personal conduct is involved, is lacking. This element is referred to in the law as the criminal mind. See Carter v. United States, 102 U.S.App.D.C. 227, 235, 252 F.2d 608, 616, where the subject is well discussed. It is there stated in terms of the common-law axiom, \" Actus non facit reum, nisi mens sit rea.\" Coke, Third Institute *6, *107.\n\nThe portion of the quotation above which relates to an Act of Congress recognizing that a chronic alcoholic loses the power of self-control refers to the definition of \"chronic alcoholic\" contained in D.C. Code 1961, § 24-502, which is identical, in relevant part, to the definition of narcotic \"addict\" contained in 21 U.S.C. § 802(1) (1970) and \"drug user\" contained in D.C. Code 1973, § 24-602(a).\n\nThe government argues that because an addict retains \"some control\" over his conduct, he cannot assert a defense based upon drug dependence. This is simply not the law in any recognized defense. The insane, chronically alcoholic, and those subject to external duress, all retain some control over their conduct. A total loss of control would render an individual nothing more than a vegetable. This is why Congress has defined an \"addict\" or \"drug user\" as one:\n\nis so far addicted to the use of narcotic drugs as to have lost the power of self-control with reference to his addiction. [21 U.S.C. § 802(1) (1970); D.C. Code 1973, § 24-602(a).]\n\nThus we are concerned with a loss of control \"with reference to his addiction,\" i.e., the use of narcotics, not a complete loss of all control. \u003cspan class=\"fnref\"\u003e75\u003c/span\u003e\n\nAlthough some addicts may retain the ability to choose methadone maintenance rather than continued use of heroin, \u003cspan class=\"fnref\"\u003e76\u003c/span\u003e they should not be precluded from raising a defense of drug dependence. Sick persons, whether mentally ill, alcohol dependent, epileptic, etc., are not precluded from asserting a defense because they failed to take advantage of available treatment. The relevant inquiry is into the defendant's mental and physical condition at the time of the alleged offense, \u003cspan class=\"fnref\"\u003e77\u003c/span\u003e i.e., the addict's \"power of self-control with reference to his addiction.\"\n\nThere is little doubt that the compulsion felt by a drug addict is at least as strong as that felt by a chronic alcoholic, \u003cspan class=\"fnref\"\u003e78\u003c/span\u003e and that while an addict's behavior controls are not totally destroyed, they are certainly substantially impaired.\n\nIX. Conclusion\n\nFor the foregoing reasons, I find the majority opinion in this case to be erroneous and I, therefore, Dissent from it.\n\nWe Judges should not be dissuaded from our responsibility because the suggested defense of drug dependence does not neatly fit within the four corners of definitions of recognized excuses from criminal liability. It is not enough to say that drug dependence does not fall squarely within the definition of \"insanity,\" \"compulsion,\" or \"duress,\" and therefore it cannot be recognized.\n\nthe genius of the common law has been its responsiveness to changing times, its ability to reflect developing moral and social values. Drawing upon the past, the law must serve - and traditionally has served - the needs of the present. . . . [ United States v. Freeman, 357 F.2d 606, 624-25 (2d Cir. 1966).]\n\n\u003cspan class=\"fn\"\u003e* Retired as of April 14, 1974.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Several other defendants were tried with Gorham and Williams but were acquitted or failed to note an appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. ABA SPECIAL COMMITTEE ON CRIME PREVENTION AND CONTROL, NEW PERSPECTIVES ON URBAN CRIME 25 (1972) [hereinafter cited as NEW PERSPECTIVES ON URBAN CRIME].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Id. at 44.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Id. at 25.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. See United States v. Brawner, 153 U.S.App.D.C. 1, 21, 471 F.2d 969, 989 (1972), where the court points out the limited number of cases involving acquittal by reason of insanity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The order is set out as Appendix A to this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. In any event, this issue has been disposed of by this court in Wheeler v. United States, D.C.App., 276 A.2d 722 (1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The order is set out as Appendix B to this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. D.C. Code 1973, § 33-402.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. D.C. Code 1973, § 22-3601.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The probationary plan required that\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1) she live with her mother,\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2) she attend the Narcotic Treatment Administration Program at D.C. General Hospital on an out-patient basis for one year (including thrice weekly urine surveillance for drug use), and\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3) that she obtain a job as a cook.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The conditions imposed were 1) good behavior, 2) cooperation with the Narcotic Treatment Administration, and 3) cooperation with Vocational Rehabilitation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. E.g., McDonald v. United States, 114 U.S.App.D.C. 120, 312 F.2d 847 (1962); Durham v. United States, 94 U.S.App.D.C 228, 214 F.2d 862 (1954). The Durham-McDonald Rule was modified in United States v. Brawner, supra note 6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. 10 Clark \u0026 F. 200, 8 Eng.Rep. 718 (H.L. 1843).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. See United States v. Moore, supra at 390, 486 F.2d at 1154; id. at 411, 486 f.2d at 1175 (Leventhal, J., Concurring).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. See, e.g., Drug Abuse Office and Treatment Act of 1972, P.L. 92-255, 86 Stat. 65 (1972); Comprehensive Drug Abuse Prevention and control Act of 1970, P.L. 91-513, 84 Stat. 1236 (1970) [hereinafter Drug Control Act]; The Narcotic Addict Rehabilitation Act of 1966, P.L. 89-793, 80 Stat. 1438 (1966) [hereinafter NARA]; PRESIDENT'S COMMISSION ON LAW ENFORCEMENT AND ADMINISTRATION OF JUSTICE, THE CHALLENGE OF CRIME IN A FREE SOCIETY, 211-31 (1967); PRESIDENT'S ADVISORY COMMISSION ON NARCOTIC AND DRUG ABUSE, FINAL REPORT (1963).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. 21 U.S.C. § 844 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Act of Feb. 9, 1909, c. 100, § 2, 35 Stat. 614 (repealed 1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Act of Dec. 17, 1914, c. 1, § 1, 38 Stat. 785 (repealed 1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. See United States v. Moore, supra at 451-65, 486 F.2d at 1215-1229 (wright, J., Dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. This is an inexact term as many addicts sell on a small scale to support their own habit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The Dissent apparently misunderstands this statement and states that our \"condemnation of the recognition of a new mens rea defense on the ground of judicial 'legislation' involves a fundamental misconception of the judicial process.\" What we say is that an appellate court may not supersede the expressed legislative will - always barring, of course, unconstitutionality. Otherwise, we are usurping the function of the legislative branch. We would have considered this proposition to be well nigh indisputable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. 28 U.S.C. § 2901 et seq. (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. See n. 17, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. 28 U.S.C. § 2902 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. 18 U.S.C. § 4251 et seq. (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. 42 U.S.C. § 3411 et seq. (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. 21 U.S.C. § 844 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. 21 U.S.C. § 841, et seq. (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Id. See H.R.REP.No. 1444, 91st Cong., 2d Sess. 11 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. See note 17 (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. D.C. Code 1973, § 16-710.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. D.C. Code 1973, § 24-204.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. D.C. Code 1961, § 25-128.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. D.C. Code 1973, § 24-601.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. D. C. Code 1973, § 24-603(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Lowinson, Langrod \u0026 Alperin, Legal Services in Treating the Addict, 130:05 AM.J. PSYCHIATRY 592 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. In spite of the humanitarian efforts to help addicts in this city, the Washington Post recently reported a \"disturbing\" increase in heroin deaths in the city in recent months because of greater availability of the drug. Washington Post, Mar. 15, 1975, at E-1, col. 5.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. D.C. Code 1973, § 33-708(a) provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAny person violating any provision of this chapter, or of any regulation made by the District of Columbia Council under the authority of this chapter shall upon conviction be punished, for the first offense, by a fine of not less than $100 nor more than $1,000, or by imprisonment for not exceeding one year, or by both such fine and imprisonment; and for any subsequent offense by a fine of not less than $500 nor more than $5,000 or by imprisonment for not exceeding ten years, or by both such fine and imprisonment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. SUPERIOR COURT OF THE DISTRICT OF COLUMBIA, THE NARCOTICS DIVERSION PROJECT (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. Id. We are concerned, however, by the following passage from the July 15, 1974, Quarterly Programmatic Progress Report of the Narcotics Diversion Project of the Superior Court of the District of Columbia:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe problems which developed over the last two quarters - poor cooperation from a sizeable segment of the defense bar, coupled with restrictive Project eligibility criteria - continued to hamper Project intake. Of the 78 defendants who were screened as eligible \"on paper\" this quarter - i.e. who had a nonviolent misdemeanor, and had no prior felony or violent misdemeanor convictions - the Project was unable to schedule 32 of them (41.0 percent) for enrollment conferences due to no other reason but disinterest or downright non-cooperation on the part of defense counsel in those cases. Id. at page 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWe note also that the Superior Court has also indicated concern:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eon the part of counsel to keep scheduled appointments with representatives of the Project and the Office of the U.S. Attorney concerning client enrollment is viewed with special concern by the Court and may be grounds for the removal of appointed counsel from a case. [THE NARCOTICS DIVERSION PROJECT, (supra) n.42].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. In a recent report relating the results of a continuing study of men who had served in Vietnam and had there used narcotics, it is stated:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMost of the men who had been heavy users of narcotics in Vietnam had not used any since their return. The deterrents they cited most frequently were expense, fear of addiction, and fear of arrest. Men highly dependent on narcotics in Vietnam who said they had been detected as users at DEROS because they were too addicted to quit had the highest risk of use and readdiction after return. But half of these men stopped narcotic use entirely on return, and only 14% because readdicted. [THE VIETNAM DRUG USER RETURNS, A STUDY SPONSORED BY THE SPECIAL ACTION OFFICE FOR DRUG ABUSE PREVENTION, X (Sept. 1973).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. [DRUG USE IN AMERICA: PROBLEM IN PERSPECTIVE, SECOND REPORT OF THE NATIONAL COMMISSION ON MARIHUANA AND DRUG ABUSE 273 (March, 1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1a Defendant Smith is also charged with unlawful entry. His motion to dismiss does not go to that charge. Defense counsel also move to dismiss the charges of possession of the implements of crime against all three defendants on the ground that the statute in question was not intended to extend to possession of narcotic paraphernalia. Those motions are denied inasmuch as the D.C. Court of Appeals has repeatedly sanctioned the challenged application of the statute, e.g., McKoy v. United States, 263 A.2d 645, 649 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2a The transcript of the hearings, consisting of 730 pages, was completed on February 3, 1971.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3a One psychiatrist, Dr. Leon Wurmser, testified that there is a belief in certain medical circles that physical characteristics remain after withdrawal and endure for a period of several months. Dr. Wurmser did not share that belief, and there is no testimony before the Court to the effect that physical indicia of addiction survive withdrawal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4a There was also some testimony to the effect that methadone is regarded with some reservations or suspicion by many in the addict community, testimony which the Court regards as substantially negated by the fact that immense numbers of persons are now using methadone.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5a The parties have stipulated that one capsule or cap or pill of heroin consists of 50 milligrams of white powdery substance, approximately three to eight percent of which is, on the Washington, D.C. market, heroin and the rest of which is cutting or diluting material. The retail market price for heroin at most times relevant to these proceedings was $1 per capsule. A \"bag\" of heroin generally consists of the equivalent of ten capsules and accordingly sells for $10. Bags of half that size for $5 have sometimes been available. A \"spoon\" of heroin is approximately two $10 bags and generally is equivalent to 15 to 25 capsules.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6a As of the time of his testimony there was a two-week waiting period for an addict who wished to become enrolled in an NTA methadone and counseling program. However, an addict who applied would be referred to another agency, such as Blackman's Development Center or Bonabond, where he could obtain methadone in a detoxifying dosage pending his acceptance into the program.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7a It is noted that, apart from what the Constitution requires, Congress has recently indicated its intent that rehabilitation rather than retribution should be the major objective of the criminal process with respect to defendants who are not drug traffickers. H.R.Rep. No. 91-1444, 91st Cong., 2d Sess. (1970), to Comprehensive Drug Abuse Prevention and Control Act of 1970, P.L. 91-513, 84 Stat. 1236 (Oct. 27, 1970), as reported in U.S. Code Congressional and Administrative News, 8, 4566\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8a In Title II, § 101(4) of P.L. 91-513, (supra) , Congress made the finding that \"local distribution and possession of controlled substances contribute to swelling the interstate traffic in such substances.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9a Title II, § 404 of P.L. 91-513, (supra) at note 7. The Act was approved on October 27, 1970, and most of its provisions become effective on May 1, 1971.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10a See H.R.Rep. No. 91-1444, (supra) at note 7 .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11a Clearly, the civil commitment procedures of Title III are available to persons in this jurisdiction. The D.C. Court of General Sessions utilized Title II of the Act in cases where the defendant was subject to at least three years confinement, and it appears that Superior Court defendants are eligible for treatment under that title under similar circumstances.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12a On the issue whether addiction per se constitutes a mental illness, see United States v. Collins, No. 22,550 (U.S. Ct.App., D.C.Cir., Aug. 28, 1970); and Heard v. United States, 121 U.S.App.D.C. 37, 348 F.2d 43 (1964). The denial of these motions does not preclude defendants from raising at trial the defense of insanity or lack of criminal responsibility.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1b This request followed the Court's earlier refusal to dismiss the informations on Eighth Amendment grounds. See, in that connection and generally, Wheeler v. United States, D.C.Ct.App. No. 5462 (May 5, 1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2b U.S. Ct.App.,D.C.Cir., No. 21,186 (July 15, 1970), slip opinion at p. 15.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3b McDonald v. United States, 114 U.S.App.D.C. 120, 312 f.2d 847 (1962) (en banc); Durham v. United States, 94 U.S.App.D.C. 228, 214 F.2d 862 (1954).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4b See, e.g., Watson, (supra) , slip opinion at p. 22 (majority opinion) and at p. 35 (opinion of Bazelon, Chief Judge, Concurring in part and Dissenting in part); and, for a suggestion that the civil commitment statute be used following an acquittal of any charge by reason of chronic alcoholism, Salzman v. United States, 131 U.S.App.D.C. 393, 407, 405 F.2d 358 (1968) (opinion of Wright, J., Concurring).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5b Bolton v. Harris, 130 U.S.App.D.C. 1, 395 F.2d 642 (1968).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6b See opinion of Wright, J., Concurring in Salzman v. United States, (supra) at footnote 4, for a development of the argument that a similar approach in cases of chronic alcoholics should be adopted and should serve as the basis for \"denying criminal responsibility for any actions produced by the disease\".\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7b Title II, § 404, Comprehensive Drug Abuse and Control Act of 1970, P.L. 91-513, 84 Stat. 1236 (Oct. 27, 1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8b The fact of addiction, standing alone, does not permit a finding of disease or defect. As Judge, now Chief Justice, Burger expressed it in Salzman, (supra) at 399: \"The accused must show some evidence that he has lost the capacity to control his behavior not simply with respect to drinking, but in other contexts as well.\" See also Gaskin v. United States, 129 U.S.App.D.C. 308, 394 F.2d 933 (1967); and Heard v. United States, 121 U.S.App.D.C. 37, 348 f.2d 43 (1964).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9b D.C. Code § 24:301(j) (1971 Supp.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10b the evidence adduced in connection with the pretrial motion to dismiss on Eighth Amendment grounds suggests that the defendants may be able to raise an insanity issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11b See in this connection Watson, (supra) , slip opinion at p. 35 (opinion of Bazelon, Chief Judge, Concurring in part and Dissenting in part).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12b The court views its requirement that defendants produce \"some evidence\" of mental illness as consistent with Judge Burger's Concurring opinion in Hutcherson v. United States, 120 U.S.App.D.C. 274, 280, 345 f.2d 964, 970, cert.den. 382 U.S. 894, 15 L. Ed. 2d 151, 86 S. Ct. 188 (1965). The indication there that it is sufficient for defendant to make a showing that \"addiction to and long or intensive use of narcotics have eroded and impaired his capacity to control his conduct\" is taken by this Court to embrace a requirement that the use in question resulted in a mental illness. See jury instruction by Gasch, J., to same effect at p. 8 of charge in U.S. v. McCollough, McNair and Johnson, U.S. District Court for D.C., Crim. No. 467-67, April 16, 1968.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13a D.C. Code § 24:301(d)(1) (1971 Supp.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 This brief history of the development of common law mens rea in Anglo-American was drawn primarily from the following sources which are not cited in other footnotes to this section. J. RAWLS, A THEORY OF JUSTICE 235-43 (1971); F. JACOBS, CRIMINAL RESPONSIBILITY (1971); H.L.A. HART, PUNISHMENT AND RESPONSIBILITY (1968); G. WILLIAMS, : THE GENERAL PART (2d ed. 1961); J. BIGGS, THE GUILTY MIND 79-119 (1955); 2 HOLDSWORTH, HISTORY OF ENGLISH LAW (3d ed. 1927); i POLLOCK \u0026 MAITLAND, HISTORY OF ENGLISH LAW (2d ed. 1923); 2 J. STEPHEN, A HISTORY OF THE OF ENGLAND 99, 183 (1883); M. HALE, PLEAS OF THE CROWN (1675); Greenwalt, \" Uncontrollable\" Actions and the Eighth Amendment: Implications of Powell v. Texas, 69 COLUM.L.REV. 927, 937-79 (1969); Dubin, Mens Rea Reconsidered: A Plea for a Due Process Concept of Criminal Responsibility, 18 STAN.L.REV. 322 (1966); Remington \u0026 Helstad, The Mental Element in Crime - A Legislative Problem, 1952 WIS.L.REV. 644, 648-52; Perkins, A Rationale of Mens Rea, 52 HARV.L.REV. 905 (1939); Chesney, The Concept of Mens Rea in the , 29 J.CRIM.L. \u0026 CRIMINOLOGY 627 (1939); Turner, The Mental Element in Crimes at Common Law, 6 CAMB.L.J. 31 (1936); Levitt, The Origin of the Doctrine of Mens Rea, 17 ILL.L.REV. 117 (1922).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 COKE, THIRD INSTITUTE 6, 56, 107 (1641).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 4 W. BLACKSTONE, COMMENTARIES *21-22, *27.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 See, e.g., J. BENTHAM, AN INTRODUCTION TO MORALS AND LEGISLATION, chs. 12-15 (1789).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 4 W. BLACKSTONE, COMMENTARIES *21-22.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 BENTHAM, (supra) note 4, at ch. 13, para. 9.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 . . . \"Historically, our substantive is based upon a theory of punishing the vicious will. It postulates a free agent confronted with a choice between doing right and doing wrong. . . . \" Pound, Introduction to Sayre, Cases on (1927).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7 United States v. Brawner, 153 U.S.App.D.C. 1, 471 F.2d 969 (1972).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8 Allen v. United States, 150 U.S. 551, 37 L. Ed. 1179, 14 S. Ct. 196 (1893).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9 Martin v. State, 31 Ala.App. 334, 17 So.2d 427 (1944).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10 \"Coercion\" is really a specific type of compulsion relating to the husband's exercise of influence over his wife. See R. PERKINS, 909-18 (2d ed. 1969).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11 People v. Freeman, 61 Cal.App.2d 110, 142 P.2d 435 (1943).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12 State v. McCullough, 114 Iowa 532, 87 N.W. 503 (1901).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13 United States v. McGlue, 1 Curt. 1, 26 F.Cas. 1093 (No. 15,679) (C.C.D.Mass. 1851); United States v. Drew, 25 F.Cas. 913 (No. 14,993) (C.C.D.Mass. 1828).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14 Pribble v. People, 49 Colo. 210, 112 P. 220 (1910).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15 Fain v. Commonwealth, 78 Ky. 183, 39 Am.R. 213 (1879).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16 State v. Fearon, 283 Minn. 90, 166 N.W.2d 720 (1969); Easter v. District of Columbia, 124 U.S.App.D.C. 33, 361 F.2d 50 (1966) (en banc).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17 \"It is unlikely that any State at this moment in history would attempt to make it a criminal offense for a person to be mentally ill, or a leper, or to be afflicted with a venereal disease. . . . But, in the light of contemporary human knowledge, a law which made a criminal offense of such a disease would doubtless be universally thought to be an infliction of cruel and unusual punishment. . . . \" Robinson v. California, 370 U.S. 660, 666, 8 L. Ed. 2d 758, 82 S. Ct. 1417 (1962); Salzman v. United States, 131 U.S.App.D.C. 393, 399-401, 405 F.2d 358, 364-66 (1968) (Wright, J., Concurring). See Seney, \" When Empty Terrors Overawe\" - Our Defenses, 19 WAYNE L.REV. 947 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee Platt \u0026 Diamond, The Origins of the \"Right and Wrong\" Test of Criminal Responsibility and Its Subsequent Development in the United States: An Historical Survey, 54 S.CAL.L.REV. 1224 (1966); Keedy, Irresistible Impulse as a Defense in the , 100 U.PA.L.REV. 956 (1952).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18 Appellants' Supplemental Brief on Rehearing at 10.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19 Majority op. at 11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20 Id. at 3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21 Id. at 22.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22 Id. at 9.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23 Id. at 3-22.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24 See, e.g., Wasserstrom, Strict Liability in the , 12 STAN.L.REV. 731 (1959); Sayre, Public Welfare Offenses, 33 COLUM.L.REV. 55 (1933); ALI, MODEL PENAL CODE § 2.05 (Proposed Official Draft 1962).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25 158 U.S.App.D.C. at 486 n.221, 486 F.2d at 1250 n.221.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26 Brief for Appellee at 11. \"Congress has not expressly provided that addiction shall not be an affirmative defense to a charge of possessing illicit narcotics or any other offense.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27 Majority op. at 13.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28 See H.R.REP. No. 1505, 92d cong., 2d Sess. (1972) [to accompany H.R. 11268]. No action was taken on the report and no action was taken in the Senate on s. 2692.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29 To date, the proposed legislation has not been reintroduced in the 94th Congress.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30 H.R.REP. No. 1444, 91st Cong., 2d Sess., pt. 1, 9 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31 Id. at 10.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32 Supplemental Brief and Appendix for Appellee at 40.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33 \"It shall be unlawful for any person knowingly or intentionally to possess a controlled substance . . . Any person who violates this subsection shall be sentenced to a term of imprisonment. . . . \"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34 \"The congress intends that Federal s shall be enforced against drug users as well as other persons. . . . \" D.C. Code 1973, § 24-601.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35 D.C. Code 1973, § 24-603(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36 (supra) p. 71.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37 Another tactic formerly employed by the United States Attorney as a matter of policy was to permit an addict found in possession of a small quantity for his own use to plead guilty to a felony possession count \"in the hope that the court will thereafter invoke the provisions of title II of the Narcotic Rehabilitation Act of 1966 (18 U.S.C. § 4251 et seq.).\" Hearings on Drug Abuse in the Washington Area Before the Senate Comm. on the District of Columbia, 91st Cong., 1st Sess., pt. 2, 370 (1969) (statement of David G. Bress, former United States Attorney for the District of Columbia).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38 Majority op. at 3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39 THE PRESIDENT'S ADVISORY COMMISSION ON NARCOTIC AND DRUG ABUSE, FINAL REPORT 40 (1963). See also Holahan, The Economics of Heroin, in DRUG ABUSE SURVEY PROJECT, DEALING WITH DRUG ABUSE - A REPORT TO THE FORD FOUNDATION 278-95 (1972) [hereinafter, FORD FOUNDATION REP.]; NATIONAL COMMISSION ON REFORM OF FEDERAL S, WORKING PAPERS 1132, 1136-37 (1970) (Note on Dependence as a Defense to Unlawful Possession); CANADIAN COMMISSION OF INQUIRY INTO THE NON-MEDICAL USE OF DRUGS, INTERIM REPORT 517 (1970); THE PRESIDENT'S COMMISSION ON LAW ENFORCEMENT AND ADMINISTRATION OF JUSTICE, TASK FORCE REPORT NARCOTICS AND DRUG ABUSE 158 (1967) [hereinafter, PRESIDENTIAL TASK FORCE REP.]; W. N. SEYMOUR, THE YOUNG DIE QUIETLY 55 (1972); A. LINDESMITH, THE ADDICT AND THE LAW 61-62 (1965); I. CHEIN, D. GERARD, R. LEE \u0026 E. ROSENFELD, THE ROAD TO H (1964); PROCEEDINGS OF THE WHITE HOUSE CONFERENCE ON NARCOTIC AND DRUG ABUSE 229-30 (1962); W. ELDRIDGE, NARCOTICS AND THE LAW (2d rev.ed. 1967); L. KOLB, DRUG ADDICTION A MEDICAL PROBLEM (1962); JOINT COMMITTEE OF THE AMERICAN BAR ASSOCIATION AND THE AMERICAN MEDICAL ASSOCIATION ON NARCOTIC DRUGS, DRUG ADDICTION, CRIME OF DISEASE? 45 (1961) [hereinafter, ABA-AMA COMM.REP.]; Hearings on Heroin Importation, Distribution, Packaging and Distribution Before the House Select Comm. on Crime, 91st Cong., 1st Sess. (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40 See, e.g., DuPont, Profile of a Heroin-Addiction Epidemic, N.ENG.J. OF MED. 320-24 (Aug. 5, 1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee generally STAFF STUDY ON DRUG ABUSE IN THE WASHINGTON AREA 1970, prepared for the Senate Comm. on the District of Columbia, 91st Cong., 2d Sess. (Committee Print 1970); Hearings on Narcotics-Crime Crisis in the Washington Area Before the Senate Comm. on the District of Columbia, 91st Cong., 2d Sess., pt. 12 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41 ABA SPECIAL COMMITTEE ON CRIME PREVENTION AND CONTROL, NEW PERSPECTIVES ON URBAN CRIME 26 (1972) [hereinafter, ABA CRIME REP.].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42 Id. at 50. See E. BRECHER \u0026 THE EDITORS OF CONSUMER REPORTS, LICIT \u0026 ILLICIT DRUGS 528 (1972).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43 See, e.g., Watson v. United States, 141 U.S.App.D.C. 335, 338, 439 F.2d 442, 445 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44 ABA CRIME REP., (supra) note 41, at 28.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45 Jaffe, Drug Addiction and Drug Abuse, in the PHARMACOLOGICAL BASIS OF THERAPEUTICS 283 (4th ed. L. Goodman \u0026 A. Gilman eds. 1970) [hereinafter, Jaffe on Drug Addiction ].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Id.; W. N. SEYMOUR, THE YOUNG DIE QUIETLY, (supra) note 39, at 77; D. LOURIA, THE DRUG SCENE 5 (1968); PRESIDENTIAL TASK FORCE REP., (supra) note 39, at 52; I. CHEIN, THE ROAD TO H, (supra) note 39; Cohen, Control of Drug Abuse, 34 FED. PROBATION 32 (1970); Rosenthal, Two Problems and a Lesson for the Draftsman of Drug Crimes Legislation, 24 SW. L.J. 407 (1970); Bell, Drug Addiction, 22 BULL. OF NARCOTICS 21 (1970); Skolnick, Coercion to Virtue: The Enforcement of Morals, 41 S.CAL.L.REV. 588 (1968).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. DuPont, Profile of a Heroin-Addiction Epidemic, supra note 40.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. ABA CRIME REP., (supra) note 41, at 33. See also J. CULL \u0026 R. HARDY, TYPES OF DRUG ABUSERS AND THEIR ABUSES (1974); Lewis \u0026 Glaser, Lifestyles Among Heroin Users, 38 FED. PROBATION 21 (March 1974); Rubington, Two Types of Drug Use, in NATIONAL DISTRICT ATTORNEY'S ASS'N. DRUG DEPENDENCE AND ABUSE RESOURCE BOOK 149-200 (1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. See, e.g., In re De La O, 59 Cal.2d 128, 28 Cal.Rptr. 489, 378 P.2d 793 (1963).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. See, e.g., D.C. Code 1973, § 24-609. See generally Kramer, The Statute Versus the Addict: Uncivil Commitment, 50 B.U.L.REV. 1 (1970); Aronowitz, Civil Commitment of Narcotics Addicts, 67 COLUM.L.REV. 405 (1967).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. Greenwalt, \"Uncontrollable\" Actions and the Eighth Amendment: Implications of Powell v. Texas, supra note 1, at 958.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. NATIONAL COMMISSION ON MARIHUANA AND DRUG ABUSE, SECOND REPORT: DRUG USE IN AMERICA 256 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. Id. at 273.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. ABA CRIME REP., (supra) note 41, at 58; PRESIDENTIAL TASK FORCE REP., (supra) note 39, at 226; ARTHUR D. LITTLE, INC., DRUG ABUSE AND LAW ENFORCEMENT - A REPORT TO THE PRESIDENT'S COMMISSION ON LAW ENFORCEMENT AND ADMINISTRATION OF JUSTICE 47-48 (1967); PRESIDENT'S COMMISSION ON CRIME IN THE DISTRICT OF COLUMBIA, REPORT 572-73 (1966); D. MAURER \u0026 V. VOGEL, NARCOTICS AND NARCOTIC ADDICTION 179-80 (3d ed. 1967); ABA-AMA COMM.REP., (supra) note 39, at 85.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eUnited States District Court Judge Richey recently noted the incarceration of an addict \"will do nothing to solve his problem of drug addiction or his underlying problems.\" United States v. Turner, 337 F. Supp. 1045, 1047 (D.D.C. 1972).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. D. MAURER \u0026 V. VOGEL, (supra) note 54, at 172.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. H.L.A. HART, PUNISHMENT AND RESPONSIBILITY, (supra) note 1, at 153; J. RAWLS, A THEORY OF JUSTICE, (supra) note 1, at 241.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. See text (infra) at note 60.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. 116 CONG.REC. 33,605 (1970) (remarks of Rep. Springer).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOne presidential commission stated that the objectives of narcotic law enforcement \"are to reach the highest possible sources of drug supply and to seize the greatest possible quantity of illicit drugs before use.\" PRESIDENT'S COMMISSION ON LAW ENFORCEMENT \u0026 ADMINISTRATION OF JUSTICE, THE CHALLENGE OF CRIME IN A FREE SOCIETY 218 (1967).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. The National Commission on Marihuana and Drug Abuse has pointed out that such efforts are often ineffective because nontrafficking addicts usually know little about men higher up in the drug distribution chain. SECOND REPORT: DRUG USE IN AMERICA 255 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. Supplemental Brief and Appendix for Appellee at 37-38. References appear in the slip opinion at 23, 29, 32, and 39.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. H.L.A. HART, PUNISHMENT AND RESPONSIBILITY, (supra) note 1, at 153. See Packer, Mens Rea and the Supreme Court, 1962 SUP.CT.REV. 107; Comment, Criminal Responsibility and the Drug Dependence Defense - A Need for Judicial Clarification, 42 FORDHAM L.REV. 361, 366 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. Majority op. at 4.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. Judges MacKinnon, Robb, and Wilkey.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. United States v. Moore, 158 U.S.App.D.C. at 395, 486 F.2d at 1159; United States v. Harrison, 158 U.S.App.D.C. 229, 232, 485 F.2d 1008, 1010 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. 18 U.S.C. § 4251(f)(4) (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. Marshall v. United States, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. See TASK FORCE ON FEDERAL HEROIN ADDICTION PROGRAMS, FEDERAL DRUG ABUSE PROGRAMS, A REPORT SUBMITTED TO THE SECTION OF THE ABA AND DRUG ABUSE COUNCIL 87, 103 (1972); COMPTROLLER GENERAL OF THE UNITED STATES, REPORT TO THE CONGRESS ON THE LIMITED USE OF FEDERAL PROGRAMS TO COMMIT NARCOTIC ADDICTS FOR TREATMENT \u0026 REHABILITATION, reprinted in Hearings on Treatment \u0026 Rehabilitation of Narcotics Addicts Before Subcomm. No. 4 of the House Comm. on the Judiciary, 91st Cong., 1st Sess., pt. 1 at 209, 217 (1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. Majority op. at 19.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. See, e.g., D. MAURER \u0026 V. VOGEL, NARCOTICS AND NARCOTIC ADDICTION 37-44 (4th ed. 1973); W. ELDRIDGE, NARCOTICS AND THE LAW, (supra) note 39, at 2. See generally R. BLUM, D. BOVET, J. MOORE ET AL., CONTROLLING DRUGS (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eDr. Jerome H. Jaffe has defined \"addiction\" to mean:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ebehavioral pattern of compulsive drug use, characterized by overwhelming involvement with the use of a drug, the securing of its supply, and a high tendency to relapse after withdrawal. Addiction is thus viewed as an extreme on a continuum of involvement with drug use and refers in a quantitative rather than a qualitative sense to the degree to which drug use pervades the total life activity of the user. In most instances it will not be possible to state with precision at what point compulsive use should be considered addiction. Addiction in this frame of reference cannot be used interchangeably with physical dependence. It is possible to be physically dependent on drugs without being addicted and to be addicted without being physically dependent. [Jaffe on Drug Addiction, supra note 45, at 277; emphasis in original.] [ See for similar statements, A. LINDESMITH, THE ADDICT AND THE LAW, (supra) note 39; ABA-AMA COMM.REP., (supra) note 39, at 45-46.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eUnited States District Court Judge Gasch offered the following definition of \"addict\" in United States v. Lindsey, 324 F. Supp. 55, 59 (D.D.C. 1971):\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ewho lacks the ability to abstain from taking or using narcotics or is utterly unable to control his actions in regard to the taking of narcotic drugs. . . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. WHO TECH. REP. SER. No. 526, at 17 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71. WHO TECH. REP. SER. No. 84, at 10-11 (1954).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72. See, e.g., 18 U.S.C. § 4251(a) (1970); 28 U.S.C. § 2901(a) (1970); 42 U.S.C. § 3411(a) (1970). The Public Health Service Act, 42 U.S.C. § 201(q) (1970), defines \"drug dependent person\" as\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ea person who is using a controlled substance (as defined in section 802 of Title 21) and who is in a state of psychic or physical dependence, or both, arising from the use of that substance on a continuous basis. Drug dependence is characterized by behavioral and other responses which include a strong compulsion to take the substance on a continuous basis in order to experience its psychic effects or to avoid the discomfort caused by its absence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eHearings Before the Permanent Subcomm. on Investigations of the Senate Comm. on Government Operations, 88th Cong., 2d Sess., pt. 5, at 1300-01 (statement of Dr. Herbert A. Raskin); ABA-AMA COMM.REP., (supra) note 39, at 45.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73. 1 M. HALE, PLEAS OF THE CROWN, (supra) note 1, at 50.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74. 4 W. BLACKSTONE, COMMENTARIES *30 (\"he ought rather to die himself than escape by the murder of an innocent\"); 1 M. HALE, id. at 51.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e75. The Model Penal Code proposes a \"substantial capacity\" standard which has been adopted by the Second Circuit. United States v. Freeman, 357 F.2d 606 (2d Cir. 1966).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA person is not responsible for criminal conduct if at the time of such conduct as a result of mental disease or defect he lacks substantial capacity. . . to conform his conduct to the requirements of law. [ALI, MODEL PENAL CODE § 4.01(1) (PROPOSED OFFICIAL DRAFT 1962).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ethe drafters offer the following explanation of this section:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe law must recognize that when there is no black and white it must content itself with different shades of gray. The draft, accordingly, does not demand complete impairment of capacity. It asks instead for substantial impairment. This is all we think that candid witnesses, called on to infer the nature of the situation at a time they did not observe, can ever confidently say, even when they know that a disorder was extreme. [ALI, MODEL PENAL CODE, Comments § 4.01 at 158 (TENT. DRAFT No. 4, 1955).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee also MODEL PENAL CODE § 2.01(1):\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA person is not guilty of an offense unless his liability is based on conduct which includes a voluntary act or the omission to perform an act of which he is physically capable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe National Commission on Reform of Federal s recommended that there be an affirmative defense to a prosecution for possession of an abusable drug if:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003edrug was possessed for personal use by a defendant who was so dependent on the drug that he lacked substantial capacity to refrain from use. [NATIONAL COMMISSION ON REFORM OF FEDERAL S, STUDY DRAFT OF A NEW FEDERAL CRIMINAL CODE § 1824(2) (1970).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThat section was deleted, however, in the Commission's Final Report (1971) without comment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee generally United States v. Brawner, supra note 7.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e76. Methadone is a synthetic narcotic which prevents withdrawal and satiates the addict's craving for heroin. However, there is no euphoria associated with oral administration of methadone and it is also an addictive drug. Consequently:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eare significant numbers of addicts who seem unwilling to substitute methadone for heroin. After studying a group of criminal recidivist addicts in the New York City jail, Dr. Dole concluded that only 50 percent of those crime-prone addicts would accept methadone instead of heroin. Dr. Henry Gollance, one of Dr. Dole's colleagues, told the House Select Committee on Crime that methadone maintenance might be effective for only 25 percent of New York's entire addict population. [ABA SPECIAL COMMITTEE ON CRIME PREVENTION AND CONTROL, NEW PERSPECTIVES ON URBAN CRIME 56-57 (1972).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e77. See Easter v. District of Columbia, supra note 16, at 36, 361 F.2d at 53; United States v. Drew, supra note 13, at 914.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e78. As noted earlier in the text, (supra) notes 70 and 71, alcohol is classified as a \"dependence-producing drug\" by the WHO, and drug dependence of the opiate type is ranked as the most intensive form of drug dependence. See D. MAURER \u0026 V. VOGEL, NARCOTICS AND NARCOTIC ADDICTION, (supra) note 69, at 47; K. JONES, L. SHAINBERG \u0026 C. BYER, DRUGS AND ALCOHOL 144 (2d ed. 1973); M. Glatt, Alcoholism and Drug Dependence - Under One Umbrella?, in WORLD DIALOGUE ON ALCOHOL AND DRUG DEPENDENCE 311, 329-31 (E. Whitney ed. 1970); Eddy, Halback, Isbell \u0026 Seevers, Drug Dependence: Its Significance and Characteristics, 32 BULL. OF WHO 721, 725-28 (1965); A. LINDESMITH, ADDICTION \u0026 OPIATES 4 (1968); INTERDEPARTMENTAL COMMITTEE ON NARCOTICS, REPORT TO THE PRESIDENT OF THE U.S. 3-4 (1961).\u003c/span\u003e\n\n",
    "body_length": 171811,
    "citedas": [
      "339 A.2d 401"
    ],
    "attorneys": "M. Langhorne Keith, with whom John Ferren was on the brief, for appellant Gorham. Richard L. Hubbard, appointed by this court, for appellant Williams. Ann K. Macrory participated in the argument of this case for William Russell Franklin, whose appeal was consolidated with those of appellants Gorham and Williams for reargument before the court sitting en banc. A separate opinion was rendered in appellant Franklin's case. Richard L. Cys, Assistant United States Attorney, with whom Harold H. Titus, Jr., United States Attorney, John A. Terry, Robert C. Crimmins, Roger M. Adelman and Oscar Altshuler, Assistant United States Attorneys, were on the brief, for appellee. Robert L. Palmer, with whom Robert N. Sayler was on the brief, for the Washington Area Council on Alcoholism and Drug Abuse, Inc., as amicus curiae.",
    "category": [
      "243",
      "36",
      "75"
    ],
    "judges": "Before Reilly, Chief Judge, and Kelly, Fickling, Kern, Gallagher, Nebeker, Pair,* Yeagley and Harris, Associate Judges.",
    "citation_count": 14
  }
}
