{
  "id": "9IHwPWYBTlTomsSBl2hY",
  "document": {
    "title": "Simmons v. City of Philadelphia",
    "full_title": "DELORES SIMMONS, ADMINISTRATRIX OF THE ESTATE OF DANIEL LA FRISCOE SIMMONS v. THE CITY OF PHILADELPHIA; POLICE OFFICER A. PANATI, BADGE NO. 2587",
    "jurisdiction": "Third Circuit",
    "date": "1991-10-18T00:00:00.000Z",
    "docket": "No. 90-1118",
    "body": "Opinion ANNOUNCING THE JUDGMENT OF THE COURT\n\nTABLE OF CONTENTS\n\nI. THE FACTUAL BACKGROUND AND PROCEDURAL HISTORY 1049\n\nA. The Factual Background 1049\n\nB. The Trial Proceedings 1049\n\nII. WAS THE CITY ENTITLED TO J.N.O.V. WITH RESPECT TO\n\nPLAINTIFF'S FEDERAL CLAIMS? 1055\n\nA. Did the City Waive its Inconsistency Objection to the\n\n§ 1983 Verdicts? 1055\n\nB. The Alleged Inconsistency of the Verdicts; the Requisites\n\nfor Estab-\n\nlishing a Municipality's Direct Liability for a Policy or\n\nCustom and a\n\nFailure to Train; and (More On) Waiver 1058\n\n1. The Alleged Inconsistency of the Verdicts 1058\n\n2. The Predicates to a Municipality's Direct Liability for\n\na Policy,\n\nCustom, or Failure to Train 1059\n\n3. More on Waiver 1065\n\nC. The Sufficiency of the Evidence 1066\n\n1. Standards for Determining Whether the City Breached a\n\nConsti-\n\ntutional Duty to Intoxicated and Potentially Suicidal\n\nDetainees 1067\n\n2. The Sufficiency of the Evidence With Respect to\n\nPlaintiff's\n\nMunicipal Custom or Policy Allegation 1070\n\n3. The Sufficiency of the Evidence With Respect to\n\nPlaintiff's\n\nFailure to Train Theory 1074\n\nIII. WAS THE CITY ENTITLED TO J.N.O.V. WITH RESPECT TO\n\nPLAINTIFF'S\n\nPENDENT STATE CLAIMS? 1076\n\nA. Did the City Waive its Argument that Plaintiff Failed\n\nto Allege and\n\nEstablish any Pendent State Claims? 1076\n\nB. The Alleged Errors in the Jury Instructions 1077\n\n1. The Alleged Error of Permitting the Jury to Consider the\n\nCondition of the Lockup Facilities 1078\n\n2. The Alleged Error of Instructing the Jury that Police\n\nDirectives\n\nEstablish a Statutory or Common Law Duty 1079\n\n3. The Instruction that Intoxication Can Lower a Prisoner's\n\nDuty\n\nto Exercise Due Care 1079\n\n4. The Alleged Error of Failing to Instruct the Jury on the\n\nPrecon-\n\nditions to a Duty Arising from a Special Relationship 1080\n\nC. Is the City Immune from Liability With Respect to\n\nPlaintiff's State\n\nClaims? 1084\n\nIV. IS THE PLAINTIFF ENTITLED TO DELAY DAMAGES UNDER RULE\n\n238? 1088\n\nV. CONCLUSION 1088\n\nBECKER, Circuit Judge\n\nThis is an appeal from a judgment of the district court entered on a large jury verdict in favor of the mother and administratrix of the estate of an emotionally disturbed young man who hung himself in a Philadelphia station house lockup after having been arrested for intoxication. This appeal requires exploration of the recesses of the federal civil rights law insofar as it bears on the liability of municipalities and municipal police officers under these circumstances. More particularly, this appeal requires examination of the predicates to a municipality's liability for a policy, a custom, or a failure to train employees in light of a trio of Supreme Court decisions expanding on the prerequisites to municipal liability established in Monell v. Department of Social Services, 436 U.S. 658, 98 S. Ct. 2018, 56 L. Ed. 2d 611 (1978). This appeal also necessitates prediction of how the Pennsylvania Supreme Court would decide issues concerning the prerequisite to a duty to protect an intoxicated and suicidal prisoner and the effect of the state's Tort Claims Act on the validity of municipal ordinances, such as Philadelphia's, waiving immunity from liability for police negligence. Finally, because in a number of instances counsel for the defendant City of Philadelphia arguably failed to preserve points raised on appeal, I devote a good deal of attention to an explanation of the principles of waiver and their application to this case. For the reasons that follow in this opinion and in Judge Sloviter's separate opinion, the district court's order denying the City's post-trial motions, its judgment on the verdict, and its award of delay damages to the plaintiff will be affirmed.\n\nI. THE FACTUAL BACKGROUND AND PROCEDURAL HISTORY\n\nA. The Factual Background\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nIn the early hours of the morning of October 19, 1985, Philadelphia (\"City\") police officers took Daniel Simmons, who was 24 years of age and had no prior convictions, into custody for public intoxication. Pursuant to a departmental directive, the City police ordinarily do not file charges against intoxicated persons, but merely hold them in protective custody until they are sober or can be released to a responsible party.\n\nWhen the police detained Simmons, who was heavily intoxicated, he grew agitated, became quite concerned about his arrest, and began to cry. The arresting officers attempted to calm him and transported him to the City's Sixth Police District, where they placed him in the custody of the facility's turnkey, Officer Albert Panati. The arresting officers informed Panati that Simmons was crying and upset at the time that he was taken into custody. Following his arrival at the district detention facility, Simmons became confused, emotional, and deeply concerned about his arrest and its consequences. The district court determined that, \"in spite of his condition, the minor nature of his offense, and his inability to call his family,\" no one at the detention facility placed a call on Simmons's behalf. Simmons v. City of Philadelphia, 728 F. Supp. 352, 353 (E.D. Pa. 1990). Indeed, Panati testified that it was his practice not to place telephone calls on behalf of intoxicated detainees and to permit such a detainee to place a phone call only if the detainee made a request and was, in the officer's judgment, sufficiently sober.\n\nPanati removed Simmons's belt and sundry of his personal belongings as required by a City police directive before placing him alone in a cell. Panati, however, did not comply with a second directive, presumably intended to forestall suicide attempts, which provides that \"whenever possible, a minimum of two persons are to be placed in a cell/detention room.\" Notwithstanding this directive, Panati customarily attempted to house intoxicated detainees separately, in order to prevent altercations. Because the cell block was empty at the time that he incarcerated Simmons, Panati could not have housed Simmons with another prisoner, even had he decided that Simmons should not be left alone in a cell. The district court determined, however, that \"there were other jails in the City which were not totally empty\" to which Simmons could have been taken. Id.\n\nPanati returned to Simmons's cell approximately fifteen minutes after he first had placed him there. At this point, because Simmons had untied his shoe laces and they were flopping around, Panati removed them -- a step that a City police directive instructs should be taken immediately upon incarceration. The district court determined that \"aside from removing the shoe laces, no other steps were taken to protect Simmons.\" Id.\n\nPanati's desk was separated by a wall from the cell block in which Simmons was held, and a turnkey had to enter the block physically in order to see what was happening within a given cell. Panati's log book showed that, during the time that Simmons was incarcerated, the officer inspected the cell block at precise fifteen minute intervals, in accordance with police directives. Panati admitted, however, that he recorded in this log that he had inspected the cells in the facility at exactly every quarter of an hour, regardless of when he actually did so. For at least one hour of the time during which Simmons was custody, he remained quite upset and periodically rattled the bars of his cell. According to Panati, Simmons had \"glassy eyes,\" was \"in a stupor,\" and did not respond when Panati told him to sit down and relax. Panati described Simmons's reactions to his continued incarceration as varying between confusion and hysteria.\n\nSlightly more than one and one half hours after he first had locked Simmons into his cell, Panati discovered Simmons hanging from the bars of the cell from a noose that he had made from his trousers. Panati cut Simmons down and called for a medical rescue team. Panati himself made no attempt to revive Simmons. A rescue team arrived approximately seventeen minutes after Panati had discovered Simmons's body. An autopsy revealed that, at death, Simmons's blood alcohol level was .24, or more than twice the legal blood-alcohol limit for operating a motor vehicle.\n\nFollowing her son's suicide, Simmons's mother and administratrix, Delores Simmons, instituted this civil rights action, 42 U.S.C. § 1983, against Officer Panati, the City, and City Police Commissioner Gregor Sambore. Plaintiff alleged that these defendants had violated various of Simmons's constitutional rights, including his rights to life, liberty, and due process of law under the fifth and fourteenth amendments and his penumbral privacy rights. In addition, plaintiff asserted cognate pendent tort claims against each of the defendants. Prior to trial, however, plaintiff moved and was granted permission to withdraw her action against Police Commissioner Sambore.\n\nB. The Trial Proceedings\n\nWhereas plaintiff presented numerous theories of the City's section 1983 liability in her complaint, she attempted to establish the City's liability at trial based on two conjoint theories. First, plaintiff sought to establish, by means of expert testimony concerning the state of City detention facilities and the City's rules for processing detainees, that the City violated Simmons's constitutional right to due process through a policy or custom of inattention amounting to deliberate indifference to the serious medical needs of intoxicated and potentially suicidal detainees. As a concomitant of this overarching theory, plaintiff sought, second, to establish that the City violated Simmons's due process rights through a deliberately indifferent failure to train its officers to detect and to meet those serious needs.\n\nAt trial, plaintiff called as a witness Sergeant John Heran of the City Police Department's Research and Planning Unit, which serves the City's Police Commissioner and is responsible for drafting departmental policies and procedures. Sergeant Heran testified that between the years of 1980 and 1985, 20 individuals, 15 of whom had been detained for public intoxication, committed suicide in City lockups. According to Heran, in 1985 -- the year in which Simmons died -- four detainees (including Simmons) committed suicide in City lockups; all were intoxicated and all killed themselves in the early hours of the morning. Heran's testimony revealed that all 20 of the individuals who committed suicide in City lockups between 1980 and 1985 did so by hanging themselves with articles of clothing. In the five years prior to Simmons's suicide, no suicides had occurred in the 6th District lockup.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nHeran testified that the 20 suicides in City lockups between 1980 and 1985 occurred from among a total of 428,000 arrests, 97,141 of which were for public intoxication. He stated, however, that the Research and Planning Unit had compiled no statistical information on the number of attempted suicides that had occurred in City lockups in that five year period. Neither, according to Heran, had the Research and Planning Unit compiled any psychological data on individuals who had attempted or committed suicide in City lockups. Heran further testified that none of the departmental directives drafted by the Research and Planning Unit and promulgated by the Police Commissioner either dealt with training in suicide prevention or set forth warning signs of suicide in the behavior of intoxicated or otherwise disturbed detainees.\n\nOfficer Panati's trial testimony tended to corroborate the absence of any specific focus on suicide prevention in the City's continuing education of its police officers. Panati stated that, although he believed that he might have received some training in suicide prevention at the City Police Academy nearly twenty years prior to Simmons's suicide, he could not recall having received any additional or specialized training in suicide prevention during his time as a member of the City Police Department.\n\nIn addition to eliciting the testimony of Officer Panati and of Sergeant Heran, plaintiff called two expert witnesses at trial. The district court qualified the first of these witnesses, Joseph Rowan, as an expert in data concerning jail suicides and in police training techniques aimed at preventing them.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Rowan testified that a survey of jail suicides completed in 1981 showed that intoxicated persons comprised two-thirds of all suicides in police lockups and jails; that 75% of the suicides occurred when individuals were isolated in jail cells, as opposed to housed with one or more other inmates; that most jail suicides occurred between the hours of 12:00 a.m. and 6:00 a.m.; and that most of the individuals who committed suicide in lockups were young.\n\nRowan further testified that this 1981 survey, which was widely used in training jailers in the identification and monitoring of suicidal detainees, had been made available to all police lockups in the country. He stated that the City's statistics on the suicides occurring in its jails between 1980 and 1985 -- in particular, the statistic that 15 of the 20 individuals who committed suicide (or 75%) were intoxicated -- comported with the results of both the 1981 survey and a subsequent survey on jail suicides.\n\nRowan also surveyed the jail safety standards issued prior to Simmons's suicide by organizations such as the Commission on Accreditation for Law Enforcement Agencies (CALEA)\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e and the American Medical Association. Rowan testified that these standards directed that intoxicated detainees, because they are at a high risk of sudden death from suicide and other causes, should be under constant observation while in lockups and, if possible, transferred to treatment facilities. According to Rowan, the standards additionally directed that jail personnel should be trained in the signs of suicidal tendencies, such as intoxication, agitation, and mood swings from a state of high anxiety to one of silent introspection, signifying that the detainee may have decided to commit suicide.\n\nRowan testified that the various detention facility standards in effect at the time of Simmons's suicide further directed that officers staffing lockups should be prepared to respond within four minutes to health and safety threats to inmates. Because of this recommended four-minute response time, Rowan observed, these standards frequently provided that various types of audio or visual monitoring systems should be installed in jail facilities to supplement direct supervision by staff members. Rowan voiced the opinion that, in light of these standards and the practices of other police departments, the City Police Department's system of checking on inmates -- particularly intoxicated and otherwise potentially suicidal ones -- by means of fifteen-minute checks was \"grossly substandard.\"\n\nBased on the 1981 survey and the various standards existing at the time, Rowan opined that Simmons's suicide was both predictable and the product of negligence and deliberate indifference on the part of Panati and the City. Rowan faulted Panati for failing to realize that Simmons was likely to harm himself, failing to monitor Simmons more closely, failing to respond to Simmons's hanging within four minutes, and failing to administer C.P.R. to him. With respect to the City, Rowan chiefly faulted the lack of training in suicide prevention and detection received by officers. Based on Panati's testimony, Rowan asserted that the officer had \"absolutely not\" received the training in detecting and preventing potential suicides that the City should have provided for all turnkeys. Rowan suggested that, because Simmons fit the psychological profile of a suicidal detainee that had been derived for training purposes from the 1981 survey, the City, through training turnkeys such as Panati in suicide prevention, could have averted Simmons's suicide.\n\nIn cross-examining Rowan, counsel for the City emphasized the extremely small number of suicides among intoxicated detainees -- .00015% -- that had occurred in City jails between 1980 and 1985. Despite this extremely small statistical probability that any particular intoxicated detainee would commit suicide, it was Rowan's opinion that each suicide during those years increased the City's obligation to train officers to prevent still another suicide. It was also Rowan's view that each suicide increased the City's obligation to develop specific procedures for implementing its global directives on ensuring prisoner safety and to make physical feature changes in jail facilities, such as \"suicide-proofing\" cells and installing audio or visual monitoring devices, that would deter future suicides.\n\nPlaintiff called, as her second expert, Dr. Edward Guy, a forensic psychiatrist and the Program Director of Mental Health Services in the Philadelphia Prison System since the mid-1960s. Dr. Guy testified that, in the years prior to Simmons's suicide, officials in the City Police Department and prison system knew, from a study carried out within the prison system and from a series of suicides in police precinct lockups, that a correlation existed between intoxication and suicides occurring among detainees. Guy stated that, as a result, he was asked in 1981 to participate in a City Police Academy training program for a group of turnkeys.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nAlthough it is unclear whether he directly imparted this information to policymaking officials within the City Police Department, Guy testified that he discussed with the turnkeys a profile that he had developed of the type of detainee most likely to be at a high risk of suicide. Guy's research revealed that the majority of suicidal detainees had completed high school, had better occupational records than the average inmate, and tended to be -- although were not necessarily -- white. According to Guy, detainees likely to commit suicide would \"be showing some kind of emotional disturbance that would be observable,\" such as crying, agitation, shouting, and rattling cell bars. Guy stated that he informed the turnkeys that such detainees should be constantly monitored by means of one-on-one interaction or television monitors and, if necessary, physically restrained with handcuffs to prevent them from harming themselves.\n\nGuy's testimony further indicated that in 1981, the year in which he participated in the training course for turnkeys, he communicated to officials within the City Police Department his belief that the design of the typical precinct lockup prevented proper observation of detainees. Guy stated that he had encouraged that design changes to enable turnkeys to observe detainees more closely be made in City lockups. According to Guy, he specifically had advised that the staff members at lockups be stationed within cell areas.\n\nGuy concluded that Simmons, although black, otherwise displayed \"all of those signs that would have put him in the highest risk group of incarcerated persons to commit suicide.\" It was Guy's opinion that Simmons, at the time of his suicide, was suffering from an emotional disturbance and seriously impaired judgment. According to Guy, Simmons therefore either should have been under constant observation or should have been transferred expeditiously to a lockup in which he could have been placed in a cell with other inmates. It was Guy's opinion that Panati was negligent and deliberately indifferent in failing to take either measure. Guy also attributed negligence and deliberate indifference to the City for failing, in the face of many years of suicides in precinct lockups, to take steps to diminish the clear risk of future suicides. Guy was of the opinion that the City, among other steps, should have redesigned its lockup areas to permit closer monitoring of detainees and should have instituted procedures to ensure that intoxicated detainees received medical attention.\n\nSimmons's stepbrother, Reginald Rosemond, testified that the police detective who notified the family of Simmons's suicide told him that his brother had been acting peculiarly while in detention. According to Rosemond, the detective stated that the police had taken Simmons's shoe laces from him for this reason. Rosemond also testified that the officer had told him that people who are intoxicated are at high risk to commit suicide while in jail.\n\nAt the close of plaintiff's evidence, the City moved for a directed verdict on the grounds set forth in its trial brief. In this brief, the City had argued that: (1) plaintiff could not establish a claim premised on violations of Simmons's due process or other constitutional rights because she could adduce no evidence of deliberate indifference on the part of Panati or the City; and (2) plaintiff's pendent state claims should be dismissed because no special relationship, as defined by state law, existed between Simmons and the defendants. In a brief colloquy with counsel, the district court denied the City's motion on grounds that sufficient evidence existed to submit to the jury the issues of Panati's and the City's deliberate indifference and negligence.\n\nThe City then called as witnesses Officer Panati and a second officer who was on duty at the precinct lockup at the time of Simmons's suicide. Panati testified that he had seen no signs of suicidal tendencies in Simmons's behavior, which had not seemed to him abnormal for an intoxicated detainee. The second officer testified to the speed with which the rescue team arrived following the discovery that Simmons had hung himself.\n\nThe case then was submitted to the jury on special interrogatories.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The jury specified that it did not find Panati liable to plaintiff under section 1983 for depriving Simmons, under the color of state law, of his constitutional rights. The jury found, however, that Panati had committed torts against Simmons under Pennsylvania law. The jury responded \"Yes\" to the further questions whether the City was liable under section 1983 for violating Simmons's constitutional rights and had committed torts against Simmons under Pennsylvania law. The jury also found that the actions of both Panati and the City were legal causes of harm to Simmons. The jury awarded plaintiff $10,000 in wrongful death damages and $990,000 in survival damages. Having responded \"No\" to the question whether Panati had recklessly or maliciously injured Simmons, the jury awarded plaintiff no punitive damages against the officer.\n\nAdvancing numerous arguments, the City moved for judgment notwithstanding the verdict and, in the alternative, for a new trial. The district court determined that the City, by failing to raise them in support of its Rule 50(a) motion for a directed verdict, had waived most of these arguments, including: (1) that in order for a verdict against the City under section 1983 to stand, the jury must first have returned a verdict against Panati; (2) that only if the jury had found that Panati violated Simmons's constitutional rights under the color of state law could it validly have found that the City's actions were a legal cause of Simmons's death; (3) that plaintiff generally had failed to allege and establish any causes of action for negligence under Pennsylvania law; and (4) that although the City had by ordinance waived its immunity from liability for police misconduct, a statute enacted by the state legislature, as construed by the Pennsylvania Supreme Court in In re Upset Sale of Properties (Skibo), 522 Pa. 230, 560 A.2d 1388 (1989), effectively had invalidated that ordinance and reinstated the City's immunity from suit for negligence. The district court further concluded that, even if properly preserved, all of these arguments lacked merit. 728 F. Supp. at 354-55.\n\nThe district court determined that the City had, in its motion for a directed verdict, preserved two arguments for granting its motion for j.n.o.v.: (1) that plaintiff had failed to adduce evidence sufficient to meet the deliberate indifference standard for municipal liability established in City of Canton v. Harris, 489 U.S. 378, 109 S. Ct. 1197, 103 L. Ed. 2d 412 (1989); and (2) that because no \"special relationship\" existed between Simmons and the police, Panati and the City had no state-law duty to Simmons and therefore could not be held liable to plaintiff for negligence. 728 F. Supp. at 354.\n\nAfter analyzing the Supreme Court's holding in City of Canton, in tandem with the statistical evidence and the testimony of plaintiff's experts, the district court concluded that the jury reasonably could have found that the City, at least by failing to train its police officers properly, had shown deliberate indifference to the serious medical needs of intoxicated and potentially suicidal detainees, thereby violating Simmons's due process rights.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Id. at 355-57. The district court also rejected the City's state law argument, reasoning that in DeShaney v. Winnebago County, 489 U.S. 189 109 S. Ct. 998, 103 L. Ed. 2d 249 (1989), the Supreme Court had established that custody creates a special relationship and a concomitant duty to detainees. 728 F. Supp. at 359. The district court distinguished Melendez v. City of Philadelphia, 320 Pa. Super. 59, 466 A.2d 1060 (1981), a case setting out state-law prerequisites for a special relationship giving rise to a duty of protection that differ from the special relationship prerequisites announced in DeShaney. 728 F. Supp. at 359-60.\n\nFollowing the district court's denial of the City's motion for j.n.o.v. or a new trial, plaintiff moved for damages under Pennsylvania Rule of Civil Procedure 238. The district court awarded plaintiff these damages, rejecting the City's arguments that plaintiff was not entitled to them.\n\nThe City timely appealed, raising a plethora of arguments for reversing the district court's decisions denying its motion for j.n.o.v. or a new trial and granting plaintiff's request for delay damages. We have jurisdiction, pursuant to 28 U.S.C. § 1291, over the City's appeal from the district court's final judgment.\n\nII. WAS THE CITY ENTITLED TO J.N.O.V. WITH RESPECT TO PLAINTIFF'S FEDERAL CLAIMS?\n\nA. Did the City Waive its Inconsistency Objection to the § 1983 Verdicts?\n\nThe City contends on appeal that we must reverse the district court's denial of its motion for j.n.o.v. because the jury's section 1983 verdicts with respect to Panati and the City are fatally inconsistent. The City argues that the district court erred in failing to find inconsistency in the jury's verdicts (1) that Panati merely was negligent in his treatment of Simmons, but (2) that the City violated Simmons's constitutional rights. The crux of the City's contention is that the district court's section 1983 judgment against it cannot stand in light of the jury's finding that Panati inflicted no constitutional harm upon Simmons. The City grounds this argument in Williams v. Borough of West Chester, 891 F.2d 458, 467 (3d Cir. 1989), in which we concluded that a municipality cannot be held liable under section 1983 for violating an individual's civil rights as a result of a municipal policy or practice unless one of the municipality's employees \"is primarily liable under section 1983 itself.\"\n\nAccording to plaintiff, however, the City was required to object to any inconsistency in the jury's responses to the district court's special interrogatories at the time that the responses were read, so that the judge could have cured any defect in the verdict slip prior to dismissing the jury. Although plaintiff does not frame her procedural argument in these terms, she in substance contends that an objection prior to the dismissal of the jury is required either by Federal Rule of Civil Procedure 49, governing special verdicts and interrogatories, or by our jurisprudence construing this rule.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nRule 49 provides the district courts with two basic alternatives to the general jury verdict. Rule 49(a), governing special verdicts, provides that a court may have a jury return its verdict in the form of written responses to separate questions concerning the factual issues in dispute.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Rule 49(b) provides that a court may employ the somewhat different procedure of requesting that a jury both return a general verdict and respond to written interrogatories concerning the factual determinations upon which that verdict rests.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Whereas Rule 49(a) is mute on the subject of inconsistency in the jury's special verdicts, Rule 49(b) provides that \"when the answers [to interrogatories] are inconsistent with each other and one or more is likewise inconsistent with the general verdict, judgment shall not be entered, but the court shall return the jury for further consideration of its answers and verdict or shall order a new trial.\"\n\nThe prerequisites for preserving the right to raise on appeal an objection to the inconsistency of verdicts rendered under Rules 49(a) and 49(b) are the subject of considerable disagreement among the courts of appeals. Most, although not all, courts of appeals have interpreted the provision in Rule 49(b) for resubmitting an inconsistent verdict and interrogatories to the jury to require that any objection to the jury's findings on the grounds of inconsistency be made -- or else waived -- before the jury is discharged. 5A J. Moore \u0026 J. Lucas, Moore's Federal Practice para. 49.04, at 49-62 to 49-64 (2d ed. 1991) (compiling cases). There is far less agreement among the circuits, however, on whether a party must, under Rule 49(a), object prior to the jury's dismissal to a perceived inconsistency in the jury's responses to special verdict interrogatories. See Bates v. Jean, 745 F.2d 1146, 1150 (7th Cir. 1984) (generally noting conflict among circuits); Note, Resolving Inconsistencies in Federal Special Verdicts, 53 Fordham L. Rev. 1089, 1100-01 (1985) (surveying the conflicting circuit law on the requirements for preserving an objection to inconsistent verdicts rendered under Rule 49(a)).\n\nIn this circuit, it probably is necessary, as it is in the majority of the circuits, to raise prior to the jury's dismissal an objection based on the inconsistency of the answers to interrogatories supporting a general verdict rendered under Rule 49(b). See Walker v. Sinclair Refining Co., 320 F.2d 302, 305 (3d Cir. 1963) (holding that reversal of district court's judgment was unwarranted, notwithstanding possible contradiction in interrogatory answers, because contradiction was not raised before the district court or on appeal); cf. Scott v. Plante, 641 F.2d 117, 124-25 (3d Cir. 1981) (where defendants did not object to form of interrogatories either before or after verdict and did not argue on appeal that they were prejudiced thereby, jury's responses to interrogatories must be read with a view toward their reconciliation), vacated on other grounds, 458 U.S. 1101, 102 S. Ct. 3474, 73 L. Ed. 2d 1362 (1982). It is clear, however, that, in order to preserve the objection on appeal, it is not necessary in this circuit for a party, prior to the district court's dismissal of the jury, to lodge an inconsistency objection to special verdicts rendered under Rule 49 (a). See Malley-Duff \u0026 Associates v. Crown Life Insurance Co., 734 F.2d 133, 144-45 (3d Cir.) (distinguishing verdicts rendered under Rule 49(a) from verdicts rendered under 49(b) and holding that, in the case of a verdict rendered under Rule 49(a), appellate review is not precluded by absence of objection before discharge of jury), cert. denied, 469 U.S. 1072, 105 S. Ct. 564, 83 L. Ed. 2d 505 (1984). In order to ascertain whether plaintiff is correct in asserting that the City has waived its inconsistency objection, it therefore is necessary to determine whether the jury's verdict was rendered under Rule 49(a) or 49(b).\n\nUnfortunately, simply juxtaposing the verdict sheet submitted to the jury in this case, see supra typescript at 18 n. 6, with the language of Rule 49 sheds little light on whether the district court's questions frame special verdicts under Rule 49(a) or interrogatories accompanying a general verdict under Rule 49(b). Rule 49(a) describes the special verdict that it permits as \"a special written finding upon each issue of fact.\" In contrast, the written findings that the district court requested from the jury -- for example, \"Indicate whether or not you find that under the law of Pennsylvania the defendant City of Philadelphia committed torts against the decedent\" -- seem to require conclusions combining facts with law, thereby constituting a species of general verdict. The district court's questions to the jury, however, do not seem strictly to comprise, under Rule 49(b), \"written interrogatories upon . . . issues of fact\" together with a request for a general verdict, at least as that term commonly is defined as \"[a] verdict whereby the jury finds either for the plaintiff or for the defendant in general terms.\" Black's Law Dictionary 1560 (6th ed. 1990).\n\nThe conundrum posed by juxtaposing the district court's verdict sheet with Rule 49, however, is more apparent than real. We have held, implicitly if not explicitly, that special verdicts under Rule 49(a) may, like the findings rendered by the jury in this case, constitute findings of fact that actually blend factual with legal conclusions. See, e.g., Malley-Duff, 734 F.2d at 144 n. 3, 145 (jury's responses to interrogatories asking, for example, whether one party \"tortiously interfered\" with the contractual rights of another or \"conspired with the specific intent to inflict injury upon the plaintiff\" constituted special verdicts governed by Rule 49(a)); Scott, 641 F.2d at 124 (jury's responses to interrogatories concerning, for example, proximate causation and whether plaintiff had been deprived of due process constituted \"special verdict interrogatories\"); see also Brodin, Accuracy, Efficiency, and Accountability in the Litigation Process -- The Case for the Fact Verdict, 59 U. Cin. L. Rev. 15, 85-87 (discussing Simone v. Golden Nugget Hotel \u0026 Casino, 844 F.2d 1031 (3d Cir. 1988), as example of case employing special verdicts to divide dispute into \"ultimate\" facts, each of which actually requires a legal, as well as a factual, determination).\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nUnder our prior decisions it is clear that, in determining whether a verdict has been rendered under Rule 49(b), as opposed to Rule 49(a), a court need not limit its inquiry to the specific form of the interrogatories framed within the four corners of the verdict sheet. In my opinion, our prior decisions make clear that we must look, rather, to the totality of the district court's instructions, determining whether the court instructed the jury, either verbally or in writing, to make a general finding for the plaintiff or the defendant, in addition to findings of actual or ultimate facts. See, e.g., McLaughlin v. Fellows Gear Shaper Co., 786 F.2d 592, 595 n. 2 (3d Cir. 1986) (in determining that jury rendered verdict under Rule 49(b), court looked to district court's expressed intent that the jury conform its verdict to the framework of Rule 49(b)); Stanton by Brooks v. Astra Pharmaceutical Products, 718 F.2d 553, 574-75 (3d Cir. 1983) (in concluding that jury rendered verdict under Rule 49(b), as opposed to 49(a), district court's instructions, which cohered with the mandate of Rule 49(b), were determinative).\n\nIn this case, the interrogatories submitted to the jury are strikingly similar to interrogatories that this court has decided comprised special verdict interrogatories under Rule 49(a). Compare supra typescript at 18 n. 6, with Malley-Duff, 734 F.2d at 144 n. 3; Scott, 641 F.2d at 124. More importantly, however, I can discern no expressed intent on the part of the district court -- in its jury instructions or otherwise -- that the jury should conform the verdict in this case to Rule 49(b). I conclude, therefore, that the jury rendered special verdicts governed by Rule 49(a) and that the City need not have objected, prior to the dismissal of the jury, to any inconsistency in these verdicts in order to have preserved, on appeal, its contention that it was entitled to j.n.o.v. on this ground.\n\nB. The Alleged Inconsistency of the Verdicts; the Requisites for Establishing a Municipality's Direct Liability for a Policy or Custom and Failure to Train; and (More On) Waiver\n\n1. The Alleged Inconsistency of the Verdicts\n\nIn contending, based on Williams, 891 F.2d at 467, that the jury's section 1983 verdicts must be viewed as inconsistent, the City in essence argues that an employee's primary liability for a constitutional tort is a prerequisite to municipal liability for a constitutional violation arising either from a policy or custom or from a failure to train. The district court concluded that this argument, even if properly preserved, was groundless. In arriving at this conclusion, the district court emphasized the Supreme Court's holding in Monell, 436 U.S. at 694, 98 S. Ct. at 2037-38, that local governing bodies, although not subject to respondeat superior liability, may be sued directly under section 1983 for constitutional injuries arising from the implementation of municipal policies or customs. In the district court's view, the jury separately ascertained Panati's and the City's section 1983 liability and concluded that, although Panati negligently served as a causal conduit of Simmons's injury, the City, through its own policy, custom, or training procedures, directly -- and with deliberate indifference -- violated Simmons's constitutional rights. 728 F. Supp. at 357. The district court thus concluded that plaintiff sufficiently established the City's section 1983 liability without showing that Panati -- or any other municipal actor -- was also primarily liable under section 1983. See id.\n\nPlaintiff's reasoning on appeal with respect to the merits of the City's consistency contention diverges somewhat from that of the district court. Plaintiff urges that predicating a municipality's section 1983 liability on a municipal employee's primary liability under the statute would contravene public policy. Plaintiff argues, in terrorem, that \"if the Court were to adopt the City's rationale, any municipality could insulate itself from liability by merely failing to train its employees.\" Appellee's Br. at 33. Plaintiff's contention, at bottom, appears to be that no form of municipal liability under section 1983 may be conditioned on the primary liability of any individual acting on the municipality's behalf.\n\nThe City's, the district court's, and plaintiff's varying views of the jury's section 1983 verdicts are symptomatic of their deeper divergences concerning the elements that must be established in order to subject a municipality to liability under section 1983 for an unconstitutional policy or custom and a failure to train its employees. In order to determine whether the verdicts are consistent, it is, in my opinion, necessary to survey the jurisprudence concerning the predicates to a municipality's direct liability under section 1983.\n\n2. The Predicates to a Municipality's Direct\n\nLiability for a Policy, Custom, or Failure to Train\n\nAs I have noted, plaintiff argued at trial that the City violated Simmons's constitutional rights by means of its policy or custom with respect to intoxicated and potentially suicidal detainees. In order to prove her theory, plaintiff sought to establish, as I conclude infra she must have, that this policy or custom evinced deliberate indifference to these detainees' serious medical needs. The elements of the City's section 1983 liability under this theory are rooted in the Supreme Court's decisions in both Monell and City of Canton.\n\nIn Monell, as the district court emphasized, the Supreme Court held that although local governments cannot be held liable under section 1983 on a theory of respondeat superior, they may be directly subject to section 1983 liability as a result of an official policy or custom. 436 U.S. at 694, 98 S. Ct. at 2037-38. The Monell Court defined a municipal policy as a \"statement, ordinance, regulation, or decision officially adopted and promulgated by [a local governing] body's officers.\" Id. at 690, 98 S. Ct. at 2036. The Court characterized a municipal custom, which lacks the formal approval of a policy, as \"'such practices of state officials . . . [as are] so permanent and well settled as to constitute a \"custom or usage\" with the force of law.'\" Id. at 691, 98 S. Ct. at 2036 (quoting Adickes v. S.H. Kress \u0026 Co., 398 U.S. 144, 167-68, 90 S. Ct. 1598, 1613, 26 L. Ed. 2d 142 (1970)). Further explicating the elements of direct municipal liability under section 1983, the Monell Court concluded that \"it is when execution of a government's policy or custom, whether made by its lawmakers or by those whose edicts or acts may fairly be said to represent official policy, inflicts the injury that the government as an entity is responsible.\" Id. at 694, 98 S. Ct. at 2037-38.\n\nMonell therefore requires that plaintiff, in order to establish her claim that the City violated Simmons's due process rights by means of a municipal policy of deliberate indifference to the serious medical needs of suicidal detainees, must have shown that this indifference resulted either from a decision officially adopted and promulgated or from a permanent and well-settled practice. Monell 's holding also suggests that plaintiff, as an element of establishing the City's policy or custom of deliberate indifference, must have presented evidence of such indifference on the part of lawmakers or other officials with the authority to make municipal policy.\n\nIn City of Canton v. Harris, 489 U.S. 378, 109 S. Ct. 1197, 103 L. Ed. 2d 412 (1989), the Supreme Court, in a decision relevant to both plaintiff's municipal policy or custom and failure to train theories of the City's liability, held that a municipality's failure to train its police officers can give rise to a constitutional violation only when that failure \"amounts to deliberate indifference to the rights of persons with whom the police come into contact.\" Id. at 1204. The City of Canton Court, however, only partly articulated the elements of establishing the deliberate indifference standard that it enunciated. Rather, as the City emphasizes, the City of Canton Court defined the standard in the negative, holding that a municipality's deliberately indifferent failure to train is not established by (1) presenting evidence of the shortcomings of an individual; (2) proving that an otherwise sound training program occasionally was negligently administered; or (3) showing, without more, that better training would have enabled an officer to avoid the injury-causing conduct. Id. at 1206.\n\nPlacing some flesh on the bones of the standard, City of Canton emphasized the nexus between deliberate indifference and the municipal policy or custom on which the Monell Court conditioned the direct liability of a local governmental entity under section 1983. City of Canton did so by quoting from the plurality decision in Pembaur v. City of Cincinnati, 475 U.S. 469, 106 S. Ct. 1292, 89 L. Ed. 2d 452 (1986) -- the first in the Supreme Court's trio of decisions\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e that expand on Monell's requirements for establishing direct municipal liability in the context of a single municipal decision to take unconstitutional action. 109 S. Ct. at 1205. The City of Canton Court reasoned that only when a municipality's failure to train is tainted by a deliberate indifference to constitutional rights can that failure rise to the level of a municipal policy or custom -- that is, \"'a deliberate choice to follow a course of action . . . made from among various alternatives' by city policymakers.\" Id. (quoting Pembaur, 475 U.S. at 483-84, 106 S. Ct. at 1300). Further merging the deliberate indifference standard with Monell 's municipal policy or custom requirement, the Court held that \"only where a failure to train reflects a 'deliberate' or 'conscious' choice by a municipality -- a 'policy' as defined by our prior cases -- can a city be liable for such a failure under § 1983.\" Id.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nCity of Canton, similarly to Monell, therefore appears to require that a plaintiff, in order to meet the deliberate indifference standard for directly subjecting a municipality to section 1983 liability, must present scienter-like evidence of indifference on the part of a particular policymaker or policymakers.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Such a requirement would tend to support the City's contention, based on Williams, that the primary liability of an actual person -- namely, a municipal employee -- is a predicate to holding a municipality liable under section 1983. It is necessary to look to the Supreme Court's trio of cases beginning with Pembaur, however, to determine whether Monell, as both that opinion and Canton suggest, in fact requires a plaintiff to present scienter-like evidence with respect to specific municipal policymakers as an element of establishing a deliberately indifferent policy, custom, or failure to train.\n\nIn Pembaur, the first case in this trio, the Supreme Court, in a plurality opinion, determined that, although for purposes of section 1983 liability Monell 's municipal policy or custom requirement \"was intended to distinguish acts of the municipality from acts of employees,\" unconstitutional actions cannot be diffusely attributed to a municipality as an abstract entity. 475 U.S. at 479, 106 S. Ct. at 1298 (emphasis in original). Instead, Monell \"expressly envisioned\" that municipal liability under section 1983 would be predicated on official policies established by legislators or by \"other officials 'whose acts or edicts may fairly be said to represent official policy.'\" Id. at 480, 106 S. Ct. at 1299 (quoting Monell, 436 U.S. at 694, 98 S. Ct. at 2037-38). The Pembaur plurality concluded that whether an official has the authority to formulate a municipality's official policy is a matter of state law. Id. at 483, 106 S. Ct. at 1300.\n\nCity of St. Louis v. Praprotnik, 485 U.S. 112, 108 S. Ct. 915, 99 L. Ed. 2d 107 (1988), the second decision in the trio, confirmed and expanded on Pembaur 's conclusion that a municipal policy cannot be established absent evidence of scienter attending the decisionmaking of particular officials. In Praprotnik, the Supreme Court, once again in a plurality opinion, noted that Monell is animated by the awareness that \"governmental bodies can act only through natural persons\" and reiterated Pembaur 's criteria for directly subjecting a municipality to section 1983 liability.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Id. at 923. The Praprotnik plurality firmly rejected the argument that municipal policymakers should be defined broadly to include officials other than those on whom state law specifically confers policymaking authority in the area at issue. Id. at 928. The plurality also emphasized that it should not be left to juries to decide which officials' decisions should subject a municipality to section 1983 liability. Id.\n\nIn Jett v. Dallas Independent School District, 491 U.S. 701, 109 S. Ct. 2702, 105 L. Ed. 2d 598 (1989), the final case in the trio, the plurality positions in Pembaur and Praprotnik finally acquired the status of a majority opinion. In Jett, which was decided shortly before the case sub judice went to trial, a majority of the Supreme Court approved the foregoing teachings of Pembaur and Praprotnik and held that there are two preconditions to a municipality's ultimate liability under section 1983. First, the district court must identify the officials or governmental bodies that have final policymaking authority for the local government assertedly liable for a constitutional violation by \"reviewing the relevant legal materials, including state and local positive law, as well [as] '\"custom or usage\" having the force of law.'\" Id. at 2723 (citation omitted). Second, once the district court has identified the relevant policymakers, the jury must determine whether these individuals have, through their decisions, \"caused the deprivation of rights at issue by policies which affirmatively command that it occur or by acquiescence in a long-standing practice or custom which constitutes the 'standard operating procedure' of the local governmental entity.\" Id. (citation omitted). In Jett, therefore, the Supreme Court held that even when a plaintiff alleges that a municipal custom or practice, as opposed to a municipal policy, worked a constitutional deprivation, the plaintiff must both identify officials with ultimate policymaking authority in the area in question and adduce scienter-like evidence -- in this case of acquiescence -- with respect to them.\n\nIn my opinion, reading Monell and Canton in light of the Pembaur trio resolves the ostensible inconsistency in the jury's section 1983 verdicts in this case and reveals that the district court's, the City's, and plaintiff's differing perspectives on whether employee liability is a prerequisite to establishing a municipality's section 1983 liability, although ultimately incomplete, are complementary, rather than mutually exclusive. I believe that the district court and plaintiff are correct in reasoning that plaintiff need not have established deliberate indifference on the part of Panati. Further, I believe that the City is correct insofar as it contends that plaintiff, in order to prove either her municipal policy or custom or her failure to train theory, must have adduced evidence of scienter on the part of a municipal actor. In my opinion, however, under the Pembaur trio, and Jett in particular, the scienter-type evidence must have been adduced with respect to a high-level official determined by the district court, in accordance with local law, to have final policy making authority in the areas in question.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Because Panati, a low-level employee, is not the City actor whose primary section 1983 liability must have been established as a predicate to subjecting the City to section 1983 liability for a policy or custom or a failure to train, I find no inconsistency in the jury's section 1983 verdicts in this case.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nI believe that this analysis of the prerequisites for establishing a municipal policy or custom and a failure to train comports with the relevant jurisprudence. I think, first, that the foregoing analysis is consistent with our conclusion in Williams, based on City of Los Angeles v. Heller, 475 U.S. 796, 106 S. Ct. 1571, 89 L. Ed. 2d 806 (1986) (per curiam), that the primary liability of a municipal employee under section 1983 -- as opposed to the primary liability of an official with policymaking authority -- was a prerequisite to the section 1983 liability of the municipality itself. See 891 F.2d at 467. I think that our conclusion in Williams in substance expresses our essential determination here that, absent the conscious decision or deliberate indifference of some natural person, a municipality, as an abstract entity, cannot be deemed to have engaged in a constitutional violation by virtue of a policy, a custom, or a failure to train.\n\nWilliams, moreover, posed a problem distinct from that in this case. In Williams, the plaintiffs predicated a municipality's liability, as does plaintiff in this case, on the municipality's alleged unconstitutional policy or custom of inadequately caring for suicidal detainees and its deliberate indifference in failing to train officers who dealt with them. The issue in Williams was whether plaintiffs could proceed to trial on their section 1983 claim against the municipality in the face of insubstantial evidence of any violation of the decedent's constitutional rights at the hands of the defendant police officers or otherwise. Id. The plaintiffs in Williams -- in contrast to plaintiff in this case -- neither alleged nor adduced any evidence to establish that the municipality, through its policies or its deliberate indifference, directly violated their decedent's constitutional rights.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Id. With the case in that posture, we determined that the municipality was entitled to summary judgment, emphasizing the Supreme Court's holding in Heller that the constitutionality of a police department's regulations is irrelevant in the absence of a constitutional injury causally related to those regulations. Id.\n\nI think, moreover, that my analysis of the elements of establishing a municipal policy or custom and deliberate indifference coheres with our reasoning in Andrews v. City of Philadelphia, 895 F.2d 1469 (3d Cir. 1990), which we decided shortly after the Supreme Court announced its opinion in Jett. In Andrews, female officers in the City's police department brought a section 1983 action against the Police Commissioner, among others, alleging that the department had a policy or custom of sexual harassment that violated their constitutional right to equal protection. Id. at 1471. We applied Pembaur, Praprotnik, and Jett in determining the elements of establishing an unconstitutional municipal policy or custom and determined that neither could be established absent conscious decisionmaking or acquiescence in a long-standing custom or practice on the part of a policymaker. Id. at 1481 (\"even in 'custom' type cases, it is impossible on the delivery of a kick to inculpate the head [or municipality] and find no fault with the foot [or policymaker]\"). Because the jury had found that the Police Commissioner, whom we determined to be the relevant policymaker, was not liable under section 1983, we concluded that the district court properly had granted the City's motion for j.n.o.v. in that case. Id.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nIn sum, based on Monell, Canton, and the Supreme Court's Pembaur trio, as well as on our decisions in Williams and in Andrews, I conclude that plaintiff, in order to have subjected the City to section 1983 liability under each of her theories, must have established the following. In order to establish the City's liability under her theory that Simmons's rights were violated as a result of a municipal policy or custom of deliberate indifference to the serious medical needs of intoxicated and potentially suicidal detainees, plaintiff must have shown that the officials determined by the district court to be the responsible policymakers were aware of the number of suicides in City lockups and of the alternatives for preventing them, but either deliberately chose not to pursue these alternatives or acquiesced in a long-standing policy or custom of inaction in this regard.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e As a predicate to establishing her concomitant theory that the City violated Simmons's rights by means of a deliberately indifferent failure to train, plaintiff must similarly have shown that such policymakers, likewise knowing of the number of suicides in City lockups, either deliberately chose not to provide officers with training in suicide prevention or acquiesced in a long-standing practice or custom of providing no training in this area. As I discuss, infra typescript at 55-56, plaintiff in my opinion additionally must establish, with respect to each of her theories, that the City's affirmative or acquiescent election to take no measures to prevent suicides caused one or more of its police officers to neglect Simmons's serious medical needs, thereby causing his constitutional injury.\n\n3. More on Waiver\n\nIt is clear from the record that plaintiff never requested the district court to determine, by reference to local law, which City officials had final policymaking authority over the procedures for and the training of City police officers in the handling of detainees in City lockups at the time of Simmons's death. My examination of the record also reveals that plaintiff failed to adduce any scienter-like evidence showing that such officials: (1) consciously chose, in the face of the number of suicides in City lockups and the alternatives for preventing them, to institute no preventive training or other measures; or (2) acquiesced in a practice of providing turnkeys with no training or other means of preventing suicides, despite knowledge of the past suicides in City lockups and the consequent likelihood that future suicides would occur. The trial testimony of plaintiff's expert and other witnesses, implied, but did not directly establish, such conscious decisionmaking or acquiescence on the part of specific responsible policymakers. I note in this connection that plaintiff moved and was granted permission to withdraw her action against Police Commissioner Sambore before her case went to trial. See supra typescript at 8.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nIt also is clear from the record, however, that the City never argued before the district court that plaintiff, through neglecting to identify the responsible policymakers and to provide evidence of either their decisionmaking or their acquiescence in a long-standing practice with respect to the training of turnkeys and the handling of detainees, failed to establish this essential \"scienter\" element of her section 1983 case. The City did not ground either its motion for a directed verdict or its motion for j.n.o.v. on this specific failure on plaintiff's part. Neither does the City contend on appeal -- at least with any specificity -- that plaintiff's failure to establish this essential \"scienter\" element of her case constitutes grounds for reversing the district court's judgment on the jury's verdict against it.\n\nWe recently emphasized, in Brenner v. Local 514, United Brotherhood of Carpenters, 927 F.2d 1283, 1298 (3d Cir. 1991), the well-established rule that \"failure to raise an issue in the district court constitutes a waiver of the argument.\" We concluded that reversing the judgment of the district court on the basis of a theory that the plaintiffs had failed to raise before it would contravene this long-standing waiver rule. Because the plaintiffs also had failed to raise the theory at issue on appeal, we further concluded that our consideration of that theory would vitiate the requirement of the Federal Rules of Appellate Procedure and our own local rules that, absent extraordinary circumstances, briefs must contain statements of all issues presented for appeal, together with supporting arguments and citations. Id. (citing Fed. R. App. P. 28(a)(1)-(3) and Third Circuit Rule 21(1)(A)(d)); see also Institute for Scientific Information v. Gordon \u0026 Breach Science Publishers, Inc., 931 F.2d 1002, 1011, 18 U.S.P.Q.2D (BNA) 1527 (3d Cir. 1991) (district court's dismissal of one of plaintiff's claims was not appealable, because dismissal was not challenged, as required by Fed. R. App. P. 28(a)(2)-(4), anywhere in plaintiff's brief).\n\nIt might be argued that one or more of the issues that the City has preserved encompasses the particular contention that plaintiff failed to establish the \"scienter\" element of her section 1983 case against the City, thus rendering that contention appealable. As we have discussed, the City was entitled to raise the issue of the consistency of the jury's verdicts on appeal. Through challenging the sufficiency of plaintiff's evidence in its motion for a directed verdict, its motion for j.n.o.v., and its appellate brief, the City has properly preserved this contention, as well. I do not think, however, that either of these contentions fairly can be interpreted to have encompassed, and thereby to have preserved, the particular argument that plaintiff failed to establish the \"scienter\" element of her section 1983 case against the City. Under the specificity requirements of Federal Rule of Appellate Procedure 28 and Third Circuit Rule 21, a passing reference to an issue in a brief will not suffice to bring that issue before this court on appeal. See Lunderstadt v. Colafella, 885 F.2d 66 (3d Cir. 1989) (brief mention of issue did not suffice, under Fed. R. App. P. 28(a)(2) \u0026 (4), to present issue on appeal); Jackson v. University of Pittsburgh, 826 F.2d 230 (3d Cir. 1987) (same). In Frank v. Colt Industries, 910 F.2d 90 (3d Cir. 1990), moreover, we squarely addressed the issue whether general arguments raised before the district court and on appeal were sufficient to frame a specific theory of the case that the defendant had not previously presented. We concluded that, although it was conceivable that the defendant's previous arguments logically incorporated his new theory, \"particularly where important and complex issues of law are presented, a far more detailed exposition of argument is required to preserve an issue.\" Id. at 100 (citing Fed. R. App. P. 28(a)(4)).\n\nFurther, I can ascertain no extraordinary circumstances, see Brenner, 927 F.2d at 1298, to justify reversing the district court's denial of the City's motion for j.n.o.v., based on plaintiff's failure to establish an essential element of her section 1983 case against the City. As I have noted, see supra typescript at 37, Jett, the final case in the Supreme Court's Pembaur trio, was decided shortly before this case went to trial. If the Jett decision alone was not sufficient to put the City on notice of the scienter requirements for establishing a section 1983 case premised on a municipal policy, custom, or failure to train employees, I think that the Supreme Court's plurality decisions in Pembaur and Praprotnik, as well as our own jurisprudence in this area, amply presaged the requirements spelled out by the Jett majority. I therefore conclude that the City has waived the argument that the district court's judgment on the jury's section 1983 verdict against the City must be reversed because plaintiff failed to establish an essential element (scienter) of her case.\n\nC. The Sufficiency of the Evidence\n\nI have concluded that the City has preserved in part its contention that plaintiff adduced insufficient evidence to support her section 1983 claim against it. In light of the City's waiver at both trial and appellate levels of the argument that plaintiff failed to establish the essential \"scienter\" element of her case, I additionally conclude that, in weighing the sufficiency of the evidence, we must assume: (1) that some responsible City policymaker was aware of the number of suicides each year in City lockups and of the availability of training and other alternatives, such as physical feature changes and specific suicide-prevention directives for officers, likely to prevent them; and (2) that this policymaker(s) either deliberately chose to take no preventive measures or acquiesced in a long-standing practice or custom of inaction with respect to the prevention of suicides in City lockups. I believe that were we to weigh the sufficiency of the evidence as to these two scienter-like elements of plaintiff's section 1983 claim against the City, we would, in effect, permit the City, under the rubric of its challenge to the sufficiency of the evidence, to raise the issue whether plaintiff has established these elements of her case -- the very theory of appealability that I have rejected as inconsistent with our well-established rules of waiver and appellate procedure.\n\nThe focus of my inquiry therefore is narrowed to the remaining \"duty\" and \"causation\" elements of plaintiff's case. I believe that the essential question that must be asked, with respect to plaintiff's municipal policy or custom and failure to train theories of the City's liability, is whether the evidence is sufficient to establish that the City policymakers' chosen or acquiescent course of instituting no suicide prevention measures (1) rose to the level of a breach of its constitutional duty to intoxicated and potentially suicidal detainees that (2) caused Simmons's suicide.\n\nThe evidence with respect to these remaining elements of plaintiff's section 1983 case against the City clearly must be weighed in a highly deferential manner. In determining whether the district court erred in denying the City's motion for judgment notwithstanding the section 1983 verdict, \"we must review the record in the light most favorable to the non-moving party . . . and 'affirm the judgment of the district court denying the motion [] unless the record is critically deficient of the minimum quantum of evidence from which a jury might reasonably afford relief.'\" Kinnel v. Mid-Atlantic Mausoleums, Inc., 850 F.2d 958, 961 (3d Cir. 1988) (citation omitted); see also Clark v. Township of Falls, 890 F.2d 611, 617 (3d Cir. 1989) (same).\n\n1. Standards for Determining Whether the City Breached a Constitutional Duty to Intoxicated and Potentially Suicidal Detainees\n\nThe inquiry into the sufficiency of the evidence that the City, by means of a municipal policy or custom or a failure adequately to train its officers, breached a constitutional duty to intoxicated and potentially suicidal detainees such as Simmons poses complex questions, because the injury to the victim was not directly inflicted by officials acting under color of state law. Under the Supreme Court's decision in DeShaney, 109 S. Ct. at 1005-06, as well as our own decisions, see Brown v. Grabowski, 922 F.2d 1097, 1113-16 (3d Cir. 1990), cert. denied, 115 L. Ed. 2d 997, 111 S. Ct. 2827 (1991); Commonwealth Bank \u0026 Trust Co. v. Russell, 825 F.2d 12, 17 (3d Cir. 1987), a local governmental entity has no duty to protect individuals who are not in custody from either self-inflicted violence or the violent acts of persons who are not officials acting under the color of state law.\n\nBecause pretrial detainees such as Simmons are in custody, however, it is clear that a municipality has a constitutional duty to provide them with some quantum of care and protection. In Colburn v. Upper Darby Township, 838 F.2d 663, 668 (3d Cir. 1988), cert. denied, 489 U.S. 1065, 109 S. Ct. 1338, 103 L. Ed. 2d 808 (1989), (\" Colburn I \") we surveyed the jurisprudence concerning the constitutional rights of pretrial detainees and convicted prisoners.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e This court concluded that \"[a] detainee is entitled under the Due Process Clause of the Fourteenth Amendment to, at a minimum, no less protection for personal security than that afforded convicted prisoners under the Fourteenth Amendment and no less a level of medical care than that required for convicted prisoners by the Eighth Amendment.\" Id. Our conclusion in Colburn I concerning the constitutional rights of pretrial detainees encompassed our previous determination, see, e.g., Boring v. Kozakiewicz, 833 F.2d 468, 471 (3d Cir. 1987), cert. denied, 485 U.S. 991, 108 S. Ct. 1298, 99 L. Ed. 2d 508 (1988); Inmates of Allegheny City Jail v. Pierce, 612 F.2d 754, 762 (3d Cir. 1979); Norris v. Frame, 585 F.2d 1183, 1187 (3d Cir. 1978), that the fourteenth amendment imposes on local governmental actors the same duty to provide medical care for pretrial detainees that the eighth amendment imposes with respect to convicted prisoners: the duty not to engage in \"acts or omissions sufficiently harmful to evidence deliberate indifference to serious medical needs.\" Estelle v. Gamble, 429 U.S. 97, 106, 97 S. Ct. 285, 292, 50 L. Ed. 2d 251 (1976).\n\nIn Colburn I, this court took note of Judge Wisdom's reasoning in Partridge v. Two Unknown Police Officers of Houston, 791 F.2d 1182, 1187 (5th Cir. 1986), that municipal defendants \"'had a duty, at a minimum, not to be deliberately indifferent'\" to the serious medical needs of a suicidal pretrial detainee. 838 F.2d 663. We concluded that the need for psychological or psychiatric treatment may amount to a serious medical need, particularly when that need arises from suicidal tendencies. Id. at 669 (quoting Partridge, 791 F.2d at 1187); see also Pierce, 612 F.2d at 763 (holding that Estelle v. Gamble 's deliberate indifference standard applies in evaluating constitutional adequacy of psychological or psychiatric care provided for pretrial detainees and convicted prisoners suffering from mental illnesses).\n\nIn light of Colburn I and the related jurisprudence concerning the rights of pretrial detainees, I think that the basic standard that must be applied in determining whether the City breached a constitutional duty toward intoxicated and potentially suicidal detainees by means of a municipal policy or custom is that which plaintiff has attempted to meet: whether the City was deliberately indifferent to the serious medical needs of this class of detainees.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e In applying this standard, however, I believe that it is necessary to consider that municipal officials often have to make difficult decisions concerning institutional security, as well as the allocation of resources to ensure the safety of the greatest number of municipal citizens. As the Supreme Court emphasized in Bell v. Wolfish, 441 U.S. 520, 562, 99 S. Ct. 1861, 1886, 60 L. Ed. 2d 447 (1979), a court faced with determining whether municipal officials have breached a constitutional duty to a class of pretrial detainees must be careful not to second guess \"the wide range of 'judgment calls' that meet constitutional and statutory requirements [and] are confided to officials outside of the Judicial Branch of Government.\"\n\nIn Bell, the Supreme Court considered the constitutionality of conditions of and restrictions resulting from pretrial confinement. The Court determined that when such conditions or restrictions involve deprivations of liberty under the fourteenth amendment, the conditions or restrictions are constitutionally violative only if they constitute punishment of the detainee. 441 U.S. at 535, 99 S. Ct. at 1872. The Bell Court in substance established a balancing test for determining whether confinement conditions or restrictions punish a pretrial detainee. Under Bell, a court must determine whether a confinement condition or restriction is punitive by weighing the evidence that it is intended to punish, purposeless, or arbitrary against the possibility that it is \"an incident of some other legitimate governmental purpose,\" such as \"maintaining institutional security and preserving internal order.\" Id. at 538, 546, 99 S. Ct. at 1873, 1878.\n\nI conclude, as did the Fifth Circuit in Partridge, that in the context of a section 1983 action alleging a municipal custom or policy of deliberate indifference to the serious medical needs of suicidal pretrial detainees, it is necessary to incorporate into the deliberate indifference standard the balancing consideration, derived from Bell, whether \"an intervening legitimate governmental objective\" exists for a decision, or an act tantamount to a decision, not to allocate resources to provide for the needs of this class of detainees.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Partridge, 791 F.2d at 1187; see Bell, 441 U.S. at 538, 99 S. Ct. at 1873 (\"A court must decide whether the disability [of pretrial detention] is imposed for the purpose of punishment or whether it is but an incident of some other legitimate governmental purpose.\").\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nLike her overarching theory that the City violated Simmons's constitutional rights by means of a policy or custom with respect to the medical needs of potentially suicidal detainees, plaintiff's closely related theory that the City violated Simmons's rights through failing to train its officers to detect and to meet those needs may implicate extra-judicial decisions concerning institutional security, the safety of municipal citizens, and resource allocation. I therefore think that the balancing consideration of an intervening governmental interest also must be applied in weighing the sufficiency of plaintiff's evidence that the City breached a constitutional duty in failing to train its officers.\n\nAs I have discussed, see supra typescript at 33-35, the standard for determining whether a municipality has breached a constitutional duty in failing to train its officers, like the standard for determining whether a municipality has breached a constitutional duty as a result of a policy or custom of inattention to detainees' medical needs, is one of deliberate indifference. Under City of Canton, it therefore is necessary to determine whether there is the minimum quantum of evidence in the record to support a jury conclusion that, in light of the duties assigned to officers responsible for detaining intoxicated persons, and turnkeys in particular, \"the need for more or different training [was] so obvious, and the inadequacy so likely to result in the violation of constitutional rights, that the policymakers of the city [could] reasonably be said to have been deliberately indifferent to the need.\" 109 S. Ct. at 1205.\n\nIn order for this court to sustain the jury's section 1983 verdict against the City, the record must, in my opinion, not only contain evidence of the City's breach of a constitutional duty toward a class of detainees, but also must contain evidence sufficient to establish that the breach of duty was causally related to the violation of Simmons's constitutional rights. With respect to plaintiff's policy or custom theory, the central inquiry is whether the record contains the minimum quantum of evidence from which the jury could conclude that City policymakers' deliberate or acquiescent election not to make physical feature alterations in City lockups, for example, or to institute specific procedures aimed at averting detainee suicides were the \"moving force\" behind a violation of Simmons's constitutional rights. Monell, 436 U.S. at 694, 98 S. Ct. at 2038. With respect to plaintiff's failure to train theory, the central inquiry, from the same evidentiary standpoint, is whether \"the failure to provide proper training . . . actually cause[d]\" Simmons's injury. Canton, 109 S. Ct. at 1205.\n\n2. The Sufficiency of the Evidence With Respect to\n\nPlaintiff's Municipal Custom or Policy Allegation\n\nI note at the outset that the question whether the record contains the minimum quantum of evidence from which the jury reasonably could conclude that the City was deliberately indifferent to the serious medical needs of intoxicated and potentially suicidal detainees lends itself to a misplaced emphasis on the probability of harm to an individual detainee. That misplaced emphasis is exemplified by the City's seemingly compelling argument that, in light of the extremely small statistical probability (.00015%) that Simmons, a particular intoxicated detainee, would attempt to commit suicide, plaintiff's evidence, even if viewed deferentially, cannot be sufficient to establish that the City was deliberately indifferent to his serious medical needs. This argument, however, misses the mark. Plaintiff's contention is not that the City showed deliberate indifference toward Simmons individually. Plaintiff, rather, sought to establish at trial that the City showed deliberate indifference toward the class of intoxicated and potentially suicidal pretrial detainees to which Simmons belonged and that this deliberate indifference toward the class caused a constitutional injury to Simmons individually.\n\nA brief statistical comparison exemplifies the error inherent in the City's -- and to some extent the dissent's -- misplaced emphasis on the probability that an individual intoxicated detainee will, in the absence of preventive measures, commit suicide, rather than on the injury suffered by the class of intoxicated and potentially suicidal detainees as a whole.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e As I previously have noted, the City essentially suggests that a plaintiff can prove that a municipality was deliberately indifferent to the serious medical needs of a suicidal detainee only by showing that a relatively high probability existed that each member of the relevant class would commit suicide. As I understand the City's argument, even evidence of 200 yearly suicides among the approximately 19,500 persons detained by the City each year for public intoxication might not suffice to establish a constitutional injury to an individual intoxicated detainee who committed suicide, because there would have been no more than a 1% probability of harm to this detainee. I think, however, that it is constitutionally untenable that the City could, without taking preventive measures, permit 200 individuals to kill themselves each and every year while in temporary police detention for the minor infraction of public intoxication. This is not to say that it would be constitutionally impermissible for the City, as a result of costs or other factors relating to a legitimate countervailing governmental interest, to tolerate some relatively smaller number of yearly suicides.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e I simply emphasize that an exclusive focus on probabilities of individual harm masks the reality that, across the entire group of intoxicated detainees, a predictable number of actual individuals will kill themselves each year as a result of suicidal tendencies that have not been attended to -- and that individual probabilities therefore are a misleading measure of the totality of the constitutional injury suffered by the particular group.\n\nAs I previously have explained, see supra typescript at 48-49, I think that it is necessary to assume that plaintiff has established that City policymakers (1) were aware of the average number of suicides occurring each year in City lockups, and (2) knew of the suicide prevention measures testified to by plaintiff's experts. With the case in this posture, the question, therefore, is whether the record is \"'critically deficient of the minimum quantum of evidence'\" from which the jury reasonably could have concluded that the failure of City policymakers to take any of those preventive measures amounted to deliberate indifference to the serious medical needs of intoxicated and potentially suicidal detainees. Kinnel, 850 F.2d at 961. Although the case is an extremely close one, I do not think that the record is so deficient of evidence to support the jury's verdict that the district court's decision denying the City's motion for j.n.o.v. must be reversed.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nSergeant Heran's statistical testimony at trial revealed that, in the years preceding Simmons's suicide, the average number of suicides among intoxicated pretrial detainees in City lockups -- approximately 3 from among an average of 19,500 persons detained each year for public intoxication -- was, relatively speaking, extremely small. Heran's trial testimony also revealed, however, that this average number represented suicides that had been occurring regularly over a period of at least five years and that, absent preventive measures, would be likely to continue to occur at roughly the same rate in the future.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Further, the testimony of plaintiff's experts, Rowan and Guy, suggested that closely monitoring intoxicated detainees, particularly those showing signs of hysteria and depression, was the prevailing practice nationwide and that the City had at least considered either making changes in lockup facilities or instituting procedures to provide for such monitoring. I therefore do not think that the record is critically deficient of evidence from which the jury could have concluded that the due process rights of intoxicated and suicidal pretrial detainees were at least implicated by the manner and conditions of their detention.\n\nPlaintiff's experts testified that the City could have taken a variety of measures to provide for the serious medical needs of intoxicated and suicidal detainees, thereby preventing future suicides. These measures included costly physical feature changes in lockups, such as \"suicide proofing\" cells and remodeling lockup facilities to locate the turnkey's work area within the cell block. However, they also included relatively inexpensive steps, such as installing audio and visual monitoring devices and promulgating and enforcing procedural directives specifically aimed at preventing suicides -- directives providing, for example, that an intoxicated detainee should under no circumstances be housed alone and that if a precinct cell block is empty, the detainee should be kept under restraint and observation in the processing area of the precinct station until transported elsewhere.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nAlthough the record shows that City police directives required officers to remove detainees' belts and shoelaces and, in order to forestall suicide attempts, to place detainees together in cells, the City presented no evidence, from which a legitimate countervailing governmental objective might have been inferred, to rebut either the efficacy or the feasibility of any of the other suicide prevention measures to which plaintiff's experts testified. The City presented no evidence, for example, that its policymakers had determined that physical feature changes in lockups were fiscally impossible or that it was necessary to allocate the City's financial resources differently. The City also presented no evidence that the relatively inexpensive suicide prevention measures discussed above actually would have proven to be too costly or would not have been effective in preventing suicides among intoxicated detainees.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nHad the record showed that the preventive measures available to the City all were quite costly, the evidence might be insufficient to establish that the City was deliberately indifferent to the serious medical needs of intoxicated and suicidal detainees. This is not to suggest that the traditional cost-benefit analysis of tort law is appropriate in the constitutional context. However, assuming knowledge on the City's part of all available measures, I think that the City's failure to implement costly measures to prevent an extremely small number of yearly suicides would yield a strong inference that City policymakers had made a constitutional \"judgment call\" concerning the allocation of City resources to ensure the safety and to protect the constitutional rights of the greatest number of its citizens. In other words, evidence that all available preventive measures were costly might justify an inference that the City had a legitimate countervailing governmental interest for electing not to implement additional suicide prevention measures, and thus might render the record critically deficient of evidence from which a jury reasonably could have concluded that the City was deliberately indifferent to the serious medical needs of intoxicated and potentially suicidal detainees.\n\nThat, however, is not this case. In light of the evidence concerning relatively inexpensive measures that the City might have taken to prevent suicides among intoxicated detainees, as well as the absence of any evidence from which a legitimate countervailing governmental interest for taking no preventive measures could be inferred, I cannot conclude that the record is crucially lacking in any evidence on which the jury could base a determination that the City was deliberately indifferent in failing to take steps to meet the serious medical needs of intoxicated and suicidal detainees.\n\nI also think that there is sufficient evidence in the record to support a jury conclusion that the City's deliberate indifference to the serious medical needs of intoxicated and suicidal detainees was, as Monell requires, the \"moving force\" behind a violation of Simmons's fourteenth amendment rights. It is undisputed that Simmons hung himself while intoxicated and alone in the Sixth Precinct cell block, during an interval between Panati's periodic inspections. Simmons's suicide was therefore the very type of suicide that preventive monitoring measures, ranging from audio-visual devices to directives instituting procedures to ensure that intoxicated detainees are not left alone, might well have prevented.\n\n3. The Sufficiency of the Evidence With Respect to Plaintiff's Failure to Train Theory\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nI have determined that the jury reasonably could have returned its section 1983 verdict against the City based on the conclusion that the City violated Simmons's rights by means of a custom or policy tainted by deliberate indifference to the serious medical needs of intoxicated detainees. I also think, however, that the record contains sufficient evidence to support a section 1983 verdict against the City based on plaintiff's corollary theory that the City violated Simmons's rights through a deliberately indifferent failure to train officers responsible for intoxicated detainees in suicide detection and prevention.\n\nDue to the extremely small number of suicides relative to the large number of intoxicated persons detained each year in City lockups, it is a close evidentiary question whether, consistent with City of Canton, 109 S. Ct. at 1205, \"the need for more or different training\" of officers responsible for these detainees would have been \"obvious\" to City policymakers, even assuming, as I must in light of the waiver principles I have discussed, that they knew of the suicides. Officer Panati and Sergeant Heran testified that City directives required officers to remove detainees' belts and shoelaces. In addition, Dr. Rowan testified that he had participated in a suicide-prevention training program for turnkeys in 1981. The City, however, introduced no evidence that it had undertaken to train all turnkeys in suicide prevention. It is clear from Heran's statistical testimony, moreover, that small numbers of suicides continued regularly to occur between 1980 and 1985. Further, the testimony of plaintiff's experts suggested that statistical profiles of the type of detainee likely to commit suicide were widely available and that police departments commonly trained officers responsible for detainees to recognize suicidal tendencies and to take preventive measures. See supra typescript at 11-13, 15-16. I therefore do not think that the record is utterly deficient of evidence from which reasonable jurors could conclude that the need to train officers in suicide detection and prevention should have been apparent to City policymakers.\n\nIt also is a close question whether there was sufficient evidence that the failure to provide police officers with training in suicide detection and prevention was, consistent with City of Canton, 109 S. Ct. at 1205, \"so likely to result in the violation of constitutional rights\" that the jury reasonably could conclude that the policymakers were deliberately indifferent to the serious medical needs of intoxicated and suicidal detainees. I think, however, that, absent evidence of a legitimate countervailing governmental interest, the jury could reasonably have concluded that the City's failure to provide the relevant training to all officers responsible for handling detainees would likely result in violations of intoxicated and suicidal detainees' fourteenth amendment rights, based on the record evidence that suicides among intoxicated detainees, although small in yearly numbers, were regular in occurrence. The testimony of plaintiff's experts suggested that relatively minimal training in the profile of a typical suicidal detainee, the known hours during which suicides were likely to occur, and the need for monitoring by officers or other inmates would have enabled turnkeys to prevent suicides among intoxicated detainees.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e The City, moreover, introduced no evidence, such as testimony that this training would have proved unworkable, ineffective, or too costly, from which a countervailing and legitimate governmental reason for electing not to provide the training could have been inferred.\n\nWith respect to whether the record contains the minimum quantum of evidence from which the jury could reasonably have inferred that the City's failure to train officers in suicide detection and prevention \"actually cause[d]\" Simmons's injury, City of Canton, 109 S. Ct. at 1205, I note that Panati testified that the only training that he might have received in suicide prevention occurred some twenty years prior to Simmons's suicide. Both of plaintiff's experts testified that Simmons, with the exception of race, fit the profiles compiled of a typical suicidal detainee. This testimony suggests that, had Panati received training in suicide detection and prevention, he likely would have realized the danger that Simmons posed to himself and, through monitoring or some other precautionary measure, could have averted Simmons's suicide.\n\nThe testimony of Simmons's stepbrother, Reginald Rosemond, that he was told by the officer who notified the family of Simmons's death that intoxicated detainees are high risk candidates to commit suicide while incarcerated corroborates, at least to some degree, the inference that Panati, with the benefit of some continuing training in suicide detection, could have prevented Simmons from killing himself.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e Based on all of this record evidence, I cannot conclude that the record is critically deficient of evidence on which the jury reasonably could have based the conclusion that the City's deliberately indifferent failure to train its officers was an actual cause of Simmons's death.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nI would for the foregoing reasons uphold the district court's decision denying the City's motion for judgment notwithstanding the jury's section 1983 verdict against it.\n\nIII. WAS THE CITY ENTITLED TO J.N.O.V. WITH RESPECT TO PLAINTIFF'S PENDENT STATE CLAIMS?\n\nA. Did the City Waive its Argument that Plaintiff\n\nFailed to Allege and Establish any Pendent State Claims?\n\nOn appeal, the City contends that we must reverse the district court's decision denying its motion for j.n.o.v. on plaintiff's pendent state claims for the reason it advanced in the district court in support of its motion for j.n.o.v. -- to wit, that plaintiff failed both to allege causes of action under state law and to adduce sufficient evidence to support them. As I have noted, see supra typescript at 19-20, the district court determined that the City had waived this argument for purposes of its motion for j.n.o.v. by failing to raise it in support of its Rule 50(a) motion for a directed verdict. The district court concluded that the only argument that the City had preserved in support of its motion for post-trial relief with respect to plaintiff's state claims was the argument that, because the state law prerequisites for a special relationship had not been met, the City and Panati had no duty to Simmons under Pennsylvania tort law. It therefore is necessary to determine whether the City has waived on appeal its overarching contention that plaintiff failed to state claims under Pennsylvania law and to muster sufficient evidence to support them.\n\nIt is clear under our jurisprudence that this court cannot reverse the district court's decision denying the City's Rule 50(b) motion for j.n.o.v. on the basis of an argument that the City failed to raise in support of its predicate Rule 50(a) motion for a directed verdict. See Abraham v. Pekarski, 728 F.2d 167, 172-73 (3d Cir.) (\"[A] Rule 50(b) motion for judgment notwithstanding the verdict may not be made on grounds that were not asserted in a motion for directed verdict.\"), cert. denied 467 U.S. 1242, 104 S. Ct. 3513, 82 L. Ed. 2d 822 (1984); cf. Lowenstein v. Pepsi-Cola Bottling Co. of Pennsauken, 536 F.2d 9 (3d Cir.) (holding that court may grant motion for j.n.o.v. only on basis of motion for directed verdict renewed at close of evidence and emphasizing that requirement avoids tactical victories at expense of substantive interests), cert. denied, 429 U.S. 966, 97 S. Ct. 396, 50 L. Ed. 2d 334 (1976).\n\nAs I have noted, see supra typescript at 17, the City moved for a directed verdict on the grounds set forth in its trial brief. In its trial brief, the City argued, with respect to plaintiff's state claims, that it and Panati had no duty to Simmons because no special relationship, as defined by Pennsylvania law, existed between Simmons and the police.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e I have carefully examined both the City's trial brief and the transcript of the trial proceedings to determine whether the City at any point or in any manner, prior to its motion for j.n.o.v., otherwise challenged the sufficiency of plaintiff's evidence or argued that plaintiff had failed to state a claim under Pennsylvania law on which relief could be granted. I can find no indication that it did so.\n\nI therefore conclude that the district court correctly determined that the City waived its argument that plaintiff failed to allege or establish any pendent state claims. For that reason, I also must conclude that the City has waived this argument on appeal. Although this conclusion may appear unduly technical or harsh, I believe that it is required by the same seventh amendment concerns that we discussed in Mallick v. International Brotherhood of Electrical Workers, 644 F.2d 228, 233 (3d Cir. 1981), in the context of a party's failure to precede a motion for j.n.o.v. with a timely motion for a directed verdict. This court concluded in Mallick that \"unless a court has been alerted to deficiencies in proof by a motion for a directed verdict\" -- and I think that the motion includes the reasons therefor -- \"a request that the court enter a judgment contrary to that of the jury is tantamount to asking the court to re-examine the facts as found by the jury,\" a reexamination that \"would abridge the Seventh Amendment.\" Id.\n\nB. The Alleged Errors in the Jury Instructions\n\nTo complicate matters, the City has now recast as an objection to the district court's jury instructions the argument advanced in support of its Rule 50(a) and 50(b) motions that, because the state law prerequisites for a special relationship had not been met in this case, the City and Panati had no duty to Simmons under Pennsylvania tort law. In addition, the City, for the first time on appeal, raises a number of other purported flaws in the district court's jury instructions. The City specifically argues that we must reverse the district court's decision denying its motion for j.n.o.v. because the district court erred: (1) in permitting the jury to consider the condition of the lockup facilities, for which the City asserts that it is immune under Pennsylvania law; (2) in permitting the jury to consider the City's directives for police officers in determining whether the City or Panati breached a duty to Simmons under state tort or statutory law; (3) in instructing the jury that it could, consistent with Pennsylvania tort law, find that Simmons's duty to exercise due care for his own safety was lowered by his intoxicated condition; and (4) as suggested above, in failing to charge the jury on the preconditions to duty and the creation of a special relationship under state tort law.\n\nUnder Fed. R. Civ. P. 51, a party, in order to preserve an objection either to a failure to instruct the jury on an issue or to the manner in which the jury was instructed, clearly must \"object[] thereto before the jury retires to consider its verdict, stating distinctly the matter objected to and the grounds of the objection.\" See also McAdam v. Dean Witter Reynolds, Inc., 896 F.2d 750, 759 (3d Cir. 1990) (declining to consider newly developed argument concerning jury charge deficiency where party \"failed to specifically and clearly object to either the charge or the entry of a judgment . . . based on this charge\"); Waldorf v. Shuta, 896 F.2d 723, 739-40 (3d Cir. 1990) (holding that objection, because sufficiently specific, had preserved error alleged on appeal). If a party has preserved an objection to points on which the jury actually was charged, \"we generally ask ourselves whether, viewed in light of the evidence, the charge as a whole fairly and adequately submits the issues in the case to the jury, and reverse 'only if the instruction was capable of confusing and thereby misleading the jury.'\" Bennis v. Gable, 823 F.2d 723, 727 (3d Cir. 1987) (quoting United States v. Fischbach \u0026 Moore, Inc., 750 F.2d 1183, 1195 (3d Cir. 1984), cert. denied, 470 U.S. 1029, 105 S. Ct. 1397, 84 L. Ed. 2d 785 (1985)); see also Waldorf, 896 F.2d at 740 (quoting Bennis). Absent a timely and specific objection, however, we may review jury instructions only for plain error, a form of discretionary review that we have exercised sparingly and only to correct a \"fundamental\" error that would \"result in manifest injustice.\" Bowley v. Stotler \u0026 Co., 751 F.2d 641, 652 (3d Cir. 1985); see also United States v. 564.54 Acres of Land, 576 F.2d 983 (3d Cir. 1978) (under plain error doctrine, court may review jury instruction if error is \"fundamental and highly prejudicial\" and failure to consider it \"would result in manifest injustice\"), rev'd on other grounds, 441 U.S. 506, 99 S. Ct. 1854, 60 L. Ed. 2d 435 (1979).\n\nIn my opinion, it therefore is necessary to review the alleged deficiencies in the jury instructions to determine whether they have been properly preserved and, as the City contends, constitute grounds either for reversing the district court's decision denying j.n.o.v. as to plaintiff's pendent state claims or, in the alternative, for a new trial.\n\n1. The Alleged Error of Permitting the Jury to Consider the Condition of the Lockup Facilities\n\nThe City contends that because, under Pennsylvania's Tort Claims Act, it is immune from liability for injuries caused by the condition of jail facilities, the district court erred in instructing the jury that it could consider the adequacy of the lockup facilities in determining the City's liability. This contention borders on the frivolous.\n\nThe district court instructed the jury, I think correctly, that the adequacy of the lockup facilities in which Simmons was held could be considered, with respect to plaintiff's federal claim, in determining whether the City had an unconstitutional policy or custom tainted by deliberate indifference. In the course of its jury instructions concerning plaintiff's state claims, the district court mentioned the condition of the lockup facilities only in characterizing plaintiff's contentions and did not otherwise address the extent to which the jury could or should consider the condition of the lockup facilities. [A-A 663]\n\nThe City neither contends that it objected to the district court's mention of the lockup facilities in characterizing plaintiff's state claims nor alleges that it sought an instruction limiting the jury's consideration of the condition of the facilities. I nonetheless have inspected the record, but can find no point at which counsel for the City either objected to the court's instructions concerning the relevance of the condition of the lockup facilities or sought such a limiting instruction. I therefore believe that it is clear that the City failed to preserve any objection to the district court's instructions in this regard. I do not think, moreover, that either the district court's passing mention of the condition of the lockup facilities in connection with plaintiff's pendent claims or its failure to deliver a limiting instruction that the City itself did not request can begin to amount to the type of \"fundamental\" error, resulting in a \"manifest injustice,\" that calls for review under the plain error doctrine. Bowley, 751 F.2d at 652.\n\n2. The Alleged Error of Instructing the Jury that Police Directives Establish a Statutory or Common Law Duty\n\nThe City's next contention, as I understand it, is that the district court erroneously instructed the jury that police conduct that did not comport with the City's police directives constituted a breach of duty under state negligence law. The City argues that its police directives establish neither a common law nor a statutory duty.\n\nThis contention, like the previous one, borders on the frivolous.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e The City does not contend, and indeed there is no basis in the record for concluding, either that it sought and was denied a limiting instruction concerning the jury's consideration of the directives or that it objected to the district court's suggestion that the content of the directives was relevant in determining whether the City breached a duty to Simmons.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e I therefore conclude that the City neither has cause to object nor, under Rule 51, has preserved any objection to the district court's jury instructions concerning the directives. Nor do I think that the district court's instructions in this regard provide any basis for invoking the plain error doctrine.\n\n3. The Instruction that Intoxication Can\n\nLower a Prisoner's Duty to Exercise Due Care The City further contends that the district court committed reversible error in instructing the jury that, although it could determine that Simmons's own willful and wanton conduct relieved the City and Panati of any liability for negligence, \"if a prisoner is so intoxicated and his mental and physical faculties are so impaired that he cannot exercise due care, then he is not responsible for the consequence of his acts.\" [A-A 662] According to the City, this instruction is incorrect under McMichael v. Pennsylvania R. Co., 331 Pa. 584, 586, 1 A.2d 242, 243 (1938), in which the Pennsylvania Supreme Court held, with respect to a plaintiff who got drunk while sitting on the defendant's railroad tracks and subsequently was struck by a train, that \"voluntary intoxication does not justify a failure to exercise due care\" and that \"an intoxicated person who fails to exercise proper care and caution is guilty of negligence, if such failure contributes to the accident.\"\n\nThe City argues that it objected sufficiently to this instruction to preserve the allegation of error on appeal.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Based on my examination of the record, however, the proposed jury instruction to which counsel for the City objected was abandoned by plaintiff's counsel and was not used by the court.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e I can find no other point at which the City, either in discussing proposed instructions with the court or in the course of the jury instructions, objected to the instruction adopted by the district court that Simmons's intoxication could be regarded as lowering his duty to exercise due care. I note, in addition, that the City appears to have raised the Pennsylvania Supreme Court's McMichael decision for the first time on appeal. In short, having neglected to \"state distinctly the matter objected to and the grounds of the objection,\" as required by Fed. R. Civ. P. 51, the City has, in my opinion, failed to preserve any allegation of error in the district court's instructions on Simmons's duty of care. I also do not believe that the district court's instructions on Simmons's duty of care constitute a \"fundamental\" error that \"would result in manifest injustice,\" necessitating review under the plain error doctrine. Bowley, 751 at 652.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\n\n4. The Alleged Error of Failing to Instruct the Jury on the Preconditions to a Duty Arising from a Special Relationship\n\nWhereas the City argued in support of its motions for a directed verdict and for j.n.o.v. that plaintiff had failed to allege and establish the prerequisites to a special relationship set forth in Melendez v. City of Philadelphia, 320 Pa. Super. at 59, 466 A.2d at 1060, the City raises this argument, on appeal, solely as an objection to the district court's jury instructions. In Melendez, the Pennsylvania Superior Court established a three-pronged test for determining whether a special relationship, giving rise to a duty of protection, exists between a group or an individual and the police. 320 Pa. Super. at 59, 466 A.2d at 1060. Melendez requires that a plaintiff claiming the existence of a special relationship \"must demonstrate that the police were: (1) aware of the individual's particular situation or unique status, (2) had knowledge of the potential for the particular harm which the individual suffered, and (3) voluntarily assumed, in light of that knowledge, to protect the individual from the precise harm which has occasioned.\" Id. at 65, 466 A.2d at 1064 (emphasis in original). The district court's instructions to the jury on the City's and Panati's duty to Simmons were as follows:\n\nWith regard to prisoners, there are some . . . specific rules that I can give you. Those who hold a prisoner in custody must use reasonable care to protect prisoners from an unreasonable risk of harm.\n\nAnd with regard to suicide, the plaintiff[] must prove by the fair weight or the preponderance of the evidence that those who held the prisoner in custody either knew or should have known of the prisoner's particular situation or unique status, that is, of the particular vulnerability to suicide. And that plaintiff[] must further prove that those who held the prisoner in custody either knew or should have known of the potential for harm that was present because of this vulnerability. [J-A 310]\n\nIn addition to a general objection to the court's failure to instruct the jury on Melendez 's prerequisites to a special relationship, the City specifically contends that the court's instructions concerning the City's negligence were erroneous in three respects: (1) in charging the jury that the City's conduct could be regarded as the proximate cause of Simmons's death if that conduct negligently increased the risk that Simmons would harm himself; (2) in failing to charge the jury that, under Pennsylvania law concerning special relationships, a basic duty to protect Simmons could have arisen only if Panati or other police officers had knowledge or reason to know that Simmons was in danger of committing suicide; and (3) in failing to charge the jury that, in order for the City to have incurred a specific duty to prevent Simmons from committing suicide, Panati must have had actual knowledge that Simmons was particularly vulnerable to the risk of suicide.\n\nI reject the City's first contention that the district court erred in instructing the jury that the City's negligence could be regarded as causing Simmons's death if that negligence increased the risk that he would harm himself. First, this contention is but tangentially related to the City's argument that the court erred in failing to charge the jury on the Melendez prerequisites to a special relationship. Therefore, unlike the City's general and remaining two specific contentions, which clearly are grounded in Melendez, it is to my mind doubtful whether this contention concerning the court's causation instructions has been preserved. Second, I can find no basis for the contention in the court's actual instructions on causation with respect to plaintiff's state claims. Indeed, it appears likely that the City has mistaken the court's causation charge as to plaintiff's federal claim for the court's causation charge based on state law.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nAs to the City's remaining general and specific objections to the district court's failure to charge the jury on Melendez 's prerequisites to a special relationship, it is necessary to consider as a threshold matter whether the City adequately preserved them by contending, in support of its Rule 50(a) and 50(b) motions, that plaintiff had failed to allege and establish these prerequisites to a duty on the part of the police to take measures to prevent Simmons's suicide. The City, through raising that argument in support of its motions for a directed verdict and for j.n.o.v., clearly would have preserved an objection on appeal, grounded in Melendez, to the sufficiency of plaintiff's complaint and evidence. See Fed. R. Civ. P. 50(a) \u0026 50(b); see also Abraham, 728 F.2d at 172-73. However, as I previously have explained, Rule 51 and our jurisprudence under that rule impose a distinct requirement for preserving an objection to jury instructions -- namely, the requirement that a party object to a jury instruction or the court's failure to instruct the jury on a given issue \"before the jury retires to consider its verdict, stating distinctly the matter objected to and the grounds of the objection.\" Fed. R. Civ. P. 51; see also McAdam, 896 F.2d at 759; Waldorf, 896 F.2d at 739-40.\n\nI have noted, see supra typescript at 68, that a party's failure to alert the district court to deficiencies in proof by a motion for a directed verdict supported by the reasons therefor raises serious seventh amendment concerns. I think that requesting a n.o.v. that depends on a jury instruction that either was not objected to or was never requested in essence asks the court to function as the jury in finding new facts and thus implicates equally serious seventh amendment concerns. These concerns are not abated by the fact that a party may earlier, in support of a Rule 50(a) motion for a directed verdict, have raised the point of law in which the party later alleges the jury instructions were deficient. Absent a timely objection to jury instructions that again raises the point of law, the court very well may fail to cover the point either through inadvertence or based on the conclusion that the party who earlier raised the point has decided to abandon it.\n\nIn determining whether the City has preserved its general and two specific objections, grounded in Melendez, to the district court's instructions on the City's and Panati's duty to exercise due care to protect Simmons, I therefore find it necessary to look solely to any arguments or objections that the City advanced in relation to the court's instructions on this matter. In my opinion, it is a close question whether the City adequately objected to the court's state-law duty charge.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e However, I think that, under Bowley v. Stotler \u0026 Co., 751 F.2d at 641, it did so. In Bowley, id. at 647, this Court determined that Rule 51's requirements for preserving an objection to a jury instruction must be read in light of Rule 46, concerning unnecessary exceptions, which provides that \"it is sufficient that a party, at the time the ruling or order of the court is made or sought, makes known to the court the action which the party desires the court to take or the party's objection to the action of the court and the grounds therefor.\" Fed. R. Civ. P. 46. In Bowley, we interpreted Rule 46 to mean that, if a litigant endeavors fully to identify to the district court his position, in opposition to that of the court, on an issue pertaining to a jury instruction, the litigant has met Rule 51's requirements for preserving an objection. 751 F.2d at 647.\n\nAlthough counsel for the City did not formally object following the court's explanation of its refusal to incorporate the Melendez test in the jury instructions on duty, he unmistakably raised the issue whether Melendez provided the appropriate standards for determining whether the City and Panati had a duty to take measures to prevent Simmons's suicide and expressed the City's position on that matter. I therefore conclude that the City has preserved its general and two specific objections, grounded in Melendez, and review the instructions at issue to determine whether the court's charge, in light of the evidence, \"fairly and adequately\" submitted to the jury the issue whether Panati and the City breached a duty to Simmons under Pennsylvania law. In arriving at this determination, I am mindful that reversal is warranted \"'only if the instruction was capable of confusing and thereby misleading the jury.'\" Bennis, 823 F.2d at 727 (citation omitted).\n\nAs the district court noted both in discussing its negligence instructions on duty and in its opinion denying the City's motion for j.n.o.v., Melendez is distinguishable from this case. In Melendez, the Pennsylvania Superior court set forth the prerequisites to a special relationship in the context of an action alleging that the Philadelphia Police Department had breached a duty to protect the residents of a neighborhood troubled by recurring racial violence. 320 Pa. Super. at 59, 466 A.2d at 1060. The Melendez court granted summary judgment for the City, holding that a municipality has a duty to provide police protection to a particular individual or group only when the test for a special relationship set forth in its decision had been met. Id.\n\nThe Pennsylvania Supreme Court has not, as yet, decided whether Melendez 's prerequisites to the existence of a special relationship giving rise to a duty to protect apply when an individual is in state custody.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e The district court thus was called on to predict the Pennsylvania Supreme Court's holding on this issue in formulating the jury instructions concerning Panati's and the City's duty to Simmons.\n\nThe district court in substance determined that Melendez 's prerequisites are restricted in their application to the determination whether police officers breached a duty to protect an individual who has sustained an injury in a noncustodial context.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e In light of the uncertain state of Pennsylvania law on the duty to protect, we think that the district court's instructions concerning Panati's and the City's duty to exercise due care to protect Simmons generally were sound and, at a minimum, \"fairly and adequately\" submitted to the jury the issue whether these defendants had breached that duty.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\n\nI think that the district court rightly predicted that the Pennsylvania Supreme Court\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e would hold that when an individual is in custody, the applicable rule for determining whether the individual's custodian breached a duty of protection is the prevailing common law rule, as formulated in section 314A of the Restatement (Second) of Torts, as opposed to the three-pronged test for a special relationship set forth in Melendez. Section 314A of the Restatement specifies that \"one who is required by law to take . . . custody of another under circumstances such as to deprive the other of his normal opportunities for protection\" is under a duty to protect the individual from an \"unreasonable risk of physical harm\" and to provide care for the individual if he is ill or injured. Consistent with the district court's instructions on duty, the Restatement further provides that a defendant is not liable \"where he neither knows nor should know of [an] unreasonable risk[] or of [an] illness,\" and that a defendant is required to take action only when \"he knows or has reason to know that the plaintiff is endangered[] or is ill.\" Id. comments e \u0026 f. Courts generally have interpreted this common law rule to require that jail authorities who know or should know that a prisoner, unless forestalled, is likely to harm himself, must exercise reasonable care to ensure that the harm does not occur. See Annotation, supra, 79 A.L.R. 3d at 1214, 1216-17 (collecting cases decided by courts in a number of states and concluding that this is the general rule).\n\nI think that the district court's instructions on a custodian's duty to a detainee under Pennsylvania law were in no way confusing or misleading and, in the absence of a controlling decision by the Pennsylvania Supreme Court, fairly and adequately submitted to the jury the issue whether Panati and the City breached a duty of protection to Simmons. I therefore reject the City's contention that it is entitled either to j.n.o.v. or a new trial on the basis of flaws in the district court's jury instructions.\n\nC. Is the City, Notwithstanding its Police Waiver Ordinance, Immune from Liability With Respect to Plaintiff's State Claims?\n\nThe City additionally contends on appeal that the district court should have granted its motion for j.n.o.v. with respect to plaintiff's state claims because it is immune under Pennsylvania law from any liability for negligently injuring Simmons. The City argues that Pennsylvania's Political Subdivision Tort Claims Act (the PSTCA), 42 Pa. Cons. Stat. Ann. §§ 8541-64 (Purdon 1982 \u0026 Supp. 1990),\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e overrides the waiver of liability in Section 21-700 of the Philadelphia Code, which provides that \"the City shall not plead governmental immunity as a defense in any civil action commenced by any person sustaining bodily injury or death caused by negligence or unlawful conduct of any police officer while the latter is acting within the scope of his office or employment.\" The City emphasizes that police negligence does not fall within any of the eight statutory exceptions to the PSTCA's general rule of sovereign immunity. The City also contends that the Pennsylvania Supreme Court's decision in In re Upset Sale of Properties (Skibo), 522 Pa. 230, 560 A.2d 1388 (1989) stands for the proposition that the PSTCA overrides legislated municipal waivers of immunity, such as that of the City.\n\nThe district court concluded that the City, by failing to raise the immunity argument in support of its Rule 50(a) motion for a directed verdict, had waived that argument as a grounds for granting its Rule 50(b) motion for post-trial relief. It therefore is necessary, at the outset, to determine whether the City has preserved the argument on appeal. Based on our examination of the City's trial brief and of the transcript of the trial proceedings, the district court correctly determined that the City neglected to raise its immunity argument at any point prior to its motion for post-trial relief. Under our jurisprudence construing the prerequisites to a Rule 50(b) motion for j.n.o.v, see supra typescript at 67-68, the City thus would appear to have waived appellate consideration of the immunity issue.\n\nOur federal waiver precepts, however, conflict with Pennsylvania law concerning the City's right to raise its immunity argument on appeal. Although the City raised Skibo solely with respect to the merits of its immunity argument, the decision has important ramifications as to appellate consideration of the City's possible immunity. In Skibo, the Pennsylvania Supreme Court held that governmental immunity is \"an absolute defense\" that cannot be waived by negligence or agreement and that \"is [not] subject to any procedural device that could render a governmental agency liable beyond the exceptions granted by the legislature.\" 522 Pa. at 232, 560 A.2d at 1389. Although the merits of the City's argument that the PSTCA overrides a municipal waiver of immunity are far from certain, see infra typescript at 91-95, Skibo clearly stands for the proposition that an argument raising immunity under the PSTCA as a defense to governmental liability cannot be waived as a result of procedural error.\n\nGiven this conflict between federal procedure and Skibo 's holding that an immunity defense cannot be waived, it is necessary to determine which controls appealability of the City's immunity argument. It is well established that, although state law governs the decision of substantive issues in federal diversity actions and in pendent state claims, the Federal Rules of Civil Procedure control the resolution of procedural issues. Hanna v. Plumer, 380 U.S. 460, 85 S. Ct. 1136, 14 L. Ed. 2d 8 (1965); Yohannon v. Keene Corp., 924 F.2d 1255 (3d Cir. 1991). It is equally settled, however, that \"choices between state and federal law are to be made not by application of any automatic, 'litmus paper' criterion,\" but rather by reference to the principles of outcome determination and the deterrence of forum shopping that underlie Erie Railroad Co. v. Tompkins, 304 U.S. 64, 58 S. Ct. 817, 82 L. Ed. 1188 (1938). Hanna, 380 U.S. at 467, 85 S. Ct. at 1141. In determining whether the Pennsylvania Supreme Court's rule prohibiting procedural waiver of a governmental immunity defense to liability is substantive for Erie purposes, and therefore must prevail over our waiver precepts under Rule 50(a) and 50(b), the relevant inquiry is\n\nwhether application of the [state] rule would make so important a difference to the character or result of the litigation that failure to enforce it would unfairly discriminate against citizens of the forum State, or whether application of the rule would have so important an effect upon the fortunes of one or both of the litigants that failure to enforce it would be likely to cause a plaintiff to choose the federal court.\n\nHanna, 380 U.S. at 468 n. 9, 85 S. Ct. at 1142 n. 9; see also Fauber v. KEM Transportation \u0026 Equipment Co., 876 F.2d 327, 331 (3d Cir. 1989) (quoting same as proper inquiry).\n\nIt is unlikely that a Pennsylvania plaintiff would choose the federal court for the litigation of a diversity action -- or of an action such as this one combining federal civil rights with state negligence claims -- based on the small probability that a municipal defendant would fail to raise the defense of immunity under the PSTCA in its Rule 50(a) and 50(b) motions, thereby waiving on appeal an argument concerning governmental immunity that could have been raised in the state appellate courts. The application of Skibo 's rule that a governmental immunity defense is not procedurally waivable, however, is quite likely to influence the character and the outcome of an appeal to which it is relevant and to affect each litigant's chances of prevailing. For this reason, the panel is in agreement that the Pennsylvania Supreme Court's rule must be regarded as substantive for Erie purposes and must be applied in this case to permit appellate consideration of the City's immunity argument. Cf. Yohannon, 924 F.2d at 1265 (holding for similar reasons that Pennsylvania law on delay damages in tort is substantive for Erie purposes, although deemed procedural under state law); Brown, 922 F.2d at 1106-07 (holding that, under Erie, a claim of qualified immunity under state law is appealable only if state has conferred underlying substantive immunity from suit).\n\nWe therefore conclude that the district court erred in holding that, because the City failed to raise its immunity argument in support of its motion for a directed verdict, the City had waived the argument for purposes of its motion for j.n.o.v.. With respect to the merits of the City's immunity argument, however, the district court, in an alternative holding, distinguished Skibo on the basis that the decision applies to waivers of immunity by counsel, not to waivers enacted by municipalities. In addition, the district court considered the decisions of the two courts that have decided whether the PSTCA served to nullify the same Philadelphia police waiver ordinance at issue here -- City of Philadelphia v. Middleton, 89 Pa. Commw. 362, 492 A.2d 763 (1985); Borenstein v. City of Philadelphia, 595 F. Supp. 853 (E.D. Pa. 1984) -- and was persuaded by the determination of both courts that the statute does not affect the validity of municipal ordinances waiving substantive immunity. The district court therefore concluded that, even if it had not procedurally been waived, the City's immunity contention lacked merit.\n\nJudge Sloviter and I agree with the district court that Skibo does not determine whether the PSTCA has overridden municipal ordinances waiving sovereign immunity. As the district court emphasized, see 728 F. Supp. at 360, the Skibo court addressed the issue whether counsel for a municipal tax claim unit had waived the defense of governmental immunity by raising that defense for the first time on appeal. See 522 Pa. at 230, 560 A.2d at 1388. Skibo held that \"a governmental agency cannot be put at the mercy of negligent or agreed waiver by counsel of a substantive right designed to protect its very existence.\" Id. at 232, 560 A.2d at 1389 (emphasis added). The Skibo court, referring to Leflar v. Gulf Creek Industrial Park, 511 Pa. 574, 515 A.2d 875 (1986), further held that the \"defense of governmental immunity is an absolute defense, directly analogous to our holding in workmen's compensation cases and is not waivable.\" Id. The Skibo court's reference to Leflar, which held that a defense based on the Workman's Compensation Act, even if raised in an untimely fashion, is not subject to waiver, underscores the limited procedural focus of Skibo 's holding. Id. Judge Sloviter and I therefore conclude that Skibo is confined by its terms to procedural waivers of the defense of governmental immunity through the inadvertence, mistake, or agreement of counsel and that we must look to the PSTCA and its legislative history in order to determine whether the statute nullifies the City's ordinance that waives immunity from liability for police negligence.\n\nAs Middleton and Borenstein detail, the PSTCA has an involved history that began with the Pennsylvania Supreme Court's abolition of sovereign immunity as a common law defense in Ayala v. Philadelphia Board of Public Education, 453 Pa. 584, 305 A.2d 877 (1973). See Middleton, 89 Pa. Cmwlth. at 365, 492 A.2d at 764-65; Borenstein, 595 F. Supp. at 858. The Pennsylvania legislature enacted the PSTCA in 1978 to reinstate the sovereign immunity that Ayala had abolished. See Borenstein, 595 F. Supp. at 858 (citing Carroll v. County of York, 496 Pa. 363, 437 A.2d 394 (1981); Note, The Political Subdivision Tort Claims Act: Pennsylvania's Response to the Problems of Municipal Tort Liability, 84 Dickinson L. Rev. 717 (1980)). The PSTCA, as the City emphasizes, contains eight exceptions to its general rule of sovereign immunity,\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e none of which by their terms encompass a municipal police waiver, such as that of the City, implemented prior to the PSTCA's enactment.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\n\nWe must determine whether, in addition to the eight codified exceptions to the PSTCA's general rule of sovereign immunity, exceptions that have been legislated by local governments are permissible under the statute. No provision in the PSTCA resolves this issue. As the Borenstein court noted, however, state statutory limitations on municipal legislative powers, see 53 Pa. Stat. Ann. § 13133 (1957 \u0026 Supp. 1990), \"have been consistently interpreted by the Pennsylvania courts to place very few restrictions on the legislative authority of 'first class cities' such as Philadelphia.\" 595 F. Supp. at 858. The Borenstein court also emphasized that the Report of the Joint State Government Commission on Sovereign Immunity, on which the PSTCA was based, states that the Commission agreed that additional exceptions to the general rule of sovereign immunity might be added to the statute in the future. Id. at 858-59 (citing Joint State Government Commission, Report to the Gen. Assembly of the Commonwealth of Pennsylvania, Sovereign Immunity, at 10 (May 1978)). In Middleton, the Commonwealth Court, relying on Borenstein, thus concluded:\n\nThe legislature's main concern was to avoid the possible devastating effects which an unpredictable number of lawsuits would have on municipal budgets. There is no indication, however, that the eight exceptions listed in the Act were intended to be exclusive or that local municipalities were forbidden to waive the immunity granted by the Act. . . . Therefore, . . . the City of Philadelphia acted well within the powers derived from its Home Rule Charter in deciding that it would be in the best interest of its citizens to waive governmental immunity in cases where bodily injury or death has resulted from the negligent or unlawful conduct of its police officers.\n\n89 Pa. Cmwlth. at 365, 492 A.2d at 765.\n\nJudge Sloviter and I find this analysis to be persuasive. We note, in addition, that the primary reason that the Joint State Government Commission on Sovereign Immunity gave in its proposed legislation for retaining sovereign immunity was that\n\nthe Commonwealth will not be required to process and defend various litigation brought against it in areas where risk management is totally uncertain at this time -- e.g., radiation exposure -- or strong public policy suggests that a continuation of the sovereign immunity bar to litigation be continued -- e.g., claims arising out of adverse possession against the Commonwealth, improper assessment of taxes, licensing procedures, etc.\n\nSovereign Immunity at 10. Litigation arising from a municipal waiver of immunity with respect to police conduct is not of this type.\n\nJudge Sloviter and I acknowledge that neither this factor nor the factors reviewed in Borenstein and Middleton clearly establishes that the PSTCA was not intended to abrogate municipal waiver ordinances such as that of the City. In the absence of a controlling decision of the Pennsylvania Supreme Court or legislative action by the Pennsylvania General Assembly, however, we think that the factors considered above tip the balance in favor of this interpretation of the statute and its legislative history.\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e We therefore hold that the PSTCA did not serve to nullify the City's ordinance waiving liability arising from the negligence of its police officers.\n\nIV. IS PLAINTIFF ENTITLED TO DELAY DAMAGES UNDER RULE 238?\n\nFollowing the district court's entry of judgment on the verdict, plaintiff, as we have noted, moved for delay damages under Pennsylvania Rule of Civil Procedure 238, which provides that plaintiffs in certain civil actions involving bodily injury or death may request that delay damages be added to awards of compensatory damages. 42 Pa. Cons. Stat. Ann., Pa. R. Civ. P. 238 (Purdon 1987 \u0026 Supp. 1990). The district court granted plaintiff delay damages in the amount of $104,687.51 on the jury's entire damage award of $1,000,000. The City challenges the application of Rule 238 on a number of grounds, none of which has merit.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e\n\nAt oral argument before this court, the panel sua sponte raised the question of the applicability of Savarese v. Agriss 883 F.2d 1194 (3d Cir. 1989). In Savarese, we held that, because the application of state substantive law providing for prejudgment interest would destroy the uniformity of damages in federal civil rights cases, Rule 238 does not apply to damages awarded under section 1983. 883 F.2d at 1206-07. The Rule, however, clearly is applicable to damages awarded on pendent state claims. See id. at 1207 n. 21. Savarese thus would appear to require that the amount of delay damages awarded in the case be reduced to cover only that portion of the jury's verdict that is attributable to plaintiff's state claims.\n\nBecause the City failed to raise Savarese as grounds for reducing the amount of delay damages awarded in this case, however, we conclude, based on the waiver principles that we previously have discussed at length, that the City has waived the right to such a reduction. We have discussed Savarese, however, in hopes that, in future cases, counsel and the district courts will take note of its applicability, as well as of the advisability of requesting separate verdicts on federal question and state pendent claims so as to facilitate the calculation of delay damages.\n\nV. CONCLUSION\n\nIn sum, it is my opinion that although plaintiff failed to establish the essential \"scienter\" element of her section 1983 action against the City, as required by the Supreme Court's Pembaur trio of cases and the jurisprudence of this circuit, the City waived any objection to this failure. The scienter issue thus falls out of the case, see supra at 50-51. Applying this Court's highly deferential standard of review in weighing whether the evidence was sufficient to support the jury's section 1983 verdict against the City, I conclude that the record contains at least the minimum quantum of evidence necessary to sustain the jury's verdict.\n\nIn addition, I conclude that the City, by failing to preserve its objections as required by the Federal Rules of Civil Procedure, has waived its contention that plaintiff failed to allege or establish causes of action under state law, and also has waived a number of exceptions to the district court's jury instructions. Although I believe that the City preserved an objection to the court's instructions on the state-law prerequisites to a special relationship giving rise to a duty to Simmons on the part of the police, I conclude that the court's instructions on this issue fairly and adequately submitted the duty issue to the jury. Further, although Judge Sloviter and I have determined that the City had the right to raise on appeal the argument that it is immune from any liability for police negligence toward Simmons, we conclude that this argument lacks merit. Judge Sloviter has concurred in the judgment for the reasons set forth in her separate opinion.\n\nThe district court's order denying the City's post-trial motions, its judgment on the verdict, and its award of delay damages in the amount of $104,687.51 will be affirmed.\n\nSLOVITER, Chief Judge, concurring in the judgment.\n\nI concur in the judgment and join in Part I, Part III. C, and Part IV of Judge Becker's opinion, as well as in footnotes 26, 28-30, and 32-34, which represent Judge Becker's response to Judge Weis's dissent.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nAlthough I agree with some of the analysis of Judge Becker's thoughtful opinion, I write separately because of some fundamental differences with respect to Judge Becker's discussion of the City's liability. One centers on the underpinnings of Judge Becker's analysis regarding the proof that a section 1983 plaintiff must adduce as to a policymaker's state of mind in order to establish municipal liability. Specifically, I believe that Judge Becker's emphasis on production by plaintiff of \"scienter-like evidence\" when charging a municipality with deliberate indifference to deprivation of rights may impose on plaintiffs a heavier burden than mandated by the Supreme Court or prior decisions of this court. My other substantial concern is Judge Becker's treatment of the issue of the cost of minimizing or eliminating policies effecting unconstitutional deprivation, an issue I would not reach in this case.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nI.\n\nThe conceptual difficulty in applying the deliberate indifference standard stems from the principle that municipalities can be liable only for policies or customs approved by policymakers (who are defined by state law). The formulation of policies is generally regarded as an intentional act. Therefore, it is anomalous to think in terms of a municipality having a conscious, intentional policy of being \"indifferent\" to deprivations of constitutional rights. As the Supreme Court noted in City of Canton v. Harris, 489 U.S. 378, 390, 103 L. Ed. 2d 412, 109 S. Ct. 1197 (1989), \"it may seem contrary to common sense to assert that a municipality will actually have a policy of not taking reasonable steps to train its employees.\" The Court nevertheless provided guidance on how to determine whether there is such a policy or custom. \"It may happen that in light of the duties assigned to specific officers or employees the need for more or different training is so obvious, and the inadequacy so likely to result in the violation of constitutional rights, that the policymakers of the city can reasonably be said to have been deliberately indifferent to the need.\" Id. (emphasis added).\n\nJudge Becker recognizes that a municipality may be liable based on the \"acquiescence\" of the officials in a long-standing practice or custom. Becker Typescript Op. at 40. Nonetheless, his focus on an identifiable policymaker's \"scienter\" -- a term the Supreme Court never used in City of Canton or the Pembaur trio of cases\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e -- suggests the need to prove an intentional course of action. Cf. Prosser \u0026 Keeton, The Law of Torts § 107, at 741-43 (5th ed. 1984) (generally equating \"scienter\" with \"intent\" in tortious misrepresentation actions). Admittedly, for some purposes \"scienter\" may encompass action other than intentional action. Black's Law Dictionary defines the term as including \"the defendant's previous knowledge of the cause which led to the injury complained of, or rather his previous knowledge of a state of facts which it was his duty to guard against, and his omission to do which has led to the injury complained of.\" Black's Law Dictionary 1207 (5th ed. 1979). Nonetheless, because of the common equation of \"scienter\" with intentional action, I am concerned that Judge Becker's use of the term will be misread as limiting section 1983 cases to those where plaintiffs can show defendants knew of the constitutional deprivation and excluding those cases where plaintiffs argue that defendants should have known of it. Nor are my concerns allayed by Judge Becker's attachment of the suffix \"like\" to \"scienter.\"\n\nNowhere in Judge Becker's opinion is there an acknowledgement that liability may be based on the City's ( i.e., policymaker's) reckless refusal\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e or failure to take account of facts or circumstances which responsible individuals should have known. Nothing in the current precedent of the Supreme Court suggests that liability against a municipality may not be based on its reckless disregard of the relevant circumstances.\n\nRecklessness has been defined as conduct that \"evince[s] disregard of, or indifference to, consequences, under circumstances involving danger to life or safety to others, although no harm was intended,\" or a state of mind that \"either pays no regard to its probably or possibly injurious consequences, or which, though foreseeing such consequences, persists in spite of such knowledge.\" Id. at 1142-43. Failure of a municipality to fulfill a duty to guard against a foreseeable harm when its officials have knowledge of circumstances making that harm likely is clearly reckless and culpable conduct.\n\nIn Colburn v. Upper Darby Township (Colburn I), 838 F.2d 663, 670 (3d Cir. 1988), we noted that we had not yet had occasion to define, nor distinguish between, such terms as \"deliberate indifference,\" \"reckless disregard,\" and \"reckless indifference\" in the context of section 1983 civil rights litigation. We repeated that statement in Williams v. Borough of West Chester, 891 F.2d 458, 464 n. 10 (3d Cir. 1989), which was decided after City of Canton and the Pembaur trio of Supreme Court cases.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Although these observations were made in the context of individual officers' liability for jail suicides, rather than in the context of municipal liability, there is no reason why the standard of proof of \"deliberate indifference\" should be any different for the latter.\n\nIn the Eighth Amendment context, where the deliberate indifference standard is also used, albeit as the prerequisite to a claim of cruel and unusual punishment, a plaintiff can demonstrate that the defendant was deliberately indifferent by proving either an intentional deprivation of rights or \"by showing that he acted in reckless disregard of those rights\"; this can be established by showing the plaintiff \"was faced with a pervasive risk of harm and that [the defendant] failed to reasonably respond to that risk.\" Bailey v. Wood, 909 F.2d 1197, 1199 (8th Cir. 1990); see also Richardson v. Penfold, 839 F.2d 392, 394-95 (7th Cir. 1988); Berg v. Kincheloe, 794 F.2d 457, 459 (9th Cir. 1986).\n\nI find nothing in City of Canton or the Pembaur trio of cases that calls on us to revise our established jurisprudence holding that deliberate indifference can be proven by demonstrating the defendants' reckless conduct. In Jett v. Dallas Indep. School Dist., 491 U.S. 701, 737, 105 L. Ed. 2d 598, 109 S. Ct. 2702 (1989), for instance, the Court stated that once official policymakers are identified by the trial judge, \"it is for the jury to determine whether their decisions have caused the deprivation of rights at issue by . . . acquiescence in a long-standing practice or custom which constitutes the 'standard operating procedure' of the local governmental entity.\" Proof of such acquiescence might be reckless as well as intentional conduct.\n\nThe Supreme Court has not suggested that actual knowledge of the conditions by a municipal policymaker is a condition of municipal liability. Such a standard would put a premium on blinders. If Judge Becker's emphasis on scienter is read to exclude liability for conditions that City officials should have known, it would be inconsistent with City of Canton, 489 U.S. at 390 (a city may be found to be deliberately indifferent if \"the need . . . is . . . obvious, and the inadequacy . . . likely to result in the violation of constitutional rights\").\n\nI would not rely on the City's waiver of the absence of scienter-like evidence to support affirmance. Instead, using the City of Canton standard, I would hold that the evidence of 20 jail suicides in Philadelphia prisons between 1980-85, of whom 15 were intoxicated, the City's possession of knowledge before 1981 that intoxicated detainees presented a high risk of suicide, its awareness of published standards for suicide prevention, and its failure to implement the recommendations of experts, including its director of mental health services for the prison system, was sufficient basis for the jury to have found that unnamed officials with responsibility over the City's prisons acted recklessly or with deliberate indifference, thereby contributing to the deprivation of constitutional rights of plaintiff's decedent. If a city cannot be held liable when its policymakers had notice of a problem and failed to act, then it is difficult to posit a set of facts on which a city could be held to have been deliberately indifferent.\n\nII.\n\nI have a similar concern about the portions of Judge Becker's opinion referring to the balancing of City officials' decisions concerning \"resource allocation\" in determining whether the City breached a constitutional duty. See, e.g., Becker Typescript Op. at 55-58. While I agree that \"municipal officials often have to make difficult decisions concerning institutional security, as well as the allocation of resources\" to ensure citizens' safety, id. at 55, I do not believe that Bell v. Wolfish, 441 U.S. 520, 60 L. Ed. 2d 447, 99 S. Ct. 1861 (1979), upon which Judge Becker relies, made a municipality's decisions about resource allocation or cost efficiency a central factor for consideration by the courts in determining whether a municipality's deliberate indifference to the medical and safety needs of detainees, such as Simmons, is culpable.\n\nIn Bell, the Court held that the conditions of incarceration to which pretrial detainees may be subjected violate due process only when they constitute \"punishment\" of the detainee. 441 U.S. at 535-37. The Court provided guidance for that inquiry:\n\nA court must decide whether the disability is imposed for the purpose of punishment or whether it is but an incident of some other legitimate governmental purpose. . . . Absent a showing of an expressed intent to punish on the part of detention facility officials, that determination generally will turn on \"whether an alternative purpose to which [the restriction] may rationally be connected is assignable for it, and whether it appears excessive in relation to the alternative purpose assigned [to it].\" . . . Thus, if a particular condition or restriction of pretrial detention is reasonably related to a legitimate governmental objective, it does not, without more, amount to \"punishment.\"\n\nId. at 538-39. Thus, the reference in Bell to a \"legitimate governmental objective\" was merely to ascertain whether the conditions imposed on pretrial detainees amount to \"punishment.\" The Court noted that there may be justifications for conditions of detention other than insuring the detainee's presence at trial. These stem from the government's need to manage the facility in which the individual is detained, which may require \"steps to maintain security and order at the institution and make certain no weapons or illicit drugs reach detainees\" as well as other actions necessary to \"the effective management of the detention facility.\" Id. at 540.\n\nThe context of this discussion in Bell was to evaluate the need for and legitimacy of the custodial restrictions which plaintiffs challenged, i.e., prohibitions on receipt of books and magazines as well as food and personal items; body cavity searches after visitation; room inspection procedures; and the bunking of detainees in areas not designed for sleeping. Id. at 528-29. This is far different from holding that administrative officials' discretionary decisions concerning resource allocation are a legitimate excuse for deprivations of constitutional rights. The question whether a city can constitutionally \" tolerate some relatively smaller number of yearly suicides,\" Becker Typescript Op. at 62 (emphasis added), is different from whether \"the City has taken into account the serious medical needs of suicidal detainees and had taken all reasonable steps to protect them, in light of security, fiscal and other constraints.\" Becker Typescript Op. at 62 n. 27. In this case, the jury's verdict for the plaintiffs reflects the jury's determination that the City did not do all that it could reasonably have done. Under those circumstances, I see no need in this opinion to decide whether the Supreme Court precedent relied on by Judge Becker signifies that consideration of the high cost of constitutional compliance may be used as a justification for a constitutional violation. I note merely that it would be a cynical inquiry indeed to ascertain just how much cost saving to the City justifies its \"toleration\" of the preventable death of one young man detained only because of public intoxication.\n\nAlthough I have other differences with Judge Becker's opinion, I rely on the principal reasons set forth above for my decision to concur in the judgment of the court but limit my joinder in Judge Becker's opinion.\n\nWEIS, Circuit Judge, dissenting.\n\nTwo points are critical to my approach to this case. First, the decedent committed suicide -- he was not injured or killed by the police. The sin charged against the City is not commission, but omission. Second, the evidence fails to establish deliberate indifference on the part of the City of Philadelphia.\n\nThe record does not demonstrate indifference -- to the contrary, it clearly shows that the City, through directives to its police officers, had adopted a policy to limit or eliminate suicides that occurred in its jails. That the policy had not been completely successful, whether through nonactionable negligence or a paucity of resources, does not make out a case of deliberate indifference.\n\nCustody of intoxicated persons is not a matter of isolated incidents in the City of Philadelphia. In the five year statistical period that the plaintiff chose to establish for her case, there were 97,141 arrests for intoxication. During that same period, fifteen of those persons committed suicide while in custody, a percentage rate of .00015. That is not to minimize the seriousness of loss of life, but to point out that the imposition of a deliberate indifference test as to the municipality is not unreasonable in the circumstances here.\n\nTwo exhibits in evidence show that Philadelphia did have an affirmative policy to protect prisoners. A bulletin dated March 11, 1982 entitled \"Assist Officer\" issued by the Philadelphia Police Department Training Bureau addressed the matter of \"prisoner safety\" and stated, \"Police personnel responsible for the custodial care of defendants will take all necessary precautions to ensure that prisoners do not inflict harm to themselves or others.\"\n\nUnder \"Removal of Articles\" the bulletin requires both the arresting officer and the turnkey to search the prisoner and \"remove all articles with which the prisoner may injure himself or others while in custody. . . . Particular attention should be given to the following:\n\na. Ties\n\nb. Belts\n\nc. Shoe Laces. . . . \"\n\nThe bulletin went on to say:\n\n\"There have been incidents when prisoners have attempted to use pants and shirts to hang themselves. Officers will not limit their observations to the above. Suspects in a cell should be considered capable of causing harm to themselves or others despite the above precautions. Therefore, it is imperative for all officers involved to be familiar and comply with Directive 21 D, Cell Block Inspections. The safety of officers and prisoners is paramount.\"\n\n\"Appendix C\" to Police Department Directive 82 is dated November 18, 1983. It is undisputed that Directives 82 and Appendix C were in effect in 1985.\n\n\"Appendix C\" lists as \"Policy\" the admonition contained in the 1982 training bulletin that those responsible for custodial care are to take precautions to ensure that prisoners do not inflict injury on themselves or others. Also repeated are the instruction to remove \"any property that may be used . . . to inflict personal injury on the prisoner or others \" [emphasis in original] and the reference to such items as \"belts, ties, [and] shoelaces.\" In addition, \"Appendix C\" states, \"Whenever possible, a minimum of two (2) prisoners are to be placed in a cell/detention room.\"\n\nMoreover, the Directive contained instructions for inspection of cell blocks:\n\n\"1. The time of each inspection is to be recorded on the Prisoner Log (75-297) and will be conducted as follows:\n\na. Lieutenant or other ranking supervisor will inspect the cell block at least twice during the tour of duty.\n\nb. Operations Supervisor will inspect the cell block every hour.\n\nc. Turnkeys and/or trainees will inspect the cell blocks at 15-minute intervals as scheduled by the Operations Supervisor.\"\n\nThese documents conclusively refute any suggestion that the police department had not adopted precautions to safeguard its prisoners from self-inflicted harm. To the contrary, the City had taken deliberate steps to reduce the risk of detainee suicides.\n\nA review of the suicide record is revealing. In 1980 four people arrested for intoxication committed suicide in city jails; in 1981, one; 1982, two; 1983, 3; 1984, one; 1985, four. There were significant drops in the years 1981 and 1984 and an increase in 1985. The record contains no explanation for these variations, nor does the evidence reveal whether the deaths were occasioned by negligence on the part of jail personnel, or whether the Directives were violated. The statistics, therefore, do not demonstrate that the policy set out in the 1982 Directives was ineffective or that additional training was required.\n\nAs his jailer, the City had an obligation not to be indifferent to the decedent's serious medical needs, but the first question is whether the decedent had demonstrated any serious medical need. The record is unequivocal that the police had no knowledge that the decedent had any history of mental illness or instability. Indeed, his family had never noticed any symptoms and the record is completely silent on the decedent's mental health. At the time he came into the custody of the Sixth District Jail, he was intoxicated as a result of the voluntary, excessive consumption of alcohol. His conduct, according to Officer Panati, the turnkey, was not markedly different than other intoxicated persons who had been committed previously. This case is quite unlike those where individual jailers had actual knowledge of, or had reason to suspect suicidal tendencies on the part of specific detainees. In those cases, the conduct of a defendant turnkey has been measured under the deliberate indifference standard for purposes of section 1983. It is important here to remember that in determining the liability of the City, the question is not whether Officer Panati was deliberately indifferent (the jury found he was not), but whether the Philadelphia policymakers had adopted or followed a policy of deliberate indifference.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nPlaintiff does not argue that the City's policy failed to protect those prisoners it knew were suicidal, rather she urges on this Court a far broader and unprecedented basis of liability. She argues that based solely on the statistics of prior prisoner suicides, the City should have known not only that the decedent was suicidal but that its policies were inadequate. Essentially, her position is that the City was deliberately indifferent because it did not supplement its existing policy in the face of a suicide frequency for intoxicated detainees of .00015. That is at best a tenuous argument that I am not prepared to accept.\n\nThis Court in Colburn v. Upper Darby Township, (\"Colburn II\"), 946 F.2d 1017, 1024 (3d Cir. 1991), observed that \"several of our sister circuits have recently pointed out the requirement of 'reckless or deliberate indifference' implies that there must be 'a strong likelihood, rather than a mere possibility, that self-inflicted harm will occur.'\" See also Torraco v. Maloney, 923 F.2d 231, 236 (1st Cir. 1991). The suicide frequency for intoxicated detainees of .00015 fails to establish that as a \"class\" these detainees presented such a \"strong likelihood\" of committing suicide that the City was indifferent in not taking additional precautions. Cf. Colburn II, 946 F.2d at 1026 (the Court was unwilling on the record in that case to equate intoxication with a \"particular vulnerability to suicide\"); Belcher v. Oliver, 898 F.2d 32, 35 (4th Cir. 1990).\n\nThe majority's position here is inconsistent with Colburn II. The attempt to distinguish that case on minor points is unpersuasive because it fails to address the basic thrust of that opinion.\n\nMoreover, the fact remains that if the police had followed the department policy and placed the decedent in a cell with someone else, whether at the Sixth District Jail or some other location, the suicide likely would not have occurred.\n\nThe plaintiff's experts opined that the City could have taken a variety of measures to provide for potentially suicidal intoxicated prisoners. The suggested measures included plexiglass screens in place of some cell bars, audio or video monitors,\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e relocation of the turnkeys desk to an area within the cell block, or calling in police personnel from street duty to assist in constant observation when intoxicated prisoners could not be put in a cell with other persons.\n\nOpinions of this Court and other Courts of Appeals have held that expert evidence of this nature does not support a claim of deliberate indifference by a municipality. In Williams v. Borough of West Chester, Pa., 891 F.2d 458, 467 \u0026 n. 14 (3d Cir. 1989), the Court concluded that allegations of the Borough's failure to require that detainees' belts be removed or to install equipment for visual surveillance of the cell block area, failure to appropriate funds for handling detainees with mental health problems, and failure to train officers in handling detainees with mental health problems, amounted, at most, to negligence and not deliberate indifference.\n\nIn contrast, Colburn v. Upper Darby Township (\"Colburn I\"), 838 F.2d 663, 669 (3d Cir. 1988), presented allegations that the police knew of the detainee's suicidal tendencies and failed previous attempts, but did not take proper steps to protect her against herself.\n\nOther Courts of Appeals have reached the same result as we did in Williams. In Molton v. City of Cleveland, 839 F.2d 240, 247 (6th Cir. 1988), cert. denied, 489 U.S. 1068, 103 L. Ed. 2d 814, 109 S. Ct. 1345 (1989), the City had promulgated directives requiring removal of detainees' belts and extra surveillance in cases where suicide attempts could be anticipated. Although the City had a history of detainee suicides, the Court decided that the directives showed that the policymakers had taken steps to prevent such incidents. Even if the City had undertaken its initiative negligently, that fact did not establish deliberate indifference, nor did the failure to build a suicide-proof cell.\n\nSimilarly, in Popham v. City of Talladega, 908 F.2d 1561, 1564 (11th Cir. 1990), the Court held that the standard procedures followed by jail officials, \"removal of shoelaces, belts, socks, and pocket contents demonstrate an effort to assure [the prisoner's] safety and a lack of deliberate indifference.\" In that case, the intoxicated prisoner hung himself in a corner of the cell not viewed by a closed circuit television camera.\n\nRellergert v. Cape Girardeau County, Mo., 924 F.2d 794, 797 (8th Cir. 1991), was yet another jail suicide case. Rejecting a contention that the evidence established deliberate indifference, the Court remarked that \"indifference is apathy or unconcern.\" That the prisoner there was able to evade the cautious eyes of the jailer for a brief period of time, \"does not change the value and import of the policy to the contrary.\" Although the cautionary measures prescribed failed and the actions of the jailers might have been negligent, \"no view of the evidence can support the conclusion that the policy was deliberately indifferent.\" Id.; see also Bell v. Stigers, 937 F.2d 1340, 1343 (8th Cir. 1991) (\"The deliberate standard is met only if there were a 'strong likelihood, rather than a mere possibility,' that self-infliction of harm would result.\").\n\nIn short, the undisputed evidence is that the City of Philadelphia did take positive steps to prevent prisoner suicides. It had a policy expressed in its Directives to the police to protect inmates from self destructive acts. Whether the policy could have been more effective or whether the City should have devoted more resources to the problem may have some bearing on whether the municipality acted negligently -- it does not make out a case of deliberate indifference. A city cannot be both deliberately cautious and deliberately indifferent. Rellergert, 924 F.2d at 797 (defendant Sheriff sued as a policymaker).\n\nThe testimony of the experts (whose recommendations in some respects agreed with the City's Directives), aided by the wisdom endowed by hindsight, was not enough to establish deliberate indifference. Nor did the evidence suffice to allow the jury to override the City's decision to allocate its limited resources among this problem and other perhaps more pressing needs.\n\nIn the face of the positive City policy, little need be said to address the alleged failure to train, or more accurately to give better training. Officer Panati had received some training concededly years before, but in recent years had the benefit of the City's bulletin and directives published in 1982.\n\nThat the decedent here exhibited some agitation while confined to the cell does not demonstrate either that his conduct was unusual in intoxicated individuals or a need for additional training. Likewise, the expert's testimony that the symptoms exhibited by decedent were consistent with a profile of suicidal detainees is of little value in determining the City's liability. No suicides had occurred at that station so far as the record reveals and neither the arresting officers nor Panati found the detainee's actions to be different than others they had in their custody previously.\n\nMoreover, the city was not required to train officers to medically screen prisoners to detect suicidal tendencies. \"The latter requires the skills of an experienced medical professional with psychiatric training, an ability beyond that required of the average police officer by the due process clause.\" Burns v. City of Galveston, Tex., 905 F.2d 100, 104 (5th Cir. 1990); Edwards v. Gilbert, 867 F.2d 1271, 1276 (11th Cir. 1989) (\"The law does not require jail officials to keep up with the latest literature in the social sciences.\"); cf. Beddingfield v. City of Pulaski, Tenn., 861 F.2d 968, 972 (6th Cir. 1988).\n\nConcluding that there was insufficient evidence to establish liability on the part of the City under section 1983, I would enter judgment in its favor on that count.\n\nII.\n\nI agree with Judge Becker that the question of the City's immunity from state tort claims is properly before us. I differ, however, with the result the majority reaches.\n\nThe Political Subdivision Tort Claims Act was enacted by the Pennsylvania legislature in reaction to a decision of the state Supreme Court abolishing sovereign immunity as a defense in tort actions. Ayala v. Philadelphia Bd. of Pub. Educ., 453 Pa. 584, 305 A.2d 877 (1973). The Act provides that: \"Except as otherwise provided in this subchapter, no local agency shall be liable for any damages on account of any injury to a person or property caused by any act of the local agency or an employee thereof or any other person.\" 42 Pa. Cons. Stat. Ann. § 8541.\n\n\"Local agency\" is defined as \"A government unit other than the Commonwealth government.\" 42 Pa. Cons. Stat. Ann. § 8501.\n\nThe \"exceptions\" to the grant of municipal immunity permit tort actions to be brought based on the use of motor vehicles, or on dangerous conditions of traffic lights, street lights, streets, municipal utility systems. Additionally, claims related to personal or real property in possession of the political subdivision may not be brought.\n\nIt is undisputed that the City of Philadelphia is a \"local agency\" and that none of the statutory exceptions to the grant of immunity are applicable. The issue is whether the City of Philadelphia has the power to waive the provisions of the Act by means of a pre-existing municipal ordinance.\n\nIt is fundamental that absent a specific constitutional provision a city may not enact a valid ordinance contrary to state legislation. The municipal corporation is but a subdivision of, created by, and subservient to the state. Philadelphia has been denominated a city of the first class by the legislature and granted certain powers by a Home Rule Charter. Pa. Stat. Ann. tit. 53, §§ 13101-13157. Section 13133 provides that despite the grant of powers conferred, \"no city shall exercise powers contrary to, or in limitation or enlargement of, powers granted by acts of the General Assembly which are --\n\n(b) Applicable in every part of the Commonwealth.\n\n(c) Applicable to all the cities of the Commonwealth.\"\n\nThe Tort Claims Act is applicable throughout the state and extends to all municipalities. It has a broad scope and clearly implements statewide policy. Nevertheless, an ordinance at Chapter 21-700 of the Philadelphia Code, enacted before the Tort Claims Act came into effect, purports to allow the City to waive the defense of governmental immunity for torts committed by police officers.\n\nIn Borenstein v. City of Philadelphia, 595 F. Supp. 853 (E.D. Pa. 1984), the district court concluded that the City could choose to waive immunity despite the language of the Tort Claims Act. The court reasoned that the decision to give up the immunity defense in a particular class of cases was a matter of \"peculiarly local concern\" and noted that the state Supreme Court had imposed few restrictions on the legislative authority of Philadelphia. The cases cited by the district court in support of that proposition, School Dist. v. Zoning Bd. of Adjustment, 417 Pa. 277, 207 A.2d 864 (1965); Ebald v. City of Philadelphia, 387 Pa. 407, 128 A.2d 352 (1957); In re Addison, 385 Pa. 48, 122 A.2d 272 (1956), appeal dismissed, 352 U.S. 956, 1 L. Ed. 2d 316, 77 S. Ct. 353 (1957), were concerned with zoning and personnel management, topics which may well be classified as matters of purely local interest.\n\nRelying on the reasoning in the Borenstein case, a divided Commonwealth Court of Pennsylvania in City of Philadelphia v. Middleton, 89 Pa. Commw. 362, 492 A.2d 763 (1985), sustained the ordinance. The dissent pointed out that section 802(c) of the Torts Claims Act as originally enacted provided that \"all other acts or parts of acts are repealed to the extent of any inconsistency.\" 492 A.2d at 765. In any event, the dissent felt that a local ordinance could not be sustained when it contradicted state law.\n\nI recognize that the decision of the Commonwealth Court of Pennsylvania is entitled to great respect, nevertheless, I am convinced by opinions of the Supreme Court of Pennsylvania that it would decide the question of immunity in a manner contrary to Borenstein and Middleton.\n\nThe state Supreme Court upheld the constitutionality of the Tort Claims Act in Carroll v. County of York, 496 Pa. 363, 437 A.2d 394 (1981). There an inmate of a detention center committed suicide. The Court commented that \"the conferring of tort immunity upon political subdivisions is within the scope of the Legislature's authority.\" Id. at 396. Further, the Court said, \"Manifestly, it is within the province of the Legislature to determine that certain bars to suit are, in its judgment, needed for the operation of local government.\" Id. at 397.\n\nIn Mascaro v. Youth Study Center, 514 Pa. 351, 523 A.2d 1118, 1123 (1987), another detention center case, the Court reversed the Commonwealth Court and held that Philadelphia was immune. \"Since Section 3 [the real estate proviso] is an exception to the rule of immunity, we believe that its extent must be narrowly interpreted given the expressed legislative intent to insulate political subdivisions from tort liability.\"\n\nRigid adherence to the Tort Claims Act is forcefully demonstrated in In re Upset Sale (\"Skibo\"), 522 Pa. 230, 560 A.2d 1388 (1989), where the court again reversed the Commonwealth Court. In that case, the tax claim unit of North Hampton County first raised the question of immunity on appeal. The state Supreme Court refused to find an effective waiver stating:\n\n\"Perhaps here is one reason their immunity cannot be waived; a governmental agency cannot be put at the mercy of negligent or agreed waiver by counsel of a substantive right designed to protect its very existence. . . . Defense of governmental immunity is an absolute defense, directly analogous to our holding in workmen's compensation cases and is not waivable, Le Flar v. Gulf Creek Industrial Park, 511 Pa. 574, 515 A.2d 875 (1986), nor is it subject to any procedural device that could render a governmental agency liable beyond the exceptions granted by the legislature.\"\n\n560 A.2d at 1389; see also Gardner v. Consolidated Rail Corp. SEPTA, 524 Pa. 445, 573 A.2d 1016, 1018 n. 4 (1990) (the Court once again repeated its admonition that exceptions to the grant of immunity were to be narrowly construed).\n\nIn re: Upset Sale cannot be dismissed as a mere procedural holding. It's admonition that a governmental agency may not be deprived of immunity through an agreed waiver by counsel is a strong indication that the Court would not countenance a waiver by a council either.\n\nTort immunity of municipalities is not a matter of purely local concern for Philadelphia as were the cases discussed in Borenstein. Philadelphia's precarious financial condition and its pleas for aid from the state legislature make it obvious that state taxpayers, not just Philadelphia taxpayers, are affected by a waiver of immunity.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe state Supreme Court thus far has been consistent in its application of the immunity conferred by the Tort Claims Act. I am persuaded that were this case to be presented to that Court it would hold that the Philadelphia ordinance was superseded by the Tort Claims Act. Accordingly, judgment should be entered in favor of the City on the state tort claims.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The facts of this case also are related in the district court's opinion, see Simmons v. City of Philadelphia, 728 F. Supp. 352 (E.D. Pa. 1990). For purposes of weighing the sufficiency of the evidence, I have set forth the record testimony of plaintiff's experts in somewhat greater detail than did the district court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Testimony at trial, however, indicated that one or more suicides may have occurred in the 6th District lockup prior to 1980. [ See A-A 496]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Rowan's qualifications include having served as co-director of a 1987 national survey on suicides in jails and police lockups, as Director of the American Medical Association Standards and Accreditation Program for jails, as Commissioner of Minnesota's Youth Conservation Commission, as Director of Florida's Division of Youth Services, and as the head of three prison consulting agencies. Rowan also was in charge of compiling the 1988 National Suicide Prevention Manual for Lockups and Jails and has authored two training \"keys\" on identifying and managing suicidal persons in police lockups for the International Association of Chiefs of Police.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. CALEA is an umbrella organization comprising the International Association of Chiefs of Police, the National Sheriff's Association, the Black National Law Enforcement Organization, and the National Police Forum.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. It is unclear from Guy's testimony how many turnkeys participated in the 1981 training program. Panati, however, clearly was not among the turnkeys who received training in suicide prevention.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The interrogatories, as completed by the jury, were as follows: 1. Indicate whether or not you find that under section 1983 of Title 42 U.S. Code the defendant officer acted under color of the authority of Pennsylvania to deprive the decedent of his constitutional rights. Officer A. Panati Yes No X 2. Indicate whether or not you find that under the law of Pennsylvania the defendant officer committed torts against the decedent. Officer A. Panati Yes X No 3. Indicate whether or not you find that under section 1983 of Title 42 U.S. Code the defendant City of Philadelphia had a custom, policy, or regulation which deprived the decedent of his constitutional rights. Yes X No 4. Indicate whether or not you find that under the law of Pennsylvania the defendant City of Philadelphia committed torts against the decedent. Yes X No 5. Indicate for the defendant officer [if] you have answered \"Yes\" in Question 1 or Question 2, or the city if you have answered \"Yes\" in Question 3 or Question 4, whether or not such defendants' actions were a legal cause of any harm to the decedent. (a) Officer A. Panati Yes X No (b) City of Philadelphia Yes X No 6. Indicate for the defendant officer if you have answered \"yes\" in Question 5(a) whether or not such defendant's actions were maliciously, wantonly, or oppressively done. Officer A. Panati Yes No X 7. (A) If you have answered \"Yes\" for one or more defendants in Question 5, make any award of total compensatory damages here for plaintiff. Wrongful death damages $10,000 Survival damages $990,000 (B) With regard to the defendant officer if you have answered \"Yes\" in Question 6, indicate any award of punitive damages for plaintiff. Officer A. Panati\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The district court instructed the jury as to both plaintiff's municipal policy or custom theory and her failure to train theory of the City's liability. In its opinion denying the City's motion for j.n.o.v., however, the court focused primarily on plaintiff's failure to train theory in weighing the sufficiency of the evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The district court appears to have concluded that the City waived its objection to the putative inconsistency of the jury's section 1983 verdicts for the different reason that the City failed to reference this objection in its motion for a directed verdict pursuant to Federal Rule of Civil Procedure 50. See 728 F. Supp. at 354. As I discuss infra, it is our jurisprudence under Rule 49, as opposed to Rule 50, that in my opinion governs waiver in this instance.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Fed. R. Civ. P. 49(a) provides in pertinent part: The court may require a jury to return only a special verdict in the form of a special written finding upon each issue of fact. In that event the court may submit to the jury written questions susceptible of categorical or other brief answer or may submit written forms of the several special findings which might properly be made under the pleadings and evidence; or it may use such other method of submitting the issues and requiring the written findings thereon as it deems most appropriate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Fed. R. Civ. P. 49(b) in part provides: The court may submit to the jury, together with appropriate forms for a general verdict, written interrogatories upon one or more issues of fact the decision of which is necessary to a verdict. The court shall give such explanation or instruction as may be necessary to enable the jury both to make answers to the interrogatories and to render a general verdict, and the court shall direct the jury both to make written answers and to render a general verdict.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Although Rule 49(a) appears to prescribe findings that are purely factual in nature, one analyst of the Rule has concluded that it incorporates the distinctions drawn by the drafters of the Federal Rules of Evidence among \"three categories of facts: 'ultimate, intermediate or evidentiary.'\" Brodin, supra at 85 n. 323 (quoting Advisory Committee's Note to Fed. R. Evid. 401, 56 F.R.D. 183, 216 (1973)). According to a second commentator on Rule 49, courts have, from its inception, read into the Rule the distinction between \"evidentiary\" and \"ultimate\" facts, such that Rule 49 \"guarantees only the right to have questions directed to the latter\" -- that is, to the \"ultimate\" facts constituting \"the zone of transition between questions of evidentiary fact and questions of law.\" Comment, Special Verdicts: Rule 49 of the Federal Rules of Civil Procedure, 74 Yale L.J. 483, 510 (1965). Thus, in current practice under Rule 49(a), \"the special verdict . . . is typically used to divide the dispute into 'ultimate,' not actual, facts,\" with each \"ultimate fact\" constituting, \"like the general verdict, its own impenetrable intermingling of law and fact.\" Brodin, supra, at 85 (footnotes omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Pembaur, 475 U.S. at 469, 106 S. Ct. at 1292; City of St. Louis v. Praprotnik, 485 U.S. 112, 108 S. Ct. 915, 99 L. Ed. 2d 107 (1988); Jett v. Dallas Independent School District, 491 U.S. 701, 109 S. Ct. 2702, 105 L. Ed. 2d 598 (1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. In her concurrence in the judgment, Chief Judge Sloviter emphasizes an additional passage from City of Canton, discussed infra at 66-67, in which the Court observed: It may seem contrary to common sense to assert that a municipality will actually have a policy of not taking reasonable steps to train its employees. But it may happen that in light of the duties assigned to specific officers or employees the need for more or different training is so obvious, and the inadequacy so likely to result in the violation of constitutional rights, that the policymakers of the city can reasonably be said to have been deliberately indifferent to the need. 109 S. Ct. at 1205. I agree with Chief Judge Sloviter that this passage from City of Canton, like the passages quoted above, marks the conceptual difficulty of thinking in terms of a municipal policymakers \"having a conscious, intentional policy of being 'indifferent' to deprivations of constitutional rights.\" Concurrence in Judgment at . [Sloviter typescript at 2] Deliberate indifference -- virtually an oxymoron -- uneasily yokes indifference, which connotes heedlessness, thoughtlessness, and the absence of a state of mind, with deliberation, which connotes a very definite, reflective, and even willful state of mind. Chief Judge Sloviter essentially asserts that I have given undue weight to the \"deliberate,\" or \"scienter,\" element of these uneasily yoked terms. Indeed, Chief Judge Sloviter goes so far as to claim that I nowhere acknowledge \"that liability may be based on the city's (i.e. policymaker's) reckless refusal or failure to take account of facts or circumstances [of] which responsible individuals should have known.\" Id. at . [Sloviter typescript at 3] I believe that a fair reading of the following text, in which I take pains to distinguish deliberate indifference, marked by acquiescence in a long-standing practice or custom, from the clear decisionmaking that attends the formulation of municipal policy, simply does not support this claim. Whereas I do not think that I at any point suggest that deliberate indifference may not constitute a reckless disregard of constitutionally violative circumstances, however, my discussion makes clear my opinion that Monell, City of Canton, and the Pembaur trio compel the conclusion that it is a particularly willful type of recklessness that is inherent in the deliberate indifference standard. For this reason, I conclude that Chief Judge Sloviter's reading of City of Canton emphasizes \"indifference\" to the exclusion of the word \"deliberate\" to which it is yoked.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. In her concurrence in the judgment, Chief Judge Sloviter takes considerable issue with my use of the term \"scienter\" here and in the analysis that follows. See Concurrence in Judgment, infra, at - . [Sloviter typescript at 1, 2-6] Following careful reflection, I chose to use the term, however, because I believe that it generally connotes some culpable state of mind of an identified individual, as opposed to an attitude diffusely attributable to an abstract social entity -- a distinction that, as I discuss infra, I believe that reading Monell and City of Canton in light of the Pembaur trio compels. More specifically, I believe that my consistent qualification of \"scienter\" with \"like,\" as well as my constant attempt to cabin contextually the range of the term's possible meanings, makes clear that I do not by my usage intend to exclude from the scope of scienter's meaning a municipal policymaker's deliberately indifferent acquiescence in a custom or policy of inadequately training employees, even though \"the need for more or different training is [very] obvious, and the inadequacy [quite] likely to result in the violation of constitutional rights.\" City of Canton, 489 U.S. at 390. Indeed, I think that, read in context, my use of \"scienter-like\" obviously comprehends that shade of meaning of \"scienter\" that Chief Judge Sloviter rightly emphasizes -- to wit, \"'the defendant's previous knowledge of the cause which led to the injury complained of, or rather his previous knowledge of a state of facts which it was his duty to guard against, and his omission to do which has led to the injury complained of.'\" Concurrence in Judgment, infra, at (quoting Black's Law Dictionary 1207 (5th ed. 1979)). [Sloviter typescript at 3] I therefore also believe that my use of \"scienter\" is not susceptible, as Chief Judge Sloviter fears, to a misreading that would limit section 1983 cases \"to those where plaintiffs can show defendants knew of the constitutional deprivation, and excluding those where plaintiffs argue that defendants should have known of it.\" Id. at . [Sloviter typescript at 3] I note that Chief Judge Sloviter grounds this fear in the equation of \"scienter\" with \"intent\" in the discussion of tortious misrepresentation actions in Prosser \u0026 Keeton, The Law of Torts § 107, at 741-43 (5th ed. 1984), on this basis asserting that \"'scienter' . . . suggests the need to prove an intentional course of action.\" Concurrence in Judgment at . [Sloviter typescript at 2] This narrow view of the semantics of \"scienter,\" however, is controverted by the considerable range of meanings attributed to the term in our own jurisprudence. See, e.g., Berda v. CBS, Inc., 881 F.2d 20, 27 (3d Cir. 1989) (to maintain claim for tortious misrepresentation under Pennsylvania law, a plaintiff must establish, inter alia, \"'scienter, which may be either actual knowledge of the truth of falsity of the representation, reckless ignorance of the falsity of the matter, or mere false information where a duty to know is imposed . . . by reason of special circumstances'\") (emphasis added and citation omitted), cert. denied, 493 U.S. 1062, 110 S. Ct. 879, 107 L. Ed. 2d 962 (1990); Eisenberg v. Gagnon, 766 F.2d 770, 777 (3d Cir.) (\"[A] showing of recklessness is sufficient to establish scienter for a claim under [the Securities Exchange Act of 1935] § 10(b).\"), cert. denied, 474 U.S. 946, 106 S. Ct. 342, 88 L. Ed. 2d 290 (1985); In re Complaint of Bankers Trust Co., 752 F.2d 874, 883 (3d Cir. 1984) (whereas scienter element of establishing fraudulent misrepresentation may be proven in India by showing \"either intent or reason to expect that the representations will be acted upon by the person to whom they were made,\" mere false information can satisfy scienter component in Pennsylvania where duty to know is imposed). Because we clearly have acknowledged that \"scienter\" may encompass types of reckless indifference, as well as actual knowledge, I believe that I am entirely justified in using the term in this context.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The Praprotnik plurality succinctly summarized Pembaur 's criteria as follows: First, . . . municipalities may be held liable under § 1983 only for acts for which the municipality itself is actually responsible, \"that is, acts which the municipality has officially sanctioned or ordered.\" Second, only those municipal officials who have \"final policymaking authority\" may by their actions subject the government to § 1983 liability. Third, whether a particular official has \"final policymaking authority\" is a question of state law. Fourth, the challenged action must have been taken pursuant to a policy adopted by the official or officials responsible under state law for making policy in that area of the city's business. Id. at 924 (citations omitted and emphasis in original).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. I do not intend to intimate, however, that the municipal actor, who may be insulated from liability by some form of immunity, actually must be held liable under section 1983.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Because I have concluded that a municipality's section 1983 liability is conditioned on the liability of a municipal actor who is a high-level policymaker, as opposed to a low-level employee, I note that there is no danger that a municipality will be able, as plaintiff has contended, to insulate itself from liability through failing to train its employees.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The Williams plaintiffs based their section 1983 claim primarily on the deliberate indifference of several police officers and officials of the Borough of West Chester, whom they alleged had actual knowledge of the decedent's suicidal tendencies as a result of his prior suicide attempts. 891 F.2d at 465-66. Although the plaintiffs submitted an affidavit that they also would introduce expert testimony of the defendants' deliberate indifference in light of the national minimum standards for jail suicide prevention, they adduced no evidence of prior suicides in the Borough's jails, and their theory of the Borough's liability -- in contrast to plaintiff's theory in this case -- primarily was vicarious, as opposed to direct. Id. at 463, 467.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. I note that my analysis of the elements of establishing a municipal policy or custom, as well as a deliberately indifferent failure to train, also appears to comport with our cases, decided prior to the Supreme Court's decisions in Canton and Jett, concerning the requisites of stating a viable claim under section 1983 based on a jailhouse suicide. In Colburn v. Upper Darby Township, 838 F.2d 663 (3d Cir. 1988), cert. denied, 489 U.S. 1065, 109 S. Ct. 1338, 103 L. Ed. 2d 808 (1989), we suggested that scienter-like evidence of decisionmaking on the part of policymaking officials constituted an essential element of establishing a section 1983 claim alleging an unconstitutional municipal policy or custom, and held that an official policy may arise from the informal acts or omissions of \"'supervisory municipal officials.'\" Id. of 671 (citation omitted). In Colburn, we further suggested that in order to establish a section 1983 claim against a municipality, arising from a jailhouse suicide and premised on the failure to provide employees with adequate training, a plaintiff must present evidence of a policymaker's knowledge of a constitutionally violative incident or pattern of incidents arising from inadequate training. Id. at 673. See also Freedman v. City of Allentown, 853 F.2d 1111, 1115-16 (3d Cir. 1988) (discussing Colburn 's requirements for stating a section 1983 claim based on a jailhouse suicide and alleging violations of constitutional rights arising from a municipal policy or custom and a failure to train).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. I note in this regard that the Supreme Court, in Wilson v. Seiter, 115 L. Ed. 2d 271, 111 S. Ct. 2321 (1991), recently held that, in order for a prisoner to establish a section 1983 claim that conditions of confinement violate the eighth amendment's prohibition against cruel and unusual punishment, the prisoner must show that prison officials possessed \"a culpable state of mind\" -- to wit, deliberate indifference. Id. As I discuss infra, at 50-51, the deliberate indifference standard formulated above for determining whether the City, by means of a policy or custom, breached a constitutional duty to Simmons is derived from this court's decisions holding that pretrial detainees are entitled to at least the same level of medical care as that to which convicted prisoners are entitled under the eighth amendment. In determining that the presentation of scienter-like evidence with respect to specific City officials constituted an essential element of plaintiff's section 1983 action against the City, I have relied principally on the Supreme Court's trio of cases setting forth the prerequisites for establishing a municipal policy or custom. I think, however, that Wilson 's holding in the eighth amendment context further supports my conclusion that, in order to establish that the City was deliberately indifferent to the needs of intoxicated and potentially suicidal detainees, plaintiff must have adduced scienter-like evidence of the deliberate indifference of specific policymakers.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. I do not intimate that, if the district court had determined the Police Commissioner to be the responsible policymaker in the areas in question, plaintiff, in order to subject the City to liability, would have had to obtain a verdict against him, or even to have continued to name him as a defendant in the action. Plaintiff, however, would at least have had to adduce evidence -- through the Commissioner's testimony or otherwise -- concerning his knowledge and his decisionmaking or acquiescence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. In Colburn I, we vacated the district court's order dismissing a section 1983 action alleging that deliberate indifference on the part of a municipality and a prison custodian caused the jailhouse suicide of the plaintiff's decedent. However, in Colburn v. Upper Darby Township, 946 F.2d 1017 (3d Cir. 1991) (\" Colburn II \"), we recently held that the plaintiff had adduced insufficient evidence of either the custodian's or the municipality's deliberate indifference to survive the defendants' motion for summary judgment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. In Colburn I, in response to the plaintiff's allegations that individual defendants had knowledge of the suicidal tendencies of her decedent, this court arrived at a functionally identical, if somewhat differently articulated, standard for determining whether individual defendants have breached a constitutional duty toward a particular detainee. In that context, we held that although \"custodial officials cannot be placed in the position of guaranteeing that inmates will not commit suicide,\" the fourteenth amendment imposes on such officials \"who know or should know of the particular vulnerability to suicide of an inmate . . . an obligation not to act with reckless indifference to that vulnerability.\" 838 F.2d at 669.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. In her concurrence in the judgment, Chief Judge Sloviter criticizes this reading of Bell -- and of Partridge 's reference to Bell 's balancing consideration of a legitimate countervailing governmental objective. See Concurrence in Judgment, infra, at . [Sloviter typescript at 6-9]. Chief Judge Sloviter asserts that \"the reference in Bell to a legitimate 'governmental objective' was merely to ascertain whether the conditions imposed on pretrial detainees amount to 'punishment.'\" See id. at . [Sloviter typescript at 7] As Chief Judge Sloviter emphasizes, although the Bell Court concluded that conditions of confinement do not constitute punishment if those conditions are \"reasonably related to a legitimate [governmental] goal,\" 441 U.S. at 539, 99 S. Ct. at 1874, I apply Bell 's balancing consideration in the context of determining whether conditions of confinement are tainted by deliberate indifference to a detainee's serious medical needs. However, I believe that the Bell Court's articulation of this balancing consideration compels my conclusion, in the context of a similar fourteenth amendment challenge to the constitutionality of conditions of confinement, that confinement conditions cannot be considered to be tainted by deliberate indifference if, having considered the serious medical needs of suicidal pretrial detainees and having taken all reasonable steps to address those needs, government policymakers determine that, due to security, institutional discipline, or other weighty reasons, including fiscal prohibitiveness, they simply can do no more to protect these unfortunate detainees from themselves. I believe, therefore, that the distinction between Bell, in which the petitioning pretrial detainees claimed that the conditions of their confinement violated their fourteenth amendment liberty rights, and this case, in which plaintiff claims that Simmons's conditions of confinement violated his fourteenth amendment rights to both liberty and life, is a distinction with only one material difference. That difference, which I discuss infra, at note 25, concerns the weight that a governmental interest must possess, in order to be legitimate, when the fourteenth amendment deprivation alleged is that of life itself.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. In Bell, 441 U.S. at 539, 99 S. Ct. at 1873, the Supreme Court articulated the balancing consideration of a \"legitimate governmental purpose\" in the context of evaluating the constitutionality of conditions of pretrial confinement \"that implicate only the protection against deprivation of liberty without due process of law.\" Id. at 535, 99 S. Ct. at 1872 (emphasis added). When conditions of confinement affect serious medical needs and implicate due process protections against the deprivation of life itself, I believe that a governmental purpose, in order to be legitimate, may have to be relatively more weighty than would be necessary in the context of a deprivation of liberty.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. In his dissent, Judge Weis, like the City, urges that the City could not reasonably be found to have been deliberately indifferent in part because, out of a total of 97.141 persons arrested for public intoxication, \"a percentage rate of .00015\" committed suicide. Dissent, infra at . (Weis typescript at 1.) Judge Weis, in weighing the sufficiency of the evidence, similarly questions \"whether the decedent had demonstrated any serious medical need.\" Dissent, infra at . (Weis typescript at 4.) As I discuss in the text that follows, I find that this focus on the statistical -- or even apparent -- probability that a particular intoxicated detainee would commit suicide misconceives the fundamental question in determining whether the minimum quantum of the evidence exists to support the jury's determination that Simmons's suicide was causally related to City policymakers' deliberate indifference to the serious medical needs of intoxicated and potentially suicidal detainees. I take this question to be whether, in light of the totality of the constitutional injury suffered by the entire group of such detainees, the deliberate or acquiescent election of 'city policymakers to take no other suicide prevention measures than instituting the directives from which Judge Weis quotes at length, see Dissent, infra at [Weis typescript at 2-3] constituted deliberate indifference that causally contributed to Simmons's suicide.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. As I have discussed, supra, at note 24 and the text accompanying it, I mean by this statement no more than that, if the evidence showed that the City had taken into account the serious medical needs of suicidal detainees and had taken all reasonable steps to protect them, in light of security, fiscal, and other constraints, the City could not be held to have been deliberately indifferent to those serious medical needs. As I emphasize infra, at 65-66, I do not intimate that cost-benefit analysis is appropriate in the constitutional context.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. In his dissent, Judge Weis urges that, because the record \"clearly shows that the City, through directives to its police officers, had adopted a policy to limit or eliminate suicides that occurred in its jails,\" the City cannot be found to have had a custom or a policy tainted by deliberate indifference to the serious medical needs of intoxicated and potentially suicidal detainees. Dissent, infra at . [Weis transcript at 1] Paraphrasing the Eighth Circuit's opinion in Rellergert v. Cape Girardeau County, 924 F.2d 794, 797 (8th Cir. 1991), Judge Weis asserts that \"[a] city cannot be both deliberately cautious and deliberately indifferent.\" Dissent, infra at . (Weis typescript at 8.) Judge Weis concludes, in essence, that the implementation of some measures intended to reduce the risk of suicides in City lockups negates the possibility that City policymakers could be found to have been anything more than negligent in addressing the medical needs of intoxicated and suicidal detainees. I believe, however, that this reasoning proves too much and that in some cases deliberate indifference may indeed coexist with deliberate, but insufficient, caution. Two clearly untenable corollaries attend Judge Weis's logic. First, under Judge Weis's reasoning, municipal policymakers, exercising deliberate caution, could take steps that they subsequently discover to be ineffective in redressing constitutional violations. However, Judge Weis further implies that, notwithstanding this knowledge, these initially-cautious policymakers could avoid any constitutional liability for wilfully failing to take further measures to protect the constitutional rights of the citizens affected by the infirm policy. Second, if formulated as a legal rule applicable to future cases, Judge Weis's reasoning, thus dissolving the spectre of deliberate indifference, would create incentives for municipal policymakers to take meager measures that they know or should know to be ineffectual in preventing specific violations of constitutional rights. I therefore conclude that the City's police directives concerning fifteen minute checks, the double-celling of detainees, and the removal of personal articles do not, in and of themselves, preclude the City's constitutional liability for a policy or custom tainted by deliberate indifference. I note, in addition, that I do not read Rellergert to stand for the proposition that they do. In Rellergert, the Eighth Circuit held that a defendant sheriff and deputy were entitled to qualified immunity, notwithstanding the section 1983 verdict against them in a jail suicide case, because the considerable measures that these officials took to prevent the suicides of detainees in general and of the decedent in particular did not demonstrate deliberate indifference. Id. Notably, it was to the defendant officials' implementation in the decedent's case of a policy of housing suicidal inmates in a common area in which they could be kept under nearly constant observation -- and not to a general municipal policy -- that the Rellergert court referred in asserting that \"the policy could not have been both deliberately cautious about [the decedent's] risk as a suicide and deliberately indifferent about it.\" Id. Both the central issue (the defendant officials' entitlement to qualified immunity) and the nature of the deliberate caution exercised in Rellergert distinguish that case from this one.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Judge Weis concludes that, because the record contains no explanation for the variations in numbers of yearly suicides in City lockups, \"the statistics . . . do not demonstrate that the policy set out in the 1982 Directives was ineffective or that additional training was required.\" Dissent, infra at . [Weis transcript at 4] Although I agree with Judge Weis that the record contains no evidence linking the suicides that the statistics document to violations of the directives or unlawful conduct on the part of jail personnel, I by no means draw the same conclusion. Rather, I believe that, absent some evidence that more strenuous preventive measures would not have diminished the numbers of suicides that occurred in the years surveyed, the jury reasonably could have inferred that the existing directives did not sufficiently address the serious medical needs of intoxicated and potentially suicidal detainees. To my mind, this conclusion is necessitated by the elements of plaintiff's case that the court must take as established in light of the City's waiver -- namely, that City policymakers were aware both of the number of yearly suicides occurring in City lockups and of the alternatives, in addition to the directives, for preventing them.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Surveying a considerable number of recent cases involving jail suicides, Judge Weis asserts, in his dissent, that \"expert evidence of this nature does not support a claim of deliberate indifference by a municipality.\" Dissent, infra at 6. [Weis typescript at 6] Particularly in light of our highly deferential standard of review of the jury's deliberate indifference verdict, discussed supra at 62, and the knowledge on the part of City policymakers that I believe that this court, given the City's waiver, is obligated to take as established, I do not agree with Judge Weis's analysis. More specifically, I believe that the opinions on which Judge Weis relies do not support his conclusion that the expert testimony in this case, in tandem with the statistical and other testimony of plaintiff's witnesses, fails to supply the \"minimum quantum of evidence\" from which the jury reasonably could have concluded that City policymakers were deliberately indifferent to the serious medical needs of intoxicated and potentially suicidal detainees. Kinnel, 850 F.2d at 961. In urging that the foregoing expert testimony could, at best, support the conclusion that City policymakers were negligent in failing to take further measures to prevent lockup suicides, Judge Weis quotes from our decision in Williams. In Williams we stated that claims that the municipality had violated the decedent's rights by failing to require the removal of detainees' belts, to install visual surveillance equipment in the cell block area, to allocate funds for the treatment of detainees with mental health problems, and to train officers in the handling such detainees at most amounted to allegations of negligence. 891 F.2d at 467 n. 14. However, as I have discussed at length, see supra at 42-43 \u0026 n. 18, Williams, a summary judgment case primarily predicated on the deliberate indifference of the police officers who dealt with the decedent and in which we concluded, inter alia, that the plaintiff had failed to show any causal nexus between the decedent's suicide and a municipal policy or custom with respect to mentally ill detainees, posed a problem distinct from that in this case. I therefore find Judge Weis's focus on our statement in Williams to be misplaced. Further, Molton v. City of Cleveland, 839 F.2d 240 (6th Cir. 1988), Popham v. City of Talladega, 908 F.2d 1561 (11th Cir. 1990), and Rellergert v. Cape Girardeau County, 924 F.2d 794 (8th Cir. 1991), also are distinguishable. Molton, like this case, constituted an appeal from the district court's denial of the defendant city's motion for j.n.o.v., following a jury verdict of deliberate indifference in a jail suicide case. See 839 F.2d at 240. The Molton court determined that the defendant city was entitled to j.n.o.v. primarily because the plaintiff had adduced insufficient evidence that the city's failure to provide adequate training for its police officers and to make physical feature changes in its jail cells to prevent suicides amounted to a policy or custom. See id. at 246. Because the City, in the case sub judice, failed to preserve on appeal the issue whether plaintiff had presented the type of evidence necessary to establish a municipal policy or custom, the element of the plaintiff's case at issue in Molton is precisely the element that we must take as established here. Rellergert was a qualified immunity appeal concerning whether the evidence was sufficient to establish the deliberate indifference of individual police officers. Rellergert simply did not address the issue whether a municipality's failure to institute a more rigorous suicide prevent policy -- or its acquiescence in a custom of taking inadequate preventive measures -- could constitute deliberate indifference. See 924 F.2d at 796-98. Popham, similarly to Rellergert, involved the issue whether, for purposes of summary judgment, the evidence tended to demonstrate the deliberate indifference of individual jailors. Whereas the Popham court, in the passage quoted infra by Judge Weis at (Weis typescript at 7), emphasized that the jailors had followed municipal directives requiring the removal of personal effects with which detainees might injure themselves, the court nowhere addressed the issue whether the directives negated deliberate indifference on the part of the municipality.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. In my opinion, not only the procedural posture and the requisite evidentiary assumptions, but also the nature of the City's suicide prevention measures, distinguish this case from Colburn v. Upper Darby Township, 946 F.2d 1017 (3d Cir. 1991) (\" Colburn II \"), discussed supra at note 22. In Colburn II, we held, inter alia, that the defendant municipality was entitled to summary judgment with respect to the plaintiff's claim that the municipality had an unconstitutional policy or custom tainted by deliberate indifference to the needs of intoxicated and potentially suicidal detainees. As in this case, the evidence presented in Colburn II showed that written policies governing police conduct provided that persons arrested for public intoxication were to be frisked upon arrest, searched upon arrival at the station house, relieved of personal belongings that could pose a danger either to the arrestee or to other detainees, and, once behind bars, periodically checked. 946 F.2d at , . [ Colburn II typescript at 8-9, 25] In marked contrast to the evidence presented in this case, however, the evidence presented in Colburn II also showed that, pursuant to municipal policies and police directives, jailors assigned to monitor detainees were given no other duties; detainees were monitored continuously by means of a video camera and a closed circuit television; detainees were provided with any medical attention that appeared to be necessary; and a crisis intervention officer, trained to handle emergency situations including suicides, was on call during each shift. Id. at . [ Colburn II typescript at 9-10] Further, in Colburn II we concluded that \"the custodian's implementation of the municipal policy appears to have been relatively efficacious, having thwarted something like eighteen of twenty suicides in the last ten years.\" Id. at . [ Colburn II typescript at 29] The statistical evidence, therefore, and the evidence concerning the nature and the efficacy of the suicide-prevention measures that the City had taken prior to Simmons's suicide, set this case apart from Colburn II.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. My responses to Judge Weis's dissent in the previous section, concerning the sufficiency of the evidence with respect to a deliberately indifferent policy or custom on the part of the City, apply in large part to my conclusion in this section that plaintiff adduced sufficient evidence to support a jury verdict that the City was deliberately indifferent in failing to train its officers.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Judge Weis appears to suggest that the training measures testified to by plaintiff's experts constituted training \"to medically screen prisoners to detect suicidal tendencies\" -- a task that would \"'require[] the skills of an experienced medical professional with psychiatric training, an ability beyond that required of the average police officers by the due process clause.'\" Dissent, infra at (quoting Burns v. City of Galveston, 905 F.2d 100, 104 (5th Cir. 1990)). [Weis typescript at 9.] In my view, however, the basic training in obvious symptoms of suicidal tendencies or in the statistical profile of a suicidal detainee that plaintiff's experts discussed is a far cry from the type of sophisticated medical training that Judge Weis rightly rejects.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. In concluding that the record contains insufficient evidence to support plaintiff's theory that the City demonstrated deliberate indifference in failing to train its officers adequately, Judge Weis asserts that \"neither the arresting officers nor Panati found the detainee's actions to be different than [those of] others they had in their custody previously.\" Dissent, infra at ___. [Weis typescript at 9] I believe, however, that this assertion is undermined by (1) evidence that the arresting officers informed Panati that Simmons was crying and upset at the time that he was taken into custody, see supra at 5; and (2) Reginald Rosemond's testimony, see supra at 16-17, that the officer who informed the family of Simmons's death told him that Simmons had acted peculiarly while in detention and, because intoxicated, was at a high risk to commit suicide.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. In Colburn II, discussed supra, at notes 22 and 31, this court affirmed the district court's decision granting summary judgment to the defendant municipality on the plaintiff's claim that the defendant had, as a result of deliberate indifference, failed to train its police officers adequately in suicide detection and prevention. In that case, the defendant municipality presented evidence that the decedent, although intoxicated at the time that she committed suicide, had shown relatively few symptoms of unusual agitation or distress. See id. at . [ Colburn II typescript at 5-7, 27-28] The municipality also presented evidence that, although it did not provide its police officers with formal training in suicide prevention, jail custodians received on-the-job training in handling intoxicated detainees and were instructed \"to listen for threats of self-inflicted injury and to watch for signs of emotional instability.\" Id. at . [ Colburn II typescript at 10] In addition, the police officers charged with monitoring detainees apparently knew that \"if a detainee appeared to be emotionally upset, [the officers should] talk to them in an effort to calm them down[,] . . . personally visit the cell more frequently,\" and contact the trained crisis intervention officer on call during every shift. Id. at . [ Colburn II typescript at 10] In Colburn II, we therefore concluded that the evidence failed to establish the requisite causal nexus between the failure to train and the constitutional injury and that, particularly in light of the number of suicides prevented, the training that prison custodians had received in implementing the municipality's suicide-prevention policies appeared to have been relatively effective. Colburn II, 946 F.2d at . [ Colburn II typescript at 28-29] In contrast, the evidence presented in this case fails to suggest that Officer Panati and other City police officers responsible for detainees were, formally or informally, provided with training similar to that which the jail custodians received in Colburn II -- training that comports in a number of respects with the training recommended by plaintiff's experts in this case. Further, there is in my opinion a minimum quantum of evidence from which a reasonable juror could in this case conclude that the City's failure to provide its officers with such training constituted a legal cause of Simmons's suicide.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. The City also raised in its trial brief the argument that Simmons's wanton conduct in hanging himself removed the case from Pennsylvania's Comparative Negligence Act. The City subsequently abandoned that argument, however, and it is not before us.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. The district court instructed the jury that it could consider the City's police directives in connection with plaintiff's section 1983 claim. [A-A 657] With respect to plaintiff's state claims, the court instructed the jury that it could consider whether the City had committed torts against Simmons first \" through its policies and directives,\" or, second, under a theory of respondeat superior. [A-A 674] The district court instructed the jury separately on state tort law standards of duty and at no point did the court tell the jury that noncompliance with the City's directives amounted to a breach of a duty of care under Pennsylvania negligence law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Indeed, the transcript of the colloquy between counsel and the bench concerning the proposed jury instructions suggests that plaintiff's counsel sought, but as a result of the objections of counsel for the City and the advice of the court withdrew, an instruction that the police officers who dealt with Simmons were \"under a duty to follow a directive\" and that \"the jury [could] consider that if [the police] violated that directive, that could be considered negligent.\" [A-A 278-80]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. The City bases this argument on the statement of its counsel in the course of the colloquy on proposed jury instructions that \"[it] doesn't mean this person couldn't make a decision regarding his own life or death at a particular point in time.\" [J-A 284] The City construes this statement as an objection to the court's approval of and decision to use, in the instruction on Simmons's duty of care, language from a Pennsylvania wills and estates statute that plaintiff had proposed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. Plaintiff's counsel, as the City suggests, proposed a jury instruction that would have adopted the definition of \"incompetent\" in Title 20 of the Pennsylvania Consolidated Statutes, which concerns decedents, estates, and fiduciaries. This definition states that an incompetent person is \"a person who, because of infirmities of old age, mental illness, mental deficiency or retardation, drug addiction or inebriety . . . lacks sufficient capacity to make or communicate responsible decisions concerning his person.\" 20 Pa. Cons. Stat. Ann. § 5501 (Purdon 1975 \u0026 Supp. 1990). As the City argues, the statement of its counsel appears to constitute a summary of and an objection to the use of this language in jury instructions. A comparison of the foregoing statutory language with the language of the court's actual instruction concerning Simmons's duty of care, however, reveals that the court did not use the statutory language to which the City objected. Plaintiff's counsel, moreover, appears to have withdrawn the proposed instruction. [J-A 284]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. I note at all events that, because the McMichael defendant, in contrast to the City, had no custodial or other relationship with the intoxicated plaintiff that might have given rise to a heightened duty to him, McMichael is distinguishable from this case. Indeed, the issue whether a detainee's intoxication may lower or obviate his duty of care appears to be one of first impression for the Pennsylvania courts. Courts in a number of states have held that, whereas voluntary intoxication does not necessarily relieve a detainee of the duty to exercise due care for his own safety, it is for the jury to determine whether the detainee's intoxication rendered him incapable of exercising such care and, if so, whether his jailers knew or should have known of his incapacity and thus should have taken steps to protect him from self-inflicted harm. See, e.g., Dezort v. Village of Hinsdale, 35 Ill. App. 3d 703, 710-11, 342 N.E.2d 468, 474 (1976) (with respect to municipality's liability for negligence in suicide of intoxicated and extremely depressed detainee, decedent's voluntary intoxication was \"not negligence per se but simply a circumstance to be weighed by the jury in its determination of the issue of due care\"); Thornton v. City of Flint 39 Mich. App. 260, 197 N.W.2d 485 (1972) (question whether plaintiff was contributorily negligent in inflicting serious injuries on himself while in delirium tremens or whether defendant jailers negligently caused those injuries by failing to take protective steps was for jury to decide); Thomas v. Williams, 105 Ga. App. 321, 124 S.E.2d 409 (1962) (police officers held charged with knowledge that heavily intoxicated prisoner was incapable of exercising due care for his own safety and to be under duty to take measures to protect the prisoner from setting fire to his cell and incurring serious injuries). According to one source, these holdings represent the majority rule on this issue. See Annotation, Civil Liability of Prison or Jail Authorities for Self-Inflicted Injury or Death of Prisoner, 79 A.L.R. 3d 1210, 1215 (1977 \u0026 Supp. 1990) (collecting cases and concluding that \"the courts have generally held that [voluntary] intoxication does not constitute negligence per se, and that the relevant inquiry is whether the prisoner, in his intoxicated state, is capable of exercising reasonable care for his own safety, and whether the authorities know or should know of his helpless condition\"). In view of this jurisprudence, the district court's instructions -- which essentially predict that the Pennsylvania Supreme Court would hold that a jury may consider whether an intoxicated detainee was unable to exercise due care for his own safety and may determine that municipal actors were negligent in failing to prevent a self-inflicted injury -- seem reasonable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. The district court's only causation instruction to the jury on an increased risk of harm was with respect to plaintiff's federal claim. The court instructed the jury that it could determine that a City policy caused Simmons's death if that policy \"increased the risk of harm\" to him. [A-A 658] The court's causation instruction relating to negligence and the City's liability to plaintiff under state law was as follows: \"It is not enough to be negligent[;] that negligence must be a legal cause, a substantial factor, in causing injury. . . . [Negligence] must be a legal cause of injury to someone in order for you to be responsible for their injuries.\" [A-A 662]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. It is clear from my reading of the record that the City sought a jury instruction on the prerequisites to a duty to protect Simmons from his suicidal tendencies that would directly have employed Melendez 's three-pronged test for a special relationship. It also is clear to me that counsel for the City at several points objected, at least informally, to the court's decision to employ a more liberal duty standard than that set forth in Melendez and thus to instruct the jury that, in order to hold the City liable for the failure to take reasonable measures to prevent Simmons's suicide, it must determine that those who held him in custody \"knew or should have known\" of the potential for harm arising from his particular vulnerability to suicide. The record, however, contains some suggestion that the City may have withdrawn its objection to the instruction that the district court adopted on the duty issue. After objecting to the \"knew or should have known\" language in plaintiff's proposed instruction, the City explicitly agreed to this language and made no comment when the district court rejected the third element of the Melendez test. Counsel for the City, however, subsequently renewed his objection to the court's refusal to adopt Melendez 's prerequisites in its instructions, stating \"You know, Judge, actually, I don't know if we're going to come to terms with [the proposed instruction].\" [J-A 291-92] The court then explained why it would not use these prerequisites in instructing the jury and asked counsel whether there was \"anything further.\" Counsel for the City did not renew his objection to the duty instruction and instead responded with a question concerning a different instruction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. The Common Pleas Court of Philadelphia County, however, has on two occasions held that Melendez 's prerequisites apply in determining whether the police have a duty to protect an individual whom they have taken into custody. See Holsworth v. Specialty Club, Inc., 20 Phila. 529 (1990), Kluska v. City of Philadelphia, 20 Phila. 45 (1985). Although I conclude infra that the district court reasonably arrived at the opposing conclusion that Melendez does not apply in the context of custody, I note that the Common Pleas Court in both instances determined that the three prongs of Melendez 's special relationship test had been met as a result of the custodial relationship between City police and the individual who had been taken into custody. See Holsworth, 20 Phila. at 529; Kluska, 20 Phila. at 45.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. As interpreted by the district court, Melendez 's special relationship test serves to supplant, under the circumstances in which it is met, the more harsh common-law rule that, absent some form of custodial relationship, an individual generally is under no duty to aid or protect another, even though the individual realizes or should realize that such aid or protection is necessary to ensure the safety of the other. See Restatement (Second) of Torts § 314 (1965).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. The City correctly contends that the district court erred in its opinion denying the City's motion for j.n.o.v. insofar as the court concluded that the Supreme Court's holding in DeShaney, 109 S. Ct. at 998, concerning the constitutional duty owed to a detainee, provided the applicable standard of duty in the negligence context. See 728 F. Supp. at 359. It is clear, however, that the court did not instruct the jury that it should apply DeShaney 's standard in determining whether Panati and the City breached a duty to Simmons under state law. Instead, as we discuss, the court derived the duty standard on which it instructed the jury from the Restatement (Second) of Torts (1965).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. I note that the Pennsylvania Supreme Court historically has been a strong Restatement court. See, e.g., Mitzelfelt v. Kamrin, 526 Pa. 54, 584 A.2d 888 (Pa. 1990) (holding that Restatement (Second) of Torts § 323(a) provides standard for determining whether negligent performance of services caused injury); Hamil v. Bashline, 481 Pa. 256, 268, 392 A.2d 1280, 1286 (1978) (\"Section 323(a) of the Restatement of Torts has been part of the law of Pennsylvania for many years.\"); Azzarello v. Black Brothers Co., 480 Pa. 547, 391 A.2d 1020 (1978) (continuing to approve Restatement (Second) of Torts § 402A, concerning strict liability for defective products, although holding that phrase \"unreasonably dangerous\" from this Restatement section should not be used in instructing jury).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. The first section of the Act codifies Pennsylvania's prior common law rule of sovereign immunity, stating: \"Except as otherwise provided . . ., no local agency shall be liable for any damages on account of any injury to a person or property caused by any act of the local agency or an employee thereof or any other person.\" 42 Pa. Cons. Stat. Ann. § 8541 (1982). As we discuss, infra, the Act subsequently sets forth eight exceptions to this general rule of immunity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. The PSTCA provides that a local agency or its employees may be liable for damages arising from (1) the operation of a motor vehicle; (2) the care, custody, or control of personal property; (3) the care, custody, or control of real property; (4) a dangerous condition of trees, traffic control signs or signals, and street lighting; (5) the dangerous condition of utility service facilities; (6) the dangerous condition of streets; (7) the dangerous condition of sidewalks; and (8) the care, custody, or control of animals. 42 Pa. Stat. Ann. § 8522(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. The Philadelphia City Council originally enacted the ordinance in 1962 to waive immunity for the negligence or unlawful conduct of all City employees; the ordinance was amended in 1971 to limit the City's waiver to liability arising from the negligence or unlawful conduct of police officers. See Borenstein, 595 F. Supp. at 857.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. We note in this connection that, although Middleton, as a decision of an intermediate court of appeals of Pennsylvania, does not control the resolution of this issue, it nonetheless is entitled to \"due regard\" as an \"indicia of how the state's highest court would decide the matter.\" Ciccarelli v. Carey Canadian Mines, Ltd., 757 F.2d 548, 553 (3d Cir. 1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. The City's contention that it possesses sovereign immunity from liability for delay damages is defeated by Pivorotto v. City of Pittsburgh, 515 Pa. 246, 528 A.2d 125 (1987). In Pivorotto, the Pennsylvania Supreme Court construed the Pennsylvania Constitution to suspend the operation of statutes that conflict with Court-promulgated procedural rules, such as Rule 238. The Pivorotto court therefore held that, notwithstanding a conflicting statute that appeared to provide for sovereign immunity, the city of Pittsburgh was not immune from having to pay delay damages. The City's second contention that any award of Rule 238 delay damages has been precluded by Monessen Southwestern Railway Co. v. Morgan, 486 U.S. 1306, 108 S. Ct. 1837, 100 L. Ed. 2d 349 (1988), in which the Supreme Court held that prejudgment interest could not be awarded pursuant to Rule 238 in an action brought under the Federal Employers' Liability Act, fails because Monessen clearly is distinguishable. The City's final contention that Rule 238 violates the guarantees of due process and equal protection under the Pennsylvania and United States Constitutions is disposed of by our recent decision in Knight v. Tape, Inc., 935 F.2d 617, 627-30 (3d Cir. 1991).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. I do not join Part II. A of Judge Becker's opinion because in my view of the case (as he ultimately concludes) the jury verdict can be upheld on the basis of the City's liability independent of Panati's culpability. Therefore, neither the jury's alleged inconsistent responses nor the City's possible waiver with respect to them is relevant to my vote to affirm. I do agree, however, with Judge Becker's conclusion in Part III.B.1 that the City waived its claim that plaintiff failed to identify the responsible policyholder in charge of training. I also agree with Judge Becker's analysis of the distinction between this case and Colburn II as set forth in footnotes 31 and 35.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. In light of the phrasing of jury interrogatory 3 which merely required it to decide whether the City \"had a custom, policy, or regulation which deprived the decedent of his constitutional rights,\" see Becker Typescript Op. at n. 6, I do not discuss whether there is a conceptual distinction between an unconstitutional municipal custom or policy, discussed in Judge Becker's opinion at Part II.A.2, and the City's failure to train, discussed at Part II.A.3. Even if they constitute a unitary claim for recovery, I believe the evidence is sufficient to support the jury's verdict on that claim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Jett v. Dallas Indep. School Dist., 491 U.S. 701, 105 L. Ed. 2d 598, 109 S. Ct. 2702 (1989); City of St. Louis v. Praprotnik, 485 U.S. 112, 99 L. Ed. 2d 107, 108 S. Ct. 915 (1988); Pembaur v. City of Cincinnati, 475 U.S. 469, 89 L. Ed. 2d 452, 106 S. Ct. 1292 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. As distinguished from what he denominates as a \"particularly willful type of recklessness.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. We need not decide whether \"gross negligence\" is itself a standard for liability because it is, in any event, of evidentiary significance. See Colburn I, 838 F.2d at 670 n. 4 (quoting Doe v. New York City Dep't of Social Services, 649 F.2d 134, 143 (2d Cir. 1981) (\"gross negligent conduct creates a strong presumption of deliberate indifference\")).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. I do not accept Judge Becker's conclusion that because the City has waived its argument that plaintiff failed to establish the element of scienter, the facts necessary to prove that element of the plaintiff's case must be assumed to be established. It is a logical non sequitur to conclude that waiver of a legal theory or argument based on certain facts thereby establishes the existence of those facts to defeat an argument on another theory. Put another way, if a party points to the fact that certain evidence is not in the record, and from that absence argues that theory A applies, he may nevertheless fail on that contention because of failure to raise the legal theory at the appropriate time. The waiver of the right to argue theory A, however, in no way puts into the record evidence to defeat theory B (which was not waived). A void in the record cannot be filled by non-existent evidence. Therefore, even if it waived the right to argue for judgment n.o.v. on the theory of lack of scienter, for example, the City did not concede the existence of (non-produced) evidence which could be used to defeat its theory that plaintiff failed to produce sufficient evidence to establish the inadequacy of the measures the City implemented. See e.g., n. 29, typescript page 64, 65.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. One of the publications cited by the expert, Lindsay M. Hayes, And Darkness Closes In . . . A National Study of Jail Suicides, 10 Crim. Just. \u0026 Behav. 461, 481 (1983), comments: \"Isolation, television monitors and intercom systems are more often designed for the convenience of jail personnel, and not for the benefit of the inmate. Indeed, their use may heighten the depersonalizing aspects of confinement -- the inmate having to 'relate' to a disembodied monitor or loudspeaker.\" The article also describes several instances where suicides occurred despite this technology.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. It is interesting that years after the decisions in Borenstein and Middleton, the City finally repealed the waiver ordinance on October 17, 1990. The preamble to the repealer stated that \"such waiver was not intentional, however, since the ordinance predated the Act, and because the City has not re-examined this issue legislatively since the passage of [the Tort Claims Act].\" And further, \"the continued existence of a City ordinance waiving immunity, enacted at a time when general governmental immunity prevailed, is an anomaly in light of the judicial abolition of governmental immunity and the General Assembly's subsequent creation of governmental immunity with carefully crafted exceptions.\" Although the repealer states that it applies to \"all pending civil actions,\" the City did not advise this Court of the Council's action and, therefore, I assume is not asking that it be applied to this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. In cases where the legislature has permitted suit to be brought against municipalities, the amount of damages has been capped at $500,000. See 42 Pa. Cons. Stat. Ann. § 853(b); Smith v. City of Philadelphia, 512 Pa. 129, 516 A.2d 306 (1986), appeal dismissed, 479 U.S. 1074, 107 S. Ct. 1265, 94 L. Ed. 2d 127 (1981). The repealed city ordinance purports only to prevent the city from pleading governmental immunity as a defense, but says nothing with respect to the amount of damages that might be recovered. Clearly, the legislature intended to limit the exposure of municipalities in cases where it did allow a suit for damages. The city has not raised that point on this appeal.\u003c/span\u003e\n\n",
    "body_length": 229018,
    "citedas": [
      "947 F.2d 1042"
    ],
    "attorneys": "CHARISSE LILLIE, Esquire, City Solicitor, NORMA S. WEAVER, Esquire, Chief Deputy in Charge of Claims, MIRIAM B. BRENAMAN, Esquire (Argued), Divisional Deputy in Charge of Appeals, City of Philadelphia, Law Department, Philadelphia, Pennsylvania, Attorneys for Appellants. MARK B. FROST, Esquire (Argued), Frost, DeMesquita \u0026 Rudow, Philadelphia, Pennsylvania, Attorney for Appellees.",
    "category": [
      "188",
      "75"
    ],
    "judges": "Sloviter, Chief Judge, Becker and Weis, Circuit Judges.",
    "citation_count": 488
  }
}
