{
  "id": "J6EXR2YBTlTomsSB-SQi",
  "document": {
    "title": "People v. Zammora",
    "full_title": "THE PEOPLE v. GUS ZAMMORA ET AL.",
    "jurisdiction": "California Court of Appeal",
    "date": "1944-10-04T00:00:00.000Z",
    "docket": "Crim. No. 3719",
    "body": "In an indictment returned by the Grand Jury of Los Angeles County, 22 defendants were jointly charged, in count I, with the crime of murder and, in counts II and III, with the crime of assault with a deadly weapon with intent to commit murder. After the entry of \"not guilty\" pleas as to all counts of the indictment, trial was had before a jury, resulting in the acquittal of five defendants on all three counts. Of the remaining defendants, five were acquitted of the murder charge, but were convicted of minor offenses necessarily included in the remaining two counts. The other 12 defendants were convicted on all three counts; three being found guilty of murder in the first degree and nine of murder in the second degree. This appeal\n\nis prosecuted by the last mentioned 12 defendants, against whom verdicts of \"guilty\" were returned, as follows:\n\nCount II\n\nDefendant Count I Count III\n\nHenry Leyvas Murder 1st Degree Guilty as Charged\n\nJose Ruiz Murder 1st Degree Guilty as Charged\n\nRobert Telles Murder 1st Degree Guilty as Charged\n\nManuel Delgado Murder 2nd Degree Guilty as Charged\n\nJohn Y. Matuz Murder 2nd Degree Guilty as Charged\n\nJack Melendez Murder 2nd Degree Guilty as Charged\n\nAngel Padillo Murder 2nd Degree Guilty as Charged\n\nYsmael Parra Murder 2nd Degree Guilty as Charged\n\nManuel Reyes Murder 2nd Degree Guilty as Charged\n\nVictor Robt.\n\nThompson Murder 2nd Degree Guilty as Charged\n\nHenry Ynostroza Murder 2nd Degree Guilty as Charged\n\nGus Zammora Murder 2nd Degree Guilty as Charged\n\nEpitomizing the factual background which gave rise to this prosecution, it appears from the record that, on the evening of August 1, 1942, a birthday party was in progress honoring Mrs. Amelia Delgadillo. The party was held at her home and was attended by her husband, other members of her family and some twenty or thirty other invited guests. The record discloses that some eight or eleven uninvited persons were also in attendance.\n\nThe Delgadillo home is located on what is known as the \"Williams Ranch,\" situate in the vicinity of Slauson and Atlantic Boulevards in the county of Los Angeles.\n\nAt the birthday party, on the evening in question, the guests indulged in dancing out in the patio to the music of an orchestra, which played from 9 p. m. until 1 a. m. After the departure of the musicians, a radio was placed in the back yard and members of the family with a few remaining guests continued dancing until approximately 1:45 on the morning of August 2nd.\n\nSometime before midnight, several of the defendants in this case had gone to a small pond or reservoir also located on the Williams Ranch about a half mile west of the Delgadillo home, and designated by the boys and girls who, from time to time, congregated there, as \"Sleepy Lagoon.\" While the aforesaid group, consisting of some of the boys who later became defendants in this case and their girl companions,\n\nwere at \"Sleepy Lagoon,\" they were set upon and beaten by another crowd of boys identified only as \"boys from Downey.\"\n\nThe record also discloses that some eight or ten of these so-called \"Downey boys\" were among the uninvited guests at the Delgadillo party, and, earlier that evening, two of them became involved in an argument with their host and his son-in-law, because their host told them there was no more beer. One of those boys \"grabbed\" a chair in a threatening manner, but the other \"grabbed\" him with both hands on his shoulders, turned him around, and pulled him back outside of the patio gate. The witness, Eleanor Delgadillo Coronado was sitting in the patio across from the gate. She testified: \"When I seen him, and I got up and then went to the kitchen door . . . because . . . when I seen these two boys come up, I thought they were going to start trouble or something.\"\n\nFollowing the aforesaid attack upon some of these defendants by the so-called \"Downey boys\" at \"Sleepy Lagoon,\" the former left the scene of the altercation and repaired to the vicinity of Vernon and Long Beach Avenues, some five miles distant from \"Sleepy Lagoon.\" This last named location, it appears, was a place at which a group of young people from the 38th Street neighborhood congregated. We think it is a fair statement to say that the defendants who had been beaten up at \"Sleepy Lagoon,\" smarting under the effects of the beating administered to them, returned to the vicinity of Vernon and Long Beach Boulevards for the purpose of enlisting the aid of their friends and going again to \"Sleepy Lagoon\" for the avowed purpose of \"fighting it out\" with the boys from Downey. Thus reinforced, a number of boys and girls, including the defendants, ranging in age from 14 to 22 years, went out towards \"Sleepy Lagoon\" in several automobiles, variously testified to as being from five to ten in number. There is evidence that, prior to embarking upon the last mentioned trip, one of the defendants, Angel Padillo, who accompanied the caravan, obtained a box of shells for his 22 rifle, which he took with him. The evidence on this point is in conflict, but, in any event, it is conceded the rifle was not utilized in the commission of the alleged homicide or either of the two assaults charged against the defendants. Upon arrival at \"Sleepy Lagoon,\" it was discovered that the boys from Downey had departed. Thereupon,\n\nsome of the party disembarked from their automobiles and proceeded on foot to the Delgadillo home, where the aforesaid party was in progress, while others proceeded thereto in their automobiles, where most of them alighted from their vehicles.\n\nWhat transpired thereafter will be discussed presently, but we pause here to give consideration to respondent's claim that, in returning to \"Sleepy Lagoon,\" the defendants had entered into an unlawful combination or conspiracy, the object of which, as the result of their malignant hearts, was to commit murder in satisfaction of their lust for revenge.\n\nWe have painstakingly read the reporter's transcript in this case, containing, as it does, more than 6,000 pages. We have studiously read and considered the briefs filed herein, which total some 1,400 pages, and from a reading thereof we are persuaded that there is no substantial evidence to support the claim that when the defendants left the vicinity of Vernon and Long Beach Avenues they had \"murder in their hearts\" or even that they had then formed any intent to go to the Delgadillo home. As we view the evidence, it strongly supports the theory that some of the defendants were intent upon meeting the \"Downey boys\" and engaging in a fist fight with them in retaliation for the attack made upon some of the defendants earlier that night at \"Sleepy Lagoon.\" It was only when these defendants discovered that the objects of their search had departed from \"Sleepy Lagoon\" that they determined upon going to the Delgadillo home. As to what prompted this decision upon their part the evidence is in extreme conflict. At all events, it can be said that the evidence does not reflect any unanimity of purpose. There is some testimony that one of the defendants, who had previously been at the party and had danced with one of the Delgadillo girls, stated that it was a \"good party\" and suggested that the group go there. There is other evidence that, when defendant Leyvas and some of his codefendants entered upon the Delgadillo premises, they demanded to know the whereabouts of the \"men who had beaten them up.\" Some of the defendants had no knowledge of the party and no longer expected to find the \"Downey boys,\" but just followed the others. But it belies the record to assert that what happened subsequently at the Delgadillo party was the result of a collective intent upon the part of the defendants to commit murder, and that the conduct, behavior and actions upon the part of the defendants at the party\n\nmanifested a conspiracy to commit murder or assaults with intent to commit murder. The most that the record reflects in this regard is that until their arrival at \"Sleepy Lagoon\" and their failure to find the \"Downey boys\" there, defendants had a common intent to encounter the \"Downey boys,\" and thereupon engage in a course of disorderly conduct, breach of the peace, or battery. As we shall hereafter in this opinion point out, the jury, by their verdicts, rejected the theory of the prosecution that the defendants had engaged in a conspiracy; and we think rightly so in the light of the evidence presented to which we subsequently shall refer.\n\nFollowing the entry of some of the defendants into the Delgadillo premises, a general \"free for all\" fight ensued. After this controversy and the exit of the defendants from the Delgadillo premises, one Jose Diaz was found lying unconscious in the dirt outside the fence south of the Delgadillo premises, and later died. There is no evidence as to his whereabouts or actions during the \"free for all\" fight involving the defendants. People's witnesses testified that he was seen leaving the Delgadillo premises, accompanied by two other guests who were not produced as witnesses, several minutes before the arrival of any of the defendants.\n\nIn describing the injuries upon the body of the deceased, the autopsy surgeon testified:\n\n\"Further examination showed the backs of both hands to be contused and somewhat swollen with abrasion of the knuckles of the little and ring finger on the left hand, and the second finger of the right hand. The facial features were swollen and there was contusion over the left side of the lower lip and also the upper lip; there was contusion over the prominence of both cheeks and abrasions over the outer angle, the right angle of the mouth. The left ear was quite markedly contused, and there was extensive ecchymosis of the scalp over the left side of the head. Upon opening the skull the brain was found to be contused and there was a profuse subdural hemorrhage. The base of the skull was fractured, the fracture line running along the lesser wing of the sphenoid bone on the left side.\"\n\nThe autopsy surgeon also testified that the chemical analysis of the blood of the deceased, made at 7:30 a. m. on August 2, showed 0.12 per cent alcohol, and testified that the margin of intoxication is generally accepted as 0.15 per cent.\n\nThis physician also testified that, from the time one stops drinking, the alcoholic content of the blood of a living person recedes, so that it would be impossible for him to say whether or not Jose Diaz was intoxicated a few hours before his death. This witness said the swelling of Jose Diaz' hands was similar to that caused by delivering blows with fists, and that\n\n\"The appearance on the left side of the head of the ecchymosis of the scalp and the crushing effect on the left ear indicated to me that some other instrument than a fist had been used to bring that injury about.\"\n\nHe later said, with respect to the cause of this injury, \"If this decedent had fallen to the ground . . . the head could have hit a protruding rock or something else other than a smooth surface.\"\n\nAs a result of these injuries and primarily because of the profuse hemorrhage and skull fracture, Jose Diaz died about four o'clock the same morning in the hospital to which he was taken.\n\nOne Jose Manfredi, who is the victim mentioned in count II, received a stab wound three or four inches long and about three-quarters of an inch deep, on his chest just below the heart. He also had a fracture of the frontal wall of the sinus, a basal skull fracture, concussion of the brain, and a broken left hand. He was taken to the general hospital and did not fully recover consciousness until about two o'clock on the following afternoon, August 2nd.\n\nCruz Reyes, named as the victim in count III of the indictment, received a stab wound in the abdomen and suffered contusions about his body.\n\nThe victims of the assaults alleged in counts II and III of the indictment claim to have been stabbed early in the fight while they and some of the defendants were in the Delgadillo patio, and later to have received severe beatings with steel instruments wielded by numerous boys on the east side of the Delgadillo premises.\n\nWe shall now refer in detail to the evidence introduced of and concerning the activities of each defendant upon the occasion with which we are here concerned.\n\nHenry Leyvas\n\nConcededly this defendant was one of those who, earlier in the night, had been attacked by the so-called \"Downey boys\" at \"Sleepy Lagoon.\"\n\nJoe Manfredi, the victim in count II, testified that defendant Leyvas had both a knife and a club in his hands while in the patio of the Delgadillo home. However, there is no evidence that defendant Leyvas stabbed Joe Manfredi. In fact the only testimony in that regard is the more or less unsatisfactory testimony to which we shall hereinafter refer, and which, if it is to be believed, would indicate that defendant Ysmael Parra committed the felonious assault upon Manfredi. The victim Joe Manfredi testified that, when he ran from the patio, Leyvas, Delgado and Parra ran after him as he fled. But, in the course of his testimony, he, Manfredi, testified as follows:\n\n\"After all, I turned around and left there. I didn't see who was going to follow me, but those were the three that rushed me and naturally they must have followed me . . . No, I never turned around back again to see.\"\n\nThe generally unsatisfactory state of the testimony given by Joe Manfredi is referred to more in detail in the epitome of the testimony hereinafter appearing concerning the defendant Ysmael Parra.\n\nThere is also testimony that Leyvas struck and kicked Lola Delgadillo. However, defendant Leyvas contends that he did not kick or hit Miss Delgadillo, but shoved her aside as he was attempting to escape from her father who was coming toward him with a knife. The witness, Dominic Manfredi, brother of Joe Manfredi, testified that when defendant Leyvas approached him, Leyvas had a knife in his hand.\n\nCruz Reyes, the victim of the assault contained in count III, did not identify defendant Leyvas as his assailant. While a number of state's witnesses testified that Reyes was assaulted by Leyvas, none testified that such assault was committed with a deadly weapon, and the uncontradicted evidence reveals that such assault consisted of a blow with the fist, and this notwithstanding that several of the prosecution's witnesses testified that Leyvas did have some sort of weapon in one of his hands. Some of the prosecution witnesses testified positively that whatever object defendant Leyvas had in his hand was in his left hand. Joe Manfredi, the victim named in count II, after saying he had weapons in both hands, testified of and concerning defendant Leyvas.\n\n\"I didn't say he lifted them (referring to weapons) up in hitting, or anything like that; I didn't say.\"\n\nFrom the foregoing recital, it is at once apparent that there is absolutely no testimony whatever to directly connect defendant Leyvas with any assault upon the deceased, Jose Diaz, nor is there any evidence to connect him with an assault upon the victims mentioned in counts II and III with intent to commit murder.\n\nRespondent lays great stress upon the fact that in the statement given by this defendant to the officers, as well as in his grand jury testimony, he denied being present at the Delgadillo home on the night in question. The falsity of these statements, argues respondent, is proof of his guilt. This we cannot concede, because a reading of the record indicates that this defendant refused to admit his presence at the scene of the alleged offenses because he was not permitted to consult with his attorney or to see any of his friends, and further because of the fact that force and violence were used upon him by the officers. In this latter regard, it is noteworthy that this defendant's claim that he was beaten by the officers was not denied.\n\nJoe Ruiz\n\nWith reference to this defendant, the only evidence we can find in the transcript, or to which we are directed by respondent, is that he went to the ranch house where the fight took place on the night of August 1st. That, when he arrived, a fight was already in progress in front of the house; that defendant Leyvas called out, \"Some one take care of the back\"; that, thereupon, this defendant went to the rear and started throwing rocks at the house. When accused by the officers of having a two by four, this defendant denied it, but later, according to his statement to the officers, when he was advised that certain of the other defendants had stated to the officers that Ruiz used the club and that his companions had taken it away from him and thrown it in the weeds, he was directly asked the question, \"Do you remember?\", to which Ruiz answered \"yes.\" From a reading of the statement of this defendant to the officers, however, it is not clear whether, by his answer, he intended to admit that a club was taken away from him and thrown into the weeds, or to convey the impression that he remembered that four boys were fighting with their fists, because in his statement immediately following the portion to which we have just referred Ruiz denied hitting anybody with a club and said,\n\n\"We were all hitting the man with our fists, but I didn't use any board.\" This defendant also admitted to the officers, according to his statement, which was in evidence, that he did throw rocks and kick a man who was lying sideways \"on his belly.\"\n\nIt would only prolong this opinion to set out other evidence of and concerning this defendant which, suffice it to say, does not in anywise connect him with having made an assault upon the deceased Diaz or with having engaged in an altercation with either of the victims named in counts II and III. In accounting for the verdict rendered against this defendant of first degree murder, it is noteworthy that the jury had heard read statements of other defendants, which, while the court instructed the jury were not to be considered against Ruiz, nevertheless implicated him in assaults far more severe than the one admitted by him in his statement to the officers.\n\nRobert Telles\n\nConcededly this defendant was also one of the group that had been attacked earlier in the evening by the so-called \"Downey boys\" at \"Sleepy Lagoon,\" and had thereafter returned, with defendant Leyvas, to the vicinity of Vernon and Long Beach Boulevards, from which place he assisted in escorting the group that returned to \"Sleepy Lagoon\" and the Delgadillo premises by driving his automobile in the caravan. The only testimony relied upon by the prosecution to connect this defendant with the crimes charged against him is his own statement made to the officers following his arrest. In this statement, this defendant, after identifying some of his codefendants as being present at the Delgadillo home, stated that the purpose of the return trip to \"Sleepy Lagoon\" was \"to try to catch the boys who were hitting us, and teach them a lesson about bothering couples; . . . to have it out with those in general who were beating the rest of them.\"\n\nIn his statement this defendant also stated that it was intended to engage in a fight with the \"boys who were hitting us\" with fists. This defendant further stated that when he arrived, he heard screaming and shouting and the next thing he knew he was engaged in a fight with another man; that the man with whom he was fighting hit him \"a couple of good ones in the belly,\" and he \"folded up\"; that when he next saw the man, the latter was running away; that he heard\n\nwomen screaming and yelling at the house. After identifying the people who accompanied him in his car on the return trip, he stated that, when he was under the lights, where the fighting was going on, he could see girls pulling hair; he saw a boy lying in the road gasping, and that he \"figured\" he had been cut; that he observed two girls bend over the man and wipe off his face. It is noteworthy that the deceased, Jose Diaz, was not cut, according to the testimony of the autopsy surgeon, or any other evidence in the case. In this statement, this defendant further told the officers that, after he had gotten the \"worst\" of it in the first fight, he picked up what he described as a \"stick\" for the reason that he was not going to let anyone \"lick\" him any more. He further stated that he struck a man with this stick, saying\n\n\"I hit him on the back and then I stumbled; I hit him in the rear.\"\n\nThis defendant also told the officers he did not see any one at the Delgadillo home that night with a knife, but that he had a knife in his automobile which he carried with his tools and that somebody had taken it, because it was not in his car the next day when he undertook to repair one of the tires. Nowhere in the evidence are we able to discern any testimony connecting this defendant with any assault upon the deceased Diaz, or upon either of the victims named in counts II and III of the indictment.\n\nManuel Delgado\n\nThis defendant was admittedly one of the defendants who had been attacked by the \"Downey boys\" earlier in the night. The witness, Joe Manfredi, testified that, at the time he entered the patio to ascertain what was going on and asked certain questions of defendant Leyvas, this defendant Delgado, who was present, said, \"What are you going to do about it?\" and Joe Manfredi said that a group, including this defendant, standing there, came toward the witness, whereupon he started to run away; that each one of the defendants named as being in the group had a knife in his hand and chased him. But, as heretofore pointed out in connection with the evidence affecting the defendant Leyvas, this witness, Joe Manfredi, on cross-examination, was not at all sure as to the identity of any of those in the pursuit group that chased him. Other than the foregoing, the evidence against this defendant consisted of a statement taken down in shorthand\n\nin the presence of a deputy sheriff on August 4th. After telling that he had been at \"Sleepy Lagoon\" between 10:30 and 11:30 p. m. when he and some of his codefendants and their girl friends were set upon by the \"Downey boys,\" he said they returned to the vicinity of 38th and Long Beach; that thereafter, when a crowd of reinforcements was recruited, consisting of about thirty boys, including himself, and several girls, they returned to the \"Lagoon.\" This defendant stated that he drove his own car and identified some of the occupants thereof on the return trip; that he did not recall any plan of action contemplated by the crowd which returned to the \"Lagoon\"; that windows were broken in the automobiles parked at the ranch, and that he, himself, picked up a broken chair and threw it against a car. In his statement to the officers, this witness told them that when he arrived at the scene \"everything was just about over\"; that he took no part in the altercation and that he threw no rocks. He denied being in the patio, but there was testimony by Joe Manfredi to the contrary. However, the only other evidence on this point is that of Marie Delgadillo who testified for the prosecution as to what happened in the patio and stated that she did not see this defendant Delgado the night or morning of the occurrences at the ranch.\n\nTo summarize the prosecution's ease against this defendant, it may well be said that no witness, other than Joe Manfredi, testified that Delgado was in the patio, and, except for that, no witness testified that this defendant did anything except as declared by him in his statement. Manifestly, as to him, there was no evidence whatever to connect him as an actor in the homicide or either of the assaults charged in the indictment.\n\nJohn Y. Matuz\n\nThe only testimony concerning this defendant, which we are able to discover in the transcript or which has been called to our attention by respondent in its brief, is that contained in the testimony given by this defendant before the grand jury, wherein he admitted that he was at \"Sleepy Lagoon\" about 11:30 Saturday night, August 1st, with a girl friend; that he heard about the fight between Leyvas and some of the \"Downey boys\" and that he left the \"Lagoon\" with the idea of returning to Los Angeles and getting a number of boys together and going back. When asked if he was a member\n\nof the so-called 38th Street Gang, he said \"You can call it that. I have been hanging around with them for about two weeks now.\" According to his testimony before the grand jury, defendant Matuz returned later that night to the \"Lagoon\" with Melendez, Josephine and Juanita Gonzales and another boy. Before returning to the \"Lagoon\" he had seen defendant Leyvas at Vernon and Long Beach Boulevards. When this defendant went back to the Williams Ranch that night he was accompanied by the same boys and girls who had previously been with him. He knew some of the other defendants were going back to the ranch and he followed them. He stated that he made the return trip with the idea of \"beating up\" the boys who had fought with Leyvas. He testified further that he was intoxicated at the time he returned to the \"Lagoon\" and did not remember getting out of the car, although \"they say I got out.\" He was aware of the fact that the fight was going on, because he heard \"hollering\" and breaking of windows. He was uncertain as to what, if anything, he did while he was there, but remembered some one saying \"Let's get out of here.\" The respondent asserts that Josephine Gonzales testified that she believed this defendant was one of those engaged in breaking cars on this last trip, but a review of her testimony indicates that she was so confused and uncertain as to brand her testimony as most unsatisfactory. Upon this evidence, which fails to show that this defendant participated in any way in the assault upon the deceased Diaz or the victims, Cruz Reyes and Joe Manfredi, with or without any intent to kill, or with or without a deadly weapon, he was nevertheless convicted of murder in the second degree and of both charges contained in counts II and III.\n\nJack Melendez\n\nMarie Delgadillo testified that she saw this defendant present in the road near the gateway which was the entrance to the patio; that at that time he had a stick in his hand and said \"Why didn't you tell me?\", after which he turned and ran down the road toward the power poles. It might here be stated that the deceased Diaz was found unconscious in this road between the two power poles. Although on direct examination the witness, Marie Delgadillo, had identified this stick as being similar to Exhibit 19, which was introduced in evidence, and said that it was a piece of two by four, 22 inches long, Exhibit 19 was a piece of two by three\n\nand the witness thought it resembed the piece of wood she saw in Melendez' hand. On cross-examination she further testified that she would call a stick of any size a two by four, provided it was a stick about 22 inches long. Another witness, Josephine Reyes, a sister of Miss Delgadillo and wife of the victim Cruz Reyes, in testifying about the foregoing incidents, said she saw Melendez enter the patio from the road about two to five minutes after Leyvas and the others had left the patio, converse with her sister, Eleanor Coronado, and walk back and out the gate. With reference to the statement made by Melendez, \"Why didn't you tell me?\", testified to by Miss Delgadillo, the witness Josephine Reyes said that this defendant preceded this remark by addressing a question to her as to what had happened in the patio and that the remark was made after she told him that there had been a fight there. This defendant testified before the grand jury and his testimony there given was read into evidence at the trial. He testified he went out to the Williams Ranch at the invitation of defendant John Matuz; that he did not remember whether he had been told about the assault upon some of the defendants which had occurred on Saturday evening, August 1st, at \"Sleepy Lagoon\"; that he was not told that there was going to be a fight or that anybody was to be beaten; but that he went out because \"they were going out for a good time\" and \"to ride around\"; that he was \"passed out\" in the back seat and did not leave the automobile. However, Melendez' statement to the effect that he did not leave the automobile is contradicted by the testimony of several prosecution witnesses. This defendant did not testify at the trial or deny any of the aforesaid evidence, but we fail to see wherein it in anywise directly connects this defendant with the assaults made upon either the deceased Diaz or the victims mentioned in counts II and III. Nevertheless, this defendant was convicted of murder in the second degree and of two counts of assault with a deadly weapon with intent to commit murder.\n\nAngel Padillo\n\nThere was testimony that this defendant was at the Delgadillo home on the Saturday evening and early Sunday morning here in question. Marie Delgadillo testified that she saw him at the party about 11 p. m. and that he was one of the uninvited guests who was dancing; that she herself had\n\ndanced with him. Another witness testified that he saw Padillo between 10 p. m. and the time when the orchestra left at 1 a. m. The three witnesses who were in the patio at the time when the defendant Leyvas and other defendants entered did not identify Padillo as entering the premises with the Leyvas group.\n\nTwo witnesses, in addition to defendant Padillo himself, testified concerning the latter's possession and use of his 22 rifle. One of these witnesses, the defendant Delgado, testified that he saw defendant Padillo shoot his gun into the air near the \"Lagoon.\" There was testimony that Padillo had fortified himself with bullets for his gun while at the gas station. Padillo admitted having the gun and taking it with him, as he said, \"to show off in front of the boys.\" He admitted he fired it twice when he got out of his car before any fight started, and said he did not fire the rifle near the Delgadillo premises or shoot at any person. There is no admissible evidence in the case which contradicts this defendant's statement that he used his rifle only at the \"Lagoon\" and shot twice into the air or at some telephone poles. In any event, it is not contended that the rifle was used in any of the assaults allegedly committed.\n\nThis defendant made a statement to certain police officers after being taken to the police station. In this statement, he admitted that he returned to \"Sleepy Lagoon\" to assist in \"beating up\" the gang that had earlier assaulted his companions there. He said that when he arrived at the Delgadillo home on the return trip the people had departed, the fight was over, but that some of the boys were breaking car windows and puncturing tires. In this statement, he admitted that he had his gun there and shot at two telephone poles, firing two shots; and that \"we were worried about the cops\"; that, after the fight, he took his girl companion home and came back to the pool hall where he heard some of his companions talking about what had occurred at the Delgadillo home. In this statement, defendant Padillo said that he expected to fight when he went to the Williams Ranch that night; that he went there to engage in a fight and help defendant Leyvas, because the latter had been beaten.\n\nThis defendant also testified before the grand jury, at which time he stated he went to the Williams Ranch Sunday morning with Valenzuela and a girl friend; that he went there\n\nafter he had been informed that some one had been beaten up at the ranch; that he followed the other cars in his automobile; that when he arrived at the ranch everything was all over, except that car windows were being broken and tires punctured; that he fired his rifle about 75 or 100 feet from the Delgadillo house. Before the grand jury this defendant stated he parked his car a long way from the ranch buildings; that he took the gun out of his car when he went toward the ranch buildings, but that it was not then loaded. When asked why he took the gun along if he was out of ammunition, he said \"just to take it.\" He further testified that he had put the gun in his automobile Saturday morning for the purpose of hunting rabbits, but he did not go hunting that day.\n\nAt the trial this defendant took the witness stand and testified with regard to limited matters only. While a witness at the trial, he stated that his statement made to the officers was entirely false; that he made it only because of a terrific beating administered to him by some of the officers. That any assault was made upon this defendant was denied by the officers who questioned him. At the trial, he stated that his testimony given before the grand jury was \"true,\" but in some respects was based solely upon \"what he had been told.\"\n\nOther than that this defendant was at the Delgadillo home; that he had a 22-caliber rifle; that he fired the same some distance from the Delgadillo home, there is no testimony to connect him with the homicide or either of the assaults charged. Neither is there any testimony that this defendant used the gun as a club, or in any manner whatsoever other than as hereinabove narrated.\n\nYsmael Parra\n\nThe statement of this defendant, made to the officers before his arraignment, and his testimony before the grand jury, are substantially the same. According to his grand jury testimony and statement, he was parked in front of Joe Carpio's home on 41st Street getting ready to go home when Leyvas came up and said that some \"guys\" had hit him, and also \"Let's go and beat them up,\" whereupon everyone got in cars and went. He and his wife, Delia, went to Williams Ranch with Benny Alvarez in his car which was parked near \"Sleepy Lagoon,\" and they walked from there to the Delgadillo home. When they entered the patio a fight was\n\nalready in progress there. An old man (Mr. Delgadillo) came up with a knife or razor in his hand and made a motion as if to try to cut him, and, when some one attracted the old man's attention, he hit him with his fist, knocking him down, then grabbed his wife and started for the car, going back through the patio gate through which he had come in.\n\nThere is no evidence of any kind connecting this defendant with the alleged murder of Jose Diaz charged in count I, or the alleged assault with a deadly weapon with intent to commit murder upon Cruz Reyes charged in count III of the indictment.\n\nAs to the alleged assault with a deadly weapon with intent to commit murder upon Joseph Manfredi, charged in count II of the indictment, we quote the following from respondent's reply brief:\n\n\"Joseph Manfredi testified that Parra, Leyvas and Delgado chased him from the vicinity of the kitchen door of the Delgadillo house and under a peach tree . . . and that Parra had a knife and a club . . . .\n\n\"Eleanor Coronado stated . . . that she saw Parra going after Joe Manfredi with a knife and saw him stab Manfredi.\"\n\nThe record supports respondent's statement, so far as it goes, but, after a careful reading and comparison of the entire testimony of these two witnesses, we are unable to reconcile the foregoing claims of respondents with the stories told by said witnesses.\n\nJoe Manfredi's testimony is that he had come to the party as an invited guest; that, because he did not dance, he had stood around just outside the gate to the patio talking with some of the men and watching the dancing from about 10 o'clock Saturday evening until some minutes after the arrival of the defendants and their companions; that he had seen no group of uninvited boys hanging around that gate at any time that night, and, at no time prior to defendants' arrival, had there been more than six or seven men, including the men of the Delgadillo family, at the party; that before defendants and their companions got out of their cars, although he couldn't see whether the cars were open or closed, sedans or coupes, he could see that each man carried weapons (knives, clubs, chains, etc.) in both hands; that Frank Coronado, Salvador Negrete and Remedios Parra, with whom he was then talking \" just ran away, that is all. I didn't know\n\nwhat they were going to do or what they were up to\"; that he, Manfredi, did not know where they went, but they started toward Coronado's house; but Manfredi did not run because he \"hadn't done anything\"; Joe Diaz had been talking with them there but had left about three or four minutes before defendants and their companions arrived and Manfredi didn't know where he went; that, at that time, the only men in the patio were Cruz Reyes, Dominic Manfredi, and Mr. Delgadillo; there were two or three other men about the Delgadillo home at that time, but Manfredi didn't know where they were just then because he couldn't see them.\n\nManfredi remained standing a short distance from the gate and watched the group including Leyvas, Parra and Delgado approach and enter the patio; that he stood there looking through the gate for several minutes; that he saw Eleanor Coronado and Lola Delgadillo walk right up to the gate and ask this group what they wanted; that he heard them say \"tell 'em to come out here\" and the Delgadillo girls said \"there was nobody there, who they wanted\"; that he saw the fellows push the girls back into the patio; that the boys did not say anything about any fight or being beaten up, \"if I did hear anything like that, that they had a fight or anything, I probably would have left the party\"; that after he saw them fighting with the Delgadillo family and guests in the patio; saw Marie Lola on the ground being kicked and punched, the girls that came in having Eleanor Coronado and Victoria Delgadillo by the hair, and all of the girls fighting, and heard Cruz Reyes \"holler,\" he walked into the patio to find out what was going on, what they wanted and what it was all about. He did not see Cruz Reyes or Dominic Manfredi, his brother, in the patio at any time after he entered it. The only one of the defendants he actually saw fighting was Leyvas, and he said, \"You see, when I went in, he sort of stopped.\" He asked defendant Leyvas what they wanted, and defendant Delgado said, \"What are you going to do about it?\"\n\nManfredi said that they were all in a group there near the narrow passageway between the kitchen and bunkhouse and Parra was \"standing almost beside him.\" But he further testified, \"No, I don't remember . . . I seen him (Parra) in the group there, and just what position he was standing there, or which position I was standing there, I can't really\n\ntell you.\" He said that they all had knives in their hands; that the blade of the knife he saw in one of Parra's hands (he didn't know which hand) might have been longer than two or three inches -- \"the fellow didn't demonstrate it,\" so the witness said he did not know.\n\nHe, Manfredi, \"was sort of the only man there\" and didn't have anything in his hands, so he ran. He said, \"The only time I started to run was when the fellows all come towards me. Now, I am not mentioning any particular one.\" He testified that Leyvas, Delgado and Parra chased him and there were more behind them, but also said, \"I didn't stop to see who was following me; I just started to run.\" When he was reminded of his previous testimony that \"he (Henry Leyvas) was kind of ready to swing at me or something, and I started to run,\" he said, \"Wait a minute. I am going to tell you why I answered that question. The reason I answered that question was because if a whole bunch stood up there and if you pointed them to me, I would still say a group, but when individuals stood up -- I said he was running towards me, that man, just him.\" Then followed the questions and answers here quoted from the record:\n\n\"Q. You did that because the District Attorney had one defendant stand up at the time? A. That is right.\n\n\"Q. That is why you singled out an individual -- just a minute now -- the reason you singled out any individual then in the courtroom and identified him as doing anything is because the District Attorney had the individual then stand up; isn't that true? A. That is correct. . . .\n\n\"Q. By Mr. Van Tress: You recall when the District Attorney had Ysmael Parra stand up in the courtroom -- do you remember when Ysmael Parra stood up. A. Yes, I remember when he had him stand up.\n\n\"Q. And the reason you testified with reference to Ysmael Parra, was it because he stood up individually and not with the rest of the defendants? A. I don't know just -- I don't know just --\n\n\"Mr. Barnes: If your Honor please.\n\n\"The Court: I think that question -- the danger of that question is, regardless of how it may be answered, the answer would, of necessity, be ambiguous, in view of the testimony already given.\n\n\" Mr. Van Tress: I will withdraw the question.\"\n\nJoe Manfredi testified that he was cut \"on my stomach, on\n\nmy chest, like.\" The scar exhibited to the jury was approximately three inches long and Manfredi said the cut was about one inch deep. He said he was cut \"right in the hallway there . . .\" as he \"started to leave . . .\"; that he \"didn't see who done it.\" He didn't see the knife that cut him, or the hand holding the knife. \"I believe just as soon as I started to run I must have got cut.\" In answer to the trial judge's questions, \"Well, were you cut before you started to run? -- Or, don't you know?\", Manfredi said, \"Here is the point, I don't -- you see, I got cut just as soon as I turned my back, you see, and started to run, that is when I got cut.\" When the trial judge asked, \"Why must it have been that time instead of some other time, that is what we are trying to get at?\", Manfredi said, \"Well, you see, I sort of felt some arm come around me or something, I don't know, you see, it was only a matter of a split second right there and then.\" When asked which side of his body he felt the arm or object come around, the witness said, \"Well, I was stabbed, and that is all I can remember; I didn't take time to notice . . . I didn't stop.\" When asked, \"How close was the closest person to you when you started to run?\", he answered, \"Well it was pretty well behind me --.\" Then the trial judge asked, \"Was anybody closer to you than I am to you right now?\", and he replied, \"Well, yes, I seemed to feel somebody grabbing me, something like that, they were close . . . almost within reach. . .\" and the judge repeated this answer, \"He was within reach of him.\" Manfredi does not know who this closest person was. Nobody raised a knife and threatened to cut him while he was standing there.\n\nJust as he got to the fence where he claims he was beat on the head, hand and body with chains and weapons of steel, \"there was more come in.\" He didn't see any of them or the weapons they used. Later he said, \"I think they left there, I couldn't say for sure, but still more kept coming in from somewheres.\"\n\nThe witness, Mrs. Eleanor Delgadillo Coronado, testified that she saw Ysmael Parra at her father's home during the fracas which started there in the patio about 1:45 a. m. Sunday morning, August 2, 1942, and said further:\n\n\"Well, after he hit her (referring to Henry Leyvas hitting Marie Lola Delgadillo) he knocked her out and she fainted, and then after that there was just -- everybody started\n\nfighting . . . Well, after they started fighting I seen Joe Manfredi -- that is a boy that was at the party -- some boy was hitting him in the stomach, and he was bringing him in from sort of a gateway . . . Well, they was asking some boy -- I don't know who he was -- 'What are you doing? What are you after?' And this boy kept hitting him, and then Joe walked to sort of -- Joe Manfredi walked into a platform near the kitchen door, and then there was another fellow going after him, this Ysmael Parra, and he (Ysmael Parra) stabbed Joe. So I thought he was going to kill him. . . . Then I started fighting with Delia Parra, and then Ysmael Parra turned around and he saw us, and then he said, 'My wife.' Then Parra turned around and he hit me and he knocked me down. . . .\"\n\n\"Q. . . . Who did you see go after Joe Manfredi? A. Ysmael Parra.\n\n\"Q. When you saw Parra go after Joe Manfredi, you saw a knife in Parra's hand; is that right? A. Yes, sir.\n\n\"Q. Which hand did he have it in? A. In his right hand. . . .\n\n\"Q. And Parra was pointing it toward Joe Manfredi? A. Yes.\n\nQ. . . . What was Parra doing the first time you saw him? A. Well, I just saw him when he was going after Joe Manfredi.\n\n\"Q. And was Joe Manfredi facing Parra? A. No, he was -- he had his back toward him.\"\n\nThis witness testified that she then grabbed up a beer bottle and started after Parra with it, when Delia Parra grabbed her from behind and she \"turned around and tried to take her off.\"\n\n\"Q. Where did this take place, where you and Delia Parra were engaged in this altercation? A. Right near the kitchen door.\n\n\"Q. Which way did you see Joe Manfredi run when you say you saw Parra, Mr. Parra, behind him with a knife? A. He ran in through where the kitchen door is, into that little hall, like, that we have there, out to the front of the house. . . .\n\n\" Q. About this time, then, Mr. Parra turned around and he saw you and Delia Parra fighting, is that right? A. Yes, sir.\n\n\"Q. And then you heard Mr. Parra say, 'My wife'? A. Yes, sir.\"\n\nThis witness \"doesn't think\" these are the answers she gave the grand jury, as read from the grand jury transcript.\n\n\"Q. . . . Henry Leyvas hit your sister Marie? A. Yes. And after that he goes after this Manfredi, boy, and I seen him, so I saw a beer bottle there and I grabbed it and was going to hit him over the head.\n\n\"Q. Who went after Joe Manfredi? A. Henry Leyvas. I grabbed a bottle and was going to hit him over the head, but some girl from the back grabbed me and she said, 'You cannot hit my old man.'\n\n\"Q. Did you know who that girl was? A. The Encinas girl, I think, Lorena Encinas.\n\n\"Q. Go ahead. A. And then I grabbed her, and I hit her real hard, and there was a washing machine in the corner of the kitchen down there, and she hit against it, and this boy turned around and saw me hit her.\n\n\"Q. What boy? A. Henry Leyvas; and then he said 'My wife.' That is what he said, and that is all I know, because I seen this Manfredi boy go out the other way, and then there was a whole crowd on top of me, and that is when he turned around and hit me here (indicating).\"\n\nHer further testimony at the trial was:\n\n\"Q. Did somebody hit you either that evening or that morning? A. Yes.\n\nQ. Who? A. Parra. . . .\"\n\nShe \"is sure\" she did not give the following answers before the grand jury, as read from the official transcript:\n\n\"Q. Is that (the scar indicated) the result of the blow you received? A. Yes. . . .\n\n\"Q. What were you hit with? A. His fist.\n\n\"Q. Who hit you? A. This boy.\n\n\"Q. Henry Leyvas? A. Yes, sir.\"\n\nThereupon, at the trial she testified as follows:\n\n'Q. When you testified before the Grand Jury you knew who Henry Leyvas was, didn't you? A. Yes, sir, I did.\n\n\"Q. You knew him then, didn't you? A. Yes, I seen him in the line-up.\n\n\"Q. And when you were at the Grand Jury somebody showed you a picture of Henry Leyvas, didn't they? A. Yes. . . .\n\n\"A. Well when they showed me a picture of Henry Leyvas, I said that was the man I recognized there. (Leyvas stood at Defense Attorney Van Tress' request.)\n\n\"A. Yes, that is him.\n\n\"Q. That is the picture that was shown you? A. Yes.\n\n\"Q. At the Grand Jury? A. Yes. . . .\n\n\"Q. . . . Where did you see Joe Manfredi go when he was being chased? A. He went out through the side of the kitchen up to the front of the house. . . .\n\n\"Q. Reading page 169 of the Grand Jury transcript, beginning at line 19: 'Q -- Did you see the girls assault anyone? A -- Just the one grabbed me, but there were about three girls, I can remember, that were there, but the only one I could recognize was this Encinas girl' Was that the answer that you gave before the Grand Jury? A. Yes. That was before I had seen the Parra girl. . . .\n\n\"Q. Now, you told us that it was Ysmael Parra who went after Joe Manfredi? A. Yes, it was him.\n\n\"Q. When you testified at the Grand Jury hearing you testified that it was Henry Leyvas who went after Manfredi? A. I don't remember saying that. I knew all along who it was that was going after Joe Manfredi. . . .\n\n\"Q. You say you saw Parra chasing Joe Manfredi? A. Yes.\n\n\"Q. And the next thing that happened was that while some girls were piled on top of you that Parra then came back and hit you; is that right? A. Yes, after he had stabbed Joe Manfredi.\n\n\"Q. Did you see him stabbing Joe? A. Yes, I did. I seen him.\n\n\"Q. Where was Parra and where was Joe when you saw that? A. Right here (indicating); right here in this corner (indicating a place in the passageway between the bunkhouse and the Delgadillo home, near the southeast corner of the bunkhouse). . . .\n\n\"Q. Now, in the light there did you see Parra? A. Yes, I saw him when he went after Joe Manfredi . . . with a knife.\"\n\nThe testimony of this witness is in conflict, as shown by the above quotations from the record, with that of Joe Manfredi on the important points as to when Joe Manfredi entered the patio and the manner of his entry, as well as to when the witness, herself, engaged in the fight with another girl\n\ninvolving hair pulling and her hitting a girl with a beer bottle, and as to when and how the Parras left the patio.\n\nObviously, if Parra stabbed Joe Manfredi before the fight between Eleanor Coronado and the only girl with whom she fought, Joe Manfredi could not have entered the patio for the first time after the fight between this witness and the other girl. If Joe Manfredi just walked into the patio to see what was going on, he was not brought in by some other boys who were hitting him in the stomach at that time. If Parra took his wife and left the patio by the gate immediately after the fight between her and Eleanor Coronado, he could not have chased and stabbed Joe Manfredi in the passage between the kitchen and bunkhouse, after that fight between the girls.\n\nTheir testimony is in further conflict as to the uninvited guests at the party, Eleanor Coronado saying that some eight or eleven boys from Downey had been hanging around the patio gate, and that two of them had entered the patio; gone toward the kitchen and demanded beer; that she had followed them expecting trouble, and one of the boys had threatened her father with an upraised chair, the other preventing trouble by taking him outside.\n\nWhile Eleanor Coronado did testify positively that she saw Parra stab Joe Manfredi, the questions and answers from her grand jury testimony read into this record, some of which are above quoted, show that, during her former testimony, she was just as positive that she had seen Henry Leyvas stab Manfredi. While her narrative to the grand jury is substantially the same as that given at the trial, nevertheless the identification of the actors as Henry Leyvas and Lorena Encinas in her former testimony and Ysmael and Delia Parra in her testimony at the trial is only explained by her as having been occasioned because her testimony was given before the grand jury \"before I had seen the Parra girl.\" To say the least, her testimony is therefore unsatisfactory and as well unconvincing.\n\nManuel Reyes\n\nConcededly, this defendant, 17 years of age, was one of the crowd of boys who visited \"Sleepy Lagoon\" early on the evening of August 1st when an attack was made upon them by the \"boys from Downey.\" He also was a member of the caravan that later made the trip to the Delgadillo premises. The only evidence against this defendant which\n\nwe can find in the record is that given by Joe Manfredi, victim of the assault charged in count II of the indictment. After stating: \"I am not going to name them for you, but I am going to ask them to stand up one at a time,\" the district attorney, as each of the defendants arose, asked the witness Joe Manfredi if he recognized them. However, when the district attorney reached this defendant Reyes, he specifically called him by name, saying, \"Now, then, Mr. Reyes will you stand, please? Do you recognize him?\", to which the witness answered, \"Yes, I remember him -- yes.\" Later during the direct examination, when the district attorney asked appellant Reyes to stand, again calling him by name, the witness Manfredi said, \"Well, I think he was walking in with the first group, I believe.\" On the following day, while the witness Joe Manfredi was under cross-examination, he was asked to indicate the defendants he had seen on the early morning of August 2nd, whereupon he carefully looked over all of the defendants and pointed out the same defendants he had recognized on direct examination, save and except defendant Acosta and this appellant Reyes.\n\nFor the reasons set forth by us in connection with the testimony of this witness, Joe Manfredi, in narrating the testimony with reference to the defendant Parra, we are impressed that his testimony with reference to this defendant is just as unsatisfactory as was his identification testimony of and concerning appellant Parra.\n\nWe find in the record no other testimony implicating this defendant in the offenses charged against him. A statement made by him to the officers, which he contended was elicited by force and violence, which coercion was denied by two police officers, did not in anywise implicate appellant Reyes as a participant in the commission of the crimes alleged in the indictment.\n\nA review of the evidence insofar as this defendant is concerned would indicate that he had \"passed out\" as a result of intoxication. In his statement, he implicated other codefendants but, as hereinbefore stated, such testimony was inadmissible as against such codefendants; and as to appellant himself, his statement did not in anywise link him with the alleged crimes, for which reason it is unnecessary to here set forth in detail his statement. Notwithstanding the absence of any evidence that the appellant Reyes participated in any of the assaults, he was convicted of murder in the second\n\ndegree and of both counts of assault with a deadly weapon with intent to commit murder as charged in the indictment.\n\nVictor Thompson\n\nSo far as any testimony involving this defendant in any assault is concerned, we feel it may safely be stated that none was presented. Joe Manfredi, a witness for the prosecution, testified that defendant Thompson was present on the night in question, but when asked whether it was in the \"inclosed yard\" of the Delgadillo property or somewhere outside, the witness testified that he \"must have seen him outside.\" Where, however, he could not say. Another prosecution witness, Marie Lola Delgadillo, testified specifically she did not see Thompson the night of August 1st. It will be recalled that both of these witnesses testified extensively as to what transpired in the patio, where the victims named in counts II and III claimed they were stabbed.\n\nThe prosecution introduced evidence that this defendant was questioned by a deputy sheriff during the investigation of the altercation at the Delgadillo premises, at which time this defendant denied being present. The prosecution places much emphasis upon the falsity of this statement, which is established by testimony later given by this defendant before the grand jury, and which was read into evidence at the trial. However, when he was before the grand jury he was under oath, and he explains his denial to the officers of his presence at the Delgadillo home by saying that at the time he was on probation for violation of section 503 of the Vehicle Code, and did not therefore want to involve himself in any trouble. We have read the testimony given by this defendant before the grand jury and find therein nothing which tends to incriminate him. In fact his testimony may be epitomized by his statement that he \"never touched anybody\"; a statement which, so far as we can ascertain from the record, is undisputed by any admissible evidence. Neither through any identification, or any admission is this defendant connected with either the homicide or the assaults charged in the indictment. The verdicts as to this defendant found him guilty of murder in the second degree and of both of the assaults with intent to commit murder charged in the indictment.\n\nHenry Ynostroza\n\nThe only testimony against this defendant was contained\n\nin claimed admissions he made in a statement which he gave to the officers and later in testimony given before the grand jury. From this statement and testimony, it appears that this defendant embarked upon the return trip to the \"Lagoon\" and Delgadillo home with the intent and purpose of aiding in \"beating up them guys\" who had previously attacked some of his codefendants. He then involves some of his codefendants in claimed fistic encounters with and assaults upon people at the Delgadillo home, but such testimony, of course, is not admissible against the named defendants. So far as any activities upon the part of this defendant is concerned, it may be summarized by his own statement that he struck a man with his fist. The identity of the man so struck is not established by the evidence, and certainly it cannot be said that it was either the deceased Diaz or Reyes or Manfredi, named as victims in the assaults charged in counts II and III of the indictment. While the evidence indicates that this defendant witnessed some assaults, there is no evidence that he was either armed or participated in any other than the just mentioned simple assault. He was convicted of murder in the second degree and of the two assaults with deadly weapons with intent to commit murder charged in counts II and III of the indictment.\n\nGus Zammora\n\nSo far as any specific evidence to connect this defendant with the homicide and assaults is concerned, it consists of statements made by him after his arrest to a deputy sheriff, taken down in shorthand and transcribed, together with his testimony given before the grand jury. Summarizing such statement and testimony, it appears that this defendant was at \"Sleepy Lagoon\" between 10:30 and 11 o'clock when the first fracas occurred between the so-called \"Downey boys\" and certain of these defendants. According to this defendant, following the altercation just referred to, \"we got into the car and we went back\" to 38th Street to secure reinforcements \"to get those guys\"; \"to go back up there and have another fight.\" He accompanied the returning caravan and the car in which he was riding stopped a little more than half way between the \"Lagoon\" and the Delgadillo house where he alighted and ran toward the house.\n\nHe then makes certain statements incriminating some of his codefendants, but which were inadmissible as to them\n\nand did not involve himself. As an example of the prejudicial effect of these statements upon defendants against whom they were inadmissible, it might here be noted that in his extra-judicial statements or testimony before the grand jury, this defendant stated that, during the altercation at the Delgadillo home, he saw a woman kneeling beside a man lying in the road, and that she was pointing at the defendant Ruiz and kept shouting, \"He done it,\" This defendant stated that he was present \"When Ruiz and several others\" were beating a man in a brown and black suit; that when he got there the man was already lying on the ground\" and that he \"hit the man and he fell\"; that he \"swung\" as the man was getting up but slipped in so doing. He denied throwing any rocks or having a knife or other weapon. So far as the admissible testimony against this defendant is concerned, it may be summarized by stating that he committed a simple assault upon someone, but who the victim of such assault was is not disclosed by the record. His testimony before the grand jury was practically the same as his statement to the officers and consisted in the main of testimony concerning the activities of codefendants which, under the correct ruling of the trial court, was inadmissible as to such defendants and, as we have heretofore pointed out, fails in anywise to specifically connect this defendant with the murder charged in count I or the assaults with a deadly weapon with intent to commit murder charged in counts II and III.\n\nUpon reading the voluminous transcript of the testimony adduced at the trial, one is immediately impressed that there is a great volume of evidence establishing the fact that a majority of the defendants committed one or more assaults and that in some instances weapons which could be classified as deadly weapons were used. However, such incriminatory evidence is contained in the many written statements taken from defendants after their arrest and in which they made accusatory declarations against codefendants, and which accusations were, as held by the trial court, inadmissible against such codefendants. When the admissible evidence is separated from the inadmissible, as we have done in the foregoing narrative of the factual background surrounding this prosecution, it becomes apparent that, except as to the defendant Parra, tangible and substantial evidence is woefully lacking to identify any of these appellants as having committed an\n\nassault with any deadly weapon upon either of the victims named in counts II or III, and as to all the appellants the record is devoid of any evidence directly showing that any of them committed an assault upon the decedent, Jose Diaz. It is not surprising, however, that the jurors, lacking legal training and experience, found it extremely difficult to keep before them the admissible, as distinguished from the inadmissible evidence in a trial which lasted for 13 weeks, involved 22 defendants and 66 separate charges. From the testimony herein, it appears that, as to six of these appellants, there is an utter lack of evidence that they directly committed any assault. As to the others the evidence shows three of the appellants committed an assault or assaults with their fists, while, of the remaining three, the evidence indicates that an assault was committed by one with the use of his fists and by kicking; another was guilty of an assault with a stick; and the remaining appellant Parra committed an assault with a knife, if the evidence of and concerning appellant Parra to which we have hereinbefore referred be considered as satisfactory and sufficient to establish guilt beyond a reasonable doubt.\n\nWhile conceding that satisfactory proof was offered to establish the corpus delicti of the charges of assault with a deadly weapon with intent to commit murder contained in counts II and III of the indictment, appellants challenge the sufficiency of the evidence to establish the corpus delicti of the murder charge set forth in count I. In this regard, appellants urge that \"there is not one word of direct testimony showing either that Jose Diaz was killed by any one or that any of the defendants ever laid a finger on him.\" It is appellants' contention that \"possibly\" Diaz came to his death by means of an automobile accident, or \"possibly\" as the result of a fall on an uneven surface, or \"possibly\" because of a blow or blows administered during a fist fight. Appellants' claim in this regard is without merit. The autopsy surgeon testified that, because of the location of the injury to the deceased, \"I concluded it was not due to a fall to the ground,\" but that the nature and location of the injuries to the head showed that \"some instrument was used. . . .\"\n\nOn cross-examination the autopsy surgeon, it is true, testified that the death of Diaz could have been caused by a fall\n\nupon a rocky or uneven surface, but not by contact with level ground. While this physician admitted on cross-examination that the death of Diaz might have ensued from a blow administered by a \"very powerful\" fist, it was nevertheless his opinion that, because of the crushing injury to the left side of the face, some instrument was used.\n\nAdded to this is the testimony of Maria Albino that she observed a fight in the vicinity of the power poles in which a number of persons were apparently attacking a single individual, and, while on cross-examination this witness admitted that she saw only shadows moving with upraised clenched fists, but no clubs or other instruments, nevertheless her testimony indicated that Diaz was engaged in an altercation.\n\nThis and other evidence warranted a finding by the jury that Diaz came to his death by means of a criminal agency and not, as suggested by appellants, through accidental means.\n\nWe come now to a consideration of appellants' claim that the evidence is insufficient to support the verdicts. While jurors are the sole and exclusive judges of the value and effect of evidence, their discretion and power in that regard is not absolute. Just verdicts cannot be founded upon unreasonable inferences, speculation or suspicion, but must be grounded upon satisfactory evidence and reasonable inferences predicated thereon. In the instant case, it is true that appellants had opportunity for the commission of the crimes charged in the indictment. But others had the same opportunity. The sufficiency of the jury's verdict must be tested in the light of whether the evidence upon which the verdict is framed was of such a character that it can be said therefrom that no reasonable doubt of the defendants' guilt existed.\n\nIt was the contention of the prosecution that appellants had conspired together to commit murder, assaults with intent to commit murder, assaults with a deadly weapon and assaults by means of force likely to produce great bodily injury; that the objective and common design of such conspiracy was to wreak vengeance upon and against the so-called \"Downey boys\" who had allegedly assaulted some of the appellants earlier on the night in question; and that, in furtherance of such common design of revenge, and, as a natural and probable consequence of such common design and conspiracy,\n\none or more members of such unlawful combination committed all of the crimes charged in the indictment. However, our examination of the record in this case convinces us that there is a complete lack of material and relevant evidence from which the jury could properly find or infer that appellants formed a conspiracy of the kind and type, or for the purposes, claimed by the prosecution. The most shown by the evidence is that appellants banded themselves together to \"have it out . . . with their fists\" with the \"Downey boys\" in retaliation for the fistic encounter that had taken place earlier that night. But, to say that they combined together with the avowed purpose of committing murder does violence to the factual situation presented by the record herein. There is also a total lack of evidence to show that any of the appellants murdered Diaz, and only the unsatisfactory evidence hereinbefore discussed in connection with defendant Parra to show that any defendant committed any assault with a deadly weapon. Indeed, respondents confess in their brief that \"the evidence, however, in the hands of the prosecution unerringly pointed to the conclusion that some one or more of the defendants had been perpetrators of the crimes charged,\" but we are not directed to any evidence in the record which identifies any of the appellants with the murder of Diaz or the assaults charged in counts II and III, except the testimony hereinbefore discussed as to appellant Parra in connection with the assault upon Joe Manfredi charged in count II.\n\nIn its instructions, the court advised the jury fully and elaborately on the law of conspiracy, but left it to the jury \"to determine whether or not there was a conspiracy. . . .\" The court also instructed the jury that all persons concerned in the commission of a crime, whether they directly and actively committed the act constituting the offense or aided and abetted in its commission, or advised or encouraged its commission are principals in any crime so committed, and equally guilty thereof. The diversified verdicts returned by the jury indicate that they did not proceed upon the contention advanced by the prosecution that the crimes charged were committed in furtherance of a conspiracy, but considered the activities of each appellant under the alternative theory submitted to them by the court, and returned verdicts based solely upon what the jury concluded was the conduct of each\n\nappellant acting individually, separately, and apart from any criminal combination or conspiracy.\n\nThe evidence in the instant case shows that when appellants entered the Delgadillo premises there ensued what is commonly referred to as a \"free for all\" fight. Respondent asserts that the record is barren of any evidence \"which supports any legitimate inference that the people at the Delgadillo home expected trouble after the departure of the so-called 'Downey boys' and before the arrival of the defendants.\" However, the record does disclose that earlier on the night in question some eleven or twelve of the so-called \"Downey boys\" were \"hanging around\" the Delgadillo premises just outside the fence; that at least two of them, upon entering the premises asked for alcoholic refreshments and upon refusal of this request one of the boys picked up a chair in a menacing manner, but was disarmed by his companion and led from the patio. In other words, all was not peace and tranquility at the Delgadillo party prior to the arrival of appellants. We are cited by respondent to several cases which are declaratory of the law of conspiracy. But in all of these cases the defendants therein were charged with the crime defined by section 182 of the Penal Code. Furthermore, except as to defendant Parra, the evidence fails to directly connect any of the defendants as actually or actively participating in the killing of Diaz or the assault upon Reyes as charged in count III. As to count II the evidence is insufficient to directly connect any of the defendants except Parra with the commission of the offense therein charged.\n\nWhen, as a matter of law, it can be said, as in the instant case, that the criminal combination, if any, embraced no more than a purpose to encounter the \"Downey boys\" who had previously assaulted and beaten some of the defendants, and to \"beat them up,\" \"have it out\" with them, \"with our fists,\" or, in other words, to commit or aid and abet in the commission of battery, simple assault or disturbance of the peace, and that the killing of Diaz and the assaults with deadly weapons committed upon Reyes and Manfredi were not within the reasonable and probable consequences of any such common unlawful design as shown by the evidence, it follows that the guilt of appellants was not legally established. The more or less unsatisfactory evidence heretofore\n\nreferred to against appellant Parra certainly does not establish his alleged actions as being in furtherance of any conspiracy, the common design of which was to commit murderous assaults. It must therefore be held that, as a matter of law, the evidence is insufficient to sustain the conviction of any of appellants except possibly Parra.\n\nBecause a number of defendants are principals, in an offense of assault, battery, disturbance of the peace, riot, rout or unlawful assembly, it does not necessarily follow that all would be principals in an offense of murder or felonious assault that might occur during such a disturbance.\n\nAppellants next complain that the trial judge in his ruling on objections consistently favored the prosecution and ruled against the defense on identical questions of law and fact. In urging this point, appellants state that they \"are not particularly concerned whether each ruling discussed is erroneous, but contend that by his rulings the trial judge consistently favored the prosecution.\" We have carefully reviewed the rulings of the trial judge, of which there were a very large number. Insofar as such rulings are concerned, we perceive no prejudicial error arising therefrom. Our function is to determine the correctness of the rulings made on the admission and rejection of evidence and to determine whether rulings adverse to the appellants were erroneous and, if erroneous, operated to the prejudice of appellants' substantial rights. We find no such prejudice resulting from the rulings complained of.\n\nIn our perusal of the reporter's transcript, we find many instances where objections made by the prosecution were overruled, including many objections by the district attorney that the question had been asked and answered. We also find numerous instances where testimony elicited by the prosecution was stricken by the court without any request from defense counsel for such action. Many occasions also appear in the record where the court sustained objections made by counsel for the defense, and on some occasions, the trial judge anticipated the defense objections and himself interposed objections and sustained the same. Upon other occasions, the court assisted defense counsel to reframe questions in order to overcome objections made by the prosecution. Several times the court refused to proceed with the trial until a defendant's counsel was present, notwithstanding\n\nsuch defendant's previous consent to his being represented temporarily by counsel for a codefendant. The record impresses us that the trial judge did this whenever he felt that testimony being elicited directly affected the interests of the defendant whose counsel was temporarily absent with the consent of his or her client. There are also instances where the court sustained objections made by defense counsel on grounds other than those urged. In this long and protracted trial of thirteen weeks, we cannot say that the court in ruling upon objections assumed an attitude or pursued a course of conduct which in any way militated against the substantial rights of the appellants or operated to their prejudice insofar as ruling upon the admission and rejection of evidence is concerned.\n\nWe come now to a consideration of appellants' claim that the trial judge made numerous prejudicial remarks of and concerning defense counsel, thereby being guilty of misconduct during the trial. In this regard, the record in part discloses the following. In response to a question by the district attorney, a witness had answered, \"Well, that sound came from the Delgadillo house\"; whereupon the district attorney repeated, from the direction of the Delgadillo house, you mean?\" The witness answered, \"yes.\" Thereupon the following transpired.\n\n\"Mr. Van Tress: I object to counsel leading the witness.\n\n\"Mr. Barnes: This is not leading the witness.\n\n\"The Court: I would suggest Mr. Van Tress, you having made repeatedly the objection that a question is leading, will you please look up during the noon hour just what a leading question is?\n\n\"Mr. Van Tress: I have not made repeated objections.\n\n\"The Court: I am sorry.\n\n\"Mr. Van Tress: I have kept quiet for three days; I haven't repeated objections.\n\n\"The Court: Somebody is using ventriloquism; we have a Charlie McCarthy using Mr. Tress' voice.\n\n\"Mr. Shibley: I am going to assign that remark of your Honor as error.\n\n\"The Court: You can assign it as error. I am getting thoroughly tired of useless and unnecessary objections being made in these proceedings. There is some reason back of the making of these repeated objections.\n\n\"Mr. Shibley: I wish to assign these remarks of your Honor as error, and ask the court to instruct the jury to disregard them.\n\n\"The Court: You may proceed, Mr. Barnes.\"\n\nUpon another occasion when the same defense counsel made a statement to the court the following occurred:\n\n\"The Court: Mr. Van Tress, I am afraid you have been asleep. The discussion now is as to whether the witness testified he did not feel it.\n\n\"Mr. Van Tress: I resent the court's remarks I must have been asleep, because I have not been asleep.\n\n\"The Court: You evidently did not hear what has been going on in the last five minutes.\n\n\"Mr. Shibley: I think that should be assigned as misconduct . . .\n\n\"The Court: Go ahead and make your assignment of misconduct. It is about time for you to make another one, anyway.\n\n\"Mr. Shibley: And I ask the jury be instructed to disregard that. I also assign this last remark of the court as misconduct and ask the court to admonish the jury to disregard that, too.\n\n\"The Court: I am not going to give that instruction on either assignment, and I want the record to show that every time I caution counsel, or that he is told to pay attention to anything, I indicate as to which counsel himself should observe, Mr. Shibley immediately comes forward with an assignment of misconduct. You may proceed.\"\n\nUpon another occasion when one of defense counsel charged that by the form of his objection the district attorney \"has in effect coached the witness,\" and when the district attorney arose and said, \" I resent that . . .,\" the court interrupted to say, \". . . I want to say that I resent that, Mr. Shibley. It is statement absolutely unworthy of any respectable member of the Bar. It was vicious and wholly uncalled for, and I think you owe Mr. Barnes an apology. Mr. Barnes was absolutely within his rights in making the objection to a question to this witness upon a situation as to which you should have known that the witness had not yet testified at all. The county has gone to the expense of furnishing you with a daily transcript, and if you do not choose to read it and keep yourself informed on the matter, counsel is entitled to make\n\nobjections when ever they are proper. . . . If you want to apologize, you may do so; if not, you will be seated.\"\n\n\"Mr. Shibley: I wish to assign your Honor's remarks and the remarks of counsel as misconduct and as prejudicial to my defendants, and I ask that the jury be instructed to disregard them, and I wish the record to show that remarks were not directed to the objection as such of counsel, but as to his statement later in the presence of this witness. I wish the record to show that this witness who is -- whose credibility and memory are being tested by me -- has already testified this morning as to --\n\n\"The Court: I do not want an argument. Make your assignment.\n\n\"Mr. Shibley: I have made my assignment.\n\n\"The Court: And, I take it, you do not choose to apologize?\n\n\"Mr. Shibley: I do not choose to apologize to Mr. Barnes, because I meant no offense to Mr. Barnes. I meant to point out the respect in which I thought he was guilty of misconduct.\n\n\"The Court: You may proceed, Mr. Van Tress.\"\n\nA particularly offensive incident occurred when a deputy sheriff was on the witness stand and had in his hand a memorandum. We quote from the record.\n\n\"Mr. Shibley: I note that the witness is apparently using some memorandum.\n\n\"Mr. Barnes: No, he is not apparently using some memorandum. He has the memorandum in his hand.\n\n\"The Court: Let the record show it is perfectly obvious that the officer has a document which is typewritten, consisting of two colored slips of paper, and they are so folded he cannot read them.\n\n\"Mr. Shibley: I cannot see very well from where I am.\n\n\"The Court: Before you make any accusations, Mr. Shibley, you should be a little careful.\n\n\"Mr. Shibley: If your Honor please, I assign this manner of speaking to me as misconduct, and ask that the jury be instructed to disregard it.\n\n\"The Court: The jury won't be instructed to disregard it. Furthermore, the court at this time wants to say that Mr. Shibley is guilty of serious misconduct in making the statement of fact the witness is using a memorandum when it was\n\nperfectly obvious to anybody he was not looking at the paper and that the witness was not using the memorandum, and that whatever he had in his hand was not readable in the position in which he was holding it and the manner in which it was folded.\n\n\"Mr. Shibley: I assign that as misconduct and desire --\n\n\"The Court: Proceed.\n\n\"Mr. Shibley: May I make a statement for the record, your Honor?\n\n\"The Court: No, I do not want any statement. You can make your assignment.\n\n\"Mr. Shibley: As part of the assignment, if your Honor please, I wish the record to show that I am in such a position where it is almost impossible for me to see what is in the witness' lap or what is in the hands of the witness. I simply saw a piece of paper or a part of a piece of paper in the witness' hands from where I was.\n\n\"The Court: The record may show. . . .\n\n\"Mr. Shibley: . . . And I intend to make an inquiry, if your Honor please, rather than a statement of facts. I meant to inquire if the way it appeared to me, that the witness was using a memorandum --\n\n\"The Court: The record already shows the language you used, Mr. Shibley; you cannot change it now.\"\n\nThe record herein discloses that throughout the protracted trial, because of the number of defense counsel and the seating arrangements in the courtroom, counsel, and at times the court, experienced difficulty both in hearing and seeing what was transpiring. Instead of being \"guilty of serious misconduct\" as charged by the court, counsel was, in apparent good faith, attempting to protect the rights of the defendants. This was not only his privilege, but his sworn duty. The reprimand and severe castigation administered by the court was as undeserved as it was unwarranted.\n\nOn yet another occasion, when one of defense counsel addressed the court, \"I want to make an assignment of misconduct,\" the following transpired:\n\n\"The Court: I would feel rather bad if you did not make an assignment of misconduct once every session.\"\n\nOur attention is directed to other comments, but we feel that, without unduly prolonging this opinion, we have set forth a sufficient portion of the record in that regard to indicate\n\nthat this more or less constant bickering and quarreling with counsel by the court was not conducive to the creation of that type of atmosphere that should permeate a judicial inquiry as to the guilt or innocence of those charged with serious crimes. Even though the trial judge felt it necessary to halt defense counsel in a particular course they were taking, that could have been accomplished by remarks of a more dignified and temperate character.\n\nWe are satisfied that the trial judge injured materially the defense of appellants by the character of rebukes he administered in the presence of the jury when, in most instances, not even a mild rebuke was deserved. Defense counsel was held up to the jury as one who, in an endeavor to present a defense, would resort to unethical and even iniquitous practices. Imputations upon the good faith of counsel made in the presence of the jury, can unjustly injure the cause of a defendant and thereby deprive him of that fair and impartial trial to which everyone is entitled. We do not wish to be understood as holding that the judge of the trial court is without power to direct the course of the trial, or that he is to act merely as an umpire between two contestants, but it should be remembered as an indisputable fact that every remark made by the trial court tending to disparage either party to a cause or counsel has more or less effect upon the jury, unskilled as a rule in court proceedings and, we think it may fairly be said, ever ready to accept any intimation from the court as to what their verdict should be.\n\nThe transcript also reveals numerous occasions when the judge made comments that might well have been omitted. For instance, when the autopsy surgeon was testifying, he was asked whether he had performed autopsies on the bodies of persons who died as the result of injuries received in the prize fight ring, to which the doctor answered, \"I have seen cases of that type where they have had concussion of the brain and cerebral hemorrhage, but not a fracture of the skull.\" Thereupon, Mr. Van Tress (one of defense counsel) moved that the answer be stricken on the ground that, \"It is a known fact that people in the prize ring wear padded gloves. It would not be a fair comparison.\" Instead of ruling upon the motion, the court injected the following:\n\n\"Well, I do not think that alters the situation very much.\n\nIt is a matter of common knowledge the amount of padding on there is not very extensive.\"\n\nUpon another occasion when the validity of an objection was being debated, the court remarked:\n\n\"I think you will have to bear in mind also that the witness has been confused more or less by the questions.\" This occurred during cross-examination by defense counsel and it certainly was not for the court to say but what the confusion of the witness was attributable to causes other than the form of the questions propounded. The remark certainly impaired the effectiveness of the cross-examination.\n\nAt another time during the cross-examination by defense counsel, the witness was asked:\n\n\"Any stick of any size, then, you call a 2 by 4, is that right?\", to which the witness responded, \"That is right.\"\n\nThe court thereupon injected the remark: \"The question is quite misleading. It is quite obvious the witness would not state a stick one-eighth inch in diameter is a 2 by 4.\"\n\nIt is evident from an examination of the transcript that what defense counsel was trying to bring out was that the witness did not know what the term \"two by four\" meant, other than that it referred to a piece of wood, and the court's remark tended to nullify the effect of the point counsel was attempting to or, in fact, had made.\n\nWhile it is true that, in his instructions to the jury, the trial judge admonished them to \"entirely disregard and not to consider for any purpose any remarks between court and counsel during the course of the trial,\" it would have been better judicial practice not to indulge in such comments, for as heretofore pointed out, jurors watch courts closely, and place great reliance on what a trial judge says and does. They are quick to perceive a leaning of the court. Every remark dropped by the judge, every act done by him during the progress of the trial is the subject of comment and conclusion by the jurors, and invariably they will arrive at a conclusion based thereon as to what the court thinks about the case. Hence it is that judges presiding at trials should be exceedingly discreet in what they say and do in the presence of a jury lest they seem to lean toward or lend their influence to one side or the other. However impatient a trial judge may be with a defense, he should be careful not to indicate\n\nsuch impatience by remarks or comments made during the course of a trial which will prejudice a defendant.\n\nAppellants next assert error in certain rulings of the trial court relative to the admission and rejection of evidence. In this regard, complaint is made that the court committed prejudicial error in admitting into evidence certain statements made to police officers by some of the appellants after the latters' arrest. The trial court repeatedly and explicitly instructed and admonished the jury that such statements were admissible only as against the particular defendants making them and not as against any other defendant.\n\nOrdinarily, appellants' contention in this regard could be answered by citing a section of the code, subdivision 2, section 1870, of the Code of Civil Procedure, which provides that evidence may be given upon a trial of \"the act, declaration or omission of a party as evidence against such party,\" but in the instant case there appears to us to be considerable question as to whether, in any of the statements, the declarant therein made what could legally be called a declaration or admission against himself. Such statements were introduced into evidence and read to the jury. Each of such statements is teeming with accusatory statements against codefendants, but, in every case, the declarant absolves himself of participation in either the murder or the assaults with deadly weapons with intent to commit murder as charged in the indictment. The only self-incriminatory statement we find is the appellant Telles' statement that he struck a man three times with a stick, but this falls far short of incriminating himself in any of the charges contained in the indictment. That these statements were highly prejudicial to the codefendants, against whom they were inadmissible, admits of no doubt or contradiction. For instance, in the statement of defendant Joe Carpio, who was acquitted, we find him saying that on the day following the occurrences at the Williams Ranch Henry Leyvas told his brother, Ceferino, \"We had a mean battle, and I think somebody got killed.\" Also the statement, \"I heard he (Henry Leyvas) uses a knife . . . when he fights with the boys . . . Yes . . . he has been in lots of gang fights. He (Henry Leyvas) has been in the jail for about 6 months to 8 months.\"\n\nNotwithstanding instructions of the court that such statements were not to be considered against codefendants named\n\ntherein by the declarant, it is obvious, in the light of human experience, that the effect of such statements upon the jury would serve only to injure the cause of the codefendant so accused and against whom such statements were concededly inadmissible. The multiplicity of such statements coupled with the number of defendants and the long duration of the trial could serve only to make more difficult the task of the jury in following the court's instructions not to consider such testimony save and except as to the defendants who made the statements. We must, therefore, critically examine the correctness of the ruling admitting the statements at all.\n\nEven though we concede that in some instances the declarations contained admissions made by the declarant against interest, it was unnecessary to introduce all of the damaging and prejudicial statements concerning codefendants in order to present to the jury any claimed admission or confession made by the declarant against his own interest. We do not want to be understood as holding that any admission or confession made by the declarant in these statements was not admissible, but we do hold that it is not permissible to get before the jury damaging and prejudicial, but inadmissible evidence against a codefendant, under the guise of introducing an admission or confession by someone else who has made a statement. The parts of such declarations containing accusatory and inadmissible statements against codefendants should have been excluded, and only those parts containing admissions against interest or confessions by a declarant or which were properly admissible for purposes of impeachment should have been admitted. To hold otherwise, would be to make possible a conviction upon what is purely hearsay and inadmissible but extremely prejudicial evidence. Notwithstanding the admonitions of the court, the prejudicial statements are nevertheless before the jury and to hope that they might be forgotten by the jury in their deliberations is to belie human nature and challenge human experience. What we here say has application only to the facts of the instant case in which it appears to us either that no admission against interest was contained in a given statement or, if so, it was unnecessary in order to get such admission before the jury to permit the inadmissible and highly prejudicial portions of such declarations against codefendants to be read into the record.\n\nIt is next asserted by appellants that the court erred in admitting into evidence a certain broken chair. It was testified by Maria Delgadillo that the chair which was in the patio on the night in question was not broken prior to the arrival of certain of the defendants. While there is no direct evidence as to who broke the chair or by what means such breaking was accomplished, there is, nevertheless, sufficient evidence to afford reasonable grounds for the assumption that the chair was connected with the crimes charged. The objection goes more to the weight than to the admissibility of the exhibit, and no prejudicial error can be predicated upon the ruling of the court permitting its admission.\n\nAppellants next complain that the court erred in permitting evidence on cross-examination, over the objection of appellants, that appellant Leyvas had been confined at one of the honor farms as an incident to a prior sentence to the Los Angeles County Jail. In this connection, it appears that for the avowed purpose of showing that the general conduct, behavior and associations of appellant Leyvas were good, defense counsel elicited from him on direct examination that for eight or nine months prior to August 1, 1942, he had lived at Clearwater in Los Angeles County; that, during this period he was employed by his father on the latter's ranch; that prior to this time, he had lived with his family at 1823 45th Street, in Los Angeles for some twelve years. As a matter of fact, during the aforesaid nine months, appellant Leyvas was in jail. On cross-examination, the district attorney inquired of Leyvas if the latter had lived continuously on the ranch at Clearwater during the nine months in question, to which inquiry the witness answered, \"No.\" Then the district attorney asked, \"Where else did you live?\" Strenuous objection by appellant Leyvas' counsel was overruled by the court and the witness answered that, during a part of that period he was in the county jail and at the honor farm. Appellants contend that when the witness admitted by his direct answer, \"No\" on cross-examination that he had testified falsely with regard to his place of residence on his direct examination, his impeachment on that score was complete and subsequent answers served only to degrade and prejudice the witness in the eyes of the jury. While, under our law, a defendant cannot be compelled to testify,\n\nif he elects so to do in his own behalf, then he may be cross-examined \"as to all matters about which he was examined in chief\" (Pen. Code,  1323). And it is the scope of the direct examination that determines the proper limits of the cross-examination. As long as the cross-examination is limited to the subject matter of the direct examination it is allowable. In the instant case, the cross-examination in question did not go beyond the general scope of matters covered by the direct examination. One has but to read the direct examination of appellant Leyvas to readily discern that its obvious purpose was to create the impression with the jury that appellant Leyvas was a quiet, peaceable and industrious young man, given to innocent recreational and religious activities; that he had spent some nine months prior to August 1, 1942, working on his father's ranch. On cross-examination the prosecution had the right to elicit anything which would tend not only to contradict the evidence adduced on the direct examination, but which would tend to weaken or modify its effect. To hold otherwise than that the ruling of the court was correct would amount to too narrow a construction of the scope of the direct examination.\n\nFor the next ground of appeal, it is contended that the court erred in numerous rulings affecting evidence received as to what was throughout the trial commonly referred to as \"The 38th Street gang.\" Our reading of the record impresses us that considerable of this testimony violated the hearsay rule and should not have been admitted. As an example of the questions calling for hearsay answers, and which elicited that type of answer, we cite the following:\n\n\"Had you heard of that gang before that evening?\" Subsequently the witness who answered that she had heard of the gang testified that the only basis for her testimony regarding \"the 38th Street gang\" was that she had heard the \"kids\" say there was such a gang. Other questions of a similar character were:\n\n\"What persons have you heard are reputed to be members of the 38th Street gang?\"\n\n\"Was he known as a member of the 38th Street gang?\"\n\nAppellants complain that the frequent reference to the \"38th Street gang,\" and their claimed membership therein, operated to their prejudice. However, the term was not used in such a manner as to convey any opprobrius or sinister implications.\n\nAs was aptly said by the trial court on an occasion during the trial,\n\n\"In the use of the word, we have to bear this in mind. Some of these witnesses have been using that expression, as I said earlier, the word 'gang' does not necessarily have a sinister meaning. It becomes sinister only when we associate it with activities.\"\n\nIt is true that the manner in which the term was used, that is to say, the inflection of the voice or the facial expression, might give the term a meaning that was prejudicial to the members of such so-called \"gang,\" but, of course, the cold record does not reflect the manner and demeanor of the prosecutor when he used the term. In view of the aforesaid statements of the trial judge, we cannot infer that the term \"gang\" was used in any manner disparaging to or reflecting upon the defendants. Furthermore, when the ages of the members of this so-called \"gang\" are considered, coupled with the nature and character of their association, as developed by the evidence, it seems only reasonable to assume that the use of the word \"gang\" referred only to the usual and ordinary crowd of young people living in any particular neighborhood, who associate themselves together, and from time immemorial has been referred to as a \"gang.\" We fail to find any prejudicial error resulting to appellants from either the hearsay or other evidence concerning the so-called \"38th Street gang.\"\n\nAs a further ground of appeal, it is contended by appellants that prejudicial error was committed by the court when the district attorney was permitted to impeach his own witnesses, without first claiming surprise and thereupon following the procedure required under such circumstances in that regard. Typical of the course pursued and about which complaint is made, the following is reflected by the record:\n\nDuring the district attorney's examination of the People's witness, Josephine Gonzales, she testified that on the night she went to the Delgadillo house she \"did not hear anything about a dance going on there.\" The district attorney thereupon read from the testimony previously given by the witness before the grand jury, wherein she had testified that the boys were going \"to come back where the dance was going on and\n\nbeat up the people at the dance.\" In response to a question whether she remembered so testifying, the witness replied that she did not so remember. She was then asked whether if she did so testify her testimony was true and her answer was, \"yes, but I still do not remember saying that.\"\n\nAnother witness testified that none of the boys with her on the night in question were members of the \"38th Street gang\"; that \"I don't know any of the 38th Street gang; I just heard about them.\" In testimony given by her before the grand jury and read to her at the trial by the district attorney, she had stated that the boys with her were members of the \"38th Street gang.\" This witness further testified that she did not know how many of the boys got out of the cars there that night. Before the grand jury she testified that \"about 25 or 30 boys got out of the cars.\" The district attorney read extensively from her testimony before the grand jury, which was that she saw the boys \"go into the house\"; that \"all of these boys went into the building; about 15 or 16\"; that Henry Leyvas was among them and that John Matuz \"was one of the ones who was breaking the cars.\"\n\nWithout doubt the foregoing and other evidence given by this witness before the grand jury was damaging to the cause of the defendants.\n\nAnother witness, Ann Kalustian, testified that she was sitting in the car in front of Joe Carpio's house; that she heard nothing about going to the \"Sleepy Lagoon\" or the Williams Ranch; and that she knew nothing about their destination until they were in the automobiles and half way there; that she did not see appellant Leyvas in front of the Carpio house. The district attorney then asked the witness if she had testified before the grand jury, to which she replied in the affirmative. The prosecutor then stated, \"I call your attention, Ann, to the official transcript,\" and thereupon read from it testimony given by her in contradiction of what she had testified to at the trial. It is unnecessary to here set forth additional instances of like character. To us, it appears manifest that, by the foregoing line of questioning, the district attorney was not attempting to reconcile a variance with former testimony or to refresh an absent recollection. The purpose of refreshing the recollection of a witness is to enable both the witness and his present testimony to be put fairly\n\nand in their proper light before the jury. An instance of this is found in a case where a witness gives testimony apparently at variance with that previously given, and thereupon the previously given evidence is read to the witness, whereupon, for instance, the witness admits the discrepancy between his former and his present testimony, but explains that by reason of the form of the questions now asked of him at the trial he is not sure whether his former testimony is correct or whether his present evidence is correct. In other words, there are two types of cases wherein the refreshing of the recollection of a witness is permissible: (1) where there is a present absence of recollection; and (2) where there is an apparent variance between the present testimony of the witness and prior testimony or statements. The test is whether the reference to the former testimony is for the purpose of giving the witness an opportunity to correct and explain the former testimony without waiting for the assault of cross-examination, or to get before the jury a former statement or testimony of the witness contrary to his present testimony with the object in view of discrediting the verity of the testimony presently given. In the latter case it is impeachment and not a refreshing of the memory or recollection of the witness. If the purpose of the examination is to reconcile or explain testimony, the memory of the witness may be refreshed, but if it is to contradict or discredit the present testimony of the witness and to have the contradiction stand unreconciled and unexplained, then it is impeachment, and a pretense of refreshing the memory by reading former testimony cannot be made a subterfuge to get before the jury incompetent evidence or statements which aid the case of the prosecution. (People v. Creeks, 141 Cal. 529, 532 [75 P. 101].)\n\nThe foregoing statements of the witnesses made at the trial and before the grand jury are not at all reconcilable, and, where, as here, the witnesses invariably admitted in answering questions by the district attorney that their former testimony was true, and it was at variance with that presently given, the witness stood impeached, and there was established before the jury as facts the direct opposite to what the witness had presently testified to at the trial. As we view the course pursued by the district attorney, his objective was to establish as a fact before the jury that the present testimony of\n\nthe witnesses at the trial was false, and that testimony previously given and in contradiction thereof was the truth. This amounted to plain impeachment, and the procedure enunciated by this court in the case of People v. Flores, 37 Cal. App. 2d 282, 286 [99 P.2d 326], should have been followed.\n\nWe cannot see where the doctrine of \"past recollection recorded\" has any application to the situation with which we are here concerned. If the witnesses had no \"present\" recollection of the facts about which they were being interrogated, we can understand how the past recollection recorded of the witness might be resorted to. However, the prior testimony or statements of the witness were not admissible as evidence to establish the truth of the facts therein stated, but only for the limited purpose of refreshing the recollection of, or impeaching the present testimony of the witness, and the court should have so instructed the jury. Consequently the procedure followed in the case at bar was neither proper nor legal.\n\nAppellants' contention that prejudicial error was committed and the defendants deprived of their substantial right not to be compelled to be witnesses against themselves, in that the prosecution was permitted to cross-examine some of the defendants as to matters about which they were not examined in chief (Pen. Code,  1323), is without merit.\n\nEqually without merit is appellants' claim that error was committed in permitting testimony regarding the fact that defendant Victor Thompson was also known as \"Bobby Lavine.\" It was developed at the trial that this particular defendant was known by these names because of the remarriage of his mother and that for a time he was known by the surname of his stepfather. At no time was any attempt made to show that in using the two names this defendant was actuated by any sinister or dishonest motive. In the face of what the record discloses in regard to this matter, it would do violence to reason to assume that any prejudice was engendered against defendant Thompson, or any of his codefendants.\n\nError is next predicated upon the court's ruling in admitting into evidence the following testimony given by Dr. Frank K. Webb, called as an expert witness by the prosecution. The record reveals the following:\n\n\"Q. And what, in your opinion, would have been the effect\n\nupon Jose Diaz had he failed to die but lived through this injury, as far as the subdural hemorrhage is concerned?\n\n\"Mr. Bird: Objected to as hypothetical and immaterial, your Honor.\n\n\"The Court: Overruled.\n\n\"A. I could not place the limitation to the damage because that cannot be determined until months later, but a large hemorrhage like that, if a person survives, usually forms a blood clot over the brain, causing more or less pressure, causing oftentimes adhesion to the brain and the outer membranes, resulting in an epileptic condition or in degeneration of the brain tissue and subsequent paralysis.\" Additional questions along the same general line were allowed over objection. What might have been the physical and mental condition of the victim of the alleged homicide had he lived was immaterial. The trial judge stated that he was permitting that character of testimony \"on the theory that it tends to shed light on the severity and degree of injury inflicted, but for no other purpose.\" Such reasoning suggests the inquiry, -- if death isn't the limit as to the \"severity and degree\" of the injury inflicted -- what is? It is true that an intent to kill may be inferred from all the circumstances of the act, but in the instant action other testimony without conflict described in detail the injuries sustained by the deceased and showed that the injuries inflicted were of such severity as to cause death. The suggestion of \"epileptic condition\" coupled with \"degeneration of brain tissue and subsequent paralysis\" if the deceased had lived added nothing of an evidentiary value to the existence of an intent to kill upon the part of the assailant or assailants of Jose Diaz, and only served to arouse the emotions, inflame the passions and incite the prejudice of the jury. The challenged testimony should not have been admitted.\n\nA reversal is next urged on the ground that certain statements and claimed admissions made by appellants to officers of the law and which statements were taken down in shorthand, thereafter transcribed and admitted in evidence were inadmissible for the reason that such statements and admissions were obtained while appellants were unlawfully confined and without advice as to their various legal rights, including the right to counsel. It should be borne in mind\n\nthat none of these statements were introduced as confessions, but only as claimed admissions. Although a defendant is under arrest at the time he makes a statement, that fact does not of itself render such statement either involuntary or inadmissible, although such fact should be taken into consideration in determining the admissibility of the admission and the weight to be attached thereto. (People v. Rogers, 22 Cal. 787, 805 [141 P.2d 722]; People v. Gonzales, 24 Cal. 2d 870, 875 [151 P.2d 251].) Appellants concede the existence of California cases holding that the failure to advise a defendant regarding his right to counsel before obtaining from him an admission or confession does not of itself render the same involuntary. However, appellants contend that the irregularity of the statements with which we are here concerned lies in the fact that the appellants were not brought before a committing magistrate without unnecessary delay. They assert that had they been brought before a committing magistrate they would have been advised of their rights before giving the statements and that, in the light of such advice \"the situation would have been far different.\"\n\nSection 849, Penal Code, provides:\n\n\"When an arrest is made without a warrant by a peace officer or private person, the person arrested must, without unnecessary delay, be taken before the nearest or most accessible magistrate in the county in which the arrest is made, and a complaint stating the charge against the person, must be laid before such magistrate.\"\n\nSection 825 of the same code defines the term \"unnecessary delay\" used in the foregoing section 849 as meaning: \"in any event, within two days after his arrest, excluding Sundays and holidays.\"\n\nThe record indicates that, in the case of Reyes, he was arrested August 9, 1942, and booked in the jail for violation of the Selective Service Act. Later, on the night of August 10th, he was rebooked on \"suspicion of murder.\" The record indicates that this defendant was not arraigned in court with his codefendants on the 10th, but was separately arraigned on August 13th. His statement was taken on August 12th, which was one day before his arraignment, instead of two days thereafter as contended by respondent. Consequently, it cannot be said that, at the time the statement was\n\ntaken from the defendant Reyes, he had received information as to his legal rights upon his arraignment.\n\nIf appellant Padillo was in custody on August 3, 1942, when his statement was taken on that date (the record does not indicate whether he was or not), then it follows that he was held some seven days before he was taken before a court.\n\nIn regard to appellant Parra, the record indicates that his statement was taken at the Hall of Justice on August 6th. This appellant, however, had previously testified before the grand jury, on which occasion he was fully advised of his legal rights.\n\nAs to appellant Ynostroza, it appears that his statement was taken August 3d, and he subsequently testified to substantially the same facts before the grand jury after he was fully informed of his constitutional and legal rights. The same situation and circumstances apply to appellant Zammora, whose statement was taken on August 4th, and appellant Delgado, whose statement was taken on the same day. As to appellant Thompson, the record indicates his statement was taken August 3d, and, while he later testified before the grand jury after being advised of his rights, his testimony before the grand jury was quite different from what he had previously stated to the officers.\n\nContrary to the claims of respondent that the record fails to bear out appellants' contention that they were not brought before a magistrate as required and within the time prescribed by the statutes, we are convinced that a mere reading of the record substantiates the charge that each of these appellants was held in custody longer than the time allowed by sections 849, 825 and 858 of the Penal Code. In the cases of appellants Padillo and Ruiz, if they were in custody when their statements were taken on August 3d, then they were held in custody for a week before being arraigned in court; and as to other appellants the record indicates that they were in custody some four days prior to their arraingment. Appellants place great reliance upon the cases of McNabb v. United States, 318 U.S. 332 [63 S.Ct. 608, 87 L.Ed. 819]; Anderson v. United States, 318 U.S. 350 [63 S.Ct. 599, 87 L.Ed. 829], and United States Circuit Court decisions which followed the clear edict of the United States Supreme Court that, because federal statutes made it the duty and obligation of federal officers, whether they be United States Marshals or agents\n\nof the Federal Bureau of Investigation, to take the defendant before the most accessible United States Commissioner or the nearest judicial officer for commitment \"immediately,\" any declarations or statements made by a defendant while in the custody of arresting officers cannot be received in evidence against him at his subsequent trial when it was made to appear as a fact that such defendant had not, with reasonable dispatch, been taken before a United States Commissioner or other committing magistrate for arraignment.\n\nHowever, in the recent case of United States v. Mitchell, 322 U.S. 65 [64 S.Ct. 896, 88 L.Ed. 1140] (decided April 24, 1944), the holding in the McNabb and Anderson cases, supra, was materially modified. In the Mitchell case, the defendant admitted his guilt shortly after being taken into custody. However, eight days elapsed before he was taken before a committing magistrate, but there was no showing of force, violence or coercion on the part of the officers in obtaining the admission of guilt, nor was there any inference that the confession was other than voluntary. In the last cited case, the United States Supreme Court says:\n\n\"Undoubtedly his detention during this period was illegal. The police explanation of this illegality is that Mitchell was kept in such custody without protest through a desire to aid the police in clearing up thirty housebreakings, the booty from which was found in his home. Illegality is illegality, and officers of the law should deem themselves special guardians of the law. But in any event, the illegality of Mitchell's detention does not retroactively change the circumstances under which he made the disclosure. These, we have seen, were not elicited through illegality. Their admission, therefore, would not be use by the Government of the fruits of wrongdoing by its officers. Being relevant, they could be excluded only as a punitive measure against unrelated wrongdoing by the police. Our duty in shaping rules of evidence relates to the propriety of admitting evidence. This power is not to be used as an indirect mode of disciplining misconduct.\"\n\nMr. Justice Reed, who dissented in the McNabb and Anderson cases, supra, while concurring in the result reached in the Mitchell case, gave further expression to his disapproval of the McNabb and Anderson decisions in the following language:\n\n\"As I understood McNabb v. United States. . . as explained by the court's opinion of today, the McNabb rule is that where there has been illegal detention of a prisoner, joined with other circumstances which are deemed by this court to be contrary to proper conduct of Federal prosecutions, the confession will not be admitted. Further, this refusal of admission is required even though the detention plus the conduct do not together amount to duress or coercion. If the above understanding is correct, it is for me a desirable modification of the McNabb case.\n\n\"However, even as explained I do not agree that the rule works a wise change in Federal procedure.\n\n\"In my view detention without commitment is only one factor for consideration in reaching a conclusion as to whether or not a confession is voluntary. The juristic theory under which a confession should be admitted or barred is bottomed on the testimonial trustworthiness of the confession. If the confession is freely made without inducement or menace, it is admissible. If otherwise made, it is not, for if brought about by false promises or real threats, it has no weight as proper proof of guilt.\"\n\nIn our own state, as far back as the case of People v. Devine, 46 Cal. 45, 48 (decided in 1873), it was said by the court:\n\n\"But it is claimed that, as the prisoner was not taken before a magistrate within twenty-four hours after his arrest by the officer, the custody in which he was at the time of the conversation referred to was an illegal custody, and that what he said, while in such custody, is for that reason only inadmissible as evidence against him. We think, however, that this position finds no countenance either in principle or authority.\"\n\nTo the same effect are the following cases from other jurisdictions:\n\nPeople v. Vinci (1920), 295 Ill. 419 [129 N.E. 193]; People v. Trybus (1916), 219 N.Y. 18 [113 N.E. 538]; People v. Alex (1934), 265 N.Y. 192 [192 N.E. 289, 94 A.L.R. 1033]; Cates v. State (1930), 118 Tex.Cr. 35 [37 S.W.2d 1031].\n\nTherefore, if the statements and claimed admissions in the case at bar were otherwise relevant and material, it follows that, because of wrongdoing by the officers, unrelated\n\nto the obtaining of such statements or admissions, the latter cannot be excluded as a punitive measure against the conduct of the officers. Furthermore, the statements here challenged were obtained within two days after the arrest or surrender of the defendants, which was prior to the expiration of the time allowed within which to bring them before a magistrate (Pen. Code,  825, 849). It cannot therefore be held that the introduction of these statements into evidence as against only the appellant who made such statement constituted reversible error on the ground to which we have just given consideration.\n\nAppellants next complain of the action of the trial court in permitting Deputy Sheriff Brown to read into the record, word for word, statements made by thirteen of the defendants on trial. Before he was permitted to read the statements, the witness testified that he remembered having the various conversations with the defendants; that the same were, at his direction, taken down by a stenographer in shorthand and later transcribed; and that at some \"later time\" or \"later date,\" he was given the transcription of the statements and \"read it over.\" Upon the authority of People v. Deckert, 77 Cal. App. 146, 151 [246 P. 157], it must be held that the witness occupied a position similar in all respects to that which would have been presented had the stenographer read from the transcript -- the only difference being that the stenographer would have been the person who made the stenographic notes. Therefore, as said in the case just cited, the claim of appellants that error was committed by the trial court in permitting the witness, Deputy Sheriff Brown, to read to the jury the various statements made by appellants cannot be sustained. Furthermore, the objection urged as to the strength or weakness of the recollection of the witness and the improbability, if not the demonstrated impossibility, of his remembering the circumstances surrounding the taking of the statements went to the weight rather than to the admissibility of the questioned testimony.\n\nWe perceive no error in the ruling of the trial court rejecting the testimony that it was the custom of the defendants to visit \"Sleepy Lagoon\" for \"innocent social purposes.\" The record is replete with evidence that \"Sleepy Lagoon\" was used as a gathering place for young men and girls and was more or less known as a \"lovers' lane.\" No testimony\n\nwas offered, nor could the jury have inferred that the place was used on any previous occasion as a gathering place for unlawful activities. What was the purpose of appellants in going there on the night in question was material and a very considerable amount of evidence was introduced on that issue. While such evidence was in conflict, no prejudice is shown from the ruling of the court rejecting evidence as to the custom of appellants or others in visiting \"Sleepy Lagoon\" on prior occasions.\n\nDuring the examination of some of the appellants, an attempt was made to show that statements allegedly made by such appellants were not free and voluntary, but were obtained as a result of the use of force, threats, intimidation and fear. Objection to this line of testimony was sustained. These rulings were erroneous. While respondent contends that the statements were not offered as confessions and that it was unnecessary to lay the foundation required by law for the admission of a confession, nevertheless the defense should have been permitted to show all of the facts and circumstances surrounding the making of the alleged admissions from the time defendants were arrested. Such testimony was clearly material to aid the jury in determining the weight to be given any such statements or admissions. In other words, the manner in which such statements were obtained and the circumstances surrounding the making of the claimed admissions were facts to be considered by the jury in determining the weight to be given thereto.\n\nIn view of the fact that the court in the instant case gave the jury an instruction on flight, it seems to us that the court might well have allowed appellant Leyvas to show that, within a few days after the alleged commission of the offenses charged, he received a card notice from the sheriff's office requesting his presence there and that, in response thereto, appellant Leyvas, through his attorney, contacted the sheriff's office and offered to surrender himself.\n\nIn view of the conclusion at which we have arrived in this case, we deem it unnecessary to consider the claims advanced by appellants that the trial court unduly interfered with and restricted the cross-examination of prosecution witnesses by defense counsel. Such errors will not occur upon a retrial, if it be remembered that cross-examination has long been\n\nregarded as a powerful weapon for ascertaining the truth, and should be extended liberally. In any event, opportunity should be afforded for a thorough cross-examination compatible with our rules of evidence and such examination should not be unduly restricted and abridged. To deny a fair latitude in cross-examination is to impair one of the essential safeguards to a fair trial.\n\nAppellants challenge the correctness of several instructions given to the jury, but when we remember that instructions should not be considered singly, but in their entirety (People v. Macken, 32 Cal. App. 2d 31 [89 P.2d 173]), we are persuaded from a reading of all of the instructions given that no substantial rights of the appellants were invaded in the exposition of the law as contained in the instructions given.\n\nAppellants also complain of the refusal of the court to give certain instructions offered by them. They vigorously contend that, in view of the state of the evidence, grievous error was committed by the court in refusing to submit to the jury the issue of manslaughter through appropriate instructions. In view of our holding that the evidence is legally insufficient to connect the defendants with the killing of Jose Diaz as charged in count I of the indictment, it becomes unnecessary to discuss this assignment of error.\n\nAppellants' final assault upon the judgment of conviction is grounded on the claim that prejudicial error was committed by the court, which deprived appellants of their rights guaranteed by the due process clause of the Fourteenth Amendment to the Constitution of the United States, and article 1, section 13, of the Constitution of the State of California, in that the right of appellants to defend in person and with counsel was unduly restricted by the seating arrangement of the appellants in the courtroom, which, together with certain rulings of the court, prevented the defendants from consulting with their counsel during the course of the trial or during recess periods.\n\nThe trial of this action commenced on October 13, 1942; the jury was selected and sworn on October 19th, at which time the taking of testimony began. Two days later, on October 21st, and before that day's proceedings began, the trial judge advised counsel outside the presence of the jury that he had noticed on the preceding day that one of counsel was apparently nodding his head while a witness was testifying.\n\nAfter admonishing counsel in this regard and making reference to other matters incidental to the trial, the court said: \"There is another thing I want stopped very definitely, and that is when we take a recess I want these defendants -- there are a large number of them -- taken to the prisoners' room and I do not want anybody to stop those prisoners and try to talk to them. If counsel want to talk to their clients they will have to do it at some other time.\"\n\nAt the oral argument of this appeal, it was agreed that at the trial all of the defendants were seated together in a group in one part of the courtroom some distance away from the counsel table; that the seating arrangement was in alphabetical order according to the first letter in the defendants' surnames. It was further agreed that the defendants could not confer with their counsel during the trial, except by leaving the place where they were seated and making their way to the counsel table, or by their attorney leaving the counsel table and going to the place in the courtroom where the defendants were grouped together.\n\nOn November 12th, outside the presence of the jury, the court repeated verbatim the foregoing admonition given on October 21st and then said: \"Now, I said that and I meant it. I am not going to tolerate any violation of the orders of this court. Counsel who disobey that injunction are guilty of contempt of court. I am not going to proceed in that matter, but if it happens again I am going to take very severe action. I want to call attention to the fact this is the third time I have had to mention it, and it is going to be the last.\"\n\nThereupon, Mr. Shibley, one of defense counsel, advised the court that he was not in the case nor present when the previous order was made, and then said: \"However, at this time, if your Honor please, I do wish to take exception to it and also make the demand at this time that my defendants, all of them, be allowed to sit with me at the counsel table. . . .\"\n\nThereupon, the record reveals that the following transpired:\n\n\"The Court: That request will be denied. . . .\"\n\n\"Mr. Shibley: If your Honor please, I still make the request, and I do wish to make a showing in the record here, that it is relatively impossible for me to conduct my defense of my defendants without being able to consult with them and sit\n\nwith them, and talk with them during the presentation of the prosecution's case. I am also going to say this for the record: That the defendants in the position in which they are seated are seated in a column of seats in very much the fashion as prisoners in a prisoners' box, and the jury are looking at them all the time sitting in that prisoners' box. And I say, for the record, that seated as they are, the purpose of it or, at least, the effect of it is to prejudice these defendants in the minds of the jury. And I am going to cite your Honor's action in having them seated there and in refusing them the right to consult with counsel during the trial and talk with their attorneys during the trial in the courtroom, as misconduct, and ask the jury be admonished to disregard the fact that they are seated in the place that they are, and ask your Honor to point out to the jury the fact they are seated there does not impute that they are guilty or that there is any suspicion that they are guilty of a crime.\"\n\nMr. Schutz, another of defense counsel, then started to address the court, but was interrupted by the trial judge who said:\n\n\"Just before you do that, may I make the record on Mr. Shibley's proposition? I have never at any time refused counsel the opportunity to consult with their clients during the course of the trial. But I cannot, because it is a physical impossibility, have all the clients, all of the individuals seated next to counsel; the facilities of the courtroom won't permit it. We are doing the best we can under the circumstances.\"\n\nThis was followed by Attorney Schutz saying:\n\n\"Your Honor will pardon me, but I feel constrained to say this: I just had been gathering the boys together, in the instance in which I talked to them, and one of my clients, Melendez, in this case, asked a question relative to the cross-examination of this witness, whereupon I told him I would see him at a later time about it. That apparently comes squarely within the prohibition laid down by the court, but I feel any criticism directed to me is unwarranted under the circumstances.\n\n\"The Court: I am sorry you feel that way. But both counsel were speaking to their defendants; the jury had left the courtroom and there wasn't any occasion for consulting, apparently, with their clients at that particular time. That is the very thing that I called attention to. Now, the time it occurred\n\nthe first time Mr. Shibley was not here. I called attention particularly, when we took the recess, what was going to happen in the case; that is, as they were being taken back I did not want anyone to stop them or interfere with them; it was causing a lot of trouble and disruption in a different number of ways.\n\n\"Miss Zacsek: As I understand the court's ruling, that does not prevent any of us leaving at any time and talking to the men in the courtroom ?\n\n\"The Court: No, during the course of the trial. I want the record to show that has been done and the court has not objected to it.\"\n\nFollowing an interruption in order that one of defense counsel might be temporarily excused, Attorney Shibley said:\n\n\"Now, as it happens, if your Honor please, the only time I or other counsel can be apprised as to whether or not it is necessary for us to go up and see our defendants in the attorneys' room upstairs, is if these defendants want either at the conclusion of the trial or at the recess to speak to us and say, 'There is something I want to tell you about that'. And that is the reason I went over here because a couple of these boys were telling me that they wanted to see me about something that came up during the day's trial. If I am to be denied that right, then I cannot represent my defendants.\n\n\"The Court: That can be taken care of without causing that disturbance which we had every time the prisoners were taken out of the courtroom. We have got twenty-two prisoners here, and ordinarily one or two bailiffs to handle the situation; that is all we can possibly get. The minute one defendant is stopped and held up by counsel it means that the entire group is held up and stopped.\"\n\nAfter the court had explained the necessity of conducting the trial in an orderly manner, the following occurred:\n\n\"Mr. Shibley: I am not objecting to that, but I do think, if your Honor please, that I have the same right and my defendants have the same right to consult with one another intimately during the course of the conduct of this trial.\n\n\"The Court: I am not objecting to that at all.\n\n\"Mr. Shibley: I make that demand, and I ask that some arrangement be made by which the defendants may sit with their counsel during the trial.\n\n\"The Court: It is impossible to make that arrangement. It is perfectly obvious when one man represents a number of defendants he cannot sit next to each one of them, nor is it possible around the counsel table to consult with twenty-two defendants. It just cannot be done. If you want to consult with your clients during the course of the trial, that is perfectly all right. You have done it and Miss Zacsek has done it, and other attorneys have done it. I am not objecting to that. What I am objecting to is the disorderly manner in which it is done. That will be all.\"\n\nDeputy District Attorney Barnes then proceeded to state for the purpose of the record that from time to time he had left the counsel table and consulted with officers who were assisting him in presenting the prosecution's case and, among other things, said:\n\n\"I want to say this also for the record: That I have observed -- I am not going to pick out times and individuals, but I have observed from time to time during the progress of the trial on numerous occasions various counsel for defendants consulting with their clients. And I want to say as far as we have been able to observe, your Honor, there has been no differentiation between the defendants' counsel consulting their clients and the State consulting with the two persons, and there have only been two, and the same two right along that have been in the courtroom.\"\n\n\"Mr. Shibley: . . . it has been stated both by court and counsel that counsel had an opportunity to consult with their clients here in the courtroom, which, I believe, is in error. I have had on various times, occasions leaned over to whisper a word or hear a word from one of them. But I do wish to state for the record that the arrangement by which they sit here in court absolutely denies us -- referring to counsel for the defense --\n\n\"The Court: If you want, Mr. Shibley, I will permit you to take your chair and sit back with the defendants, but you cannot put the defendants at the counsel table.\n\n\"Mr. Shibley: All right. If you will segregate my six clients for me so I can sit with them there, I will do it.\n\n\"The Court: We will be very glad to do it. We only have limited facilities here, a very small counsel table here, and it is impossible for us to put twenty-two defendants around\n\nit. In fact, five or six counsel need about all the room that the counsel table affords.\"\n\nMr. Coviello, another defense counsel then suggested that additional defense counsel tables be furnished, and that the tables be rearranged whereby he thought each defense counsel could be sitting near the defendant, or defendants, he represented. To this proposal, the court said:\n\n\"When we get to that point we may be able to arrange, while one defendant is putting in his defense, or one group of defendants, we may put them at the counsel table. We cannot get any more counsel tables; we cannot get any more furniture in the courtroom than we have. I am perfectly willing to afford counsel an opportunity to talk to their clients during the course of the trial if they desire. We are not going to place a limitation on that, but we have a situation where physically we haven't the room to handle the situation so that each counsel can have his clients at the counsel table. There isn't enough counsel table.\"\n\nThereupon, defense counsel, Coviello, said:\n\n\"I do not believe I have been denied any right to consult with my client here in open court.\"\n\nThe trial judge then said:\n\n\"I think you will recall there was no comment on anybody's part objecting to it. I do not object to it, but the thing I did not like was the way you rushed over to the group of defendants the minute the jury started to leave the courtroom. I might also call attention to the order, which has been in the courtroom for years, that is, when the jury is leaving the courtroom everybody is to remain seated. That also was ignored.\"\n\nAfter some further discussion, the court said:\n\n\"Well, gentlemen, you don't get anywhere disagreeing with one another. We have situation here where the record definitely shows the location of the defendants, they are opposite the jury, and, so far as any other jurisdiction anywhere in the world, whether it be the Greek courts, the Scandinavian courts, the German courts as they existed prior to the present World War, and the British courts, every one of those jurisdictions places the defendant in a position far more prominent and distinctive than is done in our American courts. As a matter of fact, the British courts, from\n\nwhom we inherit our jurisprudence, place the prisoner in a box where he is plainly designated and labeled, and it is not only that he is referred to as the defendant but he is referred to as the prisoner. Now, we have to have defendants in court, and it seems to me that if the defendants are sitting in the courtroom without any restraint being placed upon them, there will have to be something beyond the mere fact that they were sitting in a group which would be objectionable.\"\n\nFinally, defense counsel Shibley said:\n\n\"If your Honor please, I know your Honor said something in your remarks about no restriction being placed upon these defendants except that they had to be in the courtroom. May I inquire of your Honor, if, under that view that your Honor has given, it is proper for the defendant Victor Thompson to rise from his seat where he is seated, -- and what I refer to in my motion as the prisoners' dock, -- and to walk over to the counsel table and consult with me during the trial ?\n\n\"The Court: I certainly won't permit it.\n\n\" Mr. Shibley: You will not permit it ?\n\n\"The Court: No.\n\n\"Mr. Shibley: Well, that is just the sort of thing I am making an objection to.\n\n\"The Court: All right, then. I understand thoroughly.\n\n\"Mr. Shibley: If your Honor please, I object on the grounds that that is a denial of the rights guaranteed all defendants, and each one of them, both by the Federal and State Constitution. I think their right to consult and to be represented by counsel at all stages of the proceedings demands that they have the right to come to their counsel during the proceedings and speak to them.\"\n\nThe record reveals that the following then occurred:\n\n\"The Court: Well, that is your opinion. I happen to have another one.\n\n\"Mr. Shibley: And I do so demand that they be given those rights.\n\n\"The Court: I am not going to tolerate defendants walking around the courtroom of their own sweet desire.\n\n\"Mr. Shibley: I do not ask for that.\n\n\"The Court: The opportunity to consult exists, but not the opportunity to walk around the courtroom every time that one of them felt that they would like to walk to the counsel table. If we did that we could have this trial indefinitely\n\npostponed by reason of visiting between defendants and their counsel.\n\n\"Mr. Shoemaker: And you have twenty-two defendants walking up to the counsel table at once, which would be in the realm of what he requests.\n\n\"Mr. Shibley: I do insist also, if your Honor please, that some reasonable arrangement be made so that these defendants will be able to consult with their counsel throughout the entire proceeding. If your Honor takes exception to counsel going over to the box and speaking to these defendants at recesses, your Honor, I ask that your Honor keep the court in session for a reasonable time so that counsel can step over and talk to the defendants at each recess and determine whether or not it is necessary for the attorneys to go upstairs to the attorneys' room to consult with them further.\n\n\"The Court: The court is not going to keep these prisoners in here at recesses in the court room, the entire group of persons, because one counsel wants to talk to one defendant. I think I have covered that pretty thoroughly.\n\n\"Mr. Shibley: Then, if your Honor please, I take it at any recess no counsel is permitted to approach any of the defendants or say anything to him; is that correct ?\n\n\"The Court: Without first securing permission of the court, yes.\n\n\"Mr. Shibley: Well, if your Honor please, I wish at this time to approach my defendants and find out whether or not there is something they wish to confer with me about.\n\n\"The Court: Well, you can do that between now and 9:30. There is not going to be any session of court between now and 9:30, and you have the opportunity from now, until almost 9:30 tomorrow morning to see them. We will take a recess at this time until 9:30.\"\n\nWhen court was convened the next day, the following ensued:\n\n\"Mr. Shibley: At this time, if your Honor please, in line with the comments addressed to the court yesterday, and the request made by me on behalf of my defendants, I at this time formally move that arrangements be provided whereby counsel may sit with his clients, the defendants in this case, at a a counsel table provided therefor. That is the motion, if your Honor please.\n\n\"The Court: The motion will be denied upon the ground that there are twenty-two defendants and five counsel, that the courtroom is not big enough to permit any such arrangement, nor are there any facilities here. The court has already covered the matter by what was said in the record yesterday.\"\n\nFrom the foregoing, it is obvious that, under the court's rulings, it was impossible for counsel to leave their table, consult with their clients in another part of the courtroom, and at the same time protect the record and listen to the testimony being given. Likewise, it was not possible for the defendants to call matters to the attention of their counsel while witnesses were testifying, or call attention to claimed inaccuracies in the testimony or to suggest to counsel questions for cross-examination.\n\nTo us it seems extremely important that, during the progress of a trial, defendants shall have the opportunity of conveying information to their attorneys during the course of the examination of witnesses. The right to be represented by counsel at all stages of the proceedings, guaranteed by both the federal and state Constitutions, includes the right of conference with the attorney, and such right to confer is at no time more important than during the progress of the trial. A defendant in a criminal case is not required to leave his defense in the hands of his counsel, because the Constitution guarantees him the right \"to appear and defend in person and with counsel.\" This quoted phrase from our state Constitution does not limit the right to defend in person \" or \" with counsel, but explicitly says \" and \" with counsel. A basic part of a defendant's right to counsel is that of consultation whenever necessary. To afford to the defendant the benefits of the foregoing clause of the Constitution, it is essential that he should be allowed to consult with his counsel not only prior to the commencement of his trial, but during the actual progress thereof. The framers of the Constitution and the People, in adopting it, deemed it essential to the protection of one whose life and liberty is involved in a prosecution for crime that he shall have the right to \"appear and defend in person and with counsel.\" If he be deprived of his life or liberty without such right to appear and defend, such deprivation would be without that due process of law required by the Constitution. The Constitution primarily guarantees a defendant the right to present his case with the aid of counsel. That does not simply mean the right to have counsel present at the trial, but means\n\nthat a defendant shall not be hindered or obstructed in having free consultation with his counsel, especially at the critical moment when his alleged guilt is being made the subject of inquiry by a jury sworn to pass thereon. At such time, in order that he may have absolute freedom to assist by suggestion and information in his own defense, the accused has the right to sit with his counsel, or at least to be so situated that he can freely and uninterruptedly communicate and consult with his attorney. It is the court's duty to provide adequate quarters and facilities, which the court has the power to do without limitation. (Code Civ. Proc.,  144.)\n\nThe difficulties which presented themselves to the court by reason of the large number of defendants and counsel, together with the limited courtroom space, is the result of the failure of the court to act in this regard. Under such circumstances, it is not the Constitution or the rights guaranteed by it that must yield. That a joint trial of numerous defendants speeds the wheels of justice and provides not only an expeditious but a less burdensome method for disposing of criminal cases furnishes no valid argument for depriving a defendant charged with crime of his right to the effective and substantial aid of counsel at all stages of the proceeding. To do that, as was said in Powell v. Alabama, 287 U.S. 45 [53 S.Ct. 55, 77 L.Ed. 158, 84 A.L.R. 527], \"is not to proceed promptly in the calm spirit of regulated justice, but to go forward with the haste of the mob.\"\n\nRespondent directs our attention to but one case upon which he relies, that of United States v. Gilbert, 2 Sumn. 19, Federal Case No. 15204 (1834), wherein the opinion was written by Mr. Justice Story, and in which case the conviction was attacked on the ground that the defendants \"were not allowed to be placed near to the counsel, for the purpose of instructing counsel in their defense, as they deemed necessary.\" The cited case does not aid respondent because the court therein stated that the defendants were placed within a reasonable distance from their counsel who could constantly have the freest access to them, and the trial court stated that \"every delay of time for this purpose would be cheerfully given; and it was accordingly given.\" Also, the record in United States v. Gilbert, supra, reveals that the defendants \"might communicate with their counsel freely and as often as they wished. And this was accordingly done.\" No such freedom of communication and\n\nconsultation between the defendants and their counsel prevailed in the case at bar. As an assurance against ancient evils of tyrannical governments, our country, in order to preserve \"the blessings of liberty\", wrote into its basic law the requirement, among others, that the forfeiture of the lives, liberties or property of people accused of crime can only follow if procedural safeguards of due process have been obeyed. To hold under the circumstances here present that the defendants were accorded their constitutional right to \"appear and defend in person and with counsel\" would simply be to ignore actualities.\n\nNo other assignments of error or claimed grounds for reversal require consideration.\n\nWe are not unmindful of the flagrancy of the offenses charged. Nor are we insensible to the need and importance of strictly enforcing the law for the prevention of such crimes. It is greatly to be desired for the safety of the public that the guilty be apprehended and punished for their crimes. But, as a stabilizing influence looking toward the permanence of our institutions, it is of equal or greater importance that the guaranty of a fair trial in accordance with the meaning and intent of the Constitution and statutes should be assured and that such a trial be made a certainty so far as possible within the bounds of average human ability, attended by its unavoidable imperfections and frailties.\n\nIn appellants' briefs filed herein, we note the charge that the prosecution of these defendants is the result of racial prejudice. This claim is without foundation and finds no support in the record. While it is true that practically all of the defendants are of Mexican birth or ancestry, it should be remembered that the victims named in the indictment are also of Mexican lineage. Jose Diaz, with whose murder the defendants were charged, had the right to live. The two victims named in counts II and III of the indictment possessed a natural right to freedom from illegal and unlawful attack and injury. The picture presented by the record in the case is one wherein the Delgadillo family, also of Mexican extraction, were holding a social gathering in honor of the birthday of the mother of that family. In so doing they were entitled, as is every other family under our form of government, to be protected against the invasion of their home and homelike activities by a band of hoodlums. It would be a sad commentary upon our vaunted protection of the right to \"life, liberty and\n\nthe pursuit of happiness\" if law enforcement agencies did nothing to vindicate the rights of this family to be free from such an attack as was allegedly made upon them and their guests. However, there is no ground revealed by the record upon which it can be said that this prosecution was conceived in, born, or nurtured by the seeds of racial prejudice. It was instituted to protect Mexican people in the enjoyment of rights and privileges which are inherent in every one, whatever may be their race or creed, and regardless of whether their status in life be that of the rich and influential or the more lowly and poor.\n\nThe judgments and orders denying motions for a new trial, from which this appeal was taken, are, and each of them is, reversed, and the cause remanded.\n\nDisposition\n\nReversed. Judgments of conviction against appealing defendants reversed.\n\n",
    "body_length": 148812,
    "citedas": [
      "66 Cal. App. 2d 166",
      "152 P.2d 180"
    ],
    "attorneys": "Katz, Gallagher \u0026 Margolis, Ben Margolis, George E. Shibley and Selma Mikels Bachelia for Appellants. Robert W. Kenny, Attorney General, Eugene M. Elson, Deputy Attorney General, Fred N. Howser, District Attorney, and John Barnes, Deputy District Attorney, for Respondent.",
    "category": [],
    "judges": "White, J. York, P. J., and Doran, J., concurred.",
    "citation_count": 1
  }
}
