{
  "id": "RX98PWYBTlTomsSB5dQc",
  "document": {
    "title": "United States v. Angiulo",
    "full_title": "UNITED STATES v. GENNARO J. ANGIULO, DONATO F. ANGIULO, SAMUEL S. GRANITO, FRANCESCO J. ANGIULO AND MICHELE A. ANGIULO",
    "jurisdiction": "First Circuit",
    "date": "1990-03-05T00:00:00.000Z",
    "docket": "Nos. 86-1331, 89-1212, 89-1800",
    "body": "BOWNES, Circuit Judge.\n\nThese are consolidated appeals from convictions on jury verdicts rendered after an eight-month trial. The defendants, Gennaro Angiulo, Donato Angiulo, Samuel Granito, Francesco Angiulo, and Michele Angiulo, are all members or associates of the Patriarca Family of La Cosa Nostra. They were charged with conspiracy to participate and participating in an enterprise through a pattern of racketeering activity in violation of 18 U.S.C. § 1962(d) and (c), as well as with numerous racketeering, loansharking, and gambling offenses.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Each having been convicted and sentenced on various counts, they now appeal on a number of grounds from their convictions. They also appeal from the district court's order forfeiting certain of their assets under 18 U.S.C. § 1963. For the reasons set forth below, we affirm the defendants' convictions and sentences, but reverse certain portions of the forfeiture order.\n\nI. BACKGROUND\n\nThe evidence introduced against defendants at trial was, in large part, the product of court-authorized electronic surveillance conducted at 98 Prince Street and 51 North Margin Street in Boston's North End during the period January-May 1981. Through a combination of audio and video surveillance, FBI agents monitored the arrivals and departures of persons from these premises, as well as their conversations on the premises. Tapes and transcripts from this surveillance were introduced at trial, accompanied by material seized during the execution of various search warrants. There was also testimony by a number of government witnesses. Our review of the evidence is made, as required, in the light most favorable to the government. At this time, we summarize those facts most pertinent to the issues that have been raised on appeal.\n\nDefendants were all members of the Patriarca Family of La Cosa Nostra. Gennaro Angiulo was the underboss of this organization, in charge of its day-to-day operations. Immediately beneath him in the command hierarchy were \"Capo Regimes\" (captains) Samuel Granito and Donato Angiulo. Beneath the Capo Regimes, the organization consisted of soldiers and then of associates. Francesco Angiulo was a soldier, and also served as accountant for the organization's gambling and loansharking businesses. Michele Angiulo was an associate.\n\nThe organization was headquartered at 98 Prince Street and engaged in widespread racketeering, gambling, and loansharking activities. Because the specific nature of some of these activities is significant for certain of the issues before us, we state the relevant facts regarding them in some detail.\n\nA. Gambling Activities\n\nThe defendants, in various combinations, were charged with the operation of four illegal gambling businesses. The first business involved the operation by Gennaro and Francesco of a series of \"Las Vegas Nights\" gambling events from approximately late 1978 to mid-1981. The events were a type of bazaar, ostensibly operated to benefit non-profit, charitable organizations. The proceeds from these events, however, were not given to charitable organizations, but were kept by their La Cosa Nostra operators. The immediate manager and supervisor of the Las Vegas Nights was Gennaro's son, Jason Angiulo, assisted by Carmen Lepore.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Gennaro was the overall owner of the business, while Francesco acted as the accountant. All of these participants shared in the profits.\n\nThe second gambling business involved the operation of twice-weekly barbooth games at the Demosthenes Democratic Social Club in Lowell, Massachusetts during 1980-81. Barbooth is a dice game in which, typically, twelve or more players place bets on whether the shooter of the dice will roll a winning or losing combination of numbers. The house takes a percentage -- usually 2 1/2% -- of the amount bet on each hand. The immediate manager of the Lowell barbooth games was Peter Vulgaropoulos, assisted by Vincent Roberto as assistant manager. Ilario Zannino directed the operation and had a financial interest in it. Francesco was the accountant, and Gennaro was the ultimate overseer.\n\nThe third gambling business consisted of the operation of a highly organized and extensive illegal numbers betting business in the Boston area. Approximately 180 people were involved in the operation of this business, including agents to collect the bets, sub-books to control the agents and pay the winning number, and office managers to supervise the day-to-day management of the business and settle accounts with the sub-books. Gennaro was the principal owner and overall boss of the business. Francesco was the day-to-day supervisor of the mid-level operation. Donato controlled a number of sub-book operations and had responsibility for collecting money. Finally, Michele stood in for Francesco and also assisted in controlling several of the sub-book operations.\n\nThe fourth and final business involved the operation of high stakes poker games at 51 North Margin Street. Electronic surveillance revealed that a number of people participated in the running of the games and possessed a financial interest in them. Specifically, defendants Gennaro Angiulo, Samuel Granito, and co-conspirators Ilario Zannino, Ralph Lamattina and Nicola Giso each had financial interests in the game. Gennaro was the overall boss. Francesco acted as the accountant. John Cincotti managed the staff, extended credit to players, and collected their debts. Finally, Zannino supervised Cincotti and directly oversaw the operation.\n\nB. Extortionate Credit Transactions\n\nIn addition to their gambling activities, certain of the defendants also were involved in extortionate credit transactions. In particular, defendants Gennaro, Donato, Francesco, and co-conspirator Zannino engaged in various loansharking operations. One such operation involved extortionate loans to Donald Smoot, a regular player in the North Margin Street poker games. In early 1981, Smoot owed $14,000 to Zannino and paid interest (or \"vig\") at the rate of one percent per week on this debt. During this same time period, Smoot owed money to Donato as well and paid him vig of 2 1/2% per week. Intercepted conversations revealed that the amount of Smoot's debt to Donato was also $14,000, and that Gennaro and Francesco had an interest in the loan.\n\nA separate transaction involved a $200,000 loan to Joseph Palladino, who was the principal in the Palladino Real Estate Trust, which owned property on Canal Street in Boston. Palladino paid interest of one percent per week on this debt. The debt eventually was cancelled after a series of real estate transactions through which Palladino's Canal Street property was transferred first to the Angiulos' sister and then from the sister to the Angiulos, doing business as Huntington Realty Trust Company.\n\nC. Murder Conspiracies\n\nThe final group of racketeering activities charged in the indictment involved a series of conspiracies to obstruct justice and to commit murder. Most of these conspiracies, including the conspiracies to murder Walter LaFreniere, Walter Bennett, William Bennett and Joseph Barboza, are not at issue in this appeal. The murder of Angelo Patrizzi is, however, very much at issue and we state the facts pertaining to this murder in some detail, both here and later in the opinion.\n\nIn early 1981, Angelo Patrizzi was reputedly planning to kill Frederick Simone and Cono Frizzi -- two Boston members of the Patriarca Family -- because of his belief that they were involved in the 1978 murder of his half-brother. A decision was made to kill Patrizzi before he succeeded in killing either Simone or Frizzi. As evidence of these plans to kill Patrizzi, the government introduced intercepted conversations from a March 11, 1981 meeting among Granito, Simone and Gennaro Angiulo at which Simone and Granito related to Gennaro several unsuccessful attempts on their part to kill Patrizzi. At this March 11 meeting, Gennaro indicated that he would assist in the effort, and during a conversation the next day with Zannino, enlisted Zannino's assistance as well.\n\nOn March 13, 1981, Angelo Patrizzi disappeared. In a conversation intercepted on April 3, 1981, Zannino told John Cincotti and Ralph Lamattina that Patrizzi had been killed by nine men and put in a car trunk. On June 11, 1981, authorities found Patrizzi's decomposed body in the trunk of a stolen car in Lynn, Massachusetts. Gennaro Angiulo and Granito were charged with conspiring to murder Patrizzi and with being accessories before the fact to his murder.\n\nD. The Jury's Verdict\n\nThe above activities, among others, were set forth in the indictment against the relevant defendants as predicate acts constituting a pattern of racketeering activity in violation of the Racketeer Influenced and Corrupt Organizations Act (RICO).\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e With the exception of the murder conspiracies, the activities also were charged in the indictment as separate substantive counts against the applicable defendants.\n\nFollowing an eight-month jury trial, Gennaro Angiulo, Donato Angiulo, Francesco Angiulo and Samuel Granito were each convicted, under RICO, of conspiring to participate, and participating, in the affairs of an enterprise through a pattern of racketeering activity, in violation of 18 U.S.C. § 1962(d) and (c).\n\nGennaro Angiulo was also convicted of the following offenses: four counts of conducting illegal gambling businesses, in violation of 18 U.S.C. § 1955; two counts of conspiring to make an extortionate extension of credit, in violation of 18 U.S.C. § 892(a); conspiring to collect, and collecting, an extortionate extension of credit, in violation of 18 U.S.C. § 894(a); obstruction of, and conspiring to obstruct, justice, in violation of 18 U.S.C. § 1503 and 18 U.S.C. § 371.\n\nDonato Angiulo was also convicted of conducting an illegal gambling business, in violation of 18 U.S.C. § 1955 and conspiring to make an extortionate extension of credit, in violation of 18 U.S.C. § 892(a).\n\nGranito was also convicted of conducting an illegal gambling business, in violation of 18 U.S.C. § 1955.\n\nFrancesco Angiulo was also convicted of the following offenses: four counts of conducting illegal gambling businesses, in violation of 18 U.S.C. § 1955; two counts of conspiring to make an extortionate extension of credit, in violation of 18 U.S.C. § 892(a); and conspiring to collect an extortionate extension of credit, in violation of 18 U.S.C. § 894(a).\n\nMichele Angiulo was convicted of conducting an illegal gambling business, in violation of 18 U.S.C. § 1955.\n\nThe defendants raise numerous issues on appeal, some of which apply to only one or two of them, and some of which apply to them all. We discuss each of the issues.\n\nII. RICO'S PATTERN OF RACKETEERING ACTIVITY\n\nDefendants' first challenge is to the constitutionality of the RICO provisions under which they were convicted, 18 U.S.C. § 1962(c) and (d). These provisions state, in pertinent part:\n\n§ 1962. Prohibited activities\n\n(c) It shall be unlawful for any person employed by or associated with any enterprise engaged in, or the activities of which affect, interstate or foreign commerce, to conduct or participate, directly or indirectly, in the conduct of such enterprise's affairs through a pattern of racketeering activity or collection of unlawful debt.\n\n(d) It shall be unlawful for any person to conspire to violate any of the provisions of subsections (a), (b), or (c) of this section.\n\n18 U.S.C. § 1962 (1988).\n\nDefendants specifically challenge the \"pattern of racketeering activity\" element of RICO, contending that the term \"pattern\" is so enigmatic and ambiguous as to be void for vagueness.\n\nThe applicable standard requires that we find the statute unconstitutionally vague if it \"fails to give a person of ordinary intelligence fair notice that his contemplated conduct is forbidden by the statute.\" United States v. Harriss, 347 U.S. 612, 617, 98 L. Ed. 989, 74 S. Ct. 808 (1954). Thus, we must analyze RICO's \"pattern of racketeering activity\" element to determine if it is sufficiently susceptible of definition to give persons of ordinary intelligence in the defendants' situation fair notice that the gambling, loansharking and conspiracy offenses with which they were charged constituted an unlawful \"pattern of racketeering activity.\"\n\nThe Supreme Court's latest discussion of the meaning of \"pattern of racketeering activity\" was in H.J. Inc. v. Northwestern Bell Tel. Co., 492 U.S. 229, 109 S. Ct. 2893, 106 L. Ed. 2d 195 (1989). In H.J. Inc., the Court stated that \"to prove a pattern of racketeering activity a plaintiff or prosecutor must show that the racketeering predicates are related and that they amount to or pose a threat of continued criminal activity.\" Id. at 2900. Therefore, continuity plus relationship is the formula to be applied in determining whether a pattern exists.\n\nAccording to the Court, the relationship requirement is satisfied if criminal acts \"'have the same or similar purposes, results, participants, victims, or methods of commission, or otherwise are interrelated by distinguishing characteristics and are not isolated events.'\" Id. at 2901 (quoting 18 U.S.C. § 3575(e)). Continuity of the activity itself can then be shown by \"proving a series of related predicates extending over a substantial period of time.\" Id. at 2902. Continuity can also be shown by proving a threat of continued racketeering activity, which can be established \"if the related predicates themselves involve a distinct threat of long-term racketeering activity, either implicit or explicit.\" Id.\n\nDefendants challenge this definition of \"pattern\" as being so susceptible of differing interpretations that it is void for vagueness. In making this challenge, they rely heavily on Justice Scalia's dictum in his H.J. Inc. concurrence. Justice Scalia noted in his concurrence that courts have been unable to define \"pattern\" with any meaningful degree of clarity, leading him to speculate that RICO would be vulnerable to a vagueness challenge. He left the question for another day because the vagueness issue had not been raised before the Court. See H.J. Inc., 109 S. Ct. at 2908-09 (Scalia, J., concurring). The defendants here have raised the issue, however, and we must address it.\n\nWe begin by acknowledging that potential uncertainty exists regarding the precise reach of RICO's \"pattern of racketeering\" element. The Court itself in H.J. Inc. acknowledged that defining \"pattern\" has not proven to be an easy task and that the exact scope of the meaning of \"continuity plus relationship\" cannot be fixed in advance with precise clarity. See H.J. Inc., 109 S. Ct. at 2899, 2902. This admission, however, does not mean that defendants' vagueness challenge necessarily succeeds. The statute is not rendered unconstitutionally vague simply because potential uncertainty exists regarding the precise reach of the statute in marginal fact situations not currently before us. See United States v. Powell, 423 U.S. 87, 93, 46 L. Ed. 2d 228, 96 S. Ct. 316 (1975). Rather, in the absence of first amendment considerations, vagueness challenges must be examined in light of a case's particular facts. See id. at 92; see also New York v. Ferber, 458 U.S. 747, 767, 73 L. Ed. 2d 1113, 102 S. Ct. 3348 (1982); United States v. Cintolo, 818 F.2d 980, 996 (1st Cir.), cert. denied, 484 U.S. 913, 98 L. Ed. 2d 216, 108 S. Ct. 259 (1987). Thus, for defendants' vagueness challenge to succeed, they must demonstrate that the meaning and scope of RICO's \"pattern\" element was unclear and vague as to their conduct at issue here. Phrased another way, they must show that persons of ordinary intelligence in their situation would not have had adequate notice that the gambling, loansharking and conspiracy offenses at issue here constituted a \"pattern of racketeering activity\" under RICO.\n\nDefendants have not even come close to making this showing, for if anything is clear about RICO, it is that \"a pattern of racketeering activity\" is intended to encompass the activities of organized crime families. In H.J. Inc., the Court explicitly noted that in drafting RICO to target \"patterns\" of racketeering activity, Congress' main focus was the eradication of organized crime. See H.J. Inc., 109 S. Ct. at 2904; see also United States v. Turkette, 452 U.S. 576, 588-93, 69 L. Ed. 2d 246, 101 S. Ct. 2524 (1981). Given the history behind RICO, we have no doubt that the murder conspiracies and the gambling and loansharking operations for which defendants were charged and convicted here are precisely the type of activity that Congress intended to reach through RICO. See United States v. Ruggiero, 726 F.2d 913, 923 (2d Cir.), cert. denied, 469 U.S. 831, 105 S. Ct. 118, 83 L. Ed. 2d 60 (1984). Thus, although RICO's \"pattern\" element may be vague in some contexts, a matter on which we express no opinion, it is not vague in the context before us. A person of ordinary intelligence could not help but realize that illegal activities of an organized crime family fall within the ambit of RICO's pattern of racketeering activity.\n\nDespite this clear intent of RICO to target organized crime, defendant Granito strenuously contends that he could not have known that the acts with which he was charged were sufficiently related to fall within the parameter of RICO's \"pattern of racketeering activity\" element. Granito also argues that there was insufficient evidence to prove that his acts constituted a pattern.\n\nWe are not persuaded. Granito was charged with three predicate acts: (1) conspiring to murder Angelo Patrizzi; (2) being an accessory before the fact to the murder of Patrizzi; and (3) conducting an illegal gambling business (North Margin Street poker games). He argues that these acts do not constitute a pattern, nor could he have known that they might constitute a pattern, because they were unrelated in any \"functional\" way. In making this argument, he stresses that no evidence was introduced to show that Patrizzi's death was related to the card game or vice-versa. Although this might be so if we view the acts in a piecemeal fashion, the flaws in the argument become immediately apparent once we consider the conduct as a whole. The acts with which Granito was charged were not committed in isolation; they all were related to the affairs of the enterprise. It is the relationship between the acts and the affairs of the enterprise that renders Granito's conduct a pattern of racketeering activity under RICO. As the Second Circuit stated in United States v. Indelicato, 865 F.2d 1370 (2d Cir.) (en banc), cert. denied, 491 U.S. 907, 109 S. Ct. 3192, 105 L. Ed. 2d 700 (1989):\n\nIn some cases both the relatedness and the continuity necessary to show a RICO pattern may be proven through the nature of the RICO enterprise. For example, two racketeering acts that are not directly related to each other may nevertheless be related indirectly because each is related to the RICO enterprise.\n\nId. at 1383. The Second Circuit noted further that \"if the racketeering acts were performed at the behest of an organized crime group, that fact would tend to belie any notion that the racketeering acts were sporadic or isolated.\" Id. at 1384.\n\nThe evidence here proved beyond a reasonable doubt that the acts with which Granito was charged were linked to the affairs of the Patriarca Family. This link renders the acts sufficiently related to constitute a pattern under the meaning of RICO. Nor are we persuaded that Granito could have been unaware that these acts fell within the ambit of RICO's pattern of racketeering activity; the express intent of RICO was to target organized crime. Thus, we must reject his vagueness challenge as well.\n\nOther defendants have adopted Granito's arguments as these arguments pertain to their particular factual situations. We need not address each defendant's situation individually. Our holding with respect to Granito is equally applicable to all.\n\nIII. JURY IMPARTIALITY\n\nDefendant Gennaro Angiulo, joined by various co-idefendants, argues that in two respects, his sixth amendment right to a fair trial by an impartial jury was violated. We consider each of his arguments in turn.\n\nA. Change of Venue\n\nGennaro's first argument is that the district court committed constitutional error in denying his repeated motions for a change of venue due to extensive prejudicial pretrial publicity. There can be no dispute that extensive publicity surrounded this case from the moment of the defendants' indictment. There also can be little dispute that jurors in the venire, including some of those ultimately selected for the trial, were exposed to this publicity to one extent or another. The issue is whether this publicity was so extensive and so prejudicial as to require a change of venue.\n\nWe begin by noting the fundamental principle that \"the right to jury trial guarantees to the criminally accused a fair trial by a panel of impartial, 'indifferent' jurors,\" Irvin v. Dowd, 366 U.S. 717, 722, 6 L. Ed. 2d 751, 81 S. Ct. 1639 (1961), and that \"a change of venue may be granted if the court determines that there exists in the district 'so great a prejudice against the defendant that he cannot obtain a fair and impartial trial.'\" United States v. Drougas, 748 F.2d 8, 29 (1st Cir. 1984) (quoting United States v. Gullion, 575 F.2d 26, 28 (1st Cir. 1978)). It is also established that a motion for change of venue \"is addressed to the sound discretion of the trial court and will not be reversed in the absence of an abuse of discretion.\" Id.; see also United States v. Kelly, 722 F.2d 873, 881 (1st Cir. 1983), cert. denied, 465 U.S. 1070, 104 S. Ct. 1425, 79 L. Ed. 2d 749 (1984).\n\nIn determining whether sufficient prejudice existed to require a change of venue, we must conduct two inquiries: 1) whether jury prejudice should be presumed given the facts before us; or 2) if prejudice should not be presumed, whether the jury was actually prejudiced. Although courts often blend the two inquiries, we will endeavor to keep them distinct. See generally Harris v. Pulley, 885 F.2d 1354, 1359-65 (9th Cir. 1988) (distinguishing between presumed prejudice and actual prejudice), cert. denied, 493 U.S. 1051, 58 U.S.L.W. 3450, 107 L. Ed. 2d 848, 110 S. Ct. 854 (1990).\n\n1. Presumed Prejudice\n\nThere are two factors that could call for a presumption of prejudice. First, prejudice may properly be presumed where \"'prejudicial, inflammatory publicity about [a] case so saturated the community from which [the defendant's] jury was drawn as to render it virtually impossible to obtain an impartial jury.'\" United States v. McNeill, 728 F.2d 5, 9 (1st Cir. 1984) (quoting United States v. Chagra, 669 F.2d 241, 250 (5th Cir.), cert. denied, 459 U.S. 846, 74 L. Ed. 2d 92, 103 S. Ct. 102 (1982)); see also Harris, 885 F.2d at 1361. To justify a presumption of prejudice under this standard, the publicity must be both extensive and sensational in nature. If the media coverage is factual as opposed to inflammatory or sensational, this undermines any claim for a presumption of prejudice. See, e.g., Murphy v. Florida, 421 U.S. 794, 802, 44 L. Ed. 2d 589, 95 S. Ct. 2031 (1975); United States v. Medina, 761 F.2d 12, 19 (1st Cir. 1985); McNeill, 728 F.2d at 9; see also Harris, 885 F.2d at 1362.\n\nAfter examining the volumes of newspaper clippings and television news transcripts submitted by the defendants in support of their motions for a change of venue, we find that the media coverage was not so inflammatory or sensational as to require a presumption of prejudice. Although the news coverage was extensive, it largely was factual in nature, summarizing the charges against the defendants and the alleged conduct that underlay the indictment. We acknowledge that frequent references were made to \"reputed crime figure Gennaro Angiulo,\" \"mafia boss Angiulo,\" or \"reputed leader of Boston underworld.\" We find, however, that such references, although not phrased in the most genteel or flattering manner, fall significantly short of the type of emotionally charged, inflammatory, sensationalistic coverage needed to support a presumption of prejudice.\n\nA second factor that could support a presumption of prejudice is a more indirect measure that looks at the \"length to which the trial court must go in order to select jurors who appear to be impartial.\" Murphy, 421 U.S. at 802. Where a high percentage of the venire admits to a disqualifying prejudice, a court may properly question the remaining jurors' avowals of impartiality, and choose to presume prejudice. See id. at 802-03; United States v. Moreno Morales, 815 F.2d 725, 734 (1st Cir. 1987), cert. denied, 484 U.S. 966, 98 L. Ed. 2d 397, 108 S. Ct. 458 (1988). In Moreno Morales, twenty-five percent of the venire admitted believing that defendants were guilty. We found this percentage to be too low to require a presumption that the jurors actually seated at trial -- all of whom proclaimed impartiality -- were indeed prejudiced. See Moreno Morales, 815 F.2d at 735.\n\nThe defendants here do not point to any indicia of prejudice as strong as those that were rejected by us in Moreno Morales. At most, they claim that jurors in the venire were familiar with the Angiulo name, and some associated it with the Mafia. Mere knowledge or awareness of a defendant's past, however, is not sufficient to presume prejudice. More must be shown, such as the actual existence of a present predisposition against defendants for the crimes currently charged. See Murphy, 421 U.S. at 800 \u0026 n. 4. The defendants point to no such indications of prejudice in the venire, and we therefore decline to draw any presumptions of prejudice on the part of the jurors seated at trial.\n\n2. Actual Prejudice\n\nThe next question is whether the jurors seated at trial demonstrated actual partiality that they were incapable of setting aside. See Harris, 885 F.2d at 1363. In pursuing this inquiry, special deference is due the trial court's determination that the jurors were impartial. As we stated in United States v. McNeill:\n\nIf the trial judge, who conducted the voir dire and who could develop a contemporaneous impression of the extent and intensity of community sentiment regarding the defendant, believed that he had impanelled a jury of twelve open-minded, impartial persons, then we will set aside his action only where juror prejudice is manifest.\n\n728 F.2d at 9; see also Patton v. Yount, 467 U.S. 1025, 1032, 1038, 81 L. Ed. 2d 847, 104 S. Ct. 2885 (1984); Moreno Morales, 815 F.2d at 733; Medina, 761 F.2d at 20.\n\nThe defendants rest their allegations of actual prejudice on the extensive pretrial publicity that existed and the jurors' exposure to that publicity. In particular, they emphasize that of the 18 jurors impanelled for trial, only 3 had not been exposed to the Patriarca-Angiulo names, and of the 12 jurors that returned verdicts, only one had not been so exposed. They also note that a number of jurors drew an association between the Angiulo name and the Mafia.\n\nTo meet the standards of the sixth amendment and due process, however, it is not mandated that each and every juror's mind be a blank slate with respect to the defendant. See e.g., Medina, 761 F.2d at 19-20; see also Dobbert v. Florida, 432 U.S. 282, 303, 53 L. Ed. 2d 344, 97 S. Ct. 2290 (1977). The relevant question is whether the jurors \"had such fixed opinions that they could not judge impartially the guilt of the defendant.\" Patton, 467 U.S. at 1035. As the Supreme Court articulated in Irvin v. Dowd:\n\nIt is not required . . . . that the jurors be totally ignorant of the facts and issues involved. In these days of swift, widespread and diverse methods of communication, an important case can be expected to arouse the interest of the public in the vicinity, and scarcely any of those best qualified to serve as jurors will not have formed some impression or opinion as to the merits of the case. This is particularly true in criminal cases. To hold that the mere existence of any preconceived notion as to the guilt or innocence of an accused, without more, is sufficient to rebut the presumption of a prospective juror's impartiality would be to establish an impossible standard. It is sufficient if the juror can lay aside his impression or opinion and render a verdict based on the evidence presented in court.\n\n366 U.S. at 722-23. Thus, the mere fact that a majority of the impanelled jurors had been exposed to the Patriarca-Angiulo names, or that some linked the Angiulo name with the Mafia, is not sufficient to support a finding of actual prejudice. The defendants have put forth nothing to warrant a conclusion that the jurors were unable to lay aside any implications associated with the Angiulo name and reach a verdict based only on the evidence presented at trial.\n\nThe defendants' position is further weakened by the exhaustive procedures employed by the trial court below to screen prospective jurors and impanel an impartial jury. The court examined 260 prospective jurors, requiring each to answer comprehensive written questionnaires and respond to oral questions regarding, among other things, their exposure to pretrial publicity, their knowledge of the case or familiarity with any of the parties, their attitude towards organized crime, and the like. Those who indicated partiality were excused for cause, and the 18 jurors ultimately impanelled stated that they had formed no opinions or conclusions about the case and could render an impartial verdict based on the evidence at trial. Although we do not blindly accept such avowals of impartiality, to justify disregarding them there must be solid evidence of distinct bias. See Medina, 761 F.2d at 20 (reviewing, with approval, extensive voir dire procedures employed by the trial court); McNeill, 728 F.2d at 10. We have found none. In light of the thorough voir dire procedures employed by the trial court, and the repeated assurances of impartiality given by the impanelled jurors, we find that no actual prejudice tainted the jury. This determination, when combined with our rejection of the claim of presumed prejudice, leads us to hold that no constitutional error resulted from the trial court's denial of the motion for change of venue.\n\nB. Juror Misconduct\n\nThe defendants also contend that their constitutional right to an impartial jury was violated due to the trial court's failure to dismiss several jurors on the grounds of bias and misconduct arising from three distinct incidents. We first summarize the three incidents that allegedly fostered juror bias, and then analyze defendants' constitutional claims.\n\nThe first incident involved a juror who requested that the court excuse him from the jury due to his girlfriend's extreme fears that his service on the jury would lead to retribution by the Mafia. The juror notified the court that he had spoken with three other members of the jury about his girlfriend's fears. In response, the district court excused the juror and then questioned individually the three jurors with whom the juror had spoken to ascertain what they had been told and whether any difficulties had arisen with respect to their continued ability to remain impartial. The three jurors assured the court that they had merely been told of the girlfriend's fears and that this would have no effect on their ability to remain impartial. In light of these responses, the court retained the three jurors on the jury, and informed the rest of the jury that the first juror had been excused for personal reasons. The court also asked each of the remaining jurors separately whether anything had occurred to affect his or her impartiality, and all responded in the negative.\n\nThe second incident occurred during closing arguments when a juror informed the court that a friend of hers had relayed to her a bribe offer from third parties to vote not guilty. She told the court that she had rejected the offer, and had not spoken with any other jurors about the bribe attempt. After an examination of this juror, the court excused her, and notified the remaining jurors that she had been excused for personal reasons. The court also notified the jurors that they would be sequestered for the remainder of the trial.\n\nNot surprisingly, this story was reported in the press almost immediately. Subsequent questioning of each juror by the court revealed that four jurors had been exposed, in varying degrees, to the news coverage.\n\nJuror # 37 said that while on the subway she had seen a newspaper headline reporting that a juror had been threatened. She admitted that she was concerned by the story, had tried to read more, but was unable to do so. Juror # 68 reported that juror # 37 had told her of this newspaper headline. Juror # 25 also reported seeing a newspaper headline about a juror being approached, but had read no more of the article. Finally, juror # 4 reported overhearing two people talking about the case and the fact that somebody had talked to a juror.\n\nIn response to individual questioning, each of these jurors assured the court that he or she had not formed any conclusions about the case as a result of exposure to the news coverage, and would be able to render a verdict impartially based only on the evidence introduced at trial. Over the defendants' objections, all of these jurors were retained.\n\nThe third and final incident occurred at the outset of the jury's deliberations when juror # 104 approached a United States marshal and handed him two newspaper articles concerning the case that had been found in the jury room. In response to questioning, juror # 104 stated that he had seen juror # 64 pull the articles from an exhibit box, and had seized the articles from juror # 64 immediately because he knew the articles were not supposed to be there. Juror # 104 admitted glancing through approximately the first third of each article, but stated that he had not read the articles in their entirety. The limited portions of the articles that he could recall summarized past incidents involving certain Angiulo jurors, reporting that one juror had been dismissed because he feared for his safety; that another had been dismissed after being approached by a neighbor; and that a friend of a third juror had reported that some of the jurors had made up their minds as to the defendants' guilt or innocence prior to deliberations. Juror # 104 also said that juror # 37 may have seen the articles.\n\nJuror # 64 then was questioned and acknowledged finding the articles between two exhibit boxes in the deliberation room. He stated, though, that he saw one line at most before juror # 104 seized the articles from him. He also acknowledged that juror # 37 may have observed the articles, but he was not completely sure that she had.\n\nJuror # 37 was questioned and denied seeing any part of the articles. Finally, both juror # 104 and juror # 64 assured the court that their exposure to the news coverage had not affected their ability to remain impartial and render a verdict based solely on the evidence introduced at trial. All three jurors were retained.\n\nDefendants raise allegations of juror bias and misconduct with respect to each of these three incidents. We consider each incident in turn.\n\n1. Girlfriend's Fears\n\nThe threshold question with respect to this incident is whether or not the girlfriend's expressions of fear about possible Mafia retaliation should be analyzed under the standard governing ex parte contacts with jurors. In Remmer v. United States, 347 U.S. 227, 98 L. Ed. 654, 74 S. Ct. 450 (1954), the Supreme Court stated that \"any private communication, contact, or tampering, directly or indirectly, with a juror during a trial about the matter pending before the jury is deemed presumptively prejudicial.\" Id. at 229. The burden then shifts to the government to show that the contact was harmless to the defendant. Id. The paradigmatic example of such an ex parte contact with a juror is a threat, bribe, or statement containing prejudicial information made directly to a juror by a third party stranger.\n\nThe situation before us differs in notable respects from this paradigm. First, the \"contact,\" if it can be called that, was initiated by an intimate relation of a juror, rather than by a third party stranger. Second, direct contact was limited solely to the girlfriend and her boyfriend juror; the other affected jurors only learned indirectly of the situation through the boyfriend. Third, the contact involved only subjective expressions of fear, rather than the traditional threat, bribe, or statement containing prejudicial substantive information. These facts raise a real question as to whether this incident is properly governed by the standards that apply to true ex parte contacts. Because the resolution of defendants' allegation does not turn on the answer to this question, however, we will assume without deciding that the standards governing ex parte contacts do apply and that, under Remmer, the girlfriend's conduct raised a presumption of prejudice that shifted the burden to the government to show that the contact was harmless.\n\nIn an effort to avoid the ensuing burden were we to apply such a presumption, the government states in a footnote in its brief that the Supreme Court abandoned Remmer's presumption of prejudice standard in Smith v. Phillips, 455 U.S. 209, 71 L. Ed. 2d 78, 102 S. Ct. 940 (1982), and Rushen v. Spain, 464 U.S. 114, 78 L. Ed. 2d 267, 104 S. Ct. 453 (1983), and instead placed the burden on the defendant to establish actual prejudice. See Brief for the Government at 91 n. 106. Although the government is careful to cite the two circuit opinions that have accepted, in whole or in part, this abandonment theory, see United States v. Madrid, 842 F.2d 1090 (9th Cir.), cert. denied, 488 U.S. 912, 109 S. Ct. 269, 102 L. Ed. 2d 257 (1988); United States v. Pennell, 737 F.2d 521 (6th Cir. 1984), cert. denied, 469 U.S. 1158, 83 L. Ed. 2d 921, 105 S. Ct. 906 (1985), it neglects to cite to any of the many circuit opinions that resoundingly have rejected this abandonment theory. See, e.g., Stockton v. Virginia, 852 F.2d 740, 744 (4th Cir. 1988), cert. denied, 489 U.S. 1071, 109 S. Ct. 1354, 103 L. Ed. 2d 822 (1989); United States v. Butler, 262 U.S. App. D.C. 129, 822 F.2d 1191, 1195 n. 2 (D.C.Cir. 1987) (listing the Sixth Circuit as the only circuit court that has accepted the abandonment theory, and citing the Fourth, Fifth, Seventh, Eighth, Ninth, and Tenth Circuits as continuing to apply Remmer); United States v. Littlefield, 752 F.2d 1429, 1431-32 (9th Cir. 1985); see also United States v. Hornung, 848 F.2d 1040, 1044 (10th Cir. 1988), cert. denied, 489 U.S. 1069, 109 S. Ct. 1349, 103 L. Ed. 2d 817 (1989); United States v. Caporale, 806 F.2d 1487, 1503 (11th Cir. 1986), cert. denied, 483 U.S. 1021, 97 L. Ed. 2d 763, 107 S. Ct. 3265 (1987); United States v. Robinson, 756 F.2d 56, 59 (8th Cir. 1985).\n\nBecause we find that the government has made an adequate showing to overcome any presumption of prejudice, however, we have no occasion to decide today whether the girlfriend's conduct triggers a Remmer-type presumption. In reaching this determination, we have found several factors regarding the incident to have dispositive significance. First, the girlfriend's conduct did not provide any juror, either directly or indirectly, with substantive extra-judicial information going to the question of defendants' guilt or innocence. Courts frequently examine the nature of the information provided through a challenged ex parte contact and are more likely to deem the contact harmless if the content of the communication does not pertain to substantive matters involved in the trial. See, e.g., Butler, 822 F.2d at 1196; Sher v. Stoughton, 666 F.2d 791, 794-95 (2d Cir. 1981). This refutes the defendants' claims of prejudice, because the girlfriend's conduct merely involved her own subjective expressions of fear, rather than furnishing any information touching upon substantive matters at issue in the trial.\n\nSecond, we note with approval the immediate and thorough steps taken by the district court to ascertain the extent of any juror prejudice. The trial court quickly excused the juror whose girlfriend expressed the fear. The court also thoroughly questioned the three jurors who indirectly learned of the girlfriend's fears to determine whether their impartiality had been compromised. These jurors assured the court that their impartiality had not been affected and that they would base their deliberations solely on the evidence introduced at trial.\n\nWe can find no fault with the actions taken by the district court and his decision to retain the three jurors in light of their assurances of impartiality. Substantial deference is due the trial court's exercise of its discretion in handling situations involving potential juror bias or misconduct. See, e.g., United States v. Aiello, 771 F.2d 621, 629 (2d Cir. 1985); United States v. Webster, 750 F.2d 307, 338 (5th Cir. 1984), cert. denied, 471 U.S. 1106, 85 L. Ed. 2d 855, 105 S. Ct. 2340 (1985); United States v. Kelly, 722 F.2d 873, 881 (1st Cir. 1983), cert. denied, 465 U.S. 1070, 104 S. Ct. 1425, 79 L. Ed. 2d 749 (1984). Because the trial court's determination regarding continued juror impartiality is a question of fact, this enhances the deference due its ultimate finding on the issue. See, e.g., Rushen v. Spain, 464 U.S. 114, 120, 78 L. Ed. 2d 267, 104 S. Ct. 453 (1983); Aiello, 771 F.2d at 630; United States v. Williams, 737 F.2d 594, 612 (7th Cir. 1984), cert. denied, 470 U.S. 1003, 105 S. Ct. 1354, 84 L. Ed. 2d 377 (1985).\n\nHere, the trial court was persuaded of the three jurors' continued impartiality after individually questioning each one. He properly could rely on their assurances of impartiality, given in response to his questions. See, e.g., Aiello, 771 F.2d at 630; Williams, 737 F.2d at 612; Sher, 666 F.2d at 795. We cannot say the court erred in declining to dismiss the three jurors challenged by the defendants.\n\n2. The Bribe Attempt\n\nThere can be little dispute that the juror who was offered the bribe would be presumed, under Remmer, to have been prejudiced. This juror, however, was immediately dismissed, and thus our inquiry turns to the four other jurors who learned of the incident. Of these four jurors, two learned of the bribe offer from glimpses of newspaper headlines; the third learned of it from one of the first two, and the fourth overheard two strangers talking, apparently, about the same newspaper coverage. Directly or indirectly, therefore, all four jurors learned of the incident because of the news coverage. Consequently, the most appropriate standard for us to apply in considering this incident is the standard we have articulated in cases where jurors were exposed to potentially prejudicial publicity during the course of trial.\n\nIn United States v. Porcaro, 648 F.2d 753 (1st Cir. 1981), we set forth a three-prong standard for courts to apply to determine whether publicity during the course of a trial has prejudiced the jury. First, a court should determine whether the news coverage is prejudicial. Second, if it is, the court should determine whether any jurors were exposed to the coverage. Third, if exposure did occur, the court should examine the exposed jurors to determine if this exposure compromised their impartiality. See id. at 757; see also United States v. Gaggi, 811 F.2d 47, 51 (2d Cir.), cert. denied, 482 U.S. 929, 96 L. Ed. 2d 701, 107 S. Ct. 3214 (1987). As with ex parte contacts, a trial court's finding of continued jury impartiality despite exposure to news coverage should be upheld absent abuse of discretion. See Gaggi, 811 F.2d at 51.\n\nApplying this standard, we reject defendants' challenges to the four jurors. Although there can be no dispute that the jurors were exposed to the news coverage (prong two of the standard), the defendants cannot succeed on the other two prongs of the test. First, we have substantial reservations about whether the minimal news coverage to which the jurors were exposed can truly be deemed prejudicial. The jurors were exposed, directly or indirectly, to no more than a brief newspaper headline reporting that a juror had been approached. They were not exposed to any substantive information about issues at trial or about the defendants' guilt with respect to the charges against them. See id. at 52. The coverage also was factually oriented rather than sensational in nature. See Porcaro, 648 F.2d at 758.\n\nFurthermore, with respect to the third prong of the standard, we note that the trial court individually questioned each of the four jurors about their continued impartiality and accepted their assurances of impartiality as credible. In light of the prompt action by the trial court, the non-sensational nature of the minimal amounts of coverage to which the jurors were exposed, and the jurors' avowals of continued impartiality, we find that the trial court's retention of the four challenged jurors on the jury was not error. See United States v. Chang An-Lo, 851 F.2d 547, 559 (2d Cir.), cert. denied, 488 U.S. 966, 109 S. Ct. 493, 102 L. Ed. 2d 530 (1988); Gaggi, 811 F.2d at 51-53; see also United States v. Maceo, 873 F.2d 1, 6 (1st Cir.), cert. denied, 493 U.S. 840, 110 S. Ct. 125, 107 L. Ed. 2d 86 (1989).\n\n3. Newspaper Articles in Jury Room\n\nDefendants' final jury challenge pertains to the incident involving the newspaper articles in the jury room at the outset of the jury's deliberations. As with the bribe attempt, defendants' argument alleges juror exposure to prejudicial news coverage. Thus, Porcaro's three element standard governs our consideration of this incident as well.\n\nFor essentially the same reasons articulated in our discussion of the bribe attempt coverage, we find that defendants cannot succeed under Procaro's three-prong test. At the outset, we note that prong two has been satisfied: there was juror exposure to news coverage. Specifically, juror # 104 admitted to glancing at portions of the articles found in the deliberation room. As with the bribe attempt incident, however, defendants fail on the other two elements of the test. First, we have doubts about whether the articles to which at least juror # 104 was exposed were prejudicial within the meaning of the three-prong standard. The articles were factually oriented accounts of incidents allegedly involving certain jurors. They do not appear to have been sensational in nature. Nor did the articles contain extra-judicial substantive information about issues at trial or the defendants' guilt with respect to the charges against them.\n\nIn addition, as it did in the other incidents, the district court thoroughly questioned each of the challenged jurors to ascertain the extent of their exposure and their continued ability to judge the defendants impartially. Each juror assured the court of his continued impartiality, and the court was satisfied with these assurances. In light of the deference due the district court's determinations, we find no error in its retention of the challenged jurors on the jury. See Chang An-Lo, 851 F.2d at 559.\n\nIV. TESTIMONIAL AND PROCEDURAL CHALLENGES\n\nDefendants raise a host of challenges regarding various testimonial and procedural issues that arose at trial. We consider each of their contentions.\n\nA. Expert Witness Testimony\n\nAt trial, the government called FBI Agents Arthur Eberhart and James Nelson to give expert testimony. Eberhart was the government's gambling expert and testified at length as to various defendants' roles in different gambling operations. Nelson gave more general expert testimony on the structure and operations of La Cosa Nostra and also gave his opinion, based on the wiretap tapes, regarding each defendant's role in the criminal organization. Among other things, it was his opinion that Raymond Patriarca was the boss of the Boston-Providence Family of La Cosa Nostra and that Gennaro Angiulo was the underboss.\n\nDefendants raise two objections to this expert testimony. First, they argue that it violated their sixth amendment right to confrontation because the trial court allowed the agents to testify without requiring that they disclose the identity of, or information received from, certain government informants. Second, they contend that permitting the experts to testify as to the defendants' roles in various activities invaded the province of the jury by effectively telling the jury what results to reach.\n\n1. Nondisclosure of Informant Information\n\nDefendants raise a two-part challenge to the trial court's failure to require the disclosure of informant information. First, they contend that allowing the FBI agents' testimony without requiring the disclosure of informant information violated Rule 705 of the Federal Rules of Evidence, which states that on cross-examination, an expert witness may be required to disclose the facts and data underlying his opinion.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Second, defendants argue that their sixth amendment right to confrontation was violated because they could not effectively cross-examine the agents without the disclosure of the informant information.\n\nIn United States v. Angiulo, 847 F.2d 956 (1st Cir.), cert. denied, 488 U.S. 928, 109 S. Ct. 314, 102 L. Ed. 2d 332 (1988), we considered and rejected virtually identical arguments raised on appeal after the trial and conviction of Jason Angiulo, Gennaro's son, and various other associates of the Patriarca Family. In that trial, Agent Nelson also gave expert testimony on the operations of La Cosa Nostra and the roles of the defendants in the organization without being required to disclose the identity of informants. We upheld that testimony against sixth amendment and Rule 705 challenges on several grounds. First, we noted that the trial court had instructed Nelson not to answer any questions on direct examination that would be based on informant information he could not disclose on cross-examination. Second, we emphasized that Nelson had testified explicitly that his opinions regarding the defendants were based solely on the tapes presented at trial. Finally, we noted that defendants had the opportunity to cross-examine Nelson extensively on his opinions. In those circumstances, we found no error in the trial court's refusal to require the disclosure of informant information. See id. at 974.\n\nWe find the same reasoning to be dispositive here. The sole distinction between Angiulo and the situation before us is that the trial court here did not expressly instruct the expert witnesses not to answer any questions on direct examination that would be based on informant information that could not be disclosed on cross-examination, as had been done in Angiulo. This distinction, however, does not require a different result. The experts here gave the same type of testimony that was given in Angiulo, stating their opinions as to the roles played by defendants. As in Angiulo, the expert testimony was based solely on tape recordings presented at trial. Nelson repeatedly stated, both on direct examination and on cross-examination, that his testimony as to the roles played by the defendants was based only on the taped conversations that he had reviewed.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Although it might have been preferable for the trial court explicitly to instruct the experts as had been done in Angiulo, it was not reversible error to fail to do so where the experts testified that the opinions given were based only on the tape recordings.\n\nDefendants attempt to distinguish Angiulo by pointing to various admissions by the experts that informant information had provided a basis for certain of their conclusions. We have carefully reviewed the relevant portions of the record and find that the experts testified only that information from past cooperating witnesses had contributed to their knowledge about La Cosa Nostra in general. Phrased another way, the experts acknowledged that information gleaned from informants over the course of their FBI careers was part of the vast mix of material that contributed to their background expertise on La Cosa Nostra. This expertise, in turn, enabled them to listen to the tapes and form opinions on defendants' criminal activities. The fact that informant information furnished some part of the experts' background knowledge does not implicate the sixth amendment. Regardless of the information that contributed to their background expertise, the experts' testimony regarding the particular charges against these defendants was based solely on an analysis of the tape recordings. We find no error in the trial court's failure to require the disclosure of informant information.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\n2. Invasion of the Jury's Province\n\nDefendant Granito, joined by Gennaro Angiulo, raises an additional objection to the expert testimony. Specifically, Granito challenges Agent Eberhart's testimony regarding the roles played by various defendants in the North Margin Street poker operation -- in particular, Eberhart's testimony that, based on his analysis of the tape recordings, it was his opinion that Granito was a \"partner\" in the poker game.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nGranito contends that Eberhart's expert testimony should have been limited to a description of the general operation of gambling businesses and an explanation of any specialized terminology appearing on the tapes. With such testimony as background, the jury would have been more than competent to determine for itself the nature of Granito's involvement. In letting the expert state his opinion regarding Granito's role, the trial court impermissibly allowed the expert to give a legal conclusion and effectively tell the jury what result to reach, argues the defendant.\n\nWe disagree. The permissible scope of expert testimony under Fed.R.Evid. 702 is quite broad,\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e and encompasses an expert's statement of opinion on an ultimate fact at issue. See, e.g., United States v. Lamattina, 889 F.2d 1191, 1193-94 (1st Cir. 1989); United States v. Theodoropoulos, 866 F.2d 587, 591 (3d Cir.), mandamus denied, 489 U.S. 1009, 109 S. Ct. 1179, 103 L. Ed. 2d 246 (1989). The only significant limitation is that the expert opinion be helpful to the trier of fact. See Theodoropoulos, 866 F.2d at 591. Furthermore, the trial court has wide discretion in determining whether to admit expert testimony under this standard. See Lamattina, 889 F.2d at 1194.\n\nApplying these principles to the facts at hand, we find that the trial court committed no error in allowing the expert to give his opinion as to the defendant's role in the criminal activities at issue here. We recently have upheld similar expert testimony in closely analogous circumstances. In United States v. Lamattina, we found no error in allowing an expert witness to testify that, after listening to the government's recorded conversation involving the defendant, it was his opinion that the conversation pertained to a loansharking transaction. See Lamattina, 889 F.2d at 1193-94. Similarly, in United States v. Angiulo, we found no error in allowing an expert to testify that, after listening to the government's tapes, it was his opinion that the defendants were \"close associates\" of the Patriarca Family. See Angiulo, 847 F.2d at 973-75. In both cases, we reasoned that the testimony was helpful to the jury in determining the meaning and significance of recorded conversations and the criminal jargon used in them. See Lamattina, 889 F.2d at 1194. We noted in Angiulo that, although this type of testimony posed some risk of prejudicing the defendants, it was particularly helpful in assisting the jury to understand the often complex structure of organized crime activities. See Angiulo, 847 F.2d at 975; see also Theodoropoulos, 866 F.2d at 592.\n\nThe same reasoning is equally applicable here. Given the extensive criminal organization controlled by the Patriarca Family, the complexity of the interrelationships within the organization, and the use of criminal jargon by defendants in their conversations, we cannot find that the district court abused its discretion in permitting expert testimony as to defendants' roles in certain activities on the ground that such testimony would be helpful to the jury. As we did in Angiulo, we acknowledge that some risk exists that this type of testimony will be overly persuasive to the jury. We note with approval, however, that the trial court explicitly instructed the jury that it could accept or reject the expert testimony in whole or in part. Cf. Theodoropoulos, 866 F.2d at 592 (approving of a similar jury instruction). Considering the matter in its entirety, there was no error here.\n\nB. Refusal of Immunity\n\nDefendants' next claim of error pertains to the extortionate credit transaction involving a $200,000 loan to Joseph Palladino. To counter the government's evidence relating to this transaction, defendants intended to introduce the testimony of the alleged victim, Joseph Palladino, that he was not a loansharking victim at all, but rather a party to a legitimate business transaction with the defendants. Before calling Palladino to the stand, the defense moved to limit the government's cross-examination of Palladino to the subject of his intended direct examination -- his alleged status as a loanshark victim. The motion informed the court that Palladino would assert his fifth amendment privilege in response to all other areas of inquiry. When this motion was denied, defendants then moved for judicial immunity for Palladino, claiming that he possessed exculpatory information and would not testify in the absence of immunity for fear of future prosecution. This motion also was denied, and Palladino did not testify. Defendants argue that the trial court's failure to order immunity denied them a fair trial on the count alleging the $200,000 extortionate loan to Palladino.\n\nThe government's response to this contention is simply that the trial court lacked the authority to grant or order use immunity for Palladino. We find this response inadequate to refute defendants' contentions on the immunity issue. Although it is clear that the district court lacked authority to grant immunity itself under the use immunity statute, 18 U.S.C. § 6003(b), see United States v. Doe, 465 U.S. 605, 616-17, 79 L. Ed. 2d 552, 104 S. Ct. 1237 (1984); Pillsbury Co. v. Conboy, 459 U.S. 248, 74 L. Ed. 2d 430, 103 S. Ct. 608 (1983), it is a more difficult question whether the trial court had power, on fifth or sixth amendment grounds, to require a grant of immunity if the defendants' constitutional rights were being violated by the government's refusal to provide immunity.\n\nA number of our sister circuits have considered this question, and two theories have emerged under which defendants would be entitled to a grant of immunity for prospective witnesses. The first theory, accepted in only a small minority of cases, can be labeled the \"effective defense\" theory; it holds that a court has the inherent power to immunize witnesses whose testimony is essential to an effective defense. The second theory, accepted by a number of circuits, can be called the \"prosecutorial misconduct\" theory; it holds that a court has the power to order the government to grant statutory immunity to a witness (or face a judgment of acquittal) where there exists prosecutorial misconduct arising from the government's deliberate intent to distort the fact-finding process. See, e.g., United States v. Pennell, 737 F.2d 521, 526 (6th Cir. 1984) (describing the two theories), cert. denied, 469 U.S. 1158, 83 L. Ed. 2d 921, 105 S. Ct. 906 (1985); United States v. Turkish, 623 F.2d 769, 773 (2d Cir. 1980) (same), cert. denied, 449 U.S. 1077, 66 L. Ed. 2d 800, 101 S. Ct. 856 (1981); see also United States v. Hooks, 848 F.2d 785, 803 (7th Cir. 1988). In prior cases, we have acknowledged briefly the existence of these two theories, but have not discussed them in much depth, due to the defendants' clear failure to satisfy the requirements of either theory. See United States v. Drape, 668 F.2d 22, 26-27 (1st Cir. 1982); United States v. Davis, 623 F.2d 188, 193 (1st Cir. 1980). Defendants' allegations in this case warrant our examination of the theories in greater detail.\n\n1. Effective Defense Theory\n\nThe effective defense theory was articulated by the Third Circuit in Government of the Virgin Islands v. Smith, 615 F.2d 964 (3d Cir. 1980) and holds that:\n\nwhen it is found that a potential defense witness can offer testimony which is clearly exculpatory and essential to the defense case and when the government has no strong interest in withholding use immunity, the court should grant judicial immunity to the witness in order to vindicate the defendant's constitutional right to a fair trial.\n\nId. at 974. Under this theory, the court itself has the inherent power to grant immunity. The power is grounded in a defendant's due process right to have exculpatory evidence presented to the jury. See id. at 969 et seq.\n\nThis theory has been rejected by virtually every other court that has considered the issue. See, e.g., United States v. Paris, 827 F.2d 395, 399 (9th Cir. 1987); United States v. Tindle, 808 F.2d 319, 325 n. 4 (4th Cir. 1986) (noting that the effective defense theory has been soundly criticized and is clearly the minority view, and citing cases); United States v. Sawyer, 799 F.2d 1494, 1506 (11th Cir. 1986), cert. denied, 479 U.S. 1069, 93 L. Ed. 2d 1009, 107 S. Ct. 961 (1987); Pennell, 737 F.2d at 527; United States v. Mendia, 731 F.2d 1412, 1414 (9th Cir.), cert. denied, 469 U.S. 1035, 83 L. Ed. 2d 399, 105 S. Ct. 509 (1984); Turkish, 623 F.2d at 775-77. One of the most frequent rationales articulated in opposition to the theory is that it would pose separation of power problems for courts to assume inherent authority to grant judicial immunity themselves. The rationale is that the power to grant witness immunity is of legislative origin, and was granted to the executive branch. For the judiciary to exercise this power in the absence of a legislative grant would violate separation of power principles. See, e.g., Pennell, 737 F.2d at 527; see also Mendia, 731 F.2d at 1414. In addition to separation of power difficulties, those critical of the theory have articulated certain practical considerations that militate against courts' assuming the power to grant immunity to witnesses who possess exculpatory information. The Second Circuit has observed that acceptance of the effective defense theory would force judges to balance a defendant's need for particular witnesses against the prosecutor's reasons for not seeking immunity for the witnesses herself -- an exercise not well-suited for judicial decisionmaking. See Turkish, 623 F.2d at 775-77; see also Pennell, 737 F.2d at 527-28 (articulating additional practical considerations).\n\nWe find these arguments to have considerable force and accordingly have substantial reservations about the effective defense theory. Even, however, if we accepted the theory as articulated by the Third Circuit in Government of Virgin Islands v. Smith, 615 F.2d 964, the defendants here would not satisfy its requirements. The Third Circuit stated in Smith that before a court should invoke any inherent power to grant immunity, it must be found that the prospective witness would offer clearly exculpatory and essential testimony and that the government has no strong interest in withholding immunity. See id. at 974. Accepting, for the sake of discussion only, that Palladino would have offered essential and exculpatory testimony, the defendants' immunity argument falls under the second requirement. Unlike in Smith, the government here has presented a number of significant reasons for withholding immunity. Specifically, the government has indicated a desire not to hinder possible future prosecutions of Palladino for alleged involvement in other organized crime activities, for a variety of likely tax violations, and for probable violations of state laws. These reasons certainly are adequate to constitute a strong governmental interest in withholding immunity. We therefore reject defendants' contentions under the effective defense theory.\n\n2. Prosecutorial Misconduct Theory\n\nDespite the nearly universal rejection of the effective defense theory, courts have held that the due process clause does constrain the prosecutor to a certain extent in her decision to grant or not to grant immunity. If a prosecutor abuses her discretion by intentionally attempting to distort the fact-finding process, then a due process violation exists and a court may order the prosecutor to grant immunity or face a judgment of acquittal. See United States v. Hooks, 848 F.2d 785, 799 (7th Cir. 1988).\n\nSuch intentional distortion could occur in two ways. First, the government could intimidate or harass potential defense witnesses to discourage them from testifying -- for example, by threatening them with prosecution for perjury or other offenses. Where such intimidation tactics cause a potential witness to invoke the fifth amendment and withhold testimony that otherwise would have been available to the defendant, a court may order the prosecutor to grant immunity to the witness or face a judgment of acquittal. See, e.g., United States v. Pinto, 850 F.2d 927, 932 (2d Cir.), cert. denied, 488 U.S. 867, 109 S. Ct. 174, 102 L. Ed. 2d 143 (1988); Hooks, 848 F.2d at 799; United States v. Lord, 711 F.2d 887, 891 (9th Cir. 1983); United States v. Morrison, 535 F.2d 223, 229 (3d Cir. 1976). Cf. Webb v. Texas, 409 U.S. 95, 98, 34 L. Ed. 2d 330, 93 S. Ct. 351 (1972) (holding that a judge's lengthy perjury warnings to a defense witness effectively drove the witness off the stand, thereby denying the defendant his due process right to present his defense). Second, the government could intentionally distort the fact-finding process by deliberately withholding immunity from certain prospective defense witnesses for the purpose of keeping exculpatory evidence from the jury. See Hooks, 848 F.2d at 802; Government of the Virgin Islands v. Smith, 615 F.2d at 968; see also Pennell, 737 F.2d at 526; United States v. Burns, 684 F.2d 1066, 1077 (2d Cir. 1982), cert. denied, 459 U.S. 1174, 74 L. Ed. 2d 1019, 103 S. Ct. 823 (1983).\n\nWe find that the defendants have failed to make an adequate showing of either type of prosecutorial misconduct. With respect to their claims of governmental intimidation, the defendants have pointed to four instances of alleged prosecutorial misconduct: (1) the government's informing the court that it thought Palladino would lie if he testified; (2) the government's transmission of pertinent information on Palladino to the Internal Revenue Service's (IRS) Criminal Division; (3) the government's recital to the court of the criminal activities of which Palladino was suspected; and (4) the notification given to Palladino by the Internal Revenue Service that he was under investigation for possible tax violations.\n\nNone of this conduct is sufficient to warrant a finding of witness intimidation by the prosecution. The government arguably was justified in telling the court it thought Palladino would lie and in detailing his suspected criminal activities to explain its reasons for not granting him immunity. In addition, it is difficult to see how these communications could be deemed an intimidation of the witness when they were made to the court. Neither can we fault the prosecution's transmission of information to the IRS. The defendants have not shown that it is anything but a routine practice for one investigatory arm of government to forward information to other arms that also have an interest in the information. Finally, we cannot hold the prosecution liable for the actions of the IRS in choosing to notify Palladino that he was under investigation for suspected tax violations. There has been no indication whatsoever that the prosecution suggested to the IRS that it contact Palladino, or that the prosecution even knew of the contact in advance.\n\nFurthermore, the conduct complained of by defendants here falls far short of the type of prosecutorial conduct condemned by other courts as witness intimidation. For example, in United States v. Morrison, 535 F.2d 223, the prosecutor on at least three occasions had sent messages to a prospective defense witness warning her that she was liable to prosecution on drug charges; that if she testified, the testimony could be used as evidence against her; and that if she lied, federal perjury charges could be brought. The prosecutor then subpoenaed the witness to his office and again warned her, in the presence of three law enforcement officers, of the risks of testifying. After these warnings, the witness took the stand and repeatedly invoked her privilege against self-incrimination. See id. at 225-26; see also Lord, 711 F.2d at 891-92. The defendants here have not pointed to any prosecutor-witness communication that even remotely approaches the conduct involved in Morrison. Indeed, the defendants have not pointed to any direct communication between the prosecution and Palladino at all. Nor have the defendants established the requisite causal nexus between the government's conduct and Palladino's decision not to testify. See United States v. Hoffman, 832 F.2d 1299, 1303-05 (1st Cir. 1987). Given these circumstances, we find that defendants have failed to make a showing of governmental intimidation.\n\nWe also find no indication that the prosecution intentionally distorted the fact-finding process by deliberately withholding immunity from Palladino for the purpose of keeping his exculpatory testimony from the jury. The government gave several reasons for its objection to the immunization of Palladino, including its desire not to hinder possible state and federal prosecutions of Palladino for his suspected involvement in other criminal activities. These reasons clearly show that the government's conduct was motivated by something other than the sole desire to keep Palladino's exculpatory testimony from the jury. Accordingly, we reject defendants' prosecutorial misconduct theory, and find no error in the government's failure to offer immunity to Joseph Palladino.\n\nC. Admission of Government Pleadings\n\nDefendants object to the admission at trial of certain pretrial government motions to unseal and reseal tape recordings. To understand the defendants' objection, it is necessary first to review the underlying factual context.\n\nIn his opening statement to the jury, counsel for Francesco Angiulo challenged the government's handling of the wiretap tapes, suggesting that the procedures by which the tapes were handled did not adequately ensure their protection from tampering, and insinuating that the tapes very well may have been tampered with by the government. He acknowledged that the government had taken steps to seal the original recordings, but then noted that the tapes had been unsealed and resealed for various reasons, thereby creating the opportunity for alteration. Defense counsel even went so far as to suggest that government attorneys had misled the court on certain occasions when requesting that particular tapes be unsealed and resealed. The purpose of these statements obviously was to cast doubt on the integrity of the tape recordings that formed the heart of the government's case.\n\nTo respond to these assertions, the government elaborately laid out, through testimony and documentation, the procedures by which the tapes were handled. Included in the documentation were certain pretrial motions that had been filed by the government to unseal and reseal tape recordings. The motions were introduced and allowed in evidence not for the truth of the matters asserted, but rather to establish the reasons the government had articulated to the court in its requests for unsealing and resealing, and when these reasons had been stated. Put another way, the government was not offering the motions to prove that it had been truthful in the reasons it had given to the court for unsealing and resealing the tape recordings; rather, it was seeking only to show what the motions had stated and when they had been filed. The jury was explicitly instructed to this effect -- that it was not to consider the motions for the truth of the matters asserted.\n\nDefendants objected to the admission of the motions at trial, and they reiterate their objections on appeal. They argue that because the motions contained factual assertions made by government attorneys under oath, the admission of the motions at trial caused the government attorneys effectively to become witnesses on disputed factual issues. In particular, defendants object to the assertion made in one motion by the lead prosecutor that the integrity of the tapes had been maintained. Invoking the prohibition against an attorney's serving as both advocate and witness, defendants contend that once the motions were admitted, the lead prosecutor should either have been disqualified or subjected to cross-examination on his sworn statements contained in the admitted motions. The trial court's failure to require either, according to defendants, is reversible error.\n\nDefendants' arguments can be dispensed with fairly quickly. We acknowledge the existence of the advocate-witness rule, which generally \"bars an attorney from appearing as both an advocate and a witness in the same litigation.\" United States v. LaRouche Campaign, 695 F. Supp. 1290, 1315 (D.Mass. 1988). We are also aware that where an attorney improperly appears as both an advocate and a witness in the same litigation, the sanction of reversal and a new trial may be justified. See United States v. Birdman, 602 F.2d 547, 556-60 (3d Cir. 1979), cert. denied, 444 U.S. 1032, 62 L. Ed. 2d 668, 100 S. Ct. 703 (1980).\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nThat situation, however, does not confront us here. We find it highly significant that the motions to unseal and reseal were not admitted for the truth of the matters asserted, and that the jury explicitly was instructed to this effect. It follows that if the assertions made by government attorneys were not introduced for their truth, then the attorneys cannot be considered to have become witnesses, and there was no violation of the advocate-witness rule. Because defendants have articulated no other compelling need to justify calling the lead prosecutor as a witness, see United States v. Prantil, 764 F.2d 548, 551-54 (9th Cir. 1985); United States v. Schwartzbaum, 527 F.2d 249, 253 (2d Cir. 1975), cert. denied, 424 U.S. 942, 96 S. Ct. 1410, 47 L. Ed. 2d 348 (1976), we find no error in the trial court's failure either to disqualify the lead prosecutor or require him to submit to cross-examination.\n\nD. Severance\n\nDefendant Gennaro Angiulo raises the final procedural challenge, contending that the trial court erred in denying his motion to be severed from the trial of Granito due to antagonistic defenses.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e To address this issue, it is again necessary to review the underlying factual context.\n\nGranito was charged with: (1) conspiring to murder Angelo Patrizzi, and (2) owning and operating an illegal gambling business (the North Margin Street poker games).\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e The government's evidence against Granito consisted of tape-recorded conversations in which, inter alia, Granito discussed with Gennaro prior unsuccessful attempts to kill Patrizzi, and also inquired as to the division of profits from the North Margin Street poker game. In defense to these charges, Granito argued that he had withdrawn from any conspiracy to murder Patrizzi and that he had inquired about the poker game proceeds, not for himself, but as a favor for an individual named Nicola Giso.\n\nGennaro also was charged with these offenses. The government's evidence against him consisted of the same tape recordings introduced against Granito, as well as some others. Gennaro's defense to the charges, consistent with his defense to virtually all of the charges, was a combination of two arguments: (1) that the tapes were unintelligible, and (2) that there was insufficient evidence to prove his guilt beyond a reasonable doubt. Gennaro contends that these defenses were antagonistic to those of Granito, and as a result, the trial court erred in denying his motion to sever. We are not persuaded.\n\nA motion for severance is addressed to the discretion of the trial court, and the court's denial of such motion will be overturned only when there has been a clear abuse of discretion. See, e.g., United States v. Drougas, 748 F.2d 8, 18 (1st Cir. 1984); United States v. Arruda, 715 F.2d 671, 679 (1st Cir. 1983); United States v. Davis, 623 F.2d 188, 194 (1st Cir. 1980). Furthermore, \"antagonism of defenses requires severance only where the defenses are so inconsistent that the jury would have to believe one defendant at the expense of the other; the conflict alone establishes the guilt of a defendant.\" Drougas, 748 F.2d at 20 (quoting Arruda, 715 F.2d at 679). It is not enough that the defendants are hostile, casting blame on one another; the antagonism in defenses must be such that if the jury believes one defense, it is compelled to convict the other defendant. See id. at 19; Arruda, 715 F.2d at 679; see also United States v. Porter, 764 F.2d 1, 13 (1st Cir. 1985); United States v. Talavera, 668 F.2d 625, 630 (1st Cir.), cert. denied, 456 U.S. 978, 102 S. Ct. 2245, 72 L. Ed. 2d 853 (1982); Davis, 623 F.2d at 194-95.\n\nApplying these standards to the facts at hand, we find that Gennaro and Granito's defenses were insufficiently antagonistic to require severance. Granito's theory of defense was simply that he had withdrawn or was not involved in the crimes charged. We recognize that this theory did not always mesh perfectly with Gennaro's defense. Thus, while Gennaro argued that conversations on certain crucial tapes were unintelligible, Granito chose not to challenge the tapes but rather focused on furnishing innocent explanations for the conversations attributed to him by the government. Furthermore, some of Granito's explanations could have been accepted by the jury as compatible with a determination that Gennaro was guilty on the offenses charged. For example, Granito's explanation that he inquired about the poker game proceeds only as a favor for Nicola Giso could have been accepted by the jury as compatible with a determination that Gennaro was in charge of the poker games. But this does not make the defenses antagonistic. To conclude that defenses are antagonistic, we must find that the jury's belief of one defendant's theory necessarily compels a finding that the other defendant is guilty. This is not the situation here. The jury could have believed that Granito withdrew from the murder conspiracy and never participated in the gambling enterprise without being compelled to find Gennaro guilty of these offenses. Phrased another way, the jury could have believed Granito's withdrawal/noninvolvement defense while also accepting Gennaro's contention that there was insufficient evidence to convict him. Thus, no antagonistic defenses existed sufficient to require severance.\n\nWe are supported in this conclusion by prior cases in which we have denied severance despite the presence of even more sharply antagonistic defense theories than are involved here. In United States v. Arruda, 715 F.2d 671, we found no sufficiently antagonistic defenses even though one defendant's theory consisted of blaming his co-defendant for the crime while proclaiming his own innocence. In declining to require severance, we stated that the first defendant's theory \"consisted of nothing more than fingerpointing and tattling, which does not justify severance.\" Id. at 679. Similarly, in United States v. Luciano Pacheco, 794 F.2d 7 (1st Cir. 1986), we again rejected a claim of antagonistic defenses where one defendant's theory consisted explicitly of blaming his two co-defendants. See id. at 9-10. Granito's defense and Gennaro's defense did not even reach this level of antagonism. Accordingly, we reject defendants' severance argument.\n\nV. SUFFICIENCY OF THE EVIDENCE\n\nGranito raises two challenges to the sufficiency of the evidence supporting his convictions. The first involves the evidence regarding the Patrizzi murder; the second pertains to the North Margin Street poker games.\n\nA. The Patrizzi Murder\n\nGranito contends that insufficient evidence existed to prove that he was an accessory before the fact to the murder of Angelo Patrizzi and therefore his two RICO convictions must be overturned. To understand the reasoning behind this argument, as well as our analysis of it, it is necessary to review the nature of the charges against Granito and the form of the jury's verdict.\n\nThe indictment charged Granito with two RICO counts, under 18 U.S.C. § 1962(d) and (c) respectively, as well as with one substantive gambling violation, under 18 U.S.C. § 1955. The two RICO counts, in turn, charged Granito with the commission of three predicate acts: (1) conspiring to murder Patrizzi; (2) being an accessory before the fact to the murder of Patrizzi by inciting, procuring, counseling, hiring and commanding Frederick Simone\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e and others to commit the murder; and (3) owning and operating an illegal gambling business (the North Margin Street poker games). This last predicate act corresponded to the substantive gambling count charged separately against Granito under 18 U.S.C. § 1955.\n\nIn explaining these charges to the jury, the trial court set forth the legal elements the jury had to find to convict on each of the alleged criminal acts. The court also explicitly instructed the jury that as a prerequisite to finding Granito guilty of being an accessory before the fact to the murder of Patrizzi, \"you must first find that Frederick Simone actually committed or was otherwise a principal in the commission of the murder of Angelo Patrizzi.\"\n\nThe jury returned a general verdict finding Granito guilty on both of the RICO counts, thereby necessarily finding him guilty on at least two of the three predicate acts charged.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e The jury also found Granito guilty on the substantive gambling count that had been charged separately.\n\nGranito's argument on appeal is that there was insufficient evidence to support the accessory charge. More specifically, he contends that insufficient evidence existed to find that Simone was a principal in the Patrizzi murder, and thus, under the judge's instruction, the jury could not have found that he was an accessory. As a result, he posits that his RICO convictions must be overturned because the general nature of the verdict makes it impossible to know whether the jury relied on the insufficient accessory charge as one of two predicate acts it found under RICO. Put another way, Granito argues that the insufficiency of the evidence regarding the accessory charge requires the overturning of his RICO convictions, because the jury may have found only two predicate acts, and we are unable to rule out the possibility that the accessory charge was one of these.\n\nThe government's first response to these arguments is that, regardless of the jury instruction, the indictment charged Granito with procuring or counseling Simone and others to commit the murder of Patrizzi, and thus it is not required that Simone in particular be found a principal in order to find Granito an accessory. Second, the government argues that even if Simone must be found to have been a principal, there is sufficient evidence to support this finding. Finally, the government contends in the alternative that even if there is insufficient evidence on the accessory charge, Granito's RICO convictions need not be overturned. We consider each of these issues in turn.\n\nIn reviewing the sufficiency of the evidence, we conclude that we are bound by the trial court's instruction to the jury that Simone must be found a principal in order to convict Granito as an accessory. The instruction was not legally incorrect, and once it was given, it became the law of the case. See, e.g., United States v. Killip, 819 F.2d 1542, 1547-48 (10th Cir.), cert. denied, 484 U.S. 865, 98 L. Ed. 2d 139, 108 S. Ct. 186 (1987); United States v. Tapio, 634 F.2d 1092, 1094 (8th Cir. 1980); see also Wells Real Estate, Inc. v. Greater Lowell Bd. of Realtors, 850 F.2d 803, 809 (1st Cir.), cert. denied, 488 U.S. 955, 109 S. Ct. 392, 102 L. Ed. 2d 381 (1988); Milone v. Moceri Family, Inc., 847 F.2d 35, 38-39 (1st Cir. 1988). If we were to treat the instruction otherwise, and conclude that Granito could be deemed an accessory without finding Simone to have been a principal, we would be sustaining a conviction on appeal on a theory upon which the jury was not instructed below. This we cannot do. See United States v. Hill, 835 F.2d 759, 764 n. 7 (10th Cir. 1987); Cola v. Reardon, 787 F.2d 681, 696 (1st Cir.), cert. denied, 479 U.S. 930, 93 L. Ed. 2d 351, 107 S. Ct. 398 (1986).\n\nThe issue therefore becomes whether the government introduced sufficient evidence to prove beyond a reasonable doubt that Simone was a principal in the murder of Patrizzi. Our review of the evidence must be made in the light most favorable to the government, drawing all legitimate inferences and resolving all credibility determinations in favor of the verdict. See, e.g., United States v. Machor, 879 F.2d 945, 948 (1st Cir. 1989); United States v. Winter, 663 F.2d 1120, 1127 (1st Cir. 1981), cert. denied, 460 U.S. 1011, 75 L. Ed. 2d 479, 103 S. Ct. 1250 (1983).\n\nApplying this standard to the facts, we conclude that the evidence was not sufficient to find beyond a reasonable doubt that Simone was a principal in the murder of Patrizzi. It therefore follows that there was insufficient evidence to support a finding that Granito was an accessory before the fact.\n\nThe evidence introduced by the government at trial consisted primarily of taped conversations. This evidence indicated that Gennaro Angiulo, Samuel Granito, and others were concerned that Patrizzi might be seeking revenge against Frederick Simone and Cono Frizzi, two Boston members of the Patriarca Family, for the 1978 murder of his half-brother, Joe Porter. It was therefore decided that Patrizzi be killed before he killed either Simone or Frizzi. As evidence of the plans to kill Patrizzi, the government introduced a tape of a March 11, 1981 conversation between Granito, Simone and Gennaro Angiulo in which Granito and Simone related prior unsuccessful attempts to commit the murder. Granito told Gennaro: \"We had him ready last Friday . . . . We had a place. We're gonna take him in a house and strangle him.\" Simone further explained that he was going to take Patrizzi for a car ride and \"we were gonna kill him in the Club.\"\n\nIn the course of this March 11 conversation, Gennaro indicated that he would assist in the effort to find and kill Patrizzi. The next day, in a conversation with Ilario Zannino that also was taped, Gennaro enlisted the assistance of Zannino as well: \"Therefore you and I are going to solve a problem here. Not because we want to do it, because it's our fuckin duty to . . . .\"\n\nThe day after this conversation with Zannino, on March 13, Patrizzi disappeared. His decomposed body was found in the trunk of a stolen car on June 11, 1981. As best as could be determined, he had been dead several weeks, and possibly as long as several months.\n\nThe strongest evidence introduced by the government to prove the identities of those responsible for the commission of the murder -- and, in particular, to prove that Simone was a principal in the murder -- consisted of an April 3, 1981 conversation between Zannino and John Cincotti and Ralph Lamattina, two members of the Patriarca Family. Because of the importance of this conversation to the government's case, we reproduce pertinent portions of the transcript:\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nIlario Zannino: Shh. Now shh. Johnny I told you didn't I.\n\nJohn Cincotti: Yeah.\n\nIlario Zannino: About Joe Porter's brother? [e.g., Angelo Patrizzi].\n\nJohn Cincotti: No.\n\nIlario Zannino: Well they clipped him . . . .\n\nRalph Lamattina: Oh, that's it.\n\nIlario Zannino: Don't say a fuckin word now.\n\nJohn Cincotti: Did they find him?\n\nIlario Zannino: No, they didn't find him. They put him in his trunk . . . . Nine of them. Nine of them. They lugged him from the fuckin Topcoat. Nine fuckin guys . . . . He went in for a top coat. And nine of them did it. Sonny did. Sonny Boy. You know all the fuckin camurist [trouble makers]. And he's in his trunk . . . . the super Boss had told me on the QT. Jerry says, \"I gotta tell you something . . . . They clipped Joe Porter's brother.\" . . . . \"Larry, listen to me now.\" \"Listen what?\" He says, \"got him in his fuckin trunk.\" . . . .\n\nRalph Lamattina: It's been ten days.\n\nIlario Zannino: But they got him. They got him. Freddy [e.g., Simone] was scared to death. The kid would have clipped him in two fuckin minutes.\n\nRalph Lamattina: He wanted to clip Freddy. The kid wanted to ahh.\n\nIlario Zannino: Freddy fucked him in the ass.\n\nEven viewing this conversation in the light most favorable to the government, and drawing all legitimate inferences from it, we find the evidence insufficient to prove beyond a reasonable doubt that Simone actually committed, or was a principal in the commission of, the murder of Patrizzi. The conversation establishes only that nine men, including a \"Sonny Boy,\" carried Patrizzi from some place called the \"Topcoat,\" killed him and put him in the trunk of a car. The sole possible reference that could be taken to indicate that Frederick Simone participated as a principal in the murder is the statement by Zannino that \"Freddy fucked him in the ass.\" We assume that this is not to be taken literally but are not sure what it connotes. The most we can legitimately infer is that Patrizzi was killed before he could kill Simone and Frizzi. Whether Simone participated in the actual murder is wholly unclear from the evidence. Indeed, if Simone had participated, it is puzzling why Zannino would refer only to \"Sonny Boy\" by name as one of the nine men at the scene, and not mention Simone as well.\n\nWe are supported in our conclusion by an examination of other cases in which Massachusetts courts\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e have found the evidence insufficient to support murder convictions, despite arguably stronger evidence than existed here. In Commonwealth v. Mazza, 399 Mass. 395, 504 N.E.2d 630 (1987), the victim was found murdered in his jeep in a motel parking lot. Evidence introduced by the prosecution placed the defendant at the parking lot at the approximate time of the killing. The defendant also had a motive (a dispute over a woman) and fled the region after the killing. Still, the court deemed the evidence insufficient to support a conviction for first degree murder, holding that to find the defendant guilty on these facts would require the impermissible piling of inference upon inference. See id. at 631-33; see also Commonwealth v. Salemme, 395 Mass. 594, 481 N.E.2d 471, 475-76 (1985). To find Simone guilty as a principal in the murder of Patrizzi on the evidence introduced here likewise would require the impermissible piling of inference upon inference. Accordingly, we deem the evidence insufficient as to Simone, and thus find it insufficient to convict Granito as an accessory.\n\nThe question now is whether the general nature of the jury's RICO verdict requires that we overturn Granito's RICO convictions as well. The answer to this depends on whether we can conclude with certainty that the jury found that Granito committed two sufficient predicate acts. We can clearly conclude that one predicate act found by the jury was the gambling charge relating to the North Margin Street poker games, because Granito was convicted, under 18 U.S.C. § 1955, on the substantive gambling count corresponding to this predicate act. See Brennan v. United States, 867 F.2d 111, 114-15 (2d Cir.), cert. denied, 490 U.S. 1022, 109 S. Ct. 1750, 104 L. Ed. 2d 187 (1989); United States v. Kragness, 830 F.2d 842, 861 (8th Cir. 1987). Given the proof of this predicate act, to convict Granito on the RICO counts the jury then had to find at least one more predicate act. It must have found Granito guilty of conspiracy, or accessory, or both.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e If the jury found Granito guilty of conspiracy, then the RICO convictions would be valid. Granito has not and, from our review of the evidence, could not challenge the sufficiency of the evidence on conspiracy. The difficult question is: does the insufficiency of the evidence on accessory, combined with the uncertainty as to whether the jury relied on accessory rather than conspiracy in finding two predicate acts, require the overturning of Granito's RICO convictions?\n\nIn answering this question, we begin with the general rule that: \"'a general verdict must be set aside if the jury was instructed that it could rely on any of two or more independent grounds, and one of those grounds is insufficient, because the verdict may have rested exclusively on the insufficient ground.'\" United States v. Ochs, 842 F.2d 515, 520 (1st Cir. 1988) (quoting Zant v. Stephens, 462 U.S. 862, 881, 77 L. Ed. 2d 235, 103 S. Ct. 2733 (1983)). Courts have applied this general rule in the RICO context to vacate RICO convictions where some of the predicate acts charged were insufficient and it could not be determined whether the jury relied on the invalid predicate acts in reaching their convictions. See United States v. Holzer, 840 F.2d 1343, 1352 (7th Cir. 1988); Kragness, 830 F.2d at 861; United States v. Ruggiero, 726 F.2d 913, 921 (2d Cir.), cert. denied, 469 U.S. 831, 105 S. Ct. 118, 83 L. Ed. 2d 60 (1984); United States v. Riccobene, 709 F.2d 214, 227 (3d Cir.), cert. denied, 464 U.S. 849, 78 L. Ed. 2d 145, 104 S. Ct. 157 (1983).\n\nIn United States v. Ochs, however, we noted that an exception to this rule has emerged \"where uncertainty as to the ground upon which the jury relied can be eliminated.\" Ochs, 842 F.2d at 520. We observed that the uncertainty could be eliminated in two situations:\n\n[1] where a verdict based on any ground would mean that the jury found every element necessary to support a conviction on the sufficient ground; or [2] where extrinsic factors in the record make it clear that, although the jury could have relied on an insufficient ground, it did not, in fact, do so.\n\nId. (citations omitted).\n\nThe government invokes the first element of this exception. It argues that reversal of Granito's RICO convictions is not required because, given the facts underlying the charges as well as the nature of the charges, if the jury did convict Granito on the accessory charge, which we have deemed insufficient, they also must have convicted him on the conspiracy charge, which would be sufficient as the second predicate act.\n\nWe agree. Granito's entire argument has as its premise that the jury may have found him guilty on accessory, but not on conspiracy. Under this scenario, his RICO conviction would fall, due to the insufficiency of the accessory charge as a second predicate act. We reject this argument. We find that the jury could not have found Granito guilty as an accessory without also finding every element necessary to convict him on conspiracy. If the jury convicted Granito as an accessory, by finding that Simone was a principal in the Patrizzi murder and that Granito had incited, procured, counseled, hired and commanded Simone to commit the murder, they must necessarily have accepted the government's interpretation of the pertinent tape-recorded conversations involving Simone, Granito, Gennaro Angiulo, and Zannino. These same conversations, and virtually the same government interpretation, were at the heart of the conspiracy charge against Granito, which alleged that Granito had conspired with Zannino, Simone, and Gennaro Angiulo to kill Patrizzi. This charge was supported by sufficient evidence. Because the facts and the elements underlying the two charges were so intertwined, if the jury found Granito guilty as an accessory, they must also have found him guilty of conspiracy. Thus, even though we have found that the accessory charge is insufficiently supported by the evidence and therefore invalid as a predicate act, the nature of the charges and the evidence underlying those charges establishes that the jury necessarily must have found Granito guilty of conspiracy and thus must have found two valid predicate RICO acts. See, e.g., United States v. Corona, 885 F.2d 766, 774-75 (11th Cir. 1989); United States v. Kato, 878 F.2d 267, 270 (9th Cir. 1989); United States v. Doherty, 867 F.2d 47, 57-60 (1st Cir.), cert. denied, 492 U.S. 918, 109 S. Ct. 3243, 106 L. Ed. 2d 590 (1989); United States v. Odom, 858 F.2d 664, 666 n. 1 (11th Cir. 1988); United States v. Jacobs, 475 F.2d 270, 283-84 (2d Cir.), cert. denied, 414 U.S. 821, 94 S. Ct. 116, 38 L. Ed. 2d 53 (1973). Accordingly, there is no uncertainty in the verdict and we uphold Granito's RICO convictions.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nB. North Margin Street Poker Games\n\nGranito also challenges the sufficiency of the evidence supporting his conviction for owning and operating an illegal gambling business -- specifically, the North Margin Street poker games. As with most of the charges, the government's primary evidence consisted of tape-recorded conversations. Viewing the pertinent conversations in the light most favorable to the government, we conclude that the conversations furnish ample support for the jury's verdict.\n\nFrom the conversations, it is clear that Ilario Zannino was in charge of the day-to-day supervision of the North Margin Street poker games. Various others received a percentage of the profits. The games had a bankroll to cover certain operating expenses, such as the payment of winnings. This bankroll had become depleted, due to some players' failure to pay back loans from the house, and to other players' large winnings. In an effort to replenish the bankroll, the operation had temporarily ceased or scaled back the dispersal of its profits to the owners and operators.\n\nGranito apparently did not know of these difficulties with the bankroll, and went to Gennaro Angiulo to ask when the game was going to be \"whacked up\" -- i.e., when the profits were going to be divided and dispersed. Gennaro informed Granito that the profits were being channeled back into the operation to replenish the bankroll, but that he would \"whack up\" the game if Granito desired. Granito responded \"no\" and that he would not have asked if he had known about the difficulties.\n\nThe government relied on the tape recording of this conversation between Granito and Gennaro to support its charge that Granito was receiving a percentage of the profits from the poker games, and thus was guilty of owning and operating an illegal gambling business. Granito's defense to this allegation, as articulated in his closing argument at trial, was that he had only asked Gennaro about the profits as a favor for Nicola Giso. The jury, however, clearly was free to reject this explanation, and it is not our role to second-guess their apparent decision to do so.\n\nAs additional evidence, the government presented the testimony of FBI Agent Eberhart. Testifying as an expert witness on gambling businesses, Eberhart stated his opinion that, based on his analysis of the tapes, Granito was a \"partner\" in the North Margin Street poker games. Although Granito has challenged the permissibility of this testimony, claiming it invaded the province of the jury, we discussed and rejected this challenge in Section IV.A(2), supra. Considering Agent Eberhart's testimony in conjunction with the tape recordings themselves, we find that there was sufficient evidence to support the jury's verdict that Granito was guilty of owning and operating an illegal gambling business.\n\nVI. JURY CHARGE\n\nDefendants claim a number of errors with respect to the trial court's jury charge. We consider each alleged error below.\n\nA. Co-Conspirator Statements\n\nThroughout the course of the trial, numerous co-conspirator statements were introduced against individual defendants on the charges against them. Defendants argue that the trial court failed to apply properly the procedures articulated in United States v. Petrozziello, 548 F.2d 20 (1st Cir. 1977), and its progeny governing the admission of such co-conspirator statements. Specifically, defendants contend that the court's charge to the jury impermissibly placed the admissibility determination in the jury's hands rather than keeping it in the hands of the court.\n\nUnder the Federal Rules of Evidence, it is the responsibility of the judge to determine the admissibility of co-conspirator statements. See, e.g., Bourjaily v. United States, 483 U.S. 171, 175, 97 L. Ed. 2d 144, 107 S. Ct. 2775 (1987). In United States v. Petrozziello, we held that the proper standard for the district court to apply in making this determination is to inquire whether the government has met the requirements of Fed.R.Evid. 801(d)(2)(E) by a preponderance of the evidence. Petrozziello, 548 F.2d at 22-23. Rule 801(d)(2)(E) provides, in pertinent part, that a statement is not hearsay if it is offered against a party and is \"a statement by a coconspirator of a party during the course and in furtherance of the conspiracy.\" We held in Petrozziello that \"if it is more likely than not that the declarant and the defendant were members of a conspiracy when the hearsay statement was made, and that the statement was in furtherance of the conspiracy, the hearsay is admissible.\" Petrozziello, 548 F.2d at 23.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nSubsequently, in United States v. Ciampaglia, 628 F.2d 632 (1st Cir.), cert. denied, 449 U.S. 956, 66 L. Ed. 2d 221, 101 S. Ct. 365 (1980), we articulated fairly detailed procedures for trial courts to employ in admitting co-conspirator statements:\n\nIf the prosecution attempts to introduce into evidence an out-of-court declaration under Fed.R.Evid. 801(d)(2)(E), the trial court, upon proper objection, may conditionally admit the declaration. If the declaration is conditionally admitted, the court should inform the parties on the record out of the hearing of the jury that (a) the prosecution will be required to prove by a preponderance of the evidence that a conspiracy existed, that the declarant and defendant were members of it at the time that the declaration was made, and that the declaration was in furtherance of the conspiracy, (b) that at the close of all the evidence the court will make a final Petrozziello determination for the record, out of the hearing of the jury; and, (c) that if the determination is against admitting the declaration, the court will give a cautionary instruction to the jury, or, upon an appropriate motion, declare a mistrial if the instruction will not suffice to cure any prejudice.\n\nId. at 638. This is the process that defendants claim the court below subverted in its charge to the jury.\n\nTo assess the validity of these allegations, we begin by reviewing the procedures followed by the district court in its treatment of co-conspirator statements. The court admitted co-conspirator statements provisionally throughout the course of the trial. Limiting instructions were given to the jury restricting the evidence to particular defendants and particular charges. At the close of all the evidence, a series of bench hearings were held concerning the court's final Petrozziello determinations, as required by Ciampaglia. The defendants took the position that the court was obligated to go through each tape-recorded conversation with counsel, charge by charge and defendant by defendant, before issuing a final Petrozziello ruling. Over 300 tapes were involved, and the process would have taken days. In an attempt to expedite the matter, the government drew up a list of the statements it was seeking to introduce against each defendant and for what charges. After argument on the government's list, the court issued a written order finding that the Petrozziello requirements were satisfied as to all co-conspirator statements on the list. The defendants raise no objections on appeal to any of the procedures up to this point. Nor do they challenge the merits of the court's final written Petrozziello order.\n\nIn his charge to the jury, the court then gave a general instruction outlining the Petrozziello standard. He stated:\n\nRemember also that there are a number of separate conspiracies charged in the indictment. Statements made by the members of one alleged conspiracy during and in furtherance of that conspiracy cannot be considered in determining whether a particular defendant is guilty of some other conspiracy, unless you should find that such statements also were made during and in furtherance of that other conspiracy by members of that other conspiracy. I shall give you more detailed instructions in this regard near the end of my instructions.\n\n(Emphasis added). In later, more detailed instructions, the court stated:\n\nYou will recall that I orally instructed you on numerous occasions during the course of the trial concerning restrictions on the applicability of various forms of evidence, especially the tape-recorded conversations. In particular, each time the focus of the Government's proof shifted to a different category of offense, you remember that I instructed you as to which of the defendants that evidence was or was not applicable.\n\nI now instruct you that each of these limiting instructions remains in effect . . . . with the following two exceptions.\n\nFirst, in your consideration of whether each of the defendants committed the RICO offenses charged in Counts 1 and 2. You may consider all tape-recorded conversations played at the trial except that the previous limiting instructions shall continue to apply to your determination of whether the Government has proved the elements of each set of racketeering [acts] alleged against each defendant.\n\nSecond. You were instructed on several occasions that none of the taperecorded conversations intercepted at 51 North Margin Street could be considered by you as evidence against the defendants at trial unless and until you received further instructions from me. I now instruct you that you may consider such conversations to the extent that you find them relevant to any charge in the indictment. I caution you in this regard, however, to apply all the principles regarding the use of alleged co-conspirator's statements about which I instructed you earlier. Since none of the defendants is alleged to have been present during these conversations you may consider such evidence only if you first determine beyond a reasonable doubt that they contain statements made during the course of and in furtherance of a conspiracy of which both the speaker and the defendant under your consideration were members.\n\nI further instruct you, however, that you may not consider any statement allegedly made by Ilario Zannino at 51 North Margin Street as constituting proof that Gennaro Angiulo was a co-conspirator in the Barboza murder conspiracy or the Walter or William Bennett murder conspiracies charged in the indictment.\n\n(Emphasis added).\n\nIt is to this portion of the jury charge that defendants direct their objections. They contend that the court should have explicitly gone through its written Petrozziello order with the jury -- tape-recorded conversation by tape-recorded conversation, charge by charge, and defendant by defendant -- instructing them which conversations could be considered against whom and on what charges. In particular, defendants object to the emphasized portions of the instruction, arguing that by outlining the general Petrozziello standard for the jury, the court threw the Petrozziello determination back on the jury to make, contrary to the requirements of Petrozziello, Ciampaglia, and the Federal Rules.\n\nWe disagree. The Petrozziello determination was not simply thrown back to the jury. As the trial court noted in its charge and as we have found in reviewing relevant portions of the record, the court gave the jury limiting instructions with respect to the evidence throughout the course of the trial. These instructions repeatedly limited the admission of particular evidence, including co-conspirator statements, to certain defendants and certain charges. We read the court's written Petrozziello order as, to a large extent, merely finalizing these prior limiting instructions, at least with regard to the conversations forming the heart of the government's case. The order stated:\n\nPursuant to United States v. Ciampaglia, 628 F.2d 632 (1st Cir.), cert. denied, 449 U.S. 956, 66 L. Ed. 2d 221, 101 S. Ct. 365 (1980), this court has admitted on a conditional basis numerous alleged co-conspirator statements offered by the government under Fed.R.Evid. 801(d)(2)(E). Specifically, such statements have been admitted in connection with: (1) the separate conspiracies charged in Counts One, Twelve, Thirteen, Fourteen, Seventeen, and Nineteen; (2) the separate conspiracies charged in predicate acts 5(a)(7) and 5(a)(8); and (3) the separate joint ventures or concerted actions charged in Counts Three, Four, Five, Six, Seven, Sixteen, Eighteen, and Twenty. With regard to each of these sixteen charges, the respective co-conspirator statements so admitted are listed in subparagraph one of the relevant section in the Government's Memorandum Regarding Admissibility of Co-Conspirator Statements (Amended) filed on February 3, 1986.\n\nThe court now finds that the standard of United States v. Petrozziello, 548 F.2d 20 (1st Cir. 1977), has been satisfied with respect to each of these co-conspirator statements. Specifically, with respect to each such statement, the court finds by a preponderance of the available evidence that (1) a conspiracy existed; (2) that the declarant and the defendant or defendants against whom the statement has been admitted were members of the conspiracy at the time the statement was made; and (3) that the statement was made during the course of and in furtherance of that conspiracy. Accordingly, each of these co-conspirator statements, although still restricted to the relevant conspiracy and the respective defendants charged with that conspiracy, shall otherwise be admitted unconditionally.\n\nThe court then explicitly reminded the jury of the prior limiting instructions in his charge. Thus, contrary to defendants' argument, the tapes were not simply thrown to the jury for them to sort through on their own. The jury explicitly was instructed that the court's prior limiting instructions remained in effect and governed their consideration of the tape recordings.\n\nIn reaching this conclusion, we recognize that the North Margin Street tapes were not the subject of the same sort of limiting instructions as were the other tape-recorded conversations. Even the North Margin Street tapes, however, were not simply thrown to the jury. The trial judge specifically instructed, presumably per his Petrozziello determinations, that no statements made by Zannino could be considered as proof that Gennaro Angiulo was a co-conspirator in the Barboza or Bennett murder conspiracies.\n\nIt follows that it was not error for the trial court to have instructed the jury on the general Petrozziello standard. Because limiting instructions already were in place to restrict the jury's consideration of the evidence, providing the jury with the general standard could not prejudice the defendants. Rather, it gave them a second bite at the apple -- a chance to convince the jury, where they had failed to convince the judge, that certain conversations should not be considered. This added layer of fact-finding was not necessary, but neither did it constitute error. See, e.g., United States v. Monaco, 702 F.2d 860, 878 (11th Cir. 1983); United States v. Mastropieri, 685 F.2d 776, 790 (2d Cir.), cert. denied, 459 U.S. 945, 103 S. Ct. 260, 74 L. Ed. 2d 203 (1982); United States v. Bulman, 667 F.2d 1374, 1379 n. 5 (11th Cir.), cert. denied, 456 U.S. 1010, 73 L. Ed. 2d 1307, 102 S. Ct. 2305 (1982); United States v. Fontanez, 628 F.2d 687, 689 (1st Cir. 1980), cert. denied, 450 U.S. 935, 67 L. Ed. 2d 371, 101 S. Ct. 1401 (1981); see also United States v. Izzi, 613 F.2d 1205, 1211 (1st Cir.), cert. denied, 446 U.S. 940, 100 S. Ct. 2162, 64 L. Ed. 2d 793 (1980).\n\nWe acknowledge that we cannot rule out the possibility that the court's limiting instructions during trial did not cover all of the co-conspirator statements. With respect to statements that might not have been covered, the jury would have had to make a Petrozziello determination itself, using the general standard explained to them in the jury charge. The fact that we cannot rule out this possibility, however, does not require reversal where thorough and careful limiting instructions were repeatedly given during trial, and where the jury at least was given the general standard to apply to any conversations that may have been uncovered by the judge's instructions. Cf. United States v. Angiulo, 847 F.2d 956, 970-73 (1st Cir. 1988) (noting, with approval, that the general Petrozziello standard had been given to the jury to limit its consideration of co-conspirator statements).\n\nB. Voice Identification\n\nDefendants next contend that the trial court erred in failing to give an instruction requested by defendants regarding FBI Agent Quinn's testimony identifying defendants' voices in various tape-recorded conversations. Quinn testified at trial concerning the means by which the FBI had acquired, maintained, enhanced, and made transcripts of the audio recordings intercepted at 98 Prince Street and 51 North Margin Street. More importantly, he testified concerning his identification of the various defendants' voices in the tape recordings.\n\nDefendants, for obvious reasons, attempted to cast doubt on this identification testimony. Both during the cross-examination of Quinn and in their opening and closing statements at trial, defendants emphasized the difficulties involved in accurately identifying the voices -- in particular, the difficulties caused by the considerable amount of background noise on the tapes. Their questions on cross-examination also revealed that the government's initial identification of certain voices had been revised.\n\nAt the close of the evidence, the defendants requested the following jury instruction on the issue of voice identification, in order to present to the jury their contention that, contrary to the government's position, some of the voices on crucial tapes could not accurately be identified:\n\nThe testimony of Mr. Quinn as to each of his identifications of the voice of a defendant must be received with caution and scrutinized with care. The government's burden of proof extends to every element of each crime charged, including the burden of proving beyond a reasonable doubt the identity of an alleged perpetrator of an offense.\n\nThe court declined to give this requested instruction specifically, and defendants now argue that this failure deprived them of their right to have the jury instructed on their theory of defense.\n\nAs a general proposition, \"an accused is entitled to an instruction on his theory of defense so long as the theory is a valid one and there is evidence in the record to support it.\" United States v. Rodriguez, 858 F.2d 809, 812 (1st Cir. 1988); see also United States v. Silvestri, 790 F.2d 186, 192 (1st Cir.), cert. denied, 479 U.S. 857, 93 L. Ed. 2d 129, 107 S. Ct. 197 (1986). In determining whether the defendant has satisfied this criteria, the trial court's function is \"to examine the evidence of record and the inferences reasonably to be drawn therefrom to see if the proof, taken most hospitably to the accused, can plausibly support the theory of defense.\" Rodriguez, 858 F.2d at 812. Even then, we have held that:\n\nthe refusal to give a particular requested instruction, however, is reversible error only if \"the instruction (1) is substantively correct; (2) was not substantially covered in the charge actually delivered to the jury; and (3) concerns an important point in the trial so that the failure to give it seriously impaired the defendant's ability to effectively present a given defense.\"\n\nUnited States v. Gibson, 726 F.2d 869, 874 (1st Cir.), cert. denied, 466 U.S. 960, 80 L. Ed. 2d 557, 104 S. Ct. 2174 (1984) (quoting United States v. Grissom, 645 F.2d 461, 464 (5th Cir. 1981)).\n\nApplying these standards to the facts before us, it is clear that the matter of voice identification was of importance to the defendants' defense. Given the amount of background noise on certain tapes as well as Agent Quinn's admission that some voice identifications had been revised, we also find that there was sufficient evidence in the record to support the defense. Thus, as articulated in United States v. Gibson, our inquiry becomes whether the defendants' requested instruction (1) was substantively correct; (2) was not substantially covered in the charge actually given; and (3) was sufficiently important such that the failure to give it impaired the defendants' ability effectively to present their defense.\n\nWe begin by answering the first question in the affirmative. In United States v. Kavanagh, 572 F.2d 9 (1st Cir. 1978), a case involving a challenge to eyewitness identification, we noted that a requested instruction substantially similar to the instruction requested here was appropriate \"in cases where the evidence suggests a possible misidentification.\" Id. at 10.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nWe conclude, however, that defendants have failed to satisfy the remaining two requirements of Gibson. First, we find that a number of the court's general jury instructions, when considered in the context of the charge as a whole, substantially covered the issues raised in the requested voice identification instruction. The court gave a general instruction on witness credibility, informing the jury that they must determine the credibility of all of the evidence and specifically the credibility of each witness' testimony. The court also instructed the jury that the written transcripts of the tape recordings introduced by the government had no independent evidentiary value and were only to be used to help the jury discern the words on the tapes. Finally, the court repeatedly emphasized in its charge the government's burden of proof as to each element of the crimes charged.\n\nThese instructions put the jurors on notice that they were to listen to the tapes themselves and reach their own determinations, and not blindly base their verdict on any interpretation of the tapes by government witnesses or on any government-prepared transcripts. Although Agent Quinn's testimony was not specifically mentioned, the court's general witness credibility instructions emphasized that the jury was to scrutinize all the witnesses' testimony carefully as part of its determination whether the government had satisfied its burden of proof on each element of the crimes charged.\n\nThe sufficiency of these instructions is even more apparent when they are considered in the context of the trial as a whole. In particular, defense counsel focused heavily on the voice identification issue in cross-examining Agent Quinn and also in closing argument. Having heard these defense arguments, a jury receiving the court's general instructions on witness credibility, the government's burden of proof, and the limited purpose of the transcripts would understand that Agent Quinn's testimony was to be scrutinized with care. Cf. United States v. Rubio, 834 F.2d 442, 447 (5th Cir. 1987) (holding that when determining the adequacy of a jury charge, an appellate court should \"look to the record and the closing arguments to place the words of the judge in context.\") We conclude that the court's general jury instructions, when considered in the context of the trial, substantially covered the issues raised in the requested voice identification instruction.\n\nFurthermore, we find under the third prong of the Gibson standard, that the trial court's failure to give the requested instruction did not impair the defendants' ability effectively to present their voice identification defense. During the cross-examination of Agent Quinn, defendants explicitly challenged his ability to identify on the tapes what was said and who was speaking. Similarly, during closing arguments, counsel for Michele and Donato Angiulo stressed the difficulty of identifying voices on the tapes, noted that Agent Quinn had corrected mistakes in some identifications, and urged the jury to question Agent Quinn's ability to identify accurately the defendants' voices. In light of this, we cannot find that defendants were impaired in presenting their voice identification defense to the jury. Consequently, we find no prejudicial error in the court's failure to give defendants' requested instruction. Cf. Kavanagh, 572 F.2d at 12-13 (finding, on similar facts, no error in the trial court's failure to give a requested eyewitness identification instruction).\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nC. Multiple Gambling Businesses\n\nDefendants raise a similar objection to the court's failure to instruct the jurors, as requested, that they could choose to find only one overall gambling business in violation of 18 U.S.C. § 1955, rather than the five separate gambling businesses that the indictment charged in five separate counts. Defendants argued below that the government was charging five separate businesses, rather than one, in order to increase its chances of obtaining guilty verdicts on at least two predicate acts, and thus of obtaining RICO convictions. The jury returned guilty verdicts with respect to four of these businesses: the \"Las Vegas\" nights; the Lowell barbooth games; the numbers business; and the North Margin Street poker games. Defendants now contend that the trial court erred by failing to instruct the jury on defendants' \"one business only\" defense to these multiple charges.\n\nThe same legal standards govern our review of this contention as governed our analysis of defendants' proposed voice identification instruction. Applying these standards, there are two fatal flaws in defendants' argument. First, defendants failed to present sufficient evidentiary support to warrant instructing the jury on their \"one business only\" theory. As we stated previously, \"[a] judge is required to charge on a defense theory only if the evidence provides some foundation for it.\" United States v. Durrani, 835 F.2d 410, 419-20 (2d Cir. 1987); see also Silvestri, 790 F.2d at 192. Defendants have failed to provide such a foundation. They have not pointed to any place in the record, and we have found none, where an evidentiary basis was laid to support the proposition that the gambling operations were so linked as to constitute only one business. At best, they can cite to one short sequence of questions on cross-examination of an FBI agent and one brief comment in the closing argument of defense counsel where reference was made to the \"one business only\" theory. These references, however, were no more than conclusory allegations and insinuations that the government was acting in bad faith and charging five gambling businesses solely to increase its chances of obtaining a guilty verdict on two predicate RICO acts. Defendants offered no evidentiary support for these allegations. This lack of support is in contrast with the government's evidence in favor of finding distinct businesses -- the gambling activities were conducted over different time periods, held in different locations, and operated by different managers and personnel. There was little or no evidentiary grounds to warrant instructing the jury on the \"one business only\" theory. See Rodriguez, 858 F.2d at 815.\n\nFurthermore, even assuming adequate foundation in the record, defendants have failed to show that the \"one business only\" defense played a sufficiently important role in the trial so that the failure to give the requested instruction \"'seriously impaired the defendant's ability to effectively present a given defense.'\" Gibson, 726 F.2d at 874 (quoting Grissom, 645 F.2d at 464). As we have noted, only passing reference was made to the issue at trial.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e The paucity of such references undercuts any argument that the issue was of such importance that the failure specifically to instruct on it seriously impaired a given defense. And the references that were made indicated that the \"one business only\" theory was targeted at undermining any RICO verdict founded solely on gambling predicate acts. Yet, all of the defendants convicted under RICO were found guilty of at least one non-gambling predicate act. This further weakens any contention that the \"one business only\" theory could have played a crucial role in the defenses primarily raised and relied on by defendants. For all these reasons, we find no reversible error in the trial court's failure to instruct the jury on the \"one business only\" theory.\n\nD. Credibility Instructions and Donald Smoot\n\nDefendants contend that the trial court erroneously refused to instruct the jury on general credibility considerations to take into account in evaluating witnesses' testimony and also erroneously failed specifically to name the witness Donald Smoot as an informer.\n\nWith regard to the general credibility instructions, defendants argue that the court should have informed the jury of considerations to be taken into account in evaluating witness credibility. In particular, defendants object to the court's failure to instruct the jury that it should consider a witness' prior inconsistent statements in determining how much weight to accord that witness' testimony.\n\nIn considering such a challenge, there is no reversible error if the jury charge taken as a whole substantially covered the issues contained in the requested instruction. See Gibson, 726 F.2d at 874. After reviewing the court's charge in this case, we conclude that the charge did substantially cover the type of credibility considerations raised by defendants. The court explicitly instructed the jurors that it was entirely their responsibility to determine the credibility of witnesses, and that they could choose not to believe certain witnesses at all. In terms of specific credibility considerations, the court cautioned the jury to scrutinize with particular caution and care the testimony of accomplices and informers, instructing them to consider whether testimony may have been motivated by a desire \"for immunity from punishment or for personal advantage or vindication\" or \"affected by interest or by prejudice against a defendant.\" The court also gave explicit instructions on evaluating expert testimony, advising the jurors that they could accept such testimony, reject it, or give it as much weight as they thought it deserved in light of a particular witness' education and experience.\n\nAlthough the court did not give a specific instruction on prior inconsistent statements, as requested by defendants, this omission cannot constitute reversible error where the jury charge as a whole substantially covered general credibility considerations. See United States v. Williams, 809 F.2d 75, 88 (1st Cir. 1986) (finding no error in the trial court's failure to give a particular credibility instruction where the court had adequately given general credibility instructions), cert. denied, 481 U.S. 1030, 107 S. Ct. 1959, 95 L. Ed. 2d 531 (1987).\n\nDefendants also object to the trial court's failure to name the witness Donald Smoot as an informer. Smoot testified as part of the government's case-in-chief regarding his financial dealings with certain of the defendants -- in particular, a $14,000 loan he had received from Donato Angiulo that the government alleged was an extortionate credit transaction. The defendants characterized Smoot as a government informer and requested the following jury instruction:\n\nThe testimony of one who provides evidence against a Defendant as an informer for pay or for immunity from punishment or for personal advantage or vindication such as Mr. Smoot must always be examined and weighed by the jury with greater care and caution than the testimony of ordinary witnesses.\n\nThe trial court gave this requested instruction almost verbatim, but declined to name Smoot specifically as an informer. Defendants contend that this omission constitutes reversible error.\n\nWe are not persuaded. The trial court gave the heart of the requested instruction and declined only to name names, which was well within its discretion. Because the government disputed the characterization of Smoot as an informer, for the court to have named Smoot specifically would have constituted commenting on the evidence. While the court has sufficient discretion to so comment, it has equally ample discretion not to comment. See United States v. Taylor, 562 F.2d 1345, 1364 \u0026 n. 11 (2d Cir.), cert. denied, 432 U.S. 909, 53 L. Ed. 2d 1083, 97 S. Ct. 2958 (1977). We find no error in the court's decision not to name Smoot specifically as an informer.\n\nE. Extortionate Loans\n\nDefendants' next claim of error pertains to the jury instruction given with respect to count 12 of the indictment, which charged Gennaro, Donato and Francesco Angiulo with conspiring to make an extortionate extension of credit of $14,000 to Donald Smoot. Defendants contend that the court's instruction on count 12 failed adequately to differentiate this alleged $14,000 loan to Smoot from a distinct $14,000 loan to Smoot made by Ilario Zannino. To understand this contention, it is necessary to state the pertinent facts.\n\nCount 11 of the initial indictment charged co-defendant Zannino with making an extortionate $14,000 loan to Donald Smoot. Count 12 of the indictment charged Gennaro, Donato and Francesco Angiulo with making a separate and distinct extortionate loan to Smoot, also in the amount of $14,000. The prosecution's opening statement to the jury referred to both loans. Shortly after opening statements, Zannino's trial was severed from that of his co-defendants due to his ill health. Consequently, count 11 was not submitted to the jury.\n\nThe defendants' defense to count 12 was premised on the argument that only one $14,000 loan to Smoot existed, and it had been made by Zannino, not by the Angiulos. The government contended that two separate and distinct loans existed and introduced evidence supporting the existence of two separate loans. Both the prosecution and the defense argued their respective positions to the jury.\n\nExpressing a concern that the jury would confuse count 11 and 12, and mistakenly return a guilty verdict on count 12 that actually was premised on the Zannino loan, defendants requested an explicit instruction to the jury that count 12 did not charge the Zannino loan. The court declined to give this instruction, and defendants contend that this omission constituted reversible error.\n\nWe disagree. Reviewing the instructions as a whole, as we must, see United States v. Serino, 835 F.2d 924, 930 (1st Cir. 1987), we find that the court's instructions were sufficiently clear to eliminate any likelihood that the jury would confuse the Zannino loan (count 11) with the Angiulo loan (count 12). The court explicitly instructed the jury that counts 7 through 11 had been deleted from the indictment. Furthermore, the court read count 12 to the jury and reviewed each of the elements of the charge. As part of that review, the court explicitly named Gennaro, Donato, and Francesco Angiulo as the individuals being charged with the loan. Finally, the redacted indictment together with written copies of the entire charge were provided to the jury. Given these circumstances, we find it exceedingly difficult to believe that the jury could have been confused about the nature of count 12. Although the court did not give the precise instruction requested by defendants, the careful instructions that were given more than adequately covered the situation.\n\nF. RICO's Pattern of Racketeering Activity\n\nDefendants' final challenge to the jury charge is that the trial court erred in defining \"pattern of racketeering activity\" under RICO. Defendants argue that the court \"failed to tell the jury that 'while two [racketeering] acts are necessary [to constitute a \"pattern\"], they may not be sufficient.'\" Brief for Granito at 44 (quoting Sedima, S.P.R.L. v. Imrex Co., 473 U.S. 479, 496 n. 14, 87 L. Ed. 2d 346, 105 S. Ct. 3275 (1985)). Defendants further contend that the court \"failed to direct the jury's attention to the requirement that the predicate acts be related to each other by some organizing principle that renders them 'ordered' or 'arranged.'\" Id. (citing H.J. Inc. v. Northwestern Bell Tel. Co., 492 U.S. 229, 109 S. Ct. 2893, 106 L. Ed. 2d 195 (1989)).\n\nWhile defendants properly cite Sedima and H.J. Inc. for the proposition that predicate acts must be related to constitute a pattern of racketeering activity under RICO,\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e we do not agree with defendants' argument that the trial court below failed to instruct the jury on this relationship requirement. The court explicitly instructed the jury that to prove a pattern of racketeering activity, the government must show that at least two acts of racketeering were committed and, inter alia, \"that the offenses were connected to each other by some common scheme, plan, or motive and were of sufficient number such that you find that they constituted a planned ongoing continuing crime, in other words, a pattern as opposed to sporadic, unrelated, isolated criminal episodes.\" These instructions, rather than failing to convey the essence of the pattern requirement, presciently anticipated the Supreme Court's language three years later in H.J. Inc. that criminal acts are sufficiently related if they \"'have the same or similar purposes, results, participants, victims, or methods of commission, or otherwise are interrelated by distinguishing characteristics and are not isolated events.'\" H.J. Inc., 109 S. Ct. at 2901 (quoting 18 U.S.C. § 3575(e)). Accordingly, we reject defendants' claim of error.\n\nVII. FORFEITURE\n\nAs part of its overall verdict, the jury returned a special verdict form finding various assets of defendants to be subject to forfeiture pursuant to 18 U.S.C. § 1963. Section 1963 sets forth criminal penalties to be applied to those who have been found guilty, as defendants were, of engaging in racketeering activities in violation of 18 U.S.C. § 1962. The specific forfeiture provisions applied by the jury in this case were § 1963(a)(1) and (a)(2). These provisions state:\n\n(a) Whoever violates any provision of section 1962 of this chapter shall be fined not more than $25,000 or imprisoned not more than twenty years, or both, and shall forfeit to the United States (1) any interest he has acquired or maintained in violation of section 1962, and (2) any interest in, security of, claim against, or property or contractual right of any kind affording a source of influence over, any enterprise which he has established, operated, controlled, conducted, or participated in the conduct of, in violation of section 1962.\n\n18 U.S.C. § 1963 (1982).\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Determining that some assets had been acquired or maintained in violation of (a)(1) and that others had afforded a source of influence under (a)(2), the jury found that several pieces of real estate, a substantial amount of cash, six Chrysler bonds, and a yacht all were subject to forfeiture. The defendants challenge these forfeitures, raising several claims of error.\n\nA. Timing of Ownership\n\nDefendants first contend that the trial court erred in failing to instruct the jury that, before forfeiting an asset on the ground that it provided a source of influence under § 1963(a)(2), the jury had to find initially that the defendant owned the property at issue at the time of indictment. The government responds that its interest in forfeitable property vests at the time of the unlawful activity and cannot be extinguished by a subsequent transfer of the property prior to the indictment.\n\nThe government's position clearly is the accepted view with respect to forfeitures under § 1963(a)(1). Courts that have considered RICO forfeitures in this context have held that RICO forfeiture, unlike forfeiture under other statutes, \"is a sanction against the individual rather than a judgment against the property itself.\" United States v. Ginsburg, 773 F.2d 798, 801 (7th Cir. 1985), cert. denied, 475 U.S. 1011, 89 L. Ed. 2d 302, 106 S. Ct. 1186 (1986); see also United States v. Robilotto, 828 F.2d 940, 948-49 (2d Cir. 1987), cert. denied, 484 U.S. 1011, 98 L. Ed. 2d 662, 108 S. Ct. 711 (1988). Because RICO forfeiture is an in personam action, rather than an in rem action, it has been held that the government's interest in the forfeitable property vests at the time of the unlawful activity and cannot be defeated by the defendants' subsequent transfer of the property. See Ginsburg, 773 F.2d at 801; see also United States v. Navarro-Ordas, 770 F.2d 959, 969-70 (11th Cir. 1985), cert. denied, 475 U.S. 1016, 89 L. Ed. 2d 313, 106 S. Ct. 1200 (1986).\n\nDefendants acknowledge the holdings of these cases but argue that (a)(2) forfeiture should be treated differently from (a)(1) forfeiture. They, however, have cited nothing in the legislative history of RICO or anywhere else to support the proposition that RICO forfeiture under § 1963(a)(2) should be treated as an in rem action, in contrast to forfeiture under (a)(1), which is universally treated as an in personam action. The cases that we have reviewed in the (a)(1) context make no mention of such a distinction, and do not suggest that their in personam reasoning is limited only to (a)(1) forfeiture. Rather, they state that RICO forfeiture, presumably in general, is an in personam sanction. See, e.g., United States v. Conner, 752 F.2d 566, 576 (11th Cir.), cert. denied, 474 U.S. 821, 88 L. Ed. 2d 59, 106 S. Ct. 72 (1985); United States v. Cauble, 706 F.2d 1322, 1349 (5th Cir. 1983), cert. denied, 465 U.S. 1005, 79 L. Ed. 2d 229, 104 S. Ct. 996 (1984).\n\nWe, therefore, reject defendants' contention that (a)(2) forfeiture can only occur when the property was owned at the time of the indictment. Due to the in personam nature of RICO forfeiture, we find that under (a)(2) as well as under (a)(1), the government's interest in the forfeitable property vests at the time of the unlawful activity and cannot be defeated by the defendants' subsequent transfer of the property.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nB. Proportional Forfeiture\n\nDefendants next argue that the trial court erred in failing to instruct the jury that it had the option of only forfeiting a portion of certain amounts of cash that the government sought under § 1963(a)(2), rather than forfeiting the cash on an all or nothing basis. The facts underlying this claim are rather complex, so we state them with some care.\n\nAs discussed earlier, the forfeiture form given to the jury presented only two legal theories under which the jury could find assets subject to forfeiture: (1) assets could be forfeited because they were acquired and maintained in violation of § 1963(a)(1) -- e.g., because they constituted proceeds or profits of an illegal racketeering enterprise; or (2) assets could be forfeited because they afforded a source of influence over an illegal enterprise in violation of § 1963(a)(2). With respect to assets or property that the government sought to forfeit under § 1963(a)(1), the jury received a proportionality instruction. The court instructed it to determine what percentage of the assets or property actually constituted proceeds or profits, and to forfeit only this percentage. With respect to assets or property that the government sought to forfeit as a source of influence under § 1963(a)(2), the court gave a proportionality instruction regarding certain items, but not others. The court declined to give a proportionality instruction with respect to $331,576 in cash that was seized at 98 Prince Street and $41,025 in cash that was seized at 95 Prince Street. As to these items, the jury was to forfeit under § 1963(a)(2) on an all or nothing basis.\n\nIn its forfeiture verdict, the jury found that 50% of the cash described above constituted proceeds or profits under § 1963(a)(1). It also found that the cash afforded a source of influence over the enterprise under § 1963(a)(2). Due to the latter determination, 100% of the cash was ordered forfeited.\n\nDefendants contend that the court erred in forfeiting the cash on an all or nothing basis under § 1963(a)(2). They argue that the jury should have been instructed to apply a proportional forfeiture theory to these assets and to forfeit only that percentage of the cash that actually was used to further the affairs of the enterprise. We agree.\n\nThe types of property interests subject to forfeiture under § 1963 can be divided into two broad categories: (1) interests in a RICO enterprise, and (2) interests outside the enterprise. Any interests in an enterprise, including the enterprise itself, are subject to forfeiture in their entirety, regardless of whether some portion of the enterprise is not tainted by the racketeering activity. As the Ninth Circuit stated in United States v. Busher, 817 F.2d 1409 (9th Cir. 1987): \"Forfeiture is not limited to those assets of a RICO enterprise that are tainted by use in connection with racketeering activity, but rather extends to the convicted person's entire interest in the enterprise.\" Id. at 1413.\n\nThe forfeiture of interests outside the enterprise, however, is subject to limitations. It has been held that the forfeiture of outside interests is subject to a rule of proportionality. See United States v. Porcelli, 865 F.2d 1352, 1362-65 (2d Cir.), cert. denied, 493 U.S. 810, 110 S. Ct. 53, 107 L. Ed. 2d 22 (1989); United States v. Horak, 833 F.2d 1235, 1242-43 (7th Cir. 1987). Such outside interests include proceeds or profits forfeitable under § 1963(a)(1), see, e.g., Horak, 833 F.2d at 1242-43, and also property that affords a source of influence over an enterprise, which is forfeitable under § 1963(a)(2). See Porcelli, 865 F.2d at 1364-65; see also United States v. McKeithen, 822 F.2d 310, 314-15 (2d Cir. 1987) (requiring, under the continuing criminal enterprise statute, 21 U.S.C. § 848(a)(2)(B), proportional forfeiture with respect to property affording a source of influence over an enterprise). Under this proportionality rule, proceeds or profits and property affording a source of influence are only subject to forfeiture to the extent they are tainted by the racketeering activity. This is in contrast to the treatment of interests in an enterprise, which are forfeitable regardless of percentage of taint.\n\nThe court below properly instructed the jury on the proportionality rule regarding \"proceeds or profits\" under § 1963(a)(1). With respect to the $331,576 and $41,025 in cash, however, the court erroneously failed to instruct the jury to apply the proportionality rule regarding \"source of influence\" forfeiture under § 1963(a)(2).\n\nThe government strenuously contends that no such proportionality instruction was required. Our review of the cases cited by the government in support of its contention reveals that these cases refer to the forfeitability of interests in an enterprise, which is not the situation presented here. See, e.g., Busher, 817 F.2d at 1413; Cauble, 706 F.2d at 1349-50. The jury was explicitly instructed to apply the \"source of influence\" forfeiture theory. It was not instructed to consider whether the cash constituted an interest in the enterprise. As we have stated, the \"source of influence\" theory pertains to the forfeiture of interests outside the enterprise, and a proportionality instruction was required. See Porcelli, 865 F.2d at 1364-65.\n\nThe government also argues that the statutory language of § 1963(a)(2) negates the need for a proportionality instruction. It quotes the provision as requiring the forfeiture of \"any interest in . . . . property . . . . of any kind affording a source of influence over\" a RICO enterprise. Brief for Government at 120. (Emphasis added by the government). This is a highly selective statutory excerpt, and omits crucial language and punctuation that serve to delineate the types of interests subject to forfeiture. Quoted correctly, § 1963(a)(2) provides for the forfeiture of \"any interest in, security of, claim against, or property or contractual right of any kind affording a source of influence over, any [RICO] enterprise.\" Interpreted in a manner consistent with its punctuation, this provision first provides for the forfeiture of any interest in an enterprise; these are \"inside\" interests subject to forfeiture regardless of percentage of taint. The provision also separately provides for the forfeiture of property affording a source of influence over an enterprise. We interpret this as referring only to that property that affords a source of influence -- in other words, only that property that is actually tainted.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Viewed this way, the statutory language supports the requirement that a proportionality instruction be given with respect to \"source of influence\" forfeitures. Cf. McKeithen, 822 F.2d at 314-15 (interpreting virtually identical language in the continuing criminal enterprise statute, 21 U.S.C. § 848(a)(2), as requiring a proportionality instruction). Because the trial court failed to give a proportionality instruction with respect to the cash seized, we reverse that part of the judgment forfeiting the cash under a source of influence of theory. Only the 50% of the cash that was forfeited as proceeds or profits was properly forfeited.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nC. Bonds and Yacht\n\nDefendants Donato and Francesco Angiulo next challenge the forfeiture of their ownership interests in the six Chrysler bonds and yacht that were seized by the government. The jury found that 50% of Donato's and Francesco's interests in those items constituted proceeds or profits of the RICO enterprise and thus were subject to forfeiture under § 1963(a)(1). Defendants contest this finding, and argue that according to the indictment and the evidence introduced at trial, they cannot be deemed to have joined the enterprise through the commission of two predicate acts until after the acquisition of the bonds and the yacht. As a result, they say, their interests in these items cannot constitute proceeds or profits resulting from their involvement in the enterprise, and were not properly forfeitable by the jury under § 1963(a)(1). We agree.\n\nTo determine what is properly forfeitable under § 1963(a)(1), courts have applied a \"but for\" test. Under this test, (a)(1) forfeitures are limited to property interests that would not have been acquired or maintained but for the defendant's racketeering activities. See United States v. Ofchinick, 883 F.2d 1172, 1183-84 (3d Cir. 1989), cert. denied, 493 U.S. 1034, 110 S. Ct. 753, 107 L. Ed. 2d 769 (1990); Porcelli, 865 F.2d at 1364-65. To put it another way, defendants' racketeering activities must be shown to be \"a cause in fact of the acquisition or maintenance of these interests or some portion of them.\" United States v. Horak, 833 F.2d 1235, 1243 (7th Cir. 1987). This \"but for\" test is a proportionality rule of forfeiture. Such a rule is applied because, as already discussed, proceeds or profits constitute property interests outside the enterprise and thus are only forfeitable to the extent they are actually tainted by unlawful activities.\n\nFor any property to be forfeitable under this \"but for\" test, the property would have to have been acquired by defendants after the defendants joined the RICO enterprise. If property were acquired before the defendants joined the enterprise, it could not be said that the property would not have been acquired but for the defendants' racketeering activities.\n\nApplying this analysis to the evidence adduced at trial requires that we overturn the forfeiture of Donato's and Francesco's interests in the bonds and yacht. The government's proof at trial established that the Chrysler bonds and the yacht were acquired in 1979 and February, 1980 respectively. The earliest predicate act of racketeering on which Donato was convicted commenced in January, 1981, well after the time of acquisition of the bonds and the yacht. The commission of two such predicate acts is required for conviction as a member of a RICO enterprise. See, e.g., United States v. Friedman, 854 F.2d 535, 562 (2d Cir. 1988), cert. denied, 490 U.S. 1004, 109 S. Ct. 1637, 104 L. Ed. 2d 153 (1989); United States v. Winter, 663 F.2d 1120, 1136 (1st Cir. 1981), cert. denied, 460 U.S. 1011, 75 L. Ed. 2d 479, 103 S. Ct. 1250 (1983). Because Donato had not even committed one act prior to the acquisition of the bonds and the yacht, he cannot be said to have joined the enterprise until after these assets were acquired. For the reasons stated, the \"but for\" test therefore was not satisfied as to Donato's interests in the bonds and yacht.\n\nSimilarly, the \"but for\" test was not satisfied as to Francesco's interests in the bonds and yacht either. We recognize that Francesco was convicted on one predicate act -- operating the Las Vegas nights -- that commenced in June, 1979 and thus occurred prior to the acquisition of the bonds and yacht. The second earliest predicate act, however, was not alleged to have commenced until October, 1980 (the North Margin Street poker games). Because two predicate acts of racketeering are needed to support a defendant's conviction as a member of a RICO enterprise, and because Francesco's second act did not occur until October, 1980, Francesco cannot be deemed to have joined the enterprise until after the bonds and yacht were acquired. Therefore, the bonds and yacht cannot be considered proceeds or profits of Francesco's participation in the enterprise, because he was not a member of the enterprise until after they were acquired.\n\nThe government argues in response that the enterprise began its unlawful activities as early as 1967, well before the bonds and yacht were acquired, and thus it is immaterial that Donato's and Francesco's commission of two racketeering acts occurred after the time of the property's acquisition. The government's theory of forfeiture, however, was that this property constituted the proceeds or profits of defendants' participation in the RICO enterprise. The crucial date, therefore, is when the defendants joined the enterprise, not when the enterprise began its operations. The proof at trial established that Francesco and Donato joined the enterprise after the acquisition of the bonds and yacht. These assets cannot, therefore, have been acquired as a result of Francesco's and Donato's participation in the enterprise.\n\nThe government mentions in passing a final theory that the property was forfeitable because it was maintained as a result of defendants' participation in the enterprise, even though it may not have been acquired as a result of this participation. It is true that § 1963(a)(1) provides for the forfeiture of any property \"acquired or maintained\" as a result of racketeering activities. We recognize that some assets might be maintained as a result of participation in a RICO enterprise even though the timing of their acquisition prevents finding them to have been acquired as a result of such participation. Our review of the record, however, reveals that the government did not argue a maintenance theory to the jury. It argued only an acquisition theory. We must therefore reject the maintenance justification advanced by the government on appeal. We reverse that part of the judgment forfeiting Donato's and Francesco's interests in the Chrysler bonds and the yacht.\n\nD. Cafe Pompeii and Cash\n\nDefendants Gennaro, Donato and Francesco Angiulo challenge the sufficiency of the evidence underlying the forfeiture of their interests in the Cafe Pompeii, located at 280 Hanover Street. Francesco also challenges the sufficiency of the evidence supporting the forfeiture of $41,025 in cash found in his apartment.\n\nThe jury found that the Cafe Pompeii afforded defendants a source of influence over the enterprise and thus was subject to forfeiture under § 1963(a)(2). Defendants do not dispute that the property was properly forfeitable if it was used to further the affairs of the enterprise. See United States v. Zielie, 734 F.2d 1447, 1459 (11th Cir. 1984), cert. denied, 469 U.S. 1189, 83 L. Ed. 2d 964, 105 S. Ct. 957 (1985). Their contention is that the evidence was not sufficient to support a finding that the Cafe Pompeii was so used.\n\nIn considering such a challenge, we must sustain the jury's forfeiture verdict if, viewing the evidence in the light most favorable to the government, there is substantial evidence to support it. See Ofchinick, 883 F.2d at 1177; United States v. Cauble, 706 F.2d 1322, 1349 (5th Cir. 1983). After carefully reviewing the relevant portions of the record, we find that there was sufficient evidence to support forfeiting the defendants' interests in the Cafe Pompeii on the ground that it was used to further the affairs of the enterprise.\n\nTape-recorded conversations revealed that Donato Angiulo met with representatives of the Winter Hill gang to resolve certain misunderstandings that had arisen with respect to some racketeering activities involving the Angiulos and the Winter Hill gang. The conversations referred to these meetings as having taken place at the \"coffee shop.\" Donato related the substance of these meetings to Gennaro Angiulo, and received instructions from Gennaro as to how to handle the matter.\n\nThe defendants acknowledge that these tape-recorded conversations took place, but argue that no evidence was introduced to establish that the \"coffee shop\" referred to in the conversations was indeed the Cafe Pompeii, as the government contends. We disagree. The evidence revealed that in January, 1981, the Cafe Pompeii was cited for various licensing violations. In tape-recorded conversations discussing these violations, defendants referred to the Cafe as the \"coffee shop.\" Thus, the jury could permissibly infer that the \"coffee shop\" and the Cafe Pompeii are one and the same entity. This connection, in turn, establishes that the meetings held by Donato with the Winter Hill gang to resolve \"business\" disputes did indeed occur at the Cafe Pompeii. Such meetings clearly served to further the affairs of the RICO enterprise, and provided sufficient basis for forfeiting the Cafe under § 1963(a)(2). Furthermore, other tape-recorded conversations revealed that Donato met with an individual named Walter LaFreniere in the Cafe. A jury could infer that these conversations related to collection of the weekly payments owed to the enterprise by LaFreniere's father, Louis Venios, as a result of loansharking transactions. All this evidence was more than sufficient to support a jury's finding that the Cafe Pompeii was the \"coffee shop\" and was forfeitable under § 1963(a)(2) on the ground that it furthered the affairs of the enterprise.\n\nFrancesco Angiulo also challenges the sufficiency of the evidence underlying the forfeiture of $41,025 in cash that was found in his apartment by FBI agents during the execution of a search warrant. The jury found that this cash was subject to forfeiture on two grounds. First, 50% of the cash was forfeitable on the ground that it constituted proceeds or profits of racketeering activities under § 1963(a)(1). Second, the cash was forfeitable because it afforded a source of influence over the enterprise under § 1963(a)(2). We already have reversed that part of the forfeiture that was premised on the source of influence theory, due to the trial court's failure to give a proportionality instruction. We now consider whether there was sufficient evidence to support the jury's finding that 50% of the cash was forfeitable as proceeds or profits.\n\nViewing the evidence in the light most favorable to the government, we find sufficient basis to support forfeiting the cash as proceeds or profits of racketeering activity. Ample evidence was introduced at trial to connect Francesco's apartment at 95 Prince Street with the operation of the enterprise's illegal gambling businesses. Government agents testified that an adding machine was found in the apartment -- a discovery consistent with Francesco's role as accountant for the enterprise. Agents also discovered an unauthorized telephone line that had been patched into the apartment, supporting an inference that Francesco was managing illegal operations from the apartment. Furthermore, the jury heard various tape-recorded conversations in which Gennaro Angiulo expressed concern about possible search warrants and ordered their property to be cleaned up so no incriminating evidence would be found. He specifically asked about the existence of \"stuff\" at 95 Prince Street, and later reminded Francesco that if police walked into a private house and found $25,000 in a drawer: \"we got a fuckin problem.\"\n\nThis evidence furnished a more than adequate basis for the jury to conclude that Francesco's apartment was connected with the enterprise's unlawful activities, and that any cash found there was forfeitable under § 1963(a)(1) as proceeds or profits of such activities. We reject Francesco's claim that the evidence was insufficient to support the jury's forfeiture of 50% of the $41,025 in cash found in his apartment.\n\nE. Imposition of Interest\n\nDefendants' final challenge pertains to the trial court's order that defendants must pay interest to the government on certain forfeited real estate. Before beginning our legal analysis, we state the facts and defendants' arguments.\n\nIn its forfeiture verdict, the jury found that 42% of the current fair market value of Gennaro's, Francesco's, and Donato's interests in their Friend and Canal Streets property was forfeitable as proceeds or profits of their racketeering activities under § 1963(a)(1). The Canal Street property had been transferred to the Angiulos by Joseph Palladino. Forty-two percent of the property's market value in 1986 was deemed equivalent to the proceeds or profits realized from a $200,000 extortionate debt owed to the Angiulos by Palladino -- a debt that was cancelled when Palladino transferred the property to the Angiulos.\n\nThe jury's verdict was returned on February 26, 1986. It was not until February 17, 1989, however, that the district court issued its final judgment of forfeiture. At a post-verdict hearing held prior to this final forfeiture judgment, the court entertained suggestions from counsel as to how to treat the forfeitable 42% interest in the property. The government argued that it should receive 42% of the property's value at the time of final judgment rather than 42% of its value at the time of the jury's verdict, especially given the substantial period of time since the jury's verdict. Defendants proposed that the government receive 42% of the property's value at the time of the jury's verdict, plus some recognizable market rate of interest on that amount for the intervening years between the verdict and the final judgment.\n\nThe court selected the latter alternative. It ordered the forfeiture of 42% of the market value of the Canal Street property as of the date of the jury's verdict and also required defendants to pay interest of 8.6% per year on that amount for the period from the date of the jury's verdict to the date of the court's order. Defendants now argue that nothing in the RICO forfeiture statute authorizes the award of such interest and the trial court's imposition of interest should be overturned. We disagree.\n\nFirst, we do not think that defendants can properly challenge on appeal a proposal they themselves offered to the trial court. Having persuaded the court to adopt their proposal, rather than the government's, defendants should not be allowed to circumvent the judicial process by challenging on appeal the trial court's decision to adopt it. Cf. United States v. Rosenthal, 793 F.2d 1214, 1245 (11th Cir. 1986) (stating that appellant could not challenge, on appeal, testimony that his own attorney had elicited at trial), cert. denied, 480 U.S. 919, 94 L. Ed. 2d 692, 107 S. Ct. 1377 (1987); United States v. Truitt, 440 F.2d 1070, 1071 (5th Cir.) (similar), cert. denied, 404 U.S. 847, 30 L. Ed. 2d 84, 92 S. Ct. 150 (1971).\n\nIn any event, we find that the trial court had sufficient discretion to impose interest in order to protect the government's interests in the forfeitable Canal Street property. We recognize that the RICO forfeiture statute does not expressly provide for the imposition of interest. RICO's provisions, however, were intended to be liberally construed to accomplish the statute's objectives. See, e.g., Russello v. United States, 464 U.S. 16, 26-28, 78 L. Ed. 2d 17, 104 S. Ct. 296 (1983); United States v. Lizza Industries Inc., 775 F.2d 492, 498 (2d Cir. 1985), cert. denied, 475 U.S. 1082, 89 L. Ed. 2d 716, 106 S. Ct. 1459 (1986). The forfeiture provision, in particular, constitutes one of the crucial weapons in the RICO arsenal and should be liberally construed to accomplish its purpose of attacking the economic power of illegal enterprises. See Russello, 464 U.S. at 26-28.\n\nEmploying this principle of liberal construction, we uphold the trial court's imposition of interest on the Canal Street property. If interest had not been imposed, the defendants effectively would have been allowed to pocket three years worth of interest earned on a real estate investment that, in large part, was acquired with the proceeds of an extortionate loan. Without the imposition of interest, the three year delay between the verdict and the final forfeiture judgment would have enabled the defendants to continue to realize investment earnings on the profits of their past racketeering activity. This cannot have been the intent of Congress when it drafted the expansive RICO forfeiture provision and urged its liberal construction. We uphold the trial court's imposition of interest as justified to protect the government's interest in forfeitable property and to prevent defendants' continued unlawful gain from that property. But cf. Braxton v. United States, 858 F.2d 650, 655 (11th Cir. 1988) (construing RICO's forfeiture provisions more literally).\n\nVIII. CONCLUSION\n\nWe affirm all of appellants' convictions and sentences.\n\nWe hold that two parts of the forfeiture order must be reversed. That part of the order forfeiting $331,576 and $41,025 in cash on a source of influence theory is reversed due to the trial court's failure to give a proportionality instruction. Fifty percent of this cash was properly forfeited as proceeds or profits of racketeering activity. We do not see how there could be a new trial on this issue without revisiting many of the other issues involved in this complex and lengthy case. We therefore order that fifty percent of the $331,576 be returned to Gennaro, Donato and Francesco Angiulo, and that fifty percent of the $41,025 be returned to Francesco Angiulo. That part of the order forfeiting Donato and Francesco Angiulo's interests in the Chrysler bonds and yacht is reversed for the reasons discussed in the body of the opinion. In all other respects, the forfeiture order is affirmed.\n\nThe case is remanded to the district court for effectuating the forfeiture order.\n\n\u003cspan class=\"fn\"\u003e1. The indictment initially named Vittore Nicolo Angiulo and Ilario M. A. Zannino as additional defendants, but both were severed from the trial due to health problems. Nicolo Angiulo subsequently died, while Zannino was tried separately, and convicted, on three of the original eight counts. Zannino's appeal from these convictions was consolidated with these appeals for purposes of oral argument only, and his convictions have since been affirmed. See United States v. Zannino, 895 F.2d 1 (1st Cir. 1990).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. For an independent discussion of Jason Angiulo's role in running the Las Vegas Nights, see United States v. Angiulo, 847 F.2d 956 (1st Cir.), cert. denied, 488 U.S. 928, 109 S. Ct. 314, 102 L. Ed. 2d 332 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. 18 U.S.C. §§ 1961-1968 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Fed.R.Evid. 705 states: The expert may testify in terms of opinion or inference and give reasons there for without prior disclosure of the underlying facts or data, unless the court requires otherwise. The expert may in any event be required to disclose the underlying facts or data on cross-examination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. For example, during the cross-examination of Nelson, the following exchange took place: Q: Is your opinion as to the roles of these and other individuals based upon the taped conversations which you have reviewed? A: Yes. On further cross-examination: Q: And in connection with the opinions which you have given in this particular case, what was the basis of those opinions? A: The basis was the tapes themselves.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. We note, parenthetically, that any background role played by informant information in this case can be no different than the role played by informant information in Angiulo. The factors underlying Agent Nelson's expertise on La Cosa Nostra have not changed. Thus, we do not find that defendants have isolated any distinction from Angiulo, and for the reasons previously discussed, we conclude that its holding governs here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The testimony was as follows: Q: With respect to Samuel Granito, what, if any, role did he have in the poker game? A: He was a partner in the poker game.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Rule 702 provides: If scientific, technical, or other specialized knowledge will assist the trier of fact to understand the evidence or to determine a fact in issue, a witness qualified as an expert by knowledge, skill, experience, training, or education, may testify thereto in the form of an opinion or otherwise.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Reversal is not always required, however. See Birdman, 602 F.2d at 559-60.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Francesco Angiulo joins in this argument insofar as it pertains to his conviction for operating the North Margin Street poker games.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Granito also was charged with being an accessory before the fact to the murder of Patrizzi, but discussion of this charge is not necessary to the resolution of the severance issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The indictment described Simone as an unindicted co-conspirator in the murder of Patrizzi. Simone's role in the murder was described briefly in our initial discussion of the facts, and will be discussed in greater detail below.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Under RICO, at least two predicate acts are needed to constitute a pattern of racketeering activity. See, e.g., Sedima, S.P.R.L. v. Imrex Co., 473 U.S. 479, 496 n. 14, 87 L. Ed. 2d 346, 105 S. Ct. 3275 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Granito has raised several challenges to the admissibility of this conversation against him. We need not consider these challenges due to our conclusion that even if the conversation is admissible against Granito, the evidence still is insufficient.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. We rely on Massachusetts cases because the predicate crimes of conspiracy to murder and accessory before the fact to murder are state offenses to which the substantive law of the Commonwealth applies.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Conspiracy and accessory are two distinct offenses. That someone may have satisfied all the elements of conspiracy does not necessarily mean that he has satisfied all the elements of accessory. See Commonwealth v. Perry, 357 Mass. 149, 256 N.E.2d 745, 747 (1970). To be found an accessory, one must counsel, hire, or procure a felony to be committed. This \"means something more than mere acquiescence but does not require physical participation, if there is association with the venture and any significant participation in it.\" Commonwealth v. French, 357 Mass. 356, 259 N.E.2d 195, 222 (1970), vacated on other grounds, 408 U.S. 936, 92 S. Ct. 2846, 33 L. Ed. 2d 754 (1972). To prove a conspiracy, one must only show the \"formation of an unlawful agreement or combination.\" See, e.g., Commonwealth v. Cantres, 405 Mass. 238, 540 N.E.2d 149, 153 (1989); Commonwealth v. Pero, 402 Mass. 476, 524 N.E.2d 63, 65 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Gennaro Angiulo joined in this argument by Granito, claiming that his RICO convictions must be overturned due to the insufficiency of the evidence on the accessory charge. We may quickly dispense with this claim. Gennaro was convicted on a number of separately charged substantive counts that corresponded with predicate acts alleged against him under RICO. As a result, there can be no question that the jury found more than two valid predicate acts.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. This inquiry has since become known as \"the Petrozziello determination.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The instruction requested in Kavanagh was worded as follows: testimony of witnesses as to identity must be received with caution and scrutinized with care. The burden of proof of the Government extends to every element of the crime charged, including the burden of proving beyond a reasonable doubt the identity of the perpetrator of the offense for which he stands charged. Kavanagh, 572 F.2d at 11.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. In the analogous context of eyewitness identification, some courts have held that where witness identification is disputed, the trial court must give the jury a cautionary instruction about identification testimony if such an instruction is requested. See, e.g., United States v. Mays, 822 F.2d 793, 798 (8th Cir. 1987); United States v. Anderson, 739 F.2d 1254, 1258 (7th Cir. 1984). In United States v. Kavanagh, 572 F.2d 9, however, we declined to adopt such a rule of per se reversal, choosing not to constrain district courts with yet another mandatory requirement. See id. at 13; see also United States v. Luis, 835 F.2d 37, 41 (2d Cir. 1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Early in the proceedings, defendants did move to dismiss the multiple gambling counts on the ground that only one business was involved and that it violated double jeopardy principles to charge multiple counts. After this motion was denied, defendants dropped the double jeopardy argument. Because defendants' reply brief makes it clear that they are not relying on the double jeopardy argument on appeal, we do not consider it here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. For a more extended discussion of H.J. Inc. and its explanation of RICO's \"pattern of racketeering activity\" element, see our analysis of defendants' void for vagueness challenge to RICO in Section II, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. RICO's forfeiture provisions were amended by Congress in 1984. Pub.L. 98-473, title II, §§ 302, 2301(a)-(c), 98 Stat. 2040, 2192 (1984). For purposes of this appeal, the pre-1984 version is the governing provision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. We note that the 1984 amendments to RICO make it explicitly clear that the government's interest vests at the time of the unlawful activity. See 18 U.S.C. § 1963(c) (1988). While it can be disputed whether the actions of a later Congress provide a valid basis for discerning the intent of an earlier Congress, the 1984 amendments have been interpreted as merely confirming \"the already clearly-established legislative intent behind RICO's forfeiture provision.\" Ginsburg, 773 F.2d at 803.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Contrary to the government's \"quotation,\" the provision nowhere refers to \"any interest in property affording a source of influence.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. As a final argument, the government contends that even under a proportionality theory, the jury could only have found that 100% of the money was used as a source of influence. We are unwilling to engage in that type of speculation, and decline to uphold the 100% forfeiture on this ground.\u003c/span\u003e\n\n",
    "body_length": 172908,
    "citedas": [
      "897 F.2d 1169"
    ],
    "attorneys": "Anthony M. Cardinale for Gennaro Angiulo. Robert L. Sheketoff, with whom Zalkind, Sheketoff, Homan, Rodriguez \u0026 Lunt, was on brief, for Donato Angiulo. James L. Sultan, with whom Charles W. Rankin and Rankin \u0026 Sultan were on brief, for Samuel Granito. Elliot M. Weinstein, for Francesco Angiulo. Henry Katz for Michele Angiulo. Frank J. Marine, Attorney, Department of Justice, with whom Diane M. Kottmyer, Ernest S. DiNisco, Carol Schwartz, Special Attorneys, Department of Justice, and Wayne A. Budd, United States Attorney, were on brief, for the United States.",
    "category": [
      "36",
      "75"
    ],
    "judges": "Bownes, Breyer and Selya, Circuit Judges.",
    "citation_count": 226
  }
}
