{
  "id": "cK4XS2YBTlTomsSBAWlO",
  "document": {
    "title": "10/27/87 GEORGE L. ROBERTSON AND LEAH ROBERTSON v.",
    "full_title": "GEORGE L. ROBERTSON AND LEAH ROBERTSON, HUSBAND AND WIFE v. JAMES L. RICHARDS",
    "jurisdiction": "Idaho Supreme Court",
    "date": "1987-10-27T00:00:00.000Z",
    "docket": "No. 16043",
    "body": "I.\n\nThe primary issue before this Court is whether the correct standard was applied by the trial court in deciding whether a new trial should have been granted. We hold that the district court did not apply the correct standard. Therefore, we reverse and remand for further proceedings. In remanding for further proceedings, this Court does not give specific direction as to whether or not a new trial should be granted, but directs solely as to the standard which should be utilized in making the determination.\n\nLeah Robertson was involved in a car accident and received multiple injuries. She was taken to the emergency room at the Idaho Falls Consolidated Hospital. Dr. Hansen was the doctor in charge when Robertson arrived at the emergency room. Dr. Hansen did a cursory examination and ordered a side-view neck x-ray and chest x-ray. Dr. Hansen called Dr. Richards, the defendant, to do a complete physical examination and dictate a history. He also called Dr. Bjornson to perform an orthopedic evaluation. Dr. Richards testified that he and Dr. Bjornson examined the neck and chest x-ray, and that Bjornson, skilled in the diagnosis of neck injuries, did not indicate any abnormalities in the neck x-ray. Dr. Richards ruled out a broken neck. However, the neck x-ray did not show all seven vertebra. Dr. Bjornson testified that he was not asked to review the neck x-ray and there is conflicting evidence as to whether he did look at it.\n\nThere is also conflicting evidence as to whether reliance upon a single lateral neck x-ray meets the applicable medical standard of care. All of the plaintiff's experts testified that at least five different views of the neck were required before a broken neck could be ruled out. Dr. Richards, himself, admitted at least three views are needed before making a final determination, yet the record reflects that only one view was taken, which fact Dr. Richards knew.\n\nDr. Richards excused his failure to require at least three x-rays by asserting that he had relied upon Dr. Bjornson's expertise to diagnose a broken neck. Dr. Richards argues that his reliance on Bjornson met the required standard of care. Dr. Bjornson, however, testified that he did not assume responsibility for diagnosing the neck injury. This matter was highly contested and a close issue at trial.\n\nThis Court, based upon the record, does not rule on the applicable standard of care, but notes that this issue is one which entitles the trial court to weigh the testimony in making its determination of whether or not to grant a new trial.\n\nRobertson was taken into surgery during which Dr. Richards performed an endotracheal intubation and cleaned and stitched Robertson's facial cuts, while Dr. Bjornson set her broken leg. Prior to the surgery, Dr. Richards ordered the sandbags which had been used by paramedics to prevent neck movement be taken away from Robertson's neck. After the surgery, Dr. Richards claimed he reviewed the neck x-rays with Radiologist Newell Richardson. Richardson did not recall discussing the neck x-ray with Dr. Richards. On the afternoon of March 27th, Richardson reviewed all of the x-rays and dictated an x-ray report. Specific reference to the neck x-ray indicated that the present examination was not satisfactory and additional x-rays were needed.\n\nDuring the next three days, Leah began to exhibit a loss of neurological function. Richards asked Dr. Amick, a Neurologist, to assist with the case. Robertson's condition deteriorated in the ensuing eight weeks. The doctors concluded that Robertson would not be able to be removed from the breathing machine. She could not breathe on her own, she could not move her arms or legs, her eyes were crossed, and she lost bowel and bladder control.\n\nIn mid-May, Richards, as attending physician, advised the family to consider terminating Leah Robertson's life support system.\n\nThe family decided that they wanted a brain scan before making a decision. The CT Scan revealed water on the brain.\n\nDr. Heilbrun, a Neurosurgeon from the University of Utah Hospital, was called in to consult with the Robertson family. In reviewing the medical records, Dr. Heilbrun noted that the x-ray report had recommended additional neck x-rays, but that there had not been any other neck x-rays taken.\n\nAdditional x-rays were then taken and revealed a broken neck. There was a fracture of the odontoid process of C-2 near the base of the skull. The fracture was displaced to the rear 10mm, striking Robertson's spinal cord just below the brain stem. Heilbrun put Robertson in cervical traction to place her spine in the proper position, and the neck fracture was fused. The traction and fusion enabled Robertson to progress to the point of breathing on her own, and she gained the use of her left and right sides; however, due to neurological damage, Robertson's eyes were permanently crossed. At the University of Utah, it was also discovered that Robertson had a broken hip. After three-and-a-half months at the University of Utah Hospital, Robertson returned home. Within five months, Robertson returned to the University of Utah for rehabilitation work; this work enabled Robertson to gain control of her bowels and bladder, and she learned to walk with the aid of a walker.\n\nThe Robertsons brought suit against Dr. Richards and seven other defendants. All of the defendants, except Dr. Richards, were insured by the same company and settled before trial.\n\nThe jury returned a verdict favoring Dr. Richards. The Robertsons moved for judgment notwithstanding the verdict[Footnote 1] or for a new trial. The court denied the motion. The Robertsons now appeal.\n\nIn denying the Robertsons' motion for a new trial, the district court stated in its findings the following:\n\nIn summary the court makes the following findings:\n\nII. That the evidence was conflicting and depending upon the weight and credibility, the jury chose to give to the evidence, they could have gone either way in rendering their verdict. The fact that the court might have differed and would have weighed the evidence in a different way does not open the way for a new trial.\n\nThis finding by the trial court is at issue. We hold that the trial Judge, by failing to recognize his power to evaluate the evidence and determine if a new trial should be granted, applied the wrong standard and thus erred.\n\nThe trial court is given broad discretion in granting a new trial. Jacksha v. Gilbert, 4 Idaho 738, 44 P. 555 (1896). Idaho Rule of Civil Procedure 59(a)(6)[Footnote 2] allows for the granting of a new trial when the Judge determines there is an insufficiency of the evidence to justify the jury's verdict.\n\nIn Quick v. Crane, 111 Idaho 759, 727 P.2d 1187 (1986), this Court described the power which I.R.C.P. Rule 59(a)(6) vests in the trial court in granting a new trial:\n\nIdaho Rule of Civil Procedure 59(a)(6) permits the trial court to grant a new trial on all or part of the issues in an action by reason of the \"[i]nsufficiency of the evidence to justify the verdict or other decision, or that it is against the law.\" It is well established that the trial Judge may grant a new trial based on I.R.C.P. Rule 59(a)(6) where, after he has weighed all the evidence, including his own determination of the credibility of the witnesses, he concludes that the verdict is not in accord with his assessment on the clear weight of the evidence.\n\nSheets v. Agro-West, Inc., 104 Idaho 880, 883, 664 P.2d 787, 790 (Ct.App.1983). Id. 111 Idaho at 766, 727 P.2d at 1194.\n\nIn Blaine v. Byers, 91 Idaho 665, 429 P.2d 397 (1967), this Court formulated a two-pronged analysis which the trial court must use in determining whether to grant a new trial. The Court articulated the aspects of the first prong as follows:\n\nThe rule that where there is any competent evidence, though conflicting, to sustain the verdict, the verdict will not be set aside has no application to a trial court in passing upon a motion for a new trial. Grimm v. Harper, 84 Idaho 220, 370 P.2d 197; Coast Transport v. Stone, 79 Idaho 257, 313 P.2d 1073. See also Warren v. Eshelman, 88 Idaho 496, 401 P.2d 539. Rather the discretion with which the trial Judge is entrusted is a sound legal or judicial discretion, and the trial court may grant a new trial when it is satisfied the verdict is not supported by, or is contrary to, the evidence, or is convinced the verdict is not in accord with the clear weight of the evidence and that the ends of Justice would be subserved by vacating it, or when the verdict is not in accord with either law or Justice. (Citations omitted). Id. 91 Idaho at 670-671, 429 P.2d at 402-03.\n\nThe first prong directs the trial Judge to consider whether the verdict was against the weight of the evidence and if the ends of Justice would be served by vacating the verdict. In Quick, supra, this Court noted that \"the Judge is free to weigh the conflicting evidence for himself.\" 111 Idaho at 767, 727 P.2d at 1194. The Court further emphasized the role the trial Judge plays in preventing a miscarriage of Justice:\n\nThe trial Judge is not required to view the evidence in a light most favorable to the verdict-winner. Although the mere fact that the evidence is in conflict is not enough to set aside the verdict and grant a new trial, when a motion for new trial is based on the ground that the verdict is against the weight of the evidence, the Judge is free to weigh the conflicting evidence for himself. In fact, as Wright \u0026 Miller note in their treatise discussing the similar Federal Rule of Civil Procedure 59, \"the granting of a new trial on the ground that the verdict is against the weight of the evidence 'involves an element of discretion which goes further than the mere sufficiency of the evidence. It embraces all the reasons which inhere in the integrity of the jury system itself.'\" Wright \u0026 Miller, supra § 2806 at 45 (citing Tidewater Oil Co. v. Waller, 302 F.2d 638 (10th Cir.1962)).\n\nThe trial Judge is sitting at the heart of our trial process, a position we on the appellate level cannot duplicate. On the one hand, he does not sit to approve miscarriages of Justice when they occur in his courtroom. His authority to set aside the verdict on a new trial motion is supported by clear precedent at common law. Indeed, far from being a denigration or usurpation of the right to a trial by jury, trial Judges have always been regarded as an integral part of that right. Wright \u0026 Miller, supra § 2806, at 49. On the other hand, respect for the collective wisdom of the jury and the function entrusted to it under our constitution suggests the trial Judge should, in most cases, accept the jury's findings even though he may have doubts about some of their Conclusions. Id. Certainly, all that can be expected of our trial Judges as they exercise their discretion in this area is that they balance these conflicting principles in light of the particular facts of each case. Id. \"If, having given full respect to the jury's findings, the Judge on the entire evidence is left with the definite and firm conviction that a mistake has been committed, it is to be expected that he will grant a new trial.\" Id.; U.S. v. U.S. Gypsum Co., 333 U.S. 364, 68 S.Ct. 525, 92 L.Ed. 746 (1948). Id. 111 Idaho at 767-68, 727 P.2d at 1195-96. (Emphasis added).\n\nThis Court has stated that the trial court has a duty to grant a new trial, even where there is evidence to support the verdict, if the verdict is unjust:\n\nIndeed, it has not only been held that the trial court may set aside a verdict which\n\nis contrary to the evidence, but that there is a positive duty upon the trial court to do so. Deshazer v. Tompkins, 93 Idaho 267, 271, 460 P.2d 402, 406 (1969). (Emphasis in original) (overruled on separate issue in Mann v. Safeway Stores, Inc., 95 Idaho 732, 518 P.2d 1194 (1974)).\n\nIdaho case law makes clear that the trial court has the responsibility to weigh the evidence and make an independent determination as to whether the evidence supports the verdict. Sanchez v. Galey, 112 Idaho 609, 733 P.2d 1234 (1986); Dinneen v. Finch, 100 Idaho 620, 603 P.2d 575 (1979); Meissner v. Smith, 94 Idaho 563, 494 P.2d 567 (1972); Rosenberg v. Toetly, 93 Idaho 135, 456 P.2d 779 (1969); Mendenhall v. MacGregor Triangle Co., 83 Idaho 145, 358 P.2d 860 (1961); Checketts v. Bowman, 70 Idaho 463, 220 P.2d 682 (1950) (overruled on separate issue in Meissner v. Smith, 94 Idaho 563, 494 P.2d 567 (1972)).\n\nThe second prong of Blaine directs the trial court to consider whether a different result would follow in a retrial:\n\nAdditionally, the general rule which prevails in this jurisdiction is that a motion for a new trial should not be granted unless it appears that a different result would follow a retrial. Id. 91 Idaho at 671, 429 P.2d at 403.\n\nAlthough the trial court did not specifically address the second prong because he was not considering and applying the Blaine standard, there is language in his memorandum decision which indicates he might have felt that prong was satisfied:\n\nPlaintiffs claim that the overwhelming weight of evidence produced at trial was that Dr. Richards was at fault, in part at least, in not diagnosing and treating the broken neck. Without question there was evidence presented that would justify a finding of fault on the part of Dr. Richards. If this had been a bench trial, the court could make findings and Conclusion that would support a finding of fault in spite of the testimony of Dr. Hansen, Dr. Fazio, and Dr. Barth.\n\nThe first prong, however, is not addressed by the trial Judge either directly or indirectly because of a mistaken belief that it did not have the power to grant a new trial based upon a reevaluation of the evidence by the bench. The law in Idaho, as stated herein, makes it clear that the district court does have the power to grant a new trial. In Dinneen v. Finch, 100 Idaho 620, 603 P.2d 575, (1979), this Court recognized that a trial court's misconception of the law is an abuse of its discretion:\n\nIt is clear, then, that this court has been consistent in (1) recognizing the trial court's important function in passing on motions for new trial, and (2) upholding the trial court's grant or denial of such a motion unless the trial court has manifestly abused the wide discretion vested in it, or, as in Meissner, supra, misconceived the law, or, as suggested in Blaine v. Byers, supra, unless the trial Judge has applied a \"question of law\" rule to a decision which must be made as question of fact. That doctrine is sound, it is well established, and will be adhered to. Id. at 625, 603 P.2d at 580.\n\nIn assuming that it did not have the power to grant a new trial based upon an independent evaluation of the evidence, the trial court did not apply the correct standard, and thus, abused its discretion. Hence, the trial court's decision is reversed, and the case is remanded for further proceedings consistent herewith.\n\nII.\n\nWe are required to \"pass upon and determine all the questions of law involved in the case presented upon . . . appeal, and necessary to the final determination of the case. I.C. § 1-205;\" Garrett Freightlines, Inc. v. Bannock Paving Co., 112 Idaho 722, 703, 735 P.2d 1033, 1041 (1987). There are several issues raised on appeal involving questions regarding the propriety of the jury instructions and an important evidentiary question which need to be addressed.\n\n(A)\n\nThe appellants have argued that the district court erred in the standard of care\n\nused in the instruction on negligence. The appellants argue that the district court committed reversible error when it rejected their general instruction defining negligence.[Footnote 3] However, I.C. § 6-1012 sets the applicable standard of care in Idaho medical malpractice cases, and the district court's instructions correctly apprised the jury that the defendant was required to meet that standard.[Footnote 4] Where the court's instructions adequately and correctly instruct the jury on the law, no error may be predicated upon failure of the trial court to give a requested instruction. McPheters v. Peterson, 108 Idaho 107, 697 P.2d 447 (1985).\n\nI.C. § 6-1012 states in part that \"individual providers of health care shall be Judged in such cases in comparison with similarly trained and qualified providers of the same class in the same community, taking into account his or her training, experience and fields of medical specialization, if any.\" I.C. § 6-1012 statutorily sets the standard of care in medical malpractice actions. The given instructions were based upon the legislative standards set forth in I.C. § 6-1012, and accordingly there was no error committed by the trial court in the instructions given, or in refusing appellants' requested negligence instructions. McPheters v. Peterson, 108 Idaho 107, 697 P.2d 447 (1985).\n\n(B)\n\nThe record reflects that at the jury instruction conference the parties and the court agreed upon an instruction defining proximate cause, but in the instructions actually read and submitted to the jury that instruction was omitted. The parties are in disagreement as to why the instruction defining proximate cause did not get submitted to the jury. The district court found that the instructions agreed on at the instruction conference were given to the appellants' secretary for typing, and that in the typing process the instruction was lost by the appellants' typist.\n\nWhile the appellants contest the district court's finding of their typist's responsibility for the loss of the instruction, we need not resolve that dispute in order to dispose of the issue. First, the jury, in its special verdict, did not find Dr. Richards negligent, and therefore the issue is essentially moot. The absence of a proximate cause definition does not constitute error where the jury found that no negligence existed on the part of Dr. Richards. It is essential that negligence exists before the proximate cause issue rises. Jones v. Robert E. Bayley Constr. Co., Inc., 36 Wash.App. 357, 674 P.2d 679, 683 (1984) (\"In this case, however, the jury determined by special verdict that Bayley was not negligent, so they did not reach the issue of proximate cause. The error was, therefore, harmless.\").[Footnote 5]\n\nAdditionally, even though the proximate cause definition instruction was inadvertently omitted, after the instructions were read and submitted to the jury, the appellants\n\nhad a duty to timely notify the trial court of the omitted instruction. A litigant may not remain silent as to claimed instructional error after it occurs during the trial, and then later urge his objection to that error for the first time on appeal. Hoppe v. McDonald, 103 Idaho 33, 644 P.2d 355 (1982).\n\nFinally, viewing the existing jury instructions as a whole, we do not believe that the absence of a given instruction defining proximate cause was reversible error in this case. The court's given instructions correctly instructed the jury that \"the plaintiffs have the burden of proving that the negligence of the defendant was a proximate cause of the injury and damage to the plaintiffs, and the amount thereof.\" Instruction 12; Harper v. Hoffman, 95 Idaho 933, 523 P.2d 536 (1974). This Court has stated that in reviewing alleged errors in the jury instructions we must consider the instructions as a whole. Bushong v. Kamiah Grain, Inc., 96 Idaho 659, 534 P.2d 1099 (1975); Holland v. Peterson, 95 Idaho 728, 518 P.2d 1190 (1974). Whether or not the failure to define proximate cause in a jury instruction is error, much less reversible error, is questionable. See Prosser, Proximate Cause in California, 38 Cal.L.R. 369 (1950).[Footnote 6] Several courts have held that the terms \"cause\" and \"proximate cause\" are of sufficiently common usage and understanding and that a jury may be fairly expected to understand them without a definitional instruction. Stoneburner v. Greyhound Corp., 232 Or. 567, 375 P.2d 812, 816 (1962) (\"As a matter of caution, trial courts submit instructions on proximate cause, but such instructions are unnecessary where in the very nature of things the alleged acts of negligence, if true, necessarily formed a part of the efficient cause, and the law itself would draw that inference.\"). See also Quigley v. School Dist. No. 45J3, 251 Or. 452, 446 P.2d 177 (1968). We need not decide in this case that question, however, given the circumstances here where the jury concluded that Dr. Richards was not negligent. Under the circumstances of this case, appellants' assignment of error regarding failure to give an instruction defining proximate cause is without merit.\n\n(C)[Footnote 7]\n\nAppellants also argue that respondent's defense counsel engaged in intentional prejudicial conduct and that such conduct entitled the appellant to a new trial. The conduct complained of by the appellant took place during the cross examination of Dr. Bjornson, who was called as a witness by plaintiffs to support their claim of negligence against the defendant Dr. Richards. The witness, Dr. Bjornson, had also been sued by the plaintiffs, but had settled. When Dr. Bjornson testified that his treatment of the plaintiff was entirely appropriate, the respondent's counsel asked the doctor why then had the Robertsons sued him for $5 million.[Footnote 8] Appellants assert that the\n\nquestion put to Dr. Bjornson violated the strictures of I.C. § 10-111.\n\nA review of the transcript containing the cross examination of Dr. Bjornson makes it abundantly clear that the doctor, by his testimony, was placing responsibility for the failure to discover the neck injury solely on Dr. Richards. As such, Dr. Bjornson's testimony was open to impeachment, and the defense counsel's question, eliciting the fact that Dr. Bjornson had also been sued for $5 million for causing the same injuries that the defendant Dr. Richards was being sued for, was arguably relevant to rebut and impeach the main thrust of Dr. Bjornson's testimony that Dr. Richards was responsible for plaintiffs' injuries. Appellants' argument that I.C. § 10-111[Footnote 9] bars defense counsel's statement misreads the statute. While this section puts strict limits on a party's ability to inform the jury of the amount of damages sought in the action being tried, no such disclosure was made in this case. Rather, the defense attorney's question dealt with the amount of money that Dr. Bjornson had been sued for. That figure involved a separate claim which was not the subject of the action being tried, and therefore the question posed to Dr. Bjornson was not precluded by I.C. § 10-111.\n\nIn Conclusion, on the three other issues raised by the parties on appeal, the trial court did not err. Accordingly, the judgment of the trial court is vacated solely for the purpose of remanding for reconsidering the appellants' motion for new trial, applying the correct legal standard set out in Part I above. Costs to appellant.\n\nDisposition\n\nReversed and remanded for further proceedings.\n\nSHEPARD, Chief Justice, specially Concurring.\n\nI concur with the majority opinion as to Part I only on the basis that it correctly states the present Idaho law relating to the broad discretion vested in a trial Judge to independently evaluate the evidence and override the verdict of jurors. However, I continue to adhere to my views concerning the paramount role of a jury as the trier of fact in civil cases where highly conflicting evidence will support either side, as I have expressed in a series of cases originating with DeShazer v. Tompkins, 93 Idaho 267, 460 P.2d 402 (1969), and continuing through Dinneen v. Finch, 100 Idaho 620, 603 P.2d 575 (1979).\n\nBISTLINE, Justice, Concurring specially.\n\nOf the many issues raised on the appeal, it is my view that one in particular is deserving of special attention and that a proper resolution of this assigned error even were it not coupled with what Justice Huntley has written requires a new trial. The issue is one of inserting prejudice by a highly improper question.\n\nDid defense counsel's statement to the jury that plaintiffs had sued a former co-defendant for $5,000,000 -- the prayer of the Complaint -- require that the trial court grant a mistrial (1) on grounds of\n\nunfair prejudice or (2) pursuant to Idaho Code § 10-111, which prohibits anyone from telling the jury the amount of general damages \"sued for\" and states that a violation \"shall be grounds for mistrial?\" Plaintiffs' Appeal Brief, p. 55.\n\nIn the recent Rojas[Footnote 1] case we were presented with a similar issue. There one of the defendants settled with the plaintiff at the beginning of the second day of trial. The trial court informed the jury:\n\nIn final summation defense counsel utilized the court's statement as a means of persuading the jury of that defendant's negligence being the cause of the minor plaintiff's severe injuries:\n\nNow, you will be asked on the verdict form whether Mr. Marshall was negligent; and I submit to you that he was negligent. And I submit to you that his, his action was what caused this accident. Otherwise why would he have settled?\n\nAnything can hurt you if used improperly. And we submit that the cause of the accident was the improper use of the machine by Kenneth Marshall; and Kenneth Marshall recognized the use of the machine when he injured Pedro Rojas because he settled this case. He got out.\n\nThe opinion for this Court held that failure to object or move for a mistrial did not preserve the issue for appeal, and showed little interest in the earlier views of Justice Bakes[Footnote 2] which were brought forth in my Dissenting opinion.\n\nCounsel for Mrs. Robertson did preserve the issue by a timely objection, and by a motion for mistrial. Unlike the Rojas case, the objectionable question came early in the trial, and it would not have worked an inconvenience to select a new jury and commence anew. Instead the trial proceeded on to a duration of four weeks -- all because the trial Judge entertained a philosophy against granting mistrials in favor of his producing an instruction which would cure the prejudice already instilled in the minds of the jurors.\n\nCounsel for the plaintiffs in their opening appellate brief fairly and accurately report the question, and succeeding events. Before setting it out, it is best to first examine plaintiffs' cause of action for alleged medical malpractice, which was not filed until long after the vehicle collision, and the long period of hospitalization of Mrs. Robertson, her near death and long convalescence.\n\nNamed as defendants were Dr. Richards, Dr. Richardson, Dr. Amick, Dr. Hansen, and Dr. Bjornson, who were thereafter referred to in the complaint, and in the verdict form also, collectively as Health Care Providers, as were the corporations owning and operating the Riverview Hospital and the Parkview Hospital. The Health Care Providers were alleged to be responsible for Mrs. Robertson's diagnosis, treatment, and care of her injuries, she allegedly becoming a patient of all on her admission as an emergency patient.\n\nThe complaint alleged that:\n\nDefendant Health Care Providers, or one or more of them, failed to diagnose the broken neck until May 23, 1981, eight weeks from the date of admission, through such injury was of a type well-known medically to result from the type of head-on collision which had occurred.\n\nDefendant Health Care Providers, or one or more of them, failed to ever diagnose the broken right hip joint, though such injury was of a type well-known medically to result from the type of motor vehicle collision which had occurred.\n\nAt all times material defendant Health Care Providers, or one or more of them, breached their duties and were negligent\n\nin their diagnosis, treatment, and care of Leah Robertson in that they failed to rule out a broken neck and a broken hip joint and therefore failed to provide proper and timely medical, hospital, doctor, and nursing diagnosis, treatment, precautions, and care for her injuries, including, but not limited to, the injuries related to her broken neck and broken right hip joint.\n\nDefendant Health Care Providers, or one or more of them, breached their duties and were negligent in that the treatment and care which they provided resulted in additional injuries to Leah Robertson besides those she had received in the collision, as well as aggravation of the injuries she received in the collision.\n\nIn such circumstances, neither the plaintiffs themselves, nor counsel who undertook their representation could be expected to know or learn who of the Health Care Providers was responsible for the near-fatal diagnosis. Nor could counsel learn the underlying facts until after the lawsuit was filed and discovery was utilized. Depositions were taken of all doctors, including Dr. Bjornson, and there was an abundance of interrogatories. Thereafter there were various dismissals entered of record, presumably upon the basis of the results of discovery.\n\nReturning to the issue of alleged prejudicial misconduct on the part of defense counsel, as portrayed in the plaintiffs' brief:\n\nPlaintiffs called Dr. Bjornson as a fact witness and he gave the same testimony at trial that he did in his deposition. Tr. II, 416-418, 420, 435, 449-451, 460-461.\n\nOn cross-examination of Dr. Bjornson by Mr. Quane, the following occurred:\n\nQ: To your knowledge, did your treatment of the fractures turn out okay, of her lower leg fractures?\n\nA: I believe the fracture united, but that was after she left the hospital.\n\nQ: But as far as you understand, she had a good recovery from the fracture?\n\nA: The fracture united. I don't know about her function.\n\nQ: You haven't seen her since she was transported to the Salt Lake City, have you?\n\nA: No, sir.\n\nQ: Do you have any reason to believe that your reduction of the fractures was in any way inappropriate?\n\nA: No.\n\nQ: Do you feel that your care of her fractures was appropriate?\n\nA: Yes, sir.\n\nTr. II, 471:7-25.\n\nAt this point, Mr. Quane, raised out of his seat to his full posture and with as much drama, emphasis, and accusatory power as could be mustered, he forcefully declared:\n\nQ: If that's the case, Dr. Bjornson, can you explain to the ladies and gentlemen on the jury why Mr. and Mrs. Leah Robertson sued you for 5 million dollars in this case ? Tr. II, 472:1-4. (Emphasis added.)\n\nIt was as if a wave of emotional accusation swept over the countenance of the jury. A loud bell of prejudice had intentionally been rung and the jury had heard.\n\nMr. Quane's statement would obviously cause a multitude of questions to arise in any juror's mind, including:\n\n1. Why did the Robertsons sue Dr. Bjornson for $5,000,000?\n\n2. Why isn't Dr. Bjornson still a defendant in this case?\n\n3. How many other lawsuits against doctors have the Robertsons filed?\n\n4. How much money have the Robertsons already received from other doctors, including Dr. Bjornson?\n\nIt is also foreseeable that jurors unfamiliar with civil lawsuits and settlements would reach the following prejudicial Conclusions:\n\n1. If Dr. Bjornson is no longer a defendant, the Robertsons must have either received $5,000,000 to settle his case or received a jury verdict against him for $5,000,000.\n\n2. If the Robertsons sued Dr. Bjornson for $5,000,000 and received it, that\n\nmust indicate the failure to diagnose the broken neck was Dr. Bjornson's fault and not Dr. Richards' fault.\n\n3. The Robertsons are greedily trying to make as much money from this case as possible. They already have $5,000,000 from Dr. Bjornson and now they are trying to get more money from Dr. Richards.\n\nMr. Quane obviously wanted to raise those questions and Conclusions in the minds of the jury and that is why he intentionally inserted the $5,000,000 figure into his question.\n\nAll of the speculation triggered by such a prejudicial question was detrimental to Plaintiffs and a fair trial; but all speculation benefitted the defense.\n\nAccordingly, Plaintiffs objected and immediately moved for a mistrial, costs and attorney fees on grounds of extreme unfair prejudice and pursuant to Idaho Code § 10-111. Tr. II, 473, 478, 491. The statute provides in part:\n\nIn any civil action for damages, the amount of general damages sued for shall not be disclosed to the jury by court, counsel, or any party, and it shall be grounds for mistrial for any person to violate the prohibition of this act whether by specific statements or generalized argument. Idaho Code § 10-111.\n\nWhen plaintiffs stated to the lower court that Mr. Quane's question was not a fluke or mistake, but was planned and calculated to cause prejudice for whatever advantage could be gained, Mr. Quane, without apology for flagrant violation of the statute, admitted:\n\nI planned it, your Honor, because it was legitimate as impeachment of the plaintiffs in my opinion, and I intend to impeach the plaintiffs by the Complaint if I can get to that point in the trial. Tr. II, 485:23. (Emphasis added.)\n\nBrushing aside the statute's prohibition, defense counsel justified his misconduct by claiming that according to \"Bells Handbook\" he was entitled to prove Dr. Bjornson's negligence and impeach the Robertsons by showing the jury that the Robertsons had previously alleged Dr. Bjornson was negligent in the Complaint. Tr. II, 474:20, 477:5, 479:21.\n\nMr. Quane also argued the mere fact Dr. Bjornson had been sued was relevant to show his bias against Dr. Richards. Tr. II, 475:7, 21. He never even attempted to explain that non sequitur.\n\nUltimately, the court sustained the objection to the question and stated that the question was improper. Tr. II, 489:21-24. However, notwithstanding the clear language of Idaho Code § 10-111, the court erroneously ruled it did not control the decision on whether to grant a mistrial! Tr. II, 484:16. The Court denied the motion for a mistrial, and said it would attempt to correct the prejudice with an instruction to the jury, although it recognized there was a substantial risk the instruction would make things worse. Tr. II, 489:12-18. After the lengthy recess, the court stated:\n\nI am going to give you an instruction at this time, and I'll state it to you, ladies and gentlemen of the jury, a question has been asked this doctor why he had been sued by the plaintiffs. The Court must be cautious in making any statement as to the procedures or approaches of a party who brings a lawsuit. But it is a fact that multiple parties may be named in a lawsuit, but at trial the claim may be only against part of any parties originally named. At this point of the trial it's extremely immaterial that Dr. Bjornson may have been named as a party.\n\nTherefore, I instruct you that the statement in its entirety should be disregarded by you. You need to cast it from your minds and not let it play any part in your deliberations in this case, and not have any bearing on your decision in the case. It should not be given any weight.\n\nI hope, with that instruction that you will be able to decide this case on its merits, and we'll go ahead with the trial. Tr. II, 491:23-492:17. (Emphasis added.)\n\nAfter Plaintiffs' request for mistrial was denied, it was hoped that the length of the\n\ntrial would have a healing effect and that the $5,000,000 question would fade with the weeks of intermittent testimony. However, on the following morning, defense counsel once again argued in chambers that he was entitled to ask Dr. Bjornson whether he was a defendant at the time of his deposition and at the time of trial, in order to show bias and prejudice by Dr. Bjornson against Dr. Richards and inconsistency in Bjornson's testimony. This conference was not reported but it is recalled by all counsel. R. II, 343 para. 7, Tr. XVII, 3507:9-17, Memorandum in Opposition to Plaintiffs' Motion for Judgment Notwithstanding the Verdict or for New Trial, p. 9, Exhibit to Appeal Record.\n\nPlaintiffs agreed that such testimony under some circumstances might be relevant to show bias or inconsistency. However, plaintiffs argued that there was nothing to even hint at actual bias or inconsistency by Dr. Bjornson, and even if there were, admission of the evidence would be outweighed by the unfair prejudicial effect of indirectly disclosing to the jury that Dr. Bjornson had settled. The court ruled in chambers that defense counsel would be permitted to ask Dr. Bjornson if he had been a defendant at the time of his deposition and if he was still a defendant. Tr. XVII, 3507:9-17; Affidavit of DaLon Esplin para. 12.\n\nBecause of the chambers ruling, no objection was made when the evidence came in, in order to call less attention to it. Tr. III, 565:7-17. However, to prevent improper argument and similar testimony by other former defendant doctors, plaintiffs subsequently filed a Motion in Limine. R. I, 269; Tr. 810-813.\n\nThroughout the rest of the trial, Mr. Quane sought to prove the negligence of Dr. Bjornson by circumventing the expert testimony requirements of Idaho Code § 6-1013 and introducing the opinions, statements, and conduct of the Robertsons and their counsel set forth in the Complaint and Answers to Interrogatories. Tr. VIII, 1702-1703; Tr. X, 2075-2081; Tr. XV, 3078-3080. That prompted another Motion in Limine. R. I, 225. Argument on these issues reveals the real reason defense counsel wanted to get Dr. Bjornson's status as a former defendant before the jury was to create the improper impression that Dr. Bjornson was negligent simply because he had been sued by the Robertsons.\n\n[I]'m certainly entitled to prove what they [Robertsons] contend he [Dr. Bjornson] did, that he came to the emergency room and didn't diagnose her neck fracture. They have said that. And I'm entitled to prove that. Tr. X, 2081:19-23.\n\nThe trial court correctly ruled that allegations in the pleadings were improper evidence in a medical malpractice case since negligence of any doctor could only be established by expert testimony, and the Robertsons' allegations were not authoritative. Tr. X, 2078-2080; Tr. XV, 3080:13-23.\n\nAs the trial came to a close, Mr. Quane's deliberate effort to once again get the $5,000,000 before the jury was revealed by Defendant's Requested Jury Instruction Number 32. That instruction would have again specifically called the jury's attention to the $5,000,000 prayer in the Complaint. The instruction even asked the jury to disregard the court's prior instruction:\n\nI previously instructed you to disregard in your determinations the question propounded to Dr. Bjornson, Plaintiffs' witness, by Defendant's Counsel, which stated: \"Explain to the jury, then, why George and Leah Robertson sued you for over $5,000,000 for failing to diagnose the fractured odontoid process.\" This instruction is withdrawn. You may consider in your determinations that the fact that Dr. Bjornson was at one time a defendant in this matter, and gave certain testimony in his deposition that may be interpreted to be inconsistent with the testimony he gave at trial. This evidence has been admitted.\n\nR. III, 38. (Emphasis added.)\n\nThe court properly refused the instruction. However, during closing, Mr. Quane again brought the pleadings before the jury by arguing that Dr. Bjornson must be negligent because the Robertsons sued him and he settled:\n\nWell, I think the proof in the pudding, the real proof in the pudding, regardless of what Mr. Peck says, relates to the fact that Dr. Donald Bjornson was a defendant. And he was sued by Leah and George Robertson.\n\nWhy would they sue him? If, as they claim now, now, that he came to the emergency room only for the purpose of fixing a fractured leg and he had absolutely nothing to do with the treatment of her neck. To me that's the acid proof of why Dr. Bjornson was in the emergency room.\n\nBut really don't actions speak louder than words?\n\nTr. XVIII, 3503:8-3504:12. (Emphasis added.)\n\nThe trial transcript shows Mr. Quane continued to belabor the point until the trial court sensed the prejudice and the court interrupted. The following argument ensued in front of the jury:\n\nTHE COURT: Mr. Quane, I guess I am going to have to interrupt at this point. Early in this trial the Court made a -- gave an instruction from the bench, and it was in regard to the questions propounded to Dr. Bjornson in regard to him having been sued. And I told the jury at that time to disregard that question and the answer in its entirety. I told them that it was not to have any bearing on their decision in the case, and it should not be given any weight. And I think to bring it up now takes away from that instruction.\n\nMR. QUANE: Your Honor, the next day, though, you allowed me, and counsel agreed, that I could ask him if he was a defendant when he testified in his deposition and he wasn't when he testified in court. And that's why I am basing this --\n\nTHE COURT: I mean, I would have to remind the jury that that was my instruction. That . . .\n\nMR. QUANE: Well --\n\nTHE COURT: Does not have any bearing in this case, and I told them to no -- well, not to consider it.\n\nMR. QUANE: Well, your Honor, it came in the next day without objection from them and by agreement of everybody including the Court. You said I could ask that question if you recall.\n\nTHE COURT: No, I don't recall that.\n\nMR. QUANE: Well . . . Your Honor, you said I could ask him on the witness stand if he was a defendant when he testified in his deposition, and that he wasn't a defendant in the case when he testified in court. And that came without objection, your Honor, and this is damaging to me to have this come up like this.\n\nAnd I represent to the Court that that was the ruling.\n\nTHE COURT: I don't know if we can find it in the record. We might take a search.\n\nMR. QUANE: They didn't object.\n\nMR. PECK: Your Honor, the reason I am not responding is because I don't think it's proper in front of the jury to argue my case or argue the motion.\n\nMR. QUANE: I am sorry, but it just startled me.\n\nMR. PECK: It is okay. I am just not going to talk about what was discussed in chambers.\n\nMR. QUANE: It came in without objection. You will agree with that, Mr. Peck?\n\nMR. PECK: I am not going to comment on it in front of the jury.\n\nMR. QUANE: Your Honor, I think -- I think I'm entitled because you brought this up in this fashion, and I would like to have a recess and take it out of the record because it did.\n\nTHE COURT: Well, let's take a short recess at this time, ladies and gentlemen of the jury; remember the admonition previously given; go ahead and file out. Tr. XVII, 3506-3508. (Emphasis added.)\n\nThe jury was once again ushered out of the courtroom and on their return, the court instructed the jury that they had previously been told to disregard the improper question, but now they could consider Dr. Bjornson's defendant status in their\n\ndeliberations since that evidence had come in subsequently. The court did not limit the argument to the purpose of showing bias or inconsistency by Dr. Bjornson, but allowed it to be used for the improper inference that Dr. Bjornson was negligent because he had been sued and settled:\n\nTHE COURT: Jury is back in place after a short recess.\n\nThe Court needs to make a short explanation to you. It's become necessary for the Court to make some check on the record as to some of the procedures that took place in initial court proceedings. And I apologize to Mr. Quane. I interrupted him and stopped the flow of his argument. But the Court did give you an earlier instruction in this case when a question was directed by Dr. Bjornson about why he had been sued by the Robertsons. The Court feels that it must make some additional remarks from the bench.\n\nI told you at that time that it was entirely immaterial that Dr. Bjornson may have been sued. The next day the Doctor was asked whether he was a defendant in the suit when he gave his deposition, and that was allowed. Since that evidence did come in and was allowed, Counsel is entitled to discuss it in his closing arguments.\n\n\"So I apologize. My apologies to you Mr. Quane, and the Court did feel it necessary to do some checking in the record on that. But it did come in the next day.\" Tr. XVIII, 3508:18-3509:16. (Emphasis added.)\n\nThe incident thus graphically re-emphasized in the jury's mind Mr. Quane's improper $5,000,000 question just before the jury's deliberations.\n\nDefense counsel ended with another powerful yet prejudicial and improper inference of Dr. Bjornson's \"guilt\" because he had settled and was no longer \"fighting\" the case:\n\nAnd I think it would be an unequivocal distortion of Justice and an absolute falsery to say on that verdict form that Jim Richards was negligent and to condemn him. All he has is his practice and his pride, and this man has sat here for four weeks fighting this case and fighting. He can't even practice medicine, but he's here and he's fighting.\n\nDr. Donald Bjornson isn't fighting. He isn't here in this court, and he isn't defending. I think his [Richards'] will-ingness to do this emphasizes his sincere and unabiding belief in his innocence. And if he's guilty of anything, he's guilty of saving her life.\n\nTr. XVIII, 3550:24-3551:12. (Emphasis added.)\n\nThe jury returned a verdict attributing no liability to Dr. Richards.\n\nA. The combination of defense counsel telling the jury that the Robertsons had sued a former co-defendant, Dr. Bjornson, for $5,000,000, and its re-emphasis by defense counsel and the court during closing argument, resulted in a violation of Idaho Code § 10-111 and incurable prejudice.\n\nThere was no legitimate reason for defense counsel to tell the jury that $5,000,000 was the amount for which the Robertsons had sued Dr. Bjornson. During the arguments on plaintiffs' Motions for mistrial and for a new trial, counsel for defendant was unable to articulate a justification for revealing the $5,000,000 amount, although he readily admitted he had planned the question in advance. Tr. II, 485:23.\n\nOnce the jury heard the $5,000,000 figure, the prejudicial questions and Conclusions that naturally arose in their minds were so fixed that they could not be cast aside or ignored based on any instruction by the Court.\n\nPlaintiffs were unfairly prejudiced because they were in the awkward position of not being able to correct the jury's improper Conclusions by telling the whole story. Complete disclosure of the settlements with the other doctors, which were made for nominal amounts early in the litigation, would have had an equally powerful prejudicial influence upon the jury to either absolve Dr. Richards of all liability or adjust the damage award to be in line with the earlier settlements, when in fact, those settlements\n\ndid not accurately reflect the true damages. As other courts note:\n\nA jury might conclude that the settling Defendant was the party primarily responsible for the injury, and that the remaining Defendants should therefore be exonerated. De Lude v. Rimek, 351 Ill.App. 466, 473, 115 N.E.2d 561, 565 (1953). It might take the amount of a settlement as a measure of the Plaintiff's damages. Orr v. Coleman, supra, 455 S.W.2d at 61. It might consider one Defendant's settlement to be an admission of negligence, and then impute this negligence to a non-settling defendant. Azure v. City of Billings, [182 Mont. 234] 596 P.2d 460, 466 (1979). Slayton v. Ford Motor Company, [140 Vt. 27] 435 A.2d 946, 947 (1981).\n\nIn Young v. Verson All Steel Press Company, 539 F.Supp. 193 (E.D.Penn.1982), the Court refused to allow a settlement to go before the jury, noting that:\n\n\"Implicit in Federal's position must be the belief that a jury will be less likely to render a large damage award if they are aware that plaintiff has already been compensated by former Co-Defendant, viz Verson \". 539 F.Supp. at 194.\n\nThe trial court's attempt to cure the prejudice in this case actually emphasized it. The objection, the lengthy recess, and the initial instruction by the court to disregard the question, naturally raised in the minds of the jury the feeling that they had not heard the whole story and that Plaintiffs were keeping from them something important related to the $5,000,000 question. This is the very quality that requires reversal:\n\nIt seems to be the invariable quality of questions the asking of which may require a reversal that in themselves, and without any answers made, they call to the attention of, or suggest to, the jury some fact or claim prejudicial to the opposite party and concerning which counsel has no right to inquire, and in almost every instance of such misconduct, opposing counsel is necessarily placed in the false light of suppressing significant circumstances and attempting to deceive the jury into rendering an unjust verdict.\n\n75 Am.Jur.2d, \"Trial,\" § 194, p. 277 (1974); See also, Thomas v. Byron Tp., 168 Michigan 593, 134 N.W. 1021, 1023 (1912); Myers v. Moffett, 312 S.W.2d 59, 64 (Mo.1958).\n\nThis case illustrates why a violation of Idaho Code § 10-111 is mandatory grounds for mistrial; it creates prejudice not capable of being corrected. The court's initial instruction only addressed the issue of Dr. Bjornson's status as a former defendant. It did nothing to dispel counsel's inferrence that $5,000,000 had been obtained from Dr. Bjornson. When the whole issue was brought up again in closing argument, the court revoked its initial instruction, leaving the jury with the impression they could consider the improper question for purposes of liability and negating any cure that may have existed.\n\nIdaho Code § 10-111 prohibits anyone from disclosing to the jury the amount of damages sued for in a civil case so the amount will not have an influence on the jury in resolving the factual issues, including liability. Once the statute has been violated, attempts to correct it only re-emphasize the improper influences raised in the jurors' minds, so a mistrial is the only remedy. Idaho Code § 10-111 states:\n\nIn any civil action for damages, the amount of general damages sued for shall not be disclosed to the jury by court, counsel, or any party, and it shall be grounds for mistrial for any person to violate the prohibition of this act whether by specific statements or generalized argument. In furtherance of the provisions of this act, it is declared that it is the exclusive province of the jury in a civil action for money damages involving allegations of general damages to resolve such issues of fact and it is against the policy of the state of Idaho for the jurors required to make such determinations to be informed of the particulars of allegations of damages in the pleadings on file with the court, by the arguments of counsel or otherwise, the dollar amount\n\nappraisal or evaluation of such damages being the exclusive province of the trier of fact; provided, this act shall not be construed to prohibit proof of damages or presentation of arguments which are legally relevant and proper in view of the record and issues before the court in any action for money damages.\n\nIdaho Code § 10-111. (Emphasis added.)\n\nAlthough this statute has previously been referred to by the Idaho Supreme Court, it has not yet been interpreted. This is a case of first impression. Leliefeld v. Johnson, 104 Idaho 357, 659 P.2d 111 (1983); Yacht Club Sales and Service, Inc. v. First National Bank of Idaho, 101 Idaho 852, 623 P.2d 464 (1980).\n\nIdaho Code § 10-111 originated as House Bill 474 in 1976 with a package of House bills related to medical malpractice backed by the Idaho Medical Association and the Idaho Hospital Association. It is interesting that Dr. Donald Bjornson, as President-elect of the IMA, addressed a Joint Meeting of House Committees in support of the bills as short-term solutions to the \"malpractice crisis.\" At the same hearing, Eugene Thomas, attorney for the IMA explained the bills were designed to speak to the \"sky-rocketing cost of insurance to doctors and hospitals\" and create a \"climate conducive to competition in the insurance field which will result in insurance at a fair price.\" He also discussed the reason for House Bill 474:\n\nMr. Thomas explained that this bill would provide the means whereby a jury could render a verdict on the basis of the evidence rather than being influenced by the amount of the damages being sued for. Minutes of the Joint Meeting of the Idaho House Judiciary, Rules and Administration Committee, and Health and Welfare Committee, p. 2 (February 5, 1976). (Emphasis added.)\n\nMr. Thomas explained that this restriction provides that the portion of the complaint setting forth the dollar amount (the \"ad damnum\" portion) will not be allowed in the trial. The reason is that the insurance industry feels it distorts the jury's view of the case.\n\nMinutes of Idaho House Health and Welfare Committee, p. 1 (January 30, 1976).\n\nThe statute also protects the policy of Idaho law to encourage settlements. Rojas v. Lindsay Manufacturing Co., 108 Idaho 590, 592, 701 P.2d 210 (1985). One-sided application of the statute would discourage settlements in cases with multiple defendants and, thus, be contrary to the statute's purpose for reducing medical malpractice insurance costs.\n\nMr. Quane's intentional, inflammatory, and unfair tactic to violate the statute and confuse and unfairly prejudice the jury should not be tolerated. It must be controlled by the swift and firm application of Idaho Code § 10-111, which requires a mistrial and leaves no discretion to the trial court Judge. A new trial is required pursuant to Idaho Rules of Civil Procedure 59(a)(1) because this \"irregularity in the proceedings\" prevented the Robertsons \"from having a fair trial.\"\n\nIn addition, since the Plaintiffs have been required to try the case to completion and incur tremendous expenses and costs, the court should award costs and attorney's fees against defendant pursuant to Idaho Code § 12-121 and Idaho Rule of Civil Procedure 54(e). The intentional violation of Idaho Code § 10-111 was an unreasonable bad faith defense of this case and justifies an award of attorney's fees both at the trial level and on this appeal.\n\nB. Evidence that Dr. Bjornson had been sued and had settled was unfairly prejudicial and was used for the improper purpose of establishing Bjornson's liability and Richard's freedom from fault.\n\nAccording to defense counsel, the evidence that Dr. Bjornson had been sued by Robertsons and had settled prior to trial was relevant for three reasons: (1) to show that the Robertsons had changed their position concerning Dr. Bjornson's responsibility for failure to diagnose Leah's injuries, Tr. II, 477:5; (2) to show that because Dr. Bjornson had also been a defendant his testimony was biased, Tr. II, 475:7; and (3)\n\nto show that inconsistency between Dr. Bjornson's deposition testimony and his trial testimony was the result of his having settled the case. Tr. XVII, 2504:13-18.\n\nThe first reason was nothing more than an attempt to prove Dr. Bjornson's liability and Dr. Richards' lack of liability by inference from the Robertsons' conduct in bringing suit and later settling. As such, the evidence was clearly inadmissible under the approach of Federal Rule of Evidence 408 adopted by Idaho in Hatfield v. Max Rouse \u0026 Sons N.W., 100 Idaho 840, 606 P.2d 944 (1980). Since the trial, an identical rule has been promulgated as Idaho Rule of Evidence 408.\n\nThe rule prohibits admission of the conduct of the parties in compromise negotiations for the purpose of proving liability. This modern approach was adopted because it encourages negotiations and settlement.\n\nIdaho Code §§ 6-1012 and 6-1013 also prohibit proof of liability in a medical malpractice case by statements, conduct, or opinions of lay-persons and require that liability be established by experts possessing knowledge of the applicable standard of care.\n\nThe trial court correctly ruled throughout the trial that the fact that Robertsons had sued Dr. Bjornson and set forth their claims concerning his negligence in the Complaint, Answers to Interrogatories, and other pleadings was inadmissible for the purpose of proving Bjornson's liability. Tr. X, 2078-2080; Tr. XV, 3080:13-23.\n\nEven though the fact that Dr. Bjornson had been a defendant was not admissible to prove liability, it was admissible under Rule 408 if \"offered for another purpose\" such as proving bias or prejudice of a witness. However, the trial court should have exercised its discretion to exclude such evidence because the probative value was nil and thus was outweighed by its prejudicial effect. State v. Abel, 104 Idaho 865, 870, 664 P.2d 772, 777 (1983); State v. Sharp, 101 Idaho 498, 501, 616 P.2d 1034 (1980); Idaho Rule of Evidence 403.\n\nPrior to allowing the testimony to show bias or inconsistency in Bjornson's testimony, the Court should have required defense counsel to establish some prima facie basis that an actual bias against Dr. Richards existed, and that Dr. Bjornson's trial testimony was actually inconsistent with his deposition. Rynar v. Lincoln Transit, Co., 129 N.J.L. 525, 30 A.2d 406 (N.J.App.1943). But the trial court required neither. In truth, the fact that the Robertsons had sued Dr. Bjornson would be expected to establish bias by Dr. Bjornson against the Robertsons and in favor of Dr. Richards, and no material change in Dr. Bjornson's testimony was ever demonstrated at trial.\n\nHowever, prejudice became evident when the evidence which had been introduced to show bias or inconsistency was used in closing argument for the improper purpose of establishing Bjornson's liability. When the Court interrupted the closing and challenged the propriety of the improper argument, defense counsel claimed that since the evidence had come in he was entitled to use if for any purpose. The Court agreed and withdrew its previous instruction which had attempted to cure the prejudice of the $5,000,000 question. Tr. XVII, 3503-3508. This was clear error:\n\nWhere the evidence is stated to be introduced for a certain purpose, it should be restricted to that purpose, for it is manifest that any other rule would result in surprise and inJustice.\n\nAdvance-Rumley [Rumely] Thresher Co., Inc. v. Jacobs, 51 Idaho 160, 169, 4 P.2d 657 (1931).\n\nWhere evidence is introduced and received for a stated purpose, it is improper for counsel to argue that such evidence is competent to show other facts. 75 Am.Jur.2d, \"Trial,\" § 234, p. 314 (1974).\n\nArgument by defense counsel should have been limited to showing bias or inconsistency by Dr. Bjornson. Plaintiffs could not have argued that the mere fact they had sued Dr. Richards established his negligence, and it was unfair for Dr. Richards' counsel to use the same argument to establish\n\nBjornson's negligence. The unfairness multiplied when the court apparently agreed the evidence could be used for any purpose and specifically revoked its previous instruction.\n\nThe recognized importance of this issue became self evident at oral argument. Mr. Quane consumed all of his allotted 30 minutes, and beyond that, in attempting to persuade this Court that he was on safe and proper ground in directing the $5 million question to Dr. Bjornson. Those members of the Court who do not join this separate opinion were persuaded. To Judge George's credit, when that same argument was made to him at trial, he did not succumb to it, and had the right answers and made the correct ruling. Finding myself firmly convinced that the asking of the question was knowingly and intentionally done to discredit the witness, it is only fair to Mr. Quane that his contentions be fully laid out.\n\nTHE COURT: Response, Mr. Quane?\n\nMR. QUANE: Yes. I think it's absolutely totally proper and relevant and admissible for these reasons: Dr. Bjornson was called as a witness by the plaintiffs. He was cooperative. And he gave detrimental opinions regarding the standard of care against the defendant.\n\nHe was not in one sense hostile. He -- the net effect of his testimony is that he did not violate any standard of care; that Dr. Richards did; that he was not involved with the diagnosis or treatment of a fracture of the neck; that his only involvement was the treatment of a tibia and fibula fracture. He's called by the plaintiffs as an expert witness as well as a medical fact witness against the defendant. They therefore vouch for his credibility, his opinions, and they're bound by them.\n\nThe fact that they took a contrary position -- I'm talking about the plaintiffs -- they took a contrary position in this suit and they alleged and charged him with negligence for failure to diagnose a fracture of the neck, and they sued him. That shows that they don't believe in the veracity of their own witness who they vouch for in the person of this witness. And I'm entitled to prove an inconsistent position taken by the plaintiff as respect Dr. Bjornson's involvement.\n\nThe Complaint alleges, and it's reasonable to infer from it that he was summoned to diagnose the neck fracture, and it shows bias on his part. And it shows an inconsistent position by the plaintiffs.\n\nAnd, furthermore, I didn't ask him if he had settled. I only asked him about being sued by the plaintiffs who now take the position that he did nothing wrong; his opinions are worthy of consideration by the jury. And they are vouching for his testimony under oath that he was only asked to consult regarding the tibia fracture.\n\nWe take the opposite position. We are going to call witnesses who are going to say that Dr. Bjornson was contacted to conduct a complete, full orthopedic evaluation of this woman, including an examination of her neck and to treat the neck injury if one existed. And I'm entitled to show a biased position the part of the witness and an inconsistent position by the plaintiffs. And that's the validity of my question.\n\nWell, I can put in the -- a Complaint is a judicial admission that they filed against Dr. Bjornson. It alleges that he was negligent in his duty to diagnose the odontoid fracture. They have alleged that. That is a judicial admission that I think impeaches his testimony on this witness stand and the vouching for him that occurs implicitly when they call him as an expert witness against the defendant.\n\nYou see, your Honor, he's claiming that he only was concerned with the fractures of the leg, but there's going to be evidence that that's not true. And how can the plaintiffs sue him one day and allege that he was involved with the diagnosis of the neck, and then call him as a witness and have him testify that he wasn't, and vouch for him? That is an inconsistent position by the plaintiff by\n\nvirtue of a complaint that was filed. And that's a judicial position that I'm entitled to develop in front of the jury.\n\nHow can they call a witness and say, \"Well, gee, you didn't have anything to do with his neck, with the patient's neck. You weren't concerned with the treatment of the neck.\" Yet they sued him, and they said he was. I'm entitled to prove that. And that's the theory for my asking the question.\n\nAnd the reason I asked about the repairs done to the tibia and the fibula and if he thought that that mended well and that there was no residual injury was to eliminate the basis for a suit against him for the repair of the tibia, and it must, therefore, relate to the failure to diagnose the odontoid fracture. And I think my question was totally legitimate.\n\nMr. Quane paused, and plaintiff's counsel read to the trial court the provisions of I.C. § 10-111. Mr. Quane responded:\n\nMR. QUANE: That refers to this case between the Robertsons and Dr. Richards. I asked him about a suit between the Robertsons and this Doctor. That prohibition only relates to this case.\n\nI can show you, I think, if I may speak to the Court, excerpts from Bell's Handbook on Evidence and other evidentiary cases in Idaho where pleadings constitute judicial admissions if they're contrary to the position taken at trial. They are judicial admissions, and the fact that they sued this doctor is inconsistent with the testimony he gave for the plaintiffs in this case. It's inconsistent, and I can prove that and impeach, not only the plaintiffs, but the doctor with it.\n\nTHE COURT: I take it, from your last remarks, that at least part of your position is that you can impeach this doctor?\n\nMR. QUANE: Yes.\n\nTHE COURT: And . . . I'm just really having a hard time seeing how this impeaches him in that -- how do you impeach him by asking him if he has been sued? What's the -- tell me the formula, or whatever it is, by you asking him if he's been sued, how that impeaches him.\n\nMR. QUANE: It also impeaches the plaintiffs.\n\nTHE COURT: Let's stick to the doctor, first. I don't see how it does.\n\nMR. QUANE: Pardon?\n\nTHE COURT: I don't see how it goes toward impeaching the doctor by asking that question.\n\nMR. QUANE: He testified he didn't concern himself with the neck, diagnosis of the fracture or anything else.\n\nTHE COURT: The suit against him doesn't change that.\n\nMR. QUANE: Pardon?\n\nTHE COURT: The suit against him doesn't change that opinion on his part.\n\nMR. QUANE: They vouched for him when they called him as a witness, your Honor. They vouched for his credibility and the truthfulness and the authenticity of his testimony. The fact that he was sued and something totally contrary was alleged against him impeaches this doctor's position as a plaintiff's witness. The plaintiff vouched for him.\n\nTHE COURT: That's a different -- that's a different aspect of it. I just wanted to go on the fact that you indicated that you could impeach this doctor, and I don't think that's a proper question to impeach this doctor. It's a different question, whether you impeach the position of the plaintiffs or not. I don't know if the same rulings apply there.\n\nMR. QUANE: Well, isn't the impeachment of the doctor the impeachment of the plaintiffs' case?\n\nTHE COURT: No.\n\nMR. QUANE: I think that it is.\n\nTHE COURT: I mean, if this doctor makes some statement and you wanted to show that what he has stated is not right or it is contrary to something he said before, you can impeach him.\n\nMR. QUANE: Right.\n\nTHE COURT: You haven't done that, Mr. Quane.\n\nMR. QUANE: I realize that.\n\nTHE COURT: It's far from that.\n\nMR. QUANE: Well, I realize that. But that isn't the only method of impeaching a witness who is called for by the plaintiffs and vouched for by the plaintiffs. It's the position of the witness who's an expert called by the plaintiffs, and they're trying to convince the jury that he did not treat the neck fracture or have anything to do with it. And the plaintiff's position is contrary to that in the sense of the complaint.\n\nMR. QUANE: Well, I can call Mrs. Robertson and prove it.\n\nTHE COURT: Well, but the question has been asked, and the Court has to deal with it. I -- I mean, the fact that you might have gotten it in later on doesn't help me now.\n\nMR. QUANE: Let me ask you this, your Honor: If it would be relevant later on, what harm is it if you feel it was not property at this juncture, because I will ask it. I intend to. I intend to call in my case, or ask either plaintiff when on the witness stand if, in fact, they didn't sue Dr. Bjornson and allege that he failed to diagnose the odontoid fracture.\n\nMR. PECK: That is a different question.\n\nMR. QUANE: And that impeaches him and them.\n\nTHE COURT: It doesn't impeach him. He takes the position that he wasn't asked to do that, and that his procedures were not in any way negligent under all the circumstances. And there's no way that you can impeach him on that point of view by the fact that he's been sued. That doesn't impeach him.\n\nMR. QUANE: What I am getting at, your Honor, is if it would be permissible for me to ask the plaintiffs if they alleged against this doctor a position contrary to his testimony, if that would be admissible? If that would be permissible impeachment of the plaintiffs. And it's going to come in because I intended to do that.\n\nTHE COURT: I figured that you probably would.\n\nMR. QUANE: If that's relevant, what difference does it make if I ask him a question?\n\nMR. PECK: The statute --\n\nMR. QUANE: That applies to that suit, not this suit.\n\nTHE COURT: I don't think that that's the statute that is controlling for the Judge's decision in this case.\n\nMR. QUANE: I don't either.\n\nTHE COURT: If you put something in unfairly or at the wrong time, I don't think that it's justified by the fact that you might have got it in later by another witness.\n\nAt this juncture one of plaintiffs' counsel entered into the Discussion.\n\nMR. HAWKES: Only whether knowingly this was done, or whether it was a fluke. It is not a fluke, your Honor. It was planned and calculated for the very purpose and problem that it has caused.\n\nMR. QUANE: I planned it, your Honor, because it was legitimate as impeachment of the plaintiffs in my opinion, and I intend to impeach the plaintiffs by their Complaint if I can get to that point in the trial.\n\nTHE COURT: I think the only way you could have been justified in asking that question of Dr. Bjornson if it was tended or if it was available to you to impeach him. And I don't think that that has any relevance or anything at all in impeaching him as to his testimony that was given. It wasn't directed toward that.\n\nTHE COURT: No, that won't help me. I'm saying that the question is improper at this point. All I've gotten to do is decide whether or not I will deny a motion for a mistrial, and try to collect it with the jury. That's the point that I've got to decide upon.\n\nTHE COURT: Fine. The Court's going to propose a couple of methods of making some statement to the jury to avoid a mistrial. I may take a minute here and write something out and maybe get some suggestions if counsel has any questions. I'm going to be inclined to see if I can cure it. I want you to know that's my position.\n\nIf you wanted to aid the Court in handing me something that you think might help cure the problems in front of the jury. I think the question as of right now is improper.\n\nMR. QUANE: May I suggest this?\n\nTHE COURT: I'll sustain the objection.\n\nIt cannot be seriously argued that defense counsel did not use the improper $5 million question to his client's great advantage. Nor can it be gainsaid that the \"curing\" instruction which told the jurors to cast it out of their mind only served to emphasize it at the time. Then later when the court after having ruled that defense counsel could ask of Dr. Bjornson if he had been a named defendant when his deposition was taken, but at time of trial was not -- which took place -- and then by a slip of memory forgot that had taken place, and interrupted Mr. Quane in the midst of his peroration, and then had to take a recess after which he would publicly apologize to Mr. Quane, in the presence of the jury, that was the end of the ball game for the plaintiffs. In short, the Judge on the second day of trial in a dramatic confrontation ruled over and over that Mr. Quane's question was wrong, gave an instruction directing the jurors to forget it, and at the end of the trial apologetically retracted the instruction and was sorry for the lapse of memory. Mr. Quane was given free rein to explain to the jury that Dr. Bjornson was the culprit: \"Why would they (plaintiffs) sue him?\"\n\nIt is not a point which defense counsel can refute. It was Mr. Quane who reminded the trial Judge, \"You said I could ask that question if you recall.\" It cannot be discovered anywhere in the record, and necessarily had to have taken place in the court chambers, as stated in the brief of the plaintiffs, and not denied. The court might just as well have given defendant's written Requested Instruction No. 32. Clearly the defendant thought he was entitled to it in view of what was taking place. An order declaring a mistrial entered on the second day of trial would have prevented a trial which became incurably prejudicial to the plaintiffs.\n\nOne other error adding to the unfairness of the trial needs to be addressed, namely the use of the \"golden rule\" argument to the jury, of which plaintiff's brief states:\n\nMr. Quane asked the jury to think about the evidence as if they were Dr. Richards. Although plaintiffs objected to this tactic, the Court made no ruling and no comment, leaving the jury with the impression that the argument was proper.\n\nNow, let me ask you a question, if I might. And don't answer it. But just going to post it: Would it be fair, would it be just, would it be honest, to hold that surgeon accountable based upon the opinion of a doctor from Salt Lake who said that he failed to comply with the standard of care based entirely upon the written word and not having been given the opportunity to even know or assume or take into account that Dr. Bjornson was called to the emergency room by Dr. Hansen or by Dr. Richards for the purpose of managing and handling and taking care of Leah Robertson in regard to her neck?\n\nWhat if you were the doctor --\n\nMR. PECK: Your Honor, I am going to object to that. Mr. Quane raised that very point in the room. The Court gave us specific instructions on that. I object to it. I am going to ask the Court to instruct Mr. Quane accordingly.\n\nTHE COURT: (No audible response.)\n\nMR. QUANE: Think about -- think about, if you will, think about the inherent fairness; just the fairness of holding him legally responsible and accountable because some doctor from\n\nSalt Lake -- and it's not the Salt Lake doctors that he asked to assume all these facts. Think of the inherent inequity of making that fine doctor liable.\n\nTr. XVII, 3519:6-3520:6 (Emphasis added.)\n\nIt is generally recognized that the \"golden rule\" argument, by which counsel suggests the jurors place themselves in the position of the party, is reversibly improper because it is an invitation to ignore jury instructions and decide the case by sympathy. 75 Am.Jur.2d, \"Trial,\" § 282, p. 357 (1974).\n\nIn Klotz v. Sears \u0026 Roebuck Company, 267 F.2d 53 (7th Cir.1959), plaintiff's counsel repeatedly asked the jury to \"do unto others as you would have them do unto you\" and to \"give us the kind of deal that you would want to get.\"\n\nThe court explained how such remarks were improper because they invoke sympathy in the jury.\n\nThese remarks made by plaintiff's counsel were in effect pleas that the jury permit sympathy, rather than the facts in evidence to determine the issues. This type of appeal to sympathy or charitable considerations falls within the class of argument condemned in F.W. Woolworth Co. v. Wilson, 5 Cir., 1934, 74 F.2d 439, 98 A.L.R. 581, where plaintiff's counsel asked the jurors if they would be willing to put themselves in plaintiff's position for a few paltry thousand dollars. The court stated at pages 442-443:\n\n\" The appeal to the jury to put themselves in plaintiff's place was improper. One doing that would be no fairer Judge of the case than would the plaintiff herself. * * *\n\n\" Sympathy for suffering and indignation at wrong are worthy sentiments, but they are not safe visitors in the courtroom, for they may blind the eyes of Justice. They may not enter the jury box, nor be heard on the witness stand, nor speak too loudly through the voice of counsel. In judicial inquiry the cold clear truth is to be sought and dispassionately analyzed under the colorless lenses of the law.\" 267 F.2d at 55 (Emphasis added.)\n\nThe court went on to state that such argument is grounds for reversal of a judgment even though the trial court may have attempted to correct the problem by directing the jury to disregard the remarks:\n\nPrejudicial argument of counsel of the character here indulged in is sufficient cause for reversing a judgment even though the trial court has sustained objections to the statements and directed the jury to disregard them, Westbrook v. Chicago \u0026 N.W. Ry. Co., 248 Ill.App. 446, 451.\n\nThe nature of the remarks, their number and repetition, when considered in connection with the record as a whole, evidences a deliberate appeal to the jury to substitute sympathy for judgment and impels us to reverse and remand for a new trial.\n\n267 F.2d at 55 (Emphasis added.)\n\nIn this case there was a similar successful attempt by defense counsel to appeal to the sympathy of the jury. However, the court gave no instruction to disregard the appeal to sympathy even though Plaintiff's counsel objected and requested an instruction. The Court ignored plaintiff's objection and allowed Mr. Quane to continue his argument as if it were totally proper. Tr. XVII, 3519. On Motion for New Trial, the trial court even incorrectly denied there had been an objection. R. II, 387:7-9.\n\nPlaintiff's argument to invoke the \"golden rule\" and the Court's refusal to correct the argument resulted in an adverse verdict in a case where the clear weight of the evidence indicated that Dr. Richards was negligent. Therefore, a new trial should be granted.\n\nIn the Rojas case, this Court did have the option, perhaps, to turn away an otherwise winning appeal by reason of counsel's failure to register an objection. But there was no such failure here, and this Court is squarely forced with condemning such trial\n\ntactics, or tacitly affixing the Court's stamp of approval.\n\nThe statute in question, I.C. § 10-111, is clear enough, but I for one, having always wondered at its source, am grateful for the history of its enactment which is provided in plaintiffs' opening brief, supra. With the history of the statute's origin, it is not difficult to comprehend what it is intended to do and does do. Contained within its language it declares the policy of the state of Idaho which is \"that it is the exclusive province of the jury in a civil action for money damages involving allegations of general damages to resolve such issues of fact.\" The statute not only sets policy for the state, but is emphatic that that policy not be violated: It shall be grounds for a mistrial for any person to violate the prohibition of this act whether by specific statement or generalized argument. The first sentence of the statute is strongly worded: \"In any civil action for damages, the amount of damages sued for shall not be disclosed by court, counsel, or any party.\" It is because the trial court is also interdicted from making any disclosure, that I have said \" strongly worded.\"\n\nShould the trial Judge himself by a slip of the tongue disclose the amount sued for,[Footnote 3] then, upon it being called to his attention, should he cure the transgression by giving a curing instruction? One would think not. Otherwise a legislative enactment declaring that state of Idaho policy prohibits such conduct, and declares but a single method of relief from the prejudice which it deemed inherent in the violation, is wholly nullified. Judicial nullification of validly declared public policy and nullification of a statute declaring a mistrial as the remedy for violating proscribed conduct is violative of the doctrine of separation of powers, and intolerable.\n\nWith the purposes and policy of the statute well in mind, it is in order to examine its application to the instant circumstances. Do we have a civil action? Yes. Is it for damages including general damages? Yes. Was there a violation of the prohibition by a specific statement? Yes. The question of defense counsel, i.e., \"If that's the case [A yes answer to the question which asked if you feel that your care of her fractures was appropriate], Dr. Bjornson, can you explain to the ladies and gentlemen on the jury why Mr. and Mrs. Leah Robertson sued you for five million dollars in this case?,\" although in question form, was a disclosure to the jury of the amount of damages, including general, which was the basis of the only lawsuit that had been filed and was being tried? Yes. Was it within the prohibition of the act? Yes. Was it in violation of the public policy of the state of Idaho? Yes. Was it an intentional violation? Yes, admittedly so, and done improperly as noted by the trial court's own comments and ruling. Is it necessary to show actual prejudice under the provisions of the act? No, absolutely not. That the act presumes prejudice from a violation is implicit in the remedy therein provided. Was there, as well as the specific statement contained in the question, also generalized argument which was in violation of the prohibition of the statute? Yes.\n\n(Aside from the statute, was the question unfair and prejudicial? Yes.)\n\nThis Court in the eleven years since I.C. § 10-111 became law has never before been required to discuss its remedial provision of a mistrial. In Leliefeld v. Johnson, 104 Idaho 357, 659 P.2d 111 (1983) and again in Quick v. Crane, 111 Idaho 759, 727 P.2d 1187 (1986), violations of the statute were claimed on appeal, but not passed upon because in both instances the issue had not been preserved for appeal by objection at trial (including final arguments) or by motion for mistrial after final arguments or before submitting the cause to the jury.[Footnote 4]\n\nThe question is squarely before the Court. It is a question of great moment. But it is a question easily answered, provided that we Justices remember, as declared scores of times, declaration of public policy belongs to the legislature. In no uncertain language the legislature has said that no jury shall be retired to deliberate liability and damages if it has been tainted by the prohibited disclosure of the amount of damages being sued. The trial court, upon being made aware of a prohibited disclosure (as for certain happened in this case) is afforded no other alternative but to declare a mistrial in such event as provided in the statute. It may be readily surmised that the drafters and promoters of I.C. § 10-111 well knew what they were doing and undoubtedly considered and rejected other possible remedies -- such as a curing instruction. Such being the state of affairs, the trial courts of this state have no authority to violate a clear statutory provision which is based upon the legislative perception of public policy.\n\nIt may seem to some lawyers and Judges a bit on the harsh side to declare a mistrial and, where a jury has been utilized, to dismiss it, select a new jury, and begin the trial anew. But it is a matter of public policy, and not open to legal or judicial philosophy. And, of course, not to be forgotten, there will be no mistrials where there occurs no violation of the statute.\n\nIn this particular case, as earlier seen herein, there was a violation of the statute, by incorporating an offensive statement into a question, and the question itself, even had it been purged of the reference to the amount being sued for, was itself improper. The trial Judge so ruled in both respects, but assumed that he had the power to remedy the situation by a curing instruction. Possibly that was so as to the question being asked at an improper time -- as to the doctor having been sued -- but certainly not where the legislative statute had been violated. Not just being inadvertently violated, but deliberately and with calculation, said to be justified so as to impeach Dr. Bjornson, which the trial court correctly ruled it did not, and observed that other and acceptable means of attempting to do so were readily available.\n\nThe only Conclusion to be reached is that the legislative policy is that the trial ends with an order declaring a mistrial. Thereby the legislature accomplishes its goal of preventing jurors from learning of the amount of damages, including general, for which the complaint prayed and the action was brought. The statute was enacted at the behest of the IMA as a means of securing more fair trials. Interestingly, in this particular instance the statute was violated by counsel defending a doctor.\n\nBeing that it was a deliberate violation, my vote is that, as I said also in Rojas, the defendant be assessed all of the costs of trial and appeal, including a reasonable hourly compensation to the plaintiffs for their attorney fees to date -- other than hours spent in discovery. Those hours will be recoverable costs on the second trial, should the plaintiffs prevail. Otherwise no.\n\nOpinion\n\nON REHEARING\n\nHUNTLEY, J.\n\nThis appeal presents two main issues. The first is whether the trial court applied the correct standard in deciding whether a new trial should have been granted. The second is, despite which standard the court applied in deciding the propriety of granting a new trial, whether the record establishes that a new trial should have been granted as a result of errors occurring during the trial which deprived the plaintiffs of a fair trial. We hold that the district court did not apply the correct standard for determining whether a new trial should be granted, and, further, that errors occurred in the course of the trial that require a new trial. Therefore, we reverse and remand for new trial.\n\nLeah Robertson was involved in a car accident and received multiple injuries. She was taken to the Idaho Falls Consolidated Hospital emergency room. Dr. Hansen, the doctor in charge when Robertson arrived at the emergency room, made a cursory examination and ordered that a\n\nside-view neck x-ray and a chest x-ray be taken. Dr. Hansen then called Dr. Richards, the defendant, to perform a complete physical examination and take over the case. Dr. Hansen also called upon Dr. Bjornson to perform an orthopedic evaluation for the purpose of treating a broken leg. Dr. Richards testified that he and Dr. Bjornson examined the neck and chest x-rays, and that Bjornson, skilled in the diagnosis of neck injuries, did not indicate any abnormalities in the neck x-ray. Although the neck x-ray did not show all seven vertebra, Dr. Richards ruled out a broken neck. Dr. Bjornson testified that he was never asked to review the neck x-ray and that he confined his efforts to the fractured leg, but evidence is conflicting as to whether he ever did examine the x-rays.\n\nThere is also conflicting evidence as to whether reliance upon a single lateral neck x-ray meets the applicable medical standard of care. The Robertsons' experts all testified that at least five x-rays, taken from different angles of the neck, were required before a broken neck could be ruled out of the diagnosis. Dr. Richards himself admitted that at least three x-rays from different angles are needed before making a final determination, yet the record reflects that only one neck x-ray was taken, which was a fact well known to Dr. Richards.\n\nDr. Richards excused his failure to require that at least three x-rays be taken by asserting that he had relied upon Dr. Bjornson's expertise to diagnose whether Mrs. Robertson's neck was broken. Dr. Richards argues that, by relying on Bjornson's expertise, he satisfied the requisite standard of care. Dr. Bjornson, however, testified that he never assumed responsibility for diagnosing Robertson's neck injury; this was a highly contested and close issue at trial.\n\nDuring surgery, Dr. Richards performed an endotracheal intubation upon Robertson and cleaned and stitched her facial wounds while Dr. Bjornson set her broken leg. Prior to the surgery, Dr. Richards ordered the sandbags--which the paramedics had put in place to prevent neck movement--be removed from either side of Robertson's neck. Dr. Richards claimed that he reviewed the neck x-ray with Radiologist Newell Richardson after the surgery. Richardson, however, did not recall discussing the neck x-ray with Dr. Richards. Subsequently, Richardson reviewed the x-rays and dictated an x-ray report. Richardson's radiological report stated that the neck x-ray was unsatisfactory and that additional x-rays were necessary, but Dr. Richards claims his procedure was to have the nurse destroy his copy of the report and, therefore, he never read it.\n\nDuring the following three days, Robertson began to exhibit a loss of neurological function. Richards asked Dr. Amick, a neurologist, to assist with the case. As Robertson's condition deteriorated in the ensuing eight weeks, the doctors concluded that Robertson could not be removed from the respirator since she was unable to breathe on her own. Additionally, Robertson could not move her arms or legs, her eyes were crossed, and she had lost bowel and bladder control. In mid-May, Richards, as attending physician, advised the family to consider terminating Leah Robertson's life support system. The family decided that they wanted a brain scan before making such a decision. The CT Scan revealed water on the brain.\n\nDr. Heilbrun, a neurosurgeon from the University of Utah Hospital, was called in to consult with the Robertson family. In reviewing the medical records, Dr. Heilbrun noted that Dr. Richardson's x-ray report had recommended that additional neck x-rays be taken but, in fact, none were ever taken. Also, several doctors, including Dr. Bjornson, testified at trial that the original x-ray clearly showed a fractured neck vertebra.\n\nAdditional x-rays were then taken which revealed that Robertson's neck was broken.1[Footnote *] Heilbrun put Robertson in cervical traction in order to properly position her spine and her neck fracture was then\n\nfused. The traction and fusion enabled Robertson to breath again on her own, and she regained the use of both the left and right sides of her body; however, due to neurological damage, Robertson's eyes were permanently crossed. At the University of Utah Hospital, it was also discovered that Robertson had a broken hip. After three-and-a-half months at the University of Utah Hospital, Robertson returned home. Within five months, Robertson returned to the University of Utah for physical rehabilitation which enabled her to regain control of her bowels and bladder as well as learn to walk with the aid of a walker.\n\nThe Robertsons brought suit against Dr. Richards and seven other defendants. All of the defendants, except Dr. Richards, were insured by the same company and settled before trial. The jury returned a verdict declaring that Dr. Richards was not negligent. The Robertsons moved for judgment notwithstanding the verdict and in the alternative, for a new trial. The court denied the motions and the Robertsons appeal.\n\nI.\n\nIn denying the motion for a new trial, the district court stated:\n\n[T]he evidence was conflicting and depending upon the weight and credibility, the jury chose to give to the evidence, they could have gone either way in rendering their verdict. The fact that the court might have differed and would have weighed the evidence in a different way does not open the way for a new trial.\n\nThis finding by the trial court is at issue. We hold that the trial Judge, by failing to recognize his power to evaluate the evidence and determine whether a new trial should be granted, erred by applying the wrong standard. Based upon the record, this Court does not rule on whether the conduct of Doctor Richards comported with the applicable standard of care, but notes that this issue is one which requires the trial court to weigh the testimony in making its determination of whether or not to grant a new trial.\n\nIt has long been the rule in Idaho that the trial court is given broad discretion in granting a new trial. Jacksha v. Gilbert, 4 Idaho 738, 44 P. 555 (1896). Idaho Rule of Civil Procedure 59(a)(6) permits granting a new trial when the Judge determines the evidence insufficient to justify the jury's verdict.2[Footnote *]\n\nIn Quick v. Crane, 111 Idaho 759, 727 P.2d 1187 (1986), we described the power which I.R.C.P. Rule 59(a)(6) vests in the trial court to grant a new trial:\n\nIdaho Rule of Civil Procedure 59(a)(6) permits the trial court to grant a new trial on all or part of the issues in an action by reason of the \"[i]nsufficiency of the evidence to justify the verdict or other decision, or that it is against the law.\" It is well established that the trial Judge may grant a new trial based on I.R.C.P. Rule 59(a)(6) where, after he has weighed all the evidence, including his own determination of the credibility of the witnesses, he concludes that the verdict is not in accord with his assessment on the clear weight of the evidence. Sheets v. Agro-West, Inc., 104 Idaho 880, 883, 664 P.2d 787, 790 (Ct. App. 1983).\n\nId. at 766, 727 P.2d at 1194.\n\nIn Blaine v. Byers, 91 Idaho 665, 429 P.2d 397 (1967), this Court formulated a two-pronged analysis which the trial court must use in determining whether to grant a new trial. The characteristics of the first prong of the analysis are as follows:\n\nThe rule that where there is any competent evidence, though conflicting, to sustain the verdict, the verdict will not be set aside has no application to a trial court in passing upon a motion for a new\n\ntrial. Grimm v. Harper, 84 Idaho 220, 370 P.2d 197; Coast Transport v. Stone, 79 Idaho 257, 313 P.2d 1073. See also Warren v. Eshelman , 88 Idaho 496, 401 P.2d 539. Rather the discretion with which the trial Judge is entrusted is a sound legal or judicial discretion, and the trial court may grant a new trial when it is satisfied the verdict is not supported by, or is contrary to, the evidence, or is convinced the verdict is not in accord with the clear weight of the evidence and that the ends of Justice would be subserved by vacating it, or when the verdict is not in accord with either law or Justice. (Citations omitted).\n\nId. at 670-671, 429 P.2d at 402-03.\n\nThe first prong directs the trial Judge to consider whether the verdict was against the weight of the evidence and if the ends of Justice would be served by vacating the verdict. In Quick, this Court noted that \"the Judge is free to weigh the conflicting evidence for himself.\" 111 Idaho at 767, 727 P.2d at 1194. The Court further emphasized the role the trial Judge plays in preventing a miscarriage of Justice:\n\nThe trial Judge is not required to view the evidence in a light most favorable to the verdict-winner. Although the mere fact that the evidence is in conflict is not enough to set aside the verdict and grant a new trial, when a motion for new trial is based on the ground that the verdict is against the weight of the evidence, the Judge is free to weigh the conflicting evidence for himself. In fact, as Wright \u0026 Miller note in their treatise discussing the similar Federal Rule of Civil Procedure 59, \"the granting of a new trial on the ground that the verdict is against the weight of the evidence 'involves an element of discretion which goes further than the mere sufficiency of the evidence. It embraces all the reasons which inhere in the integrity of the jury system itself.'\" Wright \u0026 Miller, supra § 2806 at 45 (citing Tidewater Oil Co. v. Waller, 302 F.2d 638 (10th Cir. 1962).\n\nThe trial Judge is sitting at the heart of our trial process, a position we on the appellate level cannot duplicate. On the one hand, he does not sit to approve miscarriages of Justice when they occur in his courtroom. His authority to set aside the verdict on a new trial motion is supported by clear precedent at common law. Indeed, far from being a denigration or usurpation of the right to a trial by jury, trial Judges have always been regarded as an integral part of that right. Wright \u0026 Miller, supra § 2806, at 49. On the other hand, respect for the collective wisdom of the jury and the function entrusted to it under our constitution suggests the trial Judge should, in most cases, accept the jury's findings even though he may have doubts about some of their Conclusions. Id. Certainly, all that can be expected of our trial Judges as they exercise their discretion in this area is that they balance these conflicting principles in light of the particular facts of each case. Id. \"If, having given full respect to the jury's findings, the Judge on the entire evidence is left with the definite and firm conviction that a mistake has been committed, it is to be expected that he will grant a new trial.\" Id.; U.S. v. U.S. Gypsum Co., 333 U.S. 364, 68 S.Ct. 525, 92 L.Ed. 746 (1948).\n\nId. at 767-68, 727 P.2d at 1195-96. (Emphasis added).\n\nIt is clear under Idaho case law that the trial court has the responsibility to weigh the evidence and make an independent determination as to whether the evidence supports the verdict. Sanchez v. Galey, 112 Idaho 609, 733 P.2d 1234 (1986); Dinneen v. Finch, 100 Idaho 620, 603 P.2d 575 (1979); Meissner v. Smith, 94 Idaho 563, 494 P.2d 567 (1972); Rosenberg v. Toetly, 93 Idaho 135, 456 P.2d 779 (1969); Mendenhall v. MacGregor Triangle Co., 83 Idaho 145, 358 P.2d 860 (1961); Checketts v. Bowman, 70 Idaho 463, 220 P.2d 682 (1950) (overruled on separate issue in Meissner v. Smith, 94 Idaho 563, 494 P.2d 567 (1972)).\n\nThe second prong of the Blaine analysis directs the trial court to consider whether a different result would follow upon retrial:\n\nAdditionally, the general rule which prevails in this jurisdiction is that a motion for a new trial should not be granted unless it appears that a different result would follow a retrial.\n\nId. at 671, 429 P.2d at 403.\n\nAlthough the trial court did not specifically address the second prong, since it was not considering and applying the Blaine standard, there is language in the memorandum decision which indicates the court might have felt that \"a different result would follow a retrial\":\n\nPlaintiffs claim that the overwhelming weight of evidence produced at trial was that Dr. Richards was at fault, in part at least, in not diagnosing and treating the broken neck. Without question there was evidence presented that would Justify a finding of fault on the part of Dr. Richards. If this had been a bench trial, the court could make findings and Conclusion that would support a finding of fault in spite of the testimony of Dr. Hansen, Dr. Fazio, and Dr. Barth. (Emphasis added).\n\nHowever, the trial Judge failed to apply either prong of the two step analysis because of his mistaken belief that he did not have the authority to review and reevaluate the evidence in order to determine whether a new trial should be granted. As noted above, the district court does have the power to grant a new trial in such situations. In fact, in Dinneen v. Finch, 100 Idaho 620, 603 P.2d 575, (1979), this Court recognized that a trial court's misconception of the law is an abuse of its discretion:\n\nIt is clear, then, that this court has been consistent in (1) recognizing the trial court's important function in passing on motions for new trial, and (2) upholding the trial court's grant or denial of such a motion unless the trial court has manifestly abused the wide discretion vested in it, or, as in Meissner, supra, misconceived the law, or, as suggested in Blaine v. Byers, supra, unless the trial Judge has applied a \"question of law\" rule to a decision which must be made as question of fact. That doctrine is sound, it is well established, and will be adhered to.\n\nId. at 625, 603 P.2d at 580.\n\nIn assuming that it did not have the power to grant a new trial based upon an independent evaluation of the evidence, the trial court \"misconceived the law\" by failing to apply the correct standard as expressed in Blaine, supra, and thus, abused its discretion. Hence, the trial court's decision is reversed, and the case is remanded for a new trial for the reasons set forth hereafter in Part II.\n\nII.\n\nThe Robertsons claimed there was error requiring a new trial because the trial court did not instruct the jury on the definition of proximate cause.\n\nDuring the jury instruction conference, the court approved Plaintiffs' Requested Instruction No. 9, which was identical to IDJI 230:\n\nWhen I use the expression 'proximate cause,' I mean a cause of which, in natural or probable sequence, produces the damage complained of. It need not be the only cause. It is sufficient if it concurs with some other cause acting at the same time, which in combination with it, causes damage. (Emphasis added).\n\nThis instruction was inadvertently misplaced and, as a result, the jury was never instructed on the definition of proximate cause. Consequently, and of particular importance to the trial, the jury was not informed that the acts of two or more persons can each be a proximate cause of an injury. Neither the court nor counsel for either party noticed the omission of the instruction until well after the end of trial.\n\nWhile the jury was deliberating, however, it submitted the following written question to the court:\n\nCan Question Number 1 be deleted, and Question Number 3 be substituted? Number 1 is so worded as to imply 100 percent negligence, and the testimony is contrary to a yes answer.\n\nThe \"questions\" to which the jury was referring were those in the Special Verdict Form:\n\nQUESTION NO. 1. Was there negligence on the part of the Defendant James Richards which was a proximate cause of an aggravation of injuries to Leah Robertson?\n\nAnswer: Yes No\n\nIf you answered the above question \"No,\" then simply sign the verdict form and inform the bailiff that you are done. If you answered the above question \"Yes,\" please answer Question No. 2.\n\nQUESTION NO. 3. We find that the parties contributed to the aggravated injuries in the following percentages:\n\n(a) The defendant Dr. Richards %\n\n(b) Other health care providers %\n\nTOTAL 100%\n\nThe court notified counsel for both parties who then presented argument on how the jury's confusion on Question No. 1 should be handled. After lengthy Discussion, the court amended Question No. 1 to read: \"Was there any negligence on the part of the Defendant James Richards which was a proximate cause of an aggravation of injuries to Leah Robertson?\" (Emphasis added). No changes were made to question No. 3. The jurors were called into the courtroom and the Judge read the modified question to them.\n\nThe term \"proximate cause\" was specifically mentioned in seven separate jury instructions. However, as the jury's question to the court suggests, none of the references to proximate cause clarified the meaning of this legal term and the jury was never informed in the basic instructions that there can be more than one proximate cause of an injury. Clearly, the court's continuing reference to proximate cause without the aid of any definition would not reduce the jury's confusion. This is especially true when there was more than one possible proximate cause of Mrs. Robertson's injury.\n\nFurthermore, the court instructed the jury in three separate instructions (similar to the instruction below) that the jury must make its determination \"based upon these instructions\" and the definition of proximate cause as contained in these instructions:\n\nINSTRUCTION NO. 16\n\nIn regard to your determination of whether other health care providers were negligent, you will make that determination based upon these instructions, and in order to conclude that other health care providers were negligent, you must so find by a preponderance of the evidence as defined in these instructions.\n\nIn regard to your determination of whether the negligence of other health care providers proximately caused injuries sustained by plaintiff Leah Robertson, you will make that determination based upon these instructions, and in order to conclude that the negligence of other health care providers proximately caused injuries, you must so find based on the definition of proximate cause as contained in these instructions and by a preponderance of the evidence as contained in these instructions. (Emphasis added).\n\nAlthough we cannot presume to know precisely what was in the minds of the jurors when they submitted their question to the court, it is apparent that there was a definite doubt in the minds of some of the jurors whether Richards was 100 % negligent. In other words, the jury's request to substitute Question 3 for Question 1 on the Special Verdict Form indicates their concern with how negligence should be broken down in this case. Plaintiffs' Requested Instruction 9 would have eliminated the confusion by explaining that the negligence of separate individuals can combine to cause harm to the plaintiff and, thus, there could be two or more proximate causes of a plaintiff's injury.\n\nIt is the rule in Idaho that where there is evidence in support of the allegations that the negligent acts of several individuals caused the injury complained of, the jury should be instructed that there may be two or more proximate causes of an injury. Pigg v. Brockman, 85 Idaho 492, 381 P.2d 286 (1963). In Pigg, the proximate cause\n\ninstruction given by the court was determined to be erroneous because it might have misled the jury into thinking that only one act of negligence could be the cause of an injury.\n\nAlthough Pigg was concerned with an erroneous proximate cause instruction, the same underlying concern in Pigg is relevant to this case. It is critical that juries are properly instructed with regard to fundamental legal definitions. There is little difference between the error promulgated by an erroneous instruction and the error promulgated by utterly neglecting to give that same essential instruction to the jury altogether. In Hickman v. Fraternal Order of Eagles, 114 Idaho 545, 758 P.2d 704 (1988), we held that a defense verdict would not be overturned and new trial ordered and that we would not address the appropriateness of the proximate cause instruction where the jury found no negligence. This case is distinguishable from Hickman in that in the instant case Instruction No. 16, supra, which provided that guidance to the jury as to how it was to determine the presence or absence of negligence, specifically directed the jury to do so with reference to the requirements of the missing proximate cause instruction. Therefore, the missing instruction would have a direct influence on the determination of negligence in the first instance, which was not the case in Hickman, supra. Thus, the failure to include the essential proximate cause instruction requires the granting of a new trial.\n\nIII.\n\nIt is required that we pass upon and determine all questions of law presented upon appeal the resolution of which are necessary to the final determination of the case. I.C. § 1-205; Garrett Freightlines, Inc. v. Bannock Paving Co., 112 Idaho 722, 703, 735 P.2d 1033, 1041 (1987). Herein, we shall address two pertinent issues.\n\n(A)\n\nThe Robertsons argued that the district court committed reversible error by improperly defining the standard of care in its instructions and by refusing to use their general instructions which define negligence. However, I.C. § 6-1012 establishes the applicable standard of care in Idaho medical malpractice cases, and the district court's instructions correctly apprised the jury that the defendant was required to meet that standard.3[Footnote *] If the court's instructions adequately and correctly instruct the jury on the law, no error may be predicated upon failure of the trial court to give a requested instruction. McPheters v. Peterson, 108 Idaho 107, 697 P.2d 447 (1985).\n\nIdaho Code § 6-1012 states in part that \"individual providers of health care shall be Judged in such cases in comparison with similarly trained and qualified providers of the same class in the same community, taking into account his or her training, experience and fields of medical specialization, if any.\" The court's instructions were based upon the legislative standards set forth in I.C. § 6-1012 and accordingly, the trial court committed no error by giving Instructions 12 and 13 nor by refusing to accept the Robertsons' requested negligence instructions McPheters v. Peterson, supra.\n\n(B)\n\nThe Robertsons argue that defense counsel engaged in intentional prejudicial conduct which entitles them to a new trial. The conduct of which they complain took place during defense counsel's cross examination of Dr. Bjornson, who was called as plaintiffs' witness to support their claim that Dr. Richards was negligent. Dr. Bjornson had also been sued by the plaintiffs but settled prior to trial. When Dr. Bjornson testified that his treatment of Robertson was entirely appropriate, Dr. Richards' counsel, Mr. Quane, asked the doctor why the Robertsons had sued him for $5,000,000. The Robertsons assert that this question addressed to Dr. Bjornson violated the strictures of I.C. § 10-1114[Footnote *] and, therefore, they should be granted a new trial.\n\nIn Rojas v. Lindsay Manufacturing Co., 108 Idaho 590, 701 P.2d 210 (1985), we were presented with an issue similar to the one in the instant case. In Rojas, one of the defendants settled with the plaintiff at the beginning of the second day of trial. The trial court informed the jury:\n\nMr. Rojas have compromised their difficulties and have settle their portion of this case. Therefore, Mr. Marshall is no longer a party defendant.\n\nIn final summation, defense counsel utilized the court's statement as a means of persuading the jury of that defendant's negligence being the cause of the minor plaintiff's severe injuries:\n\nNow, you will be asked on the verdict form whether Mr. Marshall was negligent; and I submit to you that he was negligent. And I submit to you that his, his action was what caused this accident. Otherwise why would he have settled?\n\nAnything can hurt you if used improperly. And we submit that the cause of the accident was the improper use of the machine by Kenneth Marshall; and Kenneth Marshall recognized the use of the machine when he injured Pedro Rojas because he settled this case. He got out.\n\nThis Court held that failure to object or move for a mistrial did not preserve the issue for appeal.\n\nCounsel for Mrs. Robertson did preserve the issue by a timely objection, and by a motion for mistrial. Unlike the Rojas case, the objectionable question came early in the trial, and it would not have worked an inconvenience to select a new jury and commence anew. Instead, the trial proceeded for four weeks because the trial Judge entertained a philosophy against granting mistrials in favor of his producing an instruction which would hopefully cure the prejudice already instilled in the minds of the jurors.\n\nIt is helpful to first examine the Robertsons' cause of action for alleged medical malpractice, which was not filed until long after the vehicle collision, the long period of hospitalization of Mrs. Robertson, her near death, and long convalescence.\n\nNamed as defendants were Dr. Richards, Dr. Richardson, Dr. Amick, Dr. Hansen, and Dr. Bjornson, who were thereafter referred\n\nto in the complaint and in the verdict form collectively as Health Care Providers; also named as defendants were the corporations owning and operating the Riverview Hospital and the Parkview Hospital. The Health Care Providers were alleged to be responsible for Mrs. Robertson's diagnosis, treatment, and care of her injuries, she allegedly becoming a patient of all upon her admission as an emergency patient. The Robertsons' complaint alleged that \"Defendant Health Care Providers, or one or more of them\" were negligent in their diagnosis and care of Mrs. Robertson and had breached their duty to her.\n\nIn such circumstances, neither the plaintiffs themselves, nor counsel who undertook their representation could be expected to know or learn which of the Health Care Providers was responsible for the near-fatal diagnosis. Nor could counsel learn the underlying facts until after the lawsuit was filed and discovery was utilized. Depositions were taken of all doctors, including Dr. Bjornson, and there was an abundance of interrogatories. Thereafter there were various dismissals entered of record, presumably upon the basis of subsequent discovery.\n\nEarly in the trial, the Robertsons called Dr. Bjornson as a fact witness and he gave the same testimony at trial that he did in his deposition. On cross-examination of Dr. Bjornson, Mr. Quane asked the following questions which were the source of the prejudicial misconduct in this case:\n\nQ: To your knowledge, did your treatment of the fractures turn out okay, of her lower leg fractures?\n\nA: I believe the fracture united, but that was after she left the hospital.\n\nQ: But as far as you understand, she had a good recovery from the fracture?\n\nA: The fracture united. I don't know about her function.\n\nQ: You haven't seen her since she was transported to the Salt Lake City, have you?\n\nA: No sir.\n\nQ: Do you have any reason to believe that your reduction of the fractures was in any way inappropriate?\n\nA: No.\n\nQ: Do you feel that your care of her fractures was appropriate?\n\nA: Yes, sir.\n\nQ: If that's the case, Dr. Bjornson, can you explain to the ladies and gentlemen on the jury why Mr. and Mrs. Leah Robertson sued you for 5 million dollars in this case?\n\nA: I think because I was one of the physicians --\n\nMR. ESPLIN: Objection, Your Honor, I think that that's the type of evidence -- calls for a legal Conclusion. He has no way of --\n\nTHE COURT: Let's take a recess. I think -- on the objection, why, we'll have the matters heard outside the presence of the jury. We'll take a recess. (Emphasis added).\n\nMr. Quane's prejudicial statement could obviously cause a multitude of questions to arise in any juror's mind. It is foreseeable that jurors unfamiliar with civil lawsuits and settlements could reach the prejudicial Conclusion that the Robertsons had already received damages for their injury and that it was, in fact, Dr. Bjornson who was solely liable for Mrs. Robertson's injuries. This is especially true in light of the later jury confusion that developed with respect to the proximate cause issue, which was discussed above.\n\nObviously, it would be beneficial to his client if Mr. Quane raised the questions and Conclusions in the minds of the jury, it is not difficult to deduce why he intentionally inserted the $5,000,000 figure into his question. All speculation triggered by such a prejudicial question was detrimental to plaintiffs and a fair trial, while such speculation benefitted the defense.\n\nAccordingly, Robertson's counsel objected and immediately moved for a mistrial, costs and attorney fees on grounds of extreme unfair prejudice.\n\nWhen the Robertsons stated to the court that Mr. Quane's question was not a fluke or mistake, but was planned and calculated to cause prejudice for whatever advantage could be gained, Mr. one admitted:\n\nI planned it, Your Honor, because it was legitimate as impeachment of the plaintiffs in my opinion, and I intend to impeach the plaintiffs by the Complaint if I can get to that point in the trial. (Emphasis added).\n\nBrushing aside the statute's prohibition, Mr. Quane justified his misconduct by claiming that according to \"Bells Handbook\" he was entitled to prove Dr. Bjornson's negligence and impeach the Robertsons by showing the jury that the Robertsons had previously alleged Dr. Bjornson was negligent in the Complaint. He also argued the mere fact Dr. Bjornson had been sued was relevant to show his bias against Dr. Richards, however, he never even attempted to explain that point.\n\nUltimately, the court sustained the Robertson's objection to the question and stated that the question was improper. However, notwithstanding the clear language of I.C. § 10-111, the court erroneously ruled that the statute did not control the decision on whether to grant a mistrial.\n\nAfter a lengthy recess, the court stated to the jury:\n\nI am going to give you an instruction at this time, and I'll state it to you, ladies and gentlemen of the jury, a question had been asked this doctor why he had been sued by the plaintiffs. The Court must be cautious in making any statement as to the procedures or approaches of a party who brings a lawsuit. But it is a fact that multiple parties may be named in a lawsuit, but at trial the claim may be only against part of any parties originally named. At this point of the trial it's extremely immaterial that Dr. Bjornson may have been named as a party.\n\nTherefore, I instruct you that the statement in its entirety should be disregarded by you. You need to cast if from your minds and not let it play any part in your deliberations in this case, and not have any bearing on your decision in the case. It should not be given any weight.\n\nI hope, with that instruction that you will be able to decide this case on its merits, and we'll go ahead with the trial. (Emphasis added).\n\nThe morning after the Robertson's request for mistrial was denied, defense counsel once again argued in chambers that he was entitled to ask Dr. Bjornson whether he was a defendant at the time of his deposition and at the time of trial, in order to show Dr. Bjornson's bias and prejudice against Dr. Richards and inconsistency in his testimony. This conference was not recorded but it is recalled by all counsel. Memorandum in Opposition to Plaintiffs' Motion for judgment Notwithstanding the Verdict or for New Trial.\n\nThe Robertsons agreed that such testimony under some circumstances might be relevant to show bias or inconsistency. However, they argued that there was nothing to even hint at actual bias or inconsistency by Dr. Bjornson, and even if there were, admission to the evidence would he outweighed by the unfair prejudicial effect of indirectly disclosing to the jury that Dr. Bjornson had been sued for $5,000,000 and had settled. The court ruled in chambers that defense counsel would be permitted to ask Dr. Bjornson if he had been a defendant at the time of his deposition and if he was still a defendant.\n\nBecause of the in chambers ruling, no objection was made when the evidence came in, in order that less attention would be drawn to it. However, to prevent improper argument and similar testimony by other former defendant doctors, the Robertsons subsequently filed a Motion in Limine.\n\nAs the trial came to a close, Mr. Quane once again tried to put the $5,000,000 question before the jury as revealed by Defendant's Requested Jury Instruction Number 32. That instruction would have again specifically called the jury's attention to the $5,000,000 prayer in the Complaint and even asked the jury to disregard the court's prior instruction:\n\nI previously instructed you to disregard in your determinations the question propounded to Dr. Bjornson, Plaintiffs' witness, by Defendant's Counsel, which stated: \"Explain to the jury, then, why\n\nGeorge and Leah Robertson sued you for over $5,000,000 for failing to diagnose the fractured odontoid process.\" This instruction is withdrawn. You may consider in your determinations that the fact that Dr. Bjornson was at one time a defendant in this matter, and gave certain testimony in his deposition that may be interpreted to be inconsistent with the testimony he gave at trial. This evidence has been admitted. (Emphasis added).\n\nThe court properly refused the instruction. However, during closing, Mr. Quane again brought the pleadings before the jury by arguing that Dr. Bjornson must be negligent because the Robertsons sued him and he settled:\n\nWell, I think the proof in the pudding, the real proof in the pudding, regardless of what Mr. Peck says, relates to the fact that Dr. Donald Bjornson was a defendant. And he was sued by Leah and George Robertson.\n\nWhy would they sue him? If, as they claim now, that he came to the emergency room only for the purpose of fixing a fractured leg and he had absolutely nothing to do with the treatment of her neck. To me that's the acid proof of why Dr. Bjornson was in the emergency room.\n\nBut really don't actions speak louder than words? (Emphasis added).\n\nThe trial transcript shows Mr. Quane continued to belabor the point until the trial court sensed the prejudice and the court interrupted. The following argument ensued in the presence of the jury.\n\n\"THE COURT: Mr. Quane, I guess I am going to have to interrupt at this point. Early in this trial the Court made a -- gave an instruction from the bench, and it was in regard to the questions propounded to Dr. Bjornson in regard to him having been sued. And I told the jury at that time to disregard that question and the answer in its entirety. I told them that it was not to have any hearing on their decision in the case, and it should not be given any weight. And I think to bring it up now takes away from that instruction.\n\nMR. QUANE: Your Honor, the next day, though, you allowed me, and counsel agreed, that I could ask him if he was a defendant when he testified in his deposition and he wasn't when he testified in court. And that's why I am basing this --\n\nTHE COURT: I mean, I would have to remind the jury that that was my instruction. That . . .\n\nMR. QUANE: Well --\n\nTHE COURT: Does not have any bearing in this case, and I told them to no -- well, not to consider it.\n\nMR. QUANE: Well, Your Honor, it came in the next without objection from them and by agreement of everybody including the Court. You said I could ask that question if you recall.\n\nTHE COURT: No, I don't recall that.\n\nMR. QUANE: Well . . . Your Honor, you said I could ask him on the witness stand if he was a defendant when he testified in his deposition, and that he wasn't a defendant in the case when he testified in court. And that came without objection, Your Honor, and this is damaging to me to have this come up like this. And I represent to the Court that that was the ruling.\n\nTHE COURT: I don't know if we can find it in the record. We might take a search.\n\nMR. QUANE: They didn't object.\n\nMR. PECK: Your Honor, the reason I am not responding is because I don't think it's proper in front of the jury to argue my case or argue the motion.\n\nMR. QUANE: I am sorry, but it just startled me.\n\nMR. PECK: It is okay. I am just not going to talk about what was discussed in chambers.\n\nMR. QUANE: It came in without objection. You will agree with that, Mr. Peck?\n\nMR. PECK: I am not going to comment on it in front of the jury.\n\nMR QUANE: Your Honor, I think -- I think I'm entitled because you brought this up in this fashion, and I would like to have a recess and take it out of the record because it did.\n\nTHE COURT: Well, let's take a short recess at this time, ladies and gentlemen of the jury; remember the admonition previously given; go ahead and file out. (Emphasis added).\n\nAgain the jury was ushered out of the courtroom and, upon their return, the court instructed the jury that they had previously been told to disregard the improper question, but now they could consider Dr. Bjornson\"s defendant status in their deliberations since that evidence had come in subsequently. The court did not limit the argument to the purpose of showing bias or inconsistency by Dr. Bjornson, but allowed it to be used for the improper inference that Dr. Bjornson was negligent because he had been sued and settled:\n\nTHE COURT: Jury is back in place after a short recess.\n\nThe Court needs to make a short explanation to you. It's become necessary for the Court to make some check on the record as to some of the procedures that took place in initial court proceedings. And I apologize to Mr. Quane. I interrupted him and stopped the flow of his argument. But the Court did give you an earlier instruction in this case when a question was directed by Dr. Bjornson about why he had been sued by the Robertsons. The Court feels that it must make some additional remarks from the bench.\n\nI told you at that time that it was entirely immaterial that Dr. Bjornson may have been sued. The next day the Doctor was asked whether he was a defendant in the suit when he gave his deposition, and that was allowed. Since that evidence did come in and was allowed, Counsel is entitled to discuss it in his closing argument.\n\nSo I apologize. May apologies to you Mr. Quane, and the Court did feel it necessary to do some checking in the record on that. But it did come in the next day. (Emphasis added).\n\nThe incident thus graphically re-emphasized in the jury's mind Mr. Quane's improper 5 million dollar question immediately before the jury was to begin deliberating. Defense counsel ended with another prejudicial and improper inference of Dr. Bjornson's \"guilt\" because he had settled and was no longer \"fighting\" the case:\n\nAnd I think it would be an unequivocal distortion of Justice and an absolute falsery to say on that verdict form that Jim Richards was negligent and to condemn him. All he has is his practice and his pride, and this man has sat here for four weeks fighting this case and fighting. He can't even practice medicine, but he's here and he's fighting. Dr. Donald Bjornson isn't fighting. He isn't here in this court, and he isn't defending. I think his (Richards') willingness to do this emphasizes his sincere and unabiding belief in his innocence. And if he's guilty of anything, he's guilty of saving her life. (Emphasis added).\n\nThe jury returned a verdict attributing no liability to Dr. Richards. There was no legitimate reason for defense counsel to tell the jury that $5,000,000 was the amount for which the Robertsons had sued Dr. Bjornson. During the arguments on plaintiffs' Motions for mistrial and for new trial, counsel for defendant never articulated a justification for revealing the $5,000,000 figure, although he readily admitted that he had planned the question in advance.\n\nOnce the jury heard the $5,000,000 figure, the prejudicial questions and Conclusions that naturally arose in their minds were so fixed that they could not be case aside or ignored based on any instruction by the Court. The prejudice was subsequently and constantly worsened by Mr. Quane's persistent reference to Dr. Bjornson's negligence. The Robertsons were unfairly prejudiced because they were in the awkward position of not being able to rebut Mr. Quane's improper attacks by telling the whole story to the jury. Complete disclosure of the settlements with the other\n\ndoctors would have had an equally powerful prejudicial influence upon the jury to either absolve Dr. Richards of all liability or adjust the damage award in line with the earlier settlements. As other courts note:\n\nA jury might conclude that the settling Defendant was the party primarily responsible for the injury, and that the remaining Defendants should therefore be exonerated. De Lude v. Rimek, 351 Ill.App. 466, 473, 115 N.E.2d 561, 565 (1953). It might take the amount of a settlement as a measure of the Plaintiff's damages. Orr v. Coleman, supra, 455 S.W.2d at 61. It might consider one Defendant's settlement to be an admission of negligence, and then impute this negligence to a non-settling defendant. Azure v. City of Billings, 596 P.2d 466 (Mont. 1979). Slayton v. Ford Motor Co., 435 A.2d 946, 947 (Vt. 1981).\n\nIn Young v. Verson All Steel Press Co., 539 F.Supp. 193 (E.D. Penn. 1982), the court refused to allow a settlement to go before the jury, noting:\n\nImplicit in Federal's position must be the belief that a jury will be less likely to render a large damage award if they are aware that plaintiff has already been compensated by former Co-Defendant, viz Verson.\n\n539 F.Supp. at 194.\n\nThe trial court's attempt to cure the prejudice in this case may well have actually emphasized it. The objection, the lengthy recess, and the initial instruction by the court to disregard the question could naturally raise in the minds of the jury the feeling that they had not heard the whole story and that the Robertsons were keeping them from something important relating to the $5,000,000 question. This is the very quality that requires reversal:\n\nIt seems to be the invariable quality of questions the asking of which may require a reversal that in themselves, and without any answers made, they call to the attention of, or suggest to, the jury some fact or claim prejudicial to the opposite party and concerning which counsel has no right to inquire, and in almost every instance of such misconduct, opposing counsel is necessarily placed in the false light of suppressing significant circumstances and attempting to deceive the jury into rendering an unjust verdict. (Emphasis added).\n\n75 Am.Jur.2d Trial. § 194, p. 277 (1974); See also, Thomas v. Byron Tp., 168 Michigan 593, 134 N.W. 1023 (1912); Myers v. Moffatt, 312 S.W.2d 59, 64 (Mo. 1959).\n\nThis case illustrates why a violation of I.C. § 10-111 is a ground for mistrial; it creates prejudice usually incapable of correction. The court's initial instruction only addressed the issue of Dr. Bjornson's status as a former defendant. It did nothing to dispel Mr. Quane's inference that $5,000,000 or some substantial amount had been obtained from Dr. Bjornson. Further, when the whole issue was brought up again in closing argument, the court revoked its initial instruction leaving the jury with the impression they could consider the improper question for purposes of liability and negating any cure that may have existed.\n\nIdaho Code § 10-111 prohibits \"any person\" from disclosing to the jury the amount of damages sought in a civil case so that the amount will not have an influence on the jury in resolving the factual issues, including liability. Since the complaint, both in its body and prayer, sought the same $5,000,000 from each health care provider, jointly and severally, the mention of the figure as against one violated the statute directly if the jury were to surmise that each were sued for the like amount. On the other hand if, as argued by the defense, the jury might have speculated that Dr. Bjornson and Dr. Richards were sued for different amounts, then the question would be leading the jury to believe something which was not true. Once the statute has been violated, attempts to correct it only re-emphasize the improper influences raised in the minds of jurors.\n\nIdaho Code § 10-111 originated as House Bill 474 in 1976, backed by the Idaho Medical Association and the Idaho Hospital Association. Eugene Thomas, attorney for the IMA explained the bills were designed\n\nto speak to the \"sky-rocketing cost of insurance to doctors and hospitals\" and create a \"climate conducive to competition in the insurance field which will result in insurance at a fair price.\" He also discussed the reason for House Bill 474:\n\nMr. Thomas explained that this bill would provide the means whereby a jury could render a verdict on the basis of the evidence rather than being influenced by the amount of the damages being sued for. Minutes of the Joint Meeting of the Idaho House Judiciary, Rule and Adminstration Committee, and Health and Welfare Committee, p. 2 (February 5, 1976).\n\nMr. Thomas explained that this restriction provides that the portion of the complaint setting forth the dollar amount (The \"ad damnum\" portion) will not be allowed in the trial. The reason is that the insurance industry feels it distorts the jury's view of the case. (Emphasis added).\n\nMinutes of Idaho House Health and Welfare Committee, p. 1 (January 30, 1976).\n\nThe statute also protects the policy of Idaho law to encourage settlements. Rojas v. Lindsay Manufacturing Co., supra at 592, 701 P.2d at 212. One-sided application of the statute would discourage settlements in cases with multiple defendants and, thus, be contrary to the statute's purpose for reducing medical malpractice insurance costs.\n\nAn attorney's intentional, inflammatory, and unfair tactic to violate the statute and confuse and unfairly prejudice the jury should not be tolerated. Such tactics require the firm application of I.C. § 10-111, which requires a mistrial and leaves no discretion to the trial court Judge. Thus, a new trial is required under I.R.C.P. 59(a)(1) because this \"irregularity in the proceedings\" prevented the Robertsons \"from having a fair trial.\"\n\nReversed and remanded for new trial. Costs to appellant.\n\nBAKES, J., Concurring in part and Dissenting in part:\n\nI concur in that part of Part I of the majority opinion which reverses the trial court's denial of the motion for new trial and remands to the trial court to reconsider the motion for new trial based upon an independent evaluation of the evidence. Such was the outcome of our original opinion in this matter filed October 27, 1987 (1987 Opinion No. 94). Under a proper analysis of the issues involved here it would still be the appropriate result, although the majority's reversal and remand for a new trial now makes the issue essentially moot. I also concur in Part III(A) regarding the applicable negligence standard in medical malpractice cases. However, as to Parts II and III(B), I respectfully Dissent.\n\nIn Parts II and III(B), the Court today, after rehearing, reverses its original opinion in this matter. That earlier opinion unanimously held as to Part II that the failure to give the proximate cause instruction was not error because the jury found no negligence on the part of the defendant Dr. Richards, and thus the proximate cause issue was moot. The Court came to that Conclusion even before our recent decision and opinion in Hickman v. Fraternal Order of Eagles, 114 Idaho 545, 758 P.2d 704 (1988), which held that \"the issue of the presence or absence of proximate cause does not come into play until and unless underlying negligence is found.\" 114 Idaho at , 758 P.2d at 708. As to Part III(B), our earlier 1987 opinion correctly recognized that the question asked of Dr. Bjornson was proper cross examination which was not precluded by I.C. § 10-111. I believe the Court errs today when it reverses itself on those two issues.\n\nI\n\nThe majority's treatment of the \"missing proximate cause instruction\" in Part II is inconsistent both with our prior opinion in this matter, Robertson v. Richards, 1987 Opinion No. 94, filed October 27, 1987, and with our recently released unanimous opinion in Hickman v. Fraternal Order of Eagles, 114 Idaho 545, 758 P.2d 704 (1988). Like Hickman,\n\nthe jury in this case found no negligence on the part of Dr. Richards. The first question on the special verdict form reads as follows:\n\n\"'We, the jury, answer the questions submitted to us in the special verdict as follows:\n\n\"'QUESTION NO. 1. Was there any negligence on the part of the Defendant James Richards which was a proximate cause of an aggravation of injuries to Leah Robertson?'\n\nAnswer: Yes No X \"\n\nIn our original opinion in this matter, filed October 27, 1988, we held that the \"missing proximate cause instruction\" was not error, stating:\n\n\"The record reflects that at the jury instruction conference the parties and the court agreed upon an instruction defining proximate cause, but in the instructions actually read and submitted to the jury that instruction was omitted. The parties are in disagreement as to why the instruction defining proximate cause did not get submitted to the jury. The district court found that the instructions agreed on at the instruction conference were given to the appellants' secretary for typing, and that in the typing process the instruction was lost by the appellants' typist.\n\n\"While the appellants contest the district court's finding of their typist's responsibility for the loss of the instruction, we need not resolve that dispute in order to dispose of the issue. First, the jury, in its special verdict, did not find Dr. Richards negligent, and therefore the issue is essentially moot. The absence of a proximate cause definition does not constitute error where the jury found that no negligence existed on the part of Dr. Richards. It is essential that negligence exists before the proximate cause issue rises. Jones v. Robert E. Bayley Constr. Co., Inc., 674 P.2d 679, 683 (Wash.App. 1984) ('In this case, however, the jury determined by special verdict that Bayley was not negligent, so they did not reach the issue of proximate cause. The error was, therefore, harmless.').\" 1987 Slip Op. No. 94, at 11-12 (emphasis added).\n\nFurthermore, as our earlier opinion in this case pointed out, proximate cause has a common understanding. Professor Prosser states that it is not really necessary for courts to instruct on its definition and that attempts to define the concept have been confusing at best. As we stated in our October, 1987, opinion in this case:\n\n\"Whether or not the failure to define proximate cause in a jury instruction is error, much less reversible error, is questionable. See Prosser, Proximate Cause in California, 38 Cal.L.R. 369 (1950). Several courts have held that the terms 'cause' and 'proximate cause' are of sufficiently common usage and understanding and that a jury may be fairly expected to understand them without a definitional instruction. Stoneburner v. Greyhound Corp., 375 P.2d 812, 816 (Or. 1962) ('As a matter of caution, trial courts submit instructions on proximate cause, but such instructions are unnecessary where in the very nature of things the alleged acts of negligence, if true, necessarily formed a part of the efficient cause, and the law itself would draw that inference.'). See also Quigley v. School Dist. No. 45J3, 446 P.2d 177 (Or. 1968). We need not decide in this case that question, however, given the circumstances here where the jury concluded that Dr. Richards was not negligent. Under the circumstances of this case, appellants' assignment of error regarding failure to give an instruction defining proximate cause is without merit.\" 1987 Opinion No. 94 at 12-13 (emphasis added; footnotes omitted).\n\nThe Court's opinion today does not even attempt to explain why what was written in this case last year is incorrect.\n\nEven more inexplicable is the majority's reasoning in its cursory attempt to distinguish Hickman. In Hickman, this Court unanimously held that, where the jury finds no negligence, any error regarding a proximate cause instruction \"is moot, because\n\nthe issue of the presence or absence of proximate cause does not come into play until and unless some underlying negligence is found.\" Idaho at , 758 P.2d at 708. The Court's opinion today acknowledges that \"there is little difference between the error promulgated by an erroneous instruction and the error promulgated by utterly neglecting to give that same essential instruction to the jury altogether.\" Ante at 12-13. Having said that, Hickman should be the controlling authority.\n\nHowever, the majority attempts to distinguish Hickman, stating:\n\n\"This case is distinguishable from Hickman in that in the instant case Instruction No. 16, supra, which provided that guidance to the jury as to how it was to determine the presence or absence of negligence, specifically directed the jury to do so with reference to the requirements of the missing proximate cause instruction. Therefore, the missing instruction would have a direct influence on the determination of negligence in the first instance, which was not the case in Hickman, supra. Thus, the failure to include the essential proximate cause instruction requires the granting of a new trial.\"\n\nThis attempt to distinguish the Hickman case is wrong for at least two reasons.\n\nFirst, Instruction No. 16 was directed at the negligence of the \"other health care providers,\" and had nothing to do with the jury's analysis of the defendant Dr. Richards' alleged negligence. Instruction No. 16 states in full:\n\n\"INSTRUCTION NO. 16\n\n\"In regard to your determination of whether other health care providers were negligent, you will make that determination based upon these instructions, and in order to conclude that other health care providers were negligent, you must so find by a preponderance of the evidence as defined in these instructions.\n\n\"In regard to your determination of whether the negligence of other health care providers proximately caused injuries sustained by Plaintiff Leah Robertson, you will make that determination based upon these instructions, and in order to conclude that the negligence of other health care providers proximately caused injuries, you must so find based on the definition of proximate cause as contained in these instructions and by a preponderance of the evidence as contained in these instructions.\" (Emphasis added.)\n\nIt is clear from reading Instruction No. 16 that it relates only to the jury's \"determination of whether [the] other health care providers were negligent.\" It has nothing to do with the jury's determination of the defendant Dr. Richards' negligence. The instruction which told the jury how they were to analyze the plaintiffs' claim against the defendant Dr. Richards was Instruction No. 15, which states:\n\n\"INSTRUCTION NO. 15\n\n\"The plaintiffs have the burden of proving each of the following propositions:\n\n\"1. That the defendant Richards was negligent;\n\n\"2. That the negligence of defendant Richards was a proximate cause of injuries sustained by them;\n\n\"3. The nature and extent of the injuries, the elements of damage, and the amounts thereof.\"\n\nInstruction No. 15 in this case is practically identical to the instruction given in Hickman.[Footnote 1] Under Instruction No. 15 in Hickman, and under the practically identical\n\ninstruction in this case, the jury's deliberation was guided, setting out each of the steps necessary in order to find liability on the part of the defendant Dr. Richards. In both cases the instructions first required the jury to find that the defendant was negligent. Only after finding the defendant negligent was the jury to take the next step to determine whether \"the negligence of the defendant [Hickman] [Richards] was a proximate cause of the injuries sustained by [plaintiffs].\" In Hickman we held that \"an issue having to do with the semantics of the proximate cause instruction is moot, because the issue of the presence or absence of proximate cause does not come into play until and unless some underlying negligence is found.\" Idaho at , 758 P.2d at 708. The majority's analysis in this case fails to recognize that the juries in both Hickman and this case were identically instructed that they must first determine the question of negligence before they addressed the question of proximate cause, as Hickman held. That sequence of analysis was further emphasized by the instructions in this case; e.g., Instruction No. 12, which the majority approves, reads as follows:\n\n\"INSTRUCTION NO. 12\n\n\"The plaintiffs in a medical malpractice case have the burden of proving, by direct expert testimony and by a preponderance of all competent evidence, that at the time and place of the alleged incident in question, the defendant negligently failed to meet the applicable standard of health care practiced in the community in which such care allegedly was or should have been provided as such standard then existed with respect to the class of health care provider to which the defendant belonged and in which he was functioning.\n\n\"In addition, the plaintiffs have the burden of proving that the negligence of the defendant was a proximate cause of the injury and damage to the plaintiffs, and the amount thereof.\" (Emphasis added.)\n\nThus, the instructions in this case and the instructions in Hickman are identical with regard to the jury's analysis of whether the plaintiff has met his burden of proof. Hickman held that where the jury finds in the first step of its analysis that there was no negligence, the question of whether or not there was error in the second step of the analysis, i.e., the proximate cause instruction, is a moot issue.\n\nThe second paragraph of Instruction No. 16, which the majority concludes distinguishes this case from Hickman, does not sustain the majority's argument. A careful reading of Instruction No. 16 clearly demonstrates that it had nothing to do with the jury's analysis of the defendant Dr. Richards' negligence, but was directed toward the negligence of the \"other health care providers.\" The jury never got to that part of the special verdict dealing with the negligence of the \"other health care providers\" because the jury found that Dr. Richards was not negligent. The failure of the majority to analyze Instruction No. 16 in its entirety, rather than merely looking at a small portion of it, leads it into error. Instruction No. 16 had nothing to do with the jury's analysis of defendant Dr. Richards' conduct. That was controlled entirely by Instruction No. 15 and the definition of negligence in Instruction No. 12, which the majority acknowledges was correct, ante at 14. Therefore this case is indistinguishable from Hickman, based upon the identical Instructions No. 15 which were given in both cases. Accordingly, in my opinion, the majority errs in not concluding, as we did in Hickman, and as we did in our earlier opinion in this case, that there was no reversible error by the trial court's inadvertent failure to give the instruction on the definition of proximate cause.\n\nSecondly, the majority's analysis fails to recognize the longstanding sequence of proof required in negligent tort cases. It is hornbook law, reflected in both the instant case and in Hickman, that a prima facie case involves distinct elements, and each element must be proven before the succeeding element is given consideration. The majority opinion, however, erroneously states that a new trial should be granted\n\nbecause \"the missing [proximate cause] instruction would have a direct influence on the determination of negligence in the first instance.\" Ante at 13. This statement is clear legal error. The determination of negligence in the first instance has no connection whatsoever with proximate cause. Negligence, as reflected in the instructions given here and in Hickman, involves a determination revolving around the reasonable man standard or, in the case of medical malpractice, \"the applicable standard of health care practiced in the community.\" It is only after the jury has determined that a defendant has acted contrary to the applicable standard that the proximate cause issue is reached. Proximate causation is not dealt with as part of the threshold negligence determination; rather, it is a separate issue in and of itself, demanding consideration only if and when the threshold negligence determination is made in the affirmative. Hickman v. Fraternal Order of Eagles, supra. Accordingly, the majority's statement that the missing proximate cause instruction would have a direct influence on the determination of negligence in the first instance ignores the proper analysis applicable to negligent tort cases, eviscerates the clear legal distinction between the proximate causation and negligence elements of a tort claim, and conflicts sharply with the rationale in our Hickman case.\n\nIn sum, the majority's cursory attempt at distinguishing Hickman is fatally flawed due to an erroneous reading of a portion of Instruction No. 16, and due to its failure to distinguish the separate concepts of negligence and proximate cause. Our original unanimous opinion in this matter correctly decided this issue. Accordingly, I Dissent from Part II of the majority opinion.\n\nII\n\nI also Dissent from Part III(B) of the majority opinion. The majority reverses and remands for a new trial because defense counsel's question on cross examination of Dr. Bjornson allegedly violated I.C. § 10-111. Ante at 18.\n\nI.C. § 10-111 was enacted to prevent jury prejudice regarding the amount of the claim which that jury had to evaluate. I.C. § 10-111 has no application to any other case than the one the jury is to decide. Nor does it have any effect on the cross examination of a witness to establish prejudice or bias. The proper scope of cross examination of a witness is determined by the Idaho Rules of Evidence, not by I.C. § 10-111. See I.R.E. 1102.\n\nThe purposes behind I.C. § 10-111 are specifically set out in that section. It states that \"it is against the policy of the state of Idaho for the jurors [who are] required to make such determinations [general damages] to be informed of the particulars of allegations of damages in the pleadings on file with the court, by the arguments of counsel or otherwise, the dollar amount appraisal or evaluation of such damages being the exclusive province of the trier of fact . . . .\" The statute prevents the parties from telling the jury what the litigants think the ultimate dollar amount of the jury's verdict should be in the case they are deciding. However, the question which Dr. Richards' counsel asked Dr. Bjornson did not involve the \"determinations\" which \"the jurors [were] required to make\" in appellant's lawsuit against Dr. Richards. Rather, it involved the amount which Dr. Bjornson had been sued for, which suit had been settled and was not before the jury. That cross examination was for the purpose of impeaching Dr. Bjornson's testimony which was offered to prove that the cause of appellant's injuries was attributable entirely to the negligence and fault of the defendant Dr. Richards. Dr. Richards' counsel's purpose in asking Dr. Bjornson the disputed question was not to disclose to the jury the amount of damages being sought from Dr. Richards (in fact, it gave no clue regarding the amount plaintiffs were seeking from Dr. Richards - it only contained information about plaintiffs' now-settled claims against Dr. Bjornson); rather, counsel's purpose was to counter and impeach the testimony of Dr. Bjornson that it was Dr. Richards' negligence, not his own, which caused plaintiff her injuries.\n\nAt trial Dr. Bjornson testified that the original X-ray taken when the plaintiff was admitted to the emergency room disclosed the broken neck which he testified at trial he could observe in the X-ray from \"ten paces away.\" But there was testimony that the witness Dr. Bjornson had viewed that X-ray in the emergency room that same evening, yet he said nothing and took no action regarding the broken neck. Furthermore, the radiologist, Dr. Richardson, and presumably the neurologist, Dr. Amick, had examined the X-ray and neither apparently identified the broken neck which Dr. Bjornson testified that he could now see from \"ten paces away.\" Thus, Dr. Bjornson's testimony at trial, to the effect that the fault was entirely Dr. Richards' and not his own, was subject to serious question.\n\nThe right to cross examine Dr. Bjornson to display any bias or prejudice which might have resulted from a favorable settlement given to Dr. Bjornson, in exchange for his testimony against the defendant Dr. Richards, was critical to the defense. The majority opinion does not assert that it was error for Dr. Richards' counsel to impeach Dr. Bjornson by pointing out that he too had been sued by the plaintiff in this case. The majority apparently acknowledges, and correctly so, that it was permissible to impeach Dr. Bjornson's testimony by pointing out that he too had been sued but had settled prior to the trial. Rule 408, Idaho Rules of Evidence expressly permits that. I.R.E. 408 states that while evidence of compromises and settlements is not admissible to prove liability \"[t]his rule does not require exclusion if the evidence is offered for another purpose, such as proving bias or prejudice of a witness. . . .\" (Emphasis added.) Here, the evidence was being introduced not to prove Dr. Bjornson's liability (that issue having been previously disposed of via an out-of-court settlement), but to impeach Dr. Bjornsen's credibility. Accordingly, under I.R.E. 408 the evidence elicited by this form of cross examination was admissible.\n\nThe slender reed upon which the majority reverses is not the fact that Dr. Richards' counsel's question on cross examination disclosed that Dr. Bjornson had been sued, but that the question also disclosed the amount for which he had been sued. However, the purpose behind I.C. § 10-111 is to prevent the jury from being informed of the amount claimed for general damages in the case which the jury is deciding. Nothing which Dr. Richards' counsel stated informed the jury how much the plaintiff was seeking from Dr. Richards, the issue which they, the jurors, were to decide. Accordingly, the express purpose of the statute has not been violated.\n\nFurthermore, I.C. § 10-111 itself contains an exception designed for cases such as this. The final sentence of that section states that \"provided, this act shall not be construed to prohibit proof of damages or presentation of arguments which are legally relevant and proper in view of the record and issues before the court in any action for money damages.\" The disputed cross examination of the witness Dr. Bjornson was \"legally relevant\" for impeachment purposes, and therefore even if it were covered by the first portion of I.C. § 10-111, which it is not, the last provision of I.C. § 10-111 would not exclude \"proof of damages or presentation of arguments which are legally relevant\" to the issue of impeachment of the witness Dr. Bjornson.\n\nThis exception in I.C. § 10-111 recognizes that the amount of damages sought can be disclosed to the jury if it is \"legally relevant.\" Under both our prior cases and the Idaho Rules of Evidence, the cross examination which occurred here was \"legally relevant,\" and admissible. I.R.E. 607 states that \"[t]he credibility of a witness may be attacked by any party including the party calling him.\" Additionally, I.R.E. 611(b) states that a party may be cross examined on matters affecting his credibility as a witness.\n\nThis Court's cases, prior to the adoption of the Rules of Evidence, also acknowledge that cross examination is proper\n\n\"not only as to all facts stated by a witness in his original examination, but as to other facts connected with them, directly or indirectly tending to explain,\n\nmodify or qualify the inference resulting from the facts stated by the witness in his direct examination.\" State v. Starry, 96 Idaho 148, 525 P.2d 343, 345 (1974), quoting Towne v. Northwestern Mutual Life Ins. Co., 58 Idaho 83, 91, 70 P.2d 364, 366 (1937).\n\nMore recently, in State v. Baruth, 107 Idaho 651, 691 P.2d 1266 (Ct.App. 1984), our Court of Appeals reiterated that the purpose of cross examination is to weaken the testimony of the party examined.\n\nDirectly in point is Hall v. Bannock County, 81 Idaho 256, 340 P.2d 855 (1959). In Hall it was held that it would have been proper to permit a doctor witness to indicate whether he was a party in the original action, even though the trial court, in the exercise of its discretion, did not allow the doctor to answer the question. This Court in Hall stated:\n\n\"Appellants' first assignment claims error for the reason that the trial court sustained an objection to the following question addressed to Dr. O. F. Call under cross-examination:\n\n'Q. Doctor, in this regard at the time this action was commenced you were a party to the original action, is that right?'\n\n\"Appellants argue that the question was asked for the purpose of showing interest and bias on the part of the witness.\" 81 Idaho at 261, 340 P.2d at 857.\n\nThis Court agreed with appellants' contentions in this regard, stating:\n\n\"This Court has repeatedly held that the scope or extent of cross-examination tending to show interest or bias rests largely in the sound discretion of the trial court. [Citations omitted.] The answer sought only remotely tended to show bias. Although it would have been proper to permit the witness to answer the question we do not consider the ruling an abuse of discretion or prejudicial error.\" 81 Idaho at 261, 340 P.2d at 857-858 (emphasis added)\n\nIn the present case the trial Judge ultimately exercised his discretion and permitted Dr. Richards' counsel to impeach the witness, Dr. Bjornson, by cross examining him regarding the fact that he had been sued for $5,000,000 as a defendant in the original action, and to argue that point to the jury. The majority opinion today seemingly overlooks the holding in the Hall case that \"it would have been proper to permit the witness to answer the question\" regarding his being sued in the same action. Neither does the Court acknowledge that whether such cross examination is allowed \"rests largely in the sound discretion of the trial court.\" Hall v. Bannock County, 81 Idaho at 261. Where the trial court properly identifies the law and applies the law to the facts, then the trial court's discretion has not been abused, even if this Court would disagree in the result, as was the case in Hall v. Bannock County, supra. In Avondale On Hayden, Inc. v. Hall, 104 Idaho 321, 658 P.2d 992 (Ct.App. 1983), the Court of Appeals describes the analysis an appellate court must make in determining whether a trial court has abused its discretion. Nowhere in the majority opinion, however, is an abuse of discretion analysis made of the trial court's decision which ultimately allowed the defense to use this cross examination of Dr. Bjornson. Rather, the majority opinion clings to an over-expansive interpretation of the first portion of I.C. § 10-111, ignoring the exception contained at the end thereof which permits the \"presentation of arguments which are legally relevant and proper in view of the record and issues before the court . . . .\" Id.\n\nThere was no abuse of discretion in the district court's ruling, and under any test - be it this Court's prior decisions, the Idaho Rules of Evidence, or I.C. § 10-111 - the cross examination of Dr. Bjornson which occurred in this case was a proper mode of impeachment for bias and prejudice.\n\nFinally, even if I.C. § 10-111 applied to the question asked in this case, it would be contrary to the Rules of Evidence as they apply in this case, and it would have to yield to the superior authority of the Idaho Rules of Evidence. I.R.E. 1102 states:\n\n\"Rule 1102. Effect on evidentiary statutes and rules. --Statutory provisions and rules governing the admissibility of\n\nevidence, to the extent they are evidentiary and to the extent that they are in conflict with applicable rules of Idaho Rules of Evidence, are of no force or effect.\"\n\nEven though I.C. § 10-111, when properly applied in this case, is not in conflict with the Rules of Evidence that apply to the instant issue, if it did conflict it would have been rendered \"of no force or effect\" due to the preemptive effect of I.R.E. 1102. The cross examination which occurred here was expressly authorized by I.R.E. 607 and 611(b).\n\nToday's opinion is a complete departure from our earlier opinion issued October 27, 1987, and from several prior decisions of this Court. That earlier opinion correctly held that there is no legal basis for reversing the decision of the trial court, except to remand the matter for the correct evaluation of the motion for new trial which the trial court erroneously evaluated, as set out in Part I of the majority opinion. This Court's original October 27, 1987, opinion correctly decided the other issues in this case, and should be reaffirmed.\n\n",
    "body_length": 158421,
    "citedas": [
      "769 P.2d 505",
      "115 Idaho 628"
    ],
    "attorneys": "Hawkes, Esplin \u0026 Burnham, Pocatello, for plaintiffs-appellants. Da Lon Esplin argued. Quane, Smith, Howard \u0026 Hull, Boise, for defendant-respondent. Jeremiah A. Quane argued.",
    "category": [
      "188"
    ],
    "judges": "Huntley, Justice. Shepard, C.j., and Donaldson,* Bakes and Bistline, JJ., concur. On Rehearing -- Huntley, J. Bistline and Johnson, J.j., concur. Bakes, J., Concurring in part and Dissenting in part. Shepard, CJ., concurs.",
    "citation_count": 2
  }
}
