{
  "id": "yKJgR2YBTlTomsSBfgT2",
  "document": {
    "title": "People v. Zapien",
    "full_title": "THE PEOPLE AND v. CONRAD JESS ZAPIEN AND .",
    "jurisdiction": "California Supreme Court",
    "date": "1993-03-04T00:00:00.000Z",
    "docket": "No. S004762, Crim. No. 26289",
    "body": "Defendant was convicted, following a jury trial, of first degree murder (Pen. Code, § 187, subd. (a))\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e with the special circumstances that the killing was committed during the course of a burglary and an attempted robbery (§ 190.2, subd. (a)(17)). Defendant also was convicted of first degree burglary (§ 459) and attempted robbery (§ 664/211). The jury found that defendant personally used a knife (§ 12022, subd. (b)) and a firearm (§ 12022.5, subd. (a)) in the commission of each offense. The allegations that defendant previously had been convicted of voluntary manslaughter and robbery, and had served prior prison terms for these offenses, were tried to the court and found true. (§ 667, subd. (a), 667.5, subds. (a) and (b).) The penalty phase was tried to the jury, which fixed the punishment at death. After denying the motion for modification of the penalty verdict, the trial court entered judgment accordingly. This appeal is automatic. (Cal. Const., art. VI, § 11, § 1239, subd. (b).) We affirm the judgment.\n\nFACTS\n\nDuring a period of at least one year preceding the May 19, 1984, murder of Ruby Gonzales, she had an affair with Yeyo Blanco, who was married to defendant's sister, Inez Blanco. By April 1984 Yeyo Blanco had moved into Ruby Gonzales's house in Lompoc, in Santa Barbara County. He told his wife that he and Gonzales wanted to get married and that Gonzales was going to have an operation, at his expense, to reverse a tubal ligation so they could have children together.\n\nOn several occasions during this period, Inez Blanco had public arguments and physical altercations with Gonzales and threatened to have her\n\nkilled. On one occasion shortly before the murder, Inez Blanco saw Gonzales wearing an expensive gold bracelet that belonged to Yeyo Blanco. The bracelet bore the name \"Yeyo\" spelled out in diamonds, some of which had come from jewelry that had belonged to Inez Blanco's grandmother. Inez Blanco demanded the bracelet, but Gonzales refused to give it to her.\n\nMay 18, 1984, the day preceding the murder, was the wedding anniversary of Yeyo and Inez Blanco. Inez Blanco, who lived in Lompoc, twice visited her husband at work in Oxnard that day and attempted to hold his hand, but he refused and asked her to leave.\n\nLater that day, Inez Blanco was in her automobile, stopped at a stop sign in Oxnard, when defendant called to her. She had not seen him for a long time and invited him to enter the vehicle. Defendant, who had \"a drug problem,\" asked his sister to loan him money. She declined. Defendant searched under the automobile's floor mats and found some coins which Inez Blanco said he could keep. They later parted, and Inez Blanco drove home to Lompoc.\n\nApproximately 3 a.m. on May 19, 1984, Inez Blanco was awakened by a telephone call from defendant, who asked for an advance of money from their mother's estate, of which Inez Blanco was executrix. She refused. Inez Blanco later told a police officer that her brother had seemed desperate for money.\n\nShortly after 5 a.m. that day, Yeyo Blanco left Ruby Gonzales's house to go to work, leaving the front door unlocked. Gonzales was awake but remained in bed. Yeyo Blanco drove by his wife's home and noticed that her Oldsmobile Cutlass automobile was not there.\n\nSoon after Yeyo Blanco left the house, Gonzales's 13-year-old daughter Marci was awakened by the sound of her mother screaming for help. Marci seized a broom and ran into the hallway, where her mother was wrestling with a man whom Marci did not recognize. Marci began hitting the man over the head with the broom handle and then, at the urging of her mother, ran to telephone the police. Her mother was yelling, \"Chato, leave me alone. I will give you the money and the jewelry.\" While Marci was using the telephone, she heard a gunshot. She informed the police her mother had been shot, ran back to the hall, and heard two more gunshots. Observing her three younger sisters standing in the hallway, she pushed them into a bedroom, instructing them to remain there. The assailant ran off. Because it was dark, Marci was unable to describe the attacker in detail, but said he was wearing a long-sleeved plaid shirt, a vest, and a baseball cap. Subsequently, a long-sleeved\n\nplaid shirt and a vest were found in the alley behind Ruby Gonzales's house. The shirt was stained with blood, which was analyzed and found to be consistent with the victim's blood.\n\nAn autopsy revealed that Gonzales had been stabbed five times and had been shot three times in the head and once in the shoulder with a .22-caliber firearm. The shots had been fired at close range, and any one of the head wounds would have been fatal and would have rendered the victim immediately unconscious.\n\nShortly after the murder, police investigators spoke with Inez Blanco, who lived a few blocks from the scene of the crime. She told them that her automobile was missing and that she might have left the keys in the vehicle.\n\nWhen Yeyo Blanco returned to Ruby Gonzales's house on the day she was murdered, he removed from her bedroom his gold and diamond bracelet and $600 in cash. Upon being told by Marci that her mother had called the killer \"Chato,\" Yeyo Blanco said he might know who that was, instructed her not to repeat that information to the police or to anyone else, and stated he \"would work everything out.\"\n\nSometime during the month preceding her murder, Ruby Gonzales had been at a restaurant in Oxnard with Yeyo Blanco and happened to meet one of Inez Blanco's brothers, Valentino, who used the nickname Chato. Ruby Gonzales was with Valentino no more than five minutes on this occasion, but evidence was received establishing that, two years earlier, she had worked for a few weeks with Valentino. Valentino was in jail on the date of the murder, but the prosecution introduced into evidence photographs of Valentino and defendant to establish that the two brothers were similar in appearance.\n\nApproximately 9 a.m. on the day of the murder, upon leaving his home in Oxnard (located approximately 100 miles from Lompoc), Pastor Joe Valdez found defendant lying on the seat of an automobile that was parked in front of Valdez's home. For some time, Pastor Valdez had attempted to rehabilitate drug addicts by referring them to Christian homes in various locations around the state. Pastor Valdez had known defendant for 20 years, was aware defendant had \"a drug problem,\" and previously had told him that if he ever felt the need to go to a Christian home, he should see Pastor Valdez. Defendant appeared tired, and Pastor Valdez \"assumed\" he was under the influence of drugs. Defendant said the vehicle he was in belonged to his sister.\n\nAs the men spoke, Pastor Valdez asked defendant whether he was ready to go to a Christian home, and defendant replied he was. Pastor Valdez\n\ntelephoned a colleague who operated a Christian home in Madera, gave him defendant's name, and made arrangements for him to meet defendant at the bus station. Pastor Valdez telephoned the Greyhound bus depot in Oxnard to inquire concerning the bus schedule. Although defendant had no luggage, Valdez did not find that unusual, because in his experience persons often went to Christian homes with nothing \"but the clothes on their back.\" Pastor Valdez did not recall what clothes defendant was wearing that day but stated that defendant frequently wore either a baseball cap or a wool cap.\n\nAbout the time of the murder, defendant sometimes slept in a truck parked at his brother's house in Oxnard. He did not inform anyone at that residence of his plans to leave town.\n\nWhen defendant arrived at the Christian home in Madera, he registered under the false name less Pantoja. He appeared to be suffering from drug withdrawal.\n\nOn May 22, 1984, Inez Blanco's automobile was found in a parking lot adjacent to the Greyhound bus depot in Oxnard. Defendant's fingerprints were found on the outside, driver's side rearview mirror, the inside rearview mirror, and the gearshift lever. The position of the fingerprints found on the gearshift lever indicated defendant was the last person who drove the automobile. As a result of the foregoing circumstances, a warrant was issued for defendant's arrest on a charge of auto theft.\n\nDefendant remained in Madera for nearly two months and then transferred to another Christian home in Phoenix, Arizona, where he registered under the false name Jess Mejia. He informed the director of the program he was wanted by the police and remained there until the program closed several months later.\n\nDuring his stay in Phoenix, defendant also used the false name Jess Moran. He used his roommate's Social Security card to obtain employment, from which he subsequently was discharged when it was discovered he had falsified his identity. Defendant told a friend in Phoenix that he had shot someone during a robbery, later adding that defendant was \"wanted for murder in California.\" The witness believed, however, that defendant was referring to a robbery of a fast-food restaurant. Defendant told another friend that he previously had owned a .22-caliber hand-gun. This witness stated that defendant consistently wore long-sleeved shirts.\n\nIn March 1985, police investigators discovered defendant had placed collect telephone calls from Phoenix to his sisters in California. On March\n\n13, 1985, defendant was arrested on the auto-theft warrant and subsequently was extradited to California. At the time of his arrest, defendant was carrying a knife of the same general type as that used to stab the victim.\n\nApproximately two months after the murder of Gonzales, Yeyo Blanco resumed living with Inez Blanco. Additional evidence, whose admission defendant characterizes as error, will be summarized in connection with the Discussion of defendant's arguments.\n\nDiscussion\n\nGUILT PHASE ISSUES\n\n1. ADMISSION OF MULTIPLE HEARSAY\n\nDefendant contends the trial court erred in admitting into evidence the testimony and tape-recorded statements of Mariella Perez, because they contain multiple hearsay that does not fall within the hearsay exception, set forth in Evidence Code section 1235, for prior inconsistent statements.\n\nInez Blanco's 15-year-old daughter, who also is named Inez, testified that, on the morning Ruby Gonzales was murdered, defendant (her uncle) had not come to the house she shared with her mother and sisters. She also denied having told her older sister Juanita that defendant had come to the house on the morning of the murder with blood on his hands and clothing, that he had admitted killing Gonzales, and that he had received from their mother the keys to the Oldsmobile.\n\nJuanita testified she was on a school field trip the day of the murder and returned home the following day. She denied that her sister Inez ever told her that defendant had come to their house on the morning of the murder with blood on his hands and clothing, had admitted having killed Gonzales, and had received from their mother the keys to the Oldsmobile. Juanita also denied having told her close friend Mariella Perez that her sister Inez had made such a statement.\n\nPerez testified that approximately one year after Gonzales was killed, Juanita Blanco visited her and, while they were alone in Perez's bedroom, told her that Juanita had learned from her sister Inez that defendant had come to their house the morning of the murder with blood on his shirt and had spoken to their mother. Perez did not recall Juanita Blanco stating that defendant had admitted killing the victim, or that their mother had given defendant the keys to her automobile.\n\nDistrict attorney investigator Kenneth Ast then related Perez's out-of-court statement to him that Juanita Blanco had told Perez that Juanita's mother had given defendant the keys to the Oldsmobile. The prosecutor played for the jury tape recordings of two interviews of Perez. In the first interview, Perez stated that the elder Inez Blanco had, on numerous occasions, threatened to kill the victim. Perez also recounted the statement of Juanita Blanco that her sister Inez had seen their mother give defendant the keys to the Oldsmobile on the morning of the murder. Additionally, Perez asserted that a man she did not know had entered her house and threatened her in an effort to persuade her not to disclose information concerning the murder.\n\nIn the second interview, Perez related a statement made by Juanita Blanco approximately one month prior to the murder, that at least one year earlier her mother had planned to have the victim killed. Shortly after the murder, Juanita Blanco stated to Perez that she suspected her mother had planned the murder, because her mother had not appeared surprised at the theft of the Oldsmobile.\n\nApproximately one week after the murder, Inez Blanco and her three daughters moved out of Lompoc. Sometime long after the murder, Juanita Blanco and her two sisters visited Perez. During that visit, Juanita stated that her sister Inez had seen defendant at the front door of their house on the morning of the murder, \"with blood all over him,\" and that defendant had inquired, \"What am I going to do?\" Juanita's mother gave defendant the keys to her automobile, and defendant left. When Perez was asked about the man who had entered her house and threatened her, Perez at first declined to discuss the matter, saying it was \"not important,\" and then denied the incident had occurred.\n\nDefendant contends the trial court erred in admitting Perez's testimony and tape-recorded statements, because the exception to the hearsay rule for prior inconsistent statements (set forth in Evid. Code, § 1235) does not allow admission of multiple hearsay. Defendant does not point to any authority which so holds, but places great reliance on the absence of any reported decisions upholding the admission of multiple hearsay on this basis. We are unpersuaded.\n\nEvidence Code section 1235 authorizes the admission into evidence of a witness's prior inconsistent statement. It states, in pertinent part: \"Evidence of a statement made by a witness is not made inadmissible by the hearsay rule if the statement is inconsistent with his testimony at the hearing . . ..\" Evidence Code section 1201 authorizes the admission into evidence\n\nof multiple hearsay. It states: \"A statement within the scope of an exception to the hearsay rule is not inadmissible on the ground that the evidence of such statement is hearsay evidence if such hearsay evidence consists of one or more statements each of which meets the requirements of an exception to the hearsay rule.\"\n\nRead together, these two statutes permit admission of multiple hearsay where each hearsay level constitutes a prior inconsistent statement. (Cf. People v. Whitt (1990) 51 Cal. 3d 620, 643, fn. 15 [274 Cal. Rptr. 252, 798 P.2d 849].) Such is the situation in the present case.\n\nThe out-of-court statement of the younger Inez Blanco that defendant had come to her house the morning of the murder with blood on his person, and had obtained the keys to the Oldsmobile from her mother, is inconsistent with her denial at trial that she had made such a statement. The out-of-court statement of Juanita Blanco recounting the above described statement of her sister is inconsistent with her denial at trial that she made such a statement. Perez's out-of-court statement that Juanita Blanco had told her that Juanita's mother had given defendant the keys to the Oldsmobile is inconsistent with Perez's testimony at trial that she did not recall Juanita Blanco having made this statement.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nWe are unaware of any published decision addressing the precise question whether multiple hearsay is admissible where each hearsay level constitutes a prior inconsistent statement. But none of the decisions addressing similar questions suggests that such evidence is inadmissible.\n\nThis court has upheld the admission of multiple hearsay in appropriate circumstances (People v. Pensinger (1991) 52 Cal. 3d 1210, 1266 [278 Cal. Rptr. 640, 805 P.2d 899]), and the Court of Appeal has upheld the admission of multiple hearsay where one of the hearsay levels was a prior inconsistent statement. In In re Ricky B. (1978) 82 Cal. App. 3d 106, 112-113 [146 Cal. Rptr. 828], a witness testified he had overheard a conversation between the defendant and another person but denied that the Discussion concerned a stolen van. A police officer was permitted to testify that, prior to trial, the witness had stated that during the overheard conversation, the defendant and his companion discussed having stolen a van. The Court of Appeal ruled this multiple hearsay properly was admitted, because the witness's pretrial statement to the officer was a prior inconsistent statement\n\n(Evid. Code, § 1235) and the overheard conversation constituted either an admission or an adoptive admission by the defendant (Evid. Code, § 1220, 1221). Similarly, multiple hearsay consisting of a prior inconsistent statement and an admission of the defendant was held properly received in People v. Earnest (1975) 53 Cal. App. 3d 734, 741-743 [126 Cal. Rptr. 107], and People v. Petersen (1972) 23 Cal. App. 3d 883, 890-891 [100 Cal. Rptr. 590].\n\nThe situation is no different where, as in the present case, each level of hearsay constitutes a prior inconsistent statement.\n\nDefendant contends the reason for the rule embodied in Evidence Code section 1235, allowing admission of prior inconsistent statements, applies only to single-level hearsay. The reason the prior inconsistent statement of a witness may be received is that the declarant is present in court and subject to cross-examination. \"The witness who has told one story aforetime and another today has opened the gates to all the vistas of truth which the common law practice of cross-examination and re-examination was invented to explore. The reasons for the change of face, whether forgetfulness, carelessness, pity, terror, or greed, may be explored by the two questioners in the presence of the trier of fact, under oath, casting light on which is the true story and which the false. It is hard to escape the view that evidence of a prior inconsistent statement, when declarant is on the stand to explain it if he can, has in high degree the safeguards of examined testimony.\" (2 McCormick on Evidence (4th ed. 1992, Hearsay Rule, § 251, p. 120, fn. omitted.)\n\nDefendant asserts this rationale does not apply where multiple hearsay is involved, because \"the jury has no way of testing the reliability of the third party who reportedly saw the event or heard the admission.\" Defendant's argument is not well taken because, in the present case, the \"third party who reportedly saw the event or heard the admission,\" the younger Inez Blanco, was called as a witness and was subject to cross-examination. The jury thus was able to assess her credibility. The same is true of Juanita Blanco and Mariella Perez. The reason for the rule allowing admission of prior inconsistent statements was satisfied.\n\nDefendant contends the multiple hearsay should not have been received, because each declarant denied having made the alleged prior inconsistent statement.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e This concern, that an alleged prior inconsistent statement, which the declarant denies having made, may have been fabricated, applies\n\nequally to single hearsay and to multiple hearsay. It is settled that the declarant's denial of the prior inconsistent statement does not render that statement inadmissible. (People v. Lucky (1988) 45 Cal. 3d 259, 289 [247 Cal. Rptr. 1, 753 P.2d 1052]; People v. Strickland (1974) 11 Cal. 3d 946, 954 [114 Cal. Rptr. 632, 523 P.2d 672].) To the contrary, it has been recognized that \"the result is more favorable to the cross-examiner than could be produced by eliciting an admission that the statement was made and an explanation of change of position . . ..\" (2 McCormick on Evidence, supra, at pp. 123-124.)\n\nThe circumstances of the present case demonstrate why the jury must be permitted to consider and determine the significance of a witness's prior inconsistent statement, even where the witness denies having made the statement and proof of the statement consists of multiple hearsay. According to Perez, the younger Inez Blanco told her sister Juanita that defendant came to the Blanco residence shortly after the murder and was given the keys to the Oldsmobile by the elder Inez Blanco. The importance of this event hardly could have been lost on the Blanco sisters; it not only incriminated their uncle in a brutal murder, but also implicated their mother in the crime. The younger Inez Blanco did not reveal her observations, even to her sister, until long after they were made. Nearly a year after the crime, Juanita shared this family secret with her close friend, Perez, in a private conversation. If Perez's account is true, therefore, it would have been surprising had the younger Inez Blanco or her sister, at the murder trial of their uncle, admitted making these statements.\n\nTo be sure, it is possible that Perez bed and the statements never were made. But the possibility of falsehood adheres in nearly all testimony. The jury had a full opportunity to evaluate Perez's testimony and Judge her credibility, as well as the credibility of Juanita Blanco and her sister. It would make little sense to hold that Juanita's and her sister's denials of their statements rendered inadmissible Perez's testimony to the contrary. It was for the jury to resolve this conflict and to determine the value of this crucial piece of evidence.\n\nDefendant observes that if multiple hearsay consisting of prior inconsistent statements is admissible, \"a single person may by his own testimony introduce statements 'inconsistent' with any number of prior declarants, each of whom adamantly deny ever making the statements.\" To forestall this occurrence, defendant urges that this court \"establish a bright-line rule\" that a prior inconsistent statement may be used only \"to contradict a single prior declarant.\"\n\nIf such a rule is desirable, it must be established by the Legislature, not by this court. \"Our function is not to Judge the wisdom of statutes.\n\n[Citation.] Nor are we empowered to insert what a legislative body has omitted from its enactments. [Citation.]\" (Wells Fargo Bank v. Superior Court (1991) 53 Cal. 3d 1082, 1099 [282 Cal. Rptr. 841, 811 P.2d 1025].)\n\nDefendant contends the admission of this multiple hearsay violated his rights under the state and federal Constitutions to confront the witnesses against him. (U.S. Const., 6th Amend; Cal. Const., art. I, § 15.) The receipt in evidence of a prior inconsistent statement does not violate the confrontation clauses of the federal and state Constitutions where the declarant testifies at trial and is subject to cross-examination. (California v. Green (1970) 399 U.S. 149, 164 [26 L.Ed.2d 489, 500-501, 90 S.Ct. 1930]; People v. Chavez (1980) 26 Cal. 3d 334, 361 [161 Cal. Rptr. 762, 605 P.2d 401].) The Conclusion is no different where multiple hearsay is involved, each segment of hearsay evidence constitutes a prior inconsistent statement, and each declarant testifies at trial and is subject to cross-examination. In both situations, \"[d]efendant retains the opportunity to question the declarant as to the circumstances surrounding the prior statements and to elicit from the declarant an explanation for the inconsistencies in his prior statement and his on-the-stand testimony.\" (People v. Chavez, supra, 26 Cal. 3d at pp. 360-361.)\n\nDefendant asserts he was unable to \"confront\" the younger Inez Blanco regarding her out-of-court statement, because she denied having made that statement. As noted above, the declarant's denial she made the inconsistent statement does not render it inadmissible. (People v. Lucky, supra, 45 Cal. 3d 259, 289.) To the contrary, it has been recognized that the declarant's denial places the defendant in a stronger position than if the declarant had admitted making the inconsistent statement. (California v. Green, supra, 399 U.S. 149, 159 [26 L.Ed.2d at pp. 497-498].)\n\nIn rejecting the argument that prior inconsistent statements should be excluded because the defendant is denied the opportunity to cross-examine the declarant at the time the statement was made, the United State Supreme Court observed: \"The most successful cross-examination at the time the prior statement was made could hardly hope to accomplish more than has already been accomplished by the fact that the witness is now telling a different, inconsistent story . . ..\" (California v. Green, supra, 399 U.S. 149, 159 [26 L.Ed.2d at p. 497].) The court explained that the defendant's ability to attack the prior statement may be enhanced, because the witness \"should be more than willing to give the usual suggested explanations for the inaccuracy of his prior statement, such as faulty perception or undue haste in recounting the event.\" ( at p. 160 [26 L.Ed.2d at p. 498].) The defendant, however, still must contend with the circumstance that the witness, although\n\nnow willing to testify in the defendant's favor, admits previously having made an unfavorable statement.\n\nIf, as in the present case, the declarant denies having made the inconsistent statement, the defendant has a stronger basis for attacking the earlier statement than would be the case if the declarant had admitted making the inconsistent statement. The declarant's denial that he or she had made the alleged prior statement does not weaken the declarant's credibility as would the declarant's admission of having made a contradictory statement.\n\nIn arguing that Perez's out-of-court statements were inadmissible, defendant relies on the following sentence from the decision in California v. Green, supra, 399 U.S. 149, 158 [26 L.Ed.2d at p. 497]: \"If the witness admits the prior statement is his, or if there is other evidence to show the statement is his, the danger of faulty reproduction is negligible and the jury can be confident that it has before it two conflicting statements by the same witness.\" Defendant points out that the younger Inez Blanco denied having made the statement attributed to her, and that the \"other evidence\" suggesting the statement was made consists of the testimony of Perez which, defendant contends was untrustworthy.\n\nWe conclude Perez's testimony constitutes sufficient evidence to support a finding by the jury that the disputed statement was made. Perez's credibility, although challenged, was for the jury to determine. (People v. Barnes (1986) 42 Cal. 3d 284, 303-304 [228 Cal. Rptr. 228, 721 P.2d 110].)\n\nIt is true that in the present case the use of multiple hearsay, to establish that the inconsistent statement was made, increased \"the danger of faulty reproduction\" of the declarant's prior statement. (California v. Green, supra, 399 U.S. 149, 158 [26 L.Ed.2d at pp. 498, 497].) But this single factor does not dispositively warrant application of a rule different from that set forth in California v. Green, supra, especially because, as noted above, the declarant's denial that she made the alleged prior statement actually places the defendant in a stronger position to attack the statement than had she admitted making it.\n\nAlthough the probative value of hearsay evidence decreases with each level of hearsay (People v. Dehnel (1979) 99 Cal. App. 3d 404, 408 [160 Cal. Rptr. 279]), one particular instance of multiple hearsay may be more reliable than another instance of single hearsay. The weight to be accorded Perez's statements was for the jury to determine. (People v. Barnes, supra, 42 Cal. 3d 284, 303-304.) It is preferable that the jury determine the credibility of hearsay evidence based upon the totality of the circumstances rather\n\nthan that this court establish an arbitrary rule based solely upon the number of levels of hearsay. No existing rule of evidence bars the admission of multiple-hearsay testimony where each hearsay level constitutes a prior inconsistent statement, and we decline to establish such a rule.\n\nDefendant, contending the multiple-hearsay statement should have been excluded because Perez was an unreliable witness, cites the decision in Idaho v. Wright (1990) 497 U.S. 805, 816 [111 L.Ed.2d 638, 653, 110 S.Ct. 3139] for the proposition that the proponent of hearsay evidence has the burden of establishing that the evidence bears \"sufficient indicia of reliability to withstand scrutiny under the [Confrontation] Clause.\" But this requirement applies only if the prosecution is unable to produce the declarant and the declarant \"is shown to be unavailable.\" ( at p. 814 [111 L.Ed.2d at p. 652].) Where the declarant is unavailable, the defendant has no opportunity to confront and cross-examine the declarant, and the out-of-court statement must be excluded unless it \"bears adequate 'indicia of reliability' \" (ibid.) such that \"adversarial testing would add little to its reliability.\" ( at p. 821 [111 L.Ed.2d at p. 656].)\n\nThe foregoing rule does not apply to the admission of prior inconsistent statements because, when the declarant testifies in court, the defendant may confront and cross-examine the witness. The admission of prior inconsistent statements does not offend the confrontation clause--not because such statements are so inherently reliable that \"adversarial testing\" is not needed, but because the declarant is present in court and such \"adversarial testing\" can occur as the defendant confronts and cross-examines the witness.\n\nThe present case is controlled, therefore, by the holding in California v. Green, supra, that \"the Confrontation Clause is not violated by admitting a declarant's out-of-court statements, as long as the declarant is testifying as a witness and subject to full and effective cross-examination.\" (California v. Green, supra, 399 U.S. 149, 158 [26 L.Ed.2d at p. 497].) The primary reason for this rule is that \"the inability to cross-examine the witness at the time he made his prior statement cannot easily be shown to be of crucial significance as long as the defendant is assured of full and effective cross-examination at the time of trial.\" ( at p. 159 [26 L.Ed.2d at p. 497].) In so holding, the high court distinguished those cases which required the evidence to possess \"indicia of reliability,\" because such cases addressed \"precisely the opposite situation--situations where statements have been admitted in the absence of the declarant and without any chance to cross-examine him at trial.\" ( at p. 161 [26 L.Ed.2d at p. 499].)\n\nIn the present case, the prosecution was not required to demonstrate that Perez's testimony bore certain \"indicia of reliability.\" The circumstances\n\nrecounted by defendant that cast doubt upon the reliability of Perez's testimony, therefore, do not render the multiple-hearsay statement inadmissible, but were factors for the jury to consider in determining the weight of the evidence.\n\nDefendant asserts that the probative value of Perez's testimony \"was clearly outweighed by its prejudicial effect\" and that the evidence thus should have been excluded pursuant to Evidence Code section 352.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The record reflects that no objection on this ground was made at trial. In the absence of such an objection, the trial court had no duty to make an express ruling based upon a weighing of relevance and prejudice under Evidence Code section 352. (People v. Anderson (1990) 52 Cal. 3d 453, 477 [276 Cal. Rptr. 356, 801 P.2d 1107].)\n\nNor does defendant explain in what respect Perez's testimony was unduly prejudicial, stating only that it is reasonably probable a result more favorable to defendant would have been reached in the absence of Perez's testimony. This is not the sort of prejudice referred to in Evidence Code section 352. (People v. Hole (1983) 139 Cal. App. 3d 431, 436-437 [188 Cal. Rptr. 693].) \"The prejudice which exclusion of evidence under Evidence Code section 352 is designed to avoid is not the prejudice or damage to a defense that naturally flows from relevant, highly probative evidence.\" (People v. Karis (1988) 46 Cal. 3d 612, 638 [250 Cal. Rptr. 659, 758 P.2d 1189]; People v. Yu (1983) 143 Cal. App. 3d 358, 377 [191 Cal. Rptr. 859].) \"Rather, the statute uses the word in its etymological sense of 'prejudging' a person or cause on the basis of extraneous factors. [Citation.]\" (People v. Farmer (1989) 47 Cal. 3d 888, 912 [254 Cal. Rptr. 508, 765 P.2d 940].) No such prejudice ensued from the admission of Mariella Perez's testimony.\n\n2. ADMISSION OF THE TESTIMONY PREVIOUSLY GIVEN BY MARIELLA PEREZ AT THE EVIDENCE CODE SECTION 402 HEARING\n\nAt the request of the defense, during the presentation of its case, the trial court admitted into evidence three portions of a reporter's transcript of the testimony given by Mariella Perez at the December 16, 1986, hearing conducted (pursuant to Evid. Code, § 402) outside the presence of the jury to determine the admissibility of her multiple-hearsay testimony. Defense counsel was permitted to read to the jury 10 questions and answers in which Perez had stated, contrary to her testimony before the jury and contrary to statements made on other occasions, that neither Juanita Blanco nor her\n\nsisters were at home on the morning of the murder, that the younger Inez Blanco had not said defendant's hands and clothing were bloody when he came to the Blancos' house, and that no one had come to Perez's home and warned her not to testify. The prosecutor then offered into evidence, and the court ruled admissible over defendant's objection, the transcript of the entire testimony given by Perez at the prior hearing.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nEvidence Code section 356 provides, in pertinent part: \"Where part of an act, declaration, conversation, or writing is given in evidence by one party, the whole on the same subject may be inquired into by an adverse party . . ..\" \"In applying Evidence Code section 356 the courts do not draw narrow lines around the exact subject of inquiry. 'In the event a statement admitted in evidence constitutes part of a conversation or correspondence, the opponent is entitled to have placed in evidence all that was said or written by or to the declarant in the course of such conversation or correspondence, provided the other statements have some bearing upon, or connection with, the admission or declaration in evidence. . . .' [Citations.]\" (People v. Hamilton (1989) 48 Cal. 3d 1142, 1174 [259 Cal. Rptr. 701, 774 P.2d 730], italics in original.)\n\nDefendant introduced portions of the testimony given by Perez at the hearing held outside the presence of the jury, in order to demonstrate that this testimony differed from her later testimony before the jury and from statements she had made on other occasions. The People were entitled, therefore, to introduce the remainder of Perez's testimony for the purpose of placing her allegedly inconsistent statements in their proper context, provided that the remaining testimony had \"some bearing upon, or connection with\" the inconsistent statements introduced by defendant. (People v. Hamilton, supra, 48 Cal. 3d at p. 1174, italics omitted.)\n\nThe statements introduced by defendant concerned Perez's multiple-hearsay testimony relating Juanita Blanco's repetition of her sister Inez's statement (regarding defendant's visit to the Blanco residence on the morning of the murder) and whether Perez later had been warned not to assist in the murder investigation. Perez's testimony at the hearing comprises less than six full pages of reporter's transcript. Perez first described the nature of her\n\nrelationship with the Blanco family, and then recounted her conversation with Juanita Blanco concerning the statement of Juanita's sister, Inez. The remainder of Perez's testimony concerned whether she had been warned not to cooperate with the authorities. The only portion of Perez's testimony that did not relate directly to those portions introduced by the defense was Perez's description of her relationship with the Blanco family. That relationship, in particular with Juanita Blanco, had \"some bearing upon, or connection with\" her multiple-hearsay testimony concerning Juanita's relating of the statement made by Juanita's sister, Inez. Accordingly, the trial court did not err in admitting, pursuant to Evidence Code section 356, the entire testimony given by Perez at the prior hearing.\n\nDefendant states the trial court admitted Perez's testimony \"without even reviewing\" the transcript. The record does not support this assertion. During argument concerning the prosecutor's request to admit Perez's entire testimony from the prior hearing, the court inquired, \"May I see the transcript?\" Immediately prior to making its ruling, the court stated: \"It appears to me that Miss Perez's testimony in its pertinent part goes up to 128, line 16. The rest is colloquy between counsel and argument.\" It appears, therefore, that the trial court rather carefully reviewed the transcript before making its ruling.\n\nRelying in part upon his claim that the trial court failed to exercise its discretion because it did not review the transcript of Perez's testimony, defendant contends the court erred in refusing to exclude the prior testimony pursuant to Evidence Code section 352 because the prejudicial effect of the evidence outweighed its probative value. As explained above, however, the trial court did review the transcript.\n\nThe record of a ruling based on Evidence Code section 352 \" 'must affirmatively show that the trial Judge did in fact weigh prejudice against probative value . . ..\" [Citations.]\" (People v. Heishman (1988) 45 Cal. 3d 147, 170 [246 Cal. Rptr. 673, 753 P.2d 629].) In the present case, after the trial court had made its ruling, defense counsel reiterated that his objection was based on Evidence Code section 352. The court responded: \"Yes. I have thought about whether the jury would be confused by the whole testimony. I don't believe they would.\" The record thus is sufficient to indicate the trial court understood its duty, and exercised its discretion, pursuant to Evidence Code section 352. (45 Cal. 3d at p. 170.)\n\nWe observe, additionally, that the admission of the entire testimony given by Perez at the Evidence Code section 402 hearing could not have prejudiced defendant. As he acknowledges, much of this testimony was cumulative to the testimony given by Perez before the jury. Other small portions,\n\nsuch as the statement that Juanita reversed the charges when she telephoned Perez, were irrelevant and nonprejudicial.\n\n3. THE PROSECUTION'S INTENTIONAL DESTRUCTION OF A TAPE RECORDING PREPARED BY THE DEFENSE\n\nAfter the jury had been selected, but before opening statements were given, Assistant District Attorney Steven Plumer stated at a conference conducted outside the presence of the jury that an audio tape recording belonging to defense counsel had been discovered inadvertently by one of the prosecutors, Deputy District Attorney Gary Van Camp, and his chief investigating officer, Detective Sergeant Harry Heidt, and had been destroyed intentionally by Heidt. Two days after this disclosure, a hearing commenced outside the presence of the jury, revealing the following:\n\nOn October 4, 1986, after jury selection had begun, Van Camp and Heidt, while traveling in a \"county car,\" discovered a sealed envelope bearing the name of Assistant Public Defender Bill Davis, the defense attorney in the present case, and a return address of the Santa Barbara Public Defender's Office. From the shape of the envelope, it appeared to contain an audio cassette tape.\n\nAccording to Sergeant Heidt, he suggested to Van Camp that Heidt prepare a \"found property\" report for the envelope and its contents, which would be \"standard procedure\" under such circumstances. Instead, Van Camp opined that the tape might relate to the present case and asked Heidt to listen to it and \"report to him what was on the tape.\" Heidt testified that instead of listening to the tape recording, he threw the sealed envelope into a trash dumpster approximately 15 minutes after the envelope was discovered.\n\nTwo days later, Heidt spoke to Van Camp, who inquired whether Heidt had anything to report from listening to the tape recording. Heidt told Van Camp he had not listened to it and \"expressed [his] feelings about being placed in that position,\" explaining at the hearing that Heidt felt it would have been \"unethical\" for him to have listened to the tape recording. Heidt stated to Van Camp that, as far as Heidt was concerned, \"the tape was never found.\"\n\nNearly three weeks later, on October 24, 1986, R. O. Hebert, the chief of the Lompoc Police Department, summoned Sergeant Heidt to determine whether Heidt had knowledge of a heated argument alleged to have occurred between Van Camp and a member of the Lompoc Police Department. Heidt\n\nknew nothing of that incident. Chief Hebert then inquired whether there were any problems between Heidt and Van Camp. Heidt responded that he did have some problems and, without further inquiry by Chief Hebert, volunteered the information concerning the discovery and destruction of the tape recording. Heidt testified his destruction of the envelope had \"bothered\" him, and he felt it was important to disclose the incident before the evidentiary phase of the trial began \"[s]o the court and the defense was aware of what happened.\" Chief Hebert informed Assistant District Attorney Plumer who, on October 27, 1986, the day before opening statements were to begin at the guilt phase of the trial, notified defense counsel of the incident.\n\nVan Camp's recollection of the discovery of the envelope coincided with Sergeant Heidt's, except that Van Camp denied instructing Heidt to listen to the tape recording, testifying instead that he gave the envelope to Heidt, stating: \"I don't want it. You take it and you decide what to do with it.\"\n\nAssistant Public Defender Bill Davis represented that he had dictated the tape recording in question, which revealed his perceptions of the strengths and weaknesses of the case, in preparation for a meeting at which trial strategy was to be discussed with experienced members of his office. The contents of the tape recording had been transcribed for his use at the meeting. Davis last saw the tape recording after sealing it in an envelope and placing it in a county automobile on September 26, 1986. A sealed copy of the transcription was introduced by defense counsel and was reviewed by the trial court in camera.\n\nPrior to any ruling by the court, the District Attorney of Santa Barbara County, Thomas Sneddon, assumed the role of trial prosecutor, replacing Van Camp. Sneddon later represented to the court that Van Camp had been demoted, resulting in a decrease in salary from $52,000 per year to approximately $27,000 per year.\n\nThe trial court found that Van Camp, despite his denial, had instructed Sergeant Heidt to listen to the tape recording but further found that Heidt had not done so and instead had disposed of the recording without listening to it.\n\nIn light of the foregoing incident, defendant moved for (1) dismissal of the charges, or other appropriate sanctions, (2) recusal of the entire Santa Barbara County District Attorney's Office, and (3) a continuance to conduct further research and investigation. The trial court denied each of the motions. We shall consider separately whether the trial court erred in each instance, but first we address defendant's contention that the trial court's\n\nfinding--that neither Sergeant Heidt nor Van Camp had listened to the tape recording--was \"legally erroneous.\"\n\nA. THE TRIAL COURT'S FINDING THAT NEITHER HEIDT NOR VAN CAMP HAD LISTENED TO THE TAPE RECORDING\n\nDefendant urged the trial court to dismiss the case because the prosecution had \"invad[ed] the defense camp\" by listening to the tape recording. (See Barber v. Municipal Court (1979) 24 Cal. 3d 742, 756 [157 Cal. Rptr. 658, 598 P.2d 818].) The trial court declined to dismiss the case, or impose some other sanction, because it found the prosecution had not listened to the tape recording. At oral argument before us, defendant's counsel conceded that if the prosecution did not listen to the tape, no sanction should be imposed.\n\nDefendant contends, however, that the trial court erred in finding that the prosecution had not listened to the tape recording because, as a sanction for Sergeant Heidt's destruction of the tape recording, the trial court was required to reject Heidt's denial that he had listened to the recording, and to find instead that the prosecution had listened to it. Defendant claims that Heidt's destruction of the tape cassette itself (as distinguished from the contents of the recording) and destruction of the envelope containing the tape cassette \"deprived the defense of the only physical evidence it could use to impeach Heidt and Van Camp regarding whether they unsealed the envelope and listened to the tape.\" In support of this claim, an expert in forensic acoustics testified for the defense that \"in many instances\" he could determine from an examination of a tape recording, and the known machines upon which it had been recorded and played, whether it had been played upon any machine other than those known machines. Using the known machines, the expert would prepare a \"test tape\" and compare it to the tape recording at issue. Any differences between the \"test tape\" and the tape recording at issue would indicate that the latter had been played on a machine different from the known machines. In order for such testing to be productive, it is \"critical\" that the cassette tape used to make the recording at issue be new; if it is not new, differences between it and the \"test tape\" might be \"attributable to prior use of the tape.\" Defense counsel Davis testified the tape he used was new. An expert in fingerprint identification also testified that it is possible to detect fingerprints on an envelope, on a cassette tape holder, and on the cassette tape itself.\n\nDefendant does not assert he was harmed by the destruction of the contents of the tape recording, nor could he. Defense counsel had dictated the contents of the recording, and a transcription had been prepared, thus preserving the contents of the recording despite the destruction of the cassette tape.\n\nIt is beyond dispute that it was highly improper for Heidt to discard the envelope, knowing it belonged to defense counsel and might contain material pertinent to the present case. Citing the decisions in People v. Hitch (1974) 12 Cal. 3d 641 [117 Cal. Rptr. 9, 527 P.2d 361] and People v. Zamora (1980) 28 Cal. 3d 88 [167 Cal. Rptr. 573, 615 P.2d 1361], defendant contends the trial court was required, as a sanction for Heidt's destruction of the envelope and the cassette tape, to find that Heidt and Van Camp had listened to the recording. We conclude, however, that the trial court did not abuse its discretion in determining it would be inappropriate to impose such a sanction.\n\n\"The applicable law is no longer found in Hitch, supra, 12 Cal. 3d 641, but in two subsequent United States Supreme Court decisions. In California v. Trombetta (1984) 467 U.S. 479, 488-489 [81 L.Ed.2d 413, 422, 104 S.Ct. 2528], the high court held: 'Whatever duty the Constitution imposes on the States to preserve evidence, that duty must be limited to evidence that might be expected to play a significant role in the suspect's defense. To meet this standard of constitutional materiality [citation], evidence must both possess an exculpatory value that was apparent before the evidence was destroyed, and be of such a nature that the defendant would be unable to obtain comparable evidence by other reasonably available means.' (Fn. omitted.) [P] More recently, in Arizona v. Youngblood (1988) 488 U.S. 51, 58 [102 L.Ed.2d 281, 289, 109 S.Ct. 333], the court held that 'unless a criminal defendant can show bad faith on the part of the police, failure to preserve potentially useful evidence does not constitute a denial of due process of law.' \" (People v. Cooper (1991) 53 Cal. 3d 771, 810-811 [281 Cal. Rptr. 90, 809 P.2d 865].) This court has expressly adopted the high court's holdings in Trombetta and Youngblood. (Ibid.)\n\nThe present case is different from Trombetta and its progeny in that the envelope and cassette tape were not relevant to defendant's guilt or innocence, but related solely to whether the prosecution had engaged in misconduct. But the People do not assert that the rule announced in Trombetta is inapplicable, and we perceive no reason why this rule--formulated in the context of a destruction of exculpatory evidence--should not apply with equal force to the destruction of evidence of official wrongdoing.\n\nIn the present case, defendant urges that, had the envelope and the cassette tape it contained been preserved, they could have been tested to determine whether the envelope had been opened and the tape recording had been played. But this \"exculpatory value\" of the envelope and the cassette tape it contained (as opposed to the contents of the tape recording) was not apparent at the time Sergeant Heidt disposed of them. Although Heidt certainly had\n\nreason to suspect that the contents of the tape recording might possess exculpatory value, the destruction of the contents of the tape recording did not lessen defendant's ability to challenge Heidt's testimony that the prosecution did not listen to the tape. Therefore, the destruction of the contents of the tape recording affords no basis for imposition of the sanction that the trial court be required to reject Heidt's testimony and find that the prosecution listened to the tape recording.\n\nNeither does the destruction of the envelope and the cassette tape themselves, apart from the destruction of the contents of the tape recording, afford a basis for imposing the requested sanction. The record before us supports the trial court's implied finding that the allegedly exculpatory value of the envelope and the cassette themselves was not apparent at the time Heidt threw them away. (See People v. Medina (1990) 51 Cal. 3d 870, 893 [274 Cal. Rptr. 849, 799 P.2d 1282] [no sanction for destruction of a bottle bearing a fingerprint, because the officer who destroyed the bottle \"could not know at the time the prints were taken whether, or to what extent, the Perrier bottle's print matched defendant's prints\"].) It was reasonable for the trial court to conclude that Heidt had destroyed the envelope and the cassette tape without being aware that they later would assume evidentiary significance on the issue whether Heidt had listened to the recording. In other words, the record supports the Conclusion that, at the time the envelope and the cassette were discovered and destroyed, Sergeant Heidt had no reason to believe that the envelope and the cassette themselves (apart from the contents of the tape recording) would \"play a significant role in the suspect's defense.\" (California v. Trombetta (1984) 467 U.S. 479, 488, 81 L.Ed.2d 413, 422, 104 S.Ct. 2528].)\n\nHeidt clearly acted wrongly in disposing of the envelope and its contents, but under the circumstances of the present case, this improper act did not deprive defendant of due process of law or otherwise deny defendant a fair trial. The high court has made it clear that the destruction of evidence by law enforcement officials deprives the defendant of due process of law only if the exculpatory value of the evidence was \"apparent\" ' before the evidence was destroyed.' [Citation.]\" (Arizona v. Youngblood (1988) 488 U.S. 51, 56-57, fn. * [102 L.Ed.2d 281, 288, 109 S.Ct. 333], italics in original.) In California v. Trombetta, the high court found no constitutional violation where \"[t]he record contain[ed] no allegation of official animus towards respondents or of a conscious effort to suppress exculpatory evidence.\" (California v. Trombetta, supra, 467 U.S. 479, 488 [81 L.Ed.2d 413, 422].)\n\nWe have observed that in the present case, the trial court reasonably found that the exculpatory value of the envelope and the cassette themselves (as so\n\ncharacterized by defendant) was not apparent at the time Heidt disposed of them. The record supports the Conclusion that, although it was highly improper for Heidt to destroy the cassette, he did not intend to deprive defendant of exculpatory evidence or to otherwise harm defendant. Accordingly, the trial court did not abuse its discretion in believing Heidt's testimony that he had discarded the envelope without opening it and, accordingly, in declining to sanction the prosecution by making an adverse finding that the prosecution had listened to the tape recording.\n\nDefendant also contends it was improper for the trial Judge, in assessing Heidt's credibility, to consider the personal opinion of Heidt that the Judge had formed prior to his appointment to the bench. In announcing his finding that Sergeant Heidt did not listen to the tape recording, the trial Judge stated: \"[F]rom the evidence before me now, being the deputy public defender here for a couple of years and knew [ sic ] Sergeant Heidt then, and as a deputy district attorney I knew Sergeant Heidt then, and it would not have surprised me that he would have done what he said he did. And that's not listen to it.\" Defendant voiced no objection at trial to this statement by the trial Judge.\n\nWe agree with the Attorney General that defendant's failure to raise this issue in the trial court precludes his present claim of error. (Guadalupe A. v. Superior Court (1991) 234 Cal. App. 3d 100, 108 [285 Cal. Rptr. 570]; Gimbel v. Laramie (1960) 181 Cal. App. 2d 77, 85-86 [5 Cal. Rptr. 88].) Had defendant raised the issue in a timely fashion, the trial Judge would have had an opportunity to disclose the extent to which his prior contacts with Sergeant Heidt had affected his ruling and, if the trial Judge was unable to act impartially and defendant had so requested, the trial Judge then could have transferred the determination of Heidt's credibility to another Judge. Defendant therefore may not raise this issue for the first time on appeal.\n\nHaving concluded the trial court did not err in finding that the prosecution did not listen to the tape, we turn to defendant's contention that the trial court should have dismissed the case as a sanction for Heidt's intentional destruction of the tape recording.\n\nB. DENIAL OF DEFENDANT'S MOTION TO DISMISS\n\nCiting a number of grounds, defendant asserts the case must be dismissed. Defendant contends that dismissal is an appropriate sanction because Sergeant Heidt destroyed the contents of the tape recording without knowing whether they were essential to the defense case. To be sure, this is the primary reason that Heidt's destruction of the cassette was improper, and\n\nwe do not condone his conduct. But even though Heidt's destruction of the tape recording clearly was improper, the imposition of sanctions is warranted only if defendant suffered prejudice as a result of Heidt's misconduct. As the United States Supreme Court explained in a related context: \"[T]he interest of society in deterring unlawful police conduct and the public interest in having juries receive all probative evidence of a crime are properly balanced by putting the police in the same, not a worse, position that they would have been in if no police error or misconduct had occurred. [Fn. and citations omitted.]\" (Nix v. Williams (1984) 467 U.S. 431, 443 [81 L.Ed.2d 377, 387, 104 S.Ct. 2501].)\n\nAs noted above, the destruction of the contents of the tape recording did not prejudice defendant, because the contents of the tape recording had been preserved by transcription. It would have been inappropriate, therefore, for the trial court to impose sanctions for the destruction of the contents of the tape recording, particularly the severe sanction of dismissal. \"[A]bsent demonstrable prejudice, or substantial threat thereof, dismissal of the indictment is plainly inappropriate, even though the violation [of the defendant's right to counsel] may have been deliberate. [Fn.]\" (United States v. Morrison (1981) 449 U.S. 361, 365 [66 L.Ed.2d 564, 569, 101 S.Ct. 665].)\n\nWhere it appears that the state has engaged in misconduct, the burden falls upon the People to prove, by a preponderance of the evidence, that sanctions are not warranted because the defendant was not prejudiced by the misconduct. (Nix v. Williams, supra, 467 U.S. 431, 444 [81 L.Ed.2d 366, 387-388]; Murphy v. Waterfront Comm'n (1964) 378 U.S. 52, 79, fn. 18 [12 L.Ed.2d 678, 695, 84 S.Ct. 1594].) The People met that burden here. The evidence established that the prosecution did not listen to the tape recording and that a transcription of the tape recording had been made and was in the possession of defense counsel. The prosecution gained nothing by the destruction of the tape, and defendant lost nothing.\n\nDefendant also contends dismissal is an appropriate sanction because the prosecution may have listened to the tape recording. We have concluded, however, that the trial court properly held to the contrary. In denying defendant's motion for dismissal, the court invited defendant to reopen the issue in the event the manner in which the prosecution presented its case reflected an awareness of the contents of the tape recording. Defendant did not move to reopen the issue and made no showing of such awareness on the part of the prosecution. In light of the breadth of discovery common in capital cases, a substantial change in the prosecution's strategy resulting from access to the tape recording most likely would have been apparent to the defense. Thus the record before us affords no basis for the imposition of\n\nany sanction based upon the premise that the prosecution listened to the tape recording.\n\nDefendant finally contends the case should have been dismissed because of the cumulative effect of prosecutorial misconduct consisting of Van Camp's instruction to Sergeant Heidt to listen to the tape recording, Van Camp's allegedly unethical method of interviewing prosecution witnesses, his copying of a list of defense witnesses from the court file, and his lying under oath in denying that he had instructed Heidt to listen to the tape recording. Defendant has failed to demonstrate, however, that these instances of alleged misconduct, either singly or cumulatively, prejudiced his case. Accordingly, the trial court did not err in refusing to impose sanctions on the prosecution. (United States v. Morrison, supra, 449 U.S. 361, 365 [66 L.Ed.2d 564, 568-569].)\n\nC. DENIAL OF DEFENDANT'S MOTION TO RECUSE SANTA BARBARA COUNTY DISTRICT ATTORNEY SNEDDON\n\nThe District Attorney of Santa Barbara County, Thomas Sneddon, personally prosecuted this case from its inception until shortly before the preliminary hearing, when he assigned it to Deputy District Attorney Martinez for the preliminary hearing. Later, Sneddon reassigned the case to Deputy District Attorney Van Camp for trial.\n\nAs previously noted, when Van Camp's participation in the destruction of the tape recording came to light, Sneddon removed Van Camp from the case and personally assumed the role of trial prosecutor. Defendant subsequently moved to have District Attorney Sneddon recused. The trial court denied the motion.\n\nSection 1424 states that a motion to recuse a district attorney \"shall not be granted unless it is shown by the evidence that a conflict of interest exists such as would render it unlikely that the defendant would receive a fair trial.\" \"[A] 'conflict,' within the meaning of section 1424, exists whenever the circumstances of a case evidence a reasonable possibility that the DA's office may not exercise its discretionary function in an evenhanded manner.\" (People v. Conner (1983) 34 Cal. 3d 141, 148 [193 Cal. Rptr. 148, 666 P.2d 5].) \"In determining whether a ruling on a motion to recuse was proper, a reviewing court applies the abuse-of-discretion standard. [Citations.]\" (People v. Hamilton (1988) 46 Cal. 3d 123, 140 [249 Cal. Rptr. 320, 756 P.2d 1348].)\n\nDefendant contends District Attorney Sneddon should have been recused because (1) he prematurely terminated his investigation of Van\n\nCamp's misconduct, (2) he filed a Vehicle Code section 10851 charge against defendant, knowing it was not supported by substantial evidence, and (3) he had a personal interest in obtaining a conviction in order to protect himself and his office from negative publicity.\n\nThe trial court concluded there was no evidence Van Camp's misconduct regarding the tape recording would prevent defendant from receiving a fair trial, once Van Camp had been removed from the case. The trial court further found that Inez Blanco's denial that she gave defendant permission to take her automobile constituted a reasonable basis for the filing of a Vehicle Code section 10851 charge but that, even if it was improper for that charge to have been filed, any error was cured when the charge was dismissed. Nothing suggested defendant could not receive a fair trial on the remaining charges. Finally, the trial court ruled that the remaining allegations of misconduct, considered singly or cumulatively did not create a reasonable possibility that defendant could not receive a fair trial.\n\nIn urging that the trial court erred in denying the recusal motion, defendant points to a letter to Van Camp in which Sneddon condemned Van Camp's actions. We fail to perceive how this letter supports defendant's claim that Sneddon should have been recused. Sneddon's condemnation of Van Camp's unethical conduct was entirely appropriate. The letter apparently was an initial step in the imposition of administrative discipline. To the contrary, there would have been cause for concern had Sneddon failed to take such action, or had he otherwise appeared to condone Van Camp's misconduct.\n\nDefendant also asserts Sneddon terminated his internal investigation into Van Camp's misconduct when the trial court required the prosecution to disclose to the defense any information uncovered by that inquiry. Assistant District Attorney Steven Plumer testified that when Van Camp's involvement with the tape recording was disclosed on October 27, 1986. Sneddon instructed Plumer to inform defense counsel and to have district attorney investigator Charles Watkins interview Van Camp, Heidt, and others who might possess relevant information. On October 28, 1986, Plumer appeared before the trial court and related the information he had received concerning the discovery and destruction of the envelope containing the cassette. The trial court scheduled a hearing for the following day.\n\nAt the hearing on October 29, 1986, Plumer brought investigator Watkins's handwritten notes of his interviews and provided copies to the defense at its request. The court advised Sergeant Heidt that the hearing would be continued to the next day in order to allow him an opportunity to consult\n\nwith an attorney. Defense counsel then requested that the district attorney's office be \"restrained\" from conducting any further investigation of the destruction of the tape recording or, in the alternative, be required to reveal to the defense any information received from that investigation. The trial court ordered that any such information obtained by the district attorney's office be disclosed to the defense. On that same day, Plumer advised Sneddon of the information he had received from Watkins. Sneddon directed that the investigator prepare a summary of his investigation.\n\nOn October 30, 1986, a hearing was held at which Deputy District Attorney Van Camp, Sergeant Heidt, Chief of Police Hebert, investigator Watkins, and others testified. Following this hearing, Sneddon instructed Plumer that no further investigation be conducted by the district attorney's office, and the matter subsequently was referred to the Attorney General's office. On October 31, 1986, Plumer relieved Van Camp of his duties relating to this case and placed him on \"administrative suspension.\" As noted above, Sneddon represented to the court that Van Camp subsequently was demoted, resulting in a decrease in salary from $52,000 per year to approximately $27,000 per year.\n\nNothing in the record before us suggests the district attorney had an improper motive in discontinuing the investigation that was being conducted by his office. An evidentiary hearing had been held regarding the destruction of the tape recording, and the matter later was referred to the Attorney General's office. (Cal. Const., art. V, § 13; Gov. Code, § 12550.) Defendant does not explain what purpose would have been served had the district attorney's office continued its own investigation.\n\nThe trial court rejected defendant's additional claim that Sneddon acted unethically in filing the Vehicle Code section 10851 charge, knowing it was not supported by substantial evidence, the court instead finding that Inez Blanco's denial that she had given defendant permission to take her automobile constituted a reasonable basis for the filing of the charge. This finding is supported by substantial evidence. The circumstances that Sneddon filed the Vehicle Code section 10851 charge at a time when Inez Blanco's degree of participation in the crimes was unclear, and later moved to dismiss that charge following further investigation, does not constitute unethical conduct or demonstrate that Sneddon had an improper motive in prosecuting the case.\n\nDefendant asserts that Sneddon had a \"personal stake\" in avoiding negative publicity, and thus was led to attempt to obtain a conviction \"at all costs.\" This improper motive is demonstrated, according to defendant, by\n\nSneddon's introduction of the multiple-hearsay statements of Perez, Inez Blanco's preliminary hearing testimony, and other evidence \"which would not have been introduced by other prosecutors.\" We have held that the trial court properly admitted the multiple-hearsay statements of Perez as well as Inez Blanco's preliminary hearing testimony. We find unpersuasive defendant's unsupported claim that these and other unspecified items of evidence would not have been introduced by other prosecutors.\n\nDefendant also makes reference to the fact that on October 31, 1986, the day following the initial evidentiary hearing concerning the destruction of the tape recording, the district attorney's office made a plea bargain offer to defendant of a sentence of life imprisonment without possibility of parole in the event he were to enter a plea of guilty. It was stated this offer would be withdrawn if not accepted that day. This circumstance was not raised as a ground for recusal, and was brought to the trial court's attention only in another context and more than one month after the court had denied the recusal motion. Defendant is therefore precluded from now arguing on this basis that the trial court erred in denying the recusal motion.\n\nWe conclude the trial court did not abuse its discretion in denying defendant's motion to recuse District Attorney Sneddon.\n\nD. DENIAL OF DEFENDANT'S MOTION FOR CONTINUANCE\n\nOn Thursday, December 4, 1986, the day after the trial court denied defendant's motion to recuse the district attorney (which was also the day scheduled for opening statements), defendant filed a motion for discovery seeking a list of the names and addresses of all witnesses interviewed by former trial prosecutor Van Camp and of all persons present during those interviews. The motion included a request for \"[a] sufficient continuance for the purpose of conducting . . . independent interviews.\" That same morning, the prosecution provided the defense with \"a list of between 50 and 60\" persons Van Camp had interviewed. The defense stated it wished to interview 24 of those persons. Following further Discussions and proceedings, the case was continued to Monday, December 8.\n\nWhen trial resumed on December 8, defendant filed a motion for mistrial on the ground that, because Van Camp's misconduct was not revealed until after the jury had been sworn, defendant had been denied an opportunity to ask \"many critical questions\" on voir dire. The motion did not specify the nature of these questions. In a declaration in support of the motion for mistrial, defense counsel stated that interviews of some of the 24 witnesses (on the list of witnesses interviewed by Van Camp) disclosed \"at least four\n\nmore instances of apparent prosecutorial misconduct.\" Defense counsel estimated that \"the type of inquiry needed to look into all the areas of potential prosecutorial misconduct will take a minimum of thirty to sixty days.\"\n\nIn arguing in support of a mistrial, the defense stated it \"basically\" was seeking a continuance. The trial court denied both the motion for mistrial and the motion for continuance, stating further: \"I will entertain a continuing motion for continuance . . . upon a proper showing you need one to investigate certain other witnesses. And we will--I will be sympathetic to your needs. But I don't have enough before me right now to grant the continuance.\" Following a recess, trial resumed with the prosecutor's and defense counsel's opening statements.\n\nOn appeal, defendant does not challenge the trial court's denial of the motion for mistrial, but only its denial of the motion for continuance.\n\n\"The granting or denial of a motion for continuance in the midst of a trial traditionally rests within the sound discretion of the trial Judge who must consider not only the benefit which the moving party anticipates but also the likelihood that such benefit will result, the burden on other witnesses, jurors and the court and, above all, whether substantial Justice will be accomplished or defeated by a granting of the motion. In the lack of a showing of an abuse of discretion or of prejudice to the defendant, a denial of his motion for a continuance cannot result in a reversal of a judgment of conviction. [Citations.]\" (People v. Laursen (1972) 8 Cal. 3d 192, 204 [104 Cal. Rptr. 425, 501 P.2d 1145]; see also People v. Ainsworth (1988) 45 Cal. 3d 984, 1030 [248 Cal. Rptr. 568, 755 P.2d 1017].)\n\nIn the present case the trial court did not abuse its discretion. It expressed sympathy for defendant's desire to investigate the possibility of additional instances of misconduct by Van Camp, and granted a brief delay from December 4 to December 8, 1986. The court, however, denied defendant's request for an additional midtrial continuance of \"a minimum of thirty to sixty days\" because of the burden such a delay would inflict upon the jurors, other witnesses, and the court. But the court invited defendant to renew his motion for continuance upon a showing relating to specific witnesses, noting: \"I will be sympathetic to your needs.\" Defendant has not cited any portion of the record establishing that he ever renewed his request.\n\nDefendant also has not demonstrated he was prejudiced by the denial of his motion for continuance. Although defense counsel represented that initial interviews had disclosed additional instances of misconduct, the record does\n\nnot reflect that such alleged misconduct had any bearing upon evidence to be introduced at trial, or otherwise deprived defendant of a fair trial. We have no basis to conclude, therefore, that the additional investigation defense counsel wished to conduct would have produced relevant evidence.\n\n4. ADMISSION OF THE PRELIMINARY HEARING TESTIMONY OF INEZ BLANCO\n\nA. ALLEGED VIOLATION OF DEFENDANT'S RIGHTS OF CONFRONTATION AND CROSS-EXAMINATION\n\nBefore the elder Inez Blanco was called to testify, the trial court, on its own motion, appointed counsel to advise her of her privilege against self-incrimination. Several days later, the prosecutor called Inez Blanco as a witness at a hearing conducted outside the presence of the jury. After answering a few preliminary questions, she declined to testify further, pursuant to the advice of her counsel, or the ground she might incriminate herself.\n\nA hearing was held to determine whether the prosecution would be permitted to introduce into evidence a transcript of the testimony given by Inez Blanco at the preliminary hearing. (Evid. Code, § 402.) Defendant called as a witness David Stanley, the attorney who represented defendant at the preliminary hearing. Stanley testified that because of delays in obtaining discovery from the prosecution, and the press of other work, he had had insufficient time to prepare for the preliminary hearing. Stanley recalled that at the time of the preliminary hearing, the charges against defendant included two alleged special circumstances: murder for hire or financial gain, and murder committed during the course of a robbery. (§ 190.2, subds. (a)(1), (a)(17).) Defendant also was charged, in a separate complaint, with unlawfully taking a vehicle (Veh. Code, § 10851, subd. (a)). One of Stanley's primary goals was to eliminate the special circumstances allegations, if possible, and he believed the allegation of murder for hire or financial gain was \"particularly weak.\" He understood the prosecution's theory to be that Inez Blanco had \"procured the services\" of defendant to commit the murder.\n\nWhen the prosecution completed its direct examination of Inez Blanco at the preliminary hearing, Stanley concluded \"there was no direct evidence whatsoever which would support an inference that there had been a murder for hire, and only very weak circumstantial evidence that would in any way associate [defendant] with the killing . . ..\" Determining, therefore, that there was no need to contest Blanco's credibility, Stanley focused instead (in his cross-examination of the witness) on not inadvertently revealing evidence supportive of the murder-for-hire allegation. Stanley's view was that\n\nif he \"didn't blunder and bring out some damaging evidence that the prosecution had not brought out, that when [Blanco] departed from the witness stand, the allegation of [murder for] financial gain was going to fall by the wayside. That was certainly my goal.\"\n\nStanley also was aware that, should a penalty phase of the trial ensue, Blanco was as close a family member as defendant had, and it therefore \"was very important . . . not to alienate her by any kind of rude or roughshod tactics in examining her, but rather to maintain a positive kind of relationship with her in the speculation of maintaining her cooperation . . ..\"\n\nAt the Conclusion of the preliminary hearing, the magistrate dismissed the allegation that the murder was committed for financial gain. Subsequently, the charge of unlawfully taking a vehicle was dismissed on the People's motion.\n\nBased upon Inez Blanco's invocation of her privilege against self-incrimination, the trial court found she was unavailable. (Evid. Code, § 240.) Defendant argued that despite Blanco's unavailability, her preliminary hearing testimony was inadmissible, because that testimony is unreliable and defendant's motive for cross-examining Blanco at the preliminary hearing differed from his motive for cross-examining her at trial. The trial court ruled that the transcript of her testimony at the preliminary hearing was admissible except for her testimony that she did not give defendant permission to take her automobile, because in dismissing the Vehicle Code section 10851 charge the prosecution stated it no longer believed that portion of her testimony was true. Following the Evidence Code section 402 hearing, the transcript of Blanco's preliminary hearing testimony was read to the jury.\n\nDefendant contends that the admission at trial of this testimony violated Evidence section 1291, as well as his right of confrontation under the federal and state Constitutions.\n\nEvidence Code section 1291, subdivision (a), provides, in pertinent part: \"Evidence of former testimony is not made inadmissible by the hearsay rule if the declarant is unavailable as a witness and: [P] . . . [P] (2) The party against whom the former testimony is offered was a party to the action or proceeding in which the testimony was given and had the right and opportunity to cross-examine the declarant with an interest and motive similar to that which he has at the hearing.\" Defendant contends that his motive for cross-examining Blanco at the preliminary hearing \"differed materially and substantially\" from his motives at trial because (1) defense counsel feared\n\nthat extensive cross-examination at the earlier hearing might reveal damaging evidence regarding the special circumstance allegation of murder for financial gain which the prosecution had failed to prove and which subsequently was dismissed, and (2) he did not wish to alienate Blanco because she might be a crucial witness during a possible penalty phase.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nFrequently, a defendant's motive for cross-examining a witness during a preliminary hearing will differ from his or her motive for cross-examining that witness at trial. For the preliminary hearing testimony of an unavailable witness to be admissible at trial under Evidence Code section 1291, these motives need not be identical, only \"similar.\" (People v. Alcala (1992) 4 Cal. 4th 742, 784 [15 Cal. Rptr. 2d 432, 842 P.2d 1192].) Admission of the former testimony of an unavailable witness is permitted under Evidence Code section 1291 and does not offend the confrontation clauses of the federal or state Constitutions--not because the opportunity to cross-examine the witness at the preliminary hearing is considered an exact substitute for the right of cross-examination at trial (see Barber v. Page (1968) 390 U.S. 719, 725 [20 L.Ed.2d 255, 260, 88 S.Ct. 1318]), but because the interests of Justice are deemed served by a balancing of the defendant's right to effective cross-examination against the public's interest in effective prosecution. (Ohio v. Roberts (1980) 448 U.S. 56, 64 [65 L.Ed.2d 597, 606, 100 S.Ct. 2531]. People v. Malone, supra, 47 Cal. 3d 1, 24.)\n\nDefendant's interest and motive for cross-examining Inez Blanco during the preliminary hearing were sufficiently similar to those existing at trial so as to permit the admission of Blanco's preliminary hearing testimony. On both occasions, Blanco's testimony relating her contacts with defendant the day preceding the murder, defendant's need for money, and the disappearance of Blanco's automobile near the time of the murder, had the same tendency to establish defendant's guilt. Defendant's interest and motive in discrediting this testimony was identical at both proceedings.\n\nDefense counsel's testimony that he chose, for strategic considerations, not to vigorously cross-examine Blanco does not render her former testimony inadmissible. As long as defendant was given the opportunity for effective cross-examination, the statutory requirements were satisfied; the admissibility of this evidence did not depend on whether defendant availed himself fully of that opportunity. (People v. Green, supra, 3 Cal. 3d 981, 990; People v. Sul (1981) 122 Cal. App. 3d 355, 367 [175 Cal. Rptr. 893].)\n\nDefendant relies upon the decision in United States v. Salerno (1992) 510 U.S. [120 L.Ed.2d 255, 112 S.Ct. 2503], in which the trial court precluded\n\nthe defendant from introducing testimony given before the grand jury by two witnesses who refused to testify at trial on the ground they might incriminate themselves. Defendant asserts: \"The Salerno opinion is important because it demonstrates that a prosecutor may not have a 'similar motive' in examining a witness in front of a Grand Jury\" as might exist at trial. Defendant is mistaken, because the high court in Salerno expressed no opinion on the question. Instead, the court remanded the matter to the Court of Appeals for consideration of this issue. ( at p. [120 L.Ed.2d at p. 264].)\n\nDefendant additionally asserts the trial court's reasoning in overruling defendant's objection to this evidence was \"seriously flawed,\" because the court stated the evidence would be admissible even if defendant's interests in cross-examining Blanco at the preliminary hearing and at trial were \"entirely different.\" We need not, and do not, determine whether this single comment reflects a misunderstanding on the part of the trial court as to the requirements for admission of former testimony of an unavailable witness. \" 'No rule of decision is better or more firmly established by authority, nor one resting upon a sounder basis of reason and propriety, than that a ruling or decision, itself correct in law, will not be disturbed on appeal merely because given for a wrong reason. If right upon any theory of the law applicable to the case, it must be sustained regardless of the considerations which may have moved the trial court to its Conclusion.' [Citation.]\" (D'Amico v. Board of Medical Examiners (1974) 11 Cal. 3d 1, 19 [112 Cal. Rptr. 786, 520 P.2d 10].) The trial court's ruling admitting the preliminary hearing testimony of Inez Blanco was correct because, as explained above, defendant's \"motive and interest\" for cross-examining Inez Blanco at the preliminary hearing and at trial were, as a matter of law, sufficiently similar to satisfy the requirements of Evidence Code section 1291.\n\nB. ALLEGED VIOLATION OF DEFENDANT'S RIGHT TO DUE PROCESS OF LAW\n\nA separate felony complaint (amended on Mar. 19, 1985) was filed charging defendant with unlawfully taking Inez Blanco's automobile. (Veh. Code, § 10851, subd. (a).) This complaint was joined, for the purpose of the preliminary hearing, with the complaint in the present case charging defendant with murder.\n\nAt the preliminary hearing, which began on September 3, 1985, Blanco testified that her automobile was stolen on the morning the murder occurred, and that she had not given defendant (or anyone else) permission to take the vehicle. As explained above, Blanco went on to testify concerning other matters, testimony which ultimately was introduced at trial. Defendant was\n\nheld to answer on the charge of unlawfully taking an automobile and, on September 17, 1985, an information charging that offense was filed.\n\nOn November 14, 1985, the prosecution filed a motion to consolidate the information charging the unlawful taking of an automobile with the information in the present case. The trial court granted that motion on December 2, 1985. On September 17, 1986, the charge of unlawfully taking an automobile was dismissed on the People's motion, which was premised on the following ground: \"the People no longer believe that the defendant actually took or used the vehicle without the owner's permission and therefore lack suffi[cient] evidence to convict.\"\n\nDuring a motion to recuse the Office of the District Attorney for the County of Santa Barbara, Deputy District Attorney Eugene Martinez, the prosecutor at the preliminary hearing, testified that at the time of this hearing, he assumed Inez Blanco had induced defendant to commit the murder and \"thought there was a good possibility that she was lying\" about defendant's having taken her automobile without her permission, believing, however, the remainder of her testimony to be truthful.\n\nDefendant contends he was denied due process of law because the prosecutor, for the purpose of inducing Inez Blanco to testify at the preliminary hearing, filed and maintained against defendant the charge of unlawfully taking a vehicle, knowing that that charge was based upon false testimony and that at trial Blanco would exercise her Fifth Amendment privilege against self-incrimination and refuse to testify. We need not, and do not, determine whether the record before us establishes the first factual premise of this contention (that the prosecution improperly filed and maintained a charge against defendant, knowing it was based upon false testimony), because it is clear the record before us does not establish the remaining premises of this contention; that the prosecutor's purpose in filing and maintaining the alleged Vehicle Code violation was to induce Blanco to testify, that the filing of this charge in fact induced Blanco to testify at the preliminary hearing, and that the prosecution knew Blanco would refuse to testify at trial.\n\nThe trial court found the prosecutor did not have an improper purpose in introducing Inez Blanco's preliminary hearing testimony that she did not give defendant permission to take her automobile. Nothing in the record before us compels us to reject that finding.\n\nIn addition, defendant does not explain why filing the Vehicle Code section 10851 charge against defendant would have induced Inez Blanco to\n\ntestify at the preliminary hearing. In light of the special circumstance allegation that defendant committed the murder for hire or for financial gain, the filing of the unlawful-taking-of-a-vehicle charge hardly could have convinced Blanco that the prosecution did not at least suspect she was an accomplice to the murder. The evidence available to the prosecution suggests it logically would have believed that the person who hired defendant was Inez Blanco.\n\nFinally, nothing in the record would support a finding that the prosecution, knowing Inez Blanco would refuse to testify at trial, induced her to testify at the preliminary hearing.\n\nDefendant relies upon the observation in People v. Trevino (1985) 39 Cal. 3d 667, 681 [217 Cal. Rptr. 652, 704 P.2d 719], that \"the prosecutor may not bring criminal charges against an individual unless supported by probable cause,\" and the holding in White v. Ragen (1945) 324 U.S. 760, 764 [89 L.Ed. 1348, 1352, 65 S.Ct. 978], \"that a conviction, secured by the use of perjured testimony known to be such by the prosecuting attorney, is a denial of due process. [Citations.]\" Neither of these decisions provides a basis for reversal of the judgment in the present case.\n\nWe need not, and do not, determine whether the record establishes (1) that Inez Blanco committed perjury by testifying at the preliminary hearing that she did not give defendant permission to take her automobile, and, if so, (2) that the prosecutor knew this testimony was perjured. The charge of unlawfully taking a vehicle was dismissed prior to trial, and the disputed portion of Blanco's preliminary hearing testimony was not admitted into evidence at trial. Nothing suggests that the remaining portions of Blanco's testimony (which were received at trial) were perjured. Accordingly, defendant has failed to establish that perjured testimony was admitted at the trial or was used in some indirect manner to secure his conviction.\n\n5. ADMISSION OF INEZ BLANCO'S PRIOR INCONSISTENT STATEMENTS\n\nIn her testimony at the preliminary hearing, Inez Blanco denied that when she saw defendant the day preceding the murder, he was desperate for money, but she admitted he may have driven her automobile on that occasion. After Blanco's preliminary hearing testimony was read to the jury, the prosecution called as a witness Lompoc Police Sergeant Vernon Stevens, who testified without objection that prior to the preliminary hearing, Blanco had told him that the day preceding the murder defendant had asked to drive her automobile but she had refused. Blanco further had stated that defendant had made repeated requests for money, which she also had refused.\n\nDefendant contends the admission of this evidence violated his right to confront the witnesses against him, because he had no opportunity to cross-examine Inez Blanco regarding her inconsistent statement. (People v. Beyea (1974) 38 Cal. App. 3d 176 [113 Cal. Rptr. 254].) We asked the parties to submit supplemental briefs addressing the question whether defendant timely objected to the admission of this evidence. Defendant concedes he did not raise a separate objection to the admission of Sergeant Steven's testimony regarding Inez Blanco's inconsistent statements, but contends such an objection \"was incorporated within the objection to the introduction of Inez Blanco's preliminary hearing testimony.\" We disagree.\n\nEvidence Code section 353, subdivision (a), provides that a judgment shall not be reversed because of the erroneous admission of evidence unless there was a timely objection \"so stated as to make clear the specific ground of the objection . . ..\" \"The reason for the requirement is manifest: a specifically grounded objection to a defined body of evidence serves to prevent error. It allows the trial Judge to consider excluding the evidence or limiting its admission to avoid possible prejudice. It also allows the proponent of the evidence to lay additional foundation, modify the offer of proof, or take other steps designed to minimize the prospect of reversal. [Citation.]\" (People v. Morris (1991) 53 Cal. 3d 152, 187-188 [279 Cal. Rptr. 720, 807 P.2d 949].) As previously noted, defendant objected to the admission of Inez Blanco's preliminary hearing testimony, and the trial court properly overruled that objection. Defendant did not, however, object to the admission of Sergeant Stevens's testimony and did not apprise the trial court of the contention he now makes on appeal, namely, that even if Inez Blanco's preliminary hearing testimony was admissible, Sergeant Stevens's testimony relating Blanco's prior inconsistent statements was inadmissible.\n\nDefendant further asserts he did not object to the admission of Sergeant Stevens's testimony because the trial court had stated, in ruling upon defendant's objection to the admission of Inez Blanco's preliminary hearing testimony: \"I've made my ruling. That's all the argument I want on the subject.\" The quoted statement indicates only that the court would entertain no further argument concerning defendant's objection to the admission of Inez Blanco's preliminary hearing testimony; the court did not preclude defendant from raising additional objections to other evidence.\n\nFinally, defendant cites the plurality opinion on People v. Frank (1985) 38 Cal. 3d 711, 729, footnote 3 [214 Cal. Rptr. 801, 700 P.2d 415], for the proposition that \"On an appeal from a judgment imposing the penalty of death, a technical insufficiency in the form of an objection will be disregarded . . ..\" As we noted in rejecting a similar contention, \"Here, however, there was not a 'technical insufficiency in the form of an objection';\n\nthere was no objection at all.\" (People v. Poggi (1988) 45 Cal. 3d 306, 331 [246 Cal. Rptr. 886, 753 P.2d 1082]; see also People v. Jennings (1991) 53 Cal. 3d 334, 357 [279 Cal. Rptr. 780, 807 P.2d 1009].) Accordingly, this issue may not be raised for the first time on appeal. (People v. Welch (1972) 8 Cal. 3d 106, 114-115 [104 Cal. Rptr. 217, 501 P.2d 225].)\n\nEven if the issue had been preserved for review and the trial court had erred in admitting Blanco's statements, reversal of the judgment would not be required, because any such error was harmless beyond a reasonable doubt. (Chapman v. California (1967) 386 U.S. 18 [17 L.Ed.2d 705, 87 S.Ct. 824, 24 A.L.R.3d 1065]; People v. Beyea, supra, 38 Cal. App. 3d 176, 194.) Inez Blanco's statement that defendant \"may\" have driven her automobile the day preceding the murder is significant only to the extent it provided an innocent explanation for the presence of defendant's fingerprints inside the vehicle. The prosecution's fingerprint expert testified, however, that the location of defendant's fingerprint on the gearshift lever indicated defendant was the last person to drive the vehicle. Additionally, Blanco's vehicle was found parked near the bus station from which defendant had left town, and Pastor Valdez testified he had seen defendant driving a similar vehicle, which defendant had said belonged to his sister. Therefore, the admission of Blanco's out-of-court statement that defendant had not driven her automobile the day preceding the murder could not have affected the outcome of the trial.\n\nSimilarly, the admission of Blanco's out-of-court statement that defendant had asked her for money could not have affected the verdict, in light of Blanco's testimony at the preliminary hearing that defendant had searched her vehicle for coins and had telephoned her at 3 a.m., requesting an advance of funds from their mother's estate. We conclude any error in the admission of this evidence was harmless beyond a reasonable doubt.\n\nDefendant contends that in the event he is precluded from challenging on appeal the admission of Sergeant Stevens's testimony because the defense failed to object in the trial court, he was denied the effective assistance of counsel and the judgment must be reversed on that basis. \"Reviewing courts will reverse convictions on the ground of inadequate counsel only if the record on appeal affirmatively discloses that counsel had no rational tactical purpose for his act or omission.\" (People v. Fosselman (1983) 33 Cal. 3d 572, 581 [189 Cal. Rptr. 855, 659 P.2d 1144].) In the present case, defense counsel reasonably might have chosen for tactical reasons not to object to Sergeant Stevens's testimony because, although this evidence was favorable to the People in some respects, it also benefited defendant insofar as it served to impeach Inez\n\nBlanco's preliminary hearing testimony. Also, as noted above, Sergeant Stevens's testimony was not very damaging to defendant's case, in light of the other evidence establishing that defendant asked Inez Blanco for money prior to the murder and drove her automobile after the murder. Defense counsel reasonably may have concluded, therefore, that defendant's interests were better served by the admission of this evidence, because it impeached Inez Blanco's preliminary hearing testimony.\n\nDefendant's claim that he was denied effective assistance of counsel also fails for another reason. A judgment will not be reversed based on denial of effective representation unless there is a reasonable probability that, but for counsel's failings, the result would have been more favorable to the defendant. (People v. Mitcham (1992) 1 Cal. 4th 1027, 1058 [5 Cal. Rptr. 2d 230, 824 P.2d 1277]; People v. Ledesma (1987) 43 Cal. 3d 171, 216-218 [233 Cal. Rptr. 404, 729 P.2d 839]; see Strickland v. Washington (1984) 466 U.S. 668, 687-696 [80 L.Ed.2d 674, 693-699, 104 S.Ct. 2052].) As noted above, even if the challenged evidence had been excluded, it is not reasonably probable a determination more favorable to defendant would have resulted.\n\n6. ACCOMPLICE INSTRUCTIONS\n\nInez Blanco testified that she met with defendant the day preceding the murder, that defendant repeatedly asked her for money and that, shortly after the murder, she discovered her automobile had been stolen. Her testimony tended to connect defendant with the crime by providing possible motives (defendant's desire for money and for revenge on behalf of his sister) and by establishing that Inez Blanco's automobile, which later was linked to defendant, had been taken from her residence (located a few blocks from the murder scene) near the time of the murder. Defendant contends the trial court should have instructed the jury that Inez Blanco was an accomplice to the murder as a matter of law, and that her testimony required corroboration and should be viewed with distrust. The People, disputing defendant's assertion that Blanco was an accomplice as a matter of law, argue the trial court was not required to give \"the standard accomplice instructions\" absent defense request, because such instructions would have been inconsistent with defendant's theory of the case. Although the evidence does not establish that Blanco was an accomplice as a matter of law, we agree with defendant that accomplice instructions should have been given, but conclude the trial court's omission was harmless error.\n\nSection 1111 defines an accomplice \"as one who is liable to prosecution for the identical offense charged against the defendant . . ..\" The section\n\nfurther provides: \"A conviction cannot be had upon the testimony of an accomplice unless it be corroborated by such other evidence as shall tend to connect the defendant with the commission of the offense; and the corroboration is not sufficient if it merely shows the commission of the offense or the circumstances thereof.\"\n\n\" '[W]henever the testimony given upon the trial is sufficient to warrant the Conclusion upon the part of the jury that a witness implicating a defendant was an accomplice,' \" the trial court must instruct the jury, sua sponte, to determine whether the witness was an accomplice. (People v. Bevins (1960) 54 Cal. 2d 71, 76 [4 Cal. Rptr. 504, 351 P.2d 776].) If the testimony establishes that the witness was an accomplice as a matter of law, the jury must be so instructed. (People v. Robinson (1964) 61 Cal. 2d 373, 394 [38 Cal. Rptr. 890, 392 P.2d 970].) In either case, the trial court also must instruct the jury, sua sponte, \"(1) that the testimony of the accomplice witness is to be viewed with distrust [citations], and (2) that the defendant cannot be convicted on the basis of the accomplice's testimony unless it is corroborated . . ..\" (People v. Gordon (1973) 10 Cal. 3d 460, 466, fn. 3 [110 Cal. Rptr. 906, 516 P.2d 298].)\n\nNonetheless, \"the failure to instruct on accomplice testimony pursuant to section 1111 is harmless where there is sufficient corroborating evidence in the record. [Citations.] The requisite corroboration may be established entirely by circumstantial evidence. [Citations.] Such evidence 'may be slight and entitled to little consideration when standing alone. [Citations.]' \" (People v. Miranda (1987) 44 Cal. 3d 57, 100 [241 Cal. Rptr. 594, 744 P.2d 1127].) \"Corroborating evidence 'must tend to implicate the defendant and therefore must relate to some act or fact which is an element of the crime but it is not necessary that the corroborative evidence be sufficient in itself to establish every element of the offense charged.' [Citation.]\" (People v. Sully (1991) 53 Cal. 3d 1195, 1228 [283 Cal. Rptr. 144, 812 P.2d 163].)\n\nIn the present case, there was more than ample corroborating evidence. Evidence was introduced establishing that the younger Inez Blanco said defendant appeared at the Blanco residence shortly after the murder with blood on his person and stated: \"What am I going to do?\" Two witnesses testified that Inez Blanco's automobile was not in front of her house the morning the murder occurred. One witness added that Inez Blanco appeared surprised upon learning that her automobile was missing. Pastor Joe Valdez testified that on the day of the murder defendant was driving an automobile which defendant said belonged to his sister. Defendant left town on a bus, and Inez Blanco's automobile later was found abandoned at the bus station. The prosecution's expert testified that the position of defendant's\n\nfingerprint on the gearshift lever indicated that defendant was the last person to have driven the vehicle. Furthermore, evidence of defendant's flight shortly after the murder was committed \"supports an inference of consciousness of guilt and constitutes an implied admission which may properly be considered as corroborative of an accomplice's testimony. [Citation.]\" (People v. Garrison (1989) 47 Cal. 3d 746, 773 [254 Cal. Rptr. 257, 765 P.2d 419].) The other evidence of defendant's guilt was sufficient, therefore, to corroborate the testimony of the elder Inez Blanco, and any error committed by the trial court in failing to instruct the jury regarding the testimony of an accomplice was harmless.\n\n7. ADMISSION OF A PHOTOGRAPH OF THE MURDER VICTIM WHILE ALIVE\n\nThe prosecution offered into evidence a photograph taken of the victim while alive. In the photograph, she was wearing a fur coat and gold jewelry. Defendant objected on the ground the photograph was irrelevant because \"[i]dentity is not an issue.\" The trial court overruled the objection and admitted the photograph.\n\n\"Although we have held that photographs of victims while alive should not be admitted if they have 'no bearing on any contested issue in the case' [citation], the court has discretion to admit such photographs if relevant. [Citation.]\" (People v. Cooper, supra, 53 Cal. 3d 771, 821.) In the present case, the victim was engaged in an adulterous relationship with defendant's brother-in-law. Anger and jealousy on the part of defendant's sister was asserted as a motivating factor for the murder. Under these circumstances, the photograph of the victim while alive, showing she was attractive and well dressed, had some relevance.\n\nDefendant asserts the photograph of the victim taken while she was alive was unusually prejudicial in this case, because it showed the victim wearing jewelry and a fur coat, thus suggesting robbery as a motive for the murder, when in fact the victim was not prosperous and was receiving welfare. Rather than establishing prejudice, however, the photograph's depiction of Ruby Gonzales as a likely robbery victim enhanced its relevance and supported its admissibility. Regardless of the victim's economic status, her possession of valuable items of personal property provided a motive for robbery. Defendant was free to offer evidence to the contrary.\n\nIn any event, the tendency of the photograph to establish the victim owned expensive furs and jewelry would have been cumulative. Inez Blanco testified she saw the victim wearing a diamond necklace valued at $6,000. It is not reasonably probable, therefore, that a result more favorable to defendant\n\nwould have been reached had this photograph not been admitted. (People v. Watson (1956) 46 Cal. 2d 818, 837 [299 P.2d 243]; see People v. Taylor (1990) 52 Cal. 3d 719, 731 [276 Cal. Rptr. 391, 801 P.2d 1142]; People v. Anderson, supra, 52 Cal. 3d 453, 475; People v. Frank (1990) 51 Cal. 3d 718, 734 [274 Cal. Rptr. 372, 798 P.2d 1215].)\n\n8. THE SPECIAL CIRCUMSTANCES FINDINGS\n\nReferring to his argument, discussed above, that the trial court erred in failing to instruct the jury that Inez Blanco was an accomplice as a matter of law and that her testimony required corroboration and should be viewed with distrust, defendant argues that this omission also requires reversal of the jury's findings, as special circumstances, that the murder was committed during the commission of an attempted robbery and a burglary. As explained above, any such error is harmless, because Inez Blanco's testimony was sufficiently corroborated. (Ante, at pp. 981-982.)\n\nRelying on the rule stated in People v. Green (1980) 27 Cal. 3d 1, 61 [164 Cal. Rptr. 1, 609 P.2d 468], that a finding of special circumstances is improper if \"the robbery [or burglary] is merely incidental to the murder,\" defendant contends that the evidence is insufficient to sustain the special circumstances findings. We disagree. In Green, the \"sole object\" of the robbery was \"to facilitate or conceal the primary crime\" of murder. (Ibid.) The defendant took the victim's purse, clothes, and rings in order to conceal her identity. The facts in the present case are dissimilar. There is no indication defendant committed the burglary or attempted robbery in order to facilitate or conceal the murder.\n\nInstead, the evidence is sufficient to sustain a finding that defendant intended to rob and then kill his victim. Inez Blanco testified that defendant needed money, and that the victim kept both cash and valuable jewelry in her home. In addition, Ruby Gonzales's 13-year-old daughter Marci testified she heard her mother pleading with her attacker, \"I will give you the money and the jewelry.\" Defendant argues this statement proves that defendant's sole purpose was to kill the victim, because he refused her offer of money and valuables, killed her, and left with nothing. The jury reasonably could have concluded otherwise. An equally plausible interpretation of the victim's statement is that the victim was responding to defendant's demand for money and jewelry. A likely reason defendant fled without completing the robbery was that he knew Marci Gonzales had telephoned the police.\n\nDefendant relies upon the holding in People v. Thompson (1980) 27 Cal. 3d 303 [165 Cal. Rptr. 289, 611 P.2d 883]. In that case, the defendant\n\nentered the residence of a couple who were engaged to be married and demanded money at gunpoint but did not take the cash and jewelry produced by the victims, later stating he did not want these things. After demanding and receiving the key to the victims' automobile, the defendant said to the woman, \" 'You know why I'm here and you know who sent me,' \" and shot both victims, killing the man. ( at p. 311.) The surviving victim testified that her former husband had threatened to kill her fiance and harm her.\n\nWe held the evidence was insufficient to sustain special circumstances findings that the murder was committed during the commission of a robbery and burglary, reasoning that the defendant's refusal to accept valuables that were given to him was inconsistent with an intent to steal and that the statement made by the defendant just prior to shooting the victims revealed that his true purpose was to shoot the victims. We concluded that the defendant's demand for and acceptance of the key to the victim's automobile, viewed in context indicated a desire for a means of escape rather than an intent to steal.\n\nThe present case is different from Thompson, supra, 27 Cal. 3d 303. Gonzales offered to give defendant money and jewelry, but such valuables were not actually produced and refused, as was the case in Thompson. The record supports the inference in the present case that defendant intended first to kill Gonzales and then steal her money and jewelry, but abandoned this plan when the victim's daughter summoned the police. Also, unlike the defendant in Thompson, defendant in the present case did not state that his intention was not to steal.\n\nDefendant contends that his extrajudicial statements (made shortly before the murder), requesting money from his sister, cannot be used to establish the corpus delicti of the alleged special circumstances. Although it is true that \"the corpus delicti of felony-based special circumstances must be established independently of an accused's extrajudicial statements\" (People v. Mattson (1984) 37 Cal. 3d 85, 94 [207 Cal. Rptr. 278, 688 P.2d 887], fn. omitted), no such error occurred in the present case.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\n\" 'The corpus delicti of a crime consists of two elements, the fact of the injury or loss or harm, and the existence of a criminal agency as its\n\ncause.' [Citation.] Such proof, however, may be circumstantial and need only be a slight or prima facie showing 'permitting the reasonable inference that a crime was committed.' [Citation.]\" (People v. Jennings, supra, 53 Cal. 3d 334, 364.) \"[T]he quantum of evidence the People must produce in order to satisfy the corpus delicti rule is quite modest . . ..\" ( at p. 368.)\n\nThe jury in the present case was instructed correctly regarding the corpus delicti rule, and there was some evidence of each element of the special circumstances independent of defendant's statements. Specifically, the testimony of Marci Gonzales that her mother offered defendant \"the money and the jewelry\" is evidence tending to establish the occurrence of an attempted robbery, a reasonable inference being that the victim's offer was made in response to a demand from her assailant for money and jewelry. This is sufficient to satisfy the corpus delicti rule. (People v. Jennings, supra, 53 Cal. 3d 334, 367.)\n\nPENALTY PHASE ISSUES\n\n9. ADMISSION OF EVIDENCE OF THE CIRCUMSTANCES UNDERLYING DEFENDANT'S 1973 CONVICTION OF VOLUNTARY MANSLAUGHTER\n\nAt the penalty phase of the trial, records of defendant's 1978 conviction of robbery and his 1973 conviction of voluntary manslaughter were received in evidence. Sergeant Charles Dunham of the Oxnard Police Department then testified that approximately 3 p.m. on June 20, 1973, upon arriving at the scene of a crime, he witnessed a body being transported to St. John's Hospital. Dunham described the crime scene, which included an automobile with large amounts of blood on the back seat, and identified photographs of the automobile and the surrounding area. A knife of the type used to harvest lettuce was found inside the vehicle. Dunham described the knife as having a blade approximately six inches long \"with a sharp curve.\"\n\nDr. Roy Levin, a physician, testified he specialized in emergency practice at Ventura County General Hospital when, on June 20, 1973, he treated the victim of a knife wound who was in critical condition. He performed emergency surgery, but the patient died. From an examination of the wound, Dr. Levin concluded the murder weapon was a \"thin-bladed sword or bayonet\" approximately 12 inches long. Dr. Levin identified an autopsy photograph of the patient he had treated.\n\nMary Romero testified that on June 20, 1973, she was standing in her front yard near the scene of the crime described by Sergeant Dunham when she heard a scream and observed a fight taking place in the back seat of an\n\nautomobile. She then saw \"[a] guy running, and a guy screaming, and he just fell to the ground.\" The person running fled the scene.\n\nAfter the prosecutor had rested his case, defendant moved to strike the testimony of Dr. Levin on \"[g]rounds of relevance and lack of foundation,\" because the prosecution allegedly had failed to make \"any proper connection between the testimony of the physician and the case . . ..\" Additionally, defendant moved for a mistrial of the penalty phase. The prosecutor requested, and was granted, permission to reopen his case to present the testimony of Robert Salas.\n\nSalas testified that on June 20, 1973, he was a homicide detective in the Oxnard Police Department and was called to the scene of a crime. He examined the victim, who was lying on the sidewalk and appeared to have been stabbed. Salas went to the hospital, where he saw the victim and spoke with Dr. Levin. Salas identified the autopsy photograph previously identified by Dr. Levin as depicting the wound suffered by the victim. At the Conclusion of Salas's testimony, the prosecution again rested its case. Defendant renewed his motions to strike the testimony of Dr. Levin and for mistrial, and those motions were denied.\n\nDefendant contends the trial court erred in admitting evidence of the circumstances underlying his 1973 conviction of voluntary manslaughter, because that ruling allowed the prosecution to relitigate the circumstances of the crime, violated defendant's constitutional protection against being twice placed in jeopardy, and denied him a speedy trial. We have rejected such claims on several occasions. (People v. Fierro (1991) 1 Cal. 4th 173, 231 [3 Cal. Rptr. 2d 426, 821 P.2d 1302], and cases cited therein.)\n\nDefendant also contends the trial court should have excluded the foregoing evidence pursuant to Evidence Code section 352, because its prejudicial effect outweighed its probative value. Defendant did not object on this ground in the trial court and may not raise the issue for the first time on appeal. (People v. Anderson, supra, 52 Cal. 3d 453, 477.) Even had this contention not been waived, it would fail. \"The short answer to this claim is that the evidence is expressly made admissible by factor (b) of section 190.3. The court is not given discretion under Evidence Code section 352, to exclude this evidence when offered at the penalty phase where . . . the question for the jury is not one of fact in determining guilt. [Fn. omitted.]\" (People v. Karis, supra, 46 Cal. 3d 612, 641.)\n\nDefendant contends the trial court erred in denying his motion to strike the testimony of Dr. Levin, because no evidence was admitted establishing that defendant's conviction of voluntary manslaughter arose from the\n\nstabbing of the victim treated by Dr. Levin. Defendant failed to object on this basis in the trial court, however, and may not raise this issue for the first time on appeal. (Evid. Code, § 353.)\n\nIn the trial court, defendant objected only to the testimony of the physician, and solely on the ground that the physician's inability to identify the victim rendered his testimony irrelevant. In response, the prosecutor obtained permission to reopen his case, calling an additional witness who testified that the victim transported from the scene of the crime was the same person treated by the physician. At no time did defendant object on the ground that the crime at issue was not the crime of which defendant subsequently was convicted.\n\nEven had the trial court erred, retrial of the penalty phase would not be required, because there is no reasonable possibility the jury would not have imposed the death penalty had the testimony of Dr. Levin been stricken.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e (People v. Brown (1988) 46 Cal. 3d 432, 448 [250 Cal. Rptr. 604, 758 P.2d 1135].) Defendant did not object to the admission of the testimony of the other witnesses concerning the June 20, 1973 stabbing incident Dr. Levin's testimony added nothing that was likely to affect the jury's penalty determination.\n\n10. ALLEGED LIMITATION ON DEFENDANT'S RIGHT TO INTRODUCE RELEVANT EVIDENCE IN MITIGATION\n\nThe trial court precluded defendant from introducing evidence that, following the disclosure of prosecutor Van Camp's unethical conduct concerning the tape recording, District Attorney Sneddon offered defendant a plea bargain which included a sentence of life in prison without possibility of parole. Defendant also was precluded from introducing evidence that Van Camp improperly had \"primed\" a potential witness. John Velo, by disclosing information to Velo during an interview. Velo was not called as a witness at the trial. The trial court did allow defendant to introduce evidence concerning the destruction of the tape recording found by Van Camp.\n\nIn Lockett v. Ohio (1978) 438 U.S. 586, 604 [57 L.Ed.2d 973, 98 990, S.Ct. 2954], the United States Supreme Court ruled \"that the Eighth and Fourteenth Amendments require that the sentencer, in all but the rarest kind\n\nof capital case, not be precluded from considering, as a mitigating factor, any aspect of a defendant's character or record and any of the circumstances of the offense that the defendant proffers as a basis for a sentence less than death.\" (Italics in original, fns. omitted.) In a footnote, the high court added this clarification: \"Nothing in this opinion limits the traditional authority of a court to exclude, as irrelevant, evidence not bearing on the defendant's character, prior record, or the circumstances of his offense.\" ( at p. 604, fn. 12 [57 L.Ed.2d at p. 990].)\n\nIn the present case, the trial court acted within its traditional authority in excluding evidence relating to Van Camp's alleged prosecutorial misconduct in interviewing a potential witness who was not called to testify, and in excluding evidence of a plea bargain offered by the prosecution but rejected by defendant. The proffered evidence did not bear upon defendant's character, prior record, or the circumstances of his offense and, thus, did not constitute mitigating evidence. (People v. Fauber (1992) 2 Cal. 4th 792, 857 [9 Cal. Rptr. 2d 24, 831 P.2d 249]; People v. Daniels (1991) 52 Cal. 3d 815, 878 [277 Cal. Rptr. 122, 802 P.2d 90]; People v. Wright (1990) 52 Cal. 3d 367, 431 [276 Cal. Rptr. 731, 802 P.2d 221]; People v. Thompson (1988) 45 Cal. 3d 86, 138-139 [246 Cal. Rptr. 245, 753 P.2d 221]; People v. Belmontes (1988) 45 Cal. 3d 744, 811 [248 Cal. Rptr. 126, 755 P.2d 310]; People v. Gates (1987) 43 Cal. 3d 1168, 1210 [240 Cal. Rptr. 666, 743 P.2d 301].)\n\nDefendant contends that evidence that Van Camp used improperly suggestive techniques to interview a prospective witness was \"relevant to the issue of lingering doubt . . ..\" This court has held that at the penalty phase, jurors may consider any lingering doubts concerning the defendant's guilt. (People v. Kaurish (1990) 52 Cal. 3d 648, 706 [276 Cal. Rptr. 788, 802 P.2d 278].) But this does not mean that the defendant may introduce evidence, not otherwise admissible at the penalty phase, for the purpose of creating a doubt as to the defendant's guilt.\n\nDefendant relies upon the holding in Jeffers v. Ricketts (D.Ariz. 1986) 627 F.Supp. 1334, 1358, that evidence of plea bargains offered by the prosecution which included lesser punishment \"should be considered [as a mitigating factor] under the mandates of Lockett. . ..\" \"Decisions of the lower federal courts interpreting federal law, although persuasive, are not binding on state courts. [Citation.]\" (Raven v. Deukmejian (1990) 52 Cal. 3d 336, 352 [276 Cal. Rptr. 326, 801 P.2d 1077].) As explained above, we disagree with the federal district court's interpretation of the decision in Lockett v. Ohio, supra, 438 U.S. 586. (People v. Fauber, supra, 2 Cal. 4th 792, 857.) Accordingly, we decline to adopt the holding in Jeffers v. Ricketts, supra.\n\n11. CONSTITUTIONALITY OF SECTION 190.3\n\nIn a letter submitted to this court shortly before oral argument, defendant cites the recent decision in Stringer v. Black (1992) 503 U.S. [117 L.Ed.2d 367, 112 S.Ct. 1130] and contends that section 190.3 violates the Eighth Amendment to the United States Constitution because it fails to designate which factors are aggravating and which are mitigating, thereby allowing the jury to exercise unbridled discretion.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e We have held, however, that the factors listed in section 190.3 \"properly require the jury to concentrate upon the circumstances surrounding both the offense and the offender, rather than upon extraneous factors having no rational bearing on the appropriateness of the penalty. We believe that the aggravating or mitigating nature of these various factors should be self-evident to any reasonable person within the context of each particular case.\" (People v. Jackson (1980) 28 Cal. 3d 264, 316 [168 Cal. Rptr. 603, 618 P.2d 149]; see also People v. Raley (1992) 2 Cal. 4th 870, 919 [8 Cal. Rptr. 2d 678, 830 P.2d 712].) Furthermore, \"the constitutional prohibition on arbitrary and capricious capital sentencing determinations is not violated by a capital sentencing 'scheme that permits the jury to exercise unbridled discretion in determining whether the death penalty should be imposed after it has found that the defendant is a member of the class made eligible for that penalty by statute.' [Citation.]\" (California v. Ramos (1983) 463 U.S. 992, 1009, fn. 22 [77 L.Ed.2d 1171, 1185-1186, 103 S.Ct. 3446]; People v. Rodriguez (1986) 42 Cal. 3d 730, 778 [230 Cal. Rptr. 667, 726 P.2d 113].) Nothing in the decision in Stringer v. Black, supra, 503 U.S. [117 L.Ed.2d 367] or Godfrey v. Georgia (1980) 446 U.S. 420 [46 L.Ed.2d 398, 100 S.Ct. 1759], also cited by defendant, supports a contrary Conclusion.\n\n12. ADMISSION OF FRANK MEDINA'S TESTIMONY\n\nDefendant introduced evidence that, at the time of the charged offenses, he had conquered his addiction to drugs and had converted to Christianity. In rebuttal, the People called as a witness Frank Medina, who testified that, subsequent to the commission of the murder, when defendant was in Arizona, defendant was using heroin and asked Medina where defendant could shoplift clothing. Defendant later was in possession of some new clothing, which he attempted to sell to Medina and others in order to obtain money to purchase drugs. Defendant contends Medina's testimony was inadmissible.\n\nAs we held in People v. Boyd (1985) 38 Cal. 3d 762, 776 [215 Cal. Rptr. 1, 700 P.2d 782], and People v. Rodriguez, supra, 42 Cal. 3d 730, 791, evidence which would be inadmissible at the penalty phase under section 190.3, as part of the prosecution's case-in-chief, may be admissible on rebuttal to counter evidence of good character introduced by the defendant. \" 'The theory for permitting such rebuttal evidence and argument is not that it proves a statutory aggravating factor, but that it undermines defendant's claim that his good character weighs in favor of mercy.' \" (People v. Fierro, supra, 1 Cal. 4th 173, 237, italics in original.] \" '[T]he scope of rebuttal must be specific, and evidence presented or argued as rebuttal must relate directly to a particular incident or character trait defendant offers in his own behalf.' [Citation.]\" ( at pp. 237-238.)\n\nMedina's testimony satisfied those requirements. Defendant had introduced evidence that, prior to the crimes, he had overcome his heroin addiction and had converted to Christianity Medina's testimony tended to cast doubt upon defendant's evidence of his good character by establishing that defendant had used drugs and had stolen to support his drug habit while in Arizona. This was proper rebuttal.\n\n13. THE PROSECUTOR'S ARGUMENT\n\nA. VICTIM-IMPACT ARGUMENT\n\nIn his opening and reply briefs, defendant contends portions of the prosecutor's argument were improper under the decision in Booth v. Maryland (1987) 482 U.S. 496 [96 L.Ed.2d 440, 107 S.Ct. 2529] and violated the Eighth Amendment to the United States Constitution, because the prosecutor focused on the effect of the murder on the victim's children. (See also South Carolina v. Gathers (1989) 490 U.S. 805 [104 L.Ed.2d 876, 109 S.Ct. 2207].) In his supplemental brief, defendant acknowledges that the decision\n\nin Booth was largely overruled (as was the decision in Gathers) in Payne v. Tennessee (1991) 501 U.S. [115 L.Ed.2d 720, 111 S.Ct. 2597]. (People v. Thomas (1992) 2 Cal. 4th 489, 535 [7 Cal. Rptr. 2d 199, 828 P.2d 101].)\n\nDefendant, however, relies upon a Concurring opinion in Payne for the proposition that a prosecutor's reference to the impact of the crime upon the victim may, in a particular case, violate the due process clause of the Fourteenth Amendment to the United States Constitution if it \"so infects the sentencing proceeding so as to render it fundamentally unfair . . ..\" (Payne v. Tennessee (1991) 501 U.S. , [115 L.Ed.2d 720, 740, 111 S.Ct. 2597] (conc. opn. of O'Connor, J.).) Defendant did not object at trial to this portion of the prosecutor's argument and, therefore, is precluded from raising this issue on appeal. (People v. Duncan (1991) 53 Cal. 3d 955, 976 [281 Cal. Rptr. 273, 810 P.2d 131].) Nothing in our decisions in People v. Miranda, supra, 44 Cal. 3d 57, 112-113, or People v. Ghent (1987) 43 Cal. 3d 739, 771-772 [239 Cal. Rptr. 82, 739 P.2d 1250], cited by defendant, suggests a contrary rule.\n\nDefendant's contention also fails on the merits. The prosecutor's remarks were not \"so inflammatory as to divert the jury's attention from its proper role or invite an irrational response. [Citation.]\" (People v. Fierro, supra, 1 Cal. 4th 173, 235.)\n\nDefendant further urges us to reconsider our recent holding, in People v. Edwards (1991) 54 Cal. 3d 787 [1 Cal. Rptr. 2d 696, 819 P.2d 436], that evidence of the harm caused by the defendant's actions is admissible at the penalty phase under section 190.3, factor (a), as one of the \"circumstances of the crime.\" The arguments raised by defendant were considered and rejected in Edwards (see also People v. Fierro, supra, 1 Cal. 4th 173, 235), and we have not been presented with any argument that would justify a reexamination of this ruling.\n\nB. REFERENCE TO A CARTOON\n\nThe prosecutor concluded his opening argument with the following description of a cartoon he had seen in the editorial section of a newspaper: \"[T]here's a picture of a hand and a gun, and smoke coming out of the barrel of the gun. And it simply says underneath it, 'the murderer did not hesitate to give the death penalty to the victims. Why should you?' \"\n\nDefendant contends this reference was improper \"because it eliminates any individualized consideration for the particular defendant on trial.\" Defendant has waived this contention too, by not objecting at trial to this\n\nportion of the prosecutor's argument. (People v. Green, supra, 27 Cal. 3d 1, 27.)\n\nWe also reject the claim on the merits. Urging the jurors not to hesitate to impose the death penalty is not the equivalent of urging them to ignore their responsibility to follow the court's instructions in making their decision. In any event, this isolated remark, even if it had been erroneous, could not have been prejudicial to the defense.\n\n14. FAILURE TO INSTRUCT THE JURY REGARDING EVIDENCE OF PRIOR UNADJUDICATED CRIMES ADMITTED AT THE GUILT PHASE\n\nDuring the guilt phase of the trial, evidence was admitted establishing that, while in Arizona, defendant stated to a friend that \"he had shot someone\" during a robbery and also had shot an accomplice who \"chickened out on him\" during an attempted robbery. Defendant told another friend that he had shot two persons and, during a separate incident, had committed a robbery.\n\nDefendant contends the trial court erred at the penalty phase in failing to instruct the jury, sua sponte, \"that evidence introduced at the guilt phase tending to show [defendant] may have committed other crimes was, as a matter of law, insufficient to prove he committed such crimes and it must not be considered in determining penalty.\n\n\"[I]n the absence of a request, the trial court is under no duty to give such an instruction at the penalty phase in regard to evidence received at the guilt phase.\" (People v. Lang (1989) 49 Cal. 3d 991, 1039 [264 Cal. Rptr. 386, 782 P.2d 627].) We therefore reject defendants claim of instructional error.\n\n15. REFUSAL TO EXCUSE JUROR SCHWARK\n\nOn the fourth day of jury deliberations at the penalty phase of the trial, Juror David Schwark, outside the presence of the other jurors, informed the court that the previous night he inadvertently had overheard a television news report announcing that defendant had made \"threats against the guards . . . if he were given the death penalty.\" The court informed the juror that evidence of such a threat \"never came before you because it amounted to something probably no more than just a rumor\" and asked him whether he could base his verdict solely upon the evidence. Schwark answered in the affirmative and confirmed, in response to an additional inquiry, that he still could be fair and impartial.\n\nDefendant asked that Schwark be excused and the trial court ruled: \"I saw an honest man who said he could be honest with Mr. Zapien, and I have to\n\nbelieve him. He is going to stay on the jury.\" The trial court subsequently polled the other jurors, determined they had no knowledge of the news report, and denied defendant's motion for mistrial.\n\nDefendant correctly observes that, although the juror did nothing improper, his inadvertent receipt of information outside the court proceedings is considered \"misconduct\" and creates a presumption of prejudice which, if not rebutted, requires a new trial. (People v. Holloway (1990) 50 Cal. 3d 1098, 1108 [269 Cal. Rptr. 530, 790 P.2d 1327].) \" '[W]hether a defendant has been injured by jury misconduct in receiving evidence outside of court necessarily depends upon whether the jury's impartiality has been adversely affected, whether the prosecutor's burden of proof has been lightened and whether any asserted defense has been contradicted. If the answer to any of these questions is in the affirmative, the defendant has been prejudiced and the conviction must be reversed. On the other hand, since jury misconduct is not per se reversible, if a review of the entire record demonstrates that the appellant has suffered no prejudice from the misconduct a reversal is not compelled.' [Citation.]\" (People v. Williams (1988) 44 Cal. 3d 1127, 1156 [245 Cal. Rptr. 635, 75 P.2d 901].)\n\nIn People v. Mincey (1992) 2 Cal. 4th 408 [6 Cal. Rptr. 2d 822, 827 P.2d 388], a juror brought a Bible into the jury room during penalty phase deliberations and read verses with other jurors. The trial court learned of this misconduct at the end of the court day and, the following day, questioned the jurors individually, admonishing them to decide the case solely on the basis of the evidence received in court and the court's instructions on the law, and not to take any written materials into the jury room. On appeal, we ruled that the presumption of prejudice had been rebutted because \"there was no substantial likelihood that the incident prejudiced defendant. [Citation.]\" ( at p. 467.)\n\nThe same is true in the present case Juror Schwark informed the trial court at the earliest opportunity that he inadvertently had received information concerning the case. The trial court held a hearing, outside the presence of the other jurors, at which Schwark pledged he would not divulge this information to his fellow jurors and would disregard it in performing his duties as a juror. In his opinion, he still could be fair and impartial. The trial court, which had the benefit of observing Schwark's demeanor, stated it believed him. According proper deference to this finding, we uphold the ruling of the trial court, concluding that the record rebuts the presumption of prejudice and that there is no substantial likelihood the incident prejudiced defendant.\n\nDefendant argues that the juror's answers to questions posed by defense counsel revealed that receipt of the information necessarily affected the role\n\nhe played in deliberations. Defendant misconstrues the juror's responses, which we set forth in full:\n\n\"[Defense Counsel]: . . .. Do you feel that you would be able to entirely put that out of your mind as if you had never heard it?\n\n\"[Juror]: Yes.\n\n\"Q: Okay. Why do you think you could do that? That's a little bit of an unfair question, but--\n\n\"A: Obviously, it bothers my conscience, and that's why I'm here. I want you to know it. I want everybody to know it. I recognize it may not be fair to the defendant that I know that. All I can tell you is that any decision that I would make would be based upon whatever was presented in court, and that's all I can say.\n\n\"Q: Okay. The next level, of course, past your personal feelings, is, of course, that that can't be communicated to anybody else.\n\n\"A: I understand that, and I would pledge that I would not do that.\n\n\"Q: Okay. Now, there may be people talking about things that would directly contradict what was said on--what you heard the news people talk about. How does that affect your ability to deliberate?\n\n\"A: Obviously, if I am not going to disclose that I have that information, I can't refute if someone were to make that charge. I would not be able to stand up and strongly refute it and say, 'I have some other information.' So I would simply have to play a passive role if something like that ever came up. That's all I can tell you.\n\n\"Q: Okay. And--\n\n\"A: And that has concerned me, is that, what part in the deliberation could I play? I mean, that is a concern. I have to be careful about that.\"\n\nDefendant focuses on the juror's statement that he would have to play \"a passive role\" if the subject of defendant's future dangerousness was raised during deliberations. Read in context, however, the juror's remarks indicated only that he would be careful not to reveal to the other jurors the information he received outside the court proceedings. Taken as a whole, the juror's responses support the trial court's finding that no prejudice resulted.\n\nDefendant also stresses the following remark by the court regarding Juror Schwark: \"I say an honest man who said he could be honest with Mr.\n\nZapien, and I have to believe him.\" Defendant contends this demonstrates the court erroneously believed it was compelled to accept the juror's testimony, regardless of its credibility. Defendant interprets this statement too literally. It is clear from the context of the court's comment that it did not consider itself bound to accept Schwark's testimony as true, but that it merely did, in fact, believe the juror was telling the truth. At the Conclusion of Schwark's testimony, the court observed: \"I look at the man, he seems to me to be eminently honorable.\"\n\nDefendant relies upon our decision in People v. Holloway, supra, 50 Cal. 3d 1098, which reversed a judgment of death because a juror had read a newspaper article stating that the defendant was on parole from prison after having served time for assaulting a woman with a deadly weapon. After the guilt phase verdicts had been signed, the juror disclosed that he had read this article to a fellow juror. That juror, in turn, had informed the court. The court questioned the juror who had read the article, as well as two other jurors, and ruled that no prejudice had resulted. This court reversed the judgment, noting: \" ' \"A juryman may testify to any facts bearing upon the question of the existence of the disturbing influence, but he cannot be permitted to testify how far that influence operated upon his mind.\" ' [Citation.]\" ( at p. 1109.)\n\nThis statement in Holloway, supra, 50 Cal. 3d 1098, is based upon the proscription in Evidence Code section 1150 against admission of evidence of a juror's mental processes in reaching a verdict.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e It does not preclude a court, upon learning of misconduct prior to rendition of a verdict, from questioning the jurors concerning the misconduct and admonishing them to disregard such improper influences. (People v. Cooper, supra, 53 Cal. 3d 771, 838.) To the contrary, this court has held that \"[t]he presumption of prejudice may be dispelled by an admonition to disregard the improper information. [Citations.]\" (People v. Pinholster (1992) 1 Cal. 4th 865, 925 [4 Cal. Rptr. 2d 765, 824 P.2d 571].) \"We generally presume that jurors observe such instructions.\" (Ibid.)\n\nThe trial court in the present case questioned Juror Schwark concerning his improper, but inadvertent, receipt of information concerning the case. The effect of this questioning was to admonish the juror to\n\ndisregard the information, which Schwark pledged he would do. Unlike the juror in Holloway, supra, 50 Cal. 3d 1098, who until after the guilt phase verdicts had been signed) hid the fact he had read the newspaper article, Juror Schwark disclosed his inadvertent exposure to the television news report the morning after it occurred and promised to disregard it. (See People v. Cooper, supra, 53 Cal. 3d 771, 838.) Under these circumstances, the trial court was not required to excuse Schwark and replace him with an alternate juror. \"A trial court's decision whether good cause exists to excuse a juror or to discharge a jury is within its discretion. The court's decision will be upheld on appeal if there is any substantial evidence to support it. [Citations.]\" (People v. Mincey, supra, 2 Cal. 4th 408, 467.) We reject defendant's claim of prejudicial error.\n\n16. THE TRIAL COURT'S ALLEGED CONSIDERATION OF IMPROPER MATTER IN DENYING THE AUTOMATIC MOTION FOR MODIFICATION OF THE PENALTY VERDICT\n\nDuring argument regarding the automatic application for modification of the penalty verdict pursuant to section 190.4 subdivision (e), the prosecutor referred to a number of citizen petitions (attached to the probation report) urging imposition of the death penalty. Defendant objected, and the court stated: \"I'm not going to rule on public outcry I know that they're there, but I haven't read the names. I just know there's a lot of names there, but I can't sentence Mr. Zapien on public outcry.\" After further Discussion, the following colloquy occurred.\n\n\"The Court: I've made my position clear.\n\n\"[The Prosecutor]: You're not going to refer to it?\n\n\"The Court: I don't think the court can do that. I think unless they were here in court and heard all the evidence. I don't know what they're relying upon. I know what I'm relying upon, that's the law and that's what I have to do.\n\n\"[The Prosecutor]: All right. If you're going to ignore it, that's fine.\n\n\"The Court: I didn't say ignore it, I said I know there were a lot of people who signed the petitions. That's all I know.\n\n\"[The Prosecutor]: I'm not trying to put word in the court's mouth. If you don't want me to address it, I won't, I'll move on . . ..\"\n\nThe court subsequently denied the motion for modification of sentence, making no reference to the citizen petitions.\n\nDefendant contends the court erroneously considered these petitions in ruling on the motion for modification of the penalty verdict, because the court stated it would not \"ignore\" the petitions. The record does not support defendant's argument. A reading of the court's entire Discussion concerning the citizen petitions reveals that, although the court objected to the prosecutor's use of the word \"ignore\" in describing the court's actions, it properly refused to consider the petitions in denying the motion for modification.\n\nRelying upon the decision in Booth v. Maryland, supra, 482 U.S. 496, defendant also contends the trial court erred in considering the impact of the murder on the victim's children. (See also South Carolina v. Gathers, supra, 490 U.S. 805.) We have held that \"the broad holding of Booth and Gathers does not extend to proceedings relating to the application for modification of a verdict of death under section 190.4(e). [Citation.]\" (People v. Benson (1990) 52 Cal. 3d 754, 812 [276 Cal. Rptr. 827, 802 P.2d 330].) Moreover, as noted above, \"[d]uring the pendency of this appeal both Booth and Gathers were largely overruled. (Payne v. Tennessee (1991) 501 U.S. [115 L.Ed.2d 720, 111 S.Ct. 2597].) We have since held that the injury inflicted by the defendant--including the impact of the crime on the family of the victim--is one of the circumstances of the crime, evidence of which is admissible under section 190.3, factor (a). [Citations.]\" (People v. Thomas, supra, 2 Cal. 4th 489, 535.) We therefore reject defendant's claim that the trial court committed error in ruling upon the automatic motion for modification of the penalty verdict.\n\nConclusion\n\nThe judgment is affirmed.\n\nLucas, C. J., Panelli, J., Arabian, J., and Baxter, J., concurred.\n\nDisposition\n\nThe judgment is affirmed.\n\nI Dissent.\n\nAs I shall explain, the trial court committed reversible error when it denied a motion defendant made to dismiss the information on the grounds of gross misconduct by the prosecution.\n\nAt a hearing concerning the prosecutorial misconduct in question, most of the basic facts pertinent here were established beyond dispute.\n\nOn October 4, 1986, Gary A. Van Camp, a deputy district attorney serving under Santa Barbara County District Attorney Thomas W. Sneddon, Jr., and Harry Heidt, a detective sergeant in the Lompoc Police Department, had use of an automobile from the country's vehicle pool. Van Camp was the trial\n\nprosecutor assigned to this matter. Heidt was the chief investigating officer for the Lompoc Police Department. Kenneth R. Ast was his counterpart in the district attorney's office. Van Camp chose Ast as his main investigator over Heidt. Van Camp was actively directing the investigation of the crimes and was personally preparing the case for trial. Jury selection was in progress.\n\nOn the date in question, Deputy District Attorney Van Camp happened to find a legal-size envelope under a seat in the county automobile. The envelope was sealed; it bore the name \"Bill Davis\"--Assistant Public Defender William A. Davis, who was defendant's counsel--and the return address of the Santa Barbara County Public Defender's Office; and it appeared to contain an audiotape cassette in a cassette box. Davis had inadvertently left the envelope in the vehicle some days before; he had already had the contents of the tape transcribed. On finding the envelope, Van Camp's \"eyes kind of light[ed] up,\" since he knew that Davis was defendant's attorney. He handed the envelope to Sergeant Heidt, and told him to listen to the tape and report back what he had heard.\n\nAs to its contents, the strategy tape \"was not evidence.\" That is, it did not constitute information admissible at trial relevant to defendant's guilt or innocence. Rather, it \"was something else, something more sensitive. . . .\" It comprised Davis's detailed, personally dictated concerns about defense strategy at trial, prepared for Discussion with certain senior colleagues, reflecting his confidential communications with defendant and also his impressions, Conclusions, opinions, research, and theories concerning both the favorable and unfavorable aspects of the case. It bore heavily on the credibility of a number of crucial witnesses named therein. From early in the life of the action, it was apparent that the outcome would turn more on testimony than physical evidence. In transcribed form, the contents filled more than six pages of single-spaced type.\n\nOn October 6, Deputy District Attorney Van Camp and Sergeant Heidt spoke about the strategy tape. Heidt told Van Camp that he had thrown away the tape and accompanying materials, and that \"as far as [he] was concerned, the tape was never found.\" Neither Van Camp nor Heidt had any intention of disclosing to anyone what they had done.\n\nDuring the weeks that followed, Deputy District Attorney Van Camp continued, on a daily basis, to actively direct the investigation of the crimes and to personally prepare the case for trial. His efforts extended into areas covered by the strategy tape, including the credibility of the crucial witnesses named therein.\n\nOn October 24, R. O. Hebert, chief of the Lompoc Police Department, summoned Sergeant Heidt to his office to inquire into reports of an \"argumentative\" telephone conversation between a member of the department and one of District Attorney Sneddon's staff. He suspected that Sergeant Heidt and Deputy District Attorney Van Camp were involved. Earlier that month, there had been some discord: Van Camp wanted Heidt to remain available throughout trial, apparently to serve as \"something of a go-fer\" for Ast, his main investigator; Heidt wished to absent himself for a period to attend a police training program in the investigation of homicides--a program he had had to miss once before when he was called away to investigate an actual homicide. In the meeting with Hebert, Heidt disclaimed knowledge of the \"argumentative\" telephone conversation. Toward the end, he disclosed the strategy tape incident. At the hearing, he stated that the incident had been \"bothering\" him since its occurrence. But he also admitted that he \"didn't go\" into Hebert's office \"with the intention of divulging that [he] had destroyed\" the items in question.\n\nOn October 27, the very eve of opening statements, Chief Hebert informed Assistant District Attorney Steven B. Plumer of what he had been told by Sergeant Heidt about the strategy tape incident, and Plumer transmitted the information to Assistant Public Defender Davis.\n\nOn October 28, the trial court opened the hearing concerning prosecutorial misconduct.\n\nOn October 30, it appears, defendant moved to dismiss the information on the grounds of gross misconduct by the prosecution.\n\nOn October 31, Assistant District Attorney Plumer advised the trial court and defense counsel that District Attorney Sneddon had made an \"administrative decision,\" effective immediately to remove Deputy District Attorney Van Camp from the case and to substitute himself. Later, Sneddon suspended and demoted Van Camp for his part in the strategy tape incident.\n\nThe hearing extended from the end of October through the beginning of December. Many witnesses were called much testimony was given.\n\nOn December 3, the trial court brought the hearing to a close. It then proceeded to deny defendant's motion to dismiss.\n\nOn December 8, District Attorney Sneddon and Assistant Public Defender Davis made their opening statements and the presentation of evidence commenced.\n\nThe foregoing facts establish gross prosecutorial misconduct beyond any doubt. Deputy District Attorney Van Camp and Sergeant Heidt intentionally invaded the defense camp. Although not premeditated, the violation was indeed deliberate. They then intentionally covered up the invasion. This violation was premeditated as well as deliberate. In the invasion and cover-up, they committed divers offenses. For example, at the very beginning of the episode, they appropriated the strategy tape and accompanying materials--property they knew belonged to Assistant Public Defender Davis. (Pen. Code, § 485.) Sometime later, they maliciously destroyed the items. (Id., § 594, subd. (a).) By the end, they had entered into an at least implied agreement to obstruct Justice and had acted in furtherance thereof. (Id., § 182, subd. (a)(5).) Indeed, Van Camp persisted in his efforts in this regard throughout the hearing. He denied, under oath, that he told Heidt to listen to the strategy tape. The trial court impliedly found that he testified falsely. (Id., § 118, subd. (a).)\n\nObviously, the gross prosecutorial misconduct established by these facts infringed protections afforded defendant by the attorney-client privilege (Evid. Code, § 950 et seq.) and the work product doctrine (Code Civ. Proc., § 2018; id., former § 2016, subd. (h), Stats. 1984, ch. 1127, § 1, p. 3805). It also implicated his rights under the United States and California Constitutions, including the guaranties relating to unreasonable searches and seizures (U.S. Const., Amend IV; Cal. Const., art. I, § 13), the assistance of counsel (U.S. Const., Amend VI; Cal. Const., art. I, § 15), and due process of law (U.S. Const., Amend XIV; Cal. Const., art. I, § 15).\n\nAlthough most of the basic facts pertinent here were established beyond dispute, one was not. Did the prosecution's unlawful invasion of the defense camp extend to the contents of the strategy tape? The trial court answered the question in the negative. Crucially, it made a finding of fact that Sergeant Heidt had not listened to the tape. It erred.\n\nTo begin with, the trial court's finding does not appear to be supported, as it must be (e.g., People v. Louis (1986) 42 Cal. 3d 969, 984-985 [232 Cal. Rptr. 110, 728 P.2d 180]), by substantial evidence. The court relied in part on Sergeant Heidt's testimony at the hearing, and in part on its personal knowledge of him over the years. The former was evidence, albeit of dubious weight. The latter, of course, was not. The majority refuse to hear any complaint from defendant about the court's testimony\" as an \"unsworn witness.\" Their refusal, however, cannot transform nonevidence into evidence.\n\nIn any event, the trial court's finding is unsupported as a matter of law. Defendant requested the court to find adversely to the prosecution on the\n\nissue whether Sergeant Heidt had listened to the strategy tape. He argued that Heidt had destroyed the only evidence that could have contradicted his testimony. The condition of the envelope, cassette box, cassette, and tape would have suggested, and perhaps established, the extent of the prosecution's unlawful invasion of the defense camp. For example, one could have determined whether the envelope had been unsealed, whether the cassette box had been handled, whether the cassette had been removed, and whether the tape had been played. The court refused to make the requested finding. It was in error.\n\nFor purely practical reasons, the trial court should have found that Sergeant Heidt had listened to the strategy tape. Had it done so, it would have declared in most effective terms that the prosecution cannot engage in such gross misconduct with impunity. Regrettably, the majority's Discussion upholding the court's refusal of an adverse finding may be read to deliver an altogether different message; do the deed and then destroy the evidence.\n\nPractical reasons aside, the trial court was required by California law to find that Sergeant Heidt had listened to the strategy tape. Evidence Code section 413 provides: \"In determining what inferences to draw from the evidence or facts in the case against a party, the trier of fact may consider, among other things, the party's failure to explain or deny by his testimony such evidence or facts in the case against him, or his willful suppression of evidence relating thereto, if such be the case.\" In People v. Zamora (1980) 28 Cal. 3d 88 [167 Cal. Rptr. 573, 615 P.2d 1361], we concluded that an adverse finding was required under the circumstances there disclosed: the state had destroyed evidence of official wrongdoing, although not in bad faith. ( at pp. 93-94, 99-103 (plur. opn. by Tobriner, J.); at p. 106 (conc. \u0026 dis. opn. of Bird, C. J.).) A fortiori, an adverse finding was required under the circumstances here: the state had destroyed evidence of official wrongdoing, and had done so in bad faith. Contrary to the majority's suggestion, Zamora remains good law on this point after California v. Trombetta (1984) 467 U.S. 479 [81 L.Ed.2d 413, 104 S.Ct. 2528], and Arizona v. Youngblood (1988) 488 U.S. 51 [102 L.Ed.2d 281, 109 S.Ct. 333]. (See People v. Cooper (1991) 53 Cal. 3d 771, 811 [281 Cal. Rptr. 90, 809 P.2d 865]; People v. Medina (1990) 51 Cal. 3d 870, 894 [274 Cal. Rptr. 849, 799 P.2d 1282].)\n\nMoreover, the trial court was required by the United States Constitution to find that Sergeant Heidt had listened to the strategy tape. As will appear, an adverse finding was required to remedy the denial of defendant's right to due process of law under the Fourteenth Amendment.\n\nIn California v. Trombetta, supra, 467 U.S. 479, the United States Supreme Court stated: \"Under the Due Process Clause of the Fourteenth\n\nAmendment, criminal prosecutions must comport with prevailing notions of fundamental fairness. We have long interpreted this standard of fairness to require that criminal defendants be afforded a meaningful opportunity to present a complete defense. To safeguard that right, the Court has developed 'what might loosely be called the area of constitutionally guaranteed access to evidence.' Taken together, this group of constitutional privileges delivers exculpatory evidence into the hands of the accused, thereby protecting the innocent from erroneous conviction and ensuring the integrity of our criminal Justice system.\" ( at p. 485 [81 L.Ed.2d at p. 420], citation omitted.)\n\nThe Trombetta court went on to declare all but expressly that the Fourteenth Amendment's due process clause imposes on the states a duty to preserve evidence on behalf of criminal defendants. The obligation, however, is not absolute and unqualified. It is \"limited to evidence that might be expected to play a significant role in the suspect's defense.\" (California v. Trombetta, supra 467 U.S. at p. 488 [81 L.Ed.2d at p. 422].) Such evidence \"must both possess an exculpatory value that was apparent before the evidence was destroyed, and be of such a nature that the defendant would be unable to obtain comparable evidence by other reasonably available means.\" ( at p. 489 [81 L.Ed.2d at p. 423].)\n\nIn Arizona v. Youngblood, supra, 488 U.S. 5], the court \"again consider[ed] 'what might loosely be called the area of constitutionally guaranteed access to evidence.' \" ( at p. 55 [102 L.Ed.2d at p. 287].) It did not retreat from the core teaching of Trombetta. But it did hold that \"unless a criminal defendant can show bad faith on the part of the [state], failure to preserve potentially useful evidence does not constitute a denial of due process of law.\" ( at p. 58 [102 L.Ed.2d at p. 289.]\n\nOf course, Trombetta and Youngblood are not directly applicable to the case at bar. In both of those decisions, the evidence of which the court spoke comprised facts bearing on the criminal defendant's guilt or innocence--specifically, facts generally admissible at trial that might exculpate him of legal responsibility. In this matter, by contrast the \"evidence\" with which we are concerned consists of facts relating to the state's conduct of the criminal proceeding itself--specifically, facts generally inadmissible at trial that might inculpate the prosecution in undermining the system's integrity.\n\nAlthough not directly applicable, Trombetta and Youngblood govern by analogy.\n\nAs stated, the Fourteenth Amendment's due process clause imposes on the states a duty to preserve evidence on behalf of criminal defendants. Since the\n\nconstitutional guaranty of fundamental fairness seeks to ensure the integrity of the system, the \"evidence\" to be preserved must include facts inculpating the prosecution. This obligation, however, cannot be absolute and unqualified. It must be limited to \"evidence\" that might be expected to play a significant role in the proof of prosecutorial misconduct. Such \"evidence\" must both possess an inculpatory value that was apparent before its destruction, and be of such a nature that the defendant would be unable to obtain comparable material or information by other reasonably available means. If the prosecution acts in bad faith, its failure to preserve \"evidence\" of this sort constitutes a denial of the defendant's right to due process of law.\n\nWithout question, the \"evidence\" that the prosecution destroyed in this case--the envelope, cassette box, cassette, and strategy tape--might foreseeably have established misconduct on the part of the prosecution.\n\nTo begin with, the \"evidence\" possessed an inculpatory value that was apparent before its destruction. The majority disagree. But, as explained, the condition of the items in question would have suggested and perhaps established the extent of the prosecution's unlawful invasion of the defense camp. Indeed, Sergeant Heidt conceded as much at the hearing. The majority state that \"[i]t was reasonable for the trial court to conclude that Heidt had destroyed\" the items \"without being aware that they later would assume evidentiary significance on the issue whether Heidt had listened to the\" strategy tape. (Maj. opn., ante, at p. 965.) Quite the contrary. It was altogether un reasonable for the court to have come to any Conclusion other than that Heidt had destroyed the items in order to ensure that the issue would never arise in the first place.\n\nNext, the \"evidence\" was such that comparable material or information could not be obtained by defendant by other reasonably available means. The majority do not disagree. Nor could they. Sergeant Heidt himself admitted the fact.\n\nFurther, the \"evidence\" was destroyed by the prosecution in bad faith. Here, the majority do disagree. I am at a loss. They cannot seriously mean that Sergeant Heidt acted in good faith. They state that Heidt \"did not intend to deprive defendant of exculpatory evidence or to otherwise harm defendant.\" (Maj. opn., ante, at p. 966.) Heidt plainly intended to deprive defendant of evidence inculpating the prosecution and thereby to prevent him from uncovering its unlawful invasion of the defense camp. If, in fact, Heidt had not listened to the strategy tape, he would still be guilty of bad faith. In such a situation, he would have destroyed the items in question with reckless disregard of both their nature and their importance.\n\nFaced with the prosecution's gross misconduct, the trial court erred when it denied defendant's motion to dismiss.\n\nDismissal was required. It was an appropriate sanction and indeed the only appropriate sanction. The prosecution unlawfully invaded the defense camp and unlawfully covered up the invasion. Its object was the strategy tape. The taint introduced into the case must be deemed substantial. From early on, it was apparent that the outcome would largely turn on testimony. The tape bore heavily on the credibility of crucial witnesses. Deputy District Attorney Van Camp's efforts to investigate the crimes and prepare the case for trial extended into this area. Moreover, the taint would have been difficult to purge. It would have been hard to detect: it affected not the main lines of the case, but the interstices. If detected, it would have been hard to remove: it spread throughout the case. True, District Attorney Sneddon himself appears to have taken no part in the misconduct. But he was practically compelled by the shortness of time between hearing and trial to take Van Camp's investigation and preparation as he found them. Only by dismissal could the court have effectively prevented harm to defendant.\n\nOn this record, however, dismissal with prejudice was not required. District Attorney Sneddon should have been allowed to investigate the crimes and prepare the case anew. An absolute bar to further prosecution would have been uncalled for.\n\nRelying basically on United States v. Morrison (1981) 449 U.S. 361 [66 L.Ed.2d 564, 101 S.Ct. 665], the majority reject dismissal as a sanction. Morrison, however, is inapposite. It deals only with the appropriateness, under federal criminal procedure, of dismissal with prejudice. I agree that the prosecution should not have been put in a worse position than it would have occupied had it not engaged in misconduct. But it would simply not have been put in such a position by dismissal without prejudice.\n\nClearly, the trial court's erroneous denial of defendant's motion to dismiss requires reversal of the judgment. No other result is reasonable. Surely, harmless-error analysis is not available. Such analysis attempts to determine the outcome of the trial under review in the absence of the error complained of. But in the absence of the error committed by the court in this case, the trial that the record discloses would not have been held in the first place.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nFor the reasons stated above, I would reverse the judgment.\n\nDissenting.\n\nIn this death penalty case, shortly before trial was to begin, the prosecution gained access to a confidential tape recording that contained details of defense counsel's trial strategy and references to privileged communications between defendant and his attorney. A member of the prosecution team then unlawfully destroyed the tape recording. This act of destruction prevented the defense from showing by expert testimony that the prosecution had listened to the tape. The majority holds that this invasion of the defense camp required no sanction whatsoever, and affirms defendant's sentence of death.\n\nI disagree. As I shall discuss, the precedents of the United States Supreme Court and of this court, as well as basic concepts of fair play, require that the judgment of conviction and sentence of death be reversed, and that the case be remanded for a new trial free of the taint of prosecutorial illegality and unfair advantage.\n\nI\n\nDefendant's attorney, Assistant Public Defender Bill Davis, dictated a cassette tape recording in preparation for a strategy meeting with other attorneys in his office. The tape revealed his detailed perceptions of the strengths and weaknesses of the case as well as his complete trial strategy, and contained privileged information obtained from defendant. After the tape was transcribed, Davis inadvertently left it in a county car.\n\nAfter jury selection in this capital case had begun, the prosecutor in this case, Deputy District Attorney Gary Van Camp, and Sergeant Harry Heidt of the Lompoc Police Department found a sealed envelope in a county car. The envelope showed the name of Assistant Public Defender Davis and the address of the public defender's office. The envelope appeared to contain a cassette tape. According to Heidt, Van Camp expressed his belief that the\n\ntape might relate to this case, and told Heidt to listen to the tape and \"report\" to him what was on the tape. Heidt testified that he did not do so and that, instead of complying with procedures regarding found property, threw the sealed envelope into a trash dumpster 15 minutes later. The envelope and its contents were never recovered.\n\nThree weeks later, during which time the prosecution continued its investigation into this death penalty case, interviewing numerous witnesses and preparing its trial strategy, the chief of the Lompoc Police Department learned of Heidt's destruction of the defense tape. The police chief notified the district attorney's office, which in turn told defense counsel of the incident. District Attorney Thomas Sneddon then began an internal investigation of the misconduct. When the trial court ordered the prosecution to provide the defense complete discovery of information relating to the misconduct, District Attorney Sneddon immediately terminated his internal investigation of the deputy's misconduct. District Attorney Sneddon removed Van Camp from the case, demoted him, and prosecuted the case personally.\n\nDefendant moved for dismissal of the case, recusal of the county District Attorney's office, and a continuance to conduct further research and investigation. The trial court reviewed in chambers a transcript of the defense tape that had been prepared before the tape's destruction by the prosecution.\n\nAt the hearing on defendant's motions, defendant argued that Sergeant Heidt's destruction of the tape \"deprived the defense of the only physical evidence it could use to impeach Heidt and Van Camp regarding whether they unsealed the envelope and listened to the tape.\" Defendant presented the testimony of a forensic acoustics expert who stated he could, if he had the tape, determine whether it had been played. Moreover, according to another defense expert, if the tape had not been destroyed by Heidt, fingerprint evidence could determine whether Heidt or Van Camp had taken the tape from its sealed envelope and handled it.\n\nIn making his preliminary finding that Deputy District Attorney Van Camp and Sergeant Heidt had not listened to the tape, the trial Judge expressly stated that he relied in part on his personal knowledge and opinion of Heidt, with whom he had worked as a deputy public defender and deputy district attorney in the county.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003ea The trial court denied all relief requested by the defense, and the case proceeded to trial.\n\nII\n\nDefendant contends that because the prosecution's destruction of the tape made it impossible to determine whether the prosecution had played the tape, the trial court should, as a sanction, have deemed it established that the prosecution had done so. This argument has merit.\n\nThe majority analyzes this contention under California v. Trombetta (1984) 467 U.S. 479 [81 L.Ed.2d 413, 104 S.Ct. 2528] (Trombetta) and Arizona v. Youngblood (1988) 488 U.S. 51 [102 L.Ed.2d 281, 109 S.Ct. 333] (Youngblood). Both of these cases concern the destruction of potentially exculpatory evidence, and, accordingly, they establish a test for determining whether to impose sanctions based in part on the exculpatory value of the evidence destroyed.\n\nThis case, however, does not involve the destruction of exculpatory evidence. What was destroyed here was evidence of possible prosecutorial misconduct, which, if it occurred, violated the work-product privilege, the attorney-client privilege, and defendant's Sixth Amendment right to counsel. Although the destruction of such evidence is as much a violation of a defendant's right to due process as is the destruction of exculpatory evidence, the test for determining whether to impose sanctions here cannot turn on the exculpatory value of the evidence destroyed. Were it to do so, no sanctions for the destruction of evidence of prosecutorial misconduct could ever be imposed, because such evidence has no direct bearing on a criminal defendant's guilt or innocence, thus lacking any exculpatory value. The majority, by attempting to apply Trombetta and Youngblood to the facts of this case, tries to force a square peg into a round hole.\n\nBut even if one were to apply a test roughly analogous to that set forth in Trombetta and Youngblood to determine whether the trial court here should have imposed some sanction on the prosecution, application of such a test to the facts of this case compels the Conclusion that severe sanctions were called for and that the trial court's failure to impose sanctions requires reversal of the judgment against defendant.\n\nConsidered together, Trombetta and Youngblood establish three criteria that must be met to establish a violation of a defendant's right to due process of law when exculpatory evidence has been destroyed by the prosecution. First, the evidence destroyed must possess \"exculpatory value that was apparent before the evidence was destroyed.\" (Trombetta, supra, 467 U.S. at\n\np. 489 [81 L.Ed.2d at p. 823].) Second, the defendant must show bad faith on the part of the prosecution. (Youngblood, supra, 488 U.S. at p. 58 [102 L.Ed.2d at p. 289].) Third, the evidence must be \"of such a nature that the defendant would be unable to obtain comparable evidence by other reasonably available means.\" (Trombetta, supra, 467 U.S. at p. 489 [81 L.Ed.2d at p. 823].) To the extent these requirements are applicable here, they were, in my view, satisfied.\n\nWith respect to the first criterion of the Trombetta/Youngblood test, the majority concludes that the \"exculpatory value of the envelope and the cassette themselves was not apparent at the time Heidt threw them away.\" (Maj. opn., ante, at p. 965.) The majority's literal approach to this criterion fails to recognize that, as I noted earlier, the materials on the defense tape that was destroyed by the prosecution contained no evidence that might have exculpated defendant. Thus, it is meaningless to speak of \"exculpatory evidence\" in this case. In order to give this criterion significance in the context of this case, the concept of \"exculpatory value\" must be refocused and broadened. Rather than asking whether the \"evidence\" that was destroyed possessed \"exculpatory value that was apparent [to the prosecution] before [it] was destroyed,\" it is sensible to reframe the inquiry here in this way: Did the material that was destroyed possess importance to the case that was apparent to the prosecution before it was destroyed?\n\nThe importance of the defense tape that was destroyed by the prosecution cannot be disputed. Both Deputy District Attorney Van Camp and Sergeant Heidt had strong reason to suspect that the defense attorney's tape or its contents contained important information relating to the case. Indeed, that appears to have been the reason that prompted Van Camp to order Heidt to listen to the tape. On this record, the potential value of the tape was certainly apparent to Van Camp and Heidt before the latter's destruction of the tape.\n\nAs to the second criterion of the Trombetta/Youngblood test, here there is compelling evidence of bad faith by the prosecution. Instead of filling out a found-property report and returning the tape to defendant's counsel through the proper channels. Sergeant Heidt, knowing the tape was important, intentionally destroyed the tape by throwing it away. This action violated Penal Code section 594, it is a crime to maliciously destroy personal property of another). (See also Gov. Code, § 6200.)\n\nWith regard to the third and final requirement that the destruction of the material prejudiced the defendant, the majority denies that the prosecution's destruction of the defense attorney's tape prejudiced defendant. According to the majority, \"the destruction of the contents of the tape recording did not\n\nlessen defendant's ability to challenge Heidt's testimony that the prosecution did not listen to the tape.\" (Maj. opn., ante, at p. 965.) Although the destruction of the contents of the tape may not have prejudiced defendant, destruction of the tape itself did, as I shall explain.\n\nAt the hearing on defendant's motion for sanctions based on the destruction of the tape, the defense presented undisputed testimony that if the envelope containing the tape had been recovered, the defense could have produced evidence indicating that the tape had been listened to by the prosecution. Such evidence would include the condition of the originally sealed envelope; the presence of fingerprints on the tape or its container; the position of the tape (wound or unwound); and the presence of other evidence of handling, such as dirt, smudges, rips, breaks or cracks on the tape or its container. Moreover, the defense presented undisputed testimony of a tape-recording expert, Michael Hecker, who said that if the tape had been recovered, it could have been analyzed to determine if it had been played on a machine other than the one used by the defense team, by searching for distinctive mechanical or magnetic characteristics on the tape. Under these circumstances, I am of the view that the prosecution's destruction of the defense attorney's tape prejudiced the defense by depriving it of any opportunity to show that the prosecution had indeed listened to the tape.\n\nTherefore, to the extent the criteria set forth by the high court in Trombetta and Youngblood are applicable to this case, they require a finding that the prosecution's intentional destruction of the defense attorney's tape violated defendant's right to due process. When a court finds that the prosecution has violated a defendant's rights in this manner, \"the court must choose between barring further prosecution or suppressing . . . the State's most probative evidence.\" (Trombetta, supra, 467 U.S. at p. 487 [81 L.Ed.2d at p. 821].) Because the misconduct in this case did not concern evidence that might have been introduced at trial, there is no evidence to suppress. Thus, if Trombetta and Youngblood apply, the remedy is reversal of the judgment against defendant, with directions to the trial court to dismiss the case, and to bar further prosecution. Whether this is an appropriate remedy in this case is a question I shall explore below.\n\nIII\n\nThis case does not involve the suppression of exculpatory evidence because the defense tape that was destroyed by the prosecution was not itself, and did not contain, evidence of any sort that might have been introduced at defendant's trial, much less evidence that might have exculpated defendant.\n\nAs I noted earlier, the destroyed tape contained defense counsel's detailed trial strategy and his perceptions of the strengths and weaknesses of the case\n\nagainst defendant. Defendant argues that the appropriate sanction for the destruction of the tape, which prevented him from showing that the prosecution had listened to it, is to deem it established that the prosecution did listen to the tape.\n\nThere is no case on point. But this court's decision in People v. Zamora (1980) 28 Cal. 3d 88 [167 Cal. Rptr. 573, 615 P.2d 1361] (Zamora) may provide some guidance. There, the defendant was charged with resisting arrest and with battery on a police officer. He sought discovery of past records of unsustained complaints made by citizens alleging excessive use of force by the officers involved. Except for the names of the complainants, all those records had been destroyed about two weeks before the defendant's arrest, depriving him of the opportunity to locate witnesses who might testify about the officers' past use of excessive force.\n\nIn Zamora, the court determined that the trial court erred in not imposing any sanction for the destruction of the police records. We rejected the remedy of dismissal, and held that the proper sanction was a jury instruction that the officers 'used excessive or unnecessary force on each occasion when complaints were filed against [them], but that the complaint records later were destroyed.' (Zamora, supra, 28 Cal. 3d at pp. 102-103.) We said, \"We would thus tailor the sanction to compensate for the exact wrong done . . ..\" ( at p. 103.) Our approach to remedial sanctions in Zamora remains good law. (See People v. Cooper (1991) 53 Cal. 3d 771, 811 [281 Cal. Rptr. 90, 809 P.2d 865]; People v. Medina (1990) 51 Cal. 3d 870, 894 [274 Cal. Rptr. 849, 799 P.2d 1282].)\n\nIn determining the proper sanction in Zamora, this court looked to three factors. First, the Zamora court considered \"the particular circumstances attending [the] loss or destruction,\" noting that lawful and proper destruction warranted no sanction, but that illegal and malicious destruction could result in dismissal. (Zamora, supra, 28 Cal. 3d at p. 100.) Here, the prosecution's destruction of the confidential tape belonging to the defense attorney was both illegal and done in bad faith, as discussed previously.\n\nSecond, the Zamora court noted that \"the sanction depends on the materiality of the evidence suppressed.\" (Zamora, supra, 28 Cal. 3d at p. 100.) As I pointed out earlier, this case does not concern evidence that might have been introduced at trial; but taking \"materiality\" to be a synonym for importance, it cannot be denied that in the capital murder case the tape containing defense counsel's distillation of his trial strategy was of great importance to the case.\n\nThird, the court in Zamora stated that, in arriving at a proper sanction, \"the courts must consider the impact of the sanction upon future cases and\n\nfuture police conduct.\" (Zamora, supra, 28 Cal. 3d at p. 100.) Here, this factor weighs in favor of a substantial judicial sanction, to provide a disincentive to engage in similar misconduct in the future.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nIn Zamora, the defense was prevented from showing that the records would have led to favorable evidence by the fact of their destruction; this deprivation required a sanction adverse to the prosecution on the issue of excessive force. Here, the defense was prevented from showing that the prosecution had played the tape by the fact of the tape's destruction; this deprivation requires a finding adverse to the prosecution on the issue whether the prosecution had listened to the tape. As in Zamora, the sanction in this case should also be \"tailor[ed] . . . to compensate for the exact wrong done . . ..\" (Zamora, supra, 28 Cal. 3d at p. 103.) In light of the applicable case law, the appropriate judicial sanction for the willful destruction of the tape is to deem it established that the prosecution team did in fact listen to it. This sanction parallels that in Zamora.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nIV\n\nBased on my Conclusion that the trial court should have deemed it established that members of the prosecution team had listened to the defense strategy tape, I turn to the consequences of that Conclusion.\n\nA defendant's right to the assistance of counsel free from unreasonable government interference is protected by the Sixth Amendment. (See, e.g., Weatherford v. Bursey (1977) 429 U.S. 545, 558 [51 L.Ed.2d 30, 41-42, 97 S.Ct. 837].) When, as here, the prosecution has unlawfully gained access to confidential defense strategy materials, the prosecution has thereby unreasonably interfered with the defendant's right to the assistance of counsel. In\n\nUnited States v. Morrison (1981) 449 U.S. 361 [66 L.Ed.2d 564, 101 S.Ct. 665], which concerned government agents who met with a defendant without the knowledge or permission of her counsel, the court stated that cases \"involving Sixth Amendment deprivations are subject to the general rule that remedies should be tailored to the injury suffered from the constitutional violation and should not unnecessarily infringe on competing interests,\" ( at p. 364 [66 L.Ed.2d at p. 568]) and that \"absent demonstrable prejudice, or substantial threat thereof, dismissal of the indictment is plainly inappropriate, even though the violation may have been deliberate.\" ( at p. 365 [66 L.Ed.2d at p. 569].) It is apparent from an examination of Morrison that the high court was referring to a dismissal that would preclude retrial. ( at p. 365, fn. 2 [66 L.Ed.2d at p. 569]; see 2 LaFave \u0026 Israel, Criminal Procedure (1984) § 11.8, pp. 75-76.)\n\nIn this case, did the prosecution's intentional destruction of the defense tape result in prejudice \"or substantial threat thereof\"? (United States v. Morrison, supra, 449 U.S. at p. 365 [66 L.Ed.2d at p. 569].) This court's decision in Barber v. Municipal Court (1979) 24 Cal. 3d 742 [157 Cal. Rptr. 658, 598 P.2d 818] (Barber) is instructive. Although Barber was decided on state constitutional grounds, the facts are comparable to those in this case. In Barber, the defendants had participated in a sit-in at a nuclear power plant, and were charged with trespass. The defendants held meetings with their attorneys to plan trial strategy. Later they learned that a codefendant was an undercover police officer. Although there was no showing that the officer had passed information to the prosecution, this court held that, on the facts of that case, \"[t]he only effective remedy is the dismissal of the underlying charges.\" ( at p. 760.)\n\nIn Barber, we rejected the prosecution's argument that an exclusionary remedy would suffice. We noted that \"the enforcement of an exclusionary rule would involve exceedingly difficult problems of proof for the aggrieved client,\" and that in such circumstances \"[s]ubtle forms of prejudice are nearly impossible to isolate.\" (Barber, supra, 21 Cal. 3d at p. 757.)\n\nThe practical problems of showing actual prejudice when the prosecution has illegitimately invaded the defense camp and gained access to attorney-client privileged materials, as happened here, were explained in Briggs v. Goodwin (D.C. Cir. 1983) 698 F.2d 486, 494-495 [225 App.D.C. 3200]: \"It would be virtually impossible for an appellant or court to sort out how any particular piece of information in the possession of the prosecution was consciously or subconsciously factored into each of those [prosecutorial] decisions. Mere possession by the prosecution of otherwise confidential knowledge about the defense's strategy or position is sufficient in itself to\n\nestablish detriment to the criminal defendant. Such information is 'inherently detrimental, . . . unfairly advantage[s] the prosecution, and threaten[s] to subvert the adversary system of criminal Justice.' \" (See also United States v. Levy (3d Cir. 1978) 577 F.2d 200, 209 [\"We think that the inquiry into prejudice must stop at the point where attorney-client confidences are actually disclosed to the government enforcement agencies responsible for investigating and prosecuting the case.\"]; accord, United States v. Costanzo (3d Cir. 1984) 740 F.2d 251, 257.)\n\nI find additional guidance in the United States Supreme Court's decision in Arizona v. Fulminante (1991) 499 U.S. [113 L.Ed.2d 302, 111 S.Ct. 1246]. There, Chief Justice Rehnquist, speaking for a majority of the court, distinguished between \"trial error\" and \"structural error\" for the purpose of determining whether a federal constitutional violation could be analyzed under the \"harmless beyond a reasonable doubt\" test enunciated in Chapman v. California (1967) 386 U.S. 18 [17 L.Ed.2d 705, 87 S.Ct. 824, 24 A.L.R.3d 1065] to determine prejudice to the defendant, or whether such a violation instead required automatic reversal. \"Trial error,\" the high court explained, would be any constitutional error \"which occurred during the presentation of the case to the jury, and which may therefore be quantitatively assessed in the context of other evidence presented in order to determine whether its admission was harmless beyond a reasonable doubt.\" (499 U.S. at p. [113 L.Ed.2d at p. 330, 111 S.Ct. at p. 1264].)\n\nBy contrast, the high court said, other errors are \"structural defect[s] affecting the framework within which the trial proceeds, rather than simply an error in the trial process itself.\" (Arizona v. Fulminante, supra, 499 U.S. at p. [113 L.Ed.2d at p. 331, 111 S.Ct. p. 1265].) Such structural defects include denial of the right to public trial, and denial of the right to self-representation. (Ibid.)\n\nWhen the prosecution unlawfully gains access to defense trial strategy, that violation of the defendant's rights is not curable by an exclusionary remedy, because the harm of the violation is not that it produced evidence that was unlawfully obtained, and there is nothing to exclude. Nor is it susceptible to a harmless error analysis, because the constitutional violation did not occur \"during the presentation of the case to the jury,\" and therefore may not be \"quantitatively assessed in the context of other evidence presented in order to determine whether its admission was harmless beyond a reasonable doubt.\" (Arizona v. Fulminante, supra, 499 U.S. at p. [113 L.Ed.2d at p. 330, 111 S.Ct. at p. 1264].) In other words, such a violation of the attorney-client privilege and the Sixth Amendment right to counsel is more akin to a \"structural defect\" than to a \"trial error,\" to use the phraseology of the majority in Arizona v. Fulminante.\n\nWhen, as here, the prosecution has unlawfully invaded the defense camp and gained access to attorney-client privileged materials, there is a \"substantial threat of prejudice\" within the meaning of United States v. Morrison, supra, 449 U.S. at page 365 [66 L.Ed.2d at page 569], and a \"structural defect affecting the framework within which the trial proceeds\" within the meaning of Arizona v. Fulminante, supra, 499 U.S. at page [113 L.Ed.2d at page 331, 111 S.Ct. at page 1265]. In this circumstance, the only meaningful remedy at the trial court level is dismissal.\n\nV\n\nA prosecutor \"is the representative not of an ordinary party to a controversy, but of a sovereignty whose obligation to govern impartially is as compelling as its obligation to govern at all, and whose interest, therefore, in a criminal prosecution is not that it shall win a case, but that Justice shall be done.\" (Berger v. United States (1935) 295 U.S. 78, 88 [79 L.Ed. 1314, 1321, 55 S.Ct. 629]; accord, e.g., ABA Model Rules of Prof. Conduct, rule 3.8.) \"It is as much [a prosecutor's] duty to refrain from improper methods calculated to produce a wrongful conviction as it is to use every legitimate means to bring about a just one.\" (Berger v. United States, supra, at p. 88 [79 L.Ed.2d at p. 1321].) This court has emphasized that \"[i]t is essential that the public have absolute confidence in the integrity and impartiality of our system of criminal Justice.\" (People v. Rhodes (1974) 12 Cal. 3d 180, 185 [115 Cal. Rptr. 235, 524 P.2d 363].)\n\nThese considerations are always important, but they take on added importance when, as here, society's ultimate sanction of capital punishment is at issue. In a death penalty trial, it is essential that the public have a high degree of confidence that its representatives in court seek conviction and punishment without obtaining any unfair advantage over the defendant.\n\nThe prosecution's interference with defendant's right to counsel in this case does not mean that defendant can never receive a fair trial on these charges under any circumstances. At a retrial, both the prosecution and the defense will have the advantage of knowledge of their adversary's strategy, based on the record of the first trial. Thus, a retrial will occur on a \"level playing field.\" This will erase any appearance of impropriety and assure that no unfair advantage had been exploited.\n\nI would reverse the judgment with instructions to the trial court to dismiss the case and to permit refiling of the charges.\n\nAppellant's petition for a rehearing was denied April 29, 1993. Mosk, J., and Kennard, J., were of the opinion that the petition should be granted.\n\n\u003cspan class=\"fn\"\u003e1. All further statutory references are to the Penal Code unless otherwise indicated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The trial court found that this was a \"convenient loss of memory\" and could be deemed an implied denial of her prior statement. (People v. Green (1971) 3 Cal. 3d 981, 988-989 [92 Cal. Rptr. 494, 479 P.2d 998].) Defendant does not challenge this ruling and we do not find it erroneous.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. As noted above, the trial court deemed Perez's inability to recall certain statements to be an implied denial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Evidence Code section 352 provides, in pertinent part: \"The court in its discretion may exclude evidence if its probative value is substantially outweighed by the probability that its admission will . . . create substantial danger of undue prejudice . . ..\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The portion of the reporter's transcript cited by the parties reflects only that the court marked the transcript of Perez's testimony as an exhibit and ruled it was admissible. A declaration by the court clerk states that the transcript was received in evidence. Defendant states he does not know whether this exhibit was given to the jury, but asserts we should presume it was. The People concede the point, stating: \"For present purposes, counsel for respondent does not take issue with appellant's position that it should be assumed that the transcript in fact was the [ sic ] before the jury.\" We accept the People's concession and assume the transcript was admitted into evidence and submitted to the jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Defendant does not contest that Blanco's invocation of her privilege against self-incrimination rendered her unavailable as a witness. (Evid. Code, § 240; People v. Malone (1988) 47 Cal. 3d 1, 23 [252 Cal. Rptr. 525, 762 P.2d 1249].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. On June 5, 1990, section 190.41 was enacted by voter initiative (Prop. 115). It provides that \"the corpus delicti of a felony-based special circumstance enumerated in paragraph (17) of subdivision (a) of Section 190.2 need not be proved independently of a defendant's extrajudicial statement.\" We have held that section 190.41 applies only to crimes committed after its effective date (People v. Mickle (1991) 54 Cal. 3d 140, 179, fn. 22 [284 Cal. Rptr. 511, 814 P.2d 290]; Tapia v. Superior Court (1991) 53 Cal. 3d 282, 297-299 [279 Cal. Rptr. 592, 807 P.2d 434].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Defendant cites no authority in support of his contention that the trial court erred in denying his motion for mistrial. The admission of Dr. Levin's testimony, even if erroneous, would not have required the trial court to declare a mistrial of the penalty phase. (See Larios v. Superior Court (1979) 24 Cal. 3d 324, 330 [155 Cal. Rptr. 374, 594 P.2d 491]: \"[M]ere errors of law or procedure such as [an] . . . erroneous evidentiary ruling[],\" do not constitute legal necessity to declare a mistrial.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Section 190.3 provides, in pertinent part, that in determining whether a defendant convicted of murder in the first degree, with a finding of one or more special circumstances, shall be punished by death or by life in prison without the possibility of parole, \"the trier of fact shall take into account any of the following factors if relevant: [P] (a) The circumstances of the crime of which the defendant was convicted in the present proceeding and the existence of any special circumstances found to be true pursuant to Section 190.1. [P] (b) The presence or absence of criminal activity by the defendant which involved the use or attempted use of force or violence or the express or implied threat to use force or violence. [P] (c) The presence or absence of any prior felony conviction. [P] (d) Whether or not the offense was committed while the defendant was under the influence of extreme mental or emotional disturbance. [P] (e) Whether or not the victim was a participant in the defendant's homicidal conduct or consented to the homicidal conduct or consented to the homicidal act. [P] (f) Whether or not the offense was committed under circumstances which the defendant reasonably believed to be a moral justification or extenuation for his conduct. [P] (g) Whether or not defendant acted under extreme duress or under the substantial domination of another person. [P] (h) Whether or not at the time of the offense the capacity of the defendant to appreciate the criminality of his conduct or to conform his conduct to the requirements of law was impaired as a result of mental disease or defect, or the effects of intoxication. [P] (i) The age of the defendant at the time of the crime. [P] (j) Whether or not the defendant was an accomplice to the offense and his participation in the commission of the offense was relatively minor. [P] (k) Any other circumstance which extenuates the gravity of the crime even though it is not a legal excuse for the crime.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Evidence Code section 1150, subdivision (a), states: \"Upon an inquiry as to the validity of a verdict, any otherwise admissible evidence may be received as to statements made, or conduct, conditions, or events occurring, either within or without the jury room, of such a character as is likely to have influenced the verdict improperly. No evidence is admissible to show the effect of such statement, conduct, condition or event upon a juror either in influencing him to assent to or Dissent from the verdict or concerning the mental processes by which it was determined.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. In passing, I make the following observation. In my Concurring opinion in People v. Gallego (1990) 52 Cal. 3d 115 [276 Cal. Rptr. 679, 802 P.2d 169]. I stated that a \"jury should be able to identify the . . . circumstances\" specified in the standard penalty instructions \"as 'aggravating' or 'mitigating' by itself\" because \"their nature's self-evident.' \" ( at p. 208 (conc. opn. of Mosk, J.), italics added.) Whether any given jury is actually able to do so depends on the peculiar facts of the individual case. If it is not, it may be without the guidance demanded by the Eighth Amendment as construed in Stringer v. Black (1992) 503 U.S. [117 L.Ed.2d 367, 112 S.Ct. 1130]. It is true, as the majority state, that \"the constitutional prohibition on arbitrary and capricious capital sentencing determinations is not violated by a capital sentencing 'scheme that permits the jury to exercise unbridled discretion in determining whether the death penalty should be imposed after it has found that the defendant is a member of the class made eligible for that penalty by statute.' \" (California v. Ramos (1983) 463 U.S. 992, 1009, fn. 22 [77 L.Ed.2d 1171, 1185-1186, 103 S.Ct. 3446].) But it is not true, as the majority suggest, that the California \"scheme\" allows \"unbridled discretion.\" In Stringer, the United States Supreme Court held that \"if a State uses aggravating factors in deciding . . . who shall receive the death penalty\"--as does California (Pen. Code, § 190.3)--\"it cannot use factors which as a practical matter fail to guide the sentencer's discretion\" in contravention of the Eighth Amendment. (Stringer v. Black, supra, 503 U.S. at p. [117 L.Ed.2d at p. 381, 112 S.Ct. at p. 1139].) 1a In passing on the defense motions, it was improper for the trial Judge to rely upon his personal opinion of Sergeant Heidt's credibility based on facts not in the record. (See Guadalupe A. v. Superior Court (1991) 234 Cal. App. 3d 100, 108-109 [285 Cal. Rptr. 570].) I agree with the majority, however, that, by failing to object to the trial Judge's reliance on facts outside the record, the defense did not preserve the question for review. ( at p. 108.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. District Attorney Sneddon demoted Deputy District Attorney Van Camp from grade IV to grade I as a result of his actions in this case. This substantial sanction demonstrates a recognition by the district attorney of the seriousness of the issue, and a commendable willingness to address it within his office. The courts, however, have a broader responsibility to establish structural disincentives for egregious misconduct, and therefore this discretionary action by the district attorney, although warranted, cannot substitute for a judicial sanction that possesses general applicability to future cases and other prosecutorial agencies, and has the force of law as well.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. This sanction also parallels sanctions imposed in civil cases in comparable situations. Under Code of Civil Procedure section 2023, subdivision (b)(2), \"[t]he court may impose an issue sanction ordering that designated facts shall be taken as established in the action in accordance with the claim of the party adversely affected by the misuse of the discovery process.\" (See, e.g., Kuhns v. State of California (1992) 8 Cal. App. 4th 982, 987 [10 Cal. Rptr. 2d 773]; Caryl Richards, Inc. v. Superior Court (1961) 188 Cal. App. 2d 300, 302, 305 [10 Cal. Rptr. 577].) When the destruction of evidence or critical materials by an adverse party is at issue, a defendant on trial for his or her life, as is the case here, should be entitled to no less protection than a plaintiff or defendant in an ordinary civil case.\u003c/span\u003e\n\n",
    "body_length": 192458,
    "citedas": [
      "846 P.2d 704",
      "4 Cal. 4th 929",
      "17 Cal. Rptr. 2d 122"
    ],
    "attorneys": "Crosby, Heafey, Roach \u0026 May, Chris G. Gasparich, Miller, Starr \u0026 Regalia and Michael J. Hassen for Defendant and Appellant. John K. Van de Kamp and Daniel E. Lungren, Attorneys General, Steve White, Richard B. Iglehart and George Williamson, Chief Assistant Attorneys General, Edward T. Fogel, Jr., Assistant Attorney General, Carol Wendelin Pollack, Acting Assistant Attorney General, Donald E. de Nicola, Thomas L. Willhite, Jr., Susan Lee Frierson and Robert F. Katz, Deputy Attorneys General, for Plaintiff and Respondent.",
    "category": [
      "36",
      "78"
    ],
    "judges": "Opinion by George, J., with Lucas, C.J., Panelli, Arabian and Baxter, JJ., Concurring. Separate Dissenting opinions by Mosk and Kennard, JJ.",
    "citation_count": 17
  }
}
