{
  "id": "063gSmYBTlTomsSBa7VV",
  "document": {
    "title": "State v. Uyesugi",
    "full_title": "STATE OF HAWAII v. BYRAN UYESUGI",
    "jurisdiction": "Hawaii Supreme Court",
    "date": "2002-12-26T00:00:00.000Z",
    "docket": "NO. 23805",
    "body": "ACOBA, J., CONCURRING SEPARATELY, WITH WHOM RAMIL, J., JOINS\n\nDefendant-appellant Byran Uyesugi appeals from the judgment of the first circuit court, the Honorable Marie N. Milks presiding, convicting Uyesugi of murder in the first degree in violation of Hawaii Revised Statutes (HRS) § 707-701 (1993)\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and attempted murder in the second degree in violation of HRS §§ 705-500 (1993)\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e and 707-701.5 (1993).\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e On appeal, Uyesugi argues that: (1) the circuit court erred when it failed to instruct the jury on the legal definition of the terms \"appreciate\" and \"wrongfulness\"; (2) the circuit court's verdict unanimity instruction violated his right to a unanimous jury verdict because it was prejudicially insufficient and misleading; (3) the circuit court erred when it failed sua sponte to intervene when the prosecution (a) described the victims' families, hobbies, and characteristics, and (b) obtained testimony from the family members of the victims describing personal details about the victim's lives; (4) the circuit court erred when it permitted the prosecution to introduce (a) an exhibit containing a picture of the twenty-four weapons he owned but were not used in the shooting, and (b) expert testimony about the characteristics of the weapons in the absence of an objection from defense counsel; and (5) he was deprived of effective assistance of counsel. We hold that: (1) as a matter of plain error analysis, defense counsel having failed to object to the jury instructions in which the term \"appreciate\" and \"wrongfulness\" were not defined, Uyesugi has failed to establish that his substantial rights were violated; (2) the unanimity instructions were not prejudicially insufficient or misleading; (3) the circuit court did not commit plain error when it did not, sua sponte, order the prosecution not to (a) allude to the characteristics of the victims in opening statements or (b) introduce testimony of victims' family members; (4) the circuit court did not commit plain error when, without objection, it allowed the introduction of one picture of the defendant's weapons and permitted the testimony of a weapons expert; and (5) Uyesugi did not receive ineffective assistance of counsel through the pretrial and trial proceedings.\n\nI. BACKGROUND\n\nOn November 9, 1999, Uyesugi was indicted on one charge of first degree murder for the shooting deaths of seven individuals, seven counts of murder in the second degree, and one count of attempted murder in the second degree. Witnesses testified that Uyesugi was an employee of the Xerox Corporation, and that on November 2, 1999 he arrived at work in time for an 8:00 a.m. \"work group\" meeting. Two of the seven victims were in the meeting room when witnesses heard a loud explosion, saw the two victims shot, and observed Uyesugi crouched with a gun in his hand. Two other witnesses testified to hearing the loud explosions and discovering the remaining five victims. Uyesugi surrendered without further incident after a standoff with the police lasting several hours.\n\nA. Jury instructions regarding the affirmative defense of physical or mental disease, disorder or defect excluding penal responsibility.\n\nJury instruction number 26, originally proposed by the prosecution, provided that:\n\nIt is an affirmative defense to a criminal charge that, at the time of the offense, the Defendant was not criminally responsible for his conduct.\n\nThe Defendant is not criminally responsible for his conduct if it is more likely than not or more probable than not that, at the time of the charged offense(s) and as a result of a physical or mental disease, disorder or defect, the Defendant lacked substantial capacity either to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of the law.\n\nA person \"lacks substantial capacity\" either to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of the law if his capacity to do so has been extremely limited by physical or mental disease, disorder or defect. The phrase \"lack of substantial capacity\" does not mean a total lack of capacity. It means capacity which has been impaired to such a degree that only an extremely limited amount remains. The term \"physical or mental disease, disorder or defect\" does not include an abnormality manifested only by repeated criminal or otherwise antisocial conduct.\n\nYou must return a verdict of not guilty by reason of physical or mental disease, disorder or defect which excludes criminal responsibility if you find by a preponderance of evidence, that is, that it is more likely or more probable than not, that, at the time of the charged offense, 1) the Defendant was suffering from a physical or mental disease, disorder, or defect, and 2) that as a result of such physical or mental disease, disorder or defect, he lacked substantial capacity either to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of the law.\n\nDefense counsel withdrew their requested instructions on the affirmative defense of physical or mental disease, disorder, or defect excluding criminal responsibility on June 1, 2000. The withdrawn instructions did not provide definitions of \"appreciate\" or \"wrongfulness.\" The circuit court also instructed that \"[u]nless otherwise provided, the words used in these instructions shall be given their usual sense and in connection with the context in which they appear.\"\n\nB. Jury unanimity instructions\n\nThe circuit court provided unanimity instructions. The prosecution's proposed instruction number 1, regarding first degree murder, was given over the defendant's objection. That instruction provided that \"[i]n order to find that the prosecution has proven the first element, you must find that the Defendant caused the deaths of two or more of the people specified. Your decision as to each death must be unanimous.\" Instructions regarding murder in the second degree were given by agreement: \"However, if and only if you find the Defendant not guilty in Count I of the offense of Murder in the First Degree, or if you are unable to reach a unanimous verdict as to this offense, then you must consider whether the Defendant is guilty or not guilty in Counts II through and including Count VIII of Murder in the Second Degree.\" The court's instruction number 17, given by agreement, provided that \"[a] verdict must represent the considered judgment of each juror, and in order to return a verdict, it is necessary that each juror agree thereto. In other words, your verdict must be unanimous.\" The court's instruction number 18 was given by agreement; it provided that, \"[d]uring your deliberations, you must not discuss this case with any person other than your fellow jurors. You must not reveal to the court or to any other person how the jury stands, numerically or otherwise, until you have reached a unanimous verdict and it has been received by the court.\" Instruction number 29, given by agreement provided that \"[i]f and only if you find the Defendant not guilty in Count I of the offense of Murder in the First Degree, or you are unable to reach a unanimous verdict as to that offense then you may bring in one of the following verdicts[.]\" The circuit court instructed that if the defendant \"has not proved both of these [lack of penal responsibility elements] by a preponderance of the evidence then you must find that this defense does not apply.\" At the conclusion of instruction number 29 the court reiterated to the jury that \"[y]our verdicts must be unanimous.\" At no time during deliberations did the jury request clarification of any of the instructions.\n\nC. The prosecution's opening statement and witness testimony\n\nDuring opening statements, the prosecutor referred to the victims and the victims' families. He stated:\n\nMel Lee, 58 years old; Waipahu High School; Electronics Institute of Hawaii; married for 18 years, two sons and a daughter; Xerox for 32 years. He was the defendant's boss. Along with the names of each of the victims, I will give you something about them or their life to help connect the two so you will ultimately understand exactly who was there and why they were there.\n\nAlso was Ford Kanehira, 41 years old; Castle High School, also the Electronics Institute of Hawaii. He had been married for 18 years. He had a son. He had been with Xerox for 19 years. He married, basically, his high school sweetheart. He was 17, she was 14 when they met. They dated for five years. They got married for a quarter of a century of their lives. They had been virtually inseparable until they had a child, and then the three of them were inseparable.\n\nRonny Kataoka, 50 years old; Leilehua High School. He learned his electronic trade at Honolulu Community College, also married his high school sweetheart, married for 25 years. He and his wife also worked for the Xerox Corporation, Lynn. They had a daughter. He had been with Xerox for 27 years. When the National Guard was called up from Hawaii to serve in Vietnam, Ronny was part of the National Guard, and he served. He was a Vietnam veteran. He carried a grenade launcher while he was in Vietnam.\n\nPeter Mark, 46 years old; Kaimuki High School, Electronics Institute of Hawaii; married for 16 years, two sons; Xerox for 19 years. He loved everything to do with the ocean. He loved surfing, until he got married with two kids, and then surfing took a sort of a backseat to his love of the ocean [sic]. He was buried at sea within sight of Diamond Head.\n\nJohn Sakamoto, easy person to remember. 36 years old; Kalani High School, Electronics Institute of Hawaii; married for seven years, son and daughter; Xerox for 10 years. Easy to remember because he's the fisherman. Hundreds of pictures of this man with the fish that he caught. When he -- before he joined Xerox, he helped make his own boat, and every weekend, Saturday and Sunday, every vacation it was fishing, fishing, fishing.\n\nAgain, that took a backseat after his son and daughter. It was less frequently now, but this was somebody who was on the sea and was actually able to make a living, supplement his income because of his effectiveness as a fisherman in a boat that he helped to build.\n\nAround 8:00 Jason Balatico was in that room. 33 years old; Farrington High School graduate, Healds Institute of Technology; married for ten years, a son and a daughter. That very day he had made his eighth year at the Xerox Corporation.\n\nWhat you can remember about Jason Balatico is that he was a man who was fast and quick at everything he did. He was very fast to smile, sort of a prankster; one of his favorite tricks was to supergluing [sic] a penny on the floor, somebody would try to pick it up for good luck and spend a lot of time trying to pick the penny off the floor.\n\nRon Kawamai, nicknamed the politician, love karaoke. 54 years old; Kaimuki High School; previously married, a son; Xerox for 30 years. He loved socializing, and he loved people.\n\nDefense counsel did not object either during or after the prosecution's opening statements.\n\nThe prosecution called six of the wives of the victims to testify and the son of the seventh victim. Excerpts of the questions are provided.\n\nPROSECUTION: Did you and Mel have any children?\n\nWITNESS: Yes.\n\nPROSECUTION: How many did Mel have all together?\n\nWITNESS: Three.\n\nPROSECUTION: Could you tell me what was Mel's -- just one thing what was his favorite past time?\n\nWITNESS: Golfing.\n\nThe second witness was asked whether the victim, prior to marriage, enjoyed particular activities and where the victim was buried. Defense counsel objected and the court overruled the objection. The third witness was asked about the victim's fishing business and the boat he built. The fourth witness was asked what hobbies his father enjoyed. The fifth witness was asked why she and her husband had returned to Hawaii and she stated that \"[w]e didn't want to deny our children knowing their parents -- God -- grandparents, their cousins, their aunties and uncles.\" This witness was also asked about pranks the victim liked to play on others, the victim's athletic prowess, and the names and ages of their children. The only objection made by defense counsel was noted above. Defense counsel cross-examined each of these witnesses, asking specific questions in order to confirm or deny whether Uyesugi's beliefs about each of the victims were delusional. For example, Uyesugi was apparently acting under the delusion that one of his co-workers was an FBI agent. Defense counsel asked the wife of this victim if her husband worked for the FBI and whether he had ever been a federal agent. Of the remaining witnesses, defense counsel asked questions to establish whether any of the victims had discussed Uyesugi with them or if they were aware of the problems Uyesugi was having at work.\n\nD. T estimony and evidence related to Uyesugi's gun collection\n\nThe prosecution called Charles Davis, a forensic firearm and toolmark examiner, to testify regarding the twenty-four guns owned by Uyesugi though not used in the shooting and the one gun used in the shooting. Davis testified that the prosecution requested that he identify, classify, and evaluate the weapons. He identified four types of weapons\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e and explained the differences among them. During this testimony, the prosecution offered a picture of the guns into evidence, which the circuit court received. The picture was an 8½ x 11 inch document containing a picture of each of the twenty-four guns. The prosecution then asked Davis to identify every weapon and describe its characteristics.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Davis extensively discussed the Glock 17,\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e its bullet capacity, and reloading time. Davis concluded his testimony by explaining what a \"jacketed hollow-point bullet\" is, how this type of bullet functions, and the type of damage to the human body such a bullet will inflict.\n\nII. STANDARD OF REVIEW\n\nA. Harmless error and plain error in the context of jury instructions\n\n\"The standard of review for a circuit court's issuance or refusal of a jury instruction is whether, when read and considered as a whole, the instructions given are prejudicially insufficient, inconsistent, or misleading.\" State v. Aganon, 97 Hawaii 299, 302, 36 P.3d 1269, 1272 (2001), reconsideration denied --- Hawaii --- (2002). \"'[E]rroneous instructions are presumptively harmful and are a ground for reversal unless it affirmatively appears from the record as a whole that the error was not prejudicial.'\" State v. Sua, 92 Hawaii 61, 69, 987 P.2d 959, 967 (1999).\n\nInasmuch as \"the ultimate responsibility properly to instruct the jury lies with the [trial] court,\" if trial or appellate counsel fail to raise an objection to an erroneous jury instruction as to which there is a reasonable possibility of contribution to the defendant's conviction and which, consequently, cannot be harmless beyond a reasonable doubt, then the instruction, by its very nature, has affected the defendant's substantial rights -- to wit, his or her constitutional rights to a trial by an impartial jury and to due process of law -- and, therefore, may be recognized as plain error.\n\nState v. Rapoza, 95 Hawaii 321, 326, 22 P.3d 968, 973 (2001). \"Whether we review the jury instructions in this case for plain error by the circuit court or as an ineffective assistance of counsel claim, the ultimate question is whether the erroneous instructions prejudiced Defendant's rights.\" State v. Jones, 96 Hawaii 161, 166, 29 P.3d 351, 356 (2001).\n\nB. Ineffective assistance of counsel\n\nIn assessing claims of ineffective assistance of counsel, the applicable standard is whether, \"viewed as a whole, the assistance provided [was] 'within the range of competence demanded of attorneys in criminal cases.'\" State v. Antone, 62 Haw. 346, 348, 615 P.2d 101, 104 (1980) (citation omitted).\n\nGeneral claims of ineffectiveness are insufficient and every action or omission is not subject to inquiry. Specific actions or omissions alleged to be error but which had an obvious tactical basis for benefitting the defendant's case will not be subject to further scrutiny. If, however, the action or omission had no obvious basis for benefitting the defendant's case and it \"resulted in the withdrawal or substantial impairment of a potentially meritorious defense,\" then [it] . . . will be evaluated as . . . information that . . . an ordinary competent criminal attorney should have had.\n\nBriones v. State, 74 Haw. 442, 462-63, 848 P.2d 966, 976 (1993) (emphasis in original) (internal citations omitted). The burden of establishing ineffective assistance rests with the petitioner and can only be met by demonstrating specific errors or omissions resulted in the withdrawal or substantial impairment of a meritorious defense. State v. Smith, 68 Haw. 304, 309, 712 P.2d 496, 500 (1986). State v. Pacheco, 96 Hawaii 83, 93-94, 26 P.3d 572, 582-83 (2001).\n\nIII. DISCUSSION\n\nA. Uyesugi's substantial rights were not violated when the circuit court did not define the terms \"appreciate\" and \"wrongfulness.\"\n\nUyesugi argues on appeal that the circuit court plainly erred when it failed to define the terms \"appreciate\" and \"wrongfulness,\" which resulted in a violation of his right to a fair trial. Because Uyesugi failed to object to the instruction, thereby failing to preserve the issue for appeal, we have nevertheless concluded that the circuit court did not plainly err because Uyesugi's substantial rights were not affected.\n\n1. The circuit court did not need to define the term \"appreciate.\"\n\nUyesugi argues that the instructions provided to the jury defining the affirmative defense of mental disease, disorder, or defect excluding penal responsibility (hereinafter \"lack of penal responsibility\") failed to define \"appreciate,\" thereby depriving him of his right to a fair trial. Because the term was defined differently by the prosecution and defense experts, and because the prosecution argued the wrong definition, Uyesugi asserts that the jurors were left to speculate as to the exact meaning of the term. Uyesugi acknowledges that his trial counsel failed to object to these instructions, but argues that that failure amounted to ineffective assistance of counsel. The jury instructions regarding the defense of lack of penal responsibility could have substantially affected Uyesugi's rights; therefore analysis is appropriate. That analysis reveals that Uyesugi's substantial rights were not affected and that he was not prejudiced by the jury instructions. We hold that the circuit court did not plainly err when it did not define the term \"appreciate.\"\n\nIn order to assign error, the Hawaii Rules of Penal Procedure (HRPP) Rule 30(f)\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e requires a party to object to an instruction before the jury retires to consider the verdict. State v. Culkin, 97 Hawaii 206, 214, 35 P.3d 233, 241 (2001). Inasmuch as Uyesugi's trial counsel failed to object and appellate counsel is alleging ineffective assistance of counsel, the dispositive issue is whether Uyesugi's substantial rights were prejudiced. This issue, whether the jury instructions were prejudicially insufficient, can be resolved through study of HRS § 704-400(1) (1993),\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e the commentary to that section, the Model Penal Code (MPC), and our own case law.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e HRS § 704-400(1) employs the phrase \"appreciate the wrongfulness of the person's conduct,\" in place of the original M'Naghten rule that \"resolves the problem solely in regard to the capacity of the individual to know what he was doing and to know that it was wrong.\" MPC, Tentative Drafts Nos. 1-4, Comments § 4.01 at 156 (American Law Institute ed., 1956). The Hawaii legislature was convinced that the M'Naghten rule did not comport with modern medicine and psychiatry and, therefore, adopted the reasoning and language of the MPC. Hse. Stand. Com. Rep. No. 227, in 1971 House Journal, at 785; see also State v. Moeller, 50 Haw. 110, 116, 433 P.2d 136, 141 (1967) (\"While we agree that the M'Naghten rule should have been discarded with the horse and buggy, it is part of our statutory law and as such, as long as we adhere to the rule that the legislature can prescribe rules of evidence, we must adhere to the statute.\") (quoting State v. Dhaemers, 150 N.W.2d 61, 66 (Minn. 1967)).\n\nUyesugi argues that because the standard is no longer whether the defendant knows his act is wrong, the jury instructions should reflect the legislature's concern over the antiquated right/wrong standard and expressly inform the jury that \"appreciate conveys a broader sense of understanding than simple cognition.\" The prosecution generally argues that \"appreciate\" is commonly used in daily conversation by people of ordinary intelligence and need not be defined. The prosecution asserts that the fact that the circuit court informed the jury that unless otherwise instructed, words are given their ordinary meaning reinforces its argument that the jury required no specific definition. Defense counsel and the prosecution called experts who testified as to the meaning of the term \"appreciate.\" This testimony was not dissimilar, but it was also not entirely consistent.\n\nOne defense expert, Park Dietz, M.D., stated:\n\nI use the word appreciate according to the ordinary dictionary definition, and appreciate in my use of it means to accurately weigh or judge. Now, that means having the capacity to estimate accurately; and in particular, a standard for insanity, the capacity to appreciate wrongfulness, I understand to mean the ability to accurately estimate how wrong the crime was.\n\nThe second defense expert, Robert Marvit, M.D., stated that \"[t]he word appreciate . . . is not simply knowing. Otherwise, why not use the word know. The word appreciate is, in my understanding, the recognition of the greater significance of what's happening.\" Dr. Marvit then stated that \"appreciate means to look beyond some kind of a narrow focus of either or, good or bad, right or wrong, this or that. It's being able to look at the consequence of a behavior.\" Based upon these definitions, Uyesugi states that the circuit court's instructions failed to convey the meaning of the term \"appreciate\" as applied to the defense of lack of penal responsibility.\n\nThe prosecution rebuttal witness defined the term \"appreciate\" more specifically. For example, the following occurred between the prosecutor and his rebuttal witness, Harold Hall, Ph.D.:\n\nPROSECUTOR: Can I ask you, in terms of the word appreciate, and when you use that term and when you're using the test in this case or when you're giving your opinions on the test in this case, when you use that word, can it be or do you feel that it's synonymous with know or understand or realize?\n\nWITNESS: Or to know or to realize.\n\nDuring cross-examination of Dr. Hall, defense counsel asked, \"Would you agree that to appreciate wrongfulness of conduct, it's different from knowing right from wrong?\" Dr. Hall stated, \"Well, it goes beyond a simple knowing what's legally right or wrong, yes.\" The prosecution's questioning of its expert witnesses during its case-in-chief indicated that the prosecution used the term \"appreciate\" interchangeably with the term \"know.\" For example, the prosecution asked Thomas Cunningham, Ph.D., \"What is the significance of [Uyesugi] having a plan as it relates to the question of whether he knows what he's doing is right or wrong?\" The prosecution asked the same witness, \"What do you look at to determine whether or not a person knows right from wrong?\" The prosecution asked Tom Greene, Ph.D.:\n\nPROSECUTION: Do you have an opinion as to whether or not the capacity of the defendant to appreciate the wrongfulness of his conduct was substantially impaired by his delusional disorder?\n\nWITNESS: I have an opinion on that.\n\nPROSECUTION: What was your opinion?\n\nWITNESS: No significant impairment.\n\nPROSECUTION: Can you tell us why you had that opinion, why you did not believe that he knew right from wrong?\n\nWITNESS: So the question -- are the facts that he appreciated right or wrong behavior basically?\n\nDuring cross-examination, Dr. Greene was asked whether he was equating \"appreciate\" with \"knowing.\" Dr. Greene answered affirmatively. The prosecution asked its expert, Leonard Jacobs, M.D., whether the field of medicine, and psychiatry in particular, provides a \"scientific basis for making a decision as to whether somebody knows right from wrong?\" During cross-examination, Dr. Jacobs was asked whether there is a difference between \"appreciating\" the wrongfulness of conduct and \"knowing\" the wrongfulness of conduct. Dr. Jacobs answered, \"I don't see a difference.\" During his closing arguments, the prosecution continued to use the term \"appreciate\" interchangeably with \"know.\"\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Defense counsel, in his closing argument, also focused on the term \"appreciate\" and the meaning that should be ascribed to the term.\n\nAt the beginning of its instructions, the trial court stated that \"[u]nless otherwise provided, the words used in these instructions shall be given their ordinary meaning taken in their usual sense and in connection with the context in which they appear.\" Because the circuit court did not define the term \"appreciate,\" the jury was left to define the word according to its ordinary usage.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e The circuit court's instructions were consistent with the Hawaii Standard Jury Instructions. See Hawaii Standard Jury Instructions-Criminal, Vol. 1, § 7.07 at 93 (1991). The instructions were also consistent with the legislative intent in adopting the ALI/MPC insanity defense.\n\nGiven the variety of uses and definitions of the term \"appreciate,\" the pivotal question becomes whether the lack of a specific definition during jury instructions denied Uyesugi a fair trial. In its case-in-chief, the prosecution adduced testimony from eyewitnesses, police investigators, and experts, which, if believed, established that: (1) Uyesugi could \"appreciate the wrongfulness of his conduct but acted out of anger in spite of that appreciation[,]\"; (2) Uyesugi's \"major psychiatric disorder\" did not \"substantially impair [Uyesugi's] capacity to appreciate the wrongfulness of his conduct,\"; (3) Uyesugi expressed concern that \"everybody was out to get him, that he was going to lose his job. He also had talked about how he was going to let some people down\"; (4) the Glock 17 that Uyesugi used carried seventeen rounds of ammunition and was reloaded once during the shooting; (5) three of the victims had died of multiple gunshot wounds; and (6) Uyesugi concealed the weapon when he entered the building.\n\nThe defense presented expert testimony that Uyesugi was acting under a delusion that prevented him from acting normally in relation to the individuals who were a part of Uyesugi's delusional framework. According to these experts, Uyesugi could, and did, interact normally with individuals outside of his delusions.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e When acting within the context of his delusions, Uyesugi argued, he was unable to appreciate the wrongfulness of his actions. One defense expert, Dr. Dietz, testified that:\n\nIn delusional disorder, the individual has ideas that are quite wrong. In lay terms, crazy ideas. And yet at the same time, the person can act normal, look normal, speak normally, think logically about all areas that aren't related to the delusion. And yet at the same time, have very odd whacky wrong ideas about everything connected to the delusions.\n\nHe went on to state that Uyesugi's delusions had existed for ten to twelve years in relation to particular people at Xerox. These delusions included the belief that particular people he worked with were\n\npart of a conspiracy that has purposely, maliciously gone about trying to make him miserable, torment him, make him look bad, gossip about him, ruin his reputation, make it impossible for him to do his work well, make it likely he'll be fired, invade his home and begin to take away any chance of keeping his calm in the face of this repeated, constant day after day, year after year harassment and torment.\n\nDr. Dietz testified that Uyesugi was under the deluded belief that one co-worker was employed by the government, that the FBI and CIA had surveillance equipment in his car and bathtub drain, and that the victims had invaded his home, mutilated his fish, stolen wood working projects, and gone through his private possessions.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e These defense experts agreed that Uyesugi knew killing was wrong, but that in the context of his delusions he could not appreciate the wrongfulness.\n\nDespite the varying uses of the term \"appreciate,\" none was improper. The ordinary meaning of the word is not precise. The jury heard testimony from experts who provided it with definitions, explanations, and examples of the meaning of \"appreciate.\" The thorough and extensive expert testimony gave the jury the tools necessary for it to determine whether Uyesugi could \"appreciate\" the wrongfulness of his conduct. That testimony also brought forth the inherent subtleties of the term. The closing arguments of the prosecutor are not evidence and the jury was informed of this. When Uyesugi argues that the standard is more subtle than to simply know the difference between right and wrong, he fails to understand the jury's ability to listen to the judge's instructions and the testimony of the expert witnesses. On the record before us, we hold that the circuit court did not commit plain error in its instructions to the jury.\n\n2. The circuit court did not err when it did not define the term \"wrongfulness.\"\n\nFor the same reasons Uyesugi argued that his substantial rights were violated above, he argues that the term \"wrongfulness\" should have been defined and that the court's failure to do so resulted in a violation of his right to a fair trial. Specifically, Uyesugi argues that the term \"wrongfulness\" carries with it a moral distinction that was not reflected in the instructions provided to the jury. We agree with Uyesugi that the term \"wrongfulness\" reflects our legislature's attempt to distinguish between pure \"criminality,\" in which the determining factor is whether the defendant knew his action was criminal, and \"wrongfulness,\" in which the defendant knew his conduct was criminal \"but because of a delusion believe[d] it to be morally justified.\" ALI MPC § 4.01. The prosecution argues that inasmuch as the legislature did not define the term \"wrongfulness,\" the ordinary meaning of the word should be given effect. Although we agree generally with the prosecution's argument, its definition of \"wrongfulness\" is too selective and narrow.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Uyesugi did not argue at trial that he believed society would agree that his conduct was morally justified, he did not request that the jury instructions reflect this distinction, he did not object to the instructions as given, and finally, he never raised any factual points or expert testimony supporting the assertion that, although he knew his conduct was criminal, he believed that his conduct was morally justified. Because Uyesugi failed to adduce evidence to support this issue at trial, and Uyesugi fails to demonstrate that the lack of specificity in the definition prejudiced his substantial rights, we hold that the circuit court did not plainly err.\n\nThe legislative history accompanying HRS § 704-400 expressly provides that the Hawaii Penal Code test for criminal responsibility is derived from the MPC as interpreted in United States v. Freeman, 357 F.2d 606, 622 n.52 (2d Cir. 1966). In a brief footnote, the Freeman court stated, \"We have adopted the word 'wrongfulness' in Section 4.01 as the American Law Institute's suggested alternative to 'criminality' because we wish to include the case where the perpetrator appreciates that his conduct is criminal, but, because of a delusion, believes it to be morally justified.\" Freeman, 357 F.2d at 622 n.52. There is no further discussion in Freeman that provides guidance as to how courts should interpret \"morally justified.\" Freeman is construed in State v. Wilson, 700 A.2d 633 (Conn. 1997), a case upon which Uyesugi relies for the argument that this court should adopt a subjective test in determining whether the defendant understands the wrongfulness of his conduct.\n\nWilson was convicted of murder. Apparently, Wilson functioned under the delusion that his victim, Jack Peters, was systematically destroying Wilson's life.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e At his trial, Wilson requested,\n\nthat the circuit court instruct the jury that wrongfulness is comprised of a moral element, so that \"an accused is not criminally responsible for his offending act if, because of mental disease or defect, he believes that he is morally justified in his conduct -- even though he may appreciate that his act is criminal.\" Wilson, 700 A.2d at 637.\n\nOn appeal, the supreme court held that Wilson was entitled to an instruction on the definition of \"wrongfulness\" and that the trial court's failure to so instruct was reversible error. Id. at 637.\n\nThe Wilson majority interpreted both Freeman and the MPC in adopting an objective test to determine whether the defendant appreciated the wrongfulness of his actions. Id. at 637. The Connecticut Supreme Court concluded that a defendant may\n\nestablish that he lacked substantial capacity to appreciate the \"wrongfulness\" of his conduct if he can prove that, at the time of his criminal act, as a result of mental disease or defect, he substantially misperceived reality and harbored a delusional belief that society, under the circumstances as the defendant honestly but mistakenly understood them, would not have morally condemned his actions. Id. at 640.\n\nThe majority reasoned that the MPC and Freeman employed the term \"wrongful\" to encompass the situation where the defendant knew the conduct was criminal but because of the delusion believed it to be morally justified.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Id. at 638.\n\nThe court further opined that Wilson \"presented sufficient evidence to warrant a general charge on the insanity defense.\" Id. at 644. To receive a specific instruction on \"wrongfulness,\" Wilson was also required to establish that he misperceived reality and in acting on that misperception did not appreciate that his conduct was \"contrary to societal morality.\" Having met this burden, the supreme court vacated Wilson's conviction and remanded to the circuit court for a new trial.\n\nIn her concurrence, Justice Berdon opined that both Freeman and the MPC articulate a \"subjective\" test. She stated that the MPC and Freeman court \"adopted the word 'wrongfulness' for the reason that [it would] include the case where the perpetrator appreciates that his conduct is criminal but because of [his delusion] believes it to be morally justified.\" Id. at 648 (Berdon, J., concurring) (alterations in original). Thus, Justice Berdon relies on the plain language of Freeman in which the Second Circuit Court of Appeals stated \"[w]e have adopted the word 'wrongfulness' in Section 4.01 as the American law Institute's suggested alternative to 'criminality' because we wish to include the case where the perpetrator appreciates that his conduct is criminal, but, because of a delusion, believes it to be morally justified.\" Id. at 648 (Berdon, J., concurring). It is this test that Uyesugi urges this court to adopt.\n\nAlthough our legislative history does not provide us with the specific reasoning found and relied upon by the Connecticut Supreme Court, it did expressly provide that the commentary from the MPC could be referenced in interpreting the Hawaii Code. Although Wilson is not controlling in this jurisdiction, it is nonetheless persuasive because its reasoning is thorough and directly applicable to HRS § 704-400. The Hawaii legislature had the opportunity to choose between the terms \"criminality\" and \"wrongfulness\" when it adopted HRS § 704-400. The fact that \"wrongfulness\" is found in this statute strongly supports a finding that the legislature determined that the term should carry with it the dual components of knowing that the conduct in question is criminal and honestly but mistakenly believing that conduct to be morally justified. Moreover, our legislative history expressly referenced Freeman, which lends further credence to this interpretation. Inasmuch as Hawaii's legislative history appears consistent with Wilson, we adopt a rule that reflects the reasoning from both the majority and concurrence. A subjective/objective rule would determine whether the defendant appreciated the wrongfulness of his conduct from the point of view of a reasonable person in the defendant's position under the circumstances as he believed them to be. See e.g., State v. Sawyer, 88 Hawaii 325, 333, 966 P.2d 637, 645 (1998) (\"'[T]he defendant must satisfy a subjective/objective test' in proffering a 'reasonable explanation' in accordance with HRS § 707-702(2). First, in satisfying the subjective portion, the record must reflect the circumstances as the defendant believed them to be. Second, in satisfying the objective portion, the record must support 'a reasonable explanation or excuse for the actor's disturbance.'\"); State v. Kaiama, 81 Hawaii 15, 26, 911 P.2d 735, 746 (1996) (\"To satisfy the second prong of HRS § 707-702(2), i.e., a reasonable explanation, the defendant must satisfy a subjective/objective test. The circumstances must be viewed as the defendant believed them to be (subjective); however, [t]he ultimate test is objective[.] [T]here must be a reasonable explanation or excuse for the actor's disturbance.\") (Citations and quotation marks omitted.); State v. Pemberton, 71 Haw. 466, 477, 796 P.2d 80, 85 (1990) (\"[T]he standard for judging the reasonableness of a defendant's belief for the need to use deadly force is determined from the point of view of a reasonable person in the Defendant's position under the circumstances as he believed them to be.\") (Citation omitted.).\n\nTo rely solely on the ordinary meaning of \"wrongful,\" as the prosecution recommends, would be contrary to the plain meaning of the MPC and our own legislature's reliance on Freeman when it enacted HRS § 704-400. Assuming arguendo that the use of the term \"wrongfulness\" meant that the legislature was adopting the Freeman and MPC reasoning, the question becomes whether Uyesugi adduced sufficient evidence at trial to entitle him to a specific instruction on this point. We think not.\n\nEven if this court adopted the purely subjective test proposed by Justice Berdon in Wilson, Uyesugi would still not have established sufficient evidence to warrant an instruction on the definition of the term \"wrongfulness.\" In employing the subjective approach, Uyesugi argues in this appeal that although he knew that killing was wrong and that his conduct would transgress societal mores, he believed that he was justified because of his delusional state. This argument conflicts with Uyesugi's trial defense. At trial, Uyesugi's experts never testified that Uyesugi believed his conduct to be morally justified. Indeed, on appeal, Uyesugi fails to indicate where in the record he put forth such an argument. Although arguing that this court adopt the subjective approach, Uyesugi has never, even in his appellate brief, raised the issue that he believed violating societal moral boundaries was justified. Thus, even if the more liberal subjective test were applied, i.e., that Uyesugi was aware that his conduct was criminal but, because of his delusion, believed that he was morally justified in acting, Uyesugi failed to adduce evidence sufficient to support this instruction. In essence, Uyesugi asks this court to reverse his conviction so that he can try a new defense in place of the one that failed. Because Uyesugi's substantial rights were not violated, the circuit court did not commit plain error.\n\nB. The circuit court's instruction regarding unanimity in the jury verdict was correct.\n\nUyesugi next argues that the jury instructions were prejudicially insufficient and misleading so as to violate his constitutional guarantee of a unanimous verdict. Uyesugi asserts that the jury could have been confused by the instructions because the jurors might have thought that if they could not arrive at a unanimous decision regarding Uyesugi's sanity, they were obligated to find him guilty of murder in the first degree. Uyesugi states that the jurors were not informed that \"before reaching a 'guilty as charged' verdict, rejection of the mental defense must also be unanimous.\" Thus, under Uyesugi's reasoning, the jury must be instructed to (1) determine whether the prosecution has met its burden of proving the elements of the charged offense beyond a reasonable doubt and (2) declare that it cannot reach a unanimous decision if it fails to unanimously decide whether Uyesugi has met his burden by a preponderance. Uyesugi concludes that some jurors would have voted not guilty by reason of lack of penal responsibility and others would have voted guilty as charged. Although Uyesugi's argument sets forth a correct statement of the law, it does not necessarily follow that the jury instructions, as given, were prejudicially insufficient, inconsistent, or misleading. Because the jury unanimously found Uyesugi guilty as charged and the instructions represented a correct statement of the jury's duties with regard to unanimity, we hold that the circuit court did not err.\n\nBoth the defendant and the prosecution agree that a criminal defendant has a right to a unanimous decision by the jury in all issues related to guilt and degree of the crime. See State v. Arceo, 84 Hawaii 1, 29, 928 P.2d 843, 871 (1996) (\"Pursuant to this constitutionally and statutorily conferred authority, this court has promulgated HRPP 31(a), which provides in relevant part that verdicts in criminal cases 'shall be unanimous, unless otherwise stipulated to by the parties.'\"). Given that a criminal defendant has a constitutional right to a unanimous verdict, the issue in this case becomes whether the instructions confused the jury to the extent that there was no unanimity in its determination that Uyesugi was guilty of murder in the first degree and attempted murder in the second degree.\n\nIn 1982, the Hawaii Legislature amended HRS § 704-402 to provide that the defense of lack of penal responsibility is an affirmative defense. Stand. Comm. Rep. No. 962-82, in 1982 House Journal, at 1348. Legislative history indicates that the legislature expressly adopted the reasoning of the United States Supreme Court in Leland v. Oregon, 343 U.S. 790 (1952), \"which held that making the defense of insanity an affirmative defense is not unconstitutional and does not violate the Due Process Clause of the Fourteenth Amendment. Also, courts have widely held that insanity is not an element of any offense. Thus, shifting the burden of proving insanity upon the defendant does not relieve the State of its burden of proving the elements of the offense.\" Id. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nAn affirmative defense requires the prosecution to prove each and every element of the charged crime beyond a reasonable doubt. The defendant claiming lack of penal responsibility \"has the burden of going forward with the evidence to prove facts constituting the defense and of proving such facts by a preponderance of the evidence.\" State v. Fukusaku, 85 Hawaii 462, 481, 946 P.2d 32, 51 (1997); see also HRS § 701-115(2)(b) (1993) (\"If the defense is an affirmative defense, the defendant is entitled to an acquittal if the trier of fact finds that the evidence, when considered in light of any contrary prosecution evidence, proves by a preponderance of the evidence the specified fact or facts which negative penal liability.\"). Consonant with this statute is the reasoning in Leland, in which the United States Supreme Court stated that \"Oregon required the prosecutor to prove beyond a reasonable doubt every element of the offense charged. Only on the issue of insanity as an absolute bar to the charge was the burden placed upon the [defendant].\" Leland, 343 U.S. at 799. The jury instructions provided in this case reflected a correct statement of the law.\n\nThe jury instructions for the affirmative defense, see section I.A. for a complete recitation of these jury instructions, directed that \"if the Defendant has proved both of these elements by a preponderance of the evidence, then you must find the Defendant not guilty of the offenses. If the Defendant has not proved both of these elements by a preponderance of the evidence, then you must find that this defense does not apply.\" The instructions were not erroneous to the extent that they reflect a correct statement of the law. See HRS § 701-115. Recognizing that a correct statement of the law does not always reflect an appropriate jury instruction in every case, see In re Estate of Herbert, 90 Hawaii 443, 468-69, 979 P.2d 39, 64-65 (1999), we must resolve whether, \"when considered as a whole, the instructions given are prejudicially insufficient, inconsistent, or misleading.\" See Aganon, 97 Hawaii at 302, 36 P.3d at 1272.\n\nPrior to orally charging the jury, the circuit court provided each juror with a written copy of the instructions. The circuit court instructed the jury that it \"must consider all of the instructions as a whole and consider each instruction in light of all of the others.\" As noted supra, the jury was instructed that Uyesugi must be found not guilty if he proved he was suffering from a physical, or mental disease, disorder or defect and that, \"as a result of such physical or mental disease, disorder or defect, he lacked substantial capacity either to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of the law.\" The jurors were informed that \"in deciding what the verdict should be, all jurors are equal and the foreperson does not have any more power than any other juror.\" The circuit court apprised the jury that\n\na verdict must represent the considered judgment of each juror, and in order to return a verdict, it is necessary that each juror agree thereto. In other words, your verdict must be unanimous. Each of you must decide the case for yourself, but it is your duty to consult with one another and to deliberate with a view to reaching an agreement, if you can do so without violating your individual judgment. (Emphasis added.)\n\nAfter the verdict was rendered, the jury was polled. See State v. Miyahira, 6 Haw. App. 320, 325, 721 P.2d 718, 722 (1986) (stating that the purpose of polling is \"to assure the court and the parties that a unanimous verdict has been reached and to give each juror an opportunity to indicate assent to the verdict in open court\") (citations omitted). Each juror stated that he or she agreed with the verdicts and that the verdicts reflected his or her opinion. During voir dire, defense counsel stated, \"Sure, the verdict has to be unanimous. All twelve of you have to agree either for acquittal or for conviction. All twelve of you have to agree in terms of a defense. Either you accept it, or you reject it. But each of you have an individual vote, and each of you with that individual vote can stop the verdict.\" The jury received unanimity instructions no fewer than six times.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e The jury did not seek clarification regarding any of the jury instructions; there is nothing in the record on appeal to suggest that these instructions were confusing, misleading, or prejudicially insufficient. The circuit court provided the jury with a correct statement of the law concerning unanimity of verdicts and the elements of the affirmative defense. The record as a whole does not support Uyesugi's contention.\n\nUyesugi relies on State v. Miyashiro, 90 Hawaii 489, 979 P.2d 85 (App. 1999), and the recently enacted Pattern Hawaii Standard Jury Instructions Criminal (HAWJIC) §§ 7.06\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e and 7.07\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e for his assertion that the instructions recommended in Miyashiro should have been used in his case to avoid the alleged jury confusion. In Miyashiro, the defendant was arrested and charged with various counts including promoting a dangerous drug in the first and third degrees, unlawful possession of drug paraphernalia, and possession of a firearm by a person convicted of certain crimes. Miyashiro, 90 Hawaii at 490, 979 P.2d at 86. The language of the jury instructions regarding the affirmative defense of entrapment were consistent with the instructions in the present case.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e On appeal, Miyashiro argued two points, one of which was that the circuit court erred in its answer to a communication from the jury. The jury asked, \"Is unanimity required in the decision of whether entrapment occurred regarding counts I - III [promoting dangerous drug in the first degree]?\" The court responded \"yes.\" Shortly thereafter, the jury reached a verdict. Id. at 496, 979 P.2d at 92. Defense counsel objected after notice that a verdict had been reached. He argued that the jury was misled because if it was unable to reach a unanimous verdict on the entrapment defense, it could still find the defendant guilty as charged. Id. at 496, 979 P.2d at 92. On appeal, the defendant argued that \"the circuit court committed plain error when it responded affirmatively to question No. 1 to Jury Communication No. 1. \"Defendant argues that '[i]t is not necessary that the jury be unanimous with respect to the defense of entrapment . . . only . . . that they [sic] be unanimous with respect to their [sic] verdict.'\" Id. at 497, 979 P.2d at 93 (alterations in original).\n\nRecognizing that \"the circuit court's response to a jury communication is the functional equivalent of an instruction,\" id. at 492, 979 P.2d at 89, the ICA analyzed the jury communication and the circuit court's answer as an issue of alleged erroneous jury instructions. The ICA disagreed with the defendant's argument but nevertheless agreed that the jury instructions were misleading because the circuit court \"did not instruct the jury that it was required to unanimously agree that all elements of the charged offenses had been established beyond a reasonable doubt before considering the entrapment defense.\" Id. at 500, 979 P.2d at 96. It was not, however, merely the absence of this instruction that rendered the instructions misleading, but also the circuit court's \"affirmative answer to question No. 1 to Jury Communication No. 1\" that\n\nmay have implied to the jurors that if they failed to reach agreement as to the affirmative defense of entrapment, they were required to return a guilty verdict, even if they had not unanimously determined whether the prosecution had established all the elements of the charged offenses beyond a reasonable doubt. Id. at 500, 979 P.2d at 96.\n\nThe ICA held that \"[b]ecause the circuit court's answer to question No. 1 to Jury Communication No. 1 was prejudicially insufficient and misleading and affected Defendant's constitutional right to a unanimous verdict, we conclude that the circuit court plainly erred in giving its answer.\" Id. at 501, 979 P.2d at 97.\n\nUyesugi asserts that Miyashiro is directly on point. Pursuant to Miyashiro, Uyesugi contends that he was similarly prejudiced because the jury would have \"logically, but incorrectly, concluded that [its] unanimous decision that the prosecution had proved the offenses represented [its] unanimous 'verdict' of guilt.\" Uyesugi completely ignores that part of the Miyashiro reasoning that expressly states that it was not the instructions, standing alone, that were prejudicially insufficient or misleading, but was the circuit court's answer to the jury communication in conjunction with the instructions that resulted in the plain error. Uyesugi's argument studiously disregards the factual application of, and the ICA's holding in, Miyashiro.\n\nThe Miyashiro analysis is correct. See id. at 500 n.13, 979 P.2d at 96 n.13 (providing recommended jury instructions for affirmative defenses). The ICA and HAWJIC have improved upon the affirmative defense instructions. The jury must unanimously determine whether the prosecution met its burden of proof. Only then should the jury proceed to a determination of whether the defendant met his or her burden in proving the affirmative defense. Whether the defendant met his or her burden must be determined by a unanimous decision of the jury. If the jury has successfully proceeded this far in its deliberations, it may then consider the proper verdict. If the jury fails to reach unanimity as to the affirmative defense, the circuit court must declare a mistrial due to a hung jury. Applying the reasoning and analysis of Miyashiro to the present case does not effect the same outcome. Indeed, as Uyesugi argues, the single sentence, \"if the Defendant has not proved both of these elements by a preponderance of the evidence, then you must find the defense does not apply,\" could be interpreted in the manner Uyesugi suggests. In Miyashiro, the ICA did not conclude that, viewed in isolation, this instruction was prejudicially insufficient. Nor do we. To do so would disregard the analytical imperative that we view and consider the jury instructions in their entirety. In the present case, there are numerous examples of proper jury instructions that reinforced the necessity of unanimity, that informed the jurors that each of their individual votes were of equal importance, and that they were not to concede their individual judgment to the other jury members. Unlike Miyashiro, the record is devoid of anything that suggests that the jury was confused or misled. We hold that when considered in their entirety and without evidence to the contrary, the jury instructions, as given, did not contribute to Uyesugi's conviction.\n\nC. Uyesugi's substantial rights were not violated during the prosecution's opening statement and direct examination.\n\nUyesugi argues that it was plain error to allow the prosecutor to present allegedly irrelevant and prejudicial evidence which served to incite \"the passions and resentment of the jurors.\" First, Uyesugi asserts that the prosecution's opening statement, in which the prosecutor stated that witnesses would assist the jury in knowing who the victims were and why the victims were present in the building at the time of the killings, was not relevant. Second, Uyesugi contends that the questions the prosecutor asked when he called those witnesses were calculated to inflame the passions and prejudices of the jury. Because testimony from family members of crime victims is not per se disallowed and Uyesugi's substantial rights were not prejudiced, we hold that the circuit court did not plainly err.\n\nIn State v. Edwards, 81 Hawaii 293, 300, 916 P.2d 703, 710 (1996), the defendant was charged with and convicted of the brutal murder, sexual assault, and robbery of a sixty-seven year-old woman.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e On appeal, the defendant argued that \"the daughter of the deceased . . . gave a detailed and moving account that personalized the deceased i[n] a sympathetic light, giving a romantic and pleasant picture of the deceased's life and the interactions of the deceased with her own immediate family.\"\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Edwards, 81 Hawaii at 300, 916 P.2d at 710 (alterations in original). Edwards argued that the daughter's testimony \"romanticized\" the deceased, thereby prejudicing the jury against him. Edwards had also argued that failure of his counsel to object to this testimony was indicative of ineffective assistance of counsel and led to an impairment of a potentially meritorious defense. We disagreed with both arguments.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e We were not convinced that testimony about golf and buying macadamia nuts romanticized anyone. Moreover, we stated that \"regardless of the characterization of the decedent's activities, the evidence was relevant to show that she was alive[.]\" Id. at 300, 916 P.2d at 710. In rejecting Edwards' ineffective assistance argument, we stated that \"Edwards has failed to establish[] how defense counsel's failure to object to the daughter's testimony evinced counsel's 'lack of skill, judgment, or diligence' . . . nor how such alleged failure led to 'the withdrawal or substantial impairment of a potentially meritorious defense.'\" Id. at 300, 916 P.2d at 710 (citation omitted). Edwards permits testimony from the victim's family members, but Edwards does not clarify when testimony may rise to the level of undue prejudice. It only comments that \"[w]e fail[ed] to see how playing golf and buying a box of macadamia nuts for a friend portrays a 'romantic' and 'idyllic' life.\" Id. at 300, 916 P.2d at 710. We concluded that \"given the overwhelming nature of the evidence linking Edwards to the crimes charged,\" defense counsel's failure to object did not \"result[] in either the withdrawal or substantial impairment of a potentially meritorious defense.\" Id. at 301, 916 P.2d at 711.\n\nWhether testimony of surviving family members inflames the jury to the extent that the jury is diverted from its objective considerations must be considered in light of the whole record. In particular, we focus attention on the purpose of the testimony, whether the family members expressed their opinions or characterizations of the crime and the effect of the crime on the family, the strength and weakness of the evidence against the defendant, whether the failure to object to such testimony was the result of trial strategy or ineffective assistance of counsel, and whether and how the testimony was woven into the case.\n\nIn isolation, the testimony of the family members may indeed have prejudiced Uyesugi. The family members were asked about what may clearly be described as endearing personal characteristics of the decedents. The jurors were furnished with images of decent, happy, and caring family men. Defense counsel may have been put in a bind because to cross-exam the surviving spouses and children could very well have appeared cruel and disrespectful. It has not, however, been our philosophy to view a single aspect of a trial in isolation. See State v. Lagat, 97 Hawaii` 492, 496, 40 P.3d 894, 898 (2002) (stating, in the context of jury instructions, that \"error is not to be viewed in isolation and considered purely in the abstract. It must be examined in the light of the entire proceedings and given the effect which the whole record shows it to be entitled\") (citations omitted); Aganon, 97 Hawaii at 303, 36 P.3d at 1272 (same); Culkin, 97 Hawaii at 213, 35 P.3d at 240 (same); State v. Apao, 95 Hawaii 440, 443, 24 P.3d 32, 35 (2001) (same); State v. Valdivia, 95 Hawaii 465, 471-72, 24 P.3d 661, 667-68 (2001) (same); Rapozo, 95 Hawaii at 326, 22 P.3d at 973 (same); State v. Valentine, 93 Hawaii 199, 207, 998 P.2d 479, 484 (2000) (same); State v. Gano, 92 Hawaii 161, 176, 988 P.2d 1153, 1168 (1999); State v. Vliet, 91 Hawaii 288, 298, 983 P.2d 189, 199 (1999); State v. Toyomura, 80 Hawaii 8, 26, 904 P.2d 893, 911 (1995); see also Vol. 1, Jack B. Weinstein \u0026 Margaret A. Berger, Weinstein's Federal Evidence, § 103.42[1] (Joseph M. McLauglin, ed., Matthew Bender 2d ed. 2002). In viewing the entire trial record we note that: (1) the testimony of the family members comprises 33 pages of approximately 1800 pages of transcripts; (2) the questions propounded to the decedents' relatives concerned the characteristics of the decedents; (3) the family members did not testify as to the effects of the crime on the families; (4) the evidence that Uyesugi murdered the decedents was overwhelming; (5) the expert testimony regarding Uyesugi's mental state at the time of the murders was extensive; and (6) pursuant to our analysis in section III.A. and III.B.supra, the evidence that Uyesugi lacked penal responsibility was thoroughly examined by the prosecution and defense counsel. Defense counsel also used the opportunity to cross-examine the witnesses to elicit testimony regarding Uyesugi's delusional state. Combined, these factors support a conclusion that, while the circuit court's implied permission to the prosecution to elicit testimony from family members may have been error, it did not affect Uyesugi's substantial rights and therefore does not rise to the level of plain error.\n\nUyesugi also relies on two cases from other jurisdictions holding that testimony and evidence from family members of murdered victims to be prejudicially irrelevant. These cases are distinguishable. In People v. Hope, 508 N.E.2d 202, 206-07 (Ill. 1986), the prosecutor asked the wife of the murder victim about the couple's children, introduced a photograph of the victim and his family, and asked other prosecution witnesses whether the photo accurately depicted the deceased and his family. Defense counsel objected to the introduction of the photo and identification of the photo by other witnesses. The circuit court overruled the objections. The Illinois Supreme Court ruled that the trial court erred because the testimony and photograph were presented as though they were material to the defendant's guilt, particularly because the prosecution asked other witnesses to identify the same photograph. Moreover, the court explained, defense counsel's objections were overruled, potentially amplifying the prejudicial effects by suggesting that the court thought the testimony and photograph were material to the guilt of the defendant.\n\nIn Hope, the record as a whole is distinguishable from the record in this case. Uyesugi's counsel never objected to the prosecution's opening statement or to the witnesses being called. During direct examination, Uyesugi's counsel objected to a single question. The circuit court overruled that objection. Repetition of the allegedly prejudicial questions is absent from Uyesugi's trial. The prosecution did not refer to the personal characteristics of the deceased or the testimony of the surviving family members during closing arguments. Viewing the record as a whole, Uyesugi has failed to demonstrate prejudice.\n\nLike Uyesugi's reliance on Hope, his reliance on People v. Bernette, 197 N.E.2d 436, 444 (Ill. 1964), is misplaced. The facts of Bernette are, however, more similar to those found in the case sub judice. The prosecution brought forth testimony from the wife of the deceased victim regarding the children of the deceased and the ill-effects the family was suffering as a result of the murder. Defense counsel failed to make any objections. In his closing argument, the prosecutor stated, \"[The deceased] had a wife, he had a child and he had a right -- he was only 20 years old when he died -- to be with that family and to pursue his life and liberty.\" Bernette, 197 N.E.2d at 443. The Illinois Supreme Court determined that the trial court sua sponte should have stopped the argument because it was not relevant and was highly prejudicial. Unlike the prosecutor's argument in Bernette, the prosecutor in this case did not raise the specter of the effects of the crime on the family and did not weave the testimony into the evidence as a whole, thereby suggesting that it was material to Uyesugi's guilt or sanity.\n\nFinally, Uyesugi relies on Territory v. Hays, 43 Haw. 58 (1958), in which this court stated that \"the more heinous the crime, the more care must be exercised by the presiding judge to see that defendant's rights are protected and that prejudicial evidence is not admitted.\" Hays, 43 Haw. at 58. This statement, with which we continue to agree, was made in the context of looking at the record as a whole and admonishing the trial court to reject its impulse to permit the introduction of one-sided evidence. In 1958, a sixteen-year-old female accused Hays of a statutory rape that allegedly occurred between 1949 and 1953. The trial court admitted the complaining witness' testimony, in which she stated that the defendant had sexual intercourse with her several times over a four-year period. Admitted over the defendant's objection was testimony of a physician who examined the complaining witness shortly before the trial began. He testified that the complaining witness was not a virgin, implying that the defendant was responsible for her loss of virginity. The defendant sought to enter evidence tending to prove that the complaining witness had engaged in sexual intercourse with other third parties, which was disallowed by the court. The defendant appealed, arguing, inter alia, that the court erred (1) when it refused to permit the defendant to cross-examine the complaining witness regarding acts of sexual intercourse with others because others may have been responsible for her loss of virginity and (2) in permitting the physician to testify about the state of the complaining witness' virginity six years after the alleged rapes, because her physical state at the time of the trial was not relevant. This court agreed with the defendant and reversed his conviction.\n\nThe principle expressed in Hays is as crucial to a defendant's right to due process today as it was in 1958. Unlike the facts in Hays, however, the record on appeal in this case demonstrates that Uyesugi was able to pursue his defense vigorously. He presented expert testimony and witnesses. There is no evidence that the circuit court permitted the prosecution greater opportunity than Uyesugi to support its theory of the case. We hold that, while it may have been error on the circuit court's part to fail sua sponte to stop the prosecution's potentially prejudicial comments during opening statements and direct examination, we are convinced from the record that Uyesugi's substantial rights were not prejudiced and, therefore, that the circuit court did not commit plain error.\n\nD. The circuit court did not err when it admitted evidence that Uyesugi possessed twenty-four guns not used in the shooting and testimony that detailed the characteristics of each gun, because both were relevant and did not prejudice Uyesugi.\n\nUyesugi argues that the circuit court erred when it admitted evidence of the twenty-four guns not used in the shooting and the testimony of a weapons specialist over defense counsel's objections. He states that, under HRE Rules 403\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e and 404(b),\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e the evidence was unduly prejudicial.\n\n\"[T]he determination of the admissibility of relevant evidence under HRE 403 is eminently suited to the circuit court's exercise of its discretion because it requires a cost-benefit calculus and a delicate balance between probative value and prejudicial effect[.]\" State v. Janto, 92 Hawaii 19, 31, 986 P.2d 306, 318 (1999) (quoting State v. Loa, 83 Hawaii 335, 348, 926 P.2d 1258, 1271 (1996)). This balance is predicated upon an assessment of \"the need for the evidence, the efficacy of alternative proof, and the degree to which the evidence will probably rouse the jury to overmastering hostility.\" State v. Bates, 84 Hawaii 211, 228, 933 P.2d 48, 65 (1997) (quoting State v. Renon, 73 Haw. 23, 38, 828 P.2d 1266, 1273, reconsideration denied, 73 Haw. 625, 858 P.2d 734 (1992)).\n\nUyesugi argues that, although evidence was arguably relevant \"to prove the 'concealability, compactness, firearm and magazine capacity' of the gun,\" such evidence could have been readily obtained by merely examining the gun that was used in the shootings and allowing testimony limited to that gun. The ownership of other firearms would, therefore, be irrelevant. The prosecution argues that the type of gun Uyesugi selected from his arsenal was relevant to demonstrate that Uyesugi could appreciate the wrongfulness of his conduct based upon the complex decision-making involved in choosing a gun that could be concealed, easily reloaded, was lightweight, and was loaded with bullets designed to cause severe destruction to the human body.\n\nThe prosecution's argument is persuasive given both the evidence available and Uyesugi's defense. Uyesugi's primary argument was that he was substantially impaired in his ability to appreciate the wrongfulness of his conduct. Witnesses testifying for the defense focused almost exclusively on Uyesugi's delusional belief system and its interference with Uyesugi's ability to appreciate wrongfulness. The prosecution's evidence was relevant to whether Uyesugi planned and then carried out his plan to kill his co-workers. Uyesugi had belonged to a gun club, was familiar with all types of guns, and had the ability to knowledgeably choose a weapon for his planned purposes. If the prosecution had presented the evidence in the manner proposed by Uyesugi, the jury would not have had all of the relevant facts in its determination whether Uyesugi could appreciate the wrongfulness of his conduct. Thus, the evidence was necessary because it was relevant and there was no alternative evidence available.\n\nUyesugi states that he was prejudiced by the admission of the testimony and the exhibit that contained a picture of the guns because the two pieces of evidence created an overmastering hostility against him. Uyesugi does not really explain this point. He simply states it and then adds that this evidence, combined with the opening statement and testimony of surviving family members, resulted in prejudice. Uyesugi cites a California case for the proposition that the admission of evidence of weapons not used in the crime was improper if they were of no consequence to the determination of guilt. See People v. Archer, 99 Cal. Rptr. 2d 230 (Cal. App. 2000). The Archer court stated that evidence that \"the defendant owned nine other knives was not relevant to show access to such weapons or his need to stockpile knives in order to commit the murder.\" Archer, 99 Cal. Rptr. 2d at 238. The prosecution, in Archer, argued that the evidence was necessary to demonstrate the planning that went into the murder. After dismissing this argument, the court concluded that the trial court had abused its discretion when evidence of the other knives was admitted. The court's reasoning offers little guidance. Like Archer, the evidence in this case failed to demonstrate the relevance of whether Uyesugi had a stockpile or that he needed to stockpile weapons. Unlike Archer, however, whether and how Uyesugi chose the weapon he did was relevant to his state of mind, particularly in light of his defense of lack of penal responsibility.\n\nFurther support for affirmance is found in HRE Rule 103.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Uyesugi had the burden of \"creating an adequate record\" in which he has articulated the flaw in the circuit court's actions. See HRE Rule 103; see also Addison M. Bowman, Hawaii Rules of Evidence Manual § 103-2 at 7-8 (1990). In the absence of an objection and/or a proper record, the admission of the testimony and picture does not amount to plain error. We hold that the circuit court did not commit plain error, when, without objection it allowed introduction of one picture of Uyesugi's firearms and permitted testimony of a weapons expert.\n\nE. Uyesugi fails to establish the necessary facts to successfully assert an ineffective assistance of counsel claim.\n\nUyesugi asserts that his trial counsel provided ineffective assistance because he failed (1) to request an instruction on the law defining \"appreciate\" and (2) to object to the prosecution's opening statement and questioning of surviving family members. Specifically, Uyesugi alleges that the failure to define properly the term \"appreciate\" led the jury to apply an inapplicable legal standard, thereby rendering his defense useless. The remaining issues cited by Uyesugi are addressed collectively and are based on the record as a whole that, according to Uyesugi, caused substantial impairment of his defense. Because the circuit court did not commit plain error in its jury instructions, the jury was unanimous in its verdict, and the opening statements and witness testimony did not prejudice Uyesugi, defense counsel acted within the range of competence demanded of attorneys in criminal cases.\n\nHRPP Rule 40\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e permits the defendant to seek review of common law and statutory procedures invoked before, during, and after trial. In an appeal in which a defendant first makes an ineffective assistance claim, this court has stated that the burden is on the defendant to establish that, based upon all of the circumstances, defense counsel's performance was not objectively reasonable. Briones v. State, 74 Haw. 442, 463-64, 848 P.2d 966, 976-77 (1993). This court has established a two-part test to aid the appellate court in its determination whether the defendant has met this burden. This test requires the \"defendant to show 'specific errors or omissions . . . reflecting counsel's lack of skill, judgment, or diligence' and that 'these errors or omissions resulted in either the withdrawal or substantial impairment of a potentially meritorious defense.'\" Briones, 74 Haw. at 462, 848 P.2d at 976 (quoting State v. Antone, 62 Haw. 346, 348-49, 615 P.2d 101, 104 (1980)). General claims of errors or omissions are not sufficient to trigger review. The defendant must demonstrate that there is no obvious reason for the counsel's conduct \"then the knowledge held and investigation performed by counsel in pursuit of an informed decision will be evaluated as that information that, in light of the complexity of the law and the factual circumstances, an ordinarily competent criminal attorney should have had.\" Id. at 462, 848 P.2d at 976. This rule is further narrowed by the policy of both requiring and permitting lawyers \"broad latitude to make on-the-spot strategic choices in the course of trying a case.\" State v. Samuel, 74 Haw. 141, 156, 838 P.2d 1374, 1381-82 (1992).\n\nUpon a review of the record on appeal, Uyesugi has failed to meet the two-part test. Uyesugi argues that the first prong of the test is met because his trial attorney did not submit instructions on the term \"appreciate.\" This is not so. Defense counsel actually withdrew the instruction it had submitted on this issue. Moreover, the term was properly defined, as noted above in section III.A.1. The jury had the opportunity to listen to two defense witnesses and two rebuttal witnesses on this very point. Defense counsel and the prosecution had the opportunity to put forth their arguments as to whether Uyesugi could appreciate the wrongfulness of his conduct in closing. Because the term \"appreciate\" was accurately defined, there was no substantial impairment in Uyesugi's defense. Uyesugi asserts that failure to object to the opening statements and testimony are further evidence of ineffective assistance. As discussed above, in section III.C., Uyesugi's substantial rights were not violated. Uyesugi has failed to demonstrate that his counsel's performance was not objectively reasonable and that his defense was substantially impaired. Uyesugi has failed to establish an ineffective assistance claim, therefore remand for a HRPP Rule 40 hearing is not necessary.\n\nIV. CONCLUSION\n\nIn light of the foregoing, we affirm the judgment of conviction of the first circuit court.\n\nCONCURRING OPINION BY ACOBA, J., IN WHICH RAMIL, J., JOINS\n\nThe primary issue in this case was whether Defendant-Appellant Byran K. Uyesugi (Defendant) lacked substantial capacity,i.e., an extremely limited capacity, see State v. Nuetzel, 61 Haw. 531, 550-51, 606 P.2d 920, 932 (1980), to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of law. Under the circumstances of this case, the challenged instructions did not result in substantial prejudice to Defendant. In light of the burden on Defendant to prove by a preponderance of the evidence that he lacked substantial capacity and ample evidence that he did not, I believe the errors were harmless beyond a reasonable doubt. Accordingly, I concur in the result reached.\n\nHowever, inasmuch as similar issues will likely arise in future cases, I register my position as it differs from the majority's view on the following matters: (1) the lack of a definition for the term \"appreciate\" in the jury instructions relating to the insanity defense\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e ; (2) the majority's adoption of a subjective/objective test for the term \"wrongfulness\" in the same instruction; (3) the failure to include a jury unanimity clause in the \"insanity\" instruction; (4) the lack of a unanimity requirement in the mitigating manslaughter instruction; and (5) the giving of the manslaughter instruction before the instruction concerning insanity. Because this opinion is published and, thus, establishes precedent in our jurisdiction, see Appendix A attached hereto, the rules of law involved extend beyond this case alone.\n\nI.\n\nThe insanity defense, HRS § 704-400 (1993),\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e precludes responsibility for otherwise criminal conduct if \"the person lacks substantial capacity either to appreciate the wrongfulness of the person's conduct or to conform the person's conduct to the requirements of the law.\" (Emphasis added.). In that regard, the jury was instructed as follows:\n\n[ ] Defendant is not criminally responsible for his conduct if it is more likely than not or more probable than not that, at the time of the charged offense(s) and as a result of a physical or mental disease, disorder or defect, [ ] Defendant lacked substantial capacity either to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of the law.\n\nA person \"lacks substantial capacity\" either to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of the law if his capacity to do so has been extremely limited by physical or mental disease, disorder or defect. The phrase \"lack of substantial capacity' does not mean a total lack of capacity. It means capacity which has been impaired to such a degree that only an extremely limited amount remains.\n\n(Emphases added.) Defendant did not request a definition of the term \"appreciate\" or \"wrongfulness\" as used in HRS § 704-400. However, on appeal, Defendant raises as error the court's failure to define them. The court did advise the jury that \"[u]nless otherwise provided, the words used in these instructions shall be given their ordinary meaning, taken in their usual sense, and in connection with the context in which they appear.\"\n\nIn rendering instructions, trial judges are vested with the responsibility of providing jurors with cogent instructions and definitions to ensure that a jury will consider a case in a logical and intelligent manner. See State v. Kinnane, 79 Hawaii 46, 50, 897 P.2d 973, 977 (1995). Thus, it is the role of the court, not the witnesses or the parties, to provide the pertinent definitions of law to the jury so that the jury may properly apply the facts to the law. Indeed, the court's responsibility includes acting \"'as the jury's guide to the law.'\" State v. Kupau, 10 Haw. App. 503, 514, 879 P.2d 559, 564 (1994) (quoting People v. Wickersham, 650 P.2d 311, 319 (Cal. 1982), overruled on other grounds by People v. Barton, 906 P.2d 531, 539 (Cal. 1995)). This principle governs our overview of a trial court's instructions.\n\nII.\n\nA.\n\nIn that regard, this court reviews jury instructions given by the trial court to determine whether \"when read and considered as a whole, the instructions given are prejudicially insufficient, erroneous, inconsistent or misleading.\" State v. Valentine, 93 Hawaii 199, 203, 998 P.2d 479, 483 (2000). Inasmuch as several experts testified as to different meanings of the term, it would have been preferable for the court to have instructed the jury as to the definition of \"appreciate.\" Under other circumstances, the failure to do so may constitute reversible error.\n\nThe prosecution and its witnesses defined \"appreciate\" in terms of Defendant's ability to know right from wrong. To illustrate the point, prosecution expert witness Dr. Thomas Cunningham, indicated that, \"[i]n a case like this, [he] generally look[s] for certain types of evidence that would indicate that a person is not able to recognize the difference between right and wrong.\" Similarly, Dr. James Tom Greene, another prosecution expert, testified that, \"[o]n the test I gave [Defendant], he's clear. There's absolutely no bad judgment. . . . Judgment has to do with the ability to differentiate and determine a right from wrong behavior.\" Dr. Leonard Jacobs, also testifying for the prosecution, related that he did not \"find anything that satisfied [him] that [Defendant] in fact did not know right from wrong[.]\" During cross-examination, Dr. Jacobs further clarified that, as he understood the term, \"appreciate\" means \"to know.\" In addition, a prosecution rebuttal witness, Dr. Harold Hall, defined \"appreciate\" as \"to know or to realize[,]\" although during cross examination he conceded that \"appreciate\" \"goes beyond a simple knowing what's legally right or wrong[.]\" Similarly, another prosecution expert witness, Dr. Michael Welner, testified that \"appreciate\" meant \"to recognize[.]\"\n\nContrastingly, the defense experts testified that \"appreciate\" essentially means \"to accurately weigh.\" Dr. Park Dietz clarified that \"[a] person can know that something is right or know that it is wrong. To appreciate how wrong something is means that things vary in how wrong they are, and an individual needs to be able to gauge the severity, the degree of wrongfulness of some action.\" Dr. Dietz concluded that, under Hawaii law, Defendant was insane because, \"although he knew that it was against the law to do it and he knew it was wrong, because of his illness, he could not accurately estimate how terrible what he did was.\"\n\nDr. Daryl Matthews, another defense expert witness, similarly testified that he \"take[s] the term appreciate to mean to be able to set a right value on it to be able to accurately appraise a situation.\" Defense witness Dr. Robert Marvit also defined \"appreciate\" as being able to weigh the significance of something, by explaining that \"[s]o to appreciate means being able to look beyond some kind of narrow focus of either or, good or bad, right or wrong, this or that. It's being able to look at the consequence of a behavior.\"\n\nB.\n\nThe term \"appreciate\" is not defined by statute.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e This court may \"resort to legal or other well accepted dictionaries as one way to determine the ordinary meaning of certain terms not statutorily defined[.]\" State v. Kalama, 94 Hawaii 60, 63 n.6, 8 P.3d 1224, 1227 n.6 (2000) (internal quotation marks and citation omitted). The common definition of the term \"appreciate,\" taken in its usual sense, is \"to grasp the nature . . . or significance of.\" Miriam Webster's Collegiate Dictionary 57 (10th ed. 1993). Thus, an appropriate jury instruction, in the context of an insanity defense instruction, HRS § 704-400(1), would also have defined the term \"appreciate\" as the ability to grasp the nature or significance of the wrongfulness of the defendant's conduct.\n\nC.\n\nHere the court informed the jury that it was to apply words in their usual sense in the context in which they were used. The term \"appreciate,\" as it is employed in HRS § 704-400(1), is consonant with the common meaning attributed to it. See discussion infra, section II.D. The court also advised the jury that the opinions of the experts and, thus, presumably their views of the word appreciate, were not binding on the jury.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e In light of this, and considering the other instructions, the absence of an instruction defining \"appreciate,\" under the circumstances of this case, did not render the instructions given \"prejudicially insufficient, erroneous, inconsistent or misleading.\" Valentine, 93 Hawaii at 203, 998 P.2d at 483.\n\nD.\n\nThe ordinary reading given to the term \"appreciate\" is supported by legislative history. Hence, the view that \"appreciate\" simply means to distinguish between right and wrong has been rejected by our legislature. This court had earlier stated that under the so-called \"right/wrong test,\" or M'Naghten Rule, for establishing insanity, the defendant must prove that he or she was mentally or physically incapacitated so \"as not to know the nature and quality of the act he was doing; or, if he did know it, that he did not know he was doing what was wrong.\" State v. Moeller, 50 Haw. 110, 114 n.5, 433 P.2d 136, 140 n.5 (1967) (quoting M'Naghten's Case, 10 Clark \u0026 Fin. 200, 210, 8 Eng. Rep. 718 (1843)). Subsequent to Moeller, the legislature concurred that the M'Naghten rule was outdated. See Hse. Stand. Com. Rep. No. 227, in 1971 House Journal, at 785 (agreeing with the Hawaii Supreme Court in Moeller that the M'Naghten rule was not in \"accord with the enlightened state of modern medicine and psychiatry.\").\n\nIt adopted the American Law Institute (A.L.I.) \"substantial capacity\" formulation of the insanity definition instead, see Commentary to HRS § 704-400(1), that is that a \"defendant is not criminally responsible for his acts if he lacks substantial capacity either to appreciate the wrongfulness of the person's conduct or to conform the person's conduct to the requirements of the law.\" See also Nuetzel, 61 Haw. at 536, 606 P.2d at 924 (noting that the A.L.I. insanity definition was a more \"realistic\" formulation and that it \"conforms with the practical experience of psychiatrists[.]\"). Thus, a construction of the term appreciate as merely referring to knowing right from wrong would oversimplify its meaning.\n\nIII.\n\nA.\n\nWith respect to Defendant's contention that the court should have instructed the jury on the term \"wrongfulness,\" the majority apparently concludes that Defendant would be entitled to receive a specific definition as to that term if he had established \"the dual components of knowing that the conduct in question is criminal and honestly but mistakenly believing that conduct to be morally justified.\" Majority opinion at 23 (citing State v. Wilson, 700 A.2d 633, 643 (Conn. 1997) (emphasis added). In embracing both the majority and concurring positions in Wilson, the majority devises its own subjective/objective test for the term \"wrongfulness.\"\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e However, the majority decides in this case that an instruction is unnecessary because \"[Defendant did not] adduce[] sufficient evidence at trial to entitle him to a specific instruction on this point\" because \"[a]t trial, [Defendant]'s experts never testified that [Defendant] believed his conduct to be morally justified.\" Majority opinion at 25. Of course, at the time of this trial the rule set forth in Wilson, its grounding in a \"moral justification\" explanation, and nomenclature to that effect was not adopted in this state.\n\nB.\n\nWhile the defense expert witnesses may not have discussed Defendant's conduct expressly in terms of moral justification, they suggested that Defendant believed he was morally justified in his acting as he did. For example, Dr. Dietz testified that \"[i]t's [his] opinion that [Defendant] was not capable of accurately gauging how wrong his actions were the day that he killed th[ose] seven people.\" (Emphasis added.) Dr. Dietz also referred to Defendant's belief \"that because of all that had been done to him on purpose and maliciously putting him and his family at risk, ruining the only peace he had, that they all deserved to die.\" Dr. Matthews opined that \"[Defendant] could not adequately appreciate [the decedents] as people. And his view of them were so distorted by his delusions that he couldn't appreciate the wrongfulness of his conduct.\" Moreover, Dr. Marvit determined that there was evidence \"that [Defendant] was not only misperceiving reality, but reacting to the misperception of reality\" and thus \"to this day, [Defendant] has maintained a belief system . . . in terms of [a] lack of . . . belief that anything that was done was, in fact, inappropriate.\"\n\nThus, under Wilson, the defense in this case offered \"sufficient evidence from which a jury reasonably could have found, by a preponderance of the evidence, that due to a mental disease [disorder] or defect, . . . [D]efendant misperceived reality and, in acting on the basis of that misperception, did not substantially appreciate that his actions were contrary to societal morality[.]\" Wilson, 700 A.2d at 645 (citation omitted). Hence, following the majority's view, the court should have provided the jury with an instruction concerning the majority's subjective/objective standard. The presence of evidence to the contrary adduced by the prosecution would not preclude such an instruction. See id. at 645 (explaining that, where there was evidence that the defendant the did not substantially appreciate that his actions were immoral, other evidence showing the defendant was motivated by simple retribution \"goes to the weight of the defendant's proof, and not to whether the defendant was entitled to a jury instruction correctly defining the term 'wrongfulness.'\").\n\nIV.\n\nIn contrast to the majority, I do not believe the term \"wrongfulness\" needs be defined so as to include the situation in which a defendant suffers under the delusion that he was morally right. The term \"wrongfulness\" itself precludes a meaning restricted only to criminal conduct.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e If it were otherwise, this cognitive prong of HRS § 704-400(1) would have been couched in terms of \"unlawfulness,\" as the second \"volitional\" prong of the substantial capacity test states (\"or to confirm the person's conduct to the requirements of the law\").\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e Wrongfulness is a noun form of \"wrongful.\" \"Wrongful\" means \"full of or characterized by wrong: unjust or unfair.\" Random House Collegiate Dictionary at 1521 (rev. ed. 1984).\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e The definition of wrongful as unjust or unfair is widely understood and broad enough to enable a jury to comprehend that a delusion, whether based on a mistaken moral justification view or some other false perception that was acted upon by a defendant, is subsumed by the term.\n\nA \"delusion\" is a \"false personal belief based on incorrect inference about external reality and firmly maintained in spite of incontrovertible and obvious proof or evidence to the contrary[.]\" Dorland's Illustrated Medical Dictionary 355 (25th ed. 1981); see Diagnostic and Statistical Manual of Mental Disorders §297.1 at 323-24 (4th ed. 2000) (defining the different criteria for a \"delusional disorder\" and noting that it may result in \"substantial\" impairment). A delusion relied on by a defendant as an excusing psychiatric condition would plainly be encompassed in the term wrongfulness.\n\nDelusions, obviously, need not be based only in a fixed immutable view of moral correctness. The failure to appreciate the wrongfulness of one's conduct may arise from a delusion that does not necessarily rest on moral justification grounds. In positing that its specific wrongfulness test and instruction is intended to account for cases in which the defense is based on an overweening belief in moral superiority, the majority impliedly restricts the concept of wrongfulness. I would not so limit its breadth. To define wrongfulness further would simply produce confusion and intrude on the evidence. For, proving or disproving the capacity to appreciate wrongfulness in a particular case would assumably encompass all pertinent psychological disorders relevant to that case, including delusions, whether the delusion rested on a mistaken belief that the defendant's conduct was morally correct or some other false belief not rooted in some moral rationalization.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nThe necessity for a specific instruction was lacking in this case. There was no dispute in recognizing a delusion as a mental disorder. During trial, both the prosecution and defense arrived at a common understanding of the concept consistent with the accepted description of the condition.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e See Dorland's Illustrated Medical Dictionary 355 (25th ed. 1981). Similarly, there was no disagreement that Defendant's delusion was relevant to proving or disproving Defendant's defense of lack of capacity. At trial, a total of eleven psychologists and psychiatrists testified that Defendant suffered from \"delusions and hallucinations.\"\n\nHence, as this case demonstrates, the question of wrongfulness as it relates to a mental disease, disorder, or defect is fact based and case specific, resting on the content of the evidence and expert opinions in any particular case. Thus, no further definition of the term wrongfulness would be appropriate in this case.\n\nV.\n\nIn my view the conclusion that error, if any, was harmless also rests on the burden of proof placed on Defendant. The phrase \"substantial capacity\" in HRS § 704-400 is deliberately imprecise, because of the need for flexibility in evaluating the particular facts and circumstances of each case. See Commentary on HRS §704-400 (\"An expert witness, called upon to assess a defendant's capacity at a prior time . . . , can hardly be asked for a more definitive statement even in the case of extreme conditions.\" (Citations omitted.)).\n\nIn Nuetzel, 61 Haw. at 536, 606 P.2d at 924, a pre-affirmative defense case, this court held that a jury instruction defining \"lack of substantial capacity\" as \"capacity which has been impaired to such a degree that only an extremely limited amount remains\" was acceptable in view of the rationale of HRS § 704-400.\" Id. at 548, 606 P.2d at 930. Acknowledging that it was difficult to define \"substantial\" \"with any degree of precision[,]\" Nuetzel noted that the A.L.I. test was designed to encourage \"maximum informational input from the expert witnesses while preserving to the jury its role as trier of fact[.]\" Id. at 549, 606 P.2d at 931.\n\nAccordingly, the \"degree of 'substantial' impairment required is essentially a legal rather than a medical question[,]\" id. at 549-550, 606 P.2d at 931 (quoting State v. Johnson, 399 A.2d 469, 477 (R.I. 1979)) and \"[b]ecause impairment is a matter of degree, the precise degree demanded is necessarily governed by the community sense of justice as represented by the trier of fact.\" Id. Thus, in Nuetzel, the term \"extremely limited\" used by the trial court \"conveyed the necessary meaning of the word \"substantial[.]\" Id. at 550, 606 P.2d at 932.\n\nAs Defendant notes, in an instruction, the court defined \"lacks substantial capacity\" as \"extremely limited amount\" as approved in Nuetzel. Additionally, under HRS § 704-402 (1993),\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Defendant had the burden of proving the insanity as an affirmative defense. See State v. Miller, 84 Hawaii 269, 277, 933 P.2d 606, 614 (1997) (noting that this statute was amended to make the insanity defense an affirmative one). Thus Defendant was required to establish, by a preponderance of the evidence, that he had only an \"extremely limited\" capacity. Applying these instructions, the jury was given wide discretion in determining whether Defendant lacked the requisite degree of capacity.\n\nVI.\n\nA.\n\nWith regard to the court's unanimity instructions, I concur that \"the jury instructions, as given, did not contribute to [Defendant]'s conviction.\" Majority opinion at 34. However, I differ on the rationale to reach this conclusion.\n\nThe court's general instruction as to the affirmative defense of insanity was arguably misleading insofar as it did not itself direct that, to convict Defendant as charged, the jury was required to unanimously reject that defense. Specifically, the instruction read, in part:\n\nYou must return a verdict of not guilty by reason of physical or mental disease, disorder or defect which excludes criminal responsibility if you find by a preponderance of the evidence, that is, that it is more likely or more probable than not, that, at the time of the charged offense, 1) [ ] Defendant was suffering from a physical or mental disease, disorder, or defect, and 2) that as a result of such physical or mental disease, disorder, or defect, he lacked substantial capacity either to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of the law.\n\nIf [ ] Defendant has proved both of these elements by a preponderance of the evidence, then you must find [ ] Defendant not guilty of the offense(s). If [ ] Defendant has not proved both of these elements by a preponderance of the evidence, then you must find that this defense does not apply.\n\n(Emphases added.)\n\nAdvisedly, the court should have instructed the jurors that, if they were not unanimous in their rejection of the insanity defense, then a verdict should not be returned. See State v. Miyashiro, 90 Hawaii 489, 499, 979 P.2d 85, 95 (App. 1999) (explaining that \"if the jurors unanimously agreed that all the elements of the charged offense have been proved beyond a reasonable doubt but are unable to reach unanimous agreement as to the affirmative defense of entrapment, no unanimous verdict can be reached as to the charged offense . .. [and] a mistrial would have to be declared\"); Hawaii Pattern Jury Instructions (HAWJIC) 7.06 (general affirmative defense pattern instruction advising, in part, that, if jurors are not unanimous with regard to the proof of the affirmative defense, \"then a verdict may not be returned\"); HAWJIC 7.07 (insanity pattern instruction mirroring, in part, unanimity paragraph in HAWJIC 7.06).\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nHowever, the use of the phrases, \"you must return,\" \"you must find,\" and \"if you find\" in the elements instruction for the insanity defense imparted a direction collectively to the jury itself. As set forth supra in this instruction, the jury was told that \"if the Defendant had not proved both of these elements . . . then you must find that this defense does not apply.\" (Emphasis added.) Whereas \"you,\" as reasonably understood in the instruction, referred to the jury itself, the instruction directed that the declination of Defendant's insanity defense must be a unanimous one.\n\nAlso, in arriving at decisions as to the possible outcomes to be considered by the jury, the collective connotation of the word \"you\" as referring to the jury as a body was reinforced in the instruction setting forth the several options on the verdicts for each count.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e After listing the possible verdicts, the court cautioned, \"Your verdicts must be unanimous.\" (Emphases added.)\n\nWhile not reversible error in this case, the preferable and appropriate manner of instructing as to the insanity defense or any affirmative defense is as set forth in Miyashiro and incorporated in HAWJIC 7.06 and 7.07. Trial courts, therefore, should, in all cases, adhere to these precepts.\n\nB.\n\nAdditionally, I do not read the majority opinion as stating that the Miyashiro holding is limited to the facts in that case. The majority states that \"[Defendant] completely ignores that part of the Miyashiro reasoning that expressly states that it was not the instructions, standing alone, that were prejudicially insufficient or misleading, but was the circuit court's answer to the jury communication in conjunction with the instructions that resulted in the plain error.\" Majority opinion at 33.\n\nWhile I agree that the facts of this case differ from those of Miyashiro, Miyashiro should not be read to mean that a court's failure to include a unanimity clause in an affirmative defense instruction was only prejudicial under the facts of Miyashiro (i.e., where a court's answer to a jury communication suggested that a split vote on an affirmative defense would result in a conviction of the crime charged).\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e In fact, Miyashiro is not so narrow and advises judges that they should instruct jurors on affirmative defenses in a manner that specifically states that unanimity is required. See id. at 500 n. 13, 96 n. 13.\n\nVII.\n\nWhile it was not correct, we are not required to dwell on the court's instruction on the mitigating defense of emotional disturbance manslaughter [hereinafter manslaughter]. I note that that instruction similarly did not direct the jury that its decision on such a defense must be unanimous; the court's failure to do so should not be viewed as correct.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e See State v. Yamada, No. 22456, 2002 WL 31521572 (2002) (Acoba, J., concurring) (As \"[c]riminal defendants are entitled to a unanimous verdict under the Hawaii Constitution and pursuant to court rule[,]\" a court is required \"to inform the jury that it must unanimously agree the prosecution had failed to disprove the manslaughter defense beyond a reasonable doubt.\")\n\nNowhere in the manslaughter defense instruction did the court advise the jury that it needed to be unanimous with regard to the proof of the defense. The instruction, standing alone, would have allowed the jury to convict Defendant of manslaughter without a unanimous decision. Absent unanimity, the jury would have been hung, entitling Defendant to a mistrial. See Yamada, 2002 WL 31521572 *21 (Acoba, J., concurring) (without unanimity \"the jury should have hung, entitling Defendant to a mistrial\").\n\nHowever, as in the instruction on insanity, the court referred throughout the instruction to \"you,\" reasonably conveying that the mandate involved applied to the jury as a whole. Of course, the preferable and appropriate manner of instructing the jury on manslaughter is to expressly set forth that the decision of the jury must be unanimous with respect to the proof or disproof of this mitigating defense, and trial courts should so instruct in every case.\n\nIn any event, the court's instructions, as a whole were not prejudicially erroneous. The manslaughter instruction advised the jurors that the prosecution bore the burden of proving beyond a reasonable doubt that Defendant was not under the influence of extreme mental or emotional disturbance at the time he committed the acts. See State v. Maelega, 80 Hawaii 172, 178, 907 P.2d 758, 764 (1995) (explaining that manslaughter instruction was prejudicially erroneous because it suggested that the defense, not the prosecution, bears burden of proof). The court further directed that if the prosecution had \"done so, then [the jury] must return a verdict of guilty of murder in the first degree.\"\n\nIn this connection, the jury was also told that in order to return a verdict of guilty of murder in the first degree or attempted murder in the second degree, its verdict must be unanimous. Because the jury returned verdicts of murder in the first degree and attempted murder in the second degree under the direction that such verdicts must be unanimous, a fortiori it had to have determined that the prosecution had proved beyond a reasonable doubt that Defendant was not acting under extreme mental or emotional distress. See State v. Webster, 94 Hawaii 241, 248, 11 P.3d 466, 473 (2000) (\"A jury is presumed to follow the court's instructions.\" (Citations omitted.)).\n\nVIII.\n\nI also observe that the court did not instruct the jury with regard to the order in which it was to consider the defenses of insanity and emotional disturbance. The court's instructions suggested that the insanity defense was to be considered after the emotional disturbance mitigating defense.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\n\"[T]he jury was required to decide the insanity defense which would exclude responsibility for first degree murder, before proceeding to consider the mitigating defense of manslaughter,\" Yamada, 2002 WL 31521572 at *20 (Acoba, J., concurring), inasmuch as the insanity defense completely negates guilt, while the emotional disturbance defense only mitigates guilt. See id.; State v. Nizam, 7 Haw. App. 402, 407 n.4, 771 P.2d 899, 904 n.4 (1989) (\"[Section] 704-402 (1985) delineates the affirmative defense of physical or mental disease, disorder or defect excluding responsibility.\"), cert. denied, 70 Haw. 666, 796 P.2d 502 (1989); State v. Aganon, 97 Hawaii 299, 302, 36 P.3d 1269, 1272 (2001) (referring to the emotional disturbance manslaughter defense as a \"mitigating defense\"). Thus, because proof of the defense of insanity could result in a not guilty verdict, the jury must consider that defense before the emotional disturbance defense. That being said, in light of the fact that the jury found Defendant guilty as charged, it cannot be concluded that any error in the court's instructions with regard to the order in which the defenses were to be considered was prejudicial.\n\nIX.\n\nFor the foregoing reasons, I concur.\n\nAPPENDIX A\n\nThe lack of published opinions of this court has been cited as a \"problem\" by the legal community. See Report of the [Hawaii] AJS Committee Reviewing Unpublished Opinions at 4 [hereinafter, \"the Report\"] and discussion infra. Views regarding that issue have been largely relegated to unpublished opinions, which are generally unavailable. Accordingly, I have included the following discussion as part of my concurrence. See N.K. Shimamoto, Justice is Blind, But Should She be Mute?, 6 Hawaii B.J. 6, 7 (2002) [hereinafter Justice is Blind] (\"The publication debate is currently a catch-22 for some judges and justices: if a judge or justice believes that an opinion should be published, and it is, there is no dispute over publication; if, however, a judge or justice believes that an opinion should be published, and the majority votes not to publish, then the judge or justice's work product (including why that particular case should be published) is simply relegated to a dissent or concurrence in an unpublished opinion.\" (Italicized emphases in original.)).\n\nI.\n\nIt is in the nature of stare decisis that, when this court in effect decides matters of first impression, we in fact establish precedent and, therefore, should publish our opinion. When we fail to publish, we depart from the established procedure which lends legitimacy to our decision-making process and also neglect our responsibility to provide guidance to courts, attorneys, and parties. The import of such an act is to make law for one case only, singling it out from all others, a process that can only be described as arbitrary. When there are fundamental reasons for publishing and we are given the opportunity to do so but fail to, we also compel our trial courts and counsel to rely on and employ the precedent established in other jurisdictions when trying cases in our own state.\n\nII.\n\nUnless we publish questions presented to us, they will continue to go unaddressed in any authoritative manner, and error may compound in other, similar cases leaving counsel and the trial courts to guess at the law to apply. Therefore,the fact that a majority of the court votes not to publish should not be determinative of the publication question. It is in the order of case law development that discourse on issues not covered in any existing published opinion should be disseminated and made available for examination, consideration, and citation by those similarly affected or interested. Only in the light of open debate can the dialectic process take place, subject to the critique of the parties, the bar, the other branches of government, legal scholars, and future courts. The resulting process of analysis and critique hones legal theory, concept, and rule.\n\nConsequently, it should not matter whether such discourse is set forth in a majority, concurring, or dissenting opinion. Justice Ramil has suggested adoption of a rule like that of the First Circuit Court of Appeals that would require publication of a case (1) when the case is unanimously decided by a single opinion without a dissent, if, \"[a]fter an exchange of views,\" any single justice votes for publication; or (2) with \"a dissent or with more than one opinion[,] . . . unless all participating judges decide against publication.\" Doe v. Doe, 99 Hawaii 1, 15, 52 P.3d 255, 269 (2002) (Ramil, J., dissenting, joined by Acoba, J.) (quoting United States Court of Appeals of the First Cir. R. 36(b)(2)). See, N.K. Shimamoto, Justice is Blind,supra at 12 (Adoption of a \"'one justice publication' rule, unlike the 'majority rules' rule, faithfully abides by the premises upon which SDOs and memorandum opinions were based, promotes judicial accountability, and facilitates a judge or justice's role in the legal system -- without sacrificing judicial economy.\"). Similar rules have been adopted in other jurisdictions.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\n\nIII.\n\nJustice Ramil and I have agreed and will continue to agree to any recommendation by any of the other justices to publish a case even if the majority will not adhere to such a policy. We do so because we support and respect the opinion of any one of our colleagues that a decision warrants publication and that the views raised in the opinion should be disseminated. This is not an automatic and blind decision, but, instead, the recognition that every member of the judiciary, chosen to sit on the bench because of his or her expertise, has distinct and valuable viewpoints to offer in each case. Simply put, disagreement with a justice should not be a reason to limit the reach of that justice's comments. See N.K. Shimamoto, Justice is Blind, supra, at 7 (\"A glance back through time reminds us that not only is this a country founded on the belief that we can voice our opinions against the majority, but that we have on numerous occasions embraced those opinions in the wisdom of a future day.\")\n\nIV.\n\nBy contrast with the \"one justice\" rule suggested by Justice Ramil and which had once been the custom of this court,\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e the current \"policy\" in this court follows a \"majority rules\" approach, which the majority insists is the better course. The majority appears to assert that publication guidelines other than \"majority rules\" would result in our appellate process grinding to a halt. With all due respect, I submit that the majority's arguments against any one justice of this court calling for the publication of a particular case miss the mark.\n\nWe favor the use of summary disposition orders for the vast majority of cases in which they are currently appropriately utilized. Numerous such orders have been filed which we have signed. We also do not propose that every case in which a dissenting or concurring opinion is filed necessarily requires publication. A number of summary disposition orders have been filed with a separate opinion.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e We did not urge that these cases be published, as we do here.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\nWe believe that in some cases, however, a decision must be published. Guidance to litigants and the trial courts would be provided, where none exists. The analysis would be available by litigants for citation in pending or subsequent cases. The public and the legal community would be informed of the developing law in this area.\n\nBy ignoring, as it does, the views of other justices after a simple majority is obtained, the majority invites avoidable error. As we must all concede, error will occur under any system; the relevant inquiry is on which side error would weigh the least. I submit that there is more to be gained in a jurisprudential sense, and in the present legal milieu, from a policy which shares the decision to publish with each justice.\n\nV.\n\nLong-term dangers lurk in the silencing of discourse and debate. It has been found that unpublished opinions too easily hide hidden agendas or a lack of reasoning behind an opinion. See M.H. Weresh, The Unpublished, Non-Precedential Decision, 3 J. App. Prac. \u0026 Process 175, 181 (2001) (\"The foremost [criticism of unpublished decisions] appears to be the arguable effect the practice has on judicial accountability.\"). Moreover, a rule that grants a majority of justices the power to determine that a case will not be published serves to quash the alternative views expressed in a dissenting or concurring opinion. See M. Hannon, A Closer Look at Unpublished Opinions, 3 J. App. Prac. \u0026 Process 199, 221 (2001) (\"[T]he existence of dissenting opinions in unpublished opinions cuts against the premise that unpublished opinions are used only in 'easy' cases. . . . [C]ases containing dissents and concurrences are, by definition, controversial[.]\" (Internal quotation marks and citations omitted.)); S.L. Wasby, Unpublished Decisions in the Federal Courts of Appeals: Making the Decision to Publish, 3 J. App. Prac. \u0026 Process 325, 329 (2001) (discussing a 1989 report which reflected findings \"that a significant portion of non-unanimous rulings [in the Eleventh Circuit] were not published, [and] that the ideology of judges . . . played a role in what got published\" and which concluded that \"publication of opinions in the Eleventh Circuit is much more subjective than the circuit courts would have us believe.\" (Internal quotation marks and citation omitted.)).\n\nA majority's decision not to publish an opinion can be wielded as a punitive measure against those justices choosing to dissent, or who question the majority rule. See, e.g., People v. Para, No. CRA 15889, slip op. at 34 (Cal. Ct. App. Aug. 1979) (Jefferson, J., dissenting) (objecting to the majority's reversal of its earlier decision to publish a case after the dissenting opinion had been circulated). Such dangers are not hypothetical, but pose real threats to the integrity and efficacy of this court's institutional role in a democratic system.\n\nVI.\n\nBut nothing highlights the inefficacy of the \"majority rules\" approach to publication or undermines the majority's rationalization of its position more than the proposal submitted to this court to amend HRAP Rule 35 to permit (1) citation to unpublished opinions as persuasive authority and (2) petitions for publication of unpublished cases. On June 14, 2002, the Hawaii Chapter of the AJS submitted the Report to the justices of the Hawaii Supreme Court for our consideration. The proposal recommends that this court adopt an amendment to HRAP Rule 35,\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e because \"[t]here is a problem perceived by the legal community with the continued use of summary disposition orders and, particularly, the inability to cite memorandum opinions despite the fact that these opinions appear to be of substantial length and content and often cite other case law as precedent for the conclusions.\" The Report at 4 (emphasis added). The consequences of not publishing have thus become a concern to the bench and the bar. A core function of this court is to interpret the law, to set forth our analysis, and to announce it for the education and guidance of the public. We abandon that function when we take a crabbed view of publication.\n\nVII.\n\nThe dissatisfaction with the number of unpublished opinions is also one reason why the State legislature was prompted to authorize two additional judges on the Intermediate Court of Appeals (ICA) level. The 1996 backlog is reflective of a fundamental lack of resources. In 2001, the legislature authorized two additional judges to be appointed to the ICA, in view of the appellate case load. See 2001 Haw. Sess. L. Act 248, § 1, at 646 (amending Hawaii Revised Statutes (HRS) § 602-51 to indicate that the number of judges on the ICA would be increased by two). In considering whether such a measure was necessary, the legislature viewed the additional judges as one remedy for the burgeoning use of summary disposition orders, which apparently prompted some parties \"to question whether [they were] getting due process[]\":\n\nAttempts to deal with the appellate case load have evolved into procedures and processes that have been viewed as controversial, causing some litigants to question whether the parties are getting due process. For example, a large number of cases were decided by summary disposition orders instead of opinion, and oral argument has become rare. . . . [I]f the State is to maintain an effective appellate justice system that disposes of cases in a timely manner and provides litigants with a fair hearing process, the number of ICA judges must be increased.\n\nStand. Comm. Rep. No. 1460, in 2001 House Journal, at 1495 (emphasis added). The legislators further indicated that such a measure would \"improve the functioning and efficiency of the appellate judicial process.\" Conf. Comm. Rep. No. 166, in 2001 House Journal, at 1129.\n\nHowever, as for funding for the two ICA judicial positions, the legislature reported that \"[t]he Judiciary also testified that no appropriation is needed for the 2001-2002 fiscal year.\" Conf. Comm. Rep. No. 166, in 2001 House Journal at 1129. \"[T]his bill will allow the Judiciary to begin the process of recruiting two new judges for the ICA. It is the intent of your Committee that no new additional funds be provided for this purpose for fiscal year 2001-2002.\" Stand. Comm. Rep. No. 976, in House Journal at 1495. The determination of whether these two ICA positions could have been funded under past or present judiciary budgets or at what point requests for legislative appropriations should be made is obviously subject to the exercise of the judiciary administration's discretion.\n\nThe reports also indicate that \"[t]estimony of the Judiciary on this measure in this session indicated that expansion of the intermediate court is preparatory for later reorganization of the appellate system, which could be the subject of bills for the 2002 Session.\" Conf. Comm. Rep. No. 166, in 2001 Senate Journal at 944. A search of the 2002 legislative bills has not revealed any such reorganization plan.\n\nWhat is stated is from the public record and we certainly do not intend to misrepresent the record. We are not privy to internal administrative decisions made by the judiciary administration. Obviously, we wholeheartedly agree with any and all efforts made to expand the current number of judges on the ICA.\n\nVIII.\n\nAny implication that the adoption of a one-justice rule would have a far-reaching adverse impact in criminal cases, child custody and parental termination cases, and for business and property owners in civil cases, would be a decidedly exaggerated one. A one-justice rule would not result in a rash of publication requests or a significant delay. The \"one justice\" approach has been adopted and implemented in many jurisdictions. Taking into account the expertise of all members of this court regarding the necessity of clarifying the law in any area makes the best use of our collective judicial wisdom.\n\nIt is evident that the number of cases on appeal, and the resulting hardship faced by litigants, may be in part due to the lack of clear legal precedent in an area of practice. Non-meritorious appeals are pursued by litigants when the law is murky, because the result is unpredictable. Thus, by not publishing and clarifying the law when such need is evident, we contribute to the uncertainty, and, thus, contribute to our backlog.\n\nIX.\n\nThe possibility of unintended consequences resulting from establishing precedent should not, in my view, alter publication when warranted. We cannot hide behind the fear that, in deciding a case, we may be creating precedent. That is the nature of our common law system. See Anastasoff v. United States, 223 F.3d 898, 904-05 (noting that the common law doctrine of precedent directed that all cases decided contributed to the common law, and, thus, retained precedential value, even if those cases were not \"published\" in official reporters), vacated as moot on other grounds, 235 F.3d 1054 (8th Cir. 2000) (en banc). Common law is developed through the accumulation of cases, allowing application of rules of law to varying factual situations. A rule of law changes and is refined as time and the circumstances warrant, or may be abandoned altogether. If a case is fraught with contingent problems, it is our job to see to it that our decisions have the clarity and foresight to convey the effect intended, not to take refuge in the expedient cover of an unpublished decision.\n\nFurthermore, as the court of last resort in this state, we are duty bound to decide hard issues presented to us and to render our best judgment in all cases. To allow a concern for unintended consequences to govern our decisions is to abandon our common law tradition altogether. To remain silent because we are afraid of what we might say undermines our role as the highest state court and the reason that we are here.\n\nX.\n\nA.\n\nThe Judiciary's website, is not the answer, and the fallacy of arguing it is, is transparent. If the searcher knows the specific name and date of filing of the case, the case can be located among numerous dispositions, including orders, listed chronologically and grouped by year and month, by date of decision. See State of Hawaii Judiciary, Hawaii Appellate Court Opinions and Orders, at http://www.state.hi.us/jud/ctops.htm (last updated Aug. 14, 2002). However, researching is another matter, entirely. The research capabilities are extremely limited, if not practically non-existent. The Judiciary home page is a repository of our recent dispositions; it is not a research tool.\n\nB.\n\nIn any event, the reality is that, primarily, only published opinions are considered by lawyers and judges in researching the law with respect to a point of law or a specific issue. Only those dispositions that are accessible via the seventeen established case law search engines, such as found in the reporter system, are used by this state's Judiciary. The \"publication by majority\" rule then, for all practical purposes, suppresses dissenting and concurring theories from that body of law that would be consulted in any serious inquiry.\n\nC.\n\nAdditionally, because the current HRAP Rule 35 prohibits citation to unpublished opinions, when a majority of this court votes against publication of a case, the dissenting and concurring opinions in those cases cannot be cited as authority by attorneys who hope to urge a similar view or a reexamination of a majority position, or by attorneys and trial judges who consider the separate opinions helpful in deciding related issues. Ultimately, in those situations, the value of dissenting and concurring opinions to practitioners and judges is nil.\n\nXI.\n\nLimited resources and a backlog do not warrant summary disposition of cases that should be published. This concept was recently expressed by the Eighth Circuit Court of Appeals, which strongly objected to the over-use of non-published cases as a panacea for judicial backlog and emphasized our obligation to spend the time necessary to do a competent job on each case:\n\nIt is often said among judges that the volume of appeals is so high that it is simply unrealistic to ascribe precedential value to every decision. We do not have time to do a decent enough job, the argument runs, when put in plain language, to justify treating every opinion as a precedent. If this is true, the judicial system is indeed in serious trouble, but the remedy is not to create an underground body of law good for one place and time only. The remedy, instead, is to create enough judgeships to handle the volume, or, if that is not practical, for each judge to take enough time to do a competent job with each case. If this means that backlogs will grow, the price must still be paid.\n\nAnastasoff, 223 F.3d at 904 (emphasis added). Also, as one Court of Appeals judge has noted with regard to various plans in response to a growing backlog in the federal courts,\n\n[t]he frequently noted solution of reducing our caseload could reverse a series of salutary developments. The heavier caseload in large part reflects better access to the courts and more legal protections and benefits for less-favored members of society. I resist any wholesale surrender of these hard-fought victories to \"reformers\" rallying under the banner of judicial efficiency.\n\nPatricia M. Wald, Symposium, The Legacy of the New Deal: Problems and Possibilities in the Administrative State (Part 2) Bureaucracy and the Courts, 92 Yale L.J. 1478, 1478 (1983).\n\nXII.\n\nCases which require focused review, especially those that deal with matters of first impression or which should be published on other grounds, are not susceptible to disposition according to limited time lines as may be determined by a majority. Not all cases present simple and previously decided questions of law. The critical examination and review necessary inevitably and inescapably requires time to accomplish. See Anastasoff, 223 F.3d at 904. Such examination and review spawn many instances where separate opinions and positions may result in major modifications and even reversals of original positions agreed to by a majority of this court. Insistence upon a contrary approach can only have a deleterious effect on the parties affected, the outcome of cases, and the development of case law.\n\nMoreover, even the ultimate resolution of some apparently simple cases through summary disposition may take more time then initially estimated. Issues not initially raised or addressed by the majority may be pointed out by a dissent or concurrence. The \"majority\" may change several times as justices grapple with the law and facts posed within a case, and with other considerations and compromises. The decision of whether the case should be published or not may also change several times during the course of consideration. Accordingly, the end result of a lengthy dissent or concurrence by a justice attached to a summary disposition order may have had an earlier incarnation as a majority published decision. See N.K. Shimamoto, Justice is Blind, supra, at 7 n.12 (\"In the case of the Justice or Judge who pens the majority opinion but does not garner the votes for publication, the Judge or Justice may be forced to write a concurring [or dissenting] opinion to . . . express disagreement with the decision of the majority not to publish.\")\n\nThus, a majority rule decision regarding publication does not necessarily mean that more time and resources are saved. That time and effort may already be invested. This is exemplified, as the AJS Hawaii Chapter points out, by the fact that unpublished opinions of this court have been \"of substantial length and content.\" The Report at 4. Also, denying \"publication does not somehow deposit that time and energy back into the pool of resources so that it can be used on other cases.\" N.K. Shimamoto, Justice is Blind, supra, at 11.\n\nMore importantly, the expenditure of the court's resources in filling out the analysis of what was previously thought an \"easy case\" cannot be labeled a waste of resources, when a justice believes that justice is not being served by a superficial treatment of an appeal. Thus, we do not operate as a \"committee,\" and our views, while opposed by the other justices, is certainly not intended to impugn their integrity. Case counts and statistics should not drive our disposition or deliberative process. In a conflict between the two, our primary duty lies in giving a case and the litigants involved the time they deserve. See Anastasoff, 223 F.3d at 904.\n\nXIII.\n\nThe rallying cry for those who raise the specter of backlogs as the justification for the expedient disposition of cases is \"justice delayed is justice denied.\" As one judge has noted, speedy disposition is not to be equated with justice:\n\nTo suggest that justice delayed is justice denied is not the answer. Justice delayed is not always justice denied, and speedy justice is not always justice obtained. Increased pressures on the judiciary resulting from increased litigation because of increased use of the courts by our society is an increased burden which must be met by the judiciary alone, without sacrificing the quality of the justice dispensed. The resulting pressures should and must be assumed by the judiciary without complaint. . . . If justice delayed is justice denied, then justice without quality is also justice denied, a result for which the judiciary alone will be held accountable without reference to collateral pressures from whatever source.\n\nGraver v. Secretary of Health, Ed. \u0026 Welfare, 405 F. Supp. 631, 636-37 (E.D. Pa. 1975) (emphases added).\n\nI agree that cases should be decided as promptly as possible. But there is no justice in a rush to judgment that is mandated by internal policies and procedures embracing summary decisions. Too often the administration of formulaic approaches for expediting cases becomes the focus of the time and energy of the court, which should otherwise be spent on our fundamental function of deciding cases. I see no virtue in a race to rubber stamp a circulating draft of a decision so that it may be issued quickly by the court. Such approaches detract the public's attention from a prominent reason for such delays, that is, the lack of resources. See supra Section V.\n\nBut other internal administrative obstacles cause inefficiencies that delay resolution of cases. Obstacles such as the lack of objective criteria as to whether an opinion should be published, see State v. Taua, 98 Hawaii 426, 441 n.1, 49 P.3d 1227, 1242 n.1 (2002) (Acoba, J., dissenting, joined by Ramil, J.) (opinions which depart from existing law should be published);Zanakis-Pico v. Cutter Dodge, Inc., 98 Hawaii 309, 326, 47 P.3d 1222, 1239 (2002) (Acoba, J., concurring) (opinions which apply new rules of law should be published), and disputes concerning the publishability of an opinion, would be easily resolved by the rule adopted in some jurisdictions that the vote of one justice is sufficient to mandate publication. See Doe, 99 Hawaii at 15 n.6, 52 P.3d at 269 n.6 (Ramil, J., dissenting, joined by Acoba, J.) But even the adoption of objective criteria and alternative measures such as proposed by the Hawaii AJS will not cure the lack of published opinions, inasmuch as a majority disfavoring publication in the first place is unlikely to actually change its position even in the face of such objective standards or alternative measures. Hence, in our view, a single justice rule is necessary.\n\nXIV.\n\nMoreover, although a case that should be published exacts deliberation and, thus, time to complete, over the long-term, publication has the effect of decreasing the backlog and saving ourselves, trial courts, and attorneys needless expense of time, effort, and resources. When we do not publish and address the questions squarely presented to us, there are wide-ranging systemic effects.\n\nEach party for whom the issue subsequently arises is faced anew with an error that is \"novel,\" because we have not yet addressed it. Trial courts must guess at what law should be applied, further delaying the resolution of trials. Law clerks, judges, and justices must in effect \"reinvent the wheel.\" See John v. State, 35 P.3d 53, 64 (Alaska Ct. App. 1989) (Manheim, J., concurring) (\"[S]o many of our decisions are unpublished that, given enough time and enough change of personnel, the court 'forgets' we issued those decisions.\"). Appellants and appellees must do the same. Thus, over the long-term, publication will reduce our backlog, by removing issues from our appellate treadmill.\n\nFailing to publish decisions that should be published has a substantial impact on the public. When this court postpones for an indefinite time the resolution of issues presented before it, the result is to leave parties -- whether they are prosecutors and defendants in criminal cases, parents and children in family court cases, business entities, government, or the public at large -- and their attorneys to guess at what the law is in this jurisdiction, at the risk of guessing wrong. By the time the matter is brought again to this court, much time and events may have passed. It is no wonder that representatives of both the bench and the bar recommend the recourse of citing to the only body of law oftentimes available to them -- unpublished opinions.\n\nXV.\n\nIn our view, the balance is to be struck in the context of our role as the court of last resort in this state and the long range perspective we must take. The litigants in each case deserve the considered judgment of each justice. Our obligation to the rule of law is to apply it assiduously, evenly, and justly; expediency should play no part in the task in which we are engaged. In that regard, more, not less, authoritative guidance strikes the right balance in our present legal milieu. By satisfying our obligation in individual cases, we fulfill our duty as stewards of the judicial power, to all parties and to the public at large without favoring any one party or the interests of one litigant over another.\n\n\u003cspan class=\"fn\"\u003e1. . HRS § 707-701(1)(a) provides that \"[a] person commits the offense of murder in the first degree if the person intentionally or knowingly causes the death of: (a) More than one person in the same or separate incident[.]\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. . HRS § 705-500 provides: (1) A person is guilty of an attempt to commit a crime if the person: (a) Intentionally engages in conduct which would constitute the crime if the attendant circumstances were as the person believes them to be; or (b) Intentionally engages in conduct which, under the circumstances as the person believes them to be, constitutes a substantial step in a course of conduct intended to culminate in the person's commission of the crime. (2) When causing a particular result is an element of the crime, a person is guilty of an attempt to commit the crime if, acting with the state of mind required to establish liability with respect to the attendant circumstances specified in the definition of the crime, the person intentionally engages in conduct which is a substantial step in a course of conduct intended or known to cause such a result. (3) Conduct shall not be considered a substantial step under this section unless it is strongly corroborative of the defendant's criminal intent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. . HRS § 707-701.5(1) provides that \"[e]xcept as provided in section 707-701, a person commits the offense of murder in the second degree if the person intentionally or knowingly causes the death of another person.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. . Davis testified that he identified five rifles, two shotguns, nine revolvers, and eight pistols.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. . For example, while discussing the difference between a .22 and .357 magnum revolver, Davis stated \"the next pistol is a Browning model P 35, high power, Belgian pistol. It's a .9 mm caliber, has a five-inch barrel. It's a semiautomatic Belgian, the magazine, which is displayed here with the gun has a capacity of 13 cartridges.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. . Uyesugi used the Glock 17, loaded with hollow point bullets in the shooting; 28 casings were recovered.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. . HRPP Rule 30(f) provides in relevant part: No party may assign as error the giving or the refusal to give, or the modification of, an instruction, whether settled pursuant to subdivision (b) or subdivision (c), of this rule, unless the party objects thereto before the jury retires to consider its verdict, stating distinctly the matter to which the party objects and the grounds of the objection. Opportunity shall be given to make the objection out of the hearing of the jury. Objections made to instructions at the time they were settled shall be deemed preserved even though not restated after the court has instructed the jury. See also Hawaii Rules of Appellate Procedure (HRAP) Rule 28(b)(4)(B) which provides: (b) Within 40 days after the filing of the record on appeal, the appellant shall file an opening brief, containing the following sections in the order here indicated: (4) A concise statement of the points of error set forth in separately numbered paragraphs. Each point shall state: (i) the alleged error committed by the court or agency; (ii) where in the record the alleged error occurred; and (iii) where in the record the alleged error was objected to or the manner in which the alleged error was brought to the attention of the court or agency. Where applicable, each point shall also include the following: . . . . (B) when the point involves a jury instruction, a quotation of the instruction, given, refused, or modified, together with the objection urged at the trial[.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. . HRS § 704-400(1) provides: A person is not responsible, under this Code, for conduct if at the time of the conduct as a result of physical or mental disease, disorder, or defect the person lacks substantial capacity either to appreciate the wrongfulness of the person's conduct or to conform the person's conduct to the requirements of law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. . The Hawaii Penal Code was adopted and modeled after the MPC; therefore reference to commentary from both Codes is relevant to this discussion. See HPC § 701-105 (stating that \"[t]he commentary accompanying this Code shall be published and may be used as an aid in understanding the provisions of this Code, but not as evidence of legislative intent.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. . For example, the prosecution stated, \"Appreciating the options that he had, appreciating his idea of intimidation that had worked for so long but was not working on the date of the killings.\" Very soon after the above statement, the prosecution stated, \"He even knows that the wrongfulness of what he's done will impact his entire family. . . . He did what he had to do to make a point, disregarding the wrongfulness of what he was doing understanding that it was wrong.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. . The Merriam-Webster's Collegiate Dictionary defines \"appreciate\" as \"to grasp the nature, worth, quality, or significance of (appreciate the difference between right and wrong).\" Merriam-Webster's Collegiate Dictionary 57 (10th ed., 2001).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. . For example, Uyesugi could firmly believe that co-worker \"A\" was sabotaging his work product. This belief did not permeate Uyesugi's beliefs about any other co-worker, even if \"A\" talked to or was friends with other co-workers.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. . All of the experts testified that Uyesugi's articulation of his delusional belief system was consistent throughout all of the examinations.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. . The prosecution defines \"wrongfulness\" as \"full of or characterized by wrong; unjust or unfair and having no legal right; unlawful.\" \"Wrongful\" is defined as \"injurious, heedless, unjust, reckless, unfair; it implies the infringement of some right, and may result from disobedience to lawful authority.\" Black's Law Dictionary 1110 (6th ed. 1991). Black's also defines \"wrongfully\" as, inter alia, in a \"manner contrary to the moral law, or to justice.\" Id. at 1110. One definition of \"wrong\" in Merriam-Webster's Collegiate Dictionary provides \"something wrong, immoral, or unethical; esp : principles, practices, or conduct contrary to justice, goodness, equity, or law.\" Merriam-Webster's Collegiate Dictionary at 1363. Clearly, the prosecution picked the words that most accurately reflected their argument and deleted those that supported Uyesugi.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. . Wilson believed that Peters was poisoning him with methamphetamine, hypnotizing him to control his thoughts, and caused him to lose his job and become sexually inadequate. Wilson, 700 A.2d at 636. Prior to killing Peters, Wilson had gone to the police to seek their assistance in stopping Peters' harassment. The police informed Wilson that they could not intervene because there was no proof that Peters had done anything illegal. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. . The court noted that the MPC provides states with the option of alternative phrasing. This permits states to choose between two standards, i.e., criminality or wrongfulness. Id. at 639. The Wilson court stated: By bracketing the term \"wrongfulness\" and juxtaposing that term with \"criminality,\" the drafters purposefully left it to the individual state legislatures to decide which of these two standards to adopt to describe the nature of the conduct that a defendant must be unable to appreciate in order to qualify as legally insane. The history of the Model Penal Code indicates that \"wrongfulness\" was offered as a choice so that any legislature, if it wishes, could introduce a \"moral issue\" into the test for insanity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. . Inasmuch as the 1982 amendment makes lack of penal responsibility an affirmative defense, case law relying on the pre-amendment analysis has been statutorily overruled. See State v. Nuetzel, 61 Haw. 531, 606 P.2d 920 (1980); State v. Moeller, 50 Haw. 110, 433 P.2d 136 (1967); Territory v. Adiarte, 37 Haw. 463 (1947); Davis v. United States, 165 U.S. 373 (1897).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. . See section I.B. for specific examples of the unanimity instructions given by agreement of the parties.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. . The amendments came into effect on June 29, 2000. Uyesugi's trial ended prior to the implementation of the amendments. The recommended instructions in effect at the time of Uyesugi's trial were HAWJIC §§ 7.06 and 7.07. Amended HAWJIC § 7.06 relates to the Generic Affirmative Defense and provides in relevant part: If you unanimously find that the defendant has proven the elements of the affirmative defense by a preponderance of the evidence, then you must find the defendant not guilty of (specify in the disjunctive charge(s) and any instructed included offense(s)). If you unanimously find that the defendant has not proven the elements of the affirmative defense by a preponderance of the evidence, then you must find the defendant guilty of (specify charge(s) or any instructed offense(s)). If you are unable to reach a unanimous agreement as to whether the affirmative defense has been proved or not been proved, then a verdict may not be returned on (specify in the disjunction charge(s) and any instructed included offense(s)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. . Amended HAWJIC § 7.07 Insanity provides in relevant part: If you unanimously find that the defendant has proven both elements of the affirmative defense by a preponderance of the evidence, then you must find the defendant not guilty of (specify in the disjunctive charge(s) and any instructed included offense(s)). If you unanimously find that the defendant has not proven both elements of the affirmative defense by a preponderance of the evidence, then you must find the defendant guilty of (specify in the disjunctive charge(s) and any instructed included offense(s)). If you are unable to reach a unanimous agreement as to whether the affirmative defense has been proved or not been proved, then a verdict may not be returned on (specify in the disjunctive charge(s) and any instructed included offense(s)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. . The circuit court instructed that: As to any of the offenses charged in Counts I, II, and III of the indictment, if [Defendant] has proved both elements of entrapment by a preponderance of the evidence -- that is, it is more likely than not or more probable than not that entrapment occurred, then you must find [Defendant] not guilty. If [Defendant] has not proved by a preponderance of the evidence both elements of entrapment, then the defense of entrapment does not apply. Miyashiro, 90 Hawaii at 496, 979 P.2d at 92.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. . In describing the murder, this court stated, \"a sixty-seven year-old woman (the decedent), suffered horrific indignities and fatal physical injuries as a result of being bound at her ankles and wrists, beaten, sexually assaulted, and robbed.\" Edwards, 81 Hawaii at 295, 916 P.2d at 705.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. . The decedent's daughter testified that her mother was a seasonal resident of Maui, usually a resident of Alaska, a real estate agent, and for the five years preceding her death, a widow. Edwards at 300, 916 P.2d at 710. The daughter also recounted her mother's activities on January 25, 1993, the day her mother was murdered. \"According to the daughter, on that date, the decedent had played golf; on the way home, she stopped at a store to buy a box of macadamia nuts for a friend.\" Id. at 300, 916 P.2d at 710.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. . Edward's counsel also failed to object to the testimony of a Maui Police Department Detective \"that implied that Edwards had a criminal record.\" Id. at 301, 916 P.2d at 711. In agreeing that the detective's testimony \"may have suggested to the jury that Edwards had a criminal record and that the defense counsel's failure to object to such a reference reflected a 'lack of skill, judgment, or diligence[.]'\" Id. at 301, 916 P.2d at 711.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. . HRE Rule 403 provides: Although relevant, evidence may be excluded if its probative value is substantially outweighed by the danger of unfair prejudice, confusion of the issues, or misleading the jury, or by considerations of undue delay, waste of time, or needless presentation of cumulative evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. . HRE Rule 404(b) provides: Other crimes, wrongs, or acts. Evidence of other crimes, wrongs, or acts is not admissible to prove the character of a person in order to show action in conformity therewith. It may, however, be admissible where such evidence is probative of another fact that is of consequence to the determination of the action, such as proof of motive, opportunity, intent, preparation, plan, knowledge, identity, modus operandi, or absence of mistake or accident. In criminal cases, the proponent of evidence to be offered under this subsection shall provide reasonable notice in advance of trial, or during trial if the court excuses pretrial notice on good cause shown, of the date, location, and general nature of any such evidence it intends to introduce at trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. . HRE Rule 103 provides in relevant part that \"[t]he court may add any other or further statement which shows the character of the evidence, the form in which it was offered, the objection made, and the ruling thereon. It may direct the making of an offer in question and answer form.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. . HRPP Rule 40 provides in relevant part \"Where the petition alleges the ineffective assistance of counsel as a ground upon which the requested relief should be granted, the petitioner shall serve written notice of the hearing upon the counsel whose assistance is alleged to have been ineffective and said counsel shall have an opportunity to be heard.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. For convenience, I refer to Hawaii Revised Statutes (HRS) § 704-400 (1993), the defense of \"physical or mental disease, disorder or defect[,]\" as the \"insanity\" defense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. HRS § 704-400 sets forth the defense as follows: Physical or mental disease, disorder, or defect excluding penal responsibility. (1) A person is not responsible, under this Code, for conduct if at the time of the conduct as a result of physical or mental disease, disorder, or defect the personlacks substantial capacity either to appreciate the wrongfulness of the person's conduct or to conform the person's conduct to the requirements of the law. (2) As used in this chapter, the terms \"physical or mental disease, disorder, or defect' do not include an abnormality manifested only by repeated penal or otherwise anti-social conduct. (Boldfaced font in original.) (Emphasis added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. I observe that the majority discusses the terms \"appreciate\" and \"wrongfulness\" separately, as Defendant advocates. The case it relies on for its definition of \"wrongfulness,\" Wilson, 700 A.2d at 643, concerned the application of the entire phrase \"appreciate the wrongfulness[.]\" While largely a semantical point, the majority's definition of \"wrongfulness\" is likely to engender jury confusion as it utilizes a \"subjective/objective\" test that is only appropriate when placed in context of the entire phrase \"appreciate the wrongfulness[.]\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The court read the jury an instruction on expert testimony as follows: During the trial you heard the testimony of one or more witnesses who were described as experts. Training and experience may make a person an expert in a particular field. The law allows that person to state an opinion about matters in the field. Merely because such a witness has expressed an opinion does not mean, however, that you must accept this opinion. It is up to you to decide whether to accept this testimony and how much weight to give it. You must also decide whether the witness'[s] opinions were based on sound reasons, judgment, and information. (Emphasis added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The subjective/objective test is described as \"[f]irst, in satisfying the subjective portion, the record must reflect the circumstances as the defendant believed them to be. Second, in satisfying the objective portion, the record must support a reasonable explanation or excuse for the actor's disturbance.\" Majority opinion at 24 (quoting State v. Sawyer, 88 Hawaii 325, 333, 966 P.2d 637, 545 (1998) (internal quotation marks omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. With all due respect, it is difficult to ascertain how this test advances the evaluation of \"wrongfulness.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. The \"substantial capacity\" test involves two parts. \"Cognitive capacity,\" where it is lacking, means \"the defendant must not know the nature and quality of the defendant's act or that what the defendant is doing is wrong.\" Commentary on HRS § 704-400. Volitional capacity \"is put in terms of whether the defendant lacked substantial capacity to confirm the defendant's conduct to the requirements of the law.\" Id. In regard to the test, \"[t]he Code does not demand total incapacity; it requires substantial incapacity.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. This is \"the most frequently encountered meaning [and] appears as the first definition for each part of speech.\" Random House Collegiate Dictionary at XXVIII.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. The majority's position rests in part on \"our legislature's reliance on Freeman when it enacted HRS § 704-400.\" Majority opinion at 27. Respectfully, there is nothing to indicate in the legislative history that the legislature adopted the Freeman rationale, as later embodied in Wilson, or that the plain meaning of the term would not cover a psychiatric condition such as a delusion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Dr. Cunningham, a prosecution expert witness, defined the term \"delusion\" as a false belief that a person has that is unshakable. No matter how much evidence you provide them with and no matter how much they see that other people don't believe them, you cannot convince them that this false idea is wrong. Dr. Dietz, a defense expert, defined Defendant's delusion as follows: Delusional disorder is an unusual mental illness. It's one of the serious mental illnesses, . . . one has one of the worst symptoms a person can have psychiatrically; namely, delusions, fixed, false beliefs that they cannot be talked out of. No proof, no evidence, no reasoning can ever touch the delusion. And yet at the same time that they have extremely warped view of the world, other parts of them remain largely intact . . . unlike schizophrenia where most often people . . . are deteriorated . . . in the way they look and their hygiene and the ability to communicate and their ability to look you in the eye or talk to you, all those tend to be impaired in schizophrenia.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. This statute states, in pertinent part: Physical or mental disease, disorder, or defect excluding responsibility is an affirmative defense; form of verdict and judgment when finding of irresponsibility is made. (1) Physical or mental disease, disorder, or defect excluding responsibility is an affirmative defense. (Boldfaced font in original.) (Emphasis added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. As pointed out by the majority, these pattern instructions reflect amendments which became effective on June 29, 2000,see majority opinion at 33 n.19, but they merely reflect the prior existing law as set forth in Miyashiro.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. For example, the court in the verdicts instruction advised: As to Count I, Murder in the First Degree, you may bring in one of the following verdicts: 1. Not guilty; or 2. Guilty as charged; or 3. Guilty of the included offense of Manslaughter based on extreme mental or emotional disturbance; or 4. Not guilty by reason of physical or mental disease, disorder, or defect. . . . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Miyashiro states: The circuit court should have instructed the jury, in relevant part, that its deliberative process should include the following steps: (1) For each count, decide whether all the elements of the charged offense have been established beyond a reasonable doubt. (2) If the jury unanimously agrees that all the elements of the charged offense have not been established beyond a reasonable doubt, the jury must acquit Defendant of the charged offense and consideration of the affirmative defense [ ] is not required. (3) If the jury unanimously agrees that all the elements of the charged offense have been established beyond a reasonable doubt, then the jury must consider the affirmative defense [ ]. In such event, (a) If the jury unanimously agrees that Defendant has proved, by a preponderance of the evidence, that entrapment occurred for a charged offense, the jury must acquit Defendant of that offense; and (b) If the jury unanimously agrees that Defendant has not proved, by a preponderance of the evidence, that entrapment occurred for a charged offense, the jury must find Defendant guilty of the charged offense. Id. at 500 n. 13, 96 n. 13.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. Specifically, the instruction read: As to Count I, if and only if you find, beyond a reasonable doubt, that [ ] Defendant intentionally or knowingly caused the deaths of more than one person in the same or separate incident, you must then determine whether, at that time, [ ] Defendant was under the influence of extreme mental or emotional disturbance for which there is a reasonable explanation. The reasonableness of the explanation shall be determined from the viewpoint of a person in [ ] Defendant's situation under the circumstances of which [ ] Defendant was aware or as [ ] Defendant believed them to be. The prosecution must prove beyond a reasonable doubt that [ ] Defendant was not, at the time that he caused the deaths of more than one person in the same or separate incident, under the influence of extreme mental or emotional disturbance for which there is a reasonable explanation. If the prosecution has done so, then you must return a verdict of guilty of Murder in the First Degree. If the prosecution has not done so, then you must return a verdict of guilty of Manslaughter based upon extreme mental or emotional disturbance. (Emphasis added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. For example, in the court's general verdict instructions, the verdict of not guilty by reason of insanity was listed after the emotional disturbance verdict: As to Count I, Murder in the First Degree, you may bring in one of the following verdicts: 1. Not guilty; or 2. Guilty as charged; or 3. Guilty of the included offense of Manslaughter based on extreme mental or emotional disturbance; or 4. Not guilty by reason of physical or mental disease, disorder, or defect.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. See, e.g., 6th Cir. R. 206 (\"The following criteria shall be considered by panels in determining whether a decision will be designated for publication in the Federal Reporter: . . . (4) whether it is accompanied by a concurring or dissenting opinion . . . . An opinion or order shall be designated for publication upon the request of any member of the panel.\"); 8th Cir., App. I, 28 U.S.C.A. (\"The Court or a panel will determine which of its opinions are to be published, except that a judge may make any of his [or her] opinions available for publication.\"); 9th Cir. R. 36-2 (\"A written, reasoned disposition shall be designated as an OPINION only if it: . . . [i]s accompanied by a separate concurring or dissenting expression, and the author of such separate expression requests publication of the disposition of the Court and the separate expression.\" (Capitalization in original.)); Ala. R. App. P. 53 (\"[I]f in a 'No Opinion' case a Justice or Judge writes a special opinion, either concurring with or dissenting from the action of the court, the reporter of decisions shall publish that special opinion, along with a statement indicating the action to which the special opinion is addressed.\"); Ariz. Sup. Ct. R. 111(b)(4) (\"Dispositions of matters before the court requiring a written decision shall be by written opinion when a majority of the judges acting determine[s] that it involves a legal or factual issue of unique interest or substantial public importance, or if the disposition of matter is accompanied by a separate concurring or dissenting expression, and the author of such separate expression desires that it be published, then the decision shall be by opinion.\" (Internal section numbering omitted.)); N.D. Sup. Ct. Admin. R. 27, § 14(c) (\"The opinion may be published only if one of the three judges participating in the decision determines that one of the standards set out in this rule is satisfied. The published opinion must include concurrences and dissents.\" (Emphasis added.)). For these, as well as other jurisdictions' rules, see Doe, 99 Hawaii at 15 n.6, 52 P.3d at 269 n.6 (Ramil, J., dissenting, joined by Acoba, J.) (collecting similar rules in other jurisdictions).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. My understanding is that the majority rule regarding publication was recently adopted in 1996. As related by Justice Ramil, the custom of this court previously was to concur with a justice's recommendation to publish.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. See, e.g., State v. Irvine, No. 24193 (Hawaii Jul. 12, 2002) (unpublished) (Acoba, J., dissenting); Saito v. Fuller, No. 23913 (Hawaii Jun. 8, 2002) (unpublished) (Ramil, J., concurring; Acoba, J., dissenting); Ng. v. Miki, No. 24267 (Hawaii May 28, 2002) (unpublished) (Moon, C.J. and Nakayama, J., dissenting); State v. Iha, Nos. 23083, 23156, 23157, 23158, 23161, 23177, 23178, 23189, 23190, 23191, 23192, 23193, 23213, 23234, 23235, 23236, 23237, 23238, 23239, 23240, 23242, 23253, 23254, 23255, 23256, 23257, 23258, 23259, 23260, 23274, 23326, 23327, 23328, 23329, 23330, 23347, 23359, 23363, 23364, 23365, 23366, 23371, 23436, 23437, 23438, 23452, 23453, 23561, 23596 (Hawaii Aug. 27, 2001) (Nakayama, J., dissenting, joined by Ramil, J.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. The majority's refusal to address issues of first impression has little to do with numbers. See, e.g., State v. Bush, No. 24808 (Oct. 11, 2002) (SDO) (Acoba, J., dissenting); State v. Makalii, No. 24833 (Oct. 2, 2002) (SDO) (Ramil, J., dissenting, joined by Acoba, J.); State v. Lopes, No. 24187 (Sept. 6, 2002) (SDO) (Acoba, J., concurring, joined by Ramil, J.); State v. Hauanio, No. 23034 (Aug. 30, 2001) (SDO) (Acoba, J., dissenting). The majority's approach will likely engender more such cases. Moreover, as observed, from July 2000 through December 2000, \"the Supreme Court wrote 106 opinions: 56 cases (52.8%) were disposed of via SDO, 20 cases (18.9%) by memorandum opinion, and 30 cases (28.3%) by published opinion.\" N.K. Shimamoto, Justice is Blind, supra, at 6. Thus, only 28.3% of Hawaii Supreme Court cases were published during this time period.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. The AJS recommendation, inter alia, suggests an amendment to HRAP Rule 35. See The Report at 18, 20. The suggested amendment adds a new subsection c and re-alphabetizes and supplements the current subsection c as follows: (c) Application for Publication. Any party or other interested person may apply for good cause shown to the court for publication of an unpublished opinion. [(c)] (d) Citation. A memorandum opinion or unpublished dispositional order shall not be considered nor shall be cited in any other action or proceeding as controlling authority, except when the opinion or unpublished dispositional order establishes the law of the pending case, re [sic] judicata or collateral estoppel, or in a criminal action or proceeding involving the same respondent. In all other situations, a memorandum opinion or unpublished dispositional order may be cited in any other action or proceeding if the opinion or order has persuasive value. A party who cites a memorandum opinion or unpublished dispositional order shall attach a copy of the opinion or order to the document in which it is cited, as an appendix, and shall indicate any subsequent disposition of the opinion or order by the appellate courts known after diligent search. If an unpublished decision is cited at oral argument, the citing party shall provide a copy to the court and the other parties. When citing an unpublished opinion or order, a party must indicate the opinion's unpublished status. The Report at 22 (underscoring, indicating additions, and brackets, indicating deletions, in original).\u003c/span\u003e\n\n",
    "body_length": 161666,
    "citedas": [
      "100 Haw. 442",
      "60 P.3d 843"
    ],
    "attorneys": "On the briefs: Deborah L. Kim and Edward K. Harada, Deputy Public Defenders, fordefendant-appellant Donn Fudo, Deputy Prosecuting Attorney and Brian Toma, Law Clerk onthe Brief, for plaintiff-appellee",
    "category": [
      "36",
      "78",
      "75"
    ],
    "judges": "Moon, C.J., Levinson, And Nakayama, JJ.",
    "citation_count": 20
  }
}
