{
  "id": "CbhwTmYBTlTomsSB-sCm",
  "document": {
    "title": "New Jersey Coalition Against War in the Middle East v. J.M.B. Realty Corp.",
    "full_title": "NEW JERSEY COALITION AGAINST WAR IN THE MIDDLE EAST, SYLVIA ACKELSBERG, AND DAVID CLINE AND CROSS-RESPONDENTS, v. J.M.B. REALTY CORPORATION, D/B/A RIVERSIDE SQUARE, PRUTAUB JOINT VENTURE, D/B/A THE MALL AT SHORT HILLS AND CROSS-APPELLANTS, AND CHERRY HILL CENTER, INC., D/B/A CHERRY HILL MALL, KRAVCO, INC., D/B/A HAMILTON MALL, EQUITY PROPERTIES \u0026 DEVELOPMENT CO., INC., D/B/A MONMOUTH MALL, KRAVCO, INC., D/B/A QUAKERBRIDGE MALL, ROCKAWAY CENTER ASSOCIATES, D/B/A ROCKAWAY TOWNSQUARE, WOODBRIDGE CENTER, INC., D/B/A WOODBRIDGE CENTER, LIVINGSTON MALL VENTURE, D/B/A LIVINGSTON MALL, HARTZ MOUNTAIN INDUSTRIES, INC., D/B/A THE MALL AT MILL CREEK .",
    "jurisdiction": "Supreme Court of New Jersey",
    "date": "1994-12-20T00:00:00.000Z",
    "docket": "No. A-124/125",
    "body": "The opinion of the Court was delivered by WILENTZ, C.J.\n\nThe question in this case is whether the defendant regional and community shopping centers must permit leafletting on societal issues. We hold that they must, subject to reasonable conditions set by them. Our ruling is limited to leafletting at such centers, and it applies nowhere else.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e It is based on our citizens' right of free speech embodied in our State Constitution. N.J. Const. art. I, PP 6, 18. It follows the course we set in our decision in State v. Schmid, 84 N.J. 535 (1980).\n\nIn Schmid we ruled that our State Constitution conferred on our citizens an affirmative right of free speech that was protected not only from governmental restraint -- the extent of First Amendment protection -- but from the restraint of private property owners as well. We noted that those state constitutional protections are \"available against unreasonably restrictive or oppressive conduct on the part of private entities that have otherwise assumed a constitutional obligation not to abridge the individual exercise of such freedoms because of the public use of their property.\" Id. at 560. And we set forth the standard to determine what public use will give rise to that constitutional obligation. The standard takes into account the normal use of the property, the extent and nature of the public's invitation to use it, and the purpose of the expressional activity in relation to both its private and public use. This \"multi-faceted\" standard determines whether private property owners \"may be required to permit, subject to suitable restrictions, the reasonable exercise by individuals of the constitutional freedoms of speech and assembly.\" Id. at 563. That is to say, they determine whether, taken together, the normal uses of the property, the extent of the public's invitation, and the purpose of free speech in relation to the property's use result in a suitability for free speech on the property that on balance, is sufficiently compelling to warrant limiting the private property owner's right to exclude it; a suitability so compelling as to be constitutionally required.\n\nApplying Schmid, we find the existence of the constitutional obligation to allow free speech at these regional and community shopping centers clear. Although the ultimate purpose of these shopping centers is commercial, their normal use is all-embracing, almost without limit, projecting a community image, serving as their own communities, encompassing practically all aspects of a downtown business district, including expressive uses and community events. We know of no private property that more closely resembles public property. The public's invitation to use the property -- the second factor of the standard -- is correspondingly broad, its all-inclusive scope suggested by the very few restrictions\n\non the invitation that are claimed, but not advertised, by defendants. For the ordinary citizen it is not just an invitation to shop, but to do whatever one would do downtown, including doing very little of anything.\n\nAs for the third factor of the standard -- the relationship between the purposes of the expressional activity and the use of the property -- the free speech sought to be exercised, plaintiff's leafletting, is wholly consonant with the use of these properties. Conversely, the right sought is no more discordant with defendants' uses of their property than is the leafletting that has been exercised for centuries within downtown business districts discordant with their use. Furthermore, it is just as consonant with the centers' use as other uses permitted there. Indeed, four of these centers actually permitted plaintiff's leafletting (although it took place in only two of those).\n\nWe therefore find the existence of a constitutional obligation to permit the leafletting plaintiff seeks at these regional and community shopping centers; we find that the balance of factors clearly predominates in favor of that obligation; its denial in this case is unreasonably restrictive and oppressive of free speech: were it extended to all regional and community shopping centers, it would block a channel of free speech that could reach hundreds of thousands of people, carrying societal messages that are at its very core. The true dimensions of that denial of this constitutional obligation are apparent only when it is understood that the former channel to these people through the downtown business districts has been severely diminished, and that this channel is its practical substitute.\n\nWe hold that Schmid requires that the free speech sought by the plaintiff -- the non-commercial leafletting and its normal accompanying speech (without megaphone, soapbox, speeches, or demonstrations) -- be permitted by defendants subject to such reasonable rules and regulations as may be imposed by them. This free speech can be, and we have no doubt will be, carefully controlled by these centers. There will be no pursuit or harassment\n\nof shoppers. Given this limited free speech right -- leafletting, given the centers' broad power to regulate it, and given experience elsewhere, we are confident that it is consonant with the commercial purposes of the centers and the varied purposes of their shoppers and non-shoppers.\n\nWe recognize the concerns of the defendants, including their concern that they will be hurt. Those concerns bear on the extent and exercise of the constitutional right and we have addressed them in this opinion. We recognize the depth and legitimacy of those concerns even apart from their constitutional relevance. Defendants have expended enormous efforts and funds in bringing about the success of these centers. We hope they recognize the legitimacy of the constitutional concern that in the process of creating new downtown business districts, they will have seriously diminished the value of free speech if it can be shut off at their centers. Their commercial success has been striking but with that success goes a constitutional responsibility.\n\nWithout doubt, despite the fact that the speech permitted -- leafletting -- is the least obtrusive and the easiest to regulate, and despite the centers' broad power to regulate, some people will not like it, any more perhaps than they liked free speech at the downtown business districts. Dislike for free speech, however, has never been the determinant of its protection or its benefit. We live with it, we permit it, as we have for more than two hundred years. It is free speech, it is constitutionally protected; it is part of this State, and so are these centers.\n\nI\n\nIn the summer and fall of 1990 our government and our country were debating what action, if any, should be taken in response to Iraq's invasion of Kuwait. The issue eclipsed all others. The primary competing policies were military intervention and economic sanctions. On November 8, President Bush announced a major increase in the number of troops stationed in Saudi Arabia and the Persian Gulf in order to provide \"an adequate offensive military option.\" President's News Conference, 26 Weekly Comp.\n\nPres. Doc. 1789, 1792 (Nov. 8, 1990). Plaintiff -- a coalition of numerous groups\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e -- opposed military intervention and sought public support for its views. For that purpose, plaintiff decided to conduct a massive leafletting campaign on November 9 and November 10, urging the public to contact Congress to persuade Senators and Representatives to vote against military intervention. The November 9 effort was aimed at commuter stops around the State.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The November 10 targets were shopping centers, the ten very large regional and community shopping centers whose owners are the defendants herein.\n\nOn November 9, plaintiff -- aware of the shopping centers' probable refusal -- sought judicial relief ordering the centers to permit\n\nthe leafletting. That effort was unsuccessful. The trial court ruled that plaintiff had failed to prove refusal; appellate review was also unsuccessful.\n\nOn November 10 plaintiff's members and representatives went to the malls and requested permission to leaflet. Four of the defendant malls granted plaintiff permission to leaflet on their premises, and plaintiff did in fact leaflet at two of those malls. Monmouth Mall initially denied plaintiff's request, but later issued plaintiff a permit to use its community booth for two days in January, and even provided professional signs and displays for the group. Plaintiff used the booth on those days. The conditions imposed by mall management, however, made it difficult for plaintiff to reach the public. Among other restrictions, plaintiff was not allowed to approach passersby to offer them literature. The Mall at Mill Creek, Cherry Hill Mall, and Woodbridge Center granted plaintiff permission to use their community booths, but required that plaintiff obtain or show proof of liability insurance in the amounts of $1,000,000 for bodily injury and $50,000 to $1,000,000 for property damage. Plaintiff was unable to obtain the necessary insurance, and requested that the malls waive the requirement. Woodbridge Center waived the insurance requirements, allowing plaintiff to distribute leaflets from a table, while The Mall at Mill Creek and Cherry Hill Mall refused.\n\nAlthough the six remaining malls refused permission, one of those malls -- Hamilton -- ultimately allowed plaintiff to leaflet. While it initially denied permission, asking plaintiff to leave the premises, it eventually allowed plaintiff to leaflet undisturbed for approximately three to four hours.\n\nAs a consequence of defendants' refusal to allow plaintiff access to the malls, and the restrictions imposed on such access where allowed, few of the thousands of people at those malls on November 10 learned of plaintiff's views.\n\nPlaintiff again sought emergent judicial relief ordering the centers to permit its members to leaflet in support of their view that those forces already deployed refrain from any military\n\naction. Relief was again denied, both at the trial and appellate level. Plenary trial of the substantive issue of plaintiff's right to leaflet on defendants' premises was thereafter held, but by then the military intervention had occurred and the engagement was over.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nEach of the ten defendant shopping centers is very large. For instance, one defendant mall, Woodbridge Center, serves an area with a population of 1,400,000. On an average day in 1990, approximately 28,750 people shopped there. November 10, 1990, however, was not an average day. Not only was the tenth a Saturday, a day that is generally very busy for shopping malls, but it was also part of Veterans' Day weekend. Thus, presumably many more people visited malls on that day than on an average day. Indeed, plaintiff's witnesses testified that they sought to leaflet on that day because of the large expected turnout of shoppers during the holiday weekend.\n\nNine of the defendant shopping centers are \"regional centers.\" A regional shopping center is defined in the industry as one that\n\nprovides shopping goods, general merchandise, apparel, furniture and home furnishings in full depth and variety. It is built around the full-line department store, with a minimum GLA [gross leasable area]\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e of 100,000 square feet, as the major drawing power. For even greater comparative shopping, two, three or more department stores may be included. In theory a regional center has a GLA of 400,000 square feet, and can range from 300,000 to more than 1,000,000 square feet.\n\n[National Research Bureau, Shopping Center Directory 1994, Eastern Volume (1993).]\n\nThe regional centers involved in this case have from 93 to 244 tenants, including not only department stores, but also restaurants and other retail and business establishments, such as art galleries, automotive centers and gas stations, banks, brokerage houses and finance companies, leisure and entertainment centers, optical centers, travel agencies, hair salons, shoe repair shops, theaters, ticket agents, insurance agencies, doctors' offices, and a United States postal booth during the holiday seasons. One housed a United States Post Office substation until approximately 1990. Each mall is surrounded by parking facilities that hold from 3,075 to 9,000 vehicles. The acreage of the regional centers ranges from 31.44 to 238 acres.\n\nThe tenth defendant is a \"community\" shopping center. A community center is smaller than a regional center and lacks the variety of merchandise available at a regional mall. The industry defines a community center as one that includes\n\na wide[] range of facilities for the sale of soft lines (apparel) and hardlines (hardware, appliances, etc.). . . . It is built around a junior department store, variety store or discount department store although it may have a strong specialty store. The typical size of a community center is 150,000 square feet. In practice a community center can range from 100,000 to 300,000 square feet.\n\n[Ibid. ]\n\nThe only community center involved in this case, the Mall at Mill Creek, covers twenty-seven acres. It has a discount department store, a supermarket, sixty-two smaller retail stores, and a seven-restaurant food court.\n\nAll of the defendant shopping centers are enclosed malls -- enclosures covering not only the tenants of all kinds but also substantial common areas linking them and providing space for people to congregate. In those malls where plaintiff was refused permission to leaflet, the refusal was absolute; plaintiff was denied access to the enclosed areas as well as the parking lots and sidewalks outside of the enclosures.\n\nAlthough each mall asserts that it does not resemble a downtown business district, like those districts, each of these malls employs or uses part-time (or in some cases, on-duty) municipal\n\npolice officers, usually in uniform and armed. Quakerbridge Mall houses a municipal police substation. Police officers, almost always off-duty, patrol the inside of Cherry Hill Mall, Woodbridge Center, Livingston Mall, and the Mall at Short Hills. The interiors of Rockaway Townsquare Mall and Monmouth Mall are patrolled by on-duty municipal police officers. Some of the malls (such as Riverside and Monmouth) hire off-duty police officers for traffic control when necessary. Most of the malls' parking lots are patrolled by municipal police officers.\n\nEach of the defendants permits and encourages a variety of non-shopping activities on its premises.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Six of the malls provide access to community groups. Riverside Square Mall has a meeting room, with an occupancy of 150 persons, that is available to the public. Monmouth Mall rents a civic auditorium to various organizations. Monmouth Mall also has a community booth from which various groups are allowed to espouse their causes, distributing leaflets and literature to passersby. Hamilton, the Mall at Mill Creek, Cherry Hill Mall, and Woodbridge Center provide similar community booths.\n\nSome of the non-shopping activities permitted by defendants involved speech, politics, and community issues. Some of these activities, moreover, have been permitted by the very defendants who denied plaintiff permission to leaflet. For example, Rockaway Townsquare Mall held a Crime Prevention Day, has hosted community weekends, and allowed one of plaintiff's constituent members, Morris County SANE/FREEZE, to participate. Livingston Mall also has sponsored community weekends where civic groups were allowed to position themselves in the common area of the mall, distribute literature and speak about issues relevant to their causes, and Quakerbridge has hosted a similar community day.\n\nIn addition to sponsoring community weekends or days, these malls have sponsored other events that included political speech or concerned issues of civic importance. Livingston Mall allowed a voter registration drive to be conducted by the League of Women Voters, and sponsored a Child ID Day with the Livingston Police. Rockaway Townsquare Mall sponsored a voter registration drive in conjunction with the Morris County Republican party, and a United Way Day of Caring where sixty-seven agencies distributed information on diverse topics, such as substance abuse, homelessness, hunger, literacy, and youth counselling. Local officials and dignitaries participated in the \"kick-off\" for that event. Quakerbridge Mall hosted an exhibition of local municipal groups with the Mall's Merchants Association and Lawrence Township.\n\nThe remaining malls have permitted similar events. For example, Cherry Hill Mall allowed Senator Bill Bradley's office to conduct a voter registration drive in the fall of 1990. Woodbridge Center allowed Senator Bradley to walk through its mall greeting and shaking hands with its patrons in the summer of 1990 when he was running for re-election. Both Cherry Hill Mall and Woodbridge Center allowed the Marines to sponsor \"Toys for Tots\" drives. Woodbridge Center's press release stressed that the focus of the event would be on children whose mothers or fathers were serving in the Persian Gulf. The Mall at Mill Creek allowed the New Jersey Prosecutor's Victim and Witness Association to present information for crime victims, allowed a Bradley for United States Senate Voter Registration Drive to be held, and allowed military recruitment by the United States Naval Sea Cadets and the United States Army.\n\nMonmouth Mall sponsored a Spring Community Fair, held a Berlin Wall Exhibit, allowed free \"Video Postcards From Home\" to the Persian Gulf troops to be taped on its premises, and has a senior citizen activity network office. Riverside Square Mall allowed Senator Bradley's office to conduct a non-partisan voter registration drive. Riverside Square also sponsored a United States Marine Corps \"Toys for Tots\" drive, a Bergen County\n\nRead-In Festival, which involved the participation of local officials, and an Earth Day Celebration with local and national environmental organizations. Hamilton Mall hosted a Coastal Cops Celebration Holiday. This program, which is coordinated by the mall and local businesses, gives children ages six to twelve the opportunity to participate in a clean-up effort of the area's beaches.\n\nFurthermore, based on statements at oral argument (and on our own experience) we deem it likely that defendants permit candidates, accompanied as always by a few aides, to seek support by walking through the mall, approaching shoppers, offering a handshake, and saying a few words (or more) to each. We would be surprised if those aides did not have leaflets available.\n\nDespite the myriad of permitted uses, including many involving the distribution of issue-oriented literature -- leaflets -- and accompanying speech, despite the explicit permission given to plaintiff to leaflet at four of them, and despite the display of tenants' posters at most of them, posters that were visible from the common areas and expressed support for our armed forces in the Persian Gulf, all of the centers claim to prohibit issue-oriented speech and leafletting.\n\nDefendants presented evidence that issue-oriented free speech, and especially controversial free speech, conflicted with their commercial purpose: that purpose is to get as many shoppers as possible on the premises and to provide an atmosphere that would encourage buying. Leafletting, speaking, and the assumed related consequences of such actions, were described as in conflict with shopping, particularly impulse buying, a major goal of such centers. If designed to prove probable financial loss, the evidence was unpersuasive. At malls of this size, carefully regulated leafletting, limited in duration and frequency, and permitted only in selected areas, seems unlikely to have the slightest impact on actual revenues, even if some shoppers dislike it. At most the impact would be negligible. Despite plaintiff's assertion that California's shopping centers, where leafletting has been permitted since 1979, have suffered no adverse financial consequences\n\nwhatsoever, defendants suggested nothing concrete to the contrary.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e And the same is true of Bergen Mall, apparently a regional shopping center, where issue-oriented leafletting has been permitted since 1984 by virtue of a trial court injunction (and where plaintiff leafletted against our Persian Gulf military involvement).\n\nAt the plenary trial, plaintiff sought a permanent injunction restraining defendants from preventing or interfering with plaintiff's free speech activities, subject to reasonable conditions. It claimed this substantive right to free speech under\n\nNew Jersey's Constitution as well as at common law. No claim of right was made under the Federal Constitution. Plaintiff also challenged specific regulations imposed by some of the malls including: 1) content-based regulations prohibiting offensive speech, 2) requirements that the group seeking access to the mall obtain insurance, 3) regulations prohibiting people engaging in expressive activity from approaching mall visitors and 4) arbitrary limitations on mall access.\n\nThe trial court entered judgment in favor of defendants, denying all relief, on the ground that defendants' property was dedicated solely to commercial uses inconsistent with political speech; that the invitation to the general public was limited to such use; and that, therefore, under our ruling in State v. Schmid, 84 N.J. 535 (1980), no State constitutional right of free speech on defendants' premises existed. New Jersey Coalition Against War in the Middle East v. J.M.B. Realty Corp., 266 N.J. Super. 195 (Ch. Div. 1993). The trial court ruled, in effect, that defendants retained the right to exclude those\n\nnot invited to its premises to the same extent as any other private property owner. Given that judgment, the trial court found it unnecessary to rule on defendants' contention that the relief sought by plaintiff, if granted, would constitute a taking of their property without just compensation, would deprive them of their property without due process of law, and would abridge their freedom of speech by forcing them to provide a forum for the speech of others, all in violation of the Federal and State Constitutions. The Appellate Division affirmed, relying substantially on the trial court's findings and opinion. 266 N.J. Super. 159 (1993).\n\nWe granted both plaintiff's petition for certification and cross-petitions filed by two of the defendants. 134 N.J. 564 (1993). We reverse, and declare that plaintiff has a State constitutional right to leaflet at defendants' shopping centers, subject to reasonable conditions, and that such right does not infringe on any constitutional right asserted by defendants.\n\nII\n\nBefore reaching our Discussion of the law, we must first examine the background against which this question is raised. We know its most important outline. Regional and community shopping centers significantly compete with and have in fact significantly displaced downtown business districts as the gathering point of citizens, both here in New Jersey and across America.\n\nStatistical evidence tells the story of the growth of shopping malls. In 1950, privately-owned shopping centers of any size numbered fewer than 100 across the country. Steven J. Eagle, Shopping Center Control: The Developer Besieged, 51 J. Urb. L. 585, 586 (1974). By 1967, 105 of the larger regional and super-regional malls existed. This number increased to 199 in 1972 and to 333 in 1978. Thomas Muller, Regional Malls and Central City Retail Sales: An Overview, in Shopping Centers: U.S.A. 180, 189 (George Sternlieb \u0026 James W. Hughes eds., 1981). By 1992, the number expanded to at least 1,835. Shopping Center World/NRB\n\n1992 Shopping Center Census, Shopping Center World, Mar. 1993, at 38.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Thus, from 1972 to 1992 the number of regional and super-regional malls in the nation increased by roughly 800%. In New Jersey, the number of malls greater than 400,000 square feet, or, roughly, the number of regional and super-regional malls, has more than doubled over the last twenty years, increasing from 30 in 1975 to 63 in 1992. Shopping Center Census. . ., Shopping Center World, Jan. 1977, at 21; Shopping Center World/NRB 1992 Shopping Center Census, supra, at 46.\n\nThe share of retail sales attributable to regional and super-regional malls has demonstrated a similar pattern. Nationally, regional malls' market share of \"shopper goods sales\" was 13% in 1967 and 31% in 1979. Muller, supra, at 187. In 1991 retail sales in \"shopping centers,\" a category that includes not only regional malls but other types of urban and suburban retail centers, \"accounted for over 56% of total retail sales in the United States, excluding sales by automotive dealers and gasoline service stations.\" International Council of Shopping Centers, The Scope of the Shopping Center Industry in the United States, 1992-1993, at 1 (1992). In New Jersey in 1991, retail sales in shopping centers constituted 44% of non-automotive retail sales. Id. at 34.\n\nThus, malls are where the people can be found today. Indeed, 70% of the national adult population shop at regional malls and do so an average of 3.9 times a month, about once a week. Id. at 1. Therefore, based on adult population data from the 1990 census,\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e more than four million people on average shop at our regional\n\nshopping centers every week, assuming New Jersey follows this national pattern.\n\nThe converse story, the decline of downtown business districts, is not so easily documented by statistics. But for the purposes of this case, we do not need statistics. This Court takes judicial notice of the fact that in every major city of this state, over the past twenty years, there has been not only a decline, but in many cases a disastrous decline. This Court further takes judicial notice of the fact that this decline has been accompanied and caused by the combination of the move of residents from the city to the suburbs and the construction of shopping centers in those suburbs. See Western Pa. Socialist Workers 1982 Campaign v. Connecticut Gen. Life Ins. Co., 515 A.2d 1331, 1336 (Pa. 1986) (\"Both statistics and common experience show that business districts, particularly in small and medium sized towns, have suffered a marked decline. At the same time, shopping malls, replete with creature comforts, have boomed.\").\n\nThat some downtown business districts have survived, and indeed thrive, is also fact, demonstrated on the record before us. The overriding fact, however, is that the movement from cities to the suburbs has transformed New Jersey, as it has many states. The economic lifeblood once found downtown has moved to suburban shopping centers, which have substantially displaced the downtown business districts as the centers of commercial and social activity.\n\nThe defendants in this case cannot rebut this observation. Indeed, the shopping center industry frequently boasts of the achievement. The industry often refers to large malls as \"'the new downtowns.'\" Note, Private Abridgment of Speech and the State Constitutions, 90 Yale L.J. 165, 168 n.19 (1980) (quoting Shopping Center World, Feb. 1972, at 52). It correctly asserts that \"the shopping center is an integral part of the economic and social fabric of America.\" International Council of Shopping Centers, The Scope of the Shopping Center Industry in the United States, 1992-1993, ix (1992).\n\nIndustry experts agree. One recent study asserted \"the suburban victory in the regional retail war was epitomized by the enclosed regional mall. . . . [Regional malls] serve as the new 'Main Streets' of the region -- the dominant form of general merchandise retailing.\" James W. Hughes \u0026 George Sternlieb, Rutgers Regional Report Volume III: Retailing and Regional Malls 71 (1991). Beyond that, one expert maintains that shopping centers have \"evolved beyond the strictly retail stage to become a public square where people gather[]; it is often the only large contained place in a suburb and it provides a place for exhibitions that no other space can offer.\" Specialty Malls Return to the Public Square Image, Shopping Center World, Nov. 1985, at 104.\n\nMost legal commentators also have endorsed the view that shopping centers are the functional equivalent of yesterday's downtown business district. E.g., James M. McCauley, Comment, Transforming the Privately Owned Shopping Center into a Public Forum: PruneYard Shopping Center v. Robins, 15 U. Rich. L. Rev. 699, 721 (1981) (\"Privately-owned shopping centers are supplanting those traditional public business districts where free speech once flourished.\"); Note, Private Abridgment of Speech and the State Constitutions, supra, 90 Yale L.J. at 168 (\"The privately held shopping center now serves as the public trading area for much of metropolitan America.\").\n\nStatisticians and commentators, however, are not needed: a walk through downtown and a drive through the suburbs tells the whole story. And those of us who have lived through this transformation know it as an indisputable fact of life, and that fact does not escape the notice of this Court.\n\nIII\n\nWe shall briefly summarize the lengthy history of the law of free speech that underlies this case. The relevant historical starting point is Marsh v. Alabama, 326 U.S. 501, 66 S. Ct. 276, 90 L. Ed. 265 (1946). In Marsh, the United States Supreme Court held that the First Amendment's guarantee of free speech was\n\nviolated when the private owners of a company town prevented distribution of literature in its downtown business district. Finding that the company town had all the attributes of a municipality, the Court held that the private owner's action was \"state action\" for constitutional free speech purposes. In a democracy, the Court recognized, citizens \"must make decisions which affect the welfare of community and nation. To act as good citizens they must be informed. In order to enable them to be properly informed their information must be uncensored.\" Id. at 508, 66 S. Ct. at 280, 90 L. Ed. at 270. The paramount right of the citizens to be informed overrode the rights of the property owners in the constitutional balance. Id. at 509, 66 S. Ct. at 280, 90 L. Ed. at 270.\n\nThe question whether citizens may exercise a right of free speech at privately-owned shopping centers without permission of the owners has been litigated extensively. The first time the question came before the Supreme Court, the Court upheld the right of free speech at shopping centers. Amalgamated Food Employees Union Local 590 v. Logan Valley Plaza, 391 U.S. 308, 325, 88 S. Ct. 1601, 1612, 20 L. Ed. 2d 603, 616 (1968). Clearly relying on Marsh, the majority in Logan Valley ruled that shopping centers are the functional equivalent of downtown business districts and that the private owners could therefore not interfere with the exercise of the right of free speech. For First Amendment purposes that interference constituted \"state action.\" The Court implied, but did not hold, that an unrestricted free speech right existed. Logan Valley was thereafter \"limited\" by Lloyd Corp. v. Tanner, 407 U.S. 551, 92 S. Ct. 2219, 33 L. Ed. 2d 131 (1972), which held that war protesters had no right of free speech at shopping centers. The Court distinguished Logan Valley, confining it to the situation in which the speech was related to shopping center activities -- a labor dispute involving one of the center's tenants -- and in which no alternative was available for the expression of views, id. at 563, 92 S. Ct. at 2226, 33 L. Ed. 2d at 139-40 -- such as the public sidewalks that surrounded the center in\n\nLloyd.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nThe Court in Hudgens v. NLRB, 424 U.S. 507, 517-18, 96 S. Ct. 1029, 1035-36, 47 L. Ed. 2d 196, 205-06 (1976), reviewing both Logan Valley and Lloyd, concluded not only that the reasoning of the latter amounted to a total rejection of the former, but that even the limited right of free speech (namely, that relating to shopping center activities) approved in Lloyd did not exist. That view was reaffirmed in PruneYard Shopping Center v. Robins, 447 U.S. 74, 81, 100 S. Ct. 2035, 2040-41, 64 L. Ed. 2d 741, 751-52 (1980). Those cases, Hudgens and Pruneyard, essentially held that the First Amendment right found in Marsh was limited to a privately-owned factory town, an entity that performed substantially all of the functions of government. Its actions were therefore akin to \"state action,\" thereby triggering First Amendment protection. Not so the actions of shopping centers, whose functional equivalence to a town was limited to the downtown business district.\n\nIt is now clear that the Federal Constitution affords no general right to free speech in privately-owned shopping centers, and most State courts facing the issue have ruled the same way when State constitutional rights have been asserted. Fiesta Mall Venture v. Mecham Recall Comm., 767 P.2d 719 (Ariz. Ct. App. 1989); Cologne v. Westfarms Assocs., 469 A.2d 1201 (Conn. 1984); Citizens for Ethical Gov't v. Gwinnet Place Assoc., 392 S.E.2d 8 (Ga. 1990); Woodland v. Michigan Citizens Lobby, 378 N.W.2d 337 (Mich. 1985); SHAD Alliance v. Smith Haven Mall, 488 N.E.2d 1211 (N.Y. 1985); State v. Felmet, 273 S.E.2d\n\n708 (N.C. 1981); Eastwood Mall v. Slanco, 626 N.E.2d 59 (Ohio 1994); Western Pa. Socialist Workers 1982 Campaign v. Connecticut Gen. Life Ins. Co., 515 A.2d 1331 (Pa. 1986); Charleston Joint Venture v. McPherson, 417 S.E.2d 544 (S.C. 1992); Southcenter Joint Venture v. National Democratic Policy Comm., 780 P.2d 1282 (Wash. 1989); Jacobs v. Major, 407 N.W.2d 832 (Wis. 1987). In most of those decisions, the courts analyzed their state constitutions and concluded that their free speech provisions protected their citizens only against state action. E.g., SHAD Alliance, supra, 488 N.E.2d 1211; Slanco, supra, 626 N.E.2d 59; Southcenter Joint Venture, supra, 780 P.2d 1282. Others relied on federal constitutional doctrine without independently analyzing their state constitutions. E.g., Citizens for Ethical Gov't, supra, 392 S.E.2d 8; Felmet, supra, 273 S.E.2d 708.\n\nCalifornia, Oregon, Massachusetts, Colorado, and Washington, however, have held that their citizens have a right to engage in certain types of expressive conduct at privately-owned malls. Of those five, only California has held that its free speech clause protects citizens from private action as well as state action and grants issue-oriented free speech rights at a regional shopping center. Robins v. PruneYard Shopping Ctr., 592 P.2d 341, 347 (Cal. 1979), aff'd, 447 U.S. 74, 100 S. Ct. 2035, 64 L. Ed. 2d 741 (1980). Massachusetts and Oregon relied on clauses other than their free speech clauses. Batchelder v. Allied Stores Int'l, 445 N.E.2d 590, 593 (Mass. 1983) (relying on state constitution's \"free-and-equal elections\" provision); Lloyd Corp. v. Whiffen, 849 P.2d 446, 453-54 (Or. 1993) (Whiffen II) (relying on state constitution's initiative and referendum provision and declining to address whether free speech clause was also source of right to collect signatures at mall). Colorado relied on its constitution's free speech provision to hold that political activists had a constitutional right to distribute literature at a privately-owned mall. Bock v. Westminster Mall Co., 819 P.2d 55 (Colo. 1991). The Bock court, however, did not dispense with a state action requirement for its free speech provision; rather, the\n\ncourt found that the mall that sought to prohibit the distribution of literature was a state actor. Id. at 62.\n\nThe Washington Supreme Court has done an about-face on this issue. In Alderwood Associates v. Washington Environmental Council, 635 P.2d 108 (1981), a majority of the court reversed an injunction prohibiting a group from collecting signatures at a mall, but only a four-Justice plurality concluded that the state constitution's free speech clause did not have a state action requirement. In Southcenter Joint Venture, supra, 780 P.2d 1282, the court, again deeply divided, rejected the plurality position in Alderwood and held that the state's free speech provision does not protect speech on private property. However, the remainder of the holding in Alderwood -- that there was a right to solicit signatures on private property under the state constitution's initiative provision -- was not disturbed. Id. at 1290.\n\nPennsylvania's position on the free speech/state action issue appeared, at one time, to accord with ours in Schmid. In Commonwealth v. Tate, 432 A.2d 1382 (1981), the Pennsylvania Supreme Court held that the state constitution's free speech provision prohibited a private university from preventing people from leafletting outside a university building in which a public symposium was being held. The court specifically held that \"the state may reasonably restrict the right to possess and use property in the interests of freedom of speech, assembly, and petition.\" Id. at 1390. Thus, the court seems to have held that there is no state action requirement in its free speech provision. In Western Pennsylvania Socialist Workers 1982 Campaign, supra, 515 A.2d 1331, however, the same court expressly stated that the state's free speech clause provided protection only from state action, id. at 1335, and held that there is no constitutional right to collect signatures in a privately-owned shopping mall. Id. at 1339. While not overruling its previous Tate decision, the Court distinguished it by concluding that the private college in Tate had turned itself into a public forum. Id. at 1337.\n\nFrom these cases we learn that the Federal Constitution does not prevent private owners from prohibiting free speech leafletting at their shopping centers because the owners' conduct does not amount to \"state action\"; that practically every state, when its constitutional free speech provisions have been asserted, has ruled the same way, again on the basis of a legal Conclusion that state action was required. We are not out-of-step, however, for as detailed above, every state that has found certain of its constitutional free-speech-related provisions effective regardless of \"state action\" has ruled that shopping center owners cannot prohibit that free speech. There have been four such rulings: California (general free speech provision), Massachusetts (free and equal election provision), Oregon (initiative and referendum provision), and Washington (initiative provision). Put differently, no state with a constitutional free-speech-related provision unencumbered by any \"state action\" requirement has allowed shopping centers to prohibit that speech on their premises. Colorado is apparently the only state that found its constitutional \"state action\" requirement satisfied in the shopping center context, and ruled on that ground that the owners' denial was unconstitutional and required that leafletting be permitted.\n\nIV\n\nIn New Jersey, we have once before discussed the application of our State constitutional right of free speech to private conduct. In State v. Schmid, 84 N.J. 535 (1980), appeal dismissed sub nom. Princeton University v. Schmid, 455 U.S. 100, 102 S. Ct. 867, 70 L. Ed. 2d 855 (1982), we held that the right conferred by the State Constitution was secure not only from State interference but -- under certain conditions -- from the interference of an owner of private property even when exercised on that private property. Id. at 559. Specifically, we held that Schmid, though lacking permission from Princetown University, had the right to enter the campus, distribute leaflets, and sell political materials. We ruled that the right of free speech\n\ncould be exercised on the campus subject to the University's reasonable regulations.\n\nWe thus held that Article I, paragraph 6 of our State Constitution granted substantive free speech rights, and that unlike the First Amendment, those rights were not limited to protection from government interference. In effect, we found that the reach of our constitutional provision was affirmative. Precedent, text, structure, and history all compel the Conclusion that the New Jersey Constitution's right of free speech is broader than the right against governmental abridgement of speech found in the First Amendment. Our holding in Schmid relied on all of these factors, id. at 557-60, presaging the criteria of later cases used to determine whether the scope of state constitutional provisions exceeded those of cognate federal provisions. E.g., State v. Hunt, 91 N.J. 338, 358-68 (1982) (Handler, J., Concurring) (explaining principles for interpreting State constitutional provisions).\n\nIn this case, we continue to explore the extent of our State Constitutional right of free speech. We reach the same Conclusion we did in Schmid : the State right of free speech is protected not only from abridgement by government, but also from unreasonably restrictive and oppressive conduct by private entities. Schmid, supra, 84 N.J. at 560. Applying the standard developed in Schmid to this very different case, we decide today that defendants' rules prohibiting leafletting violate plaintiff's free speech rights.\n\nA\n\nWe found in Schmid that Princeton University, in pursuit of its own educational mission, had invited the public to participate in the intellectual life of the University in various ways, including participation in Discussions of current and controversial issues. The University not only underlined its interest in free speech in various statements of policy, but in the imperative of extending participation beyond the student body so that both different views and groups would be heard. We found that this invitation included participation in various formal meetings of committees and clubs, invitations to both specific individuals and groups outside of the University body, and on occasion general invitations to the public. We held that all of these factors had the effect of opening up Princeton's property to a limited public use and that the activity sought to be carried on by Schmid was consonant with that use. Schmid, supra, 84 N.J. at 564-66.\n\nThe balancing of the various factors of the Schmid standard guided our determination. We also considered alternative channels available to Schmid for the communication of his ideas, not to determine the existence of a right, but rather to evaluate the extent to which Princeton could regulate that right. Given all of those premises, we concluded that Schmid's entry on the University's lands was not a trespass and reversed his conviction, based on our Conclusion that Schmid had the right of free speech on Princeton's property. We held further that Princeton's attempts to regulate and condition speech, as those regulations and conditions then existed, were invalid because they were applied without standards. But we affirmed the underlying right of Princeton to adopt reasonable regulations concerning the time, manner, and place of such speech. Id. at 567-68.\n\nSchmid set forth \"several elements\" to be considered in determining the existence and extent of the State free speech right on privately-owned property. The three factors mentioned in that opinion as the \"relevant considerations,\" id. at 563, have been the focus of the argument before us. As we noted in that case:\n\nThis standard must take into account (1) the nature, purposes, and primary use of such private property, generally, its \"normal\" use, (2) the extent and nature of the public's invitation to use that property, and (3) the purpose of the expressional activity undertaken upon such property in relation to both the private and public use of the property. This is a multi-faceted test which must be applied to ascertain whether in a given case owners of private property may be required to permit, subject to suitable restrictions, the reasonable exercise by individuals of the constitutional freedoms of speech and assembly.\n\n[Ibid. ]\n\nThe balancing of the three factors and the ultimate balance between expressional rights and private property rights was a matter of concern in Justice Schreiber's concurrence in Schmid. Noting uncertainty about whether the majority based its constitutional holding on \"a balancing process\" or on a \"dedication to the public of its property,\" id. at 576 \u0026 n.1, the concurrence concluded that the dedication of private property \"for a public use involving public Discussion,\" id. at 580, was essential to justify our holding. We need not, however, examine what a dedication to the public for public Discussion really means, for there is no property more thoroughly \"dedicated\" to public use than these regional and community shopping centers, a public use so pervasive that its all-embracing invitation to the public necessarily includes the implied invitation for plaintiff's leafletting.\n\nIn this case, the trial court held that the Schmid standard was not satisfied and, therefore, that the plaintiff had no constitutional right to leaflet at defendants' premises. New Jersey Coalition Against War in the Middle East v. J.M.B. Realty Corp., 266 N.J. Super. 195 (Ch. Div. 1993). Specifically, after analyzing the proofs, it found that the common areas were not open to the public generally, but rather that \"the public's invitation to each of the defendant malls is for the purpose of the owners' and tenants' business and does not extend to the activities of leafletting or the distribution of literature.\" Id. at 203. Furthermore, it found that the plaintiff failed to prove that the proposed activity was not discordant with the \"uses to which these shopping malls are dedicated.\" Id. at 204. If one focuses only on the owners' \"purpose\" and \"dedication,\" these findings are literally correct.\n\nGiven those findings, the trial court and the Appellate Division concluded that the requirements of Schmid were not met. They presumably believed that it would be inappropriate to further probe the possible constitutional implications of Schmid when applied to this very different case in a novel, debatable, and most\n\nimportant area of constitutional law. The tradition of our judiciary under those circumstances is generally to leave constitutional determinations of that kind to this Court, and the lower courts did just that.\n\nHowever, the lower courts' holdings and the defendants' view of the second factor of Schmid -- \"the extent and nature of the public's invitation to use that property\" -- misperceive both its essential meaning and the functional role of the standard in determining the outcome of the constitutional issue. The factual issue is the overall nature and extent of the invitation to the public, not somehow restricted to the subjective \"purpose\" of defendants' uses, and certainly not limited to whether defendants extended an explicit invitation to plaintiff to speak. The issue is whether defendants' actual conduct, the multitude of uses they permitted and encouraged, including expressive uses, amounted to an implied invitation and, if so, the nature and extent of that invitation. The functional role of the standard and its three elements is to measure the strength of the plaintiff's claim of expressional freedom and the strength of the private property owners' claim of a right to exclude such expression -- all for the ultimate purpose of \"achieving the optimal balance between the protections to be accorded private property and those to be given to expressional freedoms exercised upon such property.\" Schmid, supra, 84 N.J. at 562.\n\nWe reaffirm our holding in Schmid. The test to determine the existence of the constitutional obligation is multi-faceted; the outcome depends on a consideration of all three factors of the standard and ultimately on a balancing between the protections to be accorded the rights of private property owners and the free speech rights of individuals to leaflet on their property.\n\nB\n\nWe now examine the standard and determine the resulting balance in this case between free speech and private property rights. We find that each of the elements of the standard and\n\ntheir ultimate balance support the Conclusion that leafletting is constitutionally required to be permitted.\n\nThe normal use of these properties and the nature and extent of the public's invitation to use them (the first two elements) are best considered together, for in this case they are most closely interrelated. Our view of these two factors -- the normal use and the nature and extent of the invitation to use -- is primarily factual, but also constitutional. Factually, we find an implied invitation to leaflet. Though more complex, ultimately its existence in this case is at least as clear as it was in Schmid. Constitutionally, these two elements of the standard point strongly in the direction of a constitutional right.\n\nThe predominant characteristic of the normal use of these properties is its all-inclusiveness. Found at these malls are most of the uses and activities citizens engage in outside their homes. That predominant characteristic is not at all changed by the fact that the primary purpose of the centers is profit and the primary use is commercial. Within and without the enclosures are not only stores of every kind and size, but large open spaces available to the public and suitable for numerous uses. There is space to roam, to sit down, and to talk. The public is invited to exercise by walking through the centers before the retail stores have opened for business. There are theaters, restaurants, professional offices, meeting rooms, and almost always a community table or booth where various groups can promote causes and different activities taking place within their local area.\n\nThe invitation to the public is simple: \"Come here, that's all we ask. We hope you will buy, but you do not have to, and you need not intend to. All we ask is that you come here. You can do whatever you want so long as you do not interfere with other visitors.\" Loitering may be \"discouraged\" but the record does not contain even one instance of someone ejected on that basis. That policy, if indeed it exists, has not made the slightest dent in the centers' all-embracing invitation to come there. The multitude of non-shoppers testifies to the success of this invitation, and it is a\n\n\"success\" because the centers know that the phenomenon of \"impulse buying\" will make shoppers out of many of these non-shoppers. So people go there just to meet, to talk, to \"hang out,\" and no one stops them; indeed, they are wanted and welcome. The activities and uses, the design of the property, the open spaces, the non-retail activities, the expressive uses, all are designed to make the centers attractive to everyone, for all purposes, to make them a magnet for all people, not just shoppers. The hope is that once there they will spend. The certainty is that if they are not there they will not.\n\nThe term \"expressive uses\" is not intended necessarily to suggest free speech as that phrase is conventionally used, or some commitment of the centers to free speech simply because they have invited these uses. They are generally not the same expressive uses encouraged by Princeton University, uses that went to the core of free speech. But almost all are non-retail, non-commercial activities that most likely involve some element of speech, and some involve causes and issues. There are events to which the entire public was invited, free of charge. Each one, at some point in the event, in some way, presumably projected some message, even if mostly non-controversial.\n\nThese non-retail uses, expressive and otherwise,\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e underline the all-inclusiveness of defendants' invitation to the people.\n\nNot only are there the multiple uses ordinarily found in a downtown business district, and the invitation implied from that alone, but others that may not be found in the downtown business district, all explicitly sponsored by the shopping centers, the sum total amounting to the broadest, indefinable, almost limitless invitation. Speech is included; it is certainly not the goal, but it is inevitably found there, even if in modest portions, along with its inevitable messages, many deemed by most people -- but not all -- as non-controversial because they agree with the message. These uses, combined with the vast open spaces, the benches, the park-like settings, together carry the message that this is the place to be -- this is your community, where you can rest, relax, talk, listen, be entertained and be educated. The multiplicity of uses reflects the intention to bring the entire community -- its citizens and its activities -- into the center. The uses and invitation, in effect, reconstitute the community, conveniently, under one roof.\n\nWhile most centers apparently permit it, some of the centers explicitly authorize issue-oriented speech at community desks and community booths. The community booth policy of Woodbridge Center provides a good illustration:\n\nOur shopping center is an important part of this community. We invite members of the community to shop at Woodbridge Center and to take advantage of the numerous amenities we offer. We also make our Community Booth available to community and political organization of [sic] citizens' groups for the purpose of distributing circulars, petitions and other literature pertaining to their activities and for communication with the public regarding community affairs, subject to our rules and regulations. We have provided a Community Booth to be used for this purpose.\n\nYour presence, whether as a shopper or as a purveyor of community or political information, is welcomed; provided that you recognize and respect our right to maintain our center as clean, neat orderly, pleasant and harassment free environment for everyone.\n\nOur rules and registration form must be submitted no less than seven days prior to the desired date. Subject to availability, activities will be calendared on a first-come, first-served basis.\n\n[Plaintiff's Appendix, 149a (first and second emphasis added).]\n\nThe centers, moreover, have apparently not excluded the partisan political speech often found in voter registration drives, most of which were sponsored by party organizations or candidates, and especially found in the conduct of the candidates (and presumably their aides) as they walk through the mall.\n\nThe breadth of the invitation and of the permitted uses suggests that the real issue in this case is not the constitutional right to leaflet, but the scope of the owners' power to regulate it. Indeed, the constitutional dispute appears to be academic for the four defendants who granted plaintiff permission to leaflet on their premises. In effect, although they deny the existence of a constitutional right, their sole practical issue with plaintiff concerns the extent of regulation, plaintiff claiming it substantially and unnecessarily restrains the effectiveness of its leafletting, and defendants claiming it is essential to protect their market.\n\nWe need not devise new legal principles of general application to determine whether defendants' explicit prohibition -- wherever it existed, and to the extent there was one -- destroys the implicit invitation or vice versa. We consider both the prohibition and the invitation in our evaluation of this element of the standard and in our resolution of the constitutional question.\n\nThe almost limitless public use of defendants' property, its inclusion of numerous expressive uses, its total transformation of private property to the mirror image of a downtown business district and beyond that, a replica of the community itself, gives rise to an implied invitation of constitutional dimensions that cannot be obliterated by defendants' attempted denial of that invitation, an implied invitation that includes leafletting on controversial issues. The regional and community shopping centers have achieved their goal: they have become today's downtown and to some extent their own community; their invitation has brought everyone there for all purposes. Those purposes in fact -- regardless of their clear subjective profit motive -- go far beyond buying goods; they include not only expressive uses but so many different uses without any commonality other than the mix of uses that\n\ndefine a community, and in terms of the centers' motivation, almost anything that will bring people to the centers. This is the new, the improved, the more attractive downtown business district -- the new community -- and no use is more closely associated with the old downtown than leafletting. Defendants have taken that old downtown away from its former home and moved all of it, except free speech, to the suburbs. In a country where free speech found its home in the downtown business district, these centers can no more avoid speech than a playground avoid children, a library its readers, or a park its strollers.\n\nThus, the first two elements of the standard -- the normal use of the property, and the nature and extent of the public's invitation to use it -- point strongly in the direction of a constitutional right of speech.\n\nThe third factor, the relationship between \"the purpose of the expressional activity . . . to both the private and public use of the property,\" Schmid, supra, 84 N.J. at 563, examines the compatibility of the free speech sought to be exercised with the uses of the property. We note preliminarily that where expressive activity is permitted and therefore compatible with those uses, presumptively so is leafletting, and the burden should fall on those who claim it is not. More importantly, we find that the more than two hundred years of compatibility between free speech and the downtown business district is proof enough of its compatibility with these shopping centers. The downtown business districts at one time thrived: no one has ever contended that free speech and leafletting hurt them. The extent of their downfall has had nothing to do with free speech and leafletting. This record does not support the proposition that one dollar's worth of business will disappear because of plaintiff's leafletting even though some shoppers and non-shoppers may not like it. Furthermore, defendants' contention that leafletting on controversial issues is discordant and damaging to their purposes is inconsistent with the permission to leaflet given to plaintiff in this case by four of these centers.\n\nThese centers have full power to minimize whatever slight discordance might otherwise exist; full power to adopt rules and regulations concerning the time, place, and manner of such leafletting, regulations that will assure beyond question that the leafletting does not interfere with the shopping center's business while at the same time preserving the effectiveness of plaintiff's exercise of their constitutional right.\n\nThus, the third element of the standard -- the compatibility between the expressive activity and the purposes of that activity, and the public and private uses of the property -- points in the direction of the existence of the constitutional right.\n\nWe find that each of the elements of the standard in Schmid, the use, the invitation, and the suitability of free speech at the centers, supports the existence of a constitutional free speech right in the plaintiff and a corresponding obligation in the defendants. \"Taken together, these . . . relevant considerations\" of the \"multi-faceted\" standard set forth in Schmid lead to the Conclusion that these regional and community shopping centers must \"be required to permit, subject to suitable restrictions, the reasonable exercise by individuals of the constitutional freedoms of speech and assembly,\" here the leafletting sought by plaintiff. Schmid, supra, 84 N.J. at 563.\n\nC\n\nWe decide this case not only on the basis of the three-pronged test in Schmid, but also by the general balancing of expressional rights and private property rights. Schmid, supra, 84 N.J. at 560-62. The standard and its elements are specifically designed with that balancing in mind. A more general analysis of the balance provides a further test of the correctness of our determination.\n\nThe essence of the balance is fairly described by Justice Handler in Schmid :\n\nPrivate property does not \"lose its private character merely because the public is generally invited to use it for designated purposes.\" Nevertheless, as private property becomes, on a sliding scale, committed either more or less to public use and enjoyment, there is actuated, in effect, a counterbalancing between expressional and property rights.\n\n[Id. at 561 (quoting Lloyd Corp. v. Tanner, 407 U.S. 551, 569, 92 S. Ct. 2219, 2229, 33 L. Ed. 2d 131, 143 (1972)) (citations omitted).]\n\nOr, as stated in Marsh, \"the more an owner, for his advantage, opens up his property for use by the public in general, the more do his rights become circumscribed by the statutory and constitutional rights of those who use it.\" Marsh v. Alabama, 326 U.S. 501, 506, 66 S. Ct. 276, 278, 90 L. Ed. 265, 268 (1946), cited with approval in Amalgamated Food Employees Union Local 590 v. Logan Valley Plaza, 391 U.S. 308, 325, 88 S. Ct. 1601, 1612, 20 L. Ed. 2d 603, 616 (1968).\n\nThere is no doubt about the outcome of this balance. On one side, the weight of the private property owners' interest in controlling and limiting activities on their property has greatly diminished in view of the uses permitted and invited on that property. The private property owners in this case, the operators of regional and community malls, have intentionally transformed their property into a public square or market, a public gathering place, a downtown business district, a community; they have told this public in every way possible that the property is theirs, to come to, to visit, to do what they please, and hopefully to shop and spend; they have done so in many ways, but mostly through the practically unlimited permitted public uses found and encouraged on their property. The sliding scale cannot slide any farther in the direction of public use and diminished private property interests.\n\nOn the other side of the balance, the weight of plaintiff's free speech interest is the most substantial in our constitutional scheme. Those interests involve speech that is central to the purpose of our right of free speech. At these centers, free speech, such as leafletting, can be exercised without discernible interference with the owners' profits or the shoppers' and non-shoppers' enjoyment. The weight of the free speech interest is thus composed of a constant and a variable: the constant is the quality of\n\nfree speech, here free speech that is the most important to society; the variable is its potential interference with this diminished private property interest of the owner. Given the limited free speech right sought, leafletting accompanied only by that speech normally associated with and necessary for leafletting, and subject to the owners' broad power to regulate, that interference, if any, will be negligible.\n\nThe vindication of our State's constitutional free speech right in this case falls at least as clearly within the standard of Schmid as did the facts in that case. While the use of the campus of Princeton for free speech was a proportionately greater component of Princeton's total uses, and while Princeton had a strong institutional commitment to political free speech, the potential interference with Princeton's need to control activities on its campus and within its academic community was troublesome. Schmid, supra, 84 N.J. at 566-67. We acknowledged the sensitivity of the issue -- the overriding need of independent private universities to control their mission and to shape it without outside interference -- and our determination to respect that independence. Moreover, Princeton's commitment to free speech and its invitation to off-campus organizations and individuals is idiosyncratic, not an essential or inevitable attribute of private universities' role in society or their success. We have no doubt that other private universities may have no such constitutional obligation and assume that Princeton itself could so change its mission, commitment, and policies as to bring into question the continued existence of the free speech right, although we doubt very much that that will occur given the University's tradition and history.\n\nNo such sensitivity exists in this case; there is no need to carefully calibrate the risk of damaging the mission of these centers, for the risk is practically non-existent. More than that, the constitutional obligation in this case arises from what we have come to recognize as the essential nature of regional shopping centers -- their all-inclusive uses and their corresponding all-em\n\nbracing implied invitation to the public. For regional shopping centers, the implied expressional invitation is part of their nature, solidly embedded in their inescapable mission as the intentional successors to downtown business districts and their basic profit-making purpose. We foresee no likely change in that essential nature that would affect the elements of the standard or the ultimate balance between free speech and property rights.\n\nWe are totally satisfied that on balance plaintiff's expressional rights prevail over defendants' private property interests. We are further satisfied that the interference by defendants with plaintiff's rights constitutes unreasonably restrictive or oppressive conduct. The deprivation of free speech would affect more than a private university community, it would affect a substantial portion of the state's population.\n\nWe need not deal directly with plaintiff's common law contentions. However, in deciding the case on constitutional grounds, we draw on those sources mentioned in Hunt, supra, 91 N.J. at 363-68 (Handler, J., Concurring), including our common law. It lays a foundation that would vindicate the exercise of speech and assembly rights in this setting.\n\nIn State v. Shack, 58 N.J. 297 (1971), we ruled, on common law grounds, that two employees of federally funded organizations had the right to enter private property of an operator of a migrant labor camp to aid two migrant workers who lived and worked there. The aid included an aspect of free speech, the right to give the workers information about assistance available to them under federal statutes. By bringing migrant workers to their property, the operators of these camps created a need for free speech there that could not be denied because of its private ownership. We recognized in Shack that in necessitous circumstances, private property rights must yield to societal interests and needs, that there must be an \"accommodation between the right of the owner and the interests of the general public,\" id. at 306, that\n\nwhile society will protect the owner in his permissible interests in land, yet \". . . such an owner must expect to find the absoluteness of his property rights curtailed by the organs of society. . . . The current balance between individualism and dominance of the social interest depends not only upon political and social ideologies, but also upon the physical and social facts of the time and place under Discussion.\"\n\n[Id. at 305 (quoting 5 Powell on Real Property (Patrick J. Rohan, ed., 1970)).]\n\nWe also find as support for our Conclusions an enduring principle recognized in Marsh, a principle that remains pertinent for our purposes even though it has not been accepted in this context as a matter of federal constitutional doctrine. The principle of that case (and Logan) is that the constitutional right of free speech cannot be determined by title to property alone. Thus, where private ownership of property that is the functional counterpart of the downtown business district has effectively monopolized significant opportunities for free speech, the owners cannot eradicate those opportunities by prohibiting it.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nD\n\nLike many constitutional determinations, our decision today applies a constitutional provision written many years ago to a\n\nsociety changed in ways that could not have been foreseen. One of those changes is relatively modern: the vastly increased capability to achieve mass communication, primarily, for the moment at least, to do so through television. This emergence of television as the preeminent medium for mass communication provides no justification to deny plaintiff this constitutional right. Most fundamentally, the general right of free speech through one means has never depended on a lack of any other means; radio never diminished the right of free speech at downtown business districts.\n\nFurthermore, television is not available as a practical matter to these issue-oriented groups. In the fourth quarter of 1993 the average cost of a national thirty-second television commercial ranged from $23,000 during daytime hours to $155,000 during prime-time hours. Adweek, Marketer's Guide to Media, Fall/Winter 1993-1994, at 27 (1993). While much lower rates for smaller audiences are available, issue-oriented groups simply cannot afford an effective television campaign. The paucity of issues advertised on television proves it. The viewer will see only those issue-oriented groups with the most substantial membership and funds. There are very few.\n\nAlthough no one can confidently predict the future impact of technological developments on the free speech of these groups, television at present seems in fact to do them more harm than good. As the overwhelming medium of choice, it has somewhat diminished the impact of press coverage traditionally generated by issue-oriented groups. Television's own lack of issue coverage has been widely criticized. When they are covered, the coverage almost invariably deals with majoritarian viewpoints on issues that have engaged large sectors of the public. The little-known, often unheard of, small issue-oriented groups and their views are rarely if ever mentioned. Some may not be worth hearing, but that should give little comfort in a country born of dissidents and Dissenters. For these small groups, indeed for the country itself, television falls short in serving the core value of free speech -- the belief that the unpopular views of a minority, if heard, can in time\n\nbecome the majority view. We are a poorer nation when these small groups are silenced. The effect of the dominance of television has been to increase the need of these issue-oriented groups to reach the public through other means, and their only other practicable means is the leafletting they seek here. Justice Marshall knew it, and said it well:\n\nFor many persons who do not have easy access to television, radio, the major newspapers, and the other forms of mass media, the only way they can express themselves to a broad range of citizens on issues of general public concern is to picket, or to handbill, or to utilize other free or relatively inexpensive means of communication. The only hope that these people have to be able to communicate effectively is to be permitted to speak in those areas in which most of their fellow citizens can be found. One such area is the business district of a city or town or its functional equivalent. And this is why respondents have a tremendous need to express themselves within Lloyd's center [a regional shopping center].\n\n[Lloyd Corp. v. Tanner, 407 U.S. 551, 580-81, 92 S. Ct. 2219, 2234-35, 33 L. Ed. 2d 131, 149-50 (1972) (Marshall, J., Dissenting).]\n\nIf constitutional provisions of this magnitude should be interpreted in light of a changed society, and we believe they should, the most important change is the emergence of these centers as the competitors of the downtown business district and to a great extent as the successors to the downtown business district. The significance of the historical path of free speech is unmistakable and compelling: the parks, the squares, and the streets, traditionally the home of free speech, were succeeded by the downtown business districts, often including those areas, the downtown business districts where that free speech followed. Those districts have now been substantially displaced by these centers. If our State constitutional right of free speech has any substance, it must continue to follow that historic path. It cannot stop at the downtown business district that has become less and less effective as a public forum. It cannot be silenced \"as the traditional realm of grassroots political activity withers away.\" Curtis J. Berger, Pruneyard Revisited: Political Activity on Private Lands, 66 N.Y.U. L. Rev. 633, 661 (1991).\n\nCertainty is impossible in determining the undiscoverable intent of this century-old provision in the light of changing times. In the\n\neffort, however, we must not forget that our constitutional free speech provision is different from practically all others in the nation. Schmid proclaimed this difference and it is fundamental. In New Jersey, we have an affirmative right of free speech, and neither government nor private entities can unreasonably restrict it. It is the extent of the restriction, and the circumstances of the restriction that are critical, not the identity of the party restricting free speech. Were the government ever to attempt to prohibit free speech in the downtown business district, without doubt our Constitution would prohibit it, and in New Jersey when private entities do the same thing at these centers, our Constitution prohibits that too. We cannot determine precisely the extent of damage to free speech that will call forth our constitutional provision to prevent it, but precision is not required in this case: the damage is massive.\n\nA change of a political nature should also be considered. The recall of elected officials and the adoption or repeal of laws and constitutional provisions through initiative and referendum have become fairly common in this country, the former -- recall -- now part of New Jersey's Constitution, the latter -- initiative and referendum -- a realistic possibility.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Both depend directly on petitioning and indirectly on the persuasiveness, through free speech, of the candidate, the cause, or the petitioner. In the case of recall, over one million petitioners are required if the official is the Governor, or if a county official, the average is over 48,000 signatures, and for a district, the average is 25,000.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e As for initiative and referendum, one proposal would require over 300,000 signatures for a constitutional initiative and over 200,000 for a\n\nstatutory initiative.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Obviously, these centers are the most likely place for realizing the goals of such laws, and perhaps the only practical place. The required number of petition signers cannot be found elsewhere. These are free speech rights of the highest order, the recall provision already approved by the people. It is unthinkable that the free speech provision of our State Constitution will not protect them at these centers.\n\nWe look back and we look ahead in an effort to determine what a constitutional provision means. If free speech is to mean anything in the future, it must be exercised at these centers. Our constitutional right encompasses more than leafletting and associated speech on sidewalks located in empty downtown business districts. It means communicating with the people in the new commercial and social centers; if the people have left for the shopping centers, our constitutional right includes the right to go there too, to follow them, and to talk to them.\n\nWe do not believe that those who adopted a constitutional provision granting a right of free speech wanted it to diminish in importance as society changed, to be dependent on the unrelated accidents of economic transformation, or to be silenced because of a new way of doing business.\n\nV\n\nTwo of the defendants contend that granting plaintiff the constitutional right of free speech deprives them of their property without due process of law, takes their property without just compensation, and infringes on their right of free speech. U.S. Const. amends. I, V; N.J. Const. art. I, PP 6, 20. Each of those contentions, insofar as the Federal Constitution is concerned, was rejected in PruneYard Shopping Center v. Robins, 447 U.S. 74, 82-88, 100 S. Ct. 2035, 2041-44, 64 L. Ed. 2d 741, 752-56 (1980). Their assertion here includes the same contentions under New Jersey's Constitution, which we now reject for reasons similar to those expressed by the United States Supreme Court. Other jurisdictions that have addressed this issue have similarly relied on the federal PruneYard decision. Lloyd Corp. v. Whiffen, 849 P.2d 446, 449-50 (Or. 1992) (Whiffen II); Bock v. Westminster Mall Co., 819 P.2d 55, 62 (Colo. 1991). Insofar as invasion of private property rights is concerned, our decision in State v. Shack, 58 N.J. 297, 303-08 (1971), is similarly dispositive. We would add to the United States Supreme Court's response to the private property owners' free speech concerns (concerns underlined in Justice Powell's concurrence in PruneYard, supra, 447 U.S. at 96-101, 100 S. Ct. at 2048-51, 64 L. Ed. 2d at 761-65) that private property owners who have so transformed the life of society for their profit (and in the process, so diminished its free speech) must be held to have relinquished a part of their right of free speech. They have relinquished that part which they would now use to defeat the real and substantial need of society for free speech at their centers; they should not be permitted to claim a theoretically-important right of silence from the multitudes they have invited. No matter how it is analyzed, the right claimed by the property owners is minimal compared to that which their claim would significantly diminish.\n\nWe do not interfere lightly with private property rights, but when they are exercised, as in this case, in a way that drastically curtails the right of freedom of speech in order to avoid a relatively minimal interference with private property, the latter must yield to the former. That does not mean that one is fundamentally more important than the other, although we believe it is, but rather that here the correct resolution of the conflict between those rights is self-evident. What is involved in this case is the right of every person and of every group to make their views known, however popular or unpopular they may be, and the right of the public to hear them and learn from them. What is involved here is the fundamental speech right of a free society. The flow of free speech in today's society is too important to be\n\ncut off simply to enhance the shopping ambience in our state's shopping centers.\n\nDefendants, in advancing their private property concerns, contend that plaintiff's activities are discordant with their primary, indeed their exclusive, commercial goals. However, as noted earlier, the assertion of a negative effect on defendants' enterprises is not persuasively supported by the record. Even if the issue were in doubt on this record, it is an unavoidable consequence of their own activities. Our Constitution guarantees the right of free speech at their premises with all of its inevitable consequences; and while it also guarantees fair compensation if property is taken, there is no guarantee of compensation for the exercise of constitutional rights that does not result in even the slightest impact on business or profits.\n\nVI\n\nOur holding today applies to all regional shopping centers. That holding is based on their essential nature.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e The mammoth size of these regional centers, the proliferation of uses, the all-embracing quality of the implied invitation, and the compatibility of free speech with those uses: the inevitable presence and coexistence of all of those factors more than satisfy the three elements of the Schmid standard. Furthermore, these regional shopping centers are, in all significant respects, the functional equivalent of a downtown business district, a fact that provides further support for our holding. These are the essential places for the preservation of the free speech that nourishes society and was found in downtown business districts when they flourished.\n\nWe are aware of the differences among defendant regional shopping centers regarding the range of non-retail uses. The\n\nMall at Short Hills apparently offers only musical events, visits by Santa and the Easter Bunny, and a fitness walkers' program. The other malls offer numerous public events and generally allow community groups space to promote local activities and causes; expressive uses of various kinds are common. We emphasize, however, that these differences in the degree of public activity are not material and will not exempt a regional mall from the obligation to permit free speech activity.\n\nThe list of \"horribles\" suggested by defendants as the inevitable consequence of our holding for other forms of private property should be dealt with now, rather than in some future litigation. No highway strip mall, no football stadium, no theater, no single huge suburban store, no stand-alone use, and no small to medium shopping center sufficiently satisfies the standard of Schmid to warrant the constitutional extension of free speech to those premises, and we so hold.\n\nWe realize there may be differences of degree and that some cases might approach a closeness that would otherwise give us pause. Similar concerns apparently infused the debate among Justices of the United States Supreme Court on these issues. Addressing precisely the same concerns expressed by defendants, Justice Marshall said: \"Every member of the Court was acutely aware [in Logan ] that we were dealing with degrees, not absolutes. But we found that degrees of difference can be of constitutional dimension.\" Lloyd Corp. v. Tanner, 407 U.S. 551, 581 n.5, 92 S. Ct., 2219, 2235 n.5, 33 L. Ed. 2d, 131, 150 n.5 (1972) (Marshall, J., Dissenting). Despite the degrees, the entity to which we apply the free speech right, the\n\nregional shopping center, is clearly and easily discernible and distinguishable from all others in its constitutional satisfaction of the standard of Schmid ; it is distinguishable in its physical size, its multitude of uses, its layout, and its combination of characteristics that together compel the imposition of the constitutional obligation.\n\nThe inclusion of all regional shopping centers in our holding, justified by the facts before us and their clear application to all regional shopping centers, comports with the nature of the obligation as a constitutional command. We are unable, however, to apply that command to community shopping centers with only one such center before us, for while we believe all others share its characteristics, we are not yet sufficiently certain of that fact.\n\nThe justification for the limitation of our holding to regional shopping centers is obvious. Defendants' posited multitude of uses to which free speech would allegedly extend under our decision is without substance, as we have held. Using the constitutional analysis of Schmid, it is clear that in all of defendants' examples mentioned above, the three elements either will not be satisfied or their degree of satisfaction will be substantially lower than in a regional shopping center. Indeed, some of the locations that defendants suggest we be concerned about include but one use.\n\nTheir implied invitation is limited since the uses at those locations do not approach the multitude of uses found at regional shopping centers. Furthermore, the limited activity at such locations is such that the exercise of free speech will generate greater interference with their normal use. The common characteristic of defendants' list is crowds, but it takes much more than crowds to trigger the constitutional obligation.\n\nWe do not, and cannot, however, foreclose the possibility that in some case with unusual circumstances the free speech right may exist elsewhere, most notably at a shopping center that is neither regional nor community but that has clearly and consistently invited or permitted issue-oriented groups, candidates, and others, to leaflet.\n\nOur holding is limited to leafletting and associated speech in support of, or in opposition to, causes, candidates, and parties -- political and societal free speech. We affirmatively rule that our State Constitution does not confer free speech rights at regional and community shopping centers that go beyond such speech. In addition to some doubt -- the issue is really not before us -- whether our constitutional provision was intended to cover commercial speech in any way at all, we find this limitation the result of our\n\napplication of the elements and standard in Schmid. Commercial free speech at regional and community shopping centers is fundamentally so discordant with the purposes and uses of those centers as to disqualify it from constitutional protection. It is generally discordant: the owners and managers of the center, as well as the various tenants, carefully plan their merchandising strategy, their advertising programs, and are entitled to reap the rewards of their efforts without commercial interference, even well-intentioned commercial interference, from others. At a somewhat different level, the commercial free speech could obviously be directly in conflict with the centers' activities, uses, and success, the most obvious example being leafletting seeking to persuade shoppers and non-shoppers to go elsewhere. We will not require these centers to carefully review every application for commercial free speech and put them to the test of justifying its exclusion under some balance. It is obviously a most serious intrusion on the property interests of these owners; it does not satisfy the standard of Schmid ; it does not have State constitutional protection.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nAs for the manner of speech, our ruling is confined to leafletting and associated free speech: the speech that normally and necessarily accompanies leafletting. Plaintiff has sought no more. It does not include bullhorns, megaphones, or even a soapbox; it does not include placards, pickets, parades, and demonstrations; it does not include anything other than normal speech\n\nand then only such as is necessary to the effectiveness of the leafletting. The free speech associated with leafletting, handbilling, and pamphleteering, as commonly understood, is only that which is needed to attract the attention of passersby -- in a normal voice -- to the cause and to the fact that leaflets are available, without pressure, harassment, following, pestering, of any kind. Additionally, the sale of literature and the solicitation of funds on the spot (as distinguished from appeals found in the leaflets themselves) are not covered by the protection. In that connection, we are in accord with the reasoning of decisions in other jurisdictions. Southcenter Joint Venture v. National Democratic Policy Comm., 780 P.2d 1282, 1306 (Wash. 1989) (Utter, J., Concurring) (\"The nature of this speech activity [soliciting memberships and contributions] competed directly with the property interests of the mall owners and tenants -- who were in the retail business.\"); H-CHH Assoc. v. Citizens For Representative Gov't, 238 Cal. Rptr. 841, 859 (Cal. Ct. App. 1987), cert. denied, 485 U.S. 971, 108 S. Ct. 99 L. Ed. 2d 446 (1988) (\"Any activity seeking to solicit political contributions necessarily interferes with that function by competing with the merchant tenants for the funds of [mall] patrons.\").\n\nThese are the basic limits on the manner of exercising the kind of free speech that has been sought in this case. They are not intended at all to foreclose the owners from adopting time, place, and manner rules and regulations that impose further and greater limits -- nor are they intended to prevent the owners from granting greater rights.\n\nThere is concern, understandable concern, about the possibility of confrontation, disturbance, and even violence -- concerns not just for business, but for the safety and security of people at the premises. Freedom of speech has always had this potential, controversy being part of its nature. Defendants' fears are not fanciful, but this is hardly a novel problem. This country, and its cities, and more to the point, its downtown business districts, have successfully dealt with it and lived with it for centuries.\n\nWe do not believe our opinion will result in any harm to these centers, to their businesses, nor any less enjoyment for those who visit, shoppers and non-shoppers. The free speech we have permitted -- leafletting only, no speeches, no parades, no demonstrations -- is the least intrusive form of free speech and the easiest to control. The experience elsewhere proves the ability of those centers to absorb such speech without harm. The rare instances of disturbance resulted from circumstances most unlikely to occur here.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Obviously, we cannot guarantee that disturbances will not occur as a result of our decision. Indeed, we could not guarantee freedom from such disturbances even in the absence of a right to leaflet. However, the slim possibility of disruption is the price we all pay as citizens of this state; the danger that some will abuse their rights is a necessary result of our constitutional commitment to free speech.\n\nThe centers' power to impose regulations concerning the time, place, and manner of exercising the right of free speech is extremely broad. We assume that in most cases malls can limit the time of leafletting to specific days, and a specific number of days. Certainly no individual or group will be entitled to be\n\npresent any more often than is necessary to convey the message. Under some circumstances, however, a limitation to certain days may constitute an unreasonable regulation. For instance, a blanket prohibition against leafletting on the Saturday or Sunday before an election may be unreasonable. In addition, an otherwise innocuous day restriction may be unreasonable given peculiar characteristics of the speaker or the cause. Depending on the circumstances, and all of these comments depend on the circumstances, it may be necessary, as here, that if only one day is sought or permitted, the speech be permitted a fair portion of that day.\n\nLimits on the place of exercise of the right may perhaps properly confine the exercise of free speech rights to the parking lot, or to common sidewalks and other areas outside the enclosed malls. We do not at all, however, exclude the possibility that the leafletting, to be effective, may require access to the enclosed portion of the center. To the extent leafletting is confined to some limited space, we assume that in addition to normal voice contact with passersby, an appropriately sized sign stating the cause will be permitted. Clearly, access by competing or conflicting groups may be staggered to occur on different days, or the groups may be placed far apart.\n\nWe need not and should not go beyond that. Problems of this kind concerning regulation of free speech have traditionally been resolved either through Discussions and negotiations between the citizens involved and the government, usually the police, and if unsuccessful, then resolved by courts and counsel. We are certain that reasonable accommodations can be reached, though both sides may not be completely satisfied.\n\nWe believe that this constitutional free speech right, thus limited, will perform the intended role of assuring that the free speech of New Jersey's citizens can be heard, can be effective, and can reach at least as many people as it used to before the downtown business districts were transported to the malls.\n\nWe recognize that these centers will require time to prepare regulations and procedures concerning applications to leaflet and the activity itself. Those regulations and procedures must satisfy both the legitimate interest of the centers and the constitutional rights of the applicants, not always a simple matter. In order to give the centers time to address these and other matters, our judgment will not take effect until sixty days from the date of this decision.\n\nVII\n\nThe judgment of the Appellate Division is reversed; judgment is hereby entered, effective sixty days from the date of this decision, in favor of plaintiff declaring it has a right to leaflet on defendants' premises as described above; and judgment is entered against defendants Riverside Square Mall and The Mall at Short Hills declaring that the grant of free speech rights to plaintiff does not deprive them of the rights they have asserted under both the Federal and State Constitutions.\n\nJustices Handler, O'Hern, and Stein join in this opinion. Justice Garibaldi has filed a separate Dissenting opinion in which Justice Clifford and Judge Michels join. Justice Pollock did not participate.\n\nAPPENDIX\n\n[The following Appendix appeared as Appendix B to the opinion of the Superior Court, Chancery Division, reported at 266 N.J. Super. 195, 211 (1993).]\n\nAPPENDIX B -- LIST OF EVENTS\n\nCHERRY HILL CENTER, INC.\n\nCherry Hill Center sponsored the following public events which were open to Center patrons and other members of the public without admission charge, in the Center's common areas during 1990:\n\nBel Canto Opera Competition\n\nSpring Fashion Show\n\nEaster Bunny Arrival\n\nGlobal ReLeaf Tree Seedling Giveaway\n\nBugs Bunny 50th Anniversary Show\n\nMickey Mouse Meet and Greet\n\nBack Yard Circus\n\nFall Fashion Show\n\nTrick or Treat at the Mall\n\nSanta's Arrival\n\nSenior Citizen Thanksgiving Dinner\n\nBreakfast with Santa\n\nHoliday Musical Performers\n\nMall Walkers Blood Pressure Screening\n\nMall Walkers 5th Anniversary Salute\n\nHadassah Holiday Gift Wrap\n\nToys for Tots\n\nVisit Santa Claus\n\nSinging Santa for the Hearing Impaired\n\nGrand Re-Opening with the New Jersey Pops\n\nFashion Spectacular\n\nSnoopy's Greatest Adventures\n\nThe Jones New York Collection\n\nConcert by the New Jersey Youth Symphony\n\nVoter Registration Campaign\n\nWOODBRIDGE CENTER\n\nWoodbridge Center sponsored the following public events which were open to Center patrons and other members of the public without admission charge in the Center's common areas during 1990:\n\nIce Sculpture event\n\nHadassah Gift Wrap\n\nBoat and Leisure Living Show\n\nFashion Show\n\nBunny Arrival\n\nPancake Breakfast\n\nNew Jersey Youth Symphony\n\nNJAEYC\n\nSt. Elizabeth's Hospital Cholesterol Screening\n\nGlobal ReLeaf Tree Giveaway\n\nMademoiselle Fashion Show\n\nVacation Show\n\nBaby Fest\n\nFather's Day Freeze Modeling\n\nNew Jersey Pops Concert Series\n\nMickey and Minnie Breakfast\n\nMuppet Traffic Safety Show\n\nChildren's Fashion Show\n\nNewark Museum Workshop\n\nNinja Turtle Show\n\nFall Fashion Show\n\nSafe Halloween Parade\n\nSanta's Arrival\n\nHoliday Community Entertainment\n\n1990 Car Show\n\n16th Annual U.S. Marine Corp. Toys for Tots\n\nLIVINGSTON MALL\n\nLivingston Mall has sponsored the following events at the Mall in 1990 to which the general public was invited without charge:\n\nBoat \u0026 Leisure Show\n\nBridal Fair\n\nBridal Fashion Show\n\nSpring Fashion Shows\n\nEaster Bunny Visits Mall\n\nHand Made in America Craft Show\n\nChild ID Day\n\nProm Fashion Show\n\nVoter Registration Drive\n\nHome Show\n\nJuvenile Diabetes Walk-a-thon\n\nTrick or Treating in the Mall\n\nSanta Arrives\n\nSanta Visits Mall\n\nStory Hours\n\nHoliday Entertainment Programs\n\nROCKAWAY TOWNSQUARE\n\nRockaway Townsquare sponsored the following events at the mall in 1990 to which the general public was invited without charge:\n\nAntique Show\n\nAnnual Bridal Festival\n\nBridal Fashion Event\n\nBoat Show\n\nSpring Fashion Event\n\nEaster Bunny Photos\n\nCholesterol Screening\n\nMeet \u0026 Greet Mickey \u0026 Minnie Mouse\n\nProm Fashion Event\n\nDouble Dare Road Show\n\nJail-a-thon for Cancer\n\nLeisure Living Show\n\nMeet \u0026 Greet Bart Simpson\n\nGerman Band Performance\n\nBack to School Fashions\n\nFall Fashion Event\n\nCrime Prevention Day\n\nHandmade in America Show\n\nSanta's Arrival Breakfast\n\nPhotos with Santa\n\nChoral Groups\n\nMONMOUTH MALL\n\nMonmouth Mall has sponsored the following events at the mall during 1990 and 1991 to which the public was invited free of charge:\n\n1990:\n\nMonmouth County Census Bureau Display\n\nChildren's Dental Health Promotion Day\n\nWorld Gym Aerobics Presentation\n\nSpring Fashion Show\n\nPhotos with the Easter Bunny\n\nFreeze Modeling\n\nSpring Community Fair\n\nSummer Sidewalk Sale\n\nFall Fashion Show\n\nHalloween Celebration, With Trick-or-Treating for the Children\n\nPhotos with Santa\n\n\"Sounds of Christmas\" Performances\n\n\"Making Music\" Holiday Concert\n\nPiano Recital\n\n1991:\n\n4H -- Seeing Eye Dog Mall Walk\n\nSt. Patrick's Day 5k Run at the Mall\n\nFree \"Video Postcards From Home\" to the troops in the Gulf Program\n\nBerlin Wall Exhibit\n\nLighting of the Christmas Tree\n\nSavvy Shopper Sidewalk Sale\n\nPhotos of the Easter Bunny\n\nAfter Hours Savvy Shopper Fashion Show/Cocktail Hour\n\nHalloween at the Mall\n\nSanta Photos Campaign\n\nSanta Entertainment\n\nSpring Fashion Show\n\nJuly Sidewalk Sale\n\nFall Fashion Show\n\nHoliday Choral Concerts\n\nAppearance by Soap Opera Character Jackson Montgomery of \"All My Children\"\n\nTHE MALL AT MILL CREEK\n\nThe following activities of non-profit organizations occurred at The Mall at Mill Creek:\n\n1989:\n\nNew Jersey Prosecutor's Victim and Witness Association -- Information for Crime Victims\n\nSecaucus Recreation Department Art Display\n\nMeadowlands Hospital Medical Center Health Fair\n\nMarch of Dimes Event\n\nDeborah Hospital Foundation Gift Wrap\n\n1990:\n\nAmerican Cancer Society Daffodil Sale\n\nBradley for U.S. Senate Voter Registration Drive\n\nFairleigh Dickinson University Information\n\nMarch of Dimes Information\n\nPSE \u0026 G Information\n\nSecaucus Chapter of Deborah Raffle Sale\n\nSecaucus Lions White Cane Drive\n\nU.S. Naval Sea Cadets Recruitment\n\nU.S. Army Recruiting Information\n\nNew Jersey Prosecutor's Victims and Witness Association Information disseminated to the public\n\nU.S. Veterans of Foreign Wars Recruiting\n\nSecaucus High School Art Expo\n\nAmerican Cancer Society Jail-A-Thon\n\nThe Mall at Mill Creek sponsors a \"Merry Milers Mall Walk\". Participants in this event have access to the Mall during hours when the Mall shops are not yet open for business as well as during regular business hours. There is no requirement that a person shop at the Mall in order to participate in this event.\n\nRIVERSIDE SQUARE SHOPPING CENTER\n\nRiverside Square has sponsored the following events over the last two years:\n\n1989:\n\nBusiness and Finance Show\n\nSpring Fashion Show\n\nEaster Bunny Show\n\nSpring Events\n\nSpring Kidfest\n\nSpringbreak Kidsfest\n\nHome and Garden Show\n\nWorking Woman Show\n\nWorking Woman Seminar\n\nBergen County Read-In Festival\n\n5th Annual Dell New Jersey Crossword Open\n\nSummer Concert Series\n\nBack-To-School Series\n\nFashion Show\n\n8th Annual \"Riverside Rapids\" Speed Chess Tournament\n\nHome Show\n\nHalloween Kidsfest\n\nHoliday Entertainment (Nov. 29, 1989 -- Dec. 21, 1989)\n\n1989 U.S. Marine Corps. Toys for Tots Drop Box\n\n1990:\n\nWinter Antique Show\n\n\"Today's Youth\" Art Show\n\nSpring Fashion Show\n\nEarth Day Celebration\n\nVictorian Garden party\n\n6th Annual Dell New Jersey Crossword Open\n\nGreat Outdoors Summer '90 Expo\n\nSummer Antique Show\n\nMusic Festival: 5 Mondays (July 1990 -- Aug. 1990)\n\nBack-to-School Kidsfest 1990\n\nFall Career Fashion Show\n\nGreat Scotland Festival\n\n9th Annual Invitational Masters Speed Chess Tournament\n\nCounty Craft Festival\n\n\"Picasso of Pumpkins\" Show\n\nHalloween Activities Day\n\nHoliday Entertainment (Nov. 28, 1990 -- Dec. 24, 1990)\n\nMost of the events took place during regular mall hours but a few occurred when the mall stores were closed and several occurred in The Meeting Room. Riverside Square has a meeting room called \"The Meeting Place,\" which may be used for a fee by the general public. The Meeting Place can fit up to 150 people and is available for bookings Monday through Fridays from 8 A.M. to 12 noon, 1 P.M. to 5 P.M., and 6 P.M. to 9:30 P.M., and Saturday from 8 A.M. to 12 noon, and 1 P.M. to 5 P.M. All bookings must be made in advance and approved by management.\n\nSHORT HILLS MALL\n\nShort Hills has sponsored the following events in 1990 and 1991:\n\nMini Symphony performance of June 4\n\nMorris Nanton Jazz Trio\n\nString Ensemble of June 25\n\nSeptember Fall Concert Series\n\n1. Nelson Riddle Orchestra\n\n2. Tommy Dorsey Orchestra\n\n3. Classical Beethoven and Bach\n\n4. Guitars of Splendor\n\n5. Glenn Miller Orchestra\n\n6. Morris Nanton Jazz Trio\n\n7. Piano Concerto\n\n8. Classical Mozart by mini-symphony\n\nSpecial Performance of Count Basie Orchestra\n\nSanta Claus\n\nPeter Rabbit Easter program and display\n\nValentine's Day piano concert series\n\nThese events were scheduled during mall hours. The September concert series was held on eight consecutive Sundays from 2 P.M. to 3 P.M.\n\nShort Hills sponsors a fitness walk program, which allows access to the mall before daily business hours, from 7:30 A.M. until 10:00 A.M. The program is sponsored in cooperation with the Morristown Memorial Hospital and open to all members of the public who register in writing and receive a license. Over two hundred people have registered with the mall for the program.\n\nQUAKERBRIDGE MALL\n\nThe Quakerbridge Mall sponsored the following public events at the mall in 1990 to which shoppers and other members of the general public were invited without an admission charge:\n\nAntique Show\n\nJanuary Sidewalk Sale\n\nColonial Arts Show\n\nBoat Show\n\nBridal Fair\n\nInterior Design Show\n\nNew Car Show\n\nBoy Scouts of America\n\nHome and Garden Show\n\nAntique and Collectibles Show\n\nFFA Floral Design Show\n\nBunny Arrival\n\nSpring Freeze Modeling\n\nInvestment Show\n\nHealth and Fitness Show\n\nIris Sale\n\nFall Kids Show\n\nBack To Fall Fashion Show\n\nMDA Telethon\n\nFall Travel Show\n\nHome and Energy Show\n\nWinter Survival Show\n\nHoliday Gifting Show\n\nHoliday Tables Show\n\nSanta's Arrival\n\nBreakfast with Santa\n\nThe Quakerbridge Mall had a community day in 1990 where approximately ten non-profit and non-commercial groups, including the American Cancer Society, were present. Each group had its own table located in the common area and was permitted to speak to persons and hand out literature only to persons who approached their tables. No political or religious groups were allowed to participate in community day.\n\nOn one occasion, the Quakerbridge Mall allowed representatives of Rider College to come to the mall and set up a tax information table at which visitors' questions about tax matters were answered.\n\nThe Muscular Dystrophy Association sponsored a telethon which was held in the common area of the Quakerbridge Mall. A regional phone bank was set up and entertainment was provided. Information about mall activities and tenant shops was provided by the mall.\n\nOn one occasion, the Quakerbridge Mall's Merchant's Association and Lawrence Township jointly sponsored an exhibition and display of local municipal groups such as the volunteer fire department\n\nand the volunteer emergency medical technicians. No fund-raising was conducted.\n\nDuring the holiday season, choirs sing at the Quakerbridge Mall and provide entertainment.\n\nThe Merchant's Association of Quakerbridge Mall sponsors a mall walkers program jointly with a local area hospital. Participation is open to the public. No cost or purchase is necessary. The mall is opened at 8 A.M. on weekdays and Saturdays for the convenience of tenants and their employees. Members of the mall walkers program may walk in the mall at this time provided they display a membership button at all times.\n\nHAMILTON MALL\n\nThe Hamilton Mall has sponsored the following public events at the mall in 1990 to which shoppers and other members of the general public were invited without an admission charge:\n\nWinter Clearance Sidewalk Sale\n\nRetirement Show and Band performance\n\nValentine's Celebration/Bridal Fair \u0026 Fashion Show\n\nColonial Arts Show\n\nSpring Home and Garden Show\n\nAtlantic City Magazine Restaurant Gala Fashion Show\n\nEaster Bunny Arrival Parade and Spring Freeze Modeling\n\nYour Cholesterol Counts\n\nDay Of The Young Child\n\nAuto Show\n\nShowcase of Services\n\nWomen of the 90's Show\n\nRNS Mother's Day Celebration\n\nArts and Crafts Show\n\nMaster Artists Tour\n\nToys For Dads\n\nRose Show\n\nAntique Shoe/Father's Day Event\n\nInformal Modeling At The Atlantic City Race Course\n\nHamilton Mall Night At The Races\n\nThe Artie Shaw Band Performance and Mallwalker Club\n\nReception\n\nACC Day At The Mall\n\nKey To Success Seminar\n\nHealth To You Show\n\nTV 40 Grand Prize Drawing\n\nKey To Success Phase II Awards\n\nBoat Show\n\nToddler Tryouts\n\nFall Home Show\n\n4-H Day At The Mall\n\n1991 Auto Preview\n\nHalloween Trick or Treat and Costume Contest\n\nOrchid Society Show\n\nSanta's Arrival\n\nCoastal Cops Celebration Holiday\n\nHoliday Fashion Extravaganza\n\nWKTU Charity Day\n\nShopper Service Day\n\nAfter complying with every requirement set forth in the guidelines for non-commercial activity, the Kiwanis and Girl Scouts were permitted to use the Community Booth at the Hamilton Mall in a manner consistent with the mall's policies. A non-partisan voter registration drive was held on consecutive Saturdays in September 1990 and was sponsored by the Atlantic Area Business and Professional Women, Inc.\n\nThe mall also coordinates with local businesses a program for children ages six to twelve called \"Coastal Cops\". The activities include a clean-up effort of the area's benches.\n\nHamilton Mall Merchant's Association sponsors a mall walkers program. Participation is open to the public. No cost or purchase is necessary. The mall is opened as early as 7 A.M. on weekdays and Saturdays for the convenience of tenants and their\n\nemployees. Members of the mall walkers program may walk in the mall at this time provided they display a membership button at all times.\n\nGARIBALDI, J., Dissenting.\n\nToday the Court holds that the New Jersey Constitution requires that owners of privately-owned-and-operated shopping malls who invite the public onto their property for commercial purposes must allow the public free access to that property to engage in unrestricted expressional activities, including, through the distribution of leaflets and petitions to shoppers, the promotion of various political or social views. To reach that Conclusion, the majority distorts the test announced in State v. Schmid, 84 N.J. 535, 563 (1980); dismisses completely the rights of private-property owners to regulate and control the use of their own property; disregards the trial court's findings of fact, developed after an extensive eleven-day trial; and instead relies primarily on old theories that the United States Supreme Court and most other state courts long ago discarded.\n\nUnder the majority's rudderless standard, whether property is owned privately or publicly is irrelevant; whether the message is discordant with the private property's use and purpose likewise makes no difference; and whether less-convenient but equally-accessible and -effective means of distribution exist is of no moment. So long as the private property, here a shopping mall, offers an opportunity for many people to congregate, the private-property owners must grant those people free access for expressional activity, regardless of the message or of its disruptive effect. Although the Court duly notes that such access will be subject to reasonable restrictions of time, place, and manner, ante at (slip op. at 70-73), its opinion reveals that the restrictions will be minimal and will present more problems and lawsuits than they will solve.\n\nI\n\nThe United States Supreme Court has held that the First Amendment allows the owners of private shopping malls to bar the distribution of political literature on mall property. See PruneYard Shopping Ctr. v. Robins, 447 U.S. 74, 100 S. Ct. 2035, 64 L. Ed. 2d 741 (1980); Hudgens v. NLRB, 424 U.S. 507, 96 S. Ct. 1029, 47 L. Ed. 2d 196 (1976); Lloyd Corp. v. Tanner, 407 U.S. 551, 92 S. Ct. 2219, 33 L. Ed. 2d 131 (1972). However, the Supreme Court has held that a state's constitution may furnish an independent basis that surpasses the guarantees of the federal constitution in protecting individual rights of free expression and assembly. PruneYard, supra, 447 U.S. at 81, 100 S. Ct. at 2039-40, 64 L. Ed. 2d at 752. The vast majority of states do not require that privately-owned shopping malls grant free access for expressional activity on their property. Ante at (slip op. at 29).\n\nFour provisions of Article I of the New Jersey Constitution are at issue: Paragraph 1, which concerns the unalienable right to acquire, possess, and protect property; Paragraph 20, which provides that individual persons or private corporations cannot take private property for public use without just compensation; Paragraph 6, which gives the right to speak, write, and publish freely; and Paragraph 18, which guarantees the right to assemble. We addressed the conflict between those provisions in Schmid, supra, 84 N.J 535. However, breaking with our decision in that case, the majority engages in no balancing of those competing constitutional provisions; instead, the majority relies on only the free-speech and assembly provisions, ante at (slip op. at 3), ignoring completely the private-property provisions. In so doing, it turns its back on our holding in Schmid.\n\nSchmid involved a person's free-speech rights on the private property of Princeton University. Although situated on private property, Princeton was traditionally a forum for the free exchange of ideas, and Princeton endorsed that tradition as part of its educational mission. We therefore found it appropriate to permit Schmid free access to the University's private property to\n\nexpress his political views. Rather than endorse ad hoc determinations, we established a rational test under the New Jersey Constitution that balanced the rights of private-property owners and the expressional freedom of others on that private property.\n\n[The] test to be applied to ascertain the parameters of the rights of speech and assembly upon privately owned property and the extent to which such property reasonably can be restricted to accommodate these rights involves several elements. This standard must take into account (1) the nature, purposes, and primary use of such private property, generally, its \"normal\" use, (2) the extent and nature of the public's invitation to use that property, and (3) the purpose of the expressional activity undertaken upon such property in relation to both the private and public use of the property.\n\n[84 N.J. at 563.]\n\nUsing a test essentially the same as Schmid, the Pennsylvania Supreme Court established, in Commonwealth v. Tate, 432 A.2d 1382 (1981), \"a limiting rationale for applying [the Pennsylvania] constitution's rights of speech and assembly to property private in name but used as a forum for public debate.\" Western Pa. Socialist Workers 1982 Campaign v. Connecticut Gen. Life Ins. Co., 515 A.2d 1331, 1336 (Pa. 1986) (discussing Tate). The Tate court overturned a trespass conviction for distributing pamphlets on a college campus. 432 A.2d at 1391. Yet when the court reviewed a subsequent case concerning an alleged constitutional right of access to a shopping mall, it recognized that unlike a university, the shopping mall was not a public forum for political expression. Western Pa. Socialist Workers, supra, 515 A.2d at 1337. The court found that the mall \"is operated as a market place for the exchange of goods and services but not as a market place for the exchange of ideas.\" Ibid. That rationale is entirely consistent with the Schmid Court's own finding that \"Princeton University's raison d'etre is more consonant with free speech and assembly principles than a shopping center's purposes might be * * *.\" 84 N.J. at 551. Unlike universities, shopping malls are not public forums dedicated to public use or to the exchange of ideas.\n\nII\n\nAlthough the majority alleges that it is adhering to Schmid, its opinion discloses that it is not. Indeed, the majority has forgotten the primary premise of Schmid, that a balance must be found between the rights of private-property owners and the expressional freedom of others on that property. A proper application of Schmid supports the trial court's judgment, which the Appellant Division affirmed, that the mall owners may bar Coalition from distributing its leaflets in the malls.\n\nAfter a close and careful examination of the normal use of each mall and the public invitation each mall extended, the trial court set forth its factual findings. The first prong of the Schmid test requires a court to take into account the nature, purposes, and primary use of the private property -- its \"normal\" use. In that regard, the trial court concluded:\n\nIt is this court's opinion that that question may be answered unequivocally. The nature, purpose and primary use of the malls is commercial. The shopping malls are retain establishments, constructed, designed and maintained to do business and make a profit. I did not hear one fact at trial which controverts or contradicts this finding. The plaintiff offered no proofs which will lead this court to any other Conclusion.\n\n[266 N.J. Super. 195, 200 (Law Div. 1991)\n\n(emphasis added).]\n\nMoreover, the trial court found \"from all of the credible evidence [that] has been offered at this trial that each of these ten malls has dedicated its facilities and property to its primary purpose, that is, business and commercial ventures.\" Ibid.\n\nIn respect of the second Schmid factor, the extent and nature of the public's invitation to use the private property, the trial court stated:\n\nFrom the credible evidence offered by the defendants, that is, the testimony of mall managers, designers and planners, I find that the public's invitation to each of the defendant malls is for the purpose of the owners' and tenants' business and does not extend to the activities of leafletting or the distribution of literature.\n\n[Id. at 203 (emphasis added).]\n\nAdditionally, the trial court determined that \"the primary purpose of each and every one of the activities listed [e.g., free concerts, Earth Day celebrations, and Girl Scout Cookie sales] * * * is to\n\ndraw people to the mall and thereby maximize sales and increase profits.\" Id. at 202.\n\nDespite the trial court's findings, the majority baldly asserts that the mall owners issued an invitation to the public to use their private property \"to do what they please\" and granted \"practically unlimited permitted public uses * * * on their property.\" Ante at (slip op. at 50). Under the majority's reasoning, the nature and extent of the invitation is of no moment. By the majority's analysis, any time the public is invited onto large, privately-owned property, it becomes a place to congregate and therefore becomes the functional equivalent of a downtown area. In Lloyd Corp., supra, the United States Supreme Court rejected the \"functional equivalent\" analysis, finding:\n\nThe invitation is to come to the Center to do business with the tenants. It is true that facilities at the Center are used for certain meetings and for various promotional activities. The obvious purpose, recognized widely as legitimate and responsible business activity, is to bring potential shoppers to the Center, to create a favorable impression, and to generate goodwill. There is no open-ended invitation to the public to use the Center for any and all purposes, however incompatible with the interests of both the stores and the shoppers whom they serve.\n\n[407 U.S. at 564-65, 92 S. Ct. at 2227, 33 L. Ed. 2d at 140.]\n\nAs the Supreme Court further explained, \"Nor does property lose its private character merely because the public is generally invited to use it for designated purposes.\" Id. at 569, 92 S. Ct. at 2229, 33 L. Ed. 2d at 143. See also Schmid, supra, 84 N.J. at 561.\n\nIgnoring the trial court's detailed factual findings, the majority rewrites Schmid, lumps the first two factors together into one, and continually misapprehends the test. Ante at (slip op. at 40). The majority repeatedly refers to the first factor as the \"normal\" use, but ignores the language prior to that: \"the nature, purposes and primary use of the private property.\" The primary use of a shopping mall is shopping, an obvious fact that the majority fails to understand.\n\nIndeed, strikingly absent from the majority opinion is any awareness that the primary users of shopping malls are shoppers.\n\nWe should not lose sight of the fact that persons who own and operate shopping malls are merchants. As such they should not be required to provide forum, place, or occasion for speech making, petition signing, parades, or cracker barrels, to discuss local or global events. They are in business for business sake. They are not municipalities, states, or villages, and however romantic it may be to believe that the public repair to these galvanic places, of a Saturday morning, for more than bread and salt, they are not yet instruments of the state.\n\n[Western Pa. Socialist Workers, supra, 515 A.2d at 1341 (McDermott, J., Concurring).]\n\nIn contrast to the purpose of a shopping mall, the primary purpose of a university is to educate, i.e., to increase the wealth of human knowledge, which can be done only through discourse and Discussion, free and open debate. That is the significant difference between Princeton University and The Mall at Short Hills. Shopping can be accomplished even with mouths shut and minds closed.\n\nThe majority ignores any distinction between the purpose of Princeton and the purpose of a mall. \"We need not, however, examine what a dedication to the public for public Discussion really means, for there is no property more thoroughly 'dedicated' to public use than these regional and community shopping centers * * *.\" Ante at (slip op. at 37). Therefore, under the majority's reasoning, whether the property, like Princeton University, was dedicated to the public for public Discussion is irrelevant. All that matters is that the property was open to the public, as is a shopping mall or any other large gathering space. An example of a publicly-accessible place that will become an open forum for expression under the majority's analysis is Great Adventure Theme Park. That result is plainly absurd.\n\nThe third prong of the Schmid analysis directs a court to consider the \"purpose of the expressional activity undertaken upon such property in relation to both the private and public use of the property\". 84 N.J. at 563. That requires determining \"whether the expressional activities undertaken * * * are discordant in any sense with both the private and public uses of the [property at issue].\" Id. at 565. The trial court found that the \"plaintiffs have not met their burden of proving\n\nthat their activities are not discordant with both the public and private uses to which these shopping malls are dedicated.\" 266 N.J. Super. at 204.\n\nObviously, the expressed purpose of plaintiffs' activity was to oppose the war in the Middle East, a purpose totally unrelated to the mall owners' commercial purposes and to their invitation to the public to shop there. Additionally, confrontations between groups advocating opposing views on a controversial political or social topic are likely, and those groups' purposes will clearly be discordant with shopping. The abortion debate is an easily-identifiable issue to consider under the Court's opinion. Clearly, a mall allowing a pro-choice group to distribute pamphlets will face opposition from pro-life groups. Yet under the majority's opinion, a mall owner could not restrict such groups from its private property.\n\nWhen advocates press hotly-contested political and social issues, confrontation is an easily-foreseen outcome. In Cologne v. Westfarms Associates, 469 A.2d 1201 (Conn. 1984), a mall refused to permit members of the Ku Klux Klan to rally there. After the Klan's departure, however, a number of anti-Klan demonstrators, responding to reports of the intended appearance of the Klan, engaged in a heated demonstration outside the mall building. Police from several area towns and the state police were necessary to bring the situation under control. The demonstration resulted in the closing of some shopping-mall doors for the day.\n\nAs one of the defendants stated in its brief:\n\nShould the Ku Klux Klan in their flowing white robes or the Black Separatists in their paramilitary gear be permitted on the mall's property? These groups would offend even the most tolerant of shoppers. What shopper does not have an opinion on abortion, so that same question applies to pro-choice and pro-life advocates with their gruesome displays. Should an animal rights group, regardless of its graphic illustrations, be permitted near a pet shop or fur salon? Should the Vietnam Veterans and SANE be permitted to conduct activities on the same day in proximity to each other? What standards should a mall manager use when considering the graphic portrayal on a placard, when measuring the strong language in a leaflet or when evaluating the appropriateness of a costume or\n\nclothing? Aside from \"controversial\" issues, a host of content-based questions arise once politicians, religious groups, charities and \"causes\" invade the mall.\n\nEach mall owner will have to answer those subjective questions, as well as many others, on a daily basis. Although the majority recognizes the difficulty in preparing regulations and procedures concerning leafletting in the malls, ante at (slip op. at 74) (granting sixty day stay), they provide no standards for the mall owners to use in resolving those problems. Moreover, regardless of the standards used, each mall owner will be second-guessed and litigation concerning the private owner's decision will ensue. Public officials may have to face those issues in granting parade permits, but private-property owners should not be forced to decide those value-laden questions.\n\nThe morass that the majority opinion will produce is already demonstrated in the troubles that arise when public officials must determine what constitute legitimate time, place, and manner restrictions on the free expression of ideas on public property. See, e.g., National Socialist Party of Am. v. Village of Skokie, 432 U.S. 43, 97 S. Ct. 2205, 53 L. Ed. 2d 96 (1977). Private-property owners should not be compelled to face the same challenges when they decide which groups may or may not champion their causes at these privately-owned-and-operated shopping malls.\n\nIII\n\nTo circumvent the detailed and meticulous findings of the trial court, the majority departs from the Schmid test and argues that shopping malls are the \"functional equivalent\" of the traditional downtown business districts or town squares. Ante at (slip op. at 25, 46). In support of that theory, the majority relies on \"common knowledge\" of the Court outside the record, ignoring the factual findings of the trial court and evidence that many of the towns in Essex, Hudson, and Morris Counties around the malls have become more, not less, vibrant.\n\nUnder the majority's theory, private property becomes municipal land and private-property owners become the government.\n\nThe United States Supreme Court discredited that proposition over twenty years ago, Lloyd Corp., supra, 407 U.S. 551, 92 S. Ct. 2219, 33 L. Ed. 2d 131, and likewise almost every state court that has considered it has discarded it. See, e.g., Fiesta Mall Venture v. Mecham Recall Comm., 767 P.2d 719 (Ariz. Ct. App. 1989); Cologne, supra, 469 A.2d 1201; Citizens for Ethical Gov't, Inc. v. Gwinnett Place Assocs., 392 S.E.2d 8 (Ga. 1990); Woodland v. Michigan Citizens Lobby, 378 N.W.2d 337 (Mich. 1985); SHAD Alliance v. Smith Haven Mall, 488 N.E.2d 1211 (N.Y. 1985); State v. Felmet, 273 S.E.2d 708 (N.C. 1981); Eastwood Mall v. Slanco, 626 N.E.2d 59 (Ohio 1994); Western Pa. Socialist Workers, supra, 515 A.2d 1331; Charleston Joint Venture v. McPherson, 417 S.E.2d 544 (S.C. 1992); Southcenter Joint Venture v. National Democratic Policy Comm., 780 P.2d 1282 (Wash. 1989); Jacobs v. Major, 407 N.W.2d 832 (Wis. 1987).\n\nTo reach its Conclusion, the Court relies on the long-overruled statement in Logan Valley that shopping centers are the functional equivalent of downtown areas. See Amalgamated Food Employees Union Local 590 v. Logan Valley Plaza, 391 U.S. 308, 318, 88 S. Ct. 1601, 1608, 20 L. Ed. 2d 603, 612 (1968). The Logan Valley Court, in turn, based its holding on Marsh v. Alabama, 326 U.S. 501, 66 S. Ct. 276, 90 L. Ed. 265 (1946), and found an analogy between the sidewalks and parking areas of a shopping mall and the company town in Marsh. As we noted in Schmid, supra, 84 N.J. at 550, Lloyd Corp. repudiated Logan Valley. Nevertheless, the majority, like the Logan Valley Court, contends that plaintiffs here should have access to the shopping malls just as the Court gave the petitioner in Marsh access to the business district. Indeed, the majority relies on the discredited reasoning of Logan Valley and of the Dissents in Lloyd Corp. and Hudgens. Ante , , , (slip op. at 54, 55, 57, 65).\n\nAlthough I question whether Marsh still has validity, a \"company town\" is easily distinguishable from a shopping mall. Justice\n\nBlack, who wrote Marsh, aptly pointed out the difference in his Logan Valley Dissent:\n\nBut Marsh was never intended to apply to this kind of situation. . . . I can find very little resemblance between the shopping center involved in this case and Chickasaw, Alabama.\n\n[391 U.S. at 330-32, 88 S. Ct. at 1615, 20 L. Ed. 2d at 619-20 (emphasis added).]\n\nThe United States Supreme Court adopted that position in Lloyd Corp., effectively rejecting Logan Valley 's \"functional equivalent\" rationale. 407 U.S. at 569, 92 S. Ct. at 2229, 33 L. Ed. 2d at 143; see also Fiesta Mall, supra, 767 P.2d 719 (rejecting functional equivalent argument). To borrow from Lloyd Corp., \"the instant case provides no comparable assumption or exercise of municipal functions or powers.\" Ibid. Additionally, the Fiesta Mall court, relying on Lloyd Corp., found that shopping malls\n\nare not the functional equivalent of towns. They are simply areas in which a large number of retail businesses is grouped together for convenience and efficiency. Their sole purpose is for shopping, and appellant's argument that they are opened early for joggers and walkers, that large numbers of people are present in them each day, that occasionally non-commercial activities take place in them and that people enjoy air- conditioned comfort in them during Phoenix's scorching summers does not change that basic fact.\n\n[767 P.2d at 724.]\n\nRelying on the functional-equivalent test, yet paying lip service to Schmid, the Court writes:\n\nNo such sensitivity exists in this case; there is no need to carefully calibrate the risk of damaging the mission of these centers, for the risk is practically non-existent. More than that, the constitutional obligation in this case arises from what we have come to recognize as the essential nature of regional shopping centers -- their all-inclusive uses and their corresponding all-embracing implied invitation to the public. For regional shopping centers, the implied expressional invitation is part of their nature, solidly embedded in their inescapable mission as the intentional successors to downtown business districts and their basic profit-making purpose. We foresee no likely change in that essential nature that would affect the elements of the standard or the ultimate balance between free speech and property rights.\n\n[Ante at (slip op. at 51-52)].\n\nThe inescapable mission of shopping malls is not to be the successor to downtown business districts; rather, it is to provide a comfortable and conducive atmosphere for shopping, a mission into which mall owners have invested large sums and energy.\n\nCommon sense also dictates that privately-owned-and-operated shopping malls are not the functional equivalent of downtown business districts. They are not \"replicas of the community itself.\" Ante at (slip op. at 45). Shopping malls do not have housing, town halls, libraries, houses of worship, hospitals, or schools. Nor do they contain the small stores, such as the corner grocer, that used to serve as the forum for exchange of ideas. Indeed, most shopping malls do not allow people even to walk their dogs there.\n\nThe shopping mall is not a community. There is no \"mayor of the mall.\" Shoppers do not elect a common council. They do not have a say in the day-to-day affairs of the mall, nor do they expect one. They do not visit the mall to be informed or to inform others of social or political causes; they go to shop. Even though the malls sponsor community events, visits from Santa, and orchestral concerts, visitors do not mistake them for grassroots gathering places, Santa's Workshop, or a mecca of the arts or culture. See, e.g., Southcenter Joint Venture, supra, 780 P.2d at 1292 (\"Shopping malls are concerned with just one aspect of their patrons' lives -- shopping.\"); Jacobs, supra, 407 N.W.2d at 845 (\"Opening the mall 'avenues' would be like opening the private businesses in the Marsh community. Since neither has an essentially public nature, we cannot hold them subject to the same constitutional requirements with which public property must comply.\").\n\nPlaintiffs, and the majority, also rely on this Court's decision in State v. Shack, 58 N.J. 297 (1971). Ante at (slip op. at 53-54). Like Marsh, Shack is factually inapposite and therefore provides no basis for the Court's opinion. The circumstances of the instant case stand in stark contrast to those in Shack. Here effective alternative means of communication are readily available. Moreover, the people whom the Coalition\n\nsought to reach at the malls are far from the disadvantaged, impoverished people of Shack who were subject to the singular authority of the property owner; they are visitors to a mall drawn to that location for commercial purposes. No compelling interest or policy mandates an invasion of the property owner's rights. Nothing in this case forces this Court to subserve the rights of private-property owners to the free-speech rights of the public as we were compelled to do in Shack.\n\nIV\n\nThe majority states, \"What is involved in this case is the right of every person and of every group to make their views known, however popular or unpopular they may be, and the right of the public to hear them and learn from them.\" Ante at (slip op. at 63). I find it axiomatic that the right to speak freely is inextricably linked with a right to a forum in which to express those thoughts and ideas. Without such a forum, the right of free expression would be nugatory. Traditionally, that forum has been on public property.\n\nOur decision in Schmid extended that forum onto private property, but only in those limited situations in which the factors outlined in that opinion weighed in favor of extending that right to private property. The majority's decision today guarantees the right to a forum for free expression not only on public property, or on private property in the limited circumstances as permitted under Schmid, but on all private property -- not just shopping malls -- where a captive audience can readily be found. Like the court in Cologne, I too am unable to \"discern any legal basis distinguishing this commercial complex from other places where large numbers of people congregate, affording superior opportunities for political solicitation, such as sport stadiums, convention halls, theaters, county fairs, large office or apartment buildings, factories, supermarkets or department stores.\" 469 A.2d at 1209; see also Southcenter, supra, 780 P.2d at 1292 (same); Woodland,\n\nsupra, 378 N.W.2d at 353 (\"'Nor is size alone the controlling factor. The essentially private character of a store and its privately owned abutting property does not change by virtue of being large or clustered with other stores in a modern shopping center.'\" (quoting Lloyd Corp., supra, 407 U.S. at 569, 92 S. Ct. at 2229, 33 L. Ed. 2d at 143)).\n\nThe majority attempts to limit its holding to all regional malls and the one community mall involved in this action. Ante at (slip op. at 64). That limitation is based on the Court's understanding of a regional shopping center's \"essential nature\": \"The mammoth size of these regional centers, the proliferation of uses, the all-embracing quality of the implied invitation * * *.\" Ibid. Yet the facts adduced at trial, the descriptions of each of these malls and the activities that did and did not take place in them, even the trade's determination of what constitutes a regional mall, ante at (slip op. at 12-13), reveal vast differences among these properties. Their only commonality is that they attract large numbers of people for commercial gain.\n\nMoreover, despite its assertion that its holding is limited to large regional malls, the Court states that\n\nin New Jersey, we have an affirmative right of free speech, and neither government nor private entities can unreasonably restrict it. It is the extent of the restriction, and the circumstances of the restriction that are critical, not the identity of the party restricting free speech.\n\n[Ante at (slip op. at 58-59)].\n\nThat broad assertion limits nothing; in fact, it extends this holding far beyond that ever contemplated in Schmid, perhaps beyond that ever contemplated by the drafters of New Jersey's constitutional free speech provisions.\n\nIn reaching its result, the majority completely ignores the rights the New Jersey Constitution grants to the owners of private property. See art. I, paras. 1, 20. No support exists for the proposition that the majority announces today, that a right to free expression exists anywhere an audience may be found. The constitutional right to free expression does not command such an extreme result. It guarantees a forum, not an audience.\n\nV\n\nThe majority's opinion ignores the basic commercial purpose of these private malls, ascribes to them the downfall of urban business districts, and delegates to them the responsibility to fulfill the role once, and arguably still, played by town squares. It does all of that without any legitimate or rational justification. Moreover, the Court places burdens on the private malls that they are ill-suited to handle. Ultimately, mall owners will pass those burdens on to the consumer. The private property owner and ultimately the consumer, the forgotten person in the majority opinion, will have to pay the increased costs that result from the expanded security and other expenses associated with the public's free access to the mall for expressional activities. Unlike the municipalities that the majority thinks the malls have supplanted, malls are not exempt from most tort claims under the New Jersey Tort Claims Act, N.J.S.A. 59:1-1 too/12-3.\n\nPlaintiffs cannot claim that they have no means to express their opinion to the public other than by distributing pamphlets in shopping malls. No evidence shows that plaintiffs could not effectively distribute their pamphlets in other areas. Indeed, according to plaintiff's November 9, 1990, press release, they distributed their materials in at least thirty locations, including several downtown areas. Ante at n.3 (slip op. at 9 n.3). They were able to distribute over 85,000 pamphlets in those locations during a three-day period. Plaintiffs do not need to use the malls, save for their own convenience. See ante at (slip op. at 59-60) (discussing convenience and ease of using shopping malls for petition signing). \"Petitioners' convenience, however, does not create a constitutional rights of access to private property for political activity.\" Citizens For Ethical Gov't, supra, 392 S.E. 2d at 9.\n\nThe majority seems to assert that absent our creation of a right of free expression on this privately-owned property, the patrons therein would not receive important news and information about significant societal issues. Yet unlike the migrant workers in\n\nShack, shoppers are free to come to and go from these malls as they choose. They can avail themselves of all the burdens and benefits of free society as they like.\n\nWere we to adhere to Schmid and deny access to the malls, plaintiffs would nevertheless remain able to reach the public outside supermarkets and movie theaters, at train stations and bus stops, in parks and post offices, in the media, and even in the numerous still-vibrant downtown shopping districts. Plaintiffs can voice their opinions today more readily and more accessibly in more places and in more formats than ever before in human history.\n\nPlaintiffs predicate their desires to express themselves on the private property of these shopping malls not on some constitutional mandate but rather on considerations of efficiency, cost, and convenience. Yet such factors do not a constitutional right create. Schmid, properly applied, has adequately served this state, both its protesting citizens and its private-property owners, for more than a decade. The majority's departure from Schmid's established standard is unprecedented. It makes neither good sense nor good law, and for those reasons, I respectfully Dissent.\n\nJustice Clifford and Judge Michels join in this opinion.\n\nSUPREME COURT OF NEW JERSEY\n\nSEPTEMBER TERM 1993\n\nNO. A-124/125\n\nON APPEAL FROM\n\nON CERTIFICATION TO Appellate Division, Superior Court\n\nNEW JERSEY COALITION AGAINST WAR IN THE MIDDLE EAST, SYLVIA ACKELSBERG, and DAVID CLINE, Plaintiffs-Appellants and Cross-Respondents, v. J.M.B. REALTY CORPORATION, d/b/a Riverside Square, PRUTAUB JOINT VENTURE, d/b/a The Mall at Short Hills, Defendants-Respondents and Cross-Appellants, and CHERRY HILL CENTER, INC., d/b/a Cherry Hill Mall, et al., Defendants-Respondents.\n\nDECIDED December 20, 1994\n\nChief Justice Wilentz PRESIDING\n\nOpinion BY Chief Justice Wilentz\n\nCONCURRING OPINION BY\n\nING OPINION BY Justice Garibaldi\n\nCHECKLIST REVERSE AFFIRM\n\nCHIEF JUSTICE WILENTZ X\n\nJUSTICE CLIFFORD X\n\nJUSTICE HANDLER X\n\nJUSTICE O'HERN X\n\nJUSTICE GARIBALDI X\n\nJUSTICE STEIN X\n\nJUDGE MICHELS X\n\nTOTALS 4 3\n\n\u003cspan class=\"fn\"\u003e1. As noted and explained infra at (slip op. at 64-66), our ruling applies to all regional shopping centers. We do not decide if it applies to all community shopping centers.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The Coalition is comprised of several dozen political and religious groups with related but not identical political agendas. There are over 25,000 individual members, including the following groups: New Jersey SANE/FREEZE, New Jersey Citizen Action, Monmouth County Pax Christi, New Jersey Council of Churches, the New Jersey Rainbow Coalition, the Baptist Peace Fellowship, the Coalition for Nuclear Disarmament, Vietnam Veterans Against the War, Drew University Peacemakers, the Monmouth County Coalition for the Homeless, the Jersey Cape Coalition for Peace and Justice, the New Jersey Peace Mission, the New Jersey Pledge of Resistance, the South Jersey Campaign for Peace and Justice and the Women's International League for Peace and Freedom. The Coalition established the following four objectives: 1) to prevent United States military intervention in the Persian Gulf, 2) to prevent the establishment of a United States base in the Middle East, 3) to obtain a peaceful solution to the Persian Gulf crisis by an international agency and 4) to divert the expenditure of United States tax dollars from defense spending to domestic spending. It sought to achieve these objectives by, among other things, distributing educational literature and obtaining signatures on petitions and sending them to public officials.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. According to plaintiff's November 9, 1990 press release, their materials were distributed in at least 30 locations including Journal Square in Jersey City, Newark Penn Station, Camden City Hall, the Lewes Ferry in Cape May, the Hoboken PATH station and locations in Atlantic City, New Brunswick, Wrightstown, Princeton, Trenton, Woodbridge, Edison, Rockaway, Bernardsville, Montclair, South Orange, Maplewood, Englewood, Fort Lee, Rutherford, Glen Rock, New Providence, Plainfield, Cranford, Westfield, Haddonfield, Collingswood, Red Bank, Long Branch, and Middletown. Plaintiff's representatives also distributed leaflets at the Port Authority Bus Terminal in New York and Market Street Station in Philadelphia.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Congress had voted in January 1991 to authorize the President to use armed force to repel the Iraqi aggression in Kuwait. S.J. Res. 2, 102d Cong., 2d Sess. (1991); H.J. Res. 77, 102d Cong., 2d Sess. (1991). The Senate narrowly approved the joint resolution by a vote of fifty-two to forty-seven. 137 Cong. Rec. S403 (daily ed. Jan. 12, 1991). The resolution's margin of success in the House of Representatives was 250 to 183. 137 Cong. Rec. H485 (daily ed. Jan. 12, 1991).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Gross Leasable Area refers to \"the total floor area designed for tenant occupancy and exclusive use. . . . GLA is the area for which tenants pay rent.\" National Research Bureau, 1991 Directory of Shopping Centers in the United States, Eastern Volume (1990).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The myriad of uses permitted at the malls defies description. In the appendix to this opinion, which reproduces Appendix B of the trial court's opinion, we have listed these uses.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Defendants presented the affidavit of the general manager of Sunvalley Mall in Concord, California. While noting that in 1990 the mall issued 266 permits for expressive activities on its premises, he provided only one example of disruption: a group of seventy activists handed out condoms in the mall. There is no mention, however, of any financial harm as a result of that incident. Defendants could clearly prohibit such conduct by virtue of their power to regulate leafletting activities.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. This study reported the number of malls with gross leasing areas (GLAs) greater than 400,000 square feet. Because regional and super-regional malls have GLAs of at least 300,000 square feet, see National Research Bureau, Shopping Center Directory 1994, Eastern Volume (1993), this number most likely underestimates the number of regional and super-regional malls.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. In 1990, the adult population in New Jersey was 5,931,524. I Division of Labor, Market and Demographic Research, New Jersey State Data Center 1990 Census Publication, Profiling New Jersey II: State of New Jersey (1993).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Our observation in State v. Schmid, 84 N.J. 535, 551 (1980), that \"Princeton University's raison d'etre is more consonant with free speech and assembly principles than a shopping center's purposes might be\" was made in connection with our analysis of Lloyd. It did not purport to be dicta based on the issue decided in Schmid, but rather noted that under the restrictive ruling in Lloyd, Princeton University was a better candidate for First Amendment free speech than was a shopping center.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. As noted earlier, a list of non-retail activities offered by defendants is included as an appendix to this opinion. Some hint of the future is found at a Camden County mall (Echelon Mall, apparently either a regional or community shopping center, not a defendant in this case) where the Camden County Board of Chosen Freeholders, in conjunction with the Camden County Library Commission has rented space (the \"Camden County Store\") where citizens, without charge, can obtain all kinds of information about county services, including specific information about matters pending before other county agencies, advice on a variety of governmental programs, including referrals to other governmental agencies, all presumably formerly available at the downtown business district of Camden city. From time to time, different agencies of county government apparently make presentations concerning their work and services. During its first two months of operations, the center has attracted more than 5,000 people. Herbert Lowe, Camden County Services Flourishing at Mall, Philadelphia Inquirer, November 29, 1994, at S1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. We note the reasoning of Logan Valley and of the Dissents in Lloyd and Hudgens. As noted by Justice Marshall in his Dissent in Hudgens : There is nothing in Marsh to suggest that its general approach was limited to the particular facts of that case. The underlying concern in Marsh was that traditional public channels of communication remain free, regardless of the incidence of ownership. Given that concern, the crucial fact in Marsh was that the company owned the traditional forums essential for effective communication. . . . In Logan Valley we recognized what the Court today refuses to recognize -- that the owner of the modern shopping center complex, by dedicating his property to public use as a business district, to some extent displaces the \"State\" from control of historical First Amendment forums, and may acquire a virtual monopoly of places suitable for effective communication. The roadways, parking lots, and walkways of the modern shopping center may be as essential for effective speech as the streets and sidewalks in the municipal or company-owned town. [Hudgens v. NLRB, 424 U.S. 507, 539-40, 96 S. Ct. 1029, 1046, 47 L. Ed. 2d, 196, 218-19 (1976).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. We note the proposals on initiative and referendum introduced in 1994. A. Con. Res. 33, 206th Leg., 1st Sess. (1994); A. 111, 206th Leg., 1st Sess. (1994).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. These figures are based on the number of registered voters for the 1992 election. Center for Government Services, 1993 New Jersey Legislative District Data Book 5, 12 (1993).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. These projections are based on the number of voters in the 1993 gubernatorial election, as reported in the New Jersey Legislative Manual 860 (1994).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Our holding also applies to the defendant community shopping center (The Mall at Mill Creek) but the record before us is insufficient to satisfy us that it should apply to all community shopping centers. More information is necessary before that determination can be made.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Our treatment of commercial speech is consistent with the lower level of protection afforded such speech under the Federal Constitution. As noted by Justice Clifford, \"Although commercial speech is protected under the First Amendment, there is a \"common-sense\" distinction between speech proposing a commercial transaction and other varieties of speech, including political speech, and thus the constitutional protection accorded to commercial speech is less than is provided to other constitutionally guaranteed expression.\" State v. Miller, 83 N.J. 402, 412 n.5 (1980) (citing Central Hudson Gas \u0026 Elec. Corp. v. New York Pub. Serv. Comm'n, 447 U.S. 557, 100 S. Ct. 2343, 65 L. Ed. 2d 341 (1980)). We realize some commercial speech may be regarded as issue-oriented. We do not address that situation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. We do not foresee a disturbance such as that which occurred at Westfarms Mall in Connecticut in 1983, due to the unusual nature of the circumstances surrounding that incident. As discussed in Cologne v. Westfarms Associates, 469 A.2d 1201, 1203 n.2, 1204 n.4 (Conn. 1984), an injunction against the mall allowed the National Organization for Women to solicit signatures in support of specific issues, but the mall continued to deny access to other groups. However, because of the injunction, the local police refused to respond to the mall's requests that groups leafletting without permission be evicted as trespassers. On a Sunday in May of 1983, the Ku Klux Klan attempted to appear at the mall after being denied permission. They were barred from entering the mall with the assistance of the police. After their departure, a demonstration by a number of anti-Klan protestors required the further intervention of local police, as well as that of state police. Several mall stores closed for the day as a result of the incident. It is unclear when the police responded or whether their policy of non-intervention contributed to the disturbance. The fact that this is the only such confrontation brought to the attention of this Court suggests that such incidents are rare. Given the clear terms and conditions of our opinion, the confusion that apparently contributed to the Westfarms Mall disturbance will not exist.\u003c/span\u003e\n\n",
    "body_length": 148938,
    "citedas": [
      "138 N.J. 326",
      "650 A.2d 757"
    ],
    "attorneys": "Frank Askin and William J. Volonte, on behalf of the American Civil Liberties Union Foundation, argued the cause for appellants and cross-respondents (Mr. Askin, Howard Moskowitz, and Mr. Volonte, attorneys. Joseph Aviv, a member of the Michigan bar, argued the cause for respondents and cross appellants (Cuyler, Burk \u0026 Matthews, attorneys; Mr. Aviv, Jo Ann Burk, Peter Petrou, and Bruce L. Segal, a member of the Michigan bar, on the brief). Nicholas deB. Katzenbach argued the cause for respondents Cherry Hill Center, Inc., d/b/a Cherry Hill Mall and Woodbridge Center, Inc., d/b/a Woodbridge Center (Riker, Danzig, Scherer, Hyland \u0026 Perretti, attorneys; Anne M. Patterson, on the brief). Ronald E. Wiss argued the cause for respondents Rockaway Center Associates, d/b/a Rockaway Townsquare and Livingston Mall Venture, d/b/a Livingston Mall (Wolff \u0026 Samson, attorneys; Mr. Wiss and Sandra Nachshen, on the brief). Brian J. McMahon argued the cause for respondents Kravco, Inc., d/b/a Hamilton Mall, Kravco, Inc., d/b/a Quakerbridge Mall (Crummy, Del Deo, Dolan, Griffinger \u0026 Vecchione, attorneys). Mark A. Steinberg submitted a letter in lieu of brief on behalf of respondent Equity Properties and Development Co., Inc., d/b/a Monmouth Mall. Curtis L. Michael submitted a letter brief on behalf of respondent Hartz Mountain Industries, Inc., d/b/a The Mall at Mill Creek (Horowitz, Rubino \u0026 Associates, attorneys). Bernard A. Kuttner submitted a brief on behalf of amici curiae, United Farm Workers of America, AFL-CIO, and New Jersey Consumer Coalition.",
    "category": [
      "252",
      "213"
    ],
    "judges": "Justices Handler, O'Hern, and Stein join in this opinion. Justice Garibaldi has filed a separate Dissenting opinion in which Justice Clifford and Judge Michels join. Justice Pollock did not participate.",
    "citation_count": 38
  }
}
