{
  "id": "HoHjPWYBTlTomsSB3jyt",
  "document": {
    "title": "American Home Products Corp. v. Federal Trade Commission",
    "full_title": "AMERICAN HOME PRODUCTS CORPORATION, A DELAWARE CORPORATION v. FEDERAL TRADE COMMISSION",
    "jurisdiction": "Third Circuit",
    "date": "1982-12-03T00:00:00.000Z",
    "docket": "No. 81-2920",
    "body": "Opinion OF THE COURT\n\nADAMS, Circuit Judge.\n\nBefore us is a petition for review of an Order entered by the Federal Trade Commission (\"Commission\") against American Home Products (\"AHP\"). The Order requires that AHP cease and desist various deceptive advertisements for a number of its drug products, including Anacin and Arthritis Pain Formula (APF). AHP does not take issue with all of the findings of deceptiveness on which the Order is based. It argues, however, that some of these findings are not supported by substantial evidence, and that, whether or not the findings are adequately supported, certain aspects of the Order remain unjustified. We uphold the Commission's findings, and accordingly will affirm the core of its Order. We agree, however, with some of AHP's objections to the Order's vagueness and breadth, and therefore will direct that the Order be modified accordingly.\n\nI. Background\n\nThe petition for review represents the most recent stage of a proceeding that was initiated by an administrative complaint filed almost ten years ago. Issued on February 23, 1973, the complaint alleged that AHP, in its advertisements for Anacin and APF, had engaged in unfair or deceptive acts in violation 15 U.S.C. §§ 45 and 52 (sections 5 and 12 of the Federal Trade Commission Act).\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e That same day, the Commission filed similar complaints against Bristol-Myers Company, manufacturer of Bufferin and Excedrin, and Sterling Drug Inc., manufacturer of Bayer Aspirin. These other cases are currently pending on appeal in the Commission, and are not before the Court at this time.\n\nAnacin is a non-prescription analgesic that is composed of two active ingredients, aspirin (400 milligrams) and caffeine (32.5 milligrams). There is no contention here that caffeine, either in itself or in conjunction with aspirin, is an analgesic. Thus, Anacin's sole pain-killing component is aspirin. See App. 303. An \"ordinary\" aspirin tablet contains 325 milligrams of aspirin. The recommended dosage of Anacin is one or two tablets. APF, also a non-prescription analgesic, contains \"micronized\" aspirin (486 milligrams) -- that is, it is an aspirin tablet formulated with small aspirin particles -- along with two antacids.\n\nThe complaint charged, among other things, that AHP's advertisements had falsely claimed that Anacin has a unique pain-killing formula that has been conclusively proven to be superior in effectiveness to all other non-prescription analgesics, and that Anacin is a tension reliever. Another of the complaint's accusations was that the petitioner misrepresented that APF is superior to competing products in that it causes less frequent side effects. AHP's answer, filed May 29, 1973, denied any violation of the Federal Trade Commission Act. The petitioner's position was that it did not make the advertising claims which the complaint accused it of making, and that any claims it did make were truthful.\n\n15 U.S.C. § 45(a) (1) declares unlawful \"unfair methods of competition in or affecting commerce, and unfair or deceptive acts or practices in or affecting commerce. . . .\" Under 15 U.S.C. § 52(a), it is unlawful to disseminate \"any false advertisement . . . by any means, for the purpose of inducing, or which is likely to induce, directly or indirectly, the purchase in or having an effect upon commerce of food, drugs, devices, or cosmetics.\" 15 U.S.C. § 52(b) makes such dissemination of false advertisements an \"unfair or deceptive act or practice\" under section 45, thereby triggering the various enforcement and review provisions of section 45. \"False advertisement,\" as defined by 15 U.S.C. § 55(a) (1), is a broadly inclusive term. It encompasses not merely advertisements that are literally untrue, but also materially misleading advertisements -- even where it is only the failure to reveal material facts that renders the advertisement misleading.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nExtensive hearings were conducted in connection with the complaint against AHP. On September 1, 1978, the Administrative Law Judge (\"ALJ\") issued an Initial Decision and Order (App. 85-344), meticulously reviewing the record evidence and resolving most issues in favor of the complaint counsel. On cross-appeals the Commission, in an Order and Opinion issued September 9, 1981, upheld the ALJ in almost all respects (App. 345-426). The ALJ's findings of fact and conclusions of law were adopted except to the extent inconsistent with the Commission's opinion. App. 346. Whereas the ALJ found AHP's practices \"unfair and deceptive,\" the Commission chose to speak only in terms of deception. Both the ALJ and the Commission focused on the capacity of AHP's advertisements to mislead, and, as the Commission remarked in denying rehearing, the difference in approach was \"more of form than of substance.\" App. 430.\n\nThe Commission's Order has several sections.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Although the Commission's findings related solely to Anacin and APF, some portions of the Order were directed to other products as well. Part I of the order applied to Anacin, APF, and \"any other non-prescription internal analgesic product\" of AHP's. In I(A) -- the \"establishment\" provision -- the Commission demanded that when AHP represents that the superior freedom from side effects or superior effectiveness of one of these products to any other products has been \"established or proven,\" AHP must be able to support this representation with at least two well-controlled clinical investigations. I(B) of the Order -- the \"substantial question\" provision -- takes I(A) support requirements on AHP whenever its advertisements claim superior effectiveness or freedom from side effects, even when those advertisements do not overtly claim that this superiority has been established or proven.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e If AHP cannot provide two or more well-controlled clinical studies to support its superiority claims, it is prohibited from making such claims in an unequivocal manner. It is allowed, however, to assert superiority, provided it discloses that the superiority is open to substantial question.\n\nPart II of the Order applies to all of AHP's non-prescription drug products, not merely the non-prescription internal analgesics. II(A) prohibits AHP from representing that a product contains an unusual or special ingredient when the actual ingredient is commonly used in other non-prescription drugs intended for the same uses. Under II(B), AHP must cease \"making false representations that [any non-prescription drug] product has more of an active ingredient than any class of competing products.\" The misrepresentation of test or survey data concerning effectiveness or freedom from side effects is proscribed by II(C). II(D), an especially far-reaching provision in the Order, requires that AHP cease even noncomparative claims of effectiveness or freedom from side effects unless it possesses a reasonable basis for these claims.\n\nUnder Part III of the Order, AHP is required, whenever an advertisement makes a performance claim for Anacin or APF, to disclose in a clear and conspicuous manner that the analgesic ingredient in the product is aspirin.\n\nPart IV of the Order -- the \"tension relief\" provision -- covers only Anacin. It directs AHP to cease any representations that Anacin \"relieves nervousness, tension, anxiety or depression. . . .\"\n\nThe Order is prospective only. It is designed to ensure that future advertisements will neither mislead the public further nor confirm entrenched misimpressions induced by previous advertisements. Although the Commission found, and AHP in large part no longer disputes, that AHP has engaged in large-scale deception, the Order reflects no punitive intent. The Order does insist that AHP's advertisements make disclosures under many circumstances, but requires disclosures only where AHP makes certain types of claims. Thus the affirmative obligation to provide information to the public is not unconditional under the Order, but will be triggered only when AHP advances certain claims for its products.\n\nA motion for reconsideration filed by AHP was denied on January 21, 1982 (App. 429-34). In separate statements, two commissioners maintained that the Commission as an exercise of discretion should stay the Order, or vote to reconsider it, because of the possibility that the decision might require modification to guarantee that the treatment of AHP be consistent with that of AHP's competitors, Bristol-Myers and Sterling Drug, which had Commission proceedings pending against them.\n\nAHP then petitioned this Court for review pursuant to 15 U.S.C. § 45(c). It asks that Parts I, II(D) and III be vacated, and that II(A), II(B) and II(C) be limited to Anacin and APF. No relief from the strictures of Part IV is requested. We shall first take up AHP's challenge to the findings of deceptiveness that underlie Part I of the Order, and AHP's administrative due process challenge to Part I(B). We shall then turn to a consideration of whether Part II of the Order must be modified as excessively broad or vague, despite AHP's apparent acceptance of the factual findings on which Part II is predicated. The final portion of the opinion will focus on AHP's First Amendment challenge to Part III of the Order.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nII. Part I of the Order\n\nPart I of the Order consists of two provisions. Part I(A) demands that AHP cease falsely to represent that its non-prescription analgesics are medically proven or established to be superior in effectiveness or freedom from side effects to those of competitors. AHP charges that the Commission lacked substantial evidence either that representations of proven superiority were made, or, if they were made, that they were misleading. Under Part I(B), AHP may not represent the superiority of its non-prescription analgesic unless it has established that there exists a specified level of medical evidence. AHP addresses both procedural and substantive challenges to Part I(B). It argues that it was denied administrative due process by reason of changes in the Commission's theory of liability during the course of the proceedings. AHP's substantive objections to Part I(B) are analogous to those made against Part I(A): that the proscribed claims were never made and would not be misleading even if they were. It should be stressed that all the advertising claims at issue -- both those that the Commission found to have been made and those that AHP acknowledges were present -- are susceptible of objective measurement and intended to be taken seriously. AHP does not defend its advertisements as lawful \"puffing.\"\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nA. The Standard of Review of Findings of Deceptiveness\n\n15 U.S.C. § 45(c) directs that \"the findings of the Commission as to the facts, if supported by evidence, shall be conclusive.\" It is \"clear that properly interpreted, the statute requires review by the substantial evidence in the record as a whole standard,\" Beneficial Corp. v. FTC, 542 F.2d 611, 616 (3rd Cir. 1976) (footnote, citing cases, omitted), cert. denied, 430 U.S. 983, 52 L. Ed. 2d 377, 97 S. Ct. 1679 (1977). This standard \"does not permit the reviewing court to weigh the evidence, but only to determine that there is in the record '\"such relevant evidence as a reasonable mind might accept as adequate to support a conclusion,\"'\" Steadman v. SEC, 450 U.S. 91, 99, 67 L. Ed. 2d 69, 101 S. Ct. 999 (1981) (quoting previous decisions).\n\nThis deferential standard with respect to Commission findings of fact applies to the findings here. Although \"in the last analysis the words 'deceptive practices' set forth a legal standard and they must get their final meaning from judicial construction,\" FTC v. Colgate-Palmolive Co., 380 U.S. 374, 385, 13 L. Ed. 2d 904, 85 S. Ct. 1035 (1965), a Commission finding that advertisements are deceptive or tend to mislead \"is obviously an impressionistic determination more closely akin to a finding of fact than to a conclusion of law,\" Beneficial, supra, 542 F.2d at 617 (applying \"substantial evidence\" standard to Commission findings that advertisement was deceptive). Colgate-Palmolive explained that the \"statutory scheme\" created by section 5 of the Federal Trade Commission Act, 15 U.S.C. § 45(a) (1), in particular the generality and flexibility of the statutory standards of illegality,\n\nnecessarily gives the Commission an influential role in interpreting § 5 and in applying it to the facts of particular cases arising out of unprecedented situations. Moreover, as an administrative agency which deals continually with cases in the area, the Commission is often in a better position than are courts to determine when a practice is \"deceptive\" within the meaning of the Act. This Court has frequently stated that the Commission's judgment is to be given great weight by reviewing courts. This admonition is especially true with respect to allegedly deceptive advertising since the finding of a § 5 violation in this field rests so heavily on inference and pragmatic judgment.\n\n380 U.S. at 385 (footnote omitted). \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nThe Commission's familiarity with the expectations and beliefs of the public, acquired by long experience, is especially crucial when, as with the advertisements proscribed by Parts I(B) and III of the Order in this case, \"the alleged deception results from an omission of information instead of a statement.\" See Simeon Management Corp. v. FTC, 579 F.2d 1137, 1145 (9th Cir. 1978).\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nB. How Advertising is to be Interpreted\n\n\"The tendency of the advertising to deceive must be judged by viewing it as a whole, without emphasizing isolated words or phrases apart from their context,\" Beneficial, supra, 542 F.2d at 617. The impression created by the advertising, not its literal truth or falsity, is the desideratum:\n\nDo these advertisements create a false impression as to the value of \"Lite Diet\" bread as compared with other articles of food? The Commission's judgment is what controls here unless a court finds that the judgment is unsupported by evidence or is capricious or arbitrary or what you will. We think an examination of the advertisements clearly supports the Commission's finding that by implication and innuendo the deceptive impression had been created.\n\nBakers Franchise Corp. v. FTC, 302 F.2d 258, 261 (3d Cir. 1962).\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nIt is true that on some crucial points in the case at hand the Commission lacked direct evidence that consumers were in fact misled. But the Commission need not buttress its findings that an advertisement has the inherent capacity to deceive with evidence of actual deception.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nIn the present proceeding, the Commission analyzed not only the words used, but also, with respect to the television advertisements, the messages conveyed through the \"aural-visual\" pattern. App. 254 and 374-75. The Commission's right to scrutinize the visual and aural imagery of advertisements follows from the principle that the Commission looks to the impression made by the advertisements as a whole. Without this mode of examination, the Commission would have limited recourse against crafty advertisers whose deceptive messages were conveyed by means other than, or in addition to, spoken words. In Standard Oil Co. of California v. FTC, 577 F.2d 653, 659 (9th Cir. 1978), the court upheld a Commission finding \"that the predominant visual message was misleading, and that it was not corrected or contradicted by the accompanying verbal message in advertisements.\" Colgate-Palmolive, supra, 380 U.S. at 385-86 also supports the Commission's right to look beyond spoken words to the message conveyed visually. According to Colgate-Palmolive, \"even if an advertiser has himself conducted a test, experiment or demonstration which he honestly believes will prove a certain product claim, he may not convey to television viewers the false impression that they are seeing the test, experiment or demonstration for themselves, when they are not because of the undisclosed use of mock-ups.\"\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nC. Part I(A) of the Order\n\nWe have no hesitation in affirming the Commission's determination that AHP represented that the superiority of Anacin had been proven or established,\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e and that such representation was deceptive.\n\n1. Were the establishment claims made ?\n\nThe ALJ's overall method for interpreting advertisements is unexceptionable. He wrote:\n\nI have primarily relied on my knowledge and experience to determine what impression or impressions an advertisement as a whole is likely to convey to a consumer. When my initial determination is confirmed by the expert testimony of complaint counsel or respondents, I rested. When my initial determination disagreed with that of expert testimony, which was often conflicting, I reexamined the advertisement in question, and further considered such record evidence as the ASI copy tests and verbatim responses [a type of survey evidence] before reaching a final determination. In this connection, my determinations agreed in most instances with those of Dr. Ross, complaint counsel's expert, and disagreed with those of Dr. Smith in most instances.\n\nApp. 255, footnotes omitted. The Commission expressed its approval of this methodology at some length. App. 421-26. Both the ALJ and the Commission amply defended their reasons for awarding limited weight to the testimony of AHP's expert. App. 255-56; 423-24. The opinion of the ALJ explored in minute detail the survey evidence offered by AHP. App. 210-43. In contrast, the interpretations that AHP presses upon us rely primarily on technical readings of the advertisements in question. If accepted, AHP's position might well preclude the Commission from taking action against advertisements that, when read with scrupulous care by vigilant and literal-minded consumers, could be seen to be making true claims.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nOne advertisement which appeared in virtually identical form in several magazines is entitled \"News about headache relief you probably missed (unless you read medical magazines).\" Beneath what was designed to resemble a clipping from a medical journal, the body of the advertisement informed readers:\n\nIn clinical tests on hundreds of headache sufferers, it has now been proven beyond a doubt that today's Anacin delivers the same complete headache relief as the leading pain relief prescription. This advertisement in leading medical journals [i.e., the clipping] told the complete story.\n\nDoctors know Anacin contains more of the specific medication they recommend most for pain than the leading aspirin, buffered aspirin, or extra-strength tablet. Is it any wonder that last year physicians and dentists distributed over 25 million packets of Anacin tablets to their patients?\n\nNow you know that Anacin gives you the same complete headache relief as the leading pain relief prescription. Next headache, see how fast Anacin relieves your pain.\n\nApp. 547. See App. 548-49. The advertisement, read with sedulous attention, proclaims that Anacin has been clinically proven to be as effective as the leading prescription analgesic, and that Anacin is known by doctors to have more of the pain reliever they recommend most than do the other leading non-prescription analgesics. There is no explicit representation that Anacin has been clinically proven to be more effective than any other non-prescription analgesics. The ALJ found that the clinical tests in question did not prove Anacin's equivalence to the leading prescription analgesic (App. 184-87), and the Commission appears to have agreed (App. 386). But for the purposes of Part I(A) of the Order, the fundamental objection to the advertisement is that consumers, not unreasonably assuming that prescription drugs are more effective than non-prescription products, will be likely to combine the claim of proven equivalence to the leading prescription drug, and the claim that doctors know that Anacin has more pain reliever than the other non-prescription products, into a claim that Anacin's superiority to the other non-prescription products has been proven.\n\nAnother advertisement which appeared in several magazines reads:\n\nWhat's best to take for tension headache pain? Why not take the fast acting pain-reliever doctors recommend most for headaches? You'll find it in Anacin Tablets. And today's Anacin gives you 100% more of this specific pain-reliever than the other leading extra-strength tablet. In minutes Anacin breaks the grip of headache pain so relaxes its nervous tension, releases pressure on nerves and helps lift pain's depression. You feel great again after taking Anacin. You see Anacin is a special fortified combination of ingredients and only Anacin has this formula. Next time a tension headache strikes, see if medically-proven Anacin doesn't work better for you.\n\nApp. 550, 551, 552 (emphasis in original). A rigorous analysis reveals that this advertisement does not state that Anacin has been \"medically-proven\" to \"work better,\" but, read literally, merely invites consumers to see for themselves whether \"medically-proven Anacin\" -- the respects in which it is \"medically-proven\" are unspecified -- works better for them. But surely it was reasonable for the Commission to conclude that consumers would be likely to take the ambiguous term \"medically-proven\" to relate to the principal question which the advertisement purportedly addresses: \"What's best to take for tension headache pain?\"\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nThe Commission, despite primary reliance on its own knowledge in interpreting the advertisements, weighed all the survey evidence in the record. Although AHP produced several types of empirical data, only one type -- the Audience Studies, Inc. (ASI) tests -- was relevant to determining the meaning of particular advertisements, as AHP's expert admitted (App. 118).\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e ASI had conducted tests on behalf of AHP's advertising agency to measure the effectiveness of some advertisements. These tests involved none of the print or radio advertisements but rather were limited to thirty of those that appeared on television. A sample of consumers was shown films in a theater of the advertisements. Thirty or forty minutes later, the consumers wrote down what they recalled, and these responses were then tabulated and coded. AHP's expert, Dr. Smith, apparently found no consumers who thought that an \"establishment\" claim was made in the advertisements. The Commission, however, for a number of reasons discounted this result as being of limited usefulness. Dr. Smith's analysis was found to be flawed because his\n\napproach was to code a response as a \"directly-related recall\" only if it recited the precise language of the alleged representation. See, e.g., Smith, Tr. 7541. We believe this to be an overly restrictive use of copy test results. Other expert testimony in the record shows, moreover, that a low response rate of verbatims falling into a particular category is meaningless without an assessment of the advertisement tested and all surrounding circumstances, and that even after such analysis it may be impossible to determine conclusively that a given message was not communicated. (Lukeman, Tr. 241-44, 247-48; Seltzer, Tr. 367-68). In addition, the open-ended questioning technique used by ASI does not elicit an exhaustive playback from consumers of all the representations that may be perceived in the tested advertising.\n\nApp. 425-26.\n\nWe cannot say that the Commission's appraisal of this evidence was unsupported. It is also significant that there was considerable record evidence of a widespread consumer belief in Anacin's superior efficacy, although not a belief in its established superiority. See App. 311, 416. In view of the inability of consumers to discriminate objectively between competing analgesics, discussed infra, the Commission was \"convinced that the primary source of this consumer belief in Anacin's superiority is the advertising of the product.\" App. 417. The Commission apparently inferred from this that consumers implicitly hold a belief in Anacin's proven superiority; however, the Commission seems not to have relied on this inference in interpreting the advertisements. The Commission also concluded that consumers' belief in superiority, and their implicit belief in established superiority, would be likely to persist unless AHP carried out the directives of the Commission's Order. App. 418.\n\n2. Were the establishment claims deceptive ?\n\nHaving upheld the Commission's determination that certain of AHP's advertisements should be read as making the \"establishment\" claim, we proceed to consider whether the Commission could have found that claim misleading. On this issue as well it is clear that the Commission must be sustained.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Even though AHP's advertisements never disclosed the presence of aspirin in Anacin, the claim to superior effectiveness appears to be based on the belief that a somewhat larger dosage of aspirin, such as Anacin contains, is more effective in the relief of pain than \"ordinary\" aspirin.\n\nThe Commission carefully considered, and rejected, the evidence that Anacin's superiority had been established or proven. It found that there was \"no real dispute as to the type of evidence scientists require before they regard it as having been proven (established) that one drug is more effective than another.\" App. 376. See App. 158-63.\n\nAHP makes much of the allegation that the word \"established\" lacks a fixed meaning in the medical-scientific community and that the Commission used various verbal formulations in addition to the word \"established.\" Reply Br. 6-7; Br. 27. This relatively minor terminological dispute cannot disguise the fact that the record evidence, including the testimony of AHP's witnesses, decisively supports the Commission's finding that the scientific community agrees on the criteria for testing the comparative superiority of an analgesic. See App. 376-82. AHP's insinuation that the Commission is imposing an unheard of demand for \"absolute\" proof is unwarranted in light of the expert testimony.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nQuite apart from the argument that the word \"established\" is of uncertain meaning, AHP asserts that two studies performed for it by Dr. Gilbert McMahon meet the standard of two well-controlled clinical studies; but the Commission found numerous defects in these studies (App. 383-384).\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e The Commission objected that the results were not statistically significant; that the drug product tested against aspirin was not shown to be equivalent to commercially-available Anacin; and that the studies failed to deal with headache pain, which AHP's witnesses conceded to be different from other types of pain. The ALJ, in a closely reasoned analysis of the McMahon studies (App. 175-83), made additional points, including that bias was introduced into the studies by the ongoing \"peeking\" at and evaluation of data by AHP (App. 179). We are unable to hold that the Commission acted unreasonably in refusing to assign to these studies the probative force that AHP wishes for them.\n\nAHP also argues that the aspirin \"dose response curve\" proves Anacin's superior effectiveness (App. 384). Again, it is apparent that the Commission accorded the proffered evidence a thorough examination and reasonably judged it to be insufficient. A dose-response curve, as the name suggests, charts the degree of average pain relief (\"response\") for different dosages of a drug. While a few points on the curve are established by clinical studies, the remainder are extrapolated, and not proven. According to the Commission,\n\neven assuming that the curve as a whole has been established, the evidence indicates that above 600 mg. the curve is either very shallow or levels off to a plateau (Kantor, Tr. 3573; Lasagna, Tr. 4881). In other words, a substantial increase in dosage is necessary to produce even a small increase in pain relief (Kantor, Tr. 3573; Azarnoff, Tr. 642; F. 257), yet Anacin contains only 150 mg. more aspirin than common aspirin. Indeed, several dose-response studies showed no statistically significant differences in pain relief for dosages greater than 600 mg. (F. 246-55). Thus, the aspirin dose response curve cannot establish the superiority of 800 mg. of aspirin over 650 mg., or, consequently, the superiority of Anacin over aspirin (or other analgesic products).\n\nApp. 385, footnotes omitted. (\"F.\" refers to the ALJ's findings). The Commission's treatment of the dose-response curve is well supported by substantial evidence on the record.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nA number of expert witnesses testified that Anacin's superior efficacy has not been established, and some expressed the view that Anacin was not superior. See App. 392. Far from concluding that Anacin's superiority had been proven, the ALJ suggested that Anacin might be less effective than \"ordinary\" aspirin. The possibility that the caffeine in Anacin could actually heighten awareness of pain was not ruled out. App. 288. Moreover, there was evidence that caffeine exacerbated aspirin's gastrointestinal side effects, App. 288, and \"in terms of chronic use, the record evidence strongly suggest[s] that more aspirin may be worse [in its side effects] than less aspirin.\" App. 285.\n\nThere are numerous appellate decisions upholding the Commission's right to require substantiation of advertising claims. In a case involving non-prescription weight-reducing tablets, Porter \u0026 Dietsch, Inc. v. FTC, 605 F.2d 294, 305 (7th Cir. 1979), cert. denied, 445 U.S. 950, 63 L. Ed. 2d 784, 100 S. Ct. 1597 (1980), the court refused to strike down an order prohibiting, among other things, representations that any product of the advertiser could achieve any result, \"unless the representation is, when made, substantiated by competent scientific and medical tests and studies.\" This prohibition was more far-reaching than Part I(A) of the present Order in two respects. First, it applied to any of Porter \u0026 Dietsch's products, although misrepresentations had been found with respect to only one. Part I(A) of the Order here applies only to AHP's non-prescription drug products. Second, all representations as to \"results\" were encompassed, not merely claims to superior safety and effectiveness, even though only one \"result\" (automatic weight loss) had been deceptively claimed.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nD. Due Process and Part I(B) of the Order\n\nAlthough AHP is correct that there was some vacilation at the administrative level as to the genesis of the theory undergirding Part I(B) of the Order, it cannot be said that AHP was thereby denied administrative due process. AHP charges that the theory of liability on which the relevant section of the complaint relied, and on which evidence was taken at the hearing, was wholly different from the theory on which the Commission predicated Part I(B) of the Order.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e AHP maintains that it was prevented from defending itself against the charge on the basis of which it was found liable, because it lacked notice and because th ALJ excluded relevant evidence. More specifically, the arguement is that Part I(B) of the Order (the \"substaintial question\" section), which forces AHP either to reveal the extistence of a substantial question about the superiority of its products or to cease advertising such superiority, was premised on the \"resonable basis\" theory, even though the complaint was brought under the \"substantial question\" theory, and even though the ALJ refused to accept evidence that would have been relevant under the \"resonable basis\" proposition.\n\nThe \"reasonable basis\" doctrine of Pfizer, Inc., 81 F.T.C. 23 (1972), is that advertisers must possess and rely on an adequate \"reasonable basis\" for their claims. The Commission has supported this standard on the grounds that \"deception derives from the failure to disclose to consumers the material fact that an affirmative product claim lacks the support that would be presumed absent some qualification of it.\" App. 390, n. **. Pfizer treated the question of \"what constitutes a reasonable basis [as] essentially a factual issue.\" It listed a number of considerations in resolving the issue in particular cases but remarked that \"there may be some types of claims for some types of products for which the only reasonable basis . . . would be a valid scientific or medical basis.\" 81 F.T.C. at 64. AHP seems to concede the validity of the reasonable basis theory.\n\nIn the Commission's complaint against AHP, it alleged that there was a \"substantial question\" whether the claimed superiority for Anacin and APF had been proven or established, and that failure to set forth this substantial question in advertisements claiming superiority was misleading. Complaint counsel did not deny that there was a \"reasonable basis\" for AHP's superiority claim but urged that the existence of a \"substantial question\" nevertheless rendered the advertisements misleading. The ALJ allowed both sides to present whatever they considered relevant under the \"substantial question\" doctrine, but excluded \"reasonable basis\" evidence. He ultimately found, and the Commission agreed, that a substantial question about the superiority of Anacin and APF existed in the absence of two well-controlled clinical studies supporting their superiority, and that, in the context of this case, failure to disclose this substantial question was misleading. AHP was not denied an opportunity to introduce evidence either as to when a substantial question exists in the medical-scientific community, or as to whether, in this case, failure on the part of the manufacturer to reveal a substantial question was misleading.\n\nAHP contends nevertheless that the ALJ and the Commission denied it due process. It asks us to view the ALJ's and the Commission's express reliance on the \"substantial question\" idea as a subterfuge designed to hide reliance on the \"reasonable basis\" theory. As evidence that the ALJ based his decision on the \"reasonable basis\" doctrine, AHP considers it sufficient to note the following statement from the ALJ's lengthy opinion: \"against this background, what is the reasonable level of substantiation required under the fairness doctrine for a claim that Anacin is more effective than aspirin . . .?\" App. 303. It is not clear why this passage is thought to be incongruent with the \"substantial question\" test. The ALJ was considering how much support AHP must have, in the circumstances of this proceeding, for its advertising claims of Anacin's effectiveness. His conclusion was that, if the advertisements are not to be either false or unfair to consumers, Anacin must pass the \"substantial question\" test:\n\nThe challenged representation . . . that it has been established that a recommended dose of Anacin is more effective for the relief of pain than a recommended dose of any other non-prescription internal analgesic, is not only unfair to consumers but also false since the greater effectiveness of Anacin has not been scientifically established. In light of the evidence, there existed a substantial question recognized by experts qualified by scientific training and experience to evaluate the efficacy of such drugs as to the validity of such representations.\n\nThe consumers of OTC analgesic products are entitled, as a matter of marketplace fairness, to rely upon the manufacturer to have a sufficient kind and level of substantiation for the claim. In the circumstances of this case, the only sufficient substantiation for the claim is that the claim is accepted as established by the medical-scientific community. The record is clear that, with respect to OTC [over the counter, i.e., non-prescription] internal analgesic products, the medical-scientific community requires two or more well-controlled clinical studies . . .\n\nApp. 184, 303-04. The ALJ's use of the term \"reasonable\" in framing the issue in no way implies a reliance on the \"reasonable basis\" test.\n\nThe Commission, in affirming the ALJ, took a slightly different position regarding the provenance of the \"substantial question\" doctrine. Though complaint counsel had characterized \"substantial question\" as a new idea, and the ALJ appears to have agreed, the Commission reasoned that the theory was a logical application of well-established principles:\n\nThe conclusions set forth herein are merely an elaboration, in the specific context of drug products, upon well-established principles of advertising law requiring that advertisers possess and rely upon a reasonable basis for affirmative product claims. Pfizer, Inc., 81 F.T.C. 23, 60-65 (1972). It has repeatedly been held that failure to possess a reasonable basis for advertising claims is a deceptive practice. [citations omitted] Deception derives from the failure to disclose to consumers the material fact that an affirmative product claim lacks the support that would be presumed absent some qualification of it. The appropriate measure for such support is, of course, to be determined in light of the particular claims made and the products for which they are made. For reasons noted in the text, we believe that such support in the case of drugs consists of the two or more well-controlled clinical studies deemed necessary by a broad spectrum of relevant experts to justify assertions as to drug performance.\n\nApp. 390, n. **.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e That is, the Commission determined that in some circumstances an advertiser lacks a \"reasonable basis\" for its claim where there is a substantial question about the truth of the claim. Given this determination, no evidence purporting to establish a \"reasonable basis,\" and not purporting to eliminate the existence of a \"substantial question,\" could have been relevant.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nAHP also asserts, as a procedural objection, that the Commission's expert witnesses were not asked about the \"substantial question\" issue. Whether this allegation bears on the Commission's procedure, or on the merits of Part I(B), it is not persuasive. There was an impressive array of testimony supporting the Commission's decision as to the procedures the medical-scientific community considers sufficient to establish a claim to superiority for an analgesic. Even if complaint counsel failed to use the actual phrase \"substantial question\" in examining the witnesses it is unrealistic to suppose that AHP could have failed to realize that the experts were being queried as to when, in the complaint's terminology, a \"substantial question\" could be said to exist in the medical community regarding the superiority of an analgesic.\n\nE. The Merits of Part I(B) of the Order\n\nBecause we do not vacate Part I(B) on due process grounds, it is necessary to address AHP's substantive challenge to this provision. Part I(B) deals with advertisements which claim that the products are superior, but which do not make overt claims that superiority has been proven. It directs AHP, when making unequivocal claims of superior effectiveness or freedom from side-effects for non-prescription analgesics, to verify such claims with two well-controlled clinical studies, or to reveal that there exists a substantial question about their truth.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Another alternative available to AHP is to cease claiming superiority.\n\nAHP does not deny that affirmative product claims can be misleading if not supported by adequate proof. Nor do we understand AHP to take exception to the Commission's right to order that the advertisements of a violator disclose the absence of the appropriate level of proof for a product claim. AHP's objections to Part I(B), analogous to those made against Part I(A), are, first, that the advertisements in question did not make the claim which the Commission attributes to them, i.e., the claim of superiority, and second, even if this claim had been made, there existed sufficient supporting evidence to render it non-deceptive.\n\n1. Were the superiority claims made ?\n\nThe advertisements lend themselves to the Commission's interpretation, and there is expert testimony in favor of this reading.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e As AHP admits, it represented that Anacin contains \"more analgesic content than regular or regular buffered aspirin tablets,\" \"twice as much of the pain-reliever recommended most by doctors,\" as the other leading \"extra-strength\" tablet, and \"the analgesic ingredient most recommended by doctors.\"\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Also acknowledged is that AHP represented that APF's \"'double-buffering' makes it gentle to the stomach.\" Petitioner's Br. 5.\n\nAs explained more fully in connection with Part II of the Order, these particular representations -- although technically correct -- were nevertheless misleading. The Commission's reasoning that a claim of more pain reliever, which the advertisements explicitly make, would be read by consumers as a claim of more pain relief, seems compelling. Not only credulous purchasers are apt to conflate the idea of more pain reliever with that of more pain relief, but as the Commission explains in its brief, even rational and careful consumers will be apt to place such an interpretation on the advertisements (Respondent's Br. 21 n. 14):\n\nIf the presence of more pain reliever in a product did not result in greater pain relief (as may well be true of Anacin), disclosure of the extra amount could be a clear liability, since consumers would logically expect that it contributed to an increased price. Since rational consumers do not expect a rational advertiser to highlight the drawbacks in its own product, and since the ads in question deal solely with the question of comparative analgesic efficacy, the only possible message that rational consumers can draw from American Home's incessant statements about Anacin's extra pain reliever is that Anacin is more efficacious.\n\nThe advertisements thus support the interpretation that superiority to \"regular aspirin\" and to \"the leading extra strength tablet\" was claimed.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e As for APF, the\n\nexpress claim that APF is gentle to the stomach because of its \"double-buffering\" or because it is \"microfined\" clearly convey[s] the message that APF has a larger amount of buffering action than other buffered products and is finer than others and that, therefore, it is the gentlest of all OTC analgesic products on the market.\n\nApp. 265-66, citing advertisements.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\n2. Were the superiority claims deceptive ?\n\nMore difficult than the question whether superiority claims were made is whether the superiority claims were deceptive. In this regard, the Commission's central passage is the following:\n\nWhen an analgesic advertiser claims its product to be superior in performance, even without the additional explicit claim that it has been so proven, it is reasonable for consumers to construe that claim to be the assertion of a fact that is generally accepted, within the scientific community, as established. By their nature, therapeutic drug products raise special public health concerns, in light of the risks associated with their use.\n\nApp. 387-38, footnote omitted.\n\nWe do not decide whether such reasoning would justify a \"substantial question\" provision whenever advertisements make any affirmative product claims for any drugs. In the present case, the Commission declined to apply this reasoning so broadly, and limited Part I(B) to AHP's non-prescription analgesics and to claims of superior effectiveness or freedom from side effects. The Commission expressly recognized the possibility that comparative claims for some non-prescription drugs might require less substantiation than is demanded here. See App. 407.\n\nThe essential idea supporting Part I(B) is readily comprehensible, despite AHP's attempts to portray this provision as arcane. When a factual, verifiable proposition is unequivocally asserted in an advertisement, the Commission's view is that a consumer is entitled to assume that the appropriate verification has been performed. It cannot be stressed too emphatically that claims of superior effectiveness or freedom from side effects for a drug are factual, testable claims. When an article of clothing is proclaimed to be more aesthetically pleasing than competitors' products, consumers cannot expect that this quality of the clothing has been verified. But when a drug is held out to consumers as superior, this is as much a factual representation -- even if the verification procedures are more difficult to perform -- as a claim that a product is pure gold, or weighs one pound, and consumers can be expected to read it as such.\n\nFailure to disclose that a claim regarding a drug product lacks an appropriate level of support, when such support is non-existent, is misleading. AHP's principal attack is at bottom nothing more than a disagreement as to how much proof is appropriate to prevent a claim from having the capacity to mislead. Although it is unclear what quantity or quality of proof AHP would consider sufficient,\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e AHP clearly regards the Commission's standard here -- that is, two clinical studies satisfying a number of criteria -- as excessive. Thus, AHP's challenge to the \"substantial question\" provision is essentially to a factual determination by the Commission that certain advertisements, in the absence of a designated type of proof, are deceptive.\n\nAs explained above, we are required to give deference to Commission findings that advertisements are deceptive. There are strong reasons why the Commission's demand for an especially high level of proof for advertising claims is justifiable under the facts of this proceeding. These reasons can be grouped into two categories: first, those based upon the special nature of the product category; and second, those relating to the particular facts of AHP's conduct.\n\nPervasive government regulation of drugs, and consumer expectations about such regulation, lend drug claims all the more power to mislead. The Commission's reasoning on this point (see especially App. 389 n. **) is similar to that approved in Simeon Management Corp. v. FTC, supra, 579 F.2d at 1145 (footnote omitted):\n\nThe Commission found that (1) some consumers will reasonably believe that the government exercises control over the promotion and use of prescription drugs; (2) this belief is intensified by the advertisements' representations that the weight loss treatments are safe, effective and medically approved; and (3) the representations may therefore reasonably lead consumers into the mistaken belief that the claims of safety and effectiveness are based, not on the advertiser's own opinion, but on a determination by the FDA. It further found that, in view of the public's belief that the government strictly regulates drugs, the fact that the treatments involve administration of a drug lacking FDA approval for such use may materially affect a consumer's decision to undergo the treatment. Accordingly, the Commission declared that the failure to disclose that the weight reduction treatments involve injection of a drug lacking FDA approval for such use renders the advertisements deceptive and thus in violation of § 5 of the FTCA.\n\nThe Commission in these proceedings reasonably extended the ideas approved in Simeon from prescription to non-prescription drugs, and from absolute representations about safety and effectiveness to comparative representations. Non-prescription as well as prescription drugs are subject to the FDA's requirements that absolute safety and efficacy be demonstrated by well-controlled clinical tests. And the Commission concluded that many consumers could reasonably believe that the federal government demanded similarly high standards for claims of comparative effectiveness and safety as are imposed on absolute claims.\n\nOf course the Commission is not committed to the unrealistic notion that consumers understand the clinical details of comparative drug testing or the exact mechanisms of government regulation. It merely asserts that consumers reasonably assume that the proper governmental authorities will take steps to ensure that unqualified claims of a drug's superiority are supported by whatever proof the appropriate medical or scientific experts consider sufficient.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nAnother consideration in favor of holding comparative effectiveness and safety claims for analgesics to high standards of substantiation is the difficulty for the average consumer to evaluate such claims through personal experience, and the consequent tenacity of advertising-induced beliefs about superiority. Several factors account for the lack of capability by consumers in this area. First, mild to moderate pain, especially headache pain, is \"self-limiting\"; that is, it will eventually disappear whether or not the consumer attempts a remedy. Consequently, the consumer cannot tell if relief was obtained spontaneously or as a result of the analgesic. Second, problems of memory may prevent reliable comparisons by a consumer between different preparations taken on different occasions. Third, pain varies in intensity, again undermining the reliability of any individual's judgments of comparative effectiveness. Fourth, the \"placebo effect\" ensures that many consumers will perceive relief even from totally ineffective products. As the ALJ noted, in \"clinical studies of mild to moderate pain, the placebo response rate, i.e., the rate of positive responses (perceived relief) in the presence of a pharmacologically inactive drug, is commonly between 30% and 60% [citing expert witnesses].\" App. 161. One expert witness \"demonstrated that, even on a blinded basis, individual consumers are unable to distinguish the comparative therapeutic effect of five OTC analgesics.\" App. 163. Because consumers cannot accurately rate the products for themselves, advertising, and the expectations which it engenders, becomes a significantly more influential source of consumer beliefs than it would otherwise be. See App. 243-44.\n\nThe health risks associated with aspirin are another special feature of the product category. The larger dosages of aspirin which AHP exhorts consumers to ingest increase the dangers of adverse side effects, with little evidence that there exist any countervailing benefits. The Commission summarized some of the dangers:\n\nAspirin may cause adverse side effects such as dyspepsia for some individuals (Grossman, Tr. 828; Plotz, Tr. 1044). For others, including asthmatics, a dangerous allergic reaction to aspirin is possible. (Falliers, Tr. 3187; Moertel, Tr. 1021; Stevenson, Tr. 1474). The Report for OTC Internal Analgesics (CX 367) of the Food and Drug Administration's (FDA) advisory review panel (a panel of outside experts established by FDA to review the safety and efficacy of OTC drugs) summarizes the possible adverse side effects of aspirin, which range from massive gastrointestinal bleeding (which may be fatal) to hepatic (liver) dysfunctions (CX 367014). For example, aspirin may interfere with normal blood clotting, increase internal bleeding, cause peptic ulcers, increase the incidence of neonatal deaths, depress the central nervous system, and cause anemia. For individuals with aspirin allergies, according to the Report, ingestion of asprin [sic] may result in shortness of breath, laryngeal swelling from anaphylactic shock, blocking of air pathways, and a sudden drop in blood pressure (id.).\n\nApp. 366-67, footnotes omitted. (\"CX\" denotes a documentary exhibit of complaint counsel.)\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nIn addition to the special features of the product, AHP's past behavior also supports the Commission's demand for a high level of proof. AHP has for many years waged advertising campaigns designed to impress upon the public the superiority of Anacin and APF. At least with respect to Anacin, there is much evidence that the campaigns had considerable success. The Commission, despite its finding of violations, decided that corrective advertising was unnecessary. It explained Part I (B) and other provisions of its order in part as a less intrusive means of undoing the damage caused by AHP's previous advertisements and as a means of keeping this proven violator from inflicting such damage in the future:\n\nA belief in the proven superiority of Anacin is most likely to continue if comparative claims continue to be made in Anacin advertising. But under this order, any future comparative efficacy or side effects claims must be effectively qualified -- i.e., corrected as to the lack of proof -- unless the requisite proof actually exists, in which case there will be no further deception. Moreover, the order will prevent respondent from conveying an erroneous impression of the product's superiority (proven or not) by means of claims about the unusualness of the ingredient in the product, in that it will prohibit false unusualness claims and will require the disclosure, in many Anacin ads, of the familiar name of aspirin.\n\nApp. 418. Even if the inherent nature of the products would not in itself justify Part I(B), when the product's nature is considered in conjunction with the facts of AHP's past actions, there is ample support for this provision.\n\nThe courts have accorded the Commission wide latitude in ordering advertisers to make disclosures which limit or counteract affirmative advertising claims. In National Commission on Egg Nutrition v. FTC, 570 F.2d 157, 160 (7th Cir. 1977), cert. denied, 439 U.S. 821, 58 L. Ed. 2d 113, 99 S. Ct. 86 (1978) the Commission allowed an egg industry group to make representations concerning the relation of egg consumption to heart and circulatory disease only if it was \"clearly and conspicuously disclosed in immediate conjunction therewith that many medical experts believe that existing evidence indicates that increased consumption of dietary cholesterol, including that in eggs, may increase the risk of heart disease.\" The Seventh Circuit upheld the Commission, explaining that this aspect of the order was appropriate to prevent future deception, even though the record did \"not show a long history of deception which has so permeated the consumer mind that the 'claim was believed by consumers after the false advertising had ceased,'\" id. at 164, quoting Warner-Lambert Co. v. FTC, 183 U.S. App. D.C. 230, 562 F.2d 749, 771 (1977), cert. denied, 435 U.S. 950, 55 L. Ed. 2d 800, 98 S. Ct. 1575, 98 S. Ct. 1576 (1978). The Egg Nutrition decision supports a provision, such as Part I(B) of the Order here, which requires that the existence of a controversy over the truth of a scientific assertion made in an advertisement be conveyed to the public. Moreover, Egg Nutrition upheld such a requirement even where, in contradistinction to the case at bar, there was no evidence that it was needed to serve a remedial function.\n\nA similar approach was taken by the Supreme Court in Colgate-Palmolive, when it affirmed a Commission finding that a televised \"test\" of a product's effectiveness is misleading because of the undisclosed substitution of a prop for a genuine component in the purported test. There were several possible ways of conforming to the Commission's order: the violator might seek to inform the public that the test is a simulation, an alternative that the violator alleged was impractical; the violator might televise real tests, a practice also alleged to be impractical; or the violator could simply do without such demonstrations in its advertisements. The alternatives open to AHP under Part I(B) would seem to be similar: it can reveal that there is a substantial question; it can perform the clinical tests that would, if successful, eliminate the substantial question; or it can eliminate its superiority claims.\n\nWarner-Lambert, supra, 562 F.2d at 759, considered it \"well established\" that \"under certain circumstances an advertiser may be required to make affirmative disclosure of unfavorable facts.\" Warner-Lambert cited Ward Laboratories, Inc. v. FTC, 276 F.2d 952 (2d Cir.), cert. denied, 364 U.S. 827, 5 L. Ed. 2d 55, 81 S. Ct. 65 (1960) and Keele Hair \u0026 Scalp Specialists, Inc. v. FTC, 275 F.2d 18 (5th Cir. 1960), which upheld Commission orders that sellers of baldness treatments must make clear that their products would have no effect on most baldness.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nAlthough it somewhat modified a Commission order, Warner-Lambert affirmed that portion of the order which required the company to disclose in future advertisements for Listerine that this product \"will not help prevent colds or sore throats or lessen their severity,\" id. at 752. Although the order was less burdensome than Part I(B) here in that it automatically terminated after a specified amount of advertising money had been spent by the violator, it was clearly more of an encumbrance in that, as a genuine \"corrective advertising\" requirement, it demanded disclosure in future advertisements regardless of the content of those advertisements. While Part I(B) has a corrective purpose, it is not a corrective advertising requirement in the narrow sense because AHP can escape its strictures by the simple expedient of ceasing to claim superior effectiveness or freedom from side-effects for its non-prescription analgesics. The Commission, recognizing that corrective advertising of the sort upheld in Warner-Lambert can be a significant burden on a violator, refused to order it in the present case. See App. 313-14 and 418.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nCommissioner Clanton, who concurred with the remainder of the Commission on all other points, dissented from Part I(B) of the Order. He acknowledged that it was\n\ntrue, of course, that the Commission need not refer to consumer surveys or similar extrinsic evidence to interpret the meaning of an advertisement . . . Similarly, actual deception need not be shown by complaint counsel to carry its burden of proof. It is necessary only that the advertisement have the tendency or capacity to deceive.\n\nApp. 355, citations omitted. Commissioner Clanton also agreed that \"consumers generally regard product performance claims to have some reasonable support.\" App. 358. Indeed, he granted that \"reasonable support\" in the present case might very well be medical or scientific proof; in other words, that Part I(B) of the order might well be justifiable. His principal objection was that the majority's approach was too inflexible. In his view, the Commission had adopted a per se rule that any comparative drug claim -- and perhaps all non-comparative drug claims, and even many comparative claims outside the drug area -- must be supported by scientific proof. But, according to Clanton, the Commission should examine drug claims on a case by case basis to determine whether they must be supported by scientific proof in order to be lawful under the statute.\n\nWe do not understand the Commission to have adopted such a rigid rule. Although there is some broad language in the opinion to support Clanton's concern, the Commission gave attention to the particular nature of AHP's advertisements, to the specific facts regarding the products involved, and to the effects of AHP's past deceptions. Even if it would have been preferable for the Commission to have had more evidence of consumer beliefs, this would not be a ground to modify or vacate its order. In the very case at hand, the Commission majority declined to impose the \"substantial question\" provision so relentlessly. Part I(B) applies only to non-prescription analgesics, not to prescription drugs or other non-prescription drugs, or any products other than drugs. Moreover, it applies only to comparative claims of effectiveness and freedom from side effects. If an appeal arises in which it appears that the Commission has employed a \"substantial question\" provision in an unyielding fashion, without regard for the facts of the case, that perhaps will be an appropriate occasion to consider modifying an order.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e It is worth noting that Clanton's more particular objection to the \"substantial question\" provision in the order here under review offers no comfort to AHP. He suggests that, so far from Anacin's superiority being proven, \"most researchers would simply dismiss [AHP's] purported substantiation as inadequate to establish anything scientifically.\" App. 38.\n\nIII. Part II of the Order\n\nPart II of the Order requires AHP to cease claiming falsely that its non-prescription drug products have special ingredients (Part II(A)), or have more of an active ingredient than do competing products (II(B)). AHP must also stop misrepresenting surveys or tests (II(C)), and must abandon all noncomparative claims of effectiveness or freedom from side effects lacking a reasonable basis (II(D)). Parts II(C) and II(D), like the other requirements of Part II, encompass all of AHP's non-prescription drug products. AHP objects that Parts II(A)-(C) are unsupportably broad and should be narrowed to Anacin and APF. Part II(D) is in AHP's view so vague that it must be vacated in full and not merely limited.\n\nA. The findings of fact underlying Part II of the Order\n\nAlthough AHP mounts no challenge to the findings on which the Commission seeks to base Part II, it is important to understand those findings in order to determine whether they warrant as broad an order as was issued. At no point in the proceedings has AHP attempted to defend the notion that Anacin or APF possess special or unusual analgesic ingredients. The only analgesic in either product is aspirin. Yet AHP's expert witness, Dr. Smith, acknowledged that the advertising campaign was designed to differentiate the products from ordinary aspirin, and this was confirmed by the officer responsible for advertising and marketing Anacin. (See App. 363-64, citing testimony of Smith and DeMott). One of the offending advertisements reads:\n\nAnacin tablets are so effective because they are like a doctor's prescription. That is, a combination of ingredients. Anacin contains the pain reliever most recommended by doctors plus an extra active ingredient not found in leading buffered aspirin. . . . The big difference in Anacin makes a difference in the way you feel.\n\n(Quoted in App. 364).\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e APF advertisements employed similar techniques (see App. 365). The Commission concluded that affirmative misrepresentation of the product's uniqueness, combined with the failure of the advertisements to reveal that the products contained aspirin, had the capacity to mislead consumers. In addition to its own reading of the advertisements, the Commission relied on the expert testimony of Dr. Ross and on several consumer surveys showing that many consumers were unaware of the presence of aspirin in Anacin, and believed that Anacin was superior to aspirin.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nAHP's advertising that Anacin and APF possessed more of an active ingredient than did their competitors' products was, similarly, an attempt at false product differentiation. One series of television advertisements announced that the consumer shown on camera \"found medically proved Anacin overpowers headache pain. For most headaches, all three leading pain relievers reach an effective level in your bloodstream in minutes. But in the final analysis the highest level is reached by Anacin. This higher level is the extra pain reliever Anacin provides for your headache.\" App. 513-516. The ALJ found that a claim of superiority over the \"leading\" products in a field would be understood by consumers as implying superiority over the entire category, a principle with which AHP's expert, Dr. Smith, seems to have agreed to a large extent. See App. 126-27 and 258; and 371-72. Yet other products on the market possess as much aspirin as Anacin and four widely available products -- APF, Arthritis Strength Bufferin, Cope, and Midol -- contain greater amounts. App. 157. Even more misleading are those advertisements that convey the impression the Anacin has twice as much pain reliever as all other non-prescription products. For example, one advertisement had it that\n\n2 Anacin Tablets have more of the one pain reliever doctors recommend most than 4 of the other leading extra strength tablets . . . . 2 Anacin contain more of this specific pain reliever than 4 of the others.\n\nAnother advertisement proclaims:\n\nAnacin's fortified formula has more of this specific pain reliever than any other leading headache tablet. In fact, Anacin is formulated twice as strong in the amount of this specific pain reliever as the other leading extra-strength tablet.\n\nThe ALJ quoted these two advertisements, along with several others. App. 124-25. See App. 194. Despite the implication that Anacin has twice as much pain reliever as any other non-prescription analgesic (or at least as any other that is readily available), as previously noted, four commonly obtainable products actually contain more pain reliever than Anacin.\n\nPart II(C) of the Order prohibits AHP from misrepresenting in certain ways any test, study or survey. The findings that form the predicate of this provision were that AHP misrepresented tests comparing Anacin with other analgesics (App. 373-75 and 412), as well as misrepresenting a survey of doctors (App. 399, 412; see App. 195). While Part II(C) applies to all of AHP's non-prescription drug products, the Commission limited it \"to conform to the types of misrepresentations that respondent made: namely, efficacy and freedom from side effects claims.\" App. 412. Cf. Litton, supra, 676 F.2d at 371-72.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nAlthough Part II(D) of the Order is sweeping -- prohibiting any non-comparative representation, without a reasonable basis, of the effectiveness or freedom from side effects of a non-prescription drug product -- the finding which supports it is quite narrow. The only non-comparative claim of effectiveness or freedom from side effects, lacking a reasonable basis, which the Commission specifically found was the advertising message that Anacin offers relief from tension. To point out that the finding is relatively narrow is of course not to suggest that it was unimportant or unsupported by the evidence. Indeed, AHP has declined to challenge here the finding regarding tension relief.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\nThe advertisements in question -- and there were a great many -- represented that Anacin alleviates various tension-related conditions such as nervousness, tension, stress, fatigue, and depression. There was not the slightest basis for such representations. AHP claimed before the Commission that the advertisements merely made the true claim that Anacin will help tension-associated pain, but has chosen to abandon this contention on appeal. Two print advertisements in the record, both entitled \"When Boredom and Emotion Fatigue Bring on \"Housewife Headache,'\" advised consumers:\n\nMaking beds, getting meals, acting as family chauffeur -- having to do the same dull work day after day -- is a mild form of torture. This can bring on nervous tension, fatigue and what is now known as 'housewife headache'. For this type of headache you need strong yet safe relief. So next time take Anacin. Anacin gives you twice as much of the strong pain reliever doctors recommend most as the other leading extra strength tablet.\n\nMinutes after taking Anacin, your headache goes, so does its nervous tension and fatigue. Lets you feel better all over. Despite its strength, Anacin is safe taken as directed. It doesn't leave you depressed or groggy. Next time take Anacin Tablets!\n\nApp. 535, 536; see also App. 534, 537-39. Television advertisements made the same claims, conjoined with depictions of stressful situations. See App. 397-98. It is not surprising that, as AHP's own survey showed, consumers exposed to such advertising were far more likely to identify \"tension/nervous tension\" than \"tension headache\" as the symptom relieved by Anacin. See App. 398.\n\nB. The Commission's Discretion to \"Fence In\" Violators\n\nPrimary responsibility for fashioning orders rests with the Commission. FTC v. National Lead Co., 352 U.S. 419, 429, 1 L. Ed. 2d 438, 77 S. Ct. 502 (1957). As the Supreme Court observed in FTC v. Ruberoid Co., 343 U.S. 470, 473, 96 L. Ed. 1081, 72 S. Ct. 800 (1952) (footnote omitted):\n\nIn carrying out this function the Commission is not limited to prohibiting the illegal practice in the precise form in which it is found to have existed in the past. If the Commission is to attain the objectives Congress envisioned, it cannot be required to confine its road block to the narrow lane the transgressor has traveled; it must be allowed effectively to close all roads to the prohibited goal, so that its order may not be by-passed with impunity.\n\nMore succinctly, \"those caught violating the Act must expect some fencing in.\" National Lead, supra, 352 U.S. at 431. The necessity for allowing the Commission to construct broad remedial orders results in part from the fact that \"there is no limit to human inventiveness in this field,\" Sears, Roebuck, supra, 676 F.2d at 391, quoting H.R. Conf. Rep. No. 1142, 63d Cong., 2d Sess., 19 (1914).\n\nWe are cautioned that \"courts should not 'lightly modify' the Commission's orders,\" Colgate-Palmolive, supra, 380 U.S. at 392. The rule set forth in Jacob Siegel Co. v. FTC, 327 U.S. 608, 612-13, 90 L. Ed. 888, 66 S. Ct. 758 (1946), is that the Commission \"has wide latitude for judgment and the courts will not interfere except where the remedy selected has no reasonable relation to the unlawful practices found to exist.\" The Jacob Siegal \"reasonable relation\" test has been applied in numerous cases, e.g., Colgate-Palmolive, supra, 380 U.S. at 392; National Lead, supra, 352 U.S. at 428; Ruberoid, supra, 343 U.S. at 473; Consumers Products of America Inc. v. FTC, 400 F.2d 930, 933 (3d Cir. 1965); see also Beneficial, supra, 542 F.2d at 618; and Bakers Franchise Corp., supra. 302 F.2d at 262.\n\nIn Colgate-Palmolive, 380 U.S. at 392, however, the Supreme Court has\n\nwarned that an order's prohibitions \"should be clear and precise in order that they may be understood by those against whom they are directed,\" [citation omitted] and that \"the severity of possible penalties prescribed . . . for violations of orders which have become final underlines the necessity for fashioning orders which are, at the outset, sufficiently clear and precise to avoid raising serious questions as to their meaning and application.\" [citation omitted]\n\nOrders worded in such general language that serious questions as to meaning and application exist \"are disfavored because they alter the scheme of penalties and enforcement procedures defined by the Act without specific identification of the proscribed conduct.\" Standard Oil, supra, 577 F.2d at 661. When an advertiser is accused of violating the statute it receives a full hearing before the Commission, and if the Commission finds against the advertiser, a cease and desist order will issue. In contrast, an accusation that a Commission order has been violated is heard in district court, short-circuiting the agency hearing process envisioned by the statute and subjecting the advertiser to harsher penalties. See id. at 661; and Litton Industries, supra, 676 F.2d at 371. Colgate-Palmolive, requires only, however, that the crucial terms of an order be \"as specific as the circumstances will permit.\" 380 U.S. at 393.\n\nThe Commission must, therefore, adhere to two rules when attempting to fence in a violator. Under Jacob Siegal, there must be a reasonable relation between the violation and the order; under Colgate-Palmolive, an order must be sufficiently clear and precise to be understood by the violator, although the order need be no more definite than circumstances permit.\n\n\"Fencing in\" often takes the form, as in this case, of a multi-product order.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Thus, in Colgate-Palmolive, the Supreme Court sustained an all-product order on the basis of only three advertisements for a single product:\n\nWe find no defect in the provision of the order which prohibits respondents from engaging in similar practices with respect to \"any product\" they advertise. The propriety of a broad order depends upon the specific circumstances of the case, but the courts will not interfere except where the remedy selected has no reasonable relation to the unlawful practices found to exist. In this case the respondents produced three different commercials which employed the same deceptive practice. This we believe gave the Commission a sufficient basis for believing that the respondents would be inclined to use similar commercials with respect to the other products they advertise. We think it reasonable for the Commission to frame its order broadly enough to prevent respondents from engaging in similarly illegal practices in future advertisements.\n\n380 U.S. at 394-95, footnote omitted. \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nNoting that \"fencing-in provisions are prophylactic,\" a recent decision of the Ninth Circuit stated that \"the ultimate question is the likelihood of the petitioner committing the sort of unfair practices [the provisions] prohibit,\" Litton Industries, supra, 676 F.2d at 370. In answering this ultimate question, that court in another recent case summarized the relevant considerations:\n\nWhere a fair assessment of an advertiser's conduct shows a ready willingness to flout the law, sufficient cause for concern regarding further, additional violations exists. Two factors or elements frequently influence our decision -- the deliberateness and seriousness of the present violation, and the violator's past record with respect to unfair advertising practices. Standard Oil Co. of California v. FTC, 577 F.2d 653, 662 (9th Cir. 1978). Other circumstances may be weighed, including the adaptability or transferability of the unfair practice to other products. See Colgate-Palmolive Co., 380 U.S. at 395, 85 S. Ct. at 1047. The weight given a particular factor or element will vary. The more egregious the facts with respect to a particular element, the less important it is that another negative factor be present. In the final analysis, we look to the circumstances as a whole and not to the presence or absence of any single factor.\n\nSears, Roebuck, supra, 676 F.2d at 392, citations and footnote omitted.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e Thus, the validity of a multi-product order depends to a large degree on the facts of the particular proceeding. Because a multi-product order requires a prediction of the likely future conduct of a proven violator, and such a prediction is even more dependent on pragmatic inference and accumulated expertise than are most factual determinations, it may be especially appropriate to defer to the Commission's appraisal of the need for multi-product coverage.\n\nIn addition to the three Sears, Roebuck criteria, the court may also factor in the seriousness of the potential violations which the fencing-in provisions prohibit. The Commission should be allowed to consider that the consequences of a failure to construct a sturdy \"fence\" would be severe. This element is of course similar to the first Sears, Roebuck component in looking to \"seriousness,\" but it differs in focusing on the seriousness of the actions to be proscribed rather than on the violator's past conduct. There must always be a reasonable relation, however, between the violation and the order; the Commission cannot proscribe conduct which bears no relation to the proven violation merely because such conduct would, if engaged in, have extremely untoward results. When drug advertising is at issue, the potential health hazards may well justify a more sweeping order than would be proper were the Commission dealing with a less consequential area.\n\nC. Parts II(A)-(C) of the Order\n\nParts II(A)-(C) of the Order withstand AHP's challenges. Each of the factors set forth in Sears, Roebuck is present here to a significant extent. And since the Commission is attempting to curb misleading drug advertising by a proven violator, it should have especially wide latitude.\n\nIt should be emphasized that the findings underlying Part II of the Order are based on settled principles and are unchallenged by AHP at this stage of the proceedings. Although AHP attempts to extenuate its violations by arguing that \"the standards by which its advertisements were judged in this case did not exist at the time the advertisements were disseminated,\" Petitioner's Reply Br. 14, this contention would be valid, if at all, only in the context of Part I(B) of the Order. The arguable novelty of the \"substantial question\" doctrine underpinning Part I(B) cannot support an inference, with respect to Part II, that AHP lacked \"a ready willingness to flout the law,\" see Sears, Roebuck, supra, 676 F.2d at 392.\n\nThe first Sears, Roebuck element is the \"deliberateness and seriousness\" of the violation. The ALJ found that Anacin's advertising campaigns were attempts to convince the public that Anacin differed from its competitors, even when no significant differences existed. The advertisements evince massive, long-standing efforts to persuade the public that Anacin had a special ingredient, that it did not have aspirin, that it had more \"pain reliever\" than competitor's products, that tests demonstrated Anacin's superiority, that doctors in surveys preferred Anacin, and that Anacin relieved tension. Furthermore, the concealment of Anacin's aspirin content created a health danger for some consumers. Similarly, by misrepresenting the tension-relieving qualities of Anacin, AHP encouraged unnecessary ingestion of a potentially hazardous product. The statement that it was established that Anacin provides more pain relief than \"ordinary\" aspirin also may have encouraged unnecessary aspirin consumption. The seriousness of the violations is enhanced by the inability of consumers to evaluate the product for themselves and to make purchasing decisions on the basis of personal experience. \"Deliberateness\" and \"seriousness\" appear to be present to a fairly large degree.\n\nThe violator's past record -- the second Sears, Roebuck factor -- also supports the Commission's decision. The Commission had previously entered three litigated cease and desist orders against AHP for misleading non-prescription drug advertisements: Wyeth Chemical Co., 29 F.T.C. 281 (1939); American Home Products Corp., 63 F.T.C. 933 (1963); and American Home Products Corp., 70 F.T.C. 1524 (1966), aff'd in part, modified in part, American Home Products Corp. v. FTC, 402 F.2d 232 (6th Cir. 1968).\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nExplaining Part I of the Order, the Commission indicated that there was \"simply no room left to doubt that respondent is a habitual violator of the Federal Trade Commission Act, American Home Products Corp. v. FTC, supra, 402 F.2d at 237, and that in order to protect the public adequately against future deception of the same sort, these provisions of our Order must cover claims for more than the two products misrepresented.\" App. 407.\n\nWe need not decide whether, in the absence of other considerations, AHP's violations could be considered sufficiently \"habitual\" to warrant a multi-product order. We merely recognize that there have been previous violations which the Commission was entitled to place in the balance along with the other factors. Moreover, where, as in this case, the \"present\" violations have been extensively disseminated over a long period,\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e the relative lack of \"past record\" should be weighed less heavily.\n\nThe \"adaptability or transferability\" of the violations to other products is the next item to consider. Explaining the scope of Part II(A) of the Order, the Commission remarked on AHP's demonstrated propensity to mislead and the ease with which its deceptive practices could be transferred to other products:\n\nWe believe it essential that Part II.A encompass all OTC drug advertising by AHP, and bar misrepresentations of the specialness of common ingredients other than aspirin. The effort to misrepresent the nature of a quite ordinary ingredient -- whether it is aspirin, caffeine, or some other substance*fn* -- is a technique that could easily be applied to advertising of OTC drug products other than Anacin or APF. And as we have described above in detail, this respondent's history of misleading advertising raises a serious concern that the order imposed here be carefully drawn if it is to succeed in preventing future violations.*fn**\n\nApp. 411. The decision to impose a narrower order on Clyne than on AHP is a further indication that the Commission's multi-product prohibitions were carefully tailored to the facts of AHP's behavior. Although it does not appear that the Commission explicitly appealed, in defense of Part II(B) of the order, to the transferability of false representations that a product has more of an active ingredient, it seems clear enough that such a deceptive practice is as transferable as the practices proscribed by Part II(A). In addition, misrepresenting that doctors prefer a product, or that tests prove the product's superiority, is a form of deception that could readily be employed for any non-prescription drug product. Thus transferability is a significant factor in favor of allowing Part II(C) to encompass a broad range of products.\n\nAll the Sears, Roebuck elements, and the additional consideration that the public's health could be endangered by the conduct that is proscribed, lead us to conclude that the Commission did not abuse its discretion by reining in AHP with Parts II(A)-(C) of the Order.\n\nIn attacking Parts II(A)-(C) of the Order, AHP cites Standard Oil, supra. But the multi-product order struck down by Standard Oil was, especially under the facts of that case, truly extraordinary; the order against AHP in the present case is considerably milder, and the circumstances here indicate a much more presssing need for some multi-product coverage. In Standard Oil, on the strength of just three implicitly misleading advertisements for a single product, a manufacturer and its advertising agency were subjected to an order covering thousands of products, including \"fuel and lubricant products, waxes, fertilizers, pesticides, garden equipment, and cook books.\" 577 F.2d at 661. The manufacturer had never before been accused of false advertising and its agency had had only one consent order entered against it by the Commission. Id. at 663. The deception could not easily be transferred to other products, there was no \"blatant and utter disregard of the law,\" and the violators made \"a good faith attempt to eliminate rapidly the implied misstatements . . .\" Id. at 662-63. In the case at hand, only 35 products by AHP's count -- all of them non-prescription drugs -- are covered. The deceptions were extensive, involving numerous advertisements over many years. Even though it would be inaccurate to characterize AHP's behavior as a \"blatant and utter disregard of the law,\" the violations were serious. Moreover, AHP made no \"good faith attempt to eliminate rapidly the misstatements.\"\n\nAHP rests its argument primarily on the Sixth Circuit's reasoning in American Home Products Corp. v. FTC, 402 F.2d 232, 237 (6th Cir. 1968) (the Preparation H case). Preparation H appears to stand for the proposition that, unless it has been \"established that the petitioner is a habitual violator of the Federal Trade Commission Act,\" no multi-product order can be sustained when violations are found with respect only to one drug. As the Ninth Circuit recently declared, however, since the Preparation H proceeding \"courts have regularly refused to follow such reasoning,\" Sears, Roebuck, supra, 676 F.2d at 392. It is also arguable that Preparation H was at variance with the Supreme Court's decision in Colgate-Palmolive, supra, which made the propriety of a multi-product order depend \"upon the specific circumstances of the case,\" 380 U.S. at 394. The Supreme Court in Colgate-Palmolive mentioned transferability of the unfair practice as a factor, implying that the \"habitual violator\" issue is not dispositive. Even if we were to follow Preparation H, we would not necessarily disagree with the Commission's determination that even under that decision AHP can be considered a habitual violator and therefore can be subjected to a multi-product order.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\nAttempts by AHP to distinguish Litton, supra, and Sears, Roebuck, supra, are unavailing. The order upheld in Litton banned misuse of survey results with respect to all of the manufacturer's consumer products, although the only proven violations involved microwave oven advertisements. It is true that one factor noted by the court was that the multi-product prohibition would not be very burdensome because Litton produced \"few\" consumer goods. 676 F.2d at 371. But in a very important aspect the order here is more modest than that upheld in Litton, for it applies not to all consumer products but only to non-prescription drugs sold to consumers. Had the Commission in its order against Litton adopted an approach comparable to that employed here, it might have restricted its order to home appliances or major home appliances. The Court characterized the Litton order as \"narrow,\" but only in the sense that Parts II(A)-(C), although not Part II(D), in this case are also narrow: although encompassing a group of products, the provisions refer only to violations of the precise sort actually found. See id. at 371-72.\n\nIn Sears, Roebuck, an order applicable to all major home appliances of the advertiser was sustained where one such product, a dishwasher, had been misrepresented. The fourteen covered items constituted \"a small proportion of the total number of products sold by Sears,\" 676 F.2d at 395. But Sears, Roebuck, as explained above, looked \"to the circumstances as whole,\" id. at 392, in evaluating the multi-product order, and there is no suggestion that the court considered the proportion of the manufacturer's products covered to be of great significance. Indeed, it observed that the Supreme Court in Colgate-Palmolive had upheld an all-products order; and it approved the Second Circuit decision, Jay Norris, supra, sustaining an all-products order. Id. at 385.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\n\nD. Part II(D) of the Order\n\nIn contrast to the detail that characterizes much of the Commission's opinion, the reasoning in support of Part II(D) is quite abbreviated:\n\nPart II.D of the order requires respondent to have a reasonable basis, consisting of competent and reliable scientific evidence, for any . . . non-comparative representations concerning the effectiveness or freedom from side effects of its OTC drug products. In light of the overall history of advertising violations by AHP, described above, we believe this provision is necessary as a fencing-in measure to prevent respondent from making other unsubstantiated non-comparative claims.\n\nApp. 413. A footnote to this passage simply refers to the Commission's discussion of AHP's comparative claims. The Commission apparently meant to justify Part II(D) on the grounds that the deceptive comparative claims of effectiveness and safety for Anacin and APF, and the one deceptive non-comparative claim of effectiveness for Anacin (i.e., the claim that Anacin relieves tension) support a fencing in provision directed to all non-comparative claims of effectiveness or safety for all of AHP's non-prescription drugs.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e This is a broader and vaguer provision than Parts II(A)-(C), and is premised on a more slender basis. In addition to covering many products as to which no deceptions were found, it encompasses deceptive practices which seem to be quite dissimilar to the deceptions actually found. While a provision such as Part II(D) might in other instances be sustained, Part II(D)'s lack of clarity, in our judgment, is too great under the circumstances of this case to survive review.\n\nPart II(D) requires that AHP possess, with respect to any non-prescription drug product, a \"reasonable basis\" for any non-comparative representation of effectiveness or freedom from side effects. The \"reasonable basis\" test, as interpreted by the Commission, is flexible: \"The appropriate measure for . . . support is, of course, to be determined in light of the particular claims made and the products for which they are made,\" App. 390 n. **. While the Commission at one point has apparently suggested that any drug performance claim must be supported by two well-controlled clinical studies (id. 390 n. **), the Commission acknowledged in the same opinion \"the possibility that comparative claims for [non-prescription drugs other than analgesics] may be adequately substantiated, at least in some instances, by evidence other than two clinical tests . . .\" (id. 407). Because the Commission has chosen not to bind itself in advance to rules as to the interpretation of the phrase \"reasonable basis,\" any order which essentially relies upon \"reasonable basis\" language will be imprecise, although not necessarily fatally so.\n\nThe vice of vagueness is exacerbated by the breadth of an order. An unclear order whose prohibitions begin to approach in scope the statutory proscriptions creates the risk that primary interpretation and enforcement of the statute will be shifted from the Commission to the district court. See Standard Oil, supra, 577 F.2d at 661; cf. American Home Products, supra, 402 F.2d at 237. Although it goes too far to say that Part II(D) simply \"admonish[es] petitioner not to violate the law again,\" Petitioner's Br. 48, it is also inaccurate to declare that the provision \"proscribes a specific subset of deceptive advertising, like and related to the deception that occurred here,\" Respondent's Br. 42. While Part II(D) does not track the statutory language, and sweeps less broadly than the statute, it is nevertheless far-reaching enough to demand that we scrutinize it closely before concluding that the circumstances required such imprecision.\n\nWhile AHP presumably can \"oblige the Commission to give [it] definitive advice as to whether [its] proposed action, if pursued, would constitute compliance with the order,\" Colgate-Palmolive, 380 U.S. at 394, Jay Norris, 598 F.2d at 1251, and this possibility is a factor weighing in favor of permitting a certain amount of imprecision, we do not believe that it cures the excessive vagueness here.\n\nIf AHP had committed several different violations of the type proscribed by Part II(D), the breadth and vagueness of this provision would be less troublesome. But the only advertising claim made by AHP that is in the category proscribed by Part II(D) is the claim that Anacin relieves tension. This was a non-comparative representation of effectiveness. There were no non-comparative misrepresentations of freedom from side effects.\n\nAlthough AHP has demonstrated a propensity to represent improperly the superiority in various respects of Anacin and APF over those of its competitiors, the Commission has said little to support a contention that AHP has an inclination to misrepresent the non-comparative freedom from side effects of any product. As noted, supra, n. 5, the heart of this case is AHP's attempt to differentiate its products from those of competitors. Any attempts by AHP to misrepresent, in absolute terms, some qualities of its products, seem to have been somewhat more peripheral to its advertising strategy, even if such attempts led to serious violations.\n\nThe Commission has not recommended any improvements that might be ordered in the event Part II(D) is found to be unsupportably vague. Though it is undisputed that false non-comparative claims of efficacy have more serious consequences than comparative ones (Petitioner's Reply Br. 3 n. 9), the Commission has not argued that a false claim of ability to relieve tension is readily transferable to any non-prescription drug.\n\nIn sum, the following factors persuade us that Part II(D) should be vacated in its entirety: the only violation of the sort interdicted by Part II(D) that AHP actually committed is specifically covered by the uncontested Part IV; there is no indication that this violation is easily transferable; the record is ambiguous as to the likelihood that AHP will in the future disseminate false non-comparative claims; the provision is quite imprecise; Part II(D) would be equally imprecise, and still quite broad, even if limited to non-comparative effectiveness claims; the Commission has not explained why the circumstances require such imprecision.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e\n\nIV. Part III of the Order: The Aspirin Disclosure Provision\n\nPart III of the Order imposes the requirement of disclosing the presence of aspirin whenever any performance claim is made in Anacin or APF advertisements. AHP is concerned that this is a \"burdensome prior restraint.\" It insists that Part II(A) of the Order -- which is unchallenged in its application to Anacin and APF -- ensures that deception as to the ingredients of Anacin and APF will end. Part II(A) terminates AHP's claims of \"special ingredients.\" AHP's argument therefore is that since it will no longer be able to claim that Anacin and APF have special or unique ingredients, there is no longer any deception, and for the Commission to impose further requirements is a violation of First Amendment free speech rights.\n\nThe Commission appears to have justified the disclosure requirement on two grounds. First, as AHP no longer disputes, past advertisements misled the public as to the contents of Anacin and APF. Without disclosure, the public's misimpressions would tend to persist. Second, unless a disclosure requirement is imposed, AHP, with its \"striking history . . . of related advertising violations . . . will devise ways to continue misrepresenting the nature of its product.\"\n\nAHP's attempts to conceal the presence of aspirin in Anacin and APF were aptly summarized as follows:\n\nOn the basis of the small actual differences in formulation between the Anacin (and APF) compounds and plain aspirin, respondents' advertisements have created an impression that the products are based on some special, unusually strong pain reliever entirely different from and superior to aspirin. Whenever aspirin is named in the Anacin ads, it is used in such a way to contrast it with Anacin and associate it with Anacin's competitors. None of the challenged Anacin advertisements discloses that the analgesic ingredient in Anacin itself is, in fact, aspirin; instead, the identity of Anacin's ingredient is in every single instance obscured with phrases like \"the pain reliever doctors recommend most\" and \"this specific fast acting ingredient against pain.\"\n\nApp. 364. The point is not that a failure to disclose aspirin in advertisements for aspirin-based products is necessarily misleading, but that it was misleading at least in the context of AHP's attempts to distinguish Anacin's ingredient as special or unique.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\nThe Commission's judgment that Part III is needed in addition to Part II(A) is acceptable under the \"reasonable relation\" test of Jacob Siegel, supra and the \"fencing in\" precedents. The cases are uniform that the Commission's evaluations of the likelihood that a proven violator will devise new deceptions deserve much deference. What is more, Part II(A) seems insufficient to overcome the effects of past misrepresentations that Anacin does not have aspirin. We cannot hold that the Commission is authorized to require aspirin disclosure only in the same contexts that failure to disclose was specifically found misleading.\n\nAHP seems to recognize that the \"fencing in\" doctrine provides powerful support for the Commission's Order. It appears, instead, that AHP is arguing that the fencing in doctrine is unconstitutional in its application here.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e AHP alleges that Part III is an unconstitutional and \"burdensome prior restraint.\" It is difficult to locate the burden, however; and even if there would be a significant burden, Part III would be vindicated by the very free speech cases on which AHP relies.\n\nThe disclosure requirement is not burdensome except insofar as it may inhibit illicit attempts to derive a market advantage from promoting misimpressions about Anacin and APF. It would consume far less space -- and presumably less of AHP's advertising budget -- to admit that the products have aspirin than to indulge in circumlocutions designed to conceal this fact. To take just one example, according to an AHP advertisement, \"Anacin starts with as much pain reliever as the leading aspirin tablet. Then adds an extra core of this specific fast-acting ingredient against pain.\" App. 364. Compliance with Part III could easily be accomplished by substituting \"aspirin\" for \"pain reliever,\" or perhaps by replacing \"this specific fast-acting ingredient against pain\" with the word \"aspirin.\" Modifications of this sort would save space, comply with Part III, and yet convey essentially the same information as the origial version. The Commission has represented that if situations arise in which the disclosure of aspirin in advertisements covered by Part III would pre-empt space, it will \"entertain a request\" for a modification. Appellee's Br. 33 n. 23.\n\nExempted from Part III are advertisements that incorporate no performance claims -- for example, those that merely inform the public where and at what price the products are available, or perhaps those that avoid product information in favor of merely creating a \"mood\" assocated with the products. Thus Part III is not a true \"corrective advertising\" provision in that its disclosure requirements are only triggered when AHP makes certain types of claims. Thus some advertisements, especially the more abbreviated ones, would avoid Part III's strictures. Part III merely requires that if AHP takes the space to make performance claims, it must also state that the product for which the claims are made contains aspirin.\n\nAHP misconceives the commercial free speech cases. These cases would not aid AHP's cause even if AHP were correct that Part III of the Order is burdensome. AHP relies heavily on Beneficial, supra, a decision which if anything lends weight to the Commission's position. In Beneficial, the Commission had forbidden an advertiser from using the slogan \"Instant Tax Refund.\" The so-called \"Instant Tax Refund\" was in fact an ordinary loan, and the phrase tended to mislead consumers into supposing that a special service, keyed to the individual's anticipated tax refund, was offered. This Court nevertheless set aside the Commission's prohibition, because of the failure \"to consider fully the possibility of requiring merely that advertising copy be rewritten in lieu of total excision of the offending language.\" 542 F.2d at 619. Qualifying explanatory language is in general a preferable remedy. Id. at 618-620.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e In the present case, the Commission has acted precisely as Beneficial directed. It determined that, while the advertisements were misleading, there was no necessity to ban particular words or phrases. Rather, AHP is permitted to employ any language it chooses, provided that a qualifying explanation is included. It may, for example, continue to refer to \"this specific fast-acting ingredient against pain,\" but it must also convey that this ingredient is aspirin.\n\nRecent extension of First Amendment protection to commercial speech is founded on the philosophy that commercial speech warrants the \"degree of protection . . . necessary to insure that the flow of truthful and legitimate commercial information is unimpaired,\" Virginia State Board of Pharmacy v. Virginia Citizens Consumer Council, 425 U.S. 748, 772 n. 24, 48 L. Ed. 2d 346, 96 S. Ct. 1817 (1976). The Supreme Court did not \"prohibit the State from insuring that the stream of commercial information flow cleanly as well as freely.\" id. at 772. When health is involved, the interest in assuring a \"clean\" flow of information is enhanced. National Commission on Egg Nutrition, supra, 570 F.2d at 162. The rationale of the commercial speech cases, \"to open the channels of communication,\" Virginia State Board of Pharmacy, 425 U.S. at 770, can have no application here. Indeed, it would be a subversion of commercial speech doctrine to hold that AHP's interest in preventing the nature of its products from being unveiled in its advertisements invalidates the Commission's disclosure order.\n\nV. Conclusion\n\nFor the reasons set out above, the Order of the Commission will be modified by the deletion of Part II(D), and, as modified, enforced. There is no contention that the Commission abused its discretion by refusing, in its denial of AHP's petition for rehearing, to stay its Order until proceedings against AHP's competitors, Sterling Drug and Bristol-Myers, have been completed.\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e The Commission, however, has indicated that it will consider such a stay after we have issued our decision, and it would not seem unreasonable that in the interests of fairness a stay be granted at least with respect to Part I(B).\n\nAppendix: THE COMMISSION'S ORDER\n\nI\n\nIT IS ORDERED that respondent American Home Products Corporation, its successors and assigns and respondent's officers, agents, representatives and employees, directly or through any corporation, subsidiary, division or other device, in connection with the advertising, offering for sale, sale or distribution of \"Anacin,\" \"Arthritis Pain Formula,\" or any other non-prescription internal analgesic product, in or affecting commerce, as \"commerce\" is defined in the Federal Trade Commission Act, do forthwith cease and desist from:\n\nA. Making any representation, directly or by implication, that a claim concerning the superior effectiveness or superior freedom from side effects of such product has been established or proven unless such representation has been established by two or more adequate and well-controlled clinical investigations, conducted by independent experts qualified by training and experience to evaluate the comparative effectiveness or comparative freedom from side effects of the drugs involved, on the basis of which it could fairly and responsibly be concluded by such experts (1) that the drug will have the comparative effectiveness or freedom from side effects that it is represented to have, and (2) that such comparative effectiveness or freedom from side effects is demonstrated by methods of statistical analysis, and with levels of confidence, that are generally recognized by such experts. The investigations shall be conducted in accordance with the procedures set forth below:\n\nAt least one of the adequate and well-controlled clinical investigations to evaluate the comparative effectiveness of the drug shall be conducted on any disease or condition referred to, directly or by implication; or, if no specific disease or condition is referred to, then the adequate and well-controlled clinical investigations shall be conducted on at least two conditions or diseases for which the drug is effective. The clinical investigations shall be conducted as follows:\n\n1. The subjects must be selected by a method that:\n\na. Provides adequate assurance that they are suitable for the purposes of the investigation, and diagnostic criteria of the condition to be treated (if any);\n\nb. Assigns the subjects to the test groups in such a way as to minimize bias; and\n\nc. Assures comparability in test and control groups of pertinent variables, such as age, sex, severity or duration of disease or condition (if any), and use of drugs other than the test drugs.\n\n2. The investigations must be conducted double-blind, and methods of double-blinding must be documented. In addition, the investigations shall contain a placebo control to permit comparison of the results of use of the test drugs with an inactive preparation designed to resemble the test drugs as far as possible.\n\n3. The plan or protocol for the investigations and the report of the results shall include the following:\n\na. A clear statement of the objective of the investigation;\n\nb. An explanation of the methods of observation and recording of results, including the variables measured, quantitation, assessment of any subject's response and steps taken to minimize bias on the part of subject and observer;\n\nc. A comparison of the results of treatments or diagnosis with a control in such a fashion as to permit quantitative evaluation. The precise nature of the control must be stated and an explanation given of the methods used to minimize bias on the part of the observers and the analysts of the data.\n\nd. A summary of the methods of analysis and an evaluation of data derived from the study, including any appropriate statistical methods.\n\nB. Making any representation, directly or by implication, of superior effectiveness or freedom from side effects of such product unless:\n\n1. The superior effectiveness or superior freedom from side effects so represented has been established according to the terms set forth in paragraph I.A. of this Order, or\n\n2. Each advertisement containing such representation contains a clear and conspicuous disclosure that there is a substantial question about the validity of the comparative efficacy or side effects claim, or that the claim has not been proven. Such a disclosure may consist of a clear and conspicuous statement that the claim is \"open to substantial question,\" or that the claim \"has not been proven.\" If other language is used by respondent to convey the required message, respondent shall maintain, for a period of three (3) years after the dissemination of any advertisement containing such disclosure, records sufficient to demonstrate that the required message is effectively conveyed to the advertisement's intended audience.\n\nII\n\nIT IS FURTHER ORDERED that respondent American Home Products Corporation, its successors and assigns and respondent's officers, agents, representatives and employees, directly or through any corporation, subsidiary, division or other device, in connection with the advertising, offering for sale, sale or distribution of \"Anacin,\" \"Arthritis Pain Formula,\" or any other non-prescription drug product, in or affecting commerce, as \"commerce\" and \"drug\" are defined in the Federal Trade Commission Act, do forthwith cease and desist from:\n\nA. Making any representation, directly or by implication, that such product contains any unusual or special ingredient when such ingredient is commonly used in other non-prescription drug products intended for the same use or uses as the product advertised by respondent.\n\nB. Making any false representation that such product has more of an active ingredient than any class of competing products.\n\nC. Misrepresenting in any manner any test, study or survey or any of the results thereof, concerning the comparative effectiveness or freedom from side effects of such product.\n\nD. Making any noncomparative representation, directly or by implication, concerning the effectiveness or freedom from side effects of such product unless, at the time such representation is made, respondent has a reasonable basis for such representation which shall consist of competent and reliable scientific evidence.\n\nIII\n\nIT IS FURTHER ORDERED that the respondent American Home Products Corporation, its successors and assigns and respondent's officers, agents, representatives and employees, directly or through any corporation, subsidiary, division or other device, in connection with the advertising, offering for sale, sale or distribution of \"Anacin,\" \"Arthritis Pain Formula,\" or any product in which \"Anacin\" or \"Arthritis Pain Formula\" is used in the name, or in affecting commerce, as \"commerce\" is defined in the Federal Trade Commission Act, do forthwith cease and desist from failing to disclose clearly and conspicuously that the analgesic ingredient in such product is aspirin, when such is the case and when the advertisement makes any performance claim for the product.\n\nIV\n\nIT IS FURTHER ORDERED that respondent American Home Products Corporation, a corporation, its successors and assigns and respondent's officers, agents, representatives and employees, directly or through any corporation, subsidiary, division or other device, in connection with the advertising, offering for sale, sale or distribution of \"Anacin,\" in or affecting commerce, as \"commerce\" is defined in the Federal Trade Commission Act, do forthwith cease and desist from making any representation, directly or by implication, that Anacin relieves nervousness, tension, anxiety or depression or will enable persons to cope with the ordinary stresses of everyday life.\n\n[Parts V-VII omitted]\n\n\u003cspan class=\"fn\"\u003e1. The complaint also named Clyne Maxon, Inc., the advertising agency for APF. Although Parts V and VI of the Commission's Order in this proceeding imposed requirements on Clyne Maxon, Clyne Maxon has ceased doing business and has not petitioned for review. We will therefore consider the Order only insofar as it applies to AHP.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. 15 U.S.C. § 55(a) (1) reads in pertinent part: The term \"false advertisement\" means an advertisement, other than labeling, which is misleading in a material respect; and in determining whether any advertisement is misleading, there shall be taken into account (among other things) not only representations made or suggested by statement, word, design, device, sound, or any combination thereof, but also the extent to which the advertisement fails to reveal facts material in the light of such representations or material with respect to consequences which may result from the use of the commodity to which the advertisement relates under the conditions prescribed in said advertisement, or under such conditions as are customary or usual.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The Order is discussed at length infra ; only an overview is attempted at this point. The Appendix to the present opinion reproduces the relevant portions of the Order.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Part I(B) was the only provision that was not unanimous. See Commissioner Clanton's separate statement, App. 353-58.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Throughout the intricacies of this case, it is well to bear in mind what the Commission characterized as \"the heart of the case before us,\" App. 359: Aspirin: homey, familiar, time-tested aspirin has long been an honored staple in the American family's arsenal against common maladies. So homey is this ingredient that it evokes no aura of mystery or magic, though indeed its therapeutic properties are significant; so familiar that the firm that pioneered its development was stripped of its trademark in private litigation 60 years ago; n.1 so commonplace that a maker of one aspirin-based pain reliever seeking to differentiate its product from the rest faces a formidable marketing task. What better way to meet this challenge than to establish a new identity for the product, dissociated from ordinary aspirin, and then to represent it as special and more effective than its competitors? That effort may solve the marketer's marketing problem -- but if the representations of specialness and superiority are not adequately supported, they can be, simply put, deceptive. n.1 Bayer Co. v. United Drug Co., 272 F. 505 (S.D.N.Y. 1921).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Although Part I covers products other than Anacin and APF, AHP has not chosen to challenge the Order as overly broad in this respect. Accordingly, we assume that if Part I should be enforced as to Anacin and APF there is no occasion to consider limiting its scope.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Cf. Pitofsky, Beyond Nader: Consumer Protection and the Regulation of Advertising, 90 HARV. L. REV. 661, 677-79 (1977) (explaining the \"virtually unreviewable\" discretion of the Commission in interpreting advertisements by reference to \"the administrative inconvenience of alternative approaches,\" rather than by reference to the Commission's expertise.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The cases relied upon by AHP do not question the rule that our standard of review must be deferential. Cinderella Career and Finishing Schools, Inc. v. FTC, 138 U.S. App. D.C. 152, 425 F.2d 583, 585-88 (1970) concerned the power of the Commission, sitting as a reviewing body, to reverse factual findings of a hearing examiner without explaining the reasons for doing so. Cinderella Career has no bearing on a case such as the present one, in which the Commissioners not only endorse the findings of the ALJ challenged by the petitioner but thoroughly explain their view of the evidence. Two appellate decisions dealing with advertisements for hemorrhoid preparations disagreed with the Commission's determination that certain representations were misleading. American Home Products Corp. v. FTC, 402 F.2d 232 (6th Cir. 1968); Grove Laboratories v. FTC, 418 F.2d 489 (5th Cir. 1969). But neither court found that the Commission was mistaken in its interpretation of what the advertisements were representing and both courts ordered that most of the provisions of the orders under review be enforced. Significantly, both courts appear to have given the Commission's findings substantial weight. FTC v. Sterling Drug Inc., 317 F.2d 669 (2d Cir. 1963) and FTC v. Simeon Management Corp., 532 F.2d 708 (9th Cir. 1976), affirmed district court refusals to grant the Commission injuctive relief under 15 U.S.C. §§ 53(a). The Commission had sought such relief pending final resolution of the administrative proceedings. Far different considerations come into play when, as in the present case, a court of appeals is asked to review a final cease and desist order of the Commission after the full panoply of administrative proceedings have been conducted. See Sterling Drug, 317 F.2d at 678 (Marshall, J., concurring); Simeon Management, 532 F.2d at 717. See also Simeon Management Corp. v. FTC, 579 F.2d 1137 (9th Cir. 1978)(affirming, after final Commission determination, that advertisements at issue in the previous Simeon Management case were in violation of the statute.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. See National Commission on Egg Nutrition v. FTC, 570 F.2d 157, 161 n.4 (7th Cir. 1977), cert. denied, 439 U.S. 821, 58 L. Ed. 2d 113, 99 S. Ct. 86 (1978) (\"an otherwise false advertisement is not rendered acceptable merely because one possible interpretation of it is not untrue,\" quoting Commission); Resort Car Rental System, Inc. v. FTC, 518 F.2d 962, 964 (9th Cir. 1975) (\"Advertising capable of being interpreted in a misleading way should be construed against the advertiser\"); J.B. Williams Co. v. FTC, 381 F.2d 884, 890 (6th Cir. 1967) (commission \"not bound to the literal meaning of the words\"); Carter Products, Inc. v. FTC, 323 F.2d 523, 528 (5th Cir. 1963) (\"the Commission need not confine itself to the literal meaning of the words used but may look to the overall impact of the entire commercial\"); and Murray Space Shoe Corp. v. FTC, 304 F.2d 270, 272 (2d Cir. 1962) (\"In deciding whether petitioners' advertising was false and misleading we are not to look to technical interpretation of each phrase, but must look to the overall impression these circulars are likely to make on the buying public . . . And statements susceptible of both a misleading and a truthful interpretation will be construed against the advertisers,\" citations omitted). See also Donaldson v. Read Magazine, Inc., 333 U.S. 178, 188, 92 L. Ed. 628, 68 S. Ct. 591 (1948). Cf. C. Lasch, THE CULTURE OF NARCISSISM 140-41 (1979) (criticizing mass culture, and product advertising in particular, not for obvious untruths but for blurring of truth and falsehood).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Simeon Management Corp. v. FTC, supra, 579 F.2d at 1146 n.11, for example, states: Advertisements having the capacity to deceive are deceptive within the meaning of the FTCA; actual deception need not be shown. Goodman v. Federal Trade Commission, 244 F.2d 584, 602 (9th Cir. 1957). It is well settled that \"the Federal Trade Commission has the expertise to determine whether advertisements have the capacity to deceive or mislead the public. Consumer testimony, although sometimes helpful, is not essential.\" (quoting Resort Car Rental Systems, supra.) In Colgate-Palmolive, supra, 380 U.S. at 391-92, it was not considered \"necessary for the Commission to conduct a survey of the viewing public before it could determine that the commercials had a tendency to mislead. . . .\" According to Beneficial, supra, 542 F.2d at 617. the FTC has been sustained in finding that advertising is misleading even absent evidence of that actual effect on customers; the likelihood or propensity of deception is the criterion by which advertising is measured. Other cases authorizing the Commission to rely on its own interpretations, without resort to consumer testimony or surveys, include Carter Products, supra, 323 F.2d at 528; J.B. Williams, supra, 381 F.2d at 890; and E.F. Drew \u0026 Co. v. FTC, 235 F.2d 735, 741 (2d Cir. 1956), cert. denied, 352 U.S. 969, 77 S. Ct. 360, 1 L. Ed. 2d 323 (1957). AHP appears to hint that under In re R.M.J., 455 U.S. 191, 102 S. Ct. 929, 71 L. Ed. 2d 64, 50 U.S.L.W. 4185, 4189 (1982) there is a First Amendment violation when a finding that an advertisement is misleading and an order predicated on this finding is not based on empirical evidence that the public was in fact misled. See Petitioner's Br. 38 n.57. This would be a distortion of R.M.J. See e.g. Young v. American Mini Theatres Inc., 427 U.S. 50-68, 49 L. Ed. 2d 310, 96 S. Ct. 2440 (1976): \"Regulatory commissions may prohibit businessmen from making statements which though literally true, are potentially deceptive.\" (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. There is no contention in this case that even if the advertisements are misleading they are not \"misleading in a material respect\" under 15 U.S.C. § 55(a) (1). Once the Commission finds deception, it is normally allowed to infer materiality. See e.g., Colgate-Palmolive, supra, 380 U.S. at 391-92.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The Commission did not find that AHP had made any establishment claim for APF (App. 373 n. *) although, as discussed infra, it determined that APF advertisements misleadingly claimed that this product causes less gastric discomfort than do competing products. Although Part I(A) is directed in part to representations that the superior freedom from side effects of a product has been proven, and AHP was not found to have made such representations, AHP makes no challenge to Part I(A) on the grounds that by encompassing claims about side effects the provision is excessively broad.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. One way to phrase the controversy is that AHP would have the Commission perform a \"semantic\" analysis of the advertisements, whereas the Commission, consistently with settled law, is more interested in a \"pragmatic\" analysis. While semantics deals with meaning in the strict sense, the theory of pragmatics aims to explain \"how it is that speakers of any language can use the sentences of that language to convey messages which do not bear any necessary relation to the linguistic content of the sentence used.\" R. Kempson, SEMANTIC THEORY 68 (1977). See R. Stalnaker, Pragmatics, in SEMANTICS OF NATURAL LANGUAGE 380 (G. Harman and D. Davidson eds. 1972). Cf. H. P. Grice, Logic and Conversation, in THE LOGIC OF GRAMMER 64 (D. Davidson and G. Harman eds. 1975) (developing the distinction between what is \"said\" and what is \"implicated.\")\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. As discussed infra in connection with Part II of the order, AHP no longer disputes that claims in advertisements such as this one for Anacin's supposedly tension-relieving effect, and for its supposedly special combination of ingredients, are misleading. For reasons discussed infra, typescript slip op. at 33-4, consumers cannot, as this advertisement suggests, compare competing analgesics for themselves. Many other advertisements could be cited. The Commission summarized some of them in App. 373-76. For example, one advertisement announced: \"Medical research has definitely established that the most reliable medication in the treatment of arthritis . . . is the compound in today's Anacin tablets. . . .\" In various advertisements, it was claimed that a study or test \"proves,\" \"substantiates,\" \"shows\" or proves \"beyond doubt\" that Anacin is on a par with the leading prescription drug. Such claims were often coupled with descriptions of clinical procedures employed in the tests, and with misleading references to doctors' surveys. Imagery in the advertisements, including technical graphs, chemical formulas, and medical texts, reinforced the establishment claims.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The other empirical evidence included studies of consumer perceptions of non-prescription analgesics, \"image\" studies of how consumers regard Anacin and competing brands, and \"penetration\" studies of consumers' ability to recall Anacin's advertising themes. No empirical evidence on the meaning of APF's advertisements was offered. See App. 422 n. *.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. AHP appears to concede that certain of its claims were misleading, although it denies that such claims were establishment claims. See discussion of Part II(C) of the Order, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. There also appears to be no basis for AHP's contention that the Commission is imposing a higher standard for comparative effectiveness claims than the Food and Drug Administration (FDA) requires before considering a drug to be effective at all. The Commission took great care to make certain that its requirements were consistent with and similar in spirit to FDA regulations. App. 378-82. The Commission quoted the Supreme Court, Weinberger v. Hynson, Westcott \u0026 Dunning, Inc., 412 U.S. 609, 617-19, 37 L. Ed. 2d 207, 93 S. Ct. 2469 (1973), that the FDA's requirements -- which employ virtually the same criteria of proof as those which the Commission seeks to impose here -- express \"well-established principles of scientific investigation,\" App. 382 n. *.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. It should be noted that \"evaluation of conflicting reports as to the reputation of drugs among experts in the field is not a matter well left to a court without chemical or medical background,\" Weinberger v. Bentex Pharmaceuticals, Inc., 412 U.S. 645, 653, 37 L. Ed. 2d 235, 93 S. Ct. 2488 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The Commission also found wanting the evidence that Anacin is equally as effective as Darvon Compound 65 (the leading prescription analgesic), and the evidence that a regular dosage of aspirin is not as effective as the Darvon Compound. Thus, Anacin's superiority to regular aspirin was not established by the studies allegedly showing Anacin's equivalence to the Darvon product, and would not have been established even if Anacin had been proved to be Darvon Compound 65's equal. App. 386.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Other recent cases allowing the Commission to impose substantiation requirements on advertisers include: Sears, Roebuck and Co. v. FTC, 676 F.2d 385 (9th Cir. 1982); Litton Industries, Inc. v. FTC, 676 F.2d 364 (9th Cir. 1982); Jay Norris, Inc. v. FTC, 598 F.2d 1244 (2d Cir.), cert. denied, 444 U.S. 980, 62 L. Ed. 2d 406, 100 S. Ct. 481 (1979); Fedders Corp. v. FTC, 529 F.2d 1398 (2d Cir.), cert. denied, 429 U.S. 818, 50 L. Ed. 2d 79, 97 S. Ct. 63 (1976); National Dynamics Corp. v. FTC, 492 F.2d 1333 (2d Cir.), cert. denied, 419 U.S. 993, 42 L. Ed. 2d 265, 95 S. Ct. 303 (1974); and Firestone Tire \u0026 Rubber Co. v. Federal Trade Commission, 481 F.2d 246 (6th Cir.), cert. denied, 414 U.S. 1112, 38 L. Ed. 2d 739, 94 S. Ct. 841 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. AHP appears to base its contention on 5 U.S.C. § 554(b) (3), which entitles respondents in administrative proceedings to be \"timely informed of . . . the matters of fact and law asserted.\" See Rodale Press, Inc. v. FTC, 132 U.S. App. D.C. 317, 407 F.2d 1252, 1256 (1968) (\"[I]t is well settled that an agency may not change theories in midstream without giving respondents reasonable notice of the change.\") (citations omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The fact that the Commission characterized the \"substantial question\" test as a logical elaboration of the \"reasonable basis\" theory does not indicate that the Commission decided the case on the general \"reasonable basis\" theory, as AHP alleges. In fact, the only dissenter from Part I(B) of the Commission's order based his dissent on his disapproval of the Commission's application of the very rigid, as he perceived it, \"substantial question\" test. App. 357-58. But see text at 699-700 (rejecting Commissioner Clanton's characterization of the test as rigid). It is not alleged that the Commission abused its discretion by announcing the \"substantial question\" test in an adjudication rather than in a rulemaking proceeding. Compare Ford Motor Company v. FTC, 673 F.2d 1008 (9th Cir.), cert. denied, 459 U.S. 999, 103 S. Ct. 358, 74 L. Ed. 2d 394, 51 U.S.L.W. 3009 (1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Counsel for AHP at oral argument contended that AHP was prejudiced when the ALJ precluded AHP from introducing \"cost benefit evidence,\" such as evidence concerning \"the costs both in dollor terms and saftey terms in requiring or not requiring certain kinds of evidence\" to support advertising claims about these drug products. Transcript 15. See also Petitioner's Br. 8, 22-3. Clearly such evidence does not address whether AHP's product claims were open to \"substantial question.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. AHP may use the phrases \"open to substantial question\" or \"has not been proven.\" If it chooses, AHP may instead employ any other language, provided that it can show that the proper message is being effectively conveyed to the intended audience.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Moreover, as noted above, there is empirical evidence that consumers in fact have an image of Anacin's superiority. It is likely that this image derives from advertising, even if it cannot be determined from the record which specific advertisements gave rise to this consumer belief.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Although the advertisements proscribed by Part I (B) are not the ones that made explicit claims that superiority has been proven, many of the misleading advertisements that in the Commission's view justified Part I (B) did \"mention briefly that 'doctors recommend' or 'doctors specify ' Anacin's pain reliever.\" Such phrases \"can contribute somewhat to an aura of scientific authority.\" App. 387, n. **.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. As noted infra 702-703, the Commission can properly read a claim of superiority to the \"leading extra-strength\" tablet as a claimed superiority to all products in the field.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. We follow the parties in devoting most of our attention to Anacin rather than APF. The ALJ's review of the inconclusive evidence that APF causes less gastric upset than regular aspirin is in App. 190-94 and 290-92.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. It regards as sufficient \"substantiation considered acceptable by responsible medical experts.\" Petitioner's Br. 29. But this either supports the Commission's position or else is vacuous. The Commission found, on the basis of powerful evidence, that the medical community would not consider the substantiation for an unequivocal claim of superiority to be \"acceptable\" unless it included more than one clinical test of the type specified in Part I(B).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. As the philosopher Hilary Putnam implies, the division of labor in society (in the broadest sense) means that even when the truth of a claim is important to an individual he must often rely on the availability of experts who can verify the claim for him: Consider our community as a \"factory\": in this \"factory\" some people have the \"job\" of wearing gold wedding rings ; other people have the \"job\" of selling gold wedding rings; still other people have the job of telling whether or not something is really gold. It is not at all necessary or efficient that everyone who wears a gold ring (or a gold cufflink, etc.) or discusses the \"gold standard, \" etc., engage in buying and selling gold. Nor is it necessary or efficient that everyone who buys and sells gold be able to tell whether or not something is really gold in a society where this form of dishonesty is uncommon (selling fake gold) and in which one can easily consult an expert in case of doubt. And it is certainly not necessary or efficient that everyone who has occasion to buy or wear gold be able to tell with any reliability whether or not something is really gold. H. Putnam, Meaning and Reference, in NAMING, NECESSITY, AND NATURAL KINDS 125 (S. Schwartz ed. 1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. The gastrointestinal side effects are especially worrisome. The ALJ found it \"evident from the record that aspirin poses a serious public health problem, in terms of gastrointestinal effects, to certain groups of individuals in the population,\" App. 199. Although aspirin enjoys a favorable \"benefit-to-risk ratio,\" and massive gastrointestinal bleeding is relatively rare, \"the mortality rate associated with this condition is 4 to 10%, including those persons whose bleeding was induced by aspirin . . .\" App. 198-99. A \"conservative estimate\" is that \"aspirin ingestion results in 10 out of every 100,000 users developing a gastric ulcer, requiring hospitalization,\" App. 296. One study \"estimated that one-eighth of all gastric ulcers were aspirin-related,\" App. 296. There is even a specific kind of ulcer not seen in the absence of aspirin. App. 199, 296. AHP's brief insists that the Commission conceded aspirin's safety. But while the Commission acknowledges that aspirin is \"generally safe\" (e.g., App. 303), at all steps of these proceedings attention has been called to the serious aspirin-related health risks that exist for a \"significant\" number of individuals (e.g., App. 368). The advertisements for APF would appear to raise special problems since they unequivocally represent that APF is \"gentle\" to the stomach -- indeed, \"so gentle you can take it on an empty stomach\" (e.g., App. 611) -- and so may persuade even individuals who know they should avoid aspirin, and realize that APF contains aspirin, to use this product.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Similar disclosure requirements for other types of products were upheld in Feil v. FTC, 285 F.2d 879 (9th Cir. 1960) and J. B. Williams Co. v. FTC, 381 F.2d 884 (6th Cir. 1967). Alberty v. FTC, 86 U.S. App. D.C. 238, 182 F.2d 36 (1950), cert. denied, 340 U.S. 818, 95 L. Ed. 601, 71 S. Ct. 49 (1950), refused to sustain a similar order, but the D.C. Circuit has radically limited, if it has not overruled, Alberty. See Warner-Lambert, 562 F.2d at 759 n. 52.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Simeon Management Corp., supra, is another recent appellate court refusal to set aside a Commission finding that, in the absence of certain disclosures, advertisements were in violation of the Federal Trade Commission Act. The advertisements at issue stressed the safety and effectiveness of the advertisers weight loss program. Although the advertisements made no additional claim that any government agency had approved the safety or effectiveness of the program, and despite the lack of any evidence that consumers were actually deceived about this, the \"Commission found that the advertisements could reasonably lead consumers to believe that the claim [sic] of safety and effectiveness are based on a determination by the appropriate administrative agency,\" 597 F.2d at 1146 (footnote omitted). The Court in affirming argued that \"in view of the currently pervasive level of governmental regulation, particularly in the medical field, we cannot say that this determination is unreasonable, arbitrary, capricious or an abuse of discretion,\" id. at 1146. See also the \"substantiation\" cases noted supra typescript at 22, especially Porter \u0026 Dietsch and Firestone Tire. Part I(B) is both a \"substantiation\" provision and a \"disclosure\" provision in that it requires AHP to substantiate its claims, to disclose the lack of substantiation, or else to cease making the claims. Porter \u0026 Dietsch, 605 F.2d at 306-7, in addition to affirming a substantiation requirement, sustained in modified form a warning that the Commission required the company to include in all advertisements for certain products. In contradistinction to this the Commission here has not required any warning at all, and has required affirmative disclosures only to the extent certain claims are made. In Firestone Tire, 481 F.2d at 251, the Sixth Circuit upheld a finding that an advertising claim that tires \"stop 25% quicker\" was misleading \"without substantial scientific test data to support it,\" regardless of the absence in the advertisements of any allusion to scientific or other proof of the claim. The order there upheld is thus quite similar to Part I(B) here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Counsel for the Commission made it clear at oral argument that this Court is not being asked to decide upon the validity of a rigid rule. Counsel suggested that, while Part I(B) is reasonable, other alternatives are also reasonable, and the Commission might reach a different result in the companion cases involving AHP's competitors. If inconsistent results are reached, AHP can request conformed treatment. See 709; and Respondent's Br. 27 n. 18.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Many other advertisements in a similar vein could be cited. See App. 124-26 and 138-39.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. The Commission, in discussing the materiality of the deception, stressed the special dangers that can arise when consumers who should avoid aspirin are misled as to the nature of Anacin and APF. See supra typescript slip op. at 34-5.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. The misrepresentations as to tests and surveys formed part of the Commission's case in support of Part I(A) of the order. These misrepresentations were discussed above, in connection with Part I(A). Since AHP does not appeal Part II(C) as applied to Anacin and APF but does appeal Part I(A), its position would seem to be that the test and survey claims were properly found to be deceptive, although not deceptive by reason of making any claim that Anacin's or APF's superiority had been established.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Although AHP has not requested that Part IV of the Order (which specifically forbids tension relief claims for Anacin) be vacated, it mentions that \"because the challenged tension relief claims ceased in 1973 . . . it is questionable whether any order is necessary at this time.\" Petitioner Br. 49 n. 77. But the claims ceased only after proceedings had been brought against AHP, so the discontinuance cannot be considered voluntary. See Oregon-Washington Plywood Co. v. FTC, 194 F.2d 48, 51 (9th Cir. 1952). Even if the advertisements had been voluntarily withdrawn, the Commission would not necessarily lack the authority to issue an order. See Fedders Corp., supra, 529 F.2d at 1403.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Parts I and II both embody multi-product fencing in, although AHP has not chosen to challenge Part I as overly broad. Part III, although narrowly restricted as to products covered, is based both on the need to \"fence in\" AHP so that it does not devise new deceptions, and on the need to overcome consumer misimpressions created by past deceptive advertisements. Part II(D) fences AHP in both as to products and as to types of deceptions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. Many decisions have upheld multi-product -- in some cases all-product -- orders that were issued on the basis of findings that an advertiser had violated the statute with respect to a handful of products. For example, Porter \u0026 Dietsch, supra, 605 F.2d at 305, footnote omitted, upheld an order covering any food, drug, cosmetic, or device, although only one product was misrepresented: The record shows that Porter \u0026 Dietsch is continuously testing and marketing new products and, as a wholesale operation not faced with the expense of modifying manufacturing facilities to add new products to its line, it can do so comparatively cheaply. Fraser and wholly-owned subsidiaries of Porter \u0026 Dietsch have violated the Federal Trade Commission Act in the past. These facts and the evidence of petitioners' readiness, in carrying out the advertising campaign for X-11, to go at least to the very limits of what the law might be argued, with some modicum of plausibility, to allow, justified the breadth of the order against the principal offenders. In ITT Continental Baking Co. v. FTC, 532 F.2d 207, 222-23 (2d Cir. 1976), the Court refused to modify an order directed to any food product, although an advertising violation had been found with respect to only one. Another decision upholding a multi-product order is Jay Norris, supra, 598 F.2d at 1250-51. There have also been a few appellate court decisions narrowing multi-product orders, e.g., Standard Oil, supra. The possible relevance of these decisions will be more apparent after the precise basis of Parts II(A)-(C) of the order has been explained.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Sears, Roebuck also explained that the \"prevention of 'transfers' of unfair trade practices is a fundamental goal of the Commission's remedial work.\" Id. at 394. If the Commission's authority to prevent \"transfers\" is denied, unscrupulous merchandisers (and we do not imply that Sears falls in that category) might be encouraged to transfer unlawful but successful advertising techniques from product to product, leaving the Commission the job of instituting separate proceedings to secure new orders for each unlawfully advertised product. Because so drastic a limitation on the Commission's enforcement procedure would conflict with . . . [Congressional intent] . . . would consume enormous resources, and would afford no particular protection to lawful advertisements and little protection to consumers, the Commission need not wait until a \"transfer\" occurs before issuing multi-product orders in cases like the one before us. It may issue and enforce such orders to avert an \"apprehended effect.\" Id. at 395, footnote omitted. The same considerations apply when, as in our case, the Commission chooses a \"deception\" rationale instead of basing its decision on \"unfairness.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. There have also been two court decisions, involving advertising claims other than the ones involved in the case at bar, finding that AHP had made false and misleading representations: American Home Products Corp. v. Johnson \u0026 Johnson, 577 F.2d 160 (2d Cir. 1978) (upholding district court injunction against certain false claims of Anacin's superiority over Tylenol); and McNeilab, Inc. v. American Home Products Corp., 501 F. Supp. 517 (S.D.N.Y. 1980) (finding false the representations that Maximum Strength Anacin is stronger than Extra Strength Tylenol and has the maximum strength allowed without a prescription.) These two cases did not involve the Federal Trade Commission Act, however.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. \"The advertising challenged in this proceeding was widely disseminated, in print and broadcast media, over a period of many years and at a cost of millions of dollars annually.\" App. 406. AHP \"spent approximately $210 million between 1960 and 1970, advertising Anacin to consumers as a product superior to aspirin in relieving pain and as a tension reliever,\" App. 245. See also App. 100.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. In Grove Laboratories v. FTC, 418 F.2d 489, 497 (5th Cir. 1969), the Court eliminated a multi-product provision like the one struck down by Preparation H, on the grounds that Grove Laboratories and Preparation H were \"companion cases involving substantially the same facts and involving two competing companies who produce and sell almost identical products that are designed and used for the same purpose . . .\" AHP has not contended that Grove Laboratories supports its position on Part II of the order. Nor does it attempt to rely on National Dairy Products Corp. v. FTC, 412 F.2d 605, 624 (7th Cir. 1969), which restricted a Commission multi-product order where, unless restricted, the order (in the words of ITT Continental Baking, supra, 532 F.2d at 223 n. 24) \"could reach conduct which had been specifically exonerated in the same FTC proceeding.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. Sears, Roebuck did not, as AHP alleges, hold \"that the scope of a remedial order should be narrowest in a case . . . where the claims at issue are comparative and implied, rather than absolute and express,\" Petitioner Reply Br. 14, citing 676 F.2d at 393. What the Sears, Roebuck court said was that the implicit relative performance claims involved in Fedders Corp., supra, were less serious than the offenses involved in the matter before them. AHP's violations, which had the potential for severely injuring the health of consumers, were surely at least as serious as Sears, Roebuck's false statements about the ability of its dishwashing machine to clean dishes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. The Commission's brief in this Court seems to assume, however, that Part II(D) is predicated only on the nervous tension claim. Respondent's Br. 42-3. This was the ALJ's position. App. 317.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. It is at least arguable that the decision to excise Part II(D) is inconsistent with Porter \u0026 Dietsch, supra, 605 F.2d at 305-6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. As remarked supra, there is evidence that many consumers are unaware that Anacin contains aspirin. Even one of AHP's expert witnesses \"admitted that his own study of aspirin idiosyncracy revealed that patients took OTC analgesic drugs, such as Anacin, without knowing that the products contained aspirin . . .\" App. 205. There is no reason to assume that warnings from physicians to their patients eliminate all the dangers of deceptively representing that an over the counter product does not contain aspirin.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. Indeed, AHP's position comes close to the proposition, directly contradicted by the statute and the cases, that only an affirmative misrepresentation, not a failure to disclose a material fact, can constitutionally be barred as deceptive.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. Bates v. State Bar of Arizona, 433 U.S. 350, 53 L. Ed. 2d 810, 97 S. Ct. 2691 (1977), which extended First Amendment protection to lawyer advertising, adopted a similar approach and, in the words of In re R.M.J., 455 U.S. 191, 102 S. Ct. 929, 71 L. Ed. 2d 64, 50 U.S.L.W. 4185, 4189 (1982), \"suggested that the remedy [for potentially misleading advertising] in the first instance is not necessarily a prohibition but preferably a requirement of disclaimers or explanation.\" Virginia State Board of Pharmacy v. Virginia Citizens Consumer Council, 425 U.S. 748, 772 n. 24, 48 L. Ed. 2d 346, 96 S. Ct. 1817 (1976), notes that the special attributes of commercial speech may \"make it appropriate to require that a commercial message appear in such a form, or include such additional information, warnings, and disclaimers, as are necessary to prevent its being deceptive.\" Cf. National Society of Professional Engineers v. United States, 435 U.S. 679, 697, 55 L. Ed. 2d 637, 98 S. Ct. 1355 (1978) (upholding a district court order, far more burdensome on speech than the Order in the present case, which was designed \"to avoid a recurrence of the violation and to eliminate its consequences.\"); United States v. Reader's Digest Association, 662 F.2d 955, 965 (3d Cir. 1981) cert. denied, 455 U.S. 908, 102 S. Ct. 1253, 71 L. Ed. 2d 446, 50 U.S.L.W. 3570 (1982). (\"Any remedy formulated by the FTC that is reasonably necessary to the prevention of future violations does not impinge upon constitutionally protected commercial speech.\"); and National Commission on Egg Nutrition, supra, 570 F.2d at 164, in which the court held that, consistently with the First Amendment, the Commission could require an advertiser to reveal the existence of a controversy among the experts, but, in the absence of a long history of deception, could not require that advertisements present the other side of the controversy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. See e.g., Porter \u0026 Dietsch, supra, 605 F.2d at 307 (\"The fact that other firms in the market are not similarly burdened does not affect the validity of this order.\"). Cf. Developments in the Law-Deceptive Advertising, 80 HARV. L. REV. 1005, 1083 (1967) (Commission occasionally \"stay[s] a proceeding or suspend[s] the effect of an order pending investigation and action against competitors.\") We do not suggest that the Commission should ignore the interests of scrupulous competitors who forego misleading claims. See FTC v. R. F. Keppel \u0026 Bro., 291 U.S. 304, 78 L. Ed. 814, 54 S. Ct. 423 (1934).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e* Caffeine, like aspirin, is a common substance available in many products (F. 387; Ans of AHP, para. 23). Thus, if caffeine is commonly used in products intended for the same purpose as the advertised product (as aspirin is used in many products intended for pain relief other than Anacin), the advertisement may not state or imply that it is an unusual or special ingredient. The fact that the ALJ found that caffeine has not been shown to pose a serious public health problem is irrelevant, since the basis for this disclosure requirement is the need to prevent misleading representations about the ingredient.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e** Because the advertising agency does not bring to this litigation the same history of advertising violations as AHP, we believe that an order covering only OTC internal analgesics will suffice as to Clyne. Nor does the order require Clyne to make affirmative ingredient disclosure.\u003c/span\u003e\n\n",
    "body_length": 146503,
    "citedas": [
      "695 F.2d 681"
    ],
    "attorneys": "Samuel W. Murphy, Jr. (Argued), David S. Versfelt, Donovan Leisure Newton \u0026 Irvine, New York, New York, John J. McGrath, Jr., John P. Dean, Donovan Leisure Newton \u0026 Irvine, Washington, District of Columbia, Of Counsel: Charles F. Hagan, American Home Products Corporation, New York, New York, for Petitioner. John H. Carley, General Counsel, Howard E. Shapiro, Deputy General Counsel, Ernest J. Isenstadt (Argued), Acting Assistant General Counsel, for Respondent.",
    "category": [
      "243",
      "75"
    ],
    "judges": "Adams, Hunter, and Becker, Circuit Judges.",
    "citation_count": 34
  }
}
