{
  "id": "GrhwTmYBTlTomsSBIL1j",
  "document": {
    "title": "State v. Bey",
    "full_title": "STATE OF NEW JERSEY v. MARKO BEY .",
    "jurisdiction": "Supreme Court of New Jersey",
    "date": "1994-06-30T00:00:00.000Z",
    "docket": "A-1 September Term 1993",
    "body": "The opinion of the court was delivered by\n\nPOLLOCK, J.\n\nIn unrelated incidents, defendant, Marko Bey, sexually assaulted and murdered two women. Separate juries sentenced defendant to death for each of the murders. Initially we vacated both death sentences. In State v. Bey, 112 N.J. 45 (1988) (Bey I), which involved the murder of Cheryl Alston, we reversed the murder conviction and held that defendant was not death eligible because he was under the age of eighteen at the time of the murder. On remand, a jury found defendant guilty of purposeful murder and aggravated sexual assault. The trial court sentenced him to an aggregate sentence of life imprisonment plus twenty years, with no parole eligibility for forty years. In State v. Bey, 112 N.J. 123 (1988) (Bey II), decided the same day as Bey I, we affirmed defendant's conviction for the murder of Carol Peniston. Because of an incorrect jury charge, however, we reversed the death sentence and remanded the matter for re-sentencing. Once again, the jury returned a death sentence for the Peniston murder, which we affirmed in State v. Bey, 129 N.J. 557 (1992) (Bey III). In Bey III, we deferred proportionality review of that sentence pending receipt of a more complete record. We now find no disproportionality in the imposition of the death sentence for defendant's second murder.\n\nTABLE OF CONTENTS\n\nI. Facts\n\nII. Proportionality Review\n\nA. The Universe of Cases\n\nB. Method of Classifying Cases\n\nIII. Comparison of Cases\n\nA. The Frequency Approach\n\n1. The Salient-Factors Test\n\n2. The Numerical-Preponderance-of-Aggravating-and-Mitigating-Factors Test\n\n3. The Index-of-Outcomes Test\n\nB. The Precedent-Seeking Approach\n\n1. Relevant Factors\n\n2. Comparison of Marko Bey's Case to Similar Cases\n\na. The Cases\n\nb. The Comparison\n\n3. Other Cases\n\nIV. Race as an Impermissible Factor\n\nV. Conclusion\n\n-I-\n\nFACTS\n\nThe facts surrounding the murder of Carol Peniston are set forth in Bey II, supra, 112 N.J. at 131-33, and Bey III, supra, 129 N.J. at 568-69. We therefore include only a brief summary.\n\nOn April 26, 1983, around 9:20 p.m., Carol Peniston left Neptune High School, where she had attended a computer course, and had driven away in her car. Approximately four hours later, the car was involved in a one-car accident in Newark. Defendant's fingerprints were on the rearview mirror. Ms. Peniston, who had been divorced and lived alone, neither returned to her apartment nor reported to work the next day.\n\nOn May 3, Asbury Park police discovered Ms. Peniston's body in a shed near an industrial building. An autopsy performed on May 4 disclosed that she had been dead for several days. The autopsy further disclosed that she had been beaten, sexually assaulted, and strangled. From a sneaker imprint on her chest and from evidence of fractured ribs and hemorrhaging of the right lung, vertebral column, and right atrium of the heart, the Monmouth County medical examiner concluded that Ms. Peniston's assailant had stomped on her chest. The ultimate cause of her death, however, was ligature strangulation. Subsequent police investigation revealed that the characteristics of spermatozoa found on the victim's coat were consistent with those of defendant's saliva, and that defendant's sneakers bore an imprint that was similar to the impression on the victim's chest.\n\nOn May 6, defendant, who had turned eighteen only three weeks earlier, was arrested for receiving stolen property, Ms. Peniston's car. After five hours in police custody, defendant confessed to the murder.\n\nDefendant then gave a written statement, in which he admitted that he had accosted Ms. Peniston in front of her apartment building and demanded money from her. The statement continued that when defendant heard someone coming, he grabbed her and led her to the shed. In the ensuing events, he repeatedly struck Ms. Peniston, sexually assaulted her, and took eight dollars, as well as the car keys, from her pocketbook. While on his way to Newark in her car, he had an accident and abandoned the car.\n\nA jury convicted defendant of capital murder and sentenced him to death. The sentence followed from the jury's finding of two aggravating factors: the murder had \"involved torture, depravity of mind, or an aggravated assault to the victim,\" N.J.S.A. 2C:11-3c(4)(c) (the c(4)(c) factor), and it had been committed in the course of a felony, N.J.S.A. 2C:11-3c(4)(g) (the c(4)(g) factor). The jury found no mitigating factors. We affirmed the conviction, but reversed the death sentence, primarily because the court had incorrectly charged the jury on the mitigating factors. Bey II, supra, 112 N.J. at 156-64, 166-71.\n\nOn the same day that we reversed and remanded Bey's death sentence for the murder of Carol Peniston, we also vacated his conviction and death sentence for the prior murder and sexual assault of Cheryl Alston. Bey I, supra, 112 N.J. at 51. In that decision, we held that defendant was not death eligible because he had committed the Alston murder before reaching the age of eighteen. Ibid. On re-trial for the Alston murder, the jury found defendant guilty of purposeful murder and aggravated sexual assault. He received an aggregate sentence of life imprisonment plus twenty years, with forty years of parole ineligibility. The Appellate Division affirmed the conviction, 258 N.J. Super. 451, and we denied certification, 130 N.J. 19 (1992).\n\nAt the re-sentencing trial for the Peniston murder, the State proffered two aggravating factors: defendant previously had been convicted of a murder, that of Cheryl Alston, N.J.S.A. 2C:11-3c(4)(a) (the c(4)(a) factor), and the Peniston murder had occurred during a sexual assault and robbery, the c(4)(g) factor. Defendant did not contest these aggravating factors, but argued that four mitigating factors outweighed them: \"defendant was under the influence of extreme mental or emotional disturbance,\" N.J.S.A. 2C:11-3c(5)(a) (the c(5)(a) factor); defendant's age at the time of the murder, N.J.S.A. 2C:22-3c(5)(c) (the c(5)(c) factor); \"defendant's capacity to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of the law was significantly impaired as the result of mental disease or defect or intoxication,\" N.J.S.A. 2C:11-3c(5)(d) (the c(5)(d) factor); and the catch-all factor -- \"any other factor which is relevant to the defendant's character or record or the circumstances of the offense,\" N.J.S.A. 2C:11-3c(5)(h) (the c(5)(h) factor).\n\nThe jury unanimously found both aggravating factors. Two jurors found extreme mental or emotional disturbance, c(5)(a), and six jurors found the catch-all factor, c(5)(h). None of the jurors found that either defendant's age, c(5)(c), or the significant impairment of his moral faculties, c(5)(d), was a mitigating factor. Furthermore, the jury found beyond a reasonable doubt that the two aggravating factors outweighed the two mitigating factors. Consequently, the court sentenced defendant to death. Bey III, supra, 129 N.J. at 576.\n\n-II-\n\nPROPORTIONALITY REVIEW\n\nN.J.S.A. 2C:11-3e, a section of the Capital Punishment Act (the Act), requires a proportionality review on a defendant's request to determine whether the death sentence, considering both the crime and the defendant, is disproportionate to the penalty imposed in similar cases. L. 1985, c. 478. In general, the death penalty must be imposed fairly and with reasonable consistency. The test of disproportionality is that \"'[A] death sentence is comparatively excessive if other defendants with similar characteristics generally receive sentences other than death for committing factually similar offenses in the same jurisdiction.'\" State v. Marshall, 130 N.J. 109, 131 (1992) (citing Tichnell v. State, 468 A.2d 1, 17 n.18 (Md. 1983)). Thus, a death sentence is valid unless the defendant establishes that similar defendants who commit factually-similar offenses generally receive sentences other than death.\n\nBefore reviewing the proportionality of defendant's sentence, we first must answer preliminary questions regarding the universe of cases and the method of classifying those cases.\n\n-A-\n\nTHE UNIVERSE OF CASES\n\nIn Marshall, we defined the relevant universe of cases. 130 N.J. at 137. Preliminarily, we must decide whether to follow the May 12, 1992, amendment to the Act, which limits proportionality review to a comparison of similar cases in which the sentence of death actually has been imposed, L. 1992, c. 5, or whether we should continue to consider all cases that are death eligible, including those cases in which the State did not seek the death penalty.\n\nAlthough the amendment was designed to take effect immediately, the Legislature did not indicate whether it should apply to pending appeals. If we were to apply the amendment to pending appeals, we would be obligated to consider whether it is unconstitutional as an ex post facto law. We decided in Marshall that because of the long pendency of that appeal, we would review the sentence under the prior law. 130 N.J. at 119. Because we rejected Marshall's proportionality challenge under the prior law, the amendment would not have affected the outcome in that case. Ibid. We come to the same Conclusions here.\n\nDefendant murdered Ms. Peniston on April 26, 1983, sixteen months before the murder of Robert Marshall's wife. Defendant's appeal has been pending since his initial death sentence on September 28, 1984, more than eight years before the effective date of the amendment. As in Marshall, we reject defendant's proportionality challenge under the old law. For these reasons, we decline to address the constitutionality of the amendment. We shall apply the statute in its pre-amendment form. Thus, as in Marshall, the relevant universe of cases consists of those that are death eligible, even if they were not prosecuted as capital cases.\n\nMarshall summarizes the procedure for identifying the universe of cases. Id. at 137-41. Since the Marshall decision, the Administrative Office of the Courts (AOC) has assumed the responsibility from Special Master David C. Baldus for maintaining the data base of cases. In compiling the statistics, the AOC has followed the Special Master's procedure, as modified by our opinion in Marshall. The universe of cases for Bey consists of 266 death-eligible homicides committed from 1983 to 1992, 117 of which proceeded to the penalty phase. After oral argument, we granted defendant's motion to supplement the record with data that had been compiled since March 25, 1993, the date of the last revision of the appendices and tables for Bey's proportionality review (the Bey Report). This information, which constitutes the universe of cases compiled through June 25, 1993, for the pending proportionality review of John Martini (the Martini Report), increases the relevant universe of cases to 298 death-eligible offenses, 125 of which proceeded to the penalty-trial phase. Our consideration of these data in this case will not affect any argument proffered by Martini in his proportionality review.\n\n-B-\n\nMETHOD OF CLASSIFYING CASES\n\nHaving determined the universe of cases, we next convert that universe into the data base for comparison purposes. In Marshall, we analyzed the cases in two ways. The first method followed an a priori, or clinical, approach, in which we analyzed the cases according to features that experience has shown probably influenced the life/death decision. Id. at 141-42, 144. The second approach was an empirical one: we analyzed the cases according to characteristics that best explained the sentence actually imposed. Id. at 142-43, 144. Following the Special Master's methods, we \"[took] advantage of the available data to sort out the cases on the basis of the characteristics that both prosecutors in the charging process and juries in the deliberative process deem most relevant.\" Id. at 143.\n\nThe coding of variables in the companion cases continues to be a source of contention between the Public Defender and the Attorney General. In Marshall, we recognized their differences and urged them to cooperate in developing a data base. Id. at 216-18. Since then, the AOC has conducted meetings to resolve issues concerning the standards for each coded characteristic. Many issues have been resolved, and the characteristics have been reduced to statistical codes. We recognize, however, that the codes inevitably incorporate subjective determinations. Implicit in the seemingly-objective review of statistics lies an unavoidably-subjective view of deathworthiness.\n\nRemaining are some issues first raised in Marshall and raised again here. One issue questions the reliability of the coding of the thirty-four cases that remain coded as death-sentenced although reversed for various errors, such as improper jury instructions. Specifically, defendant identifies errors in all seven of the cases involving prior murder convictions (State v. Biegenwald, 106 N.J. 13, 53 (1987) (Biegenwald IA); State v. Biegenwald, 126 N.J. 1, 8 (1991) (Biegenwald IB); State v. Coyle, 119 N.J. 194, 218-20, 220-21, 229-32 (1990); State v. Erazo, 126 N.J. 112, 128 (1991); State v. Pennington, 119 N.J. 547, 565 (1990); State v. Purnell, 126 N.J. 518, 523 (1991); and State v. Ramseur, 106 N.J. 123, 312-13 (1987)). On remand, these cases either were not pursued to the penalty-trial phase or resulted in life sentences. Defendant argues that the initial death sentences in these cases, therefore, are not proper indicators of deathworthiness.\n\nIf we exclude these seven prior-murder-conviction cases from the pool of death-sentenced cases, Bey would remain as the only prior murderer whose death sentence we affirmed. That fact alone would not compel a finding that Bey's death sentence is disproportionate. In Marshall, we faced a similar situation. We stated that \"simply because Marshall may be the first [contract-killer to receive an affirmed death sentence] does not mean that his death will be disproportionate under our statute.\" 130 N.J. at 166. After reviewing the frequency data in Marshall, we concluded that \"'although lesser sentences than death are frequently imposed in domestic murder cases, it does not follow that the death penalty would not be authorized for the murder of one spouse by another under any circumstances.'\" Id. at 174 (quoting Tyler v. State, 274 S.E.2d 549, 555 (Ga. 1981)). The circumstances in Marshall were that the defendant hired another to kill his wife so that he could collect life-insurance benefits on her life. \"The data showed that among those for whom death is a fitting punishment, contract killers, whether principal or agent, are among the more frequent recipients of the death sentence.\" Id. at 166-67. Similarly, if Bey were to remain as the only defendant who had been previously convicted of murder and whose death sentence was affirmed, that sentence need not be disproportionate.\n\nFurthermore, we decline to follow defendant's suggestion to re-code as life-sentenced cases those death-sentenced cases in which the sentence was reversed. The AOC continues to code these cases as death-sentenced cases. In Marshall, we stated that \"we believe, . . . as does the [Special] Master, that the original penalty trials, although reversed for various reasons, most often for the burden-of-proof and Gerald issues, have reflected juror values of deathworthiness in terms of deterrent effect.\" Id. at 194 n.10. The phrase \"Gerald issues\" derives from our holding in State v. Gerald \"that a defendant who is convicted of purposely or knowingly causing 'serious bodily injury resulting in death' . . . as opposed to one who is convicted of purposely or knowingly causing death . . . may not be subjected to the death penalty.\" 113 N.J. 40, 69 (1988). Marshall recognized that such issues pertaining to procedural fairness, as distinguished from those that affect the substance of the crime, do not necessarily bear on the jury's determination of deathworthiness. 130 N.J. at 169 n.5, 194 n.10.\n\nFor example, in defendant's first trial for the sexual assault and murder of Cheryl Alston, the jury returned a sentence of death. We reversed because of a statutory mandate, L. 1985, c. 478 (codified at N.J.S.A. 2C:11-3g), that a defendant younger than eighteen-years old could not receive a capital sentence. Bey I, supra, 112 N.J. at 95-105, Consequently, Bey, who was only ten days short of his eighteenth birthday when he sexually assaulted and murdered Cheryl Alston, received a life sentence. Our reversal, however, does not detract from the initial jury's view that defendant deserved the death penalty for the Alston murder. Defendant does not explain why some errors that have caused us to reverse a death sentence necessarily reflect on the jury's ability to assess a defendant's deathworthiness. In the absence of an acceptable explanation, we continue to believe that a death sentence, even when reversed, represents a societal consensus concerning the deathworthiness of a defendant.\n\nMoreover, the reasons for the State's failure to pursue capital sentencing a second time or for the imposition of a life sentence at a second penalty-phase trial are varied and indeterminable. We cannot conclude that in any given case a life sentence resulted from the view that the defendant was not initially deathworthy, rather than, for example, from the strength of the prosecutor's case, including the availability of witnesses, or the adequacy of the State's resources.\n\nWe therefore treat as death-sentenced a case that initially resulted in a death sentence but that was reversed. As we stated in Marshall, \"we have been candid to acknowledge that there is no scientific infallibility in the frequency data that we cite.\" 130 N.J. at 169 n.5. Indeed, as stated above, all coding decisions necessarily rely on subjective determinations of deathworthiness that may not be completely accurate representations of death-sentencing decisions of jurors or prosecutors. Supra at (slip op. at 11). We rely, as we did in Marshall, on \"what we know,\" 30 N.J. at 169 n.5; of the 117 death-eligible cases proceeding to the penalty phase, thirty-four cases received the death penalty.\n\nOur Dissenting colleague urges, post at (slip op. at 10), as he did in Marshall, 130 N.J. at 249, 253-57 (Handler, J., Dissenting), that reversed cases are not valid indicators of deathworthiness. We continue to believe, however, as we did in Marshall, that cases in which prosecutors seek and juries impose the death penalty reflect the conscience of the community on the propriety of the imposition of that penalty. A reversal does not necessarily erase \"the complex nature of the jury's deliberation in the penalty-phase.\" Post at (slip op. at 27). We acknowledge that a reversed death penalty is a less persuasive indicator of deathworthiness than one that is affirmed, but we continue to believe that even reversed death sentences are sufficiently valid indicators to remain for statistical purposes in the pool of death-sentenced cases.\n\nWe disagree also with our colleague's suggestion, based on a recommendation of the Special Master, that we should adopt \"a rebuttable presumption that reversed death sentences are invalid determinations of deathworthiness.\" Post at (slip op. at 13). The suggestion is reminiscent of his statement in his Marshall Dissent, \"I believe that a death sentence is disproportionate unless defendants with similar characteristics generally receive death sentences for committing factually similar offenses.\" 130 N.J. at 248. Implicit in both statements is the proposition that the State bears the burden of establishing the proportionality of a death sentence. We believe, however, that once this Court has sustained a death sentence on direct appeal, the defendant should bear the burden of proving disproportionality. Indeed, the language of the Act indicates that the Legislature intended that the defendant should bear that burden. N.J.S.A. 2C:11-3e provides that \"the Supreme Court shall determine whether the sentence is disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant.\" The use of the word \"disproportionate,\" rather than \"proportionate,\" signifies the legislative intention that we should search not for proof that a defendant's death sentence is perfectly symmetrical with other death sentences, but for proof that the sentence is an outlier.\n\nConsistent with the Dissent's underlying premise that no defendant should ever receive the death penalty, the Dissent argues that no defendant should be the first to die. Hence, the Dissent attacks as \"hypothetical\" our Conclusion that even if we were to exclude reversed death-sentenced cases, leaving Bey as \"the only prior murderer finally sentenced to death,\" his death sentence would not be disproportionate. Post at (slip op. at 14). As we said in Marshall, in which our Dissenting colleague raised the same argument, 130 N.J. at 267-68, simply because a defendant \"may be the first does not mean that his death will be disproportionate under our statute,\" id. at 166. The grim fact is that some defendant must be the first to receive the death penalty.\n\n-III-\n\nCOMPARISON OF CASES\n\nAfter the Court has determined the universe of cases and the criteria for coding those cases, the third step of proportionality review is to group cases according to similarities relevant to the determination of deathworthiness. In Marshall, we selected measures of blameworthiness, or culpability, based on our consideration of both statutory aggravating and mitigating factors and nonstatutory factors based on \"objectively-verified measures of blameworthiness.\" Id. at 145.\n\nWe then evaluated these factors in two ways: the frequency analysis and the precedent-seeking analysis. The frequency analysis computes the frequency of death sentences within a pool of similar cases. It depends on a statistical analysis that measures the societal consensus that death is the appropriate penalty in the measured cases. See David C. Baldus, Death Penalty Proportionality Review Project, Final Report to the New Jersey Supreme Court 27 (Sept. 24, 1991) (Final Report). The precedent-seeking analysis is more intuitive, comparing a defendant's deathworthiness with that of defendants in factually-similar cases. Id. at 30-31. Combining these two analyses helps to ensure the reliability of our evaluation of the proportionality of a defendant's death sentence. The pool of cases remains small. As that pool expands, we can rely more heavily on the frequency analysis. For the time being, we are forced to rely more heavily on the precedent-seeking analysis.\n\n-A-\n\nTHE FREQUENCY APPROACH\n\nThe frequency analysis consists of three different methods of assessing criminal culpability: the salient-factors test, the numerical-preponderance-of-aggravating-and-mitigating-factors test, and the index-of-outcomes test. Marshall, supra, 130 N.J. at 154. These tests are statistical analyses that assess the criminal culpability of a defendant when compared to other defendants. Because the frequency approach is a form of statistical analysis, our Discussion is necessarily steeped in the underlying data.\n\nGenerally speaking, statistical results become more reliable as the data sample increases and the correlation grows between two variables. In Marshall we stated that \"the higher the frequency of a death sentence among the comparison group of 'similar cases,' the more certain the determination that the sentence is proportionate. The lower the frequency, the more strictly the Court must scrutinize the case for the possible influence of impermissible factors.\" Id. at 153. As a general rule, \"'[a] death sentence is comparatively excessive if other defendants with similar characteristics generally receive sentences other than death for committing factually similar offenses in the same jurisdiction.\" Id. at 153-54 (quoting Tichnell, supra, 468 A.2d at 17 n.18). \"Generally,\" however, does not require a threshold rate over fifty percent. Id. at 152-54, 167. Even if the frequency were less than fifty percent, it could serve as evidence of reliability of the sentence, particularly if confirmed by the precedent-seeking analysis. Id. at 154, 167.\n\nAs in Marshall, 130 N.J. at 265-67, Justice Handler urges, post at (slip op. at 17), that we set a more specific standard in the frequency analysis than that of general comparability with other death sentences. A general standard, although admittedly imprecise, is not necessarily arbitrary. Indeed, a standard that applies generally is the antithesis of one that applies arbitrarily. Hence, as in Marshall, 130 N.J. at 152-54, we decline to define more specifically the standard for defining an acceptable frequency for the imposition of the death penalty.\n\nProportionality review seeks to determine only whether a particular death sentence is aberrational, not whether it compares perfectly with other sentences. Id. at 131. Not every statistical disparity establishes disproportionality. After conducting all three tests, we conclude that defendant's death sentence is neither random nor aberrational.\n\nAt first glance, defendant's death sentence might seem disproportionate. In the Bey Report, forty-four percent (117/266) of the death-eligible cases in the universe proceeded to the penalty-trial phase, but only twenty-nine percent (34/117) of those cases resulted in a death sentence. When the Martini data are added, the ratios remain approximately the same: forty-two percent (125/298) of the death-eligible cases proceeded to the penalty phase and thirty percent (38/125) of those cases resulted in a death sentence.\n\nThe more significant basis of comparison is not all death-sentenced cases, but only those with similar characteristics relevant to the sentencing decision between life and death. Marshall, for example, was the only defendant sentenced to death whose death sentence was affirmed among all 227 death-eligible cases and 113 penalty-trial cases as of September 24, 1991. 130 N.J. at 166. Yet, we found his death sentence not to be disproportionate. Id. at 174. Marshall's status as one who hired a contract-killer put him in a category of cases with defendants who more likely than not received a death sentence. Id. at 166-67. So here, the data show that of all deathworthy defendants those, like defendant, with a prior murder conviction, more frequently receive the death penalty.\n\nPreliminarily, defendant urges that we should not include him in the study because to do so would be to compare his case to himself. In Marshall, we recognized good reasons for both including and excluding a defendant's case from review. Thus, we decided to review the statistics under both alternatives. Id. at 167-68. Here, we use the same approach.\n\n1. THE SALIENT-FACTORS TEST\n\nThe salient-factors test, which compares sentences in cases that are factually similar, is the most persuasive test. Id. at 168. Its methodology is simple: the test measures the frequency of death sentences in similar cases. Ibid. In Bey's case, the most salient factor is that he had been convicted of a prior murder. We believe that prosecutors and juries would find a previously-convicted murderer to be more blameworthy than a first-time offender.\n\nAmong the seventeen cases in the Bey Report in which defendants had been convicted of a prior murder, seventy-five percent (9/12) of these defendants reaching the penalty-trial phase received the death penalty, and fifty-three percent (9/17) of all death-eligible defendants received the death penalty. The figures are:\n\nPenalty Trial Death Eligible\n\nIncluding Bey .75 (9/12) .53 (9/17)\n\nExcluding Bey .73 (8/11) .50 (8/16)\n\nThe Martini Report, which compiles data for John Martini's proportionality review, adds three death-eligible cases, all of which proceeded to the penalty phase. When these additional cases are considered, the ratios remain high: including Bey, sixty percent (9/15) of the defendants with a prior murder conviction who reached the penalty phase received the death penalty, and forty-five percent (9/20) of all such defendants who were death eligible received the death penalty.\n\nThe death-sentencing rate for defendants with prior murder convictions in both the Bey Report and the Martini Report exceeds the death-sentencing rate for contract-killer principals such as Marshall. Id. at 168. In Marshall, we found significant a thirty-three-percent death-sentencing rate among penalty-trial cases and a twenty-five-percent death-sentencing rate among death-eligible cases. Id. at 169. By comparison, the death-sentencing rate for cases most similar to defendant's case illustrates a higher correlation between a prior murder conviction and a death sentence.\n\nThese figures illustrate an even-higher correlation when the pool is narrowed to include cases more factually comparable to defendant's case. A significant factor in Bey's case is that in addition to being a two-time murderer, Bey committed his second murder during a sexual assault. prosecutors and juries regard as highly blameworthy those defendants who have a prior murder conviction and whose current case involves either one additional aggravating circumstance or particular violence or terror (the violence/terror factor). In thirteen cases in the Bey Report involving defendants who had been convicted of a prior murder, juries found one additional aggravating circumstance or the violence/terror factor. Among those cases, one-hundred percent (8/8) reaching the penalty-trial phase resulted in the death penalty, and sixty-two percent (8/13) of all death-eligible cases resulted in the death penalty. The figures are:\n\nPenalty Trial Death Eligible\n\nIncluding Bey 1.0 (8/8) .62 (8/13)\n\nExcluding Bey 1.0 (7/7) .58 (7/12)\n\nAgain, these ratios remain high when we consider the relevant data from the Martini Report: eighty-nine percent (8/9) of all cases reaching the penalty phase, and fifty-seven percent (8/14) of all death-eligible cases in this category resulted in a death sentence.\n\nDefendant disputes the validity of these results on several grounds. First, he argues that the cases most similar to his are not reliable indicators of deathworthiness because the sentences in those cases are fraught with procedural and other errors. The argument proceeds that if these questionable cases were excluded from the pool of death-sentenced cases and instead were coded as life-sentenced cases, the death-sentencing rate would be much lower. For reasons set forth above, however, supra at (slip op. at 11-16), we shall continue to include them. Consequently, we shall continue to treat as death-sentenced cases those cases in which we have reversed the death sentence. Therefore, the cases that initially resulted in a death sentence should remain in the pool of factually-comparable cases. Marshall, supra, 130 N.J. at 169 n.5, 194 n.10.\n\nSecond, defendant argues that his death sentence suffers from several procedural errors that affected the verdict. Generally speaking, the errors concerned jury selection and the admission of evidence. These \"distorting factors,\" defendant alleges, \"inflated the frequency leading to\" his death sentence. In Bey III, however, this Court held that it was \"extremely unlikely [that the errors] had the capacity materially to affect the jury's deliberations or produce an unjust result.\" 129 N.J. at 616. For this reason, we believe that these \"errors\" do not impugn defendant's death sentence.\n\nThird, defendant asserts that other categories of factually-comparable cases do not demonstrate a high rate of death sentences In particular, defendant points to the results of the sexual-assault and robbery cases. The sexual-assault pool in the Bey Report consists of thirty-five cases, none of which involved a prior murder conviction. The death-sentencing rate for the eighteen cases reaching the penalty-trial phase is twenty-eight percent (5/18), and fourteen percent (5/35) for all thirty-five death-eligible cases in the pool. If the analysis were limited, as defendant contends, to cases with the violence/terror factor, the death-sentencing rate increases slightly to thirty-six percent (5/14) of the penalty-trial cases and nineteen percent (5/26) of the death-eligible cases resulting in the death penalty. The figures are:\n\nPenalty Trial Death Eligible\n\nSexual assault including Bey .32 (6/19) .17 (6/36)\n\nSexual assault excluding Bey .28 (5/18) .14 (5/35)\n\nWith violence including Bey .40 (6/15) .22 (6/27)\n\nWith violence excluding Bey .36 (5/14) .19 (5/26)\n\nWhen the Martini data are added, the ratios remain approximately the same: including Bey, sixteen percent (7/44) of all death-eligible sexual-assault cases received a death sentence, and thirty-five percent (7/20) of these cases proceeding to the penalty phase received the death sentence. When we narrow our focus to sexual-assault cases exhibiting the violence/terror factor, twenty-one percent (7/34) of all death-eligible cases and forty-four percent (7/16) of penalty-trial cases, including Bey, received a death sentence.\n\nThe robbery pool includes ninety cases. Like the cases in the sexual-assault pool, none of these cases involved a prior murder conviction. Consequently, the robbery pool does not include Bey. Thirty of the robbery-pool cases proceeded to the penalty phase. Among those cases, twenty percent (6/30) resulted in the death penalty; only seven percent (6/90) of all death-eligible cases in this category received the death penalty. As with the sexual-assault pool, the sub-group of cases in this category exhibiting the violence/terror factor does not significantly increase the death-sentencing rates for robberies. Of the thirty-four cases in this smaller pool, thirty-one percent (4/13) of the penalty-trial cases and twelve percent (4/34) of all death-eligible cases resulted in a death sentence. The figures are:\n\nPenalty Trial Death Eligible\n\nRobbery including Bey .23 (7/31) .08 (7/91)\n\nRobbery excluding Bey .20 (6/30) .07 (6/90)\n\nWith violence including Bey .36 (5/14) .14 (5/35)\n\nWith violence excluding Bey .31 (4/13) .12 (4/34)\n\nThe Martini data do not significantly change the death-sentencing rate. Excluding Bey - because of his prior murder conviction - twenty-one percent (7/33) of all robbery cases that proceeded to the penalty-trial phase and seven percent (7/100) of all such cases, including death-eligible defendants, resulted in the death penalty.\n\nAlthough we agree with defendant that the death-sentencing rates in the sexual-assault pool and the robbery pool are lower than the rate in the prior-murder-conviction pool, the difference is meaningless. Both these categories as defined in the Bey and Martini Reports exclude cases with prior murder convictions. Because Bey was convicted of the prior murder of Cheryl Alston, his case is not even included in the categories of cases in which defendants have committed only a sexual assault or robbery. As demonstrated above, a prior murder conviction is one of the most significant indicia of blameworthiness. In both Bey and Martini, sixty-four percent (9/14) of all death-eligible cases having two aggravating factors, one of which is a prior murder conviction, resulted in a death sentence. Therefore, to compare defendant's case to cases involving a sexual assault or robbery, but not involving a prior murder conviction, is to disregard one of the most influential elements in death sentencing -- the prior murder conviction.\n\nAs outlined above, moreover, a smaller pool of cases accounts for defendants with prior murder convictions whose crimes exhibit one additional aggravating factor or the violence/terror factor, such as murder during the course of a sexual assault or robbery. Cases with both characteristics are most like Bey's case. Neither the Bey Report nor the Martini Report indicates in which of these cases the additional aggravating factor was a sexual assault or robbery, or both. Prosecutors, however, frequently seek the death penalty when prosecuting murders involving sexual assaults. Final Report, supra, at 81. We believe, therefore, that a jury would deem as highly blameworthy convicted prior murderers who commit a sexual assault in conjunction with a subsequent murder.\n\nUnder the salient-factors measure, the data do not show that defendants similar to Bey generally receive a sentence other than death. To the contrary, the data demonstrate that defendants like Bey, who have killed before and who kill again during a sexual assault, are highly blameworthy. Indeed, defendants having a prior murder conviction and an additional aggravating factor receive the death penalty sixty-two percent of the time. The imposition of the death penalty in sixty-two percent of all comparable death-eligible cases is strong evidence of the reliability of defendant's death sentence.\n\n2. THE NUMERICAL-PREPONDERANCE-OF-AGGRAVATING-AND-MITIGATING-FACTORS TEST\n\nThe numerical-preponderance test compares the subject case with cases having the same number of aggravating and mitigating factors. In addition to this purely quantitative analysis, the test also attempts to account for the qualitative value that juries place on certain aggravating and mitigating factors.\n\nIn defendant's case, the jury found two aggravating and two mitigating factors. Concerning the aggravating factors, the jury found that defendant had been convicted of a prior murder and that he had murdered Ms. Peniston during a sexual assault and robbery. For mitigating factors, two jurors found that defendant suffered from extreme emotional disturbance, and six found that he was entitled to the catch-all factor. Unlike the application of the numerical-preponderance test in Marshall, which reflected an infrequency of death sentences for cases with two mitigating factors and only one aggravating factor, the application of that test to cases such as this one, with two mitigating factors and two aggravating factors, demonstrates a high frequency of death sentencing. Among the twenty penalty-trial cases in which jurors identified the relevant aggravating and mitigating circumstances, weighed them, and then returned a sentence, fifty-five percent (11/20) resulted in a death sentence. The Martini Report, which adds three cases, shows a slight increase in the death-penalty rate to fifty-seven percent (13/23).\n\nDefendant argues that the frequency of death-sentencing rates for cases having two aggravating and two mitigating factors is low when all death-eligible cases are considered. Among the forty-three death-eligible cases in this category, only twenty-six percent (11/43) received the death penalty. These figures are summarized:\n\nPenalty Trial Death Eligible\n\nIncluding Bey .55 (11/20) .26 (11/43)\n\nExcluding Bey .53 (10/19) .24 (10/42)\n\nIn the Martini Report, which includes five additional death-eligible cases, the rate is twenty-seven percent (13/48).\n\nWe agree that the probability of a death sentence, on considering all death-eligible cases with two aggravating and two mitigating factors, is comparatively low. The death-sentencing rate for all such cases, however, is much higher than the rate for cases similar to Marshall. The death-penalty rate for all death-eligible cases with one aggravating and two mitigating factors, as was the case in Marshall, was seven percent (3/44) including Marshall and five percent (2/43) excluding him. Notwithstanding those frequencies, we found that Marshall's death sentence was proportionate because the payment-for-murder aggravating factor, N.J.S.A. 2C:11-3c(4)(e) (the c(4)(e) factor), produced an above-average death-sentencing rate. Id. at 172. Similarly, when one of the aggravating circumstances is the c(4)(a) factor, a prior murder conviction, the death-sentencing rate is much higher for death-eligible cases in the category of cases having two aggravating and two mitigating factors. In both the Bey and the Martini Reports, seventy-one percent (5/7) of such cases resulted in the imposition of the death penalty. The numerical-preponderance analysis, therefore, does not indicate that defendant's death sentence is disproportionate.\n\nDefendant further argues that his case should be compared to cases with three, not two, mitigating factors. The additional mitigating factor that he claims is his age, because he was eighteen years old at the time he murdered Carol Peniston. No member of the jury, however, found age to be a mitigating factor.\n\nAccording to defendant, the jury's rejection of his age as a mitigating factor indicates that the verdict is irrational. Defendant argues that age is the most significant of the mitigating factors and is the factor most often found by a jury to be relevant in sentencing decisions. See Final Report, supra, at 92 (stating \"defendant's age (5c) has the greatest mitigating effect\"). His argument is that in only seven percent (6/83) of all death-eligible cases and fifteen percent (6/41) of all cases proceeding to the penalty phase in which age was found to be a mitigating factor did the jury return the death penalty. The Martini data increased the rate slightly with sixteen percent (7/43) of all penalty-trial cases and eight percent (7/91) of all death-eligible cases resulting in the death penalty. Furthermore, because proportionality review includes non-statutory factors, defendant invites us to reconsider factors that the jury rejected or found less persuasive than others. We decline the invitation.\n\nWe held in Bey III that the jury had not erred in failing to find age as a mitigating factor. 129 N.J. at 613. The trial court had properly instructed the jury to consider both chronological age and psychological maturity at the time of the crime. Although a jury may not ignore a defendant's youth, it need not find that age is relevant to his or her culpability. Ibid. We do not believe that all twelve members of the jury were acting irrationally when each declined to find defendant's age to be a mitigating factor. Furthermore, although the jury did not find Bey's youth relevant to the age factor, it may have considered his youth in conjunction with the catch-all factor.\n\nOther juries confronting young defendants also have rejected age as a mitigating factor. For example, when first sentencing Phillip Dixon, who was eighteen at the time he beat, sexually contacted, and murdered a thirteen-year-old girl, the jury failed to find age to be a mitigating factor. State v. Dixon, 125 N.J. 223, 231 (1991); Detailed Narrative of Summaries for Death Eligible Cases 44 (Detailed Narrative Summaries). Dixon's death sentence was reversed on appeal. In that case, as in Bey III, however, the jury's failure to find age to be a mitigating factor was not a reason to reverse the death sentence. See Dixon, supra, 125 N.J. at 228; Bey III, supra, 129 N.J. at 613.\n\nIn sum, we are unpersuaded by defendant's arguments. Like the sentencing jury in Marshall, the sentencing jury in Bey considered a number of aggravating and mitigating factors, but found only some. The mere fact that defendant was eighteen when he murdered Ms. Peniston does not mean that the jury must find his youth to be a mitigating factor as a matter of law. Our system contemplates that juries will reject some factors, including age. Although juries may find age to be a mitigating factor in many cases, they need not so find it in every case.\n\nMoreover, our consideration of non-statutory factors does not entitle us to overrule the jury findings. We may not reject the jury's findings even if we might disagree with them. Our role, as previously stated, is to search for aberrations that might be the result of impermissible factors. In the frequency analysis, we will consider only those factors that the jury found relevant to the imposition of the death penalty. By comparison, in the precedent-seeking analysis, we will expand our review to include objective factors that are clearly present in the record even if the jury did not find them to be relevant. We will not include these additional factors in the frequency analysis because of the need to maintain the uniformity of the statistics. Otherwise, we would be obliged to reconsider and recalculate the ratios for each case in the universe of cases. As with judicial review generally, we must recognize our limits in proportionality review.\n\nThe Dissent argues here, as it did on direct review of Bey's conviction, see 129 N.J. at 632-48, that the trial court's exclusion of the report of one of the State's experts, Dr. Cooke, and its refusal to permit leading questions of Bey's mother, could not have been harmless error. Post at (slip op. at 21-22). Further, the Dissent asserts that harmless-error analysis has no place in death-penalty cases. Post at (slip op. at 25-30). We continue to believe, however, as we did on direct appeal, that the asserted errors were harmless. 129 N.J. at 586-94. Our role in proportionality review is not to second-guess rulings that we made on direct appeal but to determine if the imposition of the death sentence on the defendant, when compared to sentences imposed on other defendants, is irrational or aberrant. At some point, even a death-penalty case must end.\n\n3. THE INDEX-OF-OUTCOMES TEST\n\nThe index-of-outcomes approach seeks \"to identify the characteristics common to the cases in terms of their degree of blameworthiness as perceived by prosecutors and juries.\" Marshall, supra, 130 N.J. at 172. It organizes cases according to statistically-relevant measures of culpability, such as the infliction of severe physical pain or mental suffering on the victim, a contemporaneous sexual assault or robbery, and the commission of a prior murder. In the data compiled for Robert Marshall's proportionality review (Marshall Report), the Special Master \"estimated for each offender the probability of receiving a death sentence . . .. On the basis of those predictions, he created five level culpability scales which cut the cases at each 20-percentage points of increasing probability of a death sentence, i.e., 0-19, 20-39, etc.\" Technical Appendix 9 at 5.\n\nBey scores high in blameworthiness. Using indices that include both statutory and non-statutory factors, we find that the predicted probability of a death sentence in his case is seventy-six percent among all penalty-trial cases, with a lower limit of thirteen percent and an upper limit of ninety-nine percent. Defendant's case falls within culpability level four (60-80% culpability), which contains six other cases, and has an overall death-sentencing rate of forty-three percent (3/7). When we consider the Martini data, Bey's predicted probability of receiving a death sentence increases to eighty-one percent, with a lower limit of thirty-five percent and an upper level of ninety-seven percent. Accordingly, Bey moves to level five (80-100%), the highest culpability level, which has a death-sentencing rate of eighty-eight percent (23/26).\n\nAmong all death-eligible cases, the predicted probability of a death sentence in defendant's case is fifty-one percent, with a lower limit of nine percent and an upper limit of ninety-two percent. The seven cases most comparable to defendant's in terms of blameworthiness fall into culpability level three (40-60% culpability), which has an overall death-sentencing rate of fifty-seven percent (4/7). Defendant's predicted probability of receiving a death sentence in Martini is forty-seven percent, with a lower limit of ten percent and an upper limit of eighty-eight percent. At culpability level three, the death-sentencing rate is fifty percent (5/10).\n\nWhen we consider only statutory factors, the predicted probability of a death sentence for Bey among all penalty-trial cases, within a range extending from fourteen to ninety-six percent, is sixty-seven percent. Eleven cases similar to defendant's case fall within culpability level four (60-80% culpability). The overall death-sentencing rate for these cases is eighty-three percent (10/12). In Martini, Bey's predicted probability of receiving a death sentence is sixty-two percent, with a lower limit of sixteen percent and an upper limit of ninety-four percent. At culpability level four, defendant's level, the death-sentencing rate is sixty-seven percent (10/15).\n\nAmong all death-eligible cases, the predicted probability of a death sentence in defendant's case is twenty-five percent, with a lower limit of seven percent and an upper limit of sixty-one percent. The comparison includes eighteen cases similar to defendant's case. In culpability level two, defendant's level, the overall death-sentencing rate is fifty-eight percent (11/19). In Martini, Bey's predicted probability of receiving a death sentence is thirty-three percent, with a lower limit of ten percent and an upper limit of sixty-eight percent. This would place him in culpability level two, which has a death-sentencing rate of fifty-two percent (12/23).\n\nWe are constrained, as we were in Marshall, by the small sample of cases with the same level of blameworthiness as defendant's case. As in Marshall, \"'we have a much less solid basis for saying that cases like his either will or will not be associated with frequent death sentencing over the long run.'\" 130 N.J. at 173 (quoting Marshall Report, supra, at 41).\n\nTo compensate for the dearth of cases in his culpability range, defendant, following a suggestion of the Special Master, has modified the culpability ranges. Instead of using five standard ranges of culpability of twenty percent each, defendant has altered the ranges so that more cases fall within the middle-range levels two through four. Defendant's modified culpability ranges for all penalty-trial cases are:\n\nCulpability Level Culpability Range Death Sentencing Rate\n\n1 0-.0019 0% ( 0/33)\n\n2 .0019-.012 0% ( 0/19)\n\n3 .012-.145 5% ( 1/21)\n\n4 .145-.89 43% (10/23)\n\n5 .89-1 96% (28/29)\n\nThe inescapable problem with defendant's modified culpability ranges is that they consist of dissimilar cases. In level four, defendant's culpability level, the range of cases is vast: a case having an overall blameworthiness index of .145 is in the same comparison group as a case having a blameworthiness index of .89. Thus, level four includes cases in which defendants have significantly different levels of culpability. For example, defendant's extended version of culpability level four includes Joseph Hicks, who has a culpability ratio of .15. Hicks shot his victim once in the head during a struggle over a sale of marijuana. Detailed Narrative Summaries, supra, at 126. Level four also includes Nicholas Muscio, who has a culpability ratio of .16. Muscio repeatedly stabbed a woman during the course of robbing her apartment. Id. at 208. Joseph Guagenti, another defendant included in this culpability level, has a culpability ratio of .18. He shot his ex-girlfriend at a bar where she was dancing and was spending time with a new boyfriend. Id. at 113. Finally, Raymond Kise has a culpability ratio of .20. He beat and then drowned a neighbor of his co-defendants because the victim called Kise's girlfriend a \"slut\" while the group of men were drinking in the apartment of one of the co-defendants. Id. at 82.\n\nUnlike Bey, none of these defendants had a prior murder conviction. Nor did they sexually assault their victims. Guagenti had been committed to a forensic psychiatric hospital for fifteen months for depression and had attempted suicide following the break-up of his relationship with his victim. Kise was intoxicated. These defendants are not comparable to Bey, who has a culpability level of .76 for sexually assaulting, beating, strangling, and stomping his victim, Carol Peniston, and who had a prior conviction for beating, sexually assaulting, and murdering Cheryl Alston. Because these cases are dissimilar from Bey's case, they should be excluded from the pool of comparable cases. Although the Special Master noted that the pool should be expanded to include a sufficient number of cases for comparison purposes, he never said that the pool should include dissimilar cases.\n\nThe overall result of the three types of analyses constituting the frequency approach demonstrates that the capital-sentencing rate for prior murderers such as defendant is not random or aberrational. Defendant has failed to offer reliable evidence showing that for cases similar to his, a sentence other than death generally is imposed.\n\n-B-\n\nTHE PRECEDENT-SEEKING APPROACH\n\nThe second part of proportionality review involves the precedent-seeking analysis. This analysis, which supplements the frequency approach, is a less mechanical and more traditional case-by-case comparison of similar death-eligible cases. As with the frequency analysis, our study incorporates not only cases decided by March 24, 1993, the date of the Bey Report, but also cases through June 25, 1993, the date of the Martini Report. The precedent-seeking analysis also persuades us that defendant's death sentence is not disproportionate.\n\n1. RELEVANT FACTORS\n\nIn Marshall, the Court extended the factors involved in the precedent-seeking approach beyond the statutory factors to include other \"objective criteria rooted in traditional sentencing guidelines.\" 130 N.J. at 159 (citing N.J.S.A. 2c:44-1). The Court identified three elements of criminal culpability as examples of the types of such additional factors. Id. at 155-59. The first is the defendant's moral blameworthiness, which includes motive, premeditation, provocation, mental disease, knowledge of helplessness of the victim, knowledge of the effects on surviving victims, the defendant's age and maturity, and his or her involvement in planning the crime. Second is the degree of victimization, which includes the extent of mutilation of the victim and injury to surviving victims. The third factor is the character of the defendant, which includes the defendant's prior record and other acts of violence, cooperation with authorities, remorse, and capacity for rehabilitation.\n\nIn Marshall, with a few exceptions, id. at 178-79, 188, we confined the precedent-seeking analysis to the same universe of cases that we considered in the frequency analysis. Id. at 178-79. Here, we will maintain the same universe for both analyses. Proportionality review provides two different methods of analyzing the same data. If the case universe varies, the two analyses cannot confirm each other.\n\nDefendant questions the identification of comparable cases. He argues that the comparison group should include those cases in which the juries found certain mitigating factors, such as age, a history of child abuse, mental or emotional disturbance, or remorse, or in which the prosecutor offered the defendant a plea bargain. The argument misperceives the method of selecting comparable cases. Initially, from the universe of all death-eligible cases, we select a class of cases according to their salient factors. Id. at 155. Those factors, which differ from mitigating factors, are simply a means of classifying the comparable cases. Ibid. Defendant's error when selecting those cases is in substituting mitigating factors for salient factors. We use mitigating factors to make a more detailed consideration of the comparable cases to the case at hand, not to make the initial selection of those cases.\n\nThe salient factors for determining the proportionality of Bey's death penalty are not his age (although he was only eighteen when he murdered Carol Peniston), his alleged mental infirmity, history of child abuse, expression of remorse, or the fact that he was offered a plea bargain. Rather, Bey's essential attribute is that before he was convicted of sexually assaulting and murdering Carol Peniston, he had been convicted of sexually assaulting and murdering Cheryl Alston. As we stated earlier, a two-time murderer is among the most blameworthy of defendants. Supra at (slip op. at 20-21). Only eleven of the fifty-two cases that defendant offers as \"similar\" involve a prior murder conviction. As in Marshall, we decline to consider cases that do not exhibit the salient factors of the case under review.\n\nHaving determined how to identify the group of comparable cases, we now turn to how to compare those cases. Defendant proposes that we consider not only the factors that the sentencing jury found, but also those that the jury rejected, such as age, or factors that defendant never asserted, such as intoxication or the offer of a plea bargain.\n\nAs discussed above, in Marshall we distinguished similar cases based on a broader range of factors than the statutory aggravating and mitigating factors. The reason for expanding the range of factors was to reflect more accurately the factors juries consider when determining whether to impose the death penalty. 130 N.J. at 157. If, however, evidence of a factor is not objective or was not submitted to a jury, we will not consider it. Thus, although the statute does not expressly include factors such as child abuse, if evidence of such abuse is clearly present on the record, a jury is likely to consider it, as will we. Here, the sentencing jury did not hear evidence that the State had offered defendant a plea bargain, that defendant had been intoxicated, or that defendant had not served prison time for the Alston murder. Hence, we will not consider evidence of those factors.\n\nWe will, nonetheless, consider defendant's age, child abuse, and remorse. These factors are objective, rooted in traditional sentencing guidelines, were clearly presented to the sentencing jury, and are likely to influence a jury's sentencing decision. As we have indicated, although the jury rejected age as a separate mitigating factor, it may have considered defendant's youth in finding the catch-all factor. Supra at (slip op. at 31-32).\n\nEvidence of defendant's abusive childhood could have influenced the jury's findings of either the catch-all factor or the extreme-mental-or-emotional-disturbance factor. Also, Bey's apology to Carol Peniston's family could have influenced the jury's findings on the catch-all factor.\n\nIn sum, we will analyze the twenty-one cases in the Bey and Martini Reports in which defendants had a prior murder conviction, compare those cases, and determine whether Bey's case is more like those of defendants who received a capital sentence or those who received a non-capital sentence. In conducting our analysis, we will consider objective factors clearly present on the record that reflect on blameworthiness, victimization, and character.\n\n2. COMPARISON OF MARKO BEY'S CASE TO SIMILAR CASES\n\nIn the salient-factors approach, the AOC grouped Bey's case with other cases in which the defendants had a prior murder conviction. Twenty-one cases involving thirteen different defendants exhibited a separate murder conviction that was or could have been offered as a prior murder conviction. Excluding Bey, eight of those cases resulted in a death sentence, and the remaining twelve resulted in life sentences.\n\nOur task is to determine whether, by comparison to jury sentences of defendants in comparable cases, Bey's sentencing jury acted aberrantly by sentencing him to death. A defendant's sentence is not disproportionate simply because other defendants who have committed similar crimes have not received sentences other than death. No two murders are identical. The comparable cases, although similar in many respects, involve different defendants, different facts, different legal issues, and different juries. We therefore anticipate some inconsistency between the results of the comparable cases and the case before us. Of necessity, the persuasiveness of the comparison of Bey's case to others will depend on the similarity of the facts presented to the sentencing jury in those cases. We glean those facts from the published opinions or, if the opinions are unpublished, from the AOC's Detailed Narrative Summaries. We conclude that juries in comparable cases generally sentence defendants like Bey to death and that Bey's jury did not act aberrantly by sentencing him to death.\n\na. THE CASES\n\nRICHARD BIEGENWALD I and II\n\nThese cases involve the murder of Anna Olesiewicz (Biegenwald IA, IB, \u0026 IC) and that of William Ward (Biegenwald II). On August 27, 1982, eighteen-year-old Anna Olesiewicz and a friend, Denise Hunter, drove from Camden to Neptune City to spend the evening at the Asbury Park boardwalk and then stay at the home of Hunter's uncle. While at the boardwalk, Olesiewicz sat on a bench and Hunter went to the women's room. When Hunter returned, she could not find Olesiewicz. Hunter returned to her uncle's home, and the next morning filed a missing persons report.\n\nOn January 14, 1983, Olesiewicz's remains were discovered in a vacant lot behind a fast-food restaurant. Biegenwald had encouraged Theresa Smith, whom he considered a \"protege,\" to become \"tough\" by killing someone. When Smith reneged on a plan to kill one of her co-workers, Biegenwald decided to kill Olesiewicz. He lured the victim to his house by promising her marijuana. Then he shot her in the head four times. Biegenwald removed a gold ring from the victim's finger and gave it to Smith.\n\nThe State alleged two aggravating factors: the prior-murder-conviction factor, c(4)(a), and the depraved-mind factor, c(4)(c). Biegenwald asserted three mitigating factors: extreme emotional disturbance, c(5)(a); mental disease or defect, c(5)(d); and the catch-all factor, c(5)(h). In support of the mental-disease and catch-all factors, Biegenwald presented the videotaped testimony of a forensic psychiatrist who claimed that Biegenwald had been abused as a child and had been institutionalized at the age of eight. During his institutionalization, Biegenwald had been diagnosed as schizophrenic and subjected on twenty occasions to electro-shock treatment. The psychiatrist diagnosed Biegenwald as suffering from an anti-social personality disorder with paranoid traits, a condition that prevented him from appreciating the wrongfulness of his conduct. The jury found both aggravating factors, but rejected extreme emotional disturbance as a mitigating factor. Three jurors found mental disease or defect, and four jurors found the catch-all factor. After weighing the two aggravating factors against the two mitigating factors, the jury sentenced Biegenwald to death. Biegenwald 1A, supra, 106 N.J. at 18-25.\n\nWe affirmed the conviction, but remanded for a new sentencing proceeding because the jury had not been instructed to find that the aggravating factors outweighed the mitigating factors beyond a reasonable doubt. Id. at 67. A second jury sentenced Biegenwald to death, but this Court reversed that sentence because of a defective voir dire. Biegenwald IB, supra, 126 N.J. at 43. After this Court reversed the two death sentences imposed on Biegenwald for the Olesiewicz murder, a third jury sentenced Biegenwald to a life sentence.\n\nIn the Ward murder, Biegenwald and the State's principal witness, hit-man Dherren Fitzgerald, met with William Ward to arrange the terms of a \"hit\" that Fitzgerald wanted to perform for $25,000. Fitzgerald joined Ward in Ward's car and the two drove to Fitzgerald's home. Biegenwald followed them in Fitzgerald's car. Before Biegenwald arrived at Fitzgerald's apartment, Fitzgerald and Ward discussed the terms of the \"hit.\" Fitzgerald, who wanted no witnesses, refused to permit Ward to watch the \"hit.\" Ward responded by displaying his revolver. The men wrestled over the gun. Fitzgerald claims the gun went off, shooting him in either his shoulder or neck. Fitzgerald then reached for a .22 caliber pistol with a silencer. Because he could not cock the gun with one hand, Fitzgerald hit Ward on the head with the barrel, rendering the gun inoperable.\n\nThe struggle ended with Fitzgerald on top of Ward, who was on his back, still clutching the gun. Fitzgerald stated that Biegenwald then appeared and shot Ward in the head five times. Biegenwald and Fitzgerald then stuffed Ward into the car, returned home, and stored the body in the garage until they buried it.\n\nThe prosecution served notice of only one aggravating factor, the prior-murder-conviction factor, c(4)(a). Biegenwald presented two mitigating factors: mental disease or defect, c(5)(d), and the catch-all factor, c(5)(h). The jury found the aggravating factor and both mitigating factors, but was unable to reach a verdict. Therefore, the court sentenced Biegenwald to life imprisonment with a thirty-year parole disqualifier. The Appellate Division affirmed in an unreported opinion.\n\nJAMES KOEDATICH\n\nOn November 23, 1982, at approximately 9:30 p.m., eighteen-year-old Amie Hoffman left her part-time job in a shopping center. Two days later her body was found floating face down in a water-retention tank located in a secluded area. Koedatich had abducted her in the mall parking lot. When discovered, she was wearing the same clothing as on the day of her abduction.\n\nAn autopsy revealed a long gash on the left side of her head, a wound to her right shoulder, and injuries at the base of her neck. Her left ear had been severed, leaving a deep wound that extended to the spinal chord. She also had sustained two severe chest wounds, one penetrating four-and-one-half inches and the other seven inches, through her lungs and to her back. The medical examiner theorized that the knife had been inserted once, causing the shallower wound, and then thrust in deeply, causing the seven-inch wound. The victim's hand revealed defensive wounds consistent with grabbing for the knife, and abrasions and bruises on her left thigh and lower arm, consistent with having been dragged over the retention-tank wall. Vaginal and rectal swabs revealed sperm, and the medical examiner estimated that intercourse had occurred within twenty-four hours of the victim's death.\n\nThe State alleged the existence of four aggravating factors: a prior murder conviction, the c(4)(a) factor; depraved mind, the c(4)(c) factor; the murder was committed for the purpose of escaping detection for another crime, N.J.S.A. 2C:11-3c(4)(f) (the c(4)(f) factor); and the murder was committed in the course of either a kidnapping or aggravated sexual assault, the c(4)(g) factor. Koedatich refused to allow his counsel to present any mitigating evidence concerning his childhood trauma. The trial court, nonetheless, submitted the catch-all factor, c(5)(h), and charged the jury that the decision on this factor must be unanimous. The jury found that Koedatich had committed a prior murder, that of Deirdre O'Brien, for which he had received a life sentence. It also found that he had a depraved mind, but it did not unanimously find the catch-all mitigating factor. The jury sentenced Koedatich to death. State v. Koedatich, 112 N.J. 225, 231-49 (1988), cert. denied, 488 U.S. 1017, 109 S. Ct. 818, 102 L. Ed. 2d 803 (1989).\n\nThis Court affirmed the conviction, but reversed Koedatich's death sentence because of improper instructions regarding the catch-all factor. Id. at 325. In the re-trial of the penalty phase, the jury found all four aggravating factors: prior murder conviction, depraved mind, murder to escape detection, and contemporaneous murder and felony. The jury also found the catch-all factor. Because the jury could not unanimously agree on the weighing of the aggravating and mitigating factors, Koedatich received a life sentence.\n\nTHOMAS RAMSEUR\n\nOn August 25, 1982, Ramseur stabbed to death his former girlfriend, fifty-four-year-old Asaline Stokes. Stokes lived with her grandchildren across the street from Ramseur's aunt's house. Ramseur had frequently threatened to kill Stokes and had physically attacked her. On one occasion, when he had severely beaten Stokes, the police were called. Three or four months before the murder, Ramseur threatened to kill her and her grandchildren. The day before the murder Ramseur and Stokes had an argument, during which she stated she was tired of his drinking and threats. Ramseur told her, \"you'll be sorry,\" stole a knife from her kitchen, and left.\n\nOn the day of the murder, Stokes was speaking to a mechanic near her house when Ramseur left his aunt's house and walked over to the victim and the mechanic. He patted her on the shoulder, stabbed her, and continued to stab her as she fell to the ground. As she lay dying, Ramseur taunted her by saying, \"if I see your kids again I'm going to kill them too.\" Stokes finally succumbed at the hospital. She had major stab wounds in the face and chest, and two wounds in the chest penetrated eight-and-one-half-inches deep, piercing her lung.\n\nThe State alleged two aggravating factors: c(4)(a), the prior-murder-conviction factor, and c(4)(c), the depraved-mind factor. Ramseur presented testimony that his behavior had changed after he had been mugged in 1982. A neurologist testified that Ramseur had progressive shrinking of the brain in the frontal and temporal lobes. A psychiatrist testified that Ramseur suffered from psycho-motor seizures, a form of epilepsy that may cause loss of control during a seizure. The psychiatrist, who diagnosed Ramseur as paranoid, testified that the stabbing had occurred during a psycho-motor seizure. Ramseur alleged that four mitigating factors were present: c(5)(a), extreme emotional disturbance; c(5)(c), age; c(5)(d), mental disease or defect; and c(5)(h), the catch-all factor. The jury found both aggravating factors and found two mitigating factors - extreme emotional disturbance and mental disease or defect. It then sentenced him to death. Ramseur, supra, 106 N.J. at 160-66.\n\nThis Court affirmed Ramseur's conviction, but vacated the death sentence because the supplemental instructions on jury deadlock had coerced the death sentence. Id. at 314.\n\nSAMUEL ERAZO\n\nOn July 20, 1986, Erazo stabbed his wife, Lucy, to death. The two had been married in 1982 while Erazo was in prison serving a sentence for the murder of a young girl. After Erazo was released, he moved into Lucy's apartment. The relationship between the two worsened. Erazo hit Lucy on many occasions. One of Lucy's daughters spoke to parole authorities about Erazo's living in an apartment with children, a violation of his parole. As a result, Erazo was imprisoned for several months. On the night of the murder, during a party in their apartment, Erazo and Lucy drank heavily. Tension increased throughout the evening, and Erazo became infuriated when Lucy danced the merenge with another man.\n\nWhen the party ended at 11:30 p.m., Erazo left to accompany his guests home. When he returned, Lucy was leaving the apartment. She returned after midnight. Shortly thereafter, neighbors heard glass breaking and Lucy screaming that Erazo was killing her. Erazo changed his clothes, left the apartment house, and told a friend to call an ambulance. Medical personnel found Lucy lying on the floor next to a bloodstained knife. She had sustained four knife wounds to her hands, arms, and chest, three slashes to the neck, and a single stab wound to the back that had killed her instantly. The State asserted that Erazo had killed her because after she purposely cut her hand, she had threatened to call the police, a call that could have led to the revocation of Erazo's parole.\n\nAt the penalty phase, the State relied on two aggravating factors: c(4)(a), prior murder conviction; and c(4)(c), depraved mind. In mitigation, Erazo presented testimony from his brother and sister urging the jury to spare his life for them and for his mother, who was ill. Corrections officers at Rahway State Prison testified that during Erazo's imprisonment, he had been a model prisoner. Erazo also gave a statement of allocution. He offered this evidence in support of six mitigating factors: the c(5)(a) factor, extreme emotional disturbance; N.J.S.A. 3C:11-3c(5)(b) (the c(5)(b) factor), victim participation in conduct that led to her death; the c(5)(d) factor, intoxication; N.J.S.A. 11:3c(5)(e) (the c(5)(e) factor), unusual or substantial duress; the c(5)(c) factor, age; and the c(5)(h) catch-all factor. The jury found both aggravating factors and four of the mitigating factors: extreme emotional disturbance, victim participation, intoxication, and extreme duress. It rejected the age and catch-all factors, and sentenced Erazo to death. Erazo, supra, 126 N.J. at 227-31.\n\nThis Court reversed the conviction and remanded the case to the Law Division for a re-trial of the guilt phase because of an error in the jury charge on passion-provocation manslaughter and because of a Gerald error. Id. at 122. At the time of the Martini Report, Erazo's guilt had not yet been determined.\n\nFRANK PENNINGTON\n\nPennington arrived at a bar in East Rutherford, New Jersey at about 11:30 p.m. on September 2, 1986. Thirty minutes later, the victim, Arlene Connor, arrived to help her daughter close the bar. Connor announced closing time at about 1:00 a.m. Pennington asked for a beer, his fourth, and went to the men's room. The other customers had left by the time Pennington returned to the bar. Pennington shot Connor once in the heart, killing her. In a statement to the police, Pennington conceded that he had pulled out a gun, told the victim he did not want to hurt anyone, and that he just wanted money. When Connor threw a glass that hit him in the chest, he ducked, straightened up, and pulled the trigger.\n\nThe State alleged two aggravating factors: c(4)(a), prior murder conviction; and c(4)(g), murder while engaged in a contemporaneous felony. Pennington alleged three mitigating factors: c(5)(a), extreme emotional disturbance; c(5)(d), mental disease or defect; and c(5)(h), the catch-all factor.\n\nHe presented the testimony of various family members, who asserted that his mother was immature, promiscuous, bad tempered, and had not properly raised him. For example, she had taught him to steal cigarettes for her. His mother testified that Pennington's father was an alcoholic who had beaten her and Pennington. Furthermore, in 1968 Pennington enlisted in the Marine Corps and served in Vietnam. Medical testimony indicated that Pennington suffered from multiple-personality disorder, and that after he had returned home from Vietnam he had suffered from post-traumatic stress syndrome. He also was an alcoholic and had suffered a brain injury.\n\nFinding both aggravating factors and the mental-disease-or-defect mitigating factor, the jury sentenced Pennington to death. Pennington, supra, 119 N.J. at 577-60. This Court reversed the sentence because the trial court had failed to require the jury to determine whether Pennington had intended to cause death rather than just serious bodily injury, a Gerald error. Id. at 561. Pennington received a life sentence in the re-sentencing trial.\n\nBRAYNARD PURNELL\n\nOn August 28, 1988, at about 6:00 p.m., Purnell, a thirty-six-year-old cocaine user, asked a friend, Jeffrey Davis, to purchase $20 of cocaine from Lawrence Talley. Davis went to a local playground but was unable to make a buy. Talley later sent an associate to deal with Purnell, but Purnell wanted more cocaine than Talley would agree to sell for $20. Talley and Purnell walked to Purnell's house, where in the backyard Purnell killed Talley and hid the body. The body was found several days later. Talley had been killed by fifteen stab wounds to the neck, chest, and abdomen. Scratches on his back were consistent with the body having been dragged. According to Davis, on the night of the murder, Talley was carrying cocaine, but the police did not find drugs or cash on Talley's body.\n\nThe State alleged two aggravating factors: c(4)(a), prior murder conviction; and c(4)(g), murder committed during the course of a robbery. In mitigation, Purnell asserted c(5)(h), the catch-all factor; and c(5)(b), victim participation in the conduct that precipitated his death. Defense witnesses testified about Purnell's redeeming character and personality, his good works for others, and his non-use of drugs. The jury found both aggravating factors. Three jurors found that the victim had participated in his own death, the c(5)(b) factor, and two jurors found the catch-all factor, c(5)(h). Purnell was sentenced to death. Purnell, supra, 126 N.J. at 524-30.\n\nThis Court reversed the conviction and the sentence because the trial court had not charged the jury on the lesser crime of felony murder. Id. at 534. At the second sentencing hearing, Purnell received a life sentence.\n\nBRYAN COYLE\n\nIn 1983, shortly after his release from prison after serving a term for murder, Coyle moved to Old Bridge. He soon became sexually involved with Rhonda Lemberg, his married next-door neighbor. Lemberg told Coyle that she was unhappy with her husband, who had beaten her and her children. She also disclosed her fear that her husband would one day use against her the gun that was in their house.\n\nOn July 28, 1983, Lemberg and her husband had an argument, following which she went to Coyle's house. Coyle had taken mescaline, a narcotic, before her arrival. Shortly thereafter, the husband arrived and demanded that his wife return home. When no one answered, the husband broke the window, cutting his hand. Before opening the door, Coyle retrieved his nine-millimeter handgun, loaded it, and put it in his back pocket. The husband entered and, ignoring Coyle's efforts to placate him, moved towards his wife. When Coyle fired a warning shot, the husband fled and returned home to call the police. The husband, seeing his wife and Coyle enter Coyle's car, ran into the street and used a discarded garage door to block the car. Lemberg believed that her husband had a gun. She told Coyle that her husband would kill her. She fled from the car, but her husband caught her and they engaged in a heated verbal exchange. Her husband walked back to his home and Coyle walked down the block with Lemberg. Shortly thereafter, the husband stormed out of his house and hurried after Lemberg. Coyle chased the husband and fired his handgun. The first two shots missed. Coyle shot again, this time hitting the husband in the leg. The husband crawled across a lawn and hid behind a tree. Coyle followed him and fired three more shots, two of which hit the husband, one in the back of the head, killing him. At trial, both Lemberg and Coyle testified that the husband had been acting irrationally on the night of the murder. Coyle also claimed that he fired at the husband to save Lemberg, that he had intended not to kill her husband, but only to stop him from attacking her.\n\nThe State alleged two aggravating factors: c(4)(a), prior murder conviction; and c(4)(c), depraved mind. Coyle asserted four mitigating factors: c(5)(a), extreme emotional disturbance; c(5)(d), intoxication; c(5)(b), victim participation; and c(5)(h), the catch-all factor. The jury found both aggravating factors and only the victim-participation factor, c(5)(b), as a mitigating factor. It sentenced Coyle to death. Coyle, supra, 119 N.J. at 201-08.\n\nThis Court reversed the death sentence because of various errors, including the absence of an instruction on the intent to cause death as opposed to serious bodily injury, and an improper charge on passion-provocation. Id. at 221. On re-sentencing, Coyle received a life sentence.\n\nCARLOS VASQUEZ\n\nOn June 3, 1988, at about 8:00 a.m., Vasquez, who was forty-three-years-old, abducted a thirteen-year-old girl and then sexually assaulted and killed her. The victim, whose hands and feet were tied together behind her back with electrical cord and clothesline, was found in a box that had been put out to be collected with the trash. Vasquez said that he had made sexual advances toward the girl. When she resisted and became hysterical, he grabbed her neck to prevent anyone from hearing her. The cause of death was asphyxia caused by gagging, ligature strangulation, and fracture of the cervical spine.\n\nAt the request of the victim's parents to spare them the stress of a trial, defendant was allowed to plead guilty to felony murder, despite the fact that he had a prior murder conviction. Vasquez received an aggregate sentence of life imprisonment plus twenty years, with a forty-year parole disqualifier. He denied any physical, mental-health or substance-abuse problems. Detailed Narrative Summaries, supra, at 285-86.\n\nJIHAD MUHAMMED\n\nOn August 3, 1984, Muhammed approached Dawn Andrew and Clarence Maxwell on the street and offered to sell them \"speed.\" When Andrew declined, Muhammed left but returned twenty minutes later with his co-defendant, Forrest Boyer. Muhammed pulled out a handgun, pointed it at the couple, and then fired it into the ground. Boyer then took Andrew's purse, rummaged through it, and stole marijuana. Maxwell told Boyer to give back the purse. Muhammed took two steps, pulled out a sawed-off shotgun, and shot him. When Andrew's father came out of a nearby house and asked why Muhammed had shot the victim, Muhammed replied: \"I didn't like his attitude.\"\n\nMuhammed pleaded guilty to murder and various weapons charges, and was sentenced to life imprisonment with an aggregate parole disqualifier of thirty-six years. Id. at 189-91.\n\nALBERTO NIEVES\n\nOn March 25, 1987, Nieves was leaving a grocery store when he heard Hector Rentas sound his automobile horn at Nieves's wife. In the exchange that followed, Nieves took a gun from his car and pointed it at Rentas's head, telling him that if he wanted his girl, he should take her. Nieves then lowered the gun and returned to his car.\n\nThree days later, on March 28, Rentas was parked outside a store with his six-year-old son when Nieves walked up to him and told him to \"stop messing with my girl.\" When Rentas responded that he was not messing with Nieves's girl, Nieves raised a gun and shot Rentas once in the head. The bullet passed through Rentas's head and lodged in the seat between him and his son. The medical examiner later testified that at the time of the shooting, the gun had been within six inches of the victim's head.\n\nA jury convicted Nieves of purposeful or knowing murder. At the penalty phase, the prosecution offered two aggravating factors: c(4)(a), the prior-murder-conviction factor; and c(4)(b), the grave-risk-of-death factor, for endangering the victim's six-year-old son. The defendant offered four mitigating factors: c(5)(a), extreme emotional disturbance; c(5)(b), victim participation; N.J.S.A. 2C:11-3c(5)(g) (the c(5)(g) factor), substantial assistance to the State; and c(5)(h), the catch-all factor. The catch-all factor was supported by evidence that Nieves was one of eighteen children and had grown up in extreme poverty. One of his siblings had been murdered and another had been imprisoned for avenging that murder.\n\nThe jury found both aggravating factors and two of the mitigating factors: c(5)(b), victim participation; and c(5)(h), the catch-all factor. One juror refused to deliberate, and the jury could not reach a unanimous verdict. The court sentenced the defendant to an aggregate term of life imprisonment, with a thirty-two-and-one-half-year parole disqualifier. Id. at 222-25.\n\nGEORGE BOOKER\n\nOn January 6, 1972, George Booker was convicted of murder and was sentenced to twenty-seven to twenty-nine years in the State Prison. He was paroled on November 15, 1983. On September 11, 1985, after being asked to leave the home of friends with whom he had been staying, Booker went to the home of a thirty-one-year-old female friend, pulled out a knife, sexually assaulted her, and stole her car. As he drove away, Booker ran down a pedestrian and stole his wallet.\n\nBooker then went to the home of two women who were living together. Booker raped and sodomized one woman, bashed in her mouth and forehead, and then strangled her with an electrical cord. When the other woman returned home, he forced her to undress and lie in the bed next to her dead roommate. Then he stabbed her to death. Booker, knife in hand, was arrested on September 13 while inside the home of an elderly female.\n\nBooker was convicted of capital murder of both victims. The sentencing jury found aggravating factors for a prior murder conviction, c(4)(a); depraved mind, c(4)(c); and murder to escape detection, c(4)(f). Concerning the murder of the first victim, the jury also found c(4)(g), the contemporaneous-felony factor, as an aggravating factor. In mitigation of both murders, the jury found c(5)(a), the extreme-mental-or-emotional-disturbance factor. Also, the jury found c(5)(h), the catch-all factor. Because the jury could reach a unanimous decision concerning either murder, the court sentenced Booker to an aggregate sentence of life imprisonment, with a sixty-year parole disqualifier. Id. at 29-32.\n\nHECTOR SANABRIA\n\nSanabria's first murder occurred on September 25, 1984, when Sanabria, a drug dealer, shot and killed another drug dealer, Omar. The shooting was an attempt by Sanabria to obtain a monopoly over the sale of drugs in Paterson. The pre-sentence report stated that Sanabria and his brother, Junior, were concerned that Omar was attempting to move into their territory, and that he had robbed one of their workers. During a meeting between Omar and the Sanabria brothers, Junior struck Omar with a gun. When Omar reached for his gun, both Sanabria brothers fired their weapons. Sanabria also grabbed Omar's gun and shot him with his own weapon. Substantial proof suggested that Sanabria had provoked the encounter. Omar's body was found with seven bullets in it, five in the heart.\n\nThe second murder occurred on December 3, 1984, when, during an argument about the ownership of drugs, Sanabria shot and killed Edwin and Nelson Aponte on a street in Paterson. As in the killing of Omar, evidence supporting Sanabria's claim of self defense was weak. The cause of death for both victims was multiple gunshot wounds in the chest.\n\nA jury convicted Sanabria of Omar's murder, and on April 25, 1986, the court sentenced Sanabria to life imprisonment, with a thirty-year parole disqualifier. Despite this murder conviction, the prosecutor did not file a notice of the c(4)(a), prior-murder-conviction factor in the case involving the murder of the Aponte brothers. The jury convicted Sanabria of the knowing and purposeful murder of both brothers. The court sentenced Sanabria to two thirty-year terms, each with a thirty-year parole disqualifier and each consecutive to the other. Detailed Narrative Summaries, supra, at 227-28.\n\nb. THE COMPARISON\n\nThe totality of the evidence, which includes Bey's prior murder conviction and the sexual assault of both of his victims, leads us to conclude that Bey's death sentence is not disproportionate.\n\nBey argues that when measured by victimization, moral blameworthiness, and character, he is not as deathworthy as other defendants who received either life sentences or death sentences. We disagree.\n\nFirst, Bey compares the victimization in his murder and sexual assault of Carol Peniston with that in the murders of other defendants in the comparison group. Bey points to the fact that Biegenwald has been convicted of killing a total of five people, and that Booker has been convicted of killing a total of three people, but that he has killed only two people. Although the number of victims is a factor that bears on the degree of victimization, the prosecutor presented the sentencing juries in the Biegenwald cases with evidence of only two other murders, not four. One of those murders was a 1959 conviction for a murder that had occurred during the course of a robbery. As for Booker, two of the murders occurred during the same crime spree. Unlike Bey's two murders, they were not separate and independent incidents.\n\nSome defendants, such as Biegenwald, Ramseur, Purnell, Coyle, and Sanabria, shot or stabbed their victims several times. Others, like Ramseur, Erazo, and Nieves, threatened their victims over a period of time, with Nieves killing his victim in the presence of a young child. Unlike Bey, however, none of these defendants sexually assaulted his victim. By comparison, Bey sexually assaulted, beat, strangled, and stomped on his victim, a woman whom he did not know and who had done nothing to provoke his rage. Koedatich, Vasquez, and Booker, who sexually assaulted their victims, are closer to Bey in terms of victimization. As we subsequently discuss, infra at (slip op. at 68-70), these cases are distinguishable from Bey's case for other reasons.\n\nSecond, defendant also contends that he is less culpable than several other defendants because he is not as morally blameworthy. Specifically, he contends he was much younger at the time of his second murder than they were when they murdered their victims. Although age often mitigates a defendant's culpability, as we have stated above, supra at (slip op. at 31-32), in light of the totality of evidence, defendant's age by itself does not compel the return of a sentence other than death.\n\nBey also offered evidence of chronic child abuse and possible organic brain syndrome to support his argument that he is less culpable than other defendants. Like many of the comparable defendants, Bey suffered an abusive childhood. His violent childhood, however, does not differ materially from that of Biegenwald, Koedatich, Ramseur, Pennington, and Nieves, who also had suffered from child abuse or other violence. But these defendants, unlike Bey, offered additional, uncontroverted evidence to demonstrate the impact of the abuse and violence they had suffered.\n\nFor example, Biegenwald had been institutionalized as a youth from the age of eight. He also had experienced twenty electro-shock treatments, and had been diagnosed as suffering from schizophrenia, anti-social personality disorder, and paranoia. Ramseur and Pennington offered uncontradicted physical evidence to support their defense of mental disease or defect. Ramseur exhibited a shrinking of his brain in the frontal and temporal lobes and suffered from psycho-motor seizures, which he had experienced during the murder of his victim. Pennington was a Vietnam veteran who suffered from post-traumatic stress syndrome, multiple personality disorder, and a brain injury. In Bey's case, however, the State disputed the evidence of organic brain damage and introduced evidence showing that Bey suffered merely from an anti-social personality disorder that did not prevent him from understanding his actions or acting purposely. The uncontradicted evidence of physical brain damage to the comparable defendants could explain why their juries did not deem them to be deathworthy.\n\nThe Dissent attacks our explanation of the difference between Bey's sentence and that of other defendants by pointing to evidence of the abuse that Bey endured during his childhood that was excluded at trial. Specifically, the Dissent points to the exclusion of a report of a state psychologist, Dr. Cooke, and the preclusion of leading questions to Bey's mother. Post at (slip op. at 21-22). Implicit in the Dissent is the notion that the excluded evidence would establish that Bey is like other defendants who have received a sentence other than death. On Bey's direct appeal, we found that the evidence was cumulative and therefore that the errors were harmless. 129 N.J. at 590, 594. We continue to believe that other evidence adequately established the abuse that Bey suffered as a child and that the excluded evidence would not have made a difference. Thus, we find that the excluded evidence does not account for the difference between Bey's death sentence and the sentences imposed on other defendants.\n\nMoreover, Bey failed to offer the sentencing jury any evidence of intoxication. In contrast, Booker, Erazo, and Pennington presented evidence that they had been intoxicated when they committed their crimes. Furthermore, many defendants, e.g., Biegenwald (in the murder of William Ward), Erazo, Purnell, Coyle, Pennington, and Sanabria offered evidence that they had been provoked by the victim or otherwise had been motivated by passion or duress. Bey, in contrast, did not know his victim and was not provoked by her. We conclude that the differences between Bey's case and the comparable cases suggest that Bey is more blameworthy than these defendants.\n\nThird, defendant attempts to distinguish his character from that of other defendants. He states that unlike the other defendants, with the exception of Sanabria, he had not served any prison time for a prior murder. Defendant, however, does not explain how this fact reflects on his character. From this evidence, we cannot conclude that Bey's character is any better than that of the other defendants.\n\nLast, defendant also offers his remorse as evidence that his character is less culpable than that of other defendants. In support, he points to his apology to the victim's family. Bey, however, expressed remorse only at the sentencing phase when facing the death penalty. Under these circumstances, his belated apology does not demonstrate that his character is any better than that of the other defendants.\n\nIn sum, the results of our analysis of the degree of victimization, moral blameworthiness, and character of defendants in comparable cases do not support the Conclusion that Bey's sentence is disproportionate. Bey may seem no worse in some respects than defendants who have received a sentence other than death. Yet, as the preceding Discussion illustrates, the cases of those other defendants differ significantly from Bey's case. So viewed, Bey's death sentence is not aberrant.\n\nEach of the defendants in the comparison group had a prior murder conviction. Except for Koedatich, Vasquez, and Booker, however, their cases share a common characteristic that distinguishes them from Bey's case: the absence of sexual assault of the victims. As culpable as defendants with prior murder convictions may be, a jury could find that a defendant such as Bey, with two convictions for murder and aggravated sexual assault, is particularly deathworthy.\n\nKoedatich, Vasquez, and Booker exhibit similar levels of culpability because each of these defendants sexually assaulted his victim and each had been convicted of a prior murder. But these three defendants, unlike Bey, ultimately received life sentences for their crimes. From this, defendant argues that he also should have received a life sentence. We disagree.\n\nFirst, we expect that juries may decide similar cases differently. Disparity alone does not demonstrate disproportionality. Marshall, supra, 130 N.J. at 181. As we stated in Marshall:\n\nThe ultimate question concerns whether the fact that a jury spared [other defendants in comparable cases] requires the invalidation of Robert Marshall's death sentence. We do not believe that statutory disproportionality ever contemplated that two New Jersey juries must reach identical verdicts even in closely-similar circumstances. Our search should be for some impermissible or invidious factor or pattern that has been broken. That the [other defendants] were spared their lives does not establish a pattern of life-sentencing for such killings. We do not sense that some invidious factor tainted Marshall's sentencing process.\n\n[Ibid.]\n\nHere, as in Marshall, we do not find a pattern of life sentencing or the taint of an invidious factor that would require us to reverse Bey's death sentence. Unusual circumstances arising in Koedatich and Vasquez preclude a finding of a pattern of life sentencing for sexual-assault murders. In Koedatich, after a jury unanimously decided to sentence Koedatich to death, one juror in the second penalty-trial phase, in light of Koedatich's abusive childhood, refused to consider the death penalty. The mere fact that one juror in one case prevented the imposition of the death penalty need not prevent other juries from imposing that penalty on another defendant in another case. Similarly, in Vasquez, the victim's parents insisted that Vasquez be allowed to plead to a non-capital offense to spare them the trauma of a trial.\n\nAs previously noted, Booker is distinguishable on the facts. It involved a defendant who went on a crime spree apparently caused by substance abuse. Booker committed his sexual assaults and murders during this spree. The jury heard evidence that Booker had used marijuana and anti-depressants, and had drunk a quart of beer before commencing his rampage. Uncontroverted expert testimony explained that Booker had an unusually exaggerated reaction to these drugs and had become uncontrollable while under their influence. By comparison, the second Bey jury did not hear any evidence of intoxication. Bey, moreover, committed his sexual assaults and murders in separate, independent criminal episodes.\n\nFinally, in neither Vasquez nor Booker was the prior murder joined with a sexual assault. Only Bey's and Koedatich's murders joined rape and murder. As we stated above, the Koedatich case was unusual because one juror, in light of mitigating evidence, refused to consider imposing the death penalty. Despite their basic similarities, the Koedatich, Vasquez, and Booker cases differ sufficiently to support our Conclusion that Bey's death sentence is not disproportionate.\n\n3. OTHER CASES\n\nIn the category of cases of defendants with prior murder convictions, defendant includes the cases of Leroy Taylor, Orlando Montalvo, and Marcus Rogers. We decline to consider these cases because none of the defendants had been convicted previously of murder. The prosecutor could not have asserted the prior murder conviction in any of them. In Taylor, the defendant was adjudicated a delinquent in his first murder case and therefore was not \"convicted\" of murder. Detailed Narrative Summaries, supra, at 257-60. In Montalvo, the defendant pled guilty to manslaughter in his first murder case before the second murder trial began. Id. at 179-83. Finally, in Rogers, the defendant's prior murder conviction was reversed on appeal, and he then pled guilty to manslaughter before he committed the second murder. Id. at 215-19. In none of these cases could the State have asserted the prior-murder-conviction aggravating factor. Hence, they are distinguishable from Bey.\n\n-IV-\n\nRACE AS AN IMPERMISSIBLE FACTOR\n\nFinally, defendant contends that prosecutors and juries impermissibly consider the race of defendants and of victims when imposing the death sentence. His point is that if he were not an African-American, the prosecutor would not have sought and the jury would not have imposed the death penalty. The statistics do not support his contention. Our abiding problem with analyzing the effect of race is that the case universe still contains too few cases to prove that the race of a defendant improperly influences death sentencing.\n\nThat fundamental point distinguishes our opinion from the Dissent. The inescapable fact is that we lack enough cases to conclude with any degree of statistical reliability whether race is working impermissibly in death sentencing. For the Dissent, however, the \"under-sized data pools and consequently large margins for error,\" post at (slip op. at 39), merely mean that the Court has not met its burden to ensure that the imposition of the death penalty is proportionate. As we have explained above, however, we believe that the burden remains that of the defendant to prove disproportionality. Supra at (slip op. at 15-16).\n\nIn Marshall, we reaffirmed our commitment to equality in the administration of Justice, stating that\n\nwere we to believe that the race of the victim and race of the defendant played a significant part in capital-sentencing decisions in New Jersey, we would seek corrective measures, and if that failed we could not, consistent with our State's policy, tolerate discrimination that threatened the foundation of our system of law.\n\n[130 N.J. at 209.]\n\nWe remain committed to that belief. Consequently, we will continue to monitor any correlation between race and the imposition of the death penalty.\n\nAlso in Marshall, we indicated that we would find the race-based disparities described in McCleskey v. Kemp, 481 U.S. 279, 326-27, 107 S. Ct. 1756, 95 L. Ed. 2d 262 (1987), to be constitutionally significant. Id. at 210. In McCleskey, the United States Supreme Court sustained the imposition of the death penalty notwithstanding certain disparities in death sentencing according to the race of the defendant and of the victim. 481 U.S. at 291, 107 S. Ct. at 1766, 95 L. Ed. 2d at 277. Those disparities were that white-victim cases received capital sentences at a rate eleven times that of cases involving black victims; black defendants who killed white victims were sentenced to death at nearly twenty-two times the rate of black defendants who killed black victims and seven times the rate that pertained to white defendants who killed black victims. Id. at 326-27, 107 S. Ct. at 1785, 95 L. Ed. 2d at 300-01. The McCleskey data further indicated that prosecutors sought the death penalty for seventy percent of black defendants who killed white victims, but for only fifteen percent of black defendants who killed black victims and nineteen percent for white defendants who killed black victims. Id. at 327, 107 S. Ct. at 1785, 95 L. Ed. 2d at 301. Although the United States Supreme Court found these data not to be significant under the Federal Constitution, we believe that these disparities could be significant under the New Jersey Constitution. Marshall, supra, 130 N.J. at 210.\n\nUnlike the data in McCleskey, the Marshall data did not demonstrate that race played a constitutionally-significant role in death sentencing. Ibid. In Marshall, the Special Master presented two tables: Table 18, which treats the race of defendants; and Table 18A, which treats the race of victims. Table 18 illustrated that at culpability level four, black defendants are sentenced to death sixty-four percent more often than non-black defendants. Ibid. According to Table 18A, white-victim cases are 1.4 times more likely to advance to the penalty trial than cases involving other victims. Id. at 211.\n\nAlthough these tables demonstrate a degree of disparity that troubled us in our analysis of McCleskey, we ultimately found in Marshall no substantial discrimination in the application of the Act. One reason was that the tables did not provide an extensive set of relationships between the statistical variables. Id. at 210. Table 18 and Table 18A showed the rate of death sentencing for defendants and victims individually, but they did not show, as the McCleskey data showed, the death-sentencing rate for race-of-victim and race-of-defendant combinations.\n\nAnother reason we rejected Marshall's arguments was that the number of cases involving defendants, black or non-black, with comparable culpability factors was too few to support any reliable Conclusion. Id. at 211. Finally, and most importantly, the data showed no race-of-victim effects in penalty-trial decisions. Id. at 212-13. For these reasons, we concluded that the data showed no \"'substantial discriminatory effect in the application of the [Act].'\" Id. at 211 (quoting Final Report, supra, at 103).\n\nHere, amicus curiae Association of Criminal Defense Lawyers of New Jersey and New Jersey State Conference of NAACP Branches have attempted to correct the deficiencies we identified in Marshall. Amici developed a more extensive set of relationships by evaluating the interaction between race-of-victim and race-of-defendant combinations and by assessing the influence of statutory and non-statutory factors such as socio-economic status and the gender of the defendant. Also, amici updated the Marshall universe by adding forty additional cases. It recently supplemented this larger universe with the data from the Martini Report. The Martini data add eight more penalty-trial cases to Table 18 and twenty-eight more penalty-trial cases to Table 18A. Using these amended tables, Bey argues that an overall racial disparity exists at a statistically-significant level, particularly at the middle ranges of culpability where the choice between life and death is less certain.\n\nAs in Marshall, Bey's Table 18 displays race-of-defendant disparities in death-penalty-sentencing decisions among penalty-trial cases after adjusting the standard-culpability levels. As stated above, only seven cases fall within culpability level four, Bey's level. The Martini data add only one case. Bey, to include enough cases for a statistically-reliable comparison, redefined level four from .60-.80 to .145-.89. His new level four now contains twenty-three cases, ten of which resulted in the death penalty. Thus, forty-three percent (10/23) of the cases at culpability level four resulted in the death penalty. The Martini data include twenty-seven cases, thirteen of which resulted in the death penalty, thereby increasing the death-sentencing rate at level four to forty-eight percent (13/27).\n\nBey argues that a disproportionate number of these death sentences were imposed on black defendants. Of the ten cases included in the Bey data that resulted in death sentences, eight involved black defendants, but only one defendant was white and one was Hispanic. Therefore, the death sentence was imposed on black defendants in culpability level four, Bey's level, at a rate of eighty percent (8/10); for non-black defendants, the rate was only fifteen percent (2/13). The results are produced below:\n\nCulpability Level Black Defendant Non-Black Defendant % Disparity\n\n1 0 ( 0/21) 0 ( 0/12) 0\n\n2 0 ( 0/8) 0 ( 0/11) 0\n\n3 .17 ( 1/6) 0 ( 0/15) 17\n\n4 .80 ( 8/10) .15 ( 2/13) 65\n\n5 1.0 (12/12) .94 (16/17) 6\n\nThe Martini data reflect a similar, although slightly decreasing disparity between black and non-black defendants. Of the thirteen cases that received a death sentence, ten involved black defendants and only three involved white or Hispanic defendants. Therefore, Bey's data show that at culpability level four, the death sentence was imposed on black defendants at a rate of eighty-three percent (10/12), and on non-black defendants at a rate of twenty percent (3/15). The results are:\n\nCulpability Level Black Defendant Non-Black Defendant % Disparity\n\n1 0 (0/16) 0 (0/10) 0\n\n2 0 (0/12) 0 (0/15) 0\n\n3 .2 (2/10) .13 (2/16) 7\n\n4 .83 (10/12) .20 ( 3/15) 63\n\n5 1.0 (11/11) .94 (15/16) 6\n\nDespite amici's best efforts, defendant's analysis remains flawed. Defendant's redefinition of the culpability levels distorts culpability level four, the level that evidences the highest percentage of disparity and that includes Bey. The basic problem is that level four includes too much. To create middle ranges that contain a sufficient number of cases, defendant extended culpability level four from a range of twenty percent to one of seventy-five percent. This extended range fails to achieve the underlying purpose of creating culpability levels consisting of similar cases. Supra at (slip op. at 37-38). In Marshall, the Special Master chose the original twenty-percent ranges so that each range would contain sufficiently similar cases in terms of blameworthiness. Admittedly, he also stated that culpability level four would need to be expanded to include a sufficient number of cases for a valid statistical analysis. Marshall Report, supra, Technical Appendix 9 at 5. The Special Master, however, never stated that any range so expanded would be statistically reliable. As expanded, culpability level four includes cases that are dissimilar. Thus, the level is unreliable.\n\nThe Dissent's attempt to develop a reliable statistical base fails for the same reason. Although the Dissent's culpability level four is smaller than defendant's, it still includes cases that are dissimilar. The Dissent's level four includes cases with a predicted probability of a death sentence ranging from .19 to .85, a sixty-six percentage-point differential. A culpability range that spans sixty-six percentage points, although narrower than defendant's range, is still too broad to ensure the inclusion only of comparable cases. Furthermore, the Dissent's perceived \"true mid-range cases,\" post at (slip op. at 38), with a predicted probability of .30 to .70, includes only fifteen cases at level four. So meager a number of cases is too small to support the Dissent's Conclusion that \"an obvious disparity between races is visible.\" Post at (slip op. at 38). We note, moreover, that the Dissent's compilation of cases, unlike defendant's Table 18, is not limited to penalty-trial cases and includes cases that are not even death eligible. Post at (slip op. at 37 n.4).\n\nImplicit in the extensions of level four as proposed by defendant and by the Dissent is the admission that without extending the range to include additional cases, level four would contain too few cases to support a reliable statistical Conclusion. The lack of sufficient cases becomes clear if we confine our analysis to the standard twenty-percent levels contained in the Bey and Martini Reports. Of the cases included in level four in the Bey Report, only seven proceeded to the penalty phase, three of which resulted in the imposition of the death penalty. The comparable data in the Martini Report show only eight cases, four of which resulted in the death sentence. Neither table contains a sufficient number of cases to determine whether a significant statistical disparity exists between death-sentencing black and non-black defendants. In the Martini Report, moreover, Bey's predicted probability of receiving a death sentence increases to .81, which places him in culpability level five, the highest culpability level.\n\nWithout a sufficient number of similar cases, we cannot hold that race impermissibly influences the imposition of the death penalty. As vexing as waiting for more data may be, we have no alternative but to wait. To force the analysis by adding dissimilar cases, as defendant and the Dissent propose, would disserve the ends of Justice. We do not foreclose all attempts to modify the culpability ranges to produce a sufficient number of cases for a valid statistical analysis. Any such modification, however, must consist of ranges containing similar cases.\n\nDefendant's Table 18 also addresses other impermissible factors, such as socio-economic status. Defendant argues that socio-economic status aggravates racial disparity at Bey's culpability level. The flaw in defendant's analysis is that he subjectively defines socio-economic status. The problem is not that we should never consider socio-economic status. In Marshall, we stated that such data might be relevant. 130 N.J. at 135, 203, 214. The data, however, must be objective and rooted in traditional sentencing guidelines. Supra at (slip op. at 39). In Marshall, we also accepted the defendant's argument that we should not undertake subjective, moralistic judgments when considering non-statutory factors. Id. at 155. Socio-economic status, as defined by Bey, invites precisely that kind of subjective judgment.\n\nDefendant appears to have defined socio-economic status according to general job descriptions without considering other relevant facts about the defendants' or the victims' lifestyles. For example, defendant identifies high socio-economic status as including victims or defendants who are employed as secretaries, government workers, and store managers. Consequently, he identifies Carol Peniston as having a high socio-economic status simply because she was a secretary. From the record, however, we cannot glean sufficient information to justify that Conclusion. Bey contends that defendants of low socio-economic status include those who have never worked, have worked sporadically, or are engaged in organized crime. According to this classification, defendant deemed William Todd Lewis to be of low socio-economic status, although Lewis had worked as a truck driver consistently since 1971, had earned $400 per week, and was married to a woman who owned her own house and car. Similarly, defendant classifies Samuel Mincey as being of low socio-economic status, although Mincey had owned his landscaping business for five years, worked in construction, and had been a maintenance worker.\n\nDefendant's Table 18A illustrates the race-of-victim disparities in penalty-trial death-sentencing decisions after adjusting the culpability levels to the same extent that we find unacceptable in Table 18. Unlike in Marshall, this table demonstrates a more extensive set of relationships that are similar to the McCleskey comparisons; defendant evaluated the interaction between race-of-victim and race-of-defendant combinations, and assessed the influence of statutory and non-statutory factors such as socio-economic status and gender of defendant. Defendant argues that the results definitively show that at the penalty-trial phase, defendants who kill white victims are more likely than defendants who kill non-white victims to receive the death sentence. He presses the point although both his victims were African-American women. We produce the results below.\n\nCulpability Level White Victims Non-white Victims % Disparity\n\n1 .19 ( 6/32) .06 ( 3/50) 13\n\n2 .35 ( 8/23) .24 ( 9/37) 11\n\n3 .65 (15/23) .29 ( 4/14) 36\n\n4 .72 (13/18) .71 (12/17) 1\n\n5 .90 (27/30) .91 (20/22) -1\n\nAs with the race-of-defendant data in defendant's Table 18, the data in his Table 18A continues to reflect a disparity that generally decreases with additional cases. The Martini data add twenty-eight cases, four of which fall within culpability level four. The results are:\n\nCulpability Level White Victim Non-White Victim % Disparity\n\n1 .18 ( 7/38) .03 ( 2/59) 15\n\n2 .42 (10/24) .29 (14/48) 13\n\n3 .57 (13/23) .27 ( 3/11) 30\n\n4 .74 (17/23) .75 (12/16) -1\n\n5 .93 (27/29) .87 (20/23) 6\n\nOn examination, however, the tables do not show any disparity at Bey's level of culpability in the imposition of the death penalty because of the race of the victim. Moreover, Table 18A suffers from the same flaws as Table 18: the modified culpability ranges include cases that are dissimilar and that are based on inadequate measures of socio-economic status. In sum, we do not find from the data presented that the race of either the defendant or the victim plays an impermissible role in death sentencing. Likewise, we do not find that the socio-economic status of the defendant or the victim plays any such role.\n\nDefendant also argues that his sentence violates the United States Constitution because juries do not generally impose death sentences and because geographic disparities impermissibly affect death sentencing. We rejected those arguments in Marshall, supra, 130 N.J. at 188-206, and continue to find them unpersuasive.\n\n-V-\n\nConclusion\n\nAs in Marshall, we face a universe of cases that is too small to support reliable comparisons in some areas of the frequency approach and in our evaluation of racial disparities in sentencing. We also recognize that our method of comparison, such as the inclusion of cases in which the death sentence has been reversed, is not perfect. Overall, however, the statistical analyses and our own more traditional review of the cases support the Conclusion that defendant's death sentence is not disproportionate. Furthermore, defendant has failed to show that impermissible factors, such as race, have played a constitutionally-significant role in the imposition of the death penalty.\n\nThe imposition of the death penalty on defendant is not disproportionate.\n\nChief Justice Wilentz and Justices Clifford, O'Hern, Garibaldi, and Stein join in this opinion. Justice Handler has filed a separate Dissenting opinion.\n\nHANDLER, J., Dissenting.\n\nThe Court now decides that the death sentence imposed on a young African-American man is proportionate, and that he may therefore be executed.\n\nIn settling, once again, the fate of a capital defendant, the Court returns to the difficult issues that surround the proportionality review of a death sentence. Those issues are virtually intractable. Their insolubility reflects not a lack of will, energy, or acuity on the Court's part. Rather, it stems from the impossibility of evaluating the proportionality of a death sentence that is imposed under a capital punishment regime that is itself founded on conflicting and contradictory principles and is administered without any degree of consistency, much less uniformity.\n\nThe hopelessness of proportionality review is exemplified by this case. The Court's formulation and application of the standards for proportionality remain markedly vague and unworkable. The most serious deficiencies in the Court's proportionality review are evident, specifically, in (1) the continued use of a universe of cases that includes cases in which the death sentence has later been reversed; (2) the inherent subjectivity of the Court's principal methods for determining proportionality, frequency analysis, and precedent-seeking analysis and their arbitrary application; and (3) clearly the most significant and least tolerable defect in the Court's efforts today, the Court's failure to recognize the recurring indications that the imposition of the death penalty in New Jersey may be infected by racial bias. Those deficiencies of design and application deprive proportionality review of whatever faint chance it might have had to provide constitutional legitimacy to the imposition of a death sentence.\n\nI\n\nOn April 2, 1983, Cheryl Alston was sexually assaulted and murdered. Defendant, Marko Bey, was subsequently charged with and convicted of capital murder, felony murder, aggravated assault, and aggravated sexual assault. See State v. Bey, 112 N.J. 45, 51-52 (1988) (Bey I). On defendant's appeal from his sentence and convictions for the Alston murder, this Court overturned both. Id. at 51. After a second trial on the Alston killing, a jury convicted defendant of purposeful murder. Because defendant, at the time of Alston's murder, was seventeen-years old, he was deemed not subject to the death penalty and was therefore sentenced to life imprisonment with a thirty-year parole disqualifier for the murder.\n\nAbout three weeks after the murder of Cheryl Alston, on April 26, 1983, Carol Peniston was sexually assaulted and murdered. Defendant was taken into custody for the murder of Peniston on May 6, 1983. After a jury trial, defendant was convicted of capital murder, felony murder, kidnapping, aggravated assault, aggravated sexual assault, robbery, and theft. Id. at 133-34. A jury sentenced defendant to death for the murder of Peniston. On appeal, this Court affirmed defendant's convictions, but reversed and remanded for a new trial on sentencing.\n\nThe retrial of the penalty phase lasted seven days. The jury unanimously found that the aggravating factors outweighed the mitigating factors, and the jury sentenced defendant to death. Ibid.\n\nDefendant appealed the second sentence of death for the Peniston murder. State v. Bey, 129 N.J. 557, 568 (1992). Defendant raised objections to the fairness of the second penalty proceeding. He argued that the trial court had prevented him from developing or the jury from fully considering certain mitigating factors. These asserted errors included: prohibiting defense counsel from asking leading questions of defendant's mother, who resisted providing detailed or explicit accounts of her abuse of her son, id. at 593-94, and excluding the report of a State expert, Dr. Cooke, that largely corroborated the defense theory that defendant, in murdering Peniston, had acted out of aggression toward women, id. at 586-93.\n\nOver Dissents by two of its members, this Court rejected those contentions, either determining that no error existed or finding that although error was present, it was \"extremely unlikely\" that the error \"had the capacity to affect the jury's deliberations or produce an unjust result.\" 129 N.J. at 616.\n\nII\n\nThe Capital Punishment Act provides that at a defendant's request, \"the Supreme Court shall determine whether the sentence is disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant.\" N.J.S.A. 2C:11-3e. Although not required by the federal constitution, Pulley v. Harris, 465 U.S. 37, 104 S. Ct. 871, 79 L. Ed. 2d 29 (1984), proportionality review is intended as a safeguard against the arbitrary and capricious imposition of the death penalty.\n\nThis Court has acknowledged the \"entirely unique function\" of proportionality review in a capital proceeding. State v. Ramseur, 106 N.J. 123, 326 (1987). The Court in Ramseur held that because death is fundamentally different from all other punishments, a correspondingly greater need for reliability existed in determining whether death was appropriate in a given case. Ibid. Thus a practical and effective proportionality review is essential to the Court's continued insistence that the imposition of the death penalty can be carried out in fidelity to the constitutional norms that bind state power.\n\nProportionality review in New Jersey is intended to be offender rather than offense-oriented. The Court in State v. Marshall, 130 N.J. 109 (1992) (Marshall II), explained that the offender-oriented approach inquires whether the penalty in a particular case is disproportionate to the punishment imposed on others convicted of the same crime. The touchstone of the Court's analysis is ensuring that the death penalty is \"imposed fairly, and with reasonable consistency.\" Ibid.\n\nIn Marshall II, the Court concluded that proportionality review required a determination of deathworthiness that was informed as fully as possible. That determination called for the creation of a \"universe\" of cases sufficiently inclusive to allow a broad-based consideration of all relevant factors bearing on the deathworthiness of a homicide defendant, including both jury and prosecutorial decisions. Id. at 137.\n\nThe Court then settled on two complementary means of assessing the proportionality of the defendant's death sentence in relation to various sub-groupings of cases deemed to be similar to the defendant's. The first approach, generally referred to as \"frequency analysis,\" is composed of three discrete statistical methodologies each intended to give the Court a different perspective on the proportionality of the defendant's sentence relative to other similar cases. The controlling evaluative focus of the statistical approach is on the relative frequency with which a death sentence is imposed in cases deemed to be similar. Id. at 153. The second approach authorized by this Court in Marshall II, \"precedent-seeking analysis,\" relies on the statistical analysis as a point of departure. The precedent-seeking approach allows the Court, on a case-by-case basis, to compare similar cases according to a defendant's criminal culpability. Id. at 155.\n\nThe statistical and precedent-seeking approaches are intended to complement one another. Theoretically, they afford the Court a perspective informed both by empirical analysis and the more traditional manner of case-by-case, judicial assessment. That dual approach, combining statistical and precedential analyses, remains at the core of what the Court does in carrying out proportionality review.\n\nProportionality review is also designed to provide a window through which the Court can monitor the administration of the death penalty in New Jersey. See Ramseur, supra, 106 N.J. at 327. In Marshall II, the Court articulated its strong concern about the influence that invidious factors, particularly race, might exert on the administration of the death penalty. 130 N.J. at 207-08. Proportionality review attempts to respond to that concern. In this regard it should be noted, however, that the Court's authority and duty to guard against the presence of certain invidious factors, such as racial discrimination, in the administration of the death penalty do no flow from the Capital Punishment Act. The Equal Protection Clause of the Fourteenth Amendment and New Jersey's state constitution prohibit state action that discriminates on the basis of, inter alia, a person's race. Were a defendant to allege racial discrimination as a determinant of the decision to prosecute her for or convict her of a capital crime, or to sentence her to death, this Court independent of any statutory or constitutional mandate to conduct proportionality review -- would be constitutionally required to examine meticulously that allegation. The method of that examination would be very similar to, if not functionally indistinguishable from, what we now call \"proportionality review.\"\n\nConceptually, the methodology of proportionality review aspires to fulfill two concurrent purposes: (1) to ensure that a particular death sentence is not disproportionate; and (2) to ensure that invidious factors, especially race, are not at work in determining who receives death sentences. The failure of the Court's methodology to achieve those purposes is demonstrated in today's decision.\n\nIII\n\nAn issue of critical importance in the determination of capital-sentencing proportionality is the definition of the appropriate universe of cases from which to conduct judicial review. The bounds of that universe are effectively dictated by the objectives of proportionality review. Because the Court has recognized that proportionality review should serve to prevent \"any impermissible discrimination in imposing the death penalty,\" Ramseur, supra, 106 N.J. at 327, the race, sex, and socioeconomic status of the defendants, as well as the role of geography, by county, in sentencing decisions are factored into the definition of the universe. Further, because prosecutorial as well as jury decisions about deathworthiness are relevant to assessing whether invidious discrimination is at work, the Court concluded that the outer limits of that universe should include all death-eligible homicides whether or not prosecutors have chosen to prosecute them as capital crimes.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nOne enduring and troubling issue emanating from Marshall II is the Court's decision to include in its universe capital cases later reversed on appeal as death-sentence cases for purposes of proportionality review. Marshall II does not provide any extended explanation or defense of the Court's choice to treat reversed cases as death-sentenced. The Special Master, in dealing with that problem, constructed three possible responses: (1) treat all reversed cases as valid death sentences, (2) treat no reversed case as a valid death sentence, (3) proceed on a case-by-case basis, assessing the reliability of the original sentence for use in proportionality review. David Baldus, Death Penalty Proportionality Review Project, Final Report to the New Jersey Supreme Court, 61 (Sept. 24, 1991) (hereinafter Final Report). The Special Master recommended the third approach to the Court, noting that a presumption should exist against using death-sentences reversed because of penalty-phase errors. Id. at 63.\n\nThe Court today attempts a defense of the use of reversed death sentences in proportionality review. It does so using evasive language, noting that \"in the absence of an acceptable explanation, we continue to believe that a death sentence, even when reversed, represents a societal consensus concerning the deathworthiness of a defendant.\" Ante at (slip op. at 14) (emphasis added). The Court cites Marshall II, arguing that \"issues pertaining to procedural fairness, as distinguished from those that affect the substance of a crime, do not bear on a jury's determination of deathworthiness.\" Ante at (slip op. at 13) (emphasis added). Yet nowhere does the Court define what an \"acceptable explanation\" might be. Nor does it illuminate or even dwell on the obvious over-simplification that \"issues pertaining to procedural fairness * * * do not bear on a jury's determination of deathworthiness.\" Ibid.\n\nThe Court also notes that after reversal, prosecutors do not always re-try cases as capital crimes, observing that the reasons for that failure are \"varied and indeterminable.\" Ante at (slip op. at 14) (emphasis added). Nevertheless, the Court is content to draw the inference that \"we cannot conclude that in any given case that a life sentence resulted from the view that the defendant was not initially deathworthy, rather than, for example, the strength of the prosecutor's case.\" Ibid. That is a curious statement, and the Court does not bother to explain what it means by the \"strength of the prosecutor's case.\"\n\nI strongly criticized those same basic Conclusions as they were expressed in Marshall II, supra, 130 N.J. at 253-57 (Handler, J., Dissenting), and I find myself no more persuaded by the Court's explanations today. Reversed death sentences should be considered life sentences for the purpose of proportionality review. Id. at 253. My opinion is based on the premise that reversed death verdicts are, by definition, unreliable indicators of deathworthiness.\n\nThe irrationality of using reversed death sentences in proportionality review should be obvious. Yet the Court persists in indulging what I have termed an \"unfathomable irony\" whereby a reversed sentence, by definition too unreliable for use in sentencing a defendant, is nonetheless used collaterally against yet another defendant on proportionality review. Ibid. The infirmity of the Court's reasoning stems from its insistence that a defendant's \"deathworthiness\" is somehow distinguishable from the final legitimate verdict reached in that defendant's case.\n\nTo justify the use of reversed death sentences in proportionality review, the Court draws a facile but radically unsound distinction between \"procedural fairness\" and \"the substance of the crime.\" Ante at (slip op. at 13). The Court intimates that a jury's determination of a defendant's deathworthiness is somehow separable from the rules that structure the jury's deliberative process. Nothing could be more at odds with the soul of capital-murder jurisprudence as it has evolved in the post-Furman era. The moral logic, such as it is, behind the continued constitutionality of the death penalty is the belief that deliberative procedures can be structured reasonably to ensure that the death penalty is not imposed arbitrarily, i.e., that only those who are truly \"deathworthy\" receive death sentences. See Ramseur, 106 N.J. at 183 (commenting on Furman). That logic insists that both the procedural structure and substantive quality of a jury's deliberations are integral to the ultimate constitutionality of a death sentence. Realistically, procedural fairness and substantive culpability are interwoven throughout the prosecution of a capital case; the sentencing process starts with the qualification of the very first juror.\n\nEven the most cursory review of our case law since Ramseur indicates our efforts to refine our capital-murder doctrine to ensure that only the truly deathworthy are able to receive a death sentence. See State v. Clausell, 121 N.J. 298, 345-46 (1990) (requiring that juries be informed of legitimacy and acceptability of non-unanimous, non-death-deserving verdict at the penalty trial); State v. Gerald, 113 N.J. 40, 85 (1988) (requiring that to be death-eligible, defendant must have intended to kill, not merely to have inflicted serious bodily injury); State v. Williams, 113 N.J. 393, 453-54 (1988) (reversing death sentence because prosecution relied on victim-impact evidence); State v. Bey, 112 N.J. 123, 162-77 (1988) (requiring reversal if Court incorrectly instructed jury concerning finding and weighing of mitigating factors); Ramseur, supra, 106 N.J. at 211 (narrowing grounds for c(4)(c) aggravating factor to infliction of severe suffering). Those decisions reflect more than mere procedural tinkerings. They reflect continuing consideration of the factors that appropriately determine deathworthiness.\n\nThe Court misunderstands the unbreakable link between the structure that frames the jury's deliberative process and the substantive standards that inform its ultimate determination of deathworthiness. Its crude distinction between substance and procedure erodes the very foundation of the death penalty's constitutionality -- that is, the belief that truly deathworthy defendants can be identified by juries if they are given a deliberative structure within which their discretion is \"suitably directed and limited so as to minimize the risk of wholly arbitrary and capricious action.\" Gregg v. Georgia, 428 U.S. 153, 189, 96 S. Ct. 2909, 2932, 49 L. Ed. 2d 859, 883 (1976) (Stewart, Powell, and Stevens, JJ.). Death sentences are reversed because at some point the carefully constructed environment of a capital-punishment prosecution has been contaminated, whether by procedural or substantive fault, thereby undermining the soundness and impugning the reliability of the jury's ultimate determination of deathworthiness.\n\nThe Court \"acknowledges\", as, at a minimum, it must, that a reversed death sentence is \"a less persuasive indicator of deathworthiness\" than an affirmed death sentence. Ante at (slip op.at 15). It leaves us totally unenlightened, however, as to why such a problematic indicator of death worthiness should be used to justify the death sentence of another defendant.\n\nAt the very least, the Court should impose a rebuttable presumption that reversed death sentences are invalid determinations of deathworthiness. That approach was endorsed by the Special Master. He expressed the opinion that some reversed death sentences might be salvageable for use in proportionality review especially if, on re-trial, another death sentence was imposed. Final Report at 61-62. The Special Master suggested that the Court analyze each reversed sentence proposed for use in proportionality review to determine if the error requiring reversal impugned the reliability of the original sentence. Ibid. Yet here the Court inverts the structure of Proof inherent in the Special Master's proposal. The Court states that \"defendant does not explain why some errors that have caused us to reverse the death sentence necessarily reflect on the jury's ability to assess the defendant's deathworthiness.\" Ante at (slip op. at 13-14). With due respect, at a bare constitutional minimum, the Court should explain and the State should bear the burden of demonstrating why errors requiring reversal of a death sentence do not necessarily reflect on deathworthiness.\n\nThe Court itself concedes the dramatic impact that excluding reversed death sentences would have on its exercise of proportionality review. Ante at (slip op. at 12). Of the seven other prior-murder capital cases in the universe, all seven were reversed for errors of one kind or another, leaving Marko Bey as the only prior murderer to be sentenced to death.\n\nThe Court peremptorily reaches out to note that the fact that Marko Bey is the only prior murderer finally sentenced to death would not compel a finding that his sentence was disproportionate. Ibid. Whatever the merits of that hypothetical Conclusion, that case is not before the Court. Because the Court persists in following a course that contradicts the basic principles of capital-murder doctrine and common sense, Bey is condemned by a proportionality review that uses as its primary feature comparison to seven other cases in which verdicts of death have been rejected by this Court as unreliable. The Court's continued use of reversed death sentences dooms its proportionality review from the start.\n\nIV\n\nThe Court's Conclusion that defendant's death sentence is proportionate is the end of a process of review that is itself incoherent. The inherent subjectivity of proportionality review, to which the Court so readily admits, ante at (slip op. at 11, 14, 36, 44), is exacerbated by the Court's flaccid treatment of the grave methodological problems apparent in both its frequency analysis and precedent-seeking review.\n\nA.\n\nThe Court's application of frequency analysis reveals a palpable bias favoring the proportionality of a death sentence. The Court engages in that analysis without a settled standard or perception of what constitutes a high or low predicted frequency of death. Consequently, it inevitably ends up engaging in a form of reasoning that is little more than a selective and convenient rationalization of proportionality.\n\nTheoretically, frequency analysis operates according to a basic controlling principle, namely, that \"'[a] death sentence is comparatively excessive if other defendants with similar characteristics generally receive sentences other than death for committing factually similar offenses.'\" Marshall II, supra, 130 N.J. at 153-54 (quoting Tichnell v. State, 468 A.2d 1, 17 n.18 (Md. 1983)) (alterations in original). The higher the frequency of a death sentence among a comparison group, the more certain the determination that the sentence is proportionate.\n\nThe Court has understandably refused to employ a precise numerical cut-off in determining proportionality. Yet it refuses to state, even in general terms, what a high or low frequency might be. The Court contents itself with what it terms a \"general standard.\" Ante at (slip op. at 19). The Court rests secure in the notion that \"a standard that applies generally is the antithesis of one that applies arbitrarily.\" Ibid. But what does \"generally\" mean? What could it reasonably mean? In common parlance, if something generally occurs then it happens more often than not. That would imply at least a fifty percent threshold. Yet the court quite clearly states that \"generally\" does not require a threshold rate over fifty percent. Ante at (slip op. at 19).\n\nThe Conclusion to be drawn from the Court's use of a \"general standard\" is that it simply does not have or is unwilling to announce a pre-existing standard for determining high or low frequencies of death sentence imposition. The Court's refusal to recognize its own ambivalence only serves to deepen the confusion surrounding its application of frequency analysis with the result that the Court's assessments based on frequency analysis appear perfunctory and wholly unconvincing.\n\nThe absence of a clear standard invites manipulative reasoning that inevitably tilts toward the Conclusion that a sentence is not disproportionate. That is especially so when, as is the case here, frequency analysis is given such a subservient role in comparison to precedent-seeking analysis. The Court's now persistent refusal to clarify the nature of the relationship between frequency analysis and precedent-seeking analysis creates a situation in which the Court has entirely too much leeway to pick and choose among the results of the various tests.\n\nThe point is not to suggest that the Court adopt a precise numerical cut-off. Rather, the Court should come to a rough Conclusion, before it begins to analyze the statistical data that make up frequency analysis, about which general range of frequencies are low and which are high. If the Court, as here, first assesses where defendant falls and then determines if that statistical ranking represents a high or low enough frequency, the sense that the Court is merely using the statistics to vouch for a preconceived, subjectively-comfortable Conclusion about proportionality is unavoidable. Obviously, if a defendant's ranking falls at the extremes (high or low), those concerns are minimal, but in cases, such as this one, in which defendant's rank falls roughly in the middle, those concerns become pronounced.\n\nA frequency analysis of defendant's sentence reveals that death-sentencing frequencies for cases similar to his range from less than ten percent to about sixty percent. Given that that amounts to a \"toss of the coin,\" as defendant argues, the Conclusion should be that his death sentence is disproportionate. Minimally, the inconclusive frequency of death-sentencing in cases such as defendant's bespeaks the susceptibility of such cases to impermissible factors such as racial discrimination. See Discussion infra at (slip op. at 34-35).\n\nFalling as defendant does in the mid-range range of predicted frequencies of death sentence imposition, he is peculiarly vulnerable to the ad hoc character of this Court's frequency analysis. The Court's analytical failure with respect to frequency analysis serves only to further devalue the already scant protections defendant is afforded by frequency analysis. Although originally designed as the more objective of the two methods that make up proportionality review, frequency analysis as applied by the Court does little more than set the stage for whatever subjective determination might be made under the precedent-seeking approach.\n\nB.\n\nThe Court has acknowledged that it relies more heavily on precedent-seeking analysis. Unfortunately, as designed by Marshall II, and most especially as practiced by the Court today, precedent-seeking analysis is woefully inadequate to its task.\n\nThe ostensible virtue of precedent-seeking analysis is that, unlike a statistically-based frequency analysis, it employs a more traditional form of judicial reasoning. The Court assesses the proportionality of a defendant's death sentence by seeking out patterns of common facts and circumstances that inform a comparative judgment about the relative culpability, and thus the deathworthiness, of a particular defendant. The inherent subjectivity of that approach is undeniable. The Court posits that subjectivity as a welcome antidote to the sterile and deterministic nature of statistical analysis. Thus the Court gamely asserts that during precedent-seeking review, it comes to meet the \"real people involved in defendant's and similar cases.\" Marshall II, supra, 130 N.J. at 154.\n\nAs with the standardless use of frequency-analysis, the Court's precedent-seeking review is rife with rationalization posing as objectivity. The Court quite reasonably suggests that age -- a defendant's youthfulness -- need not axiomatically correspond to a decreased culpability, ante at (slip op. at 31-32), although it does concede that age \"often mitigates a defendant's culpability.\" Ante at (slip op. at 65). The Court does not speculate about why this jury was unimpressed by defendant's youth. It is content with the proposition that the jury's failure to find age as a mitigating factor does not make its determination per se aberrant. Ibid.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nAlthough Bey's youthfulness in itself, may not have constituted a mitigating factor, the Court inexcusably treats that mitigating factor in a vacuum without the slightest appreciation that separate mitigating factors, particularly in the weight ascribed to them, may be viewed by a jury as interrelated. Thus, defendant's youthfulness might serve to strengthen the mitigating effect of the evidence of the abusive childhood he had endured and, conversely, the abuse he had experienced as a child could greatly affect the significance to be attributed of his youthfulness.\n\nThe Court rightly notes that the experience of childhood abuse is, unfortunately, a trait common to many defendants faced with a death sentence. Ante at (slip op. at 65). Indeed, the evidence adduced at Bey's penalty trial -- his mother's alcohol-abuse, the abandonment of his family by his father, the frequent and savage beatings, the emotional deprivation and consequent alienation, the early dependence on drugs and alcohol and its resultant destruction of mental and social capacities, and finally the maladaptive resort to violence -- is a litany all too familiar to any sentencing Judge. Yet what distinguishes Bey's case is his youth at the time of his crimes. He was not yet eighteen at the time he committed them. That his behavior is horrific and deserving of severe punishment is not in question. What ought to be in question, however, and is not, is whether relative to other defendants who have experienced similar abuse, Bey's youthfulness distinguishes him as less culpable. The Court's failure to address that question marks yet another in a series of seemingly arbitrary determinations that characterize this Court's use of precedent-seeking review.\n\nThe Court's shortsightedness with respect to the correlation between defendant's age and the evidence of the abuse he suffered as a child takes an even more saturnine form in the manner in which the Court distinguishes defendant's case from that of James Koedatich.\n\nBy the Court's own standards, Koedatich, a prior murderer with a pattern of sexually assaulting his victims, is the ideal comparison case. Ante at (slip op. at 65). At pains to differentiate Koedatich, who received a life sentence, the Court quite brazenly asserts that he \"unlike Bey, offered additional, uncontroverted evidence to demonstrate the impact of the abuse and violence [he had] suffered.\" Ante at (slip op. at 66).\n\nThe Court's attempts to distinguish Bey based on the fact that Koedatich offered more and better evidence of child abuse expose the radical contradictions that permeate our capital punishment system. More disturbing, they show the Court's willingness to paper over its own role in weakening the evidence of Bey's abusive childhood.\n\nBey argued forcefully on direct review that the trial court erroneously had prevented him from fully adducing evidence related to the abuse he had suffered as a child. The trial court refused to allow into evidence the Cooke Report which, although prepared by a psychologist retained by the prosecution, addressed Bey's mental and emotional condition at the time of the murders and went to the core of his defense. In particular, the Cooke Report linked the abuse Bey had suffered as a child to his rage and violence against his victims. It thus \"demonstrated the impact of the abuse and violence [he had] suffered,\" which is precisely what the Court, now conducting proportionality review, says is lacking in the evidence that was adduced with respect to Bey's childhood. Ante at (slip op. at 66). Thus, exclusion of that evidence was, at one point on direct appeal, harmless. Yet, currently, before the same Court conducting proportionality review, the absence of that evidence is a factor that supports the proportionality of a death sentence. What was once harmless is now lethal.\n\nIn the same vein, Bey's lawyers were refused permission to treat Bey's mother, a defense witness understandably reluctant to give detailed testimony about the abuse she had inflicted on her son, as a hostile witness. The sentencing court's ruling prohibited defense counsel from asking Ms. Bey leading questions. Blocked, defense counsel was unable to elicit detailed accounts of the manner, severity, and frequency of the abusive incidents in the young Marko Bey's life. Now the Court affirms the proportionality of Bey's death sentence in part because of his failure to adduce sufficient evidence of abuse that distinguishes him as more culpable than James Koedatich.\n\nThrough a series of subjective judgments that ignore the impact of the Court's own prior harmless-error rulings, the Court deprecates glaring indications of jury aberrancy. Although Bey is the youngest capital defendant yet to face the Court, no juror found the \"age\" mitigating factor. Although Bey produced substantial, albeit incomplete, evidence of abuse during childhood, only two jurors found the \"mental disturbance\" mitigating factor. Rather than test those \"hypotheses\" of aberrancy by comparing Bey's sentence with those of young defendants or defendants where the mental disturbance factor was found, or even better, where both were found, the Court instead discounts the relevance of those factors and concentrates instead on a comparison of Bey to the narrow class of prior murderers. Then, when finally confronted with Koedatich, Vasquez, and Booker, all prior murderers, who, according to the Court, exhibit similar levels of culpability, ante at (slip op. at 68), all of whom received life-sentence, the Court distinguishes them because, as noted, Koedatich offered more and better evidence of child abuse, Vasquez's parent's pled for his life, and Booker's murderous spree was fueled by substance abuse. Ibid. Yet the narrative summaries reveal that both Booker and Koedatich killed three persons, and both were significantly older than Marko Bey, while Vasquez, who strangled a thirteen-year old child to death, denied any mental-health problems. See Appendix, infra at (slip op. at 58).\n\nTo bolster its attempts to distinguish Koedatich's case from that of defendant, the Court indulges in a form of argumentation more appropriate to journalism than a judicial decision. Koedatich's life sentence was the result of a lone hold-out juror. The Court suggests that this juror \"prevented\" the remaining eleven of the opportunity to return a death verdict implying that somehow Koedatich, within a single juror's vote of being sentenced to death, is really more deathworthy than not. Ante at (slip op. at 70). The Court's observations and its studied implication border on the outrageous. Jury unanimity is essential to a determination of deathworthiness. Ramseur, supra, 106 N.J. at 301. Neither our statute nor the state or federal constitution permits a classification of defendants who are \"almost deathworthy.\" Yet is that not precisely what the majority does in its attempts to distinguish James Koedatich?\n\nIt is simply wrong for this Court to suggest, let alone rely on and give legal force to, the notion that some non-deathworthy defendants are less deathworthy than others. Such thinking is dangerously misconceived. It is totally at odds with what is a fundamental condition of deathworthiness, namely, the unanimous concurrence of qualified jurors that the defendant's life shall be forfeited. Resort to such an argument betrays the Court's enduring confusion about the basic constitutional norms that inform and regulate our capital punishment regime.\n\nThe Court's exercise of precedent-seeking review not only serves as a grim reminder of the Court's disastrous rulings in Bey IV, but also should impel the Court to consider the viability of the harmless-error doctrine as it is currently practiced in the review of capital cases. We see now quite clearly that error adJudged harmless at one stage of a capital case can materialize at yet another stage exerting substantial, perhaps dispositive, influence on subsequent determinations that bear directly on the imposition of a sentence of death.\n\nC.\n\nThe Court's decision today highlights the impossibility of harmless error analysis in the penalty trial of a capital case. Errors in a defendant's penalty trial that were adJudged harmless on direct review resurface in proportionality review where their effect can be incalculably harmful. This Court, having earlier determined certain errors to have been harmless because they were \"not clearly capable of producing an unjust result,\" State v. Bey, 129 N.J. 537, 591 (1991) (Bey IV), now must confront the inescapable reverberations of its failure to foresee the continuing capacity of \"harmless error\" to contribute to an unjust result.\n\nTwo distinct Conclusions emerge from a consideration of harmless-error-review undertaken in light of the subsequent proportionality analysis done in this case. The first is that the Court's prior determination that errors in the penalty trial were harmless in terms of their capacity to affect the sentence imposed on the defendant is inaccurate. The second, less obvious, although no less damning, Conclusion to be drawn from the Court's exercise of proportionality review is that harmless-error analysis, traditionally understood, is not appropriate or feasible in the penalty phase of a capital case.\n\nFrom the very start, the problems inherent in the application of conventional harmless-error analysis to the penalty phase of a capital case have been evident. The United States Supreme Court first allowed the application of harmless-error analysis to errors made in the penalty phase of a capital case in Satterwhite v. Texas, 486 U.S. 249, 108 S. Ct. 1792, 100 L. Ed. 2d 284 (1988). Even as the Supreme Court sanctioned the use of harmless-error review, it felt compelled to note that the \"evaluation of the consequences of an error in the sentencing phase of a capital case may be more difficult because of the discretion that is given to the sentencer. \" Id. at 258, 108 S. Ct. at 1798, 100 L. Ed. 2d at 295 (emphasis added); see also Clemons v. Mississippi, 94 U.S. 738, 754, 110 S. Ct. 1441, 1451, 108 L. Ed. 2d 725, 742 (1990) (\"In some situations, a state appellate court may conclude that peculiarities in a case make appellate reweighing or harmless-error analysis extremely speculative or impossible.\"). Justices Marshall and Brennan, Concurring in Satterwhite, argued that harmless-error review was impossible in the penalty phase because unlike a traditional guilt-phase determination, a jury's decision in the penalty phase is a \"profoundly moral evaluation of the defendant's character and crime.\" 486 U.S. at 261, 108 S. Ct. at 1800, 100 L. Ed. 2d at 297 (Marshall, J., Concurring). Given the complex nature of the jury's deliberation in the penalty-phase, \"predicting the reaction of a sentencer . . . on the basis of a cold record is a dangerously speculative enterprise.\" Ibid.\n\nThe conceptual basis of harmless-error review -- that a court can determine the effect of the error on the verdict-- is not viable in a penalty-phase trial that requires juries to make value determinations rather than simply to find facts. Linda E. Carter, Harmless Error in the Penalty Phase of Capital Case: Doctrine Misunderstood and Misapplied, 28 Ga. L. Rev. 125, 149 (1993) (Hereinafter \"Carter\"). \"The individual choices jurors make [in the penalty-phase trial] about the existence of mitigating circumstances coupled with the unique weighing of factors creates a proceeding fundamentally different from the guilt trial.\" Ibid.\n\nMoreover, traditional harmless-error analysis cannot be fitted to the distinctive nature of a penalty-trial proceeding. The typical harmless-error inquiry is focused on the amount of evidence adduced to support a particular Conclusion. Carter, supra, 28 Ga. L. Rev. at 159. Thus, on direct review of defendant's case, the Court determined that the exclusion of the Cooke Report and the refusal to allow the defense to elicit the testimony of Ms. Bey as a hostile witness were harmless errors, in part, because they constituted cumulative evidence. See Bey IV, supra, 129 N.J. at 590 (\"Viewed in the context of the medical testimony at trial, Dr. Cooke's report offered compelling but cumulative evidence of the defendant's background and personality disorder.\") (emphasis added); id. at 594 (\"Moreover, Mrs. Bey's testimony was cumulative[.]\"). Such a quantitative review does not, indeed cannot, take into account the complex value judgments that constitute juror determinations in the penalty-phase.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e In the penalty phase of a capital case, where the sentencer's discretion contemplates the influence of moral values, see McCleskey v. Kemp, 481 U.S. 279, 294, 107 S. Ct. 1756, 1767, 95 L. Ed. 2d 262, 279-80 (1987) (\"Each jury is unique in its composition, and the Constitution requires that its decision rest on innumerable factors.\"), the Court must consider infinitely more than what a \"reasonable\" juror might do. See Comment, Deadly Mistakes: Harmless Error in Capital Sentencing, 54 U. Chi. L. Rev. 740, 756 (1984).\n\nA defendant's right to proportionality review further debilitates the prospects that a court can ever fairly apply conventional harmless-error analysis to errors occurring in the penalty phase of a capital case. We have acknowledged the potential prejudice that can result from the fact that the evidence adduced (or excluded) at one phase of a capital-murder prosecution will overlap another phase of the prosecution. State v. Erazo, 126 N.J. 112, 133 (1991) (noting that evidence introduced at guilt phase of capital trial has an inescapable impact on jury's deliberation in penalty phase). In most cases, the prosecution moves guilt-phase evidence into the record for the penalty trial. But even if the State does not explicitly incorporate guilt-phase evidence into the penalty-trial, \"the danger abides that the jury will rely on it during the penalty-phase deliberations.\" Ibid. The flow of evidence from the guilt to the penalty phases of a capital trial is an inescapable problem in any system, that uses, as we do, a bifurcated trial structure but sits the same jury for both the guilt and the penalty phases. By virtue of the Court's decision today, that evidence can now slide over into proportionality review. Ante at (slip op. at 42). Thus errors made at the guilt and penalty phases are swept along into proportionality review.\n\nMy point is not that the Court is necessarily wrong in limiting its precedent-seeking review to the evidence before the jury that actually rendered the death sentence, but rather that in accepting the evidence on the record before the original jury, the Court has an obligation to recognize that it accepts whatever errors (of inclusion or exclusion) might have been made in assembling that body of evidence. Moreover, the Court must recognize that its prior harmless-error rulings cannot properly account for the effect those errors might have on the subsequent determination of the defendant's sentence's proportionality.\n\nIn my view, a court that on proportionality review chooses to limit its review to the \"evidence\" before the jury must be willing to re-consider its prior harmless-error determinations of penalty-phase error to account for such effect that those errors may have on the proportionality determination. Further, a court must conclude that given the complex value determinations required of a jury at the penalty phase and given the impossibility of predicting the likely effects of evidentiary errors on proportionality review, conventional harmless-error analysis of penalty-trial errors is unworkable.\n\nThe values that lay behind the harmless-error doctrine -- finality, conservation of judicial resources, and the determination not to allow irrelevant error to compromise the integrity of the judicial process -- are substantial, but by force of reason and morality, they are dwarfed by the \"awesome severity of a death sentence.\" Satterwhite, supra, 486 U.S. at 264, 108 S. Ct. at 1801, 100 L. Ed. 2d at 298 (Marshall, J., Concurring). We see in today's decision the insidious effects of trial errors sanctioned by a harmless-error analysis that is ill-fitted to the nature and purposes of a penalty trial and cannot begin to anticipate its implications for a subsequent proportionality review.\n\nVI\n\nThe role that comparative proportionality review plays in preventing invidious discrimination is perhaps its most significant one. The United States Supreme Court has recognized that when state procedures provide adequate protections in the prosecution of a capital case, proportionality review is not required by the federal constitution. Pulley, supra, 465 U.S. at 45, 104 S. Ct. at 876, 79 L. Ed. at 37. However, despite the lack of a federal constitutional requirement, our death-penalty statute affords capital defendants the right to seek proportionality review of their sentences. N.J.S.A. 2C:11-3(e). Indeed, when the Legislature was considering the present capital-sentencing scheme in 1982, the Attorney General himself recognized the importance of guarding against invidious discrimination in sentencing defendants to death, urging the Legislature \"to make sure that [death] sentences are being meted out in a fair, even-handed way throughout the State, and that we do not have either classes of individuals or areas in the State which appear to be arbitrary one way or other.\" Joseph H. Rodriguez, Michael L. Perlin \u0026 John M. Apicella, Proportionality Review in New Jersey: An Indispensable Safeguard in the Capital Sentencing Process, 15 Rutgers L.J. 399, 429 n.203 (1984).\n\nThe Court has yet to confront the question whether proportionality review is required under our State Constitution. That, I submit, is a question of overarching magnitude the answer to which cannot be long postponed. Yet, as noted, supra, at 7, even without a constitutional mandate to exercise proportionality review, the Court has an independent obligation to review the capital-punishment system to ensure that it is not infected by invidious discriminatory factors. The Court has stated clearly that \"'discrimination on the basis of race, sex, or other suspect characteristics cannot be tolerated.'\" Marshall II, supra, 130 N.J. at 135 (quoting Ramseur, supra, 106 N.J. at 330) (alteration in original). With regard to race, the Court has stated unequivocally:\n\nWe have committed ourselves to determining whether racial and ethnic bias exist in our judicial system and to \"recommend ways of eliminating it wherever it is found. \" Hence, were we to believe that the race of the victim and race of the defendant played a significant part in capital-sentencing decisions in New Jersey, we would seek corrective measures, and if that failed, we could not, consistent with our State's policy, tolerate discrimination that threatened the foundation of our system of law.\n\n[Id. at 209 (citations omitted) (emphasis added).]\n\nCharges of racial bias within our capital-sentencing system are not new. The Special Master's Report, noted in Marshall II, suggested that a discrepancy in capital-sentencing rates may correlate to the race of the defendant or the race of the victim. 130 N.J. at 207. The Court, in Marshall II, however, rejected the defendant's race discrimination claims because they were not \"relentlessly documented.\" Id. at 213. According to the Court, the disparities were not consistently shown -- that is, the data that indicated race-of-defendant disparities did not show race-of-victim effects in the penalty-trial decisions, and the race-of-victim effects in cases advancing to trial were less stable than the effects observed for the race-of-defendant variable in the penalty trial decisions. Id. at 212-13. This Court announced that it was not yet convinced that the effects of racial discrimination were systemic. Id. at 213. Clearly, however, the Court was put on notice of preliminary indications that racial discrimination might well be at work in determining the rates at which certain cases were charged as capital crimes, and in determining the rates at which death sentences were actually imposed.\n\nAccording to the Court in Marshall II, the Public Defender's most compelling argument was that for cases within the mid-range of aggravation, an African-American had a sixty-four percent greater risk of being sentenced to death. The Court, however, accepted the Special Master's Conclusion that those results were not conclusive. The Special Master advised that \"more work will be required to determine if they persist under closer scrutiny and alternative analyses.\" Final Report, supra, at 101. The Court concluded by stating that the statistical indices of discrimination were \"not sufficiently alarming to compel a Conclusion of substantial discriminatory effect.\" Marshall II, supra, 130 N.J. at 212.\n\nDefendant now claims that the tentative findings, noted but found inconclusive in Marshall II, have now been verified by further analysis. In my view, the Court cannot disregard or discount the evidence that defendant has produced demonstrating the heightened risk of death sentencing for African-American defendants, particularly at the mid-range levels of culpability.\n\nDefendant bases his arguments on an updated version of the data base used by the Special Master in Marshall II. Forty cases have been added to the original data set. In addition, defendant's experts, Messrs. Weiner and Mills of Princeton University, prepared their own tables to study the question of racial bias. To test the hypothesis that race was responsible for the disparity in sentencing, the defense experts used rigorous statistical techniques to eliminate other variables that could possibly explain the variations attributed to race.\n\nDefense experts updated Table 18 and found that the overall racial disparity first noted in Marshall II has continued at a statistically significant level. That disparity is especially strong at culpability level four. The disparity remained significant, although not as great, at culpability level three, and disappeared at the highest degree of culpability, level five.\n\nDefendant argues that whether one relies on the Special Master's tabulations or defendant's own, the effect of impermissible factors -- such as race -- is most pronounced in cases of \"mid-range\" culpability, i.e., cases in which the death penalty is imposed roughly fifty-percent of the time or less. That finding has considerable support from the academic work of the Special Master, see, e.g., David Baldus et al., Equal Justice and the Death Penalty 14 (1990) (citing work of Baldus demonstrating that \"the magnitude of the impact of racial factors on the sentencing outcome varies with the culpability level of the cases\"). Those findings also comport with common sense. If invidious racial discrimination enters into a capital-sentencing system, it is likely to do so in the areas in which prosecutorial or juror discretion is greatest. Where the relative culpability of a defendant is either extremely high or extremely low, the effect of prosecutorial or jury discretion is minimized, i.e., the likely sentencing outcome is fairly obvious. But in cases of mid-range culpability, in which outcomes vary consistently between life and death, the opportunity for invidious factors to play a role is greater.\n\nAlthough it does not dispute defendant's results -- including the shocking sixty-five percent disparity -- the Court treats defendant's analysis dismissively. It attacks defendant's claims primarily because of the broad expanse of cases in defendant's re-worked culpability level four. Ante at (slip op. at 78).\n\nThe Court is correct in focusing its assessment on the sixty-five percent disparity at culpability level four. Theoretically, all cases grouped at the same culpability level share roughly the same likelihood of receiving a death sentence. The Special Master originally divided the culpability levels into five bands covering ranges of twenty percentage points. Thus culpability level one includes all cases with a 0.00 to .19 predicted frequency, and level two includes .20 to .39 and so on. Because so few death sentences are imposed relative to the death-eligible universe, when the cases are plotted on those levels, the vast majority are grouped at level one. Indeed, under the Special Master's model only seven cases end up in level four.\n\nThe operative hypothesis about race as an invidious factor is that it creeps into the discretionary elements of the system (prosecutorial discretion and juror discretion) in the marginal cases. If racial disparity is going to occur, one would expect it to rear its head not in the obvious cases (extremely high or extremely low predicted frequencies) but in the so-called mid-range cases, between roughly .30 and .70 predicted frequency of death-sentence imposition.\n\nThe Special Master recognized that to test for race, one would have to group mid-range cases together. Hence, instead of setting the bands at ranges of twenty percent of expected frequency, the Special Master arranged the entire pool of cases in order from lowest frequency to highest, and then to ensure an adequate number of cases for purposes of assessment, fixed the culpability levels at an even number of cases at each level. At the re-worked culpability level four a wide sweep of predicted frequencies now exists from .14 to .89 among the twenty or so cases grouped there.\n\nDefendant argues that those mid-range cases, omitting the extremely low and extremely high predicted frequencies, are the appropriate test pool for race. The Court reasons, however, that by expanding the sweep of level four, defendant is no longer comparing similar cases. Ante at (slip op. at 78).\n\nThe Court's position is not without logic as far as it goes. Given such a wide sweep of predicted frequencies, if all the African-American defendants who received a death sentence are at the upper level of that range, i.e.,.70 to .80, and all the whites happen to be at the lower ranges, i.e.,.14 to .30, then relative culpability, not race, explains the disparity. What the Court does not do, however, is examine the range of the cases within culpability level four to see if such a clustering occurs at the upper or lower ends of the scale. That can be done by listing the cases assigned to level four, according to who received death and who life, and including their race, viz:\n\nDEFENDANT Estimate: Race: Sentence:\n\n1. M. Bey (1)*** 0.19 black death\n\n\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\n2. S. Monturi (2) 0.21 white life\n\n3. A. Perry *** 0.22 black death\n\n4. D. Pitts *** 0.24 white death\n\n5. Br. Purnell 0.36 black death\n\n6. Jm. Koedatich 0.40 white life\n\n7.. M. Manfredonia 0.42 white life\n\n8. S. Monturi (1) 0.42 white life\n\n9. T. Rose 0.42 white life\n\n10. Wm. Engel 0.43 white/Hisp. life\n\n11. Jos. Guagenti 0.46 white life\n\n12. Geo. Booker (2) 0.47 black life\n\n13. R. Kise (1) 0.48 white life\n\n14. Geo. Booker (1) 0.53 black life\n\n15. Jac. Hightower 0.53 black death\n\n16. M. Melendez 0.54 white/Hisp. life\n\n17. S. Moore (1) 0.55 black death\n\n18. S. Moore (21) 0.55 black death\n\n19. Jm. Hunt 0.68 black death\n\n20. L. Reyes 0.72 white/Hisp. life\n\n21. W. Johnson (1) 0.79 white life\n\n22. M. Bey 0.82 black death\n\n23. R. Kise (2) 0.85 white death\n\nAlthough the range theoretically begins at .14, in fact, the first case is .19. At an anecdotal level, note that three black defendants, Marko Bey, Arthur Perry, and Braynard Purnell, with the first; third; and fifth-lowest predicted frequencies, all received death sentences. Overall, of the twenty-three cases, eight of ten (8/10) black defendants received the death penalty, but only two of thirteen (2/13) white defendants received death. The most revealing information comes if one accepts the Court's argument that the range is too big and limits analysis to those cases that fall between .30 and .70, which could be considered a fair mid-range. That sub-grouping has seven black defendants, five of whom received a sentence of death. It also has eight white defendants, all of whom received life sentences. Thus in the most marginal cases, in which one would expect roughly a fifty-fifty chance of receiving a death sentence, one finds that blacks received the death penalty in five out of seven cases and whites in none. Thus, even when the focus of analysis is on the true mid-range cases, those between .30 and .70 predicted frequency of death sentencing, an obvious disparity between races is visible.\n\nBased on defendant's showing, I am convinced that the racial disparity alleged by defendant at culpability level four is significant and worthy of this Court's most conscientious and thorough consideration. Yet, the Court exhibits both an uncharacteristic timidity in light of its oft-stated judicial obligation to confront the possibility of invidious racial discrimination and an unwillingness to examine rigorously arguments that credibly and cogently present that possibility.\n\nThe Court takes the easy route in concluding that too few cases exist from which to make a determination regarding the possible effects of racial discrimination, ante at (slip op. at 72). The problems associated with under-sized data pools permeate the whole of the Court's proportionality review. The inescapable fact remains that all the statistical analyses in this case are disadvantaged by under-sized data pools and consequently large margins for error. That statistical indeterminacy casts a shadow of doubt over the entire proportionality enterprise. The Court, however, determines that defendant alone should bear the burden of dissipating that doubt -- a determination that is at odds with the logic of proportionality review itself, which is premised on the notion that defendant has the constitutional right not to be subjected to disproportionate punishment. Moreover, the Court's placing of the burden of statistical doubt on the defendant contradicts its institutional role in ferreting out race-based discrimination in the administration of Justice and its independent responsibility to ensure that invidious discrimination plays no role in determining who receives a death sentence.\n\nSince Ramseur, the Court has warned that it would be vigilant for traces of racial bias in the system. Now confronted by evidence of racial bias, the Court quibbles with methodology and evinces an almost reactionary distrust of statistics. As the Court acknowledges, ante at (slip op. at 68), statistical analysis plays an essential role in assessing claims of racial discrimination. See Racial InJustice in the Senate, N.Y. Times May 13, 1994, at A-22 (criticizing members of Senate for refusing to endorse Racial Justice Act appended to House version of federal crime bill, which would expressly authorize statistically-based, racial discrimination studies by federal death-penalty defendants and without which it would not be possible to discover racial discrimination in the administration of the death penalty).\n\nThe question is not whether defendant has proved that racial discrimination is operative in our capital murder system, but rather, whether defendant's showing requires the Court to undertake further investigation and to suspend capital sentencing until allegations of racial discrimination can be thoroughly discounted.\n\nIn light of the Court's wholly inadequate response to the defendant's statistical arguments, its citation to McCleskey v. Kemp rings with irony. Unless the Court modifies its review of allegations of systematic racial discrimination, it subjects defendants like Marko Bey to the ultimate penalty while waiting for some unspecified quantum of proof that race is acting invidiously in our capital murder system. The Court suffers under the delusion that serious consideration of those allegations can be continually postponed. Time will eventually run out, as it did for Warren McCleskey.\n\nVII\n\nAs stated at the beginning, the grave inadequacy of the proportionality review at issue in this case is not the product of a Court lacking in insight or commitment to fairness. Nevertheless, the errors that infect this exercise of proportionality review reflect the fundamental incoherence of our capital murder jurisprudence. The Court's continued uncritical use of reversed death sentences, an irrationality of the first order, can be supported only by drawing an unfounded distinction between the basic fairness of the sentencing process and the validity of the outcomes of that process. Lacking a coherent and workable methodology, the Court over-relies on a precedent-seeking analysis, which is itself compromised by the harmless-error determinations made in the defendant's case on direct review. The Court's application of frequency analysis is driven by no more than intellectual convenience with little care given to the assessment regarding what is a high or low frequency and lax attention to its functional relationship to precedent-seeking review. Finally, and most disturbingly, evidence of the invidious effect of racial bias in determining who receives death sentences is basically ignored, once again turned aside as premature or inconclusive.\n\nToday's decision serves as further confirmation of the failure of our experiment with capital punishment. The Court's sincere aspirations for proportionality review cannot be squared with the problems inherent in an attempt to apply an abiding standard of fairness to the imposition of a death sentence. The lights of reason and our common humanity insist that we treat death differently. Sadly, and undeniably, the result of today's decision is neither rational nor humane. Marko Bey's now pending execution is bitter testament to the Court's collective failure to appreciate and respect the limits that inhere naturally in a society governed by law in which the exercise of governmental power is constrained by an insistence that the government act rationally, fairly, and with consistency, or not at all.\n\nThe Court's initial confidence that it could fashion a constitutionally legitimate process for imposing the death penalty, see Ramseur, supra, 106 N.J. at 331 (\"How we will resolve this paradox remains as yet fully unrevealed to us. We shall continue to labor on the process.\") has been shaken by the bewildering experience of proportionality review, the purposes of which, as evidenced by today's opinion, the Court little understands. I would not hesitate to venture a bet that few in today's majority would agree with the assurances expressed in Marshall II, that \"once defined . . . the process of proportionality review will not 'frustrate and confuse the Court'.\" 130 N.J. at 218.\n\nThe confusion so readily apparent in today's decision is the inevitable product of a futile endeavor: the quest to devise and to apply a standard of due process protection commensurate with the gravity of the sentence to be imposed.\n\nWe are, by now, inured to the import of the what has become cliched -- that \"'death . . . is . . . different. . . .'\" Ramseur, supra, 106 N.J. at 326 (quoting Lockett v. Ohio, 438 U.S. 586, 605, 98 S. Ct. 2954, 2965, 57 L. Ed. 2d 973, 990 (1978)). That phrase is more than a mere truism, however. It serves as the primary evaluative principle in our continuing consideration of the feasibility of a death sentence as a constitutionally valid punishment. We noted in Ramseur that proportionality review was to assist the Court in ensuring that \"'we have designed procedures [that] are appropriate to the decision between life and death.'\" 106 N.J. at 326 (quoting Pully, supra, 465 U.S. at 67-68, 104 S. Ct. at 888-89, 79 L. Ed. 2d at 52). The manifest failure of proportionality review as designed and exercised by this Court is now evident. Equally evident is the impossibility of a capital punishment regime that takes seriously the moral fact that death is indeed different.\n\nThe Conclusion is clear: the Court must either abandon its mission or accommodate itself to the juridical brutality of imposing death without due process protections commensurate to its awesome finality.\n\nThe by-now-familiar argument that the capital murder jurisprudence of the United States Supreme Court rests on two fundamentally incompatible goals was given renewed poignancy by Justice Blackmun's recent Dissent from the Supreme Court's denial of certiorari in Callins v. Collins, U.S. , 114 S. Ct. 1127, 127 L. Ed. 2d 435 (1994):\n\nRather than continue to coddle the Court's delusion that the desired level of fairness has been achieved and the need for regulation eviscerated, I feel morally and intellectually obligated simply to concede that the death penalty experiment has failed.\n\n[Id. at , 114 S. Ct. at 1129, 127 L. Ed. 2d at 438.]\n\nJustice Blackmun's Conclusion, coming as it does at the close of his long tenure on the Supreme Court, is based on his experiences in attempting, over twenty years, to reconcile the indispensable yet conflicting values of consistency and fairness, a task that he concluded was simply impossible.\n\nThe temptation to resolve the conflict by abandoning one value for another is ever-present and apparently irresistible to some. See Walton v. Arizona, 497 U.S. 639, 673, 110 S. Ct. 3047, 3068, 111 L. Ed. 2d 511, 541 (1990) (Scalia, J., Concurring in part and Dissenting in part) (\"I will not, in this case, or in the future, vote to uphold an Eighth Amendment claim that the sentencer's discretion has been unlawfully restricted.\") This Court, however, cannot escape, and should not evade, its obligation to assess the compatibility of our capital-murder regime with the principles of consistency and reliability that undergird our sense of Justice when the punishment is death. See Ramseur, supra, 106 N.J. at 185 (\"Sometimes conflicting, the two principles of consistency and reliability reflect the increased demands of accuracy and fairness, rising to constitutional dimension, in the implementation of this unique criminal sanction.\"); see also Louis D. Bilionis, Legitimating Death, 91 Mich. L. Rev. 1643, 1684-85 (1993) (arguing that state constitutions are force that can fill void left by Supreme Court's shortcomings).\n\nAs is painfully evident today, our proportionality review is wholly inadequate to aid in legitimating our State's oft-expressed desire to impose capital punishment. Absent that legitimation, the Court must with Justice Blackmun abandon its quixotic aspiration to reconcile the irreconcilable, or with Justice Scalia draw the Conclusion that, \"at least one of these judicially announced irreconcilable commands . . . must be wrong.\" Callins, supra, U.S. at , 114 S. Ct. at 1128, 127 L. Ed. 2d at 436 (Scalia, J., Concurring). Which would the Court renounce: fairness or consistency?\n\nLike Justice Blackmun, retired United States Supreme Court Justice Lewis Powell has also made public his view that constitutional administration of the death penalty is impossible. JOHN C. JEFFRIES, JR., JUSTICE LEWIS F. POWELL, JR., 452 (1994). Justice Powell, who cast the deciding vote in favor of executing Warren McCleskey, has since come to conclude that the death penalty cannot be decently administered and that continued attempts to enforce the death penalty will serve only to bring the law into disrepute. Ibid. Today's decision gives more immediacy to that fear.\n\nAs is nearly always true in a capital case, we are impelled to lavish enormous resources, both economic and intellectual, on a person who can lay precious little claim to our sense of compassion. We have, however, an obligation to rely on principle, the basic notion that governmental power can be exercised only in fidelity to the values of due process, values that increase as the punitive severity of governmental action escalates. How else can the cornerstones of our collective liberty be secured, unless we are willing to insist that they be sedulously applied on behalf of the least of us?\n\nThis Court should acknowledge that no death sentence can be affirmed by a process of review that is beset by inherent contradictions, riddled with subjectivity, laced with error, and tainted by apparent racial bias. If we are uncomfortable in casting Marko Bey as the victim, we can legitimately substitute ourselves. Although perhaps unwittingly, in failing to insist that death be imposed with the full measure of constitutional protection or not at all, we lose a significant and irredeemable part of our civilization built on the rule of law.\n\nAPPENDIX\n\nFactual Description of Similar Cases derived from Detailed Narrative Summary of Death Eligible Case, New Jersey Proportionality Review Project.\n\n1. George Booker:\n\nGeorge Booker, aged thirty-six, went on a \"three day crime spree.\" After sexually assaulting his first victim and stealing her car, Booker ran down a male pedestrian and stole his wallet. Booker then entered the home of a lesbian couple. He raped and sodomized the first victim, then killed her. Her partner returned home; the defendant forced her to undress and lie in bed next to her partner, then he stabbed her to death. When the victims were found, it was discovered that the first victim's mouth and forehead had been bashed in, her mouth gagged with a bathrobe tie, and a cord was wrapped around her neck. Police found the defendant carrying a knife in the home of an elderly neighbor. The defendant was convicted of knowing murder with respect to the first victim and purposeful murder of the second. At the penalty phase, the jury found the presence of three aggravating factors with respect to the first murder: prior murder, extreme suffering, and contemporaneous felony. The jury found three aggravating factors for the second victim, prior murder, extreme suffering, and murder to escape detection. The jury also found that the mitigating factors of emotional disturbance and the catchall factors applied to both murders. The jury deadlocked on whether the mitigating factors outweighed the aggravating factors, and Booker was sentenced to an aggregate sentence of life imprisonment with a sixty year parole disqualifier.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\n2. Carlos Vasquez:\n\nCarlos Vasquez, aged forty-three, abducted a thirteen year old, raped her and killed her. The defendant had bound her hands and feet together and pulled them behind her back. The cause of the victim's death was asphyxia by gagging, ligature strangulation, and fracture of the cervical spine. The defendant denied mental health or substance abuse problems. The jury found the catch-all mitigating factor. Defendant received an aggregate sentence of life imprisonment with a forty year parole disqualifier.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\n3. Leroy Taylor:\n\nLeRoy Taylor, age twenty-five, had raped and strangled a thirteen-year-old babysitter hired by his girlfriend. Taylor had a prior conviction for the murder of a four-year-old girl. He pled guilty to the murder and did not proceed to a penalty phase, apparently as part of the plea agreement. Taylor received a life sentence with a total parole disqualifier of thirty-two-and-one-half years.\n\n4. James Koedatich:\n\nJames Koedatich, age thirty-four, abducted an eighteen-year-old Amie Hoffman from the parking lot of the Morris County Mall at approximately 9:30 p.m. on November 23, 1992. The defendant raped and sodomized the girl, stabbed her multiple times, including two fatal chest wounds, then left her body in an isolated holding tank in Randolph Township. Defendant had committed a prior murder in Florida ten years earlier, and another murder of a twenty-five-year-old woman two weeks after the Amie Hoffman murder. At a retrial of the penalty phase, jurors found four aggravating factors: 4(a), prior murder; 4(c), extreme suffering; 4(g), contemporaneous kidnap and sexual assault, and 4(f), murder to escape detection. The jury found a factor of childhood trauma under the 5(h) catch-all factor. During the weighing process, the jury deadlocked and life imprisonment was imposed.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\n5. Anthony McDougald:\n\nAnthony McDougald committed multiple murders involving burglary and sexual assault of at least one of the victims. Defendant, age twenty-seven, had been dating a thirteen-year-old girl, the daughter of the two victims. Her parents objected to Antoinette and McDougald having sexual relations. McDougald entered their home with another thirteen-year-old girl, slashed Mr. Bass' throat and stabbed him in the chest, and struck him in the head with a baseball bat. He then struck the mother with a cinderblock and a bat, cut her throat, and inserted the bat into her vagina. The thirteen-year old girl also participated in the killings. At the penalty trial, the defense sought to portray the defendant as a product of a violent and deprived childhood, and severely despondent over the impending divorce from his wife. McDougald's mother testified at trial that when the defendant was a child, her sister, who had been living with them in North Carolina, had physically abused the defendant. A few years later, when the family moved to Newark, New Jersey, defendant was also beaten by his mother's boyfriend and repeatedly witnessed his mother being beaten. At the penalty trial, the jury found aggravating factors 4(c), intent to cause suffering; 4(f), murder to escape detection; and 4(g), commission of the murders while engaged in commission of a burglary. The jury also found mitigating factors 5(a), influence of extreme mental or emotional disturbance, and 5(h), the catch-all factor concerning background and character. The jury found that aggravating factors outweighed mitigating factors. Retrial of the penalty phase, based on the court's erroneous charge on the 4(c) aggravating factor, is now pending.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Prior to the Court's decision in Marshall II, the Legislature amended the Capital Punishment Act to provide that only \"similar cases in which a sentence of death has been imposed\" would form the basis of comparison for the purpose of proportionality review. L. 1992, c. 5 (effective May 12, 1992) (codified at N.J.S.A. 2C:11-3(e)). The Court does not apply the amendment to defendant's case, nor does it consider its constitutionality. Ante at (slip op. at 9). Limiting proportionality review to death-sentenced cases is irrational and destroys the analytic value of proportionality review itself. Review of prosecutorial discretion would have to be effectively abandoned. Detecting invidious discrimination, like racial bias, within the amended statute's narrow universe, will be almost impossible. The former Chief Justice of the Nebraska Supreme Court recognized that fact, pointing out that limiting proportionality review to death-sentenced cases is like reviewing alleged discrimination in public transportation by looking only at those riding in the back of the bus. See State v. Palmer, 399 N.W.2d 706, 752 (1986) (Krivosha, C.J., Concurring and Dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The State, however, in its briefs, was willing to speculate on why this jury did not find age as a mitigating factor. It suggested that perhaps the jury was swayed by the thought that if given a life sentence carrying a mandatory thirty-year parole ineligibility period, Bey, being relatively young, aged eighteen, might be released at the age of forty-eight. The jury, had it so reasoned, would have been wrong; Bey, given his prior conviction and sentence would not have been eligible for release during his life time. The jury was not accurately informed of the true implications of a life sentence for Bey, however. The sentencing court failed to answer its inquiry on the matter, a failure that this Court held to be harmless error. Bey, supra, 129 N.J. at 606.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Nor does the distinction between \"structural\" and \"trial\" error measurably aid the accuracy or enhance the fairness of harmless-error review in the penalty phase of capital sentencing. See Charles J. Ogletree, Jr., The Harm of Applying Harmless Error to Coerced Confessions, 105 Harv. L. Rev. 152, 159-64 (1991).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. * * * indicates cases in which the Court later determined that the defendant was not even death eligible, e.g., Bey I in which the Court determined that he was a juvenile. Those names do not appear in any of the finished tables used by defendant or the Special Master, but for purposes of race analysis, those cases are included making a total of 23 cases in level 4. The majority criticizes the use of those three cases. Ante at (slip op. at 79). Yet, of course, the majority, heedless of the irony, steadfastly insists that reversed death sentences, like those in Bey I, continue to represent \"a societal consensus concerning the deathworthiness of a defendant.\" Ante at (slip op. at 14).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Defendant argues that Booker was clearly more culpable because Booker had killed a total of three persons. Booker's level of victimization was higher than Bey's, since the 4(c) factor of aggravated assault or torture was found to be present. Unlike Bey, Booker, though he had come from a large sharecropping family, had not suffered an abused childhood. In addition, Booker was considerably older than Bey.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Defendant argues that the levels of victimization in the two cases are equivalent but that Vasquez's older age, lack of mental disturbance, and lack of known abusive childhood, and the youth of the victim clearly make him more culpable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Defendant maintains that the fact that Koedatich had committed a third murder ten years earlier, and was 34 years old when he committed the New Jersey murders, renders him more culpable than Marko Bey. The defense contends that Koedatich received a life sentence because he received a fair trial, in as much as, that the jury received \"a full picture of his abusive childhood,\" understood the alternatives to the death sentence, and was shielded from irrelevant and inflammatory evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The defense claims that McDougald did not experience the extended abuse as a child that was inflicted on Marko Bey, and that Marko Bey did not engage in such extensive torture or mutilation of his victim.\u003c/span\u003e\n\n",
    "body_length": 192850,
    "citedas": [
      "137 N.J. 334",
      "645 A.2d 685"
    ],
    "attorneys": "Claudia Van Wyk, Deputy Public Defender II, and James K. Smith, Jr., Assistant Deputy Public Defender, argued the cause for appellant (Zulima V. Farber, Public Defender, attorney). Alton D. Kenney, Assistant Prosecutor, argued the cause for respondent (John Kaye, Monmouth County Prosecutor, attorney; Mark P. Stalford, Assistant Prosecutor, of counsel; Barry J. Serebnick, Assistant Prosecutor, on the brief). Lawrence S. Lustberg argued the cause for amici curiae Association of Criminal Defense Lawyers of New Jersey and New Jersey State Conference of NAACP Branches (Crummy, Del Deo, Dolan, Griffinger \u0026 Vecchione, attorneys). Catherine A. Foddai, Deputy Attorney General, argued the cause for amicus curiae Attorney General of New Jersey (Fred DeVesa, Acting Attorney General, attorney).",
    "category": [
      "243",
      "36",
      "78"
    ],
    "judges": "Pollock, Wilentz, Clifford, O'Hern, Garibaldi, Stein, Handler",
    "citation_count": 27
  }
}
