{
  "id": "iIOdPmYBTlTomsSBqsWe",
  "document": {
    "title": "1 v. Wainwright",
    "full_title": "JOHN A. SPINKELLINK,*FN1 -APPELLANT, v. LOUIE L. WAINWRIGHT, SECRETARY, FLORIDA DEPARTMENT OF OFFENDER REHABILITATION -APPELLEE",
    "jurisdiction": "Fifth Circuit",
    "date": "1978-08-21T00:00:00.000Z",
    "docket": "No. 77-2940",
    "body": "AINSWORTH, Circuit Judge:\n\nThis case involves the petition for a writ of habeas corpus by a Florida state inmate under sentence of death. On February 4, 1973, petitioner John A. Spenkelink, a 24-year-old white male and twice convicted felon, who had escaped from a California correctional camp, murdered his traveling companion, Joseph J. Szymankiewicz, a white male, in their Tallahassee, Florida motel room. Spenkelink shot Szymankiewicz, who was asleep in bed, once in the head just behind the left ear and a second time in the back, which fragmented the spine, ruptured the aorta, and resulted in the victim's death. The petitioner then recounted a cover story to the motel proprietor in order to delay discovery of the body and left.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Authorities apprehended him less than one week later in Buena Park, California. On December 20, 1973, subsequent to a jury verdict of guilty of first degree murder, Spenkelink was sentenced to the death penalty by a Florida state court trial judge on the jury's recommendation.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Now, five years later, following an unsuccessful direct appeal and unsuccessful collateral review in the Florida state courts, and two unsuccessful petitions for certiorari to the United States Supreme Court, Spenkelink seeks federal habeas corpus relief. He asks this Court, in effect, to reverse his conviction and annul the decision that he must die for his premeditated act of murder. After reviewing the record with painstaking care and considering each of the petitioner's contentions, we have determined that Spenkelink's conviction and sentence were proper. Accordingly, we affirm the district court's dismissal of his petition for habeas corpus.\n\nI. Statement of the Case\n\nA. State Court Proceedings\n\nSpenkelink was found guilty of first degree murder by a jury in the Circuit Court of the Second Judicial Circuit in Leon County, Florida.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Under Florida law first degree murder is a capital felony, Fla.Stat.Ann. § 782.04(1),\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e punishable either by life imprisonment with eligibility for parole after twenty-five years or by death, Fla.Stat.Ann. § 775.082(1),\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e which in Florida is by electrocution. Fla.Stat.Ann. § 922.10. See id. § 922.11. In response to Furman v. Georgia, 408 U.S. 238, 92 S. Ct. 2726, 33 L. Ed. 2d 346 (1972), Florida by legislative act has provided that a defendant convicted of a capital felony must be provided a bifurcated trial, with a separate sentencing proceeding following his conviction to determine whether he shall receive the death penalty or life imprisonment. The relevant statute, Fla.Stat.Ann. § 921.141, which is set forth in footnote\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e below, requires that the sentencing proceeding be held before the trial jury,\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e which is to reach its decision by a majority vote after considering whether there are sufficient statutorily-defined aggravating circumstances and, if so, whether sufficient statutorily-defined mitigating circumstances exist that outweigh the aggravating circumstances. The jury's determination is advisory only. That recommendation notwithstanding, the trial court must make the final sentencing decision, but if the court imposes a sentence of death, it must set forth written findings of fact to support its decision. Thus the trial court, in order to impose the death penalty, must find that sufficient statutorily-defined aggravating circumstances exist to justify the death penalty and that there are insufficient statutorily-defined mitigating circumstances to outweigh the aggravating circumstances found to exist. Additionally, \"in order to sustain a sentence of death following a jury recommendation of life, the facts suggesting a sentence of death should be so clear and convincing that virtually no reasonable person could differ.\" Tedder v. State, 322 So.2d 908, 910 (Fla.1975). The Florida Supreme Court automatically reviews each conviction and sentence of death on an expedited basis.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nThe trial jury recommended that Spenkelink receive the death penalty. The trial court agreed. Pursuant to Fla. Stat.Ann. § 921.141(3), it found that the felony \"was committed for pecuniary gain, either for another person's money or to re-coup his own,\" that the crime \"was especially heinous, atrocious and cruel,\" that Spenkelink \"was previously convicted of a felony involving the use, or threat of violence to another, to-wit: armed robbery,\" and that Spenkelink committed the crime while \"under sentence of imprisonment.\" The only mitigating circumstance found by the trial court was \"that possibly the defendant was under the influence of extreme mental or emotional disturbance,\" a consideration which, \"based on the record as a whole,\" the court did not regard \"as a substantial factor.\" See Fla.Stat.Ann. §§ 921.141(5), (6). The Supreme Court of Florida affirmed both the conviction and sentence. Spinkellink v. State, 313 So.2d 666 (Fla.1975), cert. denied, 428 U.S. 911, 96 S. Ct. 3227, 49 L. Ed. 2d 1221 (1976). With respect to the sentence of death, the Florida Supreme Court stated:\n\nAs more fully set out above the record shows this crime to be premeditated, especially cruel, atrocious, and heinous and in connection with robbery of the victim to secure return of money claimed by Appellant. The aggravating circumstances justify imposition of the death sentence. Both Appellant and his victim were career criminals and Appellant showed no mitigating factors to require a more lenient sentence.\n\n313 So.2d at 671. The United States Supreme Court denied certiorari. Spenkelink v. Florida, 428 U.S. 911, 96 S. Ct. 3227, 49 L. Ed. 2d 1221 (1976).\n\nThe petitioner next sought executive clemency. Article IV, section 8(a) of the Florida Constitution provides that the governor of Florida, with the approval of three members of the cabinet, may commute punishment. Pursuant to rules adopted by the governor and the cabinet regarding executive clemency, Spenkelink appeared first before the Florida Parole and Probation Commission, which recommended to the governor that clemency be denied. Counsel for Spenkelink and for the State then appeared before the governor and cabinet to argue the clemency issue. On September 12, 1977, the governor denied clemency and signed a death warrant setting Spenkelink's electrocution for 8:30 a.m. on September 19, 1977.\n\nOn September 13, the petitioner, pursuant to Fla.R.Crim.P. 3.850, filed a motion to vacate, set aside or correct sentence in the Circuit Court of the Second Judicial Circuit in Leon County, Florida. The motion was dismissed and the Supreme Court of Florida affirmed. Spenkelink v. State, 350 So.2d 85 (Fla.1977). The United States Supreme Court denied certiorari. Spenkelink v. Florida, 434 U.S. 960, 98 S. Ct. 492, 54 L. Ed. 2d 320 (1977).\n\nB. Federal Court Proceedings\n\nHaving exhausted his state court remedies, Spenkelink turned to federal court. On September 14 he filed a petition for habeas corpus, 28 U.S.C. § 2254, in the United States District Court for the Middle District of Florida, which transferred the case to the Northern District of Florida. Judge William Stafford of the Northern District stayed the execution and scheduled an evidentiary hearing for September 21. At that time a hearing was held, which began during late morning and lasted into the evening, and which produced over 300 pages of testimony. On September 23 the district court dismissed the petition and ordered that the stay of execution expire at noon on September 30. The district court also granted Spenkelink a certificate of probable cause to appeal, pursuant to 28 U.S.C. § 2253. This Court then stayed the execution pending further order.\n\nII. The Petitioner's Contentions\n\nOn appeal Spenkelink urges three general contentions through which he asserts the contentions in his habeas corpus petition. First, he contends that the district court erroneously denied him the right to submit evidence during the evidentiary hearing on some of the contentions in his petition, which the district court found to \"have been authoritatively disposed of by the United States Supreme Court.\" Second, he contends that the district court erroneously denied his motion for a continuance and therefore denied him an adequate opportunity to present evidence during the evidentiary hearing on other contentions in his petition. Third, he asserts that the district court erroneously ruled against him on the merits of several of the contentions in his petition.\n\nIn support of his contentions that the trial court erred in not holding an evidentiary hearing on some of his claims and that the trial court held an inadequate hearing on others, the petitioner points to Townsend v. Sain, 372 U.S. 293, 313, 83 S. Ct. 745, 757, 9 L. Ed. 2d 770 (1963), where the Supreme Court set forth the circumstances under which a federal district court must hold an evidentiary hearing on allegations in a habeas corpus petition. The requirements of Townsend as to when a hearing must be held are now codified in 28 U.S.C. § 2254.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e When, however, it affirmatively appears from the petition that a petitioner is not entitled to the writ, an evidentiary hearing is unnecessary. Guillory v. Allgood, 5 Cir., 1967, 379 F.2d 273, 274. See also Coco v. United States, 5 Cir., 1978, 569 F.2d 367, 369. For example, if a petitioner's habeas corpus allegations raise legal questions only, a district court's refusal to hold an evidentiary hearing does not violate the directives of Townsend or Section 2254(d). Anderson v. Maggio, 5 Cir., 1977, 555 F.2d 447, 453. This rule would also apply when a trial court holds an inadequate evidentiary hearing, for if only questions of law are involved, an evidentiary hearing to develop fully the facts underlying a petitioner's complaints would be pointless. This Court views those of Spenkelink's contentions on which the trial court did not conduct a hearing and those on which the court conducted an allegedly inadequate hearing as containing legal questions only. We assume for the sake of argument that the factual allegations underlying these contentions are true, because, even if they are, the petitioner cannot prevail on them as a matter of law for reasons soon to be discussed. Accordingly, the trial court did not err in its conduct with respect to the evidentiary hearing.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e With this procedural question behind us, we turn to the substantive contentions urged in the petition for habeas corpus.\n\nA. Exclusion of Veniremen\n\nSpenkelink contends first that at his trial the exclusion for cause of two veniremen who had conscientious scruples against the death penalty (1) violated the requirements of the Sixth and Fourteenth Amendments set forth in Witherspoon v. Illinois, 391 U.S. 510, 88 S. Ct. 1770, 20 L. Ed. 2d 776 (1968), (2) violated his right under the Sixth and Fourteenth Amendments to trial by an impartial jury, (3) violated his rights under the Sixth and Fourteenth Amendments to trial by a jury selected from a representative cross-section of the community, and (4) subjected him to cruel and unusual punishment in violation of the Eighth and Fourteenth Amendments.\n\nDuring the voir dire examination of the jury, counsel for Spenkelink contemporaneously objected to the exclusion for cause of the two veniremen in question. His counsel did not, however, raise any of these contentions regarding the veniremen's exclusion on direct appeal to the Florida Supreme Court. Additionally, although a court reporter recorded the voir dire testimony, neither Spenkelink nor his trial attorney requested the court reporter to transcribe it, and his trial attorney even expressly excluded the voir dire examination from testimony designated to be transcribed for the appellate record.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e The Florida Supreme Court on collateral review, Spenkelink v. State, supra, and the district court below, both relying on Wainwright v. Sykes, 433 U.S. 72, 97 S. Ct. 2497, 53 L. Ed. 2d 594 (1977), found that Spenkelink had waived his contentions regarding the exclusion of the two veniremen.\n\nIn Wainwright v. Sykes, supra, the United States Supreme Court held that a defendant who did not contemporaneously object, and whose attorney did not contemporaneously object, during the defendant's state trial to the involuntariness of the defendant's confession waived his objection and could not thereafter raise the issue on federal habeas corpus review. Justice Rehnquist, writing for the majority, stated:\n\nWe therefore conclude that Florida procedure did, consistently with the United States Constitution, require that petitioner's confession be challenged at trial or not at all, and thus his failure to timely object to its admission amounted to an independent and adequate state procedural ground which would have prevented direct review here. See Henry v. Mississippi, 379 U.S. 443, 85 S. Ct. 564, 13 L. Ed. 2d 408 (1965). We thus come to the crux of this case. Shall the rule of Francis v. Henderson, supra [425 U.S. 536, 96 S. Ct. 1708, 48 L. Ed. 2d 149] barring federal habeas review absent a showing of \"cause\" and \"prejudice\" attendant to a state procedural waiver, be applied to a waived objection to the admission of a confession at trial? We answer that question in the affirmative.\n\n433 U.S. at 86, 97 S. Ct. at 2506. The Supreme Court made clear that federal habeas corpus review would not be barred if a defendant could show actual \"prejudice\" from or \"cause\" for his failure to follow the state procedural rule. Id. See Francis v. Henderson, 425 U.S. 536, 542, 96 S. Ct. 1708, 1711, 48 L. Ed. 2d 149 (1976). As to whether the defendant in Wainwright v. Sykes had shown cause or prejudice, the Court stated that \"whatever precise content may be given those terms by later cases, we feel confident in holding without further elaboration that they do not exist here.\" 433 U.S. at 91, 97 S. Ct. at 2508. Compare Sincox v. United States, 5 Cir., 1978, 571 F.2d 876; Jiminez v. Estelle, 5 Cir., 1977, 557 F.2d 506.\n\nWhether Spenkelink's procedural default actually falls within the ambit of Wainwright v. Sykes, supra, and, concomitantly, whether sufficient cause or prejudice exists in this case so as not to bar federal habeas corpus review, are difficult questions on which we need not pass. Spenkelink's contentions regarding the exclusion of the two veniremen must fail on their merits as a matter of law for reasons to be discussed; the petitioner thus is not entitled to relief on the basis of these contentions even if Wainwright v. Sykes does not prevent him from raising them. Therefore, we proceed to a consideration of the merits of the contentions themselves.\n\n1.\n\nIn Witherspoon v. Illinois, supra, the Supreme Court held that the jury impartiality to which a criminal defendant is entitled under the Sixth and Fourteenth Amendments\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e precludes a state from executing a person if the jury that imposed or recommended the death penalty \"was chosen by excluding veniremen for cause simply because they voiced general objections to the death penalty or expressed conscientious or religious scruples against its infliction.\" 391 U.S. at 518, 522, 88 S. Ct. at 1775, 1777. It cannot be assumed, the Court stated, that such veniremen will never vote in favor of the death penalty or would not consider doing so in the case from which they were excluded. Consequently, to exclude them for cause results in the selection of \"a tribunal organized to return a verdict of death.\" 391 U.S. at 515 n. 9, 521, 88 S. Ct. at 1773 n. 9, 1776, 20 L. Ed. 2d 776. Only when a venireman is \"irrevocably committed, before the trial has begun, to vote against the penalty of death regardless of the facts and circumstances that might emerge in the course of the proceedings\" can he be struck for cause. 391 U.S. at 522-23 n. 21, 88 S. Ct. at 1777 n. 21. The Witherspoon Court more carefully defined its holding through a paragraph in footnote 21 of its opinion:\n\nWe repeat, however, that nothing we say today bears upon the power of a State to execute a defendant sentenced to death by a jury from which the only veniremen who were in fact excluded for cause were those who made unmistakably clear (1) that they would automatically vote against the imposition of capital punishment without regard to any evidence that might be developed at the trial of the case before them, or (2) that their attitude toward the death penalty would prevent them from making an impartial decision as to the defendant's guilt. Nor does the decision in this case affect the validity of any sentence other than one of death. Nor, finally, does today's holding render invalid the conviction, as opposed to the sentence, in this or any other case.\n\nId. [emphasis in original]\n\nThe transcript of the voir dire examination of the two excluded veniremen is set forth in Appendix A. A reading of the transcript demonstrates that both veniremen stated unambiguously that they could fairly judge Spenkelink's guilt or innocence. However, both veniremen also made it \"unmistakably clear . . . that they would automatically vote against the imposition of capital punishment without regard to any evidence that might be developed at the trial of the case before them.\" Id. In response to the question \"Would you automatically vote against the imposition of capital punishment without regard to the evidence?\", venireman Ferrell stated, \"Capital punishment, yes.\" In response to the same question venireman Colson replied, \"I would.\" The record could not be clearer. The veniremen were properly excluded for cause and there was no Witherspoon violation.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e See, e.g., Davis v. Georgia, 429 U.S. 122, 97 S. Ct. 399, 50 L. Ed. 2d 339 (1976); Maxwell v. Bishop, 398 U.S. 262, 90 S. Ct. 1578, 26 L. Ed. 2d 221 (1970); Boulden v. Holman, 394 U.S. 478, 89 S. Ct. 1138, 22 L. Ed. 2d 433 (1969); Note, Jury Selection and the Death Penalty: Witherspoon in the Lower Courts, 37 U.Chi.L.Rev. 759, 762-63 (1970).\n\n2.\n\nThe petitioner's second argument is that even if the two veniremen were properly excluded for cause under Witherspoon from recommending his sentence, their exclusion for cause still violated his right under the sixth and fourteenth amendments to trial by an impartial jury, because the exclusion of the two veniremen resulted in the selection of a \"death-qualified\" jury that was \"prosecution-prone\" with respect to the question of guilt or innocence. Spenkelink acknowledges that this contention was submitted to the Supreme Court in Witherspoon and that the Court expressly declined to embrace it, stating:\n\nWe simply cannot conclude, either on the basis of the record now before us or as a matter of judicial notice, that the exclusion of jurors opposed to capital punishment results in an unrepresentative jury on the issue of guilt or substantially increases the risk of conviction.\n\nWitherspoon v. Illinois, supra, 391 U.S. at 518, 88 S. Ct. at 1774-75. Spenkelink suggests nonetheless that if this Court will remand his case for an additional evidentiary hearing, he will develop a more complete record than the one before the Supreme Court in Witherspoon and prove the contention.\n\nThe petitioner complains of jury partiality. He alleges that the exclusion for cause of the two veniremen resulted in a \"death-qualified\" jury that was \"prosecution-prone.\" From this he concludes, by implication, that a nondeath-qualified jury -- in this case a jury which includes the two excluded veniremen -- would be impartial with respect to the question of guilt or innocence. This is not necessarily so. When the petitioner asserts that a death-qualified jury is prosecution-prone, he means that a death-qualified jury is more likely to convict than a nondeath-qualified jury.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Proof that this proposition is true is far from conclusive,\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e but for the moment we will assume its validity. Even if it is true, the petitioner's contention still must fail. That a death-qualified jury is more likely to convict than a nondeath-qualified jury does not demonstrate which jury is impartial. It indicates only that a death-qualified jury might favor the prosecution and that a nondeath-qualified jury might favor the defendant. The pivotal question, therefore, is which appearance most closely reflects reality.\n\nIn the instant case a reading of the transcript of the voir dire examination demonstrates that those veniremen who were chosen to be jurors in no way indicated that they were biased for the prosecution or against the defendant. None of the veniremen indicated, for example, that he had a preconceived opinion as to the petitioner's guilt or innocence, compare Williams v. Wainwright, 5 Cir., 1970, 427 F.2d 921, 924, modified, 408 U.S. 941, 92 S. Ct. 2864, 33 L. Ed. 2d 765 (1972), or that he believed it would be his duty in every case to recommend that the trial court sentence a defendant found guilty of first degree murder to capital punishment. Compare Stroud v. United States, 251 U.S. 15, 20-21, 40 S. Ct. 50, 52, 64 L. Ed. 103 (1919); Crawford v. Bounds, 4 Cir., 1968, 395 F.2d 297, 301-04, cert. denied, 397 U.S. 936, 90 S. Ct. 941, 25 L. Ed. 2d 117 (1970); United States v. Puff, 2 Cir., 211 F.2d 171, 184, cert. denied, 347 U.S. 963, 74 S. Ct. 713, 98 L. Ed. 1106 (1954). Had a venireman expressed either attitude, he could appropriately be described as prosecution-prone and would properly have been struck for cause. E.g., Witherspoon v. Illinois, supra, 391 U.S. at 521, 88 S. Ct. at 1776; Fay v. People of State of New York, 332 U.S. 261, 294, 67 S. Ct. 1613, 1630, 91 L. Ed. 2043 (1947); Glasser v. United States, 315 U.S. 60, 83-87, 62 S. Ct. 457, 471-72, 86 L. Ed. 680 (1942); Stroud v. United States, supra, 251 U.S. at 20-21, 40 S. Ct. at 52; Williams v. Wainwright, supra, 427 F.2d at 923-24; Crawford v. Bounds, supra, 395 F.2d at 303-04; United States v. Puff, supra, 211 F.2d at 184; Fla.R.Crim.P. 3.330, 3.340. Instead, the veniremen chosen to be jurors indicated only that they had no conscientious scruples against the death penalty and that in a proper case they would recommend capital punishment which, as the Supreme Court made clear in, e.g., Proffitt v. Florida, supra, and Gregg v. Georgia, 428 U.S. 153, 96 S. Ct. 2909, 49 L. Ed. 2d 859 (1976), is constitutional if administered through a properly drawn statute. In other words, the veniremen indicated only that they would be willing to perform their civic obligation as jurors and obey the law. Such persons cannot accurately be branded prosecution-prone. Consider in this regard the comments of the late Judge Prettyman of the D.C. Circuit:\n\nOur own inquiry has brought to our attention another thesis in this area of the law. It is that persons who are not opposed to capital punishment are psychologically inclined against criminals and therefore a jury composed of such persons is not an impartial jury. We understand that this thesis has not as yet received the sanction of any court. We cannot accept it. We examine it because this is a serious case, and if the thesis were tenable it might cause reversal. No proof is available, so far as we know, and we can imagine none, to indicate that, generally speaking, persons not opposed to capital punishment are so bent in their hostility to criminals as to be incapable of rendering impartial verdicts on the law and the evidence in a capital case. Being not opposed to capital punishment is not synonymous with favoring it. Individuals may indeed be so prejudiced in respect to serious crimes that they cannot be impartial arbiters, but that extreme is not indicated by mere lack of opposition to capital punishment. The two antipathies can readily coexist; contrariwise either can exist without the other; and, indeed, neither may exist in a person. It seems clear enough to us that a person or a group of persons may not be opposed to capital punishment and at the same time may have no particular bias against any one criminal or, indeed, against criminals as a class; people, it seems to us, may be completely without a controlling conviction one way or the other on either subject. We think the premise for the thesis has no substance.\n\nTuberville v. United States, supra, 112 U.S.App.D.C. at 409, 303 F.2d at 420-21. See Pope v. United States, 8 Cir., 1967, 372 F.2d 710, 724-25, vacated on other grounds, 392 U.S. 651, 88 S. Ct. 2145, 20 L. Ed. 2d 1317 (1968); United States v. Puff, supra, 211 F.2d at 184-85. See also Witherspoon v. Illinois, supra, 391 U.S. at 520, 88 S. Ct. at 1776; Clarke v. Grimes, 5 Cir., 1967, 374 F.2d 550, 552.\n\nThe two excluded veniremen, on the other hand, stated that they would automatically vote against imposition of the death penalty regardless of any evidence that might be developed at trial. They also represented that they would fairly judge the petitioner's guilt or innocence. The state trial court, nonetheless, struck them for cause, thus excluding them completely from the trial. We find nothing constitutionally impermissible by a state following such a procedure. Florida apparently has concluded that, if for whatever noble reason -- religious conviction, philosophical posture, intellectual stance, or some other reason -- a venireman clings so steadfastly to the belief that capital punishment is wrong that he would never under any circumstances agree to recommend the sentence of death, it is entirely possible -- perhaps even probable -- that such a venireman could not fairly judge a defendant's guilt or innocence when a capital felony is charged. Suppose, for example, that the evidence at trial proved the defendant's guilt beyond a reasonable doubt and demonstrated, within the meaning of the Florida death penalty statute, that capital punishment could be warranted. A juror who had such deeply-seated conscientious scruples against the death penalty might find himself confronting a grisly choice. If, because of his scruples, he votes to acquit, he must risk hanging the jury.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Similarly motivated votes by other jurors in subsequent trials and retrials could, in effect, result in near immunity from crimes for which the death penalty can be imposed, which would frustrate Florida's interest in the just and evenhanded application of its laws, including its death penalty statute. If the juror votes to convict, he must risk betrayal of his principles should the death penalty eventually be imposed. Even under Florida's bifurcated trial procedure in these cases, the situation would be no less problematic. Although the juror could be excused from the jury during the sentencing phase of the trial, during the guilt-determination phase he still would know that a vote to convict could eventually mean the death penalty, a result to which he would have contributed, if only indirectly. His choices as to how to vote on the defendant's guilt or innocence would remain equally troublesome.\n\nThe right under the Sixth and Fourteenth Amendments to trial by a jury guarantees to the criminally accused \"a fair trial by a panel of impartial, 'indifferent' jurors.\" Irvin v. Dowd, supra, 366 U.S. at 722, 81 S. Ct. at 1642. Accord, e.g., Murphy v. Florida, 421 U.S. 794, 799, 95 S. Ct. 2031, 2036, 44 L. Ed. 2d 589 (1975). But the state also enjoys the right to an impartial jury, Williams v. Wainwright, supra, 427 F.2d at 923, and impartiality requires not only freedom from jury bias against the accused and for the prosecution, but freedom from jury bias for the accused and against the prosecution. Hayes v. Missouri, 120 U.S. 68, 70-71, 7 S. Ct. 350, 351, 30 L. Ed. 578 (1887). See Comment, 21 Vand.L.Rev. 864, 865 (1968). Florida has reasoned that a person may so cherish his conscientious scruples against the death penalty that he would favor the acquittal of a defendant charged with a capital felony. This is not, of course, necessarily true of all persons who would refuse under any circumstances to recommend death. Some such veniremen might be able to subordinate their personal views to their duty to abide by their oaths as jurors and to obey the law of Florida. Witherspoon v. Illinois, supra, 391 U.S. at 514 n. 7, 88 S. Ct. at 1773 n. 7, and cases cited therein. Florida, however, has determined that even though a venireman states he can fairly judge guilt or innocence, if he also states that he is irrevocably committed before the trial has begun to vote against the penalty of death, regardless of the facts and circumstances that might emerge at trial, he must be excluded completely. The state has decided that the parties' right under the Sixth and Fourteenth Amendments to an impartial trial and the state's interest in the just and evenhanded application of its laws, including Florida's death penalty statute, are too fundamental to risk a defendant-prone jury from the inclusion of such veniremen.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e The Constitution does not prohibit this judgment. See Logan v. United States, 144 U.S. 263, 298, 12 S. Ct. 617, 628, 36 L. Ed. 429 (1892); Pope v. United States, supra, 372 F.2d at 724-25; Turberville v. United States, supra, 112 U.S.App.D.C. 407-10, 303 F.2d at 418-21; United States v. Puff, supra, 211 F.2d at 182-86. See also Witherspoon v. Illinois, supra, 391 U.S. at 520, 88 S. Ct. at 1776. But see Crawford v. Bounds, supra. The jury that emerges after excluding such veniremen, having been carefully examined to exclude also for cause those veniremen who are biased against the defendant, either as to guilt or as to punishment, is impartial. To call it prosecution-prone is to misunderstand the meaning of impartiality.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Accordingly, the petitioner's contention is without merit.\n\n3.\n\nSpenkelink's third contention is that the exclusion for cause of the two veniremen violated his right under the Sixth and Fourteenth Amendments to trial by a jury selected from a representative cross-section of the community. Similarly, he contends also that the exclusion for cause of the two veniremen violated Fourteenth Amendment equal protection and due process. For reasons already detailed, the petitioner's contentions must be rejected.\n\nIn Taylor v. Louisiana, 419 U.S. 522, 95 S. Ct. 692, 42 L. Ed. 2d 690 (1975), the Supreme Court struck down as unconstitutional Louisiana's jury selection process whereby women, who represented 53 per cent of the eligible jurors in the parishes in question, had to register in order to be called for jury duty, a requirement that systematically excluded most eligible women from the jury venire. The Court held that such a jury selection system violated the criminal defendant's right under the Sixth and Fourteenth Amendments to trial by a jury selected from a representative cross-section of the community, which is \"an essential component\" of the fundamental right under the Sixth Amendment to trial by a jury in nonpetty criminal cases. 419 U.S. at 525-26, 528, 530-31, 537-38, 95 S. Ct. at 695, 697-98, 701-02. See Duncan v. Louisiana, supra. As justification for its exclusion of women, Louisiana argued \"that women as a class serve a distinctive role in society\" as the center of home and family life and \"that jury service would . . . substantially interfere with that function.\" 419 U.S. at 533, 534 n. 15, 535 n. 17, 95 S. Ct. at 699 \u0026 n. 15, 700 n. 17. To this argument the Court responded:\n\nThe right to a proper jury cannot be overcome on merely rational grounds. There must be weightier reasons if a distinctive class representing 53% of the eligible jurors is for all practical purposes to be excluded from jury service. No such balance has been tendered here.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\n419 U.S. at 534, 95 S. Ct. at 699-700.\n\nAssuming for the moment that veniremen who are properly excluded under Witherspoon because they would automatically vote against the death penalty no matter what evidence was proved at trial constitute a \"distinctive class,\" cf. Witherspoon v. Illinois, supra, 391 U.S. at 519-20, 88 S. Ct. at 1775-76, we believe that Florida in the instant case has satisfactorily shown the \"weightier reasons\" required by the Supreme Court in Taylor for the exclusion of such veniremen. See generally Ballew v. Georgia, supra; Apodaca v. Oregon, 406 U.S. 404, 92 S. Ct. 1628, 32 L. Ed. 2d 184 (1972); Williams v. Florida, 399 U.S. 78, 90 S. Ct. 1893, 26 L. Ed. 2d 446 (1970). As we have already noted, Florida has reached the reasoned determination that the parties' right under the Sixth and Fourteenth Amendments to an impartial jury and the state's interest in the just and evenhanded application of its laws, including Florida's death penalty statute, are too fundamental to risk a defendant-prone jury from the inclusion of such veniremen. As the petitioner in his brief concedes, a defendant would be unjustified in objecting, for instance, to the exclusion for cause of a class composed of veniremen who are related to him, even if the veniremen stated they could impartially judge his guilt or innocence, because the chance that such veniremen would be biased in favor of the defendant is too great. Petitioner's Brief at 57. Such danger is no less real when the excluded class is those veniremen properly struck under Witherspoon because of their conscientious scruples against capital punishment. The exclusion of such veniremen, therefore, does not violate the representative cross-section requirement of the Sixth and Fourteenth Amendments.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e See Brown v. Allen, 344 U.S. 443, 467-74, 73 S. Ct. 397, 412-16, 97 L. Ed. 469 (1953); United States v. Gordon-Nikkar, 5 Cir., 1975, 518 F.2d 972; Pope v. United States, supra, 372 F.2d at 724-25; Turberville v. United States, supra, 112 U.S.App.D.C. 407-10, 303 F.2d at 418-21; United States v. Puff, supra, 211 F.2d at 180-186. Compare Glasser v. United States, supra, 315 U.S. at 83-87, 62 S. Ct. at 471-72; Labat v. Bennett, 5 Cir., 1966, 365 F.2d 698, cert. denied, 386 U.S. 991, 87 S. Ct. 1303, 18 L. Ed. 2d 334 (1967).\n\n4.\n\nThe petitioner's final contention with regard to the exclusion of the two veniremen is that their exclusion for cause resulted in the selection of a jury that was incapable of \"'maintain[ing] a link between contemporary community values and the penal system,'\" Woodson v. North Carolina, 428 U.S. 280, 295, 96 S. Ct. 2978, 2987, 49 L. Ed. 2d 944 (1976) (opinion of Stewart, Powell, and Stevens, JJ.), quoting Witherspoon v. Illinois, supra, 391 U.S. at 519 n.15, 88 S. Ct. at 1775 n.15, which thus subjected him to cruel and unusual punishment in violation of the Eighth and Fourteenth Amendments.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Spenkelink points to Woodson, Roberts v. Louisiana, 428 U.S. 325, 96 S. Ct. 3001, 49 L. Ed. 2d 974 (1976), and Gregg v. Georgia, supra, in which the Court held, as it did in Jurek v. Texas, 428 U.S. 262, 96 S. Ct. 2950, 49 L. Ed. 2d 929 (1976), and Proffitt v. Florida, supra, that capital punishment, if imposed through a properly drawn statute by a properly guided sentencing body, does not constitute cruel and unusual punishment, and contends that the Court in those decisions \"relied upon the notion that juries' reflections of enduring community attitudes in regard to the propriety of capital punishment would keep infliction of the death penalty in line with the enduring standards of decency which are the measure of the Eighth Amendment.\" Petitioner's Brief at 58-59. See Trop v. Dulles, 356 U.S. 86, 101, 78 S. Ct. 590, 598, 2 L. Ed. 2d 630 (1958) (plurality opinion) (\"The [Eighth] Amendment must draw its meaning from the evolving standards of decency that mark the progress of a maturing society.\") According to Spenkelink, the exclusion of the two veniremen who were irrevocably against capital punishment under all circumstances resulted in the selection of a jury that did not reflect the full panoply of these \"enduring community attitudes\" about capital punishment, a deficiency that allegedly violates the Eighth Amendment's ban against cruel and unusual punishment as interpreted in Woodson, Roberts, and Gregg, as well as in Jurek and Proffitt. This is so, says the petitioner, even if the veniremen were properly excluded under the Witherspoon rationale.\n\nWe have carefully reviewed the Supreme Court's pronouncements in all five of these decisions and find no support for the petitioner's contention. While the Court in these decisions indicated its approval of properly guided jury participation in the capital punishment sentencing process, see, e.g., Roberts v. Louisiana, supra, 428 U.S. at 335, 96 S. Ct. at 3007 (opinion of Stewart, Powell, and Stevens, JJ.); Woodson v. North Carolina, supra, 428 U.S. at 302, 96 S. Ct. at 2990 (opinion of Stewart, Powell, and Stevens, JJ.); Jurek v. Texas, supra, 428 U.S. at 269-75, 96 S. Ct. at 2955-57 (opinion of Stewart, Powell, and Stevens, JJ.); Proffitt v. Florida, supra, 428 U.S. at 253, 96 S. Ct. at 2966 (opinion of Stewart, Powell, and Stevens, JJ.); Gregg v. Georgia, supra, 428 U.S. at 188-98, 96 S. Ct. at 2932-36 (opinion of Stewart, Powell, and Stevens, JJ.), nowhere in the cited cases did the Court allude to the question of appropriate jury composition in the context of the Eighth and Fourteenth Amendments, much less address the specific contention raised here by the petitioner. In any event, as has already been demonstrated, the jury composition in the instant case was constitutional. Accordingly, the contention is without merit.\n\nB. The Florida Death Penalty Statute\n\nSpenkelink's next series of contentions are directed against the Florida death penalty statute, Fla.Stat.Ann. § 921.141.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e The petitioner attacks the statute as applied, pointing out that the United States Supreme Court's comprehensive review of the statute in Proffitt v. Florida, supra, resulted only in a declaration that Section 921.141 was constitutional on its face. Specifically, Spenkelink contends (1) that the death penalty under Section 921.141 is being applied arbitrarily, capriciously, excessively, and disproportionately in violation of the Eighth and Fourteenth Amendments, (2) that the death penalty under Section 921.141 is being systematically administered so as to induce guilty pleas from defendants charged with capital felonies, which allegedly penalizes these defendants' exercise of their right under the Fifth and Fourteenth Amendments to plead not guilty, (3) that Section 921.141 contains unreliable procedures and standards for determining aggravating circumstances in violation of the Fifth, Sixth, Eighth, and Fourteenth Amendments, (4) that the death penalty under Section 921.141 is being applied in a discriminatory fashion against defendants convicted of murdering whites, as opposed to blacks, in violation of the Eighth and Fourteenth Amendments and in violation of Fourteenth Amendment equal protection, (5) that electrocution, which is Florida's method of carrying out a sentence of capital punishment, is unnecessarily torturous and wantonly cruel in violation of the Eighth and Fourteenth Amendments, and (6) that the death penalty under Section 921.141 is being applied in a discriminatory fashion against males and poor persons in violation of Fourteenth Amendment equal protection.\n\n1.\n\nIn his first contention the petitioner charges that the death penalty under Section 921.141 is being applied arbitrarily and capriciously, as well as excessively and disproportionately,\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e in violation of the prohibition against cruel and unusual punishment in the Eighth and Fourteenth Amendments. Spenkelink points to his own case as evidence of these allegations, contending that \"it is apparent that virtually every death sentence reversed by the Florida Supreme Court has involved a more gruesome set of facts than the instant case.\" Petitioner's Brief at 37. He contends further that \"if the homicide in this case occurred today, it is inconceivable that [he] would be sentenced to death, for a plethora of Florida cases -- all decided after Spinkelink -- indicate that this sort of homicide is not deemed sufficiently heinous in Florida to merit the penalty of death.\" Id. at 40.\n\nThe Florida Legislature enacted Section 921.141 at least in part as a response to Furman v. Georgia, supra. In Furman the Supreme Court held that statutes which grant a jury unbridled discretion in the imposition of the death penalty allow the penalty to be imposed arbitrarily and capriciously, thus violating the ban under the Eighth and Fourteenth Amendments against cruel and unusual punishment. Furman was a 5-4 per curiam decision with each Justice writing a separate opinion in which none of the others joined. Justices Douglas, Brennan, Stewart, White, and Marshall were in the majority, while Chief Justice Burger and Justices Blackmun, Powell, and Rehnquist dissented. Of those in the majority, only Justices Brennan and Marshall found the death penalty unconstitutional per se. 408 U.S. at 370-71, 92 S. Ct. at 2793-94 (Marshall, J., concurring); 408 U.S. at 305-06, 92 S. Ct. at 2760 (Brennan, J., concurring). Justice Douglas, on the other hand, emphasized that standardless capital punishment statutes allow the death penalty to be inflicted in a discriminatory fashion; as he put it, such statutes \"are pregnant with discrimination.\" 408 U.S. at 257, 92 S. Ct. at 2735 (Douglas, J., concurring). Justice White stressed that discretionary statutes result in the death penalty being extracted so infrequently, even for the most atrocious crimes, \"that there is no meaningful basis for distinguishing the few cases in which it is imposed from the many cases in which it is not,\" which causes the penalty to lose its deterrent effect. 408 U.S. at 312-13, 92 S. Ct. at 2764 (White, J., concurring). Justice Stewart felt that such statutes allow the death penalty to be applied \"wantonly\" and \"freakishly\" to \"a capriciously selected random handful.\" 408 U.S. at 309-10, 92 S. Ct. at 2762-63 (Stewart, J., concurring). See The Supreme Court, 1975 Term, 90 Harv.L.Rev. 56, 63 \u0026 n.3 (1976). Furman, then, did not hold that imposition of the death penalty per se violates the Constitution, but only that the manner in which it was being imposed -- arbitrarily and capriciously -- was unconstitutional. See, e.g., Roberts v. Louisiana, supra, 428 U.S. at 335, 92 S. Ct. at 3007 (opinion of Stewart, Powell, and Stevens, JJ.); Woodson v. North Carolina, supra, 428 U.S. at 302, 96 S. Ct. at 2990 (opinion of Stewart, Powell, and Stevens, JJ.); Jurek v. Texas, supra, 428 U.S. at 276, 96 S. Ct. at 2958 (opinion of Stewart, Powell, and Stevens, JJ.); Proffitt v. Georgia, supra, 428 U.S. at 259, 96 S. Ct. at 2970 (opinion of Stewart, Powell, and Stevens, JJ.); Gregg v. Georgia, supra, 428 U.S. at 188, 96 S. Ct. at 2932 (opinion of Stewart, Powell, and Stevens, JJ.)\n\nThat was 1972. In 1976 the Court returned to the subject of capital punishment in Roberts v. Louisiana, supra; Woodson v. North Carolina, supra; Jurek v. Texas, supra; Proffitt v. Florida, supra ; and Gregg v. Georgia, supra. In Gregg, Proffitt, and Jurek the Court found constitutional, in light of Furman, death penalty statutes that articulated standards in the form of aggravating and mitigating circumstances concerning the nature of the crime as well as the nature of the criminal, which judges and juries were to follow in exercising their discretion as to which convicted murderers were to die for their crimes and which were to receive life sentences. In Woodson and Roberts the Court struck down statutes that made the death penalty mandatory for the commission of certain crimes; such statutes, stated the Court, necessarily run afoul of Furman's proscription of unbridled jury discretion in the imposition of capital punishment.\n\nThe Florida statute held constitutional in Proffitt v. Florida, supra, was Section 921.141, the identical statute the petitioner challenges in the case at hand. See also State v. Dixon, 283 So.2d 1 (Fla.1973), cert. denied, 416 U.S. 943, 94 S. Ct. 1950, 40 L. Ed. 2d 295 (1974) (Section 921.141 held constitutional by Florida Supreme Court). Although the Court in Proffitt indicated that its concern was with the constitutionality of the statute on its face, 428 U.S. at 251-54, 96 S. Ct. at 2966-67 (opinion of Stewart, Powell, and Stevens, JJ.), we find quite instructive certain Proffitt passages in considering Spenkelink's contention that the death penalty under Section 921.141 is now being applied arbitrarily, capriciously, excessively, and disproportionately. In Proffitt the Court stated:\n\nThe Florida capital-sentencing procedures thus seek to assure that the death penalty will not be imposed in an arbitrary or capricious manner. Moreover, to the extent that any risk to the contrary exists, it is minimized by Florida's appellate review system, under which the evidence of the aggravating and mitigating circumstances is reviewed and reweighed by the Supreme Court of Florida \"to determine independently whether the imposition of the ultimate penalty is warranted.\" Songer v. State, 322 So.2d 481, 484 (Fla. 1975). See also Sullivan v. State, 303 So.2d 632, 637 (Fla. 1974). The Supreme Court of Florida, like that of Georgia, has not hesitated to vacate a death sentence when it has determined that the sentence should not have been imposed. Indeed, it has vacated eight of the 21 death sentences that it has reviewed to date. See Taylor v. State, 294 So.2d 648 (Fla. 1974); Lamadline v. State, 303 So.2d 17 (Fla. 1974); Slater v. State, 316 So.2d 539 (Fla. 1974); Swan v. State, 322 So.2d 485 (Fla. 1975); Tedder v. State, 322 So.2d 908 (Fla. 1975); Halliwell v. State, 323 So.2d 557 (Fla. 1975); Thompson v. State, 328 So.2d 1 (Fla. 1976); Messer v. State, 330 So.2d 137 (Fla. 1976).\n\nUnder Florida's capital-sentencing procedures, in sum, trial judges are given specific and detailed guidance to assist them in deciding whether to impose a death penalty or imprisonment for life. Moreover, their decisions are reviewed to ensure that they are consistent with other sentence imposed in similar circumstances. Thus, in Florida, as in Georgia, it is no longer true that there is \"'no meaningful basis for distinguishing the few cases in which [the death penalty] is imposed from the many cases where it is not.'\" Gregg v. Georgia, ante, 428 U.S. p. 188, 96 S. Ct. p. 2932, quoting Furman v. Georgia, 408 U.S., at 313, 92 S. Ct., at 2764 (White, J., concurring). On its face the Florida system thus satisfies the constitutional deficiencies identified in Furman.\n\n428 U.S. at 253, 96 S. Ct. at 2967 (opinion of Stewart, Powell, and Stevens, JJ.). Later the Court added:\n\nNonetheless the petitioner attacks the Florida appellate review process because the role of the Supreme Court of Florida in reviewing death sentences is necessarily subjective and unpredictable. While it may be true that that Court has not chosen to formulate a rigid objective test as its standard of review for all cases, it does not follow that the appellate review process is ineffective or arbitrary. In fact, it is apparent that the Florida Court has undertaken responsibly to perform its function of death sentence review with a maximum of rationality and consistency. For example, it has several times compared the circumstances of a case under review with those of previous cases in which it has assessed the imposition of death sentences. See, e.g., Alford v. State, 307 So.2d 433, 445 (Fla. 1975); Alvord v. State, 322 So.2d 533, 540-541 (Fla. 1975). By following this procedure the Florida Court has in effect adopted the type of proportionality review mandated by the Georgia statute. Cf. Gregg v. Georgia, ante, 428 U.S. 204, 206, 96 S. Ct. pp. 2939-2941. And any suggestion that the Florida Court engages in only cursory or rubber stamp review of death penalty cases is totally controverted by the fact that it has vacated over one-third of the death sentences that have come before it. See p. 2967, supra.\n\n428 U.S. at 258, 96 S. Ct. at 2969-70 (opinion of Stewart, Powell, and Stevens, JJ.). Finally, in responding to the argument that Section 921.141's eighth aggravating circumstance was unconstitutionally vague and overbroad, the Court in Proffitt even mentioned the case of petitioner Spenkelink:\n\nThe Supreme Court of Florida has affirmed death sentences in several cases, including the instant case, where this eighth statutory aggravating factor was found, without specifically stating that the homicide was \"pitiless\" or \"torturous to the victim.\" See, e.g., Hallman v. State, 305 So.2d 180 (1974) (victim's throat slit with broken bottle); Spinkellink v. State, 313 So.2d 666 (1975) (\"career criminal\" shot sleeping traveling companion); Gardner v. State, 313 So.2d 675 (1975) (brutal beating and murder); Alvord v. State, 322 So.2d 533 (1975) (three women killed by strangulation, one raped); Douglas v. State, 328 So.2d 18 (1976) (depraved murder); Henry v. State, 328 So.2d 430 (1976) (torture murder); Dobbert v. State, 328 So.2d 433 (1976) (torture and killing of two children). But the circumstances of all of these cases could accurately be characterized as \"pitiless\" and \"unnecessarily torturous,\" and it thus does not appear that Florida Court has abandoned the definition that it announced in Dixon and applied in Alford, Tedder, and Halliwell.\n\n428 U.S. at 255 n. 12, 96 S. Ct. at 2968 n. 12 (opinion of Stewart, Powell, and Stevens, JJ.) (emphasis added).\n\nNonetheless, Spenkelink contends that his crime, in comparison to the crimes in other Florida death penalty cases, was insufficiently gruesome or heinous to warrant the death penalty.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e In this regard, the district court stated:\n\nPetitioner next claims that the death penalty is being imposed in an arbitrary, capricious, and irrational manner. In support of this contention petitioner points to other cases in which the Florida Supreme Court has commuted death sentences to life imprisonment and claims that his case is no worse than the majority of these and cannot, therefore, be reconciled with them. As the court noted at the beginning of the September 21 hearing, this line of inquiry has apparently been foreclosed by the decision rendered in Proffitt v. Florida, 428 U.S. 242, [96 S. Ct. 2960, 49 L. Ed. 2d 913] (1976). . . .\n\nEven if this issue had not been previously decided by the United States Supreme Court, petitioner has shown no basis to conclude that the Florida Supreme Court has failed to discharge its statutory duties responsibly. This court has considered the other death cases decided by the Florida Supreme Court and has compared the facts involved in those cases with the facts of petitioner's crime. In those instances where a sentence of death has been reversed by the Florida court, there appear significant mitigating circumstances that serve to fairly distinguish those cases from petitioner's. Thus, the petitioner has not shown anything to indicate that the death penalty has been imposed by the Florida judicial system in an irrational, arbitrary or capricious fashion, and the petitioner cannot prevail on this point.\n\nIt was not necessary for the district court to undertake such a case-by-case comparison. This conclusion rests upon which we believe the Supreme Court meant in Proffitt when it found Section 921.141 constitutional \"on its face.\" The Court used the expression only twice. On the first occasion the Court stated that \"on their face these procedures [provided for in Section 921.141], like those used in Georgia, appear to meet the constitutional deficiencies identified in Furman.\" 428 U.S. at 251, 96 S. Ct. at 2966 (opinion of Stewart, Powell, and Stevens, JJ.). On the second occasion the Court stated that \"on its face the Florida system thus satisfies the constitutional deficiencies identified in Furman.\" 428 U.S. at 253, 96 S. Ct. at 2967 (opinion of Stewart, Powell, and Stevens, JJ.). The second quotation implies that on its face Section 921.141 conclusively removes the arbitrariness and capriciousness which Furman held violative of the Eighth and Fourteenth Amendments. If this is so, our concern here in this attack on Section 921.141 as applied would be whether the Florida courts have followed the statute in imposing Spenkelink's death sentence, and a comparison of Spenkelink's case with other Florida death penalty cases would be unnecessary. The first quotation, on the other hand, implies that Section 921.141 only potentially satisfies Furman's concern for arbitrariness and capriciousness. If this is so, our task in the instant case would be to compare Spenkelink's case with all other Florida death penalty cases in order to determine if Spenkelink was sentenced to death when other convicted murderers, equally or more deserving to die, were given life imprisonment.\n\nIf this latter interpretation is the correct reading of Proffitt, serious problems arise. First, every criminal defendant sentenced to death under Section 921.141 could through federal habeas corpus proceedings attack the statute as applied by alleging that other convicted murderers, equally or more deserving to die, had been spared, and thus that the death penalty was being applied arbitrarily and capriciously, as evidenced by his own case. The federal courts then would be compelled continuously to question every substantive decision of the Florida criminal justice system with regard to the imposition of the death penalty. The intrusion would not be limited to the Florida Supreme Court. It would be necessary also, in order to review properly the Florida Supreme Court's decisions, to review the determinations of the trial courts. And in order to review properly those determinations, a careful examination of every trial record would be in order. A thorough review would necessitate looking behind the decisions of jurors and prosecutors, as well. Additionally, unsuccessful litigants could, before their sentences were carried out, challenge their sentences again and again as each later-convicted murderer was given life imprisonment, because the circumstances of each additional defendant so sentenced would become additional factors to be considered. The process would be never-ending and the benchmark for comparison would be chronically undefined. Further, there is no reason to believe that the federal judiciary can render better justice. As the Florida Supreme Court itself so candidly admits, see Provence v. State, supra, 337 So.2d at 787, reasonable persons can differ over the fate of every criminal defendant in every death penalty case. If the federal courts retried again and again the aggravating and mitigating circumstances in each of these cases, we may at times reach results different from those reached in the Florida state courts, but our conclusions would be no more, nor no less, accurate. Such is the human condition. Cf. Stone v. Powell, 428 U.S. 465, 493 n. 35, 96 S. Ct. 3037, 3051-3052 n. 35, 49 L. Ed. 2d 1067 (1976) (condemning the respondents' \"basic mistrust of the state courts as fair and competent forums for the adjudication of federal constitutional rights.\").\n\nThe Supreme Court in Proffitt, or in Furman, Gregg, Jurek, Woodson, or Roberts, could not have intended these results. We understand these decisions to hold that capital punishment is not unconstitutional per se, and that a state, if it chooses, can punish murderers and seek to protect its citizenry by imposing the death penalty -- so long as it does so through a statute with appropriate standards to guide discretion. If a state has such a properly drawn statute -- and there can be no doubt that Florida has -- which the state follows in determining which convicted defendants receive the death penalty and which receive life imprisonment, then the arbitrariness and capriciousness condemned in Furman have been conclusively removed.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e For us to read these cases otherwise would thrust this Court and the district courts into the substantive decision making of the state court sentencing process which is rightfully reserved to the Florida state judiciary under Section 921.141. Under the Constitution, as well as fundamental notions of federalism and comity, that is not the role of the federal courts. Cf. Younger v. Harris, 401 U.S. 37, 91 S. Ct. 746, 27 L. Ed. 2d 669 (1971).\n\nA review of the record demonstrates dramatically that the Florida state trial court and the Florida Supreme Court performed their unenviable duty of sentencing Spenkelink under Section 921.141 with care and concern.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Our inquiry must end there. As for Spenkelink's contention that this Court should go further, we think the remarks of Justice White in his concurring opinion in Gregg v. Georgia, supra, 428 U.S. at 226, 96 S. Ct. at 2949 (White, J., concurring), are responsive:\n\nPetitioner's argument that there is an unconstitutional amount of discretion in the system which separates those suspects who receive the death penalty from those who receive life imprisonment a lesser penalty or are acquitted or never charged seems to be in final analysis an indictment of our entire system of justice. Petitioner has argued in effect that no matter how effective the death penalty may be as a punishment, government, created and run as it must be by humans, is inevitably incompetent to administer it. This cannot be accepted as a proposition of constitutional law. Imposition of the death penalty is surely an awesome responsibility for any system of justice and those who participate in it. Mistakes will be made and discriminations will occur which will be difficult to explain. However, one of society's most basic tasks is that of protecting the lives of its citizens and one of the most basic ways in which it achieves the task is through criminal laws against murder. I decline to interfere with the manner in which Georgia has chosen to enforce such laws on what is simply an assertion of lack of faith in the ability of the system of justice to operate in a fundamentally fair manner.\n\nThe petitioner's contention is without merit.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\n2.\n\nIn his second contention Spenkelink asserts that the death penalty under Section 921.141 is being systematically administered so as to induce guilty pleas from defendants charged with capital felonies, which allegedly penalizes exercise by these defendants of their right under the fifth and fourteenth amendments to plead not guilty. According to the petitioner, this has the same effect as the federal statute condemned in United States v. Jackson, 390 U.S. 570, 88 S. Ct. 1209, 20 L. Ed. 2d 138 (1968), and thus is unconstitutional.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nSuccinctly stated, Spenkelink complains of abuse of discretion. Charles William Proffitt and Troy Gregg had similar complaints. In Proffitt v. Florida, supra, 428 U.S. 254, 96 S. Ct. at 2967 (opinion of Stewart, Powell, and Stevens, JJ.), the Supreme Court responded:\n\nThe petitioner first argues that arbitrariness is inherent in the Florida criminal justice system because it allows discretion to be exercised at each stage of a criminal proceeding the prosecutor's decision whether to charge a capital offense in the first place, his decision whether to accept a plea to a lesser offense, the jury's consideration of lesser included offenses, and, after conviction and unsuccessful appeal, the Executive's decision whether to commute a death sentence. As we noted in Gregg, this argument is based on a fundamental misinterpretation of Furman, and we reject it for the reasons expressed in Gregg. See ante, p. 2937.\n\nIn Gregg v. Georgia, supra, 428 U.S. at 199, 96 S. Ct. at 2937 (opinion of Stewart, Powell, and Stevens, JJ.), the Court stated:\n\nFirst, the petitioner focuses on the opportunities for discretionary action that are inherent in the processing of any murder case under Georgia law. He notes that the state prosecutor has unfettered authority to select those persons whom he wishes to prosecute for a capital offense and to plea bargain with them. Further, at the trial the jury may choose to convict a defendant of a lesser included offense rather than find him guilty of a crime punishable by death, even if the evidence would support a capital verdict. And finally, a defendant who is convicted and sentenced to die may have his sentence commuted by the Governor of the State and the Georgia Board of Pardons and Paroles.\n\nThe existence of these discretionary stages is not determinative of the issues before us. At each of these stages an actor in the criminal justice system makes a decision which may remove a defendant from consideration as a candidate for the death penalty. Furman, in contrast, dealt with the decision to impose the death sentence on a specific individual who had been convicted of a capital offense. Nothing in any of our cases suggests that the decision to afford an individual defendant mercy violates the Constitution. Furman held only that, in order to minimize the risk that the death penalty would be imposed on a capriciously selected group of offenders, the decision to impose it had to be guided by standards so that the sentencing authority would focus on the particularized circumstances of the crime and the defendant.\n\nIn footnote 50 in Gregg, the Court continued:\n\nThe petitioner's argument is nothing more than a veiled contention that Furman indirectly outlawed capital punishment by placing totally unrealistic conditions on its use. In order to repair the alleged defects pointed to by the petitioner, it would be necessary to require that prosecuting authorities charge a capital offense whenever arguably there had been a capital murder and that they refuse to plea bargain with the defendant. If a jury refused to convict even though the evidence supported the charge, its verdict would have to be reversed and a verdict of guilty entered or a new trial ordered, since the discretionary act of jury nullification would not be permitted. Finally, acts of executive clemency would have to be prohibited. Such a system, of course, would be totally alien to our notions of criminal justice.\n\nMoreover, it would be unconstitutional. Such a system in many respects would have the vices of the mandatory death penalty statutes we hold unconstitutional today in Woodson v. North Carolina, post, 428 U.S., p. 280, 96 S. Ct. p. 2978, 49 L. Ed. 2d 944 and Roberts v. Louisiana, post, 428 U.S., p. 325, 96 S. Ct. p. 3001, 49 L. Ed. 2d 974. The suggestion that a jury's verdict of acquittal could be overturned and a defendant retried would run afoul of the Sixth Amendment jury-trial guarantee and the Double Jeopardy Clause of the Fifth Amendment. In the federal system it also would be unconstitutional to prohibit a President from deciding, as an act of executive clemency, to reprieve one sentenced to death. U.S.Const., Art. II, § 2.\n\n428 U.S. at 198 n. 50, 96 S. Ct. 2937 n. 50 (opinion of Stewart, Powell, and Stevens, JJ.).\n\nThe complaints of prosecutorial discretion in Gregg and Proffitt, as well as in Jurek v. Texas, supra, 428 U.S. at 273, 96 S. Ct. at 2957 (opinion of Stewart, Powell, and Stevens, JJ.), were made and rejected in the context of Furman's concern for arbitrariness and capriciousness in the imposition of the death penalty. Here, of course, petitioner Spenkelink complains that the discretion approved in Gregg, Proffitt, and Jurek is now being systematically abused. See generally Gregg v. Georgia, supra, 428 U.S. at 225, 96 S. Ct. at 2949 (White, J., concurring). Like the petitioner's argument in Gregg, Spenkelink's argument appears to be \"nothing more than a veiled contention that Furman indirectly outlawed capital punishment by placing totally unrealistic conditions on its use,\" Gregg v. Georgia, supra, 428 U.S. at 198 n. 50, 96 S. Ct. 2937 n. 50, (opinion of Stewart, Powell, and Stevens, JJ.), which Furman did not. Id. Nevertheless, we cannot say with assurance that the petitioner's allegation was answered in Gregg, Proffitt, or Jurek, so we must look further.\n\nSpenkelink's contention is without merit for several reasons. First, in Florida a defendant may be sentenced to death whether he pleads guilty or not guilty. E.g., Surace v. State, 351 So.2d 702 (Fla.1977); Thompson v. State, 351 So.2d 701 (Fla.1977); Lamadline v. State, 303 So.2d 17 (Fla.1974). United States v. Jackson, supra, therefore, is inapplicable to the petitioner's contention because there the condemned statute provided in effect that a defendant could receive the death penalty only if he pleaded not guilty and went to trial. See note 29 supra and accompanying text. Second, the Supreme Court in Bordenkircher v. Hayes, 434 U.S. 357, 365, 98 S. Ct. 663, 669, 54 L. Ed. 2d 604 (1978), recently held that plea-bargaining, in which the prosecutor openly presents a defendant with the unpleasant alternatives of pleading guilty to a lesser charge and foregoing trial or pleading not guilty and facing a more serious charge on which he plainly is subject to prosecution, and for which he would receive upon conviction life imprisonment, does not violate the Due Process Clause of the Fourteenth Amendment. The fact that the prosecutor's plea-bargaining tool in Bordenkircher was life imprisonment and in this case it allegedly is the death penalty is a distinction without a difference. Bordenkircher controls the instant case. See, e.g., Montgomery v. Estelle, 5 Cir., 1978, 568 F.2d 457. Finally, it is well settled that a plea bargain is not invalid per se because it is induced by fear of receiving the death penalty or because in agreeing to the plea bargain the defendant averts the possibility of receiving the death penalty. See, e.g., Brady v. United States, 397 U.S. 742, 747, 90 S. Ct. 1463, 1468, 25 L. Ed. 2d 747 (1970). Thus, if Florida prosecutors actually are using the threat of the death penalty under Section 921.141 in their plea-bargaining to induce guilty pleas, the practice is permissible,\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e and the petitioner's contention is without merit.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\n3.\n\nSpenkelink's third attack on Section 921.141 is that the statute contains unreliable procedures and standards for determining aggravating circumstances. First, the petitioner contends that the indictment alleged no aggravating circumstances, and no other form of notice informing him of the aggravating circumstances on which the State would rely in seeking the death penalty, or which the trial court would consider in imposing it, was given to him prior to the sentencing proceeding. According to the petitioner, this violated his right under Fourteenth Amendment due process and his right under the Sixth and Fourteenth Amendments to be informed of the nature of the charges against him,\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e and hindered his preparation for the rebuttal of the aggravating circumstances found in his case. This contention is without merit.\n\nSpenkelink cites no case, federal or state, which requires the prosecutor to list in the indictment the aggravating circumstances on which he will rely in seeking the death penalty. Whether such a requirement exists is an issue we need not reach in this case. A review of the record indicates that neither Spenkelink nor his attorney objected at trial to the indictment, which Fla.R.Crim.P. 3.190(c) requires in order for the alleged defect to be preserved for appellate review.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e Accordingly, the defect, if any, was waived.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e Wainwright v. Sykes, supra; Tennon v. Ricketts, 5 Cir., 1978, 574 F.2d 1243 [1978]; St. John v. Estelle, 5 Cir., 1977, 563 F.2d 168 (en banc); Nichols v. Estelle, 5 Cir., 1977, 556 F.2d 1330; Loud v. Estelle, 5 Cir., 1977, 556 F.2d 1326, 1329-30. As for Spenkelink's contention that he had no other notice of the aggravating circumstances on which the State would rely or which the trial would consider, we need only point to Fla.Stat.Ann. § 921.141(5), which defines the aggravating circumstances that may be considered by both judge and jury.\n\nSecond, Spenkelink contends that Section 921.141 does not prescribe the standard of proof to govern factual determinations with regard to aggravating circumstances at the sentencing proceeding, and suggests that the Fifth and Fourteenth Amendments require that the appropriate standard be beyond a reasonable doubt. The Florida Supreme Court agrees, as evidenced by its holding in 1973 in State v. Dixon, supra, 283 So.2d at 9:\n\nThe aggravating circumstances of Fla.Stat. § 921.141(6) [ sic ], F.S.A., actually define those crimes -- when read in conjunction with Fla.Stat. §§ 782.04(1) and 794.01(1), F.S.A. -- to which the death penalty is applicable in the absence of mitigating circumstances. As such, they must be proved beyond a reasonable doubt before being considered by judge or jury.\n\nIn accordance with Dixon, the trial court instructed the jury at Spenkelink's sentencing proceeding:\n\nAggravating circumstances must be established beyond a reasonable doubt before they may be considered by you in arriving at your decision. Proof of an aggravating circumstance beyond a reasonable doubt is evidence by which the understanding, judgment and reason of the jury are well satisfied and convinced to the extent of having a full, firm and abiding conviction that the circumstance has been proved to the exclusion of and beyond a reasonable doubt. (emphasis added)\n\nThe petitioner's contention is therefore without merit.\n\nFinally, Spenkelink contends that the aggravating circumstance set forth in Fla.Stat.Ann. § 921.141(5)(h), that \"the capital felony was especially heinous, atrocious, or cruel,\" is vague and overbroad in violation of Fourteenth Amendment due process. In Proffitt v. Florida, supra, 428 U.S. at 255, 96 S. Ct. at 2967-68 (opinion of Stewart, Powell, and Stevens, JJ.), the Supreme Court stated:\n\nThe petitioner asserts that the enumerated aggravating and mitigating circumstances are so vague and so broad that \"virtually any first degree murder convict [is] a candidate for a death sentence.\" In particular, the petitioner attacks the eighth and third statutory aggravating circumstances, which authorize the death penalty to be imposed if the crime is \"especially heinous, atrocious, or cruel,\" or if \"the defendant knowingly created a great risk of death to many persons.\" § 921.141(5)(h), (c) (Supp.1976-1977). These provisions must be considered as they have been construed by the Supreme Court of Florida.\n\nThat Court has recognized that while it is arguable \"that all killings are atrocious, . . . (still) we believe that the Legislature intended something 'especially' heinous, atrocious, or cruel when it authorized the death penalty for first degree murder.\" Tedder v. State, 322 So.2d 908, 910 (Fla. 1975). As a consequence, the Court has indicated that the eighth statutory provision is directed only at \"the conscienceless or pitiless crime which is unnecessarily torturous to the victim.\" State v. Dixon, 283 So.2d 1, 9 (Fla. 1973). See also Alford v. State, 307 So.2d 433, 445 (Fla. 1975); Halliwell v. State, 323 So.2d 557, 561 (Fla. 1975). We cannot say that the provision, as so construed, provides inadequate guidance to those charged with the duty of recommending or imposing sentences in capital cases. See Gregg v. Georgia, ante, 428 U.S. pp. 200, 203, 96 S. Ct. p. 2938.\n\nNonetheless, the petitioner points out that the Court in Proffitt examined the claims of vagueness and overbreadth of the statutory aggravating circumstances \"only insofar as it is necessary to determine whether there is a substantial risk that the Florida capital-sentencing system, when viewed in its entirety, will result in the capricious or arbitrary imposition of the death penalty,\" and thus violate the prohibition under the Eighth and Fourteenth Amendments of cruel and unusual punishment. 428 U.S. at 254 n.11, 96 S. Ct. at 2967 n.11 (opinion of Stewart, Powell, and Stevens, JJ.). See Gregg v. Georgia, supra, 428 U.S. at 201 n.51, 96 S. Ct. at 2938 n.51 (opinion of Stewart, Powell, and Stevens, JJ.). In the instant case, the petitioner contends, his vagueness and overbreadth challenges are made through the Due Process Clause of the Fourteenth Amendment. A review of the record indicates that Spenkelink's allegations of vagueness and overbreadth do not appear in his habeas corpus petition, and therefore were not argued to the district court on the basis of any constitutional amendment. Rather than dismiss his contentions summarily, as we ordinarily would do, only to have them resurface again through another habeas petition, we have decided in the interest of time and judicial economy to address them on their merits.\n\nIn State v. Dixon, supra, the Florida Supreme Court, in holding constitutional Fla.Stat.Ann. §§ 775.082, 782.04, and 921.141, see note 23 supra, also considered the certified question of whether the aggravating circumstance in Section 921.141 (5)(h) is so \"vague, indefinite and uncertain,\" 283 So.2d at 3, as to violate, inter alia, Fourteenth Amendment due process. The court answered this question in the negative:\n\nThe aggravating circumstance which has been most frequently attacked is the provision that commission of an especially heinous, atrocious or cruel capital felony constitutes an aggravated capital felony. Fla.Stat. § 921.141(6)(h), F.S.A. Again, we feel that the meaning of such terms is a matter of common knowledge, so that an ordinary man would not have to guess at what was intended. It is our interpretation that heinous means extremely wicked or shockingly evil; that atrocious means outrageously wicked and vile; and, that cruel means designed to inflict a high degree of pain with utter indifference to, or even enjoyment of, the suffering of others. What is intended to be included are those capital crimes where the actual commission of the capital felony was accompanied by such additional acts as to set the crime apart from the norm of capital felonies -- the conscienceless or pitiless crime which is unnecessarily torturous to the victim.\n\n283 So.2d at 9. This definition has been followed repeatedly by the Florida Supreme Court. See, e.g., Proffitt v. Florida, supra, 428 U.S. at 255 n.12, 96 S. Ct. at 2968 n.12 (opinion of Stewart, Powell, and Stevens, JJ.); Halliwell v. State, supra, 323 So.2d at 561; Tedder v. State, supra, 322 So.2d at 910; Alford v. State, 307 So.2d 433, 444-45 (Fla.1975). Nothing in Smith v. Goguen, 415 U.S. 566, 94 S. Ct. 1242, 39 L. Ed. 2d 605 (1974); Papachristou v. City of Jacksonville, 405 U.S. 156, 92 S. Ct. 839, 31 L. Ed. 2d 110 (1972); Thornhill v. Alabama, 310 U.S. 88, 60 S. Ct. 736, 84 L. Ed. 1093 (1940); or Herndon v. Lowry, 301 U.S. 242, 57 S. Ct. 732, 81 L. Ed. 1066 (1937), the cases cited by the petitioner in support of his vagueness and overbreadth contentions, persuades us that the Florida Supreme Court is in error. We agree on Fourteenth Amendment due process grounds with the United States Supreme Court in Proffitt that Section 921.141(5)(h), as construed by the Florida Supreme Court, provides adequate guidance to those charged with the duty of recommending or imposing sentences in capital cases. See Proffitt v. Florida, supra, 428 U.S. at 255, 96 S. Ct. at 2968 (opinion of Stewart, Powell, and Stevens, JJ.). The contentions that Section 921.141(5)(h) are vague and overbroad are therefore without merit.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e See, e.g., the cases cited in Grayned v. City of Rockford, 408 U.S. 104, 108 n.4, 92 S. Ct. 2294, 2299 n.4, 33 L. Ed. 2d 222 (1972); Note, The Void-for-Vagueness Doctrine in the Supreme Court, 109 U.Pa.L.Rev. 67 (1960).\n\n4.\n\nSpenkelink's next contention is that the death penalty under Section 921.141 is being applied in a discriminatory fashion against defendants convicted of murdering whites, as opposed to blacks, in violation of the prohibition under the Eighth and Fourteenth Amendments of cruel and unusual punishment and in violation of Fourteenth Amendment equal protection.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Spenkelink's contention appears to be that Florida prosecutors, jurors, trial judges, and supreme court justices value black lives less than they do white lives, and thus are more likely to seek, recommend, impose, and affirm the imposition of the death penalty when a defendant murders a white victim.\n\nDuring the evidentiary hearing below the petitioner introduced evidence through an expert witness that, although the estimated number of black felony murder victims and white felony murder victims for 1973-1976 is the same, 92 per cent of the inmates on Florida death row had murdered white victims, while only 8 per cent had murdered black victims. The State responded by arguing, inter alia, that murders involving black victims have, in the past, generally been qualitatively different from murders involving white victims; as a general rule, the State contended, murders involving black victims have not presented facts and circumstances appropriate for imposition of the death penalty.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e The State also challenged the accuracy and reliability of the methodology used by the petitioner's expert witness. Many of these imperfections the witness himself admitted. For example, he conceded that factors other than race could have caused the disparate figures:\n\nQ. With regard to the conclusions that you have reached that there is a variance of black victims and white victims as to who gets the electric chair in Florida. What are the other variables?\n\nA. I don't understand your question, Mr. Shevin.\n\nQ. Well, for instance, would the prosecutorial discretion as to what charges be filed, would that be relevant?\n\nA. Sure.\n\nQ. And would the prosecutor's decision as to whether or not to take the case to the Grand Jury be a relevant variable?\n\nA. Well, as I testified, I have no knowledge of the process that stands between the arrest and the final disposition, and that is exactly the thing one should explore in order to find out how these differences come about. All I have is the final difference.\n\nQ. So in analyzing what happens from the arrest to the final judgment, your rule could be affected, could they not, by decisions of whether or not to prosecute?\n\nA. Oh, sure. I said that.\n\nQ. And it could be affected by what verdicts the juries returned?\n\nA. Could, although my guess -- yes, it could, sure. I said it could be affected at all stages, Mr. Shevin.\n\nQ. And it could be affected by whether the defendant pleads guilty or not?\n\nA. If this -- if this -- I -- if this saves many people, I have -- I have seen --.\n\nQ. Can it be affected by whether the prosecutor is asking for the death penalty, could it not?\n\nA. I said so.\n\nQ. All right. And it could be affected by the elements of aggravation and mitigation that are set forth in the Florida statutes?\n\nA. Of course.\n\nThe witness also was unable to point to any defendant convicted of first degree murder for killing a black who, under the facts and circumstances of the case, should have received the death penalty but did not. Nevertheless, petitioner Spenkelink contends that he has made a prima facie case of racial discrimination in the imposition of the death penalty in Florida, and that we should remand his case to the district court for additional evidentiary proceedings to provide him the opportunity to present further evidence.\n\nAssuming for the sake of argument that the petitioner's statistics are accurate, his contention must fail as a matter of law on both of the constitutional grounds relied upon. The allegation that Florida's death penalty is being discriminatorily applied to defendants who murder whites is nothing more than an allegation that the death penalty is being imposed arbitrarily and capriciously, a contention we previously have considered and rejected. To allege discriminatory application of the death penalty, as meant in the context of this case, is to argue that defendants who have murdered whites have received the death penalty when other defendants who have murdered blacks, and who are equally or more deserving to die, have received life imprisonment. In order to ascertain through federal habeas corpus proceedings if the death penalty had been discriminatorily imposed upon a petitioner whose murder victim was white, a district court would have to compare the facts and circumstances of the petitioner's case with the facts and circumstances of all other Florida death penalty cases involving black victims in order to determine if the first degree murderers in those cases were equally or more deserving to die. The petitioner thus requests the same type of case-by-case comparison by the federal judiciary that we have previously rejected in considering the petitioner's contention that Florida's death penalty is being imposed arbitrarily and capriciously. We need not repeat the myriad of difficult problems, legal and otherwise, generated by such federal court intrusion into the substantive decision making of the sentencing process which is reserved to the Florida state courts under Section 921.141. As we previously noted, this Court reads Furman, Gregg, Proffitt, Jurek, Woodson, and Roberts as holding that if a state follows a properly drawn statute in imposing the death penalty, then the arbitrariness and capriciousness -- and therefore the racial discrimination -- condemned in Furman\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e have been conclusively removed.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Florida has such a statute and it is being followed. The petitioner's contention under the Eighth and Fourteenth Amendments is therefore without merit.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nSpenkelink also raises his claim under Fourteenth Amendment equal protection. He concedes that Section 921.141 is facially valid and neutral with respect to race. He contends nonetheless that the administration of the statute has resulted in \"dramatic racial inequity,\" Petitioner's Brief at 36, which allegedly violates equal protection.\n\nThe petitioner's suggestion that a violation of equal protection is proved by a showing of disparity in the race of first degree murder victims, which allegedly results from the administration of a facially valid and neutral statute, ignores the holdings of two recent United States Supreme Court opinions. In Washington v. Davis, 426 U.S. 229, 96 S. Ct. 2040, 48 L. Ed. 2d 597 (1976), the Court held that a District of Columbia Metropolitan Police Department entrance examination designed to test verbal ability, vocabulary, reading, and comprehension did not violate Fourteenth Amendment equal protection, even though the examination had a racially disproportionate impact in that far more blacks than whites failed to pass it. In so holding, the Court noted that while \"the central purpose of the Equal Protection Clause of the Fourteenth Amendment is the prevention of official conduct discriminating on the basis of race,\" prior Court decisions \"have not embraced the proposition that a law or other official act, without regard to whether it reflects a racially discriminatory purpose, is unconstitutional solely because it has a racially disproportionate impact.\" 426 U.S. at 239, 96 S. Ct. at 2047 (emphasis in original). The Court also stated:\n\nNecessarily, an invidious discriminatory purpose may often be inferred from the totality of the relevant facts, including the fact, if it is true, that the law bears more heavily on one race than another. It is also not infrequently true that the discriminatory impact in the jury cases for example, the total or seriously disproportionate exclusion of Negroes from jury venires -- may for all practical purposes demonstrate unconstitutionality because in various circumstances the discrimination is very difficult to explain on nonracial grounds. Nevertheless, we have not held that a law, neutral on its face and serving ends otherwise within the power of government to pursue, is invalid under the Equal Protection Clause simply because it may affect a greater proportion of one race than of another. Disproportionate impact is not irrelevant, but it is not the sole touchstone of an invidious racial discrimination forbidden by the Constitution. Standing alone, it does not trigger the rule, McLaughlin v. Florida, 379 U.S. 184, 85 S. Ct. 283, 13 L. Ed. 2d 222 (1964), that racial classifications are to be subjected to the strictest scrutiny and are justifiable only by the weightiest of considerations.\n\n426 U.S. at 242, 96 S. Ct. at 2049. A year later, in Village of Arlington Heights v. Metropolitan Housing Development Corp., supra, the Court held that the refusal of the Village of Arlington Heights to rezone a tract of land in order to allow the Metropolitan Housing Development Corporation to build racially integrated low and moderate income housing did not violate Fourteenth Amendment equal protection, because the Village's rezoning denial was motivated not by racial discrimination but by its desire to protect property values and maintain its zoning plan. The Court relied on Washington v. Davis, supra, in announcing that \"official action will not be held unconstitutional solely because it results in a racially disproportionate impact,\" and that \"proof of racially discriminatory intent or purpose is required to show a violation of the Equal Protection Clause.\" 429 U.S. at 265, 97 S. Ct. at 563.\n\nAssuming for the sake of discussion that Section 921.141 does have a racially disproportionate impact with respect to the race of first degree murder victims, Washington v. Davis, supra, and Arlington Heights mandate that the petitioner's equal protection challenge must fail, because the discrimination is explainable on nonracial grounds. Florida offered credible evidence, evidently believed by the district court, that murders involving black victims generally have been qualitatively different from murders involving white victims. The petitioner's own expert witness also testified that factors other than race could have caused the disparate figures, and could single out no defendant convicted of first degree murder for killing a black who, under the facts and circumstances of the case, should have received the death penalty instead of life imprisonment. The petitioner's witness testified further that he found no evidence of intentional or purposeful discrimination; \"I'm far from suggesting,\" he stated, \"that there is any deliberate effort anywhere in the system to achieve this goal [of racially disproportionate impact].\" In sum, this is not a case in which a petitioner proved a prima facie case of discrimination that the state could not rebut. Compare, e.g., Castaneda v. Partida, 430 U.S. 482, 97 S. Ct. 1272, 51 L. Ed. 2d 498 (1977). This is a case in which the State, with the assistance of the petitioner's own expert witness, provided several lawful explanations totally unrelated to race for the racially disproportionate impact of its statute.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e Stated otherwise, it is a case in which the petitioner could not prove racially discriminatory intent or purpose as required by Washington v. Davis, supra, and Arlington Heights. See Nevette v. Sides, 5 Cir., 1978, 571 F.2d 209. Spenkelink's challenge to Section 921.141 on the basis of Fourteenth Amendment equal protection is therefore without merit as a matter of law.\n\n5.\n\nThe petitioner's fifth contention is that electrocution, which is Florida's method of carrying out a sentence of capital punishment, see Fla.Stat.Ann. § 922.10, is unnecessarily torturous and wantonly cruel and therefore constitutes cruel and unusual punishment in violation of the Eighth and Fourteenth Amendments. The Supreme Court has previously considered this assertion in In re Kemmler, 136 U.S. 436, 10 S. Ct. 930, 34 L. Ed. 519 (1890), quoted in Gregg v. Georgia, supra, 428 U.S. at 170, 96 S. Ct. at 2924 (opinion of Stewart, Powell, and Stevens, JJ.), where the Court held that a New York statute providing for electrocution as the method of carrying out a sentence of capital punishment was constitutional. The Court stated:\n\nUndoubtedly the [fourteenth] amendment forbids any arbitrary deprivation of life, liberty, or property, and secures equal protection to all under like circumstances in the enjoyment of their rights; and, in the administration of criminal justice, requires that no different or higher punishment shall be imposed upon one than is imposed upon all for like offenses. But it was not designed to interfere with the power of the state to protect the lives, liberties, and property of its citizens, and to promote their health, peace, morals, education, and good order. Barbier v. Connolly, 113 U.S. 27, 31, 5 Sup.Ct.Rep. 357, 28 L. Ed. 923. The enactment of this statute was, in itself, within the legitimate sphere of the legislative power of the state, and in the observance of those general rules prescribed by our systems of jurisprudence; and the legislature of the state of New York determined that it did not inflict cruel and unusual punishment, and its courts have sustained that determination. We cannot perceive that the state has thereby abridged the privileges or immunities of the petitioner, or deprived him of due process of law.\n\n136 U.S. at 448-49, 10 S. Ct. at 934. Accord, Louisiana ex rel. Francis v. Resweber, 329 U.S. 459, 67 S. Ct. 374, 91 L. Ed. 422 (1947), quoted in Gregg v. Georgia, supra, 428 U.S. at 170, 96 S. Ct. at 2924 (opinion of Stewart, Powell, and Stevens, JJ.). See generally Ex parte Granviel, 561 S.W.2d 503 (Tex.Cr.App. 1978) (execution by intravenous injection of lethal substance is not cruel and unusual punishment). The petitioner's contention is therefore without merit.\n\n6.\n\nThe petitioner, an indigent male, contends finally that the death penalty under Section 921.141 is being applied in a discriminatory fashion against males and poor persons in violation of the Equal Protection Clause of the Fourteenth Amendment. Although the petitioner asserts his claim under the guise of Fourteenth Amendment equal protection, closer examination reveals that at its core lies the charge of arbitrary and capricious conduct. Male and indigent murderers, the petitioner in effect contends, have in Florida received the death penalty under Section 921.141, while women and nonindigent murderers, equally or more deserving to die, have received life imprisonment. For reasons that we have already detailed at length, the contention that the death penalty under Section 921.141 is being applied arbitrarily and capriciously must fail as a matter of law except under exceptional circumstances.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e Accordingly, the petitioner's contention is meritless.\n\nC. Florida's Clemency Procedures\n\nThe petitioner's next contention is that the Florida Rules of Executive Clemency violate the Due Process Clause of the Fourteenth Amendment. We do not agree.\n\nArticle IV, section 8(a) of the Florida Constitution provides that \"except in cases of treason and in cases where impeachment results in conviction, the governor may, by executive order filed with the secretary of state, . . . and, with the approval of three members of the cabinet, grant full or conditional pardons, restore civil rights, commute punishment, and remit fines and forfeitures for offenses.\" The governor and the cabinet of Florida, \"in order to assist in the orderly and expeditious exercise of this clemency power,\" Fla.R.Exec. Clemency 2, established by executive order the Florida Rules of Executive Clemency, which are set forth in Appendix B of our opinion. The procedures provided for in these rules are detailed and comprehensive:\n\nThe newly devised death sentence review process operates very much like all other administrative processes in the executive branch of Florida's government. The rules adopted for this purpose establish an \"Office of Executive Clemency\" headed by a \"coordinator\" and staffed by assistants. A \"proper record\" of all proceedings is maintained. Precise steps for review are prescribed, channeled by precise time frames, and the process once triggered requires (i) a hearing examiner to take written or oral testimony, (ii) an informal evidentiary proceeding, (iii) a required report to be filed by the hearing examiner within 60 days, (iv) a required hearing before the Governor and cabinet, (v) notice to applicants' attorneys and to counsel for the state, (vi) authority for both counsel to file \"exceptions, briefs or memoranda\" concerning the examiner's report, (vii) a prohibition against direct communications to the Governor or any cabinet member during the pendency of the proceedings, and (viii) a public explanation for granting or not granting clemency.\n\nSullivan v. Askew, 348 So.2d 312, 318 (Fla.) (England, J., concurring), cert. denied, 434 U.S. 878, 98 S. Ct. 232, 54 L. Ed. 2d 159 (1977). Their constitutionality has been reviewed and upheld by the Florida Supreme Court. Sullivan v. Askew, supra.\n\nSpenkelink contends nonetheless that these procedures are fundamentally unfair and violate Fourteenth Amendment due process because they allegedly (1) denied him an impartial tribunal because the state attorney general who defended his death sentence in the courts sits as a member of the cabinet and reviews death sentences, (2) denied him the privilege of personally attending the hearing conducted by the governor and cabinet, (3) denied him disclosure of the evidence relied upon by the Florida Parole and Probation Commission in reaching an adverse recommendation with respect to his clemency, which was forwarded to the governor and cabinet, and (4) denied him notice of the standards and criteria followed by the governor and cabinet in reaching their clemency decisions. The issues presented by the petitioner, therefore, are whether the Due Process Clause of the Fourteenth Amendment applies to clemency decisions by the governor and cabinet of Florida, and, if so, whether the Rules of Executive Clemency comport with the standards of procedural due process. Our answer to the first question renders unnecessary our consideration of the second.\n\nIn Sullivan v. Askew, supra, the Florida Supreme Court addressed the constitutionality of the Rules of Executive Clemency. The court held that the petitioner's complaint, which raised the same contentions as Spenkelink raises here, failed to state a cause of action because \"the clemency power is exclusively in the executive branch.\" 348 So.2d at 314. The court relied heavily on the doctrine of separation of powers and cited with approval its opinion in Ex parte White, 131 Fla. 83, 178 So. 876 (1938), which declared a state legislative enactment unconstitutional because it was \"in conflict with and in derogation of the constitutionally established execution [ sic ] power of clemency.\" 348 So.2d at 316. \"This prohibition against legislative encroachment upon the executive's clemency power,\" stated the court in Sullivan, \"is equally applicable to the judiciary.\" Id.\n\nThe opinion in Sullivan, while instructive and well reasoned, is not dispositive, because it is unclear whether the justices were relying on the Florida Constitution or the United States Constitution. Our inquiry, of course, involves the latter. Two other decisions, both by the United States Supreme Court and both involving federal constitutional law, provide us further guidance. In Schick v. Reed, 419 U.S. 256, 95 S. Ct. 379, 42 L. Ed. 2d 430 (1974), the Supreme Court turned away the petitioner's challenge to the president's pre-Furman clemency decision in his case. The Court held that the president, acting under article II, section 2, clause 1 of the United States Constitution, which provides in part that the president \"shall have Power to grant Reprieves and Pardons for Offences against the United States, except in Cases of Impeachment,\" could commute a prisoner's sentence from death to life imprisonment, subject to the condition that he would not thereafter be eligible for parole. Chief Justice Burger, writing for the Court, delved into the historical origins of the president's clemency power, and then wrote a thoughtful analysis of the limits of that power. The Chief Justice concluded:\n\nA fair reading of the history of the English pardoning power, from which our Art. II, § 2, cl. 1, derives, of the language of that clause itself, and of the unbroken practice since 1790 compels the conclusion that the power flows from the Constitution alone, not from any legislative enactments, and that it cannot be modified, abridged, or diminished by the Congress. Additionally, considerations of public policy and humanitarian impulses support an interpretation of that power so as to permit the attachment of any condition which does not otherwise offend the Constitution. The plain purpose of the broad power conferred by § 2, cl. 1, was to allow plenary authority in the President to \"forgive\" the convicted person in part or entirely, to reduce a penalty in terms of a specified number of years, or to alter it with conditions which are in themselves constitutionally unobjectionable. . . . We therefore hold that the pardoning power is an enumerated power of the Constitution and that its limitations, if any, must be found in the Constitution itself.\n\n419 U.S. at 266-67, 95 S. Ct. at 385. Schick, therefore, stands for the proposition that the substantive discretion of the president in the exercise of his clemency power is all but absolute.\n\nIn Meachum v. Fano, 427 U.S. 215, 96 S. Ct. 2532, 49 L. Ed. 2d 451 (1976), the Supreme Court held that the Due Process Clause of the Fourteenth Amendment does not entitle \"a state prisoner to a hearing when he is transferred to a prison the conditions of which are substantially less favorable to the prisoner, absent a state law or practice conditioning such transfers on proof of serious misconduct or the occurrence of other events.\" 427 U.S. at 216, 96 S. Ct. at 2534. The Court found that such transfers do not infringe or implicate a \"liberty\" interest within the meaning of the Due Process Clause, because \"given a valid conviction, the criminal defendant has been constitutionally deprived of his liberty to the extent that the State may confine him and . . . subject him to the rules of its prison system so long as the conditions of confinement do not otherwise violate the Constitution.\" In short, \"the conviction has sufficiently extinguished the defendant's liberty interest to empower the State to confine him in any of its prisons.\" 427 U.S. at 224, 96 S. Ct. at 2538. To hold otherwise, stated the Court, \"would place the [Due Process] Clause astride the day-to-day functioning of state prisons and involve the judiciary in issues and discretionary decisions that are not the business of federal judges.\" 427 U.S. at 228, 96 S. Ct. at 2540.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e Accord, Montanye v. Haymes, 427 U.S. 236, 96 S. Ct. 2543, 49 L. Ed. 2d 466 (1976).\n\nSchick and Meachum compel us to reject Spenkelink's contention. Meachum indicates that the clemency decision of the governor and cabinet of Florida did not infringe or implicate any interest protected by the Due Process Clause. As we have already held, Spenkelink was constitutionally sentenced to die upon affirmance of his sentence by the Florida Supreme Court. That affirmance empowered the State then to execute him. See Cruz v. Skelton, 5 Cir., 1976, 543 F.2d 86, 89, cert. denied, 433 U.S. 911, 97 S. Ct. 2980, 53 L. Ed. 2d 1096 (1977); Brown v. Lundgren, 5 Cir., 528 F.2d 1050, 1052-53, cert. denied, 429 U.S. 917, 97 S. Ct. 308, 50 L. Ed. 2d 283 (1976); Hoffa v. Saxbe, D.D.C., 1974, 378 F. Supp. 1221, 1245. But it did not. The governor and cabinet, pursuant to established procedures, wisely chose to consider whether the petitioner was entitled to mercy. See Gregg v. Georgia, supra, 428 U.S. at 200 n.50, 96 S. Ct. at 2937 n. 50 (opinion of Stewart, Powell, and Stevens, JJ.). (A capital punishment system devoid of executive clemency \"would be totally alien to our notions of criminal justice.\"). This Court is not prepared to hold that in so choosing Florida's executive branch triggered the requirements of Fourteenth Amendment procedural due process.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e To hold otherwise would involve both the federal and state judiciaries in issues and discretionary decisions which, as Schick v. Reed, supra, intimates, are not the business of judges. See Solesbee v. Balkcom, 339 U.S. 9, 70 S. Ct. 457, 94 L. Ed. 604 (1950); Sullivan v. Askew, supra. Cf. United States v. Nixon, 418 U.S. 683, 94 S. Ct. 3090, 41 L. Ed. 2d 1039 (1974).\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e The petitioner's contention is therefore without merit.\n\nD. Miranda Violation\n\nThe petitioner's next contention is that the admission of one of his custodial statements into evidence at trial violated his constitutional rights under the Fifth, Sixth, and Fourteenth Amendments as defined in Brewer v. Williams, 430 U.S. 387, 97 S. Ct. 1232, 51 L. Ed. 2d 424 (1977), and Miranda v. Arizona, 384 U.S. 436, 86 S. Ct. 1602, 16 L. Ed. 2d 694 (1966). A review of the record indicates that neither the petitioner nor his attorney objected at trial to the admission of the statement. Fla.R.Crim.P. 3.190(i) requires such a contemporaneous objection in order to preserve the matter for appellate review.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e We agree with the Florida Supreme Court, Spenkelink v. State, supra, 350 So.2d at 85, that this situation falls squarely within the holding of Wainwright v. Sykes, supra. No cause or prejudice having been shown, the objection was waived. See Tennon v. Ricketts, supra; St. John v. Estelle, supra; Nichols v. Estelle, supra; Loud v. Estelle, supra, 556 F.2d at 1329-30.\n\nE. Lockett v. Ohio\n\nSpenkelink has submitted a post-argument brief in which he contends that Florida's Section 921.141 is unconstitutional under the recent United States Supreme Court holding in Lockett v. Ohio, 438 U.S. 586, 98 S. Ct. 2954, 57 L. Ed. 2d 973 (1978). In Lockett the Court held \"that the Eighth and Fourteenth Amendments require that the sentencer, in all but the rarest kind of capital case, not be precluded from considering as a mitigating factor, any aspect of a defendant's character or record and any of the circumstances of the offense that the defendant proffers as a basis for a sentence less than death.\" 98 S. Ct. at 2965 (plurality opinion) (emphasis in original). On the basis of language in Cooper v. State, 336 So.2d 1133, 1139 (Fla.1976),\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e Spenkelink contends that Section 921.141 impermissibly limits the mitigating factors which the judge and jury can consider in assessing the death penalty, and therefore must be declared unconstitutional. We disagree.\n\nWhen the Supreme Court in Proffitt v. Florida, supra, first approved the constitutionality of Florida's death penalty statute, it stated that Section 921.141 contains no limiting language with respect to the mitigating circumstances that the judge and jury can consider. In footnote 8 of their Proffitt opinion, Justices Stewart, Powell, and Stevens said:\n\nIn one case the Florida Court upheld a death sentence where the trial judge had simply listed six aggravating factors as justification for the sentence he imposed. Sawyer v. State, 313 So.2d 680 (1975). Since there were no mitigating factors, and since some of these aggravating factors arguably fell within the statutory categories it is unclear whether the Florida Court would uphold a death sentence that rested entirely on nonstatutory aggravating circumstances. It seems unlikely that it would do so since the capital-sentencing statute explicitly provides that \"aggravating circumstances shall be limited to the following [eight specified factors.].\" § 921.141(5) (Supp.1976-1977). (Emphasis added.) There is no such limiting language introducing the list of statutory mitigating factors. See § 921.141(6) (Supp.1976-1977). See also n. 14 infra.\n\nProffitt v. Florida, supra, 428 U.S. at 250 n. 8, 96 S. Ct. at 2965-66 n. 8 (opinion of Stewart, Powell, and Stevens, JJ.). Justice White, joined by Chief Justice Burger and Justice Rehnquist, accepted this interpretation of the Florida statute. Id., 428 U.S. at 260, 96 S. Ct. at 2970 (White, J., concurring). Later, in Lockett, the Court reaffirmed the constitutionality of Florida's Section 921.141:\n\nAlthough the Florida statute approved in Proffitt contained a list of mitigating factors, six members of this Court assumed, in approving the statute, that the range of mitigating factors listed in the statute was not exclusive. . . . None of the statutes we sustained in Gregg and the companion cases clearly operated at that time to prevent the sentencer from considering any aspect of the defendant's character and record or any circumstances of his offense as an independently mitigating factor.\n\nLockett v. Ohio, supra, 98 S. Ct. at 2966 (plurality opinion). The Ohio statute, noted the Court, is \"significantly different,\" and therefore must fall. Id. It is unmistakably clear from this language in Lockett that the Court still views Gregg v. Georgia, supra, and the companion cases, one of which was Proffitt v. Florida, supra, as sound law. The conclusion is inevitable that the Court continues to view Section 921.141 as constitutional, as it did in 1976 when it decided Proffitt. Obviously, we are without power or authority to overrule the express finding of the Supreme Court.\n\nThe Court's language in Lockett, to the effect that when Proffitt was decided, Section 921.141 did not \"at that time . . . prevent the sentencer from considering any aspect of the defendant's character and record or any circumstances of his offense as an independently mitigating factor,\" Lockett v. Ohio, supra, 98 S. Ct. at 2966 (plurality opinion), is also important. Cooper v. State, supra, the case relied upon by Spenkelink, was not decided until July 8, 1976. Spenkelink was sentenced on December 20, 1973, and his conviction affirmed by the Florida Supreme Court on February 19, 1975. At the time of the sentencing proceeding, Spenkelink was afforded, and exercised, without limitation, every opportunity to set forth any and all mitigating factors in his favor. He contended, for example, that he should not receive the death penalty because his killing of Szymankiewicz was in self-defense, though that defense is not one of the mitigating circumstances expressly set forth in Section 921.141(6). Moreover, the trial court instructed the jury that, in addition to the evidence presented at the sentencing hearing, it was to consider also the evidence presented at trial. The mitigating circumstance of provocation, possibly resulting from the alleged episodes of homosexuality and \"Russian roulette,\" see note 3 supra, was thus before the jury and the judge, even though provocation also is not one of the mitigating circumstances expressly mentioned in Section 921.141(6). A reading of the transcript of the sentencing hearing therefore indicates that the hearing was full, fair, and thoroughly complete. We find no merit to the post-argument contention of the petitioner.\n\nAfter considering each of the petitioner's contentions and finding them to be without merit, we agree with the district court's denial of a writ of habeas corpus and accordingly affirm that judgment.\n\nAFFIRMED.\n\nDisposition\n\nAFFIRMED.\n\n\u003cspan class=\"fn\"\u003e1. Although some state and federal courts have spelled the petitioner's surname \"Spinkellink,\" the correct spelling, according to the petitioner's brief, is \"Spenkelink.\" Petitioner's Brief at 3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Spenkelink told the proprietor that Szymankiewicz was his brother, that Szymankiewicz was so drunk that Spenkelink could not get him into their automobile, and that Szymankiewicz therefore would be left behind. Spenkelink then paid for an extra night's lodging.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Spenkelink contends that he murdered Szymankiewicz in self-defense following a scuffle between the two after Spenkelink had returned to the motel room to retrieve certain belongings that Szymankiewicz allegedly had stolen. Florida contends that Spenkelink murdered Szymankiewicz while he was asleep in bed. The United States Supreme Court in Proffitt v. Florida, 428 U.S. 242, 255 n. 12, 96 S. Ct. 2960, 2968 n. 12, 49 L. Ed. 2d 913 (1976) (opinion of Stewart, Powell, and Stevens, JJ.) described the circumstances in Spenkelink's case as \"'career criminal' shot sleeping traveling companion.\" Spenkelink contends also that some time before the shooting Szymankiewicz had antagonized and provoked him by, among other things, using him as the target for a game of \"Russian roulette\" and forcing him to commit oral sodomy at gunpoint. Unfortunately, the only witness to these alleged activities is Szymankiewicz, who is now dead. The jury apparently disbelieved Spenkelink, as evidenced by its verdict and recommended sentence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. For additional facts concerning the petitioner's crime, trial, and conviction, see Spinkellink v. State, 313 So.2d 666 (Fla.1975), cert. denied, 428 U.S. 911, 96 S. Ct. 3227, 49 L. Ed. 2d 1221 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The first degree murder statute under which the petitioner was convicted states: (a) The unlawful killing of a human being, when perpetrated from a premeditated design to effect the death of the person killed or any human being, or when committed by a person engaged in the perpetration of, or in the attempt to perpetrate, any arson, involuntary sexual battery, robbery, burglary, kidnapping, aircraft piracy, or unlawful throwing, placing, or discharging of a destructive device or bomb, or which resulted from the unlawful distribution of heroin by a person 18 years of age or older when such drug is proven to be the proximate cause of the death of the user, shall be murder in the first degree and shall constitute a capital felony, punishable as provided in § 775.082. (b) In all cases under this section, the procedure set forth in § 921.141 shall be followed in order to determine sentence of death or life imprisonment. Fla.Stat.Ann. § 782.04(1) (West 1976). The statute has since been amended. Fla.Stat.Ann. § 782.04(1)(a)(West Supp. 1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Fla.Stat.Ann. § 775.082(1) provides: A person who has been convicted of a capital felony shall be punished by life imprisonment and shall be required to serve no less than 25 years before becoming eligible for parole unless the proceeding held to determine sentence according to the procedure set forth in § 921.141 results in findings by the court that such person shall be punished by death, and in the latter event such person shall be punished by death.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Fla.Stat.Ann. § 921.141 provides: (1) Separate proceedings on issue of penalty. -- Upon conviction or adjudication of guilt of a defendant of a capital felony, the court shall conduct a separate sentencing proceeding to determine whether the defendant should be sentenced to death or life imprisonment as authorized by s. 775.082. The proceeding shall be conducted by the trial judge before the trial jury as soon as practicable. If, through impossibility or inability, the trial jury is unable to reconvene for a hearing on the issue of penalty, having determined the guilt of the accused, the trial judge may summon a special juror or jurors as provided in chapter 913 to determine the issue of the imposition of the penalty. If the trial jury has been waived, or if the defendant pleaded guilty, the sentencing proceeding shall be conducted before a jury impaneled for that purpose, unless waived by the defendant. In the proceeding, evidence may be presented as to any matter that the court deems relevant to sentence, and shall include matters relating to any of the aggravating or mitigating circumstances enumerated in subsections (5) and (6). Any such evidence which the court deems to have probative value may be received, regardless of its admissibility under the exclusionary rules of evidence, provided the defendant is accorded a fair opportunity to rebut any hearsay statements. However, this subsection shall not be construed to authorize the introduction of any evidence secured in violation of the constitutions of the United States or of the State of Florida. The state and the defendant or his counsel shall be permitted to present argument for or against sentence of death. (2) Advisory sentence by the jury. -- After hearing all the evidence, the jury shall deliberate and render an advisory sentence to the court, based upon the following matters: (a) Whether sufficient aggravating circumstances exist as enumerated in subsection (5); (b) Whether sufficient mitigating circumstances exist as enumerated in subsection (6), which outweigh the aggravating circumstances found to exist; and (c) Based on these considerations, whether the defendant should be sentenced to life imprisonment or death. (3) Findings in support of sentence of death. -- Notwithstanding the recommendation of a majority of the jury, the court, after weighing the aggravating and mitigating circumstances shall enter a sentence of life imprisonment or death, but if the court imposes a sentence of death, it shall set forth in writing its findings upon which the sentence of death is based as to the facts: (a) That sufficient aggravating circumstances exist as enumerated in subsection (5), and (b) That there are insufficient mitigating circumstances, as enumerated in subsection (6), to outweigh the aggravating circumstances. In each case in which the court imposes the death sentence, the determination of the court shall be supported by specific written findings of fact based upon the circumstances in sub sections (5) and (6) and upon the records of the trial and the sentencing proceedings. If the court does not make the find ings requiring the death sentence, the court shall impose sentence of life imprisonment in accordance with s. 775.082. (4) Review of judgment and sentence. -- The judgment of conviction and sentence of death shall be subject to automatic review by the Supreme Court of Florida within sixty (60) days after certification by the sentencing court of the entire record, unless the time is extended for an additional period not to exceed thirty (30) days by the Supreme Court for good cause shown. Such review by the Supreme Court shall have priority over all other cases and shall be heard in accordance with rules promulgated by the Supreme Court. (5) Aggravating circumstances. -- Aggravating circumstances shall be limited to the following: (a) The capital felony was committed by a person under sentence of imprisonment. (b) The defendant was previously convicted of another capital felony or of a felony involving the use or threat of violence to the person. (c) The defendant knowingly created a great risk of death to many persons. (d) The capital felony was committed while the defendant was engaged, or was an accomplice, in the commission of, or an attempt to commit, or flight after committing or attempting to commit, any robbery, rape, arson, burglary, kidnapping, or aircraft piracy or the unlawful throwing, placing, or discharging of a destructive device or bomb. (e) The capital felony was committed for the purpose of avoiding or preventing a lawful arrest or effecting an escape from custody. (f) The capital felony was committed for pecuniary gain. (g) The capital felony was committed to disrupt or hinder the lawful exercise of any governmental function or the enforcement of laws. (h) The capital felony was especially heinous, atrocious, or cruel. (6) Mitigating circumstances. -- Mitigating circumstances shall be the following: (a) The defendant has no significant history of prior criminal activity. (b) The capital felony was committed while the defendant was under the influence of extreme mental or emotional disturbance. (c) The victim was a participant in the defendant's conduct or consented to the act. (d) The defendant was an accomplice in the capital felony committed by another person and his participation was relatively minor. (e) The defendant acted under extreme duress or under the substantial domination of another person. (f) The capacity of the defendant to appreciate the criminality of his conduct or to conform his conduct to the requirements of law was substantially impaired. (g) The age of the defendant at the time of the crime.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. If the defendant waives a trial by jury on the question of his guilt or innocence or pleads guilty, the sentencing proceeding is held before a jury specially empaneled for that purpose, unless waived by the defendant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. For a more detailed explanation of how Fla.Stat.Ann. § 921.141 operates, see Proffitt v. Florida, supra, 428 U.S. at 246-251, 96 S. Ct. at 2964-66 (opinion of Stewart, Powell, and Stevens, JJ.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. 28 U.S.C. § 2254(d) provides: In any proceeding instituted in a Federal court by an application for a writ of habeas corpus by a person in custody pursuant to the judgment of a State court, a determination after a hearing on the merits of a factual issue, made by a State court of competent jurisdiction in a proceeding to which the applicant for the writ and the State or an officer or agent thereof were parties, evidenced by a written finding, written opinion, or other reliable and adequate written indicia, shall be presumed to be correct, unless the applicant shall establish or it shall otherwise appear, or the respondent shall admit -- (1) that the merits of the factual dispute were not resolved in the State court hearing; (2) that the factfinding procedure employed by the State court was not adequate to afford a full and fair hearing; (3) that the material facts were not adequately developed at the State court hearing; (4) that the State court lacked jurisdiction of the subject matter or over the person of the applicant in the State court proceeding; (5) that the applicant was an indigent and the State court, in deprivation of his constitutional right, failed to appoint counsel to represent him in the State court proceeding; (6) that the applicant did not receive a full, fair, and adequate hearing in the State court proceeding; or (7) that the applicant was otherwise denied due process of law in the State court proceeding; (8) or unless that part of the record of the State court proceeding in which the determination of such factual issue was made, pertinent to a determination of the sufficiency of the evidence to support such factual determination, is produced as provided for hereinafter, and the Federal court on a consideration of such part of the record as a whole concludes that such factual determination is not fairly supported by the record: And in an evidentiary hearing in the proceeding in the Federal court, when due proof of such factual determination has been made, unless the existence of one or more of the circumstances respectively set forth in paragraphs numbered (1) to (7), inclusive, is shown by the applicant, otherwise appears, or is admitted by the respondent, or unless the court concludes pursuant to the provisions of paragraph numbered (8) that the record in the State court proceeding, considered as a whole, does not fairly support such factual determination, the burden shall rest upon the applicant to establish by convincing evidence that the factual determination by the State court was erroneous.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Our holding is not meant to imply that the trial court's hearing was inadequate. As previously pointed out, the hearing lasted from late morning until into the evening and produced testimony of over 300 pages. This notwithstanding, the petitioner asserts that his hearing was inadequate with respect to two of his contentions because he allegedly did not have sufficient time beforehand to assemble all of his evidence and that the trial court should have granted his motion for a continuance to provide him more time. The Florida Supreme Court affirmed Spenkelink's conviction and sentence on February 19, 1975 and the United States Supreme Court denied certiorari on July 6, 1976. The evidentiary hearing in federal court was held on September 21, 1977. Fourteen months is sufficient time in which to assemble evidence for collateral review proceedings. Moreover, counsel for the petitioner informed the district court on September 16, five days before the hearing, that he then was ready to present his evidence, and did not move for a continuance until the parties and the trial court were well into the hearing itself. A trial court's denial of a motion for continuance is reviewed on appeal by the abuse of discretion standard, United States v. Mendoza, 5 Cir., 1978, 574 F.2d 1373, and we cannot say that the trial court abused its discretion in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The State later had the testimony transcribed and made it part of the record on collateral review by the Florida Supreme Court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The Sixth Amendment provides that \"in all criminal prosecutions, the accused shall enjoy the right to a speedy and public trial, by an impartial jury. . . .\" The Sixth Amendment right to trial by a jury in nonpetty criminal cases applies to the states through the Due Process Clause of the Fourteenth Amendment, Duncan v. Louisiana, 391 U.S. 145, 88 S. Ct. 1444, 20 L. Ed. 2d 491 (1968), and includes the right to \"a panel of impartial, 'indifferent' jurors.\" Irvin v. Dowd, 366 U.S. 717, 722, 81 S. Ct. 1639, 1642, 6 L. Ed. 2d 751 (1961).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The petitioner reads footnote 7 in Witherspoon as requiring the trial court to instruct veniremen such as Ferrell and Colson that \"it [is] the civic duty of each venireman to sit as a juror if he possibly [can], and to subordinate his scruples to this civic obligation if he [is] able to do so,\" Petitioner's Brief at 50, an instruction which the petitioner did not request and which the trial court did not give. Footnote 7 of Witherspoon states: It is entirely possible, of course, that even a juror who believes that capital punishment should never be inflicted and who is irrevocably committed to its abolition could nonetheless subordinate his personal views to what he perceived to be his duty to abide by his oath as a juror and to obey the law of the State. See Commonwealth v. Webster, 59 Mass. 295, 298. See also Atkins v. State, 16 Ark. 568, 580; Williams v. State, 32 Miss. 389, 395-396; Rhea v. State, 63 Neb. 461, 472-473, 88 N.W. 789, 792. 391 U.S. at 514 n. 7, 88 S. Ct. at 1773 n. 7. Nowhere in the footnote, or in any other part of the opinion, does the Court even imply that a trial court must give the instruction suggested by the petitioner, and we decline to so hold.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Underlying the guilt-bias argument is the premise that jurors who have no scruples against capital punishment will necessarily be more prone to convict than jurors who express some reservations regarding the death sentence. Support for this premise is drawn from psychological studies documenting the thesis that a given individual will tend to run a coherent, discernible pattern with respect to attitudes and values. A juror unopposed to capital punishment, according to the thesis, fits into the mold of the so-called \"authoritarian personality\" who tends to be more condemning, suspicious, and non-love-seeking than one who has some reservations about the death penalty. Comment, 1969 Utah L.Rev. 154, 162. See, e.g., Turberville v. United States, 1961, 112 U.S. App.D.C. 400, 408, 303 F.2d 411, 419; Bronson, On the Conviction Proneness and Representativeness of the Death-Qualified Jury: An Empirical Study of Colorado Veniremen, 42 U.Col.L.Rev. 1, 4 (1970); Goldberg, Toward Expansion of Witherspoon: Capital Punishment Scruples, Jury Bias, and Use of Psychological Data to Raise Presumptions in the Law, 5 Harv.Civ.Rights-Civ.Lib.L.Rev. 53, 59 (1969); Jurow, New Data on the Effect of a \"Death Qualified\" Jury on the Guilt Determination Process, 84 Harv.L.Rev. 567 (1971); Oberer, Does Disqualification of Jurors for Scruples Against Capital Punishment Constitute Denial of Fair Trial on Issue of Guilt ?,\" 39 Tex.L.Rev. 545 (1961); White, The Constitutional Invalidity of Convictions Imposed by Death-Qualified Juries, 58 Cornell L.Rev. 1176, 1182 (1973); Note, supra, 37 U.Chi.L.Rev. at 775-776; Comment, supra, 1969 Utah L.Rev. 154, 162. But see Jurow, supra, 84 Harv.L.Rev. at 570-71; White, supra, 58 Cornell L.Rev. at 1188.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. See, e.g., Witherspoon v. Illinois, supra, 391 U.S. at 516-18, 88 S. Ct. at 1174-75; United States ex rel. Fein v. Deegan, 2 Cir., 1969, 410 F.2d 13, 23, cert. denied, 395 U.S. 935, 89 S. Ct. 1997, 23 L. Ed. 2d 450 (1969); Bronson, supra, 42 U.Col.L.Rev. at 31; Goldberg, supra, 5 Harv.Civ.Rights-Civ.Lib.L.Rev. at 66; Jurow, supra, 84 Harv.L.Rev. at 574-76, 596-98; Oberer, supra, 39 Tex.L.Rev. at 565; White, supra, 58 Cornell L.Rev. at 1183-84, 1185 n.49; Note, supra, 37 U.Chi.L.Rev. at 776; Comment, supra, 1969 Utah L.Rev. at 163; cf. Ballew v. Georgia, 435 U.S. 223, 246, 98 S. Ct. 1029, 1042, 55 L. Ed. 2d 234 (1978) (Powell, J., concurring and questioning \"the wisdom -- as well as the necessity -- of Mr. Justice Blackmun's heavy reliance [in his opinion announcing the judgment of the Court] on numerology derived from statistical studies.\")\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Under Florida law the jury's verdict in a criminal trial must be unanimous. Fla.R.Crim.P. 3.440.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. See generally United States v. Puff, supra, 211 F.2d at 185: It will readily be seen that this \"balanced\" jury, which the defendant envisages, is in reality a \"partisan jury\": if, as he urges, it may include jurors with bias or scruples against capital punishment it must -- if it is to have \"balance\" -- include also those with bias in favor of the death penalty as the punishment for murder. It is settled by Andres v. United States, 333 U.S. 740, 68 S. Ct. 880, 92 L. Ed. 1055, that under the Statute [18 U.S.C. § 1111(b)] the verdict must be unanimous both as to guilt and as to punishment. As a result, as Mr. Justice Frankfurter noted in his concurring opinion, 333 U.S. at page 766, 68 S. Ct. at page 892, any juror \"can hang the jury if he cannot have his way\" as to the sentence which he deems appropriate. These considerations lead to the conclusion that trials before \"balanced juries,\" even on unanimous findings of guilt, would frequently result in disagreements. And disagreements on successive trials would result in practical immunity from murder. We cannot believe that the Statute [18 U.S.C. § 1111(b)] was intended to have such a tendency.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Indeed, one may legitimately question how the petitioner can challenge such a jury as prosecution-prone, when it was a jury of this composition that, while convicting him, acquitted his codefendant and traveling companion who also was charged with the first degree murder of Joseph J. Szymankiewicz.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. One commentator has suggested that Taylor is more an equal protection case than a Sixth Amendment case, and that the Court in its condemnation of the sex discrimination brought about by the Louisiana jury selection statute implicitly relied on the strict scrutiny test of Frontiero v. Richardson, 411 U.S. 677, 689, 93 S. Ct. 1764, 1772, 36 L. Ed. 2d 583 (1973) (invalidation of a federal statute sanctioning discriminatory treatment against servicewomen in the payment of benefits for dependent spouses). Note, The Representative Cross Section Standard: Another Sixth Amendment Fundamental Right, 21 Loyola L.Rev. 995, 1002 (1975). Other commentators disagree. See, e.g., Comment, U.Fla.L.Rev. 281, 286-87 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. For the same reasons, the exclusion of the two veniremen did not deny the excluded veniremen Fourteenth Amendment equal protection. See Ballew v. Georgia, supra, 98 S. Ct. 1038; Carter v. Jury Commission of Greene County, 396 U.S. 320, 90 S. Ct. 518, 24 L. Ed. 2d 549 (1970); Brown v. Allen, supra, 344 U.S. 443, 467-74, 73 S. Ct. 397, 412-16, 97 L. Ed. 469; Pope v. United States, supra, 372 F.2d at 724-25; Turberville v. United States, supra, 112 U.S.App.D.C. 407-10, 303 F.2d at 418-21; United States v. Puff, supra, 211 F.2d at 180-86; State v. Guirlando, 152 La. 570, 579-586, 93 So. 796, 800-02 (1922). Compare Hernandez v. Texas, 347 U.S. 475, 74 S. Ct. 667, 98 L. Ed. 866 (1954); Smith v. Texas, 311 U.S. 128, 61 S. Ct. 164, 85 L. Ed. 84 (1940); Labat v. Bennett, supra; Schowgurow v. State, 240 Md. 121, 213 A.2d 475 (1965); Juarez v. State, 102 Tex.Crim. 297, 277 S.W. 1091 (1925). There also was no violation of Fourteenth Amendment due process. See, e.g., Taylor v. Louisiana, supra; Brown v. Allen, supra, 344 U.S. at 473-74, 73 S. Ct. at 415-16.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The Eighth Amendment prohibition of cruel and unusual punishment applies to the states through the Due Process Clause of the Fourteenth Amendment. Robinson v. California, 370 U.S. 660, 666-67, 82 S. Ct. 1417, 1420, 8 L. Ed. 2d 758 (1962).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Section 921.141 prescribes the procedures that must be followed in imposing the death penalty. See note 7 supra and accompanying text. As noted previously, Fla.Stat.Ann. § 782.04(1) is the statute that actually defines first degree murder and makes it a capital felony, which Fla.Stat.Ann. § 775.082(1) makes punishable by death or by life imprisonment. See notes 5 and 6 supra and accompanying text. Fla.Stat.Ann. § 922.10 provides further that the death penalty shall be carried out by electrocution. For the sake of brevity, however, we will refer to Section 921.141 as the death penalty statute.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. In contending that the death penalty under Section 921.141 is being applied excessively and disproportionately, allegedly as evidenced by his own case, Spenkelink cites Coker v. Georgia, 433 U.S. 584, 97 S. Ct. 2861, 53 L. Ed. 2d 982 (1977), in which the Supreme Court held that the sentence of death for the crime of rape is excessive and disproportionate and therefore cruel and unusual punishment. In Roberts v. Louisiana, supra, 428 U.S. at 331, 96 S. Ct. at 3005 (opinion of Stewart, Powell, and Stevens, JJ.); Woodson v. North Carolina, supra, 428 U.S. at 285, 96 S. Ct. at 2982 (opinion of Stewart, Powell, and Stevens, JJ.); Jurek v. Texas, supra, 428 U.S. at 268, 96 S. Ct. at 2954 (opinion of Stewart, Powell, and Stevens, JJ.); Proffitt v. Florida, supra, 428 U.S. at 246, 96 S. Ct. at 2964 (opinion of Stewart, Powell, and Stevens, JJ.); and Gregg v. Georgia, supra, 428 U.S. at 166-189, 96 S. Ct. at 2922-32 (opinion of Stewart, Powell, and Stevens, JJ.), the Court held that the sentence of death for the crime of murder is not inherently excessive and disproportionate punishment. See Coker v. Georgia, supra, 433 U.S. 591, 97 S. Ct. at 2865. The allegations of excessiveness and disproportionality, at least as used by the petitioner in this case in challenging the death penalty as applied, appear to be synonymous with the allegations of arbitrariness and capriciousness. For example, according to the petitioner, the tests for determining if the death penalty is being applied arbitrarily and capriciously and if it is being applied excessively and disproportionately are the same: one must compare the facts and circumstances of cases in which convicted murderers have been sentenced to death with the facts and circumstances of cases in which convicted murderers have received life imprisonment. The two sets of allegations, therefore, do not constitute separate issues in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Spenkelink highlights seven other cases in particular, all of which allegedly involved defendants equally or more deserving of the death penalty than he but in all of which the Florida Supreme Court reversed sentences of death. The first case cited by the petitioner is Swann v. State, 322 So.2d 485 (Fla.1975). In Swann the defendant gagged his victim, bound her so that \"any efforts she might have made to free herself could have choked her to death,\" severely beat her, and then robbed her. The victim later died. Id. at 486. The jury convicted the defendant of first degree murder but recommended a life sentence. The trial court imposed the death penalty. The Florida Supreme Court affirmed the conviction but, noting that the defendant was a nineteen-year-old with no significant history of criminal conduct, as well as the fact that \"there is a specific duty imposed on this Court to consider the record in order to assure that the punishment accorded a criminal will meet the standards prescribed in Furman v. Georgia,\" the court reversed the sentence. It found \"that there were insufficient aggravating circumstances to justify the imposition of the death penalty\" and imposed a sentence of life imprisonment. Id. at 489. In Halliwell v. State, 323 So.2d 557 (Fla.1975), the second case cited by the petitioner, the defendant beat his victim to death with a breaker bar and then dismembered the body. The jury convicted him of first degree murder and recommended the death penalty, which the trial court imposed. The Florida Supreme Court affirmed the conviction but reduced the sentence to life imprisonment. The court found that the defendant had no prior arrests and was a decorated Green Beret in the Vietnam War. It found further that the defendant had acted \"under emotional strain over the mistreatment of [the women he loved] by the victim\" and that the dismemberment occurred after death. Thus, the death penalty was not warranted. Id. at 561. In the third case cited by Spenkelink, Tedder v. State, supra, the defendant, who recently had been separated from his wife, shot to death his mother-in-law. 322 So.2d at 909. The jury convicted him of first degree murder and recommended life imprisonment. The trial court imposed a sentence of death. The Florida Supreme Court affirmed the conviction but reduced the sentence to life imprisonment after determining that the murder was not heinous, atrocious, or cruel within the meaning of Section 921.141(5)(h). Additionally, the court stated: With respect to the trial court's sentence, we agree with appellant that the death penalty was inappropriate and that a life sentence should have been imposed. A jury recommendation under our trifurcated death penalty statute should be given great weight. In order to sustain a sentence of death following a jury recommendation of life, the facts suggesting a sentence of death should be so clear and convincing that virtually no reasonable person could differ. That is not the situation here. Id. at 910. Jones v. State, 332 So.2d 615 (Fla. 1976), is the fourth case upon which the petitioner relies. The defendant in Jones raped his victim and then murdered her by stabbing her 38 times. Id. at 616. The jury convicted him of first degree murder and recommended life imprisonment. The trial court sentenced him to death. The Florida Supreme Court found that the defendant \"suffered a paranoid psychosis to such an extent that the full degree of his mental capacities at the time of the murder is not fully known.\" This mitigating circumstance, according to the court, was \"determinative,\" and sufficiently outweighed the aggravating circumstances. The defendant's sentence was therefore reduced to life imprisonment. Id. at 619. In Thompson v. State, 328 So.2d 1 (Fla.1976), Spenkelink's fifth case, the defendant stabbed his victim to death while robbing him. Id. at 3. Once again the jury convicted the defendant of first degree murder and recommended life imprisonment, and the trial court sentenced the defendant to death. The Florida Supreme Court, in affirming the conviction but reducing the sentence to life imprisonment, stated that the recommendation of the jury, although advisory only, merits \"serious consideration,\" especially when that recommendation is life imprisonment. The court found that the 17-year-old defendant had no prior criminal record and that the evidence failed to establish that the murder was deliberate. In short, \"the mitigating circumstances were such that the death penalty would not be proper.\" Id. at 5. The final two cases cited by Spenkelink are Burch v. State, 343 So.2d 831 (Fla.1977), and Provence v. State, 337 So.2d 783 (Fla.1976), cert. denied, 431 U.S. 969, 97 S. Ct. 2929, 53 L. Ed. 2d 1065 (1977). In Burch, the defendant murdered his victim by stabbing her over 30 times after an unsuccessful rape attempt. 343 So.2d at 832. Following a jury conviction of first degree murder with a recommendation of life imprisonment, the trial court imposed capital punishment. The Florida Supreme Court affirmed the conviction but reduced the sentence to life imprisonment. The court first quoted Tedder v. State, supra, 322 So.2d at 910, in recognizing that a jury recommendation of life is entitled to great weight. It then found \"that at the time of the offenses the defendant was mentally disturbed.\" 343 So.2d at 834. Burch also had no prior history of criminal conduct. Id. at 833-34. These mitigating circumstances, held the court, were sufficient to preclude imposition of the death penalty. Finally, Provence involved a defendant who robbed his victim of $1,500 and then murdered him by stabbing him eight times with a hunting knife. 337 So.2d at 784-85. The jury convicted the defendant of first degree murder and recommended life imprisonment, but the trial court sentenced him to the death penalty. The Florida Supreme Court affirmed the conviction but reduced the sentence to life imprisonment. In doing so the court noted the mitigating circumstance that the defendant had never been convicted of any previous crimes as well as the aggravating circumstance that the murder had been committed for pecuniary gain. The court then compared the defendant's case to other death penalty cases, finding the circumstances in the defendant's case to be \"less aggravated\" than those in Halliwell v. State, supra, and Swann v. State, supra, where the court reversed the trial court's imposition of capital punishment. Next the court quoted once again from Tedder v. State, supra, 322 So.2d at 910, in recognizing that a jury recommendation of life is entitled to great weight. Finally, the court decided that the balance tipped in favor of life imprisonment. 337 So.2d at 786-87. The first and certainly foremost impression one receives after considering these cases in light of Spenkelink's case is that all of the murders involved, including the murder of Joseph J. Szymankiewicz, were senseless and atrocious. Nonetheless, in six of these cases -- Swann, Halliwell, Jones, Thompson, Burch, and Provence -- the Florida Supreme Court, after balancing the aggravating and mitigating circumstances, found that sufficient mitigating circumstances existed to outweigh the aggravating circumstances and preclude imposition of the death penalty. In the case of Spenkelink, the Florida Supreme Court found otherwise. In fact, it found no mitigating circumstances at all. (The trial court's treatment of Spenkelink's possible mental or emotional disturbance as an insubstantial factor apparently was accepted by the Florida Supreme Court.) In Tedder, the only case in which the court did not appear to balance, at least not expressly, aggravating and mitigating circumstances, the court announced the rule that when the jury recommends life imprisonment the trial court should impose capital punishment only when \"the facts suggesting a sentence of death [are] so clear and convincing that virtually no reasonable person could differ.\" Tedder v. State, supra, 322 So.2d at 910. That was not the situation there, so the Florida Supreme Court reversed the death sentence. That also is not the situation here, because the jury recommended that Spenkelink receive the death penalty. In any event, Tedder was decided after the Florida Supreme Court reviewed Spenkelink's case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The concluding paragraph of the Proffitt opinion of Justices Stewart, Powell, and Stevens supports our interpretation: Florida, like Georgia, has responded to Furman by enacting legislation that passes constitutional muster. That legislation provides that after a person is convicted of first-degree murder, there shall be an informed, focused, guided, and objective inquiry into the question whether he should be sentenced to death. If a death sentence is imposed, the sentencing authority articulates in writing the statutory reasons that led to its decision. Those reasons, and the evidence supporting them, are conscientiously reviewed by a court which, because of its statewide jurisdiction, can assure consistency, fairness, and rationality in the evenhanded operation of the state law. As in Georgia, this system serves to assure that sentences of death will not be \"wantonly\" or \"freakishly\" imposed. See Furman v. Georgia, 408 U.S., at 310, 92 S. Ct., at 2762 (Stewart, J., concurring). Accordingly, the judgment before us is affirmed. 428 U.S. at 259, 96 S. Ct. at 2970 (opinion of Stewart, Powell, and Stevens, JJ.) (emphasis added). Similarly, in Gregg v. Georgia, supra, 428 U.S. at 206, 96 S. Ct. at 2940-41 (opinion of Stewart, Powell, and Stevens, JJ.) (emphasis added), the Court stated: The basic concern of Furman centered on those defendants who were being condemned to death capriciously and arbitrarily. Under the procedures before the Court in that case, sentencing authorities were not directed to give attention to the nature or circumstances of the crime committed or to the character or record of the defendant. Left unguided, juries imposed the death sentence in a way that could only be called freakish. The new Georgia sentencing procedures, by contrast, focus the jury's attention on the particularized nature of the crime and the particularized characteristics of the individual defendant. While the jury is permitted to consider any aggravating or mitigating circumstances, it must find and identify at least one statutory aggravating factor before it may impose a penalty of death. In this way the jury's discretion is channeled. No longer can a jury wantonly and freakishly impose the death sentence; it is always circumscribed by the legislative guidelines. In addition, the review function of the Supreme Court of Georgia affords additional assurance that the concerns that prompted our decision in Furman are not present to any significant degree in the Georgia procedure applied here. In Coker v. Georgia, supra, 433 U.S. at 591, 97 S. Ct. at 2865, the Court, citing Furman, Gregg, Proffitt, Jurek, Woodson, and Roberts, stated further: It is also established that imposing capital punishment, at least for murder, in accordance with the procedures provided under the Georgia statutes saves the sentence from the infirmities which led the Court to invalidate the prior Georgia capital punishment statute in Furman v. Georgia, supra. See, e.g., Roberts v. Louisiana, supra, 428 U.S. at 335, 96 S. Ct. at 3007 (opinion of Stewart, Powell, and Stevens, JJ.); Jurek v. Texas, supra, 428 U.S. at 276, 96 S. Ct. at 2958 (opinion of Stewart, Powell, and Stevens, JJ.); Proffitt v. Florida, supra, 428 U.S. at 253, 96 S. Ct. at 2967 (opinion of Stewart, Powell, and Stevens, JJ.); Gregg v. Georgia, supra, 428 U.S. at 199 n. 50, 96 S. Ct. at 2937 n. 50 (opinion of Stewart, Powell, and Stevens, JJ.); id., 428 U.S. at 224, 96 S. Ct. at 2949 (White, J., concurring). But see, e.g., Woodson v. North Carolina, supra, 428 U.S. at 303, 96 S. Ct. at 2991 (opinion of Stewart, Powell, and Stevens, JJ.); Jurek v. Texas, supra, 428 U.S. at 277, 96 S. Ct. at 2959 (Burger, C.J., concurring).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. We note that counsel for Spenkelink argued to the district court below that the Florida Supreme Court, as evidenced by Spenkelink's case, has exercised more zeal than wisdom in reviewing death penalty cases. Spenkelink's attorney suggested that the court has engaged in little more than rubber stamp review and that it \"should stand on its own and should make their [ sic ] own decisions independently of what the juries do or do not recommend.\" We agree with the United States Supreme Court that the Florida Supreme Court \"has undertaken responsibly to perform its function of death sentence review with a maximum of rationality and consistency,\" and that \"any suggestion that the Florida Court engages in only cursory or rubber stamp review is totally controverted.\" Proffitt v. Florida, supra, 428 U.S. at 259, 96 S. Ct. at 2969 (opinion of Stewart, Powell, and Stevens, JJ.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. This is not to say that the federal judiciary should never concern itself on habeas corpus review with whether Section 921.141 is being applied arbitrarily and capriciously. If a petitioner who has been sentenced to death can show that the facts and circumstances of his case are so clearly undeserving of capital punishment that to impose it would be patently unjust and would shock the conscience, which is not so in Spenkelink's case, see notes 2, 3, and 25 supra and accompanying text, then federal court intervention might be warranted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. In Jackson the Supreme Court considered 18 U.S.C. § 1201(a), which provided that if a defendant pleaded guilty, the maximum penalty was life imprisonment, but if the defendant pleaded not guilty and went to trial, the maximum penalty upon conviction was death. The Court held that the statute was unconstitutional, stating: The inevitable effect of any such provision, is of course, to discourage assertion of the Fifth Amendment right not to plead guilty and to deter exercise of the Sixth Amendment right to demand a jury trial. If the provision had no other purpose or effect than to chill the assertion of constitutional rights by penalizing those who choose to exercise them, then it would be patently unconstitutional. 390 U.S. at 581, 88 S. Ct. at 1216.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. By tolerating and encouraging the negotiation of pleas, this Court has necessarily accepted as constitutionally legitimate the simple reality that the prosecutor's interest at the bargaining table is to persuade the defendant to forego his right to plead not guilty. Bordenkircher v. Hayes, supra, 434 U.S. at 364, 98 S. Ct. at 668.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Florida in its brief questions Spenkelink's standing to urge this contention, in light of the fact that he himself was not induced to plead guilty. Because the contention is meritless and because the standing issue has not been briefed by either party, we do not decide the issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The Sixth Amendment provides that \"in all criminal prosecutions, the accused shall enjoy the right . . . to be informed of the nature and cause of the accusation. . . .\" This Sixth Amendment right is applicable to the states through the Due Process Clause of the Fourteenth Amendment. In re Oliver, 333 U.S. 257, 273, 68 S. Ct. 499, 507-08, 92 L. Ed. 682 (1948).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Fla.R.Crim.P. 3.190(c) provides: Time for Moving to Dismiss. Unless the court grants him further time, the defendant shall move to dismiss the indictment or information either before or upon arraignment. The court in its discretion may permit the defendant to plead and thereafter to file a motion to dismiss at a time to be set by the court. Except for objections based upon fundamental grounds, every ground for motion to dismiss which is not presented by a motion to dismiss within the time hereinabove provided for shall be taken to have been waived. However, the court may at any time entertain a motion to dismiss on any of the following grounds: (1) The defendant is charged with an offense for which he has been pardoned; or (2) The defendant is charged with an offense of which he has previously been placed in jeopardy; or (3) The defendant is charged with an offense for which he has previously been granted immunity; or (4) There are no material disputed facts and the undisputed facts do not establish a prima facie case of guilt against the defendant. The facts on which such motion is based should be specifically alleged and the motion sworn to. See generally Fla.R.Crim.P. 3.140(o), 3.190(b).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. The record also indicates that the petitioner has never even attempted, before this Court or any other, state or federal, to show prejudice from or cause for his failure to follow the state procedural rule. See Wainwright v. Sykes, supra, 433 U.S. at 86, 97 S. Ct. at 2506; Francis v. Henderson, supra, 425 U.S. at 541, 96 S. Ct. at 1711. Compare Sincox v. United States, supra; Jimenez v. Estelle, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Spenkelink raises two other claims regarding the aggravating circumstances defined in Section 921.141(5). First, he contends that his murder of Szymankiewicz was not \"especially heinous, atrocious, or cruel,\" Fla.Stat.Ann. § 921.141(5)(h), as those words have been construed and applied in other Florida death penalty cases, and therefore he was sentenced to death arbitrarily and capriciously in violation of the prohibition under the Eighth and Fourteenth Amendments of cruel and unusual punishment. We have already addressed this contention and decided it adversely to the petitioner. Second, Spenkelink contends that he did not murder Szymankiewicz \"for pecuniary gain,\" Fla.Stat.Ann. § 921.141(5)(f), as those words have been construed and applied in other Florida death penalty cases, but in fact was attempting only to recover those possessions and money which his victim allegedly had stolen from him. The trial court and the Florida Supreme Court acknowledged as much, but still defined his act as murder \"for pecuniary gain.\" According to Spenkelink, this too constitutes arbitrary and capricious application of the death penalty, a contention, as noted above, that we already have considered and rejected.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Spenkelink has standing to raise the equal protection issue, even though he is not a member of the class allegedly discriminated against, because such discrimination, if proven, impinges on his constitutional right under the Eighth and Fourteenth Amendments not to be subjected to cruel and unusual punishment. See Taylor v. Louisiana, supra, 419 U.S. at 526, 95 S. Ct. at 695-96.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. According to the State, Florida murders involving black victims have in the past fallen into the category of \"family quarrels, lovers quarrels, liquor quarrels, [and] barroom quarrels.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. That racial discrimination in the imposition of the death penalty was one of the Supreme Court's concerns in Furman is evidenced by the concurring opinion of Justice Douglas. In determining that capital punishment was not unconstitutional per se, but that standardless death penalty statutes as they were being applied violated the constitutional ban on cruel and unusual punishment, Justice Douglas quoted with approval from a study of capital cases in Texas from 1924 to 1968. That study concluded: \"Application of the death penalty is unequal: most of those executed were poor, young, and ignorant. . . . . \"Seventh-five of the 460 cases involved co-defendants, who, under Texas law, were given separate trials. In several instances where a white and a Negro were co-defendants, the white was sentenced to life imprisonment or a term of years, and the Negro was given the death penalty. \"Another ethnic disparity is found in the type of sentence imposed for rape. The Negro convicted of rape is far more likely to get the death penalty than a term sentence, whereas whites and Latins are far more likely to get a term sentence than the death penalty.\" Furman v. Georgia, supra, 408 U.S. at 250-51, 92 S. Ct. at 2732 (Douglas, J., concurring), quoting Koeninger, Capital Punishment in Texas, 1924-1968, 15 Crime \u0026 Delin. 132, 141 (1969). See id., 408 U.S. at 250 n.15, 92 S. Ct. at 2732 n.15. Justice Douglas then stated: Thus, these discretionary statutes are unconstitutional in their operation. They are pregnant with discrimination and discrimination is an ingredient not compatible with the idea of equal protection of the laws that is implicit in the ban on \"cruel and unusual\" punishments. Id., 408 U.S. at 256-57, 92 S.Ct at 2735 (Douglas, J., concurring). See generally id., 408 U.S. at 365-66, 92 S.Ct at 2791 (Marshall, J., concurring); id., 408 U.S. at 313, 92 S. Ct. at 2764 (White, J., concurring); id., 408 U.S. at 309-10, 92 S. Ct. at 2762-63 (Stewart, J., concurring). In later Supreme Court opinions, therefore, e.g., Roberts v. Louisiana, supra, 428 U.S. at 335, 92 S. Ct. at 3007 (opinion of Stewart, Powell, and Stevens, JJ.); Woodson v. North Carolina, supra, 428 U.S. at 304, 96 S. Ct. at 2991 (opinion of Stewart, Powell, and Stevens, JJ.); Jurek v. Texas, supra, 428 U.S. at 273, 96 S. Ct. at 2957 (opinion of Stewart, Powell, and Stevens, JJ.); Proffitt v. Georgia, supra, 428 U.S. at 253, 96 S. Ct. at 2967 (opinion of Stewart, Powell, and Stevens, JJ.); Gregg v. Georgia, supra, 428 U.S. at 188, 96 S. Ct. at 2932 (opinion of Stewart, Powell, and Stevens, JJ.), when the Court spoke of Furman's condemnation of arbitrary and capricious imposition of the death penalty, implicit in its definition of arbitrariness and capriciousness was racial discrimination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. The district court below expressed the point well: It is undeniable that the Supreme Court considered each and every phase of the Florida system and, based upon that examination, concluded that it is a reasonable one. Although there is no mention of the race of the victims of murderers in the Proffitt opinion, it is clear that the United States Supreme Court was confident that the safeguards which are provided are sufficient to insure evenhanded application. It is for this reason that this court must conclude that the focus of any inquiry into the application of the death penalty must necessarily be limited to the persons who receive it rather than their victims. There are, of course, many reasons which could explain the decision to sentence one defendant to death and another to life imprisonment. But it now seems clear that a decision to afford a defendant mercy violates no constitutional precepts. As the Supreme Court noted in Gregg v. Georgia, [428 U.S. 153, 96 S. Ct. 2909, 49 L. Ed. 2d 859], 44 U.S.L.W. 5230, 5243 (1976), there are many stages of the criminal justice system in which a decision may be made which will remove a defendant from consideration as a candidate for a death sentence. So long as the system is designed to minimize the risk of capricious imposition of the death penalty by providing standards which enable those who must impose sentences to focus on the circumstances of the crime of each defendant, the dictates of Furman v. Georgia, 408 U.S. 238 [92 S. Ct. 2726, 33 L. Ed. 2d 346] (1972) are satisfied. Florida now has such a system.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. As we pointed out in footnote 28 supra with respect to the contention that Florida's death penalty is being imposed arbitrarily and capriciously, this is not to say that federal courts should never concern themselves on federal habeas corpus review with whether Section 921.141 is being applied in a racially discriminatory fashion. If a petitioner can show some specific act or acts evidencing intentional or purposeful racial discrimination against him, see Village of Arlington Heights v. Metropolitan Housing Development Corp., 429 U.S. 252, 266-68, 97 S. Ct. 555, 564-65, 50 L. Ed. 2d 450 (1977), either because of his own race or the race of his victim, the federal district court should intervene and review substantively the sentencing decision. We emphasize once again, see note 28 supra, that this Court anticipates that such intervention will be infrequent and only for the most compelling reasons. Mere conclusory allegations, as the petition makes here, such as that the death penalty is being \"administered arbitrarily and discriminatorily to punish the killing of white persons as opposed to black persons,\" Petitioner's Brief at 2, do not constitute such reasons and would not warrant an evidentiary hearing. This is so on Eighth Amendment grounds as well as on Fourteenth Amendment equal protection grounds, because the intrusionary effect would be the same.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. These explanations were provided in an evidentiary hearing on the petitioner's contention that was not constitutionally required. See note 40 supra and note 42 infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. As footnotes 28 and 40 supra indicate with respect to the contentions considered there, if a petitioner in federal habeas corpus proceedings can point to some specific act or acts evidencing intentional or purposeful discrimination against him on the basis of sex or wealth, the district court would be justified in looking behind the substantive sentencing decisions of the state criminal justice system. Conclusory allegations, as the petitioner makes here, such as that the death penalty is being \"'exacted pursuant to a pattern or practice of Florida prosecuting authorities, courts, juries, and Governors to discriminate on grounds of sex and poverty in the administration of capital punishment,'\" Petitioner's Brief at 24, do not constitute sufficiently compelling reasons for district court intrusion. Under these circumstances, an evidentiary hearing, either on Eighth Amendment grounds or on Fourteenth Amendment equal protection grounds, would not be warranted. See Village of Arlington Heights v. Metropolitan Housing Development Corp., supra, 429 U.S. at 266-69, 97 S. Ct. at 564-65.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. The Court in Meachum distinguished Wolff v. McDonnell, 418 U.S. 539, 94 S. Ct. 2963, 41 L. Ed. 2d 935 (1974), on which the Court of Appeals had heavily yet erroneously relied. Wolff held that the Due Process Clause entitles a state prisoner to certain procedural safeguards when he is deprived of \"good-time credits\" because of serious misconduct. This \"liberty\" interest did not originate in the Constitution, however; it had its roots in state law and therefore was a statutory right. In Meachum, state law conferred no right, statutory or otherwise, on a prisoner to remain in the prison to which he was initially assigned, absent proof of specific acts of misconduct. 427 U.S. at 224, 96 S. Ct. at 2538-39.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. As with the prison transfers in Meachum, a clemency decision is not a statutory right. It is an act of grace. See Fla.Const. art. IV, § 8; Fla.R.Exec. Clemency 1, 5.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. As Justice England pointed out in his concurring opinion in Sullivan v. Askew, supra, 348 So.2d at 319 (England, J., concurring), the Supreme Court in Gregg v. Georgia, supra, and Proffitt v. Florida, supra, \"very clearly indicated that its constitutional concern regarding the imposition of death is the judicial process alone, and not the discretionary stages which precede (prosecutorial discretion) or succeed (clemency) the judicial processes of trial and appellate review.\" See Proffitt v. Florida, supra, 428 U.S. at 253, 96 S. Ct. at 2967 (opinion of Stewart, Powell, and Stevens, JJ.); Gregg v. Georgia, supra, 428 U.S. at 199, 96 S. Ct. at 2937 (opinion of Stewart, Powell, and Stevens, JJ.); Note, Gregg v. Georgia: The Search for the Civilized Standard, 1976 Det.C.L.Rev. 645, 661.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Fla.R.Crim.P. 3.190(i) provides: Motion to Suppress a Confession or Admissions Illegally Obtained. (1) Grounds. Upon motion of the defendant or upon its own motion, the court shall suppress any confession or admission obtained illegally from the defendant. (2) Time for Filing. The motion to suppress shall be made prior to trial unless opportunity therefor did not exist or the defendant was not aware of the grounds for the motion, but the court in its discretion may entertain the motion or an appropriate objection at the trial. (3) Hearing. The court shall receive evidence on any issue of fact necessary to be decided in order to rule on the motion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. As to proffered testimony concerning Cooper's prior employment, it is argued that this evidence would tend to show that Cooper was not beyond rehabilitation. Obviously, an ability to perform gainful work is generally a prerequisite to the reformation of a criminal life, but an equally valid fact of life is that employment is not a guarantee that one will be law-abiding. Cooper has shown that by his conduct here. In any event, the Legislature chose to list the mitigating circumstances which it judged to be reliable for determining the appropriateness of a death penalty for \"the most aggravated and unmitigated of serious crimes,\" and we are not free to expand the list. Cooper v. State, supra, 336 So.2d at 1139.\u003c/span\u003e\n\n",
    "body_length": 161425,
    "citedas": [
      "578 F.2d 582"
    ],
    "attorneys": "Andrew A. Graham, Cocoa, Florida Jack Greenberg, New York, New York James M. Nabrit, III, New York, New York David E. Kendall, New York, New York Joel Berger, New York, New York Anthony G. Amsterdam, Stanford University Law School, Stanford, California, for Appellant. Robert L. Shevin, Atty. Gen., Tallahassee, Florida Raymond L. Marky, Asst. Atty. Gen., Tallahassee, Florida George R. Georgieff, Asst. Atty. Gen., Tallahassee, Florida Richard W. Prospect, Asst. Atty. Gen., Tallahassee, Florida Charles W. Musgrove, Asst. Atty. Gen., Tallahassee, Florida, for Appellee.",
    "category": [
      "36",
      "78",
      "75"
    ],
    "judges": "Brown, Chief Judge, Ainsworth and Vance, Circuit Judges.",
    "citation_count": 288
  }
}
