{
  "id": "dqE9R2YBTlTomsSBf5s_",
  "document": {
    "title": "People v. Beasley",
    "full_title": "THE PEOPLE AND v. KENNETH BEASLEY ET AL. AND",
    "jurisdiction": "California Court of Appeal",
    "date": "1970-03-19T00:00:00.000Z",
    "docket": "Crim. No. 7992",
    "body": "The People appeal from orders of the superior court (1) dismissing two counts of rape (Pen. Code, § 261, subd. 4) and one count of kidnaping to commit robbery (Pen. Code, § 209) against defendant William Augustus Morris, (2) granting Morris probation following his pleas of guilty to certain other charges, and (3) dismissing two counts of rape (Pen. Code, § 261, subd. 4) and one count of kidnaping to commit robbery (Pen. Code, § 209) against defendant Kenneth Beasley.\n\nThe record before us discloses the following.\n\nThe victim of the offenses charged against Morris and Beasley was an unmarried young lady of 22 years whose given name, Lois, will be used by\n\nus. Lois was employed as a cashier by a large San Francisco hotel. On the evening of November 20, 1968, she left her employment around 11 o'clock and started home by public bus. Leaving the bus at a transfer point she waited for another which would take her about a block from her home. While waiting, an automobile occupied by defendants Morris and Beasley and one Jackson (who is not a party to this appeal) drove up and stopped. They \"started making noises\" and calling out \"Oh, baby.\" However, the second bus soon arrived and the girl continued on her way home; unknown to her the three men followed. A few minutes later Lois left the bus and started walking toward her home where she lived with her parents. Almost home, she again saw the car with the three men, one of whom called out \"There she is. That's her.\" Walking fast she heard a car door open after which a man grabbed her by the throat with one hand and over the mouth with the other. She kicked and screamed, but was thrown into the back seat of the automobile. Her shoes had been knocked off her feet and her front door key out of her hand. Her mother, hearing the screams, ran to the window and saw the abduction.\n\nDefendant Morris who \"was the most aggressive and vile of the three,\" was the car's driver. He drove while one of the others placed his hand over Lois' throat and told her to stop screaming. She was promptly relieved of the contents of her purse and a valuable topaz ring, and told that she was \"going for a long ride.\" The car was driven somewhere \"up in the hills\" where the men took off the girl's upper clothing; she was ordered to remove the remainder. She complied because she believed Morris would carry out a threat he made to kill her. The men then raped her one by one, accomplishing six acts of sexual intercourse. One of the men tried to force the girl to orally copulate his sexual organ, but was somehow discouraged from the act. The men then disagreed over what they should do next. Morris' expressed thought was \"we're going to have to kill her -- we're going to have to get rid of her.\" Another suggested that they disfigure her face. Further violence was averted when the discussion turned to the \"ransom\" possibilities of the situation. Lois very intelligently entered into this conversation. She explained that she was a hotel cashier and that she took in about $600 cash during her shift. If they took her home and didn't \"bash up my face or anything\" she agreed that the men could come to her cashier's cage the next night and \"say, 'All right, hand over your money,' and I'll give it to you and I'll wait for a few minutes until you have a chance to get out and everything, and then I'll tell one of the bartenders, because the bartenders are right next to the cashier, and I said, 'I'll just say I have been held up,' you know. And I said, 'That's all there is to it.' I said, 'Nobody will get hurt,' you know. I said, 'I won't lose my job, and the hotel is insured.'\"\n\nAfter being warned by Morris that if anything went wrong with the next night's pretended robbery she would be killed and her \"parents' home would be bombed,\" Lois was let out of the car about a block away from her residence. The police who had already been there were again called; Lois related the events of the evening and the \"plans\" for the hotel robbery to them. The next evening Morris and Beasley appeared at the hotel as agreed. Lois pointed them out to the waiting police and both were arrested.\n\nThere can be no doubt concerning the reliability of Lois' recollection of the events of the evening in question, for her statements to the police and later to the grand jury were fully corroborated by uncontested confessions of Morris and Beasley. The men were thereafter released on bail.\n\nMorris, Beasley and Jackson were each indicted by the San Francisco County Grand Jury on three counts of rape (Pen. Code, § 261, subd. 4), one count of kidnaping for robbery (Pen. Code, § 209), and one count of robbery (Pen. Code, § 211). Each rape count alleged that one of the defendants had directly committed the act while being aided and abetted by the others.\n\nThe remainder of the pertinent factual history of this case relates to proceedings before Superior Court Judge Bernard J. Glickfeld to whose department of the court the Morris and Beasley cases had been assigned.\n\nMorris and Beasley pleaded not guilty to all charges. Jackson, who had a prison record, pleaded guilty to one of the charges against him and was returned to prison. On motion of the district attorney the remaining charges against him were dismissed.\n\nIt is conceded that following the arraignment of Morris and Beasley and their not guilty pleas, two successive unreported and otherwise unrecorded conferences were held in the chambers of Judge Glickfeld. Present at the meetings were the judge, counsel for Morris and Beasley, and an assistant district attorney. Agreements were reached, over the objection of the district attorney, for what Morris describes in his brief as a \"' package disposition' of all the five charges.\" Under this arrangement Morris and Beasley would each plead guilty to the robbery charge and to one of the rape charges. In return the judge promised to refer Beasley to the California Youth Authority,\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and to dismiss his remaining kidnaping and rape charges. The consideration to Morris was that he would receive a suspended prison sentence and then be placed on probation for three years on condition that he serve\n\none year in the county jail under the \"Work Furlough\"\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e program; his remaining charges would also be dismissed.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nOn February 21, 1969, Morris and Beasley appeared in court with their attorneys. Counsel asked leave to withdraw the previous not guilty pleas and to enter \"new and different\" pleas. Judge Glickfeld responded: \"It is my understanding, just so we get this straight, that both of you men are going to enter guilty pleas to a 211 [robbery], Second Degree, and to a 261 [subd. 4], which is the rape charge?\" Defense counsel agreed that such was the understanding previously reached. The judge then said: \"I will tell you what this means and what I intend to do. And there is a third charge which is kidnaping with intent to commit robbery. And it is my intention at the proper time when the probation reports come in to dismiss that charge pursuant to section 1385 of the Penal Code.\"\n\nAddressing Beasley, Judge Glickfeld then said: \"Now, I said upon a plea what I would do is refer your matter to the California Youth Authority. And after you plead your attorney would make a motion for probation, and it takes about 3 weeks. And you would remain on bail or OR\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e and after we get the report it is mailed down to Sacramento for approval by the Youth Authority and it takes about 10 days. So that takes about 4 or 5 weeks. And after we get the acceptance we will set a date and you will come in. And if you are accepted, then you will be sent to the Youth Authority for whatever rehabilitation program they have down there. . . . That is what I intend to do, and I put it on the record so there is no question.\" Turning to Morris, the court said: \"[It] is my intent to treat your case as follows: State Prison, suspended, and put you on probation for three years, and one year in the county jail as a condition on a Work Furlough. . . . You will have to go in every night or whatever it is.\"\n\nA moment later the judge announced: \"It would be my intention to dismiss 1 [rape], 3 [rape], and 4 [kidnaping] on Mr. Morris.\" Questioned by the court clerk as to the disposition of the remainder of Beasley's charges,\n\nhe answered: \"I am going to take those under submission for the date of sentencing, and it is my intention on March 21st to dismiss them pursuant to section 1385.\" The People, represented by the district attorney, made appropriate objection to the judge's intended disposition of the cases. And it was stated: \"the district attorney's position here is and it has been at all times that probation is not in order and it should be denied here.\" Each defendant then made a \"motion for probation.\" The motions, as required by law (Pen. Code, § 1203), were referred to the probation officer to investigate and report to the court, and the date for hearing thereon was set for March 21, 1969.\n\nPrior to the time set for the probation hearings the probation officer filed his report recommending that probation be denied as to both Morris and Beasley.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e With respect to Morris the report stated that he was ineligible for the Work Furlough Program because in view of the circumstances surrounding the case he was not a \"proper candidate\" for that program.\n\nLois, the victim of the admitted crimes, was directed to be present on March 21, the date set for hearing on the probation motions. On the morning of the probation hearing she was accompanied to the courtroom by a police inspector. This circumstance appears to have been a source of irritation to Judge Glickfeld and he castigated the inspector and his superior officer for their solicitude on Lois' behalf.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e This factor should\n\nhave been of no concern to the judge and we allude to it verbatim in the footnote as indicative of the judge's frame of mind in our analysis of whether the judge used a sound judicial discretion in his determination of the matters here under discussion.\n\nPenal Code section 1204 reasonably requires the district attorney in cases such as this to have the victim present at the probation hearing. That section provides that at the hearing circumstances of aggravation or mitigation \"must be presented by the testimony of witnesses examined in open court\" and by report of the probation officer as provided in Penal Code section 1203.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Nor is it unusual in cases such as this for the victim of the crime to be escorted to the courtroom by a police officer assigned to the case. There are several reasons for this practice; one is particularly apparent here. As permitted, but not required, by law the judge had ordered that Morris and Beasley might remain at liberty on bail after their guilty pleas. They, and possibly their friends and relatives, would necessarily travel through and on the public corridors and elevators of the courthouse, to and from Judge Glickfeld's courtroom. It seems idle even to point out that Lois should not be obliged to chance an unescorted confrontation with her self-confessed ravagers or their friends.\n\nLater that morning the probation proceedings were called. After some discussion about a continuance the following appears in the record:\n\n\"[Judge Glickfeld] . . . For what it is worth, anyway, but the only thing that disturbs me, and I will say this here on the record, is that I just don't like the undercurrent of pressures that are being put on from the\n\noutside on the district attorney's office. And I don't like the pressures that are being put on from the outside, I believe, on the probation department and the Work Furlough Program, in view of my experience with them and what they have been doing in the past and how they have been operating. And I will not tolerate any pressures on this court. The court is going to act in an independent manner and in its best judgment, and hopefully in good judgment. And I will answer to the right person, to my conscience and to my God, and that is who I will answer to, and that is all I can say. I will not tolerate any pressure on the court and district attorney or on any arm of the court; and the probation department is an arm of the court.\n\n\"Mr. Smith [of defense counsel]: Or the police department.\n\n\"[Judge Glickfeld]: And I won't tolerate any pressures on the police either, and having somebody telling me he is here to protect somebody. I have got some pretty good protection here. So everything will go over to the 8th on the motions. . . . I will tell you one thing, if you find out any direct pressures have been exerted on any arm of the court, the probation department, police department, or anything else, I will bring the person before the court and there will be a hearing on a question of contempt of court. And I will tell you this right now, and with all the consequences that follow from it, if it comes to my attention, and that means everybody.\"\n\nThe hearings were then continued to April 8. On that day Beasley, as promised, was committed to the California Youth Authority and the three remaining counts of the indictment against him were dismissed under the purported authority of Penal Code section 1385. Morris' hearing was continued to April 11.\n\nOn the April 11 hearing the record shows the following, among other things, to have occurred:\n\n\"[Judge Glickfeld]: And Mr. Morris is 22 and so he is not eligible for that [California Youth Authority], and I had recommended Work Furlough Program. And the chief probation officer [Mr. Kavanaugh] was under a misinformation as to the powers of the court and apparently he thinks he is a judge, and I am not going to let him preempt my position or that of Judge Karesh or Judge Neubarth. I am not going to get into any discussion with him at this time, but the future will take care of itself. But the report indicates that probation should be denied and they say the man is ineligible for Work Furlough. And I just want to point out for the record that another man was put on Work Furlough who had two previous felonies without permission of the court and who was charged\n\nwith robbery, second degree, 487,\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e and who was not a local resident, and who was on Work Furlough one day and then escaped and there was a bench warrant out for him. . . .\n\n\"I know that the district attorney's office is strongly opposed to this, and I say this sincerely, but there is a lot of hocus-pocus in the background here, and I am going to persist in my judgment. And I sit here and I am responsible for this judgment, and it is my conscience, and I am going to answer to my God for my judgment. . . . At this time I don't want to make a fuss about the Work Furlough, but I will put you on probation for a period of three years, and as a condition of probation you are to spend the next 52 weekends in the county jail commencing Friday night at 7 o'clock, and you will be released at 6 o'clock Monday morning.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e . . .\"\n\n\"Counts 1 [Rape], 3 [rape], and 4 [kidnaping to commit robbery], which I indicated I am going to dismiss pursuant to section 1385 of the Penal Code, I am dismissing such counts.\n\n\"Mr. Norman: And may the record indicate the district attorney is objecting to the dismissing of those counts and it is the district attorney's position, and he requests this court to set those matters for trial as soon as possible.\n\n\"[Judge Glickfeld]: I have already dismissed them and I can't set something I have dismissed.\n\n\"Mr. Norman: Well, we would ask your Honor to not dismiss and to set them for trial.\n\n\"[Judge Glickfeld]: I have already dismissed them, and if you want to appeal the use of my discretion, you have a remedy.\n\n\"Mr. Norman: We understand that. And for the record, Your Honor, and on behalf of the district attorney, it is felt that this is one of the most vicious and most aggravated offenses that has come in this county in the last several years, and we are objecting to the sentence in this case and feel that probation is not in order at all. . . . Might I inquire of the court just what hocus-pocus the court has said or alluded to?\n\n\"[Judge Glickfeld]: There has been a lot of pressure here. I have talked to Mr. Kavanaugh and I indicated the hocus-pocus, Mr. Norman, by reason of the type of person that was put on the Work Furlough, and I have indicated it because Mr. Kavanaugh was trying to preempt the\n\nfunction of the judge. Now, I have had a lot of information and I am not going to talk about it at this time, and which has come to my attention and which shows a lot of finagling in the background and effort to get to Mr. Kavanaugh with pressure. I am not going to go into this, but I am aware of them; and if you are not, you are being pretty naive. . . . And the next time this happens Mr. Kavanaugh will be in here on a contempt charge. It is that simple. Now you know my position. . . . And, for example, I will tell you one hocus-pocus which I got from the probation report. They referred to some letters sent in, and I had to request the letters and find out who sent them in and what they said. That is one piece of hocus-pocus, and I think the court is entitled to a full revelation of what the file contains. That is one, and I could tell you many more.\"\n\nJudgment against Morris was then pronounced; he was sentenced to state prison on each of the counts to which he had pleaded guilty. Judge Glickfeld thereupon ordered that each of the sentences be suspended, and that Morris be placed on probation on each count for three years, on condition that he serve 52 weekends in the county jail.\n\nThe People contend: (1) that Judge Glickfeld abused his discretion in granting probation to Morris, and in dismissing the unresolved charges of rape and kidnaping to commit robbery against Morris and Beasley; (2) that under the law (Pen. Code, § 1203) Morris was ineligible for probation; and (3) that the orders of dismissal were invalid for failure of the judge to set forth the reasons therefor \"in an order entered upon the minutes\" as required by Penal Code section 1385.\n\nThe People's first contention, as indicated, relates to the \"discretion\" vested in courts on probation and dismissal proceedings. Recently California's Supreme Court in People v. Russel, 69 Cal. 2d 187, 194 [70 Cal. Rptr. 210, 443 P.2d 794], quoting earlier authority on the subject, stated:\n\n\"'The discretion intended, however, is not a capricious or arbitrary discretion, but an impartial discretion, guided and controlled in its exercise by fixed legal principles. It is not a mental discretion, to be exercised ex gratia, but a legal discretion, to be exercised in conformity with the spirit of the law, and in a manner to subserve and not to impede or defeat the ends of substantial justice.' . . . '\"'The word imports the exercise of discriminating judgment within the bounds of reason. Discretion in this connection means a sound judicial discretion, enlightened by intelligence and learning, controlled by sound principles of law, of firm courage combined with the calmness of a cool mind, free from partiality, not swayed by sympathy nor warped by prejudice nor moved by any kind of\n\ninfluence save alone the overwhelming passion to do that which is just.'\"'\" The court continued, saying (p. 195): \"[We] think, that all exercises of legal discretion must be grounded in reasoned judgment and guided by legal principles and policies appropriate to the particular matter at issue,\" and that \"'\"In a legal sense discretion is abused whenever in the exercise of its discretion the court exceeds the bounds of reason, all of the circumstances before it being considered.\"'\" (p. 194.)\n\nAn observation seems appropriate at this point: The People of the State of California, represented by the district attorney, are a party the plaintiff in this and all criminal actions (Gov. Code, § 100). They, the People, are entitled to the same judicial impartality and fairness as any other litigant in our courts.\n\nWe first consider the contention that the order granting Morris probation was an abuse of the court's discretion.\n\nSuch an order is appealable. Penal Code section 1239 designates the decisions from which the People have a right of appeal. Subdivision 5 of that section authorizes such an appeal \"From an order made after judgment, affecting the substantial rights of the people.\" It has been held that an order granting probation, as in Morris' case, after pronouncement of judgment, imposition of sentence, and suspension of sentence is appealable by the People as such \"an order made after judgment\" (People v. Orrante, 201 Cal. App. 2d 553, 556 [20 Cal. Rptr. 480]; People v. Superior Court, 118 Cal. App. 2d 700, 703 [258 P.2d 1087]; In re Sargen, 135 Cal. App. 402 [27 P.2d 407]).\n\nIt is established law that where an appeal is taken from an order granting probation, upon a showing that there was a clear abuse of discretion by the trial judge, his order will be reversed. (See People v. Lippner, 219 Cal. 395, 400 [26 P.2d 457]; People v. Ingram, 272 Cal. App. 2d 435, 439 [77 Cal. Rptr. 423]; People v. Mancha, 213 Cal. App. 2d 590, 592 [29 Cal. Rptr. 72]; People v. Privitier, 200 Cal. App. 2d 725, 730 [19 Cal. Rptr. 640]; People v. Hollis, 176 Cal. App. 2d 92, 96 [1 Cal. Rptr. 293]; People v. Bartges, 126 Cal. App. 2d 763, 776 [273 P.2d 49]; People v. Connolly, 103 Cal. App. 2d 245, 247-248 [229 P.2d 112]; People v. Adams, 100 Cal. App. 2d 841, 844 [224 P.2d 873]; People v. Jackson, 89 Cal. App. 2d 181, 182 [200 P.2d 204]; People v. Wiley, 33 Cal. App. 2d 424, 429 [91 P.2d 907].)\n\nThe manner in which a trial judge must exercise his discretion in granting or withholding probation has been pointed out by the Supreme Court.\n\nIn Times-Mirror Co. v. Superior Court, 15 Cal. 2d 99, 113 [98 P.2d 1029], the court declared:\n\n\"Section 1203 of the Penal Code prescribes the procedure governing applications for probation and the source from which the court may receive the necessary information to enable it to act in such matters. By this section of the code the court must refer the application to the probation officer whose duty it is after investigation to make a report to the court which report the court must consider in making its final decision in granting or denying probation. We find nothing in said section of the code nor in any other provision of the law which would justify any different approach to the court when matters of probation are before it than when the regular proceedings before and at the trial are under the court's consideration. . . . The probation of a defendant is a legal act of the court and is governed by the same rules as are applicable to any other legal proceeding before the court.\"\n\nMore recently in People v. Wade, 53 Cal. 2d 322, 337-338 [1 Cal. Rptr. 683, 348 P.2d 116], the court stated:\n\n\"The probation of offenders is provided for in section 1203 of the Penal Code: '\". . . in every felony case in which the defendant is eligible for probation, before any judgment is pronounced, and whether or not an application for probation has been made, the court must immediately refer the matter to the probation officer to investigate and to report to the court. . . . The probation officer must thereupon make an investigation of the circumstances surrounding the crime and of the prior . . . history of the defendant, must make a written report to the court . . . and must accompany said report with his written recommendations . . . as to the granting or withholding of probation. . . . At the time . . . fixed by the court, the court must hear and determine . . . the suitability of probation in the particular case, and in connection therewith must consider any report of the probation officer, and must make a statement that it has considered such report. . . . If the court shall determine that there are circumstances in mitigation of punishment prescribed by law, or that the ends of justice would be subserved by granting probation to the defendant, the court shall have power in its discretion to place the defendant on probation. . . .\"' [ para. ] The purport of the statute and the cases is that the trial court must not decide the question of probation until it is in possession of all of the relevant facts, especially those contained in the probation report. [Italics ours.] There is little question from the record in the case at bar that the trial judge had decided the question of probation against the defendant at the time of granting her request to file an application therefor. It is clear that the judge did not wait until the report was completed and submitted to her.\"\n\nIn Wade, the Supreme Court found the trial judge's premature decision on the question of probation to be abusive of the court's discretion, and therefore error.\n\nAs indicated, Morris asserts in his brief and repeats at oral argument that the early conferences with Judge Glickfeld resulted in \"a package disposition of all five charges.\" He insists that the judge's promise of probation was an integral part of that disposition. The record fully supports Morris' contention.\n\nThroughout the subject proceedings Judge Glickfeld made it clear that such an agreement had been reached, and that despite further factual revelation, report, or recommendation of the probation officer, or objection of the People, he intended to follow it. This intent was memorialized on the record even before the Morris and Beasley guilty pleas were entered.\n\nThe judge at that time told the defendants \" what I intend to do.\" To Morris he stated: \". . . it is my intent to treat your case as follows : State Prison, suspended, and put you on probation for three years, and one year in the County Jail as a condition on a Work Furlough. In other words, you are in an apprentice program and whatever that is we will work out. You will have to go in every night or whatever it is. . . . So that is what I am going to do. And, sir, you have got two counts and I would make them concurrent. And again, there would be a probation report before this, which would take the same length of time. . . .\" (Italics added.) The district attorney interrupted saying, \" We would like to be heard at the conclusion of what your Honor says.\" (Italics added.) The judge responded: \"Yes, but I am just telling him what I am going to do.\" (Italics added.)\n\nAs we have noted, the probation officer thereafter rejected Morris for the judge's contemplated Work Furlough program. He also filed his report and recommended against probation. In open court the judge responded: \"I don't like the pressures that are being put on from the outside, I believe, on the probation department and the Work Furlough Program, . . . I will not tolerate any pressure on the court and district attorney or on any arm of the court; and the probation department is an arm of the court. . . . And the chief probation officer was under a misinformation as to the powers of the court and apparently he thinks he is a judge, . . . I am not going to get into any discussion with him at this time, but the future will take care of itself. But the report indicates that probation should be denied and they say the man is ineligible for Work Furlough. . . . This court will not be threatened by threats of what the newspapers are going to do and by other threats of what Mr. Kavanaugh intends to do. And the next time this happens Mr. Kavanaugh will be in here on a contempt charge. It is that simple. Now you know my position.\"\n\nWe recognize that the court did endorse on the probation report the legally required language, \"I have read and considered the report of the probation officer.\" (Pen. Code, § 1203, 1st par.) But here again, as in Wade, supra, 53 Cal. 2d 322, 337, \"During the proceedings at which judgment was pronounced, the court made it quite clear that [its] earlier preconception had not, in fact, been changed despite reciting the formula in the language of the statute that 'the court has read and considered the report of the Probation Officer.'\" In People v. Surplice, 203 Cal. App. 2d 784, 791-792 [21 Cal. Rptr. 826], where the trial judge made such a statement, the appellate court held that any inference arising therefrom was \"expressly negated\" by other statements and the conduct of the judge.\n\nAs was the case in People v. Wade, supra, 53 Cal. 2d 322, 338, \"There is little question from the record in the case at bar that the trial judge had decided the question of probation\" long before he was in possession of the relevant facts of the probation report. The grant of probation to Morris under these circumstances was accordingly an abuse of discretion, an abuse which we think clear.\n\nThere is additional evidence pointing to an abuse of the court's discretion.\n\nJudge Glickfeld's incomprehensible tirade (noted ante, fn. 6) against the victim of Morris' crime, her police inspector attendant, and his superior officer obviously discouraged, or at least tended to discourage,\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e her testimony as to the details of the offense as provided by Penal Code section 1204. And the judge's threat \"And the next time this happens Mr. Kavanaugh [the probation officer] will be in here on a contempt charge\" quite clearly refers to that official's recommendation against probation and rejection of Morris for the agreed Work Furlough program. Yet the duty to make such decisions is reposed in the probation officer by law. We note also the court's repeated accusations of \"pressure,\" \"hocus-pocus,\" and \"finagling.\" These matters tend to indicate a lack of the impartial discretion, guided by fixed legal principles in conformity with the spirit of the law, required by People v. Russel, supra, 69 Cal. 2d 187, 194.\n\nFurthermore, Penal Code section 1203 clearly requires that the court exercise its discretion as to probation after the motion therefor and the filing of the probation officer's report. This Judge Glickfeld did not do. Here it is clear, and so admitted by Morris, that the court was adhering to a \"package disposition\" long before reached, which included a grant of probation. This amounts to a failure to exercise a discretion required by law -- the practical equivalent of an abuse of discretion -- for which\n\nreason also the order granting Morris probation was improper. (See In re Brumback, 46 Cal. 2d 810, 813 [299 P.2d 217]; Saidi-Tabatabai v. Superior Court, 253 Cal. App. 2d 257, 262 [61 Cal. Rptr. 510]; Tobin v. Tobin, 181 Cal. App. 2d 789, 794 [5 Cal. Rptr. 712].)\n\nAccordingly, the order granting Morris probation must be reversed.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nWe find the People's related contention that Judge Glickfeld had no discretion, but was instead prohibited by law from granting probation to one convicted of rape \"with force and violence\" except with the consent of the district attorney, to be without merit. The contention is based upon Penal Code section 1203 (4th par.), which provides: \"Probation shall not be granted to any person who shall have been convicted of . . . rape with force or violence, . . . who in the perpetration of the crime . . . wilfully inflicted great bodily injury or torture, . . .\" Section 1203 (5th par.), states: \"In unusual cases . . . in which the interests of justice would best be served thereby, the judge may, with the concurrence of the district attorney, grant probation.\"\n\nIt is argued, not without some reason, that forcible rape necessarily includes infliction of \"great bodily injury.\" However, the Legislature has made clear an intent that \"great bodily injury\" as the term is used in section 1203 (4th par.) has a different meaning. Elsewhere in section 1203 (4th par.) it is said that probation shall not be granted to one convicted of rape with force and violence who at the time of the offense was \" armed with a deadly weapon.\" (Italics added.) Also the section denies probation, as a matter of law, if the perpetrator of such a crime \" has previously been convicted of a felony.\" (Italics added.) It is thus made clear that conduct beyond that necessarily required to commit forcible rape must appear before the accused is by law rendered ineligible for probation.\n\nIn People v. Merrill, 104 Cal. App. 2d 257, 266-267 [231 P.2d 573], the court recognized that section 1203 denies probation to one who rapes by force and violence only where the bodily injuries or torture were more than that necessary to prove the rape charge. In that case bruises on the victim's body, and the thumb gouging of her eye until she yielded, were held to constitute the bodily injury and torture required by section 1203. In the case before us Lois, fortunately, was not so additionally abused.\n\nWe note also that Morris and Beasley were charged with, and pleaded guilty to, violating Penal Code section 261, subdivision 4, referring to rape\n\nwhere the victim \"is prevented from resisting by threats of great and immediate bodily harm.\" It is section 261, subdivision 3, not here involved, that relates to rape where \"resistance is overcome by force or violence.\"\n\nWe turn now to the People's contention that the dismissal of the unresolved charges against Morris and Beasley, under the purported authority of Penal Code section 1385, was abusive of the court's discretion.\n\nPenal Code section 1238, subdivision 8, states: \"An appeal may be taken by the people: . . . From an order or judgment dismissing or otherwise terminating the action before the defendant has been placed in jeopardy.\" It is observed that the remaining counts of kidnaping and rape against Morris and Beasley were dismissed before either had been placed in jeopardy on those charges. A defendant is in jeopardy for an offense \"'when (1) placed on trial (2) for the same offense, (3) on a valid indictment or information or other accusatory pleading (4) before a competent court, (5) with a competent jury, duly impaneled and sworn and charged with the case; or, if the trial is by the court, it must be \"entered upon.\"'\" (People v. Hernandez, 250 Cal. App. 2d 842, 848 [58 Cal. Rptr. 835]; 1 Witkin, Cal. Crimes (1963) p. 178, and see authorities there cited.)\n\nNo recognizable policy appears against prosecution or punishment for a previously dismissed felony offense when jeopardy has not attached. Indeed, Penal Code section 1387 expressly provides: \"An order for the dismissal of the action, made as provided in this chapter [which includes § 1385], is a bar to any other prosecution for the same offense if it is a misdemeanor, but not if it is a felony.\" (Italics added.)\n\nThe question on review of such a dismissal order ordinarily is also whether under the circumstances the trial judge exceeded the bounds of judicial discretion. If there was such an abuse of discretion the order must be set aside. (See People v. Superior Court, 249 Cal. App. 2d 714, 718 [57 Cal. Rptr. 892]; People v. Gonzales, 235 Cal. App. 2d Supp. 887, 890 [46 Cal. Rptr. 301]; People v. Winters, 171 Cal. App. 2d Supp. 876, 880-882 [342 P.2d 538].)\n\nPenal Code section 1385 reads as follows:\n\n\"The court may, either of its own motion or upon the application of the prosecuting attorney, and in furtherance of justice, order an action to be dismissed. The reasons of the dismissal must be set forth in an order entered upon the minutes. No dismissal shall be made for any cause which would be ground of demurrer to the accusatory pleading.\"\n\nPeople v. Gonzales, supra, 235 Cal. App. 2d Supp. 887, concerned an\n\nappeal by the People from an order under Penal Code section 1385 dismissing a criminal action on the trial court's own motion. The order was reversed. Explaining that the rights of the People should be carefully considered in such a proceeding, the court quoted Singer v. United States, 380 U.S. 24 [13 L.Ed.2d 630, 85 S.Ct. 783, 790], as follows: \"'The Constitution recognizes an adversary system as the proper method of determining guilt, and the Government, as a litigant, has a legitimate interest in seeing that cases in which it believes a conviction is warranted are tried before the tribunal which the Constitution regards as most likely to produce a fair result.'\" (Italics added.) The Gonzales court continued (p. 890): \"[The] courts generally weigh the recommendations and contentions as to the facts put forward by the prosecuting attorneys. . . . Under our adversary system, the court prior to receipt of evidence in course of trial or formal proceedings is usually not informed of all of the circumstances of the alleged crime nor of the evidence available to the prosecution to prove the guilt of an accused; it does not have the investigative facilities available to the office of the prosecutor. . . . [P. 892] By the observation of our basic notion that a criminal proceeding is basically adversary in nature, the general respect of the public for courts and the judicial process, we feel, will be promoted. Courts and judicial officers must at all times not only be fair in fact, but also be diligent in preserving the appearance of fairness as well.\"\n\nSpecifically referring to Penal Code section 1385, it has been held that the language of that section, \"furtherance of justice,\" requires consideration both of the constitutional rights of the defendant, and the interests of society represented by the People, in determining whether there should be a dismissal. (People v. Winters, supra, 171 Cal. App. 2d Supp. 876, 887; People v. Disperati, 11 Cal. App. 469, 477 [105 P. 617].)\n\nThe record before us uncontrovertably shows that even before Morris and Beasley had entered their guilty pleas, and over the objection of the People, Judge Glickfeld had made up his mind to dismiss the charges in question. At that time he was without the benefit of the legally required probation officer's report containing a full exposition of the case and the background of defendants. If the judge accepted out of court information in mitigation of defendants' crimes, such was in violation of Penal Code section 1204. Reciting details of the early \"package disposition\" which included the dismissal of the kidnaping count and two rape counts against each defendant, the judge declared: \" That is what I intend to do and I put it on the record so there is no question.\" (Italics added.) And the judge thereafter honored his promise.\n\nAs in the case of the order granting Morris probation, the predetermination of defendants' cases, coupled with the circumstances and\n\ncourt-created atmosphere of the following proceedings, demonstrates a lack of the reasoned judgment, free from partiality, exercised in conformity with the spirit of the law, required by People v. Russel, supra, 69 Cal. 2d 187, 194. We conclude that the trial court's dismissal of the kidnaping and rape charges against Morris and Beasley was also an abuse of discretion.\n\nThere is yet another reason why the dismissals must be set aside. As indicated, section 1385 specifies that the \" reasons of the dismissal must be set forth in an order entered upon the minutes.\" (Italics added.) This requirement was not followed by Judge Glickfeld.\n\nOne of the purposes of the specification of reasons is to enable an appellate court to determine whether, in view of the reasons assigned to justify a section 1385 dismissal, a proper exercise of discretion is shown. (See People v. Winters, supra, 171 Cal. App. 2d Supp. 876, 880.) And \"A judge dismissing criminal charges without trial, upon his own motion, must record his reasons so that all may know why this great power was exercised, and such public declaration is indeed a purposeful restraint, lest magistral discretion sweep away the government of laws.\" (People v. Winters, supra, p. 882.) People v. Silva, 236 Cal. App. 2d 453, 455 [46 Cal. Rptr. 87], holds: \"The statutory requirement for the entry of reasons for dismissals on the minutes is designed to protect the public interest against improper or corrupt dismissals. . . .\"\n\nThe statement of reasons is not merely directory, and neither trial nor appellate courts have authority to disregard the requirement. It is not enough that on review the reporter's transcript may show the trial court's motivation; the minutes must reflect the reason \"so that all may know why this great power was exercised.\" (See People v. Winters, supra, 171 Cal. App. 2d Supp. 876, 880-882; People v. Disperati, supra, 11 Cal. App. 469, 476-477.)\n\nDefendants cite certain cases as authority for the proposition that the court need not state reasons for a section 1385 dismissal in the minutes. People v. Smith, 133 Cal. App. 2d Supp. 777 [284 P.2d 203], and People v. Superior Court, supra, 249 Cal. App. 2d 714, respectively, hold that a written statement of reasons on the court's docket, and a typewritten transcript of orally stated reasons forthwith filed at the court's direction, were the substantial equivalent of a statement on the minutes. In those cases the requirement of a public declaration of reasons \"so that all may know\" was met; there was no such public declaration in the case at bench. People v. Silva, supra, 236 Cal. App. 2d 453, 455, and People v. Fox, 126 Cal. App. 2d 560, 567 [272 P.2d 832], hold that the \"statement of reasons\" requirement was made in the public interest and not for the\n\nprotection of the defendant. Since \"'The section has nothing whatever to do with the rights of the defendant'\" (People v. Fox, supra) it was held in effect that he had no standing to complain.\n\nIt is urged that the obvious reason for dismissing the remaining counts against Morris and Beasley was the fact that they had pleaded guilty to the other counts. Were we also to speculate, we would consider it to be far more obvious that the reason for the dismissal was Judge Glickfeld's illegal promise, made many weeks before, to do so. Such a discussion points up the necessity that the reasons \"be set forth in an order entered upon the minutes\" (Pen. Code, § 1385) \"so that all may know why this great power was exercised.\" (People v. Winters, supra, 171 Cal. App. 2d Supp. 876, 882.)\n\nWe find ourselves also in agreement with the People's contention that the orders of dismissal were invalid for reasons apart from their entry being abusive of the court's discretion.\n\nThe only statutory authorization, as well as the court's purported justification, for the dismissals was Penal Code section 1385. Without the required statement of reasons therefore a dismissal under that section is invalid. This is now established law. People v. Superior Court, 69 Cal. 2d 491, 503, fn. 7 [72 Cal. Rptr. 330, 446 P.2d 138], states: \" If the reasons are not set forth in the minutes, the order dismissing may not be considered a dismissal under section 1385.\" (Italics added.) (See also People v. Evans, 275 Cal. App. 2d 78, 80 [79 Cal. Rptr. 714]; People v. Superior Court, 240 Cal. App. 2d 90, 92 [49 Cal. Rptr. 365]; People v. Shaffer, 182 Cal. App. 2d 39, 45 [5 Cal. Rptr. 844].) Under this authority also, we must hold Judge Glickfeld's dismissal orders to be invalid.\n\nWe have considered the effect of the restoration of the \"kidnapping to commit robbery\" (Pen. Code, § 209) charge against Beasley. That defendant has now been convicted of, and is undergoing punishment for, the robbery of Lois. The judgment as to the robbery has not been appealed and it is now final. It is patent that the kidnaping of Lois to commit robbery and her robbery were parts of a course of criminal conduct, the objective of which was the theft of the victim's property. In re Ward, 64 Cal. 2d 672, 675-676 [51 Cal. Rptr. 272, 414 P.2d 400], which also concerned charges of kidnaping for robbery and the resultant robbery, holds \"Section 654 of the Penal Code prohibits the imposition of double punishment if either a single act or a course of criminal conduct engaged in with a single objective is charged as the basis of multiple convictions. Under such circumstances, the defendant can be punished only for the\n\nmore serious offense. [Citation.]\" Penal Code section 654 provides that upon a conviction and sentence on one such related charge a defendant may not thereafter be prosecuted under the other.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e It would therefore be idle to reverse the \"kidnapping for robbery\" (§ 209) charge against Beasley.\n\nWe note that no rule proscribes multiple prosecution or multiple punishment where, as here, a defendant is charged with himself having directly committed the act of rape and with aiding and abetting\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e each of two accomplices in their rapes of the same victim.\n\nThe present posture of this case results from an illegal \"package disposition\" arranged between the judge and defense counsel. While ordinarily one may not complain of a result brought on by himself, the fact nevertheless remains that each defendant has now served time on the convictions following his guilty pleas. The fairest and most just solution of the problem before us would be the restoration of all parties, as nearly as possible, to the positions held prior to the entry of the guilty pleas. This would allow resumption of the action on all counts, untrammeled by the procedural snarls we have encountered in the record. But such a result must depend upon the voluntary withdrawal by defendants of their guilty pleas. A somewhat similar disposition was permitted in People v. Delles, supra, 69 Cal. 2d 906, 910-911. If defendants or either of them shall so elect to withdraw the guilty pleas, they may do so. If they or either of them shall thereafter be convicted and sentenced on the charges to which they had previously pleaded guilty, credit for any time served thereon is required by Penal Code section 2900.1.\n\nAs to defendant Morris: The order of April 11, 1969, is reversed insofar as it purports to dismiss counts 1, 3 and 4 of the indictment; the order of April 11, 1969, granting probation is reversed.\n\nAs to defendant Beasley: The order of April 8, 1969, is reversed insofar as it purports to dismiss counts 2 and 3 of the indictment; as to count 4 the order is affirmed.\n\nDisposition\n\nAs to defendant Morris: The order of April 11, 1969, is reversed insofar as it purports to dismiss counts 1, 3 and 4 of the indictment; the order of April 11, 1969, granting probation is reversed.\n\nAs to defendant Beasley: The order of April 8, 1969, is reversed insofar as it purports to dismiss counts 2 and 3 of the indictment; as to count 4 the order is affirmed.\n\nSIMS, J. I dissent.\n\nWithout personally approving or disapproving the disposition of the matter effected by the orders of the trial court, I find that his orders were within the proper scope of his discretion. If the judiciary is to play a part in the sentencing process it should not be bound to follow the recommendations of the district attorney or the probation officer, nor should it be subject to public pressure or to reversal because on appeal another disposition might appear more appropriate. Although the trial judge engaged in some apparently unwarranted and intemperate remarks, I do not believe that the record shows as a matter of law that he abused his discretion in disposing of the charges as he did.\n\nIn order to put the proceedings and facts, particularly those relating to Morris' qualifications for probation, in proper perspective, I have repeated much which is set forth in the foregoing opinion, but I believe it is necessary to trace the developments as they occurred to determine whether the judge was acting within the sphere of a proper discretion, or arbitrarily in violation of his sworn duty.\n\nAs a result of the acts set forth in the opinion Beasley, Morris and one Jackson were jointly indicted for (1) rape by threat of great and immediate harm (Pen. Code, § 261, subd. 4) committed by Beasley aided and abetted by his codefendants, (2) the same offense committed by Morris, aided and abetted by his codefendants, (3) the same offense committed by Jackson, aided and abetted by his codefendants, (4) kidnaping for the purpose of committing robbery (Pen. Code, § 209), and (5) robbery (Pen Code, § 211). Jackson entered his plea of guilty to the first count, was denied probation and was sentenced to state prison for the term prescribed by law (three years to life, Pen. Code, §§ 264 and 671), with the minimum term reduced to six months, pursuant to the provisions of section 1202b of the Penal Code by virtue of his age. Thereafter, on February 21, 1969, the trial judge received guilty pleas from Morris as to counts (2) and (5), and from Beasley as to counts (1) and (5). The degree of robbery was fixed as of the second degree by stipulation, or at least without the objection of the district attorney. Prior to, and in connection with receiving the pleas, the judge announced his intention to refer Beasley to the Youth Authority, his intention to sentence Morris to state prison, suspend the sentence and to admit him to probation for three years with one year in the county jail under the Work Furlough Program, and his further intention to dismiss the remaining counts as to each defendant. The assistant district attorney announced the People's opposition to the proposed disposition of the case, and expressly indicated that probation was not in order and should be denied.\n\nBoth proceedings were ultimately continued to March 21st and at that time following discussion in open court, which is reviewed below, the case was continued to different dates for disposition as to each defendant. On April 8th Beasley was committed to the Youth Authority. Over the objection of the prosecutor, and despite his attempts to have the matter set for trial, counts (2), (3) and (4) were dismissed as to Beasley.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e On April 11th, the court, over the protests of the assistant district attorney, made the order of dismissal and order granting probation with respect to Morris which the People seek to have reviewed on this appeal.\n\nThe People contend, as set forth in their notices of appeal, that the action of the court in dismissing, as to each defendant, two counts of rape and one count of kidnaping for the purpose of robbery, was an abuse of discretion and resulted in an improper and illegal order. On appeal it is contended that the orders were void because no reason for the dismissals was set forth in the minutes. They further contend that the grant of probation to Morris without the concurrence of the district attorney was in excess of the powers vested in the court, under the provisions of section 1203 of the Penal Code, and was an abuse of discretion.\n\nFor the reasons set forth below I conclude that the orders dismissing the counts that were unresolved were not void for failure to set forth an express reason in the minutes; that there was no abuse of discretion in dismissing those counts on the record before the court at the time they were dismissed; that the defendant Morris was eligible for probation without the necessity of concurrence by the district attorney; that the order admitting him to probation was within the sphere of discretion conferred on the trial judge by the Legislature; and that the remarks of the trial judge, although incomprehensible, irregular and subject to criticism, do not establish that the judge's announced intention was predicated on facts which were not in the record before him, or facts which were not thereafter incorporated in the probation report, so as to constitute a premature irrevocable preconception which would vitiate his subsequent formal judicial acts, nor do such remarks establish that his decision exceeds the bounds of reason. The judgment and orders should be affirmed.\n\nStatement of Facts\n\nThe facts as stated in the probation report prepared in the case of Morris accurately reflect the part played by each of the defendants as revealed by\n\nthe transcript of the grand jury proceedings leading to their indictment.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The report recites:\n\nThe grand jury transcript reveals the victim was an employee of The Jack Tar Hotel. After she left work on the evening of November 20, 1968, she was waiting for a bus at the transfer point of 25th Avenue and Geary around 11:10 p.m. William Morris and the two co-defendants were in his car which was stopped there by a controlled traffic light. They started to call out to her and the light changed and they pulled away. A man was also standing at this transfer point and an older woman who approached the victim and engaged her in conversation. When the bus came they got on it and sat together until the victim left it at 16th Avenue and Lawton Street.\n\nThe victim was approximately one block away from her home when she observed defendant's car slow down and she heard them say \"there she is -- that's her.\" She continued to walk towards her home and she was one house away from it when the defendant's car went past her down to the corner and circled back. William Morris was the driver and it was his car. When he stopped the car Kenneth Beasley jumped out and grabbed her from behind the neck and held his hand over her mouth. She started to kick and then Rickie James Jackson grabbed her feet and she was put forcibly inside the car. Kenneth Beasley was in the back seat with her while the defendant Jackson rode in the front with William Morris.\n\nThe victim was told not to look at the defendant that was in the seat with her nor to scream. She was advised to relax and it was indicated she was going for a long ride. William Morris indicated that he was going to kill her. One of the other defendants told him not to kill her pointing out that she was too pretty. Another one said that's what got her into this trouble. Then Kenneth Beasley who was in the back with her grabbed her face and she pleaded with him not to do anything to it. While they were riding they went through her purse and wallet and removed $3 and each of them took one dollar. Subsequently they took her topaz ring. They were annoyed she had so little money and finally the car was stopped on Rockaway Beach near some bushes. They inquired if her family had any money indicating they could hold her for two weeks for ransom. She told him they were poor that her father was only a truck driver.\n\nWhile she was being driven to Rockaway Beach, Kenneth Beasley\n\nremoved her coat, sweater, dress and bra. When they arrived at this destination she was ordered to take off the balance of her clothing which she did, because she was afraid of being killed. Then each of the defendants raped her twice. After this they indicated they did not know what they would do with her and again they started to talk about money. The victim advised them if they were interested in money they did not have to hurt her, because she would get them some. She explained prior to leaving work she closed out with $600 and she had a key to her bank of $150. She told them if they would return with her to The Jack Tar Hotel she would get it for them. They indicated this was not enough money then one of them decided she was telling the truth, because cashiers do have banks that they close with each day. They asked what time she would be off the next day and even though it was her off day she told them 6 p.m. Then they decided $200 each would be good and they started to talk about how they would spend their money. The victim then explained if they marred her face she would not be able to get the money for them, because she would have to look good in order to work on the job at the hotel. Then the victim planned the scheme for them so that it would look as though she was being held up.\n\nThey then decided to take her home and enroute asked how she would explain to her mother the fact that she was out so late. She told them she would inform her mother she had met a friend and gone out for a drink. They asked if she would call the police and she replied in the negative. They wanted to drive her to the front door, but the victim felt by now her mother would have called the police and she felt if the defendants saw a squad car in front of her house they might not leave her out. Therefore she prevailed upon them to leave her out at the corner which they did. Two of the defendants each returned the dollar they had taken but one kept his. When she asked them for her ring they would not give it to her.\n\nThe next day Beasley and Morris were apprehended when they came to the hotel and were identified by the victim.\n\nI\n\nRight of Appeal from Dismissal\n\n\"The power under which the order was made is substantially the same as that held by the attorney-general in England, and by the prosecuting officer in many of the American states, to enter a nolle prosequi. The court, for the purposes of the order of dismissal, takes charge of the prosecution, and acts for the people. It holds the power to dismiss, as the attorney-general in England holds the power to enter a nolle prosequi, by virtue of the office and the law; and it is exercised upon official responsibility.\" (People v. More (1886) 71 Cal. 546, 547 [12 P. 631]. See also, People v. Superior Court [ Howard ] (1968) 69 Cal. 2d 491, 499 [72 Cal. Rptr. 330,\n\n446 P.2d 138]; People v. Sidener (1962) 58 Cal. 2d 645, 647-648 [25 Cal. Rptr. 697, 375 P.2d 641]; People v. Valenti (1957) 49 Cal. 2d 199, 208 [316 P.2d 633] [limited in People v. Sidener, supra, 58 Cal. 2d at p. 647]; People v. Superior Court [ Kasparek ] (1962) 202 Cal. App. 2d 850, 854 [21 Cal. Rptr. 178]; People v. Romero (1936) 13 Cal. App. 2d 667, 670 [57 P.2d 557]; People v. Gonzales (1965) 235 Cal. App. 2d Supp. 887, 890 [46 Cal. Rptr. 301].)\n\nPrior to the addition of subdivision \u003cspan class=\"fnref\"\u003e73\u003c/span\u003e and subdivision \u003cspan class=\"fnref\"\u003e84\u003c/span\u003e to section 1238 of the Penal Code, it was established that, \"The court having acted for the people, and under express power granted by them to so act in their criminal prosecution, there is no appeal on their part for such action.\" (People v. More, supra, 71 Cal. at p. 547. See also, People v. Superior Court [ Howard ], supra, 69 Cal. 2d at pp. 497-499; People v. Valenti, supra, 49 Cal. 2d 199, 207; People v. Superior Court [ King ] (1967) 249 Cal. App. 2d 714, 715 [57 Cal. Rptr. 892]; People v. Superior Court [ Kasparek ], supra, 202 Cal. App. 2d 850, 852-854 [21 Cal. Rptr. 178]; People v. Ehrhart (1961) 196 Cal. App. 2d 468, 469-471 [16 Cal. Rptr. 606]; and People v. Baxter (1953) 119 Cal. App. 2d 46, 48-50 [258 P.2d 1093].)\n\nNevertheless it was recognized that in exceptional cases the action of a superior court in dismissing a case under the provisions of section 1385 could be reviewed by petition for writ of mandate. (People v. Superior Court [ Howard ], supra, 69 Cal. 2d 491, 500-501. See also, People v. Superior Court [ Prudencio ] (1927) 202 Cal. 165, 173-175 [259 P. 943]; People v. Superior Court [ King ], supra, 249 Cal. App. 2d 714, 715; People v. Superior Court [ Jonsson ] (1966) 240 Cal. App. 2d 90, 92 [49 Cal. Rptr. 365]; and People v. Superior Court [ Kasparek ], supra, 202 Cal. App. 2d 850, 854-855.)\n\nIt also should be noted that language identical with the first sentence of subdivision 8 of section 1238 of the Penal Code (see fn. 3 above) has been contained in section 1466 governing appeals from inferior courts since 1951 (Stats. 1951, ch. 1674, § 158, p. 3860); and that prior thereto the section provided for an appeal by the People, \"From an order or judgment\n\ndismissing or otherwise terminating the action without a trial.\" (Stats. 1935, ch. 769, § 1 (a), p. 2146; and Stats. 1939, ch. 977, § 1, p. 2730.) Such an appeal was undoubtedly necessary to protect the People's rights in the event of the dismissal of a misdemeanor charge, because section 1387 provided and provides, \"An order for the dismissal of the action, made as provided in this chapter, is a bar to any other prosecution for the same offense if it is a misdemeanor, but not if it is a felony.\" The dismissal of a felony charge generally does not preclude the prosecution from pressing the charges again. (See, People v. Silva (1965) 236 Cal. App. 2d 453, 455-456 [46 Cal. Rptr. 87]; and Arnold v. Williams (1963) 222 Cal. App. 2d 193, 196 [35 Cal. Rptr. 35]; but cf. People v. Disperati (1909) 11 Cal. App. 469, 474-477 [105 p. 617]. Note also, People v. Ehrhart, supra, 196 Cal. App. 2d 468, 470; and People v. Baxter, supra, 119 Cal. App. 2d 46, 50, with respect to misdemeanors which are prosecuted in the superior court.)\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nIn People v. Winters (1959) 171 Cal. App. 2d Supp. 876 [342 P.2d 538], the court noted the distinction which previously existed as follows: \"It will appear, therefore, that in contrast to the uncontrolled discretion of a trial judge in a superior court, under Penal Code, section 1385, the exercise of such a great power is fully subject to review upon appeal when an order of dismissal is made in the municipal court.\" (171 Cal. App. 2d Supp. at p. 880. See also, People v. Gonzales, supra, 235 Cal. App. 2d Supp. 887, 891; and People v. Smith (1955) 133 Cal. App. 2d Supp. 777, 779 [284 P.2d 203].)\n\nInsofar as is material for this case it has been determined in appeals from inferior courts that the word \"action\" as used in the earlier statute \"must be construed distributively as to each count in a complaint, where it contains more than one, there being in legal effect as many actions as there are counts.\" (People v. Ring (1937) 26 Cal. App. 2d Supp. 768, 770 [70 P.2d 281]. See also, People v. Agnello (1968) 259 Cal. App. 2d 785, 787 [66 Cal. Rptr. 571]; and People v. Saffell (1946) 74 Cal. App. 2d Supp. 967, 971 [168 P.2d 497].)\n\nIn People v. Superior Court [ Howard ], supra, it was recognized that the amendments to the Penal Code had changed the prior rule and granted the People a right to appeal from an order of dismissal made by the superior court under any of the circumstances set forth in the amendments. (69\n\nCal. 2d at p. 498, fn. 5. See People v. Curtiss (1970) 4 Cal. App. 3d 123 [84 Cal. Rptr. 106]; People v. McGrew (1969) 1 Cal. 3d 404, 406 [82 Cal. Rptr. 473, 462 P.2d 1]; People v. Evans (1969) 275 Cal. App. 2d 78, 80 [79 Cal. Rptr. 714]; and People v. Superior Court [ MacLachlin ] (1969) 271 Cal. App. 2d 338, 345-347 [76 Cal. Rptr. 712].) The appeals from the orders dismissing three counts as to each of the defendants are properly before this court. The orders terminated the action as to the offenses in question before either defendant had been placed in jeopardy. (Pen. Code, § 1238, subd. 8, see fn. 3 above.] The question remains as to the scope of the review.\n\nReasons in the Minutes\n\nPreliminarily, the People urge that the orders should be adjudged void because the order entered upon the minutes fails to set forth the reasons for the dismissal as required by provisions of section 1385. (See fn. 1 above.) In People v. Superior Court [ Howard ], supra, the court noted, \"If the reasons are not set forth in the minutes, the order dismissing may not be considered a dismissal under section 1385. (People v. Superior Court, supra, 240 Cal. App. 2d 90, 92; see People v. Shaffer, 182 Cal. App. 2d 39, 45 . . .)\" (69 Cal. 2d at p. 503, fn. 7. See also, People v. Curtiss, supra, 4 Cal. App. 3d 123, 127.)\n\nIn People v. Superior Court [ Jonsson ], supra, to which the Supreme Court refers, the question was whether a motion for judgment notwithstanding the verdict could be interposed in a criminal action. The court answered this question in the negative, and granted a peremptory writ commanding the superior court to set aside the judgment and to either sentence the defendants, grant a new trial, or grant probation as the court might be advised. The opinion recites: \"Section 1385, Penal Code, provides in pertinent part: 'The court may, either of its own motion or upon the application of the prosecuting attorney, and in furtherance of justice, order an action to be dismissed. The reasons of the dismissal must be set forth in an order entered upon the minutes.' The court did not purport to be proceeding under this section, as no reason for its action is set forth in the minutes. As said in People v. Shaffer (1960) 182 Cal. App. 2d 39, 45 . . ., an order dismissing a criminal action cannot be considered an order of dismissal under section 1385 if it is devoid of the '\"reasons of the dismissal.\"' Moreover, the order did not purport to order the action to be dismissed. It purported to grant an acquittal. Section 1385 does not give the court the right to disregard the verdict of the jury and to enter judgment\n\ncontrary to the verdict of the jury.\" (240 Cal. App. 2d at p. 92.)\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e To say that a finding that the court was not purporting to act under the provisions of section 1385 is a holding that a purported act under section 1385 is void because the court fails to set forth its reasons in the minutes is a non sequitur.\n\nSimilarly in People v. Shaffer (1960) 182 Cal. App. 2d 39 [5 Cal. Rptr. 844], the issue was not whether a purported dismissal under section 1385 had been properly made and entered, but whether the action of the court in setting aside the information was made in response to the defendant's motion under section 995 of the Penal Code, or in response to a motion to dismiss on some other theory. The minutes reflected the former. The court further observed, \"Secondly, although defendant fails to specify under what provision of the Penal Code he now contends the motion was made, we infer from his argument and citation of authorities that he contends that it was a motion to dismiss in furtherance of justice under Penal Code, section 1385. [Fn. omitted.] The record does not support a contention that such a motion was made. In any event, it is clear from a reading of said section 1385 that it does not confer upon the defendant the privilege of moving to dismiss in the furtherance of justice. [Citation.] . . . Additionally, defendant's contention that the minute order must be construed as an order of dismissal under Penal Code, section 1385, is untenable for the reason that said section requires that: '[the] reasons of the dismissal must be set forth in an order entered upon the minutes.' The minute order here involved is devoid of any statement of the 'reasons of the dismissal.'\" (182 Cal. App. 2d at pp. 44 and 45.) These remarks, when viewed in their setting, do not require approval of the People's contention in this case.\n\nIn People v. Curtiss, supra, 4 Cal. App. 3d 123 the case was dismissed on the court's assertion \"We are not running a collection agency here.\" The court noted the failure to comply with the requirement that the reasons of the dismissal be set forth in the minutes. It recognized the common practice of failing to make such a notation where one or more counts were dismissed in return for a guilty plea to another count, and observed that where the prosecutor moves to dismiss he would not appeal from the dismissal. Despite the shortcoming in the order, the court proceeded to consider it on the merits, and concluded, \"it is an abuse of the broad discretion granted under section 1385 of the Penal Code to dismiss an information solely because the judge feels that a prosecution of this type would mean that the court is 'running a collection agency.'\" (4 Cal. App. 3d at p. 128.)\n\nIn People v. Evans, supra, 275 Cal. App. 2d 78, the People appealed from the trial court's order suppressing evidence and dismissing the case. (See, Pen. Code, § 1538.5, subds, (j) and (o), and § 1238, subd. 7; and People v. Superior Court [ MacLachlin ], supra, 271 Cal. App. 2d 338, 346.) The court stated, \"The order must be reversed for several reasons. In the first place, the order suppressing the evidence is erroneous in that it is based upon the mistaken premise that the arresting officer's observation of marijuana seeds and debris on the automobile seat cushion upon which defendant had been seated immediately before he alighted from the vehicle did not provide probable cause for the further search which led to the discovery of additional and usable quantities of marijuana concealed on defendant's person. In the second place, the order of dismissal fails to comply with the requirement of Penal Code section 1385 that 'The reasons of the dismissal must be set forth in an order entered upon the minutes.'\" (275 Cal. App. 2d at pp. 79-80.) Nevertheless the court proceeded to address itself to the merits of the appeal, and examined the transcript of the hearing on the motion to ascertain the courts' reason for granting the motion to suppress and for ordering a dismissal. (Id. pp. 80, 81.) After consideration of the evidence before the trial court the dismissal was reversed. It was, of course, obvious that the dismissal was predicated upon the suppression of the evidence. The minute order read, \"Hearing re motion under Section 1538.5 Penal Code is resumed. All rest. The motion is granted and the case is dismissed.\" (Id.) The foregoing cases are consistent with other precedents which recognize that resort may be had to the other portions of the record to ascertain the reasons which should have been entered in the minutes.\n\nIn People v. Superior Court [ Howard ], supra, the court acknowledged that the trial judge set forth at length his reasons for the dismissal, and it took the facts from a memorandum opinion which accompanied the order. (69 Cal. 2d at pp. 491 and 496, fn. 3. See also, People v. Smith, supra, 133 Cal. App. 2d Supp. 777, 779.) In People v. Superior Court [ King ], supra, the court noted, \"Section 1385 requires that 'The reasons of the dismissal must be set forth in an order upon the minutes.' In lieu of strict compliance with this provision the judge ordered that the proceedings before him be transcribed and filed.\" (249 Cal. App. 2d at p. 717.) In People v. Head (1930) 105 Cal. App. 331 [288 P. 106], the court observed, \"It is apparent that the pendency of two proceedings constituted good reason for the dismissal of one, and the dismissal of the information under the\n\ncircumstances was obviously in the interests of justice as contemplated by section 1385. The failure to state in the order of dismissal the fact that another proceeding was pending charging the identical offense constituted a mere omission to state a fact which the records of the court already disclosed and here constituted at most a mere irregularity in procedure without prejudice to appellant. It does not appear that the legislature intended by the sections above mentioned to create a bar to further prosecution under the circumstances in the present case.\" (105 Cal. App. at pp. 335-336.)\n\nSo in this case it is apparent that the charges were dismissed in furtherance of justice because the defendants had entered pleas of guilty to two of the five offenses arising out of the same course of conduct. The indictment and the transcript of the grand jury proceedings which was filed to support it establish the relationship of the matters charged in each count.\n\nThe clerk's transcript reflects that on February 4, 1969, codefendant Jackson appeared with counsel, withdrew his motion to set aside the indictment under the provisions of section 995 of the Penal Code, entered a plea of guilty to the first count which charged him with aiding or abetting defendant Beasley in the commission of rape by threats of great and immediate bodily harm in violation of subdivision 4 of section 261 of the Penal Code, and moved for probation. At the same time the district attorney moved for dismissal of all of the remaining counts. On February 17th, Jackson was sentenced to state prison for the term prescribed by law (three years to life, under Pen. Code, §§ 264 and 671) with the minimum term modified to six months pursuant to the provisions of Penal Code section 1202b by virtue of that defendant's age. At the same time, all of the other counts were dismissed \"on motion of the District Attorney\" without the entry of any reasons in the minutes. No attack has been made on that conviction or sentence, or the order dismissing the other charges.\n\nIt would be fatuous to say that the subsequent dismissals of the charges against the defendants Beasley and Morris, respectively, were not made for the reason that each entered a plea of guilty to two of the five offenses charged. The People's true complaint is not that the reasons were not stated in the minutes, but that the dismissals were ordered without the approval of the district attorney, and, more realistically, that the ensuing punishment for the offenses of which those defendants stood convicted by their pleas was deemed inadequate.\n\nA series of cases in which the defendant has objected to the institution of new proceedings after the dismissal of other proceedings involving the same felony offense, have established that the failure to enter the reasons for the dismissal in the minutes is not a defect which can be taken advantage of by the defendant, and that the requirement of the entry is for the\n\npublic interest. In People v. Disperati, supra, 11 Cal. App. 469, the defendant contended that he had been once in jeopardy, not only because of irregularities in the procedure under which the court had discharged a jury which failed to agree on a verdict, but also because thereafter the original information had been dismissed, and he had ultimately been tried and convicted on a new information charging the same offense. The court after reviewing the reasons advanced for the dismissal and the refiling, stated, with respect to the provisions of section 1385, \"the statute provides that the order 'as provided in this chapter' is not a bar, and the mandate in reference to said order is that it must contain the 'reasons of the dismissal.'\n\n\"We have no authority to disregard this requirement or to hold that it is merely directory. The proceeding is somewhat harsh, and imposes an additional burden upon the defendant, and no substantial departure from the plain provision of the statute should be tolerated.\" (11 Cal. App. at p. 476. See also, People v. Curtiss, supra, 4 Cal. App. 3d 123, 125; People v. Winters, supra, 171 Cal. App. 2d Supp. 876, 881.) The court also observed, \"Here there is no pretense that the order of the court recites the reasons upon which it was based. It is true the record shows the grounds upon which the motion was made by the district attorney, but nothing in the order shows that these grounds were, or any of them was, the basis for the action of the court. . . . [ para. ] It is to be observed that this is no 'technical' objection to the proceedings as the term 'technical' is commonly understood, but it relates to an important rule of procedure which the legislature has provided for the guidance of the courts, and the omission to observe it cannot be held to be innocuous without an invasion of the authority of a co-ordinate branch of the government. If the practice of which complaint is made is to be continued, it is manifest that great abuse is likely to follow, more dangerous to society than even the acquittal of the guilty.\" (Id. at p. 477. See also, People v. Winters, supra, 171 Cal. App. 2d Supp. at p. 882.)\n\nThe Disperati case has been several times qualified and limited. In People v. Head, supra, 105 Cal. App. 331, the defendant was charged with the same homicide in two proceedings, one by information and the other by indictment. He was tried and convicted upon the indictment. He made the following point on appeal: \"While both the information proceeding and indictment proceeding were pending, the former was dismissed and the order of dismissal did not set forth the reasons for such dismissal. Under the provisions of section 1385 and 1387 of the Penal Code appellant contends that the failure to set forth the reasons for the order of dismissal of the information bars a further prosecution and makes the plea of once in jeopardy sustainable.\" (105 Cal. App. at p. 333.) The court ruled, \"The requirement of section 1385 is mandatory in its terms and the reasons for the dismissal should have been set forth in the\n\norder. However, we cannot agree that under those sections the mere failure to embody the reasons for the dismissal in the order will result in a bar to further prosecution where at the time such dismissal is made the records of the court show good reason for such dismissal and it clearly appears that the dismissal was made in 'furtherance of justice' as contemplated by section 1385.\" (105 Cal. App. at p. 335.) It further stated, \"It is apparent that the pendency of two proceedings constituted good reason for the dismissal of one, and the dismissal of the information under the circumstances was obviously in the interests of justice as contemplated by section 1385. The failure to state in the order of dismissal the fact that another proceeding was pending charging the identical offense constituted a mere omission to state a fact which the records of the court already disclosed and here constituted at most a mere irregularity in procedure without prejudice to appellant. It does not appear that the legislature intended by the sections above mentioned to create a bar to further prosecution under the circumstances in the present case.\" (Id., pp. 335-336.) With respect to People v. Disperati, on which the defendant relied, the court observed, \"In that case not only did the order of dismissal fail to show the reasons for dismissal, but in addition it did not appear that the dismissal was made in furtherance of justice. On the contrary, it appeared that the motion for dismissal was made by the district attorney for his own convenience in securing further delay. He sought to accomplish this delay by dismissing the pending information and subsequently filing another proceeding charging the defendant with the same offense. Such procedure entirely ignored the defendant's constitutional right to a speedy trial on the offense charged.\" (Id., pp 336-337.)\n\nIn People v. Romero, supra, 13 Cal. App. 2d 667, the court was likewise faced with the contention that a dismissal of an information which was not accompanied by a specification of reason in the record was a bar to a subsequent prosecution on a second information. The courts, after reviewing both Disperati and Head, concluded, \"Neither one of the foregoing cases construes section 1385 according to its apparent, if not its obvious, purpose.\" (13 Cal. App. 2d at p. 670.) The opinion reviews the legislative history of the power to enter a nolle prosequi, as quoted above from People v. More, and stated, \"The legislature, in imposing this duty and responsibility upon the court, has gone one step further, however, and has required the court to spread upon the minutes for public reference the reason for its action in dismissing a felony prosecution. From the standpoint of the public welfare, potent arguments suggest themselves as to the wisdom of such a requirement. Indeed, the legislature has gone so far as to guard against the likelihood of the court doing violence to the interest of justice by providing that such order can be made only 'in the furtherance of justice.'\n\nThe obvious function of section 1385 of the Penal Code is to impose a duty on the court, but with certain limitations and conditions: the 'limitation' that such dismissal must be in furtherance of justice, and the 'condition' that the reasons for the dismissal must be entered upon the minutes. The section has nothing whatsoever to do with the rights of the defendant. For the court to fail to perform its duty, therefore, is not a matter about which a defendant can be heard to complain. The order of the court, under section 1385 of the Penal Code, in dismissing a felony action may be a matter of public concern, but in no way, either by motion or by plea, can it be seized upon by a defendant as the technical means to a coveted end. Section 1387 of the Penal Code definitely and unequivocally provides that such a dismissal is not a bar if the offense is a felony. The plea of 'Once in Jeopardy', therefore, was without legal sanction, and the finding by the court against the defendant on the plea of 'Once in Jeopardy' was valid, assuming that such a finding was required.\" (Id., pp. 670-671. See also, People v. Fox (1954) 126 Cal. App. 2d 560, 566-567 [272 P.2d 832].)\n\nThe conclusion expressed in Romero was epitomized in People v. Silva, supra, 236 Cal. App. 2d 453, as follows: \"Defendant's first contention, invalidity of the earlier dismissals because the minutes did not set forth the reasons for the dismissals, is without merit. The statutory requirement for the entry of reasons for dismissals on the minutes is designed to protect the public interest against improper or corrupt dismissals and is not related to protection of the rights of defendants. [Citations.]\" (236 Cal. App. 2d at p. 455.) In People v. Winters, supra, the same thought was expressed as follows: \"A judge dismissing criminal charges without trial, upon his own motion, must record his reasons so that all may know why this great power was exercised, and such public declaration is indeed a purposeful restraint, lest magistral discretion sweep away the government of laws.\" (171 Cal. App. 2d Supp. at p. 882.)\n\nThe People contend that this principle makes it imperative that the reasons be stated in the minutes, and that the failure to do so renders any dismissal inoperative. This policy may well be controlling in the situation where a defendant is exonerated of all criminal responsibility for a course of conduct by a dismissal entered on a record which does not itself evince an explanation. In this case where the bargain openly consists of an admission of culpability of some offenses in return for an exoneration of prosecution for others, there is no need for a further record. The facts which have been alluded to above were all matters of public record revealed by the minutes of the court, and the public interest was not subverted by the failure of the minutes to recite \"in furtherance of justice because of the\n\ndefendant's plea of guilty to other counts.\" (Cf. People v. Head, supra, 105 Cal. App. 331, 336.)\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nI conclude that attention may therefore properly be directed to the question of whether the court abused its discretion in dismissing the other counts under the facts of this case.\n\nScope of Discretion to Dismiss\n\nIn People v. Superior Court (Howard), supra, the court, in considering the propriety of permitting review by proceedings for issuance of a writ of mandate, observed, \"Appellate review at the request of the People necessarily imposes substantial burdens on an accused, and the extent to which such burdens should be imposed to review claimed errors involves a delicate balancing of the competing considerations of preventing harassment of the accused as against correcting possible errors.\" (69 Cal. 2d at p. 501.) It concluded, \"Assuming that in some cases the matter may be of such importance that mandate may be available to the People to review determinations where appeal does not lie, we are satisfied that the proper balancing of these considerations prohibits review by mandate at the request of the People where, as here, there is a danger of further trial or retrial. Such a rule will give meaningful effect to the legislative policy limiting review and the burdens on the defendant.\" (Id.)\n\nThe court referred to the express language of section 1385 in overruling the assertion that the court could not exercise the power to dismiss an action over the objection of the prosecution. (Id.)\n\nThe court then addressed itself to the contention that it was an abuse of discretion to dismiss the action after a jury had returned a verdict of guilty. The court referred to cases upholding the power of the court to strike an established prior conviction for the proposition \". . . that the discretion of the judge is absolute except where the Legislature has specifically curtailed it.\" (Id., p. 502.) The court further observed, \"It would seem that, if anything, a court should have broader discretion to dismiss in furtherance of justice after the verdict than it should have during trial. After the verdict, the judge has heard the evidence of the prosecution; whereas prior to the conclusion of the trial there is always the possibility\n\nthat in the absence of dismissal more evidence may be received.\" (Id., p. 503.)\n\nThe court concluded, \"If a trial judge is convinced that the only purpose to be served by a trial or a retrial is harassment of the defendant, he should be permitted to dismiss notwithstanding the fact that there is sufficient evidence of guilt, however weak, to sustain a conviction on appeal. The trial judge who has heard the evidence as in the instant case is in an excellent position to determine whether a retrial would further the interest of justice. The Legislature has given the trial court the power to dismiss under the broad standard of justice, and in view of the high caliber of our trial judges and their responsibility to the electorate we believe that recognition of such power in cases of conflicting evidence will not result in abuse but to the contrary believe that the due exercise of the power to dismiss in proper cases of conflicting evidence will further justice.\" (69 Cal. 2d at p. 504.)\n\nIn People v. Superior Court [ King), supra, the opinion recites, \"In dismissing the action, the trial judge relied entirely upon the transcript of the evidence adduced at the preliminary hearing. There was nothing else before him.\" (249 Cal. App. 2d at p. 715). The court reviewed the transcript and held that where there was no evidence in the record before the trial judge which would support a finding of either justifiable or excusable homicide it was an abuse of discretion for the trial judge, on his own motion to order a dismissal under section 1385 of an information charging the defendant with felony manslaughter. (Id., p. 718.) The court stated, \"The 'furtherance of justice' objective sought by the statute includes justice to society (the 'People') as well as to the defendant. [Citation.]\" (Id., p. 718. See also, In re Pfeiffer (1968) 264 Cal. App. 2d 470, 474 [70 Cal. Rptr. 831]; People v. Gonzales, supra, 235 Cal. App. 2d Supp. 887, 889-890,\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e and People v. Winters, supra, 171 Cal. App. 2d Supp. 876, 887.)\n\nIn People v. Superior Court [ Kasparek ], supra, the trial court, after a hearing on the defendant's motion for probation, purported to dismiss the case and discharge the defendant, who had previously entered a plea of guilty to a felony petty theft. The court ruled, \"As stated in Stephens v. Toomey, 51 Cal. 2d 864 . . . the power of the court in dealing with an offender to be sentenced for judgment on a plea or verdict of guilty is limited to either sentencing the defendant, suspending execution of sentence and entertaining an application for probation, or withhold the imposition\n\nof judgment and place the defendant on probation. We have found no authorities to indicate that the court can arbitrarily dismiss the case. The situation is not like the one on a motion for a new trial, where the court has discretion to reweigh the evidence as on a duly entered plea of guilty, there is no evidence to be weighed. Thus, the court had no discretion except to sentence the defendant or grant probation in a lawful manner (Stephens v. Toomey, supra).\" (202 Cal. App. 2d at p. 855.)\n\nOn the other hand, in People v. Polk (1964) 61 Cal. 2d 217 [37 Cal. Rptr. 753, 390 P.2d 641], the court stated that although the proof of a defendant's innocence was not conclusive, it was proper for the district attorney to move for, and the court to grant a dismissal when the evidence was sufficient to raise a reasonable doubt as to the defendant's complicity in the crime charged. (61 Cal. 2d at p. 229.)\n\nIn People v. Silva, supra, the defendant contended that the dismissal of two prior separate informations and the substitution of new information charging both offenses was erroneous because the motive of the district attorney was to avoid improperly an order denying consolidation of the separate informations for trial. The court observed, \"An order of dismissal is the action of the court, not that of the district attorney. The sole limitation on the court's power to order dismissal is that the order be in furtherance of justice, a limitation not explicitly defined by the Legislature and one which has remained a subject of judicial discretion. Section 1385 provides a useful means to correct defects of form or substance in criminal pleadings, and is sufficiently comprehensive to sustain without more an order of the trial court entered under its authority. (People v. Valenti, 49 Cal. 2d 199 . . .; People v. Polk, 61 Cal. 2d 217 . . .)\" (236 Cal. App. 2d at pp. 455-456.) Similarly, in Arnold v. Williams, supra, 222 Cal. App. 2d 193, in response to the defendant's objection that he could not be recharged and rearrested for a felony offense after an original complaint for the same offense had been dismissed at the preliminary hearing because of the absence of a material witness, the court ruled that on the basis of the provisions of sections 1385 and 1387, \"the dismissal of the complaint against petitioner, with his subsequent rearrest, is expressly authorized, by statute. [Citations.]\" (222 Cal. App. 2d at p. 196.) However, in People v. Disperati, supra, the original information was dismissed on application of the district attorney because of difficulties in securing the attendance of witnesses, because of a pending investigation concerning alleged accomplices of the defendant and their complicity in other alleged offenses, and because of the costs of the trial to the county during the then current fiscal year. In response to defendant's objection to the filing of a second information charging the same offense, the court noted, \"The proceeding is quite unusual, and no doubt should be adopted\n\nonly when substantial and exigent reasons seem to demand it.\" (11 Cal. App. at p. 474.) The court indicated that the right to a speedy trial should not yield to the claims of others against the county treasury, but that the other grounds, if properly presented, would warrant the procedure which was followed. (Id., at p. 476.)\n\nIn Disperati the court further observed, \"The legislature has not attempted to define the expression 'in furtherance of justice,' and therefore it is left for judicial discretion exercised in view of the constitutional rights of the defendant and the interests of society to determine what particular grounds warrant the dismissal.\" (11 Cal. App. at p. 476. See also People v. Gonzales, supra, 235 Cal. App. 2d Supp. 887, 890; and People v. Winters, supra, 171 Cal. App. 2d Supp. 876, 881.)\n\nIn People v. Winters, supra, the court ruled, \"A dismissal 'in furtherance of justice,' upon review, must show that there has been the exercise of a valid legal discretion, amounting to more than the substitution of the predilections of a judge for the alleged predilections of the peace officers.\" (171 Cal. App. 2d Supp. at p. 882. See also, People v. Gonzales, supra, 235 Cal. App. 2d Supp. 887, 890-891.)\n\nThe prosecution claims that the trial judge abused his discretion because neither the transcript of the grand jury proceedings nor the probation reports contain facts to support the court's position.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e It may be assumed from a review of the foregoing cases that the judge could not have dismissed all of the counts as to either defendant and absolved him of all criminal responsibility in the absence of any evidence in extenuation or justification. (People v. Curtiss, supra, 4 Cal. App. 3d 123, 128; People v. Superior Court [ King ], supra, 249 Cal. App. 2d 714, 718; People v. Winters, supra, 171 Cal. App. 2d Supp. 876, 882; and see, People v. Superior Court [ Jonsson ], supra, 240 Cal. App. 2d 90, 93-94; and People v. Superior Court [ Kasparek ], supra, 202 Cal. App. 2d 850, 855.) The record shows that this was not done. The defendants' guilty pleas subjected them to criminal responsibility and punishment for their acts.\n\nJustification for the action of the court in dismissing the remaining counts is found in the principles enunciated by the Supreme Court in People v. Superior Court [ Howard ], supra. The policy against harassment which gives the judge power to dismiss and prevent a new trial (69 Cal. 2d at p. 504), should be matched by a policy against multiple prosecution for similar offenses arising out of the same course of conduct even though it be in the same action. Examination of the principles prohibiting multiple\n\nprosecution in separate actions, and the rules prohibiting multiple punishment for criminal offenses which are incident to one objective, reveals that if the defendants had been convicted of all five offenses it was not clear that they could be sentenced on all. Under these circumstances it was not unreasonable to dismiss the counts which were still contested. The desire to further prosecute those counts would appear to be predicated on the motive of securing harsher sentences than those which were imposed in connection with the original pleas. If those sentences were irregular they should be attacked directly. To reopen the dismissed counts practically, if not technically, violates the policy against multiple prosecutions.\n\nIn Kellett v. Superior Court (1966) 63 Cal. 2d 822 [48 Cal. Rptr. 366, 409 P.2d 206], the court expounded its views on multiple prosecution. After distinguishing between the policy precluding multiple prosecution and that precluding multiple punishment, the court observed, \"A defendant who blows up an airplane killing all on board or commits an act that injures many persons is properly subject to greater punishment than a defendant who kills or harms only a single person. It does not follow, however, that such a defendant should be liable to successive prosecutions. It would constitute wholly unreasonable harassment in such circumstances to permit trials seriatim until the prosecutor is satisfied with the punishment imposed.\" (63 Cal. 2d at pp. 825-826.) The court ruled that failure to unite all offenses arising out of the same act or course of conduct in a single proceeding would result in a bar to subsequent prosecution of any offense omitted if the initial proceedings culminate in either acquittal or conviction and sentence. (Id., at p. 827. See also discussion and cases reviewed in People v. Winchell (1967) 248 Cal. App. 2d 580, 586-590 [56 Cal. Rptr. 782].) In reaching this result the court made the following reference, \"[The] Illinois Supreme Court recently ruled that it is inconsistent with fundamental fairness to try defendants previously convicted of murder for the essentially simultaneous murder of another victim. The court emphasized that the state could have had no other motive for the second prosecution than to substitute the opinion of the prosecutor for that of the original jury as to the adequacy of the punishment. (People v. Golson, 32 Ill.2d 398 . . .)\" (Id.)\n\nThe rule applied in Kellett to prohibit the prosecution of petitioner for violation of Penal Code section 12021 (possession of a concealable weapon by a person who has been convicted of a felony) after he had pled guilty and been sentenced for violation of Penal Code section 417 (exhibiting a firearm in a threatening manner) would not, however, furnish a legal bar to the further prosecution of the counts which remained at issue after the defendants' pleas to the counts on which they were sentenced, if those counts had not been dismissed. \"In a single criminal action (pleading any\n\nnumber of counts), no plea of guilty to, or order of dismissal or acquittal of, any separately pleaded offenses, included or otherwise, will bar the progress of that prosecution as to the other counts. The prosecution on such other counts may continue until each, on its own merits, has been severally and finally disposed of by bringing the defendant to conviction and sentence or to acquittal.\" (People v. Tideman (1962) 57 Cal. 2d 574, 583 [21 Cal. Rptr. 207, 370 P.2d 1007]. See also, People v. Berutko (1969) 71 Cal. 2d 84, 95 [77 Cal. Rptr. 217, 453 P.2d 721]; and People v. Seiterle (1963) 59 Cal. 2d 703, 712 [31 Cal. Rptr. 67, 381 P.2d 947].) In Tideman the court observed, \"The trial judge wisely did not pronounce sentence on the plea of guilty to Count I. Until sentence was pronounced for the murder as charged in Count II there had been neither an acquittal of either charge nor a 'conviction and sentence' under either; and, manifestly, no punishment for either.\" (57 Cal. 2d at p. 585, fn. omitted.) The court therefore, following the conviction on the second count, was able to set aside the defendants' plea and dismiss the first count, which procedure was approved on appeal. (Id., at p. 577.) In Seiterle, however, the defendant had been sentenced to life imprisonment without possibility of parole for aggravated kidnaping under the provisions of section 209 of the Penal Code. He contended that his further prosecution for murder was thereby barred because both offenses were incident to one objective. The court stated, \"Where two sentences are erroneously imposed, the error can readily be cured on appeal, if important, by reversing the judgment as to the lesser sentence. [Citation.] However, if one of the sentences is death, such corrective procedure is unnecessary, and we have affirmed the death penalty, stating that no useful purpose would be served by a reversal as to the lesser offense. [Citations.] It is immaterial in this connection whether the penalties of death and of life imprisonment have been imposed simultaneously or separately in one criminal action, since the purpose of the protection against multiple punishment is to insure that the defendant's punishment will be commensurate with his criminal liability. [Citation.]\" (59 Cal. 2d at p. 712.) In the case of each of these defendants, however, a conviction of the aggravated kidnaping for the purpose of robbery, and the attendant reversal of the established sentence for robbery (see discussion below regarding multiple punishment), would involve complications with respect to the punishment already served or suffered in connection with the latter offense.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nThe principles governing multiple punishment indicate that the quest for multiple convictions might be illusory insofar as securing multiple sentences is concerned. The general rule is stated in Neal v. State of California (1960) 55 Cal. 2d 11 [9 Cal. Rptr. 607, 357 P.2d 839], as follows: \"Whether a course of criminal conduct is divisible and therefore gives rise to more than one act within the meaning of section 654 depends on the intent and objective of the actor. If all of the offenses were incident to one objective, the defendant may be punished for any one of such offenses but not for more than one.\" (55 Cal. 2d at p. 19. See also, In re Ward (1966) 64 Cal. 2d 672, 676 [51 Cal. Rptr. 272, 414 P.2d 400]; In re Cruz (1966) 64 Cal. 2d 178, 180 [49 Cal. Rptr. 289, 410 P.2d 825]; Kellett v. Superior Court, supra, 63 Cal. 2d 822, 824-825; People v. Jackson (1967) 255 Cal. App. 2d 584, 587 [63 Cal. Rptr. 359]; People v. Paxton (1967) 255 Cal. App. 2d 62, 72 [62 Cal. Rptr. 770]; People v. Nelson (1965) 233 Cal. App. 2d 440, 445 [43 Cal. Rptr. 626]; People v. Bynes (1963) 223 Cal. App. 2d 268, 272 [35 Cal. Rptr. 633]; People v. Mistretta (1963) 221 Cal. App. 2d 42, 43 [34 Cal. Rptr. 365]; and People v. Fields (1961) 190 Cal. App. 2d 515, 518 [12 Cal. Rptr. 249].)\n\nWhere sex offenses are separate and distinct acts the defendant can be punished separately for each offense. (People v. Hicks (1965) 63 Cal. 2d 764, 766 [48 Cal. Rptr. 139, 408 P.2d 747]. See also, People v. Armstrong (1968) 268 Cal. App. 2d 324, 326-327 [74 Cal. Rptr. 37]; People v. Paxton, supra, 255 Cal. App. 2d 62, 72-73; People v. Gomez (1967) 252 Cal. App. 2d 844, 860 [60 Cal. Rptr. 881]; and cases collected People v. Cline (1969) 2 Cal. App. 3d 989, 993-994 [83 Cal. Rptr. 246].) Moreover, it is established that, \"The offense of forcible rape and the offense of aiding another in the commission of forcible rape are not necessarily or even normally associated with each other. We are satisfied that the course of conduct pursued by each appellant was a divisible one, consisting of separate offenses which were not incident to one objective within the rule of the Neal case, supra. The mere fact that these offenses all took place within a relatively short space of time does not, as appellants contend, render the entire transaction an indivisible one.\" (People v. Bynes, supra, 223 Cal. App. 2d 268, 273-274. See also, People v. Paxton, supra, 255 Cal. App. 2d 62, 72-73.)\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Therefore, under the application of the foregoing principles\n\nit would appear that if any of the defendants were convicted of all five counts he could be separately punished for the act of rape he himself committed, and as well for the two acts which he aided and abetted. Numerous cases have reviewed the question of sentencing for multiple offenses arising out of a course of conduct such as was involved here, and the results appear to vary not only with the factual situation involved, but in the manner in which the facts have been viewed by the trial court or the appellate court.\n\nIn People v. Sheppard (1967) 250 Cal. App. 2d 736 [58 Cal. Rptr. 814], the defendant was convicted of kidnaping for the purpose of robbery (§ 209), robbery (§ 211), rape (§ 261, subd. 3), grand theft (§ 487, subd. 3) and assault with a deadly weapon ( § 245). The court observed, \"since all five crimes were part of a single episode, only one sentence could lawfully be imposed (Pen. Code, § 654), . . . that sentence must be the life sentence provided for by section 209.\" (250 Cal. App. 2d at p. 740.)\n\nIf it appears that a defendant convicted of rape, robbery, and kidnaping for the purpose of robbery did not formulate the intent to rape his victim until after the robbery he may be separately punished for the rape and the aggravated kidnaping, but not the robbery. (In re Ward, supra, 64 Cal. 2d 672, 678.)\n\nIf the trier of fact found any one of the defendants guilty of simple kidnaping (Pen. Code, § 207), rather than kidnaping for the purpose of robbery (§ 209), because he returned the girl's money (see People v. Nelson (1965) 233 Cal. App. 2d 440, 446 [43 Cal. Rptr. 626]), or because the robbery was an afterthought to the kidnaping (see People v. Bynes, supra, 223 Cal. App. 2d 268, 272), multiple punishment would be precluded in a different manner. In People v. Jaquette (1967) 253 Cal. App. 2d 38 [61 Cal. Rptr. 209], the court struck down a sentence for simple kidnaping under the following circumstances: \"The record here discloses that the kidnaping, was part of a continuous act motivated by one objective, rape. The kidnaping, although complete before the rapes were committed, were incidental to and a means of committing the rapes. [Citation.] Double punishment therefore is prohibited. [Citation.]\" (253 Cal. App. 2d at p. 49. See also, People v. Livingston (1967) 252 Cal. App. 2d 630, 636-637 [60 Cal. Rptr. 728]; People v. Curtis (1965) 237 Cal. App. 2d 599, 600 and 602 [47 Cal. Rptr. 123]; People v. Nelson, supra, 233 Cal. App. 2d 440, 445-446;\n\nPeople v. Bynes, supra, 223 Cal. App. 2d 268, 272-273; but cf. People v. Paxton, supra, 255 Cal. App. 2d 62, 72-74.)\n\nSimilar problems would arise in sentencing for robbery and kidnaping for the purpose of robbery. Where a kidnaping is part of an indivisible course of conduct directed to the objective of robbing the victim, the offender cannot be punished for both the robbery and the kidnaping. If a defendant is convicted of and sentenced for kidnaping for the purpose of robbery (Pen.Code, § 209) he cannot also be punished by the lesser sentence for robbery (Pen. Code, §§ 211, 213 and 671). (In re Malloy, 66 Cal. 2d 252, 254 [57 Cal. Rptr. 345, 424 P.2d 929]; In re Pratt (1967) 66 Cal. 2d 154, 156-157 [56 Cal. Rptr. 895, 424 P.2d 335]; In re Wright (1967) 65 Cal. 2d 650, 656 [56 Cal. Rptr. 110, 422 P.2d 998]; In re Ward, supra, 64 Cal. 2d 672, 675-676 and 677-678; People v. Spaniel (1968) 262 Cal. App. 2d 878, 892-895 [69 Cal. Rptr. 202]; People v. Paxton, supra, 255 Cal. App. 2d 62, 73; People v. Gomez, supra, 252 Cal. App. 2d 844, 860; and People v. Morrison (1964) 228 Cal. App. 2d 707, 715 [39 Cal. Rptr. 874].) On the other hand, if the defendant is found guilty of simple kidnaping (Pen. Code, § 207), the five to life term for first degree robbery ( §§ 213 and 671) is greater than the one to 25-year term for simple kidnaping ( § 208), and the latter sentence must be stricken. (People v. Houston (1963) 219 Cal. App. 2d 187, 195 [33 Cal. Rptr. 26].)\n\nIt therefore appears that it is only when the circumstances show a succession of acts without a common objective that the offender may be separately punished for rape (Pen. Code, § 261, subd. 3), first degree robbery (§ 211), and simple kidnaping (§ 207) as a lesser and included offense of a charged kidnaping for the purpose of robbery ( § 209). (People v. Jackson, supra, 255 Cal. App. 2d 584, 587-589. See also, People v. Roth (1964) 228 Cal. App. 2d 522, 534-535 [39 Cal. Rptr. 582]; People v. Mistretta, supra, 221 Cal. App. 2d 42, 44-46; and People v. Fields, supra, 190 Cal. App. 2d 515, 518-519; and see People v. Paxton, supra, 255 Cal. App. 2d 62, 72-74.)\n\nFrom the foregoing it is apparent that the prosecution's objections to the dismissal of the remaining counts and its insistence that they be set for trial called for a judicial determination of whether the ends of justice would be served by further prosecution of those counts. Since the facts before the court in the grand jury transcript and probation report would permit a finding that the kidnaping was for rape and not for robbery, the question resolved itself into whether further prosecution for aiding and abetting two other acts of rape was warranted. Since the part each played in the joint and several assaults was established by the statements of the victim and the admissions of the defendants, no good purpose -- other than extended punishment -- will be served by further prosecution. That it is the prosecution's dissatisfaction with the punishment and not with the dismissals, is evidenced\n\nby the prosecution's recommendation and acquiescence in the dismissal of four counts as against the defendant Jackson.\n\nUnder these circumstances I find no abuse of discretion in dismissing the three counts which were respectively dismissed as to each of the defendants Beasley and Morris.\n\nII\n\nThe order suspending the imposition of the sentence imposed on Morris and granting him probation is appealable under the provisions of subdivision 5 of section 1238 of the Penal Code. (People v. Superior Court (1953) 118 Cal. App. 2d 700, 703 [258 P.2d 1087]; and see, In re Sargen (1933) 135 Cal. App. 402, 405-406 [27 P.2d 407]. Cf., where imposition of sentence suspended, § 1238, subd. 6; People v. Thatcher (1967) 255 Cal. App. 2d 830, 831-832 [63 Cal. Rptr. 492]; and People v. Orrante (1962) 201 Cal. App. 2d 533, 556-558 [20 Cal. Rptr. 480]; but note, People v. Superior Court [ Guerrero ] (1962) 199 Cal. App. 2d 303 [18 Cal. Rptr. 557] (mandate).)\n\nEligibility for Probation\n\nIn each of the cases last cited (other than In re Sargen) it was determined that the defendant was ineligible for probation and the order granting him probation was reversed or annulled. The People contend that Morris was ineligible for probation under the provisions of the former\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e fourth and fifth paragraphs of section 1203 of the Penal Code, which provide in pertinent part as follows: \"Except as hereafter provided in this section, probation shall not be granted to any person who shall have been convicted of . . . rape with force or violence . . . and who at the time of the perpetration of said crime . . . was himself armed with a deadly weapon . . . nor to one who in the perpetration of the crime of which he was convicted, willfully inflicted great bodily injury or torture . . . nor to any defendant convicted of the crime of . . . rape with force or violence . . . unless the court shall be satisfied that he has never been previously convicted of a felony . . . .\n\n\"In unusual cases, otherwise subject to the preceding paragraph, in which the interests of justice would best be served thereby, the judge may, with the concurrence of the district attorney, grant probation.\"\n\nThe prosecutor's repeated objection to the grant of probation precludes\n\napplication of the last paragraph, if the offense in fact falls within the provisions of the preceding paragraph.\n\nThe People acknowledge that the defendant was charged with, and by his plea was convicted of, a rape in which the victim was prevented from resisting by threats of great and immediate bodily harm, accompanied by apparent power of execution (§ 261, subd. 4), and that a rape when the victim resists, but her resistance is overcome by force or violence, is designated as a separate offense (id. subd. 3). It would appear, therefore, that the provisions rendering a defendant ineligible for probation are intended to refer to the latter offense.\n\nThe People point out that the forcible abduction in this case in fact evidences the use of force and violence. Nevertheless, even if the language of section 1203 is construed as applying to a conviction under subdivision 4 as well as under subdivision 3 of section 261, the defendant is not ineligible for probation unless he additionally was armed with a deadly weapon (cf. People v. Harshaw (1945) 71 Cal. App. 2d 146, 149 [161 P.2d 978]), or had suffered a prior felony conviction.\n\nThe phrase \"willfully inflicted great bodily injury or torture\" must, by comparison with the provisions just discussed, mean more than the force or violence used to overcome the victim's resistance. (See, People v. Merrill (1951) 104 Cal. App. 2d 257, 266-267 [231 P.2d 573]; and note second paragraph of § 264 as added by Stats. 1967, ch. 151, § 1, p. 1217 to increase minimum term to 15 years when rape is accompanied by intentional great bodily injury to the victim.)\n\n\"Authority is vested in the court to grant probation except in those cases in which authority is specifically withheld.\" (People v. Superior Court [ Guerrero ], supra, 199 Cal. App. 2d 303, 305. Accord: People v. Alotis (1964) 60 Cal. 2d 698, 708 [36 Cal. Rptr. 443, 388 P.2d 675].) So here, despite the gravity of the offense, the defendant, as conceded by the majority, was eligible for probation. He, therefore, was entitled to have the court consider such a disposition of the case.\n\nAbuse of Discretion\n\nThe following passage from People v. Lippner (1933) 219 Cal. 395 [26 P.2d 457] still governs in cases in which the defendant is eligible for probation: \"The defendant has directed our attention to no case decided by the courts of this state, or elsewhere for that matter, in which an appellate court has reversed an order of the trial court in the matter of either granting, denying or revoking probation on the ground that the action of the trial court was arbitrary. We have not discovered any such authority. It does not follow, however, that such a case may not arise or possibly has\n\nnot arisen, but the dearth of such cases demonstrates the assertion above that only in a very extreme case should an appellate court interfere with the discretion of the trial court in the matter of denying or revoking probation.\" (219 Cal. at p. 400.)\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nIn People v. Russel (1968) 69 Cal. 2d 187 [70 Cal. Rptr. 210, 443 P.2d 794], the court made the following observation concerning the exercise of judicial discretion: \"The courts have never ascribed to judicial discretion a potential without restraint. In the early case of Bailey v. Taaffe (1866) 29 Cal. 422, at page 424, this court took pains to delineate limits of judicial discretion in the following terms: 'The discretion intended, however, is not a capricious or arbitrary discretion, but an impartial discretion, guided and controlled in its exercise by fixed legal principles. It is not a mental discretion, to be exercised ex gratia, but a legal discretion, to be exercised in conformity with the spirit of the law, and in a manner to subserve and not to impede or defeat the ends of substantial justice.' Similar standards were expressed in Gossman v. Gossman (1942) 52 Cal. App. 2d 184, 195 . . ., where the court quoted from Davis v. Boston Elevated Ry. Co. (1920) 235 Mass. 482, 496-497 . . . as follows: '\"The word imports the exercise of discriminating judgment within the bounds of reason. Discretion in this connection means a sound judicial discretion, enlightened by intelligence and hearing, controlled by sound principles of law, of firm courage combined with the calmness of a cool mind, free from partiality, not swayed by sympathy nor warped by prejudice nor moved by any kind of influence save alone the overwhelming passion to do that which is just.\"'\n\n\"The foregoing authorities, and particularly the passages quoted from Bailey and Gossman, make it quite clear, we think, that all exercises of legal discretion must be grounded in reasoned judgment and guided by legal principles and policies appropriate to the particular matter at issue.\"\n\n(69 Cal. 2d at pp. 194-195. See also, People v. Wade (1959) 53 Cal. 2d 322, 338 [1 Cal. Rptr. 683, 348 P.2d 116]; Brown v. Gordon (1966) 240 Cal. App. 2d 659, 666-667 [49 Cal. Rptr. 901]; and People v. Surplice (1962) 203 Cal. App. 2d 784, 791 [21 Cal. Rptr. 826].)\n\nIn order to determine whether there has been an abuse of these principles, resort must be had not only to \"the circumstances surrounding the crime,\" but also to the \"prior record and history of the defendant\" as found in the probation report, or any evidence adduced at the hearing on the application for probation. (See, §§ 1203 and 1204.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e) The circumstances surrounding the crime have been set forth above. The record and history of the defendant Morris is as follows:\n\nThe face sheet of the probation report under \"Prior Criminal Record\" reflects one prior arrest for a misdemeanor and no convictions. No attempt is made to explain the nature of the offense, or the circumstances under which the defendant was arrested in the body of the report, although the same data is reiterated. The report indicates that marijuana was found in Morris' car, and that he denied smoking it. There is no elaboration as to the amount or any other circumstances concerning its discovery or use.\n\nThe report embodies the district attorney's recommendation of a prison sentence, and the following from the police department: \"The Police Inspector, in his reply, briefly outlined the offense indicating the victim told him William Morris is the one who threatened to kill her, threatened to kill her family, and bomb her home. Victim told the inspector William Morris was the most aggressive and vile of the three defendants and he does not recommend probation for this defendant.\" The probation officer commented, \"Concerning the present offense he expressed no true remorse indicating he plead guilty to rape, because his attorney advised him to do so. He also denied that he had Kenneth Beasley went to the Jack Tar Hotel to get the money from the victim, but one of the inspectors on duty that night heard the two of them say 'We'll hit in ten minutes'. Another inspector heard defendants Morris and Beasley ask where the restaurant was located.\"\n\nAn attached copy of a letter from the victim relates in part: \"William\n\nMorris said at one point that they were going to have to kill me because he had seen my mother run out to the street as I was being kidnaped. . . . Since this all has happened I have not been able to work. I have never been out of my house alone to this date. I cannot get over the fear of someone suddenly choking me and dragging me off.\n\n\"I wish I could tell you what this has done to my parents. Being a witness to the kidnap was more than my mother could take. My Father has sold our home where we've lived for the past 21 years because my Mother no longer feels safe. We've bought a home out of San Francisco.\n\n\"These boys have ruined my life and what's left of my parents' life -- all for a two-hour joyride. Please, Mr. Cavanaugh, don't be lenient with them. Don't let them do to another girl what they've done to me.\"\n\nOn the other hand it appears that the defendant was born September 4, 1946, in San Francisco and has lived all of his life in that community. He is the only child of parents who were both continually employed and provided him a good home. His parents stated that he had a normal development; that he was given a good education and was taught right from wrong; and that all of his friends were decent church type people. He graduated from high school in January 1964 and commenced college in the fall, but dropped out in his second semester as a result of an injury.\n\nHe worked for a clothier for six or seven months in 1966. He took an examination for some 250 prospective apprentices in the electrical field and represented that he was the first Negro to be accepted in the Electricians Union. He had worked steadily since December 28, 1966, when he took employment at Hunter's Point Naval Shipyard as an apprentice electrician, and since July 15, 1968, he had been employed in the same capacity with a private electric company. His employer wrote that it was pleased to cooperate with defendant's continued employment as proposed under a work furlough plan, and that his work was satisfactory. The author of the letter observes, \"We have had him work with a number of different foremen and his work has been satisfactory. It does seem possible this sad experience may assist him in maturing and growing into a responsible citizen.\"\n\nThe report also indicates, \"Five letters of reference were submitted by individuals who have known the defendant and his family for a great many years. They all indicate his parents are outstanding citizens who are deeply concerned over the defendant's welfare and wish for his development and growth into a worthy citizen. Three of them indicate they have always found the defendant to be trustworthy and of good moral character.\" (Letters from seven individuals, in addition to the employer, are attached to the report.)\n\nThe shocking nature of this crime immediately gives rise to a feeling that the lenient punishment which was imposed is in no sense adequate for, to quote the probation officer, \"The physical and mental torture inflicted on this victim and the mental torture inflicted on her parents. . . .\"\n\nThe place of retribution in the scheme of punishment was recently considered in People v. Floyd (1970) 1 Cal. 3d 694 [83 Cal. Rptr. 608, 464 P.2d 64], as follows: \"Although this court has never held that it is improper for a prosecutor in closing argument in a penalty trial to ask the jury to impose the death penalty for reasons of retribution or vengeance, we have stated in other contexts that 'There is no place in the scheme for punishment for its own sake, the product simply of vengeance or retribution.' (In re Estrada, 63 Cal. 2d 740, 745 . . .)\" (1 Cal. 3d at pp. 721-722.) The court ruled that there was no misconduct in asking the jury to consider retribution when such a request was included with a discussion of other pertinent factors, and that the defendant was barred from assigning the remarks as error because of a failure to object and secure a timely admonition. The majority thus leaves it uncertain whether retribution is a proper end of punishment, or just a proper end of punishment when it is adverted to without objection. The dissenting opinion of Justice Peters (concurred in by the Chief Justice Traynor and Justice Tobriner) reviews the subject (1 Cal. 3d at pp. 748-754), and reiterates with approval the following principle which was quoted in In re Estrada, supra, 63 Cal. 2d at page 745 [48 Cal. Rptr. 172, 408 P.2d 948]: \"This application of statutes reducing punishment accords with the best modern theories concerning the functions of punishment in criminal law. According to these theories, the punishment or treatment of criminal offenders is directed toward one or more of three ends: (1) to discourage and act as a deterrent upon future criminal activity, (2) to confine the offender so that he may not harm society and (3) to correct and rehabilitate the offender. There is no place in the scheme for punishment for its own sake, the product simply of vengeance or retribution.\" (People v. Oliver (1956) 1 N.Y.2d 152, 160 [134 N.E.2d 197, 201-202] as quoted 1 Cal. 3d at pp. 749-750. See also, \"Deterrent Effects of Criminal Sanctions,\" Progress Report of the Assembly Committee on Criminal Procedure, May 1968, Supp. to the Appendix to the Journal of the Assembly, Vol. 19, No. 14, at p. 10.)\n\nIt is unnecessary to determine whether the judge may properly consider retribution in fixing the punishment for an offense. It is obvious that the incarceration of the defendant cannot restore the victim and her family to the state of mental tranquility they enjoyed before the offense was committed; and it is equally obvious that many reasonable persons consider that retribution or vengeance should have no place in the sentencing process. The judge, therefore, was entitled to disregard the appeals to his emotions\n\nwhich might be otherwise engendered from the relation of the collateral effects of the crime.\n\nAttention is directed to the other criteria referred to in the last quotation. This court, regardless of the individual predilections of its members, cannot say as a matter of law that the punishment imposed by the trial judge will not correct or rehabilitate the particular offender. In fact there is some evidence that the work furlough program, which was originally suggested by the judge, as discussed below, is a successful method of achieving rehabilitation. (See, Proceedings of the 1967 Sentencing Institute for Superior Court Judges, Appendix, 62 Cal. Rptr. p. 47.) It is certainly reasonable to entertain the belief that the correction and rehabilitation of the defendant may be better effected by capitalizing on those environmental factors -- family, Church, and employment -- in which he has demonstrated stability, than to uproot him and hope that at some future date he will, as an exconvict, pick up where he left off, with a completely penitent and virtuous outlook toward his responsibilities to society.\n\nThe punishment imposed, as distinguished from the work furlough program recommended by the judge, does not confine the defendant, and between weekends he is free, if so minded, to repeat his criminal conduct. This must be a calculated risk with any probationer or parolee. The record of defendant's family upbringing, education and employment, and the absence of a prior criminal record, support a conclusion that such risk is minimal.\n\nUndoubtedly many, if not most judges, would take the position that the punishment imposed would fail to discourage and act as a deterrent to future criminal activity of others. (See, Proceedings of the 1968 Sentencing Institute for Superior Court Judges, Case #1, Appendix, 77 Cal. Rptr. at pp. 16-21.) The question of the extent to which potential offenders are aware of criminal penalties, and the related question of whether fear of apprehension, or fear of lengthy incarceration, is a more potent force in the prevention of criminal activity is not free from doubt. (See, Deterrent Effects of Criminal Sanctions, supra, passim.) In the hypothetical case of robbery and rape referred to at the 1968 Sentencing Institute, the offense was more aggravated than that involved here, and the defendant had a far less stable background than defendant Morris. Nevertheless, 12 percent of the judges voting proposed jail for various lengths of time, with probation. To substitute the judgment of this court for that of the trial judge, involves the sentencing process in endless appeals.\n\nIt cannot be demonstrated empirically that the leniency shown to Morris because of his race and achievements may act as a counter-deterrent or encouragement for similar acts on the part of others (who would theoretically\n\nrestrain themselves if they knew he went to prison). It is equally possible that the recognition given to his achievements in his chosen field of employment may encourage others to emulate that facet of his character and forego his weaknesses.\n\nI find no abuse of discretion as a matter of law in determining from the record before the court that there were circumstances in mitigation of the punishment prescribed by law and that the ends of justice would be served by granting probation to the defendant (§ 1203).\n\nIII\n\nManner of Exercise of Discretion\n\nIn People v. Wade, supra, 53 Cal. 2d 322, the court after receiving the defendant's plea of guilty and granting her counsel's request for a postponement of sentencing so that a probation report could be prepared and studied announced that it considered the defendant ineligible for probation. This conclusion was reiterated at the subsequent hearing when the defendant's motion for probation was denied. (53 Cal. 2d at p. 337. Cf. People v. Hogan (1969) 71 Cal. 2d 888, 891-892 [80 Cal. Rptr. 28, 457 P.2d 868]; People v. Lichens (1963) 59 Cal. 2d 587, 589-590 [30 Cal. Rptr. 468, 381 P.2d 204]; People v. Cartier (1960) 54 Cal. 2d 300, 311-313 [5 Cal. Rptr. 573, 353 P.2d 53]; and People v. Hutson (1963) 221 Cal. App. 2d 751, 753-755 [34 Cal. Rptr. 790].) The court ruled, \"Probation is, therefore, a power that may be exercised in the discretion of the court. . . . But that discretion may not be exercised in an arbitrary or capricious manner. It must be impartial, guided by 'fixed legal principles, to be exercised in conformity with the spirit of the law.' (People v. Jones, 87 Cal. App. 482, 493-499 . . .)\" (53 Cal. 2d at p. 338.) The opinion additionally recites, \"The purport of the statute and the cases is that the trial court must not decide the question of probation until it is in possession of all of the relevant facts, especially those contained in the probation report. There is little question from the record in the case at bar that the trial judge had decided the question of probation against the defendant at the time of granting her request to file an application therefor.\" (Id. See also People v. Causey (1964) 230 Cal. App. 2d 576, 579-580 [41 Cal. Rptr. 116]; People v. Williams (1963) 223 Cal. App. 2d 676, 680 [35 Cal. Rptr. 805]; and People v. Surplice, supra, 203 Cal. App. 2d 784, 791-792.)\n\nIt is contended that the record in this case reflects that the judge decided the question of probation, and as well the question of the dismissal of the\n\nunresolved counts, in favor of the defendants and adversely to the position of the People before he was in possession of all the relevant facts. It has also been intimated that he may have received and considered information aside from that contained in the probation report or properly introduced at a hearing as required by section 1204 (see fn. 14 above). (See Times-Mirror Co. v. Superior Court (1940) 15 Cal. 2d 99, 113-114 [98 P.2d 1029] [reversed (1941) 314 U.S. 252 (86 ,L.Ed. 192, 62 S.Ct. 190)]; and People v. Surplice, supra, 203 Cal. App. 2d 784, 792. Cf. People v. Lichens, supra, 59 Cal. 2d 587, 588-589.)\n\nThe record discloses that the judge invaded a field of questionable propriety in negotiating pleas on behalf of the defendants Beasley and Morris. (See, Proceedings of the 1966 Sentencing Institute for Superior Court Judges, Appendix, 52 Cal. Rptr. at pp. 37-39; and cf. People v. Delles (1968) 69 Cal. 2d 906, 910 [73 Cal. Rptr. 389, 447 P.2d 629]; and People v. Santana (1962) 206 Cal. App. 2d 318, 319-321 [23 Cal. Rptr. 602].) The record, however, does not support the inference that he considered matters which were not properly before him in the grand jury transcript and matters which were ultimately incorporated in the probation report. His remarks throughout the proceedings, although at times intemperate and unwarranted, do not compel the conclusion that he failed to exercise his judicial discretion upon the circumstances surrounding the crime and the prior record and history of the defendant as revealed in the record before him.\n\nAfter arraignment and several continuances, each of the defendants interposed a motion to dismiss pursuant to the provisions of section 995 of the Penal Code. These motions were continued from time to time for decision. On February 21st the judge stated, \"I have read the transcript. I have had to in connection with various motions and it is a pretty rugged and rough bit of conduct. There is no question about that. I am not condoning it and I know the District Attorney is taking a severe look.\" On February 4, 1969, the defendant Jackson withdrew his motion to dismiss, entered his plea of guilty to one count, and made a motion for probation. This motion was denied when that defendant was sentenced on February 17th. It must be assumed that a probation report (not a part of this record) was prepared at that time, which set forth the circumstances surrounding the crime as they were known to the probation officer.\n\nThe transcript in this record commences with proceedings in open court on February 21st when the defendants Beasley and Morris changed their pleas. It is obvious from the record that the matter had been previously discussed at unreported proceedings in chambers. It is not contended that the People were not represented at such conference or conferences. Apparently\n\nthe judge had been advised that Morris was working as an electrical apprentice, and was aware of some letters. Whether these letters related to Morris' employment or to Beasley is not clear, but in any event all letters mentioned were properly referred to the probation department.\n\nIn open court counsel for Beasley and Morris announced the intention of their clients to change their pleas. The judge then interposed, \"It is my understanding, just so we get this straight, that both of you men are going to enter guilty pleas to a 211, Second Degree, and to a 261.4, which is the rape charge?\"; counsel for Morris replied, \"That is correct, your Honor\"; and the judge continued, \"And I will tell you what this means and what I intend to do. And there is a third charge which is kidnapping with intent to commit robbery. And it is my intention at the proper time when the probation reports come in to dismiss that charge pursuant to Section 1385 of the Penal Code.\" The judge then advised the defendants of the effect of a guilty plea on the right to trial, on the right to confront the witnesses against them, and on the right to produce witnesses on their own behalf.\n\nThe court then disclosed his understanding with regard to Beasley\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e and Morris.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e It is obvious from the content that the execution of this understanding was dependent on approval of the Youth Authority in the case of Beasley, and upon a probation report in the case of Morris.\n\nThe judge explained to Morris the consequences of a violation of probation in the event of a suspended sentence. When the assistant district attorney interjected a desire to be heard, the court again referred to his intentions, and the reasons for them.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nThereafter, in arraigning Morris for plea on the two counts to which he was to plead guilty, the judge indicated his intention to dismiss the remaining counts. Thereupon, Morris entered his plea of guilty to two counts and moved for probation. The judge advised the clerk as follows, with respect to the remaining three counts, \"I am going to take those under submission for the date of sentencing, and it is my intention on March 21st to dismiss them pursuant to Section 1385.\"\n\nBeasley similarly was arraigned, pled guilty to two counts, and moved for referral to the probation department with a recommendation for a Youth Authority commitment. With respect to the remaining counts, the court stated, \"And as to Counts 2, 3 and 4, I will take them under submission, and it is my intention to dismiss those matters pursuant to Section 1385 of the Penal Code on that date.\"\n\nIn the foregoing I find no expression of intention to disregard the recommendation of the Youth Authority or the facts or conclusions that might be expressed in a probation report, but a proper deference to the procedures provided by law.\n\nOn March 13th, Beasley's sentencing was continued to March 21st. On that morning before the defendant's case was called, the judge engaged in what appears to be an unwarranted tirade against a police inspector and the assistant district attorney.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Although the Attorney General has not referred\n\nto this part of the record, and the record does not reveal it, it has been suggested that the inspector was accompanying the victim of the offenses which gave rise to these proceedings, and that the judge's remarks were calculated to discourage her testifying to the details of the offense as permitted by section 1204 (see fn. 14 above). Since the court had already been furnished with a copy of her testimony before the grand jury, and the probation report encompassed her statements and one of her two letters to the probation officer, it would have been superfluous, and an unnecessarily distressful experience to request her to repeat her story, and subject herself to cross-examination. It is equally probable that her presence, if it were she, was occasioned by a desire to incite sympathy in her favor and prejudice against the defendants.\n\nThereafter the court took up the case of Beasley and the judge stated, \"It is my intention and understanding to deny probation at the proper time and refer the matter to the Youth Authority.\" In discussing a continuance the court observed, \"I will wait until we get the probation report back to be sure whether he is going to be accepted.\"\n\nWith respect to Morris, the court apparently had the probation report, which is dated March 21, 1969, and the letters attached to it, including a recommendation dated March 20, 1969, from the work furlough officer (see Pen. Code, § 1208), who in this case was the probation officer himself, that the defendant was ineligible for the work furlough program because, \"In view of the circumstances surrounding this case, our office is of the firm opinion that this subject is not a proper candidate for the work furlough program.\"\n\nThe judge stated that he was going to continue the Morris matter so that he could speak to the probation officer. The judge alluded to the letters attached to the probation report as follows: \"And in connection with the work furlough program, I have a letter from the Decker Electric Company. He was Number 1, and that is a pretty good recommendation. And I have all these letters here which I didn't have at the time of the original report. I had to ask for them. There was a reference, but I had a letter from the other party attached to the report. There are about eight letters here?\" He then indicated that there were pressures on the various officials concerned with the case.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e The fact that the district attorney's office was insisting on\n\nmore convictions for Beasley and Morris than were imposed on Jackson, who, from the record, was of equal if not greater culpability, may furnish some warrant for the judge's remarks. It is unnecessary, as suggested by the defendants, to take judicial notice of any formal or informal editorializing that may have occurred in the public press. (Cf. Times-Mirror Co. v. Superior Court, supra, 15 Cal. 2d 99, 107-113.)\n\nOn April 8th, having received an acceptance from the Youth Authority, the court committed Beasley to that institution without further comment by court or prosecutor; and, over the objection of the prosecutor dismissed the three unresolved counts.\n\nOn April 11th, Morris was arraigned for judgment. The judge indicated that he had read and considered the probation report. These remarks are set forth in the margin.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e The judge's remarks, unbracketed, show that he\n\nconsidered matters in the record and in the probation report in exercising his discretion to grant Morris' probation, and, as has been set forth above, there was no abuse of discretion in so doing.\n\nIt is suggested that the bracketed remarks, and those which followed sentencing\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e combined with the judge's earlier statements of his intention, his tirade about the inspector, and his views on pressures, demonstrate, and compel a finding of a preconceived purpose to grant probation which amounts to an arbitrary determination, a capricious disposition, and whimsical thinking such as to preclude the exercise of discriminatory judgment within the bounds of reason. (See, People v. Surplice, supra, 203 Cal. App. 2d at p. 791.)\n\nWhatever may be said for or against the extraneous remarks of the judge, the fact remains that he did, as required by law, consider the circumstances surrounding the crime and the prior record and history of the defendant. Since the record in that regard shows no abuse of discretion, the case is governed by the following rule: \"[Where] a judge's statements as a whole disclose a correct concept of the law and its application, no secondary remarks should be deemed to have impeached his determination.\" (People v. Cartier (1960) 54 Cal. 2d 300, 313 [5 Cal. Rptr. 573, 353 P.2d 53], as quoted in People v. Lichens, supra, 59 Cal. 2d 587, 590. See also, People v. Hogan, supra, 71 Cal. 2d 888, 892; and People v. Hutson, supra, 221 Cal. App. 2d 751, 753-755.)\n\nIt should be further noted in support of the orders of the court, that it is presumed that official duty has been regularly performed. (Evid. Code, § 664; People v. Moran (1970) 1 Cal. 3d 755, 762 [83 Cal. Rptr. 411, 463 P.2d 763]; People v. Sparks (1968) 262 Cal. App. 2d 597, 601 [68 Cal. Rptr. 909]; and People v. Connolly (1951) 103 Cal. App. 2d 245, 248 [229 P.2d 112].)\n\nThe issue is not whether this court or any of its members agree or disagree with the punishment imposed by the trial court. (See People v. Keller (1966) 245 Cal. App. 2d 711, 715 [54 Cal. Rptr. 154].) In the absence of an abuse of discretion, which has not been demonstrated on the record, I believe the orders should be affirmed.\n\n\u003cspan class=\"fn\"\u003e1. Persons are committed to the California Youth Authority for an indeterminate period (Welf. \u0026 Inst. Code, § 1766). Ordinarily they are discharged on or before age 21, but may not in any event remain there beyond their 25th birthday (id., § 1771).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Under the \"Cobey Work Furlough Law\" (Pen. Code, § 1208) a county jail prisoner is permitted to work at his regular employment, spending all other time in jail. County boards of supervisors may name one of certain designated officials as \"work furlough administrator.\" In San Francisco the chief adult probation officer is designated as such administrator; his decision determines whether a prisoner will be admitted to the program.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. This was not the common, and sometimes criticized, \"negotiated plea.\" Such a plea is \"negotiated\" between defense counsel and the district attorney. It is subject to the tentative approval of the judge who later, upon reading the probation report and obtaining a fuller understanding of the case, may, and frequently does, repudiate the arrangement of counsel and allow the defendant to withdraw his guilty plea (see People v. Delles, 69 Cal. 2d 906, 910 [73 Cal. Rptr. 389, 447 P.2d 629]).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. OR means Own Recognizance, a procedure under which a defendant is released pending trial or sentence without giving bail. (See Pen. Code, § 1308 et seq.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. As to Morris this report contained, among other things, a statement by defendant Morris of the circumstances surrounding the events leading up to the charges in this case; a narrative of the social factors pertaining to Morris' background, education, employment, financial condition and marital status; letters from interested parties recommending for and against probation; the probation officer's evaluation of the case; and a letter from Lois requesting that probation be denied. In her letter Lois stated that she had not been able to resume her work; that she had not been out of the house alone since the assaults; that she could not get over the fear of someone choking and dragging her off; that her parents had sold the home in which they had lived for 22 years and moved away from San Francisco because they no longer felt safe in the city.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The record shows the following to have occurred: \"[Judge Glickfeld]: I think it's a lousy deal when an inspector has to sit with a client. The district attorney ought to advise the inspector. I think it is ridiculous. Inspector Christensen, can I see you a moment. Is there some reason you have to sit here, or don't you have enough work to do? \"Inspector Christensen: I was instructed to go down with this young lady by the lieutenant of my detail. \"[Judge Glickfeld]: Who? \"Inspector Christensen: Lieutenant Flahaven. \"[Judge Glickfeld]: Who gave him the instructions? Bring Lt. Flahaven down here. I never heard of a sentencing procedure where people have to be in court with a policeman holding their hand. [There was no holding of hands; as later indicated by the judge the term was used figuratively.] Tell the lieutenant I want to talk to him. \"Mr. Norman [the district attorney]: Well, your Honor, I don't think that this is a fair remark. \"[Judge Glickfeld]: Mr. Norman, I am not going to listen to what is a fair remark in view of what you did to the court a few weeks ago. I don't want to hear that. I want Lt. Flahaven down here. That is the way it is going to be. And I don't want to hear about what a fair remark is. There are lots of things that are not fair. \"Mr. Norman: For the record I don't think it was. \"[Judge Glickfeld]: I don't want police inspectors sitting here in court holding some alleged victim's hands, and I am using the term figuratively. And I want Lt. Flahaven down here. I want to know where these instructions came from. There is lots more work for the police to do in the county than sit here in this court. I want to know who gave the instructions, so bring him down here.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The full text of Penal Code section 1204 follows: \"The circumstances must be presented by the testimony of witnesses examined in open court, except that when a witness is so sick or infirm as to be unable to attend, his deposition may be taken by a magistrate of the county, out of court, upon such notice to the adverse party as the court may direct. No affidavit or testimony, or representation of any kind, verbal or written, can be offered to or received by the court, or a judge thereof, in aggravation or mitigation of the punishment, except as provided in this and the preceding section.\" Reference to the \"preceding section\" is to section 1203. When section 1204 was enacted in 1872 the preceding section was 1203. Since then the Legislature has inserted several additional sections 1203.01-1203c) between sections 1203 and 1204.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Penal Code section 487 defines grand theft.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Under the Work Furlough program Morris would spend weekends and nights in jail. Under the probation order as made he would spend only weekends in jail.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. She did not testify at the probation hearing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. We, of course, make no determination or suggestion as to penalty upon future proceedings in the superior court. Such a decision is in the exclusive province of that court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The exact language of the pertinent portion of Penal Code section 654 is: \"An act or omission which is made punishable in different ways by different provisions of this code may be punished under either of such provisions, but in no case can it be punished under more than one; an acquittal or conviction and sentence under either one bars a prosecution for the same act or omission under any other.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Penal Code section 31 as pertinent here provides: \"All persons concerned in the commission of a crime, whether it be felony or misdemeanor, and whether they directly commit the act constituting the offense, or aid and abet in its commission, or, not being present, have advised and encouraged its commission, . . . are principals in any crime so committed.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Section 1385 of the Penal Code provides: \"The court may, either of its own motion or upon the application of the prosecuting attorney, and in furtherance of justice, order an action to be dismissed. The reasons of the dismissal must be set forth in an order entered upon the minutes. No dismissal shall be made for any cause which would be ground of demurrer to the accusatory pleading.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. An inspector testified regarding the content of oral confessions secured from Beasley and Morris following their arrest. These statements, perhaps suspect as self-serving, tend to indicate that Jackson was the instigator of events, and was the most depraved and violent of the three; and that Beasley and Morris restrained him from other threatened acts against the girl, and were the parties who returned a part of the victim's money. Morris' statement to the probation officer has similar overtones.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. So in this case the People could apparently have proceeded to test the scope of the court's order dismissing the three counts as to each defendant by attempting to secure a new indictment or information for those charges. Research has revealed no particular explanation for the adoption of subdivision 8 of section 1238, but it is noted that the last sentence (see fn. 3, above) was added during its passage through the Legislature. (See, Assembly and Senate Journals, Reg. Sess. 1968 re Assem. Bill 436.) The People having appealed, have waived the right to proceed anew in the event of an adverse decision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The pronouncement in the last sentence of this quotation, and a similar statement in People v. Superior Court [ Prudencio ] (1927) 202 Cal. 165, 173 [259 P. 943], were disapproved in and were impliedly overruled by People v. Superior Court [ Howard ] (1968) 69 Cal. 2d 491, particularly at page 501 [72 Cal. Rptr. 330, 446 P.2d 138].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. This is not to say that the People cannot complain of \"improper or corrupt dismissals.\" (See People v. Silva (1965) 236 Cal. App. 2d 453, 455 [46 Cal. Rptr. 87].) It is obvious that a court is not going to put an improper or corrupt reason in the minutes. The question generally will have to be presented by reference to matters dehors the minutes either in the event a reason is expressed as required by the statute, or in the event an obvious reason appears from the record as in this case. The People's analysis of the reported proceedings in this case as they bear on the impropriety of or corruption in the court's action is discussed below.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. A further implication in \"[ King ]\" that the trial judge's discretion to dismiss on his own motion is not as great as his discretion to dismiss on motion of the prosecutor was criticized in People v. Superior Court [ Howard) (1968) 69 Cal. 2d 491 at page 504 [72 Cal. Rptr. 330, 446 P.2d 138].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The further contention that the judge failed to exercise his discretion, but acted on a preconceived intent formed from facts dehors the records is examined below.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In People v. Breland (1966) 243 Cal. App. 2d 644 [52 Cal. Rptr. 696], a comparable situation arose with successive prosecutions for battery (to which the defendant had pled guilty and for which he had been sentenced to, and had started to serve, 30 days in the county jail), and murder (which resulted in a conviction of murder in the second degree). The court held that the successive prosecutions were maintainable because no homicide could have been charged until the victim's subsequent death. It resolved the question of double punishment by giving credit in the second judgment for the time served under the first. (243 Cal. App. 2d at p. 652. See also, People v. Thatcher (1967) 255 Cal. App. 2d 830, 832-833 [63 Cal. Rptr. 492).)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Insofar as the prosecutions for the several acts of rape depend upon a theory of a conspiracy to commit those acts (see People v. Bynes (1963) 223 Cal. App. 2d 268, 273 [35 Cal. Rptr. 633].), the question of multiple punishment approaches, if it does not trespass on the principle that it is a violation of the rule against multiple punishment \"to sentence a defendant for conspiracy to commit several crimes and for each of those crimes where the conspiracy had no objective apart from those crimes. If, however, a conspiracy had an objective apart from an offense for which the defendant is punished, he may properly be sentenced for the conspiracy as well as for that offense. [Citation.]\" (In re Cruz (1966) 64 Cal. 2d 178, 180-181 [49 Cal. Rptr. 289, 410 P.2d 825]. See also, In re Romano (1966) 64 Cal. 2d 826, 828-829 [51 Cal. Rptr. 910, 415 P.2d 798]; People v. Blackwell (1967) 257 Cal. App. 2d 313, 323 [64 Cal. Rptr. 642]; People v. Thomsen (1965) 239 Cal. App. 2d 84, 97 [48 Cal. Rptr. 455]; and People v. Finch (1963) 216 Cal. App. 2d 444, 456-457 [30 Cal. Rptr. 901].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. A new second paragraph inserted in section 1203, effective November 10, 1969 (Stats. 1969, ch. 522, § 2, p. 1134), renders the provisions referred to the fifth and sixth paragraphs, respectively.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. In People v. Wiley (1939) 33 Cal. App. 2d 424 [91 P.2d 907], the court also recognized that there might be review if it were shown \"that there was an abuse of that discretion.\" (33 Cal. App. 2d at p. 429.) This principle is expressed in many cases. (See, e.g., People v. Ingram (1969) 272 Cal. App. 2d 435, 439 [77 Cal. Rptr. 423]; People v. Mancha (1963) 213 Cal. App. 2d 590, 592 [29 Cal. Rptr. 72]; People v. Privitier (1962) 200 Cal. App. 2d 725, 730 [19 Cal. Rptr. 640]; People v. Hollis (1959) 176 Cal. App. 2d 92, 96 [1 Cal. Rptr. 293]; People v. Bartges (1954) 126 Cal. App. 2d 763, 776 [293 P.2d 49]; People v. Connolly (1951) 103 Cal. App. 2d 245, 247-248 [229 P.2d 112]; People v. Adams (1950) 100 Cal. App. 2d 841, 844 [224 P.2d 873]; and People v. Jackson (1948) 89 Cal. App. 2d 181, 182 [200 P.2d 204].) No case has been found where an order granting probation to an eligible defendant has been overturned. On the other hand, \"Where a court erroneously concludes that a defendant is not eligible for probation and pronounces judgment without considering the merits of his application, the judgment must be reversed, not for a new trial, but with directions to consider the application on its merits.\" (People v. Hollis (1959) 176 Cal. App. 2d 92, 99 [1 Cal. Rptr. 293].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Penal Code section 1204 provides: \"The circumstances must be presented by the testimony of witnesses examined in open Court, except that when a witness is so sick or infirm as to be unable to attend, his deposition may be taken by a magistrate of the county, out of court, upon such notice to the adverse party as the court may direct. No affidavit or testimony, or representation of any kind, verbal or written, can be offered to or received by the court, or a judge thereof, in aggravation or mitigation of the punishment, except as provided in this and the preceding section.\" (Reference to the \"preceding section\" is to section 1203. When section 1204 was enacted in 1872 the preceding section was 1203. Since then the Legislature has inserted several additional sections (1203.01-1203c) between sections 1203 and 1204.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Addressing Beasley the judge said, \"Now, I said upon a plea what I would do is refer your matter to the California Youth Authority. And after you plead your attorney would make a motion for probation, and it takes about 3 weeks. And you would remain on bail or OR and after we get the report it is mailed down to Sacramento for approval by the Youth Authority and it takes about 10 days. So that takes about 4 or 5 weeks. And after we get the acceptance we will set a date and you will come in. And if you are accepted, then you will be sent to the Youth Authority for whatever rehabilitation program they have down there. Do you understand that? Defendant Beasley: Yes. The Court: That is what I intend to do, and I put it on the record so there is no question.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Addressing Morris the judge stated, \". . . it is my intent to treat your case as follows: State Prison, suspended, and put you on probation for three years, and one year in the County Jail as a condition on a work furlough. In other words, you are in an apprentice program and whatever that is we will work out. You will have to go in every night or whatever it is. And I understand you have a couple of nights where you work or go to school? . . . So that is what I am going to do. And, sir, you have got two counts and I would make them concurrent. And again, there would be a probation report before this, which would take the same length of time.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The judge stated, \"Yes, but I am just telling him what I am going to do. I do this because this is what I feel I must do. I don't condone what you did and the circumstances are such that if my daughter or wife were involved, maybe I would have picked up a gun and gone out and done something horrible in an emotional state. And I realize that, but by the same token, I sit here as a judge, and the reason I make this decision, I have to take all factors into consideration. And that is the reason I am doing it. But I realize that your co-defendant is in San Quentin. He was sent up on a 1202(b) because we feel he was more culpable.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. \"The Clerk: Line 7, James W. Holt, Junior. Mr. Duchow: For the defendant. The Court: I think it's a lousy deal when an inspector has to sit with a client. The District Attorney ought to advise the inspector. I think it is ridiculous. Inspector . . ., can I see you a moment? Is there some reason you have to sit here, or don't you have enough work to do? Inspector . . .: I was instructed to go down with this young lady by the Lieutenant of my Detail. The Court: Who? Inspector . . .: Lieutenant . . . . The Court: Who gave him the instructions? Bring Lt. . . . down here. I never heard of a sentencing procedure where people have to be in court with a policeman holding their hand. Tell the Lieutenant I want to talk to him. [Ass't. Dist. Atty.]: Well, your Honor, I don't think that this is a fair remark. The Court: . . . I am not going to listen to what is a fair remark in view of what you did to the Court a few weeks ago. I don't want to hear that. I want Lt. . . . down here. That is the way it is going to be. And I don't want to hear about what a fair remark is. There are lots of things that are not fair. [Ass't. Dist. Atty.]: For the record I don't think it was. The Court: I don't want Police Inspectors sitting here in court holding some alleged victim's hands, and I am using the term figuratively. And I want Lt. . . . down here. I want to know where these instructions came from. There is lots more work for the police to do in the County than sit here in this court. I want to know who gave the instructions, so bring him down here.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. These remarks are as follows: \". . . the only thing that disturbs me, and I will say this here on the record, is that I just don't like the undercurrent of pressures that are being put on from the outside on the District Attorney's office. And I don't like the pressures that are being put on from the outside, I believe, on the Probation Department and the Work Furlough Program, in view of my experience with them and what they have been doing in the past and how they have been operating. And I will not tolerate any pressures on this Court. The Court is going to act in an independent manner and in its best judgment, and hopefully in good judgment. And I will answer to the right person, to my conscience and to my God, and that is who I will answer to, and that is all I can say. I will not tolerate any pressure on the Court and District Attorney or on any arm of the Court; and the Probation Department is an arm of the Court. [Morris' Atty.]: Or the Police Department. The Court: And I won't tolerate any pressures on the Police either, and having somebody telling me he is here to protect somebody. I have got some pretty good protection here . . . I will tell you one thing, if you find out any direct pressures have been exerted on any arm of the Court, the Probation Department, Police Department, or anything else, I will bring the person before the Court, and there will be a hearing on a question of contempt of Court. And I will tell you this right now, and with all the consequences that follow from it, if it comes to my attention, and that means everybody.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. For ease of reference those remarks of the court not bearing on the circumstances surrounding the crime, or the prior record and history of the defendant have been placed in brackets. \"The Court: Let me make a few remarks. This is the last of the three boys. We had the first boy who went to the Penitentiary under 1202(b) of the Penal Code because of his past record, and Mr. Beasley was sent to the Youth Authority because he was 18 or 19, as I recall, and the Court thought it was a just disposition and there was no previous record to speak of. \"And Mr. Morris is 22 and so he is not eligible for that and I had recommended Work Furlough Program. [And the Chief Probation Officer was under a misinformation as to the powers of the Court and apparently he thinks he is a judge, and I am not going to let him preempt my position or that of Judge Karesh or Judge Neubarth. I am not going to get into any discussion with him at this time, but the future will take care of itself.] But the report indicates that probation should be denied and they say the man is ineligible for Work Furlough. [And I just want to point but for the record that another man was put on Work Furlough who had two previous felonies without permission of the Court and who was charged with robbery, second degree, 487, and who was not a local resident, and who was on Work Furlough one day and then escaped and there was a bench warrant out for him.] \"In this man's case, he is 22 and finished Number 2, I believe, on the Electrical Workers' Apprentice Program. And he has been in San Francisco all his life and he would be an appropriate person for this program. [And I point it out for the reason that there has been a lot of hocus-pocus in this case.] And I accepted two pleas, and the acceptance would be concurrent to a forcible rape and robbery. \"I don't deny the conduct. I think it was vicious and I think it was disgraceful and shameful. I don't know what other word I can use. And I know you parents feel the same way, and to have to stand in court next to you and to have to share the shame with you is a tragedy. And this should be enough to make you realize what is going on. But by the same token, I don't think the purpose of sentencing is retribution; it never has been. To some extent, punishment is a means of rehabilitation, and you will be punished, but our primary consideration is rehabilitation. I say this for many reasons. The probation report finally included the letters which were not included which were first received and which I requested. And going back, there were letters from Yori Wada, who is an executive director with the YMCA, and who also happens to be on the Civil Service Commission. \"[Morris' Att'y]: And formerly on the Youth Authority. \"The Court: And there are letters of recommendation on this young man. There is a letter from the Uptown Clothiers. And there is a letter from Mr. Shifs, who was a former Grand Jury member. \"[Morris' Att'y]: I checked that again and I believe he was on the panel. \"The Court: And a letter from the Housing Authority and Mr. and Mrs. Wilson. And a letter from the Reverend Edwin Smith. And also, most important, a letter from Decker Electric Company, to indicate they thought you were going to be on work furlough, and they were pleased that you had a good work record and they knew you in connection with the Minority Work Program and that you were Number 1 in the examination taken by some 250 prospective apprentices, and that everybody has been satisfied with your work and that you are very acceptable. And there is a notation that there is a recommendation for advancement in this connection which I have, and which was made. \"So, in view of all this, and I know that the District Attorney's Office is strongly opposed to this, [and I say this sincerely, but there is a lot of hocus-pocus in the background here,] and I am going to persist in my judgment. And I sit here and I am responsible for this judgment, and it is my conscience, and I am going to answer to my God for my judgment. And I feel this is the best way to handle this. And I am going to sentence you to State Prison, suspended, and that is to both counts, to run concurrently. \"At this time I don't want to make a fuss about the work furlough, but I will put you on probation for a period of three years, and as a condition of probation you are to spend the next 52 weekends in the County Jail commencing Friday night at 7 o'clock, and you will be released at 6 o'clock Monday morning. And that will give you an opportunity to complete your program. And if you get in trouble again, you will go to the State Penitentiary. It is that simple. \"Now, it is up to you, Mr. Morris. \"So, again, I am not condoning what you are doing, but we have to live in this world and I think that knowing that you have done something wrong, you can't undo time and you can't undo what has been done. You can't unring the bells, so to speak. I always like to put myself in the position if this were my son, and I think I must, as a judge, and what I would do. You haven't exhibited, in my opinion, a pattern of criminality, but by the same token, and I say it again, it was a vicious, shameful act. And again, your parents stand here and I know how they feel. I know if this had happened to your daughter, if you have one, how you would feel. And I know how I might initially react.\" The court thereupon, over the objection of the prosecutor, dismissed the three unresolved counts and denied his motion to set them for trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The prosecutor observed, \". . . for the record, your Honor, and on behalf of the District Attorney, it is felt that this is one of the most vicious and most aggravated offenses that has come in this County in the last several years, and we are objecting to the sentence in this case and feel that probation is not in order at all. The Court: All right. I have already made my decision and I have already indicated my attitude and that I don't condone it. It is a question of my judgment of what is best for Society and what is best for this boy. And if my judgment isn't justified, and if he makes an error, he ends up in the State Penitentiary. [Morris' Atty.]: He understands that, and he intends to do right.\" In response to the prosecutor's inquiry, \"Might I inquire of the Court just what hocus-pocus the Court has said or alluded to?,\" the judge responded. \"There has been a lot of pressure here. I have talked to Mr. Kavanaugh and I indicated the hocus-pocus . . . by reason of the type of person that was put on the Work Furlough, and I have indicated it because Mr. Kavanaugh was trying to preempt the function of the judge. Now, I have had a lot of information and I am not going to talk about it at this time, and which has come to my attention and which shows a lot of finagling in the background and effort to get to Mr. Kavanaugh with pressure. I am not going to go into this, but I am aware of them; and if you are not, you are being pretty naive. This Court will not be threatened by threats of what the newspapers are going to do and by other threats of what Mr. Kavanaugh intends to do. And the next time this happens Mr. Kavanaugh will be in here on a contempt charge. It is that simple. Now you know my position. . . . And, for example, I will tell you one hocus-pocus which I got from the probation report. They referred to some letters sent in, and I had to request the letters and find out who sent them in and what they said. That is one piece of hocus-pocus, and I think the Court is entitled to a full revelation of what the file contains. That is one, and I could tell you many more. It will never happen again as long as I sit here, believe me. I don't permit anybody to preempt the function of the Court. As a matter of fact, the Probation Department is an arm of the Court and for the Court's benefit.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. In 1967 the following language was added to section 1238: \"7. From an order dismissing a case prior to trial made upon motion of the court pursuant to Section 1385 whenever such order is based upon an order granting defendant's motion to return or suppress property or evidence made at a special hearing as provided in this code.\" (Stats. 1967, ch. 1537, § 3, p. 3657.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. In 1968 a further subdivision was added to section 1238 reading, \"8. From an order or judgment dismissing or otherwise terminating the action before the defendant has been placed in jeopardy or where the defendant has waived jeopardy. If, pursuant to this subdivision, the people prosecute an appeal to decision, or any review of such decision, it shall be binding upon them and they shall be prohibited from refiling the case which was appealed.\" (Stats. 1968, ch. 532, § 1, p. 1185.)\u003c/span\u003e\n\n",
    "body_length": 166844,
    "citedas": [
      "5 Cal. App. 3d 617",
      "85 Cal. Rptr. 501"
    ],
    "attorneys": "Thomas C. Lynch, Attorney General, Albert W. Harris, Jr., Assistant Attorney General, and Derald E. Granberg, Deputy Attorney General, for Plaintiff and Appellant. Garry, Dreyfus, McTernan \u0026 Brotsky, Robert S. Marder and Ephraim Margolin for Defendants and Respondents.",
    "category": [
      "36",
      "75"
    ],
    "judges": "Opinion by Elkington, J., with Molinari, P. J., concurring. Separate dissenting opinion by Sims, J.",
    "citation_count": 0
  }
}
