{
  "id": "6IHiPWYBTlTomsSBtDf6",
  "document": {
    "title": "United States v. Jannotti",
    "full_title": "UNITED STATES OF AMERICA IN NO. 81-1020 v. JANNOTTI, HARRY P. (D.C. CRIM. NO. 80-00166-02); UNITED STATES OF AMERICA IN NO. 81-1021 V. SCHWARTZ, GEORGE X. (D.C. CRIM. NO. 80-00166-04)",
    "jurisdiction": "Third Circuit",
    "date": "1982-02-11T00:00:00.000Z",
    "docket": "Nos. 81-1020, 81-1021",
    "body": "Opinion OF THE COURT\n\nOn September 16, 1980, after a six-day trial, a jury found defendants Harry P. Jannotti and George X. Schwartz guilty of conspiring to obstruct interstate commerce, in violation of the Hobbs Act, 18 U.S.C. § 1951(a), and found Schwartz guilty of conspiracy in violation of the Racketeer Influenced and Corrupt Organizations Act, 18 U.S.C. § 1962(d). At the time of the events charged in the indictment, Schwartz was president of the Philadelphia City Council and Jannotti was the Council's majority leader. Following the entry of the guilty verdicts, defendants renewed their requests for judgments of acquittal and dismissal of the indictment, on which the trial court had previously reserved decision. On November 26, 1980, the district court entered an order setting aside the verdict of the jury in its entirety, dismissing Count III of the indictment (the Hobbs Act count) for lack of jurisdiction, and granting the motions of defendants for judgment of acquittal. The Government appeals.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nIn his opinion accompanying the order, the trial judge gave four reasons for entry of the judgment of acquittal and dismissal of Count III of the indictment. United States v. Jannotti, 501 F. Supp. 1182 (E.D.Pa.1980). He concluded:\n\n1. The evidence at trial did not establish the actual or potential impact upon interstate commerce necessary to sustain federal jurisdiction under the Hobbs Act;\n\n2. The evidence at trial established entrapment as a matter of law;\n\n3. Governmental overreaching amounted to a violation of due process of law;\n\n4. The circumstances relied upon to establish federal jurisdiction were artificially created. Id. at 1205.\n\nOur review of the record and applicable law convinces us that in reaching these conclusions the district court erred in its legal analysis and usurped the function of the jury to decide contested issues of fact. We reverse the district court's order and direct reinstatement of the jury's verdict.\n\nI.\n\nSUMMARY OF EVIDENCE\n\nAn understanding and appreciation of the evidence presented to the jury is essential to consideration of the issues facing us on this appeal. We have therefore undertaken an exposition of some of the highlights of that evidence. The government operation, which has come to be known as ABSCAM, began some time in 1978. The basic nature of the plan was that F.B.I. agents posed as employees of Abdul Enterprises, a fictional multinational corporation whose principal, a fictional Arab Sheik, Yassir Habib of the Arab nation of Abu Dhabi, was represented as interested in investing large amounts of money in this country and in emigrating here. According to the government, the plan was \"conceived to create opportunities for illicit conduct by public officials predisposed to political corruption.\" Brief for Appellant at 6. From the very beginning the government utilized the services of Melvin Weinberg, accurately characterized by the district court as a \"career swindler,\" 501 F. Supp. at 1193,\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e who, with F.B.I. agents, \"spread the word\" that the Sheik was interested in meeting public officials who could facilitate his planned investments.\n\nThis basic plan evolved into various subparts, each with its own cast of participants, which were ultimately the subject of a series of indictments returned by grand juries sitting in various federal districts of the country. Thereafter, a number of local and federal public officials were tried on offenses arising out of their participation. We focus on the facts material to the prosecution of Jannotti and Schwartz in the Eastern District of Pennsylvania.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe Philadelphia phase began on January 11, 1980 when Weinberg called Howard Criden, a Philadelphia attorney, and told him that the Sheik was \"looking to build a hotel\" in Philadelphia. Criden, who had previously received money from the F.B.I. agents for arranging introductions to congressmen in connection with another phase of the ABSCAM operation,\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e was told that two representatives of the Sheik would be coming to Philadelphia to begin discussions. Weinberg suggested that they be introduced to Congressman Myers or Lederer, and asked Criden which one would be better.\n\nCRIDEN: Well, I got to hear what you want to do first, and ... you know.\n\nWEINBERG: I think they're looking to build a hotel there. I'm not sure. That's only what I heard.\n\nCRIDEN: Okay. Why don't you tell him to find out more particulars because I don't know that either one would help you in that department. We may be able to give you more help to them.\n\nWEINBERG: Who do you know there?\n\nCRIDEN: Everybody!\n\nWEINBERG: Everybody?\n\nCRIDEN: Everybody!\n\nWEINBERG: All right. I'll ... I'll.\n\nCRIDEN: Remember. I got a partner who's a city councilman.\n\nA211-12.\n\nA week later, on January 18, 1980, Criden met with F.B.I. agents Michael Wald and Ernest Haridopolos at the Barclay Hotel in Philadelphia. Wald and Haridopolos used the names Michael Cohen and Ernie Polos in their dealings with defendants throughout these events. That meeting was among the group of meetings at the Barclay recorded on videotape by the F.B.I. Wald told Criden that the Sheik was interested in building a hotel in South Philadelphia, that Wald's role was to address himself to possible problems such as zoning, condemnations, and variances. A351. Criden stated, \"You don't have any problem. You got you two of the strongest guys\" (referring to Myers and Lederer). Wald responded, \"He (Sheik) wants to be assured that municipal government and he can coexist.\" Criden asked, \"How do you want me to satisfy you,\" to which Wald responded, \"I'm sure the easiest way for me to deal with someone in municipal government and I can go back ... Titles impress the man, as you know, from past experience .... If he receives those assurances from someone with a title sounds appropriate, eh, I buy it, he buys it.\" A351-53.\n\nWald asked Criden about the municipal setup, including city council. Criden explained that Philadelphia City Council is composed of 12 district councilmen and five at-large councilmen, that his \"partner (Johanson is) a district councilman\", and that the president of city council, Schwartz, \"is a powerful guy\" who had been \"president of city council for maybe now ten, twelve years, already now. Has got power.\" Wald responded, \"He's the man.\" A354-55. Wald later asked:\n\nWALD: Can we deal with Mr. Schwartz.\n\nCRIDEN: Oh, sure.\n\nWALD: He seems like the type of person we ...\n\nCRIDEN: Oh, sure.\n\nWALD: Can I deal with him while I'm here in town?\n\nCRIDEN: I don't know. I gotta get hold of my partner.\n\nWALD: Can I deal with your partner?\n\nCRIDEN: Oh, sure.\n\nA357. After some discussion of timing and the proper \"tariff,\" Wald asked if he could talk candidly with Johanson. Criden responded that \"As far as Johanson is concerned, you can talk as candidly as you want.\" With regard to Schwartz, he stated, \"He may want to handle it indirectly.\" A367. Wald expressed some concern, stating that under no circumstances would he want to disappoint his employer.\n\nCRIDEN: Listen, Mike, I, I read you loud and clear and if I was sitting in that chair, I would feel exactly the same way ok. You have no problems with me.\n\nWALD: Ok. How do you want to work this? Eh, do you wantta call me back here concerning ...\n\nCRIDEN: Oh sure.\n\nWALD: Mr. Johanson.\n\nCRIDEN: I'll get back to you in the next couple hours.\n\nWALD: Alright.\n\nCRIDEN: If I can serve him up.\n\nA368-69. Wald then asked what the \"tariff\" would be for Johanson and Schwartz, and Criden replied \"twenty-five\" for Johanson, A375, and \"(a) nother fifty\" for Schwartz. A376. Wald demurred at the latter figure, and Criden asked, \"You wanta go thirty on this guy?\" Wald asked, \"will he bite at thirty? ... I mean does that take care of him?\" and Criden replied, \"Let me try it .... I'll run it up the flagpole.\" A376-77. Finally Criden raised the subject of his fee and asked for and was promised \"ten for both of them.\" A377.\n\nSeveral hours later, Criden returned with Johanson to the Barclay suite where Wald and Haridopolos waited. Wald again discussed the proposed hotel construction, explained that he wanted to avoid delays due to the need for a variance or a building permit, and received Johanson's assurances that the inspectors from Licenses and Inspections, the building inspectors, the plumbing inspectors, and the electrical inspectors are \"not gonna monkey with you, for a minute because they're gonna be told not to ... because the words gonna come down, that this is a vital project.\" A421. In discussing the political situation in Philadelphia, and City Council in particular, Johanson boasted that of the 17 councilmen, he and Schwartz was each a \"very bright fella\", and \"after that there ain't a brain in the closet.\" A415. He spoke of his and Schwartz' importance, and stated that Schwartz, Jannotti and he \"run the City Council.\" A450. Wald then asked about Jannotti:\n\nWALD: Would he be interested in doing business with us.\n\nJOHANSON: I don't know that it's necessary but if you want to we can.\n\nWALD: I don't know-if it is-you're the best judge of that.\n\nJOHANSON: I think George is ah-\n\nCRIDEN: Well, it might not be a bad idea to bring Harry up.\n\nJOHANSON: We can bring Harry up. Harry's the Majority Leader. He's the-ya know, second in command.\n\nWALD: Yea.\n\nJOHANSON: He's got seniority.\n\nA453-54. After some additional discussion, the following exchange took place:\n\nHARIDOPOLOS: Are you acquainted with how much ah, ya know, ah for the favor and for all these assur-assurances, right.\n\nCRIDEN: Right.\n\nHARIDOPOLOS: You know how much it is?\n\nJOHANSON: Sure.\n\nHARIDOPOLOS: How much is it?\n\nJOHANSON: Twenty-five.\n\nHARIDOPOLOS: Okay, ah but, of course, ah, we have to have these proper assurances. You do us a favor, we're doin you a favor.\n\nCRIDEN: Obviously.\n\nJOHANSON: Sure.\n\nA471. Johanson gave his assurances and received $25,000. A480. The following exchange took place:\n\nWALD: And for 25 we've got a friend.\n\nJOHANSON: Right.\n\nA477. The conversation turned to Schwartz:\n\nWALD: Can I talk to Mr. Schwartz as I have spoken-\n\nJOHANSON: Next week-\n\nWALD: -to you gentlemen-\n\nWALD: (F)rankly ...\n\nCRIDEN: If you can't have the same discussion with George, ... you won't have the meeting.\n\nA485. Wald asked the same question about Jannotti. Criden promised to let him know whether he could have the same kind of conversation with Jannotti. A490. After Johanson left, Haridopolos gave Criden $5,000 and promised another \"five for the next delivery.\" A501.\n\nCriden, who did not know Schwartz personally, arranged for Schwartz to meet the F.B.I. agents through an intermediary, Judge Thomas Shiomos of the Court of Common Pleas of Philadelphia County, who lived in the same apartment hotel as Schwartz. Shiomos testified at trial that at a meeting on January 21, 1980 between him, Criden and their mutual friend, Mr. Kattleman, Criden told him of the proposed hotel construction, asked him if Schwartz would be interested in talking to \"these people ... for the purpose of giving them his advice with regard to building this complex in Philadelphia,\" and indicated that the investors were willing to \"pay for (Schwartz') advice.\" A639-40. Shiomos thereafter met with Schwartz, advised him that Criden had wealthy Arab clients who wanted to invest $150 million to build a hotel in Philadelphia, and indicated to Schwartz that Criden had said there \"would be a fee for Mr. Schwartz for his advice\" and \"that Mr. Criden expected part of that fee.\" A643. Schwartz stated that he \"would be interested in anyone who is willing to invest $150 million.\" Shiomos stated when he left that he didn't think there was anything \"improper\" but that if Schwartz \"thought there was anything improper or fishy (Shiomos was) sure if (Schwartz) met with Mr. Criden that (Schwartz) could determine that.\" A644.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Thereafter Criden spoke with Schwartz. That discussion was not taped or recorded, and there was no trial evidence as to the contents of the conversation.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nOn January 23, 1980, Criden and Schwartz visited Wald at the Barclay suite. This conversation was videotaped. Criden stated that he and Schwartz had \"spoken at length\" and that Schwartz knew that those persons whom Wald represented were \"interested in building a hotel facility in Philadelphia that may amount to some 30 or 40 million dollars.\" A689. Wald explained his purpose:\n\nWALD: Well, what I have been instructed to do and the purpose for ah my visits to to Philadelphia is to firm up uh, what we consider to be a major investment here and uh the gentleman cares to make a major investment here because he seems to like Philadelphia, and he has been told that it would uh be in his best interest to have an investment, uh, in an area where he, uh, would like to take up rather permanent residence and Philadelphia is it.\n\nSCHWARTZ: Philadelphia is a nice city. Philadelphia has been on the move since 1952. And, uh, business climate in Philadelphia is good.\n\nA690. Wald continued:\n\nWALD: Uh, and we want to put one up. Now we know that there are problems inherent in any major construction, uh, in this city and any other city. What I am trying to do is take care of any potential problems long before they exist. We're not breaking ground tomorrow morning. We can forsee certain problems such as, uh, uh, zoning and variances and this type of thing ... municipal government, how it effects those various things, but we don't want to be faced with problems down the road.\n\nA691-92. Schwartz responded to this overture with a soliloquy on his own political power and importance. After explaining how close he was to the mayor\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e and that he was \"sort of a protege\" of the mayor's deceased father, who had been Chairman of the (Democratic) party, Schwartz stated:\n\nSCHWARTZ: ... Unfortunately then he died in \"63. And I have been close to every chairman since. I am a member of the Democratic National Committee. I am a member of the State Committee. I am a member of the City Committee. A Ward Leader. I, uh, I have a ward-if you know what that means in politics.\n\nA693. A few minutes later, Wald asked:\n\nWALD: Is it fair to say that by doing business with you, uh ... my zoning problems become ...\n\nSCHWARTZ: Right.\n\nCRIDEN: You, you don't have any.\n\nWALD: Okay. Now. There are what, 17 members, as, as you say ... and also what uh I read here ...\n\nSCHWARTZ: Right.\n\nWALD: Uh, do we have a uh controlling vote ...\n\nSCHWARTZ: Yes.\n\nWALD: ... problem here?\n\nSCHWARTZ: No ...\n\nWALD: Uh.\n\nSCHWARTZ: No.\n\nWALD: Can you control ...\n\n....\n\nWALD: ... those types of factions?\n\nSCHWARTZ: Yes.\n\nWALD: You can control them?\n\n....\n\nSCHWARTZ: The proof was today. The proof was the election of myself as president again.\n\nWALD: Uh hmm.\n\nSCHWARTZ: In other words, we got uh five or six now (sic) members that came in. Uh, you tell me your birth date. I'll give them to you for your birthday.\n\nA695-6. The essence of Schwartz' representations of control was repeated shortly thereafter:\n\nWALD: All right. You're controlling the council at this point.\n\nSCHWARTZ: Right.\n\nWALD: As far as I'm concerned.\n\nSCHWARTZ: Right.\n\nCRIDEN: Right. And has been for ...\n\nSCHWARTZ: Right. Right.\n\nWALD: Should we have anything that comes up to a vote, that has to be done on a vote basis, the council is with you.\n\nSCHWARTZ: Yes.\n\nWALD: You control them at this point.\n\nSCHWARTZ: Yes. Yes. Yes.\n\nCRIDEN: 100 percent.\n\nSCHWARTZ: Yes.\n\nA709. Schwartz stated that although he could not promise that the hotel project would not have problems, those problems would not be \"insurmountable\" as long as the project \"is a proper project.\" A698. Wald stated, \"I am not putting up a cathouse\", Criden interjected, \"It's going to be legitimate\", and Schwartz responded, \"That I take for granted, or I wouldn't be here.\" A710. Wald then asked Schwartz for assurances of his support if the project \"violates some minor ... type statute or ordinance or ... something\", and Schwartz replied:\n\nSCHWARTZ: There is a Board of Building Standards. There, there is built-in relief every stage of the way. There's a Zoning Board of Adjustment for variances.\n\nWALD: Okay. Can you control that?\n\nSCHWARTZ: Yes ....\n\nA711. Immediately thereafter he explained, \"if it isn't something that is outlandish, if it is something that should and can be handled, and I can, I can't think of anything that couldn't be handled ... through a variance procedure of some kind.\" A712. Wald stated:\n\nWALD: Okay. Meaning that, if City Council has to vote on it, we don't have a problem at this point?\n\nSCHWARTZ: Well, I'm going further. There are other boards and agencies, uh, depending upon what your client, how idiosyncrant he wants to be and how eccentric he wants to be.\n\nWALD: (Laughter) ... They can become rather eccentric.\n\nSCHWARTZ: All right. All right. It may be necessary to go to these various boards and commissions. Now, they are part of the organization. They are part and parcel and ...\n\nWALD: Appointed, appointed officials?\n\nSCHWARTZ: Yes, they are appointed officials. Uh, but uh, as I say, uh, I always do my homework. And, uh, the mayor is a very strong mayor. We have a strong mayor form of government. And all these people are his appointees. My understanding with him is that I go to him-period. I don't even have to go to one of the flunkies, one of the functionaries. I go to him ....\n\nA712-13. After additional discussion which concerned local law firms that could be employed by the hotel project, the economic climate in Philadelphia, and the encouragement received by business from the city, Wald referred to Schwartz' compensation:\n\nWALD: Our time frame is growing short, but we don't have those type of problems. We don't have that built-in resentment. Ah ... We've talked to Howard, you know, the figures, the dollars we're talking are in the right ballpark. We're ...\n\nSCHWARTZ: That's not my prime concern. I'm interested in the City of Philadelphia. I'm interested in a good project. I'm interested in tax rateables. I want to see Center City develop. Especially Center City. There are a few parcels left. Well anything else that's going to add to the tax rateables of the city that's going to create jobs.\n\nWALD: I am again quick to say that I'm not really interested in the City of Philadelphia to be candid.\n\nSCHWARTZ: Well I have to be. I have to be.\n\nWALD: Perhaps, oh sure ... (inaudible) ...\n\nCRIDEN: Your primary concern is to see that if your employer decides to move, you have a minimum amount of problems.\n\nWALD: Exactly .... Problems are to be handled before they arise. Right. Should any minor problems come up. Should any problems that are councilmatic in scope ...\n\nSCHWARTZ: No problem.\n\nWALD: You could take care of them. Those are the type of things ...\n\nSCHWARTZ: Right.\n\nWALD: That he asks I make an unequivocal, yes, it's been handled, it's been taken care of and uh ...\n\nCRIDEN: You make that an unequivocable yes.\n\nSCHWARTZ: It's ... I would say to you that it's much easier now than it is than it was four years ago.\n\nA746-47. The conversation returned to the nature of the understanding:\n\nSCHWARTZ: There are administrative escape hatches for everything in the City of Philadelphia under our various codes. There's a way of doing it-administrative way of doing it.\n\nWALD: Okay, and that is the type of thing you can handle for us.\n\nSCHWARTZ: Oh yeah, right.\n\nWALD: I can go back and say I met a gentleman. We had a business deal uh, I've made a friend in Philadelphia.\n\nSCHWARTZ: Yes.\n\n....\n\nWALD: And things are taken care of ...\n\nSCHWARTZ: Right ...\n\nWALD: Okay, and the sums appropriate and we're in good shape. Okay.\n\nA753-54.\n\nShortly thereafter as seen on the videotape, Wald opened his briefcase and, without discussion of the amount, handed Schwartz an envelope (containing $30,000 cash), which Schwartz placed in his jacket without counting. The nature of the commitment Schwartz made was reiterated:\n\nWALD: The legislative problems we've taken care of?\n\nCRIDEN: No problem.\n\nWALD: Okay, that I can, that I, that I got assurance on.\n\nSCHWARTZ: Right.\n\nCRIDEN: You have, you have no problem.\n\nWALD: Okay, the other things can be done through attorneys, but the legislative problems don't exist anymore?\n\nCRIDEN: That's right.\n\nSCHWARTZ: No. Do not.\n\nWALD: Okay.\n\nA756.\n\nCriden remained behind and received his $5,000 fee for arranging the meeting. A758. He admitted to Wald that he had to give \"something\" to someone to make the approach to Schwartz. A763. Wald indicated an interest in talking to Jannotti if he was \"amenable\" because both Criden and Johanson had referred to Jannotti \"as a power.\" A770. Criden undertook to ascertain to \"try to do something\" with Jannotti and \"if the answer is no, I'm going to tell you right off the bat, forget it.\" A778. They discussed the amount of the payment to Jannotti, Wald asking \"Will he run with five\" and Criden replying \"Maybe ten ... (L)et me run it up the flag pole with him.\" A779-80. Wald asked whether he should deal with anybody else on the executive side and was told that there was no one else he could or should do business with. Criden promised to communicate with Wald the next day and departed.\n\nThe next evening, January 24, 1980, following telephone arrangements, Jannotti and Criden arrived at the Barclay suite to meet with Wald and Haridopolos. Jannotti had been briefed by Criden and Schwartz earlier that day who had \"explained the whole situation.\" A848. With Jannotti, as with Schwartz, Wald explained \"I'm only here for one reason, to bring back some assurances.\" A849. He continued:\n\nWALD: (W)e are prepared to make a major investment in this city, alright, and, ah, we have incredible funding but it's still a major investment even for the people that I represent at this time. Ah, it's not a drop in the bucket even for them. It's a fair amount of money and ah, the way these people do business, is somewhat different than the way we do business in this country, they don't think. They just can't tolerate nor can they put up with psychologically any problems that arise. Now these type of problems do arise but they can be handled, but the type of problems that would get back to my employer. Ahe, he can't deal with them, and he turns to me and says I thought we had all this settled in Philadelphia. So, that's why I'm here, simply to take care of any problems now.\n\nJANNOTTI: Far in advance.\n\nWALD: Ah, it's really not that far I don't think.\n\nCRIDEN: Well ...\n\nWALD: But at least enough in advance that ah when the time comes it's over and done with everything is nice. Ah, those problems are simply the ones that I can forsee and you haven't come up with anymore than you and I had been worried about nor has the other gentleman I dealt with, and that would be ah, ah, the zoning, any variances that we have to obtain any, ah, committee type things we'd would have to, ah, deal with, with City Council ah, inspections, licensing the whole gamut, ya know the whole thing, well you were in that type of business in, in an allied situation and I'm sure you can appreciate the petty things that arise, ah, that have to be handled.\n\nJANNOTTI: First of all you, you're going to invest a substantial amount of money and, ah, what you'll be doing is bringing into the City of Philadelphia a substantial amount of money, and this will create jobs, will create a tax base and ah from what I gather everything that you want to do with be strictly, ah, on board. I mean there's nothing phony about it.\n\nWALD: It's a legitimate operation.\n\nJANNOTTI: As long as it's, long as it's a legitimate, legitimate operation. Ya know, any legitimate operation we will fight for because, ah, ya know why shouldn't we fight for a legitimate operation? If the operation is legitimate, it's going to bring a tax base into the City of Philadelphia, it's going to bring employment into the City of Philadelphia, ah, this is, this is basically our job, ah George George's job and my job, ah, to try to get as much money into the City of Philadelphia and as many jobs into the City of Philadelphia as we possibly can.\n\nA849-51. Wald asked:\n\nWALD: By dealing with you here this evening and, and the gentleman I, I spoke with last evening, can I go back with those assurances?\n\nJANNOTTI: I don't see why not, as you say, ya know it's a legitimate project and you have your financing, there's nothing ah, there's nothing that you're doing illegal ...\n\nCRIDEN: Michael wants to be sure that he has a friend if he has a problem.\n\nJANNOTTI: Oh certainly.\n\nWALD: If something arises, if something arises that needs a City Council vote to be very specific, a City Council vote is needed on the thing, can I count on your vote?\n\nJANNOTTI: Why sure .... first of all we'll go over it again, you have a legitimate project, ah, you're going to invest 36 million dollars in the City of Philadelphia, which is going to create a tax base and going to create employment.\n\nWALD: Right, but.\n\nJANNOTTI: But ya, but.\n\nHARIDOPOLIS: A lot of legitimate, ah, things get bogged down, we don't want to be bogged down.\n\nJANNOTTI: No, I can't see this being bogged down.\n\nA853-54. Wald explained his position:\n\nWALD: Let me give you a short insight into the Arab mind, that its ah, it's at times difficult to understand now, ah, I can appreciate it because I've had both worlds and I can relate, ah, you know, you folks are here, right, they, they think differently, they deal differently, their psychological process are alien to the way I understand exactly what you're saying. Ok. I'm coming up with something that's going to help the City of Philadelphia. Ah, it would help, as it would help any city. Ah, he does not look on it that way. They do business, differently. They pay the freight up front. They make friends, right, and then when there, there is a potential problem then I don't mean, I don't mean a problem that would necessarily close down construction and throw the project out of Philadelphia.\n\nA855-56.\n\nWald and Jannotti discussed City Council politics, and Jannotti affirmed Criden's statement that Council \"never had a vote on an issue that George and Harry wanted passed that they'd lost in the last two years.\" A859. They then discussed the payment to Jannotti:\n\nWALD: But, you were here at the time. You convinced me right off the bat that we were in the right city and we would have no problems.\n\nCRIDEN: You will have no problems.\n\nWALD: And I would just as soon save the money, but I can't go back.\n\nCRIDEN: I understand, we had that discussion.\n\nWALD: (Pointing to Criden) Did he, was he very graphic with ya?\n\nJANNOTTI: Yes.\n\nWALD: On exactly how ...\n\nJANNOTTI: (Nodding yes) He was always up front, up front.\n\nWALD: Ok and ...\n\nCRIDEN: To the bottom line, you know me Michael, I, I don't we, we both do everything right up front.\n\nWALD: Ok and, alright, then I'm going to be, then I'm going to be up front with ya. I'm.\n\nCRIDEN: Exactly.\n\nWALD: Ah, you've been in business all your life, you've as you said, you got an education 20 years behind the bar, I was sent to Philadelphia to pay for certain things because that is the psychology and that is the method of business that these people are use to, and that is how they conduct business, they conduct with everybody they do. That's why I'm here. I understand their psychology, I've been involved with them long enough, ah to make it a major part of my life, a majority of my life.\n\nJANNOTTI: Well, you know ah, just just on the basics, of what you said and what they want to do, it's enough for me to get on the floor and argue. I don't have to, even care what else they want to come up with. My basic point is, the fact that, ah what's coming in here, and this has been our job, to bring as much business and and, and ah tax base and employment to the City of Philadelphia. If that's the way they want to do business, that's all right too.\n\nA859-61. Wald asked again for \"assurances\":\n\nWALD: Can I go back, ah ah, to my employer, the Sheik and tell him that I dealt with a man, on Wednesday night tell him who he is, dealt with you, Thursday night, explain who you were, what your position is and say he and I conducted a cash business transaction and he guaranteed me, we don't have a problem in Philadelphia. We ah, ah City Councils on our side the man has the influence with the Finance Committee, he has influence ...\n\nJANNOTTI: You wouldn't, you wouldn't be able to say we don't have a problem. Problems might arise, but problems ah, you might say problems can be solved.\n\nWALD: Ok, you can handle those problems we presume.\n\nJANNOTTI: I don't see why not if it's a legitimate, if it's a if it's a legitimate if it's a, if it's a legitimate enterprise, it's a legitimate piece of business.\n\n....\n\nWALD: By making friends with you this evening, if we have to go to City Council and say look, ya know, give us a break, right, got us some legislation that this is ok. That it's in the right neighborhood, that the time.\n\nCRIDEN: If you want a street for example let's say changed from a two way to a one way ok, maybe that will help you.\n\nWALD: Ok.\n\nCRIDEN: Handle your traffic pattern.\n\nJANNOTTI: We handle that everyday.\n\n....\n\nWALD: But I go back and I'll say we have this, and I'll use that as an example that if we have a one way street situation and it's just hurting the front, of, of the place we cannot move people in and out of the hotel limousines to private vehicles and what have you, ah the men I dealt with said they will help. I'm not saying that you could walk in there and change this thing tomorrow, but.\n\nCRIDEN: Yet.\n\nJANNOTTI: We'll go in there and battle, we'll go in and battle.\n\nWALD: You're with us?\n\nJANNOTTI: Certainly, we'll go in and battle.\n\nA863-67. Wald then took an envelope from his briefcase (containing $10,000 cash), handed it to Jannotti, and asked if \"that amount is sufficient.\" Jannotti took the envelope, answering, \"We've discussed it.\"\n\nHARIDOPOLIS: You know how much it is?\n\nCRIDEN: Tell him, you can tell him.\n\nHARIDOPOLIS: How much is it?\n\nCRIDEN: Tell him?\n\nJANNOTTI: We won't even discuss it.\n\nWALD: Ok, but you did discuss it with Howard?\n\nJANNOTTI: We won't even discuss it.\n\nHARIDOPOLIS: Is this arrangement please, pleasing to you?\n\nJANNOTTI: As I say, we won't even discuss it.\n\nWALD: Ok, well, we've done our business.\n\nA884-85. Jannotti departed, and Criden promised to see him downstairs.\n\nII.\n\nHOBBS ACT CONSPIRACY\n\nIn its opinion granting the motions for acquittal the district court noted that the \"evidence permitted, although it did not compel, the inference that the payments represented bribes paid in exchange for the defendants' assurances of using their official positions to pave the way for expeditious completion of the project.\" 501 F. Supp. at 1184. The court, however, dismissed Count III of the indictment, the Hobbs Act conspiracy count, for two reasons. The first dealt with the fictitious nature of the scheme. Although the court was willing to assume that the \"evidence permitted the jury to conclude that, if the project had in fact been a genuine project, it would have required the movement of articles in interstate commerce, and that the payment of these bribes would have affected such commerce by depleting the funds available for carrying out the project,\"\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e the court focused on the fact that \"there never was any such planned project. The Arabs, their plans, and their money were all entirely fictitious.\" Id. The court concluded:\n\nWhile the jurisdictional reach of the Hobbs Act is undoubtedly extensive, touching conduct having only minimal or potential impact upon commerce (broadly defined), it does not operate to confer federal jurisdiction over purely hypothetical potential impacts on commerce which could never occur.\n\nId. at 1185. The district court thus fashioned a requirement that conviction for conspiracy to violate the Hobbs Act requires an actual potential effect on interstate commerce.\n\nThe second jurisdictional defect, according to the district court, stemmed from its view that the Hobbs Act does not cover the \"passive acceptance of gratuities by public officials.\" Id. The district court, after noting that defendants did not request payment and \"made it very clear that the payments would not be necessary\", found that the convictions would represent \"a substantial stretching of the definition of extortion.\" Id.\n\nA.\n\nEffect on Interstate Commerce\n\nThe broad language of the Hobbs Act, covering anyone who \"in any way or degree ... affects commerce ... by ... extortion or attempts or conspires so to do ...\", 18 U.S.C. § 1951,\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e demonstrates Congress' intent to free interstate commerce from burdens of any kind caused by extortion. The Supreme Court has expressly recognized that the statute manifests a congressional purpose \"to use all the constitutional power Congress has to punish interference with interstate commerce ....\" Stirone v. United States, 361 U.S. 212, 215, 80 S. Ct. 270, 272, 4 L. Ed. 2d 252 (1960). Accord, e.g., United States v. Cerilli, 603 F.2d 415, 423 (3d Cir. 1979), cert. denied, 444 U.S. 1043, 100 S. Ct. 728, 62 L. Ed. 2d 728 (1980). See also United States v. Culbert, 435 U.S. 371, 98 S. Ct. 1112, 55 L. Ed. 2d 349 (1978); United States v. Green, 350 U.S. 415, 420-21, 350 U.S. 415, 76 S. Ct. 522, 100 L. Ed. 494 (1956). In United States v. Staszcuk, 517 F.2d 53, 58 (7th Cir.) (en banc), cert. denied, 423 U.S. 837, 96 S. Ct. 65, 46 L. Ed. 2d 56 (1975), the court concluded that \"the purpose of the Hobbs Act parallels the central purpose of the Commerce Clause itself.\" Thus, the decision of the district court in this case has application beyond the Hobbs Act because the extent of Congress' power under the commerce clause is implicated, and, if its analysis is accepted, will have ramifications for all federal criminal statutes enacted under Congress' commerce clause power.\n\nWe begin the analysis of Congress' power to regulate interstate commerce with the now-accepted principle that the commerce clause reaches, inter alia, activities affecting interstate commerce. Perez v. United States, 402 U.S. 146, 150, 91 S. Ct. 1357, 1359, 28 L. Ed. 2d 686 (1971); United States v. Darby, 312 U.S. 100, 61 S. Ct. 451, 85 L. Ed. 609 (1941). However, application of a federal criminal statute is not limited to those cases in which an actual interstate effect is shown. Instead, as the Court recognized in Perez v. United States, 402 U.S. at 152-53, 91 S. Ct. at 1360-61, it is enough that the conduct falls within the \"class of activities\" within the reach of federal power.\n\nSchwartz and Jannotti were convicted of a conspiracy to violate the Hobbs Act, rather than of a substantive violation of the Hobbs Act. A substantive violation of the Hobbs Act generally is supported by proof of an actual effect on commerce. See, e.g., United States v. Mazzei, 521 F.2d 639, 642 (3d Cir.) (en banc), cert. denied, 423 U.S. 1014, 96 S. Ct. 446, 46 L. Ed. 2d 385 (1975). But see United States v. Staszcuk, 517 F.2d 53, 59-60 (7th Cir.) (en banc), cert. denied, 423 U.S. 837, 96 S. Ct. 65, 46 L. Ed. 2d 56 (1975) (actual effect need not be shown; \"realistic probability\" of effect is sufficient). Defendants argue that it follows that a prosecution for conspiracy to violate the Hobbs Act also requires proof \"that commerce must have been affected.\" Brief for Appellee Jannotti at 22. In so arguing, defendants overlook the significant distinction between a conviction for a substantive offense and a conviction for a conspiracy to commit the substantive offense. This distinction was recognized by the district court at an early stage of the litigation when it dismissed the substantive Hobbs Act counts of the indictment on the ground that there was no possibility that the bribe payments could actually have affected commerce, but left standing the conspiracy count on the possibility that federal jurisdiction could be grounded on proof that the conspiracy, if completed, would affect commerce. See 501 F. Supp. at 1184. The subsequent dismissal of Count III of the indictment was apparently grounded on the district court's changed view of the law that an actual potential effect was required, even for a conspiracy conviction. We believe the district court's earlier view was the correct one.\n\nBecause an agreement between two or more persons to commit criminal acts poses, in and of itself, a serious danger to social order, it is proscribed by the law of conspiracy. See Callanan v. United States, 364 U.S. 587, 593, 81 S. Ct. 321, 325, 5 L. Ed. 2d 312 (1961). The ultimate failure of the conspiracy may diminish, but does not eliminate, the threat it poses to social order; therefore, the illegality of the agreement does not depend on the achievement of its ends. See generally United States v. Shoup, 608 F.2d 950, 957 n.13 (3d Cir. 1979); United States v. Bobo, 586 F.2d 355, 371 (5th Cir. 1978), cert. denied, 440 U.S. 976, 99 S. Ct. 1546, 59 L. Ed. 2d 795 (1979). It is similarly irrelevant that the ends of the conspiracy were from the very inception of the agreement objectively unattainable. United States v. Waldron, 590 F.2d 33 (1st Cir.), cert. denied, 441 U.S. 934, 99 S. Ct. 2056, 60 L. Ed. 2d 662 (1979) (conviction for conspiracy to transport stolen goods in excess of $5,000 affirmed, even though, unknown to defendants, property transported was worth less than $5,000); United States v. Thompson, 493 F.2d 305 (9th Cir.), cert. denied, 419 U.S. 834, 95 S. Ct. 60, 42 L. Ed. 2d 60 (1974) (defendant can be convicted of conspiracy to smuggle marijuana even though substance was not shown to be marijuana). In this case the defendants agreed to do acts which, had they been attainable, would have affected commerce. At that point, regardless of whether an actual effect on commerce was \"reasonably probable,\" a sufficient federal interest was implicated to support federal jurisdiction over that agreement.\n\nThe Hobbs Act, by its own terms, encompasses the inchoate offenses of attempt and conspiracy to extort. Convictions for these offenses have been sustained notwithstanding the absence of any evidence of an actual effect on interstate commerce. In United States v. Rosa, 560 F.2d 149, 153 (3d Cir.) (en banc), cert. denied, 434 U.S. 862, 98 S. Ct. 191, 54 L. Ed. 2d 135 (1977), a case in which there was no effect on commerce because the \"victim\" refused to pay the extortion demand, we stated that a defendant may be convicted under the Hobbs Act for an \"attempted extortion which would, if the act were completed, have the effect of obstructing commerce.\" See also United States v. Bellomini, 454 F. Supp. 44, 47 (W.D.Pa.1978) (\"The fact that the business enterprise was frustrated at a later date through failure of finances does not constitute a defense to a charge of attempt to extort money in violation of the Hobbs Act.\"). Similarly, in United States v. Caci, 401 F.2d 664 (2d Cir. 1968), vacated on other grounds, 394 U.S. 310, 89 S. Ct. 1163, 22 L. Ed. 2d 297 (1969), the Second Circuit sustained the conviction of defendants for conspiracy to rob an armored car messenger in violation of the Hobbs Act although the plan was aborted.\n\nCounsel for defendants conceded at oral argument that they could point to no precedent to support their contention that a conviction for conspiracy to violate the Hobbs Act must be predicated on a showing of an actual or probable future effect on interstate commerce. One of the few cases to focus on the interstate commerce aspect of the Hobbs Act, United States v. Staszcuk, 517 F.2d 53 (7th Cir.) (en banc), cert. denied, 423 U.S. 837, 96 S. Ct. 65, 46 L. Ed. 2d 56 (1975), arose when a local alderman was convicted of a substantive Hobbs Act violation. The government had proven that he received $3,000 and that he did not oppose a zoning change which authorized the construction of an animal hospital. Because no such hospital was ever built, the court noted that \"there is no evidence that either the zoning change or the payment had any effect whatsoever, either favorable or unfavorable, on interstate commerce.\" Id. at 55. Judge, now Justice, Stevens, writing for a majority of the en banc court, considered whether the federal statute reached extortion under those circumstances, and concluded: \"We are ... persuaded that the cases which uniformly hold that a threatened effect on interstate commerce is sufficient to bring the statute into play notwithstanding the absence of any actual effect, correctly interpret the congressional purpose.\" Id. at 59 (emphasis added).\n\nWe believe Justice Stevens' approach is dispositive of the jurisdictional issue before us. Congress can constitutionally reach inchoate offenses because these offenses pose a potential threat to interstate commerce; the existence of such a threat ties \"the proscribed conduct to the area of federal concern delineated by the statute.\" United States v. Feola, 420 U.S. 671, 695, 95 S. Ct. 1255, 1269, 43 L. Ed. 2d 541 (1975). The appropriate inquiry then is not whether the defendants' perceptions can invest the courts with federal jurisdiction, as the district court viewed the issue, but whether the defendants' conduct constituted a sufficient threat to interstate commerce so as to implicate an \"area of federal concern\" sufficient to give rise to federal jurisdiction.\n\nIn essence the defendants are arguing that we should accept an impossibility defense when federal jurisdiction is predicated on interstate commerce. We believe such a defense must be rejected here. In substantive Hobbs Act convictions, the requisite nexus to interstate commerce has been found in the depletion of assets theory, because the payment of an extortion demand may reduce the assets available for the purchase of goods originating in other states. See, e.g., United States v. Cerilli, 603 F.2d 415, 424 (3d Cir. 1979), cert. denied, 444 U.S. 1043, 100 S. Ct. 728, 62 L. Ed. 2d 728 (1980); United States v. Addonizio, 451 F.2d 49, 77 (3d Cir. 1971), cert. denied, 405 U.S. 936, 92 S. Ct. 949, 30 L. Ed. 2d 812 (1972). In United States v. Rindone, 631 F.2d 491 (7th Cir. 1980), the Hobbs Act conviction of a municipal inspector who had extorted money in exchange for work permits was challenged on the ground that there was no nexus with interstate commerce under the depletion of assets theory because the Federal Bureau of Investigation had supplied the money used in the extortionate transaction. In rejecting this claim, the court reviewed Hobbs Act cases which upheld jurisdiction although no depletion of assets affecting interstate commerce had or could take place and affirmed the \"federal interest in deterring even futile threats to interstate commerce\", 631 F.2d at 493, referring to United States v. Staszcuk, 517 F.2d at 57. The Rindone court concluded:\n\nAs the court noted in (United States v. Brooklier, 459 F. Supp. 476 (C.D.Cal.1978) ), \"(t)his extortion completed a plan that would have actually affected commerce but for a fact unknown to defendants, i.e., that (the victim) was a company not actually engaged in commerce.\" Id. at 478. The presence here of a fact not known to Rindone, i.e., that the FBI provided the payoff money, is likewise irrelevant to the jurisdictional inquiry.\n\n631 F.2d at 494. In the Brooklier case, relied upon by the Seventh Circuit, the victim corporation was an F.B.I.-created shell that in fact had no interstate dealings. Jurisdiction under the Hobbs Act was nonetheless upheld.\n\nIn construing other federal statutes, the courts also have expressed an unwillingness to accept impossibility as precluding jurisdiction. In United States v. Rose, 590 F.2d 232 (7th Cir. 1978), cert. denied, 442 U.S. 929, 99 S. Ct. 2859, 61 L. Ed. 2d 297 (1979), two defendants who had agreed to burglarize a home in Arizona and to transport the stolen goods to Illinois, unwittingly engaged F.B.I. agents to perform the theft and to transport the goods. The agents never intended to commit the thefts and no goods were ever stolen; instead the defendants were arrested and convicted of conspiracy to transport goods interstate knowing the goods to be stolen. Although the issue of federal jurisdiction was not expressly raised, the court, in affirming the convictions under 18 U.S.C. §§ 371, 2314, commented:\n\nHere (defendants) intended to cause the goods to be stolen and then transported in interstate commerce with knowledge that they had been stolen. All that was necessary, in addition to an overt act, was that the intended future conduct they had agreed upon include all the elements of the substantive crime.\n\n590 F.2d at 235. This statement reflects the court's view that the defendants' plan to transport the goods interstate, even though unattainable from the outset, sufficiently impinged on an area of federal concern to justify federal regulation and prohibition. See also Craven v. United States, 22 F.2d 605, 609 (1st Cir. 1927), cert. denied, 276 U.S. 627, 48 S. Ct. 321, 72 L. Ed. 739 (1928) (conviction for conspiracy to import foreign liquor without payment of tariff can be sustained based on defendants' erroneous beliefs that liquor was of foreign origin).\n\nDefendants have argued that the holding in United States v. Feola, 420 U.S. at 695-96, 95 S. Ct. at 1269-70, supports their view that an essential jurisdictional element cannot be established by reference solely to the state of mind of the defendant. Feola provides no support for the defendants' theory. In Feola, even though the defendants did not intend to assault a federal officer, the Court held that they could be still convicted for conspiring to violate the federal statute, 18 U.S.C. § 111, which prohibits an assault on a federal officer. In holding that there was a \"sufficient threat\" to an \"area of federal concern\" to meet the federal jurisdictional requirement as long as a federal officer was in fact the target of the planned attack, 420 U.S. at 695, 95 S. Ct. at 1269, the Court did not preclude the existence of federal jurisdiction where the intended victim is believed to be a federal officer, but in fact is not.\n\nIn fact, the language in the Feola opinion and the approach taken by the Court there support our final reason for rejecting the district court's holding that an actual potential effect on interstate commerce is a jurisdictional prerequisite for a conviction for conspiracy to violate the Hobbs Act. Defendants have been able to offer this court no policy reason for us to accept their restrictive view of Congress' constitutional power to legislate as to conspiracies which pose a threat to interstate commerce. Defendants agree that had the government moved from the verbal ruse that its agents were in the hotel construction business to the more concrete action of embarking on that venture, see United States v. Gambino, 566 F.2d 414 (2d Cir. 1977), cert. denied, 435 U.S. 952, 98 S. Ct. 1580, 55 L. Ed. 2d 802 (1978), the jurisdictional requirement would have been met. However, we see no reason to interpret Congress' legislative power as dependent upon whether the F.B.I. agents actually contract for a hotel site, purchase machinery to dump garbage, or establish their own fencing operation for the purchase of stolen goods. To require that the government take that additional step before it can constitutionally reach a proven conspiracy which would have affected interstate commerce had the facts been as represented misdirects the focus of the conspiracy cases. As the Court noted in Feola, \"(T)he law of conspiracy serves ends different from, and complementary to, those served by criminal prohibitions of the substantive offense.\" 420 U.S. at 693, 95 S. Ct. at 1267. The Court identified the dual purposes of conspiracy law, \"protection of society from the dangers of concerted criminal activity,\" and sanctions against those agreements which pose great likelihood of commission of an act due to well formed criminal intent. Id. at 693-94, 95 S. Ct. at 1267-68.\n\nIn this case the jury found that the defendants conspired to violate the Hobbs Act by their acceptance of payments in return for their promises to expedite completion of an elaborate hotel project which, had it been constructed, would have entailed at least a $30 million expenditure. Had the project actually been planned as represented, defendants' actions would have violated the Hobbs Act even if unforeseen difficulties, such as the overthrow of the \"sheik\", prevented any further action on the project. The federal interest in protecting interstate commerce is no less under the factual situation presented in this case. The threat posed by defendants' actions is just as great. Since Congress has exercised the full scope of its commerce power in the Hobbs Act, we conclude that there was Hobbs Act jurisdiction.\n\nB.\n\nExtortion \"Under Color of Official Right\"\n\nAs an additional ground for dismissing the Hobbs Act count the district court held that defendants' conduct did not constitute \"extortion\" under the Act because they, at most, \"passive(ly)\" accepted the bribes. 501 F. Supp. at 1185. The Act defines \"extortion\" as:\n\nthe obtaining of property from another, with his consent, induced by wrongful use of actual or threatened force, violence, or fear, or under color of official right.\n\n18 U.S.C. § 1951(b)(2).\n\nThe district court's holding is inconsistent with the rationale underlying the holdings of this court that the Act is disjunctive and proscribes the \"obtaining of property from another ... under color of official right,\" without proof of coercion by the defendant. United States v. Kenny, 462 F.2d 1205, 1229 (3d Cir.), cert. denied, 409 U.S. 914, 93 S. Ct. 233, 34 L. Ed. 2d 176 (1972). We reaffirmed this principle in United States v. Mazzei, 521 F.2d 639 (3d Cir.) (en banc), cert. denied, 423 U.S. 1014, 96 S. Ct. 446, 46 L. Ed. 2d 385 (1975), where we stated:\n\nA violation of the statute may be made out by showing that a public official through the wrongful use of office obtains property not due him or his office, even though his acts are not accompanied by the use of \"force, violence or fear.\"\n\nId. at 645 (citations omitted). In Mazzei, we observed that \"the \"under color of official right' language (of the Hobbs Act) \"repeats the common law definition of extortion.' \" Id. (citation omitted). At common law, extortion was defined as \"any officer's unlawfully taking, by color of his office, from any man, any money or thing of value that is not due to him.\" 4 W. Blackstone, Commentaries *141. The requirement that the money be taken \"by color of his office\" meant \"simply that the officer must have taken money not due him for the performance of his official duties.\" State v. Weleck, 10 N.J. 355, 372, 91 A.2d 751, 759 (1952). Thus, \"if the (Hobbs) Act is read in full, the distinction between bribery and extortion becomes unnecessary where public officials are involved.\" Stern, Prosecutions of Local Political Corruption Under the Hobbs Act: The Unnecessary Distinction Between Bribery and Extortion, 3 Seton Hall L.Rev. 1, 14 (1971). More recently, in United States v. Cerilli, 603 F.2d 415 (3d Cir. 1979), cert. denied, 444 U.S. 1043, 100 S. Ct. 728, 62 L. Ed. 2d 728 (1980), we upheld the conviction of state officials who received bribes in return for conferring valuable state contracts, and approved the district court's charge that extortion under \"color of official right is defined as the taking by a public official of money not due him or his office....\"\n\nThe holding in our cases that the Hobbs Act covers the acceptance of bribes by public officials even when payment was not obtained by force, threats, or use of fear, and the further suggestion that there need be no inducement or prior request for such payments, accords with the view taken by other courts of appeals. In United States v. Hedman, 630 F.2d 1184 (7th Cir. 1980), cert. denied, 450 U.S. 965, 101 S. Ct. 1481, 67 L. Ed. 2d 614 (1981), the government proved at trial that defendants, city building inspectors, accepted money from builders who failed to conform with the building code, but no solicitation of the bribes was shown. In rejecting defendants' argument that the government must show that the officials were the \"initiators\" or \"inducers\" of the alleged payments, the court stated:\n\nIt is settled law in this Circuit as well as others that in a Hobbs Act prosecution for extortion under color of official right it is unnecessary to show that the defendant induced the extortionate payment.... The Government is merely required to prove that a public official obtained money to which he was not entitled and which he obtained only because of his official position.\n\nId. at 1195 (footnote omitted). The Sixth Circuit has also held that the \"technical overdrawn distinction\" which the public officials sought to make there between bribery and extortion under the Hobbs Act is not in keeping with the legislative intent, and that \"in cases of misuse of official power, bribery and extortion are not mutually exclusive.\" United States v. Butler, 618 F.2d 411, 417 (6th Cir. 1980), cert. denied, 447 U.S. 927, 100 S. Ct. 3024, 65 L. Ed. 2d 1121 (1980) and 449 U.S. 1089, 101 S. Ct. 881, 66 L. Ed. 2d 816 (1981).\n\nDefendants argue that in each of the cases in which this court seemed to interpret the Hobbs Act to cover passive acceptance of a bribe by a public official, the defendant had in fact engaged in some conduct which could be construed as inducement of the payment. Even if the Hobbs Act were to be construed as requiring some inducement on the part of the public official, defendants' conduct in this case hardly constituted merely passive acceptance of the payments. The evidence does not fit the defendants' posited illustration of an unexpected bribe mailed to a public official's office. On the contrary, rather than remaining in their own offices, the evidence shows that each defendant arrived at the Barclay suite after having been briefed about the purported hotel project, the fact that there would be a payment made, and the specific amount of the payment which would be made to each. Although there is no verbatim record of Criden's earlier conversation with Schwartz, Criden reported to Wald that he told Jannotti before the January 24th meeting that the hotel builders wished assurances that there would be no municipally imposed obstacles to the project, and that the builders were willing to pay for such assurances. A897. As soon as each defendant was in the Barclay suite, Wald, the F.B.I. agent, promptly repeated the need for such assurances. Thereafter, Schwartz launched into a discourse on his own importance and power and his ability to control City Council and the relevant municipal officials and departments, A692-96, 709-13, see pages 585-586 supra, and Jannotti also confirmed his own power. A858-59, see page 588 supra. Further, each gave assurances that there would be no obstacles or that the obstacles, if any, would be manageable. Thus, each defendant's appearance at the Barclay in expectation of a payment and his conduct in providing such assurances evidences more than mere \"passive\" acceptance of the bribes,\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e and falls within the Hobbs Act definition of extortion under color of official right.\n\nAccordingly we hold that the district court erred in dismissing Count III of the indictment.\n\nIII.\n\nENTRAPMENT\n\nAs Justice Harlan noted, the meaning, purpose, and application of the defense of entrapment in criminal cases are problems that have sharply divided the Court. See Lopez v. United States, 373 U.S. 427, 434, 83 S. Ct. 1381, 1385, 10 L. Ed. 2d 462 (1963). See also United States v. Russell, 411 U.S. 423, 439-40, 93 S. Ct. 1637, 1646-47, 36 L. Ed. 2d 366 (Stewart, J., dissenting) (1973). To a large extent, that division has centered on whether the controlling standard focuses on the conduct of the government (the objective test) or the predisposition of the defendant (the subjective test). The legal principles which determine the application of the entrapment defense in this case, however, are not in serious dispute. The parameters of the entrapment defense are largely to be found from the four principal cases in which the defense has been considered by the Supreme Court, Sorrells v. United States, 287 U.S. 435, 53 S. Ct. 210, 77 L. Ed. 413 (1932); Sherman v. United States, 356 U.S. 369, 78 S. Ct. 819, 2 L. Ed. 2d 848 (1958); United States v. Russell, 411 U.S. 423, 93 S. Ct. 1637, 36 L. Ed. 2d 366 (1973); and Hampton v. United States, 425 U.S. 484, 96 S. Ct. 1646, 48 L. Ed. 2d 113 (1976).\n\nIn Sorrells v. United States, where the Court first recognized the defense of entrapment, the Court held the defendant was entitled to have the jury consider whether his acts of possessing and selling one-half gallon of whiskey in violation of the National Prohibition Act were instigated by the prohibition agent who implanted in the \"mind of an innocent person the disposition to commit the alleged offense and induce its commission in order that (Government officials) may prosecute.\" 287 U.S. at 442, 53 S. Ct. at 212. The nature of the defense was outlined more fully when the Court next considered the defense a quarter of a century later in Sherman v. United States. Chief Justice Warren, writing for the majority of the Court, stated that \"to determine whether entrapment has been established, a line must be drawn between the trap for the unwary innocent and the trap for the unwary criminal.\" 356 U.S. at 372, 78 S. Ct. at 820. In concluding that entrapment had been established as a matter of law, the Court determined from the undisputed testimony of the prosecution's witnesses that the defendant was induced to sell narcotics by the government informer and that he was not predisposed, i.e., that he engaged in conduct he would not otherwise have attempted. The Court noted, \"Entrapment occurs only when the criminal conduct was \"the product of the creative activity' of law-enforcement officials.\" Id. (emphasis in original).\n\nIn United States v. Russell, the Court expressly disapproved of the decisions of the lower federal courts which had expanded the entrapment defense beyond the Court's opinions in Sorrells and Sherman. Instead, the Court reiterated that the defense was not of constitutional dimension, and reaffirmed its prior opinions that established that entrapment is a \"relatively limited defense\", 411 U.S. at 435, 93 S. Ct. at 1644, which cannot be used by a predisposed defendant. Most recently, in Hampton v. United States, a majority of the Court, in two separate opinions, upheld defendant's conviction arising from his sales of heroin which had allegedly been procured from a government informant, reaffirming once again the unavailability of the entrapment defense to a predisposed defendant.\n\nEmerging from these cases are the principles which guide our review of the evidence which defendants argue and the district court found established entrapment as a matter of law. As the Court stated in Sorrells, \"It is well settled that the fact that officers or employees of the Government merely afford opportunities or facilities for the commission of the offense does not defeat the prosecution.\" 287 U.S. at 441, 53 S. Ct. at 212. Entrapment occurs when a defendant who was not predisposed to commit the crime does so as a result of the government's inducement. The entrapment defense thus focuses on \"the intent or predisposition of the defendant to commit the crime.\" United States v. Russell, 411 U.S. at 429, 93 S. Ct. at 1641. As we have previously held, the government has the burden \"to disprove the whole (entrapment) defense beyond a reasonable doubt,\" United States v. Watson, 489 F.2d 504, 510 (3d Cir. 1973).\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nFinally, although there may be instances where the undisputed facts establish the entrapment defense as a matter of law, as in United States v. Sherman, or where the evidence is simply insufficient to submit the issue to the jury, see, e.g., United States v. Armocida, 515 F.2d 49, 55-56 (3d Cir. 1975); United States v. Payseur, 501 F.2d 966, 970-71 (9th Cir. 1974); United States v. Smith, 489 F.2d 1330, 1334-35 (7th Cir. 1973), cert. denied, 416 U.S. 994, 94 S. Ct. 2407, 40 L. Ed. 2d 773 (1974), entrapment is generally a jury question. See United States v. Lentz, 624 F.2d 1280, 1286 (5th Cir. 1980), cert. denied, 450 U.S. 995, 101 S. Ct. 1696, 68 L. Ed. 2d 194 (1981); United States v. Bocra, 623 F.2d 281, 288-89 (3d Cir.), cert. denied, 449 U.S. 875, 101 S. Ct. 217, 66 L. Ed. 2d 96 (1980); United States v. Twigg, 588 F.2d 373, 376 (3d Cir. 1978). See also United States v. Klosterman, 248 F.2d 191, 194-95 (3d Cir. 1957); Tzimopoulos v. United States, 554 F.2d 1216, 1217 (1st Cir.) (per curiam), cert. denied, 434 U.S. 851, 98 S. Ct. 164, 54 L. Ed. 2d 120 (1977). This court has held that a defendant is entitled to an entrapment instruction,\n\nhowever unreasonable the judge would consider a verdict in favor of the defendant to be, when the accused shows (1) evidence that the Government initiated the crime, regardless of the amount of pressure applied to the defendant, and (2) any evidence negating the defendant's propensity to commit the crime.\n\nUnited States v. Watson, 489 F.2d at 509.\n\nThe district court in this case submitted the issue of entrapment to the jury following a jury charge on that issue which is not here challenged. After the jury decided that defendants were not entrapped, the district court reconsidered the propriety of such submission in ruling on defendants' motions for acquittal. The court summarized the government's evidence as relying exclusively upon the fact that each defendant did accept money from the agents. The district court agreed that \"in some situations ... a defendant's ready acquiescence in the Government's suggestion may be enough to justify a finding of predisposition.\" United States v. Jannotti, 501 F. Supp. at 1200. See, e.g., United States v. Valencia, 645 F.2d 1158, 1167-68 (2d Cir. 1980) (ready response to drug sale proposal); United States v. Viviano, 437 F.2d 295, 299 (2d Cir.), cert. denied, 402 U.S. 983, 91 S. Ct. 1659, 29 L. Ed. 2d 149 (1971) (ready response to bribe solicitation).\n\nHowever, the district court overturned the jury's decision. Although the court remarked that, \"No-one who has viewed the videotape evidence in this case could avoid feelings of distress and disgust at the crass behavior the tapes reveal,\" it gave judgment for the defendants because \"(t)he evidence was, as a matter of law, insufficient to establish the defendants' predisposition beyond a reasonable doubt.\" 501 F. Supp. at 1200. In support of that decision, the district court relied on three factors.\n\nIn my opinion, in their zeal to make sure that the defendants would accept the tendered payments, the government agents offered such attractive inducements as to preclude any reliance upon the defendants' acceptance of the money as proof of predisposition. In the first place, the amounts offered were exceedingly generous. Standing alone, the very amounts of the bribes were, to paraphrase the language of the court in Scriber v. U. S., (4 F.2d 97 (6th Cir. 1925) ), \"a substantial temptation to a first offense.\"\n\nIn the second place, it was clear that the defendants would not be asked or expected to do anything improper on behalf of the proposed hotel venture; and they agreed to do nothing inconsistent with their obligations as members of the City Council, working for the benefit of their constituents.\n\nFinally, and most importantly, they were led to believe that if they did not accept the money, the project would not come to Philadelphia. In the context of the fiscal crises which beset all large cities these days, and in the context of the problems of urban blight and decay, the governmental inducement in this case was indeed calculated to overwhelm.\n\nId. (emphasis added).\n\nBefore turning to that evidence, it will be useful to reiterate briefly the applicable principles governing deference to the jury's findings. In ruling on a motion to overturn a jury's finding of predisposition the trial court must view the evidence in the light most favorable to the prosecution, and resolve all reasonable inferences therefrom in its favor. See Glasser v. United States, 315 U.S. 60, 80, 62 S. Ct. 457, 469, 86 L. Ed. 680 (1942); United States v. Artuso, 618 F.2d 192, 195-96 (2d Cir.), cert. denied, 449 U.S. 861, 101 S. Ct. 164, 66 L. Ed. 2d 77 (1980). Credibility determinations are for the jury. See, e.g., United States v. Bocra, 623 F.2d 281, 289 (3d Cir.), cert. denied, 449 U.S. 875, 101 S. Ct. 217, 66 L. Ed. 2d 96 (1980). Viewing the evidence in this light, the trial court must uphold the jury's verdict unless no reasonable jury could conclude beyond a reasonable doubt that the defendant was predisposed to commit the offense for which he was convicted. See Burks v. United States, 437 U.S. 1, 16, 98 S. Ct. 2141, 2149, 57 L. Ed. 2d 1 (1978). Obviously, in reviewing a district court's decision to disregard a jury verdict, we apply the same standard. Id. at 17, 98 S. Ct. at 2150; United States v. Dixon, 658 F.2d 181, 188 (3d Cir. 1981). Thus, we must independently examine the evidence on the three factors relied upon by the district court to determine whether it was as overwhelming for the defendants as the district court found. If not, it was error to withdraw the decision on the predisposition issue from the jury.\n\nA.\n\nThe size of the payments\n\nThe undisputed evidence shows that Schwartz, chairman of Philadelphia City Council, accepted a payment in cash of $30,000 from an F.B.I. agent posing as a representative of the sheik, that he looked inside the envelope, fingered the bills, and licked the envelope closed. The evidence also shows that Jannotti, a member of Philadelphia City Council, accepted a payment in cash of $10,000 from the same F.B.I. representative, that he placed the envelope in his pocket without opening it, and that he declined to discuss the amount of the payment, repeating several times \"We won't even discuss it.\"\n\nThe district court, without any reference to the record or any analysis of the issue, characterized the amounts offered as \"exceedingly generous\" and determined that \"the very amounts of the bribes were ... \"a substantial temptation to a first offense.' \" 501 F. Supp. at 1200. In effect, the district court held that no reasonable jury could have found predisposition from the defendants' on-tape conduct because of the nature of the inducement offered to the defendants.\n\nEven if the dollar amount offered were relevant to disprove predisposition, a question which we do not decide, we find nothing in the record to support the district court's conclusion that in today's inflationary times, city councilmen would view sums of $30,000 or $10,000 as so large or generous as to overcome an official's natural reluctance to accept a bribe. Certainly, the question of the generosity of the sums given must be viewed in relationship to the circumstances of the acceptors. What would be tempting to an office clerk would plainly not be enough to tempt a millionaire. Yet the record is almost bare of any evidence of the defendants' financial situations. What the record does disclose hardly suggests that either man was in dire straits financially. Schwartz was a practicing lawyer until 1970 or 1971 and, until that time, a partner of a large and active center city Philadelphia law firm. In his discussion with Wald, Schwartz stated:\n\nSCHWARTZ: And, uh, I was a senior partner in a very large law firm, but decided to give up the practice completely and sever my connections with the firm to devote full time to my councilmatic duties. I felt that, uh, it was the proper thing for me to do, for my own discretion. The then mayor, who is now out of office, Frank Rizzo, who was the former police commissioner. And, uh, you know, you think things out.\n\nWALD: Uh-hmm.\n\nSCHWARTZ: And fortunately, I didn't have to worry about earning a livelihood, I've, I've been a real estate lawyer, corporate practice real estate, administrative agency law....\n\nA694-95. Furthermore, Schwartz did not expect to keep the entire $30,000. As the district court found,\n\nHowever, Schwartz accompanied Criden to a meeting with the undercover agents on January 23, 1980, and the videotape of that meeting, together with other evidence, demonstrates that Schwartz knew he would be paid $30,000, and that the payment would be shared in some way with Criden.\n\n501 F. Supp. at 1198.\n\nJannotti, who in addition to his City Council salary also owned a bar, made a statement to an F.B.I. agent during the subsequent investigation that his bar made \"more than $10,000 and there would be no reason for him to take that kind of money.\" A925.\n\nIn United States v. Myers, 527 F. Supp. 1206 at 1229 (E.D.N.Y., 1981), the district court was faced with a similar issue and commented that today \"$50,000 is simply not an overpowering sum of money.\" It also noted that other legislators approached with bribes of sums greater than $30,000 found themselves capable of rejecting the offers. Id. at 1227-1229.\n\nThe jury was well aware of the amount of the bribes as well as the defendants' stations in life. Since there is nothing in the record to support the district court's conclusion that the amounts involved were, as a matter of law, so generous and enticing as to overcome any possible refusal by the defendants, the court's action in overturning the jury's resolution of this issue was plainly an intrusion on the jury's prerogative.\n\nB.\n\nThe \"benignity\" of the payments\n\nThe second of the three factors which the district court stressed in holding that the evidence was insufficient as a matter of law to establish that the defendants' acceptance of the money showed their predisposition was that \"the defendants would not be asked or expected to do anything improper on behalf of the proposed hotel venture\" and that \"they agreed to do nothing inconsistent with their obligations as members of the City Council, working for the benefit of their constituents.\" 501 F. Supp. at 1200. The district court stated that \"there was no suggestion that the putative sheik required or expected any violation of the law in exchange for the payment; he merely wished to be assured that he had \"friends' in high places.\" Id. at 1194.\n\nThere is a fundamental inconsistency in the district court's view of the evidence in this part of its opinion and the court's earlier statement in the same opinion that\n\n(t)here is no dispute about the defendants' receipt of the payments, and the evidence permitted, although it did not compel, the inference that the payments represented bribes paid in exchange for the defendants' assurances of using their official positions to pave the way for expeditious completion of the project.\n\n501 F. Supp. at 1184 (emphasis added). The district court never attempted to reconcile the two statements. It may be that the district court, in stating that defendants agreed to do nothing \"improper\", was referring to the defendants' repeated statements on tape that they assumed that the hotel was to be a legitimate venture and their frequent comments that the project would be good for Philadelphia. However, as the district court acknowledged, the evidence permitted the inference that the payments represented \"bribes\" to elected public officials in return for the use of their official positions. We fail to see how any court anywhere under any circumstances can fail to characterize a public official's acceptance of payment to \"pave the way for expeditious completion of the project\" as \"improper\".\n\nThe government argues that defendants' arrival at the hotel room after 10 o'clock in the evening to meet with total strangers, and the statements of Criden and Johanson indicating that Schwartz and Jannotti would be ready and willing to accept payments in return for political favors and that they had done so in the past, see, e.g., A497-500, support the jury's determination that the defendants were predisposed. However, even if we were to look only at the defendants' own statements and actions shown on the tapes, there is no justification for taking from the jury the question of the nature of defendants' undertaking.\n\nTo recapitulate some of the relevant evidence, early in the meeting at the Barclay Hotel between Schwartz, Wald and Criden, Wald made it clear that he was seeking political favors in connection with the hotel venture. Thus, whatever Schwartz' expectations actually were about the services he was to perform for the anticipated fee following Judge Shiomos' references to a \"consulting opinion\", a reasonable jury could have found that in the course of Schwartz' meeting at the Barclay it became clear that what was at stake was the exchange of future political favors by the President of Philadelphia's City Council for cash to be paid on the spot. See pp. 584-587 supra.\n\nFurthermore, in light of Schwartz' response to Wald's overture (\"we got five or six (city council) members that came in ... you tell me your birth date. I'll give them to you for your birthday,\" A695-6), a reasonable jury could find that Schwartz quickly dispelled any notion that he thought he was meeting Wald for legitimate \"consulting\" work. City Council members are simply not \"given\" as birthday gifts to prospective entrepreneurs as part of a \"consultation.\"\n\nThe evidence as to Jannotti, if not quite as strong as that against Schwartz, also could be construed by a reasonable jury as proving that the payment was made for political support, for Jannotti's vote, thereby belying any suggestion that it was made for \"friendship\". With Jannotti as with Schwartz, Wald explained \"I'm only here for one reason, to bring back some assurances,\" A849, and characterized the understanding between them as a \"cash business transaction\" in which Jannotti \"guaranteed ... that we don't have a problem in Philadelphia....\" A863. A reasonable jury could view the assurances given by Jannotti as his willingness to commit his City Council vote, A853-54, and to use his political influence. A863-67. See pp. 587-590 supra.\n\nThe district court stressed the concern expressed by both Schwartz and Jannotti that the project be \"legal\" and \"legitimate\". As the evidence shows, Schwartz expressed concern that the hotel was not to be used for immoral purposes, and Jannotti was concerned that the hotel was not to be used for gambling. While the defendants' statements may indicate their unwillingness to support the project if it were to be used for such illegal purposes, either because they were interested in Philadelphia's welfare or because such use would become a matter of public knowledge, they fail to negate the permissible inference that both men knew they were acting improperly in accepting money in return for their support and influence. As this court has previously held, it is neither material nor a defense to bribery that \"had there been no bribe, the (public official) might, on the available data, lawfully and properly have made the very recommendation that (the briber) wanted him to make.\" United States v. Labovitz, 251 F.2d 393, 394 (3d Cir. 1958). Judge Hastie, writing for the court, set forth the rationale for that holding:\n\nIt is a major concern of organized society that the community have the benefit of objective evaluation and unbiased judgment on the part of those who participate in the making of official decisions. Therefore, society deals sternly with bribery which would substitute the will of an interested person for the judgment of a public official as the controlling factor in official decision.\n\nId.\n\nThe district court, in discussing some of the evidence, stated that Schwartz' words and actions during the meeting, as disclosed on the videotape, could be interpreted to mean either \"that he was rendering legal advice and advice as an expert on city government and real estate development, in exchange for a consulting fee\" which would \"merely\" violate the City Charter's prohibition against conflicts of interest, or \"that he was accepting a bribe for assuring his official support of a project he would have been willing to support in any event.\" Id. at 1198.\n\nIn the posture of the case before us, we cannot accept the \"consulting fee\" view of the payment to Schwartz (no similar contention having been made as to Jannotti). It has often been stated by this court that a defendant who chooses to defend on the ground of entrapment must admit that there were present all the elements of the crime with which he or she was charged. United States v. Shoup, 608 F.2d 950, 964 (3d Cir. 1979); United States v. Levin, 606 F.2d 47, 48-49 (3d Cir. 1979) (per curiam); United States v. Watson, 489 F.2d 504, 507 (3d Cir. 1973). The district court adopted a restrictive view of the holdings in these cases by interpreting them as conditioning the entrapment charge on defendants' admission only of the operative facts. 501 F. Supp. at 1201. Subsequent to the district court's opinion, we considered whether an entrapment defense required admission of the relevant mens rea and stated that the entrapment defense \"requires admission of guilt of the crime charged and all of its elements, including the required mental state.\" United States v. Hill, 655 F.2d 512, 514 (3d Cir. 1981). Thus, our precedent suggests that since acceptance of a bribe was an element of the crime with which Schwartz was charged, Schwartz was required to forego the argument that receipt of the money was a benign \"consulting fee\" if he was to rely on the entrapment defense. But see United States v. Demma, 523 F.2d 981 (9th Cir. 1975) (en banc).\n\nThe other difficulty in the willingness of the district court to view the payments as benign is the obvious substitution of its view for that of the jury. As the district court recognized, the jury accepted the view that the payments were not \"consulting fees\" but were bribes. 501 F. Supp. at 1198-99. The jury was expressly instructed that it must determine whether each defendant understood that the money was being paid to influence his vote or conduct. The court charged:\n\nYou would ask yourselves at the conclusion of the transaction and in the totality of the circumstances: Did that particular defendant understand that money was being paid to him to influence his vote, to influence his conduct in his official position or was this a situation in which the defendant understood merely that the money was to be paid in order to enable the Sheik's representative to report back to the Sheik that he had made friends in accordance with the Arab way of doing business? That is, in the totality of the circumstances, both the defendant and the Arab representatives understood that the defendant had been bought and that his support or at least assurance of continuing support were based at least in part upon the fact that he had received the money or was this a situation in which it was understood between the representative and the defendant that there was no corruption involved, that this was simply something which was made necessary in order to encourage the Sheik to go ahead with the project but that as between the representatives and the councilmen it was understood that there was no corruption involved?\n\nA1358-59. In view of the jury's adverse determination that the payments were not for \"friendship\" but were to improperly influence defendants in the exercise of their official positions, the district court's substitution of its view of the evidence in deciding that as a matter of law there could be no predisposition represented an unfortunate usurpation of the jury's prerogative.\n\nC.\n\nThe \"contingency\" of the hotel project, i.e., \"the Arab mind\"\n\nThe final factor, and the one considered \"most important\" by the district court in its assessment of the \"overwhelm(ing)\" inducement offered by the F.B.I. agents posing as the sheik's representatives, was the fact, as described by the district court, that defendants were \"led to believe that if they did not accept the money, the project would not come to Philadelphia.\" 501 F. Supp. at 1200. The district court, in reviewing the entire undercover operation which has come to be known as ABSCAM, stated: \"Perhaps the crucial aspect of the undercover operation was its emphasis upon \"the Arab mind,' the \"Arab way of doing business.' A constant theme of the agents' representations was that their principals would not undertake any project unless first assured of the \"friendship' of the persons with whom they were dealing.\" Id. at 1194 (emphasis added).\n\nThis conclusion suffers from the failure to cite to evidence that any such representation was ever made to or communicated to defendant Schwartz. We have found no such evidence. In fact, early in the meeting between Schwartz and Wald, Schwartz was told that Philadelphia had already been selected:\n\nWALD: Well, what I have been instructed to do and the purpose for ah my visits to Philadelphia is to firm up uh, what we consider to be a major investment here and uh the gentleman cares to make a major investment here because he seems to like Philadelphia, and he has been told that it would uh be in his best interest to have an investment, uh, in an area where he, uh, would like to take up rather permanent residence and Philadelphia is it.\n\nA690.\n\nIn an effort to point to evidence which would support the district court's conclusion that Schwartz was led to believe that if defendants did not accept the money the project would not come to Philadelphia, Schwartz refers to statements by Wald that his employer was interested in Philadelphia, had to be \"happy\", wanted to \"take care of any potential problems long before they exist\" and remarks regarding the need for \"assurances.\" Schwartz has not, nor have we, found any statement in which Wald made the representation to Schwartz that the project was contingent on his acceptance of the money. While Wald may have made representations to others that the hotel project was contingent, we have not been referred to any evidence that such statements were communicated to Schwartz. If Criden were supposed to be the alleged conduit, he failed to testify to that effect since, notwithstanding the grant of defense immunity to Criden, neither the defendants nor the government called him as a witness.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nIt may be that the district court, aware of similar representations with regard to the \"Arab mind\" which were made to other ABSCAM participants, interpolated them as to Schwartz. Whatever the explanation, since this was the \"most important\" factor to show that the appeal to civic duty was too overwhelming an inducement for any public official to resist, once this factor is negated, the house of cards built upon it collapses.\n\nWith regard to Jannotti, there is no question that a reference to the \"Arab mind\" was made to him, and that Wald also represented that this \"is the method of business that these people are use (sic) to, and that is how they conduct business ....\" A860. See pp. 588-589 supra. Whether these statements can be construed as a representation that only if Jannotti accepted the money would the hotel come to Philadelphia is somewhat questionable. Such a conclusion is even more equivocal in light of the following colloquy which took place before the reference to the \"Arab mind\":\n\nJANNOTTI: Who could refuse a project like that?\n\nWALD: Nobody could, that's my point, alright, but I've been told the City of Philadelphia is where this, ah, this construction project is going. I mean this is where he is going to be. This is where he wants it ....\n\nA852 (emphasis added). Later in the meeting Wald reiterated that \"Philadelphia has already been sold, to the man.\" A876. See also A864, A880. Thus, even as to Jannotti, at most the evidence presents the basis for differing arguments to the jury as to the interpretation to be placed on the conversations.\n\nIn fact, the issue was presented to the jury. The district court instructed on this precise issue as follows:\n\n... depending on how you interpret the testimony, you might draw the inference that the net effect of the totality of the circumstances considering everything that the agents said in the course of these meetings the defendants were led to believe that unless they were willing to accept money and give assurances this hotel project would not be coming into Philadelphia.... Depending upon how you interpret what was said you could draw either conclusion, and it is up to you to decide which one is appropriate ....\n\nA1355-56. The decision of the jury, adverse to the defendants, demonstrates its resolution of the differing inferences which might be drawn.\n\nD.\n\nAcceptance of the money by Schwartz and Jannotti\n\nTo summarize, the district court found that the acceptance of the money by Schwartz and Jannotti was insufficient evidence of their predisposition to take bribes because the government offered \"such attractive inducements\" as were bound to overwhelm. 501 F. Supp. at 1200. We conclude that the jury could have found that the evidence fails to show \"such attractive inducements\" as would overwhelm most honest, responsible public officials, no matter how deep-seated their civic duty. Thus, we return to the initial proposition, that the acceptance of the money itself may be sufficient to show predisposition.\n\nIn certain types of crimes, it is often possible for the government to show predisposition by proof of the defendant's prior convictions or his or her participation in similar transactions. See, e.g., United States v. Ordner, 554 F.2d 24, 28 (2d Cir.), cert. denied, 434 U.S. 824, 98 S. Ct. 71, 54 L. Ed. 2d 82 (1977); United States v. Lemons, 470 F.2d 135 (3d Cir. 1972) (per curiam), cert. denied, 412 U.S. 929, 93 S. Ct. 2758, 37 L. Ed. 2d 157 (1973). Such evidence would be extremely difficult to produce in the case of acceptance of a bribe by a public official. Because such officials are often intelligent, educated and worldly, it is unlikely that they will accept money from those to whom they have not had \"safe\" introductions and who, because they are also implicated, are unlikely to report to the authorities. In addition, because the crime has no direct victim, its occurrence leaves no public trail which cries for investigation. Since the ultimate factual determination is whether the defendant was \"ready and willing to commit the crime if an opportunity should be presented,\" as distinguished from having been \"corrupted by some overreaching or special inducement,\" United States v. Watson, 489 F.2d 504, 509 (3d Cir. 1973), the very acceptance of a bribe by a public official may be evidence of a predisposition to do so when the opportunity is presented.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nIn resolving the issue of predisposition, the jury must determine the defendant's subjective intent. Except in unusual cases, intent can be proven only through circumstantial evidence. The factors ordinarily relevant to the jury's inquiry, particularly the defendant's words and mannerisms at the time of the offense, are generally available only through the testimony of one or more of the participants. The jury has no opportunity to hear the voice inflections or see the mannerisms of the participants. This case is unique in that through the videotape the jury could observe the entire criminal transaction and many of the events leading up to it. It could observe whether the defendants demurred or showed any reluctance when the money was handed to each of them. The jury could observe the amount of pressure, overt or tacit, if any, placed on the defendants to accept the bribes. In short, this jury had in its hands some of the most valuable tools possible with which to conduct its inquiry into the state of mind of each defendant, the crucial factor in an entrapment defense.\n\nThe Ninth Circuit recently reviewed the factors which must be considered in determining predisposition, and concluded that, \"(w)hile none of the factors alone indicates either the presence or absence of predisposition, the most important factor, as revealed by Supreme Court and other decisions, is whether the defendant evidenced reluctance to engage in criminal activity which was overcome by repeated Government inducement.\" United States v. Reynoso-Ulloa, 548 F.2d 1329, 1336 (9th Cir. 1977), cert. denied, 436 U.S. 926, 98 S. Ct. 2820, 56 L. Ed. 2d 769 (1978). The court stated, \"We have found no case in which the defense of entrapment (as opposed to cases dealing with due process principles) was successful where the defendant had not indicated reluctance to engage in illegal activity.\" Id. at 1336 n.11.\n\nThe facts of this case are unlike any of the few in which the entrapment defense has been successful. In United States v. Klosterman, 248 F.2d 191, 193 (3d Cir. 1957), the government contacted a reluctant intermediary eleven times before he agreed to make the necessary introduction. The other defendant in Klosterman was, as the subject of an IRS investigation which had been continuing \"for an unusual length of time,\" under anxiety and therefore \"more susceptible\" to the government's persuasion. Id. at 196. In Sorrells v. United States, the agent \"lured\" defendant by \"repeated and persistent solicitation in which he succeeded by taking advantage of the sentiment aroused by reminiscences of their experiences as companions in arms in the World War.\" 287 U.S. at 441, 53 S. Ct. at 212. In Sherman v. United States, the defendant, after rebuffing numerous requests by the government agent, finally relented and sold drugs to the agent, who had played upon the defendant's sympathy by predicating his request upon his suffering from lack of narcotics. 356 U.S. at 373, 78 S. Ct. at 821. See Wall v. United States, 65 F.2d 993 (5th Cir. 1933). The situation here is obviously not analogous. Defendants in this case point to no statements or gestures which indicate any reluctance whatsoever to accept the proffered payments.\n\nAlthough we have concentrated primarily on defendants' acceptance of the payments to demonstrate that predisposition was a jury issue, even were we to disregard certain other evidence relied on by the government to which defendants vigorously object, there was additional evidence which the jury may have credited in finding predisposition. Ellis Cook, a lawyer associated with Criden, testified that Criden told him that he had given money to Schwartz in return for Schwartz' introducing him to Jannotti. A607. This payment of what might be considered a \"finder's fee\" was made to Schwartz shortly after he had received the $30,000 payment from the agents. Schwartz' acceptance of a payment for introducing Criden to Jannotti, another public official, so that Jannotti could participate in a similar transaction could be considered by the jury to demonstrate that he was disposed to wrongdoing.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e See United States v. Dickens, 524 F.2d 441, 445 (5th Cir. 1975), cert. denied, 425 U.S. 994, 96 S. Ct. 2208, 48 L. Ed. 2d 819 (1976) (defendant evidenced predisposition by \"introducing his co-defendants to the prospective buyer\").\n\nA former law partner of Schwartz testified that Schwartz described the sheik's representative to him as being \"a bright, capable individual who came prepared ....\" A814. The jury might have inferred that Schwartz' failure to describe the representative as overbearing was further evidence that Schwartz did not, even in retrospect, view the transaction as one in which his will had been overborne.\n\nIn addition to its jury instructions on the entrapment defense in general, the district court in its charge placed special emphasis on, and specifically placed before the jury for its consideration, some of the very questions of fact which that court later resolved differently than did the jury. Portions of that charge have been set forth above. When the district court advised the jury that it could find predisposition solely from the fact that a defendant was ready and willing to commit the offense for which he was currently on trial, the court cautioned that,\n\nin order to find predisposition based merely upon the fact that the defendant did in fact commit the crime he was induced to commit it is very important that you compare and analyze the issue of the alacrity with which a defendant joined the enterprise versus the extent of the inducement which was offered to him.\n\nA1363.\n\nAfter being carefully and specifically instructed on the significant factual issues in this case, the jury found the defendants guilty, thereby rejecting the entrapment defense. Its verdict represents a finding that, based on the totality of the evidence, including the observations by the jury of the actions, words, voice inflections and mannerisms of the defendants and the F.B.I. agents, the defendants were predisposed to engage in political corruption. The jury's verdict also represents a rejection of the notion that appellant Schwartz believed the $30,000 payment was a \"consulting fee\", as well as a rejection of the argument that the defendants were led to believe that the payment of money was simply to enable the representatives to report back to the sheik that they had made friends in accordance with the \"Arab way\" of doing business. Finally, it represents a rejection of defendants' argument, accepted by the district court, that the defendants were led to believe that unless they took the payments the hotel project would not come to Philadelphia.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e The dissent's passionate grandiloquent essay on judicial responsibility and courage simply glosses over the salient fact which is inescapable because of the videotape record: defendants accepted the money readily, unprotestingly, even casually, without ever once attempting to use their consummate political skill to say, as diplomatically as the circumstances required, \"Thanks, but no thanks.\"\n\nThe ultimate factual decisions in an entrapment case must be left to the jury. Where, as here, the jury was uniquely equipped to inquire into the calculus of human interaction, a court should not interfere with its conclusions. We conclude that in determining that defendants were entitled to a judgment of acquittal on the ground of entrapment as a matter of law the district court impermissibly substituted its own determination of the credibility of witnesses, the weight of the evidence and the inferences to be drawn from the evidence for that of the jury.\n\nIV.\n\nDUE PROCESS\n\nAs an alternate ground for the entry of judgment of acquittal for both defendants, the district court held that the extent of government overreaching in this case amounted to a deprivation of the defendants' due process rights. In arguing for a reversal, the government does not contend that the district court erred in assuming that such a defense would be available in appropriate circumstances even to predisposed defendants or that it erred in articulating the legal standard by which to determine whether government conduct has passed the line of \"fundamental fairness.\" Instead, the government argues that the district court erred in its application of the appropriate legal standard.\n\nIf the contours of the entrapment defense are imprecise, we have at least been able to make an effort to delineate them. A similar delineation of the conduct circumscribed by the due process defense is, at best, elusive. Part of the difficulty stems from the differing views by those who must interpret the constitutional standard as to what are \"immutable and fundamental principles of justice.\" See Rochin v. California, 342 U.S. 165, 176, 72 S. Ct. 205, 211, 96 L. Ed. 183 (1952) (Black, J., concurring). The other difficulty lies in a tendency for the due process defense to overlap with the entrapment defense, notwithstanding the Supreme Court's clear admonition that they are separate and distinct.\n\nIn United States v. Russell, the Supreme Court, while firmly rejecting the defendants' effort to define the entrapment defense in terms of the government's conduct rather than the defendant's state of mind, nonetheless accepted that in certain extreme cases \"the conduct of law enforcement agents (may be) so outrageous that due process principles would absolutely bar the government from invoking judicial processes to obtain a conviction.\" 411 U.S. at 431-32, 93 S. Ct. at 1642-43. When the issue arose again, however, three years later in Hampton v. United States, the eight Justices who considered the case divided into three groups. The plurality opinion, written by Justice Rehnquist for three Justices, rested on the position that once predisposition has been shown, governmental misconduct can never be used to overturn a conviction, since the \"remedy of the criminal defendant with respect to the acts of Government agents ... lies solely in the defense of entrapment,\" and a predisposed defendant is foreclosed from arguing entrapment. 425 U.S. 484 at 488-90, 96 S. Ct. 1646 at 1649-50, 48 L. Ed. 2d 113 . There is some language in that opinion which may be read to question the availability of any due process defense: \"If the police engage in illegal activity in concert with a defendant beyond the scope of their duties the remedy lies, not in freeing the equally culpable defendant, but in prosecuting the police under the applicable provisions of state or federal law.\" Id. at 490, 96 S. Ct. at 1650.\n\nTwo Justices, in an opinion written by Justice Powell, concurred in affirming the conviction by rejecting both the entrapment defense and the applicability of a due process defense to the facts shown. The dissenting opinion of Justice Brennan, for the remaining three Justices, focused on the \"egregious\" government conduct, and viewed the facts of the case as presenting an instance of the \"sufficiently offensive\" governmental conduct contemplated in Russell. Id. at 497, 96 S. Ct. at 1653.\n\nAlthough the two concurring Justices whose opinion was pivotal agreed with the plurality that the government's supplying of contraband to one later prosecuted for trafficking in contraband does not constitute a per se denial of due process, 425 U.S. at 491, 96 S. Ct. at 1650 (Powell, J., concurring), they disagreed with the plurality view that \"the concept of fundamental fairness inherent in the guarantee of due process would never prevent the conviction of a predisposed defendant, regardless of the outrageousness of police behavior in light of the surrounding circumstances.\" Id. at 492, 96 S. Ct. at 1651. Thus, a majority of the Court, composed of the three dissenting Justices and the two concurring Justices, has rejected the position \"that the defense of entrapment necessarily is the only doctrine relevant to cases in which the Government has encouraged or otherwise acted in concert with the defendant.\" Id. at 492 n.2, 96 S. Ct. at 1651 n.2. Justice Powell emphasized, however, that \"the cases, if any, in which proof of predisposition is not dispositive will be rare,\" and that \"police overinvolvement in crime would have to reach a demonstrable level of outrageousness before it could bar conviction.\" Id. at 495 n.7, 96 S. Ct. at 1652 n.7.\n\nWe have in a prior opinion construed the language of Russell and Hampton to signify that \"fundamental fairness will not permit any defendant to be convicted of a crime in which police conduct was \"outrageous.' \" United States v. Twigg, 588 F.2d 373, 379 (3d Cir. 1978). In Twigg, the first case since Hampton in which a defendant prevailed on a due process defense, a divided panel of this court held that \"the governmental involvement in the criminal activities of this case has reached \"a demonstrable level of outrageousness.' \" Id. at 380. In the case before us, the district court held that Twigg compelled a comparable result. The district court based this conclusion in large measure on the inducements to which the defendants had been subjected, holding that \"it is neither necessary nor appropriate to the task of ferreting out crime for the undercover agents to initiate bribe offers, provide extremely generous financial inducements, and add further incentives virtually amounting to an appeal to civic duty.\" 501 F. Supp. at 1204. These were the same factors on which the district court relied in its determination that defendants had not been shown to be predisposed and, hence, were entrapped as a matter of law.\n\nIt is plain from the Court's opinion in Russell and the separate opinions in Hampton, however, that a successful due process defense must be predicated on intolerable government conduct which goes beyond that necessary to sustain an entrapment defense. The genesis of the entrapment defense lay in the Court's interpretation of legislative intent; \"since the defense is not of a constitutional dimension, Congress may address itself to the question and adopt any substantive definition of the defense that it may find desirable.\" United States v. Russell, 411 U.S. at 433, 93 S. Ct. at 1643 (footnote omitted). We must necessarily exercise scrupulous restraint before we denounce law enforcement conduct as constitutionally unacceptable; the ramifications are wider and more permanent than when only a statutory defense is implicated.\n\nWe must be careful not to undermine the Court's consistent rejection of the objective test of entrapment by permitting it to reemerge cloaked as a due process defense. While the lines between the objective test of entrapment favored by a minority of the Justices and the due process defense accepted by a majority of the Justices are indeed hazy, the majority of the Court has manifestly reserved for the constitutional defense only the most intolerable government conduct. Here, the district court focused on the nature of the government inducements in finding a due process violation. Since we have already decided that these inducements were not so \"exceedingly generous\" as to negate the evidence of predisposition as a matter of law, it follows that they could not have been so overreaching as to violate the defendants' due process rights. Under the view of a majority of the Supreme Court, a finding of no entrapment does not preclude the availability of a due process defense; nonetheless, where, as here, the extent of government inducement necessarily was considered by the factfinder in its rejection of the entrapment defense, and we have held that issue as appropriately submitted to the jury, a successful due process defense must be predicated on other grounds.\n\nThe facts shown in Twigg, on which the district court relied, are not comparable to the government activity in this case. There, the government initiated and was actively involved in the operation of the criminal enterprise itself. As we summarized the facts:\n\nAt the behest of the Drug Enforcement Agency, Kubica, a convicted felon striving to reduce the severity of his sentence, communicated with Neville and suggested the establishment of a speed laboratory. The Government gratuitously supplied about 20 percent of the glassware and the indispensable ingredient, phenyl-2-propanone. It is unclear whether the parties had the means or the money to obtain the chemical on their own. The DEA made arrangements with chemical supply houses to facilitate the purchase of the rest of the materials. Kubica, operating under the business name \"Chem Kleen\" supplied by the DEA, actually purchased all of the supplies with the exception of a separatory funnel. (The funnel was secured by Twigg at the direction of Kubica who was engaged in operating the laboratory.) When problems were encountered in locating an adequate production site, the Government found the solution by providing an isolated farmhouse well-suited for the location of an illegally operated laboratory. Again, there was no cost to the defendants. At all times during the production process, Kubica was completely in charge and furnished all of the laboratory expertise. Neither defendant had the know-how with which to actually manufacture methamphetamine. The assistance they provided was minimal and then at the specific direction of Kubica.\n\n588 F.2d at 380-81. Thus, in Twigg, it was the DEA agents who \"set up\" the defendant, \"encouraged him\" and \"provided the essential supplies and technical expertise.\" Id. at 381. In contrast, in this case the F.B.I. provided neither material nor technical assistance to the defendants; it merely created the fiction that it sought to buy the commodity-influence-that the defendants proclaimed they already possessed. In that respect, this case differs from Twigg, Hampton, and other drug-related cases, where the government is often involved on both the buying and selling sides of the transaction. See Hampton v. United States, 425 U.S. at 498, 96 S. Ct. at 1654 (Brennan, J., dissenting); United States v. West, 511 F.2d 1083, 1085 (3d Cir. 1975). This is also not a case where the government's involvement in criminal activity has caused injury to third persons or extended beyond \"the very activity for which the defendant(s) (were) prosecuted,\" factors emphasized by Judge Friendly in dictum in United States v. Archer, 486 F.2d 670, 675, 676-77 (2d Cir. 1973).\n\nDefendants argue that both the initiation of the Philadelphia phase of the investigation and the subsequent approach to them constituted \"outrageous\" conduct in that the government had no reasonable basis to believe that such tactics would uncover criminal activity. We find this unpersuasive on both legal and factual grounds. The Second Circuit has recently indicated that there is no constitutionally-imposed requirement of reasonable suspicion before an undercover operation such as ABSCAM can be commenced. United States v. Myers, 635 F.2d 932, 941 (2d Cir.), cert. denied, 449 U.S. 956, 101 S. Ct. 364, 66 L. Ed. 2d 221 (1980). We have held, at least in the context of entrapment, that \"it is inconsequential whether law enforcement officials did or did not act on well-grounded suspicion that the defendant was engaging in wrongdoing, or whether they had probable cause for approaching the defendant.\" United States v. Silver, 457 F.2d 1217, 1220 (3d Cir. 1972) (emphasis in original; footnote omitted). Where the conduct of the investigation itself does not offend due process, the mere fact that the investigation may have been commenced without probable cause does not bar the conviction of those who rise to its bait.\n\nIn any event, there is no evidence that the government targeted either Schwartz or Jannotti in advance. Their names emerged from discussions with Criden on whom the government relied for \"Criden's proven ability to enlist corrupt politicians,\" particularly those with a connection to the Philadelphia area. Brief for Appellant at 49. Whether or not Criden had a reasonable basis for representing that Schwartz and Jannotti would be willing to \"take a hot stove,\" A499, such representations provided the government with a reasonable basis for the initiation of the bribe offers made to them. As the district court found, \"Criden assured the agent that, unless each individual agreed in advance to accept the money, no meeting between the representative and that individual would be arranged.\" 501 F. Supp. at 1197. The government's use of a middleman to bring forward corruptible officials refutes defendants' contention that they were unfairly targeted in advance by the government investigators.\n\nThe due process defense has been raised primarily in cases where defendants are accused of involvement in narcotics traffic. No federal judge can be unaware of the vastness of government undercover operations which seek to apprehend those engaged in that reprehensible trade. As Justice Powell commented in the dispositive opinion in Hampton, 425 U.S. at 495-96 n.7, 96 S. Ct. at 1652-53 n.7:\n\nOne cannot easily exaggerate the problems confronted by law enforcement authorities in dealing effectively with an expanding narcotics traffic ... which is one of the major contributing causes of escalating crime in our cities.... Enforcement officials therefore must be allowed flexibility adequate to counter effectively such criminal activity.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nOfficial corruption, in the form of bribery and extortion involving public officials, can, like the narcotics sales involved in Hampton, easily elude detection, since both parties to the transaction have an interest in concealment. Indeed, bribery may be even more difficult to uncover than drug deals. United States v. Myers, 527 F. Supp. 1206 at 1230-1231 (E.D.N.Y., 1981). A determination of what undercover operations are necessary to discover and expose corruptible public officials must be left, in the first instance, to that branch of government which has the responsibility for maintenance of public order. Unless the behavior of the F.B.I. agents rose to that level of outrageousness which would bar conviction, the conduct of agents of the executive branch who must protect the public from crime is more appropriately considered through the political process where divergent views can be expressed in the ballot box.\n\nThe district court's distaste for the F.B.I.\"s ABSCAM operation is evident from its opinion. In referring to \"the extent to which the agents were prepared to go\", the district court relied on the actions of F.B.I. agents in other phases of the ABSCAM operation which related to other defendants having no connection with Schwartz and Jannotti. 501 F. Supp. at 1194-95. We have been clearly instructed, however, that the due process inquiry must focus only on the actions of the F.B.I. insofar as they related to Schwartz and Jannotti. Thus, in his opinion in Hampton, Justice Rehnquist remarked, \"The limitations of the Due Process Clause of the Fifth Amendment come into play only when the Government activity in question violates some protected right of the defendant.\" 425 U.S. at 490, 96 S. Ct. at 1650 (emphasis in original). See United States v. Payner, 447 U.S. 727, 737 n.9, 100 S. Ct. 2439, 2447 n.9, 65 L. Ed. 2d 468 (1980). We do not, in this case, pass upon the nature of the F.B.I.\"s conduct as to any defendant other than the two who are before us on this appeal. As to them, the impropriety of government conduct on which the district court relied in granting the motions for acquittal was limited to the evidence of government instigation and inducement, which, as we have already indicated, did not reach the \"demonstrable level of outrageousness\" necessary to compel acquittal.\n\nIn reversing the district court's judgment of acquittal on the ground of a due process violation, we do not place our imprimatur either of approval or disapproval on the government's conduct. As citizens, we have differing views of the necessity or advisability of the entire ABSCAM project. As judges, however, we rule only on whether the limits which the Constitution places on another branch of government have been exceeded. We find that the government's conduct as to these two defendants did not violate their due process rights, and that therefore the district court's judgment of acquittal on this ground must be reversed.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nV.\n\nMANUFACTURED JURISDICTION\n\nThe final basis for the district court's judgment of acquittal was that \"the circumstances relied upon to establish federal jurisdiction over the offenses charged were artificially created by the Government in an attempt to exceed the proper scope of federal law enforcement.\" 501 F. Supp. at 1205. In support of an acquittal on this basis, the district court relied on the rationale used in United States v. Archer, 486 F.2d 670 (2d Cir. 1973). The holding in Archer is more limited than the concept for which it was cited by the district court. In reversing convictions under the Travel Act, the Archer court held that, as a matter of statutory construction, the use of interstate and foreign telephone facilities did not suffice to bring the defendants within that statute. The statutory infirmity was that the three interstate phone calls relied upon to establish jurisdiction under the Travel Act were insufficiently related to the criminal activity charged or had been arranged by the federal agents for the sole purpose of providing the necessary federal nexus. Under those circumstances, the Second Circuit held that the phone calls were insufficient to transform a \"federally provoked incident of local corruption into a crime against the United States.\" 486 F.2d at 683. The court explicitly declined to dismiss the prosecution as an abuse of federal power, although it made plain that its holding reflected its misgivings as to whether the facts showed any basis for a substantial federal interest.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nIn contrast, in this case, we have already sustained jurisdiction under the Hobbs Act because of the substantial federal concern in protecting interstate commerce from conspiracies such as that at issue here, and the district court held that the elements of the RICO charge as to Schwartz had been properly established. 501 F. Supp. at 1186-87. These holdings necessarily indicate the sufficiency of the federal interest presented under the facts here.\n\nThe narrow reach of Archer can also be gleaned from the Second Circuit's own construction of it in United States v. Gambino, 566 F.2d 414, 419 (2d Cir. 1977), cert. denied, 435 U.S. 952, 98 S. Ct. 1580, 55 L. Ed. 2d 802 (1978). In Gambino, the court sustained the conviction of defendants under, inter alia, the Hobbs Act and RICO over the objection of defendants that jurisdiction had been contrived by the F.B.I.\"s creation of an undercover garbage collection business for the purpose of trapping the suspected racketeers. The court pointed out that in Archer the phone calls \"were purposely made in order to create an interstate element for what would otherwise have been merely a local crime.\" Id. at 419. Although the F.B.I.\"s garbage business in Gambino, unlike the hotel project involved here, actually engaged in interstate commerce by obtaining equipment from Texas and arranging to dump its garbage in New Jersey, the court in Gambino indicated that its decision upholding jurisdiction did not turn on that fact, stating that \"since the garbage collection business in the Bronx was sufficiently related to interstate commerce ..., it was really unnecessary for the federal agents actually to buy machinery or to dump garbage outside the state. The ruse itself was not objectionable, and the allegedly spurious out-of-state involvement was in any event, irrelevant.\" Id.\n\nWe view the district court's judgment of acquittal on the grounds of manufactured jurisdiction as essentially an amalgam of its determinations that jurisdiction under the Hobbs Act was insufficient and that the entire ABSCAM operation involved federal overreaching. Since we have already found that neither of these holdings can be sustained, we believe that the circumstances of this case do not warrant acquittal on the independent basis of manufactured jurisdiction.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nVI.\n\nConclusion\n\nIn summary, we have closely examined each of the bases on which the district court reversed the defendants' convictions, the relevant evidence, and the applicable law. We conclude (1) there was jurisdiction under the Hobbs Act; (2) the evidence of defendants' predisposition was sufficient to support the jury's conclusion of no entrapment; (3) the conduct of the government agents as to Schwartz and Jannotti did not violate their due process rights; and (4) there was no basis on which to direct an acquittal on the ground of manufactured jurisdiction. For the foregoing reasons, we will reverse the district court's order of November 26, 1980 dismissing Count III of the indictment and granting judgments of acquittal, and direct reinstatement of the jury's verdict.\n\nALDISERT, Circuit Judge, dissenting, with whom WEIS, Circuit Judge joins, with the exception of Part VII.\n\nThe division of the court in this extremely important entrapment case reflects fundamental and irreconcilable differences in the values attached to two primary integrants of the American tradition of justice:\n\nTo what extent should federal judges assume the responsibility for protecting American justice traditions, and to what extent should judges delegate this responsibility to the jury?\n\nTo what extent should federal judges endorse tactics of the kind used by the Federal Bureau of Investigation in this case?\n\nThe majority opinion reads like a paean to the FBI for its conduct in this case; but as an American citizen and as a federal judge, I find that conduct revolting. I agree completely with Justice Holmes:\n\nIt is desirable that criminals should be detected, and to that end that all available evidence should be used. It also is desirable that the Government should not itself foster and pay for other crimes, ... We have to choose, and for my part I think it a less evil that some criminals should escape than that the Government should play an ignoble part.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThe FBI has a long and proud history. It has earned the admiration and respect of the American people for its efficiency and fairness. The accomplishments of its agents have been dramatically portrayed in books and on the screen. But like all human institutions it is subject to the frailties of man. Under its distinguished director William H. Webster the instances in which it has been faulted for its conduct indeed have been few in number, and in that we may take great satisfaction. One reason for the low incidence of aberrational conduct has been the sense of responsibility of the Bureau's men and women. An additional restraint has been the knowledge that the courts, in administering the criminal justice system, would scrutinize the agents' activities. The chief deterrent, however, perhaps is the resolve shared by agents, judges, and the public that the FBI not become an American version of the secret police so infamous in many countries.\n\nI.\n\nA.\n\nWe judges come to our robes bearing the stigmata of our respective experiences. I readily confess that being born to an immigrant father and reared in a Western Pennsylvania community peopled largely by European immigrants and their children placed indelible impressions on me at an early age. The religious and political refugees who came to this land at the turn of the century had much to fear from the old country's secret police, but one of the greatest abhorrences was the agent provocateur, a person employed to pretend sympathy with members of a group and incite them to illegal action, and thus to expose them to apprehension and punishment. From my childhood I remember stories told in broken English by gnarled refugees from Russia, the Ukraine, and Poland, recounting in graphic detail the abuses inflicted upon them in peasant villages by the Ochrana, the secret police of the Czar.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Lacking the personal drama, but nevertheless equally authoritative, were academic studies and news accounts of the later operations of the OGPU, the dreaded secret police of the Stalinist era.\n\nThe apogee of government artifice, guile, and deceit was reached with the formation of the Gestapo in Nazi Germany. The story of the Holocaust is an account of the agent provocateur at his ruthless worst. It is an account of fraudulent representations to determine the identity of Jews, of cajoling incrimination of father by son and son by father, of lies about the purpose of detention and detention camps, \"Arbeit Macht Frei\" (\"Work Will Set You Free\"), and of gas chambers disguised as shower rooms. Such spectres cannot be easily exorcised.\n\nThe Gestapo were the consummate users of the \"honey pot,\" a technique government witness Melvin Weinberg proudly described as the technique the government utilized in this case.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The FBI employed the honey pot through a secret agent who, by ostentatiously flashing and giving away wads of money, would attract both the wary and the unwary, the scrupulous and the unscrupulous. Having attracted, the honey pot would serve also to capture those who were willing, that is, predisposed, to make the flight to the honey in the first place, as well as those who would have been unwilling, but who made the flight to the pot only because of the strength of the lure. But this trap was particularly selective: the operators of this honey pot personally selected those who could share the sweet stuff. The party was by invitation only; when the guests came to the pot it was not necessary for them to ask for a sample; rather, their mouths were opened for them and the honey poured down their gullets.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nMoreover, it is no longer open to question that the ABSCAM operation was deliberately leaked to the press. See United States v. Criden, 633 F.2d 346, 348 (3d Cir. 1980), cert. denied sub nom. Schaffer v. United States, 449 U.S. 1113, 101 S. Ct. 924, 66 L. Ed. 2d 842 (1981). I agree with Professor Paul Chevigny of New York University:\n\n(T)he power to tempt into crime and then to leak the story is a particularly potent combination. Once the authorities have selected the target of their investigation, they can make the charge \"stick\" in the press, regardless of how much temptation was offered, regardless of whether the courts would recognize a defense, and regardless of the reason the victim was chosen.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nTo the Department of Justice, its operation was a taste of honey; to me, it emanates a fetid odor whose putrescence threatens to spoil basic concepts of fairness and justice that I hold dear.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e That the FBI has earned high praise for its performance in the traditional discharge of its duties should not immunize the secret police tactics employed in its ABSCAM operation from appropriate and vigorous condemnation. If we fail to correct when necessary, we do no favors to those who have erred.\n\nB.\n\nThe majority allow the entrapment question in this case to be resolved by a lay jury. As staunchly as I believe that the jury, reflecting the conscience of the community, should be society's instrument for resolving controverted facts once a minimum legal threshold has been established, I stoutly believe also that the jury, untrained in the law, should never be called upon to design and construct that threshold.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e This is precisely what the majority have done here. They permit the jury to perform a responsibility which by law and by formal commission belongs to the judges of the Third Article.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nDefining the precise division of authority in the judge-jury relationship is always a sensitive and delicate responsibility. Where the defense of entrapment is interposed, however, the responsibility is appreciably intensified. The mere submission to the jury may present the jury with a Hobson's choice as to the defendant, because the entrapment defense requires the defendant to admit the commission of deeds which, but for their inducement by the government, would constitute the commission of a crime. A lay jury conditioned by years of published criticism of judges \"who let the guilty go free on a technicality\" may well be reluctant to give effect to the defense.\n\nIn our American legal tradition the jury has but one function-to resolve controverted facts. I defend this simple thesis: There was not one fact, controverted or otherwise, or resulting inference that allowed the submission of the entrapment issue to the jury. Although one can fashion a lengthy and tortuous argument that, under the facts here, the entrapment issue was properly submitted to the jury, I am not willing to have basic precepts of the American legal tradition so papered by reams of irrelevancies that only a jurisprudential masquerade is left for the viewing. I would hold, based on all the testimony, crediting specially that of the government and drawing all reasonable inferences in its favor, that there was inducement as a matter of law and that a reasonable jury could not conclude that the government proved beyond a reasonable doubt that the defendants were predisposed to commit the crime. Under these circumstances, there was no jury question. Under these circumstances, there were no controverted facts for the jury to resolve. Under these circumstances, \"it is as fatal as it is cowardly to blink facts because they are not to our taste.\"\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nIn my approach to this case, I acknowledge that transgressors must be punished for conduct that violates legal standards, but I place a restriction on this abstract theory: those who receive society's commission to go forth and capture transgressors may not themselves transgress. A free society can exist only to the extent that those charged with enforcing the law respect it themselves. \"There is no more cruel tyranny than that which is exercised under cover of the law, and with the colors of justice.\"\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e The law enforcers may themselves offer inducements to transgress if, and only if, the persons so induced were predisposed to violate the law and the offered inducements provided only the opportunity to act on their predispositions. A society cannot long remain free if we permit the law enforcer to offer more than opportunity for transgression; a free society cannot and will not endure if it permits law enforcers to select individuals arbitrarily, and then to proceed by deception to persuade, cajole, entice, and implant a law-breaking disposition that was not theretofore present. Just as we will not admit into evidence a statement obtained by police methods that overbear or overwhelm the will, even if it admits to the commission of a crime, Fikes v. Alabama, 352 U.S. 191, 77 S. Ct. 281, 1 L. Ed. 2d 246 (1957); Brown v. Mississippi, 297 U.S. 278, 56 S. Ct. 461, 80 L. Ed. 682 (1936), we refuse to deem as an offense against society conduct resulting from ideas which police deliberately implanted in the mind of the actor, Sherman v. United States, 356 U.S. 369, 78 S. Ct. 819, 2 L. Ed. 2d 848 (1958); Sorrells v. United States, 287 U.S. 435, 53 S. Ct. 210, 77 L. Ed. 413 (1932).\n\nFederal public policy, and, indeed, basic social policy, dictate that it is better to let a technical transgressor go free than to allow federal law enforcement officials to manufacture crime that entraps the unwary innocent. The predicate of this public policy against entrapment is threefold. First, it recognizes the awesome power of the financial and personnel resources at the disposal of federal law enforcement authorities. Second, reflecting the Judeo-Christian understanding that weakness has inhered in mankind since the days of Adam, it appreciates that even the most morally scrupulous members of society can be persuaded to breach behavioral standards if presented with sufficiently tempting inducements. Third, it acknowledges that a line can be drawn that will permit the proper use of government resources to identify and prosecute the wrongdoer and at the same time serve as an instrument to prevent abuse of those resources. If the government presents temptations, small or large, but the defendant is predisposed to succumb to them, then the government's conduct is usually permissible;\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e if the defendant is not predisposed, then the government's conduct is beyond the pale.\n\nThe majority and I differ upon where to draw that line and upon the relative competences of judges and juries to protect society from secret police excesses. The majority's superbly crafted essay selects assorted legal precepts and then unerringly extends \"a maxim or a definition with relentless disregard of consequences to \"a dryly logical extreme.' \"\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e It bids fealty to Judge McSherry's view, that \"obviously a principle, if sound, ought to be applied wherever it logically leads, without reference to ulterior results.\"\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e I reject this process, whether one calls it Begriffsjurisprudenz, mechanical jurisprudence, or slot machine justice. I believe that the proper test of a legal rule is the extent to which it contributes to the establishment and preservation of a social environment in which \"the quality of human life can be spirited, improving and unimpaired;\"\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e and that law must be judged by the results it achieves, not by the niceties of its inherent structure. \"It must be valued by the extent to which it meets its end, not by the beauty of its logical processes or the strictures with which its rules proceed from the dogmas it takes for its foundation.\"\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nI refuse to proceed as if no important social issue were involved in this case which implicates both the wrongdoing of city public officials and the questionable activities of federal police officials. I believe that we are confronting an extremely sensitive intersection between morals and positive law, which demands that the judiciary assume rather than shirk responsibility. To paraphrase Judge Walter V. Schaefer, the philosophical difference that divides this court depends upon a judge's unspoken notions about the role of the courts. If he or she views the role of the court as a passive one, he or she will be willing to delegate the responsibility for unpopular issues to the jury and not care greatly what the result may be. If he or she views the court as an instrument of society designed to reflect in its decisions the highest values of the American legal tradition, he or she will be more likely to risk public disapproval and to measure an unpopular cause against the highest ideals and aspirations of the time.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nThe rights conferred upon our society by judges of the Third Article emanated from cases in which the defendants were unpopular and generally regarded as transgressors-Dollree Mapp, Danny Escobedo, and Ernesto Miranda quickly come to mind. In each case, a court, not a jury, drew the line of demarcation between permissible and impermissible police conduct to insure that enforcers of society's laws would not violate established moral frontiers while exercising their stewardship; it was federal judges, unmindful of editorials and broadcast plaudits, who chose to stand tall and unbending. Like District Judge John P. Fullam, those federal judges were unwilling to relegate the formulation of these protections to the \"coquetry of public opinion, which has her caprices\"\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e in the jury room.\n\nII.\n\nLet me clear the air as to what I perceive case law to regard as legitimate and, therefore, permissible, undercover police work, and that which goes beyond the pale. In the permissible category I put all undercover activity that searches out contemplated or ongoing criminal conduct and even results in actual participation in the illegal enterprise.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e In this same category I would justify an agent's inducement of others to engage in crime, so long as there is proof of predisposition by the others to participate in the illegal activity. Where, as here, there is absolutely no proof that the defendants had any disposition to commit an illegal act but for the government's inducement, however, then the government's actions are impermissible, and the defense of entrapment is available as a matter of law-and it is for a judge and not a jury to blow the whistle on the improper conduct.\n\nThe entrapment defense thus implicates two interrelated but discrete elements: inducement and predisposition. See Hampton v. United States, 425 U.S. 484, 96 S. Ct. 1646, 48 L. Ed. 2d 113 (1976); United States v. Russell, 411 U.S. 423, 93 S. Ct. 1637, 36 L. Ed. 2d 366 (1973); Sherman v. United States, 356 U.S. 369, 78 S. Ct. 819, 2 L. Ed. 2d 848 (1958); Sorrells v. United States, 287 U.S. 435, 53 S. Ct. 210, 77 L. Ed. 413 (1932). Entrapment is a \"relatively limited defense,\" Russell, 411 U.S. at 435, 93 S. Ct. at 1644 that \"focus(es) on the intent or predisposition of the defendant to commit the crime.\" Id. at 429, 93 S. Ct. at 1641. When the entrapment issue is joined, the burden is on the government \"to disprove the whole defense beyond a reasonable doubt.\" United States v. Watson, 489 F.2d 504, 510 (3d Cir. 1973); see Government of the Virgin Islands v. Cruz, 478 F.2d 712, 717 \u0026 n.5 (3d Cir. 1973).\n\nThe defense is a matter of statutory interpretation, rooted in the notion that Congress does not intend to punish a defendant who has committed all the elements of a proscribed offense if he was induced to commit them by the government. Russell, 411 U.S. at 433-35, 93 S. Ct. at 1643-44; Sorrells, 287 U.S. at 445-51, 53 S. Ct. at 214-16. The prosecution is not defeated by proof that the government has participated in deceit or merely provided an opportunity or a facility to commit the offense; the defense of entrapment is available only when \"the Government's deception actually implant(ed) the criminal design in the mind of the defendant.\" Russell, 411 U.S. at 436, 93 S. Ct. at 1645. In the felicitous phrase of Chief Justice Earl Warren, \"a line must be drawn between the trap for the unwary innocent and the trap for the unwary criminal.\" Sherman, 356 U.S. at 372, 78 S. Ct. at 820. The crucial question, then, is whether the defendant was induced to commit the offense by agents of the government or predisposed to commit like offenses whenever the opportunity arose. We have recognized, however, that evidence of inducement may be highly probative of predisposition. Judge Rosenn has expressed it succinctly: \"(T)he stronger the inducement, the more likely that any resulting criminal conduct of the defendant was due to the inducement rather than to the defendant's own predisposition.\" Watson, 489 F.2d at 511. See also United States v. Burkley, 192 U.S. App. D.C. 294, 591 F.2d 903, 915-16 (D.C.Cir.1978), cert. denied, 440 U.S. 966, 99 S. Ct. 1516, 59 L. Ed. 2d 782 (1979).\n\nChief Justice Warren emphasized that the function of law enforcement is the prevention of crime and the apprehension of criminals, and \"that function does not include the manufacturing of crime.\" Sherman, 356 U.S. at 372, 78 S. Ct. at 820. A review of the evidence in this case persuades me that the agents of the FBI were consummate manufacturers of crime. They built the plant, they designed the machinery, they operated it, and they covertly solicited the defendants to be customers of their product. It is difficult to conceive of a stronger case of inducement by the government.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Yet the majority observe, with an almost casual tone:\n\nIn view of the jury's verdict, we need not consider the government's contention that the evidence of government inducement was insufficient to warrant submission of the entrapment issue to the jury.\n\nMajority Opinion at 606 n.15. Faced with the uncontroverted facts here, the government's contention, offered for the first time at oral argument, that no prima facie case of inducement was presented, does not reflect sober analysis or serious appellate argument but a chatter of irresponsible frivolity. Studiously avoiding the impression that their product was illegal, the FBI acted efficiently to ensnare their arbitrarily selected customers within the ten days the local task force had been allotted.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Their technique was a page torn from Aleksandr Solzhenitsyn's vivid description of the dreaded Soviet Blue Caps: \"Just give us a person-and we'll create the case!\"\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e I am persuaded that this case presents a classic model of the type of entrapment that our society emphatically condemns.\n\nIII.\n\nPresented with a mere prima facie case of government inducement or lack of a defendant's predisposition, the trial court is obliged to submit an entrapment issue to the jury for a factual determination. Where the evidence of inducement is overwhelming and the defendant's lack of predisposition so evident that it points to only one reasonable conclusion, however, \"the question may be decided as a matter of law, just as any other factual issue admitting of only one conclusion.\" United States v. Klosterman, 248 F.2d 191, 195 (3d Cir. 1957). See Sherman, 356 U.S. at 373-76, 78 S. Ct. at 821-22.\n\nOur role in reviewing the evidence is not to determine whether the defendants' conduct amounted to an offense under the statute; yet the majority's discussion of the evidence is oriented to precisely that end. As such, the discussion is irrelevant to what I perceive to be the sole issue before us: did the government present evidence sufficient to sustain a jury finding that, beyond a reasonable doubt, the defendants were predisposed to commit the offenses?\n\nA.\n\nI examine first the threshold issue of inducement. ABSCAM was conceived by the FBI for one purpose: to seek out public officials vulnerable enough to accept the lush gifts dangled before their eyes by purported representatives of a fictional Middle Eastern potentate. They enlisted as their chief executive officer an old friend, convicted career swindler Melvin Weinberg, who not only was given probation by a federal district court through the intervention of the FBI, but also was paid extraordinarily well for his services. They entered Philadelphia by seeking introductions through attorney Howard Criden, who had extensively participated in corrupt transactions for cash rewards and eagerly sought opportunities for more of the same, and they further tempted him by dangling the lure of potential legal fees. FBI agent Michael Wald, in the guise of Abdul Enterprises \"expeditor\" Michael Cohen, advised Criden that the sheik was interested in building a hotel in Philadelphia, and perhaps in other investments in the area, but only if he could be assured of having the friendship of titled municipal government officials.\n\nWald eagerly sought to deal with every significant official whom Criden and others named. Criden and Wald lured Schwartz and Jannotti not only with offers of cash payments to them but also with the prospect of a multi-million dollar investment in downtown Philadelphia. It is reasonable to conclude, indeed it is the only reasonable conclusion, that the councilmen would be desirous of such an injection of funds into the city's economic arm, because it would provide jobs and expand the city's tax base. They were repeatedly assured that the project would be \"legitimate.\" In addition, \"the very amounts of the bribes were, to paraphrase the language of the court in Scriber v. (United States, 4 F.2d 97, 98 n.4 (6th Cir. 1925) ), \"a substantial temptation to a first offense.' \" United States v. Jannotti, 501 F. Supp. at 1200.\n\nThese defendants were led to believe that the Philadelphia investment was entirely contingent on the sheik's confidence, in accordance with the dictates of \"the Arab mind,\" that he had \"friends\" with titles in city government. These representations were not only made by Wald directly to Jannotti, as the majority admit, but also to Schwartz via a Tinker to Evers to Chance play: Wald to Criden to Schwartz. The majority blithely ignore the heart of the ruse devised by the FBI entrepreneurs and naively suggest that since the record does not disclose an actual communication, the basic premise underlying the scam in ABSCAM was not communicated to the very sophisticated president of the Philadelphia City Council by those who sought to enlist him.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e It was Wald, the government agent-not Criden, not Schwartz, not Jannotti-who introduced this concept, which was summarized by Judge Fullam:\n\nPerhaps the crucial aspect of the undercover operation was its emphasis upon \"the Arab mind,\" \"the Arab way of doing business.\" A constant theme of the agents' representations was that their principals would not undertake any project unless first assured of the \"friendship\" of the persons with whom they were dealing. They were impressed with titles, with persons in official positions of power and influence. Their concept of \"making friends\" was that money had to be paid. At least insofar as the Philadelphia aspects of the investigation were concerned, there was no suggestion that the putative sheik required or expected any violation of the law in exchange for the payment; he merely wished to be assured that he had \"friends\" in high places.\n\nId. at 1194. Finally, neither defendant volunteered for the sheik's \"friendship,\" nor did they actively seek or suggest that cash payments would be appropriate. They were actively recruited and solicited to accept large amounts of money, and they did.\n\nIt is in the context of inducement that the stated purpose for the payments is relevant. The threshold issue in entrapment is not what constitutes the crime of bribery or extortion but what is the extent of the inducement offered by the government agents. The statements of the defendants that they would aid a \"legitimate\" project and the government agents' failure to disabuse the defendants of their expressed belief in the plan's legitimacy-while they nevertheless pressed money on the defendants-are significant in appraising the extent of the government's importunities.\n\nThe proof of inducement is so compelling that ordinarily I would quickly dispose of the government's argument. I have discussed the evidence of inducement at some length, however, because of its relevance to the question of predisposition. What Judge Rosenn expressed in Watson bears repetition: The greater the inducement, the heavier the government's burden of proving predisposition. 489 F.2d at 511.\n\nB.\n\nCriminal predisposition or intent, the \"focus\" of the entrapment defense, Russell, 411 U.S. at 429, 93 S. Ct. at 1641, is perforce, under the teachings of the Supreme Court, an inquiry into the defendant's subjective state of mind. \"(T)he controlling question (is) whether the defendant is a person otherwise innocent whom the Government is seeking to punish for an alleged offense which is the product of the creative activity of its own officials.\" Sorrells, 287 U.S. at 451, 53 S. Ct. at 216. The inquiry must begin with the presumption that the defendant is innocent; that is, that he was not predisposed to commit the crime. The government cannot overcome that presumption except by showing criminal predisposition beyond a reasonable doubt. There is no question, however, that the prosecution is allowed considerable latitude in introducing evidence to prove predisposition. \"On the one hand, at trial the accused may examine the conduct of the government agent; and on the other hand, the accused will be subjected to an \"appropriate and searching inquiry into his own conduct and predisposition' as bearing on his claim of innocence.\" Sherman, 356 U.S. at 373, 78 S. Ct. at 821 (quoting Sorrells, 287 U.S. at 451, 53 S. Ct. at 216).\n\nThe majority avoid a detailed discussion of the evidence in the government's best case scenario of proof of predisposition, and for good reason: the government's case does not survive close analysis. The government relies heavily on certain recorded declarations of alleged co-conspirators Criden and Johanson, to the effect that Schwartz and Jannotti would be ready and willing to accept illegal payments in return for political favors. It anchors its argument on the familiar evidentiary rule that declarations made in furtherance of a conspiracy are admissible against co-conspirators as evidence of guilt. See Fed.R.Evid. 801(d)(2)(E). It cites evidence that Criden and Johanson indicated that Schwartz and Jannotti would be \"interested in doing business,\" A453, and that Criden, at a time when he had not even met either defendant, told Wald that each would \"take a hot stove.\" A499. Jannotti, Criden said, had \"been through this ... a hundred times\" and would \"take a hot stove, like a vacuum cleaner.\" A895, 905.\n\nThe government argues that the jury could credit these declarations as evidence of the defendants' reputations, and therefore as probative of the ultimate factual question of predisposition. Cf. Fed.R.Evid. 803(21) (permitting hearsay evidence of reputation). The difficulty with this argument is that Criden and Johanson were not asked for and did not attest to the councilmen's reputations among their associates or in the community. Instead, the FBI agent, Wald, asked for and was given statements of personal opinion. Evidence of opinion is competent to prove character or a trait of character under the Federal Rules of Evidence, a major departure from the common law. Fed.R.Evid. 405(a); see United States v. Curtis, 644 F.2d 263, 267 (3d Cir. 1981); 2 J. Weinstein \u0026 M. Berger, Weinstein's Evidence at 405-1 to 405-10 (1980) (legislative history). Rule 405 permits only \"testimony in the form of an opinion,\" however, and Criden and Johanson did not testify. Untested out-of-court declarations of opinion are not admissible to prove character, and if they were admissible they would be insufficient to support a finding of predisposition under the circumstances of this case.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nThe government thus attempts to bolster its case by relying on conspirators' declarations to prove character, but it succeeds only in demonstrating the fundamental insufficiency of its evidence. Rule 405(a) permits proof of character by testimony as to reputation or by testimony in the form of an opinion; and because predisposition is an essential element of the entrapment defense, Rule 405(b) permits proof of specific instances of conduct. Therefore, the government might have offered evidence that the defendants had accepted illegal payments in exchange for official favors on previous occasions, cf. United States v. Lemons, 470 F.2d 135 (3d Cir. 1972) (per curiam), cert. denied, 412 U.S. 929, 93 S. Ct. 2758, 37 L. Ed. 2d 157 (1973) (evidence of prior dealings in illegal narcotics), or testimony that they were reputed among their associates or in the community to be disposed to accept bribes, cf. United States v. Robinson, 446 F.2d 562 (5th Cir.) (per curiam), cert. denied, 404 U.S. 959, 92 S. Ct. 323, 30 L. Ed. 2d 277 (1971) (evidence of reputation for unlawful dealings). The prosecution shunned these methods of proof, however, and offers only untested declarations of opinion to support the verdict. Even if I considered this evidence admissible to prove predisposition, I would hold it insufficient as a matter of law to justify submitting the question to the jury. Without procedural safeguards designed to test its trustworthiness,\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e hearsay evidence of opinion is simply insufficient to support a guilty verdict in a criminal case.\n\nGiven the evidence of overwhelming inducement, the government's evidentiary burden to prove predisposition was commensurately substantial. I need not attempt to delineate the outer limits of that burden here, because, in my view, the prosecution's proof fell far short of the requirement. The government's best case scenario shows that the defendants arrived at the Barclay at the government's invitation, discussed city government and hotel investments, and accepted unsolicited offers of money. The circumstances demonstrate that they were offered substantial sums for their \"friendship,\" that they considered the project in the city's best interests, and that they were made to believe that the sheik would not invest in Philadelphia unless he were permitted to \"buy friends.\" In essence, the government's case is that the defendants consummated the crime by accepting money for friendship. Receiving money under these circumstances, whatever its relevancy to prove extortion, was insufficient as a matter of law to prove predisposition. The government has demonstrated convincingly that it has massive resources to encourage and inveigle local officials to commit crimes; that if sufficiently attractive monetary and civic inducements are dangled, there are fish who will bite. It does not demonstrate that the fish were predisposed to take the bait.\n\nViewing the government's case most generously, as we must, no finder of fact could reasonably infer beyond a reasonable doubt that the defendants were predisposed, given the circumstances of massive inducement established by the government's proof. Accordingly, I agree with Judge Fullam's determination that the government failed to present sufficient evidence of predisposition to submit the entrapment issue to the jury. I have made \"due allowance for all reasonably possible inferences\" favoring the government's case, but I must conclude that to accept the jury's verdict would be to allow \"mere speculation ... to do duty for probative facts.\" Galloway v. United States, 319 U.S. 372, 395, 63 S. Ct. 1077, 1089, 87 L. Ed. 1458 (1943).\n\nIV.\n\nThe majority's clever approach to this very sensitive problem is a tribute to the skilled advocate's art. Set forth in Part III of their opinion, it is an unrelenting exhortation of major and minor premises that has an uncanny resemblance to mechanical justice. I do not fault its syllogistic structure; I quarrel only with the choice of major premises. I fault the majority's refusal to take as a beginning point the critical issue in any case where, as here, there is evidence of government inducement: Did the prosecution make out a prima facie case of predisposition on the part of the defendants beyond a reasonable doubt so as to merit submitting the entrapment question to the jury?\n\nInstead, the majority have turned our American criminal justice system upon its head and reversed the burden of proof: Instead of requiring the government to prove that the issue was properly submitted to the jury, they demand proof from the defendants that it should not have been. Thus, the majority's approach, ringing and singing, is a classic example of the fallacy of ignoranti elenchi, or irrelevance.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Instead of proving point A, the defendants' predisposition, their argument proves unrelated point B, a rebuttal of factors which the district court considered in setting aside the verdict. In the scholastic rhetorical sense, the majority's obligation was to present a confirmatio of the government's proof, not a refutatio of isolated contrary contentions.\n\nThus, the major discussion of this very important issue, set forth at great length in Part III of the majority opinion, consists only of a refutation of what is described as the district judge's three stated reasons for his post-trial decision. Having rebutted these reasons, albeit skillfully, the majority rest their case. At most, however, what the majority have done, incident to refuting the benignity of the payments, is to prove a theory of extortion. They have not demonstrated how the government met its burden of proving defendants' predisposition to commit the offense. I can accept every iota of the majority's analysis in Part III and still conclude that their analysis passes wide of the relevant mark. The majority have proved that the amount of the money offered is no defense to extortion because city councilmen should have known better, III A; that there was no \"benignity\" of the payments, III B; and that Schwartz and Jannotti accepted the money, III D. Of the four items discussed by the majority in Part III, the only factual component relevant to the issue of pre-disposition was the \"Arab mind\" factor, Part III C.\n\nThe majority observe:\n\nAfter being carefully and specifically instructed on the significant factual issues in this case, the jury found the defendants guilty, thereby rejecting the entrapment defense. Its verdict represents a finding that, based on the totality of the evidence, including the observations by the jury of the actions, words, voice inflections and mannerisms of the defendants and the F.B.I. agents, the defendants were predisposed to engage in political corruption. The jury's verdict also represents a rejection of the notion that appellant Schwartz believed the $30,000 payment was a \"consulting fee\", as well as a rejection of the argument that the defendants were led to believe that the payment of money was simply to enable the representatives to report back to the sheik that they had made friends in accordance with the \"Arab way\" of doing business. Finally, it represents a rejection of defendants' argument, accepted by the district court, that the defendants were led to believe that unless they took the payments the hotel project would not come to Philadelphia.\n\nMajority Opinion at 605.\n\nThe majority thus conclude:\n\nThe ultimate factual decisions in an entrapment case must be left to the jury. Where, as here, the jury was uniquely equipped to inquire into the calculus of human interaction, a court should not interfere with its conclusions. We conclude that in determining that defendants were entitled to a judgment of acquittal on the ground of entrapment as a matter of law the district court impermissibly substituted its own determination of the credibility of witnesses, the weight of the evidence and the inferences to be drawn from the evidence for that of the jury.\n\nId. at 606.\n\nThe last quoted sentence distills the basic division in this court which, at bottom, is a disagreement over the assignment of competences between judge and jury. To decide whether a jury question was presented, one must assume the credibility of the opposing witnesses; no contest was presented here as to credibility and, therefore, there was no need to go to the jury on that issue. As to the weight to be given to the evidence, that can relate to one of two factors: credibility, where it is placed in issue (and here it was not); or to the standard of proof beyond a reasonable doubt. In the latter situation, the judge-and not the jury-first makes this legal determination, and he must draw all reasonable inferences in favor of the prosecution. I suggest that this is the test that should have been applied-not to a solitary excerpt from Judge Fullam's explanation-but to all the evidence produced on the issue of whether the defendants were disposed to commit the acts absent the inducement of the government. The majority have accurately described the standard of review of a judgment n. o. v., Majority Opinion at 597, but they then proceed to apply a newly formulated standard wherein they examine not the entire record, but only the evidence relevant to the district court's statement of why it set the verdict aside. See id. They thus substitute for a major jurisprudential hurdle less imposing hurdles that they can leap with facility.\n\nPopular opinion may not care greatly about the fates of those entrapped and convicted by the government and its agents provocateur, but federal judges must care about the sword that is plunged into the body of trust between a people and their government. That body can withstand only so many wounds before its life will be no more. Thus, I have set forth an extended discussion of the jurisprudential, case law, and common sense\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e reasons why I cannot tolerate what the majority do today. Speaking as if no large questions were involved, they will relegate to the jury the resolution of conflicting societal interests, a resolution that in the tradition of judicial courage belongs to the judge. Moreover, they justify it all in an argument built upon irrelevancy. The fundamental interests of justice in a free society deserve better. Therefore, I respectfully but vehemently dissent.\n\nV.\n\nI turn now to the question of the district court's jurisdiction under the Hobbs Act. The jury found both defendants guilty under Count III of the indictment of conspiracy to obstruct interstate commerce in violation of the Hobbs Act, 18 U.S.C. § 1951.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Indeed, this was the only basis of Jannotti's conviction. The district court set aside the verdict and dismissed Count III of the indictment, reasoning that the Act \"does not operate to confer federal jurisdiction over purely hypothetical potential impacts on commerce which could never occur.\" 501 F. Supp. at 1185. I agree, and I therefore contend that, in addition to the entrapment defense, the judgment of acquittal on Count III should be affirmed for this separate reason.\n\nI begin the Hobbs Act analysis with the familiar precept that federal courts are courts of limited jurisdiction.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e Federal district courts are established by Acts of Congress and their jurisdiction is created solely by Congress. The majority have set forth the basic theme that the Hobbs Act definition of interstate commerce is coextensive with the constitutional definition. Majority Opinion typescript at 590-591. But some interference with or effect on interstate commerce, however minimal, is a jurisdictional element of a Hobbs Act offense, in the sense that a robbery, extortion, attempt, or conspiracy that has no contact with interstate commerce is beyond the subject matter competence of the district court. United States v. Mazzei, 521 F.2d 639, 642 (3d Cir.) (in banc), cert. denied, 423 U.S. 1014, 96 S. Ct. 446, 46 L. Ed. 2d 385 (1975); United States v. Staszcuk, 517 F.2d 53, 59-60 (7th Cir.) (in banc) (Stevens, J.), cert. denied, 423 U.S. 837, 96 S. Ct. 65, 46 L. Ed. 2d 56 (1975). Cf. United States v. Feola, 420 U.S. 671, 694-96, 95 S. Ct. 1255, 1268-69, 43 L. Ed. 2d 541 (1975) (presence of a federal officer necessary to establish federal jurisdiction over a conspiracy to violate 18 U.S.C. § 111, which prohibits assaults on federal officers).\n\nThe majority rely on two decisions from the Seventh Circuit that appear to represent the frontiers of Hobbs Act jurisdiction in the federal courts today, Staszcuk and United States v. Rindone, 631 F.2d 491 (7th Cir. 1980) (per curiam).\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Accepting the precepts there announced I conclude that the evidence presented by the government at trial failed to demonstrate the necessary \"realistic probability that an extortionate transaction will have some effect on interstate commerce.\" Staszcuk, 517 F.2d at 60. In Staszcuk the defendant city councilman received $3,000 from a private individual and subsequently did not oppose a zoning change permitting construction of an animal hospital. After receiving bids from three contractors, however, the donor of this largesse changed his plans and used his land in a manner permitted by the unamended ordinance. The defendant contested federal jurisdiction, and the government presented the testimony of one of the contract estimators that construction of the animal hospital would have required the use of components manufactured outside the state. Determining that \"a threatened effect on interstate commerce is sufficient to bring the statute into play notwithstanding the absence of any actual effect,\" id. at 59, the court focused its inquiry on the situation at the time of the offense, found a potential effect on commerce, and held that \"jurisdiction ... is satisfied by showing a realistic probability that an extortionate transaction will have some effect on interstate commerce.\" Id. at 60. Judges Sprecher, Swygert, and Pell dissented, finding potential effects insufficient to create federal jurisdiction.\n\nIn Rindone, a municipal inspector extorted payments from an electrical contractor by threatening to prosecute code violations and thus force the contractor out of business. Defendant Rindone argued that because the FBI supplied the money paid him by the contractor \"no depletion of the payor's assets was possible and thus the nexus with interstate commerce (was) not sufficient to invoke Hobbs Act jurisdiction.\" 631 F.2d at 492. Following Staszcuk, the court focused on the situation at the time of the offense and held that when Rindone acted-at the time he demanded payment, before the actual transfer of money and before the contractor spoke to the FBI-there was a realistic probability that the contractor's assets would be depleted by the extortionate transaction. Id. at 493-94.\n\nUnder these two cases, relied upon by the majority, the test is whether the government introduced sufficient evidence, or any evidence at all, demonstrating the sine qua non of federal Hobbs Act jurisdiction: \"a realistic probability that (the Arab scheme) will have some (real and not fanciful) effect on interstate commerce.\" I have added the words \"real and not fanciful\" to the Seventh Circuit formulation in order to emphasize its conformity to the Hobbs Act jurisdictional requirements that our court has previously announced: \"adequate evidence to establish that there was some effect on commerce,\" United States v. Cerilli, 603 F.2d 415, 424 (3d Cir. 1979), cert. denied, 444 U.S. 1043, 100 S. Ct. 728, 62 L. Ed. 2d 728 (1980). See Mazzei, 521 F.2d at 642. I find no such evidence on this record. The government relies on an apparent jury finding \"that the extortionate scheme, as perceived by defendants, would have affected interstate commerce.... The hotel was believed to be a multi-million dollar investment, and substantial amounts of money and goods and services would have moved in interstate commerce as a result of its construction.\" Brief for Appellant at 28 n.10 (emphasis added). The argument obliquely concedes that the fantasies of federal agents cannot alone create federal jurisdiction, but then moves without logical support to a conclusion that belief by a listener can somehow convert a speaker's fancy into fact. I reject the government's theory that building castles in the air somehow confers federal jurisdiction on the ground.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nWithout a modicum, or at least a scintilla, to be very generous, of \"some effect on commerce,\" the door to the federal courthouse simply cannot be opened. The Supreme Court made this crystal clear in Feola, when it emphasized that, regardless of the defendant's perception, the victim was indeed a federal officer and that was the operative fact investing federal jurisdiction. Thus, the court explained:\n\nThe jurisdictional requirement is satisfied by the existence of facts tying the proscribed conduct to the area of federal concern delineated by the statute. Federal jurisdiction always exists where the substantive offense is committed in the manner therein described, that is, when a federal officer is attacked. Where, however, there is an unfulfilled agreement to assault, it must be established whether the agreement, standing alone, constituted a sufficient threat to the safety of a federal officer so as to give rise to federal jurisdiction. If the agreement calls for an attack on an individual specifically identified, either by name or by some unique characteristic, as the putative buyers in the present case, and that specifically identified individual is in fact a federal officer, the agreement may be fairly characterized as one calling for an assault upon a federal officer, even though the parties were unaware of the victim's actual identity and even though they would not have agreed to the assault had they known that identity. Where the object of the intended attack is not identified with sufficient specificity so as to give rise to the conclusion that had the attack been carried out the victim would have been a federal officer, it is impossible to assert that the mere act of agreement to assault poses a sufficient threat to federal personnel and functions so as to give rise to federal jurisdiction.\n\n420 U.S. at 695-96, 95 S. Ct. at 1268-69 (emphasis supplied).\n\nThe essential flaw in the majority's opinion is its failure to appreciate the jurisdictional nature of the commerce element in a Hobbs Act case. The majority interweaves its jurisdictional argument with the argument that factual impossibility of completing a substantive offense does not bar a conviction of conspiracy. They confuse proof of the crime of conspiracy with the jurisdictional power to punish the crime. The presence of subject matter jurisdiction is a discrete and primary issue in each case presented to a federal court, unlike a state court. The effect on commerce is both jurisdictional and substantive in a Hobbs Act prosecution, but the two inquiries are separate and distinct. See, e.g., Feola, 420 U.S. at 694-96, 95 S. Ct. at 1268-69. The majority have accepted the government's straw man argument that impossibility is no defense to crime of conspiracy. Even if I could in the exercise of judicial patience, tolerate a litigant's aggrandizement of irrelevancies, I must object to the majority's agreement to join the government in demolishing the straw man.\n\nI can imagine \"the persons of the dialogue,\" in the form of Socrates and Crito:\n\nSoc.: Is there federal jurisdiction?\n\nCr.: Yes, there is federal jurisdiction.\n\nSoc.: How is there federal jurisdiction?\n\nCr.: There is federal jurisdiction because factual impossibility of performing a conspiracy is no defense to a charge of conspiracy which may be brought when there is federal jurisdiction.\n\nIn terms of formal logic, how does one analyze this synthesis of the government's argument, which, nodding like Homer, the majority have accepted? To borrow from Lord Devlin, \"I confess that I approach the investigation of this legal proposition with a prejudice in favour of the idea that there may be a flaw in the argument somewhere.\"\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nTwo such flaws quickly leap to the surface. Obviously, it is a non sequitur. More unfortunately, the reasoning \"cooks the books,\" to use Professor Neil MacCormick's phrase,\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e or more popularly, it puts the bunny in the hat by begging the question in a classic petitio principii: Instead of proving the conclusion (presence of federal jurisdiction), the argument assumes it and then argues substantive law: factual impossibility as a defense to the conspiracy charge. The fundamental issue of this court's jurisdiction deserves a more serious, rational analysis.\n\nI conclude with the district court that the evidence did not establish federal jurisdiction. The Hobbs Act contemplates conspiracies that have at least a realistic probability of affecting interstate commerce. A purely hypothetical effect, a fairy tale conjured by the FBI's answer to the Brothers Grimm, is not \"a sufficient threat to (commerce) so as to give rise to federal jurisdiction.\" Id. at 695, 95 S. Ct. at 1268. Cf. United States v. Archer, 486 F.2d 670, 681-82 (2d Cir. 1973) (Friendly, J.) (Travel Act, 18 U.S.C. § 1952, does not apply when federal officers supply the interstate element and act to ensure that an interstate element will be present for the purpose of transforming a local bribery offense into a federal crime).\n\nVI.\n\nBecause of the view I take, I do not reach the due process and manufactured jurisdiction issues addressed by the majority.\n\nVII.\n\nTo avoid unduly prolonging an opinion that is already too lengthy, I will not discuss in detail the majority's treatment of the \"extortion under color of official right\" argument, set forth in Part IIB of the majority opinion, other than to assert my continued disagreement with both the majority's conclusion and its supporting reasoning. I adhere to the views set forth in United States v. Cerilli, 603 F.2d 415, 426 (3d Cir. 1979), cert. denied, 444 U.S. 1043, 100 S. Ct. 728, 62 L. Ed. 2d 728 (1980) (Aldisert, J., dissenting), where I identified and analyzed the serious error this court committed in United States v. Kenny, 462 F.2d 1205 (3d Cir.), cert. denied, 409 U.S. 914, 93 S. Ct. 233, 34 L. Ed. 2d 176 (1972), in its revolutionary interpretation of the Hobbs Act. I introduced my discussion as follows:\n\nIt is now my view that our interpretation in Kenny and its progeny is not supported by the legislative intent underlying the Hobbs Act nor is it historically accurate. I believe that our failure to reexamine its rationale has resulted in a perpetuation of erroneous law not only in this circuit but in the First, Second, Fourth, Seventh, Eighth and Tenth Circuits which have followed our lead without setting forth a reasoned elaboration for their conclusions.\n\n603 F.2d at 427 (footnotes omitted). Moreover, I demonstrated how Ruff, Federal Prosecution of Local Corruption: A Case Study in the Making of Law Enforcement Policy, 65 Geo. L.J. 1171 (1977), effectively demolished the underlying theory that we accepted for our rule when we improperly accepted the analysis set forth in Stern, Prosecution of Local Political Corruption Under the Hobbs Act: The Unnecessary Distinction Between Bribery and Extortion, 3 Seton Hall L.Rev. 1 (1971). I adhere today to every word I set forth in my Cerilli dissenting opinion and for this separate reason would affirm the judgments of acquittal on Count III.\n\nVIII.\n\nTo be such a dissentient as I have been today amidst a college of respected peers, whose views I always respect, and much more often than not share, is not to present an animadversion of the majority's approach to this important case. Rather, I have attempted to demonstrate that this sensitive intersection between morality and positive law implicates sincerely held but diverse conceptions of justice.\n\nWhatever one's own beliefs, one lives among human beings in a community or various communities. One's fellows have, and one knows they have, moral attitudes towards and moral expectations of oneself, which reflect their moral principles and, perhaps, rules-their \"moral code.\" It would take exceptional and not necessarily commendable tough-mindedness to ignore or show indifference to these attitudes and expectations.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nIn admitting to a Humean philosophy, I believe that our moral, like our legal, life has a necessary social and experiential setting. It is this which stocks our vast inventory of standards of societal conduct-legal rules or principles-\"in the context of which we can frame and test new principles of action in new or difficult circumstances.\"\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nThe choice or construction of normative principles from this inventory is what divides our court today. As a full court we have faced the responsibility of choosing between rival models for, rival patterns of, law enforcement in our society. We have attempted to do justice according to law, not justice in the raw. We diverge only on what is meant by \"according to law.\" Because I agree with the result reached by Judge Fullam, I would affirm the judgment of acquittal.\n\n\u003cspan class=\"fn\"\u003e1. The government suggests that we have jurisdiction under 28 U.S.C. § 1291. That section does not create appellate jurisdiction over appeals by the United States in criminal cases. DiBella v. United States, 369 U.S. 121, 130, 82 S. Ct. 654, 659, 7 L. Ed. 2d 614 (1962); Government of the Virgin Islands v. Hamilton, 475 F.2d 529 (3d Cir. 1973). However, we have jurisdiction over these appeals pursuant to the Criminal Appeals Act, 18 U.S.C. § 3731. See United States v. Wilson, 420 U.S. 332, 95 S. Ct. 1013, 43 L. Ed. 2d 232 (1975); United States v. Schoenhut, 576 F.2d 1010, 1018 \u0026 n.7 (3d Cir.), cert. denied, 439 U.S. 964, 99 S. Ct. 450, 58 L. Ed. 2d 421 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Weinberg was convicted of mail fraud and wire fraud in 1977. At the intercession of the government, he was sentenced to three years probation in return for his agreement to help in the ABSCAM investigation. He was paid $3,000 a month by the F.B.I. as of the time of the trial, had received a total of approximately $140,000 up to that time, and had also received other fringe benefits.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The trials of two other defendants, Louis C. Johanson, a member of Philadelphia City Council, and Howard L. Criden, a Philadelphia attorney, who were indicted along with Schwartz and Jannotti were severed from that of Schwartz and Jannotti. Both Johanson and Criden were convicted on similar charges in the United States District Court for the Eastern District of New York, and the government moved for their dismissal as defendants here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Criden, Johanson, and Mayor Errichetti of Camden, New Jersey, were instrumental in arranging for four congressmen, including Philadelphia Congressmen Myers and Lederer, to meet the F.B.I. agents. At the meetings the congressmen agreed to introduce immigration bills in return for money, leading to their ultimate indictment and conviction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Some time after Schwartz attended the January 23, 1980 meeting at the Barclay, Shiomos and Kattleman went to Kattleman's apartment where Criden lay $6,000 on the table as the fee to be paid to Shiomos and Kattleman. Shiomos assumed this was a portion of Criden's share of the fee that was paid to Schwartz. A654. Shiomos testified he gave his $3,000 share to Kattleman. A655.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. In his post-trial testimony, Criden testified: Q. All right, now, when you went and saw Mr. Schwartz after Judge Shiomos had arranged for the interview, did you tell Mr. Schwartz that the purpose for Mr. Schwartz going there is to be a consultant for these Arabs or the Arab representatives? A. To some degree, yes. Q. You say to some degree- A. I told Mr. Schwartz there would be a consulting fee involved and I explained the project to him and I also told Mr. Schwartz that I had represented these people and had done business with them for some period of time and that he would receive a consulting fee. Q. Did you tell Mr. Schwartz at any time prior to his going to that meeting that the purpose of the meeting was in a sense to fix him and to arrange for him to take care of matters in front of City Council? A. No, sir. A3317.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. There is no evidence that William Green, Philadelphia's then newly elected mayor, was ever involved in or knew of the transactions at issue. In fact, Criden described Green as \"an All American boy\", A343, and advised Wald that it would be \"a critical mistake\" to approach him. A372.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. In charging the jury on the Hobbs Act count, the court instructed that it must find that \"a natural and probable consequence of the extortion, the receiving the money, would have been to affect interstate commerce\" and that the Government position was that the receipt of the payments of $30,000 and $10,000 would have had an effect on interstate commerce. A1344-45.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The Hobbs Act reads in pertinent part as follows: Whoever in any way or degree obstructs, delays, or affects commerce or the movement of any article or commodity in commerce, by robbery or extortion or attempts or conspires so to do ... shall be fined not more than $10,000 or imprisoned not more than twenty years, or both. 18 U.S.C. § 1951(a). The statute defines \"commerce\" as commerce within the District of Columbia, or any Territory or Possession of the United States; all commerce between any point in a State, Territory, Possession, or the District of Columbia and any point outside thereof; all commerce between points within the same State through any place outside such State; and all other commerce over which the United States has jurisdiction. 18 U.S.C. § 1951(b)(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The district court's statement, without citation to the record, that the evidence \"clearly\" establishes that the defendants \"made it very clear that the payments would not be necessary,\" 501 F. Supp. at 1185, does not fairly represent the only possible construction of the evidence, and the jury accepted a contrary construction. The district court's statement is also inconsistent with the court's own finding that the evidence permitted the inference that the payments were \"in exchange for the defendants' assurances of using their official positions to pave the way for expeditious completion of the project.\" 501 F. Supp. at 1184.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. See discussion of burden of proof in Murchison, The Entrapment Defense in Federal Courts: Modern Developments, 47 Miss.L.J. 573, 604-06 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Prior to trial, the district court stated that the content of the defendants' off-camera discussions with Criden was of critical importance to defendants' entrapment defense. A102. After the close of the government's case-in-chief, the court granted Criden defense immunity to permit him to testify about these conversations. A996-1003.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Researchers have found it difficult to locate a case in which the defense of entrapment has been successfully interposed in prosecutions of public officials for accepting, agreeing to receive, or soliciting bribes. See Annotation, Entrapment to Commit Bribery or Offer to Bribe, 69 A.L.R.2d 1397, 1431 (1960). Defendants have cited to no such case, nor has our independent investigation uncovered one. This is to be contrasted with the occasional successful entrapment defense by those persons who have been enticed by public officials to make the payments. See, e.g., United States v. Klosterman, 248 F.2d 191 (3d Cir. 1957). But see United States v. Bocra, 623 F.2d 281 (3d Cir.), cert. denied, 449 U.S. 875, 101 S. Ct. 217, 66 L. Ed. 2d 96 (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Other courts have recognized that a defendant's post-crime actions are acceptable as evidence from which an inference of predisposition can be made. See, e.g., United States v. Jenkins, 480 F.2d 1198, 1200 (5th Cir.), cert. denied, 414 U.S. 913, 94 S. Ct. 256, 38 L. Ed. 2d 151 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. In view of the jury's verdict, we need not consider the government's contention that the evidence of government inducement was insufficient to warrant submission of the entrapment issue to the jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. In Twigg, we distinguished Hampton, where the convictions were upheld, on the ground that Hampton was \"concerned with the sale of an illegal drug, a much more fleeting and elusive crime to detect than the operation of (the) illicit drug laboratory (involved in Twigg).\" We recognized that in \"such a situation the practicalities of combating drug distribution may require more extreme methods of investigation, including the supply of ingredients which the drug ring needs.\" 588 F.2d at 378 (footnote omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Judges Adams, Hunter and Garth agree that United States v. Twigg, 588 F.2d 373 (3d Cir. 1978), is distinguishable from the present case on its facts. They would go one step further, however, and directly overrule the Twigg decision. They believe that United States v. West, 511 F.2d 1083 (3d Cir. 1975), relied on by the majority in Twigg, the district court below, and the appellees here, was implicitly reversed by Hampton v. United States, 425 U.S. 484, 96 S. Ct. 1646, 48 L. Ed. 2d 113 (1976), and that unless further guidance is given in this area, district courts, in a faithful attempt to apply Twigg and West, will continue to reach results that cannot be reconciled with the teaching of the Supreme Court in Hampton. In this day of heightened criminal activity, the federal judiciary must be cautious not to exercise a \"veto\"-especially, as in this case, a constitutional veto-\"over law enforcement practices of which it (does) not approve.\" United States v. Russell, 411 U.S. 423, 435, 93 S. Ct. 1637, 1644, 36 L. Ed. 2d 366 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. When Archer came before the Second Circuit a second time, Judge Friendly, the author of both opinions, stated that the ground for the decision in Archer \"was that there had been no sufficiently meaningful use of (interstate telephone) facilities in connection with the essentially local crime committed by Archer ....\" Archer v. Commissioner of Correction, 646 F.2d 44, 45 (2d Cir. 1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. In light of our holding, we express no opinion on whether a finding of manufactured jurisdiction could support a judgment of acquittal, as ordered by the district court in this case, or can be used only as the basis for dismissal of the indictment for lack of jurisdiction, which was the procedure followed in Archer.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Olmstead v. United States, 277 U.S. 438, 470, 48 S. Ct. 564, 575, 72 L. Ed. 944 (1928) (Holmes, J., dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. A most infamous agent provocateur was Azeff, \"to whom the enduring reputation of the Ochrana owes its deeper shades of infamy.\" Donnelly, Judicial Control of Informants, Spies, Stool Pigeons, and Agent Provocateurs, 60 Yale L.J. 1091, 1092 n.8 (1960) (quoting Rowan, The Story of Secret Service 374 (1937)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Weinberg Cross Examination, A254.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. An analogy by Washington, D.C., lawyer William Hundley illustrates my point: \"It's one thing to take a street where hookers work, dress a policewoman up as a hooker and put her out there, ...\" It's something else entirely, ... \"to take Bo Derek and throw her naked into the Notre Dame locker room.\" Quoted in Some Questions of Ethics, Newsweek, Feb. 18, 1980, at 32.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Chevigny, A Rejoinder, The Nation, February 23, 1980, at 205. Professor Chevigny also expressed concern about the government's power to select its targets: As stories have emerged over the past fifteen years about the practices of law-enforcement agencies in offering opportunities for crime (whether they amount to entrapment in the technical sense or not), a chief concern has been that the focus was on \"political\" people. That used to be a code word for Catholic pacifists, the Vietnam Veterans Against the War, Black Panthers and assorted others who were convicted or acquitted, according to the vicissitudes of the venue and the criminal law, for crimes against the state in which police inducements were involved. For better or worse, the code word now extends to Republican and Democratic politicians. But the danger remains the same: the power to offer a temptation to crime is the power to decide who shall be tempted. It can be and often has been used as a way for the Government to eliminate its enemies, or for one faction in Government to get rid of another. Put simply, the question raised by actions like Abscam is: Can we leave it to the investigators to decide which politician to tempt? Id. at 204-05.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Describing another era, the historian Sir Erskine May eloquently declared: Nothing is more revolting to Englishmen than the espionage which forms part of the administrative system of continental despotisms. It haunts men like an evil genius, chills their gayety, restrains their wit, casts a shadow over their friendships, and blights their domestic hearth. The freedom of a country may be measured by its immunity from this baleful agency. Rulers who distrust their own people must govern in a spirit of absolutism; and suspected subjects will be ever sensible of their bondage. 2 E. May, Constitutional History of England 275 (1863).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. See e.g., Hollinger v. Wagner Mining Equip. Co., 667 F.2d 402 (3d Cir., 1981) (Aldisert, J., dissenting); Edward J. Sweeney \u0026 Sons, Inc. v. Texaco, Inc., 637 F.2d 105 (3d Cir. 1980), cert. denied, 451 U.S. 911, 101 S. Ct. 1981, 68 L. Ed. 2d 300 (1981). In Brokers Title Co. v. St. Paul Fire \u0026 Marine Ins. Co., 610 F.2d 1174 (3d Cir. 1979), we stated: Many sins in the law have at times been swept under a jurisprudential rug in the guise of fact finding, but neither justice nor reason, neither public policy nor logic, compels us to do so here. When questions of law dominate uncontroverted material facts, resort to fact finding from a congeries of irrelevant evidence is unnecessary. Id. at 1177.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The expression is that of Professor Bernard J. Ward of the University of Texas. Ward, \"The Judges of the Third Article,\" unpublished luncheon address, Judges' Luncheon, 36th Annual Judicial Conference, Third Judicial Circuit of the United States, Pittsburgh, Pa., October 15, 1973.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. J. Tyndall, Fragments of Science in Science and Man.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Montesquieu, De l'Espirit des Lois (1748). Dissenting in Olmstead v. United States, 277 U.S. 438, 48 S. Ct. 564, 72 L. Ed. 944 (1928), Justice Brandeis stated: If the Government becomes a lawbreaker, it breeds contempt for law; it invites every man to become a law unto himself; it invites anarchy. To declare that in the administration of the criminal law the end justifies the means-to declare that the Government may commit crimes in order to secure the conviction of a private criminal-would bring terrible retribution. Id. at 485, 48 S. Ct. at 575 (Brandeis, J., dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. This court has held that, as a matter of fundamental fairness, where the government's involvement in criminal activities attains a demonstrable level of outrageousness, prosecution for the crime will be barred even if the defendant is shown to have been predisposed. United States v. Twigg, 588 F.2d 373, 380-82 (3d Cir. 1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Hynes v. New York Cent. R. Co., 231 N.Y. 229, 235, 131 N.E. 898, 900 (1921) (Cardozo, J.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Gluck v. Baltimore, 81 Md. 315, 325, 32 A. 515, 517 (1895).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Croker v. Boeing Co., 662 F.2d 975, 1002 (3d Cir. 1981) (in banc) (Aldisert, J., concurring and dissenting) (quoting Jones, An Invitation to Jurisprudence, 74 Colum.L.Rev. 1023, 1030 (1974)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Pound, Mechanical Jurisprudence, 8 Colum.L.Rev. 605, 605 (1908).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Schaefer, Precedent and Policy, 34 U.Chi.L.Rev. 3, 23 (1966).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Edmund Burke, Letter to Thomas Burgh, New Year's Day, 1780.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. This assumes that the government participation in the crime is not so extensive and outrageous as to constitute a violation of fundamental fairness. Twigg, 588 F.2d at 380-82.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The opinion of the court below summarized applicable inducement concepts as follows: Under the general label \"inducement\" the reported decisions have included such diverse elements as suggesting that the crime be committed, providing some or all of the instrumentalities or facilities needed to complete the crime, actively participating in the commission of the crime, providing varying degrees of incentives, providing varying degrees of persuasion or even coercion, or a combination of these ingredients. United States v. Jannotti, 501 F. Supp. 1182, 1190 (E.D.Pa.1980). I agree with Judge Fullam that some or all of these were established by the evidence in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The ABSCAM show was to play only 10 days in Philadelphia. The operation had to move to another location if fish were not caught. See the record in United States v. Criden, 633 F.2d 346 (3d Cir. 1980), cert. denied sub nom. Schaffer v. United States, 449 U.S. 1113, 101 S. Ct. 924, 66 L. Ed. 2d 842 (1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. A. Solzhenitsyn, The Gulag Archipelago 146 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The majority argue as to Schwartz: It may be that the district court, aware of similar representations with regard to the \"Arab mind\" which were made to other ABSCAM participants, interpolated them as to Schwartz. Whatever the explanation, since this was the \"most important\" factor to show that the appeal to civic duty was too overwhelming an inducement for any public official to resist, once this factor is negated, the house of cards built upon it collapses. Majority Opinion at 603. The majority contend that, as to Jannotti: (T)here is no question that a reference to the \"Arab mind\" was made to him, and that Wald also represented that this \"is the method of business that these people are used to, and that is how they conduct business....\" A860.... Whether these statements can be construed as a representation that only if Jannotti accepted the money would the hotel come to Philadelphia is somewhat questionable. Such a conclusion is even more equivocal in light of the following colloquy which took place before the reference to the \"Arab mind\": JANNOTTI: Who could refuse a project like that? WALD: Nobody could, that's my point, alright, but I've been told the City of Philadelphia is where this, ah, this construction project is going. I mean this is where he is going to be. There is where he wants it.... A852 (emphasis added). Later in the meeting Wald reiterated that \"Philadelphia has already been sold, to the man.\" A876. See also A864, A880. Thus, even as to Jannotti, at most the evidence presents the basis for differing arguments to the jury as to the interpretation to be placed on the conversations. Id. at 603. The majority's argument as to Jannotti goes to whether the offense of extortion was made out, an issue not controverted in entrapment. But their contention does not refute the applicability of this evidence to predisposition. Simply stated, Jannotti's response, no matter how interpreted, has relevance to the issue of his predisposition, a relevance congruent with the \"Arab mind\" scenario to which he had been exposed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Because the quoted declarations were evidence of opinion and not of reputation, I need not reach the question of whether a co-conspirator's statements of reputation would be admissible to prove character. I note, however, that Congress and the drafters of the Federal Rules of Evidence were careful to discriminate between reputation and opinion evidence. Rule 803(21) provides that evidence of reputation is not excluded by the hearsay rule, but there is no hearsay exception for evidence of opinion. Opinion evidence is permitted only by Rule 405, which is limited to testimony. Moreover, there are important functional distinctions between reputation and opinion. Hearsay evidence of a person's reputation can be rebutted without cross-examining the declarant, merely by introducing reputation witnesses in rebuttal. A statement of opinion can be challenged or rebutted only by cross-examination. The Fifth Circuit, sitting in banc, recently approached this problem in another way. In United States v. Webster, 649 F.2d 346 (5th Cir. 1981), the court overruled a long line of local precedent and held that hearsay evidence is never admissible to prove predisposition. The court had \"little trouble rejecting the government's argument that such statements are admissible under the character/reputation provisions of the Federal Rules of Evidence, see Fed.R.Evid. 404(a)(1), 405, 803,\" 649 F.2d at 350 (footnotes omitted), and held that predisposition is not a character trait but a state of mind and thus that the \"character/reputation provisions\" do not apply.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. See generally Tribe, Triangulating Hearsay, 87 Harv.L.Rev. 957, 958-60 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. W. Sahakian \u0026 M. Sahakian, Ideas of the Great Philosophers 16 (1966).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. \"Common sense\" as used here is not a makeweight. In this adjudication it is meant to be what judges perceive to be contemporary standards of received values.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. The Hobbs Act reads in pertinent part as follows: Whoever in any way or degree obstructs, delays, or affects commerce or the movement of any article or commodity in commerce, by robbery or extortion or attempts or conspires so to do ... shall be fined not more than $10,000 or imprisoned not more than twenty years, or both. 18 U.S.C. § 1951(a). The statute defines \"commerce\" as commerce within the District of Columbia, or any Territory or Possession of the United States; all commerce between any point in a State, Territory, Possession, or the District of Columbia and any point outside thereof; all commerce between points within the same State through any place outside such State; and all other commerce over which the United States has jurisdiction. Id. § 1951(b)(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. The majority fault the defendants for not citing a \"policy reason for us to accept their restrictive view of Congress' constitutional power to legislate as to conspiracies which pose a threat to interstate commerce.\" Majority opinion at 594. There are, of course, several answers to this. First, it is the burden of the prosecution to prove jurisdiction; not the burden of the defense to disprove it. Second, the issue is not a question of expansive or restrictive views of Congress' constitutional powers. Rather, giving Congress the maximum of constitutional power, can there be a vesting of federal jurisdiction without proof by the government of one iota of actual or potential effect on interstate commerce? Third, the \"policy\" sought by the majority is inherent in the Commerce Clause itself, which creates the legislative power; and that clause at its most broad interpretation, has never been construed to extend federal power over effects on commerce that are merely hypothetical, fanciful, or imaginary. In sum, giving Congress maximum constitutional power to interpret the interstate commerce clause does not mean giving Congress the power to abolish the clause.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Because United States v. Rose, 590 F.2d 232 (7th Cir. 1978), cert. denied, 442 U.S. 929, 99 S. Ct. 2859, 61 L. Ed. 2d 297 (1979), does not consider an issue of federal jurisdiction, it is irrelevant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The government synthesized its contention at the first oral argument before the panel: MR. FIORAVANTI: If the listener to the fairy tale accepts the facts as true and undertakes to become involved in a criminal conspiracy relying on those facts, then his agreement involved the violation of federal law even though the facts turn out to be a misperception. Because impossibility is no defense. JUDGE ALDISERT: How does this believing have an effect on interstate commerce? MR. FIORAVANTI: It does not, in fact, Your Honor. Transcript of oral argument at 31-32.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. St. John Shipping Corp. v. Joseph Rank, (1957) 1 Q.B. 267, 282.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. N. MacCormick, Legal Reasoning and Legal Theory 72 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. N. MacCormick, Legal Reasoning and Legal Theory 274 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Id. at 124.\u003c/span\u003e\n\n",
    "body_length": 194705,
    "citedas": [
      "673 F.2d 578"
    ],
    "attorneys": "Peter F. Vaira, Jr., U. S. Atty., Walter S. Batty, Jr., Asst. U. S. Atty., Chief Appellate Div., Joseph M. Fioravanti, Asst. U. S. Atty. (argued), James J. Rohn, Asst. U. S. Atty., Philadelphia, Pa., Paul Shechtman, Crim. Div., Dept. of Justice, Washington, D.C., for appellant. J. Clayton Undercofler, III, Robert N. deLuca (argued), Carol A. Meehan, Philadelphia, Pa., for appellee Harry P. Jannotti; Dilworth, Paxson, Kalish \u0026 Levy, Philadelphia, Pa., of counsel. Richard A. Sprague (argued), Edward H. Rubenstone, Sprague, Goldberg \u0026 Rubenstone, Philadelphia, Pa., for appellee George X. Schwartz.",
    "category": [
      "251",
      "36",
      "75"
    ],
    "judges": "Before Aldisert, Weis and Sloviter, Circuit Judges. Argued June 10, 1981 Reargued In Banc Nov. 23, 1981 Before Seitz, Chief Judge, and Aldisert, Adams, Gibbons, Hunter, Weis, Garth, Higginbotham and Sloviter, Circuit Judges.",
    "citation_count": 246
  }
}
