{
  "id": "Wc_1YWYBTlTomsSBVDfX",
  "document": {
    "title": "Cutbirth v. State",
    "full_title": "RICKEY DON CUTBIRTH (PETITIONER), v. THE STATE OF WYOMING (RESPONDENT).",
    "jurisdiction": "Wyoming Supreme Court",
    "date": "1988-03-11T00:00:00.000Z",
    "docket": "No. 86-53.",
    "body": "In this appeal, taken from the denial of his efforts to obtain post-conviction relief, Cutbirth raises two primary questions. Initially, he asserts that the trial court erred in denying his motion for a new trial which was premised upon a ground of newly discovered evidence. He also claims that the trial court erred in denying his motion for post-conviction relief in which he urged ineffective assistance of counsel in his direct appeal from his conviction. In support of this latter issue, he argues that the ineffective assistance is demonstrated by the failure to assert in the direct appeal two issues which he now contends established error in the trial proceedings: (1) the introduction into evidence at his trial of prior physical assaults which he committed upon his wife; and (2) the violation of his constitutional right not to be compelled to give evidence against himself. We conclude that there was no prejudicial error implicated in these proceedings, and we affirm the decision of the trial court.\n\nIn his brief, Cutbirth states the issues as:\n\n\"I. Whether the trial court erred in denying Appellant's Motion for a New Trial which was based upon newly discovered evidence.\n\n\"II. Whether Appellant received ineffective assistance of counsel in the course of his appeal.\n\n\"III. Whether this Court erred in permitting the State to introduce evidence pursuant to Rule 404(b), W.R.E., that Appellant had previously hit his wife.\n\n\"IV. Whether Appellant's conviction was obtained in violation of his constitutional right not to be compelled to give evidence against himself.\"\n\nThe State of Wyoming sets forth this statement of the issues to be decided in this case:\n\n\"I. Whether appellant's motion for new trial was properly denied because newly discovered evidence was presented?\n\n\"II. Whether appellant was afforded effective assistance of counsel?\n\n\"III. Whether the issue of the admissibility of defendant's prior treatment of the victim was properly brought to the attention of this court?\n\n\"IV. Whether appellant's conviction was obtained in violation of his constitutional right against self-incrimination?\n\n\"V. Whether this entire appeal should even be entertained?\"\n\nThe proceedings which are the subject of this appeal were initiated in the district court following this court's affirmance of the judgment and sentence which formalized Cutbirth's conviction of second degree murder. Cutbirth v. State, Wyo., 663 P.2d 888 (1983). The opinion in that case succinctly describes the circumstances surrounding the shooting of Cutbirth's wife on April 4, 1982. The evidence which was submitted at the trial was held to be sufficient to justify the jury in concluding that, in the course of a quarrel, Cutbirth obtained his .357 Magnum pistol from a cabinet, removed it from its holster and shot his wife in the head with it. As soon as his conviction was affirmed, Cutbirth instituted collateral attacks upon that conviction. Those efforts resulted in a consideration of an appeal from a denial of photographs of all exhibits and a transcript of Cutbirth's recorded statement to law enforcement officials. Cutbirth v. State, Wyo., 695 P.2d 156 (1985). Some of Cutbirth's efforts to proceed with his collateral attacks are outlined in that opinion.\n\nCutbirth was successful in obtaining permission of the district court to have some of the evidence evaluated by an independent criminalist. That individual concluded in a report that the explanation of the irregular wound in the victim's head, furnished at trial by the pathologist, was erroneous, and \"* * * [p]re-impact destabilization (e.g. — low angle ricochet) is, however, a possible cause of such an irregular entry wound.\" The report went on to say, however, that \"* * * [t]his could neither be confirmed or excluded from an examination of the recovered bullet due to the extensive terminal ballistic damage and deformation it incurred from penetration of bone.\" The theory of ricochet was relied upon by Cutbirth in his Amended Petition for New Trial, and he claims that the new trial should have been granted on the ground of newly discovered evidence.\n\nIn Opie v. State, Wyo., 422 P.2d 84, 85 (1967), this court set forth those factors as to which a party seeking a new trial must satisfy the court:\n\n\"* * * (1) That the evidence has come to his knowledge since the trial; (2) that it was not owing to the want of due diligence that it did not come sooner; (3) that it is so material that it would probably produce a different verdict, if the new trial were granted; and (4) that it is not cumulative, viz, speaking to facts in relation to which there was evidence at the trial.\" (Citations omitted.)\n\nThe issues in Opie v. State, supra, were similar to those presented in this case. Recently, we have reiterated the necessity for demonstrating to the satisfaction of the district court that each of these factors is present. Gist v. State, Wyo., 737 P.2d 336 (1987); Frias v. State, Wyo., 722 P.2d 135 (1986). Whether these factors are manifested sufficiently to justify the granting of a new trial is a matter within the discretion of the trial court, and we do not reverse the decision of the trial court unless an abuse of discretion is shown as a matter of law. Gist v. State, supra. This conclusion can only be justified on the basis of a determination that the trial court's decision was unreasonable.\n\nIn this case, the trial judge, in his Order Denying New Trial, specifically addressed the issues in this way:\n\n\"Now, Petitioner attacks his conviction from the opposite direction. Specifically, Petitioner asserts that he has discovered new evidence which establishes the killing to be accidental. Petitioner offers the conclusions of Lucien C. Haag, a ballistics expert, who theorizes: `Pre-impact destabilization (e.g. — low angle ricochet) is, however, a possible cause of such an irregular entry wound.'\n\n\"Petitioner's argument that the killing was accidental is not a new theory. Although the Court does not rely on the statement for its decision in this case, it is interesting to note that in a statement to police which was suppressed by the Court at the insistence of Petitioner, Mr. Cutbirth reported that he thought the gun was empty; that he wanted his wife to leave him alone; that he wanted her to know that he meant business; that he pointed the gun in her direction; and\n\n`I thought it would click, just snap. It went off. I heard a loud roar, and I jumped. It scared me and I looked back her way and I looked at the wall because I figured it (hit) the wall; and I seen a little trickle of blood coming down her forehead right here.'\n\n\"The theory of an accidental killing was submitted to the jury. The jury found the Defendant guilty.\n\n\"While the theories of Lucien Haag may have come to the attention of Petitioner since the trial, in the exercise of due diligence, there was, or is, no valid reason why these theories were not sooner discovered.\n\n\"Furthermore, the evidence from Lucien Haag is not so material that it would probably produce a different result. The premise of the evidence is an irregular entry wound. Petitioner, and Mr. Haag, theorize that because the gun `fully and properly stabilizes fired bullets' an irregular entrance wound could have been caused only by a bullet destabilized by ricochet. However, at trial the pathologist testified that there was extensive fracturing of the skull by the bullet; that it is fairly normal for such bullets to be `incredibly flat'; that high velocity bullets may or may not exit; and that there are two possibilities for irregular entrance wounds: unstable bullets or as the bone fractured, it widened the wound. The testing of Mr. Haag would, at best, be contradictory or cumulative to the testimony elicited at trial. However, it would not conclusively establish that the killing was accidental; more importantly it would not make an accidental killing more probable than an intentional killing. A jury would still be left with the same conflict to resolve: was the killing intentional as claimed by the State or was it an accident as claimed by Defendant?\"\n\nIn its order, the trial court applied the Opie criteria and found that due diligence would have disclosed the views of the criminalist prior to trial; that the testimony of the criminalist would be only contradictory or cumulative, i.e., addressing facts as to which there was evidence at the trial; and that it was not so material that it probably would produce a different verdict at another trial. In addition, to those matters discussed by the trial judge, it perhaps is worthwhile to note that in one of his reports the criminalist also said:\n\n\"No evidence of ricochet was present on this bullet [the bullet removed from the victim's head]; the substantial flattening and partial breakup of the bullet was due to terminal ballistic damage.\"\n\nEven if the subsequent report is read as an opinion of ricochet instead of a suggestion of another possibility, the opinions of the criminalist are conflicting.\n\nCutbirth urges the court to abandon the Opie test, but we are satisfied that the Opie case establishes an appropriate approach for analyzing claims such as Cutbirth's. We affirm the denial of the motion for new trial which was based on the ground of newly discovered evidence. There is less justification for granting a new trial on this ground in this case than was present in Frias v. State, supra, in which this court affirmed the denial of a motion for a new trial also premised upon a claim of newly discovered evidence.\n\nWe turn then to the issue arising from the denial of Cutbirth's petition for post-conviction relief. This contention is articulated in Issues II, III and IV of Cutbirth's statement of the issues. The claims relating to the issues of the prior battery and the inadmissibility of Cutbirth's statements come before us only out of an abundance of caution in honoring the right to effective assistance of counsel in connection with an appeal, suggested by Evitts v. Lucey, 469 U.S. 387, 105 S.Ct. 830, 83 L.Ed.2d 821, reh. denied 470 U.S. 1065, 105 S.Ct. 1783, 84 L.Ed.2d 841 (1985). While counsel was appointed to represent Cutbirth in connection with the motion for new trial based upon newly discovered evidence, the appointed attorney apparently understood that his duties were limited to that purpose. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e For this reason, the notice of appeal in this case was filed by Cutbirth pro se, and the appeal was taken only from the Order Denying New Trial, without any reference being made in the notice of appeal to the order which denied Cutbirth's petition for post-conviction relief. Consequently, upon application by counsel appointed to prosecute the appeal, this court entered an order expanding the scope of the appeal to include the question of adequate representation in the direct appeal and the collateral questions raised as justification for the contention of inadequate representation.\n\nUnder our usual rule, we would not consider the contention that the court erred at trial in permitting the introduction into evidence of prior bad acts pursuant to Rule 404(b), W.R.E., nor the claim that Cutbirth's right not to be compelled to give evidence against himself had been violated. This court has taken a disciplined approach to post-conviction relief, pointing out that it is not a substitute for the right of review upon appeal from a conviction, nor is it to be treated as an appeal. Pote v. State, Wyo., 733 P.2d 1018 (1987); Hoggatt v. State, Wyo., 606 P.2d 718 (1980); Johnson v. State, Wyo., 592 P.2d 285, cert. denied 442 U.S. 932, 99 S.Ct. 2864, 61 L.Ed.2d 300 (1979); Munoz v. Maschner, Wyo., 590 P.2d 1352 (1979). Questions which may be raised by a motion for post-conviction relief are limited to those of constitutional magnitude which manifest a miscarriage of justice. Wright v. State, Wyo., 718 P.2d 35 (1986); Hoggatt v. State, supra. Those issues which could have been presented on appeal are not open to challenge by a motion for post-conviction relief because they are foreclosed by the doctrine of res judicata. Wright v. State, supra; Hoggatt v. State, supra; Munoz v. Maschner, supra.\n\nOur rule is one of procedural waiver or default which is in accord with the rule invoked when a post-conviction review proceeding is pursued in the federal courts. If a person convicted in state court fails to assert a legal issue when an appropriate opportunity exists, in accordance with state procedural rules, that person is foreclosed from relief in a federal post-conviction proceeding unless he can meet the dual requirements of showing cause for the failure and actual prejudice. Reed v. Ross, 468 U.S. 1, 104 S.Ct. 2901, 82 L.Ed.2d 1 (1984); Engle v. Isaac, 456 U.S. 107, 102 S.Ct. 1558, 71 L.Ed.2d 783, reh. denied 456 U.S. 1001, 102 S.Ct. 2286, 73 L. Ed.2d 1296 (1982); Wainwright v. Sykes, 433 U.S. 72, 97 S.Ct. 2497, 53 L.Ed.2d 594, reh. denied 434 U.S. 880, 98 S.Ct. 241, 54 L.Ed.2d 163 (1977); Pierre v. Shulsen, 802 F.2d 1282 (10th Cir. 1986), cert. denied ___ U.S. ___, 107 S.Ct. 1964, 95 L.Ed.2d 536 (1987), reh. denied ___ U.S. ___, 107 S.Ct. 3246, 97 L.Ed.2d 750 (1987); Andrews v. Shulsen, 802 F.2d 1256 (10th Cir. 1986) cert. denied ___ U.S. ___, 107 S.Ct. 1964, 95 L.Ed.2d 536, reh. denied ___ U.S. ___, 107 S.Ct. 3246, 97 L.Ed.2d 750 (1987). \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Policy principles of finality and judicial economy demand that a state be allowed, as a matter of procedure, to compel a defendant to assert all claims of error in his direct appeal. Failure to do so justly results in a waiver of those issues in collateral proceedings. Wright v. State, supra. Our approach fits with the federal rule because in the courts of this state, a convicted person is foreclosed from raising in a post-conviction proceeding any claim of error which he could or should have presented on appeal unless he demonstrates good cause for not presenting the issue on appeal and actual prejudice arising from the failure to present it. This adoption of a rule parallel to the rule applied in the federal courts will facilitate in a material way the task of the federal courts in examining issues raised in federal post-conviction proceedings in which review is sought of a conviction in the State of Wyoming.\n\nThe waiver rule serves to foreclose those claims made in Cutbirth's Petition for Post-Conviction Relief and his Amendment to the Original Petition for Post-Conviction Relief \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e which we did not include in our order expanding the appeal. We reiterate that the courts of this state are not required to review issues which were raised or could have been raised on appeal when they are asserted in a motion for post-conviction relief. See Bryant v. State, Hawaii App., 720 P.2d 1015 (1986), citing Post Conviction Procedure A Suggested Solution, 2 Harv.J. on Legis. 189 (1965) (purpose of state post-conviction statutes is to afford relief similar to that of a federal writ of habeas corpus and to assure protection of constitutional rights in state courts).\n\nWe turn then to the claim that Cutbirth was denied effective assistance of counsel on his direct appeal. Cutbirth's claim of ineffective assistance of counsel rests upon the failure to assert on appeal the two collateral issues identified as III and IV above. The claim that counsel on appeal did not raise every potential issue is a relatively new phenomenon. We have discovered only a few cases in which reversible error for ineffective assistance of appellate counsel was premised upon the failure to raise certain issues on appeal. Matire v. Wainwright, 811 F.2d 1430 (11th Cir. 1987); Burton v. State, Ind., 455 N.E.2d 938 (1983); Shipley v. Cupp, 59 Or. App. 283, 650 P.2d 1032 (1982). While reaching the same result, cases in Pennsylvania are distinguishable because the Pennsylvania rule requires that all issues of even arguable merit be raised, and there is no requirement of a finding of prejudice to the accused. E.g., Commonwealth v. Pfaff, 477 Pa. 461, 384 A.2d 1179 (1978); Commonwealth v. Carr, 320 Pa. Super. 1, 466 A.2d 1030 (1983); Commonwealth v. Broomell, 254 Pa. Super. 574, 386 A.2d 99 (1978). But see Commonwealth v. Dockins, 324 Pa. Super. 305, 471 A.2d 851 (1984). The plethora of precedent which over the years consistently has rejected claims of ineffective assistance of appellate counsel premised upon the failure to raise particular issues can be found in the cases cited in Annotation, Adequacy of Defense Counsel's Representation of Criminal Client Regarding Appellate and Post-conviction Remedies, 15 A.L.R.4th 582 (1982 and Supp. 1987). Ineffective assistance of appellate counsel may justify review of a state court decision by a federal court, but the \"cause and prejudice test\" normally will be applied to such contentions. Smith v. Murray, 477 U.S. 527, 106 S.Ct. 2661, 91 L.Ed.2d 434 (1986). Generally, \"* * * the mere fact that counsel failed to recognize the factual or legal basis for a claim, or failed to raise the claim despite recognizing it, does not constitute cause for a procedural default.\" Murray v. Carrier, 477 U.S. 478, 486, 106 S.Ct. 2639, 2645, 91 L.Ed.2d 397 (1986). In Jones v. Barnes, 463 U.S. 745, 103 S.Ct. 3308, 77 L.Ed.2d 987 (1983), the court pointed out that raising every issue on appeal can lessen the impact of specific issues which counsel feels offer a reasonable chance of success. It follows that the simple failure to raise certain issues on appeal, even if they were meritorious, does not require a conclusion of ineffective assistance of counsel. Evitts v. Lucey, supra. The statement by the Supreme Court of the United States is that:\n\n\"* * * A brief that raises every colorable issue runs the risk of burying good arguments — those that, in the words of the great advocate John W. Davis, `go for the jugular,' Davis, The Argument of an Appeal, 26 A.B.A.J. 895, 897 (1940) — in a verbal mound made up of strong and weak contentions.\" Jones v. Barnes, supra, 463 U.S. at 753, 103 S.Ct. at 3313.\n\nIn Smith v. Murray, supra, 477 U.S. at 536, 106 S.Ct. at 2667, the Supreme Court, quoting Jones v. Barnes, supra, said:\n\n\"* * * This process of `winnowing out weaker arguments on appeal and focusing on' those more likely to prevail, far from being evidence of incompetence, is the hallmark of effective appellate advocacy.\"\n\nTactical choices play a part in appeal as well as at the trial level.\n\nThe claim of ineffective assistance of appellate counsel is not an issue which can be foreclosed as a matter of waiver or default under Wyoming law because it is not an issue that could have been raised in the initial appeal. We must, therefore, consider that issue. The first task is to identify a standard by which effective assistance of counsel on appeal may be tested. With respect to the standard of effective assistance of counsel on appeal, we adopt the test set forth in Strickland v. Washington, 466 U.S. 668, 104 S.Ct. 2052, 80 L.Ed.2d 674, reh. denied 467 U.S. 1267, 104 S.Ct. 3562, 82 L.Ed.2d 864 (1984), which we have applied with respect to effective assistance of counsel in the trial courts. E.g., Frias v. State, supra; Munden v. State, Wyo., 698 P.2d 621 (1985). This approach is the one which the majority of the federal courts have adopted, although the Supreme Court of the United States has not addressed the issue specifically. Robison v. Maynard, 829 F.2d 1501 (10th Cir. 1987); Gray v. Greer, 800 F.2d 644 (7th Cir. 1986); Griffin v. Aiken, 775 F.2d 1226 (4th Cir. 1985) cert. denied ___ U.S. ___, 106 S.Ct. 3301, 92 L.Ed.2d 715 (1986); Bowen v. Foltz, 763 F.2d 191, (6th Cir. 1985); Schwander v. Blackburn, 750 F.2d 494 (5th Cir. 1985); Mitchell v. Scully, 746 F.2d 951 (2nd Cir. 1984), cert. denied 470 U.S. 1056, 105 S.Ct. 1765, 84 L.Ed.2d 826 (1985); Cape v. Francis, 741 F.2d 1287 (11th Cir. 1984), reh. denied 760 F.2d 281 (11th Cir.), cert. denied 474 U.S. 911, 106 S.Ct. 281, 88 L.Ed.2d 245 (1985); Parton v. Wyrick, 704 F.2d 415 (8th Cir. 1983). The same requirements are applicable that are set forth in Strickland v. Washington, supra. It must be demonstrated that counsel's representation was deficient by showing errors were made that were so serious that counsel was not functioning in accordance with the constitutional guarantee, and furthermore, the deficient performance prejudiced the appellant. Cutbirth urges us to adopt the test found in Watson v. United States, 508 A.2d 75 (D.C.App. 1986). Watson v. United States, supra, was vacated by Watson v. United States, 514 A.2d 800 (D.C.App. 1986), and the case then was heard en banc. In a plurality decision, the United States Court of Appeals for the District of Columbia followed the Strickland test for ineffective assistance of appellate counsel and found neither error nor prejudice. Watson v. United States, 536 A.2d 1056 (D.C.App. 1987). We are satisfied that the Strickland test represents the better rule.\n\nTo paraphrase Strickland v. Washington, supra, as quoted in Gist v. State, supra, Campbell v. State, Wyo., 728 P.2d 628 (1986), and Frias v. State, supra, in analyzing the question of prejudice to Cutbirth, the failure to assert the claimed issues in his direct appeal must be found to have resulted in the denial to Cutbirth of a fair review, the result of which is not to be considered reliable, by showing an error of judgment on the part of counsel and resulting prejudice. In this instance, the district court held no hearing with respect to the issue of ineffective assistance of appellate counsel, and this makes the determination more difficult. Wicker v. McCotter, 783 F.2d 487 (5th Cir. 1986), cert. denied ___ U.S. ___, 106 S.Ct. 3310, 92 L.Ed.2d 723 (1986); Hamilton v. McCotter, 772 F.2d 171, reh. denied 777 F.2d 701 (5th Cir. 1985); Griffin v. Aiken, supra. In Robison v. Maynard, supra, the Tenth Circuit Court of Appeals remanded the case to the district court for a factual inquiry with respect to the reasons that appellate counsel failed to raise certain issues on direct appeal. In Gray v. Greer, supra, the court alluded to the possibility of requiring a hearing to establish the facts with respect to the failure to raise issues on appeal and said at 800 F.2d 647:\n\n\"Petitioner further seeks an evidentiary hearing to resolve his claim of ineffective assistance of counsel. An evidentiary hearing is required only if a review of the record is not sufficient to resolve factual disputes regarding the choice of issues. Williams v. Owens, 731 F.2d 391 (7th Cir. 1983). Given the nature of petitioner's claims, it is difficult to envision the evidence of testimony which petitioner would present at such a hearing. When a claim of ineffective assistance of counsel is based on failure to raise issues on appeal, we note it is the exceptional case that could not be resolved on an examination of the record alone. We leave the determination of whether an evidentiary hearing is required to the discretion of the district court after review of the trial record.\"\n\nThe Supreme Court of the United States in some of its decisions indicates that its analysis is based on a factual determination or finding made by the district court. See Burger v. Kemp, ___ U.S. ___, 107 S.Ct. 3114, 97 L.Ed.2d 638, reh. denied ___ U.S. ___, 108 S.Ct. 32, 97 L.Ed.2d 820 (1987); Smith v. Murray, supra. In this instance, in order to weigh either question of error, that is, deficient representation, or prejudice, we must turn to the record of the original trial.\n\nThe evidence which Cutbirth asserts violated Rule 404(b), W.R.E., is summarized in Cutbirth v. State, supra, 663 P.2d at 890. Essentially, it consisted of testimony of a battery committed upon the victim in the preceding year; instances in which Cutbirth was chasing his wife who was trying to escape; Cutbirth's statements that he had given the victim a black eye; and two occasions of medical treatment of the victim for consequences of batteries by Cutbirth. The trial court entertained an offer of proof in chambers and then ruled that the evidence was admissible as bearing upon the issues of motive, malice, lack of accident and course of conduct. Without unwarranted detail, we hold that the trial court was correct in its ruling admitting the evidence of the prior bad acts pursuant to Rules 402, 403 and 404(b), W.R.E. There was no abuse of discretion in that decision. It was consistent with precedent in this state and elsewhere. Coleman v. State, Wyo., 741 P.2d 99 (1987); Elliott v. State, Wyo., 600 P.2d 1044 (1979); Lonquest v. State, Wyo., 495 P.2d 575, cert. denied 409 U.S. 1006, 93 S.Ct. 432, 34 L.Ed.2d 299 (1972); Alcala v. State, Wyo., 487 P.2d 448 (1971), cert. denied 405 U.S. 997, 92 S.Ct. 1259, 31 L.Ed.2d 466, reh. denied 406 U.S. 911, 92 S.Ct. 1613, 31 L.Ed.2d 823 (1972); State v. Grider, 74 Wyo. 88, 284 P.2d 400, reh. denied 74 Wyo. 111, 288 P.2d 766 (1955); State v. Koch, 64 Wyo. 175, 189 P.2d 162 (1948). See also United States v. Naranjo, 710 F.2d 1465 (10th Cir. 1983); United States v. Tsinnijinnie, 601 F.2d 1035 (9th Cir. 1979), cert. denied 445 U.S. 966, 100 S.Ct. 1657, 64 L.Ed.2d 242 (1980); People v. Lazare, 189 Colo. 530, 542 P.2d 1290 (1975).\n\nWith respect to the contention that his constitutional protection against self-incrimination was infringed, Cutbirth relies upon both the Fifth Amendment to the Constitution of the United States of America and Art. 1, § 2 of the Wyoming Constitution. Prior to trial, a suppression hearing was conducted in the district court. At that juncture, the trial court limited the admissibility of statements made by Cutbirth to the investigating officers to those that were furnished prior to the advice that Cutbirth's wife had died. The district judge found that the statements made prior to that time were free of coercive influence and were voluntary and admissible. He foreclosed the admission of other statements. Our review of the record persuades us that the ruling by the district court was within the totality of the circumstances test which we adopted in Frias v. State, supra. The statements which were admitted were the product of uncoerced choice and demonstrated sufficient comprehension to assure that the waiver of Cutbirth's right to silence was made with full awareness of both the nature of his right and the consequences of his decision. This case is similar to Best v. State, Wyo., 736 P.2d 739 (1987), and Bueno-Hernandez v. State, Wyo., 724 P.2d 1132 (1986), cert. denied ___ U.S. ___, 107 S.Ct. 1353, 94 L.Ed.2d 523 (1987), and we support the decision of the trial court as to the limited admissibility of Cutbirth's statements. Cutbirth relies upon evidence that his blood alcohol content was more than .002. Other testimony, however, demonstrates the validity of the district court's ruling that Cutbirth was in control of his faculties and aware of what he was doing at the time he made the statements to the officers. This determination also is consistent with Miller v. Fenton, 474 U.S. 104, 106 S.Ct. 445, 88 L.Ed.2d 405 (1985), cert. denied ___ U.S. ___, 107 S.Ct. 585, 93 L.Ed.2d 587 (1986), upon which Cutbirth relies.\n\nAlthough we would not be required to review the claims presented by the third and fourth issues, we have concluded that no error was made by the district court at trial in connection with those issues. Consequently, those claims cannot support a contention of ineffective assistance of counsel; no prejudice can be found with respect to them. Our conclusion that no prejudice can be found with respect to the failure to raise these issues on the appeal makes it unnecessary to compare them with other issues presented in Cutbirth's appeal to determine if appellate counsel was guilty of deficient representation. It follows that Cutbirth, being unable to demonstrate prejudice, cannot claim inadequate representation of appellate counsel. His failure to satisfy the prejudice aspect of the test forecloses that claim.\n\nThis discussion resolves the issues in this case. We recognize, however, that approaching the task in this manner is antithetical to the strict application of the waiver rule. By agreeing to expand the scope of this appeal, we created a demand that we address the substantive claims which normally would be barred but which Cutbirth invoked by tying them to his claim of inadequate representation by appellate counsel. We should attempt to develop a concrete standard for adequate representation by appellate counsel so that we will not in every instance proceed contrary to the waiver rule and will not in every instance simply address the matter in an ad hoc way which inevitably finds counsel's professional decisions tested by the collective determination of the members of the appellate panel as to what they would have done given the same situation. We conclude that the issue of whether counsel's performance was constitutionally deficient in light of Strickland v. Washington, supra, as invoked in Smith v. Murray, supra, and Murray v. Carrier, supra, should be analyzed in much the same way that this court has analyzed the concept of plain error. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e In submitting a claim of deficient representation by appellate counsel, the petitioner in the post-conviction proceeding must demonstrate to the district court, by reference to the record of the original trial without resort to speculation or equivocal inference, what occurred at that trial. The particular facts upon which the claim of inadequate representation by appellate counsel rests must be presented. The petitioner then must identify a clear and unequivocal rule of law which those facts demonstrate was transgressed in a clear and obvious, not merely arguable, way. Furthermore, the petitioner must show the adverse effect upon a substantial right in order to complete a claim that the performance of appellate counsel was constitutionally deficient because of a failure to raise the issue on appeal. See McDonald v. State, Wyo., 715 P.2d 209 (1986); Tompkins v. State, Wyo., 705 P.2d 836 (1985), cert. denied 475 U.S. 1052, 106 S.Ct. 1277, 89 L.Ed.2d 585 (1986); Munden v. State, Wyo., 698 P.2d 621 (1985); Westmark v. State, Wyo., 693 P.2d 220 (1984); Hampton v. State, Wyo., 558 P.2d 504 (1977). The adverse effect upon a substantial right in the context of ineffective assistance of appellate counsel is shown by demonstrating a \"* * * reasonable probability that, but for counsel's unprofessional errors, the result of the proceeding would have been different. A reasonable probability is a probability sufficient to undermine confidence in the outcome.\" Strickland v. Washington, supra, 466 U.S. at 694, 104 S.Ct. at 2068. In this regard the test does address the fairness and integrity of the judicial proceedings. See Hopkinson v. State, Wyo., 632 P.2d 79 (1981), cert. denied 455 U.S. 922, 102 S.Ct. 1280, 71 L.Ed.2d 463 (1982); Jones v. State, Wyo., 580 P.2d 1150 (1978). The reasonable probability must be one that demonstrates a more favorable result to the appellant if the omitted issue had been pursued. See Nimmo v. State, Wyo., 603 P.2d 386 (1979).\n\nThe application of these objective criteria will permit a trial court presented with a claim for post-conviction relief to decide whether a showing of cause has been made sufficient to avoid the waiver rule. The claim for relief attaching to inadequate representation by appellate counsel can be resolved without necessarily considering the substantive merit of the issues raised. If this process is followed, petitioners for post-conviction relief are not permitted to evade the waiver principle by the device of claiming inadequate representation by appellate counsel. Yet the petitioner who may have been denied adequate representation by appellate counsel is afforded a fair opportunity for potentially meritorious issues to be resolved.\n\nIn Cutbirth's case, the process which we have described would have led to a correct result without any necessity for considering, in any substantive way, the issues which he claims appellate counsel failed to present. The claim of inadequate representation by appellate counsel could have been resolved by the application of the objective criteria set forth above rather than an examination of the merits of the claimed issues or simply an ad hoc analysis of them by the court to determine what its members might have done differently. When the objective criteria are invoked and the district court then is persuaded that appellate counsel did make a mistake which was prejudicial to the rights of the petitioner, appropriate relief can be afforded by ordering a new trial or, in the alternative, a reinstatement of the direct appeal so that the issue may be presented.\n\nThe district court correctly resolved the claim by Cutbirth that he was entitled to a new trial because of newly discovered evidence. There was no error in the order of the court denying the petition for post-conviction relief with respect to the contention of ineffective assistance of counsel in Cutbirth's direct appeal, nor for any of the other reasons asserted in that petition for post-conviction relief. We affirm the district court on both aspects of this appeal.\n\nURBIGKIT, J., filed a dissenting opinion.\n\nURBIGKIT, Justice, dissenting.\n\nThis appeal follows denial of post-conviction relief to the convicted defendant in two separate proceedings. Rickey Cutbirth first filed a pro-se motion for a new trial on the basis of newly discovered evidence, followed by a petition for post-conviction relief alleging trial error. An application for the appointment of counsel actually was not made at the commencement of either proceeding. Counsel was appointed for legal assistance on the motion for new trial but not for the post-conviction-relief petition which was summarily denied without hearing. Later, following a hearing but without the presentation of actual evidence and premised only on argument of counsel, the motion for new trial was denied. Without counsel for the trial court session to organize properly the post-conviction petition, \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e it is necessary to consider the appeal status essentially as if two different cases are presented by separate appeals.\n\nIn the absence of other eyewitness testimony, the critical issue of the conviction, whether an accident or intended homicide, was determinable primarily on physical evidence as observed and reported by expert witness, involving the gun distance from decedent, powder-burn determinants, projectile direction and movement on entry, and contended conflicts in the defendant's testimony of his explanations during police interrogation.\n\nMOTION FOR NEW TRIAL BASED ON NEWLY DISCOVERED EVIDENCE\n\nIf anything was learned from Frias v. State, Wyo., 722 P.2d 135 (1986) and the succeeding acquittal trial after remand, it is that expert pathology evidence can be inherently suspect and when it is properly answered by experienced experts, may not be so absolute and certain as first related by the forensic witness when parameters are uncluttered by opposing experts (somewhat like untested eyewitness identification). Initially, on the subject of Frias, the court misreads that decision, although the author of this majority opinion had there dissented to the reversal and retrial which resulted in acquittal. In that case, the majority chose the broad context of ineffectiveness of counsel within which the failure to have suitable pathology testimony, subsequently denied in post-hearing request, was an important characteristic. I would read the decision to demonstrate, in a certain and absolutely related way, that not only was there ineffectiveness of counsel, but there was clear mistake in denial of the motion for a new trial. In retrial, defendant was acquitted, based on previously denied testimony. Additionally in that case, the record was much more specifically developed by evidentiary post-trial hearing.\n\nObviously, the singular problem presented in this case by the motion for new trial was the unexplained loss by the police of the garment worn by defendant. Under expert examination, this evidence might have categorically destroyed the thrust of the prosecution's trial-time expert testimony as clearly probative in the resulting conviction, since the critical issue was whether the fatal injury was derived from a ricocheted bullet or a direct shot. The significance of the missing shirt as an item of evidence was detailed in a written report of the defendant's expert:\n\n\"As of this date the white, long-sleeve shirt purportedly worn by Rickey Cutbirth at the time of the shooting of Patricia Cutbirth has not been received by the undersigned. (This garment is item # 1 on the Wyoming State Crime Laboratory Report dated May 24, 1982, Kemmerer case no. 82-0810 and signed by Howard D. Herr.) It is this shirt and the distribution of any gunshot residues on it that stands to confirm Mr. Cutbirth's description of this shooting as an accident. It was for this reason that it was specifically named as the second item of physical evidence in the Court Order of Judge Troughton dated October 3, 1983. For similar reasons the upper garment[s] worn by the deceased were sought but have never been produced.\"\n\nIn the order of the trial court denying the motion for new trial, it was said:\n\n\"While the theories of Lucien Haag [the forensic expert on firearms and ballistics employed by defendant for the post-trial motion for new trial] may have come to the attention of Petitioner since the trial, in the exercise of due diligence, there was, or is, no valid reason why these theories were not sooner discovered.\"\n\nUnless we attribute to clients the supposed experience, knowledge, competency, and capability of counsel as attributable to learned members of the bar — particularly so when the client is in jail and the attorney has the flexibility of office and library — all of this is to define the happenstance of performance of counsel to be the assumed responsibility of the charged defendant. In the first place, unless we are going to arrange to have the attorney go to jail for his mistakes in defense rather than the client, which may have been the case at short periods in the ancient past, I decline to impose empirically on defendant his incarceration as the burden for the inadequacy of representation. See Laing v. State, Wyo., 746 P.2d 1247, 1250 (1987), Urbigkit, J., and Macy, J., concurring in part and dissenting in part.\n\nSecondly, in this year of bicentennial celebration of the United States Constitution and near centennial birth of the Wyoming Constitution, there appears to be a tendency to short-circuit constitutional rights in the search for simplicity, expediency, and maybe just less work. Due process and effective assistance of counsel are not juristic idioms or legalistic oxymorons \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e to be disregarded pragmatically. They are the essence of any democratic government's justice-delivery system. Even so, each of us should meticulously re-read Art. 1 of the Wyoming Constitution, including in particular § 6, Due Process; § 9, Trial by Jury Inviolate; and § 10, Right of Accused to Defend, with the due-process guarantees of the Fifth, Sixth, Seventh, and Fourteenth Amendments to the United States Constitution. I have no particular problem with the Opie test (Opie v. State, Wyo., 422 P.2d 84 (1967)), if rationally applied so as not to become a mechanism to incarcerate an individual for counsel mistakes and failures or perhaps just understandable misconception in trial preparation and strategy. There is no person, and in particular no trial lawyer, found to be designed in performance perfection, yet the immutable character of performance should not be what inevitably compels finality to an unjustified conviction.\n\nIt is not the burden of my dissent to apply individualized self-experience (as may be derived from past active trial experience) to legal process, technical witnesses, and even ballistics questions, to determine empirically on a short-written report that, in fact, a basis for a new trial was or was not submitted. Obviously, sufficient evidence was not available to the trial judge to make a decision in either regard. What should be done, where the clarity of conflict of the specific testimonial facts is presented as is the case evidenced here, is to provide, at a minimum, a hearing with live witnesses for review and evaluation, in order to assure due process in a fashion not to be short-circuited and excused by the stale and almost obscene explanation that defendant waived something about which he had no knowledge and concerning which his experience was totally lacking. Obviously, trial counsel (and perhaps even trial judges) had better learn something from Frias and Cutbirth in accidental versus intentional homicide cases, but little solace is afforded at this stage. No lawyer is perfect; no judge is perfect; and no system is, in first instance, perfect. The redundancy of remedial characteristics is the sine qua non of efficient and reliable organization. It is in this perspective that the validity of the motion for new trial serves a desired function, and it should not be squeezed into nonexistence by a facile and fallacious contention about evidence with consideration denied as lacking a newly discovered character which, in fact, is empirically untrue. I would find to be properly presented here the necessity for inquiry within an actual hearing to establish if:\n\n\"`* * * the evidence, had it been disclosed to the jury which convicted defendant, and in light of all other evidence which that jury heard, [would] likely have created in the jury's mind a reasonable doubt which did not otherwise exist as to defendant's guilt.'\" Keser v. State, Wyo., 737 P.2d 756, 764 (1987), quoting from State v. McDowell, 310 N.C. 61, 310 S.E.2d 301, 309 (1984).\n\nSee also, United States v. Peltier, 731 F.2d 550 (8th Cir. 1984); Smith v. United States, 635 F.2d 693 (8th Cir. 1980), cert. denied 450 U.S. 934, 101 S.Ct. 1397, 67 L.Ed.2d 368 (1981); Lindhorst v. United States, 585 F.2d 361 (8th Cir. 1978). For the standard to be applied, see United States v. Agurs, 427 U.S. 97, 96 S.Ct. 2392, 49 L.Ed.2d 342 (1976); Napue v. Illinois, 360 U.S. 264, 79 S.Ct. 1173, 3 L.Ed.2d 1217 (1959).\n\nFor this reason alone, I would reverse the denial of the motion for new trial and would require an evidentiary hearing for determination of what happened to the evidence, and otherwise to consider in live form the countervailing expert-witness testimony as would afford a rational, factual basis to grant or deny a new trial.\n\nFirst in Keser, and now here again by this case, the majority posture affirmation on the relative ignorance of the trial court. My thesis here is not that a new trial should necessarily be granted here on the bland and partially developed record of one brief affidavit; rather, it is that the proper consideration is not to be defined as the justification for decision in ignorance instead of buttressed by actual hearing and live witness for informed decision. When serious liberty interests are invoked, factual, not formalistic, considerations should be intrinsic to constitutional decision. As in Keser, and now Cutbirth, the trial court, absent exposure to actual evidence (as was the next trial jury in Frias) will never have an opportunity to consider whether an innocent man was importunely sentenced. The issue is not embodied in majority statement that \"[T]his conclusion can only be justified on the basis of a determination that the trial court's decision was unreasonable,\" but instead in absence of adequate exploration by hearing is simply unsupported in fact. If ever ignorance is bliss, it surely cannot ever promote justice as a societal function to be founded in knowledge. In context, I find the hearing denial to be not only unreasonable, but simply wrong. It is not the product of reason to know that you need knowledge to make thoughtful decisions; knowledge is intrinsic to reason. Without facts, you do not think, and exercised discretion becomes only arbitrary thoughtlessness. See People v. Jones, 157 Ill. App.3d 1006, 110 Ill.Dec. 895, 511 N.E.2d 1215, appeal denied 116 Ill.2d 568, 113 Ill.Dec. 310, 515 N.E.2d 119 (1987), where the court went further and ordered a new trial based on post-trial facts calling into question probable guilt.\n\nFurthermore, in regard to what could have been discovered, these cases, as well as the procedural-default decisions of the United States Supreme Court, are simply impressing an unbearable one-chance-only burden on defense counsel and financing budgets. Counsel is required to be a mind reader, pathology expert, and community busybody. If reasonable initial effort will not suffice, unreasonable effort is required, and that criteria will magnify the cost of criminal defense. Redundancy in process is always cheaper and better than attempted perfection in first application. By this type of decision, this court directly taps the state treasury in exasperated defense cost, since reasonable effort will never be sufficient for publicly defended cases, but, even more distressing, denies or at least denigrates rights to justice to those who may try to pay their own costs of defense.\n\nSociety is regularly bombarded with contention about costs of preventive medicine, but at least the confines of those costs are defined by the limitations of what may be done to one person. Preventive law as a one-chance-only imposed responsibility affords probability of exposure to almost limitless cost. In Keser, $50,000 in private investigation might not have revealed the classmates' knowledge and availability to be witnesses. This case by majority opinion personifies a request for counsel to anticipate that most if not all prosecution witnesses are uninformed or liars as intrinsic in required preparation criterion for the one-time opportunity. Self-corrective capability is not only less expensive, but more assured and efficient than perceived initial perfection which, of course, by the nature of human beings, is unachieved. In result, with rare exception, persons who are privately defended will not be properly defended, since few accused can pay for the costs required. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nDISMISSAL OF THE POST-CONVICTION RELIEF PETITION\n\nConsidered by the trial court as an aggravation factor for entry of the severe sentence, was Rickey Cutbirth's continued assertion that he was innocent. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Through unnumbered efforts since trial and appeal, he has continued a consistent effort to support his search for claimed truth. Intrinsic to development of favorable hard evidence was a gunpowder residue demonstration on the clothes that he had worn which could specifically invalidate the expert testimony which had served as a principal essence of his conviction. This physical evidence was lost while within the custody of the police authorities and was not available to the post-conviction-discovered expert for his examination. In context, it perhaps does not matter, since this court refuses to subject the factual facade of conviction to the critique of the countervailing analysis of this recognized expert.\n\nI am singularly oppressed by the legislative function of this decision in three very specific particulars. The first is to substitute limiting rules of oxymoronic dimension to deny constitutional rights. The second is to then foreclose rights of the criminal defendant by attenuation of waiver derived from the unintended deficiency in counsel representation. Finally, one last resort to relief from incompetency or ineffectiveness of counsel is denied by application of a \"concrete standard,\" and is self-determining in result since the denied constitutional right initially arose from unintended procedural default of trial or appellate counsel.\n\nWAIVER\n\nThis court is called, for Wyoming cases, to determine that the essential characteristic of the limitation of constitutional rights under post-conviction relief, other than issues which have been considered and determined in prior proceedings, is to be based on a theory of unintended waiver against the criminally charged individual. To the extent not previously acknowledged in rationale and reason, it is apparent that this supposition relates to the functioning of the counsel and not as a deliberative and controlled client decision. We find \"waiver\" described as:\n\n\"The intentional or voluntary relinquishment of a known right, or such conduct as warrants an inference of the relinquishment of such right, or when one dispenses with the performance of something he is entitled to act or when one in possession of any right, whether conferred by law or by contract, with full knowledge of the material facts, does or forbears to do something the doing of which or the failure of forbearance to do which is inconsistent with the right, or his intention to rely upon it. The renunciation, repudiation, abandonment, or surrender of some claim, right, privilege, or of the opportunity to take advantage of some defect, irregularity, or wrong.\" Black's Law Dictionary at 1417 (5th ed. 1979).\n\nThe context of the theory is more obviously to be appreciated if considered with the synonyms:\n\n\"abandonment, abandonment of a known right, abdication, abrogation, absolution, acquittal, act of relinquishing a right, clearance, deed of release, discharge, excuse, forgoing, giving up, intentional relinquishment, loss of right, release, relinquishment, renunciation, surrender, voluntary relinquishment.\" Burton's Legal Thesaurus at 512 (1980).\n\nIn the continuum of constitutional-interest dissertations of waiver found by repetition in subsequent citation and philosophic overlay (although in individual fact situation, neither is presently valid law), there are two idiomatic cases demonstrative of the philosophic bankruptcy of client-right waiver by attorney inadvertence, neglect, or ignorance. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e The first cases were State v. Daniels, 232 N.C. 196, 59 S.E.2d 430 (1950); Daniels v. Crawford, E.D.N.C., 99 F. Supp. 208 (1951); Daniels v. Allen, 192 F.2d 763 (4th Cir. 1951); and finally, in one of the more apparent comparisons of pragmatic result orientation from procedural protection by constitutional application, Brown v. Allen, 344 U.S. 443, 558, 73 S.Ct. 397, 436, 97 L.Ed. 469, reh. denied 345 U.S. 946, 73 S.Ct. 827, 97 L.Ed. 1370 (1953), where the Frankfurter dissent delineated \"jejune abstractions\" which predominated in denied relief from the recognized miscarriage of justice. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The factual inquiry in Daniels v. Allen, supra, was easily understood. Two young blacks in Pitt County, North Carolina (hardly a metropolitan area, and where racial numbers were not equivalently represented by voting capacity or asserted tax-bearing status), were convicted of murder and sentenced to death. Serious constitutional questions were created in the trial process. Notice of appeal was timely filed, but counsel for defendant, in accommodation to local rules, tried to serve subsequent appeal papers on the state attorney on a Friday, but forsaking an appropriate mailing for a Monday mail delivery, arranged for document delivery of specifications on the following Monday when the state's attorney returned to his office from a Friday-through-Sunday, out-of-town weekend. Based on the belated Monday service, although the Friday mailing would have sufficed, the untimely service by counsel for the convicted defendant led to decision that the right of appeal had been waived as denying consideration of the intrinsic constitutional interests. In rejection of the appeal, the North Carolina Supreme Court expressed its opinion that a writ of error coram nobis might be had. As the next step in the same court, an error coram nobis petition was denied on the basis that it could not be a substitute for the appeal, with an accompanying note of pique that resort to the federal courts was in progress.\n\nHabeas corpus was dismissed in the federal court as \"not available to petitioners on the procedural history.\" 99 F. Supp. at 216, although additionally the federal judge, in the nature of the \"good old boy\" adjudicatory process, read a decision that was not written and affirmed constitutional rights on a substantive basis which later in text did not interest either the reviewing circuit court or the writers in the Supreme Court decision as actually applicable.\n\nIn the Fourth Circuit Court of Appeals review, on a two-to-one basis, the denial was affirmed in part because of denial of certiorari by the United States Supreme Court from the North Carolina Supreme Court decisions, and further affirmed as a waiver by failure of initial appeal when \"lost by failure to comply with the reasonable rules of the state court.\" 192 F.2d at 766. It is noteworthy as analyzed by the dissent:\n\n\"There is no attempt on the part of the State of North Carolina in the pending appeal to show that there was not a gross violation of the constitutional rights of the prisoners in the trial court. The state's argument proceeds upon the ground that the appellants lost any right to a review of the action of the trial court of Pitt County when their attorneys failed to conform meticulously to the local procedural requirements.\" Daniels v. Allen, 192 F.2d at 771, Soper, Circuit Judge, dissenting.\n\nDaniels then came to the United States Supreme Court for consideration with two other cases where, in the 118-page opinion of Brown v. Allen, supra, Justice Reed, writing for the court, found the procedural defect in appeal decisive. A majority of the court, in distinction to the opinion of Reed (written by Justice Frankfurter), did clearly determine that the denial of certiorari had no legal significance when a later request of habeas corpus was made. Justice Frankfurter then wrote an academically literate and adjudicatorily logical dissent dissecting the waiver application — jejune abstractions. It is noteworthy to reflect, in considering Daniels as the patriarch of procedural waiver, that the intrinsic, substantive questions of coerced confessions and discriminatory processes for selection of jurors was not only thereafter corrected, but that the procedural waiver appellate question, as an abject absurdity, was impaled and extinguished in Evitts v. Lucey, 469 U.S. 387, 105 S.Ct. 830, 83 L.Ed.2d 821, reh. denied 470 U.S. 1065, 105 S.Ct. 1783, 84 L.Ed.2d 841 (1985). See White, Federal Habeas Corpus: The Impact of the Failure to Assert a Constitutional Claim at Trial, 58 Va.L.Rev. 67 (1972).\n\nThe second authors of procedural default, were the writers in State v. Thompsett, 65 Ohio.App. 378, 29 N.E.2d 967 (1940), and Tompsett v. State of Ohio, 146 F.2d 95 (6th Cir. 1944), cert. denied 324 U.S. 869, 65 S.Ct. 916, 89 L.Ed. 1424 (1945), in which, with some reason, it is addressed in stated facts that actually defendants probably were not guilty but were caught up in a very bad false identification. Not to be considered as an issue was the clear failure of reasonable legal counseling, including failure to timely file appeal documents; but rather, articulated was the waiver by acquiescence, or \"you have to raise hell with your lawyer during trial\" principle as invoked to even include waiver of jury trial:\n\n\"The concept of this rule is that the lack of skill and incompetency of the attorney is imputed to the defendant who employed him, the acts of the attorney thus becoming those of his client and so recognized and accepted by the court, unless the defendant repudiates them by making known to the court at the time his objection to or lack of concurrence in them. A defendant cannot seemingly acquiesce in his attorney's defense of him or his lack of it and, after the trial has resulted adversely to defendant, obtain a new trial because of the incompetency, negligence, fraud or unskillfulness of his attorney.\" Tompsett v. State of Ohio, 146 F.2d at 98.\n\nThe Ohio dilemma in developing history since Tompsett, and more particularly Young v. Ragen, 337 U.S. 235, 69 S.Ct. 1073, 93 L.Ed. 1333 (1949), and Case v. Nebraska, 381 U.S. 336, 85 S.Ct. 1486, 14 L.Ed.2d 422 (1965), was comprehensively considered in Comment, The Post-conviction Review Dilemma in Ohio, 44 Ohio St.L.J. 530 (1983), which justifies application to the law of Wyoming and the present court's opinion:\n\n\"In its Standards Relating to Post-Conviction Remedies the American Bar Association distinguishes between waiver as a rule of finality of judgment, that is, issues not presented at a specified time or in a specified way are said to have been waived, and the principle that a party to a criminal action can, with binding effect, make a knowing and informed choice to forego certain rights. The former is procedural, while the latter is a corollary of the law creating the right. The significance of the distinction comes into sharp focus when a federal constitutional right is considered in a state post-conviction proceeding: what constitutes a waiver in the sense of a voluntary relinquishment is a question of federal constitutional law, while the scope of a prior judgment is a question of state procedural law.\" Id. at 544.\n\n\"Notwithstanding federal-state disparities, closing the doors of both the Ohio and the federal courts bespeaks a policy that values efficient judicial proceedings more highly than either the scrupulous protection of individual rights or the maintenance of safeguards within the criminal process. Without legislative action, the immediate results will be increased risk that the innocent will be convicted and that a defense attorney's error, inexperience, lack of diligence, or tactical decision will produce an irremediable forfeiture of rights.\" Id. at 567.\n\nAs illustrated in other texts, the federal system direction in recent years is to a result-oriented disregard of basic and fundamental right protection as seen by Justice Brennan in Engle v. Isaac, 456 U.S. 107, 144, 102 S.Ct. 1558, 71 L.Ed.2d 783, reh. denied 457 U.S. 1141, 102 S.Ct. 2976, 73 L.Ed.2d 1361 (1982), Justice Brennan dissenting:\n\n\"The Court's analysis is completely result-oriented, and represents a noteworthy exercise in * * * judicial activism * * *.\"\n\nUnfortunately, in absolving lawyering failure by the arcane theory of procedural default, I see no prospect in the opinion of this court that we go in the direction of decreasing the frequency of these constitutional-right forfeitures, or that we go forward in the promotion of professional skill, by shifting the burden of constitutional protection to our state courts as arguably justified to the extent that we in the state judiciary should be best situated to decrease the frequency of procedural defaults and to promote professional skill. Post-conviction Review Dilemma, supra at 567, footnoting Comment, Federal Habeas Corpus Review of Unintentionally Defaulted Constitutional Claims, 130 U.Pa.L.Rev. 981 (1982). The University of Pennsylvania Comment observed:\n\n\"Analysis of why procedural defaults occur suggests that individual attorneys could eliminate at least some of them. For example, if an attorney could work longer hours without ceasing to be effective, the attorney could avoid those defaults caused by spending too little time per case: the attorney could simply put in more time. Attorneys could likewise avoid those defaults caused by lack of knowledge of recent legal developments by undertaking self-imposed continuing education regimens, such as reading professional journals or attending seminars.\" Id. at 1006.\n\n\"Rather than branding as ineffective the assistance of any attorney who defaults a valid constitutional claim, the courts are likely to find that some unintentional defaults do not constitute ineffective assistance of counsel.\" Id. at 1009.\n\nThe substance of the analysis is that, in using a reasonableness standard (or its equivalent), ineffectiveness should be defined in terms of normal attorney conduct:\n\n\"The courts could take a selective ineffectiveness approach in three ways. First, they could enunciate a standard, such as reasonableness, against which procedural defaults would be judged; if the default is unreasonable then the attorney has provided ineffective assistance. Second, a court could identify `special' rights, default of which would always constitute ineffectiveness; for example, the court could say that default of a valid fourth amendment claim always constitutes ineffectiveness in a case in which the prosecution introduces the fruits of a warrantless search. Third, the courts could protect constitutional rights against default by requiring the states to employ certain of the tools at the state's command to decrease the incidence of procedural defaults.\" Id. at 1010.\n\nThe present difficulty in judicial analysis and disposition is not raised in a case where the prior appeal, if any, examined constitutional issues and denied relief as then would constitute res judicata, stare decisis, collateral estoppel, or issue preclusion for a later-instituted post-conviction-relief proceeding which could only reanalyze what had already been determined in first trial and appeal. We are here faced with what was not considered and was not decided as the essential examination in this litigation, and for my dissent.\n\nIn practical fact, then, the concept of waiver is more appropriately defined as neglect, ignorance, unintended mistake, or defective decision of the attorney. It should not be ignored, in the words of Justice Frankfurter, by \"jejune abstraction.\" Brown v. Allen, 344 U.S. at 558, 73 S.Ct. at 436. It must also be recognized in the proper concept of the word that choice and waiver are not synonymous. In reality, most of the decisions made are justified as strategic choices when, in fact, empirically, from the standpoint of the welfare of the client, they represent waiver. In recognition of the thesis presented by the court, it is appropriate to supply the essence to the concept, rather than reliance only on the disingenuous word \"waiver.\"\n\nIf the idealism of legal precedence is relevant to jurisprudence, it is pertinent to note that Justice Black spoke in similar terms 50 years ago:\n\n\"* * * A waiver is ordinarily an intentional relinquishment or abandonment of a known right or privilege. The determination of whether there has been an intelligent waiver of the right to counsel must depend, in each case, upon the particular facts and circumstances surrounding that case, including the background, experience, and conduct of the accused.\" Johnson v. Zerbst, 304 U.S. 458, 464, 58 S.Ct. 1019, 1023, 82 L.Ed. 1461 (1938).\n\nIn reviewing the development of post-conviction relief, Larry W. Yackle, Post-conviction Remedies, pp. 16-17 (1981), a foundational text, observes:\n\n\"* * * [I]n many states habeas relief was denied when the prisoner's claims were not, but might have been, raised at trial or on direct review. This was, of course, to rest upon an inferential waiver theory — reading the prisoner's procedural default as an implicit waiver of the opportunity to litigate a claim, or, indeed, the underlying right itself. In truth, the theory had little to do with waiver and much to do with forfeiture.\"\n\nHistorians, sociologists, and philosophers opine that we of this democratic nation are wont to create mirages, facades or hero images as substitutes for reality. It is in the nature of such a most terribly unjustified fallacy that the criminal defendant is condemned by the action, aptitudes, and competency of his counsel. Originally, this principle arose out of theories of agency in that the client won or lost based on what his attorney, as his agent, did or did not do. However, the application of the principle in civil law has different characteristics, and particularly so since the agent can be liable to the principal for accrued liability caused by negligence measured in recovery of damage. But in criminal context, we do not say that the incompetent attorney goes to jail to serve the sentence for the improperly represented defendant. An extended and comprehensive analysis of waiver is found in Comment, Criminal Waiver: The Requirements of Personal Participation, Competence, and Legitimate State Interest, 54 Cal.L.Rev. 1262 (1966).\n\nSo what, then, as a fiction without logic, reason, or justification, is now to be substituted for contention that conduct of the attorney constitutes constitutional-rights waiver by the client? Only if the strongest criteria of Strickland v. Washington, 466 U.S. 668, 104 S.Ct. 2052, 80 L.Ed.2d 674, reh. denied 467 U.S. 1267, 104 S.Ct. 3562, 82 L.Ed.2d 864 (1984), or similarly constituted non-responsibility, insulative legal competency protection theories can be breached, will the individual have process afforded those constitutional guarantees. Almost never, or at least seldom, does a criminal defendant knowledgeably waive anything. The decision by intent or ignorance in doing or neglecting is that of the attorney. As a horrifying example, see Laing v. State, supra, 746 P.2d 1247. We reach the status described in Rosenberg, Jettisoning Fay v. Noia: Procedural Defaults by Reasonably Incompetent Counsel, 62 Minn.L.Rev. 341, 448 (1978), characterizing the attorney-client relationship in a criminal case as one in which the servant is omnipotent and the master subservient. Cf. Johnson v. State, Wyo., 562 P.2d 1294, 1300 (1977), where this court, in discussing ineffective counsel, observed that the client had the right to determine whether to plead guilty, waive a jury trial, or testify, and \"[a]ll other areas, including the decision whether to call or not to call a witness, are in the control of the defendant's counsel, who is the master of the proceedings.\" (Emphasis added.)\n\nPOST-CONVICTION RELIEF STATUTES\n\nThe purposes of state legislative enactment or judicial promulgation of rules on post-conviction-relief proceedings was to establish a defined, noncumbersome process to decide constitutional issues by providing a state remedy to minimize trial of state criminal issues in federal proceedings under the United States Constitution. Raper, Post Conviction Remedies, 19 Wyo. L.J. 213 (1965). Most states have some form of relief mechanism which may involve different characteristics (as does Wyoming), including statutory adoption, post-conviction proceedings by supreme court rules, or augmented or differentiated utilization of habeas corpus by statute or rule. States with post-conviction-relief statutes include, for example: Colorado, Idaho, Illinois, Iowa, Louisiana, Maine, Maryland, Montana, Nebraska, Nevada, New Mexico, North Carolina, North Dakota, Ohio, Oklahoma, Oregon, Pennsylvania, Rhode Island, South Carolina, Tennessee, and Wisconsin. Among the states which utilize a court rule, sometimes solely or in conjunction with a statute, are, as examples: Alaska, Arizona, Arkansas, Colorado, Florida, Idaho, Illinois, Indiana, Kansas, Massachusetts, Utah, and Wisconsin. See Larry W. Yackle, Post-conviction Remedies, supra, § 13 at 65. A comprehensive analysis of justifications for and divergences among state post-conviction-relief processes is found in Documentary Supplement, State Post-Conviction Remedies and Federal Habeas Corpus, 12 Wm. \u0026 Mary L.Rev. 149 (1970).\n\nThe Wyoming post-conviction statute first enacted by the Wyoming legislature by Ch. 63, S.L. of Wyoming 1961, \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e now § 7-14-101, W.S. 1977, has continued past Title 7 renovation, through 1987 revision, essentially in its original form. Criteria for relief include:\n\n(a) incarceration for a felony conviction, § 7-14-101(b), W.S. 1977;\n\n(b) commenced within five (5) years of conviction and sentencing, § 7-14-101(c), W.S. 1977;\n\n(c) any claim of substantial denial of constitutional rights not raised in the original or an amended petition is waived, Bibbins v. State, Wyo.,741 P.2d 115 (1987);\n\n(d) by assertion \"that in the proceedings which resulted in his conviction there was a substantial denial of his rights under the constitution of the United States or the state of Wyoming, or both,\" § 7-14-101(b), W.S. 1977.\n\nIn Wyoming, embodied within the proceedings and discernible only from the case for which the rule was derived, Hopkinson v. State, Wyo., 664 P.2d 43, cert. denied 464 U.S. 908, 104 S.Ct. 262, 78 L.Ed.2d 246 (1983), there is a further criterion that the proceeding is ancillary to the initial plea disposition or final conviction and not an independent, constitutional-right ascertainment proceeding. The improvidence of that decision, made specifically to deny application of a peremptory challenge otherwise available to change judges, is not here presented.\n\nPost-conviction relief was designed to dispose of claims of a constitutional nature on the merits and not with technical-issue avoidance which may to some seem to provide an immediate, easy answer but usually only serves to prolong judicial inquiry. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Confusion is magnified when the specialized post-conviction process is excised by repeal, as it has been in one state, South Dakota, with concurrent introduction of activated habeas corpus and reinstated coram nobis to address the recognized constitutional requirements, Comment, Coram Nobis as a Post-Conviction Remedy: Flight of the Phoenix?, 32 S.D.L.Rev. 300 (1987), which may invoke \"an increase in confusion and obfuscation of an area of the law already sufficiently complex and ambiguous.\" In the article, the author discusses what he describes as the vaporous and amorphous common-law remedy of coram nobis as the less-than-perfect replacement. Id. at 321. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nHISTORY OF STATE REQUIREMENTS TO AVOID INITIAL FEDERAL COURT REVIEW\n\nThe basic law as an adjudicatory standard relating to the absence of an adequate state remedy to deny federal habeas corpus was defined in Young v. Ragen, supra, 337 U.S. 235, 69 S.Ct. 1073, and Case v. Nebraska, supra, 381 U.S. 336, 85 S.Ct. 1486. Whatever has occurred within the tumultuous counter-movements since 1949, the basic standard remains uninhibited as determining that if a state process is not available to consider liberty issues under the United States Constitution in criminal conviction, exhaustion of state remedies is not presented and resort to the federal processes in the nature of habeas corpus or coram nobis is immediately available. Chief Justice Vinson, writing for the court in Ragen, determined:\n\n\"* * * The doctrine of exhaustion of state remedies, to which this Court has required the scrupulous adherence of all federal courts, Ex parte Hawk, 321 U.S. 114 [64 S.Ct. 448, 88 L.Ed. 572 (1944)] and cases cited, presupposes that some adequate state remedy exists. We recognize the difficulties with which the Illinois Supreme Court is faced in adapting available state procedures to the requirement that prisoners be given some clearly defined method by which they may raise claims of denial of federal rights. Nevertheless, that requirement must be met.\" Young v. Ragen, 337 U.S. at 238-239, 69 S.Ct. at 1074-75.\n\nRe-emphasized in Case v. Nebraska, supra, it was stated by per curiam opinion and by concurrence of Justice Clark in recognizing the contribution of Ragen to the passage of state post-conviction remedies:\n\n\"* * * `The doctrine of exhaustion of state remedies, to which this Court has required the scrupulous adherence of all federal courts . . . presupposes that some adequate state remedy exists.'\" 381 U.S. at 338, 85 S.Ct. at 1487, quoting from Young v. Ragen, 337 U.S. at 238-239, 69 S.Ct. at 1074.\n\n\"Strangely enough there has been little light thrown on the necessity for more effective post-conviction remedies in the States. In 1958 the Burton Committee reported out a preliminary draft of findings in which it stated\n\n\"`that the law of state post-conviction process in many states was wholly inadequate to cope with the demands now being placed upon it. In some jurisdictions prisoners were altogether precluded from direct access to the courts. [Cochran v. Kansas, 316 U.S. 255, 86 L.Ed. 1453, 62 S.Ct. 1068 (1942); Dowd v. Cook, 340 U.S. 206, 95 L.Ed. 215, 71 S.Ct. 262, 10 A.L.R.2d 784 (1951).] . . . In many more, the procedures recognized by state law failed to provide genuine opportunities for testing constitutional issues of the most numerous and important types. The result was that prisoners often failed to obtain hearings on their allegations in the state courts. This, in turn, increased the number of petitions in state and federal courts and was generally productive of frustrations in all persons concerned with the process.'\n\n\"I hope that the various States will follow the lead of Illinois, Nebraska, Maryland, North Carolina, Maine, Oregon and Wyoming in providing this modern procedure for testing federal claims in the state courts and thus relieve the federal courts of this everincreasing burden.\" (Emphasis added.) 381 U.S. at 339-340, 85 S.Ct. at 488-89.\n\nJustice Brennan, in concurrence, with recognition of Townsend v. Sain, 372 U.S. 293, 83 S.Ct. 745, 9 L.Ed.2d 770 (1963), and Fay v. Noia, 372 U.S. 391, 83 S.Ct. 822, 9 L.Ed.2d 837 (1963), further admonished:\n\n\"None can view with satisfaction the channeling of a large part of state criminal business to federal trial courts. If adequate state procedures, presently all too scarce, were generally adopted, much would be done to remove the irritant of participation by the federal district courts in state criminal procedure.\" 381 U.S. at 345-346, 85 S.Ct. at 492.\n\nIt is apparent that historically Ragen and Case did not spring uncultivated from barren and unplowed terrain. Justices Holmes and Hughes, in the 1915 dissent in Frank v. Mangum, 237 U.S. 309, 35 S.Ct. 582, 59 L.Ed. 969 (1915), recognized that constitutional-rights violations required intervention of federal court examination. That dissent became a majority standard in Moore v. Dempsey, 261 U.S. 86, 43 S.Ct. 265, 67 L.Ed. 543 (1923), and then the safeguard of the liberty obligation of the federal judiciary was intrinsically woven into the fabric of our society by Justice Black in Johnson v. Zerbst, supra, 304 U.S. 458, 466-467, 58 S.Ct. 1019, 1024: \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\n\"`* * * [A] prisoner in custody pursuant to the final judgment of a state court of criminal jurisdiction may have a judicial inquiry in a court of the United States into the very truth and substance of the causes of his detention, although it may become necessary to look behind and beyond the record of his conviction to a sufficient extent to test the jurisdiction of the state court to proceed to judgment against him. . . .\n\n\"`. . . it is open to the courts of the United States upon an application for a writ of habeas corpus to look beyond forms and inquire into the very substance of the matter . . .'\"\n\nThis principle, further recognized in Glasser v. United States, 315 U.S. 60, 62 S.Ct. 457, 86 L.Ed. 680, reh. denied sub nom. Kretske v. United States, 315 U.S. 827, 62 S.Ct. 629, 86 L.Ed. 1222 (1942), was more specifically and emphatically applied in Ex parte Hawk, 321 U.S. 114, 64 S.Ct. 448, 88 L.Ed. 572 (1944):\n\n\"* * * [W]here resort to state court remedies has failed to afford a full and fair adjudication of the federal contentions raised, either because the state affords no remedy * * * or because in the particular case the remedy afforded by state law proves in practice unavailable or seriously inadequate, * * * a federal court should entertain his petition for habeas corpus, else he would be remediless.\" 321 U.S. at 118, 64 S.Ct. at 450.\n\nSee also, White v. Ragen, 324 U.S. 760, 65 S.Ct. 978, 89 L.Ed. 1348, reh. denied 326 U.S. 807, 66 S.Ct. 133, 90 L.Ed. 492 (1945). \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nFROM YOUNG v. RAGEN TO WAINWRIGHT v. SYKES CAUSE AND PREJUDICE\n\nOnce the Supreme Court had defined the federal right to test state conviction by habeas corpus, the arena of conflict embodying state-system procedural default moved from the Ragen decision of 1949 to new examinations of by-pass, waiver, or forfeiture, as an attack on any conclusionary examination in the federal court of the claimed constitutional violations which had occurred in state court conviction. This campaign, now reaching a Battle of the Wilderness status, is where appellant Cutbirth, in this case, seeks to avoid initial forfeiture of his constitutional right deleted from the state court proceeding, which later may establish further waiver to deny future federal court protection of United States constitutional rights. Consequently, what was not considered by the state court by procedural default waiver may also be foreclosed from federal court constitutional protection.\n\nFollowing Brown v. Allen, supra, 344 U.S. 443, 73 S.Ct. 397, the Warren court examination of federal habeas corpus review of the state court constitutional decisional process was introduced, and the 1962 trilogy followed, Townsend v. Sain, supra; Fay v. Noia, supra; and Sanders v. United States, 373 U.S. 1, 83 S.Ct. 1068, 10 L.Ed.2d 148 (1963), as accommodative to the seminal decision of Gideon v. Wainwright, 372 U.S. 335, 83 S.Ct. 792, 9 L.Ed.2d 799 (1963), which resolved rights to counsel in state courts for criminal defense. Townsend, which involved a barbiturate and truth-serum-derived confession, was reversed on federal court inquiry after state conviction. The Supreme Court there established criteria and requirements for these federal court hearings, including six elements many times since cited:\n\n\"* * * If (1) the merits of the factual dispute were not resolved in the state hearing; (2) the state factual determination is not fairly supported by the record as a whole; (3) the fact-finding procedure employed by the state court was not adequate to afford a full and fair hearing; (4) there is a substantial allegation of newly discovered evidence; (5) the material facts were not adequately developed at the state-court hearing; or (6) for any reason it appears that the state trier of fact did not afford the habeas applicant a full and fair fact hearing.\" Townsend v. Sain, 372 U.S. at 313, 83 S.Ct. at 757.\n\nIn Fay, Justice Brennan considered denial of post-conviction coram-nobis relief on grounds of failure to appeal state conviction and the post-Ragen waiver as an inferred forfeiture decision. That standard, which now continues, if at all, in intermediate and probably indeterminate status, precipitated the procedural default philosophic conflict. Fay was founded in intended relinquishment, therein introductively noted, and since to be observed emphatically:\n\n\"* * * Our development of the law of federal habeas corpus has been attended, seemingly, with some backing and filling.\" Fay v. Noia, 372 U.S. at 412, 83 S.Ct. at 834.\n\nIn case substance, analyzing comity and abstention as related to procedural default, there was born the only fleeting condiment of deliberate by-pass:\n\n\"A practical appraisal of the state interest here involved plainly does not justify the federal courts' enforcing on habeas corpus a doctrine of forfeitures under the guise of applying the adequate state-ground rule. We fully grant * * * that the exigencies of federalism warrant a limitation whereby the federal judge has the discretion to deny relief to one who has deliberately sought to subvert or evade the orderly adjudication of his federal defenses in the state courts. Surely no stricter rule is a realistic necessity.\" Fay v. Noia, 372 U.S. at 433, 83 S.Ct. at 846.\n\n\"* * * At all events we wish it clearly understood that the standard here put forth depends on the considered choice of the petitioner. * * * A choice made by counsel not participated in by the petitioner does not automatically bar relief. Nor does a state court's finding of waiver bar independent determination of the question by the federal courts on habeas, for waiver affecting federal rights is a federal question.\" Fay v. Noia, 372 U.S. at 439, 83 S.Ct. at 849.\n\nIn Henry v. Mississippi, 379 U.S. 443, 446-447, 85 S.Ct. 564, 567, 13 L.Ed.2d 408, reh. denied 380 U.S. 926, 85 S.Ct. 878, 13 L.Ed.2d 813 (1965), which followed, the court recognized:\n\n\"* * * [I]mportant to distinguish between state substantive grounds and state procedural grounds.\n\n\"* * * [A] litigant's procedural defaults in state proceedings do not prevent vindication of his federal rights unless the State's insistence on compliance with its procedural rule serves a legitimate state interest.\"\n\nDeliberate by-pass was again asserted as a foundation for forfeiture.\n\nFollowing Case v. Nebraska, supra, of 1965, and the end of the Warren court, the Burger court, embodying a changed majority, annihilated Fay, but not on the underlying thesis of Ragen, which has survived in full effect. Building upon the abstention and comity cases of Younger v. Harris, 401 U.S. 37, 91 S.Ct. 746, 27 L.Ed.2d 669 (1971); Samuels v. Mackell, 401 U.S. 66, 91 S.Ct. 764, 27 L.Ed.2d 688 (1971); Boyle v. Landry, 401 U.S. 77, 91 S.Ct. 758, 27 L.Ed.2d 696 (1971); Perez v. Ledesma, 401 U.S. 82, 91 S.Ct. 674, 27 L.Ed.2d 701 (1971); Dyson v. Stein, 401 U.S. 200, 91 S.Ct. 769, 27 L.Ed.2d 781 (1971); and Byrne v. Karalexis, 401 U.S. 216, 91 S.Ct. 777, 27 L.Ed.2d 792 (1971), followed by Preiser v. Rodriguez, 411 U.S. 475, 93 S.Ct. 1827, 36 L.Ed.2d 439 (1973), the newly constituted court had opportunity to recede from Fay in Estelle v. Williams, 425 U.S. 501, 96 S.Ct. 1691, 48 L.Ed.2d 126, reh. denied 426 U.S. 954, 96 S.Ct. 3182, 49 L.Ed.2d 1194 (1976), in finding unknowing waiver by defendant accompanied by either ignorance, incompetence, or cowardice of counsel from trial appearance in jail garments in admitted violation of constitutional rights. Brennan, in dissent, recognized the emergence of implied waiver of constitutional rights and the demise of the Johnson v. Zerbst voluntary-waiver test. Thus was cultivated the present retreat from substantive-issue decision to incompetency or ineffectiveness-of-counsel inquiry, with all the pitfalls and idiosyncrasies soon to be developed. Strickland v. Washington, supra, 466 U.S. 668, 104 S.Ct. 2052; United States v. Cronic, 466 U.S. 648, 104 S.Ct. 2039, 80 L.Ed.2d 657 (1984).\n\nThe watershed then arrived in adjudicatory plateau, perceived by some, including this writer, to be characterized as adjudicatory aberration, where the oxymoron developed full-flower in Wainwright v. Sykes, 433 U.S. 72, 97 S.Ct. 2497, 53 L.Ed.2d 594, reh. denied 434 U.S. 880, 98 S.Ct. 241, 54 L.Ed.2d 163 (1977), where the Fay deliberate by-pass was by-passed or superceded by substitution of the present rule of cause and prejudice which had been enunciated earlier for application to federal court proceedings involving federal court convictions in Davis v. United States, 411 U.S. 233, 93 S.Ct. 1577, 36 L.Ed.2d 216 (1973). That case, in defining that absent a showing of cause for defendant (attorney failure to challenge the composition of the grand jury before trial) but also \"actual prejudice\" id. at 245, 93 S.Ct. at 1584, decreed that a right to reversal was not demonstrated. The application of Davis to state cases had been foreshadowed by Francis v. Henderson, 425 U.S. 536, 96 S.Ct. 1708, 48 L.Ed.2d 149 (1976), in holding that pretrial failure to object to grand-jury composition in state court constituted waiver, as would be the identical result in initial federal court proceedings. Consequently, by derivation of an operational rule of the federal court from Davis to equality and no more in Henderson, a rule of application for procedural default in all character was graduated to Sykes. What was cause for forfeiture with unintended waiver was not there defined or in more recent cases established with specificity, although the general standard adduced is that the defendant is impaled with procedural default for unintended forfeiture arising from the negligence, ignorance, or incompetency of counsel unless afforded relief by proof of cause and prejudice. Cause by definition is seldom found, since the misadventure of the attorney's conduct is, in these cases, unintended.\n\n\"The `cause'-and-`prejudice' exception of the Francis rule will afford an adequate guarantee, we think, that the rule will not prevent a federal habeas court from adjudicating for the first time the federal constitutional claim of a defendant who in the absence of such an adjudication will be the victim of a miscarriage of justice. Whatever precise content may be given those terms by later cases, we feel confident in holding without further elaboration that they do not exist here. Respondent has advanced no explanation whatever for his failure to object at trial, and, as the proceeding unfolded, the trial judge is certainly not to be faulted for failing to question the admission of the confession himself.\" Wainwright v. Sykes, 433 U.S. at 90-91, 97 S.Ct. at 2508-09.\n\nFactually, the court there recognized in statement of fact that the obvious and essential responsibility of counsel to object to challengeable statement introduction was not met.\n\n\"At no time during the trial, however, was the admissibility of any of respondent's statements challenged by his counsel on the ground that respondent had not understood the Miranda warnings. Nor did the trial judge question their admissibility on his own motion or hold a factfinding hearing bearing on that issue.\" 433 U.S. at 75, 97 S.Ct. at 2500.\n\nJustice Burger, in concurrence, spoke to a differentiation of intrial decision where a \"`knowing and intelligent waiver' is simply inapplicable.\" Id. at 94, 97 S.Ct. at 2510. Justice Brennan, in dissent joined by Justice Marshall, in analyzing both the court's opinion and concurrences, recognized the essential question:\n\n\"Punishing a lawyer's unintentional errors by closing the federal courthouse door to his client is both a senseless and misdirected method of deterring the slighting of state rules. It is senseless because unplanned and unintentional action of any kind generally is not subject to deterrence; and, to the extent that it is hoped that a threatened sanction addressed to the defense will induce greater care and caution on the part of trial lawyers, thereby forestalling negligent conduct or error, the potential loss of all valuable state remedies would be sufficient to this end. And it is a misdirected sanction because even if the penalization of incompetence or carelessness will encourage more thorough legal training and trial preparation, the habeas applicant, as opposed to his lawyer, hardly is the proper recipient of such a penalty.\" (Emphasis added.) Id. at 113, 97 S.Ct. at 2520.\n\nFinality for a while, until the inevitable reaction and restoration of constitutional protection which will sometime hereafter occur in the federal jurisdiction, came in Engle v. Isaac, supra, 456 U.S. 107, 102 S.Ct. 1558, where failure to object to the constitutionally prescribed burden-of-proof/self-defense instruction was considered. Forfeiture of constitutional right, in direct concept of counsel ignorance, neglect, or incompetency, was directly presented as a justification for decision. Demonstrating something less than applied trial knowledge of court processes, the rule is advanced:\n\n\"We note at the outset that the futility of presenting an objection to the state courts cannot alone constitute cause for a failure to object at trial. If a defendant perceives a constitutional claim and believes it may find favor in the federal courts, he may not bypass the state courts simply because he thinks they will be unsympathetic to the claim. Even a state court that has previously rejected a constitutional argument may decide, upon reflection, that the contention is valid.\" (Emphasis added.) 456 U.S. at 130, 102 S.Ct. at 1573.\n\nJudicial activism and constitutional denigration were well illuminated in comment by Justice Brennan:\n\n\"* * * In my view, the Sykes standard is misguided and insupportable in any context. But if it is to be suffered to exist at all, it should be limited to the arguable peripheries of the trial process: It should not be allowed to insulate from all judicial review all violations of the most fundamental rights of the accused.\" 456 U.S. at 151, 102 S.Ct. at 1584.\n\nUnited States v. Frady, 456 U.S. 152, 102 S.Ct. 1584, 71 L.Ed.2d 816, reh. denied 456 U.S. 1001, 102 S.Ct. 2287, 73 L.Ed.2d 1296 (1982), of the same date, afforded a similar result in rejecting a plain-error thesis for reversal. Reed v. Ross, 468 U.S. 1, 104 S.Ct. 2901, 82 L.Ed.2d 1 (1984) followed. By review of trial-time failure to raise the unconstitutionality of a jury instruction on burden of proof several years before any successful challenge of the rule had been made, the instruction at trial time had been proved by the state court in North Carolina for a century. Mullany v. Wilber, 421 U.S. 684, 95 S.Ct. 1881, 44 L.Ed.2d 508 (1975) was yet six years away, and served to invalidate the reversed burden-of-proof instruction. Cause and prejudice were found under Engle and Frady by the circuit court upon remand, and the Supreme Court affirmed, in an opinion by Justice Brennan, with the novelty issue as cause. Justice Rehnquist, in strong disagreement, contended that trial counsel should have anticipated the later change in the broad-based United States Supreme Court decisions on burden of proof.\n\nProcedural default was discerned by Justice Stevens in a case involving failure of counsel to more diligently attack a questioned juror, Wainwright v. Witt, 469 U.S. 412, 105 S.Ct. 844, 83 L.Ed.2d 841 (1985), although the Rehnquist opinion decided the substantive issue of the death-penalty-qualified juror. The Stevens ratio decidendi sounded in intentional strategy as attorney forfeiture of rights of client. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e See Sandstrom v. Montana, 442 U.S. 510, 99 S.Ct. 2450, 61 L.Ed.2d 39 (1979); Patterson v. New York, 432 U.S. 197, 97 S.Ct. 2319, 53 L.Ed.2d 281 (1977); Mullany v. Wilber, supra; and discussion of Justice Marshall in dissent in denial of certiorari involving constitutionally affected counsel, Strickland v. Washington, supra, 466 U.S. 668, 104 S.Ct. at 2055; Waye v. Morris, 469 U.S. 908, 105 S.Ct. 282, 83 L.Ed.2d 218 (1984); and further in certiorari denial, Justice Brennan in Moran v. Ohio, 469 U.S. 948, 105 S.Ct. 350, 83 L.Ed.2d 285 (1984). The Sykes importunity of implied forfeiture invoked by counsel decision is not unnoticed in Tenth Circuit opinion comment. See Dutton v. Brown, 812 F.2d 593 (10th Cir.), cert. denied sub nom. Dutton v. Maynard, ___ U.S. ___, 108 S.Ct. 116, 98 L.Ed.2d 74 (1987); Andrews v. Shulsen, 802 F.2d 1256 (10th Cir. 1986); Wolff v. United States, 737 F.2d 737 (10th Cir. 1984); Hux v. Murphy, 733 F.2d 737 (10th Cir. 1984), overruled on other grounds sub nom. Wiley v. Rayl, 767 F.2d 679 (10th Cir. 1985).\n\nThe instability on the subject in the United States Supreme Court is demonstrated by three even more recent cases decided within the past two years. Murray v. Carrier, 477 U.S. 478, 106 S.Ct. 2639, 91 L.Ed.2d 397 (1986) reversed the en banc decision of the Fourth Circuit in Carrier v. Hutto, 754 F.2d 520 (4th Cir. 1985), where the omission error of defense counsel in state court appeal was in apprisal of claimed error of denial by the trial judge of defendant's right to examine victim's statements. The majority concluded that omission \"inadvertence\" of defense counsel rather than deliberate choice as some kind of planned strategy would not in itself constitute cause within the procedural default thesis of Engle:\n\n\"We think, then, that the question of cause for a procedural default does not turn on whether counsel erred or on the kind of error counsel may have made. So long as a defendant is represented by counsel whose performance is not constitutionally ineffective under the standard established in Strickland v. Washington, supra, we discern no inequity in requiring him to bear the risk of attorney error that results in a procedural default. Instead, we think that the existence of cause for a procedural default must ordinarily turn on whether the prisoner can show that some objective factor external to the defense impeded counsel's efforts to comply with the State's procedural rule. Without attempting an exhaustive catalog of such objective impediments to compliance with a procedural rule, we note that a showing that the factual or legal basis for a claim was not reasonably available to counsel, see Reed v. Ross, 468 U.S., at 16, 104 S.Ct., at 2910, or that `some interference by officials,' Brown v. Allen, 344 U.S. 443, 486, 73 S.Ct. 397, 422, 97 L.Ed. 469 (1953), made compliance impracticable, would constitute cause under this standard.\n\n\"Similarly, if the procedural default is the result of ineffective assistance of counsel, the Sixth Amendment itself requires that responsibility for the default be imputed to the State, which may not `conduc[t] trials at which persons who face incarceration must defend themselves without adequate legal assistance.' * * * Ineffective assistance of counsel, then, is cause for a procedural default. However, we think that the exhaustion doctrine, which is `principally designed to protect the state courts' role in the enforcement of federal law and prevent disruption of state judicial proceedings,' * * * generally requires that a claim of ineffective assistance be presented to the state courts as an independent claim before it may be used to establish cause for a procedural default.\" 106 S.Ct. at 2645-2646.\n\nThis Justice O'Connor message of failed justice is denial by cause and prejudice, was tempered with relief, if any, only to be available for attack on counsel which must first be presented, if it can, within state court process. It was apparent that the language of the five-member majority opinion placed Evitts v. Lucey, supra, 469 U.S. 387, 105 S.Ct. 830, in present question, but then the majority added:\n\n\"* * * We remain confident that, for the most part, `victims of a fundamental miscarriage of justice will meet the cause-and-prejudice standard.' * * * But we do not pretend that this will always be true. Accordingly, we think that in an extraordinary case, where a constitutional violation has probably resulted in the conviction of one who is actually innocent, a federal habeas court may grant the writ even in the absence of a showing of cause for the procedural default.\" (Emphasis added.) 106 S.Ct. at 2650.\n\nThe concurrence of Justices Stevens and Blackmun noted accurately that Daniels had been repudiated by Fay, while stating in addition that \"the [Fay] opinion also, however, contained certain dicta that has been qualified by later opinions.\" 106 S.Ct. at 2651. The concurrence spoke for a rule of manifest injustice in consideration upon remand, but not in adoption of majority thesis of the opinion. Justice Brennan in dissent reiterated statements in earlier cases, 106 S.Ct. at 2682, with consistent distaste by characterizing Sykes as \"an illegitimate exercise of discretion.\" At the very least, one would also be called to agree with comment of the majority that \"[t]he cause and prejudice test may lack a perfect historical pedigree.\" (Emphasis added.) 106 S.Ct. at 2650. A well-traveled barnyard term might more aptly apply.\n\nMurray v. Carrier, supra, was followed by Smith v. Murray, 477 U.S. 527, 106 S.Ct. 2661, 91 L.Ed.2d 434 (1986) in a five-to-four conclusion, with dissents by Justices Stevens and Brennan which again invoked failure in state court to raise appeal issue. In rejecting novelty of issue as a cause for escape from the procedural-default constitutional-right forfeiture, Justice O'Connor continued the mind-reader thesis that:\n\n\"* * * the question is not whether subsequent legal developments have made counsel's task easier, but whether at the time of the default the claim was `available' at all.\" 106 S.Ct. at 2667.\n\n\"* * * Under these circumstances, it simply is not open to argue that the legal basis of the claim petitioner now presses on federal habeas was unavailable to counsel at the time of the direct appeal.\" 106 S.Ct. at 2668.\n\nAs we contemplate the enormity of conclusion, it is realistic to otherwise concur that travel to Mars is \"now\" available but the intrinsic process as required to do it may not be developed for the next one thousand years.\n\nHaving then failed to find cause in unexcluded potential anticipation, the decision moves:\n\n\"* * * Accordingly, `where a constitutional violation has probably resulted in the conviction of one who is actually innocent, a federal habeas court may grant the writ even in the absence of a showing of cause for the procedural default.' Murray v. Carrier, 106 S.Ct. at 2650. \"We acknowledge that the concept of `actual,' as distinct from `legal,' innocence does not translate easily into the context of an alleged error at the sentencing phase of a trial on a capital offense. Nonetheless, we think it clear on this record that application of the cause and prejudice test will not result in a `fundamental miscarriage of justice.' Engle, 456 U.S. at 135, 102 S.Ct. at 1576.\" 106 S.Ct. at 2668.\n\nOne can consequently appreciate the conclusion that initiated dissent of Justice Stevens:\n\n\"The record in this case unquestionably demonstrates that petitioner's constitutional claim is meritorious, and that there is a significant risk that he will be put to death because his constitutional rights were violated.\" 106 S.Ct. at 2669.\n\nIn thoughtfulness, it then is added for our edification that if, as the majority here does, we are to adopt the federal rule,\n\n\"* * * If accuracy in the determination of guilt or innocence were the only value of our criminal justice system, then the Court's analysis might have a great deal of force. If accuracy is the only value, however, then many of our constitutional protections — such as the Fifth Amendment right against compelled self-incrimination and the Eighth Amendment right against cruel and unusual punishment, the very claims asserted by petitioner — are not only irrelevant, but possibly counter-productive. Our Constitution, however, and our decision to adopt an `accusatorial,' rather than an `inquisitorial' system of justice, reflect a different choice. That choice is to afford the individual certain protections — the right against compelled self-incrimination and the right against cruel and unusual punishment among them — even if those rights do not necessarily implicate the accuracy of the truth-finding proceedings. Rather, those protections are an aspect of the fundamental fairness, liberty, and individual dignity that our society affords to all, even those charged with heinous crimes.\" 106 S.Ct. at 2671-2672.\n\nThis controverted zigzag \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e has not yet ended, since most recently procedural default was again revisited by the United States Supreme Court in state court denial of witness to defendant because of counsel failure to list in advance as pretrial requirement. On a five-to-three vote, this convolution of constitutional rights of the accused defendant was justified, which I find to be not singularly different from what was proscribed since Daniels, because of counsel's procedural default causing constitutional forfeiture of rights of the accused to defend with available witnesses. Taylor v. Illinois, ___ U.S. ___, 108 S.Ct. 646, 98 L.Ed.2d 798 (1988). This is a 70-year remission of fundamental constitutional law.\n\nThe vice and hypocrisy of the cause-and-prejudice ideology as legal-error absolution is intrinsic in the application of \"cause\" to unintended failure where as an axiomatic factor of the rule unintended failure is not cause, and lack of intention cannot produce cause. Whether an oxymoron, jejune abstraction, paradox, or just nonsense in justified legal stature, since unintended procedural default of counsel is antithetical to the consequent application of cause, the sole office of the rule, although not openly admitted in case application, is to deny constitutional-right consideration resulting from that unintended procedural default. Cause becomes, by definition, only an oxymoronic-excuse word when applied to unintended default as justification for denied relief. It states cause and denominates no possible cause.\n\nThe unintended mistake may have been egregious or completely understandable, and the prejudice modest or determining, but no matter — cause is lacking, and by sleight-of-hand definition, appellate inquiry is avoided. Responsive to the dilemma created, the courts then have to extract the admitted error denied in constitutional relief by cause-and-transfer review to the antithetical subject of ineffectiveness of counsel. The paradox is ineffectiveness when derived from unintended default is not cause for cause in cause-and-prejudice, but then is reviewed by the stringent criteria of ineffective counsel as dimensional failure when arising only from unintended misadventure in legal service performance.\n\nAPPLICATION OF FEDERAL CAUSE-AND-PREJUDICE FORFEITURE RULE TO WYOMING CONSTITUTIONAL GUARANTEES\n\nThe significance of this analysis of the implied forfeiture cases in the United States Supreme Court decisions is not derived from the demonstrable inconsistency which is self-evident, nor from lack of logical foundation in insistent reasoning, which is apparent, but rather to reject this coarsegrained, pragmatic ideology substitute for justice where the broad philosophy of Burger, Rehnquist and O'Connor is factually defined in denied federal relief. Their ideological drive to confine state constitutional enforcement within state courts is ill-served for this state court as a convoluted approach which is not consistently identical or constitutionally comparable with the asserted federal interest of abstention and comity. What the federal courts may do to avoid consideration of state-court originated constitutional issues has little legal relationship to the state court application of state and federal guaranteed rights in initial trial and appeal search for due process, equal protection, and constitutional justice. \"Federalism is a prime [state] reason for maintaining an effective post-conviction relief system.\" Comment, Post Conviction Remedies Under Missouri Rule 27.26: Problems and Solutions, 47 Mo.L.Rev. 787, 806 (1982).\n\n\"* * * Because state supreme courts are ultimately responsible for state law, they owe the state and the nation a duty to provide careful and thoughtful state constitutional jurisprudence. State courts can do that by independently analyzing the protections their state constitutions provide. State constitutions and bills of rights ought to be more than mere compilations of `glittering generalities.'\" Comment, Interpreting the State Constitution: A Survey and Assessment of Current Methodology, 35 U.Kan.L.Rev. 593, 623 (1987).\n\nOne only need note the generation of Evitts v. Lucey, supra, 469 U.S. 387, 105 S.Ct. 830, which in the context of a timely appeal, cf. Daniels cases, supra, cannot be confined by the cause-and-prejudice rule where counsel's mistake, inattention, or negligence would otherwise forfeit singular constitutional rights. It is to be academically noted that neither majority nor dissent in Evitts, Sykes, or its progeny as the cases which considered the implied-forfeiture rule and illusory escape of cause and prejudice. See Note, Effective Assistance of Counsel on Appeal: Due Process Prevails in Evitts v. Lucey, 35 De Paul L.Rev. 185 (1985). Consequently, Evitts becomes a first-generation exception to that course of decisions. Appellate court ad hoc determination of possible or probable innocence becomes the second, as accomplished by majority vote. Not even in determination as to whether attorneys need to be mind readers has the illogic of this precedent been consistently applied. In Engle, where the attorney was expected to contemplate and anticipate the future change from a hundred-year standard, and then in Jones v. Barnes, 463 U.S. 745, 103 S.Ct. 3308, 77 L.Ed.2d 987 (1983), the majority directly confined issue appeal obligation, even if non-frivolous. So that the message is not lost in phraseology, these cases lack any operational legal consistency in requiring absolute predestination — in issue selection in one case, and in confining appeal responsibility to only what is now probable in another. This accomplishes the converse paradox.\n\nIt is in the absolute nature of the cause-and-prejudice rule to determine that reasoned judgment is not acceptable. Meanwhile, the hungry wolves of implied forfeiture anticipatorily wait beyond the courthouse door to devour constitutional guarantees. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nAs Justice Brennan, in dissent, recognizes:\n\n\"The Court subtly but unmistakably adopts a different conception of the defense lawyer's role — he need do nothing beyond what the State, not his client, considers most important. In many ways, having a lawyer becomes one of the many indignities visited upon someone who has the ill fortune to run afoul of the criminal justice system.\n\n\"I cannot accept the notion that lawyers are one of the punishments a person receives merely for being accused of a crime.\" Jones v. Barnes, 463 U.S. at 764, 103 S.Ct. at 3319.\n\nAcademic distaste for the disingenuous status of Jones in the actualities of client and attorney relationship, and prior precedential comments invoking master-agent and master-for-client need only be related here to the unworkability of cause and prejudice. In the litany of denied justice, the admonition of Glasser v. United States, supra, 315 U.S. at 70, 62 S.Ct. at 465, should not be ignored:\n\n\"To preserve the protection of the Bill of Rights for hard-pressed defendants, we indulge every reasonable presumption against the waiver of fundamental rights.\"\n\nI am not persuaded or permitted morally to adopt the garish application of Wainwright v. Sykes, supra, 433 U.S. 72, 97 S.Ct. 2497, for application by the Wyoming Supreme Court, or even more stringent posture now developed by this court in denying constitutional-interest rights to persons charged with criminal offenses. The someday possibility of strategic by-pass is no proper basis for ignoring today constitutionally involved counseling ineffectiveness. The deterrence to sandbagging as oft discussed and never demonstrated, as a facade or mirage, is singularly unimportant compared to protection of the individual's constitutional rights. It is not to be perceived that by a number of insistently emplaced requirements this court and the justice-delivery system of the state can decrease procedural defaults. Some affirmative efforts, noted in the literature, could impose, in trial procedures, greater counsel selectivity, more rigorous education of lawyers on trial requirements, and judicial recognization of the character of the problem, and, in last resort, suspension and disbarrment for inveterate defaulters. Neither this court in present decision nor federal solutions realistically encompass a thesis of logic and justification except by a course of conduct and indicated attitude to ignore, absolve, and reject what really is occurring. Inevitably, it will be in a system which acknowledges opportunity for correction, since perfection of judge, jury, or counsel does not exist and should not be covered up in constitutionally denied rights by procedural default forfeitures. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nFEDERALISM IN CRIMINAL LAW\n\nBeyond reasoned argument, it is apparent that failure of state judicial and legislative commitment to the preservation of constitutional rights led to initial intervention of federal courts through habeas corpus in the criminal-trial process. The developments of the Frankfurter/Brennan/Warren court in relationship to denied justice in state courts were hardly accidental:\n\n\"* * * State courts having failed to reach the merits for their own purposes, federal courts may fill the void.\" Larry W. Yackle, Post-conviction Remedies, supra at 17.\n\nFederalism is a prime reason for maintaining an effective post-conviction-relief system. Post Conviction Remedies Under Missouri Rule 27.26, supra at 807. In interest of retention of state criminal litigation in state courts, reason denies diseffectuation of state post-conviction-relief processes. See Raper, Post Conviction Remedies, supra, 19 Wyo.L.J. 213.\n\n\"* * * [P]ostconviction review is necessary to protect constitutional rights to due process. The Missouri and United States Constitutions say habeas corpus must not be suspended, and the United States Supreme Court has, in effect, said that if state courts do not provide adequate post-conviction procedures, the federal courts will. In the interests of justice, federalism, and finality, state courts need to provide effective post-conviction review. It must be available to all if it is to be effective.\" Post Conviction Remedies Under Missouri Rule 27.26, supra, 47 Mo.L.Rev. at 807.\n\nConsequently, we would have the essence of the rules to be presented, from which I dissent, to be restated in actual functioning processes as procedural default forfeiture of rights not only of the United States Constitution, but more appropriately the Wyoming Constitution, arising from neglect or default of adequate representation. In reference to Cutbirth, this court applies the waiver rule invoking neglect or defective decision of counsel, to foreclose claims made in Cutbirth's petition for post-conviction relief by reiteration that the courts in this state are not required to review issues that were raised or could have been raised on appeal as later asserted in a petition for post-conviction relief, although the failure resulted from neglect or defective decision of counsel.\n\nAlthough applicable to a status derived in part from Fay, 372 U.S. 391, 83 S.Ct. 822, and Townsend, 372 U.S. 293, 83 S.Ct. 745, since decimated if not finally and totally interred in Sykes, I would concur with a 1965 academic contemplation in Note, State Post-Conviction Remedies and Federal Habeas Corpus, 40 N.Y.U.L.Rev. 154, 196 (1965):\n\n\"* * * In view of the stakes involved — the continued adjudication of crime in the state courts — and in view of the readiness evidenced by the federal courts to give weight to the needs of comity, it would seem worthwhile for states to hear and adjudicate all claims cognizable on federal habeas corpus in their own courts,\"\n\nand also with the rationale of the dissent in Wainwright v. Sykes, supra, 433 U.S. at 113-114, 97 S.Ct. at 2520-21, Brennan, J., joined by Marshall, J., dissenting:\n\n\"* * * Especially with fundamental constitutional rights at stake, no fictional relationship of principal-agent or the like can justify holding the criminal defendant accountable for the naked errors of his attorney. This is especially true when so many indigent defendants are without any realistic choice in selecting who ultimately represents them at trial. Indeed, if responsibility for error must be apportioned between the parties, it is the State, through its attorney's admissions and certification policies, that is more fairly held to blame for the fact that practicing lawyers too often are ill-prepared or ill-equipped to act carefully and knowledgeably when faced with decisions governed by state procedural requirements.\"\n\nJustice William J. Brennan, not only the most admired but also the most influential jurist of this last half century, and recognized as the author of state constitutional rights imprimatur on justice delivery, spoke directly to federalism in Federal Habeas Corpus and State Prisoners: An Exercise in Federalism, 7 Utah L.Rev. 423 (1961), and in his address to the Conference of Chief Justices, Some Aspects of Federalism, 39 N YU.L.Rev. 945, 957-958 (1964):\n\n\"Rather than as unwarranted federal encroachment upon state domains, the federal habeas corpus jurisdiction should be taken by the States as an opportunity to fashion state remedies as good or better for the disposition of the federal claims of state prisoners.\" \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nAt least in part now, and more particularly as the present disablement of constitutional rights in federal forum inevitably is soon to pass, we of this court, in moving in the direction of the limitation of \"fair inquiry\" provided by state statute, must surely expect a magnification of the Kevin Osborn result, Osborn v. State, Wyo., 672 P.2d 777 (1983), cert. denied 465 U.S. 1051, 104 S.Ct. 1331, 79 L.Ed.2d 726 (1984); Osborn v. Schillinger, D.Wyo., 639 F. Supp. 610 (1986), where after a six-day hearing in federal court it was there observed:\n\n\"In passing, this Court recognizes that Wyoming Supreme Court never has had before it a full record. It essentially dealt with a procedural situation, without a factual foundation such as developed by this Court in its six (6) day hearing, which was really the only full hearing Osborn has ever had. Because of the lack of an extensive evidentiary proceeding, the facts herein found were for the most part not known to either the state trial court or supreme court.\" 639 F. Supp. at 614. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nTO WHAT DEGREE OF PERFORMED LAWYERING SKILLS ARE CONSTITUTIONAL RIGHTS TO BE DIRECTED?\n\nIt is how the justice-delivery system deficiently defines its own structure that inevitably it not only will be in denied justice, but that it will be accurately perceived by others as a recognized failure. Rejection by popular consensus will follow if broad characterizations of failure are stated and excused, even though reasoned and rational judicial analysis might achieve the same result in affording substantive justice and providing societal satisfaction. The Constitution does not guarantee the assistance of the most brilliant counsel, but at least reason and care. What is the public message of system validity presented in forfeiture justification? We are called to wade through the misery of what justice as an institution and industry does and says in constitutional-right forfeiture dissertation:\n\n\"* * * The incompetency or negligence of an attorney employed by the defendant does not ordinarily constitute grounds for a new trial and a fortiori will not be grounds for the application of the Fourteenth Amendment. * * *\n\n\"The concept of this rule is that the lack of skill and incompetency of the attorney is imputed to the defendant who employed him * * *.\" Tompsett v. State of Ohio, 146 F.2d at 98.\n\n\"The incompetence, negligence, or unfaithfulness of defendant's counsel who was selected by him in the trial of a criminal case does not as a general rule constitute ground for a new trial, nor call for application of constitutional guarantees of defendant's full right to the benefit of counsel, nor for application of the Fourteenth Amendment to the Federal Constitution.\" Jones v. Balkcom, 210 Ga. 262, 79 S.E.2d 1, 3-4 (1953).\n\n\"* * * It would be trifling with the court to allow the client, after keeping silent in the presence of the court while his attorney entered a plea of guilty in his behalf and the court acting thereon imposed the sentence, to deny thereafter the authority of his attorney to enter the plea or to deny his approval of such action by his attorney.\" Archer v. Clark, 202 Ga. 229, 42 S.E.2d 924, 925 (1947).\n\nIt is in this last case, even though the individual alleged in denied post-conviction proceeding that he was not guilty, that he had a defense, and that he objected to the entry of the plea and his attorney would not allow him to make any explanation to the court.\n\n\"Effective representation by counsel, in order to satisfy the accused's constitutional right to a fair trial, is a rule of law that has been strictly construed. It must mean representation so lacking in competence that it becomes the duty of the court to observe such a condition and correct it. Allegations of serious mistakes on the part of an attorney, standing alone, even where harm results, are not a ground for habeas corpus. In all the cases decided on this subject, the circumstances surrounding the trial must be such as to shock the conscience of the court and make the proceeding a farce and a mockery of justice.\" (Emphasis added.) Rice v. Davis, Ky., 366 S.W.2d 153, 156-157 (1963).\n\nEntry of a technical plea or a technical violation with a 24-hour sentence actually served by sitting in the courtroom for the balance of the day, unrecognized by counsel as a pleaded-out felony conviction, does not constitute ineffectiveness of counsel. United States v. Cariola, 323 F.2d 180 (3rd Cir. 1963). In Cariola, full evidence was not available for the coram nobis review:\n\n\"`This court has made diligent effort to obtain a transcript of the proceedings to ascertain what colloquy transpired between court and counsel. Both trial judge and court reporter are deceased, and the latter's notes are not in existence. It also appears that the Government's records of this case cannot be located.'\" United States v. Cariola, 323 F.2d at 183, n. 1, quoting from United States v. Cariola, 211 F. Supp. 423, 424-425 (D.N.J. 1962).\n\nIn characteristic understatement, which is often to be perceived in examination of appellate opinions as illustrative of the lack of trial experience by the jurist, the court reflected:\n\n\"Although [counsel] met petitioner for the first time in the courtroom the morning of the trial and talked to petitioner for only about ten minutes, during this time petitioner told him everything he knew about the case. \"There is no suggestion that [the attorney] was incompetent or unfaithful to petitioner's interest. The most that can be said is that he was young, his experience in criminal matters was limited, and his trial preparation was probably less extensive than it should have been.\" United States v. Cariola, 323 F.2d at 185. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nPetitioner reveals nothing more than claimed errors of trial counsel of the extent and kind common to all human effort, including denied inquiry of failure to appeal, and ignored contentions of irregularities in brief that \"collusion occurred between his counsel and government counsel, and that the prosecution knowingly employed perjured testimony.\" Rivera v. United States, 318 F.2d 606, 608 (9th Cir. 1963).\n\n\"We think the term `effective assistance' — the courts' construction of the constitutional requirement for the assistance of counsel — does not relate to the quality of the service rendered by a trial lawyer or to the decisions he makes in the normal course of a criminal case; except that, if his conduct is so incompetent as to deprive his client of a trial in any real sense — render the trial a mockery and a farce is one descriptive expression, — the accused must have another trial, or rather, more accurately, is still entitled to a trial.\" Mitchell v. United States, 259 F.2d 787, 793 (D.C. Cir.), cert. denied 358 U.S. 850, 79 S.Ct. 81, 3 L.Ed.2d 86 (1958).\n\nAs critiqued in dissent:\n\n\"Perhaps the clearest way of expressing the reason for my dissent is to say that the constitutional right to the effective assistance of counsel does not in my view prescribe merely a procedural requirement but, contrary to the majority opinion, prescribes also a standard of skill.\" 259 F.2d at 794, Fahy, Circuit Judge, dissenting.\n\nWhat, as a standard, do these references and quotations make for civic-class evaluation, or in citizens' contemplation of the honesty, reliability, and effectiveness of the legal profession and the justice-delivery system? I see in the majority opinion an abject adaptation of the waiver idiom that the conduct of the worst becomes not only the standard of perception but the confines of responsibility.\n\nINEFFECTIVE ASSISTANCE OF COUNSEL AS AN APPEAL ISSUE\n\nHaving recognized that the waiver principle is a psychological mirage and an operational absurdity, I am then turned to the address of this court to ineffective assistance of counsel. One vice of the argument of the court afforded by contending for this phenomenon or standard is in failure to recognize that the stringent application of imputed waiver, at least for most of this century, is novel in application. It should be recognized that the extent or degree of neglect or defective decision of the attorney, which is the essential question addressed, requires analysis in order to determine whether a reversal is required, which is the office of Strickland v. Washington as a confining approach. The difficulty with the theoretical concept of the majority is, first, in the attribution of waiver, and then in the question of significance as defined in more determinative facts being relegated to a pragmatically explained justification rather than to a singular harm result in system failure. Cf. Commonwealth v. Bolden, Pa., 534 A.2d 456 (1987). At issue should only be, how bad was the counseling assistance, and how bad was the result on the fair-trial liberty interests of the accused? The jurist should always be willing to ask whether he would be satisfied and comfortable with what has occurred if he or a close acquaintance had been the accused.\n\nPractically, we should start with the recognition that, if the word \"waiver\" is used, a mistake occurred, as of the essence of the word that a valued right was lost. The consideration to be afforded in post conviction or upon appeal is whether that valued right defined a constitutional interest and the conduct of the attorney was of a character so that the facade of implied responsibility of the client should not be reassessed. In categorical difference, my disagreement with the majority is illustrated by their statement that \"the simple failure to raise certain issues on appeal, even if they were meritorious, does not require a conclusion of ineffective assistance of counsel.\" \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e One would ask, what does the failure to raise meritorious issues really mean except neglect, failure, and deficiency? This is ineffectiveness in fact, whether or not in fiction or extemporized standard. The horrifying facade of the entire approach is to foreclose the rights of the client and then deny the responsibility of the attorney. Laing v. State, supra,746 P.2d 1247. Syllogisms aside, neglect or deficient decision of the attorney is innately prejudicial, and the only question for address is to what extent and with what reasoned result. In order to assay that conduct, specific evaluation of the claimed neglect or deficient decision of the attorney must be reviewed in trial context. Obviously, the arena for review is within different parameters as included at trial with moment-to-moment responsibilities as to be differentiated from the failure of appellate counsel to acknowledge adverse decisions or recognize trial problems in record examination and appellate-brief composition.\n\nThe problem is not resolved by further application of the \"concrete standard\" which this court now pursues as a substitute for evaluation of the counseled mistake and a consideration of its effect on the liberty interests of the individual. Since explicit by the use of the word \"waiver,\" error is irretrievably adduced, and the question is the significance of the error and the relationship to a proper basis for reversal. I do not have a problem with a requirement that the petitioner must show an adverse effect upon a substantial right as derived from the \"counseled error,\" but I would submit that this has nothing rational to do with plain error or a clear and unequivocal rule of law.\n\nThe paradigm or, more appropriately, paradox or oxymoron applied by the majority as an ongoing standard of this case, is that having denied relief to the defendant based on procedural default in trial or appeal, test of relief for ineffective counsel is so stringent that the attribution of waiver to the client from the attorney's imperfect performance becomes an absolute bar to constitutional justice for the charged individual. If pragmatism in result is justified, pragmatism in calling the procedural process what it is will be more appropriate in reason and logic. Knowing the fiction of client waiver, this court poses an irrational burden on the liberty interest of the client to demonstrate effectiveness where stupidity, slovenliness or just lack of reasoned preparation will not necessarily suffice. While we should be addressing our inquiry to whether or not the accused defendant was denied constitutional rights, we detour our review to insurmountable burdens by arbitrary and parasitically applied \"standards.\" Somehow or another, it is observable that the direction is to avoid examining the issues by the substitution of labels which deny relief without academic application as affixing a result without reason.\n\nI would find cause to differ from the majority of this court in rationale and rationalization, as well as case classification of discovery of \"only a few cases in which reversible error for ineffective assistance of appellate counsel was premised upon the failure to raise certain issues on appeal.\" Actually, Evitts v. Lucey, supra, 469 U.S. 387, 105 S.Ct. 830, and the multitude of improper, untimely, or omitted appeals serve as a first example. To expand the territory of constitutional waiver as encompassing inept appellate counsel now faced here as procedural default, attention is directed to the text and cases in Annot., 15 A.L.R.4th 582, Adequacy of Defense Counsel's Representation of Criminal Client Re Appellate and Post-conviction Remedies (totaling 194 pages of text, including supplement).\n\nAs examples of reversed decisions normally occurring in post-conviction relief for habeas corpus, I include the many cases cited above, and as examples Jenkins v. Coombe, 821 F.2d 158 (2d Cir. 1987), cert. denied 108 S.Ct. 704, 98 L.Ed.2d 655 (1988); Bell v. Lockhart, 795 F.2d 655 (8th Cir. 1986); Gray v. Greer, 778 F.2d 350 (7th Cir. 1985) (remanded for further consideration of ineffectiveness of counsel); Lewis v. State, 279 Ark. 143, 649 S.W.2d 188 (1983); Paulsen v. Manson, 193 Conn. 333, 476 A.2d 1057 (1984); Rivera v. State, Ind. App., 477 N.E.2d 110 (1985) (remanded for rebriefing after the court recognized \"blatant nonrepresentation\" in text of first brief); Lamphere v. State, Iowa, 348 N.W.2d 212 (1984); Curtis v. State, 284 Md. 132, 395 A.2d 464 (1978); Stewart v. Warden, 92 Nev. 588, 555 P.2d 218 (1976); People v. Casiano, 67 N.Y.2d 906, 501 N.Y.S.2d 808, 492 N.E.2d 1224 (1986) (new counsel appointed and reconsideration of appeal required).\n\nThe subject was succinctly defined in Stewart v. Warden, supra, by a per curiam Nevada Supreme Court opinion:\n\n\"It is uncontroverted that while the appeal was in progress appellant requested his then attorney to raise certain claims of error, and the attorney neither presented those claims of error to the supreme court nor offered any reason or explanation for his failure to do so. * * *\n\n\"In the factual context of this post-conviction proceeding, we hold the unexplained omissions of appellant's former attorney may not be relied upon by a district court to penalize appellant for the failure of his `. . . appointed counsel [to] function in the active role of an advocate, . . .'\" 555 P.2d at 219.\n\nThe Iowa court in Sims v. State, Iowa, 295 N.W.2d 420, 424 (1980), simplistically stated:\n\n\"Of course the right to effective assistance of counsel also applies to assistance of counsel on appeal. Anders v. California, 386 U.S. 738, 744, 87 S.Ct. 1396, 1400, 18 L.Ed.2d 493, 498 (1967) * * *. The same standards applied to trial counsel competency should apply in measuring the competency of appellate counsel.\"\n\n\"When the post-conviction applicant asserts constitutional violations, we make an independent evaluation of the totality of the circumstances. Hinkle v. State, 290 N.W.2d 28, 30 (Iowa 1980). This is the equivalent of a de novo review. Id.; * * *.\" Id. at 422.\n\nThe Florida cases of Barclay v. Wainwright, Fla., 444 So.2d 956 (1984), and Dougan v. Wainwright, Fla., 448 So.2d 1005 (1984), more comprehensively display my conclusion of reversals for ineffectiveness of appellate counsel. See Barclay v. State, Fla., 343 So.2d 1266 (1977), cert. denied 439 U.S. 892, 99 S.Ct. 249, 58 L.Ed.2d 237 (1978), remanded for resentencing 362 So.2d 657 (1978), aff'd after resentencing 411 So.2d 1310 (1981), aff'd 463 U.S. 939, 103 S.Ct. 3418, 37 L.Ed.2d 1134 (1983), rev'd upon petition for habeas corpus in order to allow Barclay a new appeal from stay of execution, 444 So.2d 956 (1984):\n\n\"We also find that Jackson did not provide Barclay with effective assistance of counsel.\" 444 So.2d at 959.\n\nThe Dougan sequence arose in conjunction with the Barclay case, with initial affirmation of Dougan's conviction in Barclay, and following remand again affirmed and sentenced to death in Dougan v. State, Fla., 398 So.2d 439, cert. denied 454 U.S. 882, 102 S.Ct. 367, 70 L.Ed.2d 193 (1981). In Dougan v. Wainwright, supra, 448 So.2d 1005, the Supreme Court held that appellate counsel failed to provide effective assistance both by conflict of interest and failure to raise meritorious legal claims in behalf of Dougan, and the petition for habeas corpus was granted in order to afford a new appeal. The case came back in Dougan v. State, Fla., 470 So.2d 697 (1985), cert. denied 475 U.S. 1098, 106 S.Ct. 1499, 89 L.Ed.2d 900 (1986), and was again reversed for resentencing by virtue of error in the sentencing process which did not invoke incompetency or ineffectiveness of appellate or trial counsel.\n\nThe clear lesson to be learned from the Barclay-Dougan cases is the recognition of how much less time would have been required, and how much money would have been saved, if the ineffectiveness-of-counsel issue had more immediately received attention.\n\nIn reversing and remanding for a new trial, the Supreme Court of Pennsylvania in Commonwealth v. Pfaff, 477 Pa. 461, 384 A.2d 1179, 1182 (1978) teaches:\n\n\"One convicted of crime also has a right to appeal, Douglas v. California, 372 U.S. 353, 83 S.Ct. 814, 9 L.Ed.2d 811 (1963); Commonwealth v. Herge, 436 Pa. 542, 260 A.2d 787 (1970), and has the right to effective representation of counsel when taking that appeal. We are unwilling to conclude that appellate counsel effectively represents one convicted of a crime when appellate counsel, either through inadvertence or otherwise, fails to raise arguably meritorious issues on that appeal. One purpose of the appellate process is to guarantee as much as possible that the defendant's right to a fair and impartial trial is scrupulously honored. When appellate counsel fails to bring to the attention of the appellate courts facts which arguably indicate that trial counsel allowed the accused to be subjected to prejudicial prosecutorial conduct during trial, we are forced to conclude that appellate counsel's representation of the accused was also ineffective.\"\n\nSee also Commonwealth v. Broomell, 254 Pa. Super. 574, 386 A.2d 99, 101 (1978), where the case was remanded for rehearing since\n\n\"* * * [t]here must be an opportunity to have all of the issues regarding the effectiveness of counsel considered in one hearing, with right in either party to appeal from the determinations made by the court below following the evidentiary hearing.\"\n\n\"* * * When deciding a claim of ineffective appellate counsel, the hearing court must determine if the course chosen by counsel had some reasonable basis designed to effectuate his client's interests. * * * Because this decision requires an examination of counsel's stewardship of the appeal in light of the available alternatives, it often will be necessary to call counsel whose assistance is challenged as ineffective so he may explain the decisions he made in the course of the appeal. Furthermore, both the petitioner and the Commonwealth may wish to call additional witnesses and present other evidence relevant to the petitioner's claim.\" Commonwealth v. Sullivan, 472 Pa. 129, 371 A.2d 468, 474 (1977).\n\nThe context of discussion in the majority opinion as may be accorded some similarity to recent decisions of the United States Supreme Court, confuses the essential function of advocate counsel. The attorney representing the defendant, and particularly so on appeal, remains an advocate and is not just an amicus curiae. See Anders v. California, 386 U.S. 738, 87 S.Ct. 1396, 18 L.Ed.2d 493, reh. denied 388 U.S. 924, 87 S.Ct. 2094, 18 L.Ed.2d 1377 (1967); Entsminger v. Iowa, 386 U.S. 748, 87 S.Ct. 1402, 18 L.Ed.2d 501 (1967). It is equally to be recognized that appellate counsel is not free to assume the position of amicus curiae, but also is not a jurist.\n\nThe predominant posture of the thoughtful scholars and opinion writers defines the responsibility of appellate counsel to present for consideration on review each legitimate issue that he may find or that may separately be found or suggested by defendant clients. The selectivity process in the determination of legal-issue merit should be vested in the jurist, and not in the mind of the advocate counsel to either determine the rights of his client, or to anticipate the contemplative conclusions of the appellate segment of the judicial division of the justice-delivery system. Cf. Dennis v. United States, 384 U.S. 855, 875, 86 S.Ct. 1840, 16 L.Ed.2d 1973 (1966): \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\n\"* * * In our adversary system, it is enough for judges to judge. The determination of what may be useful to the defense can properly and effectively be made only by an advocate. The trial judge's function in this respect is limited to deciding whether a case has been made for production, and to supervise the process * * *.\"\n\nIn People v. Lang, 11 Cal.3d 134, 113 Cal.Rptr. 9, 520 P.2d 393, 396 (1974), we are thoughtfully reminded that\n\n\"* * * [T]he obligations of appellate counsel [include] the duty to prepare a legal brief containing citations to the transcript and appropriate authority, and setting forth all arguable issues, and the further duty not to argue the case against his client.\"\n\nThis principle was affirmed and restated in People v. Barton, 21 Cal.3d 513, 146 Cal.Rptr. 727, 579 P.2d 1043, 1046-1047 (1978).\n\nIn reversal and remand to reconsider the appeal, the California Supreme Court analyzed that:\n\n\"* * * In the instant case, appellate counsel breached both duties.\" 113 Cal.Rptr. 9, 520 P.2d at 396.\n\nIn the seminal case, where the California Supreme Court vacated the decision of the intermediate appellate court, reinstated the appeal, and appointed other counsel for the defendant, In re Smith, 3 Cal.3d 192, 90 Cal.Rptr. 1, 474 P.2d 969, 971-972 (1970), a similar definition of duties included:\n\n\"* * * `Counsel must prepare a brief to assist the court in understanding the facts and the legal issues in the case. The brief must set forth a statement of the facts with citations to the transcript, discuss the legal issues with citations of appropriate authority, and argue all issues that are arguable. Moreover, counsel serves both the court and his client by advocating changes in the law if argument can be made supporting change. * * *.'\" Quoting from People v. Feggans, 67 Cal.2d 444, 62 Cal.Rptr. 419, 432 P.2d 21 (1967).\n\nIn the devastating analysis, the court found:\n\n\"Judged by the foregoing criteria, representation by the appointed counsel for petitioner before the Court of Appeal was demonstrably inadequate. Indeed, petitioner would have fared better had his attorney withdrawn in favor of a pro se brief from petitioner, despite petitioner's acknowledged legal ineptitude. In a case bristling with arguable claims of error, petitioner's counsel filed an opening brief consisting of a 20-page recitation of the facts and a one-page argument.\" Id. 90 Cal.Rptr. 1, 474 P.2d at 972.\n\nFurthermore, I would completely agree with that court in conclusion:\n\n\"Of course, an appellate counsel is not to be held responsible for an actual frivolous appeal by his client, and we do not hold that Anders and Feggans require the advocate to contrive arguable issues. But in the instant action, each of the counts on which petitioner was convicted was potentially vulnerable to legitimate and provocative appellate contentions that should have been manifest to an alert and responsive attorney.\" Id. 90 Cal.Rptr. 1, 474 P.2d at 972.\n\nSee also Bryant v. State, Hawaii App., 720 P.2d 1015 (1986).\n\nFinally, on the subject of the \"new phenomenon,\" I would find as the most pertinent countervailing example Osborn v. State, supra, 672 P.2d 777, where that decision and this court, after an ineffective appeal, were effectively reversed by the United States District Court in Osborn v. Schillinger, supra, 639 F. Supp. 610, where the defendant was first provided an actual hearing. Obviously, with appeal still pending from that latter decision in the United States Court of Appeals, the final Osborn story of life, death, or trial on guilt is not written, but as now introduced the status is no differently presented than was the resolution in Matire v. Wainwright, 811 F.2d 1430 (11th Cir. 1987).\n\nConsequently, in this consideration of ineffectiveness of counsel for trial and appeal, I would apply as reasonably to be utilized as criteria:\n\n(1) If the issue was reasonably presented and dispositively considered in prior appeal, adjudicated finality would summarily be applied in denied relief.\n\n(2) If not presented, the issue either had merit or did not.\n\n(3) If the issue had no merit substantively, it is subject in post-conviction consideration to appropriate resolution with adjudicative finality.\n\n(4) If the issue did have prior merit in constitutional deprivation, it ill suits justice to say that it was waived by the attorney, impressed upon the client, and now reclassified to belie effective assistance of counsel. Consequently, if the issue had merit, it cannot be constitutionally waived by the uncommunicated action of counsel and should be considered dispositively as whether meeting rather clearly determinable criteria as a basis for the nonrational delivery of justice by denial, if appropriate, or by granted relief where justified.\n\n(5) To any recognized ineffectiveness of counsel, inquiry of prejudice to the defendant is applied, measured in sufficiency of the error if it had not occurred as would provide a reasonable doubt of guilt. Cf. United States v. Agurs, supra, 427 U.S. 97, 96 S.Ct. 2392; Strickland v. Washington, supra, 466 U.S. 688, 104 S.Ct. 2052; Commonwealth v. Bolden, supra, 534 A.2d 456.\n\n\"The benchmark for judging a claim of ineffectiveness is whether counsel's conduct so undermined the proper functioning of the adversarial process that the trial cannot be relied on as having produced a just result.\" People v. Dillon, Colo. App., 739 P.2d 919, 921 (1987).\n\nNeither the legislature nor this court can properly amend or deny the constitution. Compare Rocky Mountain Oil and Gas Association v. State Board of Equalization, Wyo., 749 P.2d 221 (1987). We may have become a nation of shortcuts and sloppy performance, but neither one of those problemsome features of a potentially declining society should be invoked as procedural denial of substantive justice. What this court really does is to leave for post-conviction relief only arguments sounding in lawyer-bashing, at least in trial and appeal cases, and perhaps nothing in plea cases, at least if the conclusions of Whitney v. State, Wyo., 745 P.2d 902 (1987) are to be applied hereafter, where only sentences may be at issue.\n\nMy objection and consequent dissent rest upon denial of constitutional-issue consideration by extrapolation of a new and completely confined statute as defined by judicial fiat. What this court announces is that ineffective assistance of counsel can be determined without review of the specific lawyer's error. This is to heap absurdity on hyperbole. First the court says that waiver exists if the attorney did not present the issue in trial or on appeal, and now excuses failure to raise on appeal by evaluated process without consideration of what wrong was done, if any, to the client's constitutional interests. This is to build to justiciable status accident, ignorance, stupidity, or negligence, to be responsively excused. The perspicacity of the author in Jettisoning Fay v. Noia, supra, 62 Minn.L.Rev. at 438-439, is clearly demonstrated as earlier forewarned in Osborn v. Schillinger, supra:\n\n\"Whatever standard is ultimately adopted with respect to contested cases, close scrutiny of the state court trial record will be virtually mandatory, and testimony at federal habeas evidentiary hearings is a likely prospect. Thus, claims of ineffective assistance may well result in a substantial increase of time-consuming tasks for the lower federal courts and in considerable embarrassment for the bar.\n\n\"Additional problems arise if, in implementing the cause and prejudice requirements, the Court adopts, as Sykes seems to suggest, a miscarriage-of-justice or totality-of-the-circumstances test. Since such a standard appears to involve consideration of the probable guilt or innocence of the prisoner, the federal courts will be obliged to make ad hoc, case-by-case determinations with respect to this issue. Decisions of this kind are extremely subjective, and coherent guidelines for making them are hard to formulate. * * * [A]doption of the Sykes rule in an effort to conserve judicial resources by eliminating the necessity for hearings on the merits of constitutional claims ultimately may create substantially more work for the lower federal courts and result in the elaboration of amorphous rules to determine the circumstances under which the merits of a constitutional claim can be avoided.\"\n\nWYOMING POST-CONVICTION RELIEF\n\nWhen we recognize that in the 26 1/2-year history of Wyoming post-conviction relief, petitioners have benefited from conviction reversal only once, applications of the stringent and denuding efficacy of principles here stated simply afford a judicial expungement of a legislative remedy to assure constitutional rights. In majority opinion, the court stated the conclusion for determination whether counsel's performance was constitutionally deficient \"should be analyzed in much the same way that this court has analyzed the concept of plain error.\" However, application of the plain-error concept to waiver and forfeiture was specifically rejected by the United States Supreme Court in United States v. Frady, supra, 456 U.S. 152, 102 S.Ct. 1584, and Engle v. Isaac, supra, 456 U.S. 107, 102 S.Ct. 1558.\n\nThe majority syllogism presented to deny constitutional relief when counsel made a mistake in pre-conviction processes or in failing to raise a legitimate issue on appeal as constitutionally deficient, including in essential context recognition of both an admitted constitutional issue and mistake, supposes disposition:\n\n(1) analyzed in concept of plain error;\n\n(2) with particularized facts presented;\n\n(3) sufficient to identify a clear and unequivocal rule of law;\n\n(4) demonstrating transgression as clear and obvious;\n\n(5) to then cause an adverse effect on substantial right; and then, so this court says:\n\n\"* * * The claim of inadequate representation by appellate counsel could have been resolved by the application of the objective criteria set forth above rather than an examination of the merits of the claimed issues or simply an ad hoc analysis of them by the court to determine what its members might have done differently. When the objective criteria are invoked and the district court then is persuaded that appellate counsel did make a mistake which was prejudicial to the rights of the petitioner, appropriate relief can be afforded by ordering a new trial or in the alternative a reinstatement of the direct appeal so that the issue may be presented.\"\n\nThis syllogism adjusts nothing and denies everything in an effort to excuse unintended counsel mistake in order to validate constitutional-right forfeiture. Authority even from the cause-and-prejudice decisions of the current United States Supreme Court idiom cannot be equivalently denied. Evitts v. Lucey, supra, and Kimmelman v. Morrison, 477 U.S. 365, 106 S.Ct. 2574, 91 L.Ed.2d 305 (1986). Even at best, the Wyoming Constitution has been obnubilated.\n\nInquiry is then required whether protection of the Wyoming Constitution has been denied and extinguished so completely that the present result is justified by past precedent of this court. To be repetitive, we are not here concerned with res judicata in appealed issues, but with intrinsic constitutional forfeiture from counsel mistakes.\n\nPote v. State, Wyo., 733 P.2d 1018 (1987), although result-oriented in conclusory product, addressed issues of original appeal, and not why effective counsel would more adequately have presented issues in that appeal. See likewise, Wright v. State, Wyo., 718 P.2d 35 (1986); Hoggatt v. State, Wyo., 606 P.2d 718 (1980); Johnson v. State, Wyo., 592 P.2d 285 (1979); Munoz v. Maschner, Wyo., 590 P.2d 1352 (1979). No formula is required for scholarly analysis that the claimed mistake as subject to unintended procedural default simply lacks merit for further guilt determination and constitutional guarantee inquiry if claimed, considered, and denied by earlier appeal review.\n\nI find now that apparently nothing has been learned or remembered since Frank v. Mangum, supra, in 1915, when the great jurists of that time, Justices Holmes and Hughes, first alerted society to obligations of the justice-delivery system. Rather than encasing the protective complex in a reflective armor of impenetrability, I would simply say that, assuming res judicata is not properly applied, the issue is: was there error, and was it prejudicial? If a right was waived which was meritorious, obviously there was error, and that leaves only the remaining question of prejudice to be defined and applied. The deliberate bypass of Fay was intended to confine unintended procedural default to proper remedial context. By the evisceration of Sykes in rule acceptance of cause and prejudice, this court now in singular fashion writes out the Wyoming Constitutional declaration of rights in following the political pragmatism of another court.\n\nRICKEY CUTBIRTH ISSUES IN CONTEXT\n\nAlthough the issues created in this appeal are clearly more divisive and pervasive than just the status of Rickey Cutbirth who, after all, has only a sentence of 20 years to life to serve, his case requires factual analysis of the issues presented to the trial court by the uncounseled, pro-se petition for post-conviction relief.\n\nThe first required inquiry is to determine issues presented on appeal as compared to issues later raised on post-conviction-relief petition to determine comparability or preclusion. As resolved by this court in Cutbirth v. State, Wyo., 663 P.2d 888, 889 (1983), those were:\n\n\"`1. Whether the evidence is sufficient to prove, beyond a reasonable doubt, that appellant killed his wife \"maliciously and purposely.\"\n\n\"`2. Whether the evidence indicates the appellant's conduct was, at most, negligent.\n\n\"`3. Whether the jury instructions on involuntary manslaughter misdefined the elements of offense and were so confusing and misleading that they deprived the appellant of a lesser included offense instruction and constitute plain error.'\" \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nNow in this proceeding, the issues presented by Cutbirth in his comprehensively composed petition for post-conviction relief included:\n\n(1) Involuntary nature of interrogation responses because of fraud in failure to advise that Mrs. Cutbirth had died.\n\n(2) Admission of part of the interrogation exchange and suppression of part as claimed to deny equal protection.\n\n(3) The same subject as the claimed deceptive interrogation as invoked in (2).\n\n(4) Denial of compulsory process and right to a fair and impartial trial through ineffective assistance of counsel in (a) failure of counsel by discovery to secure availability of the white, long-sleeved shirt worn by defendant; and (b) failure of counsel to secure appropriate testing and expert witness examination to have expert-opinion analysis for trial.\n\nResponsive to the petition, the State contended in its brief: (a) Post-conviction relief is inappropriate to review an issue that could or should have been raised on appeal; and (b) the record does not support petitioner's allegation that his constitutional rights were violated. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nThe issues defined by appellant in his present brief, in addition to the new-trial appeal, include: (1) ineffective assistance of counsel on appeal; (2) introduction of trial evidence of bad acts under Rule 404(b), W.R.E.; and (3) violation of appellant's constitutional rights in interrogation by being compelled to give evidence against himself. What is presented is a claim of ineffectiveness of appellate counsel in failure to raise issues of the voluntariness of the interrogation examination, generically called a confession, and in failure to request consideration of the trial-court error in admission of bad-acts evidence. The decision on the interrogation testimony as what part was suppressed and what part was admitted resulted from a pretrial suppression hearing. Likewise, proper objection was taken to the admission into evidence of prior marital difficulties and physical abuse resulting in a denied motion in limine.\n\nIn rational review of the actual record, little question exists but that the bad-acts evidence and the attached interrogation issues should have been presented on appeal to adequately protect the due-process and non-self-incrimination interests of the defendant. This failure is not particularly differentiable from failure of a lawyer to meet requirements of a statute of limitations invoking a reasonable probability sufficient to undermine confidence in the outcome. See State v. Moorman, 320 N.C. 387, 358 S.E.2d 502 (1987), where reversal occurred for a number of counseling defects but especially failure to provide any evidence of what was announced as a defense in opening statement. See also Robison v. Maynard, 829 F.2d 1501 (10th Cir. 1987), failure to raise significant appellate issue in state court appeal (prosecutorial misconduct) is ineffectiveness of counsel. It must be remembered that under Engle the possibility of a later appellate change in basic law must be anticipated in discerning what is novelty. Smith v. Murray, supra, 477 U.S. 527, 106 S.Ct. 2661; Reed v. Ross, supra, 468 U.S. 1, 104 S.Ct. 2901; Desist v. United States, 394 U.S. 244, 89 S.Ct. 1030, 22 L.Ed.2d 248, reh. denied 395 U.S. 931, 89 S.Ct. 1766, 23 L.Ed.2d 251 (1969).\n\nUnder this subject as now presented, the constitutional inquiry requirement assumes a complex parameter. No one should really question the right to effective assistance of counsel to avoid uncoerced confession and to limit conviction to pertinent evidence not polluted by bad-acts and unrelated character testimony. The actual question is whether the discretional decision (which clearly it was) of the trial court, on admission of evidence, even if improperly exercised, will now achieve a constitutional-right-denial status within the purview of the post-conviction-relief statute. This thesis is directed to the inquiry whether what could be a reversible error on appeal becomes a constitutionally denied right in post-conviction review after procedural default resulting from mistake of appellate counsel.\n\nI would advance in philosophical premise the admonition of Chief Justice Warren in Coppedge v. United States, 369 U.S. 438, 449, 82 S.Ct. 917, 8 L.Ed.2d 21 (1962):\n\n\"* * * When society acts to deprive one of its members of his life, liberty or property, it takes its most awesome steps. No general respect for, nor adherence to, the law as a whole can well be expected without judicial recognition of the paramount need for prompt, eminently fair and sober criminal law procedures. The methods we employ in the enforcement of our criminal law have aptly been called the measures by which the quality of our civilization may be judged.\"\n\nI would remand for a factual hearing on the motion for new trial, and for adequate consideration of the basis presented for post-conviction relief, uncluttered by the waiver-defined escape from substantive merit review.\n\n\u003cspan class=\"fn\"\u003e1. We have resolved any concern about the failure to appoint counsel to represent Cutbirth in connection with his petition for post-conviction relief. He did not encompass in his petition, nor in his amended petition, the allegations alluded to in § 7-14-104, W.S. 1977. The only reference to his desire for counsel appeared in a pleading styled \"In Answer to Respondent's Motion to Dismiss\" which was not verified. Furthermore, no complaint is made in this appeal of the failure to appoint counsel to represent Cutbirth on his petition for post-conviction relief.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The Supreme Court of the United States has structured an exception to this rule. \"* * * Accordingly, we think that in an extraordinary case, where a constitutional violation has probably resulted in the conviction of one who is actually innocent, a federal habeas court may grant the writ even in the absence of a showing of cause for the procedural default.\" Murray v. Carrier, 477 U.S. 478, ___, 106 S.Ct. 2639, 2650, 91 L.Ed.2d 397 (1986). This case is not one in which that exception would pertain.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. While couched in language that asserts constitutional claims, these contentions essentially are claimed errors of law which should have been asserted in the direct appeal. They include: a claim of denial of compulsory process to obtain witnesses (and apparently evidence) favorable to the accused attributed to the fault of counsel at trial; the failure to arrest Cutbirth pursuant to a regularly issued warrant, which is asserted as a violation of the due process clause; the failure of the county coroner to hold an inquest, which also is asserted as a violation of the due process clause; and misconduct by the county attorney in conspiring to make a homicide case out of an accidental shooting. These contentions in many respects are patently specious.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The standard which we adopt is less stringent than that which has been invoked by the Supreme Court of the United States in United States v. Frady, 456 U.S. 152, 102 S.Ct. 1584, 71 L.Ed.2d 816, reh. denied 456 U.S. 1001, 102 S.Ct. 2287, 73 L.Ed.2d 1296 (1982), and Engle v. Isaac, 456 U.S. 107, 102 S.Ct. 1558, 71 L.Ed.2d 783, reh. denied 456 U.S. 1001, 102 S.Ct. 2286, 73 L.Ed.2d 1296 (1982). It is true that, in those cases, the Supreme Court of the United States rejected the defendant's contention that the cause and prejudice standard should be determined in the context of a plain error inquiry. The Court stated that because of the important concerns of finality with respect to challenges to state convictions and because of comity considerations: \"We remain convinced that the burden of justifying federal habeas relief for state prisoners is `greater than the showing required to establish plain error on direct appeal.' Henderson v. Kibbe, 431 U.S. 145, 154, 97 S.Ct. 1730, 1736, 52 L.Ed.2d 203 (1977); United States v. Frady, 456 U.S. at 166, 102 S.Ct. at 1593.\" (Footnote omitted.) Engle v. Isaac, supra, 456 U.S. at 134-135, 102 S.Ct. at 1575. When a state court is asked to determine if the performance of counsel on appeal did not meet the standard of effective assistance, it is our conclusion that the less stringent standard of plain error is appropriate. Unless a hearing is to be required in every instance to investigate the rationale of appellate counsel with respect to eliminating issues from the appeal, some objective standard is appropriate to measure whether the assistance furnished was effective. See Gray v. Greer, 800 F.2d 644 (7th Cir. 1986). The plain error standard encompasses those errors which are permitted to be raised on appeal even though a proper objection was not made at trial to preserve the error for appeal. The usual requirement of the objection is waived because the error is perceived to be of sufficient magnitude that reasonably effective counsel would have preserved it for appeal by an appropriate objection. It is described as the type of error which undermines confidence in the outcome of the trial. 3A C. Wright, Federal Practice and Procedure, Criminal 2d, § 856 (1982). If the failure to raise an issue on appeal is evaluated pursuant to the plain error standard, the conclusion that may be reached is the failure to raise the issue extended beyond the range of reasonably effective performance and undermines the confidence in the appellate process. The omission of such an issue when obvious reversible error is demonstrated cannot be justified as a tactical decision. Cf. Burger v. Kemp, ___ U.S. ___, 107 S.Ct. 3114, 97 L.Ed.2d 638, reh. denied ___ U.S. ___, 108 S.Ct. 32, 97 L.Ed.2d 820 (1987); Smith v. Murray, 477 U.S. 527, 106 S.Ct. 2661, 91 L.Ed.2d 434 (1986). This objective standard of plain error is not dissimilar from the standard identified in other decisions which have attempted to establish some objective criteria for identifying error by appellate counsel which manifests ineffective assistance. See Robison v. Maynard, 829 F.2d 1501 (10th Cir. 1987) (facially appears that a reversal is conceivable had the issue been raised on appeal); Matire v. Wainwright, 811 F.2d 1430 (11th Cir. 1987) (a single weak issue raised notwithstanding the availability of a substantial meritorious issue); Gray v. Greer, supra, (whether the issues omitted clearly would have been more likely to result in reversal and were so obvious from the trial record that the failure to present such issues amounted to ineffective assistance of appellate counsel). Burton v. State, Ind., 455 N.E.2d 938 (1983) and Shipley v. Cupp, Or. App., 650 P.2d 1032 (1982) are consistent with Matire v. Wainwright, supra, but the proposition is not as precisely articulated, and the test provided in Strickland v. Washington, 466 U.S. 668, 104 S.Ct. 2052, 80 L.Ed.2d 674, reh. denied 467 U.S. 1267, 104 S.Ct. 3562, 82 L.Ed.2d 864 (1984), is not discussed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The right-to-appointed-counsel issue did not develop since appointment of an attorney was not requested in the petition. Fondren v. State, Wyo., 749 P.2d 767 (1988); Alberts v. State, Wyo., 745 P.2d 898 (1987); Long v. State, Wyo., 745 P.2d 547 (1987). See § 7-14-104, W.S. 1977.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. \"A combination for epigrammatic effect of contradictory or incongruous words,\" Webster's Third New International Dictionary, as here applied to be a stated legal rule encompassing a total contradiction in logic as a paradox or self-contradiction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. There is a smoldering, self-consuming rot in the American adjudicatory system which first demands an unavailable level of cost investment and performance attainment of defense counsel, and, if not achieved, imposes a guilt responsibility on the client which may be factually unjustified. The politically fueled, ongoing counterrevolution against constitutional rights process protection has accelerated the cataclysm. See Whitebread and Heilman, The Counterrevolution Enters a New Era: Criminal Procedure Decisions During the Final Term of the Burger Court, 10 U. Puget Sound L.Rev. 571 (1987). Any still in doubt should be invited to view The Murder of Mary Phagan (NBC television broadcast, January 24 and 26, 1988), and then read Frank v. State, 141 Ga. 243, 80 S.E. 1016 (1914); Frank v. State, 142 Ga. 617, 83 S.E. 233 (1914); Ex parte Frank, 235 U.S. 694, 35 S.Ct. 208, 59 L.Ed. 429 (1914); and Frank v. Mangum, 237 U.S. 309, 35 S.Ct. 582, 59 L.Ed. 969 (1915), Justice Holmes and Justice Hughes, dissenting. Neither the Ku Klux Klan of the Twenties and Thirties nor the totalitarianism of Italy, Germany, and the Soviet Union of those same decades and following, emerged without failed processes to provide constitutional guarantees. Cf. O'Neill, The Good, The Bad, and The Burger Court: Victims' Rights and a New Model of Criminal Review, 75 J. of Crim. Law and Criminology 363 (1984). In current time, with direct reference to now newly discovered evidence, it is valuable to consider the ongoing saga of life or execution of Willie Darden, Darden v. State, Fla., 329 So.2d 287 (1976), cert. dismissed 430 U.S. 704, 97 S.Ct. 1671, 51 L.Ed.2d 751 (1977); Darden v. Wainwright, 725 F.2d 1526 (11th Cir.), cert. denied 467 U.S. 1230, 104 S.Ct. 2688, 81 L.Ed.2d 882 (1984), cert. granted and judgment vacated 469 U.S. 1202, 105 S.Ct. 1158, 84 L.Ed.2d 311 (1985); Darden v. Wainwright, 477 U.S. 168, 106 S.Ct. 2464, 91 L.Ed.2d 144, reh. denied ___ U.S. ___, 107 S.Ct. 24, 92 L.Ed.2d 774 (1986), as last considered by the United States Supreme Court in Wainwright v. Darden, ___ U.S. ___, 107 S.Ct. 332, 93 L.Ed.2d 304 (1986), and as the current subject of two television special program analyses, West 57th Street (CBS television broadcast, January 30, 1988) and 20-20 (ABC television broadcast, January 29, 1988). The attributes of the American justice-delivery system were never so closely and publicly in question. Whether guilty or innocent, fairly convicted or victimized by prosecutorial zeal and witness misinformation, Darden was executed March 15, 1988, four days after release of this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. It is improper for a court to penalize a defendant who exercises the constitutional right to require conviction and assert innocence. United States v. Araujo, 539 F.2d 287 (2d Cir.), cert. denied 429 U.S. 983, 97 S.Ct. 498, 50 L.Ed.2d 593 (1976); United States v. Duffy, 479 F.2d 1038 (2d Cir.), cert. denied 414 U.S. 978, 94 S.Ct. 299, 38 L.Ed.2d 221 (1973); State v. Lawrence, 112 Idaho 149, 730 P.2d 1069 (App. 1986). Specifically applicable in analogous factual status is Thomas v. United States, 368 F.2d 941 (5th Cir. 1966).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Intrinsic to the intelligent review of failure of representation is the ignorance and understanding of difference between incompetency and ineffectiveness. Obviously, the incompetent may likely be ineffective. However, to be ineffective does not require incompetency. In agreement, at least in this regard, with the strong posture of now retired United States Supreme Court Chief Justice William Burger, there may be evidenced in many cases a simple lack in aptitude, education, or technical skill of the attorney to adequately perform the extraordinarily demanding responsibilities of a trial or appellate counsel. This is not dissimilar from the fact that not every person can achieve status as a professional basketball player or recognized opera singer. Cf. McDonald v. Estelle, 590 F.2d 153 (5th Cir. 1979), where the terms \"ineffective assistance\" and \"incompetency\" were used interchangeably.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. In Burton's Legal Thesaurus, supra, synonyms for Justice Frankfurter's word \"jejune,\" a word certainly not frequently seen, are obviously applicable in the context of either dull or lacking maturity: \"JEJUNE (Dull), adjective \"bleak, boresome, boring, colorless, common, commonplace, drearisome, dreary, dry, flat, flavorless, hollow, indifferent, insipid, monotonous, ordinary, plain, ponderous, prosaic, prosy, stolid, tame, tasteless, tedious, thin, tiresome, torpid, undramatic, unenlivened, unentertaining, unexciting, unimpassioned, uninspired, uninspiring, unlively, unpointed, unspirited, usual, vacuous, vapid, weak, wearisome \"JEJUNE (Lacking maturity), adjective \"adolescent, babyish, callow, childish, immature, inexperienced, infantile, infantine, juvenile, puerile, unfledged, unlearned\" Burton's Legal Thesaurus at 300.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Entitled \"Prisoner's Constitutional Rights,\" it was: \"AN ACT to provide a remedy for persons convicted and imprisoned in the penitentiary, who assert that rights guaranteed to them by the Constitution of the United States or the State of Wyoming, or both, have been denied or violated in proceedings in which they were convicted.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Although it was stated in a different context, I differ from Professor Charles Alan Wright in his book review of William F. Dooker, A Constitutional History of Habeas Corpus (1980), in Habeas Corpus: Its History and Its Future, 81 Mich.L. Rev. 802 (1983), and predecessor Friendly, The Fifth Amendment Tomorrow: The Case for Constitutional Change, 37 U.Cin.L.Rev. 671, 678 (1968), in observing that the history of post-conviction relief in adjudicatory developments of law in a civilized society is not only absorbing but also a vade mecum for understanding the present status of American law. Post-conviction relief in all aspects is also not unnoticed in A.L.R. treatment in current articles, including Annot., 2 A.L.R.4th 807, Waiver or estoppel in incompetent legal representation cases; Annot., 26 A.L.R.Fed. 218, Modern Status of Rule as to Test in Federal Court of Effective Representation by Counsel; Annot., 13 A.L.R.4th 533, Adequacy of defense counsel's representation of criminal client regarding post-plea remedies; Annot., 15 A.L.R.4th 583, Adequacy of defense counsel's representation of criminal client regarding appellate and post-conviction remedies; Annot., 83 L.Ed.2d 1112, When is attorney's representation of criminal defendant so deficient as to constitute denial of federal constitutional right to effective assistance of counsel — Supreme Court cases.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. In enacting the differentiated Illinois version of post-conviction relief, the Wyoming legislature has not taken the opportunity to adopt the original uniform act or the most current text adopted in 1980. See Uniform Post-Conviction Procedure Act, 9B U.L.A. (1966) and 11 U.L.A., Criminal Law and Procedure, together with 1987 Pocket Part. The philosophic backdrop of the place of post-conviction relief is carefully reviewed in IV ABA Standards for Criminal Justice, Ch. 22 (1986). An omnibus type of process is recommended by Standard 18.3, National Prosecution Standards (National District Attorneys Association) (1st ed. 1977). Standard 6.5, National Advisory Commission on Criminal Justice Standards and Goals (1973), accommodates a somewhat different standard. All recognize the need of the corrective process with difference or scope as indicated. Until the decision in this case, the Wyoming statute more nearly followed the American Bar Association standard. After this decision, it probably does not comply with any.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The specific constitutional issue considered was constitutional right to assistance of counsel, following Powell v. Alabama, 287 U.S. 45, 53 S.Ct. 55, 77 L.Ed. 158 (1932), and Patton v. United States, 281 U.S. 276, 50 S.Ct. 253, 74 L.Ed. 854 (1930). In more recent time, the constitutional calender invokes dissertation whether this means effective assistance of counsel, assistance of effective counsel, or just presence and moderate participation of someone admitted to practice law. The caucus denial of perfect representation is to censure expectable legal responsibility as inept and incompetent. Cf. Strickland v. Washington, supra, 466 U.S. at 687, 104 S.Ct. at 2064, \"the proper standard for attorney performance is that of reasonably effective assistance,\" however then conversely stated, \"`within the range of competence demanded of attorneys in criminal cases.'\" Apparently the author of the majority opinion in that case did not know the difference, and cases since spawned have failed to delineate between concepts that a lawyer is a lawyer is a lawyer, or that the lawyer made mistakes from which implied forfeiture of constitutional rights may be judicially decreed. \"The right to counsel is a fundamental right of criminal defendants; it assures the fairness, and thus the legitimacy, of our adversary process. * * * The essence of an ineffective assistance claim is that counsel's unprofessional errors so upset the adversarial balance between defense and prosecution that the trial was rendered unfair and the verdict rendered suspect.\" Kimmelman v. Morrison, 477 U.S. 365, 374, 106 S.Ct. 2574, 2583, 91 L.Ed.2d 305 (1986). The right to counsel is the right to effective assistance of counsel, and extends to appeal. Evitts v. Lucey, supra, 469 U.S. 387, 105 S.Ct. 830.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. It is to be observed that charismatic and sloganistic attacks on constitutional-guarantee protections of the United States Constitution as a castigation of the Warren Court are uninformed unless the philosophy and application of the Constitution by Justices Hughes, Holmes, and Vinson are first disinherited.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. In Wainwright v. Witt, 469 U.S. at 462-463, 105 S.Ct. at 872, Justice Brennan stated: \"Today's opinion for the Court is the product of a saddening confluence of three of the most disturbing trends in our constitutional jurisprudence respecting the fundamental rights of our people. The first is the Court's unseemly eagerness to recognize the strength of the State's interest in efficient law enforcement and to make expedient sacrifices of the constitutional rights of the criminal defendant to such interests. * * * The second is the Court's increasing disaffection with the previously unquestioned principle, endorsed by every Member of this Court, that `because of its severity and irrevocability, the death penalty is qualitatively different from any other punishment, and hence must be accompanied by unique safeguards . . .' * * * The third is the Court's increasingly expansive definition of `questions of fact' calling for application of the presumption of correctness of 28 U.S.C. § 2254(d) to thwart vindication of fundamental rights in the federal courts. * * * These trends all reflect the same desolate truth: we have lost our sense of the transcendent importance of the Bill of Rights to our society. * * * We have lost too our sense of our own role as Madisonian `guardians' of these rights. * * * Like the death-qualified juries that the prosecution can now mold to its will to enhance the chances of victory, this Court increasingly acts as the adjunct of the State and its prosecutors in facilitating efficient and expedient conviction and execution irrespective of the Constitution's fundamental guarantees. One can only hope that this day too will soon pass. (Emphasis added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Compare O'Connor v. Ohio, 385 U.S. 92, 93, 87 S.Ct. 252, 254, 17 L.Ed.2d 189 (1966), \"failure to object to a practice which Ohio had long allowed cannot strip [the petitioner] of his right to attack the practice following its invalidation by this Court,\" with McMann v. Richardson, 397 U.S. 759, 90 S.Ct. 1441, 25 L.Ed.2d 763 (1970), not attack guilty plea sentence based on coerced conviction subsequently subject to invalidation by Jackson v. Denno, 378 U.S. 368, 84 S.Ct. 1774, 12 L.Ed.2d 908 (1964), with current cases, Engle v. Isaac, supra, 456 U.S. 107, 102 S.Ct. 1558, with Reed v. Ross, supra, 468 U.S. 1, 104 S.Ct. 2901. Finally, we have State v. Murray, supra, and most recently Yates v. Aiken, ___ U.S. ___, 108 S.Ct. 534, 98 L.Ed.2d 546 (1988). This kind of pragmatic political-theory dominated chargeability affords a slender reed upon which a firm foundation for Wyoming constitutional law can be built. This is stare decisis by the month or four-year election results. I would ask again, what is the purpose of constitutional rights in the justice-delivery (criminal justice) system? See Chemerinsky, Thinking About Habeas Corpus, 37 Case W.Res.L.Rev. 748, 775 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. If it is to be believed that democratic processes have any extended future in this society, it must be recognized that standards and principles of the law must have a basic individual acceptability. Assuming that concept, small doubt remains that political-dogma substitutes for constitutional processes can have only a brief validity time. As separate-but-equal could not survive in this democracy, so also a substitute of pragmatism in fault found will not alone continue as a substitute for due process and constitutional rights to be maintained. No exceptional scholarly aptitude is required to recognize adaptations denied in fairness are only briefly to remain. Procedural default from unintended waiver fits precisely and however inflicted upon other courts need not become a termite within the foundation of this state's law. See Interpreting the State Constitution, supra. \"For the judge is not seated to give away the just things as a gratification, but to judge them, for he has not sword to gratify whoever seems favorable to him, but to give judgment according to the laws.\" Plato's Apology of Socrates, Four Texts on Socrates, translated with notes by Thomas G. West and Grace Starry West, p. 63 (1984). \"In the age of image, of popularity, of emotionalism, it is vital that we help our fellow citizens to see how important substance is, how indispensable courage and rationality are, how essential the rule of law remains to a free society.\" Speech by Chief Justice Rose Elizabeth Bird, January 4, 1987.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. If the pessimism of reflected constitutional concern seems extended, two even more disturbing evaluations can be found in the most current literature. Kinoy, The Present Constitutional Crisis, 27 Wn.burn L.J. 1 (1987); Hentoff, The Constitution as an Endangered Species, 22 Gonzaga L.Rev. 419 (1987/88); Williams, Where is Freedom: Federal or State Constitutions?, 30 Howard L.J. 507 (1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. In his address to the Conference of Chief Justices 24 years ago, Justice Brennan concluded with these remarks: \"We must remember these rapid changes when alarm is expressed that constitutional change is coming too fast and going too far. For, in today's world, what our constitutional fundamentals meant to the wisdom of other times cannot be their measure to the vision of our time. You and I are committed to the constitutional ideal of libertarian dignity protected through law. Crises at hand and in prospect are creating, and will create, more and more threats to the achievement of that ideal — more and more collisions of the individual with his government. The need for judicial vigilance in the service of that ideal was never greater. It has become the business of all of us to protect fundamental constitutional rights threatened today in ways not possibly envisaged by the Framers.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. I hope that no case for which I am called to function in the constitutional responsibility of this office will afford similar future comment from the federal judiciary.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. A ten-minute interview with a defendant in a pleaded-out felony, in the opinion of this writer, should be a basis of near-automatic suspension for mental incompetency and per se negligent malpractice.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. I would apply the general logic and the admonition found in Rheenen, Inequitable Treatment of Ineffective Assistance Litigants, 19 Ind. L.Rev. 159, 168 (1986): \"The problem described here is a classic example of rules founded in reason gradually becoming senseless dogma.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Nor will I separate from what is slothful, negligent, ignorant, just wrong, or whatever else might constitute ineffectiveness, from what is just \"unethical.\" See Jones v. Barnes, supra, 463 U.S. at 754, 103 S.Ct. at 3314, Blackmun, J., concurring. This concept also accommodates my disagreement with philosophical acceptance of the critique of capital defense attorney David Bruck that current minimum standards for effectiveness of counsel have been met \"if a mirror held under counsel's nose clouds up.\" Standard 11.2, National Legal Aid \u0026 Defender Association, Standards for the Appointment and Performance of Counsel in Death Penalty Cases at 51, 53 n. 2 (1987), quoting from the Los Angeles Daily Journal (September 30, 1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Cutbirth, as was the case with Kortz v. State, Wyo., 746 P.2d 435 (1987), demonstrates that definition of appellate issues on appeal requires a level of experience and supervision which may not properly be afforded by intern programs unless more comprehensive supervision is provided. The architect of what we now call \"waiver\" arose in brief writing in Cutbirth v. State, supra, by a senior law student intern program. Those programs are valuable in training, but not necessarily constitutional in waived justice. See also Engberg v. State, Wyo., 686 P.2d 541, cert. denied 469 U.S. 1077, 105 S.Ct. 577, 83 L.Ed.2d 516 (1984); and Engberg v. State, No. 87-15, now pending in this court on post-conviction-relief petition, where more than a dozen realistic appeal issues were not \"found\" by appellate counsel on original appeal. Who have been responsible for the error and neglect has not been explored in present proceedings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. In amended petition for post-conviction relief, strongly stated additional contentions were made involving theft of property and prosecutorial misconduct, which contentions are not presented in this appeal as issues now stated and thus will not be reviewed. Appellant did clearly raise the question of ineffectiveness of appellate counsel, to which the State responded that lack of identification of acts foreclosed relief. Lack of effectiveness of appellate counsel is near mechanical in definitional character by record review to determine constitutionally challenged events leading to conviction.\u003c/span\u003e\n\n",
    "body_length": 177957,
    "citedas": [
      "751 P.2d 1257"
    ],
    "attorneys": "Leonard D. Munker, State Public Defender, and Martin J. McClain, Deputy State Public Defender, Wyoming Public Defender Program, for appellant. A.G. McClintock, Atty. Gen., Gerald A. Stack, Deputy Atty. Gen., John W. Renneisen, Mary B. Guthrie, Sr. Asst. Attys. Gen., and Kaylin D. Kluge, Legal Intern, for appellee.",
    "category": [
      "243",
      "36",
      "78",
      "75"
    ],
    "judges": "BEFORE BROWN, C.J., AND THOMAS, CARDINE, URBIGKIT AND MACY, JJ.",
    "citation_count": 2
  }
}
