{
  "id": "DqWLSGYBTlTomsSBibeJ",
  "document": {
    "title": "11/09/77 POTOMAC ELECTRIC POWER CO. v. PUBLIC",
    "full_title": "POTOMAC ELECTRIC POWER CO. v. PUBLIC SERVICE COMMISSION OF THE DISTRICT OF COLUMBIA PEOPLE'S COUNSEL, INTERVENOR",
    "jurisdiction": "District of Columbia Court of Appeals",
    "date": "1977-11-09T00:00:00.000Z",
    "docket": "No. 10490",
    "body": "HARRIS, Associate Judge: Potomac Electric Power Company (Pepco) has petitioned this court pursuant to D.C. Code 1973, § 43-705, to set aside as confiscatory the rates prescribed by the Public Service Commission of the District of Columbia (the Commission) for its retail sales of electric energy to District of Columbia customers. The rate rulings were established by a two-to-one vote of the Commission in Order No. 5739 on November 12, 1975. Re Potomac Electric Power Co., 11 P.U.R.4th 215 (PSC D.C. 1975). Pepco's request for reconsideration was denied by Order No. 5759 dated January 12, 1976. Concluding that the Commission arbitrarily and unreasonably set the company's rate base at a level insufficient to allow Pepco a reasonable opportunity to earn the rate of return which the Commission itself found to be just and necessary, we vacate the orders appealed from and remand for further proceedings.\n\nI. PROCEDURAL HISTORY\n\nOn December 20, 1974, Pepco filed an application for an increase in its retail rates. The application was based upon a calendar 1974 test year, and sought an increase of approximately $50,832,000 in gross operating revenues annually. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Such additional revenues theoretically would have resulted in a 9.75% rate of return on the company's 1974 year-end rate base. Following a series of postponements and delays, a prehearing conference was held on May 6, 1975. As an outgrowth of that conference, the Commission granted intervention to 13 parties, one of whom, People's Counsel, is an intervenor on appeal. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Twenty-two days of public hearings ultimately were held from June 4 through July 24, 1975. On July 18, 1975, Pepco filed with its rebuttal testimony an updated test period reflecting actual operating figures for the 12 months ended June 30, 1975. Thereafter, further cross-examination was conducted, briefs were filed, and oral argument was heard by the Commission on September 3, 1975.\n\nAfter filing its original application, Pepco twice sought interim rate increases (by applications dated March 12 and July 3, 1975) based upon (1) the adverse impact of accelerating attrition, \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e and (2) the length of time which obviously would elapse before the Commission's final decision. Both of those applications were dismissed summarily by the Commission. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nOn November 12, 1975, the Commission issued its opinion and order. It (1) found an overall 9.1% rate of return to be reasonable and necessary, (2) authorized an increase in Pepco's gross annual operating revenues of $27,657,000, and (3) determined the basic design of the new rates. Calculations pertaining to the revenue increase were based essentially upon a calendar 1974 test period. Commissioner Stratton vigorously Dissented, citing the majority's refusal to allow properly for attrition as the principal reason for the Commission's failure to set rates at a level which would be sufficient to permit Pepco the opportunity to earn a reasonable rate of return. 11 P.U.R.4th at 237-51.\n\nPursuant to the Commission's opinion, Pepco filed a new schedule of rates on November 7, 1975. Thereafter, on December 3, 1975, Pepco petitioned the Commission for expedited review of those rates. The Commission approved the rate schedules on December 12, 1975, to become effective the following day.\n\nAlso on December 12, 1975, Pepco filed an Application for Reconsideration of Order No. 5739. That was denied in all relevant respects by the Commission in Order No. 5759 on January 12, 1976.\n\nOn appeal, Pepco accepts the 9.1% rate of return determined by the Commission, but charges that the Commission (1) arbitrarily refused to make use of the company's most recent actual operating data of record for the test period (i.e., data for the 12-month period ended June 30, 1975) or, (2) in the alternative, failed to make adjustments to the calendar 1974 test period data for continuing attrition and for certain known changes of record which occurred during the first six months of 1975. Pepco alleges that it thus was denied a reasonable opportunity to earn the rate of return found necessary by the Commission to maintain the company's financial integrity. The Commission, on the other hand, defends its use of the 1974 test period and its limited allowance for attrition primarily by singling out two \"reasons\" for Pepco's rapidly declining financial condition during the test year - the energy crisis (which led to reduced consumption) and a decrease in sales of electricity to a pool of interconnected utilities - and by stressing their irrelevancy to forecasts of Pepco's financial needs. The proceeding now before us represents the fourth time in six years that Pepco found it necessary to apply to the Commission for rate increases.\n\nII. SCOPE OF REVIEW\n\nIn reviewing orders of the Commission in rate cases, our authority is delineated by D.C. Code 1973, § 43-706. It is limited to questions of law, and to findings of fact insofar as they may be \"unreasonable, arbitrary, or capricious.\" \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Congress properly has vested the Commission, not this court, with the primary ratemaking authority, although the Commission is bound both to exercise its powers rationally and lawfully, and to set rates that are \"just and reasonable.\" D.C. Code 1973, §§ 43-301, -401, -411; Chesapeake \u0026 Potomac Telephone Co. v. Public Service Commission, D.C.App., 330 A.2d 236, 240 (1974). These standards are the same as those embodied in the Natural Gas Act, 15 U.S.C. § 717(c) and (d) (1970), and the Federal Power Act, 16 U.S.C. § 824(d) and (e) (1970). See Washington Gas Light Co. v. Baker, 88 U.S.App.D.C. 115, 118-19, 188 F.2d 11, 14-15 (1950), cert. denied, 340 U.S. 952, 95 L. Ed. 686, 71 S. Ct. 571, appeal after remand, 90 U.S.App.D.C. 98, 195 F.2d 29 (1951).\n\nThe constitutional basis for requiring utility rates to meet the test of reasonableness derives from the Fifth and Fourteenth Amendments. Federal Power Commission v. Natural Gas Pipeline Co., 315 U.S. 575, 582, 86 L. Ed. 1037, 62 S. Ct. 736 (1942) (hereinafter Natural Gas Pipeline). The Supreme Court has held that rates which are not adequate to yield a reasonable return on the value of the property used by a utility company to furnish its service to the public are unjust, unreasonable, and confiscatory, and that their effectuation would deprive the utility of its property without due process or just compensation. Natural Gas Pipeline, supra, at 585-86; McCardle v. Indianapolis Water Co., 272 U.S. 400, 408, 71 L. Ed. 316, 47 S. Ct. 144 (1926) (hereinafter McCardle); Bluefield Water Works \u0026 Improvement Co. v. Public Service Commission, 262 U.S. 679, 690, 67 L. Ed. 1176, 43 S. Ct. 675 (1923) (hereinafter Bluefield).\n\nCongress, however, has provided no formula for determining what constitutes rates which are \"just and reasonable.\" To fill that void, the Supreme Court has expanded upon the statutory standard in the Natural Gas Pipeline case and its progeny. It is axiomatic that to be \"just and reasonable,\" rates must be set at a level that permits the company to earn a fair rate of return on its investment. See Federal Power Commission v. Hope Natural Gas Co., 320 U.S. 591, 603, 88 L. Ed. 333, 64 S. Ct. 281 (1944) (hereinafter Hope); Natural Gas Pipeline, supra, at 596-97; McCardle, supra, at 408-09; Bluefield, supra, at 690. While regulation does not guarantee that a utility will achieve its projected revenues, it must provide the utility with a reasonable opportunity to earn a rate of return sufficient to maintain the company's financial integrity, to attract necessary capital at a reasonable cost, and to compensate investors fairly for the risks they have assumed, while protecting the relevant public interests. Hope, supra, at 605. This involves a delicate balancing of investor and consumer interests. Id., at 603.\n\nNo single formula - or combination of formulas - limits a regulatory commission's power to set \"just and reasonable\" rates. However, a commission is obliged to make pragmatic adjustments where appropriate circumstances exist. Hope, supra, at 602; Natural Gas Pipeline, supra, at 586. Courts may intervene only upon a \"clear showing\" of a due process violation. If the commission's order, viewed in its entirety, produces no arbitrary result, judicial inquiry is to be terminated. Natural Gas Pipeline, supra, at 586.\n\nThus, \"it is the result reached not the method employed which is controlling.\" Hope, supra, at 602. Courts are to concern themselves primarily with the overall impact of a rate order, rather than with the theories behind it. Ibid. However, if the total effect of a rate order is found to be unjust or unreasonable, a reviewing court must delve into the details of the order. It must give reasoned consideration to each contested element of the rate order \"to determine the possible presence of arbitrary action.\" \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Goodman v. Public Service Commission, D.C.App., 309 A.2d 97, 101 (1973) (hereinafter Goodman); accord, Telephone Users Association v. Public Service Commission, D.C.App., 304 A.2d 293, 298 (1973), cert. denied, 415 U.S. 933, 39 L. Ed. 2d 492, 94 S. Ct. 1448 (1974) (hereinafter Telephone Users). See Permian Basin Area Rate Cases, 390 U.S. 747, 790-92, 20 L. Ed. 2d 312, 88 S. Ct. 1344 (1968). Only in such a way may a reviewing court effectively evaluate the fairness and reasonableness, or the potentially confiscatory nature, of a particular rate order.\n\nIn the Permian Basin Area Rate Cases, supra, at 791-92, the Supreme Court summed up the responsibilities of a reviewing court:\n\nFirst, it must determine whether the Commission's order, viewed in light of the relevant facts and of the Commission's broad regulatory duties, abused or exceeded its authority. Second, the court must examine the manner in which the Commission has employed the methods of regulation which it has itself selected, and must decide whether each of the order's essential elements is supported by substantial evidence. Third, the court must determine whether the order may reasonably be expected to maintain financial integrity, attract necessary capital, and fairly compensate investors for the risks they have assumed, and yet provide appropriate protection to the relevant public interests, both existing and foreseeable.\n\nThis court has adhered to the standards of review thus enunciated on several occasions. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e In the instant case, we have examined the overall effect of the Commission's opinion, and find it to be unjust and unreasonable in that it deprived Pepco of the opportunity to earn a fair rate of return by improperly disregarding the latest relevant historical data of record pertaining to the company's operations. Examination of the elements of the opinion reveals several findings and Conclusions (expressed in the Commission's opinion in an overlapping, narrative style) which are unreasonable, arbitrary, or capricious. These include the Commission's refusal to utilize the most recent test period in the record, its failure to account for continuing attrition, and its refusal to recognize certain known changes which occurred after the originally proposed calendar 1974 test period.\n\nIII. THE OVERALL EFFECT OF THE COMMISSION'S OPINION AND THE RATE OF RETURN\n\nBasic to Pepco's arguments is the contention that the Commission effected an unreasonable and arbitrary result when it established a rate base - and thereby provided for revenues - that deprived the company of any opportunity to earn the rate of return which was found reasonable and necessary by the Commission itself. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e In its opinion, the Commission initially found \"that a fair rate of return for Pepco is 9.1%.\" It further concluded that:\n\nIn order to attract equity capital, a return on equity of 13% is required by PEPCO; and we find an equity return at that level to be fair and reasonable.\n\nNotwithstanding those Conclusions, by arbitrarily disregarding actual, historical, and uncontroverted data submitted as evidence by Pepco during the extended course of the hearing, the Commission all but guaranteed that the company would not be able to approach earning the rate of return it authorized.\n\nThe process of ratemaking involves the making of an honest and intelligent forecast of probable future values based upon all relevant circumstances, including primarily known performance during a period of time in the immediate past (i.e., a test period). See West Ohio Gas Co. v. Public Utilities Commission (No. 2), 294 U.S. 79, 82, 79 L. Ed. 773, 55 S. Ct. 324 (1935) (hereinafter West Ohio Gas); McCardle, supra, at 408-09; Missouri ex rel. Southwestern Bell Telephone Co. v. Public Service Commission, 262 U.S. 276, 288, 67 L. Ed. 981, 43 S. Ct. 544 (1923); Id., at 291-92 (Brandeis, J., Concurring in the judgment); Telephone Users, supra, at 297. The validity of the test period approach rests upon the assumption that the relationship among revenues, expenses, and rate base which were established in the test year will continue into the near future, when the prescribed rates will be in effect. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e See Letourneau v. Citizens Utilities Co., 128 Vt. 129, 259 A.2d 21, 24 (1969).\n\nAccordingly, a valid test period must be based upon the utility's most recent actual experience, with adjustments for all known changes affecting costs and revenues for the immediate future. Telephone Users, supra, at 297; Southern New England Telephone Co. v. Public Utilities Commission, 29 Conn.Supp. 253, 282 A.2d 915, 919 (Super. 1971); Letourneau v. Citizens Utilities Co., supra, 259 A.2d at 23-24; see Boston Gas Co. v. Department of Public Utilities, 359 Mass. 292, 269 N.E.2d 248, 259 (1971); New York Telephone Co. v. Public Service Commission, 29 N.Y.2d 164, 272 N.E.2d 554, 324 N.Y.S.2d 53 (1971). See also Goodman, supra, 309 A.2d at 100. It is well settled that the rate maker may not rely on out-of-date information when more recent actual experience, which shows a substantial disparity between the earlier forecasts and the rate of return actually earned, is available. West Ohio Gas, supra, at 82. Suitable adjustments must be made to accommodate the latest available relevant data which are received in evidence.\n\nTo shut one's eyes to [the latest available figures] altogether, to exclude them from the reckoning, is as much arbitrary action as to build a schedule upon guesswork with evidence available. [ Id., at 81-82.]\n\nSee New York Telephone Co. v. Public Service Commission, supra (PSC reversed for refusal to reopen hearing to receive actual data which differed from projections).\n\nA. The Most Recent Available Data\n\nPepco submitted to the Commission clear and uncontroverted evidence of its rapidly declining financial position on several occasions during the 11 1/2 month period between the filing of the original application and the issuance of the Commission's opinion. In its application, Pepco first based its rate request upon a calendar 1974 test period, but it also forecast its operating results for 12-month test periods ending March 31, 1975, June 30, 1975, and December 31, 1975. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e When filed, those projected figures were not nearly as high as those later found to be required by the Commission, and actual experience proved them to be unduly optimistic. See West Ohio Gas, supra, at 82. The forecasts, as well as the actual, historical data submitted by Pepco, reflected continuing attrition; that is, a chronic inability on the part of the company to earn its authorized rate of return because the increases in its expenses and/or rate base consistently outpaced its increases in revenues. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThe Commission further was alerted to the dramatic effects of continuing attrition on the utility when Pepco filed two requests for interim rate relief, subject to refund, pending the Commission's final opinion. The company filed the interim requests with a realization that its financial position was declining rapidly during the interval which was occasioned by administrative delay. As noted, the interim applications were filed in March and July of 1975, respectively, and were accompanied by updated direct testimony and exhibits reflecting a continuing deterioration in operating results. As we have noted, the Commission denied those applications.\n\nCross-examination with respect to Pepco's direct presentation began on June 4, 1975. The company's witnesses pointed out the severe attrition which had been experienced by Pepco since the end of 1974, and demonstrated that the test period originally proposed had become irrelevant to the company's actual financial status. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e The principal Commission Staff witness, while adhering to the calendar 1974 test period, also recognized and deplored the continuing presence of attrition. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nPepco then prepared a compilation of actual operating results for the 12 months ended June 30, 1975. That submission was filed on July 18, 1975, with the company's prepared rebuttal testimony. That filing was made during the cross-examination of the witnesses for the Commission's Staff and the intervenors. The cross-examination of Pepco's rebuttal witnesses began on July 23, 1975. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nPepco's presentation of the updated test period data was in the same format as had been utilized in its original application (filed on December 20, 1974), and as it thereafter had been amended to show actual 1974 results. Only the numbers were changed to reflect the significant intervening alteration in Pepco's financial status due to continuing attrition.\n\nAs part of this presentation, Pepco introduced into the record the following table of actual results of the company's operations:\n\nEarnings Perk Ratio of Earnings Return on Average\n\nShare of Common to Fixed Charges Common Stock\n\nStock Equity Capital\n\nYear\n\n1968 $1.35 2.94 10.5%\n\n1969 1.09 2.28 8.3\n\n1970 1.25 2.10 9.1\n\n1971 1.33 2.10 9.4\n\n1972 1.53 2.58 10.5\n\n1973 1.71 2.70 11.4\n\nTwelve Months\n\nEnded\n\nJune 30, 1974 1.87 2.81 12.3\n\nJuly 31, 1974 1.86 2.74 12.2\n\nAugust 31, 1974 1.78 2.63 11.7\n\nSeptember\n\n30, 1974 1.76 2.56 11.5\n\nOctober 31, 1974 1.72 2.51 11.3\n\nNovember 30, 1974 1.70 2.47 11.1\n\nDecember 31, 1974 1.63 2.43 10.7\n\nJanuary 31, 1975 1.57 2.36 10.3\n\nFebruary 28, 1975 1.52 2.30 9.9\n\nMarch 31, 1975 1.44 2.20 9.5\n\nApril 30, 1975 1.32 2.09 8.7\n\nMay 31, 1975 1.24 2.01 8.2\n\nJune 30, 1975 1.21 1.90 8.1\n\nPepco's witness stressed that the practical effect of those results was to preclude the company from \" additional capital funds in the public securities markets on any acceptable terms.\" \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Characterizing Pepco's position as \"critical,\" he continued:\n\nPepco has clearly begun to lose confidence and the loss will accelerate unless the Company is able to obtain the rate relief sufficient to achieve the level of results required to enable the Company to retain present and attract potential investors in its securities. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nNo substantial objection to the content of Pepco's rebuttal testimony was made, and no issue was raised concerning the calculation of the rate base utilizing the actual data for a test year ended June 30, 1975.\n\nSubsequent to the hearing, Pepco supplied for the record its financial results for the 12-month periods ended July, August, and September of 1975 as they became available:\n\nEarnings Per Share Ratio of Earnings Return on Average\n\nof Common Stock to Fixed Charges Common Stock\n\nEquity Capital\n\nTwelve Months\n\nEnded\n\nJuly 31, 1975 $1.21 1.90x 8.1%\n\nAugust 31, 1975 1.18 1.90 7.9\n\nSeptember 30, 1975 1.16 1.89 7.78\n\nFinally, in its brief, oral argument, and petition for reconsideration before the Commission, the company repeated its need for greater rate relief than that afforded by rates based upon the outdated calendar 1974 test period.\n\nB. The Commission's Exclusion of the Most Recent Available Data\n\nPepco's pleas, however, went largely unheeded. Despite a pro forma recitation to the contrary, the Commission's opinion effectively ignored the overall impact of continuing, post-1974 attrition on the company's financial integrity. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Concurring generally with the recommendations made by its Staff, the Commission de-emphasized the role of attrition in Pepco's financial woes, selecting instead two phenomena allegedly unrelated to attrition - the 1974 energy crisis and a decrease in sales to a pool of interconnected electric companies - as the primary \"causes\" of Pepco's economic troubles. In so doing, the Commission did acknowledge the historic problem of attrition and expressed concern over its own ineffectiveness in coping with the company's financial problems in the past. Nonetheless, it did not even mention the substantial data reflecting 1975 financial developments which were submitted by Pepco on numerous occasions. Such data, manifestly relevant and significantly different from the outdated statistics relied upon by the Commission, were presented by Pepco in the following ways: (1) in the forecasts and trends filed with the original application; (2) in the two later requests for interim relief, which were supported by updated testimony and exhibits; (3) during the cross-examination of the company's witnesses in its direct and rebuttal cases; (4) in the testimony of the Commission's own Staff witnesses; (5) in the presentation prior to the closing of the record of actual figures for the more recent test year ended June 30, 1975; and (6) in written and oral submissions made after the closing of the public hearing. The Commission's exclusion of this substantial and relevant evidence from its consideration was an unreasonable and arbitrary exercise of its ratemaking authority.\n\nThe overall effect of the Commission's opinion was to deny Pepco the chance to earn the rate of return termed \"required,\" \"fair,\" and \"reasonable\" in the opinion itself. Actual, historical evidence which was in the record for at least several months prior to the issuance of the Commission's opinion clearly demonstrated that Pepco's rate of return on equity had declined steadily - from 10.7% on December 13, 1974, and to 8.1% on June 30, 1975 (and, after the record was closed, to 7.78% on September 30, 1975). The order under review, supposedly designed to raise Pepco's return on common equity to 13% from the 10.7% actually experienced as of the end of 1974, could not conceivably raise Pepco's return on equity to the \"required\" 13% level from the 8.1% rate experienced by the company as of June 1975 (or from the 7.78% rate experienced as of September 1975).\n\nThe one significant attrition-related rate base adjustment made by the Commission, that of using year-end 1974 data for Plant in Service, reflected only a general consideration of the historical trend of such costs. The available post-1974 data of record were excluded from the calculations.\n\nIn its brief before us, the Commission characterizes Pepco's complaint as one directed essentially toward \"the ever present problem of regulatory lag - an unfortunate - but inevitable part of the regulatory process,\" the risk of which must be shouldered by the company and its investors. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e However, the readily recognized problem of regulatory lag has been considered by the Commission in earlier cases as a factor to be dealt with in calculating the rate of return, and as one to be allocated equitably to consumers as well as investors. Chesapeake \u0026 Potomac Telephone Co. v. Public Service Commission, supra, at 241-42 (permitting an interim adjustment for future lag); Telephone Users, supra, at 299 n.15 (justifying the use of a year-end rate base in light of evidence of regulatory lag and attrition). Realistic ratemaking in today's economic climate must take into account the lengthening delays occasioned by the regulatory processes, while recognizing the need for preserving an appropriate balance between investor and consumer interests. In the instant case, the Commission arbitrarily and unreasonably cited the problem of regulatory lag in an effort to justify its failure to strike the needed balance by utilizing the company's most recent historical data of record.\n\nUrging the use of the most current actual data available, the Supreme Court has warned that \"elaborate calculations which are at war with realities are of no avail.\" Lindheimer v. Illinois Bell Telephone Co., 292 U.S. 151, 164, 78 L. Ed. 1182, 54 S. Ct. 658 (1934), quoted in West Ohio Gas, supra, at 82. The Commission in this case, electing not to be attuned to the realities of continuing inflation and attrition, refused to take proper cognizance of known and relevant changes of record. It thereby disadvantaged both investor and consumer interests, and denied Pepco its constitutionally-guaranteed opportunity to earn a fair rate of return on its investment. The exclusion of the most recent available data from consideration and evaluation by the Commission was arbitrary in nature, confiscatory in effect, and made its decision one which is inconsistent with both reason and the evidence. See Telephone Users, supra, at 300-01. See generally West Ohio Gas, supra, at 82; New York Telephone Co. v. Public Service Commission, supra.\n\nIV. THE ELEMENTS OF THE COMMISSION'S ORDER: THE CORRECT TEST PERIOD\n\nHaving concluded that the overall effect of Order No. 5739 was unjust and unreasonable (D.C. Code 1973, §§ 43-301, -401, -411), we must proceed to consider the elements thereof challenged by Pepco. See Telephone Users, supra, at 298; see also Permian Basin Area Rate Cases, supra, at 790-91. Primarily, the company contends that the Commission erred in refusing to replace the outdated calendar 1974 test period data with the actual data submitted for the 12-month period ended June 30, 1975. According to Pepco, the striking increases in its expenses and the precipitous decline in its earnings, clear evidence of which was duly made a part of the record, unequivocally showed the 1974 test year to be unrepresentative of the future period during which the new rates would be in effect. The company emphasized that its revenue/expense/rate base relationships had changed so significantly that application of the Commission's own ratemaking formula to the more recent data would have necessitated an increase of $48.6 million in revenues, rather than the $27.7 million actually authorized. When accompanied by the actual figures reflecting Pepco's continuing decline in its rate of return on equity, the evidence demonstrated clearly and convincingly that only rates based upon the latest available data of record - data for the 12 months ended June 30, 1975 - could have afforded the company an opportunity to approach earning the rate of return found to be required by the Commission to maintain the utility's overall financial integrity, to retain investor confidence, and to assure the economic viability which is vital to Pepco's continued ability to provide reliable service to the public.\n\nIn seeking to justify its use of the calendar 1974 test period, the Commission concluded that there were two primary \"causes\" of Pepco's financial decline during the latter part of 1974 which rendered the test year both historically \"atypical\" and presently representative of a \"new normalcy.\" A substantial decrease in retail sales due to energy conservation during the fuel crisis which surfaced in 1974 and a significant drop in energy sales to a pool of utility companies were cited as the two factors which distinguished 1974 from earlier years. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e They allegedly were responsible for the downward trend in earnings, a trend which the Commission acknowledged \"shows no sign of reversal.\" The calendar 1974 test year therefore was selected over previous years as being \"more representative of conditions reasonably expected to exist in the future.\" It also was chosen, however, without reference to known changes of record occurring more recently than the end of 1974, as we have discussed.\n\nThe Commission further found (although its Dissenting member disagreed) that these \"causes\" were not related to attrition. The Commission's majority stated, however, that\n\nthe record is clear that the increase in investment costs per unit of output noted in our last decision has continued, * * * we are persuaded that attrition is a phenomenon that is still with us, and we will therefore now, as we have in the past, use an end of period rate base, with appropriate adjustments, in order to compensate for the presence of attrition.\n\nThe reasoning and Conclusions thus enunciated are incongruous.\n\nThe Commission found the 1974 earnings trend to be decreasing at a faster pace than that experienced in previous years, and admitted that \"the time, effort and expense involved in the 1970, 1972, and 1973 PEPCO cases appear to have been ineffectual in solving the economic problems of this utility.\" \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e This acknowledgement was made in the face of record evidence demonstrating that Pepco failed by significant margins to earn the rates of return found necessary by the Commission in 1970 and 1973, or at any time from 1970 to 1975. The company's rate base increased almost three times as fast as its operating income from 1973 to 1975. Notwithstanding such facts and findings, the Commission proceeded nominally to apply the same remedy used in the earlier rate cases - an end-of-period rate base. However, it then diluted that remedy by including the lower average figures for Construction Work in Progress (CWIP) and Materials and Supplies (M\u0026S). Those adjustments alone arbitrarily reduced the company's rate base by a total of approximately $36.8 million, and correspondingly reduced its revenue requirements by approximately $7.5 million.\n\nBy adopting a diluted, end-of-1974 rate base, the Commission all but made it certain that Pepco would not be able to earn the rate of return which the Commission found to be necessary to attract capital and maintain investor confidence. In an attempt to keep rates down, the Commission impermissibly ignored the consumers' and the investors' long-range concerns with the financial stability of the utility. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e See Hope, supra, at 603; Bluefield, supra, at 692-93, Missouri ex rel. Southwestern Bell Telephone Co. v. Public Service Commission, supra, at 291-92 (Brandeis, J., Concurring in the judgment).\n\nReviewing the abundant record evidence of Pepco's precipitous decline in earnings beginning mid-way through 1974 and continuing unabated into 1975, we conclude that the Commission's decision to use a partially end-of-period calendar 1974 rate base was arbitrary as a matter of law. The revenue/expense/rate base relationships that allegedly would have provided a fair rate of return during calendar 1974 manifestly had changed, and no longer could be relied upon to produce a fair rate of return during the future period when the new rates would be in effect. The requisite \"delicate balance\" between investor and consumer interests was not attained, as the burden of shouldering the losses was placed only upon the company and its investors.\n\nConfronted with strikingly similar circumstances in a telephone company rate case, the New York Public Service Commission routinely incorporated data from the six months following the originally-filed test period into a new test year. City of New York v. Public Service Commission, 42 App.Div.2d 259, 346 N.Y.S.2d 6 (1973). That commission explained its adoption of the substituted test year \"by stating that it would be unfair to the Company not to include actual operating results for the first six months of 1971.\" 346 N.Y.S.2d at 8. In the instant case, the Commission should have reached the same Conclusion. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nFurthermore, by focusing narrowly on two isolated \"causes\" of the company's financial decline and distinguishing them from attrition-related factors (for which year-end or other adjustments are made), the Commission failed properly to evaluate and deal with Pepco's overall economic problems. We agree with Dissenting Commissioner Stratton's assessment of the majority's action:\n\nWith today's decision the commission takes a giant step - backwards. Backwards into the ratemaking ethos of a departed era when the harsh realities of an uncertain energy environment, and rampant inflation were not with us. Today's decision denied the reality, abundantly demonstrated in the record, of remorseless price escalation in virtually every component of the cost of service, and by doing so insures the prompt relitigation of all the issues in this case.\n\nThe Commission further attempts to justify its failure to utilize a test period ended June 30, 1975, by attacking the procedural aspects of Pepco's introduction of the new data into evidence. The Commission first argues that Pepco did not manifest an intention to have the data for the 12-month period ended June 30, 1975, constitute the bases for a more valid test period. To support this contention, the Commission excerpted from the testimony of a Pepco official the following:\n\nBy the date of that isolated bit of testimony, seven months already had elapsed since Pepco filed its rate increase application. During that time, the company's financial situation rapidly was worsening and its earnings level was approaching the annual dividend level. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Two urgent requests for interim rate relief subject to refund had been denied. The company was experiencing an actual loss of $75,000 per day during the delay, and understandably was seeking expeditious resolution of its rate increase application. Confronted with those realities, the Pepco official urged the substitution of the most current information available (that for the year ended June 30, 1975), but did object to any reopening or continuance of the hearings to consider the new data. He stated:\n\nA. There should be ample opportunity between now in July and the time the case is concluded for the Commission staff to review the June figures and assure themselves that it [ sic ] is comparable to the December figures that were originally submitted.\n\nQ. But we are still operating on the basis of a 1974 test year for the purposes of this proceeding; correct?\n\nA. Yes. I think it would be far preferable to use the most current information that is available, which would be June, but we would not want to introduce a delay by doing so, and we thought this would be, to present it now as a complete summary of the June figures and also to present the June figures in the same form as they were submitted by the staff would make it as convenient as possible for the Commission to use those figures in reviewing the case.\n\nIn this context it is apparent that the Pepco official intended that the most recent data be utilized in lieu of the outdated 1974 figures, but was reluctant to insist upon the substitution if doing so would risk further substantial delay. Moreover, on the next day, the President and Chairman of the Board of Pepco unequivocally urged the adoption of the most recent data within the test period. He testified:\n\nI will be quite candid and open with this Commission and everybody in the room. I instructed you, Mr. Hobelman, and lawyers in this case to update the test year, and for the June 30 test year, in this case. * * * I say to this Commission that I would urge the Commission to base its results on the June 30 figures. There is plenty of time for staff audit of those figures. All of the issues have been examined by the intervenors, by People's Counsel. There is nothing which should require, in my opinion, a delay about it.\n\nIn addition, Pepco's intent to have the Commission follow the accepted regulatory practice of basing its rate determinations upon the utility's most recent actual data was manifested by its presentation of the new data on the basis of the same formulas, and in the same format, as the 1974 data originally filed. Only the numbers were changed to reflect Pepco's worsening economic situation. Those changed numbers represented the most recent historical data which the Commission was bound to take into account. See West Ohio Gas, supra, at 82; Telephone Users, supra, at 297; New York Telephone Co. v. Public Service Commission, supra. They were not forecasts, which traditionally have been accorded special treatment in ratemaking proceedings. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e In both the testimony and the actual historical data, therefore, there was sufficient evidence of the company's intent on the record to warrant our concluding that a finding to the contrary was arbitrary and capricious.\n\nThe Commission also argues that the new data were filed too late, and that its adoption of the new test period would have unduly prolonged the proceeding and prejudiced the rights of other parties. However, in reciting only: (1) the fact that the new data were filed with the rebuttal testimony; (2) the truism that \" proceeding simply must come to a Conclusion at some point\"; and (3) that the adoption of the new operating results would \"necessitate further proceedings in recognition of the procedural rights of the other parties,\" the Commission failed to substantiate its Conclusion regarding any possible delay and potential prejudice which might have resulted from its utilization of the new test period data.\n\nThe new data were filed in ample time to allow for Staff and intervenor analysis and cross-examination, and no party sought additional time to review the updated facts. No objection was made to the admission of the testimony and its accompanying exhibits. No new issue concerning the revenue/expense/rate base relationships was raised either during cross-examination of the company's rebuttal witness (which began five days after the new data were filed), or during the five months after the hearings, during which time briefs were filed, oral arguments were heard, and the two orders appealed from were issued. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Finally, Pepco offered to await audit of the new data, and certainly there was more than ample time during the nearly four months which elapsed between the hearings and the Commission's decision for such an audit to be accomplished. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e It was only after the Commission issued its opinion, and Pepco filed its Application for Reconsideration, that arguments were advanced against utilizing the most recent actual data.\n\nAs the new data thus consisted only of historical figures which were uncontested, timely filed, and easily audited, considerations of due process would not have required an extension or reopening of the hearings to admit further testimony concerning the new data. See, e.g., Re Delmarva Power \u0026 Light Co., 337 A.2d 517, 518-19 (Del.Super. 1975); City of New York v. Public Service Commission, supra, at 9. This should have been apparent to the Commission, as reflected by our reasoning in Telephone Users, supra. In that case, the utility sought to introduce two additional wage adjustments as part of its rebuttal case, despite the fact that the company was fully aware of the pending changes at the time of its direct testimony. The Commission disallowed the adjustments, concluding that they did not afford the Staff or intervenor the opportunity to present evidence of offsetting adjustments without unduly prolonging the proceeding. We reversed, citing the following four factors as the bases for our holding: (1) the fact of the wage increase was known to all parties before the hearings began (it arose from a three-year contract between the utility and the union); (2) only the amount of the wage increase initially was unknown; (3) the company's counsel alerted all parties at a prehearing conference that the company might seek allowance for the added employee expenses; and (4) the additional expenses were submitted in the utility's forecast of operations filed two weeks before the Staff filed its evidence. 304 A.2d at 302.\n\nSimilarly, in the instant case: (1) the fact of Pepco's rapidly deteriorating financial condition and corresponding need for greater rate relief than that which would be afforded by employing the 1974 data was made known to all parties long before the hearings began (in the forecasts filed with the original application and in the interim rate requests accompanied by fully updated testimony and exhibits); (2) only the exact amounts of Pepco's later rate base components and financial requirements were unknown until the more current data were filed; (3) all the parties were alerted to the need for updating the test period both when the interim rate increase applications were filed and during Pepco's direct testimony; and (4) data for the successive 12-month periods ending January through May of 1975 were submitted in support of Pepco's request for interim rate increases, and hence were available for some time prior to the filing of the Staff's and intervenors' evidence.\n\nThe Commission contends that unlike the wage adjustment in the Telephone Users case, Pepco's new test period figures were not \"known and certain\" changes of record. We disagree. The new data reflected only actual, historical evidence of the company's financial situation for the 12-month period ended June 30, 1975. They included no estimates, conjecture, or forecasts. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Their authenticity was not challenged during or after the hearings. The new data consisted only of known changes of record, and the Commission erred in failing to use the figures for the 12-month period ended June 30, 1975 - the most recent actual data available - to establish the test period upon which to base its calculations of Pepco's allowable retail rates. Cf. Boston Gas Co. v. Department of Public Utilities, supra; New York Telephone Co. v. Public Service Commission, supra.\n\nV. THE EXISTENCE AND EFFECT OF ATTRITION\n\nSo holding, we address Pepco's additional challenges to Order No. 5739, primarily to aid the Commission both on remand and in future rate proceedings. Our Conclusions hopefully will reduce the necessity for Pepco so frequently to initiate new rate proceedings, the substantial costs of which inevitably are borne by the consumers.\n\nPepco contests the Commission's rejection of attrition as the major reason for the company's continuing financial decline. Attrition is the phenomenon which occurs when the utility's investment in rate base, or the operating expenses required to produce a unit of sales, or both, rise at a faster rate than the revenues from such sales. Telephone Users, supra, at 298; Boston Gas Co. v. Department of Public Utilities, supra, 269 N.E.2d at at 257 n.19. The largest single component of a utility's overall rate base is the value attributed to its Plant in Service. Typically, particularly for an electric utility, the next largest component is Construction Work in Progress (CWIP), which covers expansion projects prior to their completion, at which time their value simply is transferred to the Plant in Service account. In previous rate cases, the Commission recognized the serious attrition problem facing Pepco, and sought to help compensate for it by adopting year-end, rather than weighted average, figures for all such rate base components. See Re Potomac Electric Power Co., 3 P.U.R.4th 65 (PSC D.C. 1973); Re Potomac Electric Power Co., 83 P.U.R.3d 113 (PSC D.C. 1970). In the instant case, the Commission again recognized the continuing adverse impact of attrition on the company's earnings, and acknowledged that the previously-applied remedy of a fully year-end rate base had not been effective. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e Nonetheless, it proceeded to make a smaller allowance for attrition than it had in the past. This was done (1) by using year-end figures only for the Plant in Service component of the rate base, (2) by applying the lesser average figures for CWIP and Materials and Supplies (M\u0026S), and (3) by locking into the new rates based on those components an unreasonably high allowance for net profits which the Commission purported to believe would result from the sale of excess generating capacity to the PJM Interchange pool.\n\nPepco's protestations concerning the Commission's unwillingness to combat attrition permeate the record, and form the bases for the company's specific allegations of error. Arguing an alternative, however undesirable, to the formal adoption of the updated test period for the year ended June 30, 1975, Pepco contends that year-end, rather than weighted average, figures for CWIP and M\u0026S should have been included in its rate base. As noted, Pepco also argues that the test period should have been adjusted to reflect several major known changes of record.\n\nDeferring, for the moment, consideration of those specific allegations of error, we note generally that the historical evidence of Pepco's precipitous decline in rate of return and earnings (which began in mid-1974 and continued unabated through 1975) was thoroughly documented in the record, as discussed above. However, by disregarding the evidence submitted in 1975, and by rationalizing that the 1974 decline was attributed to factors allegedly unrelated to attrition (i.e., the energy crisis and a decline in sales to the PJM Interchange pool), the Commission arbitrarily utilized a test period and a consequent rate base devoid of predictive value.\n\nIn his Dissent, Commissioner Stratton criticized the majority for its failure to adopt a reasonable approach to correct or compensate for expense as well as rate base attrition:\n\nBy following the traditional test-year ratemaking approach in this case without making an appropriate allowance for attrition, the commission assumes that the distorted revenue/expense/rate base relationship in which this order is rooted will apply in 1976 and beyond, so long as this order is in effect. At the same time, protestations of bewilderment are entered at the fact that this is the company's fourth rate case in six years. The reason is obvious: increases in expense and rate base outpaced the increases in revenue after the 1970, 1972 and 1973 rate cases, as they will do after the 1975 case in the absence of an order that recognizes the fact and allows for it. Unhappily, the commission has done no more in this case than to set the stage for lamentations over the company's fifth rate request, which is sure to come in the near future. For, if ever a record demonstrated attrition, this one does. If ever a record called for realistic steps to deal with attrition, this one does. If there was ever a demonstration of the failure of revenue growth to keep up with the growth of expenses and investment, it appears in the record spread before the commission in this case, where there are data not only for the test year but also for the nine months following - data which the commission accepted into the record, I had thought, for the purpose of reaching a decision that took account of the real world as it was revealed to us by the operating results of the company during the pendency of the case.\n\nWe agree with his evaluation. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nWhen the Commission concluded that \"attrition in the future may play a less significant role than it has in the past,\" it ignored the substantial, uncontradicted evidence of record demonstrating an unabated and exacerbated decline in both the company's earnings and actual rate of return. It premised its Conclusion on the following three findings, all disputed by Pepco: (1) \"sales to retail customers appear to have resumed a somewhat normal growth pattern\"; (2) \"sales to PJM appear to have leveled off to a large degree\"; and (3) \"PEPCO has substantially reduced its construction budget . . . .\" The Commission's second premise is factually incorrect, as the net interchange revenues uncontestedly not only were forecast to but did in fact decline throughout 1975. Additionally, its first and third premise, while factually correct, do not contradict the substantial record evidence of continuing attrition. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e It is clear, therefore, that what \"appeared\" to the Commission to be an abatement of attrition was no more than \"the hope of a better life to come\" by which \" confiscation is not atoned for\". West Ohio Gas, supra, at 83.\n\nVI. CONSTRUCTION WORK IN PROGRESS AND MATERIALS AND SUPPLIES\n\nPepco's arguments pertaining to the Commission's refusal to adopt year-end figures for CWIP and M\u0026S also are well founded. The only justifications offered by the Commission for its decision to use average 1974 data are that the accounts fluctuated widely, and that their amounts in December of 1974 \"appear to be abnormally high.\" It also took the position that average amounts would be \"more representative of the flow of dollars in and out of the accounts.\"\n\nThe justifications advanced do not support the Commission's decision. Wide fluctuations in CWIP are irrelevant for the purpose of determining the rate base. Any investment leaving CWIP enters Plant in Service, and thereupon is simply switched from one rate base account to another. To conclude that an end-of-period account \"appears\" to be high is not material to a proper consideration of the overall rate base. Moreover, while an average figure might better represent the cash flow over a definite period of time in the past, its predictive value, ascertained in a vacuum, is questionable at best, particularly in light of the inexorable increases in fuel costs.\n\nThe manner in which the Commission short-circuited Pepco's efforts to achieve meaningful rate relief is most glaringly illuminated by the treatment afforded the funds invested in the company's newest generating plant, Chalk Point Unit No. 3. This unit was under construction during all of 1974, and the related investment was carried in the CWIP account. In May of 1975, construction was completed, and the related investment was transferred to the Plant in Service component of the rate base. The Commission, however, arbitrarily excluded substantial sums related to the new unit from the company's rate base not once, but twice.\n\nInitially, as we have noted, the Commission prescribed average rather than year-end CWIP figures for inclusion in the 1974 rate base. By refusing to utilize the more representative year-end figures for CWIP, the Commission arbitrarily disregarded the substantial sums invested by Pepco in that new plant, and thereby excluded approximately $27.5 million from the District of Columbia rate base. This effected a resultant decrease in the utility's revenue requirement of some $5.5 million. Such a revenue deficiency more than offset the attrition allowance which resulted from permitting an end-of-period rate base for Plant in Service. The portion of the investment in CWIP that had been \"averaged out\" by the Commission simply was not permitted to earn a return. (To have allowed the use of a fully end-of-period rate base would have permitted Pepco to earn an additional return of $2.5 million - an amount which would have substantially reduced the $4.3 million earnings deficiency forecast by the Staff to result from the Commission's decision.)\n\nIn addition to effecting an unjust result, such a decision deviated from precedent. In both the 1970 and 1973 Pepco rate orders, the predecessor Commission sought to protect Pepco against attrition by discarding the traditional average test year rate base in favor of an end-of-period rate base. In so doing, the Commission hoped to give greater recognition to increased future unit costs of generation arising from the company's construction program. Although the record revealed - and the present Commission's Staff recognized - that this method of combatting attrition had proven inadequate, the Commission chose to provide for even less relief directed towards counteracting attrition in the instant case than it had in the earlier cases.\n\nIn its second (and more costly) action regarding Chalk Point Unit No. 3, the Commission refused to recognize the known and certain change that occurred in May of 1975 when the $160 million in investment for that facility was transferred from the CWIP account into the Plant in Service account. By backing up to the end of 1974 for a determination of Plant in Service, and thus refusing to account for such a simple but major shift of funds, the Commission kept that $160 million from being able to earn a return as part of Plant in Service until the company's next rate case. In this way, the Commission dramatically built attrition into its ratemaking, in a manner which was patently arbitrary and unreasonable.\n\nThe Commission's principal Staff witness virtually admitted on cross-examination that his recommendation of this adjustment was rooted in sensitivity to public reaction. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e By adopting that recommendation, the Commission destroyed the delicate balance between investor and consumer interests, sacrificing the long-range goals of both groups to what it apparently perceived to be the immediate pecuniary interests of the consumers. Commissioner Stratton accurately focused on this point in his Dissent:\n\nIf one concedes our agency expertise, the CWIP-averaging decision must be deemed to be an informed decision. Since it is clearly wrong, and the circumstances point to only one other explanation for it - namely, an expediency perpetrated in the interest of holding down rates it must be seen as arbitrary and is, on that basis, probably reversible error.\n\nCommissioner Stratton also emphasized his belief that the decision to adopt 1974 average investment in M\u0026S was arbitrary and capricious, as the known and certain average investment in M\u0026S for the more recent test year ended June 30, 1975, was $6.7 million higher than the obsolete figure adopted by the Commission. We agree.\n\nVII. THE FAILURE TO ADJUST FOR KNOWN CHANGES OF RECORD\n\nFrom the standpoint of writing an opinion in a case such as this, it is inevitable for there to be an overlapping of some of the problems with which we must deal. Pepco's final allegation of error - presented as an alternative - asserts reversible error in the Commission's failure to adjust the 1974 results for three known and certain post-1974 changes of record. While our holding as to the proper test year essentially moots these contentions, we mention the three factors briefly.\n\nThe first involves the company's net receipts from PJM Interchange sales. During the calendar 1974 test year, the net interchange margin applicable to District of Columbia business was $17.3 million. The 1975 operating results which were received in evidence reveal that the net jurisdictional margin had declined by $7.6 million annually. Pepco demonstrated that the 1974 margin was unusually high, and the Commission acknowledged that \"we see no evidence of record which persuades us that there will be a return to past normalcy in the near-term future in [PJM sales],\" and that \" . . . sales to PJM appear to have leveled off to a large degree.. . .\"\n\nTherefore, as the evidence demonstrated that the 1974 net revenue benefit to Pepco was unrepresentative of expected future margins, and as more recent data of better predictive value was available, the Commission unreasonably and arbitrarily failed to substitute the net interchange margin experienced during the test year ended June 30, 1975, for the 1974 margin.\n\nThe Commission also erred in not making the appropriate adjustments for the actual transfer of $160 million from CWIP funds to the Plant in Service rate base component for the Chalk Point Unit No. 3 which occurred in May of 1975 (as discussed above), and for the $5-7 million increase in the company's investment in M\u0026S. These were known and certain changes of record which required no further testimony or cross-examination, and the Commission erred in disregarding them to the severe economic detriment of the utility.\n\nVIII. THE REMEDY\n\nOn the basis of the Commission's arbitrary and unreasonable refusal to utilize the latest historical operating data of record and the ensuing denial to Pepco of an opportunity to earn either the overall 9.1% rate of return or the 13% rate of return on equity found required to attract capital, we must sustain Pepco's appeal, vacate Order No. 5739, and remand the case to the Commission with instructions to remedy its legal defects. Our authority to do so is delineated in D.C. Code 1973, § 43-705, which states in relevant part: \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nUpon the Conclusion of its hearings of any such appeal the court shall either dismiss the said appeal and affirm the order or decision of the Commission or sustain the appeal and vacate the Commission's order or decision. In either event the court shall accompany its order by a statement of its reasons for its action and in the case of the vacation of an order or decision of the Commission the statement shall relate the particulars in and the extent to which such order or decision was defective.\n\nOn remand, the Commission first should calculate modified rates according to the Staff's own ratemaking formula based upon the data submitted for the test year ended June 30, 1975, and then calculate the revenue losses improperly experienced by Pepco during the period that Order No. 5739 was in effect. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e Absent the atypical weather patterns experienced in 1976-'77, we would direct the Commission then to devise a means for restoring to Pepco the revenues which it improperly has been denied. A reasonable means of accomplishing this so as to assure Pepco's continued ability to perform its vital service to the public could be the application of a temporary surcharge to the rates currently in force in order to amortize the calculated loss over a period of time. In this way the delicate balance between the interests of investors and consumers could be maintained. See Hope Natural Gas, supra, at 603.\n\nThe nature of such relief would remain prospective. In calculating the lost revenues, the Commission will place itself in a position to provide the rate relief it legally was bound to give at the time of its now-vacated opinion of November 12, 1975. To do otherwise would be to give perpetual legal effect to an unlawful order, and to unnecessarily and unwarrantedly penalize Pepco, its investors, and indeed its customers for the passage of time necessitated by appellate review of that unlawful order.\n\nThe Commission opposes the imposition of any remedy involving a calculation of past revenue losses, contending that such relief improperly would constitute retroactive ratemaking. See Payne v. Washington Metropolitan Area Transit Commission, 134 U.S.App.D.C. 321, 330, 415 F.2d 901, 910 (1968). While we recognize the general principle precluding a utility from charging higher rates in the future in order to recoup past losses, that concept does not bar the relief to which Pepco appears to be entitled.\n\nThe losses sought to be recovered in Payne were suffered pursuant to an interim order issued during the rate proceeding, but before any determination on the issue of a fair rate of return was made. Id., at 324, 415 F.2d at 904. The Payne court emphasized that the losses were not shown to be materially different from those projected in the interim order:\n\n\"[Prophecy,] however honest, is generally a poor substitute for experience,\" [ West Ohio Gas, supra, at 82] and actual operating results showing losses greater or less than those the Commission had projected might properly have affected the Commission's Conclusion as to the need for a fare increase or the amount of increase needed. [134 U.S.App.D.C. at 331, 415 F.2d at 911.]\n\nIn the instant case, the losses occurred after a fair rate of return had been determined in Order No. 5739, and the lost revenues have been shown, by abundant evidence of record, to be the result of arbitrary and unreasonable Commission rulings.\n\nOur Conclusion is consistent with that set forth in Chesapeake \u0026 Potomac Telephone Co. v. Public Service Commission, supra, 330 A.2d 236. In that case, the losses at issue were experienced between the release of an interim rate relief order, in which the rate of return was determined, and the final order. Those losses, we said,\n\nwere not past losses as of the time the 8.8% rate of return was determined, and they were not taken into consideration in setting that rate. The Commission's interim proposal . . . authorized prospective relief only . . . Past losses were not accorded any consideration in establishing the rate of return for the period in question and the order did not provide for the Company to recoup losses in revenues, if any, experienced during that period. [ Id., at 240.]\n\nLikewise, in the instant case, the losses to be calculated on remand were not past at the time of the opinion in which the 9.1% overall rate of return and the 13% rate of return on equity were established, nor were they considered in setting those rates. The Commission issued its final order increasing revenues to compensate for anticipated future deficiencies in earnings. The losses to be calculated thus are essentially like those in the Chesapeake \u0026 Potomac case, and would not constitute a basis for retroactive ratemaking.\n\nIn reviewing a similar proceeding in which a rate of compensation for a past period was determined, the circuit court distinguished the result of an isolated past sale of capital assets (which could not be included in a calculation of future rates) from compensation for the service performed by the regulated company (which could be so included), regardless of whether the service was past or future. Summerfield v. Civil Aeronautics Board, 92 U.S.App.D.C. 248, 251-52, 207 F.2d 200, 203-04 (1953), aff'd on other grounds sub nom. Western Air Lines v. Civil Aeronautics Board, 347 U.S. 67, 98 L. Ed. 508, 74 S. Ct. 347 (1954). Referring to the general view that ratemaking is inherently a prospective concept, the court stated:\n\nBut we are impressed by the practical aspects of the situation. In this instance the Board was in fact looking at a period which had passed. The actual facts as to revenues and expenses for that period were known. * * * In saying that the Board was looking at a past period we are not departing from the rule in the T.W.A. case. [ Transcontinental \u0026 Western Air, Inc. v. Civil Aeronautics Board, 336 U.S. 601, 93 L. Ed. 911, 69 S. Ct. 756 (1949).] The period began when the petition for the ratemaking was filed . . . ; as of that date the ratemaking was prospective. When the Board got around to making its findings and decision the period [of service] was past. It is to the latter actuality that we refer. [92 U.S.App.D.C. at 252, 207 F.2d at 204.]\n\nThe ordinary purpose of a utility rate, the court observed,\n\ninvolves reimbursement for expenses incurred in performing the service, return on the investment used in the service, and a reasonable profit on the transaction. This much is due whether the service is past or future.[ Ibid. ]\n\nIn the instant case, the period for which the revenue losses are to be calculated came not only after the filing of the application for increased rates, but after the effective date of the order authorizing prospective rates. The lost revenues for which Pepco may be entitled to recoupment became due to the company while the disputed and inadequate rates were in effect. They therefore are not analogous to past losses bearing no relation to expected future revenues which play no valid part in a prospective ratemaking proceeding.\n\nRegarding the suggested method of collecting the losses, the Supreme Court, under comparable but reversed circumstances, ordered a refund of excessive amounts collected during the course of a rate proceeding in Federal Power Commission v. Tennessee Gas Transmission Co., 371 U.S. 145, 9 L. Ed. 2d 199, 83 S. Ct. 211 (1962). The circuit court also has ordered distribution to the rate payers of funds resulting from invalid rate increases previously granted by the Commission. Washington Gas Light Co. v. Baker, (supra) , 88 U.S.App.D.C. at 127, 188 F.2d at 23. Reviewing courts with the power to direct refunds on the basis of invalid orders also have the concomitant power to direct consideration of the possible need for surcharges on the basis of such orders, for to function otherwise would be to permit the perpetuation of demonstrably confiscatory rates, rendering appellate review but a meaningless exercise.\n\nTime and the weather, however, may have tempered the need for a surcharge to compensate the company for those aspects of the rate order which we hold to have been confiscatory. The differing views which have resulted in a majority, a Dissenting, and a Concurring opinion in this case have permitted a regrettably lengthy period to elapse on appeal. We judicially note that the summer of 1976 was moderately warmer than normal, and that the winter of 1976-'77 was uniquely cold. These and other factors may have led to unexpectedly high revenues for Pepco for those months, which, equitably, may have offset the need for a surcharge. In the computation on remand of the company's improperly proscribed revenue shortfall attributable to the arbitrary diminution of its rate base in the order which we vacate herein, we sanction as a possible offset thereto what may have been unusually high revenues experienced by Pepco during that period. Of course, at this time we have no way of knowing what the facts will prove to be; that must remain for the parties to demonstrate and for the Commission to determine on remand.\n\nVacated and remanded.\n\nNEBEKER, Associate Judge, Concurring: In view of both the content and tone of my Brother's Dissent, I feel constrained to elaborate upon my joining in the majority opinion. I am convinced that the majority opinion is wholly legally valid and manifests a realistic (and dispassionate) assessment of the issues in this case. Moreover, its Conclusions are mandated by precedent as well as by common sense.\n\nBoth the majority and Dissenting opinions recognize certain of the basic principles related to the scope of our review over the Commission's decisions; a few of the many decisions relied upon by the majority also are cited in the Dissent. Where our Dissenter goes astray, in my view, is in his apparent belief that if agency action is \"considered,\" it is immunized against a finding of arbitrariness or capriciousness. The Dissent would simply accept at face value the Commission's broad Conclusions as individually reached, and would avoid further inquiry into the correctness of the supporting evidence, as well as into the conflicts, the omissions, and the practical effect of the opinion as a whole. The majority opinion, however, goes the inescapably necessary step beyond the Dissent in making those inquiries.\n\nI. ASSERTIONS OF ERROR\n\nIn disputing the majority's determination that the Commission's opinion was arbitrary and capricious, the Dissent begins by characterizing the majority opinion as being wholly \"unsupported and unjustified.\" Yet the majority opinion is replete with supporting evidence, and its analysis of the law as applied to the facts is in accordance with controlling precedent.\n\nThe Dissent declares:\n\nAn examination of each of the Commission's findings and Conclusions reveals that none was arrived at arbitrarily, but rather only after thoughtful consideration of the evidence and of the arguments on each side.\n\nThoughtful consideration, however, does not preclude the ensuing results from being arrived at arbitrarily. The Commission undoubtedly did give thoughtful consideration to the issues raised, but still it reached a legally invalid Conclusion. That it did by ignoring significant data submitted through June of 1975.\n\nThe Dissent also attacks as \"pure speculation\" the majority's Conclusion that the relatively small increase in revenues granted by the Commission would not allow the company an opportunity to earn a fair rate of return, to maintain its financial integrity, and to attract capital, as required by Federal Power Commission v. Hope Natural Gas Co., 320 U.S. 591, 605, 88 L. Ed. 333, 64 S. Ct. 281 (1944). Yet the record contains abundant, clear, and uncontroverted evidence (1) of Pepco's rapidly declining financial position, \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e (2) that the practical effect of this position was to preclude the company from attracting capital and maintaining investor confidence, \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e (3) that the data submitted for the first half of 1975 showed convincingly that the steep decline in rate of return on equity had rendered useless the corresponding 1974 test year figures used by the Commission, \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e and (4) that the measures previously adopted by the Commission to combat the attrition in Pepco's earnings had proved inadequate in times of lesser inflation. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e A Conclusion by a reviewing court which is based on such extensive record evidence cannot be purely speculative, and an agency order which effectively ignores or improperly rationalizes away such concrete and convincing evidence cannot be allowed to stand. Pepco thus met its \"heavy burden\" of showing severe and unconstitutional prejudice resulting from the Commission's orders.\n\nII. THE STANDARD OF REVIEW\n\nContrary to the Dissent's assertion, the majority opinion carefully adheres to the standards set by Congress, as well as by the Supreme Court and our own precedents. The majority first considered the overall effect of the Commission's opinion, as it was bound to do under Federal Power Commission v. Hope Natural Gas Co., supra at 602, The Permian Basin Area Rate Cases, 390 U.S. 747, 791, 20 L. Ed. 2d 312, 88 S. Ct. 1344 (1968), and our own Telephone Users Association v. Public Service Commission, D.C.App., 304 A.2d 293, 297 (1973). Having concluded that the effect of the Commission's action was unjust and unreasonable, in that it would not allow Pepco a reasonable opportunity to earn its authorized rate of return and maintain its financial integrity, the majority proceeded to give reasoned consideration to the contested elements of the opinion, a practice established by the Supreme Court and followed by this court in the Telephone Users case, (supra) at 298. Finding then that several of the Commission's Conclusions were arbitrary because they in effect ignored volumes of the most recent uncontested data of record, we vacate and remand the decision with instructions, as authorized by D.C. Code 1973, § 43-705. Legal errors and omissions such as these cannot be shielded from even the narrowest appellate review merely because the Commission made several conclusory statements supported by insufficient, contradictory, misleading or erroneous evidence, regarding its full consideration of the issues. Such transgressions are in direct contradiction to controlling precedent and logic.\n\nTo bolster its argument, the Dissent posits that \"the Commission did not pick its Conclusions out of thin air.\" Surely, however, the bounds of judicial review are not set by this novel \"thin-air\" standard. As noted, the Commission may reach its Conclusions in a manner which is thoughtful but nevertheless arbitrary. To hold otherwise would be to render any appellate review a meaningless formality.\n\nFinally, the Dissent suggests that the Commission's inclusion of some updated figures in its \"reckoning\" removes its opinion from the zone of arbitrariness defined in West Ohio Gas Co. v. Public Utilities Commission, 294 U.S. 79, 79 L. Ed. 773, 55 S. Ct. 324 (1935). However, the Commission's exclusion of the most crucial parts of the updated data, as discussed by the majority, was as arbitrary as the action condemned in West Ohio Gas. The Commission's selective use of certain updated figures, therefore, does not insulate its action from our review.\n\nThe flaws in the Commission's opinion and orders, accordingly, may not be shelved as being reflective of \"a difference in judgment,\" as the Dissent would have us do. We may not hold that the Commission's conclusory statements regarding its consideration of the issues, statements which did not take into account crucial and substantial data of record, preclude our finding arbitrary and capricious action in this case. I now address in turn the specific assertions of error contested by the Dissent.\n\nIII. THE TEST YEAR\n\nAs regards the proper test year, once again the Dissent is unwilling to analyze the evidence beyond its superficial presentation by the Commission's majority opinion. In defense of the Commission's use of calendar 1974 as the test year, the Dissent argues primarily that Pepco did not exhibit an unequivocal intent to have the new data, which were presented in a format identical to that of the calendar 1974 data, and duly received into evidence, substituted for it. As this subject is thoroughly discussed in the majority opinion, \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e here I shall mention only the fact that the Dissent relies upon the expressed condition accompanying Pepco's request to substitute updated data to eradicate the existence of the request. The majority's more thorough examination of the issue reveals that the condition - i.e., Pepco's insistence that it could not afford a reopening of the hearings - was added out of an abundance of caution on Pepco's part, and was not legally a prerequisite to the Commission's ultimate determination of the issue. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Public hearings are held primarily to assist the Commission's determination of the proper relationships among components of new rates; the actual figures for those components must only be verified by simple audit to meet the requirements of due process and fairness. The Dissent cites no authority to the contrary. The Commission did not have to reopen the hearings, and in fact it did not. Hence the significance of Pepco's caveat evaporated.\n\nMoreover, I note that the Commission - like the Federal Power Commission and state public service commissions - routinely accepts and incorporates into its opinions new data submitted late in rate proceedings for the purpose of updating the old data, allowing only a short time for an audit of the new figures. See, e.g., City of New York v. New York Public Service Commission, 42 App.Div.2d 259, 346 N.Y.S.2d 6 (1973). As there is no cognizable reason for its refusal to do so in this case, I can only conclude that the Commission erred. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nThe Dissent also is in error when it states: \"In oral argument to the Commission Pepco did not raise any question about a June 30, 1975, test year.\" To support this statement, the Dissent quotes as follows from the argument of Pepco's counsel:\n\nNow what solutions to the attrition problem exist?\n\nThe one that's traditionally been used by this Commission and most others is year-end rate base, and we think that if the Commission is going to stick with the 1974 test period that that's a minimum. . . . [Tr. 2821-22]\n\nWhile I believe that counsel's use of \"if\" cuts against the Dissent's contention (particularly when it is recognized that the Commission ultimately used average, rather than year-end figures for Construction Work in Progress and Materials and Supplies), the part of counsel's argument which immediately followed is dispositive of that contention:\n\nNow, there are other things you could do.\n\nOne of them is to recognize the need for updating test period.\n\nThe result reached in the majority opinion on the question of updating the test period is valid and conforms to the long line of Supreme Court cases and our own precedent which require that a rate maker consider, and make appropriate adjustments for, the most recent data of record. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Therefore, as Pepco's operating results and financial condition underwent drastic changes after the end of the originally-submitted test year, and as the delay occasioned by the administrative process was quite long, the only appropriate consideration of the data for the first half of 1975 must involve their use in a test period.\n\nIV. ATTRITION AND USE OF 1975 DATA\n\nIn contesting the majority's treatment of attrition, the Dissent once again mistakes the Commission's simple acknowledgment that \"attrition . . . is still with us\" for a legally valid effort to solve the problem. As support for its statement, the Commission added:\n\nwill therefore now, as we have in the past use an end of period rate base, with appropriate adjustments, in order to compensate for the presence of attrition.\n\nThe inevitable effect, however, of the \"adjustments\" made (i.e., the use of weighted average, rather than year-end figures for two of the three major rate base components) was the creation of a revenue deficiency which more than offset the small attrition allowance resulting from the use of a period-end figure for the third component. (This fact is not mentioned in the Dissent.) Moreover, the predictive value of setting rate figures which may have been reasonable during the test year, without considering more recent data which differ significantly from those presented for the test year, is negligible. It was for this reason that the Supreme Court so clearly proscribed the use of outdated data in West Ohio Gas Co. v. Public Utilities Commission, supra at 82, and its holding controls the resolution of the test year issue in the instant case.\n\nIn the Commission's ruling on Pepco's petition for reconsideration, it again paid lip service to the existence of Pepco's continuing financial decline, and added:\n\nThis fact was fully considered by the Commission in arriving at its decision in this case, even though the decision was indeed based on a 1974 calendar year test period.\n\nYet the Commission proceeded to offer two weak and unsupported reasons for its failure to grant the relief requested. As regards the first reason, there was no basis in the record or in logic for the Commission to assume that Pepco did not request that operating data for the year ended June 30, 1975, be used. Secondly, while asserting that it was not persuaded that Pepco's financial decline in 1975 could be attributed to \"attrition\", the Commission gave no reason for reaching this Conclusion, and did not state why such a decline should not be adjusted for in some way even if it were not related to attrition. Such a Conclusion could not be labeled anything other than arbitrary and capricious. It is difficult to fathom how our Dissenting Brother apparently can believe that the Commission's reasoning carries \"considerable logic,\" thereby defeating \"any contention that the decision as to CWIP was arbitrary.\"\n\nConcerning the Commission's misuse (by substantial nonuse) of the most recent available data, I would only refer the reader to the majority's Discussion of the June 30, 1975, data, attrition, and the rate base components, and repeat that superficial assertions concerning the Commission's \"thoughtful consideration\" of the 1975 data, when not followed by remedial action, may not successfully disguise what otherwise are readily recognizable as unreasonable, arbitrary, or capricious rulings. This is particularly true when the subject of attrition is discussed, as, regardless of how the Commission rationalized away its existence, any knowledgeable person could perceive that there remained on the record uncontradicted evidence of continuing and exacerbated attrition through the first half of 1975.\n\nV. 1976 OPERATING RESULTS\n\nPerhaps the most alarming aspect of the Dissent, however, is its unfettered use of extra-record material as supposedly providing major support for its position. It refers to stock prices and to a Securities and Exchange Commission filing by Pepco as evidence that, with the contested rates in effect, Pepco was able to make financial progress. This use of such extra-record material is not only proscribed by controlling case law and by the relevant statute, but also is dangerously incomplete in its analysis and suggests erroneously that this court's decisional judgments routinely are affected by extra-record \"facts.\"\n\nAs long ago as 1813, the Supreme Court held that facts which do not appear in the record cannot be noticed by a reviewing court, even if those facts would be sufficient to change the outcome of the case. Thornton v. Carson, 11 U.S. (7 Cranch) 596, 601, 3 L. Ed. 451 (1813). The Dissent's gambol beyond the confines of the record also is prohibited by statute. D.C. Code 1973, § 43-705 provides in part that: \"Any such appeal shall be heard upon the record on appeal, and no new or additional evidence shall be received by court.\" As appeal can be taken only from the order as issued by the Commission, we may not consider evidence which was not available to the Commission at the time of issuance. Moreover, the extra-record materials do not contain facts of common knowledge, nor are they capable of such certain verification that they may be judicially noticed. Massachusetts v. Westcott, 431 U.S. 322, 52 L. Ed. 2d 349, 97 S. Ct. 1755 (1977).\n\nThe Dissent's selective use of material unavailable to Pepco during the proceeding (since it did not exist), or to the Commission in formulating its opinion, also makes no practical sense. The materials cited in no way constitute a meaningful treatment of the subject, they are not inherently reliable, and their contents may have no meaningful relationship to the rates contemporaneously in effect. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e The Dissent's reliance upon extra-record material is as erroneous as it is curious when one considers the Dissent's position on the test year issue: our Brother sanctions the Commission's effective disregard of the most current and compelling evidence of record, but relies heavily himself on \"information\" which did not even exist until some two years after the record which we review was closed.\n\nVI. REMEDY\n\nFinally, the Dissent's Discussion of the remedy prescribed rests upon two misconceptions. The first is that the majority directed specific dollar results in its remand order. In fact, the majority mandated the Commission only to recalculate the rate base and revenue requirements using the actual and audited data of record for the test year ended June 30, 1975. This certainly was not done, as the Dissent accuses, \"to avoid a hearing by the Commission on remand,\" but necessarily to conform to legal standards.\n\nSecondly, the Dissent contests our authority to outline the remedies on remand. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Yet the majority opinion conforms to the procedures mandated by D.C. Code 1973, § 43-705. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e It has accompanied its vacating of the Commission's order with detailed reasons for its action, and has related \"the particulars in and the extent to which such order or decision was defective.\" It has not assumed the administrative function of setting rates, and, after correcting the Commission's legal errors, has left the actual establishment of just rates to the Commission. Moreover, it has tempered its decision with equitable considerations to assure fair treatment to the consumer, as well as the investor. The Dissent does not address this aspect of our decision. One must remember that the true interests of the consumers do not rest solely on artificially low utility rates. In the ultimate analysis, the consumer cannot and will not afford the inadequate utility services which inevitably would follow as a consequence of short-term, confiscatory rates. I remain convinced that the reasoning of the majority opinion is not only wholly sound but also is in the best interests of the public. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nYEAGLEY, Associate Judge, Dissenting: Because I view the Commission's order here as the culmination of a conscientious and careful analysis of the extensive evidence in the case incorporating findings and Conclusions on each issue that are amply supported in the record, I must Dissent. While one could disagree with some of the Commission's Conclusions, none is either arbitrary or capricious.\n\nThe majority's severe criticism of the Commission's opinion and order might leave the impression that the Commission denied the company any increase in revenues whatever when in fact the Commission authorized a substantial increase in rates so as to provide the company with $27,657,000 additional annual revenue. Particularly troublesome to me is the remand of the majority directing the Commission to establish a substantially larger rate base in conformity with company figures as of June 30, 1975, so as to provide retroactively a substantial increase in company revenues. In my view this remand goes well beyond the bounds of legitimate agency review. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nContrary to repeated assertions by the majority, the Commission has in fact set forth quite clearly in its 52-page final opinion and order a Discussion of the evidence and its reasoning on the relevant issues. Accordingly, I must divorce myself from the effort to label the decision as \"arbitrary and capricious.\"\n\nI. ASSERTIONS OF ERROR\n\nThe majority summarizes the asserted errors it finds in the order appealed from as follows:\n\nExamination of the elements of the opinion reveals several Conclusions which are arbitrary, capricious, and not based on substantial evidence of record. These include the Commission's refusal to utilize the most recent test period in the record, its failure to account for continuing attrition, and its refusal to recognize certain known changes which occurred after the close of the originally proposed calendar 1974 test period. [Draft opinion at 7.]\n\nThe majority holds that even though the test year on which the company based its application was calendar year 1974, it was arbitrary and capricious, and therefore error for the Commission not to have used the company figures revised as of year-end June 30, 1975, as the test year. Since, as will be seen, the Commission discussed and used many of the company's 1975 figures, the majority appears to be standing on the proposition that it was error as a matter of law for the Commission not to have used all of those figures thereby effectively changing the test year to June 30, 1975, even though such data was not put in the record until it came time for rebuttal testimony. I submit that at that juncture it was clearly a matter of discretion for the Commission. It is far from clear to me just what indicia there are to justify the majority's application of the adjectives \"arbitrary and capricious\" to that determination. The mere affixing of such a label cannot confer validity on an appellate ruling that is wholly unsupported and unjustified. An examination of each of the Commission's findings and Conclusions reveals that none was arrived at arbitrarily, but rather only after thoughtful consideration of the evidence and of the arguments on each side.\n\nThe majority also concludes that the rates set would deny the company an opportunity to earn a fair rate of return. I submit that this is pure speculation. The majority does not support its Conclusion with any computation or projection or other justification except to indicate its complete acceptance of the company's evidence and the estimates of its witnesses, not an insignificant part of which was contested by intervenors and staff witnesses \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e and rejected selectively by the Commission.\n\nII. THE STANDARD OF REVIEW\n\nThe majority recognizes that the power to make rates was delegated by Congress to the Commission, but forgets that as an appellate court our review of a utility commission order is strictly limited. It is the narrowest judicial review in the field of administrative law. K. DAVIS, ADMINISTRATIVE LAW OF THE SEVENTIES § 29.00, at 647 (June 1976); 2 F. COOPER, STATE ADMINISTRATIVE LAW 756-72 (1965).\n\n\" scope of our review of the Commission's actions is 'limited to questions of law . . . and the findings of fact by the Commission shall be conclusive unless it shall appear that such findings of the Commission are unreasonable, arbitrary or capricious.'\" Watergate Improvement Associates v. Public Service Commission, D.C.App., 326 A.2d 778, 783 (1974), quoting D.C. Code 1973, § 43-706. In an appeal by an intervenor of an earlier Pepco rate increase, Judge Harris, speaking for the court said:\n\nArbitrary action, however, is action not based on facts or reason. . . . The burden upon petitioner is not merely to put forth an acceptable alternative but rather to demonstrate clearly and convincingly a fatal flaw in the action taken. . . . Petitioner has not met that burden. He simply asserts a difference of opinion with the Commission. [ Goodman v. Public Service Commission, D.C.App., 309 A.2d 97, 101 (1973).]\n\nFour years ago when intervenors contested a $12,000,000 rate increase for the company, this court quoted with approval the guiding rule for appellate review of utility agency orders as set forth in Williams v. Washington Metropolitan Area Transit Commission, 134 U.S.App.D.C. 342, 362, 415 F.2d 922, 942 (1968), cert. denied, 393 U.S. 1081, 21 L. Ed. 2d 773, 89 S. Ct. 860 (1969):\n\nOur role as a reviewing court is not to make an independent determination as to whether fares fixed by the Commission are just and reasonable, but rather to insure that the Commission, in exercising its rate-making power, has acted rationally and lawfully. Our function is normally exhausted when we have determined that the Commission has respected procedural requirements, has made findings based on substantial evidence, and has applied the correct legal standards to its substantive deliberations. [ Telephone Users Association v. Public Service Commission, D.C.App., 304 A.2d 293, 296 (1973), cert. denied, 415 U.S. 933, 39 L. Ed. 2d 492, 94 S. Ct. 1448 (1974).]\n\nThat statement of the law is reduced to a nullity by today's opinion. The final opinion and order of the Commission here easily meets the test of the Telephone Users case. It could well be one of the most thorough and comprehensive decisions this court has received from an administrative agency in the District of Columbia.\n\nThe basic disagreement I have with the majority opinion is in its treatment of the facts and in its application of the law to the facts. For example, the majority applies the standard of \"arbitrary and capricious\" in circumstances where the transgressions of which it complains are no more than differences in judgment. One who examines the order will find that the Commission did not pick its Conclusions out of thin air. It did not arrive at Conclusions except after noting evidence upon which the Conclusion could be based and in each instance the Commission set forth supporting reasons. \"The court's responsibility is not to supplant the Commission's of [the factors involved] with one more nearly to its liking, but instead to assure itself that the Commission has given reasoned consideration to each of the pertinent factors.\" Permian Basin Area Rate Cases, 390 U.S. 747, 792, 20 L. Ed. 2d 312, 88 S. Ct. 1344 (1968).\n\nAs long as there is substantial evidence to support a reasoned Conclusion of the Commission we must affirm. Watergate Improvement Associates v. Public Service Commission, supra at 783-84. See also Citizens to Preserve Overton Park, Inc. v. Volpe, 401 U.S. 402, 416, 28 L. Ed. 2d 136, 91 S. Ct. 814 (1971).\n\nThe majority places much reliance on West Ohio Gas Co. v. Public Utilities Commission, 294 U.S. 79, 79 L. Ed. 773, 55 S. Ct. 324 (1935) and New York Telephone Co. v. Public Service Commission, 29 N.Y.2d 164, 272 N.E.2d 554, 324 N.Y.S.2d 53 (1971). In the New York Telephone Co. case an interim rate increase was ordered but it was followed by an interim partial reduction. When it developed that the company's actual earnings under those orders yielded a significantly lower return than the Commission had said was reasonable, even lower than the company's earnings prior to the application, the company asked that the hearings be reopened before the final order was entered. Although the Commission did not deny that the rates were confiscatory, the majority of Commissioners refused to reopen the proceedings suggesting instead that a new rate proceeding be initiated. The appellate court held that: \"Where there is a great disparity between the predicted rate of return found necessary by the commission and the return actually earned, \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e a suitable adjustment should be made to reflect the attrition trend or the erosion that has taken place.\" Id. at , 272 N.E.2d at 557, 324 N.Y.S.2d at 56.\n\nIn the instant case we have neither a concession that the rates are confiscatory nor a blanket refusal by the Commission to consider updated figures. In fact the 1975 data were considered and many were used by the Commission as will be detailed, (infra). The New York Telephone Co. case is not authority for today's holding that it was arbitrary and capricious for the Commission not to have changed the test year at the Conclusion of the hearing.\n\nIn West Ohio Gas Co., the Commission confined itself to operating data for 1929, and refused to consider available data as to actual operations for 1930 and 1931. It is in this context that the Court said, as quoted by the majority:\n\nTo shut ones eyes to [the latest available figures] altogether, to exclude them from the reckoning, is as much arbitrary action as to build a schedule upon guesswork with evidence available. [ Id. at 81-82.]\n\nIn the instant case the Commission was not using a test year two years old and did not exclude the updated figures \"from its reckoning.\"\n\nWhen a gas company sought to enjoin allegedly confiscatory rates set by a state regulatory commission, the Supreme Court in affirming a dismissal of the complaint said: \"That question [the constitutional question] is whether the rates as fixed are confiscatory. And upon that question the complainant has the burden of proof and the court may not interfere with the exercise of the state's authority unless confiscation is clearly established.\" Los Angeles Gas Co. v. Railroad Commission of California, 289 U.S. 287, 305, 77 L. Ed. 1180, 53 S. Ct. 637 (1933).\n\nWhen the Fourth Circuit reversed a decision of the Federal Power Commission which had reduced rates of a gas company, on the grounds that the Commission had failed to consider certain costs in the rate base and had improperly computed depletion and depreciation, the Supreme Court held that a showing of a great deal more was required if the courts were to reverse such an order.\n\nThe Court observed rather sensibly:\n\nRates which enable the company to operate successfully, to maintain its financial integrity, to attract capital and to compensate its investors for the risks assumed certainly cannot be condemned as invalid, even though they might produce only a meager return on the so-called \"fair value\" rate base. . . . And he who would upset the rate order base under the Act carries the heavy burden of making a convincing showing that it is invalid because it is unjust and unreasonable in its consequences. [ Federal Power Commission v. Hope Natural Gas Co., 320 U.S. 591, 602, 605, 88 L. Ed. 333, 64 S. Ct. 281 (1944).]\n\nApplying the Supreme Court's standard in Hope, to the facts in this case, it becomes clear the majority has failed to carry its \"heavy burden\" of showing that the $27,657,000 increase in revenues awarded the company by the Commission is so inadequate that the company would not be able to operate successfully, and that it would thereby lose its financial integrity and its ability to attract capital. That Conclusion made by the majority is not justified by the facts of this case. I would note in this regard that Pepco's remarkably improved financial standing at the end of 1976, after one year of experience under the new rates \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e is devastating testament to the fallacy inherent in the majority's speculation that the increased rates would be confiscatory.\n\nIII. THE TEST YEAR\n\nContrary to the contention of the majority that it was arbitrary not to have used a June 1975 test year in arriving at a fair rate base, it can be demonstrated there is no justification whatever on this record for the company to now contend that the Commission erred in using the 1974 test year with modifications being made, as warranted, for the June 1975 data. As will be seen, it was a matter properly left by the parties on the record to the discretion of the Commission and consequently is not a matter to be taken over by an appellate court.\n\nIn the application for a rate increase filed by the company it asked that it be based on a 1974 calendar test year and it supplied actual figures for the first eight months of 1974 augmented with detailed estimates for the remaining four months. As figures for the company's actual operations for those four months became available they were supplied by the company. Thirteen different parties intervened. After cross-examination of company witnesses was completed and as the respondent and intervenors were completing their testimony in opposition, the company, on Friday, July 18, 1975, filed proposed rebuttal testimony of its Sr. Vice-Pres.-Finance, with two exhibits which set forth financial data reflecting operating results from January 1 through June 30, 1975. (Company exhibits G and 14.) That witness testified on those figures \"in rebuttal\" on Wednesday, July 23rd.\n\nThe following was brought out during cross-examination of that rebuttal witness by counsel for the Commission:\n\nQ. Mr. Davis, are you proposing a new test year for the Commission to use in this case?\n\nA. I have indicated in the testimony that we think it is important to place this information on a test year revenue requirement basis before the Commission. Now we are not - not suggesting a substitution of the June 30 year for the December 31 year, but I do ask, or do suggest in my rebuttal testimony, and I would ask, that the Commission take note of this information and apply it in reaching the Conclusions in this case . . . .\n\nThe majority quotes and relies on the testimony of Pepco's President, J. Reid Thompson, who testified in rebuttal that same day wherein he stated at first: \"I would urge the Commission to base its results on the June 30 figures.\"\n\nHowever, Mr. Thompson changed his position when cross-examined by People's Counse, but the majority has ignored this damaging testimony in its effort to brand the Commission with arbitrariness in not changing to a June 30, 1975 test period. Mr. Thompson testified as follows:\n\nQ. . . . You are not suggesting a new period, are you? You still want your end of period rate base considered in this case December, 1974. You are not requesting an amendment of that at this time?\n\nA. I don't want to get bogged down in semantics or play a game.\n\nQ. Well, let's not get bogged down. You are a lawyer. Let's understand -\n\nA. What I am saying to this Commission is trying to arrive at the truth here as to what is a fair and reasonable rate of return. I am suggesting to this Commission that if it can be done in the light of their understanding and their responsibility without delaying this case, without any further opening the record, that they should adopt a June 30 test year. I am suggesting precisely that, but I am suggesting that, however, if it requires a reopening of the record to lay in a case, that they don't do that. Rather, grant an additional attrition allowance to take into account June 30 figures.\n\nHis final position then seems to be clear that the company was not insisting on a change in the test year, but was urging the Commission to take into consideration the June 30 figures. Since the case was filed and tried on a 1974 test year, it is apparent that President Thompson was necessarily leaving to the discretion of the Commission the decision as to how much consideration to give the new data. Mr. Thompson concluded his testimony by saying:\n\nWhen the hearing was terminated there was no question on the record but that 1974 was still the test year, that the company believed the Commission should give great consideration to the updated figures but that any further delay to explore the new data was not acceptable to the company. Accordingly, respondent and intervenors, not having had time to obtain in depth familiarity with the new data, did not cross-examine Mr. Davis in detail on the new information nor did they recall their witnesses to testify regarding the updated 1975 figures as would have been their right had the Commission announced that it was adopting a new test year. The earlier testimony of all witnesses of the respondent and of all witnesses for the intervenors had dealt only with the 1974 calendar year data. That is what all of the first 2600 pages out of a total of 2900 pages of testimony were all about. When wholly new data for the test year is furnished at the end of a case, procedural due process as well as basic considerations of fairness require an opportunity for all parties to review it and cross-examine the utility's witnesses regarding it and to offer further evidence in surrebuttal.\n\nIn view of the testimony of the company's own officers, I find it surprising it would claim subsequently on petition to the Commission for reconsideration that the use of June 30, 1975, as a test year was an issue in the case. More importantly, I must confess a complete loss to understand how, on such a record, the majority here can defend, let alone advance, such an argument. I would hope that the majority does not intend to suggest that a position taken by a party on the record during a hearing, or that a stipulation entered into, or a representation made to an administrative tribunal, is not something advanced in good faith and to be relied on by the Commission.\n\nIt strikes me as somewhat misleading for the majority to suggest an inference should flow from the fact (page 29) that \" objection was made to the admission of the testimony and its accompanying exhibits,\" (referring to the June 30, 1975 figures) when there was patently no cause for an objection after the Financial Vice-President of the company who presented the new financial data, flatly stated that the company was not requesting a change to a June 30, 1975 test year.\n\nFurthermore, in view of this record, the majority's statement that: \"It was only after the Commission issued its opinion, and Pepco appealed that arguments were advanced against utilizing the most recent actual data\" is equally vulnerable. The objections were forthcoming at that point because of the strong arguments of the company raising this issue in its petition for reconsideration. In oral argument to the Commission Pepco did not raise any question about a June 30, 1975 test year. Instead its lawyers appeared to assume that a 1974 test year was to be used.\n\nCompany counsel, Carl D. Hobelman, said for example:\n\nNow what solutions to the attrition problem exist?\n\nThe one that's traditionally been used by this Commission and most others is year-end rate base, and we think that if this Commission is going to stick with the 1974 test period that that's a minimum.\n\nEdward A. Caine, the other Pepco counsel who argued, flatly stated, while discussing the possible effect of company land transactions, \" test period in this case is 1974.\" The case having been filed and tried on a 1974 test year up to almost the last day, the Commission had every right to use a 1974 test year, utilizing the 1975 updated figures as appropriate in its discretion. None of the authorities cited by the majority on this issue pose a comparable factual situation.\n\nHowever, the Supreme Court of Arkansas has had occasion to address a strikingly similar situation. In Arkansas Power \u0026 Light Co. v. Arkansas Public Service Commission, 226 Ark. 225, 289 S.W.2d 668, 673 (Ark. 1956), where the Commission refused to consider information after the end of the test year, the court held:\n\nAs to the testing period, it clearly appears to us from the record that the appellant, itself, in its rate application chose the testing period, and the Commission accepted appellant's choice. Appellant's application was tried throughout on the theory that the test period should be the 12 months ending March 31, 1954. In other words, March 31 was to be the cut-off period of this pattern year.\n\nThe reasoning of the Arkansas decision is unassailable and compelled by reasons of fairness.\n\nIV. ATTRITION AND USE OF 1975 DATA\n\nThe majority contends that \"the failure to account for or continuing attrition\" was arbitrary. However, it is patently clear that the Commission did not fail to account for attrition. The final order of the Commission is replete with comments that demonstrate its careful consideration of the evidence of attrition. It will be noted that the Commission plainly found in its order at pages 24 and 25:\n\nIn short, we are persuaded that attrition is a phenomenon that is still with us, and we will therefore now, as we have in the past use an end of period rate base, with appropriate adjustments, in order to compensate for the presence of attrition.\n\nThe real problem here is that the majority disagrees with the extent of attrition that the Commission recognized in its computation. That, of course, is simply a difference of judgment and is not demonstrably arbitrary or capricious. The best evidence upon which to conclude whether the Commission acted arbitrarily is to be found in a reading of its final order. Because I believe the final order to be self-explanatory, copies of pages 23-28 inclusive of the order are attached hereto in an appendix to this Dissent, as a typical sample of the order to assist the reader in judging whether the Commission acted reasonably or arbitrarily.\n\nSome years ago, the practice of the Commission had been to use the average rate base for the test period. In order to combat the effects of attrition, an exception to the general rule was recognized so that when attrition was found to exist the ratemaking authority could use a company's year-end rate base to compensate for it. Telephone Users Association v. Public Service Commission, supra at 298, citing City of Lynchburg v. Chesapeake \u0026 Potomac Telephone Co., 200 Va. 706, 711, 107 S.E.2d 462, 469 (1959). See also Goodman v. Public Service Commission, supra. This is exactly what was done in the instant case. The Commission chose to follow this court's suggestion in the Telephone Users case and, by and large, used the end-of-the-year rate base making adjustments when necessary for abnormally large end-of-the-year figures. It also made other adjustments in light of changes appearing in the company's June 30, 1975, data.\n\nA regulatory commission bases its final order on a consideration of all relevant data available for the test year. When updated figures following the test year are offered late in the hearing as part of the company's rebuttal testimony, it must necessarily fall to the discretion of the Commission to decide how much consideration shall be accorded such evidence and to determine which items would seem to have a significant bearing on its projection of future operations. He who would upset its decision carries a heavy burden.\n\nThe Commission carefully examined the data for 1975 and began its consideration of the effect of the 1975 figures by noting: \"Although 1975 operating data, of which we may take official notice, indicates a resumption of growth trend in retail kilowatt hour sales, it appears that the over 60% reduction in PJM sales is continuing . . . . \" (Referring to Pennsylvania, New Jersey, Maryland Interchange sales [order at 6 and 7].) With regard to its consideration of embedded costs of debt capital the Commission noted that the experts agreed that the end-of-year figure for 1974 should be adjusted to reflect the retirement in August 1975 of $10 million in debt securities. (Order at 15.) It observed: \"In determining the cost of debt that we have used in reaching our rate of return Conclusion, we have recognized and accepted known changes from the December 31, 1974 figure.\" It noted that a $50 million debt issue anticipated in 1975 by two witnesses was not made, but that Pepco had chosen instead to meet its 1975 capital needs through short-term borrowings. Accordingly, it adjusted the 1974 embedded debt cost to reflect only the August 1975 debt retirement. The resulting figure arrived at of 6.97% was rounded to 7% in recognition that at \"current costs\" (1975) of debt capital, any new debt issue by Pepco will necessarily increase the embedded figure (order at 16). In considering the cost of preferred stock, the Commission took into consideration the cost of the company's preferred stock sale in April 1975 and that it involved a convertible preferred. (Id. at 16 and 17.) It concluded this part of its Discussion by saying: \"While we are reluctant to attempt to predict the future costs of debt and preferred stock, we cannot ignore current costs [1975]. We will therefore adjust the mathematically arrived at 9.05% rate of return to 9.1%, a feature which in our judgment is just and reasonable under today's economic conditions.\" (Id. at 20.)\n\nAlthough Pepco sought a 9.75% rate of return it has not contested the rate set by the Commission. Indeed it is the highest rate I have noticed in the reported cases.\n\nIn regard to attrition the Commission said:\n\nThe point is made by PEPCO that use of an end of period rate base will only partially reflect the \"attrition\" in earnings that has taken place since our 1973 PEPCO decision. We are not persuaded, however, that the decline in earnings has been due solely to attrition, but has in large part been due to the drop in sales noted previously. Since sales to retail customers appear to have resumed a somewhat normal growth pattern [in 1975], and since sales to PJM appear to have leveled off to a large degree, [1975] and since PEPCO has substantially reduced its construction budget [for 1975], it appears reasonable to conclude that attrition in the future may play a less significant role than it has in the past. [ Id. at 25, 26.]\n\nThe \"drop in sales\" refers to the dramatic effect of the 1974 national energy crisis which resulted in a marked drop in sales of electricity as a result of the emphasis by the government and consumer groups on the need to conserve energy.\n\nIn discussing CWIP and M\u0026S the Commission said:\n\nThe record shows wide fluctuations in these accounts over time and a substantial increase in fuel inventories in 1974, resulting from stockpiling due to the unusual fuel market in that year. The amounts at the end of the period in both accounts appear to be abnormally high. In view of PEPCO's projected reduction in its construction program and the reduction in fuel inventory in 1975, we do not believe that the end period figures can be called representative of anticipated future conditions. The adjustment of materials and supplies is consistent with the Commission's treatment accorded to this item in Formal Case No. 610. [Order at 25-26.]\n\nSuch thoughtful consideration of the relevant factors throughout the Commission's opinion precludes a holding that its order was arbitrary. As was said in Goodman v. Public Service Commission, 162 U.S.App.D.C. 74, 82, 497 F.2d 661, 669 (1974): \"Since the Commission chose between alternatives and achieved a reasonable result, we cannot disturb findings.\"\n\nThe company and the majority opinion both emphasize the point that the Commission did not include the full December 31, 1974, figure of $359,000,000 \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e for construction work in progress (CWIP) instead of the weighted average used by the Commission of $284,000,000. This is a major contention of the majority which asserts that the Commission's act in arriving at this figure was not merely an error of judgment but was arbitrary and capricious. I do not find this claim to be supported in the record. There is substantial evidence, as will be seen, to support the Commission in its decision to use the weighted average. The Commission was not faced with the simple question of whether or not to accept the company figures and the company's method of computing the rate base. It had to consider all of the evidence on both sides including conflicting expert testimony and the arguments of intervenors against using full, face value, year-end CWIP. See note 1, (supra) .\n\nThe Commission was well aware that CWIP by its nature provides no service for the public nor any income for investors. In only a very few jurisdictions, including the District of Columbia, is CWIP included in the rate base. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e If it is included, it is for the purpose of providing the investor with a return for that part of his funds which are currently tied up in nonproducing plants. Many jurisdictions instead of using a figure for CWIP, use a figure that allows for funds used during construction (AFUDC), (Tr. at 1501; Tr. at 1116; Pepco Exhibit 6, at 7; People's Counsel brief at 21), or a figure that capitalizes the interest on funds used in construction. When new plants become operational and move out of CWIP into plant in service, they become revenue producing for the company after which time the investor must begin to bear the risk of profit or loss.\n\nIn considering this problem, the Kansas City Corporation Commission said:\n\nIf plant under construction were to be included in the rate base upon which a fair return is computed, equity would require inclusion also of the estimated additional revenue produced by such construction as operating revenue for the test period. Otherwise, existing telephone users would be forced to pay a return on property constructed for future subscribers with the result that when these future customers begin to receive service, the applicant would derive a double return on the cost of such construction.\" [ In re Southwestern Bell Telephone Co., 98 P.U.R.3d 30, 38 (1973).]\n\nThe evidence here indicated that during 1974 there had been an unusually large flow of dollars into CWIP from $197,000,000 on December 31, 1973, to $359,000,000 on December 31, 1974. In comparison the CWIP for year-end 1972 was only $95,000,000. The anticipated annual average through 1977 was predicted to be $288,000,000 (Staff Exhibit 4, at 28).\n\nSince Pepco operates in Maryland and Virginia as well as the District of Columbia, only those percentages of company figures properly allocated to the District of Columbia operation are used in computing the rate base for the District. For example, the figure for District of Columbia plant in service is computed by taking 44.82% of the total plant in service. Consequently, the company originally arrived at a figure of $657,634,000 or 44.82% of the total plant of $1,467,207,000.\n\nLikewise, in computing CWIP only that part of the total figure attributable to the District of Columbia operation is used. Of the total of $377,508,000 claimed originally by the company, it allotted only $155,863,000 in its computation of the District of Columbia rate base or 41.29%. Pepco Exhibit 9, W 29 and W 30.\n\nThe staff used the same percentage figure for plant in service but allocated only 36.69% of total CWIP to the District of Columbia. See Staff Exhibit 4 SM-2, Sch. A, p. 1. On the other hand, the staff allocated 53.64% to the District of Columbia operation for plant held for future use. Id. The lower figure for CWIP may result from the fact that Chalk Point III, then under construction, is located in Aquasco, Maryland. Pepco Exhibit 8, at 2-3.\n\nPeople's Counsel, citing examples of where only 60% of CWIP was used in some jurisdictions, recommended that the Commission adopt the rule followed in others that allow CWIP only up to 10% of the useful plant value. (People's Counsel Exhibit C, at 38.) The League of Women Voters asked the Commission to return to its former policy still followed by a great many regulatory bodies of excluding CWIP altogether from the rate base (brief at 6).\n\nIn view of the unusually high year-end figures, the General Services Administration urged the Commission to use a weighted average figure for CWIP, as did the Commission staff. It argued that the high year-end figure should be adjusted to normalize it to reflect conditions that may reasonably be expected to be experienced during the period the rates will be in effect (brief at 5).\n\nIt added that Pepco's proposed amount of $88,177,000 \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e for materials and supplies (M\u0026S) is clearly excessive as demonstrated throughout the record.\" (Exhibit G at 5, brief at 4.)\n\nThe principal Staff witness, a recognized expert whose qualifications were unassailed, testified that:\n\nI do believe the rate base should be representative of what will take place in the future, and I think the averaging method for construction work in progress does just that.\n\nIt puts construction work in progress on a basis that we can anticipate will occur in the future and will be more representative of what is going on.\n\nAt the same time, we get the flow of dollars into the construction program as if it were on an interest during construction or AFUDC basis. [Tr. at 1458.] \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nThe Commission concluded at page 26 of its order:\n\nWe have given most serious consideration to all of these recommendations. We are disposed to agree with our Staff and accept Mr. Manheimer's recommendation for the use of an average amount of construction work in progress and an average amount in the materials and supplies account in rate base as more representative of the flow of dollars in and out of the accounts. The record shows wide fluctuations in these accounts over time and a substantial increase in fuel inventories in 1974, resulting from stockpiling due to the unusual fuel market in that year. The amounts at the end of the period in both accounts appear to be abnormally high. In view of PEPCO's projected reduction in its construction program and the reduction in fuel inventory in 1975, we do not believe that the end period figures can be called representative of anticipated future conditions. The adjustment of materials and supplies is consistent with the Commission's treatment accorded to this item in Formal Case No. 610.\n\nThat reasoning seems to me to carry considerable logic and to be more than adequate to defeat any contention that the decision as to CWIP was arbitrary.\n\nI agree with the Corporation Counsel's contention that in exercising its ratemaking responsibility the Commission is not bound to use any particular methodology, nor is it bound to adopt any particular alternative proposed. Goodman v. Public Service Commission, supra.\n\nIn Goodman the court held that:\n\nIn its ultimate determination of future revenue requirements, the Commission had a choice of two figures: 1) the average values applying throughout the test-year (\"weighted\" rate base); or 2) the values on the last day of the test-year (\"end-of-period\" rate base). [ Id. at 82, 497 F.2d at 669.]\n\nUntil today's decision the correctness of that proposition has never been doubted by the courts in this jurisdiction.\n\nV. 1976 OPERATING RESULTS UNDER THE DECEMBER 1975 RATE ORDER\n\nSince the order herein setting increased rates became effective in December 1975, and it has taken this panel well over a year to resolve this case, we need not resort to speculation as to whether or not the rates established by the Commission might deny Pepco an opportunity of earning a fair rate of return as asserted by the company. We need only examine what the actual earnings were for the year 1976 under the new rates.\n\nOn March 1, 1977, the Commission, in Formal Case No. 666 issued order No. 5866 authorizing Pepco \"to issue and sell up to 4,000,000 shares of its common stock, $10 par value . . . .\" The order was based upon financial data supplied by the company in its application and supporting exhibits of which I can take notice \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e it being a formal record of the Public Service Commission consisting of data prepared and filed by the company itself (23 D.C. Register 7254).\n\nAttached to the application filed on January 28, 1977, was the company's SEC form S-7 showing registration of the stock with the Securities \u0026 Exchange Commission. This exhibit reflected company annual net earnings of $1.16 per share as of December 31, 1975, which improved to $1.72 per share as of December 31, 1976, an increase of nearly 50%.\n\nThe market price of the stock was shown to be:\n\n4th quarter 1975 low 10 high 12 1/4\n\n4th quarter 1976 low 13 1/2 high 14 7/8\n\nAccording to company figures the last transaction on January 26, 1977, was at 15 5/8.\n\nWhen the instant case was argued before the Commission in September 1975, Pepco's counsel pointed out that the company's common stock had been traded the day before at only $10 1/2. This means that in 16 months the stock increased approximately 50% in market value. Furthermore, according to these records, the company on January 21, 1977, raised its quarterly dividend from an annual rate of $1.16 per share to a rate of $1.28 per share.\n\nIn view of this self-proclaimed record of increased earnings, I would dispose of the majority's assertions here that the Conclusions of the Commission were arbitrary and the rates it set were confiscatory by reminding it of the Supreme Court's admonition that:\n\n\"Estimates for tomorrow cannot ignore prices of today.\" Southwestern Bell Telephone Co. v. Public Service Commission of Missouri, [262 U.S. 276, 288, 67 L. Ed. 981, 43 S. Ct. 544 ]. We have said of an attempt by a utility to give prophecy the first place and experience the second that \"elaborate calculations which are at war with realities are of no avail.\" Lindheimer v. Illinois Bell Telephone Co., 292 U.S. 151, 164, 78 L. Ed. 1182, 54 S. Ct. 658 . We say the same of a like attempt by officers of government prescribing rates to be effective in years when experience has spoken. A forecast gives us one rate. A survey gives another. To prefer the forecast to the survey is an arbitrary judgment.[ West Ohio Gas v. Public Utilities Commission, supra at 82.]\n\nIn this remand, the majority has blinded itself to the fact that \"experience has spoken\" in direct contradiction to its doomsday forecast.\n\nCommission records reflect that a year later it granted Pepco another and larger rate increase on December 16, 1976, of $29.4 million which should reflect even better results for the company in its 1977 earnings. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e That case is presently pending in this court on an appeal taken by an intervenor.\n\nVI. REMEDY\n\nAfter vacating this order, the majority states that it remands the case with directions to the Commission to \"calculate modified rates . . . based upon data submitted for the test year ended June 1975, and then must calculate the revenue losses improperly experienced by Pepco during the period that order No. 5739 was in effect.\" I am at a loss to understand the majority's Discussion of \"losses\" or how it expects them to be calculated. If the remand contemplates the company being authorized to charge higher rates in the future in order to recoup past losses (1975), it would be contrary to the law in this jurisdiction. Payne v. Washington Metropolitan Area Transit Commission, 134 U.S.App.D.C. 321, 333, 415 F.2d 901, 913 (1968).\n\nAlthough the remand is something less than specific, one point comes through quite clearly, that is the majority is directing the Commission to accept all of the company's figures ending June 30, 1975, at face value despite the limited examination accorded them by the Commission staff and the fact that coming in late they were not the subject of counter testimony and comment by any of the staff or intervenors' witnesses. This seems to be the equivalent of ordering the Commission to accept the company's updated figures and based thereon to grant the company the full amount of increased revenues it requested of well over $20 million. I find this unprecedented and a wholly unwarranted assumption by this court of the functions of the regulatory body.\n\nAs to how far a reviewing court may go, the Supreme Court has said:\n\nMore important, we have heretofore emphasized that Congress has entrusted the regulation of the natural gas industry to the informed judgment of the Commission, and not to the preferences of reviewing courts. A presumption of validity therefore attaches to each exercise of the Commission's expertise, and those who would overturn the Commission's judgment undertake \"the heavy burden of making a convincing showing that it is invalid because it is unjust and unreasonable in its consequences.\" FPC v. Hope Natural Gas Co., supra, at 602. . . .\n\nMoreover, this Court has often acknowledged that the Commission is not required by the Constitution or the Natural Gas Act to adopt as just and reasonable any particular rate level; rather, courts are without authority to set aside any rate selected by the Commission which is within a \"zone of reasonableness.\" FPC v. Natural Gas Pipeline Co., 315 U.S. 575, 585, 86 L. Ed. 1037, 62 S. Ct. 736 . No other rule would be consonant with the broad responsibilities given to the Commission by Congress; it must be free, within the limitations imposed by pertinent constitutional and statutory commands, to devise methods of regulation capable of equitably reconciling diverse and conflicting interests. [ Permian Basin Area Rate Cases, supra at 767.]\n\nSee also Federal Power Commission v. Transcontinental Gas Pipe Line, 423 U.S. 326, 331, 46 L. Ed. 2d 533, 96 S. Ct. 579 (1976) (per curiam).\n\nIn Telephone Users Association v. Public Service Commission, supra, this court held that because the Commission failed to make adequate findings based on evidence in the record regarding the utility's claim of attrition, the case had to be remanded for the Commission to make those required findings. We specifically noted that:\n\nWe are not today holding that C\u0026P's evidence in the record require a finding by the Commission of attrition, or that if the Commission finds attrition it would be compelled to use C\u0026P's year-end rather than its weighted average rate base. [ Id. at 301.]\n\nThose words are overruled by today's decision. The majority's remand order in the instant appeal fails to recognize the critical distinction between telling the Commission where it erred and to reconsider its decision, and directing the Commission to arrive at new rates based on updated company figures some of which the Commission may not have found acceptable. This court's role ends when the error has been pointed out and the case remanded for the agency to apply its expertise in correcting the error. An appellate court cannot dictate the result the agency must reach.\n\n\"The court's responsibility is not to supplant the Commission's balance of these with one more nearly to its liking, but instead to assure itself that the Commission has given reasoned consideration to each of the pertinent factors.\" Permian Basin Area Rate Cases, supra at 792.\n\nThe scope of the remand order here so far exceeds the power of this court that it goes a long way toward making us a superregulatory commission even though we are devoid of regulatory expertise.\n\nThe majority's act of directing the Commission to compute the new rates on specified company figures is done, no doubt, to avoid a rehearing by the Commission on remand, which at this late date would necessarily be a cumbersome and confusing administrative tangle. The Commission, on remand, would be compelled to use the June 30, 1975 figures even though on a later Pepco rate application in December 1975 it has already issued an order (in December 1976) granting another company rate increase based on all of calendar year 1975 including the identical data for the first six months of 1975 in issue here. By ordering the Commission to add substantially to the company's revenues with revised rates retroactively back to December 1975, the majority puts in serious question the validity of the later rate order of December 1976 which was based on a full 1975 test year. Since the company did not in fact experience a deficit in 1976, under the rates here in issue, but more than met its operating expenses for that year with a handsome net income left over, the added revenues of more than $20,000,000 from the surcharge ordered by the majority would constitute additional net profit for 1976. Will company customers petition for a revision downward of the December 1976 rate order in light of the very substantial revision upward in company earnings for 1976 resulting from this remand, and would the customers assert claims against Pepco for the overcharges in 1977 resulting from the now erroneous December 1976 rate increase? Will today's new customers who are assessed this surcharge to make up the $20 million in revenues for 1976 claim an exemption as not having received any Pepco service that year?\n\nThe pending appeal of the December 1976 order will be proceeding on a record that is no longer valid unless remanded first for a further hearing and revision of the order. The surcharge levied here for 1976 could be followed by a rebate to customers for overpayments in 1977. When do rates become final and litigation come to an end?\n\nIn any event, it now appears that a remand would be useless. Although the majority has denied the Commission's motion to dismiss for mootness, the fact remains that the order appealed from, No. 5739, no longer is of any real force or effect having been superseded on December 16, 1976, by order No. 5849 under which the company is now operating. That order awarded the company a further increase designed to produce an additional $29.4 million in revenues. Consequently the company already has been awarded an increase of well over $5 million more than it seeks in this appeal. As a result if this case is to be remanded to the Commission it can afford Pepco no greater measure of relief than that already granted.\n\nWhen a similar problem was faced by the Circuit upon its holding that an increase in gas rates was invalid, the court said:\n\nThese matters having been disposed of by this opinion insofar as it is possible now to do so, very little will be left which could be remanded to the Commission, especially as any possible remaining issues are also restricted by a new application of the Company to the Commission for a rate increase, filed since argument of these appeals, and of which we take judicial notice. Remand to the Commission, in the circumstances of this case, could not be to enable a rate order to be superimposed upon the old application, filed July 14, 1949. [ Washington Gas Light Co. v. Baker, 90 U.S.App.D.C. 98, 104, 195 F.2d 29, 35 (1951).]\n\nIt is difficult to perceive how the Commission could grant further affirmative relief on the application for an increase in revenues at issue in this appeal.\n\nI submit that the reversal here is not only wholly unjustified, but it creates an administrative nightmare. For all of the foregoing reasons, I Dissent. I would dismiss the appeal and affirm the order of the Commission.\n\nAPPENDIX\n\nOrder No. 5739\n\nThe next issue we must address under the heading of rate base is the perennial question of whether to use average or end of period figures. There is not, and indeed there cannot be, any question on this record that PEPCO has experienced a decline in earnings in the latter half of 1974 and that this declining trend shows no signs of a reversal. This fact, of course, does not in and of itself demonstrate the presence of \"attrition.\" As the Commission said in the last PEPCO rate case \"while a decline in rate of return may be the result of attrition, it may with equal validity be said to result from other factors, e.g., imprudent investment or excessive expenses.\"\n\nAs we have indicated in our preliminary views, it appears to us that the major factors contributing to PEPCO's decline in earnings were the reduction in kilowatt sales to retail customers and the significant drop in sales to PJM. Putting these two factors aside, however, the record is clear that the increase in investment costs per unit of output noted in our last decision has continued; and in this case not only is this fact demonstrated by the actual dollar investment figures in the record but it is confirmed, we believe, by the vigorous advocacy on the part of consumer intervenors of the use of marginal or long run incremental cost figures for rate making purposes. The underlying theory of this advocacy is that the cost of new production plant is higher than the average embedded cost of that plant. Thus, while we are urged by some parties to match revenue, expense and rate base by using average rate base figures, we find little support in the record for those recommendations. In short, we are persuaded that attrition is a phenomenon that is still with us, and we will therefore now, as we have in the past, use an end of period rate base, with appropriate adjustments, in order to compensate for the presence of attrition.\n\nThe point is made by PEPCO that use of an end of period rate base will only partially reflect the \"attrition\" in earnings that has taken place since our 1973 PEPCO decision. We are not persuaded, however, that the decline in earnings has been due solely to attrition, but has in large part been due to the drop in sales noted previously. Since sales to retail customers appear to have resumed a somewhat normal growth pattern, and since sales to PJM appear to have leveled off to a large degree, and since PEPCO has substantially reduced its construction budget it appears reasonable to conclude that attrition in the future may play a less significant role than it has in the past.\n\nA number of adjustments to rate base have been presented for consideration by our Staff and by several of the intervening parties in this case. People's Counsel witness McCabe, for example, with the support of other consumer parties, has urged elimination of construction work in progress from the rate base and substitution of an allowance for funds used during construction (AFUDC). Our Chief Accountant, Mr. Manheimer, noting the unusually large amounts included in construction work in progress at year end, has recommended averaging construction work in progress over the test period. Intervenor All Souls Unitarian Church has urged that PEPCO's investment in the Douglas Point Nuclear station be eliminated from rate base. Mr. Manheimer also recommends that we average materials and supplies over the test period, and that we eliminate amounts reflecting preliminary surveys, land transactions undistributed, prepaid insurance, and compensating bank balances, in our calculation of rate base.\n\nWe have given most serious consideration to all of these recommendations. We are disposed to agree with our Staff and accept Mr. Manheimer's recommendation for the use of an average amount of construction work in progress and an average amount in the materials and supplies account in rate base as more representative of the flow of dollars in and out of the accounts. The record shows wide fluctuations in these accounts over time and a substantial increase in fuel inventories in 1974, resulting from stockpiling due to the unusual fuel market in that year. The amounts at the end of the period in both accounts appear to be abnormally high. In view of PEPCO's projected reduction in its construction program and the reduction in fuel inventory in 1975, we do not believe that the end period figures can be called representative of anticipated future conditions. The adjustment of materials and supplies is consistent with the Commission's treatment accorded to this item in Formal Case No. 610.\n\nWith regard to Mr. McCabe's recommendation that construction work in progress be excluded from rate base (a recommendation subsequently modified to permit 10% of plant in service to be included as a construction work in progress allowance) we are disturbed by two factors. First, the 10% allowance appears to us to be wholly arbitrary and without foundation. Second, we would note that including CWIP in rate base without AFUDC and capitalizing AFUDC but excluding CWIP from rate base produce about the same ultimate result. Essentially, only the timing is different; but in the long run, use of AFUDC may result in a greater overall cost to the customer than inclusion in the rate base of construction work in progress. Projects begun in the period between rate cases, for example, earn no return under the CWIP approach, and if placed in service prior to the next rate case appear in rate base at the actual cost of the project. Were AFUDC used, the same project would appear in rate base at the cost of the project plus capitalized interest, and ratepayers would be required to provide a return on that higher cost. In consideration of all factors, we believe that the interest of both customer and investor would be better served by continuing our long standing practice of allowing PEPCO to include construction work in progress in its rate base.\n\nWith regard to the Douglas Point nuclear project, there is no question but that substantial funds have been invested in that project, and that nuclear projects require an extraordinarily long lead time required to plan and complete. We understand and appreciate the views expressed by All Souls witness Father Millard in support of his recommendation that the $28.6 million already invested in Douglas Point now be excluded from rate base. In consideration of current fuel uncertainties and the 8 year or longer lead time, however, we are not convinced that we should at this time declare the nuclear project imprudent or unnecessary.\n\nWe are disposed to agree with our Chief Accountant that amounts reflecting preliminary surveys and undistributed land transactions should not be included in rate base. As Mr. Manheimer has pointed out, there is no certainty that any of these amounts will be transferred to plant in service and for that reason we believe their exclusion is appropriate. Similarly, we agree with Mr. Manheimer that prepaid insurance premiums and compensation bank balances should be excluded from rate base, since insurance premiums are expensed over time and compensating bank balances are in our view more properly a part of the cost of money and have been included in our calculations of fair rate of return.\n\nFor these reasons, then, and having considered all data and recommendations of record, we find the appropriate District of Columbia rate base to be $650,091,000, as shown on Attachment A, Page 1.\n\nTo achieve a 9.1% rate of return on a rate base of $650,091,000, PEPCO's operations must produce a return of $59,158,000, as shown on Attachment A, Page 3. We turn now to consideration of observed expenses and operating results, from which we may determine the amount of revenues needed to produce this net return.\n\n\u003cspan class=\"fn\"\u003e1. Pepco's original filing was predicated on an eight-month actual and four-month forecast basis. It later was updated to encompass actual data for all 12 months of 1974 and, prior to the close of the record, for the first six months of 1975.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The Office of People's Counsel was established by Congress on January 2, 1975. See D.C. Code 1977 Supp., § 43-205. The early delay in this case was occasioned in part by the Commission's desire to obtain the participation of People's Counsel, which office had not yet been established during the first few months of the proceedings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Attrition may be defined as the inability of a utility to earn its authorized rate of return due to the fact that its investment in rate base and/or its operating expenses are rising faster than revenues. Telephone Users Ass'n v. PSC, D.C.App., 304 A.2d 293, 298 (1973), cert. denied, 415 U.S. 933, 94 S. Ct. 1448, 39 L. Ed. 2d 492 (1974). The importance of attrition to a proper determination of rates is discussed in section V of this opinion, (infra).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Pepco's first application for an interim rate increase was dismissed by Order No. 5707, issued on April 7, 1975; the second was dismissed by Order No. 5725, dated July 11, 1975. As Pepco has not challenged those orders on appeal, we do not consider their merits. They are, however, illustrative of Pepco's continuing efforts to seek rate relief from the Commission.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Chesapeake \u0026 Potomac Tel. Co. v. PSC, D.C.App., 330 A.2d 236, 239 (1974); Goodman v. PSC, D.C.App., 309 A.2d 97, 100 (1973); Tel. Users Ass'n v. PSC, supra note 3, at 296.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Arbitrary action is \"action not based on facts or reason. The burden upon petitioner is . . . to demonstrate clearly and convincingly a fatal flaw in the action taken.\" Goodman v. PSC, supra note 5, at 101.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. See, e.g., cases cited in note 5, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. For utility ratemaking purposes, the rate base multiplied by the rate of return (with the necessary adjustments for the company's income tax liabilities) determines the revenue requirements. \"Rate base\" has been defined as the value of a company's property used and useful in the public service minus accrued depreciation. See Telephone Users, supra, at 297 n.6. For Discussions of rate of return, see Williams v. WMATC, 134 U.S.App.D.C. 342, 348, 415 F.2d 922, 928 (1968) (en banc), cert. denied, 393 U.S. 1081, 89 S. Ct. 860, 21 L. Ed. 2d 773 (1969), and D.C. Transit System, Inc. v. WMATC, 121 U.S.App.D.C. 375, 400-01, 350 F.2d 753, 798-99 (1965) (en banc), cert. denied, 389 U.S. 847, 19 L. Ed. 2d 115, 88 S. Ct. 52 (1967).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Emphasizing the predictive value of test year \"relationships,\" Commissioner Stratton stated in his Dissent:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe purpose of [the test period approach] . . . is not that future rates are reasonable if in the test year they would have produced a fair return, or that the increase in revenues that would have produced a fair return in the test year is ipso facto the increase that will do so in the future. The test year approach assumes - and this is vital to an understanding of it - that the relationship among revenues, expenses, and rate base that obtained in the test year will continue into the future. Only if this assumption is valid does it follow that rates which would have produced a fair rate of return in the test year will produce a fair rate of return in the future.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The forecasts reflected the following data:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12 Months Ending\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMarch June December, 1975\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eReturn on Rate\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eBase (unadjusted)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eEnd of Period 7.09% 7.08% 7.07%\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAverage 7.63% 7.52% 7.29%\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eReturn on Equity\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eEnd of Period 9.3% 9.0% 7.6%\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAverage 9.7% 9.1% 8.1%\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. See Telephone Users, supra, at 298. In his Dissent, while distinguishing between rate base and expense attrition, Commissioner Stratton emphasized his disagreement with the majority's treatment of manifest rate base attrition as minimal or nonexistent:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhere I part company with the Commission is in its treatment of the attrition malady for which the remedy prescribed lies somewhere between a placebo and bloodletting.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. A company official emphasized that sharply escalating plant and financing costs, dramatic increases in fuel costs resulting from the national energy crisis, substantial construction programs only recently curtailed, and rapidly rising and embedded costs of senior capital were responsible for the company's deteriorating financial situation. The official's testimony was supported by several independent analysts, as well as by other company representatives.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The Staff witness stated: \"In [the prior 1973 rate order] the Commission found 'a classic picture of attrition' and used an end-of-period rate base for rate making purposes. * * * Staff is of the opinion that the conditions existing in [the 1973 rate case] that led to the finding of attrition are still present.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The chronology of the hearing was as follows. The cross-examination of Pepco's direct case began on June 10 and ended on June 23, 1975. The cross-examination of the Staff and intervenors' witnesses lasted from July 2 to July 23, 1975. The cross-examination of Pepco's rebuttal witnesses began immediately thereafter, and terminated on July 24, 1975.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The official further testified that any attempt to obtain financing through common stock or debt offerings either would be illegal (if the market price fell below par value, which then seemed likely), or at the very least,\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ewould compound the present process of deterioration in Pepco's financial situation to a point that recovery of satisfactory financial health would require more time and more rate increases.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMoreover, he stated:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ePepco's position is critical. For all practical purposes Pepco is foreclosed from the public capital markets at a time when the Company has $60 million of outstanding short-term debt. The continuation of our minimum construction program will necessitate increasing the Company's short-term debt to approximately $100 million by the end of the year, with further increases during 1976. It is imperative that the Company be placed in the position of being able to finance these expenditures with permanent capital. However, until Pepco is able to again demonstrate at least minimum levels of earnings on its common stock and adequate margins of protection for investors in senior securities, its access to the organized capital markets will continue to be blocked.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The Pepco witness added that once lost, investor confidence could be reestablished only with substantially higher earnings than are required simply to maintain such confidence. In addition, the recovery process would be particularly slow and painful for the company since it is still remembered by many investors as \"the only significant electric utility, other than Consolidated Edison, to have omitted a cash dividend on its common stock in modern times.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The Commission took \"official notice\" of certain 1975 operating data, principally to project an offset of retail sales against PJM interchange sales. See note 19, (infra). Additionally, the Commission made two minor rate base adjustments to reflect 1975 data, namely a union wage increase and a gross receipts tax increase, and took into consideration 1975 stock sales and a 1975 debt retirement. Otherwise, the Commission based its entire Discussion on data derived during the years 1970-74.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. In her oral argument, People's Counsel likewise stated:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThose investors who invest in the common stock of a regulated industry are given an opportunity to earn a fair, reasonable rate of return. this is not [fool-] proof. This is something which does have risks attached to it. * * * One of these risks is, of course, regulatory lag.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Pepco is one of approximately 12 utilities which comprise the Pennsylvania-New Jersey-Maryland (PJM) Interconnection. As a PJM member, Pepco has used the interconnected transmission systems to relieve its customers of a significant part of the carrying costs of its facilities by means of off-peak kilowatt-hour deliveries to PJM from Pepco's plant which would otherwise be idle during periods of low demand. The company also purchases energy from other PJM utilities when it is economically or technically beneficial for it to do so. Pepco's participation in PJM has served to reduce its overall cost of service, thereby considerably benefitting its retail customers. However, circumstances have combined to reduce Pepco's PJM sales significantly.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. See Re Potomac Electric Power Co., 3 P.U.R.4th 65 (PSC D.C. 1973); Re Potomac Electric Power Co., 95 P.U.R.3d 99 (PSC D.C. 1972); Re Potomac Electric Power Co., 83 P.U.R.3d 113 (PSC D.C. 1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The Commission's principal Staff witness had acknowledged that the remedy ultimately prescribed would be insufficient to alleviate Pepco's financial woes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The necessity to insure that the rates set would be fair and would have meaningful predictive value led one commission to utilize a future test period accompanied by a fully projected rate base. Re Georgia Power Co., 9 P.U.R.4th 381 (1975). Finding that this would eliminate attrition for the test period, the Georgia commission concluded that any difference between the allowed and actually experienced rate of return would be accounted for instead by errors of projection. According to that commission, such errors would prove less detrimental to the public interest than the unknown effects of future attrition. Id., at 385-86.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAnother commission solved the problems of attrition and regulatory lag by utilizing a rolled-in test year (i.e., one which \"proformed\" [ sic ] the capital structure to encompass the upcoming calendar year). Re Central Maine Power Co., 8 P.U.R.4th 277 (1975). That solution simultaneously avoided the prophesies inherent in future test years, and the inevitable imbalance of year-end rate bases. Id., at 286. Thus, the Commission's error in the instant case is seen to be egregious in view of the many alternative means available to it for setting realistic and non-confiscatory rates.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. During oral argument before us, Pepco's counsel contended that after filing its initial rate request, the company \"fell immediately into a financial decline\" described as \"the worst in Pepco's history,\" worse, in fact than that of 1969, \"when the company was forced to halve its accrued dividends.\" This same point had been made during the administrative hearing, by Pepco's President and Chairman of the Board, in direct testimony during the rebuttal phase.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Forecasts play two important roles in the ratemaking process. \"There are times, to be sure, when resort to prophecy becomes inevitable in default of methods more precise.\" West Ohio Gas, supra, at 82. See Southwestern Bell Tel. Co. v. PSC, supra, at 288. In addition, forecasts supplementing actual experience are essential to a determination of prospective rates. This court recently has held that the Commission's refusal to consider forecast data in a ratemaking proceeding was reversible error. Telephone Users, supra, at 300-01. Nonetheless, \"prophecy, however honest, is generally a poor substitute for experience.\" West Ohio Gas, supra, at 82.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. In its brief on appeal, People's Counsel suggests that the adoption of the updated test year ended June 30, 1975, may have required a revenue and expense adjustment to \"synchronize\" those elements with the company's investment in its new plant, Chalk Point Unit No. 3. However, People's Counsel does not cite, and we cannot find, evidence to support this contention so belatedly raised. Moreover, the principal Staff witness, when cross-examined on the subject, stressed that any such attempt at synchronization would be \" . . . too speculative for my purposes,\" and would have deprived Pepco of the benefit of even the partially year-end rate base which he proposed, and then conceded was inadequate to counteract the effects of existing attrition.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. As noted, Pepco facilitated audit of its most recent data by submitting them in accordance with the Staff's formulas and format, as it did in its original submission. Moreover, as is generally known (and was confirmed at oral argument), members of the Staff continuously audit the company's books, which are maintained in accordance with a Commission-prescribed uniform accounting system. Verification of the latest actual data therefore would have required minimal additional time and effort on behalf of the Commission's Staff and the intervenors. Additionally, in its opinion the Commission specifically acknowledged: \"On this record, few if any questions sults recorded on the PEPCO's books.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. The inclusion of forecasts, however, would not necessarily excuse the Commission for its failure to adopt the new test period. See note 24, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. At the outset of its decision, the Commission observed:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003edecision will be the fourth decision by the Commission in the past six years on rate increase applications by PEPCO. We make this observation not by way of criticism of either PEPCO or our regulatory predecessors, but rather as an expression of our deep concern that the time, effort and expense involved in the 1970, 1972, and 1973 PEPCO cases appear to have been ineffectual in solving the economic problems of this utility.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. For a comparison of the various means used by other commissions to set realistic rates, see Re Georgia Power Co., supra n.22 (future test period accompanied by fully projected rate base used); Re Central Maine Power Co., supra n.22 (rolled-in test year utilized); Re New England Tel. \u0026 Tel. Co., 22 P.U.R.3d 470 (1958) (test year updated for following 12 months); Re Mountain States Tel. \u0026 Tel. Co., 8 P.U.R.3d 176 (1954) (estimates for the six months following the test period selected to compensate for attrition).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Sales to retail customers did increase approximately 6% in 1975, but greater attrition occurred then than in 1974. It also is true that Pepco reduced its construction budget, but its investment in new plant remained substantial, and unit generation costs continued to increase, as expected.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. He readily agreed with \"the current Commission and Pepco practice with respect to the treatment of CWIP for rate-making\" (i.e., using end-of-period figures to compensate for attrition), and stated:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eObviously, the ability to earn on the construction work-in-progress, and at the same time improve the cash flow, would obviously have an effect on the borrowing ability of the company.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe following exchange then occurred:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. Now, if you don't feel that it is fair and reasonable to abandon the methodology because the dollar amounts are substantially larger, . . . then, why . . . do you justify . . . the averaging of CWIP during the test period, on the grounds that you have done so in order to place the method employed by Pepco on an equal basis with the AFUDC [allowance for funds used during construction] Accounting Convention.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. This was a situation . . . whereby when Pepco came in for its increase, as you well know it attracted a great deal of attention. * * *\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eI though it would be appropriate even though the use of \"averaging\" even though the end-of-rate base [ sic ] is recommended, the use of the average for construction work-in-progress was unusual.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eI thought the times called for unusual treatment. That is the reason why we thought we would adopt it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWe are separating it from attrition in this particular instance. In other words, we recognize it has to be used in the computation of attrition, but we separate it from the application of attrition to the rate base.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eObviously, for the Commission thus to \"separate\" CWIP from attrition is not merely to fail to compensate for attrition, but consciously to aggravate it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. We previously have held that the appeals provisions of the Administrative Procedure Act, D.C. Code 1973, § 1-1510 (1), are superseded by this and other relevant sections of the Code which deal with public utilities. See Chesapeake \u0026 Potomac Tel. Co. v PSC, D.C.App., 339 A.2d 710, 713 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Order No. 5739 became effective on December 13, 1975, and expired on December 13, 1976, when revised rates authorizing an additional $29.4 million in revenues became effective by means of Order No. 5849. The revised rates were set pursuant to another ratemaking proceeding which, as predicted, followed close on the heels of the instant case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Commission has urged, in a Motion To Dismiss filed on January 14, 1977, that the issuance of the revised rates in Order No. 5849 renders moot and impractical the question of relief in the instant case. However, Pepco was never allowed to recoup the revenue losses experienced as a result of the Order at issue in this case. The question of relief therefore is still a contested issue, and the Motion To Dismiss is denied.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAdditionally, even if the Order here under review technically were moot, it presents issues of a continuing nature long recognized as an exception to the mootness doctrine. Roe v. Wade, 410 U.S. 113, 35 L. Ed. 2d 147, 93 S. Ct. 705 (1973); Southern Pacific Terminal Co. v. ICC, 219 U.S. 498, 31 S. Ct. 279, 55 L. Ed. 310 (1911). This exception applies most broadly in cases reviewing administrative agency actions. See Golden Holiday Tours v. CAB, 174 U.S.App.D.C. 292, 294, 531 F.2d 624, 626 (1976). Pepco's appeal presents substantial legal questions that not only call for remedial action in and of themselves, but which readily are capable of repetition in future cases.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eCONCURRING FOOTNOTES\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 See pages 12-17 of the majority opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 See id. at 15-16.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 See id. at 18-19.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 See id. at 23 and 38-39.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 See section IV thereof.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 The majority reasoned that as the new submission followed the same format as the original, and as the purpose of the proceedings - to determine the relationships among revenue/expense/rate base components - had already been fulfilled and could not have been advanced by new hearings, considerations of fairness and due process would not have required such a reopening of the record. The Dissent's suggestion to the contrary is unsupported and erroneous.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7 The argument forwarded by the Commission that \"the proceedings must end at some point\" is unpersuasive in this context. The new data were submitted five months prior to the issuance of the Commission's opinion, and before the close of the hearings. Moreover, they constituted the most recent available data, which, among other precedents, West Ohio Gas Co. v. Public Utilities Comm'n, supra, at 82, and Telephone Users Ass'n v. Public Comm'n, supra at 297, requires to be given serious consideration. Here they were effectively ignored.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8 The case of Arkansas Power \u0026 Light Co. v. Arkansas Pub. Serv. Comm'n, 226 Ark. 225, 289 S.W.2d 668 (Ark. 1956), cited by the Dissent on this subject, is factually distinguishable from the instant case. In Arkansas, the utility filed its application for new rates on May 27, 1954, and based its request on a test year ended March 31, 1954. After extensive hearings were held, the Commission issued its order on November 22 of the same year. Although the company at some point requested that the Commission consider the period from March 31 to August 31, 1954, as an additional testing period, there appeared to be no specific reason or real need for this request. Unlike in the instant case, no assertions of a significant financial change in the company's status were made, and the length of time taken up by administrative delay was short. Moreover, the mid-1950's did not witness the inflation and fuel cost increases to which today's utilities are being subjected. Far more to the point, for example, is New York Telephone Co. v. Public Serv. Comm'n, 29 N.Y.2d 164, 342 N.Y.S.2d 53, 272 N.E.2d 554 (1971), in which the New York Court of Appeals readily reversed that state's Commission's refusal to give proper effect to the utility's most recent historical operating data.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9 The increase in earnings may be attributable to the unusual weather conditions discussed in the majority opinion, to a trend in stock investment patterns, to increases in rates which Pepco may charge its many non-District of Columbia customers (of which we have no record knowledge), or to any number of other factors. Additionally, we have no knowledge as to what has happened to Pepco's expenses and rate base in the two years since the record before us was closed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10 The Dissent also states its belief - which the majority does not share - that the validity of the rate increase granted subsequent to the one here is placed \"in serious question.\" Any further review of that decision would be occasioned only by action of the parties, and not of necessity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11 Contrary to the Dissent's claim, the Telephone Users case does not set the parameters of this court's authority. The quoted language specifies only what this court did not do - it by no means indicated what we could not do in any given situation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12 Warranting quotation is the following paragraph from Commissioner Stratton's Dissenting opinion:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eTo sum up, the commission's order posits an economic environment reminiscent of the early 1960's. In failing to acknowledge and deal with the fact that operating and capital requirements per unit of sales have risen, and continue to rise, faster than revenues the commission has taken a step that can only bring regulation in the District of Columbia into disrepute among the fair-minded and knowledgeable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 D.C. Code 1973, § 43-706, provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn the determination of any appeal from an order or decision of the Commission the review by the court shall be limited to questions of law, including constitutional questions; and the findings of fact by the Commission shall be conclusive unless it shall appear that such findings of the Commission are unreasonable, arbitrary, or capricious.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 See, for example, P.C. Exhibit A, 39-43; P.C. Exhibit 10; Commission Order at 25-26; Staff Exhibit 4, 24-28; transcript at 1111, 1112, 1457-1484, 2516; Staff Exhibit 4, sch. A; GSA Exhibit 21 at 4; GSA Exhibit 22 at 1-3; GSA Exhibit 22A at 11-13; GSA brief with the Commission at 4, 5, 10, 25, 29; and P.C. brief on appeal at 11-17.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 If the majority would not blind itself to \"the return actually earned\" by Pepco in 1976 under the new rates, it would have to discard the label of \"confiscatory.\" See section V., (infra).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 See section V., (infra).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 That figure represents over 29% of Pepco's gross utility plant. (Testimony of J. McCabe, III, P.C. Exhibit C at 36.) CWIP formed only 9% of the rate base in 1972 and the average for 1970-1974 was 13.17% (P.C. Exhibit M at 3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 Tr. at 1501.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7 Only 42.91% of this figure would be applicable to the District of Columbia operation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8 The company itself admitted that Pepco's 1975-1978 construction budget was drastically slashed due to changed forecasts of customer demand over the next several years (brief at 9).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9 Washington Gas Light Co. v. Baker, 90 U.S.App.D.C. 98, 104, 195 F.2d 29, 35 (1951); Commonwealth v. United States Steel Corp., 10 Pa.Cmwlth. 408, 410, 311 A.2d 170, 172 (1973). This is not a taking of judicial notice of evidence that the hearing agency could have used in establishing a rate base or in deciding what a fair rate of return would be, but merely is the taking of a realistic, after the fact, view of the results of an allegedly confiscatory rate order.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10 See order No. 5849, 22 D.C. Register 4147.\u003c/span\u003e\n\n",
    "body_length": 164853,
    "citedas": [
      "380 A.2d 126"
    ],
    "attorneys": "Edward A. Caine, with whom Alan G. Kirk, II, Susan H. Power, and Carl D. Hobelman were on the brief, for petitioner. Linus H. Deeny, Assistant Corporation Counsel when briefs were filed and the case was argued, with whom John R. Risher, Jr., Corporation Counsel, and Louis P. Robbins, Principal Deputy Corporation Counsel, were on the brief, for respondent. Annice M. Wagner, People's Counsel when briefs were filed and the case was argued, for intervenor.",
    "category": [
      "243"
    ],
    "judges": "Before Nebeker, Yeagley, and Harris, Associate Judges.",
    "citation_count": 16
  }
}
