{
  "id": "FI69QWYBTlTomsSBR55d",
  "document": {
    "title": "IN RE AIRCRASH DISASTER AT BOSTON JULY 31",
    "full_title": "In re AIRCRASH DISASTER at BOSTON, MASSACHUSETTS, JULY 31, 1973*",
    "jurisdiction": "D. Massachusetts",
    "date": "1976-02-19T00:00:00.000Z",
    "docket": "1712",
    "body": "CAFFREY, Chief Judge.\n\nI. INTRODUCTION\n\nAll of the above-captioned cases arise out of the tragic crash of a Delta Airlines, Inc. (Delta) DC-9 twin-engine jet airliner at approximately 11:08 a.m., \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\" July 31, 1973, at Logan Airport, Boston, Massachusetts.\n\nThe aircraft, which was identified as Delta Flight 723 (hereafter D 723) was scheduled to fly that morning from Burlington, Vermont to Logan Airport. It made an unscheduled stop at Manchester, New Hampshire, and then flew from Manchester to Boston. In attempting to effectuate an Instrument Landing System (ILS) \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\" approach at Runway 4-R \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\" at Logan Airport, the aircraft smashed into a seawall along the edge of the airport. The elevation of the runway is 16 feet above sea level, and the elevation of the ground at the point of impact with the seawall is 11.45 feet above sea level. The aircraft impacted 4153 feet short of the so-called ILS touchdown point, \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\" and about 165 feet to the right of the center line of the runway. The wreckage of the aircraft was scattered along a magnetic heading of 017 degrees in an area 250 feet wide and 790 feet long. The heading of Runway 4-R is 035 degrees.\n\nAll 89 persons aboard the aircraft died as a result of the crash. A large number of lawsuits were filed against Delta by representatives of the estates of the 82 passengers. Delta, in turn, commenced litigation charging the United States with liability premised on the alleged negligence of various air traffic controllers employed at Logan Airport. Additional suits were filed directly against the United States on behalf of the estates of all members of the crew of D 723, as well as a suit on behalf of the estate of Joseph E. Burrell who was occupying the jump seat in the cockpit of this aircraft. Litigation is still pending between the Burrell estate and Delta to determine whether his status at the time of the crash was that of a passenger entitled to sue Delta in a common law action for tort, or that of a crew member whose recovery is limited to that available under the applicable workmen's compensation law. Direct suits against the United States were also filed on behalf of the estates of several conceded passengers and Burrell.\n\nThe above-captioned actions were consolidated for purposes of a non-jury trial on the issue of liability only. Delta has brought a direct action against the United States claiming a right of contribution equal to 50 per cent of the total amount Delta is required to pay out in settlement to the estates of the passengers. Delta also seeks to recover herein the value of the airplane destroyed in the crash. The jurisdiction of all claims against the United States is premised on the Federal Tort Claims Act, 28 U.S.C. ยง 1346(b).\n\nAt the trial the parties called 26 witnesses and introduced into evidence portions of eight depositions, and a number of documentary exhibits including manuals, air navigation maps and charts, and graphs. They also introduced photographs, tape recordings and transcripts of radio communications between ATC and various aircraft and the transcript of the cockpit voice recorder (CVR) \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\" found in the wreckage of D 723.\n\nThe evidence includes a transcript of all communications between D 723 and ATC, and between ATC and other aircraft in the vicinity, as well as a transcript of all intracockpit conversations during the last 17 minutes of the flight. Also admitted were a flight profile and a flight data graph preserved by a flight data recorder device salvaged from the wreckage. The foregoing are reliable evidence of the flight path, headings, air speeds, altitudes, cockpit conversations and radio communications during relevant portions of this ill-fated flight.** Additionally, the Court took a view of some duration of actual operations in the TRACON room and in the cab of the new control tower at Logan Airport. The Court also spent about one half hour in the pilot's seat of a Delta DC-9 examining at close range the instrument panel and other portions of the cockpit under the tutelage of a Delta captain.\n\nPlaintiffs' theory of negligence is premised on the claim that the air traffic controllers on duty at the Logan Airport control tower the day of the accident, all of whom were concededly Government employees acting within the scope of their official duties, were negligent in the following ways: (1) they violated the provisions of the Terminal Air Traffic Control Manual \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\" in effect on the day of the accident by failing to provide the crew of D 723 with accurate, complete and current advice that banks of sea fog were obscuring visibility at the approach end of Runway 4-R on which D 723 was about to attempt a landing; (2) they violated the provisions of the Manual by failing to advise D 723 to intercept the localizer course \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\" at least two miles from the approach gate \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\" at an altitude not above the glide slope; \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\" (3) they violated the provisions of the Manual by failing to order D 723 to intercept the localizer at an angle of 30 degrees or less; (4) they violated the provisions of the Manual by failing to provide D 723 with information establishing (a) its position relative to the final approach, (b) a proper approach clearance, \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\" and (c) instructions to contact the tower on local control frequency \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\" or to monitor local control frequency; and (5) they issued non-standard, confusing and distracting radio communications during the final phase of D 723's approach.\n\nThe United States takes and maintains the position that this unfortunate disaster was caused solely and exclusively by the negligence of the crew of D 723. Specifically, the Government argues that the negligence of the Delta crew was gross in nature, in that the data obtained from the flight path and voice recorders establishes that this crew: (1) failed to scan their instruments and/or chose to ignore the information reflected thereon; (2) intercepted the localizer at an excessive rate of speed; (3) failed to maintain the localizer course; (4) failed to intercept and maintain the glide slope; (5) failed to make the required course deviation call-outs and the required altitude call-outs; (6) relied on information provided from a flight director which was found in the wreckage to have been set to the wrong mode; (7) failed to heed conflicting information being supplied by the more reliable primary instruments; (8) assigned a non-crew member the responsibility of participating in the approach-checklist and descent-checklist in violation of Delta's procedural manual; (9) failed to stabilize the aircraft during the approach both altitude-wise and speed-wise; (10) allowed the aircraft to dive below the glide slope during the last three miles of the approach; (11) ignored warnings from the decision height flashing light and the fact that that light illuminated prior to the middle marker light; and (12) failed to make the required decision regarding continuing the approach when they reached decision height \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\" (DH).\n\nThe witnesses who testified at the trial fall into the following categories: air traffic controllers, pilots qualified on the DC-9, air traffic control experts, an expert weather observer, an engineering expert, four lay witnesses who were in the vicinity of the crash and testified as to their observations of the prevailing weather, and four other witnesses who were employed at Logan and were among the first persons to arrive at the scene of the accident and to report the crash.\n\nII. WEATHER\n\nA. Official Observations\n\nA very substantial portion of this trial was concerned with conflicting testimony about the weather which prevailed on the morning of July 31, 1973, both up to and after the time of this crash. It has been stipulated that the crash occurred at 11:08.05 Eastern Daylight Savings Time (1508:05 GMT).\n\nTo place the testimony relative to prevailing weather in perspective, and more importantly to place in perspective the amount of information about the weather which was, or should have been, known by the pilot and co-pilot of D 723, the following information established either by exhibits or testimony should be understood.\n\nThis flight originated in Burlington, Vermont and made an unscheduled intermediate stop in Manchester, New Hampshire. While the aircraft was still at the Manchester Airport, the following exchange took place between ATC of the Manchester tower and the crew of D 723 at 1404:\n\nTower: 723 . . . Boston can't handle you right now so there will be a little delay\n\nTower: Boston advises there will be right now at least a 30 minute delay with the delay on ground at Manchester\n\n723: You want us to hold on the runway\n\nTower: Whenever Boston tower can take you will advise\n\n723: OK, thank you sir, little cluttered up this morning\n\nTower: Getting missed approaches \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\" at Boston, that seems to be the problem\n\n723: Ah, so.\n\nAt 1423 the Manchester tower called Boston and then advised the crew of D 723 \"just called Boston tower, they advised indefinite delays, no time.\"\n\nThe Manchester weather station reported patchy ground fog that morning. At 1500 Manchester reported, \"partial obscuration estimated 1000' ceiling, overcast, 3 miles visibility in fog.\" The weather station at Bedford, Massachusetts, which is on the route of this plane's flight from Manchester southward, reported \"indefinite 400' ceiling, full obscuration, 1 1/2 mile visibility in fog.\"\n\nThe official area weather forecast issued for the period 7:00 a.m. to 12:00 noon, July 31, 1973, was \"ceiling 200' full obscuration, visibility within 1/2 mile in fog, occasionally ceiling 400' full obscuration visibility, 1 mile in fog.\"\n\nAir Met, a weather warning issued by the United States Weather Bureau, stated for the period 9:00 a.m. to 12:00 noon that day: \"coastal waters, coastal New England, New Jersey and lowlands into New England, eastern New York, ceilings and visibility well below 1000 feet, 2 mile visibility in fog, coastal waters and coastal sections and ground fog elsewhere. Fog continuing coastal waters becoming patchy outer Cape Cod with fog patches occasionally drifting over immediate coastal sections and remainder of Massachusetts, New Hampshire and Maine, and dissipating elsewhere.\"\n\nThe Air Met contained a section captioned \"Clouds and Weather.\" It provided for the time period 9:00 a.m. to 12:00 noon that day: \"coastal waters zero or near zero ceilings and visibilities in fog. Few rain showers, possibly a few thunderstorms outer coastal waters.\"\n\nThe last official observation made by the U. S. Weather Bureau at Logan Airport prior to the accident was made at 1453 (15 minutes before the crash) by Harry Terban, a veteran weather observer who has been employed by the National Weather Service for 24 years. Mr. Terban, who I find to be a highly credible and well qualified weatherman, was responsible for taking all weather observations that were subsequently sent out for transmission as the prevailing weather for Boston. To the extent that there is a contradiction between Mr. Terban's testimony as to the state of the weather at Logan that day and the testimony of other witnesses thereto, I believe Mr. Terban's testimony. His 1453 observation, which he made at Logan Airport, read as follows \"partial obscuration, estimated 500, broken, 25,000 overcast. The surface visibility one and one half miles, tower visibility one and one half miles, the obscuration to vision fog, air temperature 68 degrees dew point 64 degrees wind estimated at 100 degrees at 2 knots.\"\n\nMr. Terban also testified that his observation point is on the roof of a building which is approximately 7500 feet from the approach end of Runway 4-R and that there was a fog condition at the entire airport until after the taking of the 1453 observation. He explained that a partial obscuration exists when at least 1/10 but not more than 9/10 of the sky is obscured by a surface-based phenomenon. He also explained that the visibility quoted in the weather report is the maximum which an observer can see in at least 50% of the horizon circle. The first observation he made after the time of the accident was at 1512 when he determined an estimated ceiling of 400 feet and surface visibility to be 1 mile. He sent out this information on the teleautograph system, which sends the latest weather information to other weather stations, airports and major airlines. He also made a special observation at 1533 at which time he did not observe any definable bank of fog approaching the runway end of 4-R. In fact, he testified that he did not observe any definable bank of fog at any earlier time that day.\n\nB. Regulations\n\nIt is significant to note at this point the requirement that the pilots of all commercial passenger-carrying planes have a specific obligation to fully apprise themselves of prevailing and expected weather conditions along the route of their flights. The pertinent regulations are as follows:\n\n14 C.F.R. 91.5, which provides\n\n\"Each pilot in command shall before beginning a flight, familiarize himself with all available information concerning that flight. This information must include\n\n(a) for a flight under IFR \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\" . . . weather reports and forecasts, fuel requirements, alternatives available if the planned flight cannot be completed . . . .\"\n\n14 C.F.R. 121.599, which requires:\n\n\"No aircraft dispatcher may release a flight unless he is thoroughly familiar with reported and forecast weather conditions on the route to be flown.\"\n\n14 C.F.R. 121.601, which requires:\n\n\"(a) The aircraft dispatcher shall provide the pilot in command all available current reports or information on airport conditions and irregularities of navigation facilities that may affect the safety of the flight.\n\n(b) During a flight, the aircraft dispatcher shall provide the pilot in command any additional available information of meteorological conditions . . that may affect the safety of the flight.\"\n\n14 C.F.R. 121.603, which provides:\n\n\"(a) Before beginning a flight, each pilot in command shall obtain all available current reports or information on aircraft conditions . . . that may affect the safety of the flight.\"\n\nWhile still climbing after takeoff from Manchester to the assigned altitude near Lawrence, the crew of D 723 was advised by Boston approach control at 1451 as follows:\n\n\". . . the Boston altimeter is 30.11, weather is partial obscuration, estimated 400' ceiling, overcast a mile and a half and fog.\"\n\nThe foregoing establishes the contents of the various weather reports, knowledge of which was made obligatory on the crew by the above-quoted requirements from 14 C.F.R.\n\nC. Lay Opinions\n\nA number of witnesses testified about the nature and extent of the fog which prevailed at, on above, or near Logan Airport on July 31, 1973. Their testimony leaves no doubt that it was an unusually foggy day. However, the degree of density of the fog, the altitude of the lowest portion thereof, and whether or not it was in the configuration of a definable bank were the subject of conflicting testimony.\n\nAmong those witnesses who testified were several men who, in the course of their normal employment either in the trucking industry or the maritime industry, were located in the Castle Island section of the City of Boston on the morning of July 31, 1973.\n\nWarren Hutchins, an engineer employed by the Boston Towboat Company, testified that he was aboard the tug MARS which was tied up at a pier at Castle Island because of the fog from 9:30 until 11:20 a.m. on July 31, 1973. He testified that because of the fog he could not see the airport from his position at Castle Island, which was about 3000 feet from the airport and directly across the channel from the approach end of Runway 4-R. Mr. Hutchins said that shortly before the crash he saw a plane pass directly overheard for about a second or two and then he lost it in the fog. He said he has made a hobby of watching planes land and he believed this one to be extremely low as it passed over him.\n\nRichard F. Giroux testified that he was on a coffee break about 11:00 a.m. at Castle Island and saw a plane go overhead on which he could read \"Delta.\" It then disappeared into the fog about halfway across the channel. He heard a crash-like sound about five seconds after last seeing the plane. Two or three minutes later, he heard another plane which sounded as if it were a lot higher than the Delta plane. It was on approximately the same course as the Delta plane.\n\nThomas Karacoudas testified that at about 11:00 a.m. he observed a plane go over Castle Island toward the airport and disappear into the fog as it crossed the channel. He said he could observe the word \"Delta\" on the plane, and he also said that fog obscured the whole airport as he looked toward it from where he was on Castle Island. He expressed the opinion that this was the lowest airplane he had ever seen making an approach.\n\nWilliam Rae testified that he was at Castle Island and could not see the airport because of the fog condition until an improvement occurred at about 11:20 a.m. He observed the plane go over and noted the word \"Delta\" on its tail section. It disappeared into the fog in a matter of seconds.\n\nI find that these four witnesses at Castle Island establish that at the time they made their observations fog obscured their view of the airport. I find that their testimony that the Delta aircraft which passed over them shortly after 11:00 a.m. was making an abnormally low approach to the runway to Logan is factual and corroborated by the evidence supplied by the flight recorder.\n\nAdditional testimony as to the nature and extent of the fog prevailing that morning came from two witnesses, Geoffrey F. Keating and Harris Cusick, who were present at the airport in the course of their employment on a construction project at the airport, and from Chief Charles T. Arena and Deputy Chief Peter Cutrone of the Airport Fire Department. Still additional testimony as to the prevailing fog conditions came from First Officer Keith Chappell, copilot of Eastern Airlines (EAL) Flight 572, the last plane to land on Runway 4-R prior to the accident, and from Captain Vernon H. Young, the pilot in command of EAL 945 who was waiting at the end of Runway 15-R for that flight to receive a clearance to take off for San Juan, Puerto Rico. This group testified as follows:\n\nGeoffrey F. Keating, an engineer employed on a construction project at Logan Airport, testified that because of the fog conditions, gravel-hauling trucks were stopped that morning at about 9:00 a.m. because their route normally took them across active runways. He stated that the fog condition varied all through the morning, that at times the airport tower and the downtown Boston skyline were visible and that at other times his view of those buildings was obliterated by fog. He stated he could not see Castle Island from Logan Airport at any time that morning, and he expressed the opinion that when he saw flame near the approach end of Runway 4-R he also saw fog which he estimated to be at a height equivalent to two light poles. Mr. Keating first went to the end of 4-R, observed the flames, then went to the fire station and reported the accident to Chief Arena. Mr. Keating testified that the first time he went to the vicinity of Runway 4-R, and about five minutes before he saw the flames, he did notice that the old control tower was visible, but that the upper half of the new tower was not visible. The new tower is about 500 feet high. He did not look toward the tower the second time he went to the approach end of 4-R.\n\nOn the day of the accident Harris Cusick was a fellow employee of Mr. Keating. Mr. Cusick grew up in Winthrop, the town abutting Logan Airport. He had been working at the airport for about six years prior to the crash. His background included attendance at an Air Force Weather Observation School and three years service on active duty as an Air Force weatherman. He expressed the opinion that the visibility improved somewhat around 10:00 a.m., but began to deteriorate again before 11:00. He expressed opinions as to the ceiling and visibility near the end of Runway 4-R when he arrived there some ten or fifteen minutes after the crash had occurred.\n\nI do not credit this witness' testimony since I find him to be strongly biased in favor of plaintiffs, as he conceded under cross-examination. He likewise conceded, in substance, that he was \"miffed\" because the National Transportation Safety Board did not call him but did call Mr. Keating as a witness at the post-accident hearing it held in Peabody, Mass. in August 1973. Mr. Cusick resented this because he felt that his training and experience in the United States Air Force made him a far more qualified and reliable witness than Mr. Keating as to the weather conditions prevailing at the time of the accident. Mr. Cusick showed further bias by making an attack on what he believed to be the deficiencies of the transmissometer system \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\" for Runway 4-R. His attack was based primarily on his own ipse dixit. I totally discount Mr. Cusick's testimony.\n\nChief Arena and Deputy Chief Cutrone testified in substance that in their opinion the fog was thick at the approach end of Runway 4-R at the time they arrived there, more than ten minutes after the crash. I find that the condition at the time they arrived there does not establish what the conditions were at 1508, and more particularly, that it does not establish any inaccuracy on the part of the RVR \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\" readings. Nor does it cast any light on what slant view \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\" was available to the crew of D 723 during the course of the approach, nor, most importantly, as to what the available visibility was at the time the plane reached DH and proceeded on down to impact.\n\nCaptain Vernon H. Young, of Eastern Airlines, testified that on July 31, 1973 he was in command of EAL 945 to San Juan, Puerto Rico, which was scheduled to depart at 1320. In fact, he did not \"push off\" from the gate until 1453, and as he taxied away from the Eastern Airlines terminal, heading toward the outer runway, he was facing the approach end of 4-R and Castle Island, at about 1458 or 1459. He saw fog between 4-R and Castle Island which he considered unusually dense for that time of year. When he reached the far end of Runway 15-R and was facing down the runway, his view of the approach end of 4-R was obstructed by some of the terminal buildings. He estimated that at 1505 about half the airport was obscured, including all but the most northern end of 4-R. He said that he did not see EAL 572 pass him on its roll-out to the taxiway, although he was facing the runway on which it successfully landed and rolled out. It should be noted that his failure to see EAL 572 is inconsistent with the testimony of Flight Officer Chappell, the copilot on EAL 572, which I believe, to the effect that when he landed the RVR reported a visibility of 6000 feet and that, in fact, the actual RVR was even greater along 4-R at the time he touched down and rolled out.\n\nCaptain Young, who appeared voluntarily at the request of a pilot employed by Delta, testified that he is aware that there is a regulation which requires pilots to report to the tower any change in weather conditions that may be essential to the safety of others. He did not report the above-described condition and his failure to do so is one of the reasons why I do not accept his testimony as factual.\n\nIn testimony which I find highly significant, Captain Young conceded that the only person who could determine whether or not the visibility at DH enabled a pilot to land would be the pilot himself. This is true, he testified, no matter what anyone other than the pilot saw or reported about the visibility. He testified unequivocally that it is completely up to the pilot to make a decision at DH as to whether a safe landing can be executed and this decision is to be based on what he then can or cannot see of the runway or its environment. He testified that the RVR value is important primarily because it establishes whether it is legal to pass the outer marker, i. e., whether a pilot must execute a missed approach because told the RVR is less than 2400 feet at the time he passes the outer marker. If the RVR is more than 2400 feet as he passes the outer marker, he may continue with the approach even if the RVR decreases thereafter.\n\nKeith Chappell, who was the Flight Officer on EAL 572 which landed on Runway 4-R (at about 1506 or 1507) immediately prior to the crash of D 723, also appeared voluntarily as a witness for Delta. He testified that he and the Captain of EAL 572 (a DC-9) were well aware \"that there was weather around,\" i. e., of the foggy conditions then generally prevailing along the Massachusetts coast. After leaving the Whitman holding point and beginning their final approach, the crew of EAL 572 discussed DH and the procedure for executing a missed approach. He testified that after his flight passed inside the outer marker the local control coordinator advised him that fog was moving back inside the airport and was approaching Runway 4-R. He testified that he established visual contact with the runway just before DH and never lost visual contact with 4-R thereafter. He also said that the visibility on 4-R was good as he touched down.\n\nFlight Officer Chappell said that in his experience a pilot frequently encounters weather which differs from what has been described in the last official weather bureau release, and further that experience has taught him to take all weather forecasts with a grain of salt, and to pay strict attention to what he can actually observe shortly before and at DH.\n\nHe testified that when EAL 572 landed, immediately prior to the crash of D 723, weather conditions as reported by the tower were different from those encountered on landing, but, significantly, not so different as to cause him to report them to the tower as required by an FAA regulation. I do not credit Mr. Chappell's testimony that any significant weather change had occurred since he received his last weather advisory. He testified that the receipt of information about a fog bank when the plane was at an altitude of 400 feet en route to a DH of 216 feet would not cause a competent pilot to crash the airplane, but that it was preferable to get such information earlier, if possible. In another telling piece of testimony he expressed the opinion that it is preferable for the tower to give additional weather information at a late stage of approach rather than not give it at all.\n\nD. Air Traffic Control Opinions\n\nJames R. Morrissey testified that on the day of the crash he was working the position of approach control coordinator in the TRACON room. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\" He heard no messages about the fog which indicated any significant change in previously existing weather conditions. He heard internal transmissions from the tower cab which he considered as merely messages for internal use, such as alerting controllers that incoming airplanes might begin executing missed approaches again as had been done earlier that morning. He expressed the opinion that any pilot flying a plane that day would have been well aware that there was fog all around Logan Airport. He further testified that he would not consider the internal message which he heard at 1507:03, \"that fog's coming right back across again, so you can get ready for some, it's real thick again,\" to be a \"significant weather report,\" within the provisions of the Terminal Air Traffic Control Manual. This was so, he testified, particularly in light of the fact that pilots had already been given a weather report of 400 feet ceiling and fog. He believed that fog coming back in would be a weather condition that should have been expected by any pilot who had been receiving regular reports while flying that morning.\n\nOn July 31, 1973, Jeoffrey McDonald worked part of the morning in the TRACON room and later moved, a few minutes before the crash, to the tower cab \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\" to the position of local controller. He adopted his deposition testimony that on the day of the crash he observed fog moving from the south-southeast quadrant of the airport toward the north-northeast quadrant over Runway 4-r, and back and forth across the outer parts of the airport. He testified that at the time he cleared D 723 to land he could not see all of Runway 4-L from the cab, but only that part of 4-R which was near Taxiway C. He put to rest and rendered academic a line of questions trying to elicit testimony that ATC was somehow negligent in not using Runway 15-R for landings that morning, by establishing that the electronic instrumentation associated with 15-R was inadequate to meet minimum standards for ILS landings on that day. The witness Mr. Keepers corroborated this testimony.\n\nMr. McDonald cleared EAL 572 to land at 1505:37 and in so doing volunteered the following information to that pilot: \"The fog is moving back in from the south across the airport and is just approaching Runway 4-R. Your RVR for 4-R is showing more than 6000.\" He expressed the opinion that the quoted information was not a \"pertinent\" airport condition within the meaning of para. 305 of the Terminal Air Traffic Control Manual (PX-9), which in relevant part provides:\n\n\"Issue airport condition information necessary for an aircraft's safe operation in time for it to be useful to the pilot. Include the following as appropriate:\n\n* * *\n\n(g) Other pertinent airport conditions.\"\n\nMr. McDonald gave the explanation, which I accept, that the phrase \"airport condition\" in para. 305 pertains to land mass, construction going on, snow piled along the runway, or a parked aircraft or other vehicle on the runway, but not to weather.\n\nMr. McDonald also testified that at no time did he see an RVR readout of a value lower than 6000 feet for 4-R when he was working the local control position, and that the lowest RVR reading he saw at any time during that day while in the radar room was 3000 feet. He expressed the opinion that when he left the TRACON room to begin working in the cab as local controller he had no obligation to inform the TRACON room personnel about whatever fog he observed because that fog condition had persisted essentially unchanged all morning. He further testified that he gave the same further information about the fog and RVR reading to D 723 and to EAL 572 which landed safely immediately ahead of it.\n\nDemetrios J. Merageas was on duty in the TRACON room as Arrival Data No. 1 man on July 31, 1973. His duties included updating the arrival strips which are handled by the approach controllers. In the radar room a separate strip is printed out, usually by computer, for each incoming flight. The information which appears on the strip is prepared by the air traffic center \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\" prior to its \"handing off\" a plane to approach control at Logan tower. The information on the strip includes the name of the airline, the flight number, e.g., D 723, the name of the airport at which it contemplates making a landing, the aircraft's altitude expressed in feet and its air speed expressed in nautical miles \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\" per hour as of the time when the aircraft is handed off by the Center to approach control.\n\nMr. Merageas testified that he did not hear the message \"fog is coming right back across again so you can get ready for some,\" but had he done so he would have interpreted it merely as a warning for the controllers to prepare for the possibility that pilots would again execute missed approaches. He would not have considered this as a message which should be transmitted to incoming pilots. He further testified that he would advise incoming aircraft of any pertinent major change in the weather but did not consider the return of fog under that day's prevailing weather to be such.\n\nI find that in controllers' jargon \"you can get ready for some\" refers to their preparing to get ready to handle aircraft which have executed missed approaches, not to \"some\" fog.\n\nThe senior FAA representative at Logan Airport is William C. Keepers, Chief of the control tower at Logan Airport, who testified, and I find, that the controllers in the cab are physically located about one mile from the approach end of Runway 4-R, and 3/4 of a mile from the RVR transmissometer. The transmissometer is 692 feet from the center line of the runway. It follows that the transmissometer is substantially closer to the runway than are the controllers in the cab and, for that reason, the transmissometer is in a significantly better position to measure and report the visibility along the runway than are the controllers who must make a subjective judgment from a distance of a mile away.\n\nMr. Keepers testified that the RVR reports for Runway 33-L were no better on the morning of July 31, 1973 than the RVR reports for 4-R. This testimony taken together with that of Jeoffrey McDonald, discussed supra, disposes of the contention that it was negligent to use Runway 4-R rather than some other runway that morning.\n\nMr. Keepers also testified that in his career he personally has worked thousands of landings in which a plane has come down safely in fog conditions, and for that reason does not consider fog in and of itself to be a hazard to air safety. He further testified that the RVR readings are intended to give the pilot the average visibility conditions on the ground along the runway for the preceding 52 seconds prior to the time of the particular RVR readout. He confirmed that it is not possible for tower personnel to determine with absolute certainty the visibility conditions along a runway when fog is present. Perforce they must rely on and relay the RVR reading. Mr. Keepers also established that there is no way in which tower personnel can know what slant vision is available to a pilot in the course of his approach, and that there is no equipment which provides such information to tower personnel.\n\nAlfred T. Lynch, Jr. testified that on July 31, 1973, he was working Arrival Radar position No. 2(AR-2) in the TRACON room from about one-half hour before the accident until substantially afterwards. He testified that at 1508:30, 25 seconds after the stipulated time of the crash, he sent a message to all planes in his frequency, \"All aircraft, RVR has just gone down to 2000 feet.\" He said it was possible the RVR had dropped directly to 2000 feet from a prior reading of either 3500 feet or 6000 feet.\n\nMr. Lynch likewise expressed the opinion that had he heard the transmission that fog was coming back in, he would have considered it to be internal advice to the controllers to prepare for the possibility of missed approaches. He would not have considered the information contained in that transmission to be a report of a significant weather change, required by the manual to be transmitted to incoming pilots. However, he distinguished this information from the information about the drop in the RVR, which he did transmit to incoming pilots.\n\nCharles M. Taylor, an ATC specialist supervisor at Logan Airport, was serving in the approach control position as arrival radar one (AR-1) on July 31, 1973. As such he was responsible for issuing orders to approaching aircraft, including D 723, which were in the area west of the localizer course for Runway 4-R. Mr. Lynch was responsible for approaching aircraft east of that localizer. As of that date Mr. Taylor had 17 years prior experience at Logan Tower, and 4 years experience as a United States Air Force air traffic controller. He had previously worked all positions at Logan Tower, both operational and supervisory.\n\nMr. Taylor testified that he knew that D 723 would be coming to Logan directly from Manchester, and that it would be under his jurisdiction immediately after its takeoff from Manchester. He testified, and the exhibits establish, that D 723 contacted him on his radio frequency as it was climbing to 4000 feet after takeoff from Manchester as it approached Lawrence, Massachusetts. In response to that initial contact he furnished it with the most recent weather advisory which had been posted at his position in the TRACON room. At 1451:21 he told D 723\n\n\"723 Roger, cleared to Lawrence. No delay. Planned vectors ILS 4 right. The Boston altimeter is 30.11. Weather is partial obscuration, estimate 400 overcast a mile and a half and fog.\"\n\nHe further testified, and I find, that this weather advisory was not changed between the time of his transmission to D 723 and the time of the crash. He testified that he did not hear the internal message, \"that fog is coming right back across again . . . it's real thick again,\" nor did anyone who may have heard it tell him about it. More significantly he said that if he had heard it, he would not have relayed it to D 723 because, like other controllers who testified, he merely considered it an advisory to alert the controllers to get ready for possible missed approach situations. He likewise did not consider the information about fog moving back in to be a report of a significant change in weather conditions within the meaning of the manual.\n\nE. Conclusions\n\nOn the basis of the above-summarized testimony, I find that all relevant weather advisories prior to the accident unequivocally reported the existence of fog conditions in the entire New England Coastal area. I specifically find that the crew of D 723 was well aware that an abnormally foggy condition existed and persisted at Logan all morning which, indeed, had substantially delayed the progress of their flight from Burlington to Logan. I further find that the crew of this flight was well aware that the fog was of sufficient severity to require the execution of missed approaches by other pilots with consequent traffic delays. I find that en route from Manchester to Boston D 723 flew over and through fog. More significantly, I find that Mr. Taylor transmitted the last official United States Weather Bureau advisory to the crew of D 723 as it was approaching Lawrence at 1451:21 approximately 17 minutes before the crash.\n\nI am not persuaded that any weather information which came to the attention of Mr. Taylor before the crash amounted to a \"difference [in] weather elements observed from the tower and those reported by the weather station\" within the meaning of para. 361 of the Terminal Air Traffic Control Manual (PX-9), which provides in pertinent part:\n\n361. DISSEMINATING WEATHER INFORMATION\n\n* * *\n\nc. Differences between weather elements observed from the tower and those reported by the weather station shall be reported to the official observer for the element concerned.\n\nIn so finding, I have determined that plaintiffs have failed to prove that the weather observed from the tower up to 1508:05 was different than that reported previously by the weather station on July 31, 1973, or that if such a change occurred that it did so sufficiently prior to the crash to enable Mr. Taylor to learn of it in time which was adequate for him to transmit it to the traffic under his control.\n\nParagraph 28 of the Terminal Air Traffic Control manual, captioned \" Duty Priority,\" allocates three separate priorities to various of the duties to be performed by air traffic controllers. That section gives first priority to separation of aircraft, second priority to services which are required but do not involve separation, and third (and last) priority to items classified as \"additional services.\"\n\nParagraph 361 of the same manual, supra, captioned \"Disseminating Weather Information,\" is characterized by the manual as an \"additional service.\" Therefore, it is a third priority item.\n\nFor reasons which will appear infra in the discussion of Allegheny Airlines (AL) Flight 666 and its relationship to Mr. Taylor's duties, I further find that even had there been a significant weather change, under the circumstances which obtained in the five minutes just prior to the accident and thereafter, it was not obligatory on Controller Taylor to divert his attention from the problem caused by AL 666 in order to issue a fog warning to D 723.\n\nIt is clear from the record before this Court that an experienced crew, particularly one trained to the level of proficiency claimed by Delta for its pilots, had no more need to be told that there was fog in the vicinity of Logan Airport than did they need to be told that airplanes fly in the air and above the ground! In questioning the various witnesses in this case, Delta has implied that fog took this crew by surprise. This contention is without credible support in the record, and does not warrant further discussion herein.\n\nAccordingly, I rule that plaintiffs have failed to establish any negligent conduct on the part of Mr. Taylor or any breach of any duty he owed to the crew or passengers of D 723 by reason of his not making any additional weather transmissions to D 723 after his 1451:21 weather message.\n\nEven assuming, arguendo, that there had been a significant weather change which for some reason enjoyed a higher priority under para. 28 of the manual than the \"additional services\" third priority, on the facts of this case the failure to report such a change could not be found to be a proximate cause of the crash of D 723. The record is replete with explanations by various pilots who testified that during an ILS approach the crew is to conduct an altitude countdown prior to arriving at DH. I find that the normal procedure, as testified to by several witnesses, is for the pilot who is not physically handling the operative controls of the aircraft, to orally call out various altitudes above the DH as the aircraft passes down through those altitudes in the course of its final approach. There was evidence from some witnesses that it is customary to make an oral call-out at 1000 feet above DH and at 500 feet above DH, and all witnesses who testified agreed that a call-out is mandatory at 200 feet above DH, at 100 feet above DH, and at DH.\n\nIt was also established, without contradiction, that when the aircraft arrives at DH the DH light on the instrument panel becomes illuminated, thus giving another reminder to the pilot and the copilot that they have arrived at DH altitude.\n\nIt is mandatory for the person making the oral call-out to state at DH either \"Decision Height, Contact,\" which means \"I can now see the runway or its environment, it is safe to continue with the landing,\" or \"Decision Height, No Contact,\" which means \"I cannot see either the runway or its environment and therefore it is not safe to continue this attempted landing. Start to execute a missed approach, climb up, and head for the designated holding point,\" i. e., execute a go-around.\n\nThe transcript of the CVR establishes that no oral countdown whatsoever took place in the course of this unfortunate approach. In fact, the only mention of the words \"decision height\" appearing at all in the transcript of the CVR is a reference at 1459 by the man in the jump seat, \"Check the radio altimeter, needs a DH . . . you know it is 4-R.\" An examination of the tape shows that there was no transmission from the tower which could possibly have rendered inaudible a countdown had one taken place at either 200 feet above DH or at DH. While it is not as clear that the same situation is true at the altitude of 100 feet above DH, I am persuaded and find that no countdown occurred at that time which was masked over by any transmission from the control tower. In drawing this inference, I have in mind both the absence of a countdown at other critical altitudes and the fact that the CVR was in fact able to pick up other overlapping transmissions.\n\nEven assuming that an extremely thick fog developed at the last minute, I find that the presence of such fog would not and could not have caused the crash of this plane had the crew followed the approved navigational procedures of making call outs down to DH. I find that it was totally and solely within the discretion of Captain Streil, and no one else, to determine at DH whether visibility was such that he could see the runway or its environment, and to decide whether the plane was then in a configuration vis-a-vis the localizer course and the glide slope from which a safe landing could be made. Nothing emanating from the tower had any input into this decision.\n\nI find that the fact that radio transmissions as to fog were or were not made had no causal relationship whatsoever to the crash of D 723. I further find it grossly negligent for this crew to have continued its descent (1) without ever mentioning DH after 1459, (2) without ever making the required call outs at altitudes above DH and at DH, (3) without ever discussing slant view or the visibility of the runway or its environment prior to or at DH, (4) or without ever reacting in any way to the claimed presence of fog at the approach end of 4-R.\n\nThis apparent indifference to DH, fog, visibility and altitude is still more shocking in light of the fact that a transmission was recorded on the CVR at 1507:45.5 which specifically said \"A fog bank is moving in. It is pretty heavy across the approach end.\" After it was acknowledged this message incredibly elicited no comment from pilot, copilot or jump seat occupant!\n\nThere is ample evidence in the record that it is good practice during an ILS approach for the crew to keep in mind the possibility that the weather will not be the same as that reported in the last weather advisory. Delta pilots, in particular, are taught that this is true when the temperature and dewpoint are within a few numbers of each other and when there is little or no wind. The evidence shows that both conditions obtained on July 31, 1973 and this should have been known to the crew of D 723.\n\nAt the time of the 1507:45.5 transmission noted above, the aircraft was at an altitude of approximately 325 feet (109 feet above DH) and at a point in the flight at which I find that a missed approach could have been executed safely had any consideration been given to the four factors noted above.\n\nCockpit discipline is an extremely important aspect of flying safety and the lack of it is inexcusable. These four points noted above, and the fact that the CVR shows that the captain undertook to imitate the sound of a bugle at 1452:24 and again at 1501:59, prove that there was a serious lack of discipline in the cockpit of D 723.\n\nFinally and most significantly, the record is replete with pilot testimony, including that from Delta supervisory pilots, that its pilots have the capacity to execute missed approaches at least at altitudes as low as only 5 feet and there is evidence in the record that a missed approach can be executed by a DC-9 even as its wheels touch the ground. I find no merit in plaintiffs' contention that the 1507:45.5 transmission came too late to be of use to an alert crew following approved procedures.\n\nI find that there is no causal relationship whatsoever between the weather and the presence or absence of weather transmissions from the tower, and this crash.\n\nIt also should be noted that the crews of EAL 572, of American Airlines (AM) 400, and of EAL 1020, all handled their flights safely within minutes before and after this crash, with no better or different information than was received by D 723. These crews followed prescribed procedures, with the latter two flights electing to execute missed approaches at or before reaching DH immediately following the crash of D 723.\n\nIII. THE APPROACH INSTRUCTIONS GIVEN TO DELTA 723\n\nPlaintiffs allege that there was ATC negligence in the handling of D 723's landing approach in the following respects:\n\n1. The aircraft was vectored by Mr. Taylor to intercept the localizer course at an interception angle in excess of 30 degrees contrary to para. 1351 of the Terminal Air Traffic Control Manual.\n\n2. The aircraft was vectored by Mr. Taylor to intercept the localizer at an altitude above the glide slope contrary to para. 1352 of the manual.\n\n3. The aircraft was not advised of its position relative to the final approach fix -- the outer marker -- before it reached the approach gate -- a point 6.3 miles from the glide slope touchdown point -- contrary to para. 1360(a) of the manual.\n\n4. The aircraft was not issued an approach clearance by Mr. Taylor until such clearance was requested by Captain Streil.\n\n5. The aircraft, prior to reaching the approach gate, was not instructed by Mr. Taylor when over the outer marker either to monitor the local frequency, or contact the tower on the local control frequency, contrary to para. 1360(d) of the manual.\n\n6. The aircraft was cleared to land and instructed to contact the tower by Mr. Taylor only when it was inside the outer marker at a point 2.6 miles from the glide slope touchdown point.\n\nPlaintiffs thus allege that D 723 was provided with non-standard ATC service. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\" They argue that the failure to provide adequate ATC service in the above-numbered respects had a \"snowballing\" effect on the crew of D 723 as the aircraft proceeded into its final approach course after intercepting the localizer. Plaintiffs argue that the cumulative effect of these non-standard instructions did not become apparent to the crew until the aircraft passed through DH and entered a fog bank which the plaintiffs say obscured the approach end of Runway 4-R and destroyed the previously acquired visual contact with Runway 4-R.\n\nCrucial to the determination of the causal relation of the alleged violations of ATC procedure and the crash is an understanding of those components of the instrumentation of the DC-9 aircraft which are designed to enable a pilot to \"stabilize\" his aircraft. In general, when an aircraft is \"stabilized\" on a particular approach course, its configuration is such that a landing may be safely executed.\n\nMuch of the testimony regarding the instrumentation of the DC-9, the procedure followed in a standard ILS approach of a DC-9, and the importance of being stabilized on the approach course came from Captain Thomas P. Ball.\n\nCaptain Ball retired in 1971 as vice president of flight operations of Delta Air Lines. He testified that he has been a pilot since 1929, and is \"rated\" \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\" on 11 different commercial aircraft including the DC-9. While actively employed by Delta he was, inter alia, responsible for hiring and training Delta pilots. His experience includes 11 years flying assigned routes as a line pilot for Delta. He is the person responsible for the compilation of the flight operation manuals which pertain to Delta DC-9's.\n\nCaptain Ball testified that navigation in IFR flights is primarily dependent upon the aircraft's radio instrumentation system. One instrument in this system called the PDI (pictorial deviation indicator) is used in connection with certain radio transmitters located at various fixed ground-points across the United States. These transmitters are referred to as VOR stations (very high frequency omni-range stations). The exact locations of these transmitters are designated on air navigation maps and charts used by pilots and carried with them in flight. These VOR transmitters send out a radio signal in a 360 degrees arc. By selecting the frequency of a particular VOR transmitter on the VOR receiver in his aircraft, a pilot can, by using his PDI indicator ascertain whether he is flying a heading toward or away from that VOR transmitter, and also determine whether his aircraft is to the left, right, or on the center line of the radio beam transmitted from that VOR station. One such VOR station transmits what has been referred to as the localizer course for the runway being approached.\n\nA vertical needle on the PDI dial graphically displays the aircraft's position relative to the localizer course. PDI dials are on the panels in front of both the pilot and the copilot. If the needle on the PDI is displaced to the right, this tells the pilot that the center line of the localizer is to his right and that in order to regain the localizer a right turn should be made until the PDI needle becomes centered. The dial on the PDI indicates whether the deviation from the center line is in the magnitude of \"one dot\" or \"two dots.\" Two dots is the maximum deviation discernible from this particular instrument, i. e., once an aircraft goes far enough off course to produce a two dot deviation on the dial, the dial has been exhausted and will not indicate whether and to what extent the plane goes still further off course.\n\nThe PDI also has a horizontal needle which informs the pilot of the aircraft's location vis-a-vis the glide slope in much the same way as does the vertical needle vis-a-vis the localizer. It too will depict a deviation from the established glide slope up to a maximum of two dots. The two dot deviation thus is the maximum readable on this particular instrument. For either type of a course deviation. The PDI is referred to in the trade as the \"raw data\" and the two terms are used interchangeably.\n\nCaptain Ball testified that also in front of both the pilot and the copilot there is an additional indicator called the flight director. This instrument is referred to in the trade jargon as the \"black box\" or computer and it provides more information to the pilot than does the PDI. For example, if the plane were off course to the left, the PDI would merely tell the pilot turn right and you will regain the localizer at some point. The flight director, however, not only tells the pilot to turn right but also computes for him the rate of turn necessary to center his aircraft on the localizer.\n\nThere was evidence from the CVR from which it could be inferred that during the late stages of the approach the crew of D 723 felt they were getting improper or faulty readings from their flight director. Several pilots testified that they believed that the flight director was supplying erroneous information to the crew particularly because of the comment of First Officer Burrill at 1507:05\n\n\"this goddamn command bar shows (unintelligible)\"\n\nand the subsequent comment of Captain Streil at 1507:40\n\n\"you better go to raw data, I don't trust that thing,\"\n\nboth of which are contained in the CVR transcript.\n\nIf such were the case, this might at least partially explain the evidence from the flight profile which established that the crew of D 723 did not stabilize their aircraft on either the localizer or the glide slope. However, even if the crew was receiving inaccurate information from the aircraft's flight director, this fact could not and does not in any way establish ATC negligence. But for the stipulation, made by Delta and the United States, but not by the other claimants against the United States, that the flight director was found to be in good operating condition after the crash, such misinformation might tend to establish the negligence of Delta in failing to properly maintain the aircraft's equipment. It more probably establishes the negligence of the crew of D 723 in failing to recognize the fact that the flight director was operating improperly and in failing to adjust their approach procedures accordingly.\n\nThere was evidence that the switch of the flight director was found in or near the \"go-around\" mode instead of the \"approach\" mode. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\" If that condition existed during the approach, as several pilot witnesses believed it did, the flight director did indeed provide erroneous course and descent guidance to the crew.\n\nIt should first be noted that a flight director is not a required instrument for making an instrument approach (14 C.F.R. 91.33(d)). In addition, Captain Ball testified that a pilot is trained to rely on the PDI whenever any discrepancy becomes apparent between the readings on the flight director and the PDI. This testimony was corroborated by all the DC-9 pilots who testified.\n\nCaptain Ball further testified that when he was a DC-9 pilot, he frequently intercepted localizer courses, after having been given a heading by ATC, using only the PDI. He then explained the procedure he would follow in such cases in great detail.\n\nI thus find that a properly trained crew, by a constant scan of the instrument panel and particularly the PDI, would and should have detected that the flight director was mis-set, and would and should have either reset it or ignored its indications, and relied on the PDI (or \"raw data\") without jeopardizing the safety of the aircraft.\n\nIn so finding I am mindful of Captain Ball's candid testimony that a qualified pilot constantly scans all of his instruments and \"fairly well has as a second nature a translation of his scan of instruments\", that is, he does not have to think of the information being supplied individually by each instrument, but, on the contrary, simultaneously reads, assimilates, understands, and correlates all of the information being fed to him. Captain Ball also stated that a pilot's proficiency in this regard is similar to a person's ability to think in a foreign language, and that Delta requires its pilots to understand the instruments so thoroughly that they can touch all instruments required by the checklist with their eyes closed.\n\nAdditional testimony by Captain Ball which supports the above finding also indicates the degree to which the crew of D 723 was negligent in the conduct of the ill-fated approach. Captain Ball testified that it is important for a pilot to stay along the glide slope so that if visual contact with the ground is lost, the aircraft will be at a proper altitude and attitude to execute a missed approach. He testified that the instrumentation in D 723 was adequate to advise the crew of their altitude. He made the candid admission that if Captain Streil knew the altitude and knew he was more than two dots below the glide slope at a late stage of his approach \"he should have done something about it.\" He further conceded that late in the approach between the times 1506:22 and 1506:43, when the PDI indicator was advising the crew that they were off course two dots or more to the left, and thus that a right turn was necessary to recapture the localizer course, this crew proceeded to make a further turn to the left!\n\nOn the basis of this evidence (clearly established by the flight profile) Captain Ball made the highly significant admission that there was error by the pilot in not ordering the copilot to rely on raw data earlier than he did.\n\nI find that, even assuming the crew was getting misinformation from the flight director, proper scanning of their instruments would have indicated to them how far off course they had strayed. Captain Ball explained that there is contained on the instrument panel a light which becomes illuminated when the aircraft descends to 268 feet at the inner marker. The inner marker is located near the approach end of the runway 0.6 miles before the intended touchdown point. There is likewise located on the panel, a few inches away, a different color light which becomes illuminated when the plane descends to 216 feet (the DH for Runway 4-R). Captain Ball said that if, as the flight profile indicates happened, the DH light illuminated prior to the inner marker light illuminating, this fact should have alerted the crew that there was something seriously wrong with their approach. The premature illumination of the DH light should have told this crew that they were already down to an altitude much lower than the altitude at which they should have flown over the inner marker, yet they had not proceeded as far as the inner marker.\n\nFinally, with regard to D 723's deviation from both the established localizer course and glide slope for ILS approaches to Runway 4-R, it should be noted that the record establishes that ATC personnel do not have the instrumentation available to them to monitor the deviation from the localizer by an in-coming plane except in the most extreme of cases.\n\nAlthough Captain Ball testified that D 723 was on a deviation of at least two dots for 4 1/2 of the last 5.3 miles of its approach and was on a deviation in excess of two dots for 3.3 of those 5.3 miles, Delta did not prove by a preponderance of the evidence that ATC was in any way responsible for the deviation, or had a duty to warn D 723 of the deviation. Indeed, the evidence established that air traffic controllers are not to \"get into the cockpit and fly the plane\" for the pilot.\n\nCaptain Ball, after reviewing the flight profile, listening to the tape of the CVR, and reading the transcript thereof, testified that he found no point in the flight profile down to the altitude of DH where the approach was unmanageable to the pilot. He also expressed the opinion that if this plane had \"rolled out\" (stabilized) on the localizer at about 1505:42 on the 035 degrees heading, when D 723 was then one dot above the glide slope (see PX 16), D 723 should have been able to capture the glide slope and fly in safely. He further testified that the pilot could have captured the glide slope within 30 seconds at 1505:42 at which point D 723 was then about two miles outside the outer marker, and moving at an air speed of approximately 190 knots. No speeds were assigned to this flight by ATC.\n\nWhile Captain Ball indicated that speed might have been a problem at this point in the approach, I find that if speed was in fact a problem, it was a problem created solely by the crew of D 723. Even assuming excessive speed as indicated in the record, Captain Ball stated that he knew of no reason why the crew could not have slowed this aircraft down from the excessive rate of speed to a more reasonable speed of 150 knots.\n\nI find that an additional factor contributing causally to the crash of D 723 for which the crew of the aircraft was solely responsible, was the fact that at the commencement of its approach it was travelling at the excessive rate of speed of 190 knots. With its weight and configuration the speed of this aircraft should have been 160 knots at the beginning of the approach, which speed should gradually have been reduced to about 124 knots as the final landing speed.\n\nAt approximately two and one half nautical miles from the intended touchdown zone, the approach controller advised D 723 that it was cleared to land and to contact the tower, after which at 1507:19 the captain commented, apparently to the copilot, that they were \"going like a son of a bitch,\" and at 1507:21 the copilot responded \"Oh my God.\" These comments indicated that during their approach the crew was concerned with their excessive speed; however, there was no apparent attempt to execute a missed approach which would have been a safe option consistent with Delta training and basic pilot responsibility.\n\nThus, the evidence is clear and I find that in spite of this excessive rate of speed it was well within the capabilities of a qualified crew and a DC-9 aircraft to have slowed to the proper speed, and to have stabilized with reference to the center line of the localizer and glide slope by the time the aircraft was at or slightly inbound of the outer marker.\n\nInstead of reducing the speed of the aircraft, however, the crew of D 723 allowed the aircraft to accelerate. When it passed over the outer marker, not only was it two dots off course and one dot above the glide slope center line, but its speed had increased to 207 knots. Shortly thereafter while at a speed of 197 knots, the flaps were lowered to 50 degrees. The proper maximum speed for 50 degrees of flaps is 180 knots.\n\nCaptain Ball also testified that he would expect Delta pilots to exceed the standards set out in defendant's Exhibit J, the Airline Transfer Pilot's Practical Test Guide, which requires the tested pilot to conduct an ILS approach without exceeding a one dot deviation from the glide slope or localizer.\n\nFurther, Captain Ball conceded that he would expect a qualified Delta pilot to be able to intercept a localizer at a 45 degrees angle without going into a two dot excursion off the localizer course. I therefore find that the angle of interception was not a cause of D 723's two dot deviation.\n\nAs indicated above, Delta contends that the non-standard air traffic service provided by ATC to D 723 was a concurrent and contributory cause of the crash. Captain Ball's testimony, however, while favorable to Delta on this issue, does not establish ATC negligence. Captain Ball was first asked his opinion as to whether, standing alone, each non-standard element \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\" of the ATC service provided D 723 \"could have adversely affected a standard ILS approach.\" Captain Ball's opinion was that none of these elements standing alone would have adversely affected a standard ILS approach.\n\nIt was also Captain Ball's opinion that, standing alone, neither a late switch to the tower frequency nor the fact that the crew received information about a fog bank when the aircraft was at 300 feet would adversely affect the chances for a safe landing. Finally, when Captain Ball was asked to assume that a crew experienced all of the above-described non-standard services on the same ILS approach, Captain Ball testified that he did not know whether, if taken together, these items would preclude a successful landing. Captain Ball did testify, however, that he considered that the combination would be an adverse factor for successful completion.\n\nEven assuming that the above-discussed items amounted to the provision of non-standard air traffic service, I do not find on the basis of Captain Ball's indecisive opinion that the proximate cause of this crash was the alleged negligence of ATC. In so ruling, I have in mind the testimony of the witnesses Roseborough and Burke, both of whom I believe, to the effect that none of these factors either alone or in any combination contributed to the occurrence of this crash.\n\nCaptain Ball's testimony was corroborated in almost all significant aspects by several other pilots who testified. Among them was Herlong Averett who was the assistant manager of flight training at Delta Air Lines from 1970 through mid-1974, and is now a line captain for Delta on a Lockheed L-1011. He corroborated Captain Ball's opinion that the PDI is a highly reliable instrument and that the crew of D 723 had enough training and information available to them from sources other than the flight director so that any malfunction of the flight director, for whatever reason, should have been immediately obvious to them.\n\nCaptain Averett also agreed with Captain Ball that a Delta pilot should have enough proficiency to execute a 45 degrees turn to intercept a localizer. It is clear from an examination of the approach plate for an ILS approach to 4-R that pilots of Delta DC-9 aircraft must be able to accomplish the published standard approach from the Millis holding pattern. As shown on that plate, a heading of 085 degrees is required. Thus an intercept angle of 50 degrees and a \"track\" \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\" or 50 degrees or greater depending upon wind conditions could be required. In fact, Captain Daniel, a Delta DC-9 pilot, testified that Delta's DC-9 pilots are required to perform as much as 90 degrees relative intercept angles at other airports.\n\nFinally, Captain Averett testified that he would not certify a pilot for flying if, upon testing, that pilot could not make an ILS approach from a position of one dot deviation from the center of the localizer and one dot from the center of the glide path.\n\nCaptain Daniel, a pilot fully qualified on the DC-9 and employed by Delta, corroborated the fact that as part of their training, all Delta pilots must have the ability to capture a glide slope from above and must display the ability to do so routinely during an ILS approach. I adopt as factual the testimony of Captain Daniel, corroborated by several other witnesses, that a pilot is perfectly free to reject any heading assigned to him by ATC if compliance would jeopardize the safety of the aircraft. Should a pilot decide to reject an assigned heading, he should notify the tower of his inability to comply and request an alternate heading.\n\nI find that when D 723 was given its final vector, the crew knew or should have known, by simple arithmetic, what its intercept angle would be. When Captain Streil acknowledged the vector he in effect represented to the ATC that he heard, understood and was able to carry out the instruction without any compromise to safety. The flight data recorder profile shows that D 723 intercepted the localizer course and acquired the center line of the course in a way that would not have indicated to ATC that any problem existed in using the assigned heading to capture the localizer.\n\nSubsequent to the accident, at the request and direction of his supervisors, Captain Daniel flew three simulator flights at the Delta training center in Atlanta, Georgia, in which he attempted to reconstruct the flight made by D 723 from Manchester to Logan. In the simulator he reproduced the same altitude, heading, air speeds, load, rate of descent, etc. actually used by D 723. Although in D 723 the approach work-load was coordinated among the crew members, Captain Daniel handled the three simulated flights alone, without the benefit of a copilot. On all three simulator runs, Captain Daniel was able to intercept the localizer at the 45 degrees angle, intercept the glide slope from above, successfully stabilize his flight, and successfully terminate his approach either by landing or by executing a missed approach.\n\nDuring the approach phase on one of the three simulator runs, Captain Daniel deliberately switched the flight director to the go-around mode as he attempted to make an ILS approach. In spite of the resulting misinformation he received from the flight director, he successfully executed a missed approach by using raw data. This evidence strongly corroborates Captain Ball's opinion that not switching to raw data was pilot error in the case of D 723.\n\nCaptain Everett C. Nix, manager of flight operations for Delta, testified that he has been with Delta since 1956 as second and first officer and Captain, and that he is rated on a number of commercial planes including the DC-9. He personally supervises 3100 pilots for Delta. His opinion was that in fact the graph of D 723's flight recorder indicated that the approach deviated significantly from the standards imposed by Delta on its own crews. I infer from this that the deviation was of sufficient magnitude to indicate to a non-negligent crew that a missed approach should be executed forthwith.\n\nHe further testified that Delta policy requires the aircraft to be in a stabilized position at DH. Lacking stabilization, he testified, the pilot should not continue the landing. Implicit in this Delta policy is the airline's requirement that its crews know when they are at DH, because this is the point at which they must determine whether their aircraft is stabilized, as well as whether they have made visual contact with the runway or its environment. I find that this particular crew did not know when or if they were at DH at any time during their final approach. The glide path records in evidence show that this aircraft was not in a stabilized position at the time it reached DH.\n\nAs to the issue of D 723's excessive rate of speed, Captain Nix testified that a normal descent rate for the final stages of an approach should have been 671 feet per minute, but that the records established that D 723's actual descent rate down to an altitude of 200 feet was about 750 feet per minute, and that thereafter until impact the descent rate was about 1100 feet per minute. From this he concluded that D 723's speed was excessive. He conceded that if the rate of speed called for by the approach plate for this runway had been maintained, D 723 would have reached the touchdown zone of the runway before impacting the ground. He, in substance, testified that on the basis of the record available, only manipulation of the controls by the crew could have so adversely affected the rate of D 723's descent.\n\nCaptain Nix also testified, and I find, that the instrumentation on D 723 provided the crew with sufficient information so as to enable them to determine their position at any time, and that Delta pilots are required to know where they are at all times on an approach. I find that this crew was unaware of their aircraft's location during critical stages of their final approach.\n\nCaptain Jack Roseborough is an airman certification expert for the FAA who has been flying for 36 years, during the last 10 of which he has been conducting proficiency checks of pilots and copilots who fly DC-9's on commercial airlines. He personally takes flight and ground school training, and has a proficiency check every six months. He has check-ridden DC-9 pilots for every major airline flying DC-9's except Hawaiian Air Lines. He has over 19,000 flying hours, 4,000 of which have been in the cockpit of a DC-9. I find him a qualified and truthful witness and I accept his opinion evidence as factual.\n\nCaptain Roseborough corroborated the opinion testimony of Captains Ball and Nix, that a trained pilot should always know his relative position and approximate distance from the airport prior to and during an approach. He testified, and I find, that on D 723's flight to Logan from Manchester its instruments would have indicated to the crew that the localizer was on their left as they continued south from Manchester, having already passed Logan on their left. Knowing the air speed was about 4 miles per minute, the non-flying pilot could have timed the number of seconds and minutes they continued south beyond the outer marker before being vectored to make the 180 degrees turn and head back toward Logan before the final approach. Captain Roseborough said that normally, given the heading of 080 degrees, a plane the weight of D 723 should have slowed down to about 160 knots. He also testified that if the pilot believed his aircraft was not ready or properly configured to begin an ILS approach he would not, at this point, ask ATC if he were cleared for final approach (as did Captain Streil), but would request authority to abandon that approach and request vectors for a new one.\n\nCaptain Roseborough testified that D 723 intercepted the localizer properly while on the published heading, and that the aircraft was thus in a good posture to continue the approach.\n\nThe flight profile indicated that from this point the aircraft then went into a course which produced a two dot deviation from the localizer. Captain Ball expressed the opinion, which I accept as factual, that this errant course was followed because of the failure of the D 723 crew to rely on the PDI which would have been telling them, had they followed it, \"hey, let's go to the right\" and because the crew instead was relying on the flight director which gave an indication that the crew should keep the aircraft on the course it was then following. Captain Roseborough also testified, and I find, that at this point the PDI was telling the crew to nose the aircraft down to intercept the glide slope, while the flight director was telling the crew to nose up the aircraft.\n\nIt was stipulated by Delta and the United States, but not the other plaintiffs, that the flight director was found set in or near to the \"go-around\" mode. It was also stipulated that none of the equipment or systems on this plane malfunctioned during this flight and there was deposition testimony that both Delta and Sperry found the flight director to be in good operable condition when salvaged from the wreckage.\n\nExhibit 35 establishes that Captain Streil was employed as a pilot for Northeast Airlines from 1950 until its merger with Delta, that First Officer Burrill was employed by Northeast Airlines from 1967 until the merger, and that Mr. Burrell was employed with Northeast Airlines from 1957 until he took a medical leave of absence in 1967. There was uncontroverted testimony that Northeast Airlines used Collins flight directors on its aircraft, on which the last position to the right was the \"approach\" mode, and that Delta uses Sperry flight directors on its aircraft where the \"approach\" mode is the second last position to the right and the \"go-around\" mode is the last position to the right. Having in mind the evidence that there was no malfunction of the flight director, the fact that both pilots were originally trained on the Collins equipment where the \"approach\" mode was located at the last snap to the right, the expert opinion that the flight director was misleading this crew, that the flight director was found close to or in the \"go-around\" mode, and that Mr. Hetterman, Delta's vice president of Technical Operations, testified that it was almost impossible to leave the mode switch in between two settings, I find that this crew inadvertently set the flight director to the last position to the right, the \"go-around\" mode, rather than to the \"approach\" mode.\n\nIn so finding, I rule that on the entire record it would appear more likely than not that this crew's persistence in following a course deviation of two dots or more from the localizer can be best explained rationally by the dual findings (1) that they set the flight director to the wrong mode, and (2) they negligently persisted in following the flight director's indications rather than depending upon the far more reliable information being supplied by the PDI.\n\nCaptain Roseborough corroborated the testimony of Captain Ball that once a DC-9 intercepts the localizer course, it can normally be stabilized on it in a matter of seconds. He also testified that within seconds of intercepting the localizer an experienced flight crew can normally discover a discrepancy between the flight director and the PDI and switch to the PDI if they are properly scanning their instruments.\n\nCaptain Roseborough testified that in his detailed examination of the record of this case, he found no facts or circumstances in the flight profile, the graphs as determined from the flight director, any of the testimony in open court (all of which he heard), in the Delta procedural manual, or in the CVR transcript which would excuse the crew of D 723 from maintaining the localizer center line and acquiring the glide slope center line at any time in this approach. In formulating this opinion, Captain Roseborough took into account both singly and in combination, the claimed breaches by ATC of paras. 1351, 1352 and 1360 of the Terminal Air Traffic Control Manual. He expressed the opinion that none of them alone or in combination were adequate to cause a crash.\n\nCaptain Roseborough, as well as several of the pilots who testified, including Captain Ball of Delta, mentioned a practice known to pilots as \"staying ahead of the plane.\" Generally, this concept relates to the rule-of-thumb requirement that a pilot be aware of the future consequences of his present manipulation of the aircraft's controls. Failure to anticipate the course of flight dictated by control adjustment results in the aircraft \"getting ahead of the pilot.\" All who testified on this subject stated that even when the aircraft \"gets ahead\" of the pilot on a final approach, a pilot should be able to recognize this perilous situation in time to execute a missed approach.\n\nKeith Chappell, the First Officer on EAL 572, also testified that a flight crew must stay ahead of the aircraft in order to successfully navigate it. He said that a pilot should try to project where his aircraft is going to be in the immediate future so that he can make appropriate compensations to fly the intended course. He expressed the opinion that the flight profile indicated to him that there were several places during this approach where a qualified pilot would be expected to exercise his command authority and execute a missed approach, e.g., the first time he realized he had come full scale to the left of the localizer somewhere beyond the two dot deviation; at the point when the instruments indicated that the aircraft had deviated below the glide slope; and also at DH if the aircraft then was not in a position from which a safe landing could be made or if the runway environment was not then visible.\n\nCaptain Roseborough testified that in his opinion none of the clearances, vectors, ATC communications, the lack or lateness thereof, taken alone or in combination, either caused or contributed to the causation of this accident. In so testifying he pointed out that all transmissions from ATC were promptly acknowledged by D 723 with no indication that any of them presented any problem to the crew of this aircraft (in which case it is clear as ruled above that they could have declined any instructions and requested new instructions).\n\nCaptain Roseborough also said that it was not normal procedure to increase the sink rate of the aircraft from 700 feet to 1200 feet per minute during the final 200 feet of the descent. The only explanation he could suggest for the crew making such a change in the rate of descent was letting their plane get out of control. He testified that the worst thing a pilot can do is to increase the sink rate at such a low altitude.\n\nFirst Officer Keith Chappell testified that his aircraft passed the outer marker that morning at some altitude in excess of 2000 feet, but nevertheless captured the glide slope from above and at a point inside the outer marker. He also testified that any pilot flying a DC-9 for Eastern is routinely expected to have the ability to intercept the localizer at a 50 degrees angle, even without assistance from ATC.\n\nI find this testimony of probative value in determining the standards of ability that may be reasonably required of a commercial DC-9 pilot.\n\nAfter examining the flight profile for D 723, Mr. Chappell testified that its approach was not stabilized with reference to the localizer or glide slope at any point from outside the outer marker to the point of impact. He further stated that the flight profile exhibited an approach that a qualified pilot would not have made with properly functioning equipment. (It was stipulated as indicated supra, that no equipment on D 723 malfunctioned on July 31, 1973.) He also testified that if a faulty flight director contributed in any way to the unstabilized approach, its information should have been ignored in favor of what was being shown by the PDI.\n\nHe expressed the opinion that neither the heading of 080 degrees given to D 723 by ATC, nor the fact that the aircraft had to capture the glide slope from above, could have caused either a two dot deviation from the prescribed course or the crash itself. Mr. Chappell concluded that had D 723 been flown properly, it would not have flown the two dot deviation course that was recorded, and further that a qualified pilot could have recaptured the localizer course even from a two dot deviation to the left, and still landed the plane safely while also capturing the glide slope from above.\n\nPlaintiffs called Roys C. Jones as a witness and through him sought to elicit opinion testimony as to the significance of the air traffic controller's issuing a vector to an approaching plane which could cause that plane to capture a glide slope from above and at a wide angle of intercept. I rule that Mr. Jones, who, I find, has never controlled traffic using radar equipment of the type in use today, and has never qualified as a DC-9 pilot, is not qualified to express an opinion of any probative value to this court on this subject. I further find of no probative value Jones' opinion that the controller's failure to instruct D 723 to switch to the tower frequency at an earlier time had a significant effect on the subsequent operation of that aircraft. For reasons which will be discussed more fully supra, I totally reject Mr. Jones' speculation as to the effect of the aberrations of AL 666 on Mr. Taylor's responsibilities. Lastly, as to the witness Jones, I give no weight to his opinion that the transmission made by the tower to D 723 at 1507:46 was distracting to the crew. On the contrary, I find it was a transmission relaying additional and more up-to-date information concerning weather that had not previously been given to this aircraft. I find that this information was relayed to D 723 as soon as practical and I rule that had the tower not sent this weather information to D 723 its failure to do so might well have been grounds for criticism.\n\nOne of the plaintiffs' principal allegations in support of their claim of ATC negligence is the contention that it was negligent for approach controller Taylor to issue a vector to D 723 which required it to intercept the localizer course at an angle in excess of 30 degrees. Plaintiffs contend that the issuance of this vector was negligent because it violates the provision in para. 1351 of the Terminal Air Traffic Control Manual directing that such vectors not require intercept angles in excess of 30 degrees.\n\nAs indicated supra, Runway 4-R at Logan is equipped with an ILS system which transmits a localizer beam in a direction of 035 degrees. The last vector given to D 723 was to intercept the localizer on a course of 080 degrees which produced a relative angle of intercept of 45 degrees. I find, first, that despite that manual's provision, ATC towers do not contain equipment sufficiently sophisticated to exactly measure for the controllers what the actual angle of intercept will be for a particular aircraft. As a practical matter, the measure of the actual track of the aircraft which appears as a target on the controller's radar scope and its relative angle to the localizer course can only be roughly approximated by the controllers while watching the movement of blips on their scopes.\n\nI find, second, on the basis of the Court's view of the TRACON room, which was taken on a day when VFR conditions prevailed, that the volume of traffic then being handled by the controllers was such as to make it obvious that controllers cannot devote as much time and attention to the computation of angles of intercept as plaintiffs would require them to do. It is equally clear that the volume of traffic requiring active supervision and assistance from ATC on a day when IFR conditions prevailed would be substantially heavier, particularly if those conditions necessitated the assigning of aircraft to the various holding patterns in the vicinity of the airport. Under such conditions, plaintiffs' contention would be still less tenable. Practical experience and human judgment still must play an important part in this presently inexact science of maintaining the separation of an ever growing number of aircraft.\n\nThere was ample testimony, which I believe, that it is acceptable and good practice for controllers to assign vectors to approaching aircraft based in large part on what the controller has observed preceding aircraft to have successfully accomplished without complaint or comment by the pilots of those other airplanes.\n\nI find that on July 31, 1973, prior to the time of D 723's approach, Mr. Taylor had vectored several other aircraft on the same approach course, that each of such aircraft was directed to intercept the localizer at an angle in excess of 30 degrees, that no complaints or comments on such vectors were made to Mr. Taylor, and that, in fact, one aircraft that very morning intercepted the localizer at an angle of 50 degrees with no apparent difficulty.\n\nIt is highly significant to note that the published ILS approach for Runway 4-R is depicted on a so-called \"approach plate\" (PX-11). It prescribes that from the area of the Millis holding pattern an aircraft making an approach to Runway 4-R follow a heading of 085 degrees and thus intercept the localizer at an angle of 50 degrees (or greater, depending on the prevailing wind). I further find that had traffic conditions resulted in D 723 being directed to hold at the Millis holding pattern that morning, its crew would have been required by federal regulations and the official approach plate to fly the published heading from Millis to Runway 4-R's localizer, and this would have required the flight to execute a 50 degrees angle of intercept rather than the 45 degrees angle complained of herein. See 14 C.F.R. 91.116(a) and 14 C.F.R. 97.10.\n\nThere is an abundance of testimony in the record from qualified pilots such as Captains Ball, Averett, Daniel, Nix and Roseborough, and Flight Officer Chappell, that DC-9 pilots should be able to routinely intercept localizers at angles in excess of 30 degrees without compromising the safety of their aircraft. Additionally, there is the testimony of Captain Daniel that Delta's DC-9 pilots routinely execute intercepts of localizers at an angle of 90 degrees at one of the airports serviced by Delta, and the further testimony from Flight Officer Chappell that Eastern Airlines expects its pilots to routinely handle intercepts at angles up to 90 degrees.\n\nIt is also significant to note that several pilots and air traffic controllers testified that although the responsibilities of the pilots and controllers are concurrent in many respects, nevertheless, the pilot in command has the direct responsibility for and is the final authority as to the operation of the aircraft. Necessarily, the pilot's knowledge of his own, his crew's, and his aircraft's capabilities and limitations, is of preeminent importance in this cooperative situation. None of these matters can be known by ATC. It is clear, and I find, that whenever ATC issues a vector, a direction or a clearance to a pilot, which in the pilot's judgment would jeopardize the safety of the aircraft and its occupants, that pilot has an absolute duty to reject same, to so inform ATC, and to request a new direction.\n\nAccordingly, on the basis of all of the above-described evidence I find that Mr. Taylor was not negligent in issuing a vector to D 723 requiring the intercept of the localizer course at an angle in excess of 30 degrees but less than that described on the ILS approach plate for Runway 4-R.\n\nIV. THE ALLEGHENY 666 SEPARATION PROBLEM\n\nIt is the position of the United States that the furnishing of weather information to D 723 was a third, not a first, priority matter for Controller Taylor within the provisions of para. 28 of the Terminal Air Traffic Control Manual (PX-9).\n\nThis contention is based on the fact that disseminating weather information is classified in para. 361 of that manual as \"Additional Service,\" and that para. 28 specifically makes additional service items third priority. The United States contends, all ATC personnel testified, and I find, that separation of aircraft is, in fact, a first priority obligation of ATC.\n\nThe United States alleges that the presence of AL 666 at the locations and altitudes established by the record constituted a first priority separation emergency. Mr. Taylor testified that he was very concerned about that particular flight and its potential impact on other traffic from the time it first reported to him at 1502:25 (5 minutes and 40 seconds before the time D 723 crashed) until at least 1509:22 (one minute and 17 seconds after the crash).\n\nTaylor testified, and I find, that the Air Traffic Center had directed AL 666 to go to the Millis holding pattern at an assigned altitude of 9000 feet, but AL 666 first contacted him at 1502:25 and reported its altitude to be 8000 feet at the Millis holding pattern. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\" Taylor immediately realized that he had a potential crisis on his hands because he already knew that EAL 1020 was also assigned to the Millis holding pattern at an altitude of 8000 feet. Taylor in his approximately twenty years as an air traffic controller never had encountered a situation in which two aircraft were in the same holding pattern at the same altitude. He decided to immediately remove EAL 1020 from the holding pattern and to instruct AL 666 to maintain the heading of 220 degrees on which it was then flying. The record is not clear as to exactly where either plane was vis-a-vis the normal holding pattern or vis-a-vis each other. It appears more likely so than not that EAL 1020 was following AL 666 as both planes flew the holding pattern in the same direction.\n\nTaylor instructed EAL 1020 to go to a heading of 070 degrees and make a left turn, which it did. Taking EAL 1020 out of the Millis holding pattern on the heading of 070 degrees caused Taylor to advance the estimated time for its approach clearance by approximately 8 minutes. He had previously given EAL 1020 an estimated landing time of about 1515, but at 1504 he instructed EAL 1020 to intercept the localizer course then, which it did at some point outside the Randolph intersection. At 1507 he cleared EAL 1020 to land and instructed it to continue its descent to an altitude of 2000 feet.\n\nI find that the foregoing did not exhaust Mr. Taylor's legitimate concern with the shenanigans of AL 666. Having dealt with one problem created by AL 666, his continued concern was properly a first priority item for him.\n\nPlaintiffs' Exhibit 32, which includes a transcript of communications between Taylor and AL 666, establishes that after vectoring EAL 1020 out of the holding pattern at 1502:36 he was far from finished with, and was still concerned about and occupied with, potential separation problems posed by Al 666. In fact, he sent an instruction to it at 1502:53 to continue its present heading in the holding pattern. At 1503:28 he instructed AL 666 to reverse course, proceed to the Millis intersection, and hold. This was acknowledged at 1503:32 by AL 666. At 1503:34 Taylor asked AL 666 to identify for him, which AL 666 did at 1503:37. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\"\n\nAt 1505:19 (about one and one-half minutes later) Taylor tried to verify that AL 666 had remained at 8000 feet as directed. He got no response to that inquiry. He inquired again at 1505:25, at 1505:29, at 1505:34 and at 1505:46. He received a response from AL 666 at 1505:50, repeated his question as to its altitude at 1505:51, received an unintelligible response from AL 666 at 1505:54, requested a repeat of the answer at 1505:55, got a second unintelligible response at 1505:57, put the question again at 1505:58 and, finally, got an answer from AL 666 verifying the 8000 altitude at 1506:02. He was asked by AL 666 for information as to approach clearance at 1506:04 and he responded at 1506:07, one minute and 58 seconds before the crash. Taylor then cleared D 723 to land and directed it to switch to the tower frequency at 1507:14. I find that concern over AL 666 caused the delay by Taylor in clearing D 723 and in ordering it to switch to tower frequency. D 723 reported to the tower at 1507:43. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\"\n\nTaylor testified, and I find, that while all of the foregoing activity was going on he observed on his radar scope that AL 666 had overshot the Millis intersection by approximately two miles and that it was proceeding in a northerly direction toward a space reserved for departing aircraft. He testified that this necessitated his alerting the departure controller of the course being flown by AL 666 to insure that the departure controller would maintain a separation between AL 666 and any departing aircraft in the airspace under his jurisdiction. After taking this precaution he then contacted AL 666 with instructions to reverse and return to Millis. In all, AL 666 wandered in a northerly direction approximately seven miles away from the holding pattern area.\n\nTaylor further testified that when he first observed AL 666 overshooting the holding pattern he believed that it would not continue off course as far beyond Millis as it in fact did, but that it would discover its own error and reverse its course when two or three miles out from the holding point.\n\nIt has been stipulated that between 1447 and 1514, Taylor was handling the approaches of the following aircraft:\n\nEXEC 1349\n\nTWA 288\n\nTWA 552\n\nDELTA 723\n\nWINNEPESAUKEE 304\n\nEXEC 1343\n\nEASTERN 1020\n\nPILGRIM 152\n\nALLEGHENY 666\n\nDELTA 986\n\nALLEGHENY 952\n\nAMERICAN 832\n\nAMERICAN 238\n\nNOVEMBER 731 WHISKEY\n\nOn the basis of the foregoing summary of the evidence relating to AL 666, I find that AL 666 was of legitimate concern to Controller Taylor from 1502 to 1509, and that it constituted an emergency situation within the meaning of the Terminal Air Traffic Control Manual. In view of AL 666's erratic performance that morning, I further find that maintaining its separation from other aircraft was a first priority item for Mr. Taylor which clearly overrode any obligation he might otherwise have had to perform the third priority additional service of transmitting weather information to D 723.\n\nI find that in light of the potential hazards caused by AL 666, Mr. Taylor's attention was appropriately focused on concentrated communication efforts with that and other aircraft, coordination efforts with other controllers concerning intended routes for other approaching aircraft, the sequence of aircraft being vectored to their approach courses, and the avoidance of potential conflicts with departing aircraft.\n\nV. THE LATE LANDING CLEARANCE GIVEN TO D 723\n\nPlaintiffs contend that ATC was negligent in issuing non-standard, confusing and distracting radio communications during the final phase of the approach. This contention is based on the transcripts of communications among approach control (AC), local control (LC), and D 723. The communications relevant to plaintiffs' contention occurred between 1505:39 and 1507:52. They read as follows:\n\n1505:39 D 723: Ah -- is seven two three cleared the ILS\n\n1505:41 AC: Yes, seven two three is cleared for the ILS, yes\n\n1505:43 D 723: All righty\n\n* * *\n\n1507:14 AC: Delta seven two three is cleared to land. Tower one nineteen one\n\n1507:17 D 723: Seven two three\n\n1507:43 D 723: And Boston tower Delta seven two three final\n\n1507:45.5 LC: Cleared to land four right traffic's clearin' at the end, the RVR shows more than six thousand and a fog bank's movin' in, it's pretty heavy across the approach end\n\n1507:52 D 723: Seven two three\n\nCaptain Ball testified that if this aircraft had stabilized on both the localizer and the glide slope at 1507:45 he did not think that the communication from the tower which began then would cause it to crash. He also testified that standing alone the lateness of the instruction from approach controller Taylor to D 723 directing it to switch to tower frequency would not cause the aircraft to crash. He had the same opinion as to the fact that the approach controller did not instruct D 723 to switch to tower frequency prior to its reaching the outer marker. Captain Ball also testified that, while it would be unusual to receive a clearance to land from an approach controller without being told to switch to tower frequency, he would have switched to the tower frequency if it had happened to him when making an approach.\n\nCaptain Ball specifically testified that switching to tower frequency inside the outer marker would not adversely affect a successful landing, nor would receiving news about the existence of a fog bank when the aircraft had descended to an altitude of 300 feet. He did express the opinion that conversing with the tower in a late stage of the landing would be a distracting factor, but he frankly conceded, \"I don't know how much effect that had on the tardiness with which the go-around procedure was instituted, if in fact it was.\"\n\nCapt. Ball also conceded that the change in radio frequency at 1507:14 had nothing to do with any course deviations which had occurred up to that time, and that he would not expect D 723's angle of intercept, in combination with the instruction to contact the tower frequency when outside the outer marker, would cause the plane to crash. He specifically said,\n\n\"I don't think any of those three things in and of themselves would necessarily cause any great alarm, but there were other factors in this and each one contributed its share. What that share is I am unable to say.\"\n\nFirst Officer Keith Chappell of Eastern Airlines testified that even if his plane were down as low as 400 feet in the course of an approach, he would prefer that the controllers relay any change in weather information which has come to their knowledge, rather than that they not relay it. He expressed the opinion that receiving information about a fog bank when as low as 400 feet would not cause a crash.\n\nMr. Roseborough expressed the opinion that a qualified DC-9 crew \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\" would not be distracted by the transmissions which are in evidence in this case as part of the CVR transcript. He testified that nothing in evidence, in his opinion, including the allegedly late transmissions, either alone or in combination with the other factors complained of, would excuse a pilot from maintaining a stabilized position on the center lines of the localizer and the glide slope during the approach. He said the name of the game is \"missed approach,\" if the pilot has any problem at any time prior to, or even after passing through, DH.\n\nEdmund Burke, a self-employed consultant in air traffic control matters, whose expert testimony I find credible, testified, and I find, that there is nothing unusual about the issuance of a clearance to land to an aircraft which has passed inside the outer marker. He also testified that the issuance of a clearance by the local controller at 1507:45.5 was reasonable because at that time the local controller was not sure that his earlier request to approach control to issue that clearance had, in fact, been complied with. Burke said that what the local controller was actually doing was double-checking, out of an abundance of caution, rather than acting carelessly.\n\nMr. Burke testified, and I find, that this transmission at 1507:45.5, which lasted 3 1/2 seconds, had no adverse effect on the situation, but merely repeated the earlier clearance issued by approach control. He further testified that none of the transmissions or lack of transmissions from the control tower, or the timing thereof, individually or in combination, in any way caused or contributed to the crash of D 723. I find this testimony to be factual.\n\nI reject the opinion of the witness Roys Jones to the effect that lateness in the instruction to switch to tower frequency had a significant effect on the operation of this aircraft. I find that Jones is lacking in sufficient experience with the DC-9, or any other commercial passenger-carrying jet aircraft, to make his opinion in the matter of any probative value. I also reject his opinion that the transmission at 1507:45.5 was distracting to the crew, and I accept the testimony of First Officer Chappell and other qualified witnesses to the effect that it was preferable for the tower to make, rather than not make, this transmission, because it was sending updated weather information to D 723 which should have alerted the crew to consider the possibility that a missed approach might become immediately necessary.\n\nCapt. Daniel of Delta Air Lines merely expressed the opinion that it was unusual for a pilot to receive his clearance to land and instructions to switch to tower frequency as late in the approach as did this particular flight. His testimony did not address either negligence or causation and I rule it of no probative value on this issue.\n\nDaniel E. Tucker, who has been with FAA for sixteen years and is currently on ATC team supervisor at Logan Airport, testified that, for a variety of reasons, it is a common occurrence for incoming planes not to be directed to switch over to the tower frequency. He also said that many times a landing clearance is given to an incoming aircraft by approach rather than local control, if, for any reason, the aircraft was late in switching over to the tower frequency. His testimony corroborated that of Mr. Keepers to the effect that the situation which obtains in the control tower is not compartmentalized, that each controller is aware of what other controllers are doing, and that there is considerable cooperation, coordination, and interchange among controllers.\n\nJeoffrey McDonald, an ATC specialist who has worked all positions in the Logan tower, testified that on July 31, 1973 he began working the local control position a few minutes before the accident. He testified that normally he directs an incoming plane to switch to tower frequency when it is approaching the outer marker, but he made it clear that the position of the approaching aircraft at the time he orders a frequency switch-over will vary according to prevailing circumstances. He does not automatically order it to do so at the outer marker.\n\nTwo or three minutes before the accident the following exchange took place between local controller (LC) McDonald and EAL 572:\n\n1505:37 LC: Eastern 572's cleared to land on runway 4 right.\n\n1505:40 EAL 572: Cleared to land, 572\n\n1505:42 LC: 572, the fog's movin' back in from the south across the airport now it's just approaching runway 4 right, your RVR for 4 right is showing more than 6000\n\n1505:52 EAL 572: 572\n\n1507:10 LC: Eastern 572 ah all the way to the end with a left turn off, cross runway four left hold short of 15 right inbound, remain on my frequency, there's traffic a mile final behind you\n\n1507:11 EAL 572: All the way to the end and hold short of four left\n\n1507:12 LC: Ah you can cross that runway hold short of 15 right, remain with me\n\n1507:27 EAL 572: All right.\n\nMcDonald testified that he saw EAL 572 on Taxiway November before he told D 723 \"clear to land.\" This would put EAL 572 as having landed and rolled to the end of 4-R prior to 1507:46. The last transmission from EAL 572, which appeared to come while it was in the air, was at 1505:52.\n\nThe foregoing establishes that EAL 572 landed between 1505:52 and 1507:10, probably some time after 1506 and before 1507, i. e., somewhere between 1 minute and 5 seconds and 2 minutes and five seconds before D 723 impacted.\n\nMcDonald testified that, while it is not normal for someone other than the local controller to issue a clearance, it does happen from time to time. He also testified that occasionally a landing plane will switch from tower to ground control frequency without being instructed to do so. He elaborated on this point and testified that while it is not \"normal,\" on occasion an aircraft is not instructed to switch frequency until within a mile or two of the airport on its ILS approach. He further advised that he has seen aircraft land successfully which had changed frequencies as little as 40 seconds before touchdown. (D 723 was told to change frequencies one minute and five seconds prior to impacting.)\n\nMcDonald also testified that he never had a pilot complain to him about receiving an order to make a late change of frequency and, finally, he testified that he gave both EAL 572 and D 723 the identical information about fog and RVR, and that both acknowledged the message without comment or complaint.\n\nOn the basis of the pilot testimony of Capt. Ball, First Officer Chappell, and FAA check pilot Roseborough, as well as on the basis of the testimony of Mr. Burke and Controllers Tucker and McDonald, all of whom I find to be credible and qualified witnesses, I find that there was no causal relationship between the timing of various transmissions from the controllers to D 723 and its crash. In so finding I have considered the timing of those transmissions, particularly the clearances to land, alone and in combination with the other factors complained of by plaintiffs.\n\nVI. AUTHORITIES RELIED ON BY PLAINTIFFS\n\nIn its memorandum of law Delta argues, (pp. 19, 20):\n\n\"The argument advanced by the United States in this litigation . . . is that the United States cannot be held responsible for proximately causing an aircraft crash since the pilot has final authority for his aircraft. This has been characterized as the 'sole responsibility' theory. This argument has been repeatedly rejected by the courts as contrary to reason and common experience.\n\n\"The courts have instead consistently found a duty of concurrent responsibility of the aircraft pilot and the air traffic controllers. Therefore, innumerable cases have held the United States liable, through the negligence of its air traffic controllers, for proximately causing aircraft crashes despite concurrent negligence on the part of the pilot.\"\n\nIn support of this argument, plaintiffs cite 11 cases, apparently for the proposition that the United States has been held liable because of the negligence of its air traffic controllers, notwithstanding the fact that pilots and/or crews were also found to have been negligent in the operation of their aircraft. Viewing the proposition plaintiffs assert, in this way, it may be generally stated that the cases cited are, at best, factually distinguishable from the instant case and, at worst, inapposite.\n\nA. Cases in Which There Was No Pilot or Crew Negligence Found.\n\nIn order for the cases cited to support the proposition, there must, initially, be a finding that both the crew of the aircraft and ATC were negligent. A case would be inapposite, then, if it contained no finding of air crew negligence. The following cases fall into this category and are, therefore, inapposite and warrant no further discussion:\n\nAllegheny Airlines, Inc. v. United States, 504 F.2d 104 (7 Cir. 1974), cert. den. 421 U.S. 978, 95 S. Ct. 1979, 44 L. Ed. 2d 470 (1975)\n\nYates v. United States, 497 F.2d 878 (10 Cir. 1974)\n\nHartz v. United States, 387 F.2d 870 (5 Cir. 1968)\n\nOzark Air Lines, Inc. v. Delta Air Lines, Inc., 402 F. Supp. 687 (N.D.Ill. 1975)\n\nDeWeese v. United States, 419 F. Supp. 147, 13 Av. Cas. (CCH) P17,486 (D.Colo. 1974)\n\nFikejs v. Lickteig, 13 Av. Cas. (CCH) P17,657 (D.Kan. 1975)\n\nGill v. United States, 429 F.2d 1072 (5 Cir. 1970)\n\nB. Cases Which are Factually Distinguishable from the Instant Case.\n\n1. Stork v. United States, 430 F.2d 1104 (9 Cir. 1970)\n\nStork involved the crash of a commercial jet during a take-off in extremely foggy conditions. The visibility at take-off was officially reported as \"zero in fog.\" Under these conditions the take-off was absolutely and totally prohibited by FAA regulations, and this prohibition was known to the pilots and the ATC alike.\n\nIn spite of this, the pilot of the aircraft taxied away from the gate and was cleared to take-off by ATC. The crash was caused by the lack of visibility which made it difficult to control the so-called \"take-off role.\" The court held that the failure of ATC to advise the pilot of the extraordinary circumstance that the visibility was under FAA minimums for a legal take-off constituted a breach of duty on the part of the controller that proximately caused the crash.\n\nStork is thus distinguishable from the instant case because in Stork there was a finding that take-off clearance should not have been given without a warning about the visibility, and that the take-off clearance alone was a \"reliable official invitation to proceed.\" However, the landing clearance given D 723 in the instant case did not constitute a reliable official invitation to proceed, given the pilot's duty and discretion at the DH. See footnote 10 supra. In Stork the court expressly found the situation to be one in which there was no room for the exercise of judgment by anyone. In the instant case there was ample opportunity for the exercise of pilot judgment.\n\n2. Todd v. United States, 384 F. Supp. 1284 (M.D.Fla. 1975)\n\nIn this case the pilot of a small private plane crashed into the side of an Alabama mountain in IFR conditions while descending on an approach to an airport that was still 15 miles away. The court found that the pilot and the United States, through ATC, were concurrently negligent. Under Alabama law, contributory negligence is a bar to claims of simple negligence, but is no defense if wilful or wanton negligence is proven. The court found that such a degree of negligence could not be attributed to ATC on the facts of the case. The court found that the pilot failed to properly prepare his flight plan, failed to carry the proper sectional charts showing terrain elevations, and failed to plan for alternate landing places, and that these failures to follow FAA regulations, coupled with his reckless descent in IFR conditions in known mountainous terrain without communicating his intentions to ATC, constituted negligence and was a proximate cause of the crash.\n\nIn spite of this finding of pilot negligence, the court nonetheless found that the Government was negligent, and that its negligence also was a proximate cause of the crash. The ATC handling the approach of plaintiff's plane, it was held, gave clearances that were not reasonably designed to insure the safety of the flight. The clearances were negligent in that the controller did not know the plane's exact position when the clearances were given, and in that the controller failed to warn the pilot that he was in the vicinity of mountains obscured by weather and could not safely descend at his own discretion. The Government thus was also found negligent, even though, as the court noted, the presence of the potential danger should have been equally obvious to the pilot had he been exercising due care.\n\nA clearance indicating the pilot is to \"maintain\" a certain altitude means that the pilot has no discretion to climb or to descend. A clearance indicating the pilot is to \"cruise\" at a certain altitude gives him discretion to climb or descend from the indicated altitude. In Todd, the court found that the \"cruise 4000\" clearance given the plaintiff by the controller, indicating as it did that the pilot could descend at his discretion, given in highly adverse weather conditions without determining the plane's exact position over mountainous terrain, was negligence by the controller. In effect, the clearance issued by the controller gave the pilot discretion he should not have had under the circumstances. In this respect Todd is distinguishable from the case at bar. In the instant case the ATC handling of D 723 to the point of DH was not negligent. The pilot of D 723 had the discretion at DH to execute a missed approach, and no clearance or order of any kind given by ATC denied him the opportunity to exercise that discretion safely.\n\n3. Dickens v. United States, 378 F. Supp. 845 (S.D.Texas 1974)\n\nThis case involved the crash of a small private plane during what appeared to be an attempted go-around following an aborted landing in good weather. The pilot, who held an instrument rating and was licensed for the aircraft, had a total of only 60 hours of pilot time in the plane.\n\nThe aircraft was cleared to land on a runway that intersected another runway upon which, unknown to the plaintiff, a large commercial jet had landed just minutes before. In a reconstruction of the accident, eyewitness testimony established that the plaintiff's plane while at an altitude of about 15 feet with its landing gear up, suddenly lurched to an altitude of about 100 feet, commenced a sharp turn to the right and crashed. Expert and eyewitness testimony accepted by the court established that the pilot hit an area of wake turbulence caused by the large jet. Simultaneously, a warning horn triggered by plaintiff's negligent failure to lower his landing gear sounded in the cockpit.\n\nThe court found that the accident was proximately caused by the negligent failure of the air traffic controller to warn the plaintiff that he might encounter wake turbulence, and by the plaintiff's panic upon hearing the landing gear warning horn simultaneously with encountering the wake turbulence.\n\nThe Dickens case is distinguishable from the case at bar in that the basis of ATC negligence there was a failure to warn of a hazard known to the controller but unknown to and unknowable by the pilot. In the case at bar, the possible hazard to landing caused by sea fog was a condition known to the pilot and the crew of D 723.\n\n4. Ingham v. Eastern Airlines, Inc., 373 F.2d 227 (2 Cir. 1967), cert. den. 389 U.S. 931, 88 S. Ct. 295, 19 L. Ed. 2d 292 (1967)\n\nThis case involved the crash of a large commercial aircraft (a DC-7B) during the attempted execution of a missed approach. The trial court found that the crew of the Eastern plane and the United States, through its ATC, were concurrently negligent, and that the negligence of both constituted the proximate cause of the crash.\n\nThe Eastern crew was found to have been negligent in continuing its approach after losing alignment with the runway, and in performing the missed approach maneuver in a negligent manner. The Government was found to have breached its duty to report accurately current and changing weather conditions to the crew under the then prevailing FAA Air Traffic Control Procedures Manual, which made it mandatory that \"necessary\" weather information be communicated to the crew \"as soon as possible.\"\n\nThere are several significant factors that were present in Ingham which supported a finding of ATC negligence, which have not been established by a preponderance of the evidence in this case.\n\nThe Ingham court found that at approximately 9:32.49, the coordinator in the radar room (who was in charge of disseminating weather information to approach controllers) announced that the visibility at the airport had dropped from the previously reported one mile to 3/4 of a mile in fog. At 9:33.57, the approach controller working the ill-fated Eastern flight reported the visibility to the crew of that plane as being \"one mile with fog.\" This erroneous report, which formed the basis of the finding of ATC negligence, was the last weather report to reach the Eastern flight before it crashed 12 minutes later at approximately 9:45.\n\n\"Necessary\" information under the FAA manual then in effect was defined by the court as any change \"which, under all the circumstances, the crew would have considered important both in determining whether to attempt a landing, and in preparing for the weather conditions most likely to be encountered near the runway.\" 373 F.2d at 235.\n\nThe court found that although this 1/4 mile drop in visibility did not bring the visibility below the Eastern flight's required minimum of 1/2 mile, it nonetheless constituted \"necessary\" information which had to be reported under the manual provisions.\n\nCritical, of course, to the court's findings that the drop in visibility should have been reported by the controller were the findings that, (1) a change in the weather had in fact occurred; (2) the change was observed; (3) the change was of such a nature that it should have indicated to the controller that the Eastern flight \"might well encounter less than minimum visibility upon reaching the runway;\" and (4) under the manual provisions the change was the sort of \"necessary\" information which had to be reported to approaching aircraft as soon as possible.\n\nWith regard to the third item mentioned above, the court found that a vast amount of \"supplemental\" information was known to the controller, which information should have indicated to him that the weather conditions were \"deteriorating seriously,\" and that the 3/4 mile visibility figure might not truly reflect the conditions an incoming pilot would encounter. 373 F.2d at 235. The court reached this conclusion even while assuming that none of the supplemental information itself was required to be reported to the crew of the Eastern flight. Among the supplemental items of information that the controller had in Ingham prior to the crash of the Eastern plane were the following:\n\n1. A report of the Weather Bureau observer that the visibility on the ground was 1/4 mile (which was 1/4 less than the Eastern flight's required minimum visibility);\n\n2. A report of the same observer of \"increasing obscuration;\"\n\n3. Reports from other pilots of \"considerable difficulty in take-offs and landings;\" and\n\n4. The fact that several missed approaches had been executed shortly before the Eastern flight's ill-fated approach.\n\nIn Ingham it was found that the transmissometer had become inoperable earlier that evening due to a mechanical failure. Incredibly, the court then partially premised a finding of ATC negligence on ATC's failing to rely on the RVR reading given by this concededly inoperative equipment. The Ingham court found that at the very least the surface visibility readings as reported by the United States Weather Bureau, \" should have made it plain \" to the controller that the one mile visibility figure which had been reported to the crew was deceptive, and that more current information was \"necessary.\" No such finding can be made in the instant case. Here, the plaintiffs have failed to show by a preponderance of the evidence that any employees of the United States charged with the particular duty were:\n\n(1) negligent in their observations of weather conditions at the airport generally or, in particular, in the vicinity of runway 4R; or\n\n(2) negligent in the reporting of such conditions or changes in such conditions as are required by the regulations to be reported in an appropriate manner to air traffic controllers, and thence to incoming aircraft.\n\nPlaintiffs have also failed to prove by a preponderance of the evidence that a significant change in the weather had occurred between the last weather transmission to Delta and the time of the crash. On the basis of testimony of the expert weather observer, Mr. Terban, and a number of other witnesses, this Court finds that no significant change in the prevailing weather occurred, at least at any time soon enough before the crash to make the non-transmission thereof negligence on the part of ATC.\n\nAdditionally, the instant case is distinguishable because the RVR readings at all critical times coming from a properly functioning transmissometer (as distinguished from the malfunctioning transmissometer involved in Ingham) reported visibility well in excess of the 2400 foot minimum for Runway 4-R.\n\nStill another factor which serves to distinguish the Ingham case from the case at bar is the minimum altitude at which a safe missed approach could be executed by the aircraft involved.\n\nIn Ingham the evidence before the court on this issue came from Eastern's own witnesses who testified that it was possible to execute a missed approach from an altitude as low as 50 feet. The evidence before the court in Ingham in this regard differs substantially from the evidence before the court in the instant case because, here, the evidence establishes that both aircraft and crew were capable of and expected to be able to successfully and safely execute a missed approach from any altitude, including after touchdown.\n\nIn short, the preponderance of the evidence in the case at bar established that the crew of D 723 had accurate and complete weather information prior to and during the course of their approach. By exercising due care in discharging their obligation at DH to \"observe and judge the actual effect of the weather on the plane's landing approach,\" Ingham v. Eastern Airlines, Inc., supra, at 237, they could have made either a safe landing or a safe go-around. There is no credible evidence in this record that any conduct on the part of ATC was a proximate cause of their failure to do so.\n\nVII. CONCLUSION\n\nThe plaintiffs have the burden of proving by a fair preponderance of the credible evidence that a duty of care to them existed on the part of ATC, that ATC negligently breached that duty, and that such breach was, in whole or in part, a proximate cause of the crash.\n\nOn all the credible evidence I find that plaintiffs have failed to sustain their burden. I rule that plaintiffs have not proven by a preponderance either that ATC personnel were negligent or that the conduct of ATC, however characterized, was a proximate cause of the crash either in whole or in any part.\n\nI find that the sole and exclusive cause of the accident was the negligence of the pilot and copilot of D 723.\n\nJudgment will enter for the defendant United States in all cases.\n\nAPPENDIX\n\n[SEE ILLUSTRATION IN ORIGINAL]\n\nCONSOLIDATED CASES\n\nDelta Air Lines, Inc. v. United States, C.A. 75-3159 and C.A. 75-5184.\n\nHelen M. Hall v. Delta Air Lines, Inc. v. United States, C.A. 74-2154-C.\n\nJohn D. Richards v. Delta Air Lines, Inc. v. United States, C.A. 74-2155-C.\n\nRichard Warren Young v. Delta Air Lines, Inc. v. United States, C.A. 74-2156-C.\n\nEdward G. Boyle, Jr., et al. v. Delta Air Lines, Inc. v. United States, C.A. 74-2157-C.\n\nBarbara L. Thompson v. Delta Air Lines, Inc. v. United States, C.A. 74-2328-C.\n\nMartina M. Metz v. Delta Air Lines, Inc. v. United States, C.A. 74-2329-C.\n\nNancy Lee Hanna v. Delta Air Lines, Inc. v. United States, C.A. 74-2330-C.\n\nMartha S. Cameron v. Delta Air Lines, Inc. v. United States, C.A. 74-2331-C.\n\nAletha G. Hubbell v. Delta Air Lines, Inc. v. United States, C.A. 74-2332-C.\n\nAndrea L. Holzacheiter v. Delta Air Lines, Inc. v. United States, C.A. 74-2335-C.\n\nJames Hoag v. Delta Air Lines, Inc. v. United States, C.A. 74-2336-C.\n\nLyn D. Cummings v. Delta Air Lines, Inc. v. United States, C.A. 74-2337-C.\n\nSusan A. Knapp v. Delta Air Lines, Inc. v. United States, C.A. 74-2338-C.\n\nThe Howard Bank, Executor of Estate of Marion L. Smith v. Delta Air Lines, Inc. v. United States, C.A. 74-2339-C.\n\nThomas P. Gosselin v. Delta Air Lines, Inc. v. United States, C.A. 74-2341-C.\n\nBrenda J. Theriault v. Delta Air Lines, Inc. v. United States, C.A. 74-2342-C.\n\nBetty Prescott, Admx. of Estate of Thomasina Muscato v. Delta Air Lines, Inc. v. United States, C.A. 74-2343-C.\n\nGary Vallencourt and Annette Vallencourt v. Delta Air Lines, Inc. v. United States, C.A. 74-2344-C.\n\nVivian H. Brau, et al. v. Delta Air Lines, Inc., et al. v. United States, C.A. 74-4527-C.\n\nJuanita M. Kester v. Delta Air Lines, Inc. v. United States, C.A. 74-2944-C.\n\nAnn G. D'Arcy, et al. v. Delta Air Lines, Inc. v. United States, C.A. 74-4086-C.\n\nShirley Ann McKibben Penney, et al. v. Delta Air Lines, Inc., et al. v. United States, C.A. 73-3897-C.\n\nPatricia A. Longchamp, et al. v. Delta Air Lines, Inc., et al. v. United States, C.A. 73-3898-C.\n\nKaren Haelsig McMaster v. Delta Air Lines, Inc., et al. v. United States, C.A. 74-1815-C.\n\nKaren Haelsig McMaster v. Delta Air Lines, Inc., et al. v. United States, C.A. 74-1816-C.\n\nCarol W. MacArthur, et al. v. Delta Air Lines, Inc. v. United States, C.A. 74-2149-C.\n\nBayard W. Kennett v. Delta Air Lines, Inc. v. United States, C.A. 74-2150-C.\n\nDorothy C. Ruane v. Delta Air Lines, Inc. v. United States, C.A. 74-2151-C.\n\nJames D. Warren, Jr. v. Delta Air Lines, Inc. v. United States, C.A. 74-2152-C.\n\nArthur A. Smith v. Delta Air Lines, Inc. v. United States, C.A. 74-2153-C.\n\nDiane B. Coveny and Philip Brothman v. Delta Air Lines, Inc. v. United States, C.A. 74-4248-C.\n\nPatrick J. Frawley, Jr. v. Delta Air Lines, et al. v. United States, C.A. 74-5465-C.\n\nFrances A. Burrell v. United States, C.A. 74-5499-C.\n\nHenry B. Carey, et al. v. Delta Air Lines, et al. v. United States, C.A. 74-5711-C.\n\nSusan I. Burrill v. United States, C.A. 75-1419-C.\n\nRichard F. Humphreys v. United States, C.A. 75-2110-C.\n\nMr. and Mrs. John H. Wilson v. United States, C.A. 75-2440-C.\n\nBette J. Gaines, et al. v. Delta Airlines, Inc., et al. v. United States, C.A. 75-3515-C.\n\nVirginia A. Striel v. United States, C.A. 75-4803-C.\n\nRonald Moore and Charlotte Estes v. United States, C.A. 76-459-C.\n\nHelen M. Hall, Admx. of Estate of Clarence R. Hall v. United States, C.A. 74-1836-C.\n\nC. David Bassett v. Delta Air Lines, Inc. v. United States, C.A. 74-2327-C.\n\nArthur D. Barnett v. Delta Air Lines, Inc. v. United States, C.A. 74-2333-C.\n\nRonaldo Provost v. Delta Air Lines, Inc. v. United States, C.A. 74-2334-C.\n\nH. Jordan Bean v. United States, C.A. 75-4860-C.\n\nJoan Aliapoulios v. United States, C.A. 75-4861-C.\n\nMarla J. Bailey v. United States, C.A. 76-0463-C.\n\n\u003cspan class=\"fn\"\u003e1. Control tower records and transmissions between the tower and various aircraft are expressed in terms of Greenwich Mean Time (GMT). 10:00 a.m. Eastern Daylight Savings Time appears in the exhibits as 1400 GMT; 11:00 a.m. appears in the exhibits as 1500 GMT.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The Instrument Landing System (ILS) is a system in the aircraft which provides the lateral, longitudinal, and vertical guidance necessary for a landing. The ground equipment consists of two highly directional transmitting systems and, along the approach, three (or fewer) marker beacons. The directional transmitters are known as the localizer and glide slope transmitters. The system may be divided functionally into three parts: (1) Guidance information-localizer, glide slope, (2) Range information-marker beacons, and (3) Visual information-approach lights, touchdown and center line lights, and runway lights.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Runways are numbered by reference to the heading expressed in degrees which their center line runs as compared to true north. Runway 4-R at Logan Airport has a center line 4 2/5 from true north.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The displaced threshold is designated on the approach charts for Runway 4-R as being a point located a distance of 2507 feet from the approach end of the runway. This is the nearest point to the approach end at which an aircraft using this runway may touch down on that runway when making a landing when visual flight rules (VFR) apply. The ILS touchdown point is 3660 feet up the runway from the approach end thereof. This is the earliest point at which an aircraft may touch down for its landing when making an approach when instrument flight rules (IFR) apply.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The cockpit voice recorder (CVR) is a device located within the cockpit of the airplane which makes a record of intra-cockpit conversations between the various members of the flight crew as well as radio transmissions to and from the aircraft. The cockpit voice recorder was salvaged from the wreckage and a tape of the contents thereof, as well as a transcript of the tape are in evidence. In making its findings of fact, the Court has used the transcript of the conversations recorded by the CVR (PX 18). ** See Appendix hereto, a composite of several exhibits which separately establish the headings, air speeds and altitudes flown by D 723, which indicates by means of two separate graphs the aircraft's deviation from the center line of the localizer course and from the path of the glide slope in the final minutes of its approach to Runway 4-R. The Appendix also sets forth the transcript of conversations within the cockpit and between D 723 and the control tower.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The Terminal Air Traffic Control Manual is a document promulgated by the Federal Aviation Administration for use by controllers in ATC towers at airports. It is in evidence as PX 9. Paragraph 1 thereof states its purpose as follows: 1. PURPOSE. This handbook prescribes air traffic control procedures and phraseology for use by personnel providing terminal air traffic control services. It is one of the air traffic control manuals referred to in Part 65 of the Federal Aviation Regulations. Controllers are required to be familiar with the provisions of this handbook which pertain to their operational responsibility and to exercise their best judgment if they encounter situations not covered by it. (Emphasis added.) Plaintiffs' theory is that compliance with certain paragraphs of this manual was mandatory on the part of the controllers, particularly paras. 1351, 1352 and 1360. However, para. 28 of the manual, captioned \"Duty Priority,\" provides as follows: 28. DUTY PRIORITY Give first priority to separation of aircraft as required in this manual. Give second priority to services that are required but do not involve separation of aircraft. Give third priority to additional services to the extent possible. Paragraphs 1351, 1352 and 1360 read as follows: 1351. FINAL APPROACH COURSE INTERCEPTION Except as provided in 1352 and 1362, vector aircraft to intercept final approach course before reaching the approach gate and, if a precision approach is to be made, before intercepting the glide slope. Use information from the accompanying table as a guide to determine the maximum interception angles when vectoring aircraft to intercept a final approach course. 1352. VECTORS TO LOCALIZER COURSE Whenever the reported weather is below the basic VFR minima, or upon pilot request, vector aircraft to intercept the localizer course at least 2 miles from the approach gate and at an altitude not above the glide slope. 1360. ARRIVAL INSTRUCTIONS Issue all of the following to an aircraft before it reaches the approach gate: a. Position relative to the final approach fix. If the final approach fix is not portrayed on the radar display or if none is prescribed in the procedure, issue position information relative to the navigation aid which provides final approach guidance or relative to the airport. b. Vector to intercept the final approach course, if required. c. Approach clearance, except when conducting a radar approach. If terrain or traffic does not permit unrestricted descent to lowest published altitude specified in approach procedure prior to final approach descent, controllers shall: (1) Defer issuance of approach clearance until there are no restrictions, or (2) Issue altitude restrictions with approach clearance specifying when or at what point unrestricted descent can be made. d. Instructions to do one of the following: (1) Monitor local control frequency, reporting to the tower when over the approach fix. (2) Contact the tower on local control frequency. (3) Contact tower on local control frequency. (3) Contact the final controller on the appropriate frequency if final approach guidance will be provided on a different frequency. (4) When radar is used to establish final approach fix -- inform the pilot that after being advised that he is over the fix, he is to contact the tower on local control frequency. The word \"vector\" as used in these paragraphs, and as used throughout the testimony of the various witnesses, is defined on page 13 of the manual as \"a heading issued to an aircraft to provide navigational guidance by radar.\" A \"heading\" is a course to be followed which is described in terms of degrees of the compass.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The Localizer is an electronic beam which is located approximately on the center line of a runway. It runs parallel with the runway and is projected out from the approach end of the runway for a number of miles by an electronic transmitter. The localizer for Runway 4-R extended outward from the approach end of that runway approximately 35 miles. Commercial airplanes are equipped with electronic instrumentation which allows them to \"intercept\" the localizer beam, i.e., receive it on a radio receiver, and align the plane on the center thereof by maneuvering its path while in flight. Instruments in the cockpit indicate to the pilot whether or not he is properly aligned, i. e., centered on, the localizer course. If the aircraft is centered on the localizer, it is following a course in flight which will bring it in to the runway at the intended touchdown point.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Approach Gate is a reference to a point farther away from the beginning of the runway than the so-called \"outer marker.\" The outer marker is a fixed electronic or radio beam which transmits a signal upward from a known point on the ground. The approach gate is defined in the manual as that point in the final approach course which is one mile from the approach fix on the side away from the airport or five miles from the landing threshold. For Runway 4-R this would be a point one mile southeast of the outer marker which, in turn, is 5.3 nautical miles from the airport. Thus, the approach gate for 4-R is 6.3 nautical miles from the approach end of the runway. For Runway 4-R at Logan Airport, the outer marker is located in Milton, Massachusetts, 5.3 miles distant from the end of the runway. It transmits the Morse Code signal for BO, the first two letters of Boston. D 723 was equipped with electronic instrumentation so that when it flew over the outer marker the Morse Code signal for the letters BO was audible to the crew in the cockpit, and the fact that it was audible appears in PX 18, the transcript of the CVR, which establishes that D 723 flew over the outer marker on the day of the crash at 1455:20, at which point the Captain observed, \"Boston outer marker, it's identified,\" and the copilot responded, \"Thank you.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The Glide Slope is another electronic aid to navigation, consisting of an electronic beam which is projected outward and upward from the approach end of Runway 4-R at an angle of 3 degrees. Commercial airplanes (including D 723) are equipped with electronic instrumentation which allows the interception of a glide slope and the aligning of the aircraft therewith as it makes its descent to the intended runway. If the plane is maneuvered so as to maintain proper alignment with the glide slope, the instrumentation on the instrument panel before both the pilot and the copilot tells them that they are centered, or \"stabilized,\" on the glide slope as well as on the localizer course described in footnote 7. Maintaining the aircraft in such stabilized position will cause it to touch ground at the intended point on the runway.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. An Approach Clearance is a transmission from an air traffic controller designated \"approach controller\" to an incoming aircraft advising the pilot in command that he is authorized to use a particular runway at that time. The clearance amounts to an instruction that no other planes are so located as to interfere with that pilot's flying down on to the particular runway, and also indicates that the runway is clear of obstruction, such as taxiing aircraft, supply trucks, automobiles, etc. The issuance of a clearance is a grant of permission to use the runway, but does not require the pilot to actually land on that runway. The ultimate authority for making the decision to land or go-around rests with the pilot. (See footnote 12.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. There are three different positions in a control tower at a busy metropolitan airport such as Logan, which, at different points in time, become involved in giving instructions to an incoming aircraft. The three positions are called approach control, local control and ground control. As an incoming airplane nears the airport at which it intends to land, it first comes within the jurisdiction of an approach controller, who receives notice from an air traffic center of that particular aircraft's presence, its altitude and its air speed. The approach controller issues instructions to the incoming plane as to what course to follow as it nears the airport in the course of its descent for landing. The approach controller or controllers establish a sequence for the landing of various incoming aircraft, and when a particular aircraft's turn is reached it is instructed to change its radio frequency from that on which the approach controller transmits to that on which the local controller transmits. The local controller's frequency is normally called \"tower frequency.\" Instructions may be given to the aircraft for the final leg or stages of landing by the local controller, including final clearance or authorization to land. After the plane has landed, made its run-out and turned on to a taxiway, it is told to switch to ground control frequency and the ground controller directs the aircraft toward the terminal where it will discharge its passengers or cargo.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Decision height (DH) is a predetermined altitude established with reference to a particular runway. It is an altitude at which the captain in command of an incoming plane must exercise his command authority and decide whether or not he can safely complete the landing in progress. On July 31, 1973 the established DH for Runway 4-R was an altitude of 216 feet.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. A Missed Approach describes a procedure which a pilot who has been cleared for landing elects to follow if he decides that the aircraft cannot be safely landed under then prevailing conditions. There term reflects a deliberate choice by the pilot not to complete a landing but, rather, to \"go around again.\" For each runway there is in existence a document called an \"approach plate,\" which is an air navigational map for use by pilots effectuating a landing on that particular runway. The approach plate for Runway 4-R at Logan is in evidence as PX 10. It describes the procedure to be followed by a pilot who elects to execute a missed approach rather than to complete a landing on 4-R. Briefly stated, that procedure is to pull up, climb to 3000 feet and go to a point on the map designated as the Danvers intersection, where a so-called \"holding pattern\" is to be flown until the pilot receives further instructions from ATC or, alternatively, elects to divert his flight to some other airport.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. IFR means Instrument Flight Rules. These rules become effective when weather conditions are below the minimum under VFR, Visual Flight Rules. The acronyms IFR and VFR are accepted aviation terminology used to distinguish between two types of flying. If a plane has the necessary instruments to operate under IFR conditions, it is called IFR-equipped, and if a pilot has been qualified to fly the plane by such instruments in IFR weather he is called \"instrument rated.\" Only an instrument-rated pilot may make an IFR flight and then only in an IFR-equipped aircraft. Normally, IFR flights must be flown at altitudes and on airways assigned by air traffic control. A pilot proposing to fly an IFR flight must first file with and obtain approval from air traffic control of an IFR flight plan. This requirement is predicated on the obvious fact that various aircraft flying under IFR conditions frequently are in such low visibility as to preclude their ability to see each other. Consequently they depend on instructions from FAA centers and control towers to insure their separation and avoidance of midair collisions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The Transmissometer consists of two pieces of electronic equipment situated on the ground at a point 692 feet to the side of the center line of Runway 4-R and 397 feet from the displaced threshold thereof. The displaced threshold is the nearest point to the approach end of the runway on which an airplane may touchdown and then only if operating under VFR rules. Runway 4-R has a total length of 10,000 feet, 7493 feet of which extend beyond the displaced threshold and 6340 feet of which extend beyond the touchdown point to be used when a plane is landing on an ILS approach. See footnote 4. One part of the transmissometer system emits a beam of light which is received and measured by the second component of the system. Approximately every 52 seconds this device relays to the control tower a reading as to the number of feet of visibility along the runway in the vicinity of which the transmissometer is located. The purpose of this reading is to give an incoming pilot some idea of the visibility at ground level along the runway on which he expects to touchdown his aircraft. It does not establish the nature or extent of the \"slant\" vision available to an incoming pilot. Cf. footnote 17.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The RVR system consists of two electronic components of the transmissometer located near and along the course of a runway. Approximately every 52 seconds the device sends to the air traffic controllers a readout called the Runway Visual Range. This purports to reflect the visibility along the surface of the runway. This readout is transmitted by the controllers to all approaching aircraft, and if the RVR reading is less than 2400 feet, applicable regulations do not permit the pilot to begin an approach. However if an approach has begun and the aircraft has passed inside of the outer marker, even if the pilot learns thereafter that the RVR has dropped below 2400 feet, he may continue the approach at least to DH. Cf. footnote 15.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Slant View is the visibility available to a pilot as he looks toward the runway while on the final descent for his landing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. TRACON is an acronym for Terminal Radar Approach Control. It is used synonymously with the expression \"radar room.\" The controllers who work in this room do their work on the basis of what they see on large radar screens. They do not have visual contact with the outside. They identify the location of airplanes by following the \"blip\" or \"target\" made on the radar screen by that particular aircraft. Each such \"blip\" has a \"data block\" adjacent to it which moves with the \"blip.\" A computer automatically prints out in the data block that aircraft's flight number and all changes in its air speed and altitude.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The local controller and the ground controller work in a glass-enclosed room called the \"cab,\" which affords them, absent darkness or fog, an opportunity to visually observe incoming and outgoing traffic at the airport. These persons also have available to them two-way radios for communication with the air traffic under their control and large radar screens on which incoming and outgoing traffic is visible and identified. Cabs are normally located at the top of the control tower.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. An Air Traffic Center is an FAA radar facility which assigns altitudes and vectors (headings) to aircraft in areas in between and beyond the jurisdiction of the control towers of the various airports. The Center which \"hands off\" the major portion of the traffic approaching Logan is located at Nashua, New Hampshire.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. A nautical mile contains 6020.2 feet, in contrast to a statute mile which contains 5280 feet. Nautical miles per hour may be computed by multiplying statute miles per hour by 1.15.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Air traffic control service is defined by the Terminal Air Traffic Control Manual to mean: \"A service provided for the purpose of promoting the safe, orderly, and expeditious flow of air traffic including airport, approach, and en route air traffic control service.\" (PX 9, para. 23, p. 6).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. When a pilot is \"rated\" for a particular aircraft this means that he has passed FAA proficiency tests and is licensed to fly commercial passengers in this particular type of aircraft.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The Flight Director is a computerized instrument which may be set to one of five available positions or \"modes,\" depending on which maneuver the pilot intends to perform with the assistance of that equipment. The mode selector for a flight director is a rotating ball switch. On the Sperry flight director, used on D 723, the position furthest to the left is \"SB\" or standby. The next position, to the right, is marked \"BL,\" or \"Blue Left,\" which is used for back course approaches. The third position is \"FI,\" or \"Flight Instruments.\" The next position is VOR/LOC, which is a navigation position, which may be used to tie the flight director into radio signals received from the ground, either from a VOR station or a localizer station. The next position, to the right, is the \"APP,\" or \"Approach Position,\" which is usually selected after the interception of the localizer at or near an airport's outer marker. The final position is the \"G/A\" or \"Go-Around\" position.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The elements cited by Delta were: (1) having been given an angle of intercept greater than 30 degrees; (2) having been given a vector that would cause the aircraft to intercept the glide slope from above; (3) not having received information from ATC as to the aircraft's position relative to the approach gate; and (4) not having been directed to switch to tower (local) frequency prior to reaching the outer marker.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The word \"track\" was used by the ATC witnesses to refer to the way that an aircraft appears from the radar screen to travel across known ground areas.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. A \"holding pattern\" is a course flown by an aircraft at a \"holding point.\" A \"holding point\" is an electronic beam emanating from a point identified on an air navigation map or chart. A holding pattern flown at a holding point consists of the aircraft's following an oval or racetrack-shaped course consisting of two straight \"legs\", each of which is flown in an opposite direction for a period of one minute, as well as two 180 degrees turns. Each turn is made at the rate of 3 degrees per second and each turn consumes one minute. It takes four minutes to fly a conventional holding pattern.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. When requested to \"squawk\" its identification, a pilot, by pushing a button, can send a message to the computer in the control tower which causes the letters \"ID\" to flash several times on the data block adjacent to the radar blip which represents that aircraft.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. In so finding, I reject the opinion testimony of plaintiffs' witness Frank M. McDermott, an aviation consultant and a former employee of the FAA, that AL 666 was not a problem or a matter of concern to Mr. Taylor after he vectored EAL 1020 out of the holding pattern at 1506. Because I find Mr. McDermott to be a highly partisan witness with a strong, clear and pronounced bias against the FAA, I do not credit any of his testimony.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The following background information as to the pilot, copilot and jump seat occupant was stipulated: Captain Streil and First Officer Burrill had flown all of their scheduled flights together during the month of July 1973. Captain John N. Streil, aged 49, held an Airline Transport Pilot Certificate, with an Airplane Multi-Engine Land rating. He held type ratings in the DC-3, 6, 7, and 9; the B-727; the Convair 240, 340, 440, 880 and 990; and the Vicker Viscount. He had a first-class medical certificate dated June 15, 1973, with the limitation that he possess correcting glasses for near vision while exercising privileges of his airman certification. He was employed by Northeast Airlines on June 19, 1950 and first qualified as a Pilot-in-Command on July 3, 1956. He received a type rating on the DC-9 on May 5, 1970. On the date of the accident he had a total flight time of approximately 14,840 hours, of which 1457 were in the DC-9. He last completed a proficiency check on June 25, 1973, a line check on June 18, 1973, and recurrent ground training on April 19 and 20, 1973. In the last three-year period he satisfactorily completed all training requirements without rechecks or repeats. First Officer Sideny W. Burrill, aged 31, held a Commercial Airplane Certificate with airplane single-engine land, sea and instrument ratings. He held a first-class medical certificate dated March 12, 1973, with no limitations. He became an employee of Northeast on January 3, 1967, and was upgraded to first officer on the B-727 in December 1968. On February 11, 1973 he completed initial training on the DC-9 and was assigned as a first officer on Delta's approved routes. As of the day of the accident he had a total of 6994 flight hours, 217 of which were in the DC-9. He had completed his last proficiency check in the B-727 on October 27, 1972 and his last flight engineer line check on April 16, 1972, and recurrent ground training on October 16, 1972. Over the prior three years he had completed satisfactorily all required training. Joseph E. Burrell, aged 52, held an Airline Transport Pilot certificate with an Airplane Multi-Engine Land rating. He held type ratings in the DC-3 and V-745. His first-class medical certificate was dated April 19, 1973 with no limitations. He had about 14,000 hours of civilian plus 3000 hours of military flight time. He was first employed by Northeast on June 17, 1957 and received a medical leave of absence on June 22, 1967. At that time he was qualified as Second-in-Command on the Convair 880 and Pilot-in-Command on the DC-3. He remained on medical leave until May 26, 1973 and returned to the payroll of Delta, as successor of Northeast, on May 27, 1973. He began initial DC-9 ground school training on May 28, 1973 and failed to complete a written examination on June 8, 1973. He again attended DC-9 initial ground school training from June 11 through June 22, 1973 and satisfactorily completed it. On June 23, Burrell received instruction in the procedure trainer at the Delta Air Lines Flight Training Center in Atlanta, Georgia. He began DC-9 simulator training on June 24, 1973, and by July 24 had received 24 hours of instruction and 12 hours of observing. On July 29 he was given an evaluation flight of three hours in a DC-9 aircraft. This evaluation flight resulted in a decision to allow him to ride on DC-9 flights for the purpose of familiarization. He was authorized to occupy the jump seat of a DC-9 only as an observer. It should be noted that despite Captain Streil's vastly greater experience in piloting a DC-9, he elected to have the less experienced copilot handle the controls during this attempted ILS landing in obviously marginal weather. At the opening of the trial the parties stipulated that the aircraft was being flown by First Officer Burrill.\u003c/span\u003e\n\n",
    "body_length": 154313,
    "citedas": [
      "412 F. Supp. 959"
    ],
    "attorneys": "Michael J. Pangia, Trial Atty., Torts Section, Aviation Unit, Civil Div., Dept. of Justice, Washington, District of Columbia, Elliott S. Marks, Federal Aviation Administration, Washington, District of Columbia, for the United States. , George N. Tompkins, Jr., Raymond W. Belair, Stephen J. Fearon, Condon \u0026 Forsyth, New York, New York, for Delta Air Lines, Inc. , Michael B. Latti, Alan R. Hoffman, Kaplan, Latti \u0026 Flannery, Boston, Massachusetts, for various individual plaintiffs. Caffrey, Chief Judge.",
    "category": [
      "3",
      "8"
    ],
    "judges": "CAFFREY, Chief Judge.",
    "citation_count": 1
  }
}
