{
  "id": "5a4WS2YBTlTomsSBgmcs",
  "document": {
    "title": "05/16/86 MAUD STERLING v. FRED WILLIAM BLOOM DALE",
    "full_title": "MAUD STERLING v. FRED WILLIAM BLOOM; DALE E. MARTIN; ELBERT SHRUM, DBA SEVEN MILE LOUNGE; XYZ BUSINESS ENTITIES; AND RICHARD L. LASH, DBA N.J.L. AND STATE OF IDAHO, BOARD OF CORRECTIONS",
    "jurisdiction": "Idaho Supreme Court",
    "date": "1986-05-16T00:00:00.000Z",
    "docket": "No. 15875",
    "body": "I.\n\nThis case calls on us in compelling fashion to re-examine certain provisions of the Idaho Tort Claims Act, I.C. § 6-901, et seq. A review of the facts illustrates the case's compelling nature.\n\nThe district court decided this case on a motion for judgment on the pleadings. On a motion for judgment on the pleadings pursuant to I.R.C.P. 12(c), the moving party admits all the allegations of the opposing party's pleadings and concomitantly admits the untruth of its own allegations which its adversary has denied. See, e.g., Davenport v. Burke, 27 Idaho 464, 473, 149 P. 511, 515 (1915). Sterling's allegations, deemed admitted by the State of Idaho's motion, are as summarized:\n\nOn June 30, 1982, an automobile operated by defendant Bloom turned into and struck the motorcycle operated by appellant Sterling. At the time of the accident Bloom's blood alcohol content was .23 percent by weight.\n\nThe collision caused Sterling extensive injuries, including (1) severe physical, mental and emotional injuries including massive brain trauma, (2) continuing physical pain, mental and emotional anguish, permanent injury and disability including loss of memory, loss of certain brain functions, disfigurement, and humiliation, (3) medical expenses amounting to at least $50,000, (4) future medical expenses in amounts yet to be determined, (5) lost wages of at least $30,000, (6) lost future wages in amounts yet to be determined, and (7) property damage to her motorcycle, helmet, and clothing in the amount of at least $300.\n\nLess than a year prior to the collision, Bloom had pled guilty to a felony charge of operating a motor vehicle while under the influence of intoxicating liquor in violation of I.C. § 49-1102. For this conviction,\n\nhis third for driving under the influence, on October 21, 1981, Bloom was sentenced to serve a five-year term. Execution of sentence was suspended, and for five years Bloom was placed on probation. Bloom was placed under legal custody and control of the Director of Probation and Parole of the State of Idaho Board of Corrections. A special condition of probation was that for the first year of that probation Bloom was not to drive a motor vehicle except for employment purposes.\n\nOn the same day of sentencing, Bloom executed a written Agreement of Probation with the Board. This agreement provided, among other things, that Bloom would \"respect and obey all laws,\" report on a monthly basis to the probation officer, and would not purchase or operate a motor vehicle without written permission from the Court or Probation Department. Ronald T. Housely, an employee of the Board, became Bloom's supervisor.\n\nThe Board, including but not limited to its employee Housely, acted negligently in its supervision of Bloom in at least the following particulars: (1) allowing Bloom to drive a motor vehicle for nonemployment purposes, contrary to the order of probation; (2) allowing Bloom to operate a motor vehicle without the required written permission, contrary to the agreement of probation, (3) allowing Bloom to operate an uninsured motor vehicle in violation of I.C. § 49-235, contrary to the agreement of probation, (4) allowing Bloom to reside in the same building which housed the Seven Mile Lounge, and to work there as a bartender, (5) failing to require Bloom to report on a regular basis to his supervising probation officer contrary to agreement of probation, and failing to otherwise supervise his activities; (6) failing to initiate proceedings to revoke Bloom's probation despite the fact that Bloom had failed and/or refused to comply with the order of probation and the agreement of probation on numerous occasions prior to the collision; and (7) failing to act reasonably and prudently under the circumstances despite having knowledge that Bloom had been convicted at least on two prior occasions of operating a motor vehicle while under the influence of intoxicating beverages and hence posed a great threat to the safety of the public unless adequately supervised.\n\nEach and all of those foregoing negligent acts and omissions of the Board were proximate causes of the collision and plaintiff Maude Sterling's damages.\n\nThe district court, in granting the State of Idaho's motion for judgment on the pleadings, applied the holdings of Dunbar v. United Steelworkers of America, 100 Idaho 523, 602 P.2d 21, (1979), cert. denied 446 U.S. 983, 100 S.Ct. 2963, 64 L.Ed.2d 839 (1980), and Chandler Supply Co., Inc. v. City of Boise, 104 Idaho 480, 660 P.2d 1323 (1983), and held the Board immune from liability under the Idaho Tort Claims Act on the bases that (1) in the private sector there is no \"parallel function\" to that of the Board; and (2) even if there were, the Board was engaged in a discretionary function. We will review each of these holdings in turn after first setting the stage.\n\nII.\n\nA. Standards of Construction and Review.\n\nThe Idaho legislature's adoption of the Idaho Tort Claims Act (Idaho Act), 1971 Idaho Sess.Laws ch. 150, §§ 1-31, p. 743, has been observed to be patterned largely on the Federal Tort Claims Act (Federal Act), 28 U.S.C. §§ 1346(b), 2671-2680 (1976 \u0026 Supp. V. 1981). Dunbar, 100 Idaho at 530, 602 P.2d at 28. \"A statute which is adopted from another jurisdiction will be presumed to be adopted with the prior construction placed upon it by the courts of such other jurisdiction.\" Nixon v. Tribes, 100 Idaho 198, 200, 595 P.2d 1093, 1095 (1979), quoted in Odenwalt v. Zaring, 102 Idaho 1, 5, 624 P.2d 383, 387 (1981); see also Doe v. Durtschi, 110 Idaho 466, 472 n. 2, 716 P.2d 1238, 1244 n. 2 (1986); and Dunbar, supra, 100 Idaho at 530, 602 P.2d at 28.\n\nConsequently, we look with particular interest to pre-1971 federal case law in our pursuit of the legislature's intent.\n\nThe Idaho Tort Claims Act provides:\n\n6-903. Liability of governmental entities -- Defense of employees. -- (a) Except as otherwise provided in this act, every governmental entity is subject to liability for money damages arising out of its negligent or otherwise wrongful acts or omissions and those of its employees acting within the course and scope of their employment or duties, whether arising out of a governmental or proprietary function, where the governmental entity if a private person or entity would be liable for money damages under the laws of the state of Idaho, provided that the governmental entity is subject to liability only for the pro rata share of the total damages awarded in favor of a claimant which is attributable to the negligent or otherwise wrongful acts or omissions of the governmental entity or its employees. (Emphasis added.)\n\nThe similar provisions of the Federal Tort Claims Act (the first jurisdictional in nature) in pertinent part are:\n\n28 U.S.C. § 1346. . . (b) Subject to the provisions of chapter 171 of this title, the district courts, . . . shall have exclusive jurisdiction of civil actions on claims against the United States, for money damages, accruing on and after January 1, 1945, for injury or loss of property, or personal injury or death caused by the negligent or wrongful act or omission of any employee of the Government while acting within the scope of his office or employment, under circumstances where the United States, if a private person, would be liable to the claimant in accordance with the law of the place where the act or omission occurred. (Emphasis added.)\n\n28 U.S.C. § 2674 The United States shall be liable . . . in the same manner and to the same extent as a private individual under like circumstances. . . .\n\nThis case involves the above provisions and the so-called \"discretionary function\" exceptions to liability. That exception is found in the following sections of the Idaho and Federal Acts:\n\nI.C. § 6-904. Exceptions to governmental liability. -- A governmental entity and its employees while acting within the course and scope of their employment and without malice or criminal intent shall not be liable for any claim which:\n\n(1) Arises out of any act or omission of an employee of the governmental entity exercising ordinary care, in reliance upon or the execution or performance of a statutory or regulatory function, whether or not the statute or regulation be valid, or based upon the exercise or performance or the failure to exercise or perform a discretionary function or duty on the part of a governmental entity or employee thereof, whether or not the discretion be abused.\n\n28 U.S.C. § 2680 The provisions of this chapter and section 1346(b) of this title shall not apply to --\n\n(a) Any claim based upon an act or omission of an employee of the Government, exercising due care, in the execution of a statute or regulation, whether or not such statute or regulation be valid, or based upon the exercise or performance or the failure to exercise or perform a discretionary function or duty on the part of a federal agency or an employee of the Government, whether or not the discretion involved be abused.\n\nThe purpose of both acts is to provide \"much-needed relief to those suffering injury from the negligence of government employees.\" United States v. Muniz, 374 U.S. 150, 165, 83 S.Ct. 1850, 1859, 10 L.Ed.2d 805 (1963). Idaho's act is to be construed \"liberally\" and \"'with a view to accomplishing [its] aims and purposes, and attaining substantial Justice. . . .'\" Farber v. State, 102 Idaho 398, 402, 630 P.2d 685, 689 (1981), quoting Keenan v. Price, 68 Idaho 423, 438, 195 P.2d 662, 670 (1948); see also Idaho Const., art. 1, § 18; I.C. § 73-102(1).\n\nConsistent with such purposes, the Idaho Act makes liability the rule with certain\n\nspecific exceptions. Durtschi, supra, 110 Idaho at 471, 716 P.2d at 1243; Richards v. United States, 369 U.S. 1, 6, 82 S.Ct. 585, 589, 7 L.Ed.2d 492 (1962); Jackson v. City of Kansas City, 235 Kan. 278, 680 P.2d 877, 886 (1984); Jones v. State Highway Comm'n, 557 S.W.2d 225, 230 (Mo.1977); Ramos v. County of Madera, 4 Cal.3d 685, 94 Cal.Rptr. 421, 484 P.2d 93, 98 (Cal.1971). \"There is no justification for this Court to read exemptions into the Act beyond those provided by [the legislature].\" Rayonier, Inc. v. United States, 352 U.S. 315, 320, 77 S.Ct. 374, 377, 1 L.Ed.2d 354 (1957), quoted in Muniz, supra, 374 U.S. at 166, 83 S.Ct. at 1859. Those exceptions which are expressly stated must be closely construed. Kosak v. United States, 465 U.S. 848, 104 S.Ct. 1519, 1523 n. 9, 79 L.Ed.2d 860 (1984) (\"We think that the proper objective of a court attempting to construe one of the subsections of 28 U.S.C. § 2680 [exceptions to the Federal Act] is to identify 'those circumstances which are within the words and reason of the exception' -- no less and no more. [ Quoting Dalehite v. United States, 346 U.S. 15, 31, 73 S.Ct. 956, 965, 97 L.Ed. 1427 (1953).] [Citations omitted.]\"\n\nB. The \"Parallel Function\" Test.\n\nThe district court held that the probation officer in charge of Bloom was immune from Sterling's claim, because no \"parallel function\" to that of a probation officer existed in the private sector. R., Vol. 2, pp. 117-18; id. at 118 (\"Thus the Court holds that the parallel functions test has not been met in the case at bar since there is no private prison and parole system in the state.\"). This implied exception first surfaced in Dunbar, supra. Although Dunbar and two succeeding cases appeared to find such an exception within the confines of the so-called \"discretionary function\" exception to the Idaho Act, I.C. § 6-904(1),[Footnote 1] the Board argues and this Court, in Chandler, supra, 104 Idaho at 482, 660 P.2d at 1325, has held that the actual source for this implied exception is I.C. § 6-903(a), which we requote for the sake of convenience:\n\nLiability of governmental entities -- Defense of employees. -- (a) Except as otherwise provided in this act, every governmental entity is subject to liability for money damages arising out of its negligent or otherwise wrongful acts or omissions and those of its employees acting within the course and scope of their employment or duties, whether arising out of a governmental or proprietary function, where the governmental entity if a private person or entity would be\n\nliable for money damages under the laws of the state of Idaho, provided that the governmental entity is subject to liability only for the pro rata share of the total damages awarded in favor of a claimant which is attributable to the negligent or otherwise wrongful acts or omissions of the governmental entity or its employees. (Emphasis added.)\n\nHowever, no opinion from this Court has ever attempted to explain how the parallel function test is derived from the language of this subsection. See Chandler, supra, 104 Idaho at 482, 660 P.2d at 1325 (states only that the test \"was an application of I.C. § 6-903(a) which waives sovereign immunity 'if a private person or entity would be liable for money damages. . . .'\") (emphasis added); Dunbar, supra, 100 Idaho at 546, 602 P.2d at 44 (test stated without direct reference to any statutory language). Nor has any opinion from this Court previously recognized or examined the pre-1971 federal case law which dealt directly and definitively with similar federal provisions, 28 U.S.C. §§ 1346(b) and 2674,[Footnote 2] and with the same purported implied exception. See, e.g., Indian Towing, supra. With great force and persuasiveness, counsel for Sterling earnestly urges that this Court now conduct a considered examination and ascertain if there is any supportable basis for the \"parallel function\" test.[Footnote 3] We respond to that supplication.\n\nThe parallel function test of Dunbar was stated as follows:\n\n[W]herein tort liability would attach to a private person, a governmental entity engaging in the same conduct will be liable. We do not ascertain an intent to create a new cause of action against a governmental entity for its attempts to govern. . . .\n\nHere we are faced with claims against the government related to the governmental function of governing. There are not parallel functions in the private sector. Dunbar, supra, 100 Idaho at 546, 602 P.2d at 44.\n\nAs one commentator has pointed out, this construction of I.C. § 6-903(a) created a parallel function requirement where none exists in the plain language of the statute. A. Hall, Sovereign Immunity and Re-emergence of the Governmental/Proprietary Distinction: A Setback in Idaho's Governmental Liability Law, 20 Idaho L.Rev. 197, 231-32 (1984) (footnotes omitted). The statute says nothing about a \"governmental function of governing,\" with automatic immunity attaching to such functions. Nothing in the statute mandates comparison between the underlying roles or functions of the government and roles or functions found in the private sector. Nor does the statute require that private individuals must engage in the same conduct in which the government engages for the government to be potentially liable. The statute says that if a private person would be liable for the misconduct alleged against the government, regardless of whether the private individuals ordinarily fill the same underlying function or role of the government, so will be the government. In other words, if a cause of action would lie against a private individual, it will also lie against the government. A straightforward application of the language of § 6-903(a) to the instant facts would be as follows: the government is potentially liable \"if a private person or entity would be liable for money damages under the laws of the state of Idaho\" for the negligent supervision of a third person who is or should be known to be dangerous, which negligence foreseeably results in and proximately causes harm to the injured party. I.C. § 6-903(a).\n\nNot only is this the more straightforward application, it is the application made of similar language in the Federal Act by the United States Supreme Court beginning in 1955, in place in 1971, and continuing on up to the present time. Prior to 1955, the Supreme Court had held that the Federal Act did not subject the government to liability \"arising from acts of a governmental nature or function.\" Dalehite, supra, 346 U.S. at 28, 73 S.Ct. at 964. The Court there read the language of 28 U.S.C. § 2674 -- limiting liability to \"the same manner and to the same extent as a private individual under like circumstances\" -- to require an analogous or parallel function between the public and private sectors. Dalehite, supra, 346 U.S. at 43-44, 73 S.Ct. at 972. Relying on language found in Feres v. United States, 340 U.S. 135, 71 S.Ct. 153, 95 L.Ed. 152 (1950) (involved military personnel suing the government), the Court concluded that because the firefighting activities of the Coast Guard had no parallel in the private sector, it followed that the government was immune from claims based on alleged negligence in firefighting. Dalehite, supra, 346 U.S. at 44, 73 S.Ct. at 972.\n\nHowever, this rationale of Dalehite was specifically overruled in subsequent cases. In Indian Towing, supra, the government conceded that its operation of a lighthouse was not a discretionary function, but argued that the language \"imposing liability 'in the same manner and to the same extent as a private individual under like circumstances * * *' must be read as excluding liability in the performance of activities which private persons do not perform. Thus, [the government continued to argue] there would be no liability for negligent performance of 'uniquely governmental functions.'\" Indian Towing, supra, 351 U.S. at 64, 76 S.Ct. at 124, cited with approval in Chief Justice Donaldson's Dissent in Chandler, supra, 104 Idaho at 488, 660 P.2d at 1331.\n\nClearly, there is no difference between this proposed exception to liability for \"uniquely governmental functions\" and the exception posed in Dunbar for \"governmental functions of governing\" to which \"[t]here are not parallel functions in the private sector.\" Dunbar, supra, 100 Idaho at 546, 602 P.2d at 44. The Dunbar holding (as with Dalehite) required lower courts to examine the underlying function or role performed by the governmental agency or employee involved in the alleged misconduct. If that function was sufficiently \"governmental\" to distinguish it from those found in the private sector, then there could be no liability, regardless of whether \"a private person or entity would be liable.\" I.C. § 6-903(a).\n\nThe Indian Towing Court, per Justice Frankfurter, rejected the \"uniquely governmental function\" exception:\n\nThe Government reads the statute as if it imposed liability to the same extent as would be imposed on a private individual \"under the same circumstances.\" But the statutory language is \"under like circumstances,\" and it is hornbook tort law that one who undertakes to warn the public of danger and thereby induces reliance must perform his \"good Samaritan\" task in a careful manner. Id. 351 U.S. at 64-65, 76 S.Ct. at 124 (emphasis added).\n\nIt matters not whether private individuals ordinarily fill this function of the Coast Guard. Under the High Court's interpretation of this statute, what matters is whether a private individual would be liable if he or she did perform the function and carry out the act of misconduct.[Footnote 4] Dunbar 's holding\n\nnot only conflicted with this holding, it also misunderstood which federal statutes (and inferentially which Idaho statutes) the holding involved.\n\nDunbar was premised on the misconception that Indian Towing involved the \"discretionary function\" exception. Dunbar, supra, 100 Idaho at 532, 602 P.2d at 30 (Quotes the language in Indian Towing, describing \"distinctions so finespun and capricious as to be almost incapable of being held in the mind for adequate formulation\" as referring to the supposed discretionary function exception, whereas in reality that language actually referred to the proposed \"uniquely governmental\" function exception. See Indian Towing, supra, 350 U.S. at 68, 76 S.Ct. at 126.). Dunbar failed to recognize Indian Towing 's express rejection of the very construction that Dunbar employed. Indian Towing, however, full well comprehended that the language here concerned created government liability for the same causes of action for which private persons would be held liable. See generally O. Reynolds, The Discretionary Function Exception of the Federal Tort Claims Act, 57 Georgetown L.J. 81, 99-100 (1968).\n\nSubsequent cases repeatedly reaffirmed the Supreme Court's rejection of the \"uniquely governmental or parallel function\" test. Id. at 102-03. In Hatahley v. United States, 351 U.S. 173, 180, 76 S.Ct. 745, 751, 100 L.Ed. 1065 (1956), the Court read the pertinent language to make the government potentially liable for the illegal acts of its agents enforcing federal range laws, because, \"[u]nder the law of Utah an employer is liable to third persons for the willful torts of his employees if the acts are committed in furtherance of the employer's interests or if the use of force could have been contemplated in the employment.\" In Rayonier, supra, the Court left no doubt that the \"uniquely governmental\" function exception found in Dalehite was \"necessarily rejected by Indian Towing.\" 352 U.S. at 319, 77 S.Ct. at 377 (holding that government potentially liable for Forest Service's negligent fire-fighting), cited with approval in Chandler, supra, 104 Idaho at 487, 660 P.2d at 1330 (Donaldson, C.J., Dissenting). As it dealt with Indian Towing, Dunbar saw Rayonier as dealing with the \"discretionary function\" exception, when it actually was utilizing the language of 28 U.S.C. §§ 1346(b) and 2674. Dunbar, supra, 100 Idaho at 532, 602 P.2d at 30. Finally, in Muniz, supra, the Court found the pertinent language no bar to a claim against the federal government in its capacity as the administrator of prisons -- a capacity surely constituting a traditional governmental function without a ready parallel in the private sector. 374 U.S. at 153-54, 83 S.Ct. at 1853. Post- Indian Towing lower federal courts are in accord. E.g., Fair v. United States, 234 F.2d 288, 294 (5th Cir.1956); see cases cited in 28 U.S.C.A. § 2680 note 21, supp. note 21 and 36 A.L.R.Fed. 240, 256-57, 280. The confusion perceived by Dunbar resulted from its own confusion over which section of the Federal Act the Supreme Court was addressing in Indian Towing and in Rayonier. As previously noted, we must presume that the 1971 legislature adopted the Supreme Court's construction of the pertinent language, and thereby rejected any implied parallel/uniquely governmental function exception.\n\nPost-1971 Supreme Court decisions have continued this reading of 28 U.S.C. § 2674. Varig, supra, explained and reaffirmed Indian Towing and Rayonier. 104 S.Ct. at 2764-65, 2765 n. 10. In Lockheed Aircraft Corp. v. United States, 460 U.S. 190, 198, 103 S.Ct. 1033, 1038, 74 L.Ed.2d 911 (1983), the Court made absolutely clear that the pertinent language referred to causes of\n\naction, not to the governmental role or function:\n\nThe Federal Tort Claims Act permits an indemnity action against the United States \"in the same manner and to the same extent\" that the action would lie against \"a private individual under like circumstances.\" 28 U.S.C. § 2674; see Stencel Aero Engineering Corp v. United States, 431 U.S. 666, 669-670, 97 S.Ct. 2054, 2056-2057, 52 L.Ed.2d 665 (1977) (citing United States v. Yellow Cab Co., 340 U.S. 543, 71 S.Ct. 399, 95 L.Ed. 523 (1951)). (Emphasis added.)\n\nThe capacity in which the government was functioning in Lockheed was none other than the military capacity -- the quintessential of all \"uniquely governmental\" capacities. Lockheed leaves no doubt as to the status of this \"test\" in the federal courts.\n\nAffirmative evidence that the legislature intended to follow the Supreme Court's rejection of the parallel function test surfaces upon further examination of the federal case law and the language of I.C. § 6-903(a). Indian Towing branded the government agency's argument for a \"uniquely governmental function\" exception as an attempt to return to the \"non-governmental -- governmental\" or proprietary -- governmental distinction of the old law of municipal corporations:\n\n[T]he Government in effect reads the statute as imposing liability in the same manner as if it were a municipal corporation and not as if it were a private person, and it would thus push the courts into the \"non-governmental\" -- \"governmental\" quagmire that has long plagued the law of municipal corporations. A comparative study of the cases in the forty-eight States will disclose an irreconcilable conflict. More than that, the decisions in each of the States are disharmonious and disclose the inevitable chaos when courts try to apply a rule of law that is inherently unsound. The fact of the matter is that the theory whereby municipalities are made amenable to liability is an endeavor, however awkward and contradictory, to escape from the basic historical doctrine of sovereign immunity. The Federal Tort Claims Act cuts the ground from under that doctrine; it is not self-defeating by covertly embedding the casuistries of municipal liability for torts. Indian Towing, supra, 350 U.S. at 65, 76 S.Ct. at 124 (emphasis added; footnotes omitted).\n\nThe Rayonier Court reiterated this criticism:\n\n[The government] argues that the Act only imposes liability on the United States under circumstances where governmental bodies have traditionally been responsible for the misconduct of their employees and that neither the common law nor the law of Washington imposes liability on municipal or other local governments for the negligence of their agents acting in the \" uniquely governmental \" capacity of public fireman. But as we recently held in Indian Towing Co. v. United States, 350 U.S. 61, 76 S.Ct. 122, [100 L.Ed. 48] the test established by the Tort Claims Act for determining the United States' liability is whether a private person would be responsible for similar negligence under the laws of the State where the acts occurred. We expressly decided in Indian Towing that the United States' liability is not restricted to the liability of a municipal corporation or other public body and that an injured party cannot be deprived of his rights under the Act by resort to an alleged distinction, imported from the law of municipal corporations, between the Government's negligence when it acts in a \"proprietary\" capacity and its negligence when it acts in a \"uniquely governmental\" capacity. 352 U.S. at 318-19 [77 S.Ct. at 376] (emphasis added) (footnotes omitted); see also Mid-Central Fish Co. v. United States, 112 F.Supp. 792 (W.D.Mo.1953), aff'd sub nom. National Mfg. Co. v. United States, 210 F.2d 263 (8th Cir.1954) cert. denied 347 U.S. 967 [74 S.Ct. 778, 98 L.Ed. 1108] (1954).\n\nPresumably aware of the Supreme Court's having equated the uniquely governmental/parallel\n\nfunction test with the proprietary/governmental distinction, the Idaho legislature inserted the following language into I.C. § 6-903(a): \"the governmental entity is subject to liability . . . whether arising out of a governmental or proprietary function. . . .\" (Emphasis added.) As Indian Towing teaches, uniquely governmental functions are bound to equate with those traditionally viewed as \"governmental\" functions, while those functions similar to ones performed by private persons and entities would equate with those traditionally viewed as \"proprietary.\" 350 U.S. at 66-67, 76 S.Ct. at 125; Hall, supra, at 211, 230.[Footnote 5] But, whether or not fertile minds are able to concoct a \"uniquely governmental function\" that was not a \"governmental function\" under the law of municipal corporations misses the point; what matters is that the Supreme Court unequivocally (1) saw the proposed exception to be the governmental/proprietary distinction in disguise, and (2) rejected it. In using essentially the same language as found in the Supreme Court's Discussions of the provision of the Federal Act analogous to I.C. § 6-903(a), the Idaho legislature also must have equated a proposed \"uniquely governmental function\" with the proprietary/governmental distinction, which it then expressly rejected. Accord, Hall, supra, at 220-22, 228-35; see also Ryan v. State, 134 Ariz. 308, 656 P.2d 597, 598 (1982) (\"Here the appellee-respondents urge that governmental immunity should continue in those instances where the services provided are uniquely governmental in nature. This is the old proprietary-governmental distinction in a bright new word-package.\").\n\nThe legislature was not without good reason to reject any continuation of the pre-1971 judicially imposed distinctions between government conduct which is proprietary, and that which is governmental. As the Indian Towing Court explained, whether or not there is a parallel to a governmental function in the private sector is often fortuitous and unrelated to any rational basis for immunity:\n\n[I]f the United States were to permit the operation of private lighthouses -- not at all inconceivable -- the Government's basis of differentiation would be gone and the negligence charged in this case would be actionable. Yet there would be no change in the character of the Government's activity in the places where it operated a lighthouse, and we would be attributing bizarre motives to Congress were we to hold that it was predicating liability on such a completely fortuitous circumstance -- the presence of identical private activity. 350 U.S. at 66-67, 76 S.Ct. at 125 (footnote omitted).\n\nFurther, the test is so inherently flexible that it offers no predictability. At one extreme, one can say that all governmental activities are distinct from those found in the private sector; at the other, one can always make some analogy between governmental activities and private activities. The Supreme Court explained:\n\nWhile the area of liability is circumscribed by certain provisions of the Federal Tort Claims Act, see 28 U.S.C. § 2680, 28 U.S.C.A. § 2680, all Government activity is inescapably \"uniquely governmental\" in that it is performed by the Government. In a case in which the Federal Crop Insurance Corporation, a wholly Government-owned enterprise, was sought to be held liable on a crop-insurance policy on the theory that a private insurance company would be liable in the same situation, this Court stated: \" Government is not partly public or partly private, depending upon the governmental pedigree of the type of a particular activity or the manner in which the Government conducts it.\" Federal Crop Insurance Corp. v. Merrill, 332 U.S. 380, 383-384, 68 S.Ct. 1, 3,\n\n92 L.Ed. 10. On the other hand, it is hard to think of any governmental activity on the \" operational level,\" our present concern, which is \"uniquely governmental,\" in the sense that its kind has not at one time or another been, or could not conceivably be, privately performed. Indian Towing, supra, 350 U.S. at 67-68, 76 S.Ct. at 126 (emphasis added).\n\nThe results of the parallel function test depend largely on whether the court describes the governmental role in specific terms, which enhances distinguishing characteristics, or general terms, which diminishes them. Hall, supra, at 239-40 n. 205. A case in point is Dunbar's application of the test to the facts of Martin v. United States, 546 F.2d 1355 (9th Cir.1976) cert. denied 432 U.S. 906, 97 S.Ct. 2950, 53 L.Ed.2d 1078 (1977). Dunbar found the administration of Yellowstone National Park to be \"not substantially different in its nature than wild animal parks which might be operated by private persons or entities. . . . Hence, we see no reason not to apply the same standard of care to the government as we would apply to such an enterprise operated by non-government persons.\" 100 Idaho at 533, 602 P.2d at 31. This general-term description glosses over the obvious distinguishing factor that, unlike the operators of a wild animal park, the National Park Service fulfills all governmental functions including law enforcement, and provides for and oversees all services within Yellowstone, including lodging, food services, retail sales, and automotive services to name the most prominent. In fact, the Park Service carries out the same sort of public health and safety inspections which Dunbar held to have no parallels in the private sector.[Footnote 6] If the National Park Service can be so readily equated to operators of wild animal parks, then, truly, potential parallels exist for all governmental functions.\n\nJustice Frankfurter's summarizing criticism in Indian Towing of the proposed exception for uniquely governmental functions is aptly put: \"There is nothing in the Tort Claims Act which shows that Congress intended to draw distinctions so finespun and capricious as to be almost incapable of being held in the mind for adequate formulation.\" Indian Towing, supra, 351 U.S. at 68, 76 S.Ct. at 126.\n\nAdditional reasons for believing the legislature did not intend I.C. § 6-903(a) as a broad exception to liability come from comparing it to and an examination of I.C. § 6-904. I.C. § 6-903(a) is not designated as an exception to liability; § 6-904 is so designated. Had the legislature conceived of an exception for \"uniquely governmental functions without parallels in the private sector,\" then § 6-904 was the logical place in which to incorporate it.\n\nMore importantly, the specific exceptions set out in I.C. § 6-904 establish that the legislature did consider excepting certain \"unique governmental functions,\" and did except certain but not all uniquely governmental functions. These exceptions include the following:\n\n[A]ny claim which:\n\n2. Arises out of the assessment or collection of any tax or fee, or the detention of any goods or merchandise by any law enforcement officer.\n\n3. Arises out of the imposition or establishment of a quarantine by a governmental entity, whether such quarantine relates to persons or property.\n\n5. Arises out of the activities of the Idaho national guard when engaged in training or duty under sections 316, 502, 503, 504, 505 or 709, title 32, United States Code, and the claim arising therefrom is payable under the provisions of the National Guard Claims Act (section\n\n715, title 32, United States Code) except that a claimant not compensated in whole or in part under the National Guard Claims Act may assert his claim under this act.\n\n6. Arises out of the activities of the Idaho national guard when engaged in combatant activities during a time of war.\n\n8. Arises out of a plan or design for construction or improvement to the highways, roads, streets, bridges, or other public property where such plan or design is prepared in substantial conformance with engineering or design standards in effect at the time of preparation of the plan or design, approved in advance of the construction or approved by the legislative body of the governmental entity or by some other body or administrative agency, exercising discretion by authority to give such approval. I.C. § 6-904.\n\nObviously, if there did exist a general exception for unique governmental functions without parallels in the private section in I.C. § 6-903(a), then there would have been no need for the specific exceptions in I.C. § 6-904. To so misconstrue I.C. § 6-903(a) would be in violation of the rule of construction that all provisions of a statute must be given effect, and that no one part should be rendered mere surplusage by the overly broad construction of another. Chandler, supra, 104 Idaho at 488, 660 P.2d at 1331 (Donaldson, C.J., Dissenting); University of Utah Hospital and Medical Center v. Bethke, 101 Idaho 245, 248, 611 P.2d 1030, 1033 (1980).\n\nIt has been argued that the 1971 Idaho Act was not intended to create new causes of action against the government in its business of governing. If it be the imperative of this argument that the government is liable only for claims related to functions with parallels in the private sector, then the Idaho Act did nothing to change the existing rules of liability delineated in Smith, supra. To the contrary, the Idaho Act, like its federal counterpart, clearly intended to extend liability to some \"governmental\" functions which were formerly immune. The Supreme Court has explained:\n\nIt may be that it is \"novel and unprecedented\" to hold the United States accountable for the negligence of its firefighters but the very purpose of the Tort Claims Act was to waive the government's traditional all encompassing immunity from tort actions and to establish novel and unprecedented governmental liability. Rayonier, supra, 352 U.S. at 319, 77 S.Ct. at 377, quoted with approval in Chandler, supra, 104 Idaho 487, 660 P.2d at 28 (Donaldson, C.J., Dissenting) (emphasis added).\n\nThe implication of the argument could be that the government might be impeded in its policymaking tasks. As discussed in the next part of this opinion, that function is adequately protected by the discretionary function exception. Thus, the legislature made no general exception for uniquely governmental functions partly because there was no need for such an exception. Finally, if this argument is taken as meaning that the legislature did not intend to create new torts, then such is answered by noting the prior existence of the tort of negligent supervision (as will be discussed subsequently, see Restatement (Second) of Torts, § 319 (1965)).\n\nIn sum, no support for the existence of the parallel function test exists in the language of the Idaho Act, nor in the federal case law existing prior to the adoption of the Idaho Act in 1971. Nothing whatever overcomes the presumption that the rule of Indian Towing, Rayonier and subsequent decisions was adopted along with the Federal Act. All of those cases rejected an exception for uniquely governmental functions based on language in the Federal Act which is analogous to the Idaho Act. Furthermore, we are obliged to be mindful that under both acts imposition of liability is the rule, with specific exceptions, and the exceptions are to be construed narrowly, thereby fulfilling the beneficent purpose of the Act. These rules of construction\n\nsteer us away from creating by implication such a broad exception from the language of I.C. § 6-903(a). The Supreme Court's words on the very question presented today bear repeating: \"There is no justification for this Court to read exemptions into the Act beyond those provided by Congress [or, in the case of the Idaho Act, the legislature]. If the Act is to be altered that is a function for the same body that adopted it.\" Rayonier, supra, 352 U.S. at 320, 77 S.Ct. at 377, quoted in Muniz, supra, 374 U.S. at 166, 83 S.Ct. at 1859; see also Indian Towing, supra, 350 U.S. at 69, 76 S.Ct. at 126 (The court should not \"as self-constituted guardian of the Treasury import immunity back into a statute designed to limit it.\"), quoted with approval in Chief Justice Donaldson's Dissent in Chandler, supra, 104 Idaho at 488, 660 P.2d at 1331 (emphasis added).\n\nAccordingly, we hold that I.C. § 6-903(a) means exactly what it says: \"every governmental entity is subject to liability for money damages . . . whether arising out of a governmental or proprietary function, where the governmental entity if a private person or entity would be liable for money damages under the laws of the state of Idaho. . . .\" We do not add, \"where there are private persons or entities performing parallel functions.\" Clearly, then, the language has always stated that if a private person or entity would be liable, so, then, will be the government. The \"parallel function\" language to the contrary in Dunbar and its progeny is overruled.\n\nThe only remaining question is whether a private person would be liable for the misconduct alleged against Bloom's probation officer. We hold that a private person would be. In the recent case of Doe v. Durtschi, supra, which involved the negligent retention and supervision of a school teacher, we reasoned:\n\nA cause of action in negligence requires the breach of a duty which is the proximate cause of the plaintiff's injury. Restatement (Second) of Torts § 328A (1965). . . . Under the plaintiffs' allegations, the children's injuries arose out of the basic negligence of the school district. The injuries were the foreseeable consequence of the school district's negligence in retaining Durtschi despite full knowledge of his proclivities.\n\nThe fact that the plaintiffs' injuries were caused by a third party does not absolve the school district from liability for its negligence. The concept of supervening causation is inapplicable, under the allegations of the present case. Durtschi's actions were the foreseeable result of the school district's alleged failure to exercise due care to protect its students. The very risk which constituted the district's negligence was the probability that such actions might occur.\n\nIt is clearly unsound to afford immunity to a negligent defendant because the intervening force, the very anticipation of which made his conduct negligent, has brought about the expected harm. Gibson v. United States, 457 F.2d 1391, 1395 (3rd Cir.1972). To do so would fly in the face of basic principles of tort law, as recounted in the Restatement:\n\nIf the likelihood that a third person may act in a particular manner is the hazard or one of the hazards which make the actor negligent, such an act whether innocent, negligent, intentionally tortious, or criminal does not prevent the actor from being liable for harm caused thereby. Restatement (Second) of Torts § 449. See Smith v. Sharp, 82 Idaho 420, 428, 354 P.2d 172, 176 (1960).\n\nThe fact that the foreseeable danger was from intentional or criminal misconduct is irrelevant; the school district had a statutory duty to make reasonable efforts to protect its students from such a danger. A breach of that duty constitutes negligence. Under the allegations of the present case, Durtschi's actions would not constitute a supervening cause, and the school district's tortious conduct would not arise out of assault and battery. Rather, the roots of the assault and battery would be in the district's\n\nown negligence. Durtschi, 716 P.2d at 1243-44.\n\nBefore there reaching the question of whether the assault and battery exception to liability found in I.C. § 6-904(4) applied, this Court was required to consider whether an injured person had a cause of action against another person or entity for the negligent retention and supervision of a dangerous third person who harms the injured party. The reasoning behind the holding directly applies here.\n\nIt has been argued that the duty to the plaintiffs in Durtschi arose solely out of the defendant school district's statutory duty to protect the health and morals of its students. This does not alter the reasoning of the passage quoted above, which supports the existence of a duty to persons foreseeably endangered by the negligently supervised third person. Here, the negligent supervision of Bloom foreseeably endangered any and all motorists Bloom might encounter.\n\nMoreover, the Board has a statutory duty to supervise probationers and, where appropriate, to investigate and report violations of probation conditions for the purpose of revoking probation:\n\n20-219. Probation and parole supervision. -- The state board of correction shall be charged with the duty of supervising all persons placed on probation or released from the state penitentiary on parole, and all persons released on parole or probation from other states and residing in the state of Idaho; of making such investigations as may be necessary; of reporting alleged violations of parole or probation in specific cases to the commission or the courts to aid in determining whether the parole or probation should be continued or revoked and of preparing a case history record of the prisoners to assist the commission or the courts in determining if they should be paroled or should be released on probation. (Emphasis added.)\n\nWhile the statute does not purport to identify by name or class those to whom that assigned duty is owed, in the instant circumstances, obvious to the utmost, the motorists foreseeably endangered by the negligent supervision of Bloom are within the class protected.[Footnote 7] See, e.g., Beck v. Kansas University Foundation, 580 F.Supp. 527, 534 (D.Kansas 1984) (Kansas Adult authority owed duty to protect those present at a university medical center from foreseeable danger posed by released prisoner); see generally Prosser and Keeton, The Law of Torts § 53 (5th ed. 1984) (hereinafter \" Prosser \").\n\nWhile the question of a \"duty\" may oftentimes be a difficult question, Prosser § 53, it generally is not so considered in the context of a person charged with and empowered to control the conduct of a third person. Dean Prosser explains:\n\nThe general duty which arises in many relations to take reasonable precautions for the safety of others may include the obligation to exercise control over the conduct of third persons. . . .\n\npremises to exercise reasonable care to control the conduct of any one upon them, for the protection of those outside. A franchiser may be liable for negligently permitting its franchisee to cheat the customers. The physician in charge of an operation may be liable for failure to prevent the negligence of his assistants. A hospital may be liable for permitting an unqualified doctor to treat a patient on its premises. The same rule has been applied to hospitals and psychotherapists who have charge of dangerous mental patients, and to those who have charge of dangerous criminals. A common application of the principle is found in the liability of parents for failure to exercise proper control over their children, which is considered in the chapter on domestic relations. Yet, in the absence of the requisite relationship, there generally is no duty to protect others against harm from third persons. Prosser, § 56, pp. 383-85 (emphasis added, footnotes omitted).\n\nThe duty to control a dangerous charge \"and to guard other persons against his dangerous propensities\" which Dean Prosser describes is acknowledged in the Restatement (Second) of Torts:\n\n§ 319. Duty of Those in Charge of Person Having Dangerous Propensities. One who takes charge of a third person whom he knows or should know to be likely to cause bodily harm to others if not controlled is under a duty to exercise reasonable care to control the third person to prevent him from doing such harm.\n\nAs the Restatement and Dean Prosser's observations both indicate, the key to this duty is not the supervising individual's direct relationship with the endangered person or persons, but rather is the relationship to the supervised individual. The duty extends to the protection and safety of \"others\" foreseeably endangered. Where the duty is borne by governmental officials, it is a duty more specific than one to the general public; instead, it is a duty to those foreseeably endangered. See DeHoney v. Hernandez, 122 Ariz. 367, 595 P.2d 159, 164-65 (1979) (Though under Arizona case law the duty of police protection is owed only to the general public (a rule since abandoned, see Ryan, supra, 656 P.2d at 599), there is the special and narrower duty to control persons with dangerous tendencies.)\n\nClearly a duty can be owed to more than single individuals known to the tort-feasor. In a case like the instant one, the duty is owed to a class rather than a single individual. With a drunk driver on the highways, it is strictly a matter of chance who may become his victim. For certain, however, potential victims include those persons in the class of motorists on the same highway. The negligent conduct here involved and alleged obviously endangered more than the single victim, Maude Sterling. As Dean Prosser noted, \"liability in tort is based upon the relations of persons with others; and those relations may arise generally, with large groups or classes of persons, or singly, with an individual.\" Prosser, § 1, p. 5. Here, the admitted negligent supervision of Bloom by the probation officer foreseeably created a potential for harm to those motorists whom Bloom would encounter on the state's highways. The probation officer owed those motorists a duty.\n\nThis duty has been recognized by many courts in many jurisdictions. See generally Restatement (Second) of Torts Appendix § 319, pp. 138-52 (1986). In fact, a considerable number of courts have recognized the duty in the instant context. For example, in Semler v. Psychiatric Institute of Washington, D.C., 538 F.2d 121, 123-24 (4th Cir.1976), cert. denied 429 U.S. 827, 97 S.Ct. 83, 50 L.Ed.2d 90, a probation officer, along with a psychiatric institute, failed to enforce a court order that the probationer, a person known to be dangerous to young girls, be confined and supervised as a day care patient in the institution. Sterling has made similar allegations of disregard of court orders. The probationer killed the plaintiff's daughter, a person with whom the probation officer and the institute had no direct relationship or connection. Id.\n\nThe court held that the defendants owed a duty to the plaintiff and decedent:\n\nIt is apparent [from the court order] that the decision to release Gilreath was not to be simply a medical judgment based on the state of his mental health. The decision would also entail a judgment by the court as to whether his release would be in the best interest of the community. The special relationship created by the probation order, therefore, imposed a duty on the appellants to protect the public from the reasonably foreseeable risk of harm at Gilreath's hands that the state Judge had already recognized.\n\nSection 319 of Restatement (Second) of Torts (1965) is close to the point. . . . The Restatement measures a custodian's duty by the standard of reasonable care. Here, that standard has been delineated by the precise language of the court order. The appellants were to retain custody over Gilreath until he was released from the Institute by order of the court. No lesser measure of care would suffice. Id. at 125 (emphasis added).\n\nOther courts have found the same duty on the part of probation and parole officers. E.g., Payton v. United States, 679 F.2d 475 (5th Cir.1982); Doe v. Arguelles, 716 P.2d 279 (Utah 1985); Acevedo v. Pima County Adult Probation Department, 690 P.2d 38, 40 (Ariz.1984); Mianecki v. Second Judicial Dist. Court, 99 Nev. 93, 658 P.2d 422 (1983); State v. Silva, 86 Nev. 911, 478 P.2d 591 (1971); Johnson v. State, 69 Cal.2d 782, 73 Cal.Rptr. 240, 447 P.2d 352 (1968). Likewise, we hold that the duty delineated in Restatement (Second) of Torts § 319 (1965) exists in Idaho.\n\nC. The Discretionary Function Exception.\n\nAs an alternative basis for its decision, the district court ruled that under Chandler 's construction of the \"discretionary function\" exception, I.C. § 6-904(1), \"because the prison and parole system have traditionally been regarded as governmental functions, the Board and its employees would enjoy immunity for planning and operations decisions made in their supervision of parolees.\" R., Vol. 2, p. 118. Chandler's holding to which the district court referred states:\n\nIn our view, the purpose behind the discretionary function-exception is to preserve governmental immunity from tort liability for the consequences which arise from the planning and operational decision-making necessary to allow governmental units to freely perform their traditional governmental functions. Chandler, supra, 104 Idaho at 485, 660 P.2d at 1328 (emphasis original).\n\nChandler suggests no support for this construction of I.C. § 6-904(1) from the language of § 6-904(1) itself. In addition, Chandler declined to consider the federal case law on this provision, relying solely on the review of such cases made in Dunbar. As already explained, Dunbar failed to comprehend which provision of the Federal Act certain key federal cases were addressing. As the Supreme Court recently explained in Varig, supra, and as earlier discussed, there is no unresolved inconsistency between such cases as Indian Towing, Rayonier, and Eastern Airlines and Dalehite. 104 S.Ct. at 2763-65. In light of these facts, counsel for Sterling again earnestly beseeches us to reconsider this provision of the Idaho Act. As with the preceding part of this opinion, we first turn to the language of the subsection itself, and then to pre-1971 federal authority on the question.\n\nI.C. § 6-904(1) provides:\n\nA governmental entity and its employees while acting within the course and scope of their employment and without malice or criminal intent shall not be liable for any claim which:\n\n1. Arises out of any act or omission of an employee of the governmental entity exercising ordinary care, in reliance upon or the execution or performance of a statutory or regulatory function, whether or not the statute or regulation be valid, or based upon the exercise or performance or the failure to exercise or perform a discretionary function or\n\nduty on the part of a governmental entity or employee thereof, whether or not the discretion be abused. (Emphasis added.)\n\nAddressing first the second clause excepting claims arising out of a \"discretionary function or duty,\" we readily find guidance in the dictionary definition of discretion as the \"ability to make responsible decisions,\" and as \"individual choice or judgment.\" Webster's New Collegiate Dictionary (1st ed. 1977). However, as the California Supreme Court has observed, virtually all human endeavors, even the driving of a nail, involve some type of discretion as commonly defined. Johnson, supra, 447 P.2d at 357. Clearly, then, \"discretionary function\" does not include functions which involve any element of choice, judgment or ability to make responsible decisions; otherwise every function would fall within the exception. Id.; see also Downs v. United States, 522 F.2d 990, 995 (6th Cir.1975) (even driving an automobile, which Congress indicated was a nondiscretionary act, involves judgment); Wainscott v. State, 642 P.2d 1355, 1356 (Alaska 1982) (\"Not all decisions involving an element of discretion, however, fall within the discretionary function exception.\"), quoted with approval in Chief Justice Donaldson's Dissent in Chandler, supra, 104 Idaho at 489, 660 P.2d at 1332.\n\nThe first clause in § 6-904(1) casts some light on the meaning of \"discretionary\" when it provides for immunity from claims arising out of governmental employees' actions \"in reliance upon or the execution or performance of a statutory or regulatory function,\" but only where the governmental employees exercised \"ordinary care.\" To execute or perform a statutory or regulatory function is to implement (or make operational) the policy involved in statutory and regulatory functions. The fact that this clause is joined to the \"discretionary function\" clause with the disjunctive \"or\" demonstrates that the two clauses describe mutually exclusive conduct. Dalehite, supra, 346 U.S. at 34, 73 S.Ct. at 967; Downs, supra, 522 F.2d at 996. Thus, the term \"discretionary function\" could not include the execution or performance of, i.e., the implementation of, statutory or regulatory policy. Since discretionary functions involve actions qualitatively different from implementing policy, and since the former by definition involve the exercise of choice, judgment, and the ability to make responsible decisions, then discretionary functions must actually involve the formulation of policy.\n\nThe holding in Chandler, supra, 104 Idaho at 485, 660 P.2d at 1328, that the discretionary functions exception preserves immunity for planning and operational decisionmaking robs the first clause of its meaning. The first clause extends immunity to operational decisionmaking only when that decisionmaking is carried out with ordinary care. Further, to exempt both planning and operational functions excepts all governmental functions. Beyond planning a governmental action, and putting it into operation, what else does a government do in its total function of governing? To exempt operational conduct is not in keeping with the general rules that the express exceptions be closely construed, Kosak, supra, 104 S.Ct. at 1523 n. 9, and that the Idaho Act be construed \"liberally\" and \"'with a view to accomplishing [its] aims and purposes, and attaining substantial Justice. . . .'\" Farber, supra, 102 Idaho at 402, 630 P.2d at 689 quoting Keenan, supra, 68 Idaho at 438, 195 P.2d at 670.\n\nThe legislative history of the Federal Act supports the interpretation that the two clauses created a distinction between policymaking functions and operational functions, with the latter protected by immunizing only when carried out with due care.[Footnote 8]\n\nA key paragraph which appeared numerous times in the federal legislative history stated that there would be no liability \"growing out of an authorized activity, such as a flood-control or irrigation project, where no negligence on the part of any Government agent is shown, and the only ground for suit is the contention that the same conduct by a private individual would be tortious, or that the statute or regulation authorizing the project was invalid.\" H.R.Rep. No. 2245, 77th Cong., 2d Sess., p. 10 (emphasis added) quoted in Dalehite, supra, 346 U.S. at 29, n. 21, 73 S.Ct. at 964, n. 21. This sentence refers to the first clause, and explains that immunity would extend to actions putting into operation the policy decisions of the government, even if that policy was negligently formed, so long as the actions were performed non-negligently.\n\nThe next four sentences in the aforementioned paragraph explain the purpose of the \"discretionary function\" clause:\n\n[The exception] is also designed to preclude application of the bill to a claim against a regulatory agency, such as the Federal Trade Commission or the Securities and Exchange Commission, based upon an alleged abuse of discretionary authority by an officer or employee, whether or not negligence is alleged to have been involved. To take another example, claims based upon an allegedly negligent exercise by the Treasury Department of the blacklisting or freezing powers are also intended to be excepted. The bill is not intended to authorize a suit for damages to test the validity of or provide a remedy on account of such discretionary acts even though negligently performed and involving an abuse of discretion. Nor is it desirable or intended that the constitutionality of legislation, or the legality of a rule or regulation should be tested through the medium of a damage suit for tort. Id. (emphasis added).\n\nThus, activities involving the setting of regulation and policy were those intended to fall within the term \"discretionary.\"[Footnote 9]\n\nIn its interpretation of the Federal Act and its legislative history the United States Supreme Court recognized and adhered to this planning/operational distinction. In Dalehite, supra, parties injured in the Texas City explosion of 1947 alleged that the government had negligently planned the program to produce ammonium nitrate fertilizer. 346 U.S. at 35, 73 S.Ct. at 967. The specific decisions concerned were those of the Field Director of Ammunitions Plants, by which the Field Director established by regulation for all plants the bagging temperature, the type of bagging, the labeling, and the type of coating to be used on the fertilizer. Id. at 39, 73 S.Ct. at 969. The Court held that \"[t]he decisions held culpable were all responsibly made at a planning rather than operational level and involved considerations more or less important to the practicability of the Government's fertilizer program.\" Id. at 42, 73 S.Ct. at 971. The Court held that the discretionary function exception included generally \"determinations made by executives or administrators in establishing plans, specifications or schedules of operations. Where there is room for policy judgment and decision\n\nthere is discretion.\" Id. at 35-36, 73 S.Ct. at 963.[Footnote 10]\n\nIn dicta, the Court continued: \"It necessarily follows that acts of subordinates in carrying out the operations of government in accordance with official directions cannot be actionable.\" Id. at 36, 73 S.Ct. at 968. Here the Court refers to the immunity granted in the first clause, but omits any mention of the \"due care\" requirement. However, the plaintiffs had not alleged that the bagging regulations were carried out negligently but rather that the regulations themselves were negligently established. Id. at 23, 38-40, 73 S.Ct. at 969-70. Subsequent decisions of the Court made it abundantly clear that \"due care\" is indeed required at the operational level.\n\nIn Indian Towing, as discussed in the preceding part of this opinion, the Court dealt primarily with 28 U.S.C. §§ 1346(b) and 2674 rather than with the discretionary function exception. Nevertheless, the Court made it known that activity at the \"operational level\" was not \"discretionary.\" With obvious references to the two clauses of the exception, the Court explained:\n\nThe Coast Guard need not undertake the lighthouse service. But once it exercised its discretion to operate a light on Chandeleur Island and engendered reliance on the guidance afforded by the light, it was obligated to use due care to make certain that the light was kept in good working order; and, if the light did become extinguished, then the Coast Guard was further obligated to use due care to discover this fact and to repair the light or give warning that it was not functioning. If the Coast Guard failed in its duty and damage was thereby caused to petitioners, the United States is liable under the Tort Claims Act. Indian Towing, supra, 350 U.S. at 69, 76 S.Ct. at 126 (emphasis added).\n\nThus, the decision to operate the lighthouse was discretionary as described in the second clause of the exception; the operation of the lighthouse itself was but the implementation of policy as described in the first clause. The first clause, of course, requires due care in order for immunity to apply.\n\nSubsequent decisions in agreement with Indian Towing are: Rayonier, supra, 352 U.S. at 318-20, 77 S.Ct. at 376-77 cited with approval in Chandler, supra 104 Idaho at 487, 660 P.2d at 1350 (Donaldson, C.J., Dissenting); Hatahley, supra, 351 U.S. at 181, 76 S.Ct. at 752 (analyzes the two clauses in similar fashion as in Indian Towing); see generally Reynolds, supra, at 99-104; Comment, Federal Tort Claims Act: The Development and Application of the Discretionary Function Exception, 13 Cumberland L.Rev. 535, 541-46 (1982-83). Lower federal courts before and after 1971 generally have applied the planning/operational analysis as first delineated in Dalehite and subsequently modified in Indian Towing. E.g., Nevin v. United States, 696 F.2d 1229, 1230 (9th Cir.1983) cert. denied 464 U.S. 815, 104 S.Ct. 70, 78 L.Ed.2d 84; Driscoll v. United States, 525 F.2d 136, 138 (1975); United States v. State of Washington, 351 F.2d 913, 916 (9th Cir.1965); Moyer v. United States, 302 F.Supp. 1235, 1237 (D.Fla.1969), rev'd on other grounds 481 F.2d 585 (5th Cir.1973); Cohen v. United States, 252 F.Supp. 679, 687-88 (N.D.Ga.1966), rev'd on other ground, 389 F.2d 689 (5th Cir.1967); Colorado Insurance Group, Inc. v. United States, 216 F.Supp. 787, 793 (D.Colo.1963); see generally, 36 A.L.R.Fed. 240, 255-58; 28 U.S.C.A. § 2680 notes 12, 13, 18, 19; Hall, supra, at 231; Comment, supra, at 541-553.\n\nIn short, prior to the adoption of the Idaho Act, the United States Supreme Court had established that the discretionary function exception provided immunity to (1) activities which involved the establishment\n\nof plans, specifications and schedules where there is room for policy judgment and decision (generally referred to as planning activities), and (2) activities involving the implementation of statutory or regulatory policy (generally referred to as operational activities), so long as those activities are performed with due care.\n\nUnder this test, the reviewing court looks not to the status or rank of the actor, but rather to the nature of the conduct in order to determine whether that conduct involved the exercise of discretion. Varig, supra, 104 S.Ct. at 2765 (citing Dalehite, supra); Downs, supra, 522 F.2d at 997; Smith v. United States, 375 F.2d 243, 246 (5th Cir.1967), cert. denied, 389 U.S. 841, 88 S.Ct. 76, 19 L.Ed.2d 106. The court then, guided by the Supreme Court's general distinctions as set out above, determines whether the conduct is planning or operational. If the former is the case, the government is immune even where the planning was negligent; if the latter, immunity is contingent upon the use of due or ordinary care. For example, when the FBI established its policy for dealing with hijackings in its handbook, it was conducting a planning activity involving policy formulation, for which the government was immune under the discretionary function clause even if its policy was negligently set; however, when FBI agents applied that policy to an actual hijacking, those agents were carrying out operational activities, for which the government is immune under the first clause of the exception so long as the agents used due (or ordinary) care. Downs, supra, 522 F.2d at 997; see also, e.g., Cohen, supra, 252 F.Supp. at 688 (admission of prisoner occurs at planning level, but failure to protect prisoner from a known dangerous prisoner occurred at operational level); Colorado Insurance, supra, 216 F.Supp. at 792 (SEC agents' actions to destroy plaintiff's business occurred on operation level); Sullivan v. United States, 129 F.Supp. 713, 714-15 (N.D.Ill.1955) (FBI agent's negligence in automobile pursuit occurred at operational level); cf. Doe v. Arguelles, 716 P.2d 279, 283 (Utah 1985) (decision to parole juvenile delinquent was discretionary, but the negligent supervision of that juvenile was not).\n\nIt is true that some difficulty may be encountered in drawing the line between activity which is planning and activity which is operational. However, as the California Supreme Court has noted, the exercise has the advantage of affording immunity where such immunity is needed and desirable:\n\nAdmittedly, our interpretation will necessitate delicate decisions; the very process of ascertaining whether an official determination rises to the level of insulation from judicial review requires sensitivity to the considerations that enter into it and an appreciation of the limitations on the court's ability to reexamine it. Despite these potential drawbacks, however, our approach possesses the dispositive virtue of concentrating on the reasons for granting immunity to the governmental entity. It requires us to find and isolate those areas of quasi-legislative policy-making which are sufficiently sensitive to justify a blanket rule that courts will not entertain a tort action alleging that careless conduct contributed to the governmental decision. Johnson, supra, 447 P.2d at 360-61 (footnote omitted).\n\nOne commentator noted that, for all its difficulties, the planning/operational test is soundly based on the statute and case law, and soundly premised on the purposes of the exception:\n\nThe planning-operational test is relatively simplistic; further, it has considerable support and definitional guides provided by case law. It is a formula already in use that can achieve the purposes for which the exception is needed. It will not turn the \"twilight zone\" of the Act into bright day, but it will permit the basic purposes of both the Act and the exception to be achieved. Reynolds, supra, 57 Georgetown L.J. at 132.\n\nAs this commentator explained, the planning/operational analysis (1) enables courts to avoid second-guessing the policy judgment\n\nof the government,[Footnote 11] and to primarily deal with negligent conduct, which courts are well-equipped to do, and (2) precludes widespread liability by immunizing policy choices of broad impact. Id. at 128.\n\nA potential weakness of the test is its application to judicial conduct. The test is designed to deal with \"the discretion of an executive, legislator, or administrator, not that of a Judge.\" Id. at 131. In this circumstance, the test must accommodate the important policy of judicial immunity. The decisionmaking of Judges must fall within the discretionary function exception in order to afford the insulation necessary for Judges to independently carry out their tasks without the fear of consequences. Id.; see Acevedo, supra, 690 P.2d at 40.\n\nOne circumstance in particular has posed no problems to reviewing courts. When the plaintiff alleges that a government official has negligently acted in not complying with the policy constituted in a statute, regulation, or court order, then there is no immunity. Dalehite, supra, 346 U.S. at 36, 73 S.Ct. at 968 \"[A]cts of subordinates in carrying out the operations of government in accordance with official directions cannot be actionable.\" (Emphasis added.)); Hatahley, supra, 351 U.S. at 177-81, 76 S.Ct. at 749-52; (the exception provides no immunity for government agents' seizing and destroying plaintiffs' horses without affording the notice required under the Taylor Grazing Act); Birnbaum v. United States, 588 F.2d 319, 330 (2d Cir.1978) (\"[T]he CIA's mail opening project could not be a 'discretionary act' if the Agency lacked authority to conduct such a program.\"); Semler, supra, 538 F.2d at 127 (probation officer's failure to lay requests for change in status of psychiatric patient before the Judge as required by court order was nondiscretionary act); Acevedo, supra, 690 P.2d at 41 (action of probation officers contrary to court order cannot be discretionary); Johnson, supra, 447 P.2d at 356-57 (where an official is left with no choice, that official's acts are nondiscretionary); Muskopf v. Corning Hospital District, 55 Cal.2d 211, 11 Cal.Rptr. 89, 359 P.2d 457, 462 (1961) (\"[T]he state may be liable for the harm caused by its agents' violations of such [traffic] laws.\"). Indeed the fact that the first clause extends immunity to non-negligent conduct in the execution of policy carries with it the converse implication that there is no immunity where the government official was negligent in failing to execute that policy.\n\nA final point of confusion must be addressed. Without any reference to authority, Chandler held that the discretionary function exception to immunize decisionmaking was \" necessary to allow governmental units to freely perform their traditional governmental functions.\" Chandler, supra, 104 Idaho at 485, 660 P.2d at 1328 (emphasis in original). Nothing in the definition of \"discretion\" and nothing in the entire framework and scheme of the Tort Claims Act itself provides even an inkling of any possible reference to \"traditional governmental functions.\" To the contrary, the exercise of choice and judgment and the making of responsible decisions take place daily in all human activities. The United States Supreme Court specifically rejected such a derivation. Eastern Airline, supra, 350 U.S. 907, 76 S.Ct. 192, explained in Varig, supra, 104 S.Ct. at 2764-65. Most importantly,\n\nand as previously illustrated, such a derivation would convert to mere surplusage those expressly enumerated exceptions found in I.C. § 6-904 which involve \"traditional\" governmental functions. Chandler, supra, 104 Idaho at 488, 660 P.2d at 1331 (Donaldson, C.J., Dissenting). We hold that the discretionary function exception does not extend immunity on the basis of certain governmental functions having been in pre-1971 days judicially described as \"traditional.\"\n\nThe import of the federal discretionary function exception was the subject of much litigation prior to its adoption in the Idaho Act. As our review above has revealed, the United States Supreme Court had firmly established the planning/operational test for determining the applicability of the exception. Nothing overcomes the presumption that the Idaho legislature adopted this test with its adoption of the exception. To the contrary, the test well reflects the language of and policy behind the exception. Accordingly, with the general rules of construction for the Idaho Act in mind, we hold that the planning/operational test as described above (including the Discussion of judicial functions and of conduct in violation of policy) applies to the discretionary function exception of the Idaho Act, I.C. § 6-904(1). See Chief Justice Donaldson's Dissent in Chandler, supra, 104 Idaho at 488, 660 P.2d at 1331 (\"I believe that the Court should reconsider and adopt the planning-operational distinction as an appropriate test of the discretionary function exception.\"). Anything in Chandler contrary to our holding is overruled.\n\nA proper application of our holdings to this case is not difficult. For purposes of this appeal, defendants have admitted that the probation officer negligently permitted Bloom to violate certain conditions set in both the agreement of probation and the court's order of probation (for example, in allowing Bloom to drive for recreational purposes as he was doing at the time of the accident), and that the probation officer was negligent in enforcing other conditions of probation. See Part I, supra. While the setting of those conditions involved policy judgment and thus constituted a planning function, the implementing of those conditions was not a matter of policy or even of choice. The probation officer was vested with no discretion to permit the violation of these conditions, but was required to use \"ordinary care\" in supervising the \"execution or performance of\" the conditions set for Bloom's probation. I.C. § 6-904(1). Accordingly, we hold that I.C. § 6-904(1) does not stand as a bar of immunity based upon the facts of this case as presented at this time.\n\nIn so holding, we act in accordance with all of the most highly applicable cases we have examined, including a number of cases directly on point. Payton, supra, 679 F.2d at 481-83 (establishing parole guidelines is discretionary; application in individual cases is operational); Semler, supra, 538 F.2d at 123-27 (probation officer's negligent failure to lay request for change of probationer's status before Judge, in violation of court order, was nondiscretionary act subject to liability); Cohen, supra, 252 F.Supp. at 688 (Failure to exercise ordinary care in supervision of prisoner after prisoner had been classified for purposes of confinement was nondiscretionary); Arguelles, supra 716 P.2d at 283 (negligent supervision of paroled \"sexually aggressive\" youth who stabbed and raped plaintiff was nondiscretionary and subject to liability); Acevedo, supra, 690 P.2d at 41 (probation officers' permitting probationer to have contact with children under the age of 15 in violation of court order, which contact resulted in plaintiff children being molested, was nondiscretionary); Mianecki, supra, 658 P.2d at 424 (negligent transfer and placing of probationer, which negligence resulted in the sexual assault on plaintiff child, was nondiscretionary); Silva, supra, 478 P.2d at 593 (negligent supervision of inmates in an \"honor camp\" is \"operational\"); Johnson, supra, 447 P.2d at 362 (implementation of standards for parole is nondiscretionary); see also Hatahley, supra, 351 U.S. at 181, 76 S.Ct. at 752; Muniz, supra, 374 U.S. at 152-53, 83 S.Ct. at 1852-53 (prison officials' failure to prevent\n\nviolent prisoners from injuring plaintiff results in liability); Jablonski v. United States, 712 F.2d 391, 396 (9th Cir.1983) (failure of government psychiatrist to warn foreseeable victim was \"operational\"); Berman v. United States, 572 F.Supp. 1486, 1492-93 (N.D.Ga.1983) (failure of government in legally imposed obligation to supervise and evaluate representative of government is nondiscretionary).\n\nIt is not for us to consider at this time any contention that the probation officer did not actually \"permit\" Bloom to violate the conditions of his probation, and acted reasonably and with ordinary care in the supervision of Bloom. Clearly, if the probation officer acted with ordinary care, the first clause of the discretionary function exception may afford immunity even though the conditions of probation were negligently set. However, we must assume the contrary for the purposes of the motion for judgment on the pleadings.\n\nThe judgment of the district court granting the State's motion for judgment of dismissal on the pleadings is reversed and the cause remanded for further proceedings not inconsistent herewith.\n\nCosts to appellant.\n\nHUNTLEY, Justice, Concurring.\n\nINTRODUCTION\n\nI fully concur with and join in the scholarly and thorough opinion of the majority. That opinion was exhaustively reviewed and contributed to by each Concurring Justice. This Court long and carefully considered the applicable law and the arguments of counsel and of our Dissenting brother Bakes before rendering its decision. Ultimately, the unambiguous message of the Idaho Tort Claims Act's language and of the relevant case law compelled our decision. In that sense, this is a judicially conservative decision; it adheres closely to the law as the legislature wrote it and to the federal case law to which the legislature looked. This decision changes nothing in the Act; rather, it restores the Act to what the legislature intended in 1971. With this case and henceforth the Act will function as it should, imposing on the government the same baseline accountability for acts of wrongdoing as private individuals bear, while at the same time sheltering the government from liability for \"discretionary\" policy decisions as well as for conduct involving the other enumerated exceptions to liability.\n\nI write separately only to answer the arguments advanced by the Dissent. In contrast with the majority opinion, the Dissent's desired activist result would cast aside the legislature's clear intent as expressed in the statutory language and in the pre-1971 federal case law in favor of a perceived policy need to limit the government's potential liability more than the government itself considered necessary. It hardly need be said that this is not our proper role. In order to reach a result contravening the dictates of law, the Dissent of a necessity fundamentally misconceives (1) the import of I.C. § 6-903(a) and related state and federal case law, (2) the import of the \"discretionary function\" exception found in I.C. § 6-904(1) and of related case law, (3) well-established tort law concerning (a) an alleged tort-feasor's duty to supervise a person with which the alleged tort-feasor has a special relationship and (b) respondeat superior liability, and (4) the appropriate circumstances for making decisions prospective-only in effect. I will address these arguments in the order the Dissent makes them.\n\nI. GOVERNMENTAL IMMUNITY\n\nA. The \"Parallel Function\" Test.\n\nAs with Dunbar v. United Steelworkers of America, 100 Idaho 523, 602 P.2d 21 (1979), cert. denied 446 U.S. 983, 100 S.Ct. 2963, 64 L.Ed.2d 839, the Dissent derives from I.C. § 6-903(a) an exception to liability where the underlying role or \"function\" of the government is one without parallel in the private sector. Under this test, the court disregards the actual conduct of the\n\nalleged tort-feasor, United States v. Feres, 340 U.S. 135, 142, 71 S.Ct. 153, 157, 95 L.Ed. 152 (1950) (quoted in Dissent, infra) (court looks to \"status of both the wronged and wrongdoer\" rather than to the \"circumstances\"), and disregards the fact that a private individual or entity would be potentially liable for the same alleged misconduct. Id. (no liability for alleged misconduct though private individuals and entities \"would undoubtedly be held liable\" for the same misconduct). The Dissent's advocacy of this test not only ignores (1) the plain meaning of the pertinent language of I.C. § 6-903(a), see majority op., supra, at p. 216, 723 P.2d at 760, and (2) the United States Supreme Court's construction of similar language in the Federal Tort Claims Act which has prevailed from 1955 to present, but also the express rejection of the purported exception in I.C. § 6-903(a).\n\nI.C. § 6-903(a) makes the state liable for tortious conduct \"whether arising out of governmental or proprietary function. . . .\"[Footnote 1] As the majority opinion explains, the Idaho legislature followed the lead of the Supreme Court in Indian Towing Co. v. United States, 350 U.S. 61, 76 S.Ct. 122, 100 L.Ed. 48 (1955); Rayonier, Inc. v. United States, 352 U.S. 315, 77 S.Ct. 374, 1 L.Ed.2d 354 (1957), and subsequent relevant Supreme Court and lower federal court decisions. See cases cited in majority opinion, supra, at pp. 218-219, 723 P.2d at p. 762-763. As the majority explains, the exception to immunity for \"governmental function[s] of governing\" which Dunbar enunciated, Dunbar, supra, 100 Idaho at\n\n546, 602 P.2d at 44, and which the Dissent now defends, is the same exception to immunity for which the federal government argued in Indian Towing and again in Rayonier. See majority op., supra at p. 217, 723 P.2d at p. 761. The Supreme Court saw this argument for what it was, an ill-founded attempt to \"resort to an alleged distinction, imported from the law of municipal corporations, between the Government's negligence when it acts in a 'proprietary' capacity and its negligence when it acts in a 'uniquely governmental' capacity.\" Rayonier, supra, 352 U.S. at 318-19, 77 S.Ct. at 376. As did the Supreme Court, the Idaho legislature declined to return to this \"'non-governmental' -- 'governmental' quagmire.\" Indian Towing, supra, 350 U.S. at 65, 76 S.Ct. at 124.\n\nTo leave no doubt, the legislature put it in writing in I.C. § 6-903(a). Significantly, neither Dunbar nor the Dissent even acknowledges the existence of the legislature's language, \"whether arising out of governmental or proprietary function.\" The reason is obvious: this language evinces the legislature's express rejection of the exception to liability advocated by Dunbar and now by the Dissent. To read language out of the Act, particularly language unambiguously expressing the legislature's intent, is judicial activism and interventionism at their utmost.\n\nBlithely skipping over this language of I.C. § 6-903(a) (which by itself settles the question of the status of the \"parallel function\" exception), the Dissent focuses upon the language in the same section \"where the governmental entity if a private person or entity would be liable for money damages under the laws of the state of Idaho. . . .\" the Dissent persists in Dunbar 's contorted reading of this language, to-wit, gratuitously adding the requirement of a parallel function in the private sector. This the Dissent does without regard to the rules of construction (1) that the 1971 legislature adopted the construction of the federal jurisdiction (the federal jurisdiction rejected such a construction), and (2) that the Act is to be construed with its beneficent purpose in mind.\n\nThere is one exception in the federal case law, upon which the Dissent seizes. That exception is where the plaintiff belongs to the military. So held the Supreme Court in Feres, supra. Notably, however, the holding in Feres was that, because \"the relationship of military personnel to the Government has been governed exclusively by federal law,\" there was no federal jurisdiction under 28 U.S.C. § 1346(b) for an action based on local law. Feres, supra, 340 U.S. at 142-26, 71 S.Ct. at 157-59 (emphasis added). Thus, the \"parallel function\" language is dicta. Id.; O. Reynolds, The Discretionary Function Exception of the Federal Tort Claims Act, 82 Georgetown L.J. 81, 99 (1968) (Indian Towing refused to extend \" Feres dictum that the act had made the Government liable only where analogous private liability was present. . . .\")[Footnote 2]\n\nRegardless, the Feres doctrine applies only in the above context, and no other. See United States v. Shearer, 473 U.S. 52, 105 S.Ct. 3039, 3043, 87 L.Ed.2d 38 (1985) (\"Although the Court in Feres based its decision on several grounds, '[i]n the last analysis, Feres seems best explained by the \"peculiar and special relationship of the soldier to his superiors, the effects of the maintenance of such suits on discipline, and the extreme results that might obtain if suits under the Tort Claims Act were allowed for negligent orders given or negligent acts committed in the course of military duty. \"' United States v. Muniz, 374 U.S. 150, 162 [83 S.Ct. 1850, 1858, 10 L.Ed.2d 805] (1963), quoting United States v. Brown, 348 U.S. 110, 112 [75 S.Ct. 141, 143, 99 L.Ed. 139] (1954).\"); 28 U.S.C.A. § 2674 note 26, Military Service Claims (Feres doctrine limited to circumstance of military personnel suing the government). The majority in Dalehite v. United States, 346 U.S. 15, 73 S.Ct. 956, 97 L.Ed. 1427 (1953) attempted to expand it further (to a firefighting function), but this part of Dalehite was overruled in Indian Towing and in Rayonier. See majority op., supra, pp. 761-762; United States v. Varig Airlines, 467 U.S. 797, 104 S.Ct. 2755, 2765 n. 10, 81 L.Ed.2d 660 (\"[T]he holding of Rayonier obviously overrules one element of the judgment in Dalehite,\" that element being the attempt to expand the parallel function test beyond the Feres context). The Supreme Court (not to mention all other federal courts) has continued to limit the Feres doctrine to its facts (involving military personnel as plaintiffs) up to the present. See majority op., supra, at pp. 218-219, 723 P.2d at pp. 762-763 (discussion of Indian Towing, Rayonier, Hatahley, Muniz, Varig, Lockheed, and cases cited in 28 U.S.C.A. § 2680 and 36 A.L.R.Fed. 240). All of these cases read the language to make the government liable for the same causes of action as private individuals, regardless of the existence or nonexistence of a \"parallel function.\" If this were not so, why did the Supreme Court hold the government liable in Lockheed Aircraft Corp. v. United States, 460 U.S. 190, 198, 103 S.Ct. 1033, 1038, 74 L.Ed.2d 911 (1983), where its \"function\" was that of the military, the quintessential \"unique governmental function\"? See majority op., supra, at p. 218, 723 P.2d at p. 762. There is no parallel function test in the federal jurisdiction outside the Feres context (involving military personnel as plaintiffs), as anyone with a rudimentary familiarity of the federal case law would know. The Dissent is unable to cite one case outside that limited context. One commentator explained:\n\nThe significance of Indian Towing 's interpretation of the Act's liability section is clear: If the Government undertakes an activity, even one not required, it will be held to the same standard of reasonable care as a private person would be, even though private persons seldom engage in that particular activity. . . .\n\nIndian Towing was no aberration as the Dissent asserts; it was reaffirmed in Rayonier and still controls the construction of the language we concern ourselves with in this case. See Varig, supra, 104 S.Ct. at 2764-65, 2765 n. 10.\n\nThe Dissent's claim that Varig \"in effect\" overruled Indian Towing (not to mention all the other cases mentioned above which are consistent with Indian Towing) is patently false. The Varig court actually restated without contradiction and thus reaffirmed Indian Towing 's holding,\n\nthereby rejecting the proposed parallel function exception and overruling a minor part of Dalehite:\n\nThe [ Indian Towing ] Court rejected the Government's assertion, reasoning that it would \"push the courts into the 'non-governmental'-'governmental' quagmire that has long plagued the law of municipal corporations.\" 104 S.Ct. at 2764.\n\nThe Court also reaffirmed Rayonier 's holding to the same effect. Id. at 2765 n. 10. Contradicting the Dissent's mistaken claim that Dalehite \"was based entirely\" on Feres ' reading of 28 U.S.C. § 2674, Varig proceeded to explain that the main part of Dalehite on which it was relying dealt with the discretionary function exception found in 28 U.S.C. 2680(a), while the main part of Indian Towing and Rayonier dealt with § 2674. Varig, supra, 104 S.Ct. at 2764-65. Varig only reaffirmed that part of Dalehite dealing with the discretionary function exception; the short section extending the Feres doctrine it left overruled. Id. The Dissent utterly fails to acknowledge this.\n\nContrary to the Dissent's reading of Varig in relation to Indian Towing and its progeny, Fifth Circuit Judge John R. Brown recently noted:\n\nThe FTCA is not, as government counsel think and continue to urge, confined to the typical fender bender automobile intersectional collision between a postal truck and a citizen's child-filled station wagon. We have still the significant, still valid, decisions in Indian Towing, Rayonier and Eastern Airlines which recognized FTCA liability in areas traditionally thought to have some government activity immunity. . . . Collins v. United States, 783 F.2d 1225, 1231 (5th Cir.1986) (Brown J., Concurring) (footnotes omitted).\n\nAn important reason Indian Towing et al. rejected the parallel function test is its inherent unworkability and flexibility to the point of eliminating any predictability. See majority op., at pp. 218-219, 723 P.2d at pp. 763-765. Presumably the Dissent concedes this point, since it fails to respond to it. And yet the Dissent would keep in place a test which potentially equates the functions of the National Park Service (functions which include those found \"unique\" in Dunbar) with those of the operators of a wild animal park. The parallel function test has no guidelines to lend it any certainty or rationality.\n\nOne danger of this test is that it potentially exposes the government to liability for policy decisions affecting vast segments of the public, so long as a \"parallel function\" can be found in the private sector. For example, Dunbar disagreed with the Dalehite holding (that the government was immune) on the basis of the existence of a parallel function, 100 Idaho at 531, 602 P.2d at 29; yet Dalehite involved high-level policy judgments which resulted in the injury and deaths of hundreds of people. Such an application of the parallel function test would have resulted in mammoth liability for what was a policy decision regarding a large number of fertilizer plants. In the Dissent's haste to uphold an ill-founded decision, it risks unwittingly opening up the government to extraordinarily broad liability based on the arbitrary and unpredictable results of the parallel function test.\n\nThe Dissent utterly fails to refute the argument that most of the express exceptions of the Idaho Act are rendered mere surplusage by a parallel function exception which would easily encompass them. See majority op., supra, at pp. 221-222, 723 P.2d at pp. 765-766. The Dissent thus impliedly concedes this argument as well. The Dissent mischaracterizes the argument as an assertion that the parallel function exception \"conflicts with the enumerated exceptions contained in I.C. § 6-904, thus swallowing the general rule and rendering it a nullity.\" The majority opinion goes quite to the contrary. The parallel function exception does not \"conflict\" with the exceptions; it swallows them (along with the general rule of liability) whole. For example, are not the activities of the Idaho National Guard unique governmental functions without parallel in the private sector?\n\nOf course they are. So why did the legislature include at § 6-904(6) an exception to liability concerning the activities of the National Guard, when the parallel function test of § 6-903(a) has already eliminated such liability? The answer must be obvious even to the most unreceptive set of ears -- because § 6-903(a) creates no such exception.\n\nCertainly, I.C. § 6-903(a) is a \"qualified general rule of liability\" as the Dissent explains, to the extent that a plaintiff must state a claim under which the government is potentially liable as \"a private person or entity would be liable. . . .\" However, as just explained, the \"qualification\" posed in Dunbar and now by the Dissent is so broad that it would render those express exceptions dealing with \"traditional governmental functions\" redundant, unnecessary, and mere surplusage. Any \"analytical\" difficulties in understanding the implications of the purported parallel function exception lie with the Dissent.\n\nIn reality, the question of the existence of a \"parallel function\" exception is easily answered. The federal case law states that there is none in the Federal Act, and I.C. § 6-903(a) says that there shall be none in the Idaho Act. The majority opinion simply acquiesces to reality.\n\nB. The Discretionary Function Exception.\n\nThe Dissent's Discussion of the discretionary function exception is more notable for what it fails to address than for what it does address. The Dissent ignores the majority opinion's analysis of the plain meaning of the exception; thus, it impliedly concedes that the two clauses of the exception establish a distinction between operational activities -- those \"in reliance upon or the execution or performance of\" statutory or regulatory policy (which are afforded immunity only when carried out with \"ordinary care\"), and planning activities -- those involving policy judgment and decision (which are afforded unqualified immunity). The Dissent declines to examine the statutory language at all. If it did, it would find that ordinary care indeed is required in some circumstances. The Dissent ignores the majority's Discussion of the federal legislative history; thus, it impliedly concedes that that history supports the planning-operational distinction. The Dissent ignores the majority opinion's Discussion of all pre-1971 federal case law with the single exception of Dalehite, supra; thus, it impliedly concedes that the pre-1971 federal case law aside from Dalehite (which case the majority opinion well explains, supra, at pp. 228-229, 723 P.2d at pp. 772-773) establishes the planning-operational distinction. Finally, the Dissent (1) ignores the majority opinion's long list of cases holding that a probation/parole officer's supervision of a probationer/parolee is operational, thereby requiring ordinary care, and (2) fails to cite one on-point case to the contrary; thus, it impliedly concedes that every on-point case holds there to be no unqualified immunity under the discretionary function exception.\n\nThe cases the Dissent does cite are considerably off-point. As the annotation it refers to explains, those cases generally deal \"with the personal, civil liability of a policeman, a sheriff, or some other peace officer, or his bond, for injury or damage suffered by a third person because of the officer's failure to enforce the law or arrest a lawbreaker.\" Annot., 41 A.L.R.3d 700, 701 (footnotes omitted). Obviously, none of these cases involve a governmental official charged with the supervision of a person of known dangerous propensities. As the majority opinion notes, supra, at pp. 225-226, 723 P.2d at pp. 769-770, a multitude of decisions have held that the government is potentially liable in the instant context.\n\nThe Dissent attempts to construe Sterling's allegations to accommodate its authority. A review of the allegations as summarized in the majority opinion, supra, at p. 213, 723 P.2d at p. 757, belies the Dissent's procrustean effort. Sterling did not simply allege that the probation officer was negligent for failing to arrest Bloom or revoke his probation. She alleged that the probationer failed to properly supervise Bloom and to properly enforce the order and agreement of probation. The probation officer could\n\nhave and should have taken any number of steps short of arrest or revocation (the latter of which Sterling's complaint acknowledged he had no authority to do). He could have ordered Bloom not to drive for recreational purposes, and not to drive a vehicle without written permission and without insurance, and to report regularly. He could have overseen Bloom's conduct to prevent these violations. Sterling's allegations are that he did none of this. Her allegations fall neatly within the confines of a permissible action against a governmental official or entity.\n\nNaturally, Sterling's claim would be barred by the holding of Chandler Supply Co., Inc. v. City of Boise, 104 Idaho 480, 660 P.2d 1323 (1983), but then so also would every claim brought against a governmental entity, whether it involved planning, policy-oriented activities or activities on the operational level. Justice Bakes, the author of Chandler, still offers no authority to support its unsupported holding. His Dissent explains the holding of Chandler as follows:\n\nThis Court has traditionally been called upon in past decisions to draw the distinction between discretionary and ministerial action by governmental entities. . . . The holding in Chandler Supply Co. v. City of Boise, 104 Idaho 480, 660 P.2d 1323 (1983), is nothing more than a recognition of those prior determinations of whether or not challenged action constitutes discretionary action will be made in the same manner as it has always been made by this Court.\n\nThe Dissent does not elaborate on exactly what the distinction is between discretionary and ministerial activity. One thing is certain, ministerial activity does not equate in Justice Bakes' mind with activities putting policy into operation, since Chandler held that operational as well as planning activities are immunized. Id. at 485, 660 P.2d at 1328. As the majority opinion notes, to except from liability both planning and operational activities is to except all governmental activities. Majority op., supra, at p. 227, 723 P.2d at p. 771. If the Dissent equates discretionary activities with \"traditional governmental functions,\" then it derives meaning from the discretionary function exception which is not there, it ignores United States Supreme Court authority to the contrary, and it ignores the pronouncement of I.C. § 6-903(a) that the government is potentially liable for \"governmental\" functions. See Majority op., supra, at p. 232, 723 P.2d at p. 776. In short, Chandler remains as it was, unsupported and unsupportable, unexplained and unexplainable -- all of which makes it eminently overrulable.\n\nSurprisingly, the Dissent searches for support in United States v. Varig Airlines, 467 U.S. 797, 104 S.Ct. 2755, 81 L.Ed.2d 660 (1984). That decision is quite in line with earlier federal precedent and with the majority opinion. In fact, today's majority opinion is consistent with the recent application of Varig in Collins v. United States, 783 F.2d 1225 (5th Cir.1986) (unanimous opinion).[Footnote 3]\n\nThe Collins court accurately explained the context of Varig:\n\nThe two cases before the Court in Varig involved in-flight fires and consequent destruction of aircraft that the FAA or its predecessor had certified under a post-check certification program. In fact, the planes did not meet FAA standards and may never have been inspected at all. Plaintiffs alleged that the FAA would have discovered the defects had it conducted a plane-by-plane inspection of the aircraft instead of delegating responsibility for satisfying FAA standards to airplane manufacturers with periodic spot checks to encourage compliance. Id. at 1228.\n\nVarig did not involve allegations of negligent inspection of aircraft or enforcement of the conditions of certification; rather, the Varig plaintiffs challenged the FAA'S\n\npolicy decision of setting the conditions for certification themselves.\n\nVarig 's context makes clear that when it speaks of the unqualified immunity of the government as a \"regulator,\" it means the government as the passer of regulations (in Varig, those regulations being the certification and inspection requirements of the two aircraft types). As the Collins court noted:\n\n[T]his [reference to the role as regulator] does not mean that all regulatory acts are discretionary acts. Following Dalehite and Varig, we are instructed that there is discretion under § 2680(a) when \"there is room for policy judgment and decision. . . .\" The exception therefore comprehends (1) \"the initiation of programs and activities\" and (2) \"determinations made by executives or administrators in establishing plans, specifications or schedules of operations.\" The exception extends to \"acts of subordinates in carrying out the operations of government in accordance with official directions.\" Dalehite, 346 U.S. at 35-36 [73 S.Ct. at 967] (emphasis added). Complemented with the learning from Varig we know that the United States is not liable for damages based on challenges necessarily directed at an agency's discretion, if it exists, in determining the extent to which it will regulate or the manner in which this will be done, even if the regulations being enforced are mandatory. Throughout an analysis of the discretionary function exception we must be mindful that a purpose of the exception is to prevent judicial second-guessing of agency decisions that involve considerations of social, economic, or political policy. 104 S.Ct. at 2765.\n\nIn the context of a challenge to a subordinate's conduct, Dalehite and Varig demonstrate that the subordinate's conduct is not within § 2680(a) just because the conduct is regulatory in nature. Section 2680(a) protects only discretionary conduct; not all regulatory conduct is discretionary conduct. Discretionary conduct requires room for policy analysis and judgment. Dalehite, 346 U.S. at 36 [73 S.Ct. at 968]. If an agency has the authority to do so, it may entrust to a subordinate's discretion decisions on the extent or manner in which regulations, even mandatory regulations, will be enforced where the decision to be made entails balancing considerations of social, economic, or political policy. This does not necessarily mean, though, that the employee whose conduct is being challenged must have made a policy decision: if an employee acts in accordance with official directions, the conduct is within § 2680(a). Id. In both cases, § 2680(a) applies because challenging the employee's conduct also challenges the agency's discretion to implement a particular regulatory scheme. Varig, 104 S.Ct. at 2768. 783 F.2d at 1229-30 (emphasis added in second paragraph) (footnote omitted).\n\nSterling challenged not the Board of Corrections or the criminal court's policy decisions concerning Bloom, but rather the implementation of that policy, which must be done \"in accordance with official directions.\" The Dissent ignores the latter qualification, but it is key to the scope of immunity under the Federal Act. To ignore this qualification in order to extend immunity to all conduct which is regulatory in nature would be, as the Collins court observed, a radical and unwarranted extension of Varig. Id. at 1228.\n\nIn Collins, the plaintiffs alleged that government officials had negligently failed to properly classify a dangerous mine despite their statutory and regulatory obligation to do so. The Collins court held such negligence to be outside the ambit of the discretionary function exception to liability:\n\nWe disagree with the government that the questioning of any regulatory act necessarily involves judicial second-guessing. Determining whether a decision involves policy at all is not the same as scrutinizing the correctness of that policy decision. To the extent that an employee refuses to carry out a mandatory statute or regulation, one which\n\nleaves him no discretion in the manner or extent to which it will be enforced, the employee is simply disobeying a flat command. Id. at 1231 (emphasis added).\n\nSterling similarly alleges that Bloom's probation officer disobeyed the commands of the agreement and order of probation. This he lacked the discretion to do. Accordingly, even under the holdings of Dalehite and Varig, viewed apart from the rest of federal case law (which of course we should not do), Sterling states a claim for negligent failure to carry out the policy of Bloom's probation \"in accordance with official directions.\"\n\nThe extent to which the Dissent misconstrues the case law on the discretionary function is revealed in its use of the following quote:\n\nIn the difficult cases it [the planning/operational distinction] will only \"prove to be another example of a distinction 'so finespun and capricious as to be almost incapable of being held in the mind for adequate formulation.'\" Smith v. United States, 375 F.2d at 246. Dissenting op. of Bakes, J., infra.\n\nThe language the Smith court was quoting was from Indian Towing. Unfortunately for the Dissent, what the Indian Towing Court was referring to was not the planning-operational distinction, but was the distinction between governmental and non-governmental functions, the very distinction which the Chandler holding appears to advocate. Here as elsewhere, when analyzed, the authority to which the Dissent resorts cuts against its position rather than for it.\n\nII. TORT LAW\n\nAs with the authority the Dissent relies on concerning governmental immunity, the cases and commentaries concerning tort law upon which it relies, far from supporting its position, actually undermine it even further. Furthermore, the arguments the Dissent makes in Part II contradict the record and our standard of review.\n\nA. New Causes of Action.\n\nThe Dissent begins by contending that the majority has interpreted the Idaho Tort Claims Act as creating a new cause of action -- the negligent supervision of a probationer. This, the Dissent argues, the Act forbids. The Dissent misconstrues the majority opinion.\n\nNowhere does the majority hold that the Act creates the tort of negligent supervision, and in no way can the Act be viewed as creating this tort or any other tort. What the majority opinion does say about Idaho's Act, and what the United States Supreme Court has said about the Federal Act, is simply that with the enactment of these two Acts, the Idaho legislature and Congress both intended to make governmental entities responsible for their conduct in certain circumstances, whereas in the past they had enjoyed absolute immunity.[Footnote 4] Thus, it is easy to understand why the Supreme Court found this change in the law by Congress \"novel and unprecedented,\" Rayonier, supra, 352 U.S. at 319, 77 S.Ct. at 377, given the fact that up to the enactment of the Federal Act, federal government entities enjoyed absolute immunity. This same reasoning applies to the Idaho Act and the Idaho legislature's intent. Clearly, the majority has not created a new tort out of the Idaho Act, but merely made the state liable for the same torts as are private persons and entities. The Dissent's characterization of what the majority has said on this point is therefore erroneous.\n\nThe Dissent's reliance upon I.C. § 6-903(f) also is groundless. That section is clear and straightforward. It states in pertinent\n\npart: \"[N]othing in this act shall enlarge or otherwise adversely affect the liability of an employee or a governmental entity. Any immunity or other bar to a civil lawsuit under Idaho or federal law shall remain in effect.\" What the first sentence of § 6-903(f) does is prohibit the creation of causes of action based on the fact that the defendant is a governmental entity. In other words, the viability of a cause of action will not be dependent upon whether the defendant is a private individual or a public entity. The second sentence simply makes clear that Idaho's Act does not preempt other specific grants of immunity. For example, I.C. § 20-231 specifically immunizes public entities and public employees from injuries resulting from a decision either to place a prisoner on parole or to revoke a prisoner's grant of parole. Thus, pursuant to § 6-903(f), that specific grant of immunity is valid regardless of the scope of liability under the Act.\n\nThe Dissent misunderstands both what the majority and the Supreme Court have said regarding the changes wrought by the respective tort claims acts, and also what § 6-903(f) states. The novelty of the acts is that they made formerly immune governmental entities responsible for their conduct; tort law itself remained unchanged. If there be anything \"novel and unprecedented\" relative to this issue, it rests solely in the Dissent's reasoning process.\n\nB. Duty.\n\nThe majority opinion more than adequately explains the basis for the duty that the probation officer owed to those people foreseeably endangered by Bloom. The cases and commentaries that the Dissent relies upon are either unpersuasive or not on point. I will address each of them in turn.\n\nThe Dissent begins its analysis by citing Prosser \u0026 Keaton, The Law of Torts, §§ 37, 53 (5th ed. 1981). Conveniently unmentioned is section 56, from which the majority, at pp. 224-225, 723 P.2d at pp. 768-769, extensively quotes, and which unequivocally states that with respect to relationships that are custodial in nature, the individual who has custody of another has a duty to control his or her charge and \"to guard other persons against his dangerous propensities.\" Prosser, supra, § 56. Alas, the Dissent can derive no support from Dean Prosser and Professor Keaton.\n\nThe Dissent next cites Jacobson v. McMillan, 64 Idaho 351, 132 P.2d 773 (1943), for support. Because this is a prior decision of this Court, albeit now 43 years old, a close look is warranted. In Jacobson, as the Dissent states, Dan O'Connor attempted to shoot his wife. A criminal complaint was filed and the husband was arrested by defendant McMillan, a sheriff, and taken before a probate Judge for a preliminary hearing. The Judge ordered O'Connor committed to the Kootenai County jail pending trial on charges of assault with a deadly weapon. Although an information was filed, no trial was held and no bond was ever furnished for O'Connor's release. The commitment order was never rescinded. Sheriff McMillan, believing O'Connor was suffering from a mental defect, transferred O'Connor outside the county to the State Hospital in Blackfoot for observation. There, O'Connor was released to the custody of the hospital Super-intendent, Cromwell. While still in the custody of Cromwell, O'Connor was permitted to go out of the hospital unattended and onto the hospital grounds. As a result, O'Connor escaped from the hospital. Several months later, with shotgun in hand, O'Connor returned to his wife's residence and, in attempting to shoot her, wounded Jacobson who had been specifically hired to protect the wife from O'Connor.\n\nJacobson brought suit against both Sheriff McMillan and Superintendent Cromwell and their respective sureties. In his complaint, Jacobson alleged that his injuries were the proximate result of the negligence of the sheriff and the superintendent whose acts were in direct violation of the court order committing O'Connor to the county jail. Defendants moved to dismiss the complaint, which the trial court granted.\n\nOn appeal, this Court in a 3-2 vote affirmed.\n\nThe majority's holding in Jacobson is not based upon any Conclusion that there was no duty owed by Sheriff McMillan to plaintiff Jacobson, as the Dissent asserts. That the Jacobson majority contains some language to this effect in the opinion is true, but it is clear from reading the majority and Dissenting opinions that the language was mere dicta.\n\nThe majority began its analysis by stating that Jacobson knew of O'Connor's \"affection with homicidal insanity.\" Id. at 357, 132 P.2d at 776. The majority further stated: \"Possessed of such knowledge, appellant [Jacobson] took employment and voluntarily placed himself in a position, subjecting himself to any attack that might be made by O'Connor.\" Id. at 357, 132 P.2d at 777 (emphasis added). The majority held that this decision to work for O'Connor's wife was the \" proximate cause of appellant's injuries.\" Id. (emphasis added). The majority went on to say that Sheriff McMillan and Superintendent Cromwell \"were in no way responsible for appellant's presence at the home of Grace Work O'Connor [the wife] and neither directly nor indirectly subjected appellant to the danger from which he suffered.\" Id.\n\nThe majority concluded that \"[t]he acts of the sheriff and the superintendent, in permitting O'Connor to escape and be at large, were only a remote cause in comparison with the negligence of appellant, which could not have been reasonably foreseen or anticipated. . . .\" Id. at 360, 132 P.2d at 778 (emphasis added). Thus, the majority's reason for affirming the dismissal of the complaint was based upon principles of assumption of risk and contributory negligence, which, at that time and until the advent of comparative negligence in 1971, operated as a complete bar to recovery; the Court's decision was not based upon the absence of a duty. In closing, the majority stated:\n\n[A]ppellant (according to his complaint) had every reason to believe that he would be attacked by O'Connor, if the latter should escape or be released and found appellant at the O'Connor residence. He hired to take the risk.\n\nAppellant knew of the dangers of employment, when he entered the service, and while he did not know and could not foresee the escape of O'Connor from custody, still his employment, in anticipation of some such exigency, was for the purpose of guarding against just such a contingency as arose.\n\nIt may be urged that the action of respondents, sheriff and superintendent, in permitting O'Connor to escape, so increased or augmented the dangers which appellant risked as to render them legally liable for negligence. The answer, however, to such a suggestion is, that, under appellant's complaint, there would have been no such danger to increase or augment, had appellant not undertaken the hazardous task he assumed. Id. at 360-61, 132 P.2d at 778 (emphasis added).\n\nIt is interesting to note that Jacobson has been cited to only once by this Court. In Weaver v. Pacific Finance Loans, 94 Idaho 345, 347, 487 P.2d 939, 941 (1971), Chief Justice Donaldson cited Jacobson for the proposition that in order for plaintiff's allegations to merit recovery, the \"defendant's conduct [must be] shown to be the proximate cause of plaintiff's injury. Jacobson v. McMillan, 64 Idaho 351, 132 P.2d 73 (1943).\" (Emphasis added.) This is exactly what Jacobson stands for, and no more than that.\n\nThompson v. County of Alameda, 27 Cal.3d 741, 167 Cal.Rptr. 70, 614 P.2d 728 (1980), is the next case the Dissent cites. It, too, provides no support. First of all, Thompson involved the alleged negligent release by the county of a juvenile offender -- not the continuing supervision of a probationer or parolee. Our facts, as the Dissent knows, involve the latter. Second, and more importantly, Thompson 's rationale for its holding is not applicable here. In Thompson, parents sued Alameda County for the wrongful death of their five-year-old son, alleging that the county had\n\nacted recklessly in releasing from custody a juvenile delinquent who was known to have dangerous and violent propensities toward young children, and who, twenty-four hours after being released to the custody of his mother, murdered the plaintiffs' son. The California Supreme Court rejected the plaintiffs' argument, stating that Alameda County had no affirmative duty to warn the plaintiffs of the juvenile delinquent's dangerous tendencies upon its decision to release the juvenile. The court reasoned that \"plaintiffs' decedent was not a known, identifiable victim, but rather a member of [a] large amorphous public group of potential targets.\" Id. 167 Cal.Rptr. at 80, 614 P.2d at 738.\n\nI have no quarrel with Thompson. It denied liability because there was no \" special relationship \" between the county and either the victim or the person committing the harm. (Here there is such a relationship between the Board and the perpetrator.) The Thompson court, however, approvingly quoted and applied §§ 315-319 of the Restatement (Second) of Torts. Said the Thompson court:\n\nLikewise in Tarasoff we were concerned with the duty of therapists, after determining that a patient poised a serious threat of violence, to protect the \"foreseeable victim of that danger.\" (Tarasoff, supra, 17 Cal.3d [425] at p. 439, 131 Cal.Rptr. 14, 551 P.2d 334.) In reaching the Conclusion that the therapists had a duty to warn either \"the endangered party or those who can reasonably be expected to notify him, . . .\" (id. at p. 442, 131 Cal.Rptr. at p. 27, 551 P.2d at p. 347), we relied on an exception to the general rule that one owes no duty to control the conduct of another. (Id., at p. 435, 131 Cal.Rptr. 14, 55 P.2d 334; see Rest.2d Torts (1965) §§ 315-320.) As declared in section 315 of the Restatement such a duty may arise if \"(a) a special relation exists between the actor and the third person which imposes a duty upon the actor to control the third person's conduct OR (b) a special relation exists between the actor and the other which gives the other a right to protection.\" Id. 167 Cal.Rptr. at 75-76, 614 P.2d at 733-34 (emphasis added).\n\nThis reasoning is applicable here, and argues for the existence of a duty where a special relationship exists between an actor (such as a probation officer) and a third person in need of control (such as a probationer).\n\nThe California Supreme Court has continued to quote from and apply § 315 of the Restatement. See Peterson v. San Francisco Community College District, 36 Cal.3d 799, 205 Cal.Rptr. 842, 685 P.2d 1193, 1196 (1984); Davidson v. City of Westminster, 32 Cal.3d 197, 185 Cal.Rptr. 252, 649 P.2d 894, 897 (1982).\n\nThe Dissent states that Thompson as well as cases from Washington, New York, Kansas, and Florida stand for the proposition that except where there are sufficient personal contacts by the police or probation officers with a particular individual upon which that individual relies for safety or protection, there is no legal action. This is simply false. As the above quote from Thompson states, not only does a duty arise where there is a special relationship between a government official and the victim, a duty also exists where there is a special relation between the government official and the third person who commits the harm.[Footnote 5]\n\nThat duty is reflected in Restatement § 315, which Thompson, Peterson, and Davidson all quoted and applied. The majority opinion establishes the same general duty in its quotation from Dean Prosser on page 25: \"The general duty which arises in many relations to take reasonable precautions for the safety of others may include the obligation to exercise control over the conduct of third persons.\" For this proposition Dean Prosser cites in a footnote none other than § 315.\n\nSection 319, which the majority opinion adopts, merely delineates the specific special relationship between those charged with the supervision of persons with dangerous propensities and their charges. It hardly can be argued that California has rejected § 319 when it has expressly adopted § 315, of which § 319 is but a subcategory. The California court, like all others of which I am aware to date, recognizes that a duty arises out of certain special relationships with third persons. Just such a relationship existed between Bloom and his probation officer.\n\nThe New York case cited to by the Dissent, Sorichetti v. City of New York, 65 N.Y.2d 461, 492 N.Y.S.2d 591, 482 N.E.2d 70 (1985), and the Washington case, Chambers-Castanes v. King County, 100 Wash.2d 275, 669 P.2d 451 (1983) similarly fail to support it. Both involved only allegations that police officers had failed to properly respond to the plaintiffs' call for help; neither case involved any third party at all. In addition, in Chambers-Castanes, the Washington court stated that the plaintiffs had alleged facts, which, if found to be true, would correctly place them in a special relationship with the police and sent the case back for trial. Chambers-Castanes, supra, 669 P.2d at 457.\n\nFurthermore, the Dissent neglects to cite another 1983 Washington case, Petersen v. State, 100 Wash. 421, 671 P.2d 230 (1983), wherein the Washington Supreme Court expressly adopted and applied § 315 of the Restatement (Second) of Torts. In Petersen, the court held that a state psychiatrist who had diagnosed as schizophrenic an individual whose vehicle subsequently struck and injured the plaintiff at an intersection had a duty to take reasonable precautions to protect a person such as the plaintiff who might foreseeably be endangered by the individual's drug-related mental problems. Id. at 236-37. If further support needs to be provided for the virtually universal acceptance of § 315, the Washington Court provided it, citing to Lipari v. Sears, Roebuck \u0026 Co., 497 F.Supp. 185, 188 (D.Neb.1980); Bradley Center, Inc. v. Wessner, 161 Ga.App. 576, 287 S.E.2d 716 (1982), aff'd 250 Ga. 199, 296 S.E.2d 693 (1982); McIntosh v. Milano, 168 N.J.Super. 466, 403 A.2d 500 (1979). Petersen, supra, 671 P.2d at 236.\n\nIn Sorichetti, the New York Court of Appeals affirmed a jury verdict in favor of the plaintiff, stating that the facts in the case showed that a \"'special relationship' existed between the police and [the plaintiff] such that the jury could properly consider whether the police conduct satisfied the duty of care owing to [plaintiff].\" Sorichetti, supra, 492 N.Y.S.2d at 597-98, 482 N.E.2d at 471. The New York Court purported in no way to restrict liability to special relationships between the police and the victims. It did not need to deal with any special relationship existing between the police or a parole or probation officer and the person doing the harm because no such relationship was alleged or argued. Consequently, no such Discussion was necessary to resolve the issue before it.\n\nA fair reading of Sorichetti and Chambers-Castanes, which both recognized liability on the part of governmental conduct where special relationships exist, reveals that they are harmonious with § 315, and, far from supporting the Dissent's position, actually undermine it further. That fact is further validated by the Washington Supreme Court's subsequent adoption of § 315 in Petersen, of which § 319 is a subcategory. The same can be said for the Kansas and Florida cases, Everton v. Willard, 468 So.2d 936 (Fla.1985), and Dauffenbach v. City of Wichita, 233 Kan. 1028, 667 P.2d 380 (1983).\n\nIn Everton, the Florida Supreme Court had before it the issue of \"whether to enforce the law by making an arrest is a basic judgmental or discretionary governmental function that is immune from suit, regardless of whether the decision is made by the officer on the street, by his sergeant, lieutenant or captain, or by the sheriff or chief of police.\" Everton, supra, 468 So.2d at 937 (emphasis added). The court\n\nanswered the issue in the affirmative, relying upon Trianon Park, supra, which held that governmental entities are immune when they are exercising their discretionary power to enforce compliance with laws.\n\nSignificantly, in arriving at this Conclusion, the court additionally stated: \"if a special relationship exists between an individual and a governmental entity, there could be a duty of care owed to the individual.\" Id. at 938 (emphasis added). No such relationship, however, existed in Everton: the police had not accepted the specific responsibility for the protection of the victim, and there was no evidence that the State had any custodial relationship or other responsibility for the tort-feasors' behavior. Accordingly, rather than rejecting the Restatement (Second) of Torts §§ 315-319, Everton is a proper application of those sections. Furthermore, the holding in Everton is grounded in discretionary immunity and not in any rejection of the tort of negligent supervision.\n\nIn Dauffenbach, the plaintiff sued two police officers and the City of Wichita for the excessive use of force in arresting the plaintiff. The facts conclusively show that the police officers in the case had no \"special relationships\" with the plaintiff. In fact, like Sorichetti, supra, and Chambers-Castanes, supra, there was no third party involved at all in Dauffenbach. Accordingly, as is the case with Everton, Sorichetti, Thompson, Chambers-Castanes, and Petersen, Dauffenbach is but an application of §§ 315-319. The cases upon which the Dissent relies, far from sustaining it, unequivocably contradict its position.\n\nThe Dissent next argues at page 263, 723 P.2d at page 807 that the majority today creates \"a new tort of negligent supervision.\" This is incorrect. As the majority notes, this Court in Doe v. Durtschi, supra, recognized that there could be a cause of action for the negligent retention and supervision of a school teacher who later commits a tort on a third person, relying in part upon the Restatement (Second) of Torts, § 449. There is no benefit in belaboring the obvious, other than to point out that the majority opinion today has created no \"new tort law\"; the majority opinion on the issue of duty is merely an application of universally accepted concepts of tort law -- which are found both in Idaho and elsewhere. The majority's recognition of the tort of negligent supervision is but the application of Durtschi and the overwhelming majority of case law from other jurisdictions.\n\nIn footnote 14, p. 264, 723 P.2d at p. 808, the Dissent concludes its argument on this point by stating that this Court has rejected the tort of \"negligent supervision\" in Pedigo v. Rowley, 101 Idaho 201, 610 P.2d 560 (1980). This, too, is incorrect. In Pedigo, the defendant filed a claim for contribution against a parent, arguing that the parent's negligent supervision of the plaintiff-child contributed to the injuries of the child. The Court held that the doctrine of parental immunity barred the action, not that there was no such tort. Id. at 205, 610 P.2d at 564.\n\nFurthermore, as counsel pointed out at oral argument, Pedigo does not stand for the proposition that where a negligently supervised child commits a tort against a third party, there is no action against the parent by the third party. In Pedigo the plaintiff-child was floating on an air mattress in the lake and did not hurt anyone when she was run over by a boat; there is simply no allegation that the child hurt anyone due to her parent's negligent supervision. Here we are dealing with a fact pattern where a negligently supervised probationer physically committed a tort upon another person. Thus, not only does Pedigo not stand for what the Dissent says it stands for, it also is not factually analogous.\n\nC. Proximate Cause.\n\nThe Dissent's arguments on proximate cause need not be discussed at length. The Dissent has forgotten that for purposes of this appeal, the defendant -- the State of Idaho -- has admitted that the acts of its probation officer were both negligent and the proximate cause of the plaintiff's damages. In its brief, the defendant states:\n\n\"To the extent that on a Motion for Judgment on the Pleadings, the Defendant admits the allegations within the Plaintiff's complaint, the Defendant agrees with the Plaintiff's statement of the facts.\" Respondent's Brief, p. 1 (emphasis added). In appellant's brief and in the record before us, it has been alleged that the probation officer's admitted negligence \"proximately caused\" the plaintiff's injuries. Accordingly, for the purposes of this appeal, there is no issue of proximate cause, and the Dissent's Discussion on the matter serves merely to confuse and obfuscate the issues.\n\nContained within the Dissent's Discussion of proximate cause, however, are allegations that amount to nothing more than scare tactics. First is the allegation that \"[t]he effect of the majority opinion today is that every probationer who violates any term of his probation must be arrested, or the state will be liable in tort for any subsequent violations which that probationer may incur.\" This is patently untrue. As previously explained, Sterling did not allege that the state was required to arrest Bloom, but merely to use \"ordinary care\" in his supervision. If the probation officer did supervise Bloom with \"ordinary care\" (which obviously does not necessarily involve arrest), then there will be no liability. The Dissent apparently has forgotten that the result of today's opinion is not to hold the state liable for the allegedly negligent acts of its probation officer in this case, but to hold that the state may be liable depending upon a determination of the facts by a jury. The majority opinion, of course, intimates no view about the defendant's culpability.\n\nThe Dissent's next assertion is equally off-base. It is that parole and probation officers will be unable to exercise discretion in managing their charges, and that today's opinion \"substitutes the tort law system for planning and policy decisions made by the Idaho legislature.\"[Footnote 6] In no way does today's opinion substitute Idaho's tort law system for the present parole and probation system. The Idaho legislature made no decision on the supervision of Bloom, which is the only question before us. As for the Board, its policy decisions regarding probation and parole remain immune under the \"discretionary\" function exception; only the implementation of policy decisions carries with it the requirement of ordinary care. In short, far from creating chaos, the majority opinion today brings order to the chaos and confusion that was created by Chandler, supra, and Dunbar, supra; far from requiring new legislation, the legislature can be assured that the incorrect interpretation and emasculation of its Tort Claims Act perpetrated by Dunbar and Chandler have been corrected, and the wrongs created by Chandler and Dunbar have been remedied.\n\nD. Course and Scope of Employment.\n\nThe Dissent's final argument in Part II is that the state is immune because its probation officer's negligent conduct placed him outside the scope of his employment. Again, this argument is irrelevant, since the Board conceded Sterling's allegation that the probation officer was acting within the scope of his employment. Aside from this conclusive fact, the Dissent's argument misconstrues employer-employee law.\n\nWere the Dissent's argument valid, there would never be employer liability for the negligent acts of its employees, because, by the Dissent's definition, those negligent acts would place the employee outside the scope of his employment. In short, the Dissent's argument would lead to the Conclusion that the doctrine of respondeat superior is void. A review of a wealth of case law shows the fallacy of such views.\n\nThe universal rule of respondeat superior is that an employer is liable for negligent acts or omissions of its employee committed in the scope of his or her employment. Scrivner v. Boise Payette Lumber Co., 46 Idaho 334, 268 P. 19 (1928);\n\nSmith v. Thompson, 103 Idaho 909, 911, 655 P.2d 116, 118 (Ct.App.1982); see also Williams v. Alyeska Pipeline Service Co., 650 P.2d 343 (Alaska 1982); State ex rel. City of Havre v. District Court of Twelfth Judicial District in and for Hill County, 187 Mont. 181, 609 P.2d 275 (1980), cert. denied, 449 U.S. 875; Nabors v. Harwood Homes, Inc., 77 N.M. 406, 423 P.2d 602 (1967). The test for whether an employee was acting within the scope of his employment when he or she committed a tort is the \"right to control reserved by the employer over the functions and duties of the agent.\" Van Vranken v. Fence-Craft, 91 Idaho 742, 747, 430 P.2d 488, 493 (1967); Koch v. Elkins, 71 Idaho 50, 57, 225 P.2d 457, 462 (1950). In other words, the doctrine of respondeat superior is applicable during the period of time in which the principal has the right to control the employee's actions. McCauley v. Ray, 80 N.M. 171, 453 P.2d 192 (1968). This analysis focuses on whether the act or omission is of a kind that the employee was hired to do or supposed to do, and whether the act or omission occurred substantially within the authorized limits of time and space. Stanfield v. Laccoarce, 284 Or. 651, 588 P.2d 1271 (1978).\n\nApplying this test, it is clear that Sterling has adequately alleged facts that, if found to be true, would place Bloom's negligence within the course and scope of his employment. The alleged negligence -- a failure to supervise Bloom in a reasonable way -- involves conduct for which the probation officer was specifically hired. The mere fact that this conduct may be negligent does not take it outside the course and scope of the probation officer's employment, as both Idaho case law and case law from other jurisdictions point out.\n\nIt is clear that the Dissent's novel view of respondeat superior is not the law of Idaho or of any other jurisdiction which I could discover. Therefore, its arguments on this point are without merit.[Footnote 7]\n\nIII. PROSPECTIVE APPLICATION\n\nThe Dissent's last argument is that today's decision should only apply prospectively, apparently excluding even Sterling from the benefits of her appeal. Such an argument contradicts controlling law on this matter. In Jones v. Watson, 98 Idaho 606, 608, 570 P.2d 284, 286 (1977), this Court stated that \"the determination of whether an overruling decision will be applied retroactively or prospectively, is a matter left to state courts for determination on a case-by-case basis.\" Quoting from Warwick v. State ex rel. Chance, 548 P.2d 384, 393 (Alaska 1976), the Court continued: \"'A state supreme court has unfettered discretion to apply a particular ruling either purely prospectively, purely retroactively, or partially retroactively, limited only \"by the juristic philosophy of Judges . . . their conceptions of law, its origin and nature.\" The decision is not a matter of law but a determination based on weighing the merits and demerits of each case.'\" Jones, supra, 98 Idaho at 608, 570 P.2d at 286 (emphasis added). In making this determination, three criteria are considered: \"1) the purpose of the decision, 2) reliance on the prior rule of law, and 3) the effect upon the administration of Justice.\" Id. at 609, 570 P.2d at 287.\n\nIn Thompson v. Hagan, 96 Idaho 19, 25, 523 P.2d 1365, 1371 (1974), this Court noted three different approaches to retroactivity:\n\nThe first approach is the traditional rule which is derived from the concept that courts do not pronounce new law, but only discover the true law. Under this approach there are no new decisions, but only clarifications of the true law which makes a decision applicable to both past and future cases. The second approach\n\nis the prospective rule. Under this rule a decision is effective only in future actions, and does not affect the rule of law in the case in which the new rule is announced. The third approach is the modified prospective rule which is a combination of the traditional and prospective rules. Under the modified prospective rule, the new decision applies prospectively and to the parties bringing the action resulting in the new decision; or to the parties bringing the action and all similar pending actions. (Emphasis added.)\n\nAfter considering each approach, the Court adopted the third approach in Thompson, holding that the effect of its ruling -- a decision that Idaho's guest statute was unconstitutional -- would apply to the parties of the case, all pending actions at the date of this decision, and all actions arising in the future. Id.\n\nIn Dawson v. Olson, 94 Idaho 636, 639, 496 P.2d 97, 100 (1972), this Court acknowledged the \"plaintiffs' legitimate interest in compensation after undertaking the effort and expense of bringing the issue before us.\" Accord Sims v. State, 94 Idaho 801, 803, 498 P.2d 1274, 1276 (1972). In Dawson, we specifically stated:\n\nIn the torts area, the likelihood that an injured party will undertake extended and costly litigation without hope of compensation, simply to establish a new doctrine, is slight unless the injury is recurring in nature. Smith arose from a single incident, an automobile accident on a bridge maintained by the Department of Highways. Only by applying the decision to the plaintiffs at bar could their legitimate interest in compensation, after trying and appealing the issue, have been satisfied. Dawson, supra, 94 Idaho at 639 n. 6, 496 P.2d at 100 n. 6 (emphasis added).\n\nIn Smith v. State, 93 Idaho 795, 808, 473 P.2d 937, 950 (1970) -- the case upon which the Dissent hangs its argument -- this Court applied its holding (that the doctrine of sovereign immunity should be abolished) to the parties to the appeal, and to all causes of action arising subsequent to 60 days after the adjournment of the First Regular Session of the Forty-First Idaho State Legislature.\n\nThus, it is clear that the Dissent has cited not one case that would countenance its apparent proposal of declining to apply the majority's holding to the parties to this appeal. Reason also defies that which the Dissent would do.\n\nFirst, the action by this Court in Smith -- abolishing the judicial doctrine of sovereign immunity -- is far more dramatic than the reinterpretation and setting aright of that which the Idaho legislature had provided. Thus, if, under the circumstances of Smith, this Court was willing to apply its result to the parties of that case, then a fortiori, this Court should be willing to apply its holding today to the parties of this case. In contrast with Smith, today's decision does not change a Judge-made doctrine; it restores a statute to its original intent. To fail to apply our holding at least to the instant parties would be to prolong the thwarting of the legislature's will. Second, as the Dawson Court put it: \"Only by applying the decision to the plaintiff at bar could [her] legitimate interest in compensation, after trying and appealing the issue, have been satisfied.\" Dawson, supra, 94 Idaho at 639 n. 6, 496 P.2d at 100 n. 6.\n\nThird, the overruling of Dunbar and Chandler can hardly be viewed as unexpected. Over one year ago, I unequivocably stated that Dunbar and Chandler did not command a majority of this court, quoting from the Dissenting opinions filed in Chandler by Justices Donaldson and Bistline. Merritt v. State, 108 Idaho 20, 27, 696 P.2d 871, 878 (1985) (Huntley, J., Dissenting). From that date until now, it was clear to all those who could add two plus one that both Chandler and Dunbar were terminally ill.\n\nIn summary, the Dissent's argument on this matter is without authority or reason. Because this issue was not raised on appeal, it was not briefed. It was for this reason that the majority opinion did not\n\naddress the issue. Suffice it to say, however, that the opinion applies at least to the parties to this case, as in Smith, supra. Any other result would produce the type of inJustice that the people of Idaho have had to endure under the now defunct opinions of Dunbar and Chandler.[Footnote 8]\n\nConclusion\n\nToday's decision restores balance to a system that had been seriously disrupted and skewed. The importance of this balance is essential not only because principles of fairness require it, but also because the very principles of democracy demand it. I close with that which I have previously stated:\n\nRecent decades have seen dramatic growth in the body of constitutional law as citizens have sought protection of their individual and collective rights through the nation's courts. This may be partly a result of the growth of government, which has great potential to overlook the interests of individuals and minority groups as it increases in size and complexity. It is also likely due to an increasing awareness of the relationship of government to its citizens. We recognize the need for a continuing balance between the interests of government and the interests of individuals.\n\nIn a democracy, the government is permitted to assume its role of governing only at the sufferance and with consent of those governed. Thus, when the government acts arbitrarily or unfairly in its dealings with the people, the basic foundations of the democracy are weakened. To the extent a government wrongs its citizens and permits that wrong to go without redress, it loses a part of its license to govern.\n\nIt is not surprising that recent decades have also witnessed a surge of developments in the area of governmental liability in tort. Both constitutional law and governmental liability law represent an attempt to reconcile the tension between the power of government and the rights and integrity of the individual. There is only slight conceptual difference between the due process clause of our state or federal constitution and the principle of governmental accountability for its torts. In the former, citizens are assured that the state cannot take from them their rights or property without due process, and property may not be taken in eminent domain unless the citizen receives just compensation. In the latter, government or its agents may not injure citizens or their property in the course of government activities without affording them a proper remedy.\n\nBecause the doctrine of governmental immunity in tort is so much involved with the fundamental relationship of government to its citizens, it is important that courts and legislatures alike give careful consideration to all laws which deal with it. The judiciary should be particularly conscious of its determinations, and view them in light of the underlying considerations at stake. What may be at stake is the citizens' respect for, and trust in government. Certainly the judiciary should take care to discern the objectives of the people as they are expressed through their elected representatives, and enacted into law. Where the legislature has acted to resolve the problems created by governmental immunity, judicial action should be all the more considered. In the words of Justice Cardozo: \"The exemption of the sovereign from suit involves hardship enough where consent has been withheld. We are not to add to its rigor by refinement of construction where consent has been announced.\" [ Anderson v. John L. Hayes Const. Co., 243 N.Y. 140, 147, 153 N.E. 28, 29 (1926).]\n\nHuntley, Prologue, Sovereign Immunity and Reemergence of the Governmental/Proprietary Distinction: A Setback in Idaho's Governmental Liability\n\nLaw, 20 Idaho L.Rev. 197-98 (1984).\n\nBAKES, Justice, Dissenting:\n\nTo reach their result in the present case, the majority has overturned our prior case law interpreting the Idaho Tort Claims Act (ITCA). But that is not all. To achieve their result, the majority has also had to make fundamental tort law changes, overturning our prior case law and creating a new tort (negligence supervision) which, prior to the present opinion, was non-existent under the laws of this state. Finally, the majority makes all these changes retroactively, contrary to the express language of the Idaho Tort Claims Act and our prior case of Smith v. State, 93 Idaho 795, 473 P.2d 937 (1970). For all these reasons I Dissent.\n\nI.\n\nGovernmental Immunity\n\nA. The \"parallel function\" test.\n\nThe \"parallel function\" or \"parallel liability\" test enunciated in Dunbar v. United Steelworkers of America, 100 Idaho 523, 602 P.2d 21 (1979), contrary to the majority's assertion, is founded on the express wording of the ITCA and is in harmony with the decisions of both the federal courts and the courts of our sister states interpreting similar language in their counterparts to our tort claims act.\n\nIt was the United States Supreme Court's decision in United States v. Feres, 340 U.S. 135, 71 S.Ct. 153, 95 L.Ed. 152 (1950), which established that the statutory language \"in the same manner and to the same extent as a private individual under like circumstances\" contained in both the Federal and the Idaho Tort Claims Acts required a parallel liability or parallel function analysis. Feres was a case involving three combined claims, two for medical malpractice by military doctors and a third for negligent maintenance of a heating plant in an Army barracks in New York state. In applying the above quoted language, the Court in Feres stated:\n\n\"One obvious shortcoming in these claims is that plaintiffs can point to no liability of a 'private individual' even remotely analogous to that which they are asserting against the United States. We know of no American law which ever has permitted a soldier to recover for negligence, against either his superior officers or the Government he is serving. Nor is there any liability 'under like circumstances,' for no private individual has power to conscript or mobilize a private army with such authorities over persons as the Government vests in echelons of command. The nearest parallel, even if we were to treat 'private individual' as including a state, would be the relationship between the states and their militia. But if we indulge plaintiffs the benefit of this comparison, claimants cite us no state, and we know of none, which has permitted members of its militia to maintain tort actions for injuries suffered in the service, and in at least one state the contrary has been held to be the case. It is true that if we consider relevant only a part of the circumstances and ignore the status of both the wronged and the wrongdoer in these cases we find analogous private liability. In the usual civilian doctor and patient relationship, there is of course a liability for malpractice. And a landlord would undoubtedly be held liable if an injury occurred to a tenant as the result of a negligently maintained heating plant. But the liability assumed by the Government here is that created by 'all the circumstances,' not that which a few of the circumstances might create. We find no parallel liability before, and we think no new one has been created by, this Act. Its effect is to waive immunity from recognized causes of action and was not to visit the Government with novel and unprecedented liabilities.\" Feres, 340 U.S. at 141-142, 71 S.Ct. at 157 (emphasis added.)\n\nThat analysis in Feres was further supported by the fact that 28 U.S.C. 2680(j)\n\ncontained an exception to liability under the Tort Claims Act for \"any claim arising out of the combatant activities of the military or naval forces, or the Coast Guard, during time of war.\" (Emphasis added.) Thus, Congress had specifically excepted the waiver of immunity of the military forces, but only for \"combatant activities . . . during time of war.\" The Feres case arose from circumstances which were \"non-combatant activities in peace,\" and accordingly the conduct in question in those three combined cases did not fall within any exception in Section 2680 of the Tort Claims Act. If anything, the negative inference of subsection (j) would be that, when the country was at peace, claims arising out of the non-combatant activities of the military would be subject to the tort claims waiver of immunity. Nevertheless, the Supreme Court held that, \"We find no parallel liability before, and we think no new one has been created by, this Act.\" 340 U.S. at 142, 71 S.Ct. at 157.[Footnote 1]\n\nThus the \"parallel liability\" or \"parallel function\" analysis commenced, not with our Idaho Dunbar case as the majority opinion mistakenly asserts, but with the Supreme Court's first analysis of the Federal Tort Claims Act in Feres. The decision in the Feres case has been reaffirmed by the United States Supreme Court in every case since that time to, and including, its most recent unanimous pronouncement (8-0), in United States v. Shearer, 473 U.S. 52, 105 S.Ct. 3039, 87 L.Ed.2d 38 (1985). The sole wavering in an otherwise straight line of cases was the United States Supreme Court's 5-4 decision in Indian Towing, which was critical of the earlier case of Dalehite v. United States, 346 U.S. 15, 73 S.Ct. 956, 97 L.Ed. 1427 (1953). However, the Dalehite decision was based entirely upon the Supreme Court's prior decision in Feres, which has been reaffirmed continuously by the United States Supreme Court from its inception through the Court's most recent decision in United States v. Shearer, supra. Thus, it is that Court's decision in Indian Towing which is out of step with all of the remainder of the United States Supreme Court decisions.[Footnote 2] In United States v. Varig Airlines, 467 U.S. 797, 104 S.Ct. 2755, 81 L.Ed.2d 660 (1984), in reaffirming its prior decision in Dalehite and, in effect, substantially overruling its decision in Indian Towing, the United States Supreme Court, referring to Indian Towing, stated \"the Court's reading of the Act admittedly has not followed\n\na straight line. . . .\" United States v. Varig Airlines, 104 S.Ct. 2755, 2764.[Footnote 3]\n\nThus, from the very first United States Supreme Court case, United States v. Feres, supra, to the most recent United States Supreme Court case, United States v. Shearer, supra, and every case in between, with the exception of Indian Towing, the United States Supreme Court has followed the parallel function, or parallel liability analysis of Feres.\n\nNeither is the parallel function analysis of Dunbar an aberration among state court decisions interpreting tort claims acts, as the majority suggests. That analysis has been employed by the other state courts which have adopted the Federal Tort Claims Act language, including the states of Washington, Ohio and Florida.\n\nThe Washington Tort Claims Act, similar to the Idaho and federal acts, waives the immunity of the state \"to the same extent as if it were a private person or corporation.\" Wash.Rev.Code § 4.92.090.[Footnote 4] However, the Washington act contains none of the exceptions to waiver listed in the Federal Tort Claims Act at 28 U.S.C. 2680 or the Idaho act. The Washington act is a total waiver of immunity, without listing any exceptions, creating liability on the state \"to the same extent as if it were a private person or corporation.\" Nevertheless, in the case of Edgar v. State of Washington, 92 Wash.2d 217, 595 P.2d 534 (1979), the Washington Supreme Court applied the parallel function analysis to the claim of a member of the Washington Air National Guard, who sued the state for damages which he claimed to have suffered as a result of being suspended from certain assignments of duty with the Air National Guard. The complaint alleged mental distress, humiliation, harassment and threats by the plaintiff's superior officers, all viable torts under Washington law. The Washington Supreme Court, noting the \"private person or corporation\" language of the Washington Tort Claims Act, stated the issue in the case to be as follows: \"The question is, does the plaintiff seek to hold the State liable 'to the same extent as if it were a private person or corporation' or does he seek to impose upon it a liability which has no parallel in the private sector? \" 595 P.2d at 538 (emphasis added). The court held that, because of the \"private person\" language of the state act, plaintiff was required \"to show that the conduct\n\ncomplained of constitutes a tort which would be actionable if it were done by a private person in a private setting.\" 595 P.2d at 539. After analyzing the United States Supreme Court's decision in Feres v. United States, 340 U.S. 135, 71 S.Ct. 153, 95 L.Ed. 152 (1950), the Washington Supreme Court applied the Feres parallel function analysis to the facts of the case and stated, quoting Feres, \"[T]here is no comparable function in the private sector and thus no common law action in which a private person would be liable under similar circumstances.\" 595 P.2d at 538. The Washington court upheld the trial court's dismissal of plaintiff's action based upon its parallel function analysis. This is the very same analysis which this Court applied in Dunbar, where we held, in language almost identical to the Washington court, that \"[t]here are not parallel functions in the private sector\" to the duties of the state mine inspector, and thus \"[a] finding of liability for breach of those 'duties' running to plaintiffs would result in the creation of a new cause of action which we deem not to be contemplated by our legislature, and foreign to traditional concepts of the law of torts.\" Dunbar v. United Steelworkers of America, 100 Idaho at 546, 602 P.2d at 44.\n\nThree years prior to our Dunbar decision, the Ohio Supreme Court also applied a parallel function rationale in dismissing a case against their Industrial Commission for failure to conduct safety inspections. Shelton v. Industrial Commission, 51 Ohio App.2d 125, 367 N.E.2d 51 (1976). In Shelton, the plaintiff had alleged that the Industrial Commission of Ohio and other state agencies \"were negligent in the performance of their statutory duties to make various inspections and investigations,\" 367 N.E.2d at 51 (emphasis added), and that as a result plaintiff was injured when a boiler exploded at an Ohio sugar processing plant. Plaintiff's claim was based upon certain statutory provisions which placed upon the governmental agencies the affirmative duty to investigate and set reasonable standards for hours and working conditions in the plants, and to \"ascertain, fix, and order such reasonable standards for the construction, repair, and maintenance of places of employment as shall render them safe. . . .\" 367 N.E.2d at 52. The plaintiff alleged that the defendants had breached their duties under the statutes and therefore were liable under the Ohio Tort Claims Act. The Ohio Court, noting that the state's waiver of immunity was limited to \"the same rules of law applicable to suits between private parties . . .,\" 367 N.E.2d at 53, held that: \"[A] private party's duty to inspect and to enforce safety standards is not created by statute, but only by virtue of some other legal relationship and, hence, there is no rule of law making a private party liable for a failure to perform statutory duties of inspection and enforcement of safety standards which were enacted to protect the health, safety and welfare of all the citizens of Ohio.\" 367 N.E.2d at 54. The Court then held that the statutes did not create a duty toward any particular person and accordingly held that since a private person could not recover on them there was no new cause of action created against the state. There being no parallel responsibility to a private party as to that imposed upon the Industrial Commission, and there being no private duty or liability based upon those statutes, the Court found no liability to the state.\n\nFinally, the Supreme Court of Florida in Trianon Park v. City of Hialeah, 468 So.2d 912 (Fla.1985), upheld the dismissal of plaintiff's action against the City of Hialeah for damages to condominium units as a result of the alleged negligence of the city building inspectors in their inspections of the condominiums during construction. The Supreme Court of Florida framed the issue as follows:\n\n\"Whether a governmental entity may be liable in tort to individual property owners for the negligent actions of its building inspectors in enforcing provisions of a building code enacted pursuant to the police powers vested in that governmental entity.\" 468 So.2d at 914.\n\nUtilizing a parallel function analysis, the court held that the government was not\n\nliable and dismissed plaintiff's action. The court stated:\n\n\"How a governmental entity, through its officials and employees, exercises its discretionary power to enforce compliance with the laws duly enacted by a governmental body is a matter of governance, for which there never has been a common law duty of care.\n\n\"We find that the enactment of a statute giving a governmental entity the power to enforce compliance with the law does not, in and of itself, give individuals a new right of action that previously never existed.\" 468 So.2d at 919, 922.\n\nThus, the parallel liability test did not, as asserted by the majority, \"first surface in Dunbar.\" Ante at 215, 723 P.2d at 759. Nor is the parallel function test an \"implied exception\" conjured up by a \"self-constituted guardian of the [state] treasury,\" as the majority opinion intimates.[Footnote 5] Ante at 223, 723 P.2d at 767. Furthermore, as the above cases indicate, derivation of such a test from the language of the ITCA is a legitimate interpretation of the express wording utilized by the legislature. Liability of a governmental entity under the ITCA exists only \"if a private person or entity would be liable . . . under the laws of the state of Idaho\" and then only if none of the enumerated exceptions contained in I.C. § 6-904 apply.[Footnote 6]\n\nIt is at once abundantly clear that there is no parallel in the private sector to defendant Board of Corrections (Board). There being no such parallel, there can be no parallel liability under I.C. § 6-903(a). Dunbar v. United Steelworkers of America, supra. Furthermore, as discussed later, there never has existed a cause of action at common law in this state in favor of a private citizen for failure of a law enforcement or quasi-judicial agency such as defendant Board of Corrections to perform its statutory duty of supervising probationers placed in its custody by court order. Jacobson v. McMillan, 64 Idaho 351, 132 P.2d 773 (1943); Worden v. Witt, 4 Idaho 404, 39 P. 1114 (1895).\n\nB. The discretionary function exception.\n\nIn the present case, the trial court, as one of its reasons for dismissing the action, found that the discretionary function exception, I.C. § 6-904(1) applied. The majority's analysis regarding the application of the discretionary function exception found at I.C. § 6-904(1) is flawed because it fails to properly focus on the conduct asserted by plaintiff as the basis of her claim against defendant Board. As will be more fully discussed in Part II.A(2), once the dross is removed from the allegations of plaintiff's complaint it becomes clear that the essence of the alleged negligent conduct is not \"negligent supervision\" (an extremely imprecise term), as discussed by the majority; rather, the conduct alleged to have proximately caused plaintiff's injuries is either: (1) failure to arrest defendant Bloom for violation of the terms of his probation; or (2) failure to cause Bloom's probation to be revoked.[Footnote 7]\n\nInsofar as the second is concerned, plaintiff's complaint clearly states no cause of action as to defendant Board. The Board of Corrections is simply without authority to revoke an order of probation. Revocation of probation is a purely discretionary function entrusted entirely to the courts, I.C. § 20-222, and such discretionary function falls within the ambit of I.C. § 6-904(1).\n\nInsofar as the failure to arrest Bloom is concerned, the Board and its probation officers do have authority to engage in such action. I.C. § 20-227. However, a probation officer's exercise of that authority is purely discretionary. The express wording of that statute indicates that use of the arrest power conferred therein is permissive rather than mandatory. \"Any parole or probation officer may arrest a parolee or probationer without a warrant . . . [if] the parolee or probationer has, in the judgment of said parole or probation officer, violated the conditions of his parole or probation.\" I.C. § 20-227 (emphasis added).\n\nFurthermore, the non-liability of law enforcement agencies for failure to arrest a lawbreaker or otherwise enforce the laws of a given jurisdiction (which perforce include court orders) is a rule of law accepted in nearly all jurisdictions which have addressed the issue. Dauffenbach v. City of Wichita, 233 Kan. 1028, 667 P.2d 380, 385 (1983) (police have immunity from liability on claims arising from performance or non-performance of general duty to enforce laws of state); Zavala v. Zinser, 123 Mich.App. 352, 333 N.W.2d 278 (1983) (no liability for officer's failure to intervene in fight which ultimately resulted in a gunshot wound to plaintiff); Crouch v. Hall, 406 N.E.2d 303 (Ind.App.1980) (police officers not liable for failure to properly investigate and apprehend rapist who one week later raped and murdered plaintiff's daughter); Everton v. Willard, 468 So.2d 936 (Fla.1985) (no liability for failure to arrest drunk driver who is later involved in collision producing fatalities); Parker v. Sherman, 456 S.W.2d 577 (Mo.1970) (failure of police to enforce non-gambling statute not actionable); Tomlinson v. Pierce, 178 Cal.App.2d 112, 2 Cal.Rptr. 700 (1960) (no liability for failure of police officer to arrest individual even though he knew the individual was intoxicated and intended to drive an automobile); see generally Annot., 41 ALR 3d 700. The rationale for such a rule of non-liability was adequately expressed by the Fifth Circuit in United States v. Faneca, 332 F.2d 872 (5th Cir.1964), and in Smith v. United States, 375 F.2d 243 (5th Cir.1967).\n\n\"Just as the tasks of carrying out the orders of this Court . . . are among the responsibilities of the [particular law enforcement agencies] . . . so is the choice of means for performing these tasks peculiarly within their discretion.\" Faneca 332 F.2d at 874.\n\nAnd as stated in Smith, where plaintiff had alleged negligence on the part of the United States for failure \"to arrest or prosecute the persons injuring his business.\" Smith 375 F.2d at 244.\n\n\"The federal government's decisions concerning enforcement of its criminal statutes comprise a part of its pursuit of national policy. If the government could be held liable for [failure to enforce its laws] . . . its choices in this area could quite conceivably be affected by such a suit. Thus, a policy decision of the federal government might be influenced by a plaintiff with no governmental responsibility.\n\n\"Another holding [other than non-liability] could diffuse the government's control over policies . . . and irrationally concentrate political responsibility in fortuitous lawsuits.\n\n\" Whatever else [the discretionary function exception] may do, . . . [it] prevents this diffusion of governmental power into private hands.\" Smith 375 F.2d at 247-48 (emphasis added).\n\nApart from my objections to the majority's failure to properly focus on the alleged negligent conduct involved for purposes of analyzing the applicability of the discretionary function exception, I believe the Court errs in adopting the so-called \"planning-operational\" distinction. Answering questions regarding the applicability of the discretionary function exception is admittedly a difficult process. This difficult process will not be aided by the \"planning-operational\" standard. Such a distinction, in practical application, will prove to be illusive, if not specious. There is no discernible line of demarcation between where planning stops and operations begin. And, as the United States Supreme Court stated in United States v. Varig Airlines,\n\n\"'[T]he \"discretionary function or duty\" that cannot form a basis for suit under the Tort Claims Act includes more than the initiation of programs and activities. . . . Where there is room for policy judgment and decision there is discretion. It necessarily follows that acts of subordinates in carrying out the operations of government in accordance with official directions cannot be actionable.' [ Dalehite v. United States, 346 U.S. 15, at] 35-36, 73 S.Ct. at 968.\" United States v. Varig Airlines, 467 U.S. 797, 811, 104 S.Ct. 2755, 2764 (1984).\n\nThe utility of the \"planning-operational\" distinction will arise only in cases where it is not needed, i.e., easy cases where it undoubtedly will be used as makeweight. In the difficult cases it will only \"prove to be another example of a distinction 'so finespun and capricious as to be almost incapable of being held in the mind for adequate formulation.'\" Smith v. United States, 375 F.2d at 246.\n\nThis Court has traditionally been called upon in past decisions to draw the distinction between discretionary and ministerial action by governmental entities. We have adequately discharged this function in the past without the aid of a \"planning-operational\" test, and I fail to see why such a test is now called for. It seems entirely reasonable to me that when the legislature utilized the term \"discretion\" in I.C. § 6-904(1) it presumed that the term would be interpreted or applied in the same manner that this Court has traditionally made the determination of whether or not activity was discretionary. The holding in Chandler Supply Co. v. City of Boise, 104 Idaho 480, 660 P.2d 1323 (1983), is nothing more than a recognition of those prior determinations of whether or not challenged action constitutes discretionary action will be made in the same manner as it has always been made by this Court. The majority's failure to recognize the import of our holding in Chandler has worked a great disservice in the present case, namely the adoption of the so-called \"planning-operational\" test.\n\nThe majority opinion finds this Court's interpretation of the discretionary function exception contained in I.C. § 6-904(1), as set forth in Chandler, to be out of step with federal case law interpreting the equivalent provision in the Federal Tort Claims Act. I believe that Conclusion is erroneous. The majority correctly notes that there is no unresolved inconsistency among the line of United States Supreme Court cases interpreting the discretionary function exception. Ante, at 226, 723 P.2d at 770. That consistent position of the United States Supreme Court was recently reaffirmed in the case of United States v. Varig Airlines, 467 U.S. 797, 104 S.Ct. 2755, 81 L.Ed.2d 660 (1984). In that case the court stated that in applying the discretionary function exception the following two principles must be followed:\n\n\"First, it is the nature of the conduct, rather than the status of the actor, that governs whether the discretionary function exception applies in a given case. . . . Thus, the basic inquiry concerning the application of the discretionary function exception is whether the challenged acts of a Government employee -- whatever his or her rank -- are of the nature and\n\nquality that Congress intended to shield from tort liability.\n\n\"Second, whatever else the discretionary function exception may include, it plainly was intended to encompass the discretionary acts of the Government acting in its role as a regulator of the conduct of private individuals.\" 467 U.S. at 813-14, 104 S.Ct. at 2765.\n\nAdditionally, in the Court's earliest decisions regarding the discretionary function exception, it expressly refuted the very position or interpretation taken by the majority in the present case, i.e., the exception applies only to the planning or policy formation stages of governmental activity and not to the \"operational\" aspects of such activities. The Varig Court stated, quoting from Dalehite, \"It is enough to hold, as we do, that the 'discretionary function or duty' that cannot form a basis for suit under the Tort Claims Act includes more than the initiation of programs and activities. . . . Where there is room for policy judgment and decision there is discretion. It necessarily follows that acts of subordinates in carrying out the operations of government in accordance with official directions cannot be actionable.\" Dalehite v. United States, 346 U.S. 15, 35-36, 73 S.Ct. 956, 968 (1953) quoted with approval in United States v. Varig Airlines, 467 U.S. 797, 811, 104 S.Ct. 2755, 2764 (1984).\n\nIn short, under the facts of this case, it can hardly be argued that defendant Board of Corrections was not \"acting in its role as a regulator of the conduct of private individuals.\" If the supervision of probationers does not constitute the regulation of the conduct of private individuals, then nothing does.[Footnote 8]\n\nII\n\nTort Law Analysis\n\nThe majority's overturning Dunbar and Chandler is not sufficient to prevent dismissal of plaintiff's action in the present case. Without more, plaintiff's complaint is still subject to dismissal for failure to state a cause of action. It is not enough to prove that the state has consented to be sued, i.e., waived its immunity to suit. In waiving immunity, the ITCA does nothing more than waive the state's immunity to action; it does not create a cause of action where none previously existed. I.C. § 6-903(f) states in part, \" Nothing in this act shall enlarge or otherwise adversely affect the liability of an employee or a governmental entity. Any immunity or other bar to a civil lawsuit under Idaho or federal law shall remain in effect.\" The majority chooses to ignore this directive of the Idaho legislature, stating, \"It has been argued that the 1971 Idaho act was not intended to create new causes of action against the government in its business of governing.\" Ante at 223, 723 P.2d at 766. Responding to that argument, the majority opinion, quoting from the United State Supreme\n\nCourt's opinion in Rayonier, Inc. v. United States, 352 U.S. 315, 319, 77 S.Ct. 374, 377, 1 L.Ed.2d 354 (1957), then states, \"But the very purpose of the Tort Claims Act was to waive the government's traditional all-encompassing immunity from tort actions and to establish novel and unprecedented government liability.\" Ante at 222, 723 P.2d at 766.\n\nHowever, I.C. § 6-903(a) specifically rejects this Rayonier \"novel and unprecedented liability\" doctrine. There is no comparable provision in the Federal Tort Claims Act to I.C. § 6-903(f), which rejects Rayonier's \"novel and unprecedented liability\" doctrine, and therefore the majority's reliance upon the Rayonier decision of the United States Supreme Court to the effect that \"the very purpose of the Tort Claims Act was to . . . establish novel and unprecedent governmental liability\" is contrary to the express directive of the Idaho legislature in I.C. § 6-903(f). The basic premise motivating the majority in this case having been expressly rejected by the Idaho legislature in I.C. § 6-903(f), the entire tort analysis of the majority opinion is thus flawed. Because the majority erroneously approaches the tort law aspect of this case from the doctrine borrowed from the Rayonier case that the purpose of the Tort Claims Act was to establish \"novel and unprecedented governmental liability,\" when in fact the Idaho legislature stated that \"[n]othing in this act shall enlarge . . . the liability of an employee or a governmental entity,\" the whole basic approach of the majority opinion is wrong. If the majority opinion were true to the directive of I.C. § 6-903(f), and it followed the doctrine of our existing tort law cases of Worden v. Witt, 4 Idaho 404, 39 P. 1114 (1895), and Jacobson v. McMillan, 64 Idaho 351, 132 P.2d 773 (1943), the Court would be compelled today to affirm the district court and dismiss plaintiff's complaint. Once the shield of immunity to suit is removed, a plaintiff must still affirmatively establish that the governmental entity, \"if a private person or entity, would be liable . . . under the laws of the State of Idaho\" prior to a finding of liability as to the State of Idaho and the Board of Corrections. The majority's analysis regarding this aspect of plaintiff's case ignores our prior case law. Since the plaintiff seeks to hold the board liable for the negligence of its agent/employee (probation officer Housley), the doctrine of imputed negligence or respondeat superior is clearly implicated. To succeed under this doctrine, plaintiff must establish: (1) that the agent/employee's conduct constituted actionable negligence, i.e., for all practical purposes plaintiff must make out a cause of action for negligence against Housley; and (2) that the agent/employee's negligent acts were \"within the course and scope of employment.\" I.C. § 6-903(a); Restatement (Second) Agency § 243.\n\nA.\n\nTurning first to the cause of action for negligence against the agent/employee, it is by now axiomatic that the allegation of plaintiff's complaint, in order to state a cause of action for negligence, must set forth the following \"concepts fundamental to any negligence action: duty, breach, proximate cause and damages.\" Blake v. Cruz, 108 Idaho 253, 257, 698 P.2d 315, 319 (1985). Careful analysis of plaintiff's complaint reveals that it is deficient as to two of the four fundamental elements, namely, duty and proximate cause. Thus, plaintiff has not stated a cause of action for negligence against employee Housley and, therefore, states no cause of action against defendant State Board of Corrections.\n\n1. Duty\n\nThe primary element in a cause of action for negligence is the existence of a duty owed by defendant to the particular plaintiff. Prosser \u0026 Keeton, Torts, § 30 (1984). Thus, while \"it may be said that the defendant was negligent . . . [he may not be] liable because he was under no duty to the plaintiff not to be.\" Id. The question of existence of a duty under the particular facts of the case is a question of law for the courts. Prosser \u0026 Keeton, Torts, § 37 (1984). As stated by the Supreme Court of\n\nCalifornia in a tort claims act against the State of California:\n\n\"The existence of 'duty' is a question of law. (Citations omitted.) '[L]egal duties are not discoverable facts of nature, but merely conclusory expressions that, in cases of a particular type, liability should be imposed for damage.' Tarasoff v. Regents of University of California, [17 Cal.3d 425, 131 Cal.Rptr. 14, 551 P.2d 334 (1976).]\" Thompson v. County of Alameda, 27 Cal.3d 741, 167 Cal.Rptr. 70, 74, 614 P.2d 728, 732 (1980).\n\nEssentially the question of the existence of a duty involves a legal determination that some relationship exists between the defendant and the plaintiff which gives rise to an obligation of conduct toward a particular person in the first instance. \"[D]uty is a question of whether the defendant is under any obligation for the benefit of the particular plaintiff.\" Prosser \u0026 Keeton, supra at § 53.\n\nFurthermore, a determination of the existence of a duty in a particular case involves consideration of several factors, including the following:\n\n\"[T]he extent of the burden to the defendant and consequences to the community of imposing a duty to exercise care with resulting liability for breach, and the availability, cost, and prevalence of insurance for the risk involved. . . . When public agencies are involved additional elements include the extent of the agency's powers, the role imposed upon it by law and the limitations imposed upon it by budget.\" Davidson v. City of Westminster, 32 Cal.3d 197, 185 Cal.Rptr. 252, 649 P.2d 894, 897 (1982), quoting with approval Rowland v. Christian, 69 Cal.2d 108, 70 Cal.Rptr. 97, 443 P.2d 561 (1968), and Thompson v. County of Alameda, 27 Cal.3d 741, 167 Cal.Rptr. 70, 614 P.2d 728 (1980).\n\nIn the present case, even when construing the facts and allegations contained in plaintiff's complaint and all reasonable inferences therefrom in a light most favorable to plaintiff, it is clear that she has failed to establish the existence of any legal duty owed her by defendant State of Idaho Board of Corrections (through its agent Housley). Indeed, on its face, plaintiff's complaint fails entirely to specifically allege the existence of any duty. Plaintiff's complaint does contain allegations of negligence, but as stated earlier, liability will not flow from allegations of negligence absent allegations that show that defendant was under a duty not to be negligent toward plaintiff.\n\nDrawing reasonable inferences from the allegations in plaintiff's complaint, it is possible to glean therefrom the existence of three possible sources of duty imposed on defendant board (and therefore its agent Housley): (1) the court order of probation; (2) the probation agreement between the board and defendant Bloom; and (3) the statutory duty to supervise, investigate, and report violations of the probation. However, it is beyond question that under the statutes and prior decisions of this Court any duty arising from any of these three sources may not form the basis of an action in tort.\n\nThe second category, the probation agreement violation, is quickly answered by a long line of Idaho cases, culminating with our most recent decision in Carroll v. United Steelworkers of America, 107 Idaho 717, 692 P.2d 361 (1984), wherein we stated:\n\n\"Under Idaho law it is settled that an alleged failure to perform a contractual obligation is not actionable in tort. . . . In Taylor v. Herbold, 94 Idaho 133, 483 P.2d 664 (1971), we stated, 'To found an action in tort, there must be a breach of duty apart from the non-performance of a contract.' . . . Mere nonfeasance, even if it amounts to willful neglect to perform the contract, is insufficient to establish a duty in tort.\" Carroll v. United Steelworkers of America, 107 Idaho 717, 719, 692 P.2d 361, 363 (1984).\n\nAssuming, without deciding, that a probation agreement is an enforceable contract, under the Carroll case and Taylor v. Herbold, supra, failure of the Board of Corrections\n\nto perform the contract would not support an action in tort.\n\nAs to the other two categories, the court's order of probation and the board's statutory duty contained in I.C. § 20-219,[Footnote 9] contrary to the majority's assertion, any duty arising from these two sources is owed to the public at large and not in favor of an individual member thereof.[Footnote 10] The established law in Idaho is that such duties imposed on public officials and running in favor of the general public do not inure to the benefit of individual or particular members of the general public. Worden v. Witt, 4 Idaho 404, 39 P. 1114 (1895) (\"[I]f the duty which the official authority imposes upon an officer is a duty to the public, a failure to perform it, or an inadequate or erroneous performance, must be a public, not an individual, injury, and must be redressed, if at all, in some form of public prosecution.\" 4 Idaho at 406-07); Jacobson v. McMillan, 64 Idaho 351, 132 P.2d 773 (1943).\n\nIn Jacobson v. McMillan, 64 Idaho 351, 132 P.2d 773 (1943), this Court was faced with facts substantially the same as those in the present case. In the Jacobson case, one Dan O'Connor had been arrested and charged with assault with a deadly weapon as the result of an attempt to shoot his wife. After being bound over on the assault charge, O'Connor was committed to the custody of the Kootenai County sheriff. The court's order of commitment specifically required that the individual involved be retained in custody in the Kootenai County jail pending trial on charges of assault with a deadly weapon. The court's order was never rescinded. The parallel between the facts in the Jacobson case and the facts in this case to this point are obvious. In the present case the defendant was convicted of felony DUI, and his legal custody was committed to the probation officer Housley, although released nevertheless on probation, under the strict terms as outlined in the majority opinion. Officer Housley is accused of failing to enforce the court's order of probation, thus violating it. Similar to the present case, the sheriff in the Jacobson case, was accused of acting in direct contravention of the order and the statutory duty imposed by then I.C. § 20-604,[Footnote 11]\n\nby removing the committed individual from the county jail prior to trial and releasing him to the custody of the hospital superintendent at the state hospital in Blackfoot. Through the alleged negligence of the hospital superintendent in failing to supervise the committed individual, he was permitted to wander freely around the hospital grounds without guard and as a result escaped from the state hospital. Subsequent to his escape, neither the hospital superintendent nor the county sheriff attempted to apprehend the escaped individual. Several months later O'Connor again attempted to kill his wife and in the process assaulted two men who were trying to protect her, killing one and wounding the other. Suit was brought against both the sheriff and the hospital superintendent by Jacobson, the individual wounded in the assault. In his complaint, Jacobson alleged, similar to the plaintiff in this case, that his injuries were the proximate result of the negligence of the sheriff and the superintendent whose acts were in direct violation of the court order committing the individual to the county jail.[Footnote 12] Defendants Sheriff McMillan and the superintendent of the hospital moved to dismiss the complaint on grounds that the alleged facts of the complaint did not state a cause of action. The trial court granted the motion and dismissed the complaint. Plaintiff appealed. This Court affirmed the trial court on two alternative bases: (1) lack of duty owed to plaintiff by defendants, and (2) lack of proximate cause.[Footnote 13]\n\nWriting for the Court, Justice Ailshie, in affirming the dismissal, applied traditional tort law analysis and held that there existed no duty between defendants and plaintiff.\n\n\"The duties of a peace officer, who has custody of a prisoner, are two-fold, (1) to the public and (2) to the prisoner. . . . [H]e owes no more duty to one member of the public than to another.\n\n\"Any violation on the part of the sheriff, of his duty to keep a prisoner charged with a crime, is answerable to the public; and he is subject to . . . removal from office, for wilful, negligent violation of such duty. That right, however, does not inure to individuals. It rests with the public and must be exercised by the prosecutor or a proper party on behalf of the state.\" 64 Idaho at 358, 132 P.2d at 777 (citations omitted).\n\nIn reaching this holding, Justice Ailshie relied specifically on the language from Worden v. Witt, supra. Jacobson v. McMillan, 64 Idaho at 358-89, 132 P.2d\n\n773. The rationale of Jacobson that no liability accrues in favor of an individual member of the public, based on an alleged breach of a general duty to the public, is in accord with the majority of jurisdictions which have addressed the issue. See, e.g., Thompson v. County of Alameda, 27 Cal.3d 741, 167 Cal.Rptr. 70, 80, 614 P.2d 728, 738 (Cal.1980) (absent a special relationship between the probation authorities and victim, no duty is owed by the probation authorities to a victim who is otherwise a single \"member of a large amorphous public group of potential targets\"); Everton v. Willard, 468 So.2d 936 (Fla.1985) (\"The victim of a criminal offense, which might have been prevented through reasonable law enforcement action, does not establish a common law duty of care the individual citizen and resulting tort liability, absent a special duty to the victim.\"); Dauffenbach v. City of Wichita, 233 Kan. 1028, 667 P.2d 380 (1983) (failure to perform duty owned to general public does not give rise to tort liability); Sorichetti v. City of New York, 65 N.Y.2d 461, 492 N.Y.S.2d 591, 595, 482 N.E.2d 70, 74 (1985) (absent special relationship, \"a municipality does not owe a duty to its citizens in the performance of governmental functions\"); Chambers-Castanes v. King County, 100 Wash.2d 275, 669 P.2d 451, 457 (1983) (duty of law enforcement agencies to protect public is a duty \"owed to the public at large and [is] unenforceable as to individual members of the public\"). See generally, Annot., 38 A.L.R.4th 1194 (1985).\n\nThe Thompson case, supra, presents facts substantially similar to the present case. In Thompson, plaintiffs sought to hold defendant Alameda County liable for the death of their son following the release of a dangerous juvenile offender, James. In their complaint plaintiffs alleged that the juvenile offender \"had been in the custody and under the control of county and had been confined in a county institution under court order. County knew that James had 'latent, extremely dangerous and violent propensities regarding young children and that sexual assaults upon young children and violence connected therewith were a likely result of releasing him into the community.' County also knew that James had 'indicated that he would, if released, take the life of a young child residing in the neighborhood.' . . . County released James on temporary leave into his mother's custody at her home. . . .\" Thompson v. County of Alameda, 167 Cal.Rptr. at 72, 614 P.2d at 730 (emphasis added). As in the present case, the plaintiffs in Thompson had alleged the existence of a special relationship between the county and the juvenile offender. The juvenile offender was committed to a county institution pursuant to court order just as defendant Bloom in the present case was committed to probation under a court order. The juvenile offender in Thompson was on parole at the time of the incident. There existed a relationship between the county and the juvenile offender of parolor and parolee. Nevertheless, the California Supreme Court held that, absent a special relationship between the county and the plaintiff-victim, i.e., a showing by the plaintiff that the state by its conduct placed the specific plaintiff in a position of clearly foreseeable danger, no liability could be imposed on the county. Contrasting the facts in Thompson with its earlier holding in Johnson v. State, 69 Cal.2d 782, 73 Cal.Rptr. 240, 447 P.2d 352 (1968), where the risk of danger focused precisely on a specific plaintiff, the court held in Thompson that Alameda County \"bore no special and continuous relationship with the specific plaintiffs nor did the county knowingly place the specific plaintiffs' decedent into a foreseeably dangerous position.\" The court in Thompson likewise distinguished its prior decision in Tarasoff v. Regents Univ. of California, 551 P.2d 334 (1976), where again the victim \"was the known and specifically foreseeable and identifiable victim of the [mental] patient's threats.\" 167 Cal.Rptr. at 76, 614 P.2d at 734. Applying the rationale and holding of Thompson to the present case, the majority should likewise hold that defendant Board of Corrections may not be held liable for injuries sustained by plaintiff\n\nsince no duty is owed to a single member of an otherwise \"large amorphous public group of potential targets.\" 167 Cal.Rptr. at 80, 614 P.2d at 738.\n\nThe plaintiff's allegation of inadequate or \"negligent supervision\" is nothing but a thinly veiled claim of failure of a law enforcement agency to protect her from harm. Such claims have uniformly been rejected by the courts. Sorichetti, supra; Chambers-Castanes, supra; Shore v. Stonington, 187 Conn. 147, 444 A.2d 1379 (1982) (lack of showing of imminent harm to identifiable victim failed to turn officer's legal duty to public generally into special duty to individual; therefore, town was not liable to plaintiffs whose decedent was killed by intoxicated driver who, approximately one hour prior to accident, was stopped and warned but not arrested by officer); see generally Annot. 46 A.L.R.3d 1084, §§ 3, 4, 6 (1972 \u0026 Supp.1985). The only exception to the general rule of non-liability for failure to protect is where a \"special relationship\" has been established between the governmental entity and the victim. No such special relationship has been alleged or shown in the present case. Indeed, defendant Board of Corrections was completely unaware of the particular plaintiff in this case prior to the accident in question.\n\nThe majority opinion makes no mention of the Jacobson case and its general rules of non-liability for failure to perform general duties owed to the public at large, and instead creates a duty in the present case by adopting the Restatement (Second) Torts, § 319. However, the so-called Restatement is not restating the law of Idaho and is, indeed, a complete reversal of the prior decisional law in this state. Not a single case is cited by the majority in support of its assertion that Section 319 is the law in Idaho. As it did in overturning Dunbar and Chandler, the majority again creates law (indeed, a new tort of negligent supervision) where none existed before and legislates Section 319 of the Restatement (Second) into the law of the State of Idaho.[Footnote 14]\n\n2. Proximate cause\n\nIn most instances the question of proximate cause is an issue of fact for the trier of fact. Annau v. Schutte, 96 Idaho 704, 535 P.2d 1095 (1975). However, as with any issue of fact, if reasonable minds could not differ as to the existence or non-existence of an issue, then the issue becomes one of law and is for the court to decide. Palsgraf v. Long Island RR. Co., 248 N.Y. 339, 162 N.E. 99 (N.Y.1928); Annau v. Schutte, supra. In the context of this case in its present posture (motion on the pleadings), if under any conceivable set of facts plaintiff fails to establish proximate cause, then the complaint and suit may properly be dismissed.\n\nProximate cause is defined as a cause which, in natural and continuous sequence unbroken by any efficient intervening cause, produces the result (injuries) and without which the result would not have occurred. Smith v. Sharp, 82 Idaho 420, 354 P.2d 172 (1960); Chatterton v. Pocatello Post, 70 Idaho 480, 223 P.2d 389 (1950); accord Challis Irrig. Co. v. State, 107 Idaho 338, 689 P.2d 230 (Ct.App.1984). Even if a cause is alleged to be a Concurring cause of the injury, it still must be a proximate cause in its own right. Challis Irrig. Co. v. State, supra; Miller v. Northern Pacific Ry. Co., 24 Idaho 567, 135 P. 845 (1913); 57 Am.Jur.2d Negligence, §§ 176-182 (1971).\n\nCareful examination of the allegations of plaintiff's complaint reveals that nothing short of failing to physically restrain Bloom, i.e., physically preventing him from\n\ndrinking and subsequently driving a vehicle, can be said to constitute conduct on the part of the Board of Corrections (and its agent/employee) which proximately caused plaintiff's injuries. That is, only such conduct on the part of the board is that \"without which the result would not have occurred.\" The allegations of plaintiff's complaint which constitute the sine qua non of plaintiff's cause of action are as follows:\n\n\"(a) Allowing . . . Bloom to drive a motor vehicle for non-employment purposes . . . contrary to . . . the Order of Probation. . .;\n\n\"(b) Allowing . . . Bloom to operate a motor vehicle without written permission from the court or probation department . . . contrary to the Agreement of Probation. . .;\n\n\"(i) Failing to initiate proceedings to revoke . . . Bloom's probation despite the fact that . . . Bloom had failed and/or refused to comply with the order of probation . . . and the agreement of probation . . . on numerous occasions prior to [the date of the accident in question];\n\n\"(j) Failing to act reasonably and prudently under the circumstances despite its knowledge that . . . Bloom had been convicted twice of [driving while intoxicated] prior to [the date of the accident in question] and that . . . Bloom was likely to cause great bodily harm to members of the public at large if not adequately supervised.\"\n\nAllegation (j), lack of \"adequate supervision,\" is the essence of plaintiff's complaint.[Footnote 15] However, as is apparent, lack of \"adequate supervision\" is far too broad a characterization to support a finding of proximate cause. Instead, the only aspect of \"supervision\" which does lend itself to a finding of proximate cause is physically preventing Bloom from operating a motor vehicle in contravention of his order of probation or probation agreement.[Footnote 16] In my estimation, the only two ways authorized for accomplishing such a task are either: (1) arresting Bloom for violation of his probation agreement pursuant to I.C. § 20-227 (and in this case such action only acquires meaning from a claim that probation officer Housley had actual knowledge that prior violations had occurred); or (2) initiate proceedings to revoke his probation (this is the essence of allegation (i)).\n\nI.C. § 20-227 does give a probation officer the authority to arrest a parolee for violation of the terms and conditions of his parole or probation, but the statute gives the officer discretion in determining whether or not to make such an arrest. Thus, the statute states, \"Any parole or probation officer may arrest a parolee or probationer without a warrant, or may deputize any other officer with power of arrest to do so, by giving him a written statement setting forth that the parolee or probationer has, in the judgment of said parole or probation officer, violated the conditions of his parole or probation.\" Whether or not to arrest a person who is alleged to have violated the law has always been a discretionary decision at common law. Everton v. Willard, 468 So.2d 936 (Fla.1985) (no distinction between discretionary decision of police officer whether to arrest individual for an offense and the discretionary decision of a prosecutor of whether to prosecute\n\nan individual; both are judgmental decisions which are inherent in enforcing the laws of the state); Watson v. Quarles, 381 N.W.2d 811 (Mich.App.1985) (the determination of what type of action to take in face of unlawful conduct, e.g., make an immediate arrest, is a discretionary decisional act entitled to immunity); Hildenbrand v. Cox, 369 N.W.2d 411 (Iowa 1985) (decision by police whether to take an intoxicated person into custody is permissive rather than mandatory). Under I.C. § 20-227 it is expressly made discretionary. The effect of the majority opinion today is that every probationer who violates any term of his probation must be arrested, or the state will be subject to a claim of liability in tort for any subsequent violations which that probationer may commit.\n\nThe same is true with the second allegation that the State Board of Corrections should have initiated proceedings to revoke Bloom's probation. Of course, only the court can revoke his probation, and even under the majority opinion such a revocation decision by the court falls under the discretionary function exception of I.C. § 6-904(1). However, the decision of whether or not to initiate proceedings to revoke a probation, just as a decision on whether or not to prosecute in the first instance, involves just as much judgment and discretion as does the court's decision in deciding whether or not finally to revoke probation. As a result of today's decision, the courts and the probation officers will never be able to cope with the monumental task of arresting and initiating proceedings to revoke probation for every probationer who fails to comply with some term or condition of his probation. The tort law system was never intended to supervise the management of the probation and parole system. However, that is what will result from the majority's opinion.\n\nToday's decision will \"jeopardize rehabilitative efforts\" both by eliminating any discretion which probation officers have in dealing with released offenders and their partial failure to live up to the conditions of their probations, and by the fact that \"parole or probation authorities [will] be far less likely to authorize release [on probation] given the substantial drain on their resources which [today's decision] might require. A stated public policy favoring innovative release programs [will] be thwarted.\" Thompson v. County of Alameda, 27 Cal.3d 741, 167 Cal.Rptr. 70, 79, 614 P.2d 728, 737 (1980).\n\nThe prisons in the State of Idaho are unable to cope with the huge numbers of prisoners matriculating through the criminal Justice system, and many who otherwise would be incarcerated have been forced into the already over-taxed probation and parole system. Probation and parole officers are forced to work with case loads which are extremely difficult to manage. These case loads are the result of policy decisions made by the Idaho legislature -- planning decisions, if you will -- concerning the allocation of limited state resources to the criminal Justice system, and particularly the funds available for incarceration and the funds available for probation and parole. Today's decision substitutes the tort law system for the planning and policy decisions made by the Idaho legislature. At the present level of funding, or at any level of funding which is reasonably foreseeable in the future given the state of the economy in Idaho, the parole and probation system will be unable to meet the supervision standards which today's opinion imposes upon it through the tort law system. The result, I predict, will be chaos. Either there will be a major reduction in the number of individuals placed on probation and parole, and \"a stated public policy favoring innovative release programs [will] be thwarted,\" Thompson v. County of Alameda, 27 Cal.3d 741, 167 Cal.Rptr. 70, 79, 614 P.2d 728, 737 (1980), or the state will be subjected to a flood of tort claims which will place impossible fiscal burdens upon future legislatures. Only by the legislature's immediate attention to the problems which today's decision creates\n\ncan the chaos which will undoubtedly result from it be averted.\n\nB.\n\nSince the majority is sustaining the plaintiff's cause of action, it becomes necessary to address the scope of employment issue. Even if the plaintiff has established negligence on the part of the board's agent/employee, Housley, the plaintiff's claim that Housley was within the scope of his employment is inconsistent with those allegations concerning his alleged acts which are claimed to form the basis of her cause of action.\n\nPlaintiff's allegation in her complaint, that the board's agent/employee Housley was at all times acting within the scope of his employment, is in direct contravention with plaintiff's allegation that this very agent/employee was also without authority to disobey or, in effect, ignore the terms of the order of probation and probation agreement. If, as alleged by plaintiff, the probation officer was without authority to engage in the very conduct alleged to be the basis of plaintiff's right to recovery, then plaintiff's cause of action must be dismissed against the State of Idaho for failing to establish or allege that the agent/employee's acts were committed within the scope of employment. Absent additional allegations by plaintiff that the Board of Corrections was aware of its agent/employee's conduct in this regard and thereby acquiesced in such, it is a general rule of law that an agent/employee's unauthorized conduct constitutes ultra vires action for which the principal/employer may not be held liable. Texas Co. v. Peacock, 77 Idaho 408, 293 P.2d 949 (1956) (no \"apparent authority\" of agent exists if it is known to person asserting authority of agent that, in fact, he is without authority of principal to do the complained of act); Manion v. Waybright, 59 Idaho 643, 86 P.2d 181 (1938) (presumption that acts committed during time of employment are within the servant's scope of employment may be rebutted upon a showing that such acts were unauthorized); Axtell v. Northern Pacific Ry. Co., 9 Idaho 392, 74 P. 1075 (1903) (acts by servants which are expressly forbidden may not serve as basis for imposition of liability on master); accord Orbit Stations, Inc. v. Curtis, 100 Nev. 205, 678 P.2d 1153 (Nev.1984) (acts of unauthorized agent not imputable to principal absent consent or acquiescence by principal); Kidd v. Maldonado, 688 P.2d 461 (Utah 1984) (absent ratification by principal, unauthorized act of agent does not impose liability on principal); National Cash Register Co. v. Lightner, 154 Colo. 98, 388 P.2d 781 (1964) (principal not liable for unauthorized acts of agent absent consent of principal or other allegations of \"apparent authority\" of agent).\n\nIII\n\nAs Parts I and II make clear, the holding of the majority in the present case represents a major shift in the decisional law of this state regarding both the Idaho Tort Claims Act and traditional tort law. Today's opinion imposes new and unprecedented law retroactively. At the time the cause of action accrued against the Board of Corrections, and even at the time of oral argument, the only law in the State of Idaho was that no duty existed on the part of the Board of Corrections which inured to the direct benefit of any individual member of society. Worden v. Witt, supra; Jacobson v. McMillan, supra. Furthermore, under our Dunbar and Chandler decisions, the State of Idaho and the Board of Corrections were immune from suit at the time of the acts complained of. In short, there was no law in the State of Idaho which would have rendered the Board of Corrections liable for the alleged negligent acts in the present case. Thus, by any reasonable standard the Court's current opinion in the present case represents a major shift in established tort and governmental immunity law in this state. Even under the majority's strained reading of Doe v. Durtschi, supra, the tort of negligent supervision did not exist until, at best, the decision in\n\nDurtschi was handed down. The tort of negligent supervision as embodied in Restatement (Second) Torts, § 319, had never been adopted by any decision of this Court prior to this Court's decision in the present case. Indeed, the Court's decision in Durtschi never once mentions or utilizes the phrase \"negligent supervision,\"[Footnote 17] nor does the Court's opinion in Durtschi cite to the Restatement (Second) Torts, § 319. It is only statement (Second) Torts, § 319. It is only in the proposed majority opinion in the present case that this Court for the first time asserts that the tort of negligent supervision, as set forth in the Restatement (Second) Torts, § 319, exists in the State of Idaho.\n\nIn Smith v. State, 93 Idaho 795, 473 P.2d 937 (1970), this Court specifically provided that since its decision regarding governmental immunity represented a major shift in the decisional law of the state up to that point, the effect of the decision would be given prospective application only, to a time \"60 days subsequent to the adjournment of the First Regular Session of the Forty-First Idaho State Legislature.\" 93 Idaho at 808, 473 P.2d 937. The same rationale exists in this case as existed in Smith for holding that the decision in that case would be given prospective application only. The present case makes two major shifts in the prior decisional law of this state. It overrules the two major decisions of this Court dealing with governmental immunity, Dunbar and Chandler, thereby admittedly establishing a major shift in the law as enunciated by this Court regarding actions under the Idaho Tort Claims Act. Today's opinion also makes a major reversal in Idaho tort law by, in effect, overruling Jacobson v. McMillan, 64 Idaho 351, 132 P.2d 773 (1943), and Worden v. Witt, 4 Idaho 404, 39 P. 1114 (1895).\n\nParaphrasing the language used by the Court in Smith v. State, supra, \"Postponing the operative effect of the [current] decision . . . [is based] on the fact that since the [Board of Corrections] and other governmental agencies have relied upon the doctrine of sovereign immunity [as set forth in the Idaho Tort Claims Act and as interpreted by the prior decisions of this Court in Dunbar and Chandler ] it is quite possible that they will suffer undue hardship if the abolition of the [parallel function test and the discretionary function exception as established in Dunbar and Chandler is] to take effect immediately.\" Smith v. State, 93 Idaho at 808, 473 P.2d at 950. Furthermore, as stated by this Court in Smith, \"limiting a decision which overrules an established precedent so that it has prospective application only, does not violate constitutional principles.\" Id. (emphasis added, citations omitted).\n\nA decision to render the present case prospective in application is soundly grounded in public policy. There can be no question that probation and parole constitute fundamental and necessary parts of our criminal Justice system. However, just as the system as a whole is not perfect and may fail from time to time, so also the probation and parole components, administered as they are through overworked, underpaid, imperfect human beings, are likewise subject to failure. An inevitable consequence of such failure in the system is that innocent members of society will suffer harm, be it through failure to prosecute, convict and confine a rapist or murderer, or failure to revoke a convicted felon's probation. As recognized by the California Supreme Court in the cases of Thompson v. County of Alameda, 27 Cal.3d 741, 167 Cal.Rptr. 70, 614 P.2d 728 (1980), and Johnson v. State of California, 69 Cal.2d 782, 73 Cal.Rptr. 240, 447 P.2d 352 (1968), \"Each member of the general public who chances to come in contact with a parolee [or probationer] bears the risk that the rehabilitative effort will fail. . . .\"\n\nThompson v. County of Alameda, 167 Cal.Rptr. at 77, 614 P.2d at 735; Johnson v. State of California, 69 Cal.Rptr. at 252, 447 P.2d at 364. The United States Supreme Court has likewise recognized that \"the basic risk that repeat offenses [or violations of probation or parole] may occur is always present in any parole system.\" Martinez v. State of California, 444 U.S. 277, 281, 100 S.Ct. 553, 557, 62 L.Ed.2d 481 (1980). Nevertheless, and despite this obvious risk of failure in the parole and probation programs, our legislature has seen fit to continue these programs even though such risks of harm must be borne by the public. The law cannot and does not attempt to create a risk-free society. Neither does the law seek to ameliorate all harm occasioned by such risks. Indeed, in recognition of the goals sought to be achieved by our criminal Justice system, both the courts and the legislature have sought to shield government officials involved in administering the system from liability for their administrative acts. (Court-created doctrines of official immunity involving both prosecutors and members of the judiciary are one example.) Nevertheless, the current majority opinion ignores the important position of the probation and parole component of our criminal Justice system. Indeed, the majority's current opinion on its face magnanimously only recognizes the importance of the prosecutorial and judicial component of our criminal Justice system by holding that the those functions are shielded by immunity, while the probation and parole functions are not. What the majority fails to explain is why the prosecutorial or judicial function is a more essential component to the criminal Justice system, and thus apparently more worthy of immunity, than the probation component of the system. The distinction cannot be based on arguments that one component involves discretion, while the other does not. Clearly, the administration of both components entails both discretionary and non-discretionary ministerial functions. The majority fails in any effort to explain why one component of the system enjoys immunity, while the other does not. In short, it must be conceded that the same \"important policy\" reasons supporting immunity for the prosecutorial and judicial functions also supports immunity for the probation and parole functions. The probation function, no less than the prosecutorial and judicial functions, requires \"the insulation necessary for [the respective officials] to independently carry out their tasks without the fear of consequences.\" Ante at 775. Without such immunity, the proper functioning of the criminal Justice system as a whole will be impeded if not completely hamstrung.[Footnote 18]\n\nUnder the authority of our decision in Smith v. State, supra, we should defer the effective date of today's opinion until \"60 days subsequent to the adjournment of the [next] Session of the . . . Idaho State Legislature,\" so that body can express its legislative will on the question of whether today's decision accurately reflects the policy set out in the Idaho Tort Claims Act, and to make the necessary changes to ensure the continued viability of the probation function.\n\n",
    "body_length": 207949,
    "citedas": [
      "723 P.2d 755",
      "111 Idaho 211"
    ],
    "attorneys": "Manweiler, Bevis \u0026 Cameron, Boise, for appellant; Mark H. Manweiler argued. Quane, Smith, Howard \u0026 Hull, Boise, for respondent; William A. McCurdy appeared; John N. Crawford argued.",
    "category": [
      "75"
    ],
    "judges": "Bistline, Justice. Donaldson, C.j., Huntley, J., and McFadden, J. pro tem, concur. Bistline, J., concurs. Bakes, Justice, Dissenting.",
    "citation_count": 0
  }
}
