{
  "id": "wYU3P2YBTlTomsSB0eoO",
  "document": {
    "title": "Gall v. Parker",
    "full_title": "EUGENE WILLIAMS GALL, JR. -APPELLANT, V. PHIL PARKER, WARDEN -APPELLEE.",
    "jurisdiction": "Sixth Circuit",
    "date": "2000-10-30T00:00:00.000Z",
    "docket": "Nos. 91-5502, 94-6376",
    "body": "RECOMMENDED FOR FULL-TEXT PUBLICATION\n\nPursuant to Sixth Circuit Rule 206\n\nFile Name: 00a0379p.06\n\nArgued: November 3, 1999\n\nJONES, J., delivered the opinion of the court, in which MARTIN, C. J., joined. GUY, J. (pp. 112-131), delivered a separate opinion concurring in part and dissenting in part.\n\nOPINION\n\nPetitioner-Appellant Eugene Gall (\"Gall\") appeals the denial of his petition for habeas corpus challenging his conviction and death sentence for the rape and murder of a young girl in 1978. There is little doubt that Gall committed the acts in question. Instead, the central issue contested at trial was his mental state at the time of the killing. The case is further complicated by the numerous errors of constitutional magnitude that Gall claims occurred during his trial and appeal, as well as by long-standing confusion regarding the meaning and role of extreme emotional disturbance in Kentucky law. We conclude that Gall's trial, conviction and appeal contravened fundamental constitutional tenets. We are therefore compelled to REVERSE the district court's denial of habeas relief and REMAND for a conditional granting of the writ.\n\nOVERVIEW\n\nThis is indeed a tragic case. The primary tragedy is that a young girl's life was taken in the most cruel and grisly fashion. It is also evident that Eugene Gall was the man who cut her life short. And naturally, the death and Gall's culpability engendered an understandably outraged and angry public as well as a prosecution determined to convict. In these situations, it is a court's duty to ensure that amid the tragedy, anger and outrage over hideous acts perpetrated, a fair and constitutional trial takes place. Constitutionally fair trials do not occur whenever a judge, jury and litigants go through the formal process of presenting arguments and examining witnesses. For a trial to be constitutionally sound requires far more: it is a trial where the prosecutor must prove all elements of a crime beyond a reasonable doubt in order to convict; where the prosecutor adheres to certain rules of conduct that guarantee a fair trial and a proper consideration of the defendant's theories and supporting evidence; where the jurors consider only evidence adduced by the parties and that a defendant has had an opportunity to rebut; and where a defendant enjoys the right to cross-examine adverse witnesses. When a state contemplates imposing the ultimate penalty, a constitutional trial requires jury selection procedures that avoid seating a jury predisposed to a death sentence, and also allows each individual juror to give effect to any mitigating evidence. It follows then that the issues raised do not lend themselves to summary treatment.\n\nAfter painstakingly reviewing each of the issues raised and the extensive trial record, and minutely examining the relevant governing authorities, we agree with Gall that substantial errors occurred. The key issues contested at trial that we treat below involved Gall's mental condition, and specifically whether he was competent to stand trial, whether he was legally insane at the time of the crime, and whether he was under extreme emotional disturbance when he committed the crime. Unfortunately, an array of complicating circumstances--high publicity, Gall's own actions, trial court mistakes, overzealous prosecutorial tactics combined with inexcusable oversights, and poor defense advocacy at various stages--introduced errors into both the guilt and penalty phases of Gall's trial, as well as into his direct appeal in the state courts. Although we reject a number of Gall's arguments, we find some of the errors to have been sufficiently egregious so as to violate fundamental constitutional rights and protections.\n\nI.\n\nA.\n\nOn April 27, 1978, a Boone County grand jury indicted Gall for the rape and murder of Lisa Jansen. In a two-phase trial, the Commonwealth presented considerable evidence that Gall committed the killing, so Gall's mental state at the time of the crime became the trial's central issue. On September 30, 1978, the jury found Gall guilty of murder while engaged in the commission of rape. Finding no mitigating circumstances, the jury recommended the death penalty on October 2, and the trial court entered judgment accordingly on October 6.\n\nGall directly appealed the conviction on numerous grounds, but the Kentucky Supreme Court affirmed his conviction. See Gall v. Commonwealth, 607 S.W.2d 97 (Ky. 1980) (Gall I). Gall's petition for a writ of certiorari was denied on March 9, 1981. See Gall v. Kentucky, 450 U.S. 989 (1981). Gall subsequently sought post-conviction relief in state court through a RCr 11.42 motion, but the Kentucky Supreme Court denied his various claims for collateral relief. See Gall v. Commonwealth, 702 S.W.2d 37 (Gall II). In July 1986, Gall filed a habeas corpus petition with the District Court of the Eastern District of Kentucky, raising twenty-five assignments of error. The magistrate recommended that the petition be dismissed, and on January 23, 1991, the district court denied the petition. On March 19, 1991, the district court denied Gall's motion to alter or amend that judgment. Gall appealed this denial on April 18, 1991.\n\nB.\n\nThe Kentucky Supreme Court provided a detailed account of the facts at issue:\n\nAt about 7:35 a.m. on April 5, 1978, Lisa Jansen, a 12-year-old schoolgirl, left her home in suburban Cincinnati, Ohio, for school. She was missed very shortly thereafter when she failed to arrive at the home of a friend she had planned to meet on the way and it was ascertained that she had not gone directly to school. At about 9:25 a. m. that morning Mrs. Connie Puckett, while driving her automobile along Kentucky Highway 16 from Verona, Kentucky, toward her home in Walton, Kentucky, noticed a red jacket lying on the side of the highway near the intersection of Stephenson-Mill Road. She stopped and retrieved it, thinking that probably it belonged to one of the students attending the elementary school at Verona. She was positive that the jacket had not been there when she passed the same place a few minutes earlier on her way to Verona. Upon resuming her trip homeward she observed an open schoolbook lying in the road, stopped and picked it up. It bore the name of Lisa Jansen, and when Mrs. Puckett arrived back in Walton she telephoned the school at Verona. The school principal advised her that no one by the name of Lisa Jansen was enrolled there, but later in the day he called back and told Mrs. Puckett that a television newscast had reported a Lisa Jansen as missing. Mrs. Puckett then reported her discovery of the jacket and schoolbook to the Cincinnati police.\n\nThe distance from Lisa's home in Ohio to the Kentucky state line at Cincinnati was 10.9 miles, and from the state line southward via Interstate 75 to the place near Stephenson-Mill Road where her body was found the next morning is 22.6 miles. Gall resided at Hillsboro, Ohio, about 45 miles the other side of the Jansen home.\n\nAt about 10:15 a. m. on April 5, 1978, a man later identified as the appellant, Gall, entered a small grocery store at the crossroads village of Gardnersville, 17 miles or so by public roads from the vicinity of Stephenson- Mill Road (which consists of a loop leading off and then back to Highway 16), and robbed the storekeeper and her customers at the point of a .357-gauge magnum stainless-steel revolver. The storekeeper, who was familiar with this type of weapon, observed from the exposed portions of the magazine that it was loaded with hollow-point cartridges. As soon as the robber left, she telephoned the local headquarters of the Kentucky State Police and reported the incident. Within a matter of minutes Gall was encountered by Detective Joe Whelan, who turned around and followed, and then by Trooper Gary Carey, who had alighted from his cruiser and was attempting to block the highway. As Carey signaled the driver to halt, Gall shot him once, got out of the Ford and shot him again, and then sped onward with Whelan emptying his gun into the rear of the fleeing car. Almost immediately other police officers took up the chase, and Gall was finally brought to bay when he attempted to make a U-turn in the town of Dry Ridge and one of the troopers rammed his cruiser into the Ford. The .357 revolver was lying on the floor of the Ford. Also on the floorboard of the Ford automobile the officer found a cigar box and $112.88, the money taken at the store in Gardnersville. Gall had the further sum of $42.84 on his person. Subsequent laboratory tests established that a bullet removed from Trooper Carey's person had been fired from the revolver found in Gall's automobile.\n\nShortly following his arrest Gall, by reason of his police record, became a suspect in connection with the disappearance of Lisa Jansen. In 1970 he had been charged with several counts of rape and armed robbery in southern Ohio, had been found mentally incompetent to stand trial, and had spent some 19 months in a mental institution at Lima, Ohio, after which he entered a plea of guilty to those charges and spent five years in a state penitentiary at Lebanon, Ohio. He was 31 years of age at the time of Lisa Jansen's murder. Gall I, 607 S.W.2d at 100-01.\n\nAfter his arrest and throughout the trial, Gall indicated to his lawyers and doctors that he remembered the road block, car chase, and shooting the state trooper. Yet he claimed that he could not recall his actions or whereabouts for much of the morning prior to those incidents. The period covered by his purported amnesia coincided with the time of Lisa Jansen's killing.\n\nC.\n\nBecause Gall challenges numerous aspects of his trial, we will describe in detail the most important elements of that proceeding before addressing his arguments.\n\n1.\n\nThe question of Gall's competency to stand trial emerged repeatedly throughout pre-trial proceedings and the trial itself. The day after Gall was arraigned and indicted, the trial court appointed Dr. Robert Noelker, a clinical psychologist, to assess Gall's competence to stand trial. Simultaneously, the Commonwealth hired Dr. Lee Chutkow, a psychiatrist, to determine Gall's legal competence. Dr. Noelker first examined Gall on April 13, 1978. After his appointment by the court, he continued to examine and observe Gall up to and throughout the fall trial. Dr. Chutkow examined Gall on April 30, 1978.\n\nDr. Noelker presented his views on Gall's competence at a hearing on May 26, 1978. First, Dr. Noelker reported that intelligence tests showed Gall's verbal intelligence to be \"in the extreme high end of superior range of development.\" J.A. at 872. Other tests showed Gall to be \"a severely disturbed, emotionally disturbed individual,\" with a severe \"schizophrenic paranoid type\" personality disorder--the most severe psychological disorder that can be diagnosed. J.A. at 873-74. Nevertheless, Dr. Noelker concluded that due to Gall's remission from his disorder, he was \"absolutely convenced\" (sic) that he was competent to stand trial. J.A. at 875. At the hearing, Dr. Noelker also testified that Gall claimed to have no recollection of his activity at the time of the murder. He further stated that such amnesia is rare in personality disorders of Gall's type, but that he had not yet concluded whether Gall had been in an amnesic state for the period in question. The Commonwealth placed into evidence two reports by Dr. Chutkow, who also concluded that he was legally competent. J.A. at 1537. Both Dr. Chutkow's report and Dr. Noelker's testimony described a joint attempt to assess the veracity of Gall's claim of amnesia. When they attempted to perform the required procedure, Gall refused, claiming he was a prisoner of war. After the hearing, the trial court issued an order finding Gall competent to stand trial.\n\nOn September 13, 1978, the trial court held another pre-trial hearing on Gall's competence. Dr. Noelker again stated that Gall \"was definitely competent and has been on every occasion that I have seen him.\" J.A. at 904. He noted, however, that Gall was \"less together\" and \"more anxious\" on recent visits than he had been previously. J.A. at 904.\n\nOn September 23, 1978, after several days of voir dire, Gall informed the trial court judge that he desired to \"take a more active role in [his] defense as far as questioning and cross-examining [] witnesses.\" J.A. at 635. In a hearing outside of the jury's presence, Gall stated that he understood he would jeopardize his insanity defense by taking part in the trial. Dr. Noelker testified that although he believed Gall remained competent, recent developments--primarily Gall's desire to represent himself--were bringing Gall \"very close\" to incompetency due to an inability to \"assist counsel rationally in preparing and carrying out his own defense.\" J.A. at 910.\n\nOn observing Gall's behavior at trial, Dr. Noelker notified Gall's counsel that he believed Gall was no longer competent. The trial court once again called a hearing, where Dr. Noelker testified that Gall was no longer \"capable of rationally participating in his own defense and/or assisting his attorneys in preparing or conducting his defense.\" J.A. at 915. He concluded that Gall \"ha[d] disassociated himself from this trial and [] is participating in it much more as the attorney than the Defendant,\" J.A. at 915, adding that Gall's appearance of competence was \"deceiving.\" J.A. at 918. Although he had an \"excellent\" ability to understand the proceedings taking place and the seriousness of their potential consequences, he did not \"appreciate them relative to himself\" because he now believed he was a defense attorney. J.A. at 921. Recent psychological tests confirmed this finding of incompetence, Dr. Noelker stated.\n\nAt this hearing, Gall explained to the trial judge that he did not agree with his counsel's \"insanity only\" defense strategy, and requested that the trial continue. He believed the best trial approach was to challenge the circumstantial evidence against him, creating a reasonable doubt as to his guilt. J.A. at 926, 930. The trial judge tentatively concluded that Gall was \"extremely capable of assisting his counsel.\" J.A. at 936. Nevertheless, he ordered another psychiatrist to examine Gall that evening.\n\nThe following day, Dr. Kenneth Lanter, a psychiatrist, testified that he found Gall to be \"normal\" and able to \"participate at any degree [in] his defense.\" J.A. at 842. Specifically, Dr. Lanter found that Gall appreciated his available legal defenses (including the insanity defense); understood the roles of the judge, lawyers and jurors in the trial; appreciated the seriousness of the proceedings and possible penalties against him; and exhibited above-average intelligence. J.A. at 841-45. After hearing this testimony, the trial judge once again concluded that Gall was \"qualified mentally and emotionally,\" was \"capable of assisting his counsel and [wa]s able to participate rationally in his own defense.\" J.A. at 853. The trial proceeded accordingly.\n\n2.\n\nAs the district court found below, the Commonwealth's circumstantial evidence against Gall was \"overwhelming.\" J.A. at 25. This evidence included: evidence placing Gall near the area where the victim's body was found around the time of the murder; ballistics tests from Gall's gun matching the bullets recovered from the bodies of Jansen and the police officer; red nylon carpet fibers from the car Gall was driving matching the red nylon fibers found on the victim's clothing; matching tire tracks from Gall's car and the tracks taken from the area where the victim's body was recovered; matching blood type between the semen stains on the front seat of petitioner's car and the samples from the victim's body; and a matching hair and blood type between a long hair recovered from Gall's car and the victim's hair.\n\n3.\n\nDue to this strong evidence, the insanity defense and Gall's claim that he was under an extreme emotional disturbance at the time of the killing emerged as critical aspects of the trial. Dr. Noelker testified before the jury that Gall was legally insane on April 5. Dr. John Toppen, another psychiatrist, reached the same conclusion in a deposition entered into evidence. The prosecution rebutted this testimony by presenting a videotape and written transcript of Dr. Chutkow's testimony regarding Gall's mental condition. Arresting officers and eyewitnesses also testified that Gall appeared calm and \"normal\" when they observed him during and after the 10:15 a.m. store robbery in Gardnersville. Because these assessments form a crucial part of Gall's appeal, we will address them in detail.\n\nFirst, Dr. Noelker testified before the jury that Gall suffered from a psychotic disorder--\"the most severe type of personality disorder that we know.\" J.A. at 956. Dr. Noelker testified that psychotic disorders of the type Gall suffered are \"commonly characterized . . . by a loss of contact with reality[,] by an inability to control one's behavior or thinking, by delusions, hallucinations, by grandiosity and by inappropriate affect of the circumstances he is under.\" J.A. at 956. Dr. Noelker reached his conclusion after conducting personal examinations and interviews with Gall, examining his troubled past and extensive history of mental illness (including Gall's prior imprisonment and institutionalization), and performing an assortment of tests. An out-of-state firm that conducted a blind assessment of Gall's test results agreed with his finding, and recommended administering psychotic medicine. This bevy of data led Dr. Noelker to conclude that Gall suffered from chronic paranoid schizophrenia, J.A. at 969, and that he was extremely dangerous and likely to act in a similar manner in an uncontrolled environment. J.A. at 962. He further stated that this type of schizophrenia was incurable, although Gall's behavior only periodically exhibited \"the manner [in which] he is accused of acting in this instance.\" J.A. at 969-70. Dr. Noelker also repeated the observations he had made to the trial court that Gall's behavior at trial exhibited the type of \"disassociation [that] is commonly found in schizophrenia.\" J.A. at 978. Looking at Gall's history, Dr. Noelker also found that Gall had \"blotted out his actual knowledge\" of sexual crimes he had committed in 1970, consistent with his purported amnesia in this case. J.A. at 967-68. Considering all these factors, Dr. Noelker testified that he had \"absolutely no question in [his] mind\" that Gall lacked substantial capacity to conform his conduct to the requirements of the law on April 5. J.A. at 982. The criminal acts he committed were \"the result of a severe personality disturbance.\" J.A. at 982. The severity, permanence and destructiveness of Gall's disorder also prompted Dr. Noelker to recommend that Gall \"never be allowed to become a free member of [] society again.\" J.A. at 970.\n\nGall's counsel also introduced into evidence the deposition of Dr. John Toppen, a psychiatrist who examined Gall on September 25, 1978. Dr. Toppen concluded that Gall had \"schizophrenia of a paranoid type and chronic in nature,\" which he categorized as \"severe, certainly in terms of his dangerousness to others.\" J.A. at 1207-08. Dr. Toppen further testified that Gall was in a psychotic paranoid schizophrenic state when he committed the rape and killing on April 5, 1978, and therefore lacked capacity to conform his behavior to the requirements of the law. J.A. at 1211-12.\n\nTestifying on behalf of the Commonwealth, Dr. Chutkow stated that he did not believe that Gall was suffering from acute paranoid schizophrenia on April 5. Dr. Chutkow also believed that Gall could at times comply his behavior to the requirements of the law. J.A. at 321. He stated that these conclusions were based on Gall's account of the events of April 5 that he remembered, which showed that \"[h]e was thinking realistically\" and showed none of the \"classical symptoms of schizophrenia.\" J.A. at 319. Moreover, on the day of the examination, \"[Chutkow] received nothing from him . . . indicative of schizophrenic symptoms, nor did he have them . . . after he was arrested and put in jail.\" J.A. at 319. Further, Dr. Chutkow believed that Gall's claim of amnesia was simply a conscious decision to remain silent about the hours preceding his arrest. J.A at 354.\n\nThe peculiar circumstances of Dr. Chutkow's testimony warrant close scrutiny. The record is clear that Dr. Chutkow testified by videotape rather than in open court without any explanation or showing that he was unavailable. The prosecution provided no reason for Dr. Chutkow's absence, and at oral argument for this appeal, stated only that it could not recall the reason Dr. Chutkow did not deliver live testimony. In fact, Dr. Chutkow gave the deposition on September 28 in the same courthouse where the trial took place.\n\nFurthermore, Dr. Chutkow acknowledged that the purpose of his 90-minute examination of Gall months before had been simply to determine if Gall was competent to stand trial, and not if he was legally sane on April 5, 1978. J.A. at 325. As Dr. Chutkow himself stated at the trial deposition and a 1989 deposition conducted for this habeas petition, the brief, one-time session in which he assessed Gall's competency to stand trial in no way approximated the scope, duration and intensity of investigation required to assess a person's legal sanity. Not only did Dr. Chutkow not believe he had investigated Gall's sanity, he did not consider himself to have been testifying as to Gall's sanity. J.A. at 411 (\"I did not conduct an examination on his sanity.\"); J.A. at 412, 413, 414 (\"I would have been quite aware if there was a question about sanity, and they didn't ask me that.'); J.A. at 413 (\"I really was not aware that [sanity] was the background of the questioning.\"); J.A. at 426 (stating that it \"would not have been proper to make an opinion on his sanity\"); J.A. at 427 (stating that he believed the hearing's purpose was to determine competency); J.A. at 435-38 (denying that he stated Gall was insane).\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Rather, consistent with the purpose of his examination of Gall in April, he believed the questions were aimed at eliciting his views on Gall's competency to stand trial, and nothing more.\n\nII.\n\nThis court reviews de novo a district court's refusal to grant a writ of habeas corpus. See McQueen v. Scroggy, 99 F.3d 1302, 1310 (6th Cir. 1996). We review the district court's findings of fact for clear error. See id. Given the complexity of this case, our review, of necessity, must be explicit. Primary or historical facts found by state courts are \"presumed correct and are rebuttable only by clear and convincing evidence.\" Mapes v. Coyle, 171 F.3d 408, 413 (6th Cir. 1999). District court findings of fact based upon its review of state court records or written decisions receive plenary review. See Caldwell v. Russell, 181 F.3d 731, 735 (6th Cir. 1999). Determinations of federal law, or determinations involving mixed questions of fact and law, receive de novo review. See Mapes, 171 F.3d at 413. State court interpretations of state law generally bind the federal reviewing court. See Caldwell, 181 F.3d at 735-36.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nBefore addressing the merits of his claims, we examine whether Gall has exhausted his state remedies, which he must do to gain habeas relief. See Rust v. Zent, 17 F.3d 155, 160 (6th Cir. 1994). With one exception, Gall presented the Kentucky courts with every constitutional claim that he raised before the district court and this Court. While Gall never asserted in state court the Confrontation Clause claim that he has argued below and before this Court, we agree with the Commonwealth that he procedurally defaulted on that claim because, without cause, he failed to bring it either on his direct appeal or state post-conviction petition. See infra. Because the exhaustion requirement \"refers only to remedies still available at the time of the federal petition . . ., it is satisfied 'if it is clear that [the habeas petitioner's] claims are now procedurally barred under [state] law.\" Gray v. Netherland, 518 U.S. 152, 161 (1996) (citation omitted); see also Rust, 17 F.3d at 160 (stating that because \"no remedy exists\" in state court for petitioner's constitutional claim, \"no exhaustion problem exists\"). Thus, Gall has exhausted all state remedies available to him.\n\nIII.\n\nGall challenges a number of aspects of the guilt phase of his trial.\n\nA. Legal Competence\n\nGall argues that his due process rights were violated because he was not competent to stand trial, having lacked sufficient contact with reality to understand the proceedings or cooperate with his attorneys. Gall further argues that the trial court violated due process by allowing him to represent himself at trial.\n\nA state court's determinations on the merits of a factual issue are entitled to a presumption of correctness on federal habeas review. See Demosthenes v. Baal, 495 U.S. 731, 725 (1990). A federal court may not overturn such determinations unless it concludes that they are not fairly supported by the record. See id. This deferential review applies when a habeas court reviews a state court's determination of competence. See id.\n\n1.\n\nThe Commonwealth argues that the record fairly supports a conclusion that Gall was competent to stand trial and to represent himself. We agree.\n\nA criminal defendant may not be tried unless he is competent. See Godinez v. Moran, 509 U.S. 389, 396 (1993). To be competent for trial, a defendant must have \"sufficient present ability to consult with his lawyer with a reasonable degree of rational understanding\" and must have \"a rational as well as factual understanding of the proceedings against him.\" Id. (quoting Dusky v. United States, 362 U.S. 402 (1960)); see United States v. Ford, 184 F.3d 566, 580 (6th Cir. 1999); United States v. Murphy, 107 F.3d 1199, 1203 (6th Cir. 1997). Godinez clarified that the level of competence needed to waive counsel is the same as that needed to stand trial. See 509 U.S. at 399. Cf. United States v. Harlan, 480 F.2d 515, 517 (6th Cir. 1973) (rejecting contention that \"the test for competency to plead guilty should be more stringent than the test for competency to stand trial\"). In addition to this competence requirement, a trial judge must also find that a defendant's waiver of counsel is knowing and voluntary. See Godinez, 509 U.S. at 399. This determination centers on whether the defendant actually understands the significance and consequences of a particular decision and whether the decision is uncoerced. See id. at 401 n.12; see also United States v. McDowell, 814 F.2d 245, 250 (6th Cir. 1987) (stating that judge's duty is to ensure that the right to represent oneself \"be asserted by the accused with his 'eyes open'\"). There is no constitutional requirement that such a determination be made through a formal hearing and inquiry. Rather, most circuits, including this circuit, adopt a nonformalistic approach, determining the sufficiency of the waiver from the record as a whole. See id. at 249.\n\n2.\n\nThe record supports the trial judge's conclusion that Gall was competent to stand trial. The court held a number of separate hearings solely devoted to the question of Gall's competence. At the May 26 hearing, both Dr. Noelker and Dr. Chutkow concluded that Gall was legally competent, and the trial court issued an order to that effect. On September 13, at another pre-trial hearing, Dr. Noelker again testified that Gall was competent. On September 23, after Gall asked to represent himself, Dr. Noelker again stated that he believed--but less decidedly so--that Gall was competent. Finally, after the trial had begun, Dr. Noelker informed the trial court that he believed Gall was no longer competent to stand trial due to a relapse in his condition. Hearing this conclusion, the trial judge questioned Dr. Noelker extensively. He then questioned Gall, discussing trial strategy and inquiring why Gall was resisting the insanity defense. From these discussions, the judge concluded:\n\n[M]y own personal assessment is that Mr. Gall has exhibited quite clearly to me an understanding of the nature and the proceedings and the seriousness of the proceedings and my personal belief is that he is extremely capable of assisting his counsel. J.A. at 936.\n\nNevertheless, the judge ordered an additional examination of Gall by Dr. Lanter. Dr. Lanter testified the next day that he, too, found Gall fully competent to stand trial. J.A. at 840-53. After this testimony, the trial judge made his final decision that Gall was competent:\n\nGentlemen, having heard . . . the testimony of Doctor Lanter, the testimony of Dr. Noelker and of course the testimony of Mr. Gall, the Court is of the opinion that the Defendant, Mr. Gall[,] understands very well the nature and consequences of the proceedings against him, he is qualified mentally and emotionally and is capable of assisting his counsel and is able to participate rationally in his own defense. J.A. at 853. From this record, it is clear that the trial court understood the Dusky standards for competence and carefully ensured that they were met. Because its conclusion is fairly supported by the record, we defer to it.\n\nLikewise, we hold that the trial court undertook a satisfactory inquiry before permitting Gall to serve as co-counsel in his own defense. First, the court's determination that Gall was competent to stand trial also rendered Gall competent to waive his right to counsel. See Godinez, 509 U.S. at 397-98. Moreover, the court labored to ensure that Gall made this pivotal choice knowingly and voluntarily. After Gall requested permission to ask questions of witnesses, the trial judge held a hearing with both Gall and counsel. Under questioning by the judge, Gall stated the following: that he realized his was a murder trial and that \"death is a possible penalty in this case;\" that his counsel had explained to him that his \"taking an active part in [the] trial could very well resolve in [his] loosing [sic] this trial;\" that he understood that his \"taking part in this trial could be very dangerous to any defense\" that he may have had; that he understood that taking part in the trial was counter to the advice of his attorneys; and that he understood that his counsel had raised an insanity defense, and that his participation in the trial might prejudice that defense. J.A. at 636-37. After the trial began, the judge held another hearing outside the presence of the jury. Once again, both defense counsel and prosecution questioned Gall about his comprehension of the proceedings before him, their possible consequences, and the role of all persons involved. Gall then explained that his decision to represent himself stemmed from a disagreement with his defense team as to trial strategy, and that he considered himself as capable as his attorneys at examining witnesses. J.A. at 645-47, 657-59. After hearing this testimony, the judge concluded:\n\n[M]y impression is that Mr. Gall's choice or decision . . . to take charge of his own case is made intelligently and competently and understandingly and knowingly. He certainly has been advised of the possible consequences and I feel confident that he understands that. J.A. at 858.\n\nOnce again, we believe that the record shows that the trial court properly ensured that Gall actually understood the significance and consequences of his decision to represent himself and that his decision was not coerced. See Godinez, 509 U.S. at 401 n.12. The trial court also warned Gall of the \"dangers and disadvantages of self-representation, so that the record will establish that 'he knows what he is doing and his choice is made with eyes open.'\" Faretta v. California, 422 U.S. 806, 835 (1975) (citation omitted). Although the decision to represent himself may not have been in Gall's best interest, the record fairly supports the conclusion that Gall was competent to make that choice, and that he did so knowingly and voluntarily.\n\nB. Absence of Extreme Emotional Disturbance\n\nGall contends that his conviction violated due process under In Re Winship, 397 U.S. 358 (1970), because the Commonwealth did not establish beyond a reasonable doubt one element of murder under Kentucky law. Specifically, he argues that to show murder, the Commonwealth needed to prove an absence of extreme emotional disturbance beyond a reasonable doubt. Gall contends that the Commonwealth presented no evidence on that element, and that his conviction therefore violated due process. Moreover, he argues that when the Kentucky Supreme Court rejected this argument in Gall I, it violated due process by shifting the burden of proof on the element of emotional disturbance. We find both aspects of Gall's argument persuasive.\n\nIn reviewing an appeal of a state jury's factual finding on an element of a charged offense, this Court asks \"whether, after viewing the evidence in the light most favorable to the prosecution, any rational trier of fact could have found the essential elements of the crime beyond a reasonable doubt.\" Jackson v. Virginia, 443 U.S. 307, 319 (1979). \"[T]he assessment of the credibility of witnesses is generally beyond the scope of review.\" Schlup v. Delo, 513 U.S. 298, 330 (1995). The mere existence of sufficient evidence to convict defeats a petitioner's claim. See id.\n\n1.\n\nUnder Winship, due process is only satisfied if the prosecution proves every element of a charged offense beyond a reasonable doubt. See 397 U.S. at 364; see also Apprendi v. New Jersey, 2000 WL 807189, at *8 (2000) (stating that reliance on the reasonable doubt standard \"'reflect[s] a profound judgment about the way in which law should be enforced and justice administered'\")(quoting Winship, 397 U.S. at 361-62). While the fundamental rule of Winship is clear, the logical prior question is more complex: whether the ingredient in question is in fact an element of the criminal offense, implicating Winship. If it is such an element, then the state \"may not shift the burden of proof to the defendant.\" Patterson v. New York, 432 U.S. 197, 215 (1977) (interpreting Mullaney v. Wilbur, 421 U.S. 684, 691 (1975)); see also Carter v. Jago, 637 F.2d 449, 454 (6th Cir. 1980) (\"[O]nce the elements of a crime are defined by the legislature, each element must be proven beyond a reasonable doubt by the State.\"). On the other hand, if an ingredient of a crime is not an element of the offense and does not negate an element, Winship is generally not implicated, and a state law can properly shift the burden of proving that factor onto the defendant. See Patterson, 432 U.S. 197 at 210 (stating that a state need not disprove all affirmative defenses beyond a reasonable doubt); see also Martin v. Ohio, 480 U.S. 228, 231-35 (1987)(upholding Ohio law shifting burden of proving self-defense, long determined by Ohio courts to be an affirmative defense, onto the defendant); United States v. McGhee, 882 F.2d 1095, 1098 (6th Cir. 1989) (concluding that because firearm possession was a factor bearing on the extent of punishment, and not an element of the charged crime, Winship was not implicated).\n\nThe Winship-Mullaney framework therefore leaves a reviewing court with several duties. First, it must determine whether a given ingredient is an element of the criminal offense. See, e.g., Hoover v. Garfield Hgts. Mun. Ct., 802 F.2d 168, 173-74 (6th Cir. 1986) (examining whether the existence of a \"lawful arrest\" was an element of the crime \"resisting arrest\"). Generally, the principal task is to examine the state's definition of the required elements of a crime. See McMillan v. Pennsylvania, 477 U.S. 79, 85 (1986) (\"[I]n determining what facts must be proved beyond a reasonable doubt the state legislature's definition of the elements of the offense is usually dispositive . . . .\"); Patterson, 432 U.S. at 211 n.12 (stating that the application of Winship's reasonable doubt standard is \"dependent on how a State defines the offense that is charged in any given case\"); Hoover, 802 F.2d at 173 (\"[I]n determining which facts must be proven to establish a given offense, we generally look to the state legislature's statutory definition of the offense.\") (citation omitted). And of course, we defer to state courts' construction of those state laws in making such determinations. See Mullaney, 421 U.S. at 691 (\"[S]tate courts are the ultimate expositors of state law.\").\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Next, in looking at state law, we look to see \"whether the State has defined the elements of the crime so as to presume a fact essential to guilt and then compelled the accused to negate that element of the crime.\" Jago, 637 F.2d at 455. Winship is violated when the state has shifted the burden of proof for an ingredient that it has defined as an element of the crime, or for a defense that negates a required element.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e See Mullaney, 421 U.S. at 701-02; Jago, 637 F.2d at 455-56 (stating that \"presumptions of an element are clearly unconstitutional\").\n\n2.\n\nApplying the Jackson standard of review, we conclude that Gall's due process rights have been violated. We do so because the Commonwealth's showing of the absence of extreme emotional disturbance (\"EED\")--an element of murder in Kentucky at the time --was so lacking that no rational trier of fact could have found the required elements of the crime beyond a reasonable doubt. See Jackson, 443 U.S. at 319. Moreover, in casting aside this argument in Gall I, the Kentucky Supreme Court violated the clear dictates of the Winship-Mullaney framework.\n\na.\n\nApplying the Winship-Mullaney inquiry, we find that the absence of EED was an element of murder under Kentucky law for purposes of Gall's trial and appeal. Effective on January 1, 1975, Kentucky's new murder statute provided that a person is guilty of murder when:\n\n(a) With intent to cause the death of another person, he causes the death of such person or of a third person; except that in any prosecution a person shall not be guilty under this subsection if he acted under the influence of extreme emotional disturbance for which there was a reasonable explanation or excuse, the reasonableness of which is to be determined from the viewpoint of a person in the defendant's situation under the circumstances as the defendant believed them to be. However, nothing contained in this section shall constitute a defense to a prosecution for or preclude a conviction of manslaughter in the first degree or any other crime . . . . Ky. Rev. Stat. Ann. § 507.020(1)(a) (emphases added).\n\nIn the cases that first addressed the new statute, the Kentucky Supreme Court plainly held that the absence of EED was an element of murder. Specifically, the court held without condition that a \"failure to act under the influence of extreme emotional disturbance is an element of the offense of murder.\" Edmonds v. Commonwealth, 586 S.W.2d 24, 27 (Ky. 1979); see also Ratliff v. Commonwealth, 567 S.W.2d 307, 309 (Ky. 1978). Therefore, the court also held that \"the prosecution carried the burden to satisfy the jury of the absence of extreme emotional disturbance.\" Ratliff, 567 S.W.2d at 309. In Ratliff and Edmonds, the Court applied its interpretation retroactively, reversing convictions and ordering new trials for acts that had occurred in 1976 and 1975, respectively. In Bartrug v. Commonwealth, 568 S.W.2d 925 (1978), a defendant objected to the trial court's including EED as part of the reasonable doubt jury instruction. The court rejected this challenge, stating that \"[t]he legislature clearly intended the prosecution to bear the risk of non-persuasion\" on EED, and that Bartrug's argument would shift the burden of persuasion onto the defendant. Id. at 926. \"This we can not do because the language of the statute makes the Absence of 'extreme emotional disturbance' an essential element of the offense of murder.\" Id.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nWith the statute and precedent in place, Gall's prosecutors understood their duty to show an absence of EED, announcing that they intended do so in the voir dire and attempting to do so in their closing argument. Equally telling, the trial court instructed the jurors of this burden, informing them that they must find beyond a reasonable doubt that \"when the killing occurred, Eugene Gall was not acting under the influence of extreme emotional disturbance.\" J.A. at 1563.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The trial court also demonstrated that absence of EED was an element the prosecution was required to prove when it rejected defendant's directed verdict motion. J.A. at 1560.\n\nFinally, the Kentucky Supreme Court in Gall I said nothing to undermine its clear statements from the two prior years that EED was an element of murder under the new statute. Indeed, the court noted several times that the Commonwealth shouldered the burden of proof on the element, that its burden entailed proof beyond a reasonable doubt, and that when a defendant has presented evidence of EED, a murder instruction was required to include the negating of EED. See Gall I, 607 S.W.2d at 108-09 \u0026 n.5.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e The following year, the court expressly reiterated its prior holdings, stating that \"[t]he absence of 'extreme emotional disturbance' is an essential element of the offense of murder, and the legislature intended the Commonwealth to bear the risk of nonpersuasion on this element of mitigation.\" Henley v. Commonwealth, 621 S.W.2d 906, 908 (Ky. 1981).\n\nThis interpretation was consistent with the text of the statute. First, the legislature included the absence of EED in its affirmative definition of murder. See Ky. Rev. Stat. Ann. § 507.020; cf. Allen v. Redman, 858 F.2d 1194, 1199 (6th Cir. 1988)(stating that \"[s]anity is nowhere mentioned in [Michigan's] definition\" of assault with intent to murder). Moreover, the legislature made clear in several other ways that the absence of EED, so prominently included in the affirmative definition, was not a technical defense to murder that the statute required defendants to prove. First, pursuant to Winship, the statute provides that \"[t]he Commonwealth has the burden of proving every element of the case beyond a reasonable doubt,\" but that this \"does not require disproof of any element that is entitled a 'defense,'\" Ky. Rev. Stat. Ann. § 500.070; notably, the statute does not list absence of EED as such a defense. See Ky. Rev. Stat. Ann. §§ 501.070-.090 \u0026 503.020 (listing different types of mistake, duress, intoxication and justification as defenses). Gall I itself stated that EED was not a \"'defense' within the technical meaning of that term as used in the Kentucky Penal Code,\" even if evidence of EED operated as a defense in that it mitigated murder to manslaughter. 607 S.W.2d at 108. Similarly, the statute also states that \"[t]he defendant has the burden of proving an element of a case only if the statute which contains that element provides that the defendant may prove such element in exculpation of his conduct.\" Ky. Rev. Stat. Ann. § 500.070(3). Yet again, the statute does not include absence of EED as an instance where a defendant may prove exculpation. See, e.g., Ky. Rev. Stat. Ann. § 504.020(3) (providing that a defendant may show legal insanity to exculpate conduct). Thus, both in its description of the elements of murder and in not identifying EED as a defense or element of exculpation as defined therein, the statute established that absence of EED was an element of murder.\n\nWe further note that the Kentucky statute was unique among those that incorporated the Model Penal Code's formulation for EED. Statutes introduced EED in one of three ways. First, a number explicitly described EED as an affirmative defense to first degree murder. See Conn. Gen. Stat. § 53a-54a; Haw. Rev. Stat. § 707-702(2); Mont. Code Ann. § 45-5-103; N.Y. Penal Law § 125.27(2); Or. Rev. Stat. § 163.115. Others provided EED as a mitigating circumstance and as part of their definition of manslaughter, but did not mention EED in their definition of murder. See Ark. Code Ann. §§ 5-4-605 \u0026 5-10-104; Del. Code Ann. § 641; N.H. Stat. Ann. § 630:2, Utah Code Ann. § 76-5-205.5. This is how the Model Penal Code proposed it be introduced. See Model Penal Code § 210.3(1)(b). North Dakota introduced EED as a circumstance mitigating murder, class AA felony, to murder, class A felony. See N.D. Cent. Code § 12.1-16-01. Additionally, some states explicitly placed the burden on defendants to prove EED by a preponderance of the evidence. See, e.g., 11 Del. Code Ann. § 641. No statute other than Kentucky's incorporated the Model Penal Code formulation for EED directly into its definition of murder without also stating there or elsewhere that it was an affirmative defense.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nb.\n\nDespite the judge's instruction that the government needed to show the absence of EED beyond a reasonable doubt and the jury's verdict that he was guilty, Gall maintains that the prosecution failed to adduce evidence in support of the \"absence of EED\" element, and that the Kentucky Supreme Court applied an unconstitutional standard in reviewing this sufficiency claim. After closely scrutinizing the record, we must agree.\n\nEven under Jackson's highly deferential standard of review for sufficiency of the evidence, we find that the Commonwealth did not meet its burden of showing an absence of EED beyond a reasonable doubt. First, Gall made an affirmative showing of EED. Although it would be almost ten years before the Kentucky Supreme Court would precisely define EED, cases preceding Gall's trial had provided that a showing of a severe psychotic disorder was sufficient to establish EED. See, e.g., Edmonds, 586 S.W.2d at 26-27 (finding evidence of EED due to defendant's \"bizarre manner\" resulting from psychoneurotic condition and medication); Ratliff, 567 S.W.2d at 309 (concluding that evidence of EED possibly existed due to testimony that the defendant was \"very likely psychotic\"); see also McClellan v. Commonwealth, 715 S.W.2d 464, 468 (Ky. 1986) (overruling holding in Ratliff that mental illness, \"standing alone,\" is sufficient to establish EED); Henley, 621 S.W.2d at 909 (stating that both Ratliff and Edmonds found EED instructions necessary due to testimony about defendants' respective mental illnesses).\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Gall I did not overrule or amend Ratliff and Edmonds on this point, but accepted their central premise. See 607 S.W.2d at 109 (noting that chronic paranoid schizophrenia had been characterized as an extreme emotional disturbance in the record); id. (assuming \"that a mental disorder, whether or not it amounts to legal insanity, may constitute a reasonable 'explanation or excuse' for extreme emotional disturbance\").\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nMoreover, we find that Gall clearly met the requirement of Ratliff and Edmonds, having introduced the testimony of Dr. Noelker and Dr. Toppen that he suffered from a severe psychotic disorder, and, specifically, from chronic paranoid schizophrenia. Moreover, Dr. Noelker stated explicitly to the jury that Gall was in a state of \"extreme emotional disturbance\" on April 5. J.A. at 982-83. Dr. Noelker's conclusions were based on Gall's history of severe mental disorders and the tests and interviews Dr. Noelker had administered since the crime, as well as circumstantial evidence of Gall's \"aggressive and very bizarre behavior\" on the day of the murder. J.A. at 1014. For example, Dr. Noelker stated, \"I [can] not explain Mr. Gall's behavior on that morning in question . . . except in terms of extreme mental disorder. . . . [T]his defendant had no reason to [] rush helter-skelter about, throwing clothes, belongings, books and whatever all over the highway.\" J.A. 1014-15.\n\nMeanwhile, the Commonwealth failed to rebut this showing of EED--in fact, it does not even claim to have done so in the brief it filed with this Court. Dr. Chutkow was the state's prime witness on Gall's mental state. To begin with, the gist of his testimony was that Gall was competent to stand trial--indeed, the sole purpose of his only examination of Gall had been to determine Gall's competency. In Buchanan v. Kentucky, 483 U.S. 402 (1987), all nine members of the Supreme Court recognized the fundamental distinction between an examination into a defendant's competency to stand trial and his mental condition at the time of the criminal acts in question. See id. at 423 n.20 (noting that a defendant's legal competency was a \"very different issue\" from his mental condition bearing on EED); id. at 431-32 (noting that an examiner's examination for the purpose of assessing a defendant's mental condition in the \"here and now\" was irrelevant to the defendant's mental condition when the killing occurred) (Marshall, J., dissenting). Dr. Chutkow also stated his belief that Gall did not have one particular form of paranoid schizophrenia on the day of the crime and could at times appreciate the criminality of his conduct. J.A. at 308-56, 1535. But Dr. Chutkow at no point disputed the showing that Gall suffered from a psychotic disorder sufficient to constitute an EED. In fact, for several reasons, his testimony failed to rebut in any way the evidence that Gall suffered from EED while committing the killing.\n\nFirst, Dr. Chutkow's testimony was narrow, failing to overcome crucial statements made by Dr. Noelker and Dr. Toppen. For example, he stated only that he could not find symptoms of acute paranoid schizophrenia before the onset of Gall's claimed amnesia and that he believed that Gall was legally sane. He did not testify that Gall had no mental disorder whatsoever, nor that he did not suffer from an EED at the time of the killing. Indeed, Dr. Chutkow acknowledged that he could not rule out Gall having chronic schizophrenia--the very form that Dr. Noelker had diagnosed. J.A. at 334-36. He also acknowledged that Gall's behavior during his \"POW incident\" might suggest a variety of conditions, including depression, psychotic behavior, or disassociation, even if that behavior did not characterize acute schizophrenia. J.A. at 345. In his habeas deposition, Dr. Chutkow again emphasized the narrowness of his videotape testimony, stating: \"I made no statement about him being insane. I said he only was not suffering from acute schizophrenia just prior to the period of amnesia on the commission of the crime.\" J.A. at 438. But simply lacking acute schizophrenia did not rebut Gall's strong evidentiary showing that he was under an EED at the time of the killing.\n\nAdditionally, Dr. Chutkow stated several times that he had no basis to know Gall's mental state at the time of the killing. For instance, he stated that he had \"no knowledge\" as to Gall's mental state after the \"time from which he claims amnesia,\" J.A. at 335-36; that he did not know Gall's condition for a \"gap of approximately two or three hours,\" J.A. at 350-51; and that \"[f]or a certain interval of time\" before the murder, he did not know Gall's feelings, sensations or judgments. J.A. at 355. Importantly, Dr. Chutkow also acknowledged that because he had never considered the more extensive data that Dr. Toppen and Dr. Noelker examined, he could not challenge their conclusions that Gall suffered from chronic paranoid schizophrenia. J.A. at 320, 350-51. Finally, not only did Dr. Chutkow never contradict Dr. Noelker's statement that Gall suffered from EED in committing the killing (he was never asked a question on the presence or absence of EED), Dr. Chutkow expressly acknowledged that because Gall had a background of diagnosed schizophrenia, he \"could have been\" in a \"state of exacerbation\" at the time of the crime. J.A. at 352. In sum, none of Dr. Chutkow's statements countered Dr. Noelker's definite conclusions that Gall suffered from chronic paranoid schizophrenia and was under EED at the time of the killing. While Jackson instructs us to give the jury full responsibility to resolve extant conflicts in the testimony in the prosecution's favor, see 443 U.S. at 319, Dr. Chutkow's testimony failed to contradict the central aspects of Gall's showing of EED.\n\nNor do we think that the lay testimony adduced at trial was sufficient to create a conflict over Gall's showing of EED. The district court relied in part on the testimony of officers and witnesses present at the later robbery that Gall \"appeared quiet, not excited, not nervous, and had steady hands and a normal voice\" to conclude that the Commonwealth had introduced sufficient evidence on Gall's sanity. J.A. at 26. This included the testimony of one witness, John Wynn, that during the robbery, Gall seemed \"nice [and] normal\" and did not appear nervous. J.A. at 1287.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Although this Circuit does not apply a per se rule barring lay testimony from creating an issue of fact as to a defendant's state of mind, see United States v. Smith, 437 F.2d 538, 540-41 (6th Cir. 1970), we have long been skeptical of such lay testimony. In Smith, we stated that lay testimony as to mental state lacks probative value when a witness's \"direct knowledge of the defendant is brief and superficial.\" Id. at 41. We also noted that\n\na statement that the witness never observed an abnormal act on the part of the accused is of value if, but only if, the witness had prolonged and intimate contact with the accused. . . . There is nothing to show that these witnesses had the capacity--as an expert might--to make valid psychological judgments on the basis of these relatively brief contacts. Id. at 541 (internal quotation marks and citation omitted).\n\nIn holding the State's lay evidence insufficient to raise a factual issue over Smith's sanity, the Smith Court reasoned that there was no indication that the lay witnesses were trained to make \"the kind of psychiatric evaluations necessary to answer intelligently the questions\" regarding sanity, and that there was also no evidence \"to indicate that either of these witnesses, in observing appellant, was concerned with his sanity or competence.\" Id. at 540. Following similar logic, Kentucky courts have long allowed lay witnesses to testify as to their opinion of a defendant's mental state, but have consistently emphasized the need for a sufficient basis on which that witness can form her opinion. See Brown v. Commonwealth, 934 S.W.2d 242, 248 (Ky. 1996)(noting longtime precedent that lay witnesses can testify as to a defendant's sanity when \"'by association and observation [they] have had an opportunity to form an opinion as to the sanity of a person'\") (quoting Abbott v. Commonwealth, 55 S.W. 196, 198 (Ky. 1900)); Wiseman v. Commonwealth, 587 S.W.2d 235, 238 (Ky. 1979)(describing the potential relevance of \"lay witnesses testifying as to the customary conduct of an accused\" in the jury's assessment of a defendant's mental state); Jewell v. Commonwealth, 549 S.W.2d 807, 811 (Ky. 1977) (\"'The judgment of a person's intimate friends and acquaintances as to his soundness of mind is therefore always competent in cases of this character.'\") (quoting Abbott, 55 S.W. at 198).\n\nIn this case, the lay evidence in question suffers shortcomings equivalent to that in Smith. First, the lay witnesses observed Gall not as he committed the crime in question, but as he committed a robbery at least one hour, and perhaps several hours, after the killing of Lisa Jansen. Second, these witnesses observed Gall for a matter of several minutes at most. As in Smith, their observation that he did not appear abnormal to them in those brief moments carries no probative weight as to the absence of EED. See 437 F.2d at 540-41; see also United States v. Burks, 547 F.2d 968, 970 (6th Cir. 1977) (stating that lay testimony that defendant did not appear \"abnormal\" by persons \"who had very limited opportunity to observe\" him had little value), rev'd on other grounds, 437 U.S. 1 (1978). Third, the Commonwealth introduced no evidence suggesting that any of these witnesses had the capacity to determine if Gall was either insane or under EED. Indeed, even if they believed he appeared \"normal\" on the surface, these witnesses clearly lacked the capacity to determine if Gall suffered from the type of disorder that Gall's expert witnesses diagnosed, or that he was under EED at the time of the killing several hours earlier.\n\nMoreover, notwithstanding the fact that Dr. Noelker believed Gall's behavior after the killing was further evidence of both EED and insanity, the Commonwealth theorized at trial that because Gall was attempting to flee the scene of the killing, he must have been sane and not under EED. We rejected just this logic in a prior case, concluding that \"'any fool faced with fear and foreboding can flee and hide. Such is the nature of even a wild beast.'\" Stacy v. Love, 679 F.2d 109, 1214 (6th Cir. 1982) (citation omitted). Thus, flight alone does not amount to evidence of sanity or lack of EED.\n\nFinally, we also do not find that the Commonwealth's cross-examination of Dr. Noelker elicited contradictions of his statements under direct examination. The Commonwealth asked a number of questions seeking to show that Dr. Noelker did not talk to key witnesses of Gall's behavior later on April 5, or examine other key pieces of information, before reaching his conclusions as to Gall's mental state. J.A. at 993-1001. But Dr. Noelker explained that those pieces of information were not necessary to his determination (no other witnesses testified that they were necessary), and that not even Gall's claimed amnesia prevented him from rendering an opinion based on the variety of other available data he had studied. J.A. at 1011, 1016, 1034. He proceeded to describe that data at great length. When the Commonwealth attempted to press Dr. Noelker as to whether he could truly pinpoint Gall's mental state at 8:00 a.m. on April 5, he responded that he was \"as certain as I can be of anything in my profession. . . . As certain as you can be . . . that he was actually there. . . .\" J.A. at 1017. The cross-examination ended with Dr. Noelker assuring the prosecutor that \"any competent mental health professional who has reviewed all of the data that I reviewed could [] and should come to the same conclusion.\" J.A. at 1034.\n\nReflecting the weakness of its overall evidence, the Commonwealth's closing argument also failed to offer a viable argument regarding the absence of EED. It merely offered the erroneous proposition that the defense's failure to prove an insanity defense also meant that the prosecution had succeeded in shouldering its burden of proving the lack of EED. J.A. at 1590-91. When discussing the elements to be proved beyond a reasonable doubt, the prosecutor elaborated in detail on the abundance of evidence linking Gall to the murder. In contrast, the Commonwealth failed to point to any evidence showing an absence of EED--largely, it is clear, because the Commonwealth had presented none. J.A. at 1592-1604.\n\nThus, even when we make all inferences in the Commonwealth's favor, we can not conclude that a rational trier of fact would find an absence of EED beyond a reasonable doubt at the time Gall killed Lisa Jansen. At no point did the Commonwealth rebut Gall's showing that he suffered from chronic paranoid schizophrenia at the time of the killing. Neither did the Commonwealth counter Dr. Noelker's explicit statement that Gall was under EED when he committed the crime. Instead, not only did Dr. Chutkow state that he had no basis to contest Dr. Noelker's findings, but he acknowledged that other disorders, including chronic paranoid schizophrenia, were distinct possibilities, and that Gall could have been in a state of exacerbation. Neither did the one-time, surface-level observations by the lay witnesses create a dispute over Gall's mental state. Because even when viewing the evidence in a light most favorable to the Commonwealth, a rational trier of fact could not have found one of the elements of murder beyond a reasonable doubt, Gall's conviction for murder violated due process.\n\nc.\n\nFinally, we agree with Gall that when faced with this question, the Kentucky Supreme Court read the Commonwealth's murder statute in a way that violated Winship. On his direct state appeal, Gall alleged that the Commonwealth had not satisfied its burden of proof on the absence of EED. The Gall I Court responded that there was \"not a shred of evidence to suggest that [Gall] was acting under the influence of an emotional disturbance . . . , except for the evidence that he suffered from a mental illness from which the jury could have found, but did not find, that he was insane.\" 607 S.W.2d at 109. Although before Gall I, the Kentucky Supreme Court had held that a showing of mental illness could comprise evidence of EED and that the absence of EED was an element of murder that the Commonwealth must disprove, see, e.g., Ratliff, 567 S.W.2d at 309, the Gall I Court held that Gall's evidence was not sufficient to place that burden on the Commonwealth.\n\nThere is much to be said for the proposition that an emotional disturbance inhering in a mental illness is not the kind of an emotional disturbance contemplated by the statute . . . . Assuming, however, that a mental disorder, whether or not it amounts to legal insanity, may constitute a reasonable \"explanation or excuse\" for extreme emotional disturbance, it was incumbent upon the trial court to require the negating of that factor in its instruction on murder, which was done. That is not to say that once the issue is raised (by evidence sufficient to ground a reasonable doubt) the Commonwealth must meet it with countervailing evidence. Unless the evidence raising the issue [of emotional disturbance] is of such probative force that otherwise the defendant would be entitled as a matter of law to an acquittal on the higher charge (murder), the prosecution is not required to come forth with negating evidence in order to sustain its burden of proof. Otherwise it would never be possible to convict a defendant of murder if there were no eyewitnesses and if, for example, he testifies that he acted in self-defense, or was intoxicated out of his mind, or was acting under the influence of extreme emotional disturbance. 607 S.W.2d at 109 (emphasis added) (citation omitted). In other words, the Court announced, even though Gall presented evidence sufficient to require a jury instruction that the absence of EED had to be established beyond a reasonable doubt, the prosecution did not in fact have to prove its absence beyond a reasonable doubt.\n\nGiven that the absence of EED was an element of murder under Kentucky law--a principle of law that Gall I accepted and that the Kentucky Supreme Court would not overrule for several years--this portion of Gall I directly violates Mullaney and In re Winship. The Gall I regime shifted the burden to defendants to produce evidence of EED \"of such probative force that . . . the defendant would be entitled as a matter of law to an acquittal.\" Id. Without that showing, a defendant is presumed to have acted in the absence of EED. Stated differently, the \"absence of EED\" element drops out of the state's required burden unless a defendant affirmatively shows EED, even if the defendant has presented sufficient evidence to raise a reasonable doubt about the absence of EED. This is exactly the type of burden-shifting proscribed by Mullaney; indeed, the two cases are markedly similar. In Mullaney, Maine had affirmatively shifted the burden of proof of \"heat of passion\" to the defendant--requiring that malice aforethought \"was to be conclusively implied unless the defendant proved by a fair preponderance of the evidence that he acted in the heat of passion on sudden provocation.\" 421 U.S. at 686. The Court found this to be a clear Winship violation. We find that the Gall I Court, by requiring a defendant to offer evidence \"of such probative force that otherwise [he] would be entitled as a matter of law to an acquittal on the higher charge\" places an equally weighty burden on that defendant, and thus violates due process.\n\nMoreover, the Mullaney Court rejected several of Maine's arguments with reasoning that is relevant to this case. First, it stated that the proof of an element that distinguishes between murder and manslaughter implicates Winship as much as an element that distinguishes guilt from innocence. See id. at 697-98. Second, it rejected arguments identical to those made by the Gall I Court that the burden-shifting is necessary because of the difficulties the prosecution faces in \"proving a negative\":\n\nNo doubt this is often a heavy burden for the prosecution to satisfy. The same may be said of the requirement of proof beyond a reasonable doubt of many controverted facts in a criminal trial. But this is the traditional burden which our system of criminal justice deems essential. . . . Nor is the requirement of proving a negative unique in our system of criminal jurisprudence. Maine itself requires the prosecution to prove the absence of self-defense beyond a reasonable doubt. . . . Satisfying this burden . . . is identical to the burden involved in negating the heat of passion on sudden provocation. Thus, we discern no unique hardship on the prosecution that would justify requiring the defendant to carry the burden of proving a fact so critical to criminal culpability. Id. at 701-02 (citations omitted).\n\nA close look at Patterson--in many ways the mirror image of this case--further illustrates the Mullaney violation here. In Patterson, the Court reviewed the way in which New York had adopted the same Model Penal Code EED provision into its penal law. Like most other states, see supra n. 3, the New York code explicitly provided that EED was an affirmative defense to murder, and then tasked defendants with proving EED by a preponderance of the evidence. See N.Y. Penal Law § 125.27(2); 432 U.S. at 205-06. Because the state had not deemed EED an element of the crime, and because a showing of EED did \"not serve to negative any facts of the crime which the State is to prove in order to convict of murder,\" New York could permissibly shift the burden onto defendants to show EED. Id. at 206-07. The Court explained,\n\nin revising its criminal code, New York provided the affirmative defense of extreme emotional disturbance . . ., but it was willing to do so only if the facts making out the defense were established by the defendant with sufficient certainty. The State was itself unwilling to undertake to establish the absence of those facts beyond a reasonable doubt, perhaps fearing that proof would be too difficult . . . Id. at 207.\n\nIn stark contrast, Kentucky legislators established EED as an element of murder, and \"clearly intended the prosecution to bear the risk of non-persuasion.\" Bartrug, 568 S.W.2d at 926. The very logic allowing the New York statutory scheme to pass constitutional muster in Patterson thus renders unconstitutional the burden-shifting regime of Gall I.\n\nFinally, although the Commonwealth could argue (it does not do so here) that the Gall I regime comports with the statement in Mullaney that the government only bears a burden of proof \"when the issue is properly presented in a homicide case,\" 421 U.S. at 704, that argument would ring hollow. The Court elaborated in Hankerson v. North Carolina that Mullaney \"does not forbid States from requiring the criminal defendant to present at least some evidence to raise a factual issue with respect to heat of passion or self-defense.\" 432 U.S. 233, 237 n.3 (1977) (emphasis added). But this requirement of \"some evidence\" is far less onerous than the high burden of proof Kentucky placed on defendants in Gall I. The Gall I Court itself made this distinction clear, rejecting Gall's proposition that once the issue is raised \"by evidence sufficient to create a reasonable doubt,\" the Commonwealth must rebut it with countervailing evidence. Rather, only when the evidence raising the issue \"is of such probative force that otherwise the defendant would be entitled as a matter of law to an acquittal on the higher charge (murder)\" must the prosecution negate the evidence to sustain its burden of proof. 607 S.W.2d at 109. Thus, while the court found Gall's evidence sufficient to merit an instruction on the need to negate that factor, it was insufficiently weighty to require the Commonwealth to rebut the factor as part of its burden of proof. See id. This higher threshold of Gall I directly contravened the distinction Mullaney drew between merely requiring that a defendant \"present some evidence with respect to the fact at issue\" and requiring that \"he must affirmatively establish that fact.\" See 421 U.S. at 1891 n. 31 (emphasis added).\n\nIn short, the regime the Gall I Court constructed in response to Gall's evidentiary review was itself constitutionally infirm under Mullaney. The court should have adhered to Kentucky law at the time and addressed head-on whether the prosecution met its burden to show the absence of EED beyond a reasonable doubt. In averting this review, the Kentucky Supreme Court violated due process.\n\n3.\n\nIn contrast to even the prosecutor's and trial judge's reading of Kentucky law at the time, not to mention the Kentucky Supreme Court's clear interpretation of the murder statute, Judge Guy's dissent contends that the absence of EED was not an element of murder, and that our conclusion that it was \"is most clearly erroneous.\" Post at 114. It also argues that we \"compound[]\" our error by finding that mental illness equates with EED for purposes of the Kentucky murder statute. See id. After carefully considering the dissent's points and underlying reasoning, we respectfully disagree with both assertions. Indeed, we find the dissent's reasoning to rest on an anachronistic reading of Kentucky law--based on the Kentucky Supreme Court's explicit and non-retroactive re-interpretation of the Commonwealth's murder statute in the years after its Gall I decision.\n\ni)\n\nAt the risk of repeating our earlier discussion, we first address the dissent's contention that negating EED was not an element of murder. The dissent explains that \"nothing in the statute suggests that negating extreme emotional distress is an element of the crime of murder,\" a proposition we believe is belied by the text of the statute, its clear variation from the other states that adopted the same Model Penal Code murder provision, and, most importantly, the binding interpretation of the highest court in the Commonwealth up until 1985. Post at 115. Further, the dissent points to cases such as Wellman v. Commonwealth, 694 S.W.2d 696 (Ky. 1985), Buchanan v. Kentucky, 483 U.S. 402 (1987), and Coffey v. Messer, 945 S.W.2d 944 (Ky. 1997) to argue that Kentucky applied a more refined analysis of EED, and that its absence was not an element of murder even at the time of Gall's conviction and appeal. Rather, EED comprises what the dissent terms a \"'defense' or mitigation exception.\" Post, at 115. Third, the dissent attacks what it believes to be the illogical results of our reading of the law: namely, the \"absurdity\" of having to prove the absence of EED in all cases. While the modern treatment of EED is perhaps more logically sound and workable, we simply can not agree that the dissent's reading reflects the law applicable to Gall's case; indeed, the Gall I opinion itself did not apply the law the dissent describes. A thorough review of the evolution of Kentucky EED caselaw reveals this.\n\nFollowing the Commonwealth's incorporation of the Model Penal Code language into its definition of murder in 1974, the first Kentucky Supreme Court cases to explore its meaning were Edmonds, Ratliff, and Bartrug. As stated supra, all three opinions stated without condition or exception that the failure to act under the influence of an EED was an element of the offense of murder. See, e.g., Edmonds, 586 S.W.2d at 27. This was evident from the \"language of the statute,\" where \"[t]he legislature clearly intended the prosecution to bear the risk of non-persuasion\" on this element. Id. Under this reading, any showing of EED required the reading of that element as part of the murder instruction, as well as the reading of a first degree manslaughter instruction. See id. at 27. If the jury has a reasonable doubt \"as to whether [a defendant] was acting under the influence of extreme emotional disturbance, it will not find him guilty of murder but shall find him guilty of first-degree manslaughter.\" Id. Gall I, as we explained supra, did not alter this reading, although it tasked defendants for the first time with presenting evidence \"of such probative force that otherwise the defendant would be entitled as a matter of law to an acquittal on the higher charge.\" 607 S.W.2d at 109. Further, in 1981, the Kentucky Supreme Court still adhered to its earlier holdings that the absence of EED was an \"essential\" element of murder for which the \"legislature intended the Commonwealth to bear the risk of nonpersuasion.\" See Henley, 621 S.W.2d at 908 (citing Bartrug, 568 S.W.2d 925 (1978)). Making the point as clear as possible, the court recited the definition of murder in a way that included absence of EED as a clear element: \"Murder, under the statute, is an intentional killing where the defendant is not acting under the influence of extreme emotional disturbance.\" Id.; see also Hayes v. Commonwealth, 625 S.W.2d 583, 584 (Ky. 1982)(\"KRS 507.020 defines murder as death caused by intentional or wanton conduct in the absence of extreme emotional disturbance.\"). Importantly, these cases also relied on passages of Gall I, indicating that the new Gall I burden-shifting regime coexisted with the continuing notion that absence of EED was an element of murder.\n\nThis interpretation would soon change. In Wellman, a 1985 case on which the dissent heavily relies, the Kentucky Supreme Court articulated in the plainest of terms that, prior to Gall, absence of EED had indeed been an element of murder, and that Gall had not formally changed that interpretation, although it had perhaps signaled that the change was imminent.\n\nWe are continually beset with arguments founded upon \"extreme emotional disturbance\" despite the articulation of its meaning and impact in [Gall I]. It is our opinion that the principal cause of this problem is the failure of this court, in Gall, to specifically overrule those portions of Ratliff, Bartrug and Edmonds [] which declare that the absence of extreme emotional distress is an essential element of the crime of murder and require the Commonwealth to prove such absence. . . . To the extent that such cases declare absence of extreme emotional distress to be an element of the crime of murder, they are expressly overruled. Wellman, 694 S.W.2d at 697 (emphasis added).\n\nThe court proceeded to explain that \"[t]he presence of extreme emotional distress is a matter of evidence, not an element of the crime.\" Id. A year later, the court further explained that Wellman \"clarif[ied] that absence of extreme emotional disturbance is not an element of the crime of murder which the Commonwealth must affirmatively prove.\" Matthews v. Commonwealth, 709 S.W.2d 414, 421 (Ky. 1986). Moreover, the United States Supreme Court, looking only at Wellman and Gall in light of Wellman, concluded that EED was an affirmative defense, not an element of murder. See Buchanan v. Kentucky, 483 U.S. 402, 408 \u0026 408 n.8 (1987). Later cases have more routinely labeled EED as a defense to murder, see, e.g., Foster v. Commonwealth, 827 S.W.2d 670, 678 (Ky. 1991), although the precise role of that defense still appears in flux.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nThis line of cases illuminates the flaw in the dissent's contention that the absence of EED was not an element of murder at the time of Gall I. Its reliance on Wellman is in error because that case explicitly overruled the cases holding that the absence of EED was an element of murder--and those were the very cases in place when Gall's trial and appeal occurred, and that Gall I and Henley left in place. Only in Wellman did the Kentucky Supreme Court establish that the absence of EED is not an element of murder, and as we explain infra, we can not apply that holding retroactively to Gall's conviction and appeal. Equally unavailing is the dissent's reliance on Buchanan, since that case relied on Wellman to conclude that EED was an affirmative defense. In sum, the dissent's conclusion that the absence of EED was not an element of murder is based on caselaw that postdated Gall's conviction and appeal, and, it appears, that resulted from the dramatic shift that Gall I triggered due to its clear Mullaney violation. The caselaw applicable to Gall's case was clear that the absence of EED was indeed an element of murder.\n\nii)\n\nFor similar reasons, we also respectfully disagree with the dissent's careful substantive definition of EED, and its requirement that a specific predicate provocation must trigger EED. Specifically, the dissent reads Kentucky law to have distinguished between EED and mental illness or disease that amounts to insanity. \"The facts surrounding the murder are key to the extreme emotional disturbance defense. The facts surrounding defendant's mental disease or defect are key to the insanity defense.\" Post at 124. (emphasis added). According to the dissent, only when a predicate provocation\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e is found to have triggered the killing must the prosecution negate a showing of EED. Again, while the dissent's conception may reflect the law in Kentucky today, this more refined definition is based on caselaw that developed well after Gall I, and that can not be applied retroactively to his case. Again, review of the evolution in Kentucky caselaw on the substantive definition of EED plainly illustrates this point.\n\nFirst, however, it is important to understand the intent of the Model Penal Code framers when they introduced the concept of EED. The ALI Commentary explains that the \"provision includes the common-law doctrine of provocation but is not so limited in its scope.\" ALI, Model Penal Code and Commentaries, § 210.3, at 53-54. How far the provision intended to move from the common law was less than clear, however. The Commentary itself acknowledged that it was moving into uncharted waters. The provision, it explained, \"sweeps away the rigid rules that limited provocation to certain defined circumstances. Instead, it casts the issue in phrases that have no common-law antecedent and hence no accumulated doctrinal content.\" Id. at 61. \"This development reflects the trend of many modern decisions to abandon preconceived notions of what constitutes adequate provocation and to submit that question to the jury's deliberation.\" Id. It further noted that when setting out that the reasonableness of the defendant's action be assessed from the viewpoint of a person in the actor's situation, \"the word 'situation' is designedly ambiguous.\" Id. at 62. \"There thus will be room for interpretation of the word 'situation,' and that is precisely the flexibility desired.\" Id. The ALI added that it sought for courts and juries to focus far more closely on mental infirmities:\n\n[The provision] places far more emphasis than does the common law on the actor's subjective mental state. It also may allow an inquiry into areas which have been treated as part of the law of diminished responsibility or the insanity defense. Id. at 54.\n\nIn a separate publication, the Code's primary author echoed the ALI Commentary, stating that the new provision permitted a reduction to manslaughter \"on the basis of a standard much broader than the concept of provocation as developed at the common law.\" Herbert Weschler, Codification of Criminal Law in the United States: The Model Penal Code, 68 Colum. L. Rev. 1425, 1446 (1968). \"The purpose was explicitly to give full scope to what amounts to a plea in mitigation based upon mental or emotional trauma of significant dimensions, with the jury asked to show whatever empathy it can.\" Id.\n\nGiven the intentional ambiguity of the Model Penal Code, states adopted different approaches in defining EED. Some added additional specificity within the statutes themselves. See, e.g., N.D.C.C. 12.1-16-01 (noting that \"[a]n extreme emotional disturbance is excusable . . . if it is occasioned by substantial provocation, or serious event, or situation for which the offender was not culpably responsible\"); N.H. Stat. Ann. § 630:2 (requiring \"the influence of extreme emotional disturbance caused by extreme provocation\"). Most states, however, left the ambiguous language of the MPC unchanged, allowing courts to shape the precise meaning of EED. Several state courts read the new language to eliminate any provocation requirement, allowing certain showings of mental disease to be sufficient to show EED. The New York Court of Appeals, for instance, found that \"tremendous advances made in psychology since 1881\" had primarily led to the new EED defense. People v. Patterson, 347 N.E.2d 898, 908 (N.Y. Ct. App. 1976), aff'd 432 U.S. 197 (1977). Therefore, the common law provocation and immediacy prongs for the \"heat of passion\" defense were no longer required under New York law; rather, \"[t]he purpose of the extreme emotional disturbance defense is to permit the defendant to show that his actions were caused by a mental infirmity not arising to the level of insanity, and that he is less culpable for having committed them.\" Id. at 907. This interpretation was a crucial aspect of the Supreme Court's affirmance of the Patterson case. See 432 U.S. at 206-07 (noting that New York's EED affirmative defense required a defendant only to show a \"mental infirmity not arising to the level of insanity\"). Connecticut also adopted Patterson's reasoning, holding that the defense \"does not require a provoking or triggering event.\" State v. Elliot, 411 A.2d 3, 7 (Conn. 1979).\n\nFaced with the ambiguity of the new murder statute,\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e the Kentucky Supreme Court waited more than a decade before it developed a precise substantive definition of EED. At the time of Gall's trial it had yet to lay down a clear definition, and at the time of his appeal, it had stated merely \"that we know it when we see it.\" Edmonds, 586 S.W.2d at 27. Despite this ambiguity, the early cases indicated that the court agreed with New York and Connecticut that certain mental impairments were sufficient to show EED, and that no additional showing of a triggering event was necessary.\n\nThe Court in both Ratliff and Edmonds pointed to the respective defendants' psychological maladies as warranting EED instructions, failing to require the \"triggering\" event the dissent would demand. In Ratliff, the court stated that \"[t]he record is replete with evidence of an emotional disturbance.\" 567 S.W.2d at 309. It immediately elaborated that \"[t]wo expert psychiatrists testified that appellant suffered from schizophrenia-paranoid type. Both experts agreed that she was very likely psychotic at the time of the shooting and was unable to comprehend what was occurring.\" Id. The court then described the defendant's delusion about the circumstances around her, based on her own testimony that fellow townspeople, including the store clerk whom she shot, were conspiring against her. See id. The opinion further pointed out that Ratliff had been visiting a local care center for treatment of her mental condition for some time prior to the shooting. See id. While the dissent suggests that this discussion \"clearly\" shows that the Ratliff court was treating Ratliff's own \"delusion\" of the victim's conspiracy against her as the required \"predicate provocation,\"\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e the opinion itself makes no statement of the sort. Rather, it focuses more on Ratliff's psychological disposition as described by expert witnesses and manifested by her delusions. The opinion noted, in fact, that \"the situation presented was one which in the past would have been labeled as wilful murder with a defense of insanity.\" Id. Only three years later, the Kentucky Supreme Court itself interpreted Ratliff to have found that an EED instruction \"was mandated because two psychiatrists testified that the defendant was 'very likely' psychotic at the time she committed the homicide.\" Henley, 621 S.W.2d at 909. Without mentioning the \"triggering\" delusion that the dissent now emphasizes, the Henley Court characterized the evidence of Ratliff's mental condition as \"definitive, nonspeculative evidence\" of EED. Id. And as the dissent points out, three dissenting Justices in Ratliff protested just this aspect of the decision, opining that evidence only showing that Ratliff was suffering from a severe mental disease, without more, was not sufficient to qualify as EED. See id. at 310 (Jones, J., dissenting). While this minority view did not prevail at the time (as it would in later years), it helps clarify that the majority was treating Ratliff's mental illness as sufficient to show EED.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nAgain in Edmonds, the Kentucky Supreme Court relied primarily on psychological evidence to find that an EED instruction was necessary. The court explained that Edmonds had previously been hospitalized for a psychoneurotic condition, and that prior to his alleged killing of a 23-year old woman with whom he was infatuated, he had been taking a self-prescribed and self-compounded medication (a mixture of sodium bromide or alcohol and potassium bromide) that led him to \"blank out\" and act in a \"bizarre manner.\" 586 S.W.2d at 26. The court then explained that due to continual jealousy and his delusion that she was seeing another man, Edmonds shot her. See id. While the dissent once again casts Edmonds's \"delusion\" as the required triggering predicate for an EED instruction, see post at 120, the Edmonds Court itself suggests that this was not the case. Indeed, the court flatly rejected the Attorney General's argument that the EED instruction was not necessary because EED derived from the \"heat of passion\" defense (which required provocation). Instead, the court stated that\n\n[w]e find it unnecessary to define extreme emotional disturbance. It is suffice to say that we know it when we see it. In the present case, we see sufficient evidence to justify a submission of the issue to the jury. Id.\n\nAnd once again, looking back on the case three years later, the Henley Court assessed that the instruction was warranted in Edmonds because of the \"strong evidence\" of EED: namely, \"[t]he appellant had been hospitalized several times for mental problems, and shortly prior to the shooting, he had been taking a self-prescribed and self-concocted medication which affected him mentally.\" 621 S.W.2d at 909. Just as with Ratliff, there was no mention of any predicate provocation triggering a response from Edmonds--only his mental state.\n\nGiven these opinions from the prior two years, it is no surprise that the Gall I Court, when faced with a situation where the primary evidence of EED was that of Gall's mental illness, did not simply reject Gall's argument under the dissent's rationale that Gall did not offer a \"provocation predicate.\" Rather, the Court stated that\n\nthere is not a shred of evidence to suggest that he was acting under the influence of an emotional disturbance, or that there were any circumstances existing at the time of the killing to provoke or stimulate such a disturbance, except for the evidence that he suffered from a mental illness from which the jury could have found, but did not find, that he was insane. 607 S.W.2d at 109.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nWhile the court then stated that \"there [was] much to be said for the proposition that an emotional disturbance inhering in mental illness is not the kind of emotional disturbance contemplated by the statute,\" consistent with Edmonds and Ratliff, it did not so hold. Rather, for the purposes of the appeal, the court \"[a]ssum[ed] that a mental disorder, whether or not it amounts to legal insanity, may constitute a reasonable 'explanation or excuse' for extreme emotional disturbance.\" Id. Further showing that there was no hard-and-fast provocation requirement, the court stated that the trial court's decision to omit the latter half of the EED instruction was proper because there was \"no evidence to suggest that the appellant's motivation involved any 'belief' on his part with regard to the circumstances that induced the alleged emotional disturbance.\" Id;\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e see also Gall II, 702 S.W.2d at 43 (\"[U]nlike the case where emotional disturbance has been precipitated by some event or circumstance that the defendant believed to exist, there was no evidence that Gall was motivated by any 'belief' on his part with regard to the circumstances that induced the alleged emotional disturbance.\"). Importantly, rather than holding that Gall's failure to proffer evidence about a precipitating event meant that he had not made a showing of EED and was therefore not entitled to an instruction, the Court merely found that the language of the EED instruction could be altered to accommodate that fact. Had Kentucky law followed the approach to EED the dissent describes, none of this discussion in Gall I would have been necessary. But the decisions in Edmonds and Ratliff, which remained good law after Gall I, precluded the court from simply casting the evidence aside in the manner the dissent's analysis now proposes.\n\nFinally, the most telling evidence of the understanding of EED through Gall I is the new direction the Kentucky Supreme Court adopted in subsequent years, acting upon the skepticism it first expressed in Gall I regarding the loose definition of EED. See generally Eric Y. Drogin, To the Bring of Insanity: \"Extreme Emotional Disturbance\" in Kentucky Law, 26 N. Ky. L. Rev. 99, 110 (1999) (explaining that beginning with Gall, the 1980s \"witnessed an inevitable reaction to the rulings of the nature of Ratliff and Edmonds\"). While Henley and Hayes, 625 S.W.2d at 586 (implying that evidence that defendant suffered from paranoid schizophrenia was evidence of EED), adhered to Ratliff and Edmonds, in Wellman, in addition to overruling the statements in Ratliff and Edmonds that EED comprised an element of murder, the Kentucky Supreme Court also for the first time held that mental illness was not alone sufficient to show EED. It held that there must also be \"probative, tangible and independent evidence of initiating circumstances, such as provocation at the time of his act which is contended to arouse extreme emotional disturbance.\" 694 S.W.2d at 697. One year later, the Kentucky Supreme Court elaborated further, disavowing its statement in Edmonds that \"we know it when see it,\" and choosing instead to define EED precisely. See McClellan v. Commonwealth, 715 S.W.2d 464, 467 (Ky. 1986). First, it cited Wellman for the proposition that \"[e]xtreme emotional disturbance is something different from insanity or mental illness.\" Id. at 468. It then explicitly overruled Ratliff, concluding that the Ratliff Court had \"indicated that extreme emotional disturbance was akin to a lesser-degree defense of insanity\" and had suggested that a showing of mental illness or insanity, \"standing alone,\" was sufficient to establish EED. Id. It then proceeded to set out a precise definition of EED that included the proposition that EED \"is not a mental disease in itself.\" Id. Rather, EED \"is a temporary state of mind so enraged, inflamed, or disturbed as to overcome one's judgment, and to cause one to act uncontrollably from the impelling force of the extreme emotional disturbance.\" Id. Importantly, later Kentucky decisions held that this new definition of EED was to be applied prospectively, and not retroactively. See Smith v. Commonwealth, 734 S.W.2d 437, 449 (Ky. 1987). Later cases have also clarified even further that there must be a \"triggering\" event for there to be EED, and that that event must be \"sudden and uninterrupted.\" Foster v. Commonwealth, 827 S.W.2d 670, 678 (Ky. 1991); see also Cecil v. Commonwealth, 888 S.W.2d 669, 673 (Ky. 1994) (discussing the need for a \"'triggering' event\").\n\nWhile these later standards indeed resemble the dissent's conception of EED, they also show that that conception did not emerge until after Gall I. Through Gall I and the early 1980s, as McClellan, Henley, Ratliff and Edmonds illustrate, a showing of serious mental illness (and in several instances, a showing of paranoid schizophrenia) had been sufficient to meet the ambiguously defined EED. Because Gall made such a showing, he was entitled to the due process protections of Winship and Mullaney.\n\niii)\n\nFinally, we wish to articulate the reasons that the dissent's retroactive application of Kentucky Supreme Court decisions that overruled the clear precedent governing Gall I would be improper. First, by applying the more modern definition of EED to Gall's case, the dissent would directly contravene the Kentucky Supreme Court's own determination that the new definition of EED in McClellan was to be applied prospectively. See Smith, 734 S.W.2d at 449. It was McClellan that overruled Ratliff's conclusion that mental illness, standing alone, could comprise evidence of EED, but Smith made clear that this refined definition was not to be applied retroactively. We must defer to this state determination.\n\nMore generally, applying cases such as Wellman and McClellan to Gall's case would defy the underlying purpose of habeas review. The task of a habeas court under §2254 is to assess the constitutionality of a state court conviction. Even with respect to questions of federal constitutional law, habeas review is constrained by robust principles of finality and non-retroactivity. See generally Teague v. Lane, 489 U.S. 288 (1989). Principles of comity and finality equally command that a habeas court can not revisit a state court's interpretation of state law, and in particular, instruct that a habeas court accept the interpretation of state law by the highest state court on a petitioner's direct appeal. See, e.g., Mullaney, 421 U.S. at 691 (\"[W]e accept as binding the Maine Supreme Court's construction of state homicide law.\"); Gryger v. Burke, 334 U.S. 728, 731 (1948) (stating that because the petitioner alleges only that a state trial court misinterpreted state law, and that because that court's action was affirmed by the highest court in Pennsylvania, the court was not empowered to adopt a different view of state law); Norris v. Schotten, 146 F.3d 314, 328 (6th Cir. 1998) (stating that a habeas court should not revisit an issue of state law, and that doing so is \"especially inappropriate\" when the state law issue was resolved on direct appeal); Johnson v. Rosemeyer, 117 F.3d 104, 113 (3d Cir. 1997) (\"In habeas cases [], district courts act after the state court has decided the state law and applied it to the same record that is before the habeas court. To permit federal courts to speculate about the direction state law may take in the face of an authoritative final decision of a state court in the same case would directly interfere with the state's ability to decide the meaning of its own law.\") (citation omitted) . It is against this baseline of binding state law, and the facts of the case at hand, that we review de novo a state court's resolution of whether Gall's conviction violated our Constitution. See generally Bute v. Illinois, 333 U.S. 640, 670 (1948) (\"It is our province to decide whether the practice of the Illinois court in these cases, although admittedly in conformity with the law of Illinois, was so clearly at variance with [due process] that these sentences must be clearly invalidated.\"). While a habeas court may consult intervening state decisions in instances where those decisions clarify or illustrate the law that was applied in the petitioner's own case, see, e.g., Cole v. Young, 817 F.2d 412, 421-22 (1987) (examining intervening Wisconsin decisions to comprehend state law applicable to petitioner), or decisions that correct other courts' misinterpretations of that law, see Duffy v. Foltz, 804 F.2d 50, 54 (6th Cir. 1986)(deferring to Michigan Supreme Court's conclusion on the role of the insanity defense, which conflicted with a prior Sixth Circuit interpretation of Michigan law); Glenn, 635 F.2d at 1188 (deferring to intervening Ohio Supreme Court decision that illustrated that a district court's interpretation of Ohio law had been incorrect), it would defy the fundamental framework of habeas review to apply intervening state precedent that explicitly overruled the state law applied in a petitioner's case.\n\nA simple example demonstrates this point. Jackson v. Virginia requires that habeas courts examine whether a rational trier of fact could have found a defendant guilty beyond a reasonable doubt, and instructs that such a review be made \"with explicit reference to the substantive elements of the criminal offense as defined by state law.\" 443 U.S. at 324 n.16. Suppose that a habeas petitioner, convicted at a time when three elements were required under state law, argues that the prosecution failed to prove the third element. Review under Jackson would be meaningless if a habeas court were retroactively to apply later state cases removing that third element and explicitly overruling the precedent applied in petitioner's case. Yet this is precisely what the dissent's approach proposes that we do.\n\nMoreover, constitutional due process would be violated by casting aside Kentucky Supreme Court holdings establishing the absence of EED as an element of murder in favor of later cases overruling those precedents, particularly when the Kentucky Supreme Court itself applied those early cases 1) to Gall's case, 2) to cases heard both before and after Gall I, and 3) to crimes that took place before and after Gall's. No less than in Mullaney itself, applying Wellman's conclusion that absence of EED was not an element of the crime (when Gall I and even later cases accepted that crucial premise) would effectively shift the burden of proof on an element onto Gall, with the only difference being that the Mullaney violation would occur at the collateral review stage. The Supreme Court since Mullaney has cautioned that a state must not be allowed to \"manipulate its way out of Winship.\" Jones, 526 U.S. at 240; see also Mullaney, 421 U.S. at 691 n.11 (cautioning that a state-court interpretation of state law can be re-examined when it \"appears to be an obvious subterfuge to evade consideration of a federal issue\")(citation omitted). Applying the fundamentally new conception of EED outlined in later cases such as Wellman to Gall's collateral review would allow the Commonwealth to avert Winship in just that way.\n\nFinally, retroactively applying the later Kentucky cases to Gall's habeas petition would also violate the non-retroactivity principle articulated in Bouie v. Columbia, 378 U.S. 347 (1964). While the ex post facto clause precludes state legislatures from retroactively altering the definition of crimes, see California Dep't of Corrections v. Morales, 514 U.S. 499, 504 (1995); Collins v. Youngblood, 497 U.S. 37, 43 (1990), the Bouie Court held that state supreme courts are \"barred by the Due Process Clause from achieving precisely the same result by judicial construction.\" Bouie, 378 U.S. at 353-54; see also Dale v. Haeberlin, 878 F.2d 930, 934 (6th Cir. 1989) (stating that \"'a state supreme court is barred by the due process clause from achieving by judicial construction a result which a state legislature could not obtain by statute'\")(quoting Jordan v. Watkins, 681 F.2d 1067, 1079 (5th Cir. 1982)). Thus, just as in the ex post facto context, the heart of the Bouie analysis is scrutinizing the definition and construction of the criminal act, see id., and ascertaining if the construction by the later court decision was foreseeable by the defendant in question. See Bouie, 378 U.S. at 354 (concluding that the change in law was \"unexpected and indefensible by reference to the law which had been expressed prior to the conduct in issue\")(citation omitted). If the new interpretation was in fact unforeseeable, if it was applied to events occurring before its enactment, see Weaver v. Graham, 450 U.S. 24, 29 (1981), and if the interpretation disadvantages the offender affected by it, see id., then Bouie and Dale instruct that due process is violated just as the ex post facto clause would be. Although a decision can render a \"disadvantage\" in a number of ways, see Collins, 497 U.S. at 43, 52, the elimination of an element of a crime is the quintessential disadvantage that can not be applied retroactively. See Carmell v. Texas, 120 S.Ct 1620, 1632-33 (2000)(noting that \"retrospectively eliminating an element of the offense\" violates the ex post facto clause); Collins, 497 U.S. at 43 (explaining that the original understanding of the Ex Post Facto Clause was that \"[l]egislatures may not retroactively alter the definition of crimes\"). Moreover, a law that alters the proof necessary to convict a defendant also violates the ex post facto clause. See Wilson v. Yaklich, 148 F.3d 596, 606 (6th Cir. 1998) (noting that laws affecting the \"degree of proof necessary to establish [] guilt\" implicate the ex post facto clause) (quoting Hopt v. Utah, 110 U.S. 574, 589-90 (1884)); Murpy v. Sowders, 801 F.2d 205, 207 (6th Cir. 1986) (stating that laws violate the ex post facto clause when they \"alter the degree, or lessen the amount or measure, of the proof which was made necessary to conviction when the crime was committed\").\n\nThese standards make clear that the Kentucky Supreme Court's explicit alterations of its interpretation of EED in cases such as Wellman and McClellan can not be applied to Gall's case. These later cases achieved two things: they held that absence of EED was not an element of murder, and they made a defendant's task considerably more demanding by introducing a precise \"triggering\" predicate that was articulated in neither the statute nor prior caselaw. Both cases explicitly overruled prior caselaw. Applying these new rules to Gall's case would clearly violate Bouie. Under the most reasonable reading of the statute's plain text--that absence of EED was an element of the crime, with no mention whatsoever of the \"triggering\" requirement that developed in later cases, and with legislative history suggesting a move away from the precise provocation requirement of the \"heat of passion\" element--the new conception of EED introduced by the later cases changed the law in ways that were unforeseeable at the time of the acts Gall committed. Beyond the statute itself, Kentucky Supreme Court's earliest interpretations of the statute, its decision to apply this reading retroactively to cases that occurred shortly after the statute came into effect (and prior to Gall's offense), and its explicit acknowledgment that the later cases were directly overruling the prior cases, all support this view. It is also clear that the retroactive application of those cases would substantially disadvantage Gall, both by removing an element of murder, and by making Gall's burden of showing EED substantially more difficult.\n\nIn the alternative, one could reason that the face of the statute was sufficiently unclear that at the time of Gall's crime, it could be interpreted either as establishing absence of EED as an element (as the state courts initially believed), or as a defense or matter of evidence (as the courts later believed, and as the dissent now believes). When faced with a considerable ambiguity on a facet as critical as a potential element of a crime, a court may rule that such a statute is void for vagueness or, in certain circumstances, it may add a clarifying gloss to that statute and apply it prospectively. But it would once again violate due process to apply that added and unforeseen precision retroactively. See generally Lanzetta v. New Jersey, 306 U.S. 451, 456-67 (1939)(stating that the New Jersey Supreme Court improperly applied its interpretation of a vague statute against defendants because \"[i]t would be hard to hold that, in advance of judicial utterance upon the subject, they were bound to understand the challenged provision according to the language later used by the court\"); United States v. Salisbury, 983 F.2d 1369, 1380 (6th Cir. 1993)(finding it inappropriate to cure a vague statute and apply the new construction retroactively to conduct prior to the holding). Cf. Marks v. United States, 430 U.S. 188, 195 (1977)(holding that because a federal obscenity statute was vague and sweeping, a Court decision relaxing constitutional standards on First Amendment protection of obscenity could not be applied retroactively).\n\nIn sum, due to constrictions imposed by Kentucky law, the underlying purpose of habeas review, as well as due process limitations articulated in Mullaney and Bouie, we decline the dissent's invitation to apply cases and conceptions of EED that overruled critical premises governing the Gall I decision to Gall's collateral attack of that decision. Rather, we will adhere, as we must, to the Kentucky Supreme Court's conception of EED that preceded the dramatic changes marked by Wellman and McClellan, a conception that the Gall I court applied to Gall's appeal as well as to crimes that occurred both before and after the crime in this case.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nC. Sufficiency of Evidence of Insanity\n\nGall next argues that his due process rights were violated because the evidence clearly showed that he was insane. Because we hold that Gall can not bring this argument on habeas review, we do not reach its merits.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nA state prisoner is entitled to relief under 28 U.S.C. § 2254 only if he is held \"in custody in violation of the Constitution or laws or treaties of the United States.\" A challenge to a conviction must therefore do more than pose a question of state law, for such a challenge alleges no deprivation of federal rights and does not merit habeas relief. See Engle v. Isaac, 456 U.S. 107, 119 (1982); see also Estelle v. McGuire, 502 U.S. 62, 67-68 (1991) (\"[I]t is not the province of a federal habeas court to re-examine state-court determinations on state-law questions.\"). With this requirement, the dichotomy discussed supra between elements and non-elements of a criminal act again plays an important role. Challenges to evidence pertaining to an element of an offense raise constitutional due process concerns under In Re Winship and are thus reviewable on habeas review. On the other hand, challenges to evidence on non-elements do not generally implicate In Re Winship, and are not reviewable through a § 2254 petition. See Engle, 456 U.S. at 119-22 (refusing to review an argument pertaining to an affirmative defense). An alternative way to gain habeas review is to show that a defense raised fully \"negates an element\" of a crime; a state must then disprove that defense as part of its burden of proof. See id. at 122. A contention that a state failed to disprove this type of defense raises a colorable constitutional claim appropriate for habeas review. See id.\n\nIn Kentucky, however, sanity is not an element of murder, and insanity does not negate an element of murder. We thus can not review this claim. First, Kentucky law does not include sanity as an element of murder. Unlike the EED element, § 507.020 does not indicate that absence of sanity is a required element of murder. The statute also places the burden of proving legal insanity squarely on a defendant's shoulders. See Ky. Rev. Stat. Ann. § 500.070 (placing burden of proof onto defendants whenever the statute provides that the defendant may prove the element of a case \"in exculpation of his conduct\"); Ky. Rev. Stat. Ann. § 504.020 (stating that a defendant \"may prove [legal insanity] in exculpation of criminal conduct\").\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Consistent with the statute, Kentucky courts have consistently concluded that sanity is not an element of murder, that insanity is a defense, and that the burden of proving insanity rests with the defendant. See, e.g., Hayes, 625 S.W.2d at 586; Brewster v. Commonwealth, 568 S.W.2d 232, 234 (Ky. 1978); Wainscott v. Commonwealth, 562 S.W.2d 628, 631 (Ky. 1978). This case is thus no different than Duffy v. Foltz, 804 F.2d 50, 54 (6th Cir. 1986), where this Court held that because sanity was not an element of the relevant crimes under Michigan law, Duffy's claim that there was insufficient proof of sanity did not raise a federal constitutional issue. See also Redman, 858 F.2d at 1200 (stating that there were no cognizable grounds for habeas relief \"[b]ecause under Michigan law sanity is not an element\" of the charged offenses).\n\nWe also reject Gall's alternative argument that we can review the question of sanity because showing the absence of sanity wholly negates the element of intent, placing the burden back on the Commonwealth to prove sanity beyond a reasonable doubt. Kentucky courts have consistently held that an insanity defense does not negate an element of the crime, and that a showing of insanity does not shift the burden of proving sanity onto the Commonwealth. See, e.g., Edwards, 554 S.W.2d at 383. Gall points to no cases showing otherwise. Because Gall's argument does not raise a constitutional issue, it is not subject to habeas review.\n\nD. Sitting a \"Tainted\" Juror\n\nGall next argues that in rejecting his challenge for cause of one juror (\"Barton\"), the trial court violated his right to an impartial jury under the Sixth and Fourteenth Amendments. The question of whether a trial court has seated a fair and impartial jury is a factual one, involving an assessment of credibility. See Patton v. Yount, 467 U.S. 1025, 1038 (1984). On habeas review, this court inquires \"whether there is fair support in the record for the state courts' conclusion that the jurors [] would be impartial.\" Id.; see United States v. Smith, 748 F.2d 1091, 1094 (6th Cir. 1984). We find that there was fair support in the record for the trial court's decision.\n\n1.\n\nThe Supreme Court recognizes two substantive standards that apply to juror challenges. Gall primarily relies on the standard announced in Marshall v. United States, 360 U.S. 310 (1959), in which the Supreme Court presumed prejudice for jurors who learn of prior criminal histories through news sources. But as this Court stated in Haney v. Rose, 642 F.2d 1055, 1058 (6th Cir. 1981), the decision in Marshall \"was expressly based on the supervisory power of the Supreme Court\" over federal courts, and was not \"constitutionally compelled.\" The standard that is required when a habeas petitioner is attacking a state court conviction is more demanding;\"[f]ederal courts will not presume unfairness of constitutional magnitude in the absence of particularly egregious circumstances.\" Id.\n\nThe Supreme Court's decision in Murphy v. Florida, 421 U.S. 794 (1975), outlined the contours of this inquiry. Despite the requirement of fairness and impartiality, \"[q]ualified jurors need not [] be totally ignorant of the facts and issues involved. . . . 'It is sufficient if the juror can lay aside his impression or opinion and render a verdict based on the evidence presented in court.'\" Id. at 799-800 (quoting Irvin v. Dowd, 366 U.S. 717, 723 (1961)). A juror is not properly seated if at voir dire, he exhibits such hostility toward a defendant \"as to suggest a partiality that could not be laid aside.\" Id. at 800. The Murphy Court and this Court have outlined different factors to be weighed in making such a determination, including: the nature of the information the juror knew; how probative the information was as to a defendant's guilt; when and how they learned of that information; the juror's own estimation of the relevance of that knowledge; any express indications of partiality by a juror; whether the broader atmosphere in the community or courtroom was \"sufficiently inflammatory,\" id. at 802; and the steps taken by the trial court in neutralizing this information. See id.; Haney, 642 F.2d at 1059-60 (finding that jurors were impartial); Goins v. McKeen, 605 F.2d 947, 952-54 (6th Cir. 1979) (concluding that jurors' exposure to a newspaper article on the second day of trial rendered the trial fundamentally unfair).\n\nAnalyzing these factors, we believe that the record fairly supports the trial court's conclusion that Barton was impartial. Barton acknowledged at voir dire that he had read about Gall and his alleged crime in the Kentucky Post. J.A. at 206-07. From that article, Barton stated that he knew Gall was from Hillsboro; that Gall had \"been accused of similar offenses previously[;] that I was somewhat upset or disturbed that the State Policemen were involved in this to the point that it could have cost another life;\" and that Gall had children of his own. J.A. at 207-08. He also stated that he had read that Gall was on parole for one of his past offenses. J.A. at 209. Despite this knowledge, Barton repeatedly assured defense counsel that this information did not affect his feelings toward Gall or how he would approach the trial. See J.A. at 207-08 (\"No, I don't think so once the actual evidence is presented. I don't know how much stock can be put in the Kentucky Post as far as forming an opinion.\"); J.A. at 209 (stating that his prior knowledge would not make him more inclined to find Gall guilty). Barton likewise assured the judge of his ability to look at the evidence neutrally and lay aside what he had read or heard. Finally, after overruling Gall's motion to strike Barton, the judge instructed him that if he were selected as a juror, he could not discuss what he had learned prior to trial with the jury.\n\nGiven this colloquy, this case is analogous to Murphy and Haney, where jurors were not sufficiently partial to warrant reversal. Overall, the voir dire of Barton \"indicates no such hostility\" toward Gall \"as to suggest a partiality that could not be laid aside.\" Murphy, 421 U.S. at 800. First, Barton made no statement as problematic as that by the Murphy juror who admitted that \"his prior impression of petitioner would dispose him to convict,\" id. at 801--a statement that the Supreme Court found insufficient to warrant reversal. Second, as in Haney, Barton learned of the information before trial, while Goins involved the \"stricter standard\" to be applied when prejudicial information was obtained during trial. 642 F.2d at 1059. Third, the information that Barton described on the record did not appear to be inherently prejudicial or unduly probative of petitioner's guilt, particularly considering Barton's explicit skepticism of the Kentucky Post and assurances that he was not unduly influenced by that information. See id.; cf. Goins, 605 F.2d at 953 (involving newspaper article discussing defendant's plea to a lesser included offense, as well as defendant's involvement in another aggravated murder case). While not dispositive, see, e.g., Murphy, 421 U.S. at 800; Goins, 605 F.2d at 953, such juror assurances are certainly one of the factors a trial judge can consider in determining whether that juror \"can lay aside his impression or opinion.\" Irvin, 366 U.S. at 723; see Smith, 748 F.2d at 1094-95 (relying in part on juror's reassurances). Finally, unlike in Goins, the trial judge took \"appropriate steps\" to assure Barton would be impartial, instructing him not to discuss what he had learned with other jurors.\n\nThe factor that most strongly supports Gall's argument is that Barton knew of Gall's parole status, adding a potentially inflammatory piece of information about the crime. We do not believe this factor alone outweighed the other indicia of Barton's impartiality. In sum, there is ample support in the record for the trial court's conclusion that Barton could sit on the jury.\n\nE. Impartial Jury\n\nGall further argues that other factors combined to deny him his right to an impartial jury. Specifically, he argues that widespread pretrial publicity, the court's refusal to change the trial venue, its failure to sequester the jurors during voir dire, and the evidence from voir dire that the publicity \"pervaded\" the venire, engendered a partial jury and a fundamentally unfair trial. The Commonwealth counters that the jury venire, and the ultimate panel selected, were sufficiently impartial.\n\nIn essence, Gall argues that this Court should presume that the trial was unconstitutionally prejudiced, as courts are required to in those cases where an inflammatory, circus atmosphere pervades both the courthouse and the surrounding community. See, e.g., Sheppard v. Maxwell, 384 U.S. 333, 358 (1966) (involving a \"carnival atmosphere at trial,\" with intense media coverage and presence in the courtroom, and a lack of adequate jury instructions); Estes v. Texas, 381 U.S. 532 (1965) (involving a \"circus atmosphere,\" with the press sitting in the bar of the court); Rideau v. Louisiana, 373 U.S. 723 (1963) (presuming prejudice when televised interview of defendant's confession from prison had been widely aired); Irvin, 366 U.S. at 725-28 (involving extensive prejudicial accounts in the media, and where 90% of the venire and eight of twelve jurors believed the defendant was guilty prior to the trial). This Court in DeLisle clarified that courts should only presume prejudice in those cases where the \"'general atmosphere in the community or courtroom is sufficiently inflammatory.'\" 161 F.3d at 382 (quoting Murphy, 421 U.S. at 802). Overall, such a trial must be \"entirely lacking in the solemnity and sobriety to which a defendant is entitled in a system that subscribes to any notion of fairness and rejects the verdict of a mob.\" Murphy, 421 U.S. at 799.\n\nIn contrast to those extraordinary circumstances where a court must presume prejudice, trials with a lower degree of prejudice--even those with a good deal of pretrial publicity--require a showing that \"in the totality of circumstances [the] trial was not fundamentally fair.\" Id. In recent years, this Court has on several occasions relied on Murphy to find that a trial atmosphere was sufficiently fair to require a showing of actual prejudice. These holdings came despite some factual similarities to cases like Sheppard and Irvin. See, e.g., Nevers, 169 F.3d at 367-68; DeLisle, 161 F.3d at 385-88; Brofford v. Marshall, 751 F.2d 845, 848-52 (6th Cir. 1985); Jenkins v. Bordenkircher, 611 F.2d 162 (6th Cir. 1979).\n\nThis case exhibits many, but not all, of the aspects of trials so pervaded with unfairness that courts presume prejudice. We have concluded that other due process violations occurred in this trial, and also that the introduction of extraneous evidence into the jury's deliberations worked actual prejudice into the penalty phase of Gall's trial. We need not make the difficult determination of whether we ought to presume prejudice as well.\n\nF. Prosecutorial Misconduct\n\nGall argues that a host of prosecutorial statements and tactics violated his constitutional rights. The alleged instances of misconduct include: the violation of Gall's right to remain silent by emphasizing his failure to testify; misrepresentation of evidence; prejudicial statements and actions depriving Gall a fair determination of sanity;\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e and a host of other actions that appealed to the passions and prejudices of the jury. Gall argues that these improprieties rendered the proceeding fundamentally unfair.\n\nAlthough Gall's counsel did not object to these infractions at trial, we are not barred from hearing these claims. A habeas court only adheres to a state procedural bar when the last state court rendering a reasoned judgment on the matter has stated \"clearly and expressly\" that its judgment rests on that procedural bar. Boyle v. Million, 201 F.3d 711, 716 (6th Cir. 2000) (quoting Coleman v. Thompson, 501 U.S. 722, 735 (1991)). In this case, the Kentucky Supreme Court addressed and rejected Gall's allegations of prosecutorial misconduct on their merits. See, e.g., Gall I, 607 S.W.2d at 110 (\"To be mercifully brief, we do not find in this record any conduct by the prosecuting attorney that could be said to have been inconsistent with Gall's right to a fair trial.\"). This issue is therefore not barred from review.\n\n1. Fifth Amendment Claim\n\nA defendant's Fifth Amendment right against self-incrimination protects him from several types of government misdeeds. First, once a defendant exercises his right to silence after being read his Miranda rights, that post-arrest silence cannot be used to his detriment at trial. See Doyle v. Ohio, 426 U.S. 610, 618 (1976); United States v. Williams, 665 F.2d 107, 109-10 (6th Cir. 1991). Second, the prosecution is forbidden from commenting on a defendant's decision not to testify at trial. See Griffin v. California, 380 U.S. 609, 615 (1965); Rachel v. Bordenkircher, 590 F.2d 200 (6th Cir. 1978). While direct comments about a decision to remain silent or not to testify are clearly prohibited, indirect comments require a more probing analysis. See Lent v. Wells, 861 F.2d 972, 975 (6th Cir. 1988). Such comments warrant reversal only when they are \"manifestly intended by the prosecutor as a comment on the defendant's failure to testify or were of such a character that the jury would naturally and reasonably take them to be comments on the failure of the accused to testify.\" Bagby v. Sowders, 894 F.2d 792, 797-98 (6th Cir. 1990). A court should not find manifest intent from such comments if some other explanation for the prosecutor's remarks is equally plausible. See Lent, 861 F.2d at 975. This occurs, for instance, when the comment is \"a fair response to a claim made by defendant or his counsel.\" United States v. Robinson, 485 U.S. 25, 32 (1988).\n\nHarmless error analysis applies to Fifth Amendment violations. This \"extremely narrow\" standard requires reversal only when the state can \"demonstrate beyond a reasonable doubt that the error did not contribute in any way to the conviction of the defendant.\" Eberhardt v. Bordenkircher, 605 F.2d 275, 278 (6th Cir. 1979).\n\nGall points to two occasions where the Commonwealth improperly referred to his silence at trial. First, an officer testified that Gall \"wouldn't talk\" after making several statements after his initial arrest. J.A. at 63. Second, the Commonwealth indirectly referred to Gall's silence when it stated to the jury: Gall \"sits in this courtroom as you have heard the testimony and he has lied to his parents in every instance and told them he didn't do it. The man has not even acknowledged his wrong, his fault, his crime, he denies them. He denies them to this day.\" J.A. at 1635.\n\nDespite Gall's contentions, we need not address the question of whether these statements contravened the Fifth Amendment because they comprised harmless error. As discussed supra, there was little dispute over whether Gall committed the crime; the heart of this trial was whether he was emotionally disturbed or legally insane when he did so. Because these references are not material to that issue, even if violative of his Fifth Amendment rights, they were harmless error.\n\n2. The Closing Argument\n\nIn examining alleged prosecutorial misconduct on habeas review, this Court can only provide relief \"if the relevant misstatements were so egregious as to render the entire trial fundamentally unfair to a degree tantamount to a due process violation.\" Caldwell, 181 F.3d at 736 (citing Donnelly v. DeChristoforo, 416 U.S. 637, 643-45 (1974)); see also Darden v. Wainwright, 477 U.S. 168, 181 (1986). In assessing whether the error amounts to a constitutional deprivation, the court must view the totality of the circumstances. See Hayton v. Egeler, 555 F.2d 599, 604 (6th Cir. 1977). We must first determine if the comments were improper. See Boyle, 201 F.3d at 717. We then must determine if the comments were sufficiently flagrant to warrant reversal by looking to four factors: 1) the likelihood that the remarks would mislead the jury or prejudice the accused; 2) whether the remarks were isolated or extensive; 3) whether the remarks were deliberately or accidentally presented to the jury; 4) whether other evidence against the defendant was substantial. See id.; United States v. Carroll, 26 F.3d 1380, 1385-87 (6th Cir. 1994). Because defense counsel did not object to almost any of the statements made, plain error analysis is required. See Blandford, 33 F.3d at 709; United States v. Morrow, 923 F.2d 427, 432 (1991).\n\na.\n\nWe agree that the Commonwealth's closing argument was laced with improper, prejudicial statements. First, prosecutors cannot make appeals to their own personal beliefs and opinions. See Caldwell, 181 F.3d at 737 (stating that a prosecutor cannot \"express a personal opinion concerning the guilt of the defendant or the credibility of trial witnesses\"); Carroll, 26 F.3d at 1387-88 (noting the impropriety of the government conveying \"a conviction of personal belief regarding the witness's veracity\"). Courts frown upon such statements for two reasons:\n\nsuch comments can convey the impression that evidence not presented to the jury, but known to the prosecutor, supports the charges against the defendant and can thus jeopardize the defendant's right to be tried solely on the basis of the evidence presented to the jury; and the prosecutor's opinion carries with it the imprimatur of the Government and may induce the jury to trust the Government's judgment rather than its own view of the evidence.\n\nUnited States v. Young, 470 U.S. 1, 18 (1985); see also Caldwell, 181 F.3d at 737 (stating that personal appeals exceed \"the legitimate advocate's role by improperly inviting the jurors to convict the defendants on a basis other than a neutral independent assessment of the record proof\").\n\nDespite this prohibition, throughout his closing argument the prosecutor improperly expressed his personal belief about crucial matters before the jury. For instance, the prosecutor declared in closing that he was \"not [] convinced that [Gall] isn't just a mean, shrewd, criminal.\" J.A. at 1591. He again voiced his personal belief when he stated that \"I think you can probably be skeptical of\" the results of intelligence and psychiatric tests. J.A. at 1584. He echoed this tactic once again when he asked if Gall's explanation of schizophrenia \"stretched\" the jury's \"powers of reasoning? It certainly does mine.\" J.A. at 1586. Similarly, he clearly expressed his personal belief about the credibility of key witnesses. Of Dr. Noelker, the doctor who had thoroughly examined Gall, the prosecutor stated that \"I have known him for along time and I know he is [a fine man].\" He then declared that Dr. Noelker was \"a man of compassion\" whose beliefs \"slant[] his opinions which he gives [and] his conclusions that he draws.\" J.A. at 1583. \"He is a man I believe who believes he is standing in . . . between Eugene and his ultimate destiny and I believe that weighs heavily on him. . . .\" J.A. at 1583. He also stated that \"I thought\" aspects of Dr. Noelker's and Dr. Toppen's testimony were \"really unusual, really unique.\" J.A. at 1581. Finally, the prosecutor summed up his assessment of Gall's psychiatric witnesses and evidence by stating:\n\n[Y]ou don't have to believe these guys. You know what it reminds me of? It reminds me of the three blind men who were taken out and they were asked to identify an elephant. One grabbed the trunk, one grabbed the tail, one grabbed the leg and you can imagine the bizarre opinions which they got back on how an elephant looked. J.A. at 1589.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nNext, the Commonwealth mischaracterized crucial evidence and testimony pertaining to Gall's showing of EED and insanity. Misrepresenting facts in evidence can amount to substantial error because doing so \"may profoundly impress a jury and may have a significant impact on the jury's deliberations.\" Donnelly, 416 U.S. at 646. This is particularly true in the case of prosecutorial misrepresentation because a jury generally has confidence that the prosecuting attorney is faithfully observing his obligation as a representative of a sovereignty, whose interest \"in a criminal prosecution is not that it shall win a case, but that justice will be done.\" Berger v. United States, 295 U.S. 78, 88 (1935). Nonetheless, the prosecution was particularly irresponsible when summarizing Dr. Noelker's testimony, which clearly lay at the heart of the case. For instance, he stated that Dr. Noelker \"told\" the jury that \"remission [] means [Gall] is legally feigning,\" J.A. at 1585. In examining the record, we find that to be a distorted construction of a vital portion of Dr. Noelker's testimony. The prosecutor also suggested that Dr. Noelker merely thought it was \"possible\" that Gall suffered from EED, J.A. at 1589, when Dr. Noelker definitively stated that Gall suffered from such a disturbance. Indeed, as discussed supra, Dr. Noelker's statement that Gall was under EED was a crucial issue of the case, one which the Commonwealth had not otherwise rebutted. It was Dr. Chutkow, the state's own witness, who stated that it was possible that Gall was in a \"state of exacerbation\" the morning of the killing. Finally, in cross-examining Dr. Noelker, the prosecution on several occasions suggested that Dr. Chutkow disagreed with Dr. Noelker's conclusion that Gall was legally insane, J.A. at 1032-34, when Dr. Chutkow clearly stated both on direct examination and cross-examination that he could not challenge Dr. Noelker's conclusions because he did not have the wealth of data that Dr. Noelker had. J.A. at 320, 350-51.\n\nThese comments and misrepresentations comprised part of a broader strategy of improperly attacking Gall's insanity defense by criticizing the very use of the defense itself, rather than addressing its evidentiary merits head on. Courts have long castigated prosecutors when their efforts to rebut an insanity defense constitute no more than an attack on the rationale and purpose of the insanity defense itself. As the Supreme Court of Florida articulated:\n\nWe believe that once the legislature has made the policy decision to accept insanity as a complete defense to a crime, it is not the responsibility of the prosecutor to place that issue before the jury in the form of repeated criticism of the defense in general. . . . To do so could only helplessly confuse the jury. The insanity defense is a policy question that has plagued courts, legislatures, and governments for decades. It is unnecessary to similarly plague []juries. Garron v. State, 528 So.2d 353, 357 (Fla. 1988). See also, e.g., People v. Wallace, 408 N.W.2d 87, 91 (Mich. Ct. App. 1987) (finding reversible error because a prosecutor argued against the insanity defense generally); State v. Percy, 507 A.2d 955, 958 (Vt. 1986) (finding improper and prejudicial a prosecutor's comments that the insanity defense constituted a \"mere attempt to escape justice\"). Indeed, the Kentucky Supreme Court stated only months before the Gall trial that trials \"must conform to the principle that insanity is a defense, and the defendant must be allowed to prove it in accordance with the accepted rules of evidence.\" Jewell v. Commonwealth, 549 S.W.2d 807, 812 (Ky. 1977), overruled on other grounds by Payne v. Commonwealth, 623 S.W.2d 867 (Ky. 1981). Courts also frown upon prosecutorial tactics that, in an effort to rebut a defendant's evidentiary showing of insanity, simply make \"know-nothing appeals to ignorance\" rather than present testimony countering the defendant's showing in an evidentiary rigorous way. United States v. Brawner, 471 F.2d 969, 1004 (D.C. Cir. 1972) (criticizing as improper prosecutorial comments disparaging an expert witness's tests showing mental disease as \"just blots of ink\").\n\nIn its closing, the Commonwealth used just such highly prejudicial tactics. Rather than attacking Gall's insanity evidence by pointing to counter-evidence that Gall was sane, the Commonwealth simply assaulted the very use of the defense. As he began addressing the issue, the prosecutor compared the insanity defense to other possible defenses. Other defenses, he emphasized, require \"facts,\" but an insanity defense \"is all contained in the skull of the defendant.\" J.A. at 1579.\n\nThat is the last line of defense. That is like taking an M1 Rifle and lying in your back yard waiting for the Russians to come. When it is that bad folks, it is all over. . . . Now I want to review this cranial defense within the skull of the Defendant . . . . J.A. at 1579-80.\n\nHe later reminded the jury not to be \"hoodwinked into the defense of insanity,\" J.A. at 1592. Further, his comments were peppered with the type of \"know-nothing appeals to ignorance\" that deprive defendants of their right to a fair consideration of their insanity defense. For instance, the Commonwealth mocked Dr. Noelker's use of a \"House, Tree, Person Test\" to show insanity as opposed to the Commonwealth's evidence of a \"smoking gun.\" J.A. at 1591-92. He asked: \"[i]sn't that a convenient time to go into a [schizophrenic state]?\" J.A. at 1584. And, similar to the elephant analogy, he analogized Dr. Noelker's description of the long-term evolution of Gall's mental state to a simple hypothetical: \"If my wife were pregnant eight years ago and she was pregnant one month now, does that mean she was pregnant in March? That is what Dr. Noelker is telling you.\" J.A. at 1585. At the same time, the prosecutor minimized the testimony of Drs. Noelker and Toppen that Gall could appear both calm and sane to an \"untrained observer\" even if examinations and tests revealed that he was insane or severely mentally ill: \"He may look sane, but folks, he isn't. Now they are telling us folks, 'you can't look and judge for yourself.'\" J.A. at 1581. He then argued to the jury that because Gall appeared intelligent at trial, he must be sane, and must have been sane on April 4. The tone of these statements was similar to the rhetorical approach the prosecutor took in cross-examining Dr. Noelker and Dr. Toppen, in which he assaulted psychology as an inexact discipline where doctors, applying subjective standards \"within themselves\" can reach polar opposite conclusions in examining the same individual, J.A. at 984-88, 1221-23, and belittled the tests Dr. Noelker had used in diagnosing Gall. J.A. at 1024 (\"Now here is a little one here that I think the jury ought to see. This is one of those little psychological tests.\").\n\nFinally, the prosecution's most egregious misconduct was warning that Gall would go free if found not guilty for reason of insanity. During his closing, the prosecution stated: \"Now folks are we going to turn [Gall] loose on society by reason of insanity[?]\" J.A. at 1588-89. Seconds later, he repeated: Gall \"cannot escape the ends of justice by retreating within the safety of his own skull!\" J.A. at 1589. At another point, the Commonwealth stated that if the jury were to believe Dr. Toppen's testimony, \"then turn him loose.\" J.A. at 1581. These statements contravened several related rules of conduct. First, they once again detracted from a fair consideration of Gall's insanity defense by introducing the prospect that such a determination would lead inevitably to Gall's release. See Guidroz v. Lynaugh, 852 F.2d 832, 837-38 (5th Cir. 1988); United States v. Jackson, 542 F.2d 403, 411 (7th Cir. 1976); United States v. Birrell, 421 F.2d 665, 666-67 (9th Cir. 1970); Evalt v. United States, 359 F.2d 534, 546 (9th Cir. 1966); United States v. Lane, 725 F. Supp. 936, 942 (N.D. Ill. 1989). Second, the comments violated the cardinal rule that a prosecutor cannot make statements \"calculated to incite the passions and prejudices of the jurors.\" United States v. Solivan, 937 F.2d 1146, 1151 (6th Cir. 1991); see Stumbo v. Seabold, 704 F.2d 910, 912 (6th Cir. 1983) (decrying prosecutorial misconduct which \"prejudice[s] and inflame[s] the jury\"). Eliciting the image of turning Gall loose on society by finding him insane is perhaps the paradigm example of such impropriety--calling on jurors' emotions and fears rather than \"the evidence and law of the case.\" United States v. Gainey, 111 F.3d 834, 836 (11th Cir. 1997).\n\nIn sum, facing Gall's considerable evidence of insanity and EED, counsel for the Commonwealth chose not to rebut that evidence directly.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Instead, he expressed his personal belief as to the weakness and partiality of Gall's expert witnesses' testimony, and he mischaracterized crucial aspects of that testimony. He disparaged the very use of an insanity defense as the \"last line of defense\" and the \"M1 Rifle\"; he belittled the medical and psychological tools used to support such a defense; and he equated the doctors' testifying about Gall's condition to three blind men \"asked to identify an elephant\"--\"you can imagine the bizarre opinions which they got back.\" J.A. at 1589. He then pleaded with the jury not to let Gall loose through the insanity defense. In addition to having no doubt that these tactics were improper, we find that they easily satisfy the criteria of \"flagrancy\" laid out in Boyle. They clearly misled the jury and prejudiced Gall's defense of insanity. The comments were not accidental or isolated, permeating the Commonwealth's closing argument as well as other portions of the trial. And they involved the central issue of the case. Moreover, as explained infra, the total strength of the evidence rebutting Gall's insanity defense was weak at best, not to mention improperly presented. After a close review of the record, we find that the Commonwealth's misconduct was sufficiently egregious to render the entire trial fundamentally unfair.\n\nFinally, we respectfully disagree with the dissent's conclusion that this prosecutorial misconduct is acceptable when viewed \"against the backdrop of the nature of the insanity defense in this case.\" The dissent explains that, given the strong circumstantial evidence tying Gall to the crime, as well as Gall's clear history of mental illness, the insanity defense was the central issue of the case. It is therefore understandable, the dissent explains, that \"the prosecutor would bring out his heaviest artillery and direct it at the insanity defense.\" We no doubt agree that Gall's sanity was central to this trial, and we, no less than the dissent, would expect the prosecutor to bring out \"heavy artillery\" against that defense. We also agree that persuading the jury that there is a difference between a mental disease and legal insanity was a \"legitimate goal.\" But because ours is a system of law, the arsenal available to a prosecutor to achieve that legitimate goal is limited to arguments rooted in properly introduced evidence and testimony rather than words and tactics designed to inflame passions, air unsubstantiated prosecutorial beliefs, and downplay the legitimacy of a legally recognized defense. Here, unfortunately, having failed to present an expert who had actually examined Gall to assess his sanity, the prosecutor's barrage against Gall's insanity defense comprised largely \"foul blows\" having little to do with cognizable facts or evidence. If we are to take at all seriously the Kentucky legislature's decision to provide insanity as a defense to murder, we can not countenance the prosecutor's highly improper methods to overcome that defense in this case.\n\nG. Sixth Amendment Confrontation Rights\n\nGall argues that he was denied his Sixth Amendment right to confront the witnesses against him because he was not present at the depositions of Dr. Toppen and Dr. Chutkow, and because Dr. Chutkow's testimony was presented by videotape when there was no showing that he was constitutionally unavailable. The Commonwealth counters that Gall failed to raise that claim in the state courts, and that it is therefore procedurally defaulted.\n\nIn Kentucky, a party can bring one collateral attack pursuant to RCr 11.42; all claims not brought on the direct appeal or in that collateral challenge are generally defaulted. However, under RCr 60.02, a defendant can raise a challenge not brought in his RCr 11.42 motion if the errors involved were \"unknown and could not have been known to the party by the exercise of reasonable diligence and in time to have been otherwise presented to the court.\" Gross v. Commonwealth, 648 S.W.2d 853, 856 (Ky. 1983). Additionally, a new 11.42 motion can be filed \"upon a ground which was not known, or reasonably discoverable at the time the first motion was made.\" Gilliam v. Commonwealth, 652 S.W.2d 856, 858 (Ky. 1983). Gall argues here that he meets these exceptions because the error pertaining to the videotape deposition did not become clear until Dr. Chutkow testified in preparation for the district court's habeas hearing. We, however, agree with the Commonwealth that this is a dubious argument given Gall's active presence and awareness throughout the trial. Because the error was likely known and certainly was reasonably discoverable, and because Gall failed to raise his Confrontation Clause claim on either his direct appeal or in his RCr 11.42 motion, the claim was procedurally defaulted.\n\nA habeas petitioner can only overcome procedural default in two instances. First, he can \"demonstrate cause for the procedural default and actual prejudice resulting from the alleged constitutional error.\" Rust v. Zent, 17 F.3d 155, 160 (6th Cir. 1994). Alternatively, a defendant can show that failure to consider the claim will result in a fundamental miscarriage of justice. See Coleman, 501 U.S. at 750; Rust, 17 F.3d at 162 (stating that showing cause and prejudice is not required if defendant makes an \"extraordinary case whereby a constitutional violation resulted in the conviction of one who is actually innocent\"). We must examine Gall's claim to see if either of these exceptions is met.\n\n1.\n\nWe find that the use of Dr. Chutkow's videotaped deposition did indeed violate the Confrontation Clause. In particular, the facts at trial implicate this Court's holding that unless there is a showing of constitutional unavailability, the defendant enjoys a right to confront and examine crucial witnesses \"before the jury in open court.\" Stoner v. Sowders, 997 F.2d 209, 212 (6th Cir. 1993).\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Just as in Stoner, constitutional error occurred here because Dr. Chutkow testified by videotape rather than in open court without any showing by the Commonwealth that he was constitutionally unavailable. See id. at 212. The prosecution provided no reason for Dr. Chutkow's absence, and at oral argument for this appeal, stated only that it could not recall the reason Dr. Chutkow did not deliver live testimony.\n\nMoreover, the violation did not simply surpass harmless error; it also resulted in actual prejudice to Gall because it \"worked to his actual and substantial disadvantage, infecting his entire trial with error of constitutional dimensions.\" Rust, 17 F.3d at 161 (citation omitted). As in Stoner, \"[t]here is no doubt that the guilty verdict . . . was substantially influenced by [this videotape] testimony.\" Id. at 213-14. This case hinged on Dr. Chutkow's testimony. Dr. Noelker had informed the jury of his conclusion that Gall was legally insane, and, although vague, Dr. Chutkow's testimony provided the Commonwealth's central evidence rebutting that showing of insanity. J.A. at 318, 321 (stating that Gall could at times comply his behavior to the requirements of the law). At other points in the trial, the Commonwealth directly asserted that Dr. Chutkow had disagreed with Dr. Noelker's conclusion that Gall was legally insane. J.A. at 1032. Indeed, the Commonwealth ended its re-cross-examination of Dr. Noelker by referring to Dr. Chutkow's testimony with dramatic flair; when Dr. Noelker stated on redirect that any competent mental health professional who had reviewed his data would reach the same conclusions on Gall's sanity, the prosecution rose to ask a single question: \"Except Dr. Chutkow?\" J.A. at 1035. Similarly, in its pleadings before the district court, the Commonwealth pointed repeatedly to Dr. Chutkow's testimony to support its argument that it had presented evidence that Gall was sane. J.A. at 437-39 (quoting excerpts from Attorney General's memorandum of law that \"Chutkow's testimony went far beyond merely addressing competency,\" \"Chutkow testified as to why he did not believe Gall was insane,\" and \"Chutkow did not think Gall was insane before or after the crime\"). And in its brief filed with this Court, the Commonwealth dubs Dr. Chutkow its \"insanity expert rebuttal witness.\" Commonwealth's Br. at 24.\n\nBut while Dr. Chutkow's rebuttal was the thin reed standing between acquittal based on insanity and a death sentence, he had not in fact conducted an examination of Gall's sanity.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Furthermore, as explained supra, while the Commonwealth proffered him as their so-called \"insanity expert rebuttal witness\" and used his testimony accordingly, Dr. Chutkow believed merely that he was testifying at a \"competency hearing,\" and that his answers only addressed Gall's competency. This belief arose because he had only examined Gall for competency purposes, because he was taped in isolation rather than seated in front of a live jury, and because of the nature of the prosecutor's questions. J.A. at 413, 424, 427. Based on this testimony, it is beyond doubt that his presence at trial would have corrected that misperception, making it clear that the Commonwealth was placing him in a far more central role than he realized at the time--if for no other reason than the fact that juries do not determine issues of competency, but resolve the fundamental questions of guilt versus innocence and sanity versus insanity. Additionally, had Dr. Chutkow been in court and his role clarified, Gall's defense counsel would have obtained a greater opportunity to challenge the only evidence the Commonwealth had put forth regarding Gall's sanity. There is thus no question that the violation bore a dramatic impact on the outcome of the trial, rendering actual prejudice to Gall's defense.\n\nThe dissent fundamentally misunderstands the role Dr. Chutkow's testimony played in this case. With the benefit of Dr. Chutkow's later habeas deposition, the dissent appreciates the fact that Dr. Chutkow himself intended his testimony only to address competency, and thus believes his testimony served \"little value\" in the trial. But the jury did not view Dr. Chutkow's words in light of his later deposition, as we do now. The prosecutor's questions and Dr. Chutkow's responses were sufficiently ambiguous that the jury would very likely have concluded that Dr. Chutkow had stated that Gall was legally sane. J.A. at 318, 321. Later courts certainly believed that to be the case: the Gall I Court, relying on Dr. Chutkow's rebuttal testimony, concluded that \"there was a sharp conflict in the evidence as to whether Gall was insane at all,\" 607 S.W.2d at 112; and the district court below concluded that Dr. Chutkow had proffered \"some opinions\" on Gall's sanity. J.A. at 43. Moreover, the prosecution actively encouraged that interpretation by suggesting that Dr. Chutkow had disagreed with Dr. Noelker's conclusion that Gall was insane. For instance, on cross-examination, the prosecution peppered Dr. Noelker with questions about the possibility that two psychiatrists can disagree over a person's mental condition, J.A. at 984-86, and closed the cross-examination by emphasizing that Dr. Noelker's conclusion that Gall was insane was \"in dispute with your brother Dr. Chutkow.\" J.A. at 1032. See also J.A. at 1034 (responding to Dr. Noelker's final statement on redirect--that any competent mental health professional who had reviewed the data he had would reach the same conclusions on Gall's sanity--by asking, \"Except Dr. Chutkow?\").\n\nWhile the dissent may not appreciate the critical role Dr. Chutkow's testimony played in the trial, the prosecution has emphasized his testimony as to sanity from the time of the trial through this appeal. The letter the prosecutor wrote to Dr. Chutkow on September 20, 1978 emphasized Dr. Chutkow's critical role: \"it [is] absolutely essential that we use you as a witness during the course of this trial to rebut [Dr. Noelker's] anticipated testimony\" that Gall was insane. J.A. at 1546. At trial, the prosecution used his words to undermine Dr. Noelker. And before the district court and this Court, respectively, the Commonwealth argued that Dr. Chutkow had concluded that Gall was sane, and that he served as the Commonwealth's insanity expert rebuttal witness. The dissent's assertion that Dr. Chutkow's testimony was of \"little value\" thus flies in the face of even the Commonwealth's understanding of its own case.\n\n2.\n\nNonetheless, we cannot agree that Gall has shown cause for his failure to raise the claim previously. Once again, Gall argues that \"cause\" exists because his trial counsel failed to inform him that they were taking Dr. Chutkow's deposition, and that Gall and his counsel only became aware of the error when Dr. Chutkow was deposed for the habeas proceeding below. He also states that cause exists due to ineffective assistance of counsel. Both arguments are unavailing. First, Gall's original ignorance that Dr. Chutkow was deposed in lieu of direct testimony provides no support for his assertion that he later lacked awareness of that fact, both at trial (when the tape was played to the jury and in front of him), and in preparation for his state collateral appeal. Second, his claim of counsel error as \"cause\" is insufficient because he has not shown that his counsel was constitutionally ineffective under Strickland v. Washington, 466 U.S. 668 (1984), see infra, which Coleman requires. See 501 U.S. at 752. Moreover, because there is no constitutional right to counsel for a state collateral appeal, a defendant can not argue that counsel's error at that stage was a cause for default.\n\n3.\n\nThere remains the alternative route that default can be excused because our failure to recognize the claim would result in a \"fundamental miscarriage of justice.\" See Coleman, 501 U.S. at 750. This is a high burden for a habeas petitioner to meet, occurring only in the \"extraordinary case.\" Schlup, 513 U.S. at 321. Specifically, a habeas petitioner must show that \"it is more likely than not that no reasonable juror would have convicted [defendant]\" absent the claimed error or in light of new evidence. Id. at 327; see also White v. Schotten, 201 F.3d 743, 753 (6th Cir. 2000) (stating that a fundamental miscarriage of justice occurs when constitutional error \"probably resulted in the conviction of one who was actually innocent\"). The Schlup Court explained that because the task of the habeas court is to focus on the question \"actual innocence,\" it can consider evidence that was either excluded or unavailable at trial. See 513 U.S. at 327-28.\n\nFor the reasons explained supra, we indeed believe that the Confrontation Clause violation likely stood in the way of an acquittal for reason of insanity. Given Dr. Chutkow's statements at his habeas deposition, it is clear that the Commonwealth had no evidence to rebut Gall's showing of insanity at the time of the killing. Dr. Chutkow's short examination had merely assessed whether Gall was competent to stand trial at the time of trial, while the two doctors who examined Gall for the purpose of determining his sanity on the day of the crime both concluded that he was legally insane. It is also clear that the Confrontation Clause violation sparked Dr. Chutkow's misperceptions about his role in the trial, allowing his testimony that Gall was competent to stand trial to be misleadingly used to support the Commonwealth's argument that Gall was legally sane at the time of the crime. In other words, had it not been for the constitutional violation, we believe that it is likely that no reasonable juror would have found Gall guilty beyond a reasonable doubt. This case thus poses the question of whether, under Coleman, Schlup and this Circuit's caselaw, a fundamental miscarriage of justice results when a trial error more likely than not stood in the way of a verdict of acquittal due to insanity. Because of the other errors described supra, we need not address this new and difficult question.\n\nH. Ineffective Assistance of Counsel\n\nFinally, Gall argues that he was deprived of his Constitutional right to effective assistance of counsel. There were clearly shortcomings in the representation Gall received at trial. But primarily because Gall chose to represent himself, we do not find that the constitutional standard of Strickland was violated. See Faretta v. California, 422 U.S. 806, 835 (1975); United States v. Smith, 907 F.2d 42, 45 (6th Cir. 1990) (stating that after waiving his right to counsel, appellant \"cannot complain about the quality of his own defense by arguing that it amounted to ineffective assistance of counsel\").\n\nIV.\n\nGall also challenges aspects of the penalty phase of the trial.\n\nA. Penalty Phase Instructions\n\nGall argues that the penalty phase instructions given at his trial violated his Eighth and Fourteenth Amendment rights as defined by Lockett v. Ohio, 438 U.S. 586 (1978).\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e He challenges three aspects of the sentencing instruction. First, he challenges the instruction: \"The mitigating circumstances you may consider are as follows . . .\" J.A. at 1622. Second, he challenges the instruction: \"Your findings and verdict must be unanimous and must be signed by the foreman,\" J.A. at 1624, alleging this communicated to the jurors that any mitigating factors had to be found unanimously. Third, he challenges the instruction that jurors needed to find that a mitigating factor existed by a preponderance of the evidence.\n\nGall argues that these instructions violated both Kentucky law and the Constitution because the jury was prevented from considering and giving effect to mitigating factors in violation of Lockett. The Commonwealth counters by first pointing out that Gall did not object to these instructions at trial, or appeal them in his post-conviction appeal in the Kentucky courts, so that this claim has been lost through default. It also musters a Teague defense, arguing that Gall is improperly seeking the benefit of a \"new\" constitutional rule. Assuming arguendo that this claim is not invalid, the Commonwealth also contests it on its merits.\n\nOn habeas review, errors on instructions are not reviewable unless they deprive a defendant of constitutional due process. See Long v. Smith, 663 F.2d 18, 23 (6th Cir. 1981). They must not simply be erroneous--they must \"so infect[] the entire trial that the resulting conviction violates due process.\" Henderson v. Kibbe, 431 U.S. 145, 154 (1977). Meanwhile, if a prisoner has defaulted his federal claims in state court pursuant to an independent and adequate state procedural rule, federal habeas review of the claims is barred unless the prisoner can satisfy the \"cause and prejudice\" test or show \"that failure to consider the claims will result in a fundamental miscarriage of justice.\" Coleman, 501 U.S. at 750; see Coe v. Bell, 161 F.3d 320, 329 (6th Cir. 1998).\n\n1.\n\nWe disagree with the Commonwealth's contention that Gall defaulted this claim. The Commonwealth asserts that because Gall's collateral attack motion in the Kentucky courts did not attack the penalty phase jury instructions, that attack was waived under Kentucky Criminal Rule (KCR) 11.42, which requires the motion to state \"all grounds for holding the sentence invalid.\" Thus, it argues, the Wainwright \"cause and prejudice\" standard is required here. We reject this argument.\n\nAlthough Gall did not object to the instructions at trial, the Commonwealth concedes that he did challenge them on appeal. See Gov't Br. at 28. Thus, it was up to the Kentucky Supreme Court to apply either its procedural rule barring review or to address the merits of the case; if the court clearly and expressly applied its procedural bar to that claim, then federal habeas review is precluded. See Boyle, 201 F.3d at 716; Couch v. Jabe, 951 F.2d 94, 96 (6th Cir. 1991). But the court in Gall I did not rule that Gall procedurally defaulted this claim. Rather, it endorsed the instructions on the merits.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e Because it did not even consider whether the claimed error was waived through the failure to object at trial, it certainly did not meet the \"'clear and express' statement of procedural bar\" that this Court requires. Coe, 161 F.3d at 330 (quoting Harris v. Reed, 489 U.S. 255, 258 (1989)). The claim is therefore not defaulted.\n\nAfter his direct appeal failed, Gall brought his RCr 11.42 appeal. While the Commonwealth decries Gall's failure to challenge the penalty phase instructions in that appeal, Gall had no choice in the matter. \"In an RCr 11.42 proceeding, the movant cannot raise issues which were raised and decided on direct appeal.\" Wilson v. Commonwealth, 975 S.W.2d 901, 903 (Ky. 1998). In sum, Gall did not waive his right to bring this claim, and it should be considered under the standards laid out in Kibbe and Cupp.\n\n2.\n\nThe Commonwealth asserts that the rule laid out in Mills v. Maryland, 486 U.S. 367, 1866 (1988) and echoed in McKoy v. North Carolina, 494 U.S. 433 (1990), on which Gall now relies, constitutes a \"new rule\" under Teague v. Lane, 489 U.S. 288 (1989), and can therefore not be applied retroactively on habeas review. When raised, the question as to whether Teague applies is a threshold issue in a federal habeas case. See Daniels v. Burke, 83 F.3d 760, 764 (6th Cir. 1996).\n\nAlthough we will discuss the Mills decision in more detail infra, its fundamental holding was that the rule from Lockett had been violated because there was\n\na substantial probability that reasonable jurors, upon receiving the judge's instructions in this case, and in attempting to complete the verdict form as instructed, well may have thought they were precluded from considering any mitigating evidence unless all 12 jurors agreed on the existence of a particular such circumstance. Id. at 384.\n\nIn McKoy, the Court repeated the Mills holding, stating that the Lockett principle had again been violated because it was clear that a jury had been required to make its decision based only on circumstances it had unanimously found, allowing \"one holdout juror to prevent the others from giving effect to evidence that they believe calls for a 'sentence less than death.'\" Id. at 439 (quoting Eddings, 455 U.S. at 110). We disagree with the Commonwealth's argument that Teague bars the retroactive application of these holdings.\n\nFirst, Mills and McKoy did not announce a \"new rule\" as that term is defined by Teague. Under Teague, a new rule is one that \"breaks new ground or imposes a new obligation on the states or the Federal Government. To put it differently, a case announces a new rule if the result was not dictated by precedent existing at the time the defendant's conviction became final.\" 489 U.S. at 301. To make this determination, a federal court must first determine the date upon which the defendant's conviction became final. See Caspari v. Bohlen, 510 U.S. 383, 390 (1994). It must then survey \"the legal landscape as it then existed\" and ask if a state court, considering the defendant's claim at the time his conviction became final, would have \"felt compelled by existing precedent to conclude that the rule [he] seeks was required by the Constitution.\" Lambrix v. Singletary, 520 U.S. 518, 527 (1997) (citation omitted). If the state court would not have found the rule \"dictated by precedent,\" id. at 528, then the claim is improperly attempting to apply a \"new rule\" under Teague.\n\nApplying this two-part inquiry, we find that the decision in Mills did not comprise a \"new rule\" under Teague. The final decision in Gall's case came in March 1981 when his petition for certiorari was denied. See Gall v. Kentucky, 450 U.S. 989 (1981). At that time, the Lockett principle was firmly in place, making clear that a jury can \"not be precluded from considering, as a mitigating factor, any aspect of a defendant's character or record and any of the circumstances of the offense that the defendant proffers as a basis for a sentence less than death.\" Lockett, 438 U.S. at 604. We find that the holding in Mills on which Gall now relies was in fact dictated by the Lockett rule, and that a state court facing Gall's claim even in 1981 would have felt compelled to apply Lockett as Mills ultimately did in 1988. Indeed, as Mills itself makes clear, it did nothing more than apply Lockett to a new factual situation:\n\nUnder our decisions, it is not relevant whether the barrier to the sentencer's consideration of all mitigating evidence is interposed by statute, Lockett v. Ohio, supra, [or] by the sentencing court, Eddings v. Oklahoma, supra. . . . The same must be true with respect to a single juror's holdout vote against finding the presence of a mitigating circumstance. 486 U.S. at 375 (emphasis added).\n\nIn addition to reemphasizing its origins in Lockett, see id. at 376-77 (stating that \"the Court has demanded even greater certainty that the jury's conclusion rested on proper grounds\") (citing Lockett, 438 U.S. at 605), the Mills Court relied on Andres v. United States, 333 U.S. 740 (1948), a half-century old death penalty reversal on very similar grounds. In Andres, the Court granted a new trial after finding fault in instructions that \"probab[ly]\" induced a \"reasonable\" juror to conclude that unanimity was needed to \"qualify\" a verdict of guilty in order to preclude a death sentence. Id. at 752. Given Lockett, Andres, and the Court's clear language in Mills, Mills did not \"break[] new ground or impose[] a new obligation on the states or the Federal Government.\" Teague, 489 U.S. at 301. See DeShields v. Snyder, 829 F.Supp. 676, 688 (D. Del. 1993) (\"Mills is nothing more than a mere extension of then existing precedent to a new factual scenario.\"). We therefore disagree with the Fifth and Eighth Circuits, which have found that Mills announced a \"new rule\" under Teague. See Miller v. Lockhart, 65 F.3d 676, 686 (8th Cir. 1995); Cordova v. Collins, 953 F.2d 167, 173 (5th Cir. 1992).\n\nAdditionally, even if arguendo Mills announced a \"new rule\" as defined by Teague, we find that its holding meets the second of Teague's two \"narrow exceptions\" to the non-retroactivity of new rules. Lambrix, 520 U.S. at 528. Even under Teague, a new rule can be applied retroactively when it establishes one of the \"watershed rules of criminal procedure implicating the fundamental fairness and accuracy of the criminal proceeding.\" O'Dell, 521 U.S. at 157. The Supreme Court often points to the right to counsel, announced in Gideon v. Wainwright, 372 U.S. 335 (1963), as the paradigm rule possessing the \"primacy and centrality\" to fall within this exception. See, e.g., Saffle v. Parks, 494 U.S. 484, 495 (1990). We need look no further than the language of Mills and McKoy to see that the principle they were espousing constitutes a watershed procedure \"implicit in the concept of ordered liberty.\" O'Dell, 521 U.S. at 157. Mills stated that it would be the \"height of arbitrariness\" to require unanimous agreement on mitigating circumstances. 486 U.S. at 374.\n\nThe decision to exercise the power of the States to execute a defendant is unlike any other decision citizens and public officials are called upon to make. Evolving standards of societal decency have imposed a correspondingly high requirement of reliability on the determination that death is the appropriate penalty in a particular case. . . . Under our cases, the sentencer must be permitted to consider all mitigating evidence. The possibility that a single juror could block such consideration, and consequently require the jury to impose the death penalty, is one we dare not risk. Mills, 486 U.S. at 383-84.\n\nIn his separate concurrence in McKoy, Justice Kennedy reiterated that the possibility that one juror can render a death sentence would \"represent[] imposition of capital punishment through a system that can be described as arbitrary or capricious.\" 494 U.S. at 453-54 (Kennedy, J., concurring). For these reasons, and for those further elaborated by the Fourth Circuit in Williams v. Dixon, 961 F.2d 448, 455-56 (4th Cir. 1992), we conclude that even assuming arguendo that Mills announced a \"new rule,\" that new rule is so central to our notions of ordered liberty that it falls within the second Teague exception. In sum, Teague does not bar us from granting Gall habeas relief based on Mills.\n\n3.\n\nWe therefore address the merits of Gall's Lockett-Mills argument. Lockett and its progeny govern the constitutional limits on how states can guide sentencers' discretion in considering the mitigating circumstances that may convert a sentence of death into a term of imprisonment. As stated supra, the essential rule from Lockett is that the sentencer shall not be precluded from considering, as a mitigating factor, \"any aspect of a defendant's character or record and any of the circumstances of the offense that the defendant proffers as a basis for a sentence less than death.\" Lockett, 438 U.S. at 604. Thus, a basic test of the constitutionality of death penalty sentences is whether the statutes and jury instructions have permitted the jury to consider all relevant mitigating evidence. See Blystone v. Pennsylvania, 494 U.S. 299, 307 (1990) (upholding death sentence because jury \"was specifically instructed to consider, as mitigating evidence, any matter concerning the character or record of the defendant, or the circumstances of his offense\"); see also Texas v. Johnson, 509 U.S. 350, 368 (1993)(upholding death penalty statute because mitigating evidence was within the \"effective reach\" of the jury); Penry v. Lynaugh, 492 U.S. 302, 322 (1989)(reversing death sentence because jury instructions did not permit jury to consider relevant mitigating evidence); Lockett, 438 U.S. at 608 (striking down Ohio death penalty law for precluding consideration of relevant mitigating factors). Addressing allegedly unconstitutional jury instructions, the Court in Boyde v. California, 494 U.S. 370, 380 (1990) stated that a jury instruction violates Lockett when\n\nthere is a reasonable likelihood that the jury has applied the challenged instruction in a way that prevents the consideration of constitutionally relevant evidence. Although a defendant need not establish that the jury was more likely than not to have been impermissibly inhibited by the instruction, a capital sentencing proceeding is not inconsistent with the Eighth Amendment if there is only a possibility of such an inhibition. Id. (emphasis added). In making this determination, courts should not view instructions in isolation, but \"with a 'commonsense understanding of the instructions in the light of all that has taken place at the trial.'\" Johnson, 509 U.S. at 367 (quoting Boyde, 494 U.S. at 381).\n\na.\n\nWe reject Gall's arguments regarding the first two penalty instructions he challenged. First, there is no constitutional prohibition on states' requiring that mitigating circumstances be proved by preponderance of the evidence. See, e.g., Delo v. Lashley, 507 U.S. 272, 275-76 (1993). Second, the challenged instruction that used the word \"may\" was in fact only one aspect of a longer set of instructions. The court was describing the circumstances the jury could consider as mitigation; using the word \"may\" comported with Lockett by informing the jury that it was not limited to the four specific examples the court enumerated, but also could consider other circumstances. Indeed, it is when courts use words such as \"must\" and \"shall\" in describing possible mitigating factors that they run afoul of Lockett, for they risk limiting the circumstances juries may consider in weighing the death sentence. See Blystone, 494 U.S. at 308 (concluding that because a judge's instruction allowed the jury to consider multiple mitigating factors, and was not unduly \"mandatory,\" it did not violate Lockett). Because Gall's only other argument regarding these two instructions is that they did not comport with state law, he does not raise an issue of constitutional law. Habeas review is therefore inappropriate on the first two instructions Gall challenges.\n\nb.\n\nGall's challenge of the unanimity instruction does raise a due process challenge cognizable on habeas review. We also find the argument persuasive on its merits.\n\ni) The instructions and jury form\n\nA close perusal of the relevant instructions is necessary to assess an alleged Lockett violation. In Instruction I, the judge informed the jury: \"[i]t is now your duty to determine what punishment must be imposed upon [Gall]. You will deliberate and determine whether any mitigating or aggravating circumstances, as are hereinafter defined, exist.\" J.A. at 1622. In Instruction II, the trial court instructed the jury that it \"may consider\" the murder during the course of a rape as an aggravating circumstance, and that it \"may consider\" one of a number of enumerated factors (age, emotional disturbance, legal sanity, etc.) or \"other circumstances\" as mitigating circumstances. J.A. at 1622-23. In Instruction IV, the judge instructed that Gall was presumed to be innocent of the aggravating circumstances \"unless you believe from the evidence, and beyond a reasonable doubt, that he is guilty of those crimes.\" J.A. at 1623. In Instruction V, the judge instructed:\n\nThe death penalty shall not be recommended unless you find, beyond a reasonable doubt, that one aggravating circumstance exists.\n\nYou shall not recommend the death penalty unless you believe the weight of the aggravating circumstances, if any, exceeds the weight of the mitigating circumstances, if any.\n\nEven though you may find an aggravating circumstance, you do not have to recommend the death penalty.\n\nEven though you may believe any aggravating circumstance outweighs any mitigating circumstance you do not have to recommend the death penalty. J.A. at 1623-24. In Instruction VI, the court stated that \"[y]our findings and verdict must be unanimous and must be signed by the foreman.\" J.A. at 1624 (emphasis added).\n\nMeanwhile, the judge also provided a special verdict form that asked five questions of the jury, based on the instructions given. It asked the following: first, whether Gall had committed the murder while committing rape; second, whether the offense was committed under the influence of extreme or emotional disturbance; third, whether the offense was committed at a time that Gall was legally insane; fourth, whether his age was a mitigating factor; and fifth, whether there were any other mitigating factors. The first four questions instructed the jury to \"Answer, YES or NO.\" J.A. at 1625-26. The fifth question asked them to list any mitigating factors they found. All five questions required the foreman of the jury to sign beneath the answer.\n\nii) Applying Mills and McKoy\n\nBecause they were nearly identical to instructions that the Supreme Court has found to violate Lockett, and more problematic than instructions this Court has found to violate Lockett, we hold that the instructions and verdict form in this case were unconstitutionally defective. A close look at the relevant cases illustrates why this is so.\n\nIn Mills, 486 U.S. at 367, the Supreme Court reversed a capital sentence for instructions whose flaws were similar to those in this case. The trial court had distributed a verdict form that included individualized questions regarding aggravating and mitigating circumstances, indicating that the jurors were to answer \"yes\" or \"no\" to each question. On the portion of the form regarding aggravating circumstances (Section I), the court instructed that if the jury \"unanimously conclude[d] that [an aggravating circumstance] had been so proved, you should answer the question yes. If you are not so satisfied, then of course you must answer no.\" Id. at 378 (quoting trial instructions). The court then gave the same instructions for mitigating circumstances (Section II of the form). See id. Section III of the jury form then instructed the jury to weigh only those mitigating circumstances marked \"yes\" in Section II. See id.\n\nThe Mills Court concluded that a reasonable juror would likely not have interpreted the instructions and jury form to require unanimity before answering \"no\" to the presence of a mitigating circumstance--but would instead have concluded that the absence of unanimity on \"yes\" meant the appropriate answer was \"no.\"\n\nThe jury was instructed to mark each answer \"yes\" or \"no.\" Although it was clear that the jury could not mark \"yes\" in any box without unanimity, nothing the judge said dispelled the probable inference that \"no\" is the opposite of \"yes,\" and therefore the appropriate answer to reflect an inability to answer a question in the affirmative. Nothing in the verdict form or the judge's instructions even arguably is construable as suggesting the jury could leave an answer blank and proceed to the next stage in its deliberations. Id. at 378-79.\n\nThe Court therefore concluded that the Lockett rule was violated because there was:\n\na substantial probability that reasonable jurors, upon receiving the judge's instructions in this case, and in attempting to complete the verdict form as instructed, well may have thought they were precluded from considering any mitigating evidence unless all 12 jurors agreed on the existence of a particular such circumstance. Under our cases, the sentencer must be permitted to consider all mitigating evidence. The possibility that a single juror could block such consideration, and consequently require the jury to impose the death penalty, is one we dare not risk. Id. at 384.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e See also Kordenbrock v. Scroggy, 919 F.2d 1091, 1110-11 (6th Cir. 1990) (en banc) (concluding that there was a \"substantial possibility\" that the jury construed its instructions to \"mean that mitigating as well as aggravating circumstances could be found only if the jury was unanimous\").\n\nThe Court in McKoy, 494 U.S. at 433 found instructions from a North Carolina trial to be similarly flawed. The instructions asked questions on four \"Issues\": Issue One asked if the jury unanimously found aggravating circumstances; Issue Two asked if the jury unanimously found mitigating circumstances (enumerating each possible circumstance in a separate question); Issue Three asked if the jury unanimously found the mitigating circumstances to outweigh the aggravating circumstances; Issue Four asked if the jury unanimously found the aggravating circumstances sufficient to result in death for the defendant. See id. at 436-37. Pursuant to Mills, the Court concluded that this scheme violated Lockett. \"[T]he jury is required to make its decision based only on those circumstances it unanimously finds,\" allowing \"one holdout juror to prevent the others from giving effect to evidence that they believe calls for a 'sentence less than death.'\" Id. at 439 (quoting Eddings, 455 U.S. at 110). The Court also pointed out that, just as in Mills, \"even if all 12 jurors agree that there are some mitigating circumstances, North Carolina's scheme prevents them from giving effect to evidence supporting any of those circumstances . . . unless they unanimously find the existence of the same circumstance.\" Id.\n\nThe instructions and verdict form from Gall's trial suffer from the same basic defects as those in Mills and McKoy, despite a few wrinkles of difference. Just as in Mills, the questions asked were in a clear \"yes\" or \"no\" format; indeed, the form ordered the jurors to \"Answer, Yes or No,\" listing no other alternatives. J.A. at 1625-26. Just as in Mills, then, following the judge's instruction that \"[y]our findings and verdict must be unanimous and must be signed by the foreman,\" a reasonable juror would likely have assumed that to indicate \"yes\" to one of the enumerated mitigating circumstances, unanimity was required. Otherwise, \"no\" was appropriate. And just as in Mills, \"nothing the judge said dispelled\" that inference. Mills, 486 U.S. at 378; see also Kordenbrock, 919 F.2d at 1109 (\"[C]ommon sense [] suggests that juries do not leave blanks and do not report themselves as deadlocked over mitigating circumstances after reasonable deliberation, . . . unless they are expressly instructed to do so.\") (quoting Kubat v. Thieret, 867 F.2d 351, 373 (7th Cir. 1989)) (internal quotation marks omitted). Given the judge's instruction that all findings must be unanimous, the reasonable juror would also have likely assumed that the fifth question on the form, asking \"[w]hat other mitigating factors, if any, do you find,\" J.A. at 1626 (emphasis added), also required unanimity. As Mills stated regarding a similar part of its verdict form, \"[n]o instruction was given indicating what the jury should do if some but not all of the jurors\" believed that such a mitigating factor existed. See id. at 379. Just as in both Mills and in McKoy, the Gall instructions made quite probable the disturbing hypothetical of individual jurors finding mitigating factors but being unable to give effect to those factors because of a lack of unanimity. Such a defect constitutes the \"height of arbitrariness,\" and is the \"precise defect that compelled the [Court] to strike down the Maryland scheme in Mills.\" McKoy, 494 U.S. at 440-41.\n\nWe find this case more clear-cut than Kordenbrock, where this Court, en banc, reversed a death sentence due in part to a Mills violation The Court held that \"[b]ecause the jurors . . . were told that aggravating factors had to be unanimous, but were not told exactly what role mitigating factors play, it would have been reasonable for them to assume that mitigating factors had to be found unanimously as well.\" 919 F.2d at 1110. In other words, the Court concluded that the trial court's requiring unanimity for aggravating circumstances, combined with its silence on whether or not unanimity was required for the mitigating circumstances, likely induced reasonable jurors to assume that mitigating circumstances required unanimity. In this case, the jurors were flatly told: \"Your findings and verdict must be unanimous and must be signed by the foreman.\" J.A. at 1624. Unlike Kordenbrock, then, we need not even speculate as to how jurors interpreted the court's silence, because the court referred to all findings when it required unanimity.\n\nThe Commonwealth's attempts to defend the instructions are unavailing. The Commonwealth's primary argument is to point to Instruction V, which informed the jury that it did not \"have to recommend the death penalty\" even if it found an aggravating circumstance, or even if it concluded that any one aggravating circumstance outweighed any one mitigating circumstance. Gov't Br. at 31. We believe that these instructions did not negate the clear communication to the jurors that any mitigating circumstances to which they gave effect had to be found unanimously, and that their determination of a death sentence required them to weigh the aggregate aggravating circumstances against the aggregate mitigating circumstances that they so found.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e This places Instruction V on the same ground as McKoy's \"Issue Four,\" which the Supreme Court found insufficient to cure the unconstitutionality of the unanimity instruction. Issue Four instructed the McKoy jury that it could only impose the death penalty if it unanimously found the aggravating circumstances to be \"sufficiently substantial\" relative to the mitigating circumstances. Despite the government's argument in McKoy that that instruction distinguished that case from Mills, the Court was not convinced. The instruction did not cure the infirmity of the unanimity requirement because it still permitted the jury only to consider mitigating factors that it found unanimously. See 494 U.S. at 439.\n\nOur decision in Mills was not limited to cases in which the jury is required to impose the death penalty if it finds that aggravating circumstances outweigh mitigating circumstances or that no mitigating circumstances exist at all. Rather, we held that it would be the 'height of arbitrariness to allow or require the imposition of the death penalty' where 1 juror was able to prevent the other 11 from giving effect to mitigating evidence. Id. at 439-40 (emphasis added).\n\nThat is the same defect introduced by the instructions and jury form in this case. For example, if a single juror believed that Gall had not shown any of three mitigating circumstances listed on the jury form, even if the remainder of the jury firmly believed that all three circumstances did exist, a reasonably likely interpretation of the unanimity instruction would have required the jury to answer \"no\" to the presence of each mitigating circumstance. Under one interpretation of Instruction V, this result would have required the jury to render a sentence of death;\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e under the alternative, it would have allowed a death sentence. Under either scenario, McKoy is violated.\n\nSimilarly unavailing is the Commonwealth's argument that the trial judge's role in the sentencing process \"cured\" these instructions. See Ky. Rev. Stat. Ann. § 532.025(1)(b) (establishing that the jury shall retire to \"determine whether any mitigating or aggravating circumstances . . . exist and to recommend a sentence for the defendant. Upon the findings of the jury, the judge shall fix a sentence within the limits prescribed by law\"). The Supreme Court rejected a similar \"curing\" argument in Beck v. Alabama, 447 U.S. 625, 645-46 (1980), instructing courts not to presume that a judge's discretion to depart from the death sentence will correct mistakes made in the jury's factfinding function.\n\nThe Commonwealth's attempt to downplay Beck by pointing to Baldwin v. Alabama, 472 U.S. 391 (1985) is meritless. Contrary to the Commonwealth's contention, that decision did not hold that \"[a] state law authorizing a trial judge to consider mitigating circumstances to reduce a death sentence imposed by a jury was constitutionally sufficient . . . to cure error in the jury instructions.\" Commonwealth Br. at 34. Baldwin instead involved a facial challenge to Alabama's two-phase sentencing scheme. Under the statute, an Alabama jury issued a preliminary \"sentence\" of death based simply on its finding that a defendant was guilty of one of fourteen specified aggravated offenses. The trial court would thereafter determine whether to impose a death sentence by conducting a hearing where it considered and weighed all aggravating and mitigating circumstances, a task the jury had not undertaken. See id. at 375-76, 380-84. Due to the independence of the judge's determination, the Court upheld the statute, and also distinguished Beck. Unlike Beck, the Court explained, a judge under the new Alabama statute \"knows that determination of the appropriate sentence is not within the jury's province, and that the jury does not consider evidence in mitigation at arriving at its 'sentence.' The jury's 'sentence' means only that the jury found the defendant guilty of a capital crime.\" Id. at 388. This is starkly different than Kentucky law, where the jury makes the initial factual determination on the presence or absence of mitigating factors and aggravating factors, and where its \"recommendation\" carries \"great weight\" on the trial judge's ultimate decision. Gall I, 607 S.W.2d at 104 (\"[The jury's] recommendation of the death sentence, though not binding on the trial judge, obviously carries great weight.\"). Given this clear distinction, the conclusion reached in Beck, and not Baldwin, controls this case.\n\nIn short, given Mills, McKoy, and the combination of the instructions and verdict form presented to the Gall jury, there was at least \"a reasonable likelihood that the jury [] applied the challenged instruction[s] in a way that prevent[ed] the consideration of constitutionally relevant evidence\" in rendering a death sentence against Gall. Boyde, 494 U.S. at 380. Because we must ensure that juries carry out their roles properly in death penalty cases, because it is reasonably likely that the jury was confused on the necessity of unanimity for mitigation, and because \"the verdict of death may not have been imposed had they understood that one juror could block the death sentence if he or she believed there were sufficient mitigating circumstances,\" Kibbe, 431 U.S. at 154, we conclude that this error so infected the sentencing phase that the resulting death sentence violated due process.\n\nB. Reference To Jury's Sentencing Decision As a \"Recommendation\"\n\nGall next argues that both the prosecutor and the trial judge violated his constitutional rights by repeatedly referring to the jury's role in sentencing as a \"recommendation,\" which lessened the jurors' sentencing responsibility and thus violated Caldwell v. Mississippi, 472 U.S. 320 (1985).\n\nThis issue is clearly controlled by Kordenbrock. In that case, petitioner made the same argument Gall makes today: that both the prosecutor and the judge improperly referred to the jury's task as a \"recommendation\" in violation of Caldwell. See 919 F.2d at 1101. This Court plainly rejected the argument. First, it explained that the description of the jury's role as a recommendation accurately and technically reflected Kentucky law of the time. See id. Second, the Court concluded that the prosecutor or judge had not gone so far as to \"improperly describe[] the jury's role under state law in order to water down their responsibility.\" Id. Finally, the Court rejected Kordenbrock's reliance on more recent state cases (the same cases cited by Gall here) that altered the instructions to be read to juries; it concluded that those cases were not applicable because the Kentucky Supreme Court had \"declined to apply the new rule retroactively which means the prosecutor and the judge did not misadvise the jury concerning the division of sentencing authority.\" Id.\n\nGall has not successfully distinguished the facts of Kordenbrock from this case. He argues that in Kordenbrock, the jurors were informed that the judge would give great weight to their recommendation, while they were not so advised in the Gall trial. In actuality, the references made in the two cases are almost identical. Both prosecutors downplayed the jurors' role during voir dire. Compare Kordenbrock, 919 F.2d at 1101 (informing the jury that it would make \"a recommendation, that is all\" and that that recommendation \"would not be binding on the court\") with J.A. at 1097-98 (stating that the jury's recommendation of punishment \"is not necessarily binding upon the Court\"). In closing, Gall's prosecutors were more circumspect, referring several times to the jury's impending \"recommendation\" but not describing it as a diminished role. See J.A. at 1630, 1632, 1636, 1637. Similarly, the trial court's instructions to Gall's jury used the word \"recommend\" largely without elaboration. (The judge instructed the jury that it was their \"duty to determine what punishment must be imposed upon\" Gall.) J.A. at 1622-24. With no distinguishing facts, Kordenbrock controls this case. The prosecutor's statements therefore did not violate Caldwell.\n\nC. Exclusion of Venireman\n\nGall argues that in dismissing a venireman (\"Correll\") who was uncertain about his views on the death penalty, the trial court violated Gall's constitutional rights. In particular, Gall argues that because Correll did not meet the standards for exclusion spelled out in Witherspoon v. Illinois, 391 U.S. 510 (1968), the trial court's striking him for cause was a constitutional violation.\n\nA trial court's decision to strike a juror based on his or her views of capital punishment is a factual determination. Under 28 U.S.C. § 2254, such a determination is entitled to a presumption of correctness, to be overturned only if it is not fairly supported by the record viewed as a whole. See Wainwright v. Witt, 469 U.S. 412, 426-31 (1985); McQueen v. Scroggy, 99 F.3d 1302, 1326-27 (6th Cir. 1996).\n\nWe find that the trial court committed reversible error in excluding Correll. Its decision is not supported by the record, and violated clear precedent. In a series of cases beginning with Witherspoon, the Supreme Court has consistently held that the Sixth Amendment right to an impartial jury is infringed when, through the procedures used to obtain a jury for a particular trial, the trial judge allows the selection of a jury \"uncommonly willing to condemn a man to die.\" 391 U.S. at 521. In Witt, the Court clarified that a juror is properly excluded for cause when \"the juror's views would 'prevent or substantially impair the performance of his duties as a juror in accordance with his instructions and his oath.'\" 469 U.S. at 424 (quoting Adams v. Texas, 448 U.S. 38, 44 (1980)). The Witt Court noted that this standard does not require that a juror's bias be proved with \"unmistakable clarity,\" id., and noted that generally, deference ought be paid to the trial judge. See id. at 426.\n\nNotwithstanding the deference owed to the trial judge,\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e we find that the factual record does not fairly support Correll's exclusion under the standards of Adams and Witt. Correll's discomfort with the death penalty did not appear to \"'prevent or substantially impair the performance of his duties as a juror in accordance with his instructions and his oath.'\" Id. at 424 (quoting Adams, 448 U.S. at 44). Correll rejected the proposition that his mind was \"closed\" to imposing the death penalty--\"No, I would say it isn't closed, but it - I am just undecided.\" J.A. at 507; \"it is just one of those things you would have to cross when you got to it.\" J.A. at 506-07. Moreover, on several occasions, he informed counsel and the judge that he would possibly or \"very possibl[y]\" feel the death penalty was appropriate in certain factual scenarios. J.A. at 507. He also told the judge that he believed he could and would follow the law as instructed. J.A. at 508. These statements showed that he was not \"so irrevocably opposed to capital punishment as to frustrate the State's legitimate efforts to administer its\" death penalty scheme, the standard that Witt requires for exclusion. Adams, 448 U.S. at 51. Correll's statements that his decision would likely depend on the facts he was faced with also suggested that his selection would comport with a trial court's \"quest\" to find jurors who \"conscientiously apply the law and find the facts.\" Witt, 469 U.S. at 423. Similarly, Correll's uncertainty as to how the option of a death sentence would affect his decision should not have led to his exclusion. In Adams, the Court reversed a conviction on a scheme that precluded prospective jurors \"whose only fault was to take their responsibilities with special seriousness or to acknowledge honestly that they might or might not be affected.\" 448 U.S. at 50-51. Finally, unlike the juror who was properly struck in Witt because she repeatedly \"affirmed that her beliefs would interfere with her sitting as a juror,\" 469 U.S. at 434, Correll not once stated that his beliefs would deter him from serving as an impartial juror. Correll's exclusion was thus error.\n\nA violation under Witt is reversible error not subject to harmless error analysis. See, e.g., Gray v. Mississippi, 481 U.S. 648, 668 (1988); Davis v. Georgia, 429 U.S. 122, 123 (1976) (holding that the improper exclusion of one veniremember out of 83 was reversible error). The Kentucky Supreme Court was thus incorrect when it reasoned that even if error, Correll's exclusion was harmless error. See Gall, 607 S.W.2d at 104. However, this error \"does not invalidate the guilty verdict. It holds only that the death sentence imposed by an improperly selected jury cannot be executed.\" Woodards v. Cardwell, 430 F.2d 978, 980 (6th Cir. 1970).\n\nD. Prejudicial Extraneous Information\n\nGall argues that the post-conviction testimony of another juror (\"Palmer\") demonstrates that Gall's death sentence was unconstitutional. In a post-conviction questionnaire and again at a deposition conducted as part of Gall's habeas petition, Palmer indicated that he was aware of Gall's parole status when he committed the crime. (Gall alleges that Barton informed other jurors, including Palmer, of that fact). Palmer also indicated that the question of parole--the fact that he committed the crime while on parole, and the potential for parole from a life sentence--played an important role in the jury's decision to render a death sentence. Indeed, the jury explicitly asked the judge during deliberations if Gall could be paroled if given a life sentence. The judge responded: \"the Court cannot advise you as to either parole or pardon.\" J.A. at 1638-39. Gall argues that the jury's consideration of his parole status violated both Kentucky law and Gall's constitutional rights.\n\nThe Commonwealth offers several counter-arguments. First, the Commonwealth contends that statements in the penalty phase of the trial by both of Gall's parents referred indirectly to Gall's parole status, so that it was not \"extraneous\" information. The Commonwealth next avers that the evidence is not admissible under Fed. R. Evid. 606(b), pointing to the magistrate court's conclusion to that affect and to Tanner v. United States, 483 U.S. 107 (1987), which discussed FRE 606(b). Third, the Commonwealth argues that Gall has not made a valid argument under habeas review because there is no constitutional rule prohibiting juries from considering the possibility of parole as part of their weighing of the death penalty. See, e.g., California v. Ramos, 463 U.S. 992 (1983). Further, the claim that the jury's consideration of parole violated Kentucky law is not cognizable on habeas review.\n\n1.\n\nGall is certainly correct when he argues that post-conviction hearings are permissible means to investigate and remedy actual juror bias. See Smith v. Phillips, 455 U.S. 209, 215 (1982) (holding that the Court \"has long held that the remedy for allegations of juror partiality is a hearing in which the defendant has the opportunity to prove actual bias\"); United States v. Herndon, 156 F.3d 629, 635 (6th Cir. 1998) (holding that \"[w]here a colorable claim of extraneous influence has been raised,\" a hearing is necessary to provide an opportunity to show actual bias). The critical task is determining what evidence can be considered in assessing a claim of jury partiality. In doing so, we find most of Palmer's statements to be inadmissible; nevertheless, we find some of his most crucial statements admissible.\n\nFederal Rule of Evidence 606 establishes what evidence pertaining to jury deliberations a court may consider.\n\n[A] juror may not testify as to any matter or statement occurring during the course of the jury's deliberations or to the effect of anything upon that or any other juror's mind or emotions as influencing the juror to assent to or dissent from the verdict or indictment or concerning the juror's mental processes in connection therewith . . . .\n\n[A] juror may testify on the question whether extraneous prejudicial information was improperly brought to the jury's attention or whether any outside influence was improperly brought to bear upon any juror. Fed. R. Evid. 606(b).\n\nTanner further clarified the distinction between \"internal\" and \"external\" matters. Examples of impermissible \"internal influences 'include the behavior of jurors during deliberations, the jurors' ability to hear or comprehend trial testimony, and 'physical or mental incompetence of a juror'\"--generally, the \"'internal processes of the jury.'\" Herndon, 156 F.3d at 634-35 (quoting Tanner, 483 U.S. at 118, 120). Misapprehension of instructions is also internal in nature. See Warden v. Gall, 865 F.2d 786, 788 n.2 (6th Cir. 1989). Examples of outside influences include a juror in a criminal trial who had previously applied for a job in the district attorney's office; a bribe attempt on a juror; and the entry of newspaper articles and media attention into deliberations. See Herndon, 156 F.3d at 635. This Court further sharpened the definition of external influence:\n\n[W]e distill the principle that an extraneous influence on a juror is one derived from specific knowledge about or a relationship with either the parties or their witnesses. This knowledge or relationship is such that it taints the deliberations with information not subject to a trial's procedural safeguards. These types of influences, moreover, may well deny the litigants their constitutional right to have the case heard by a fair and impartial jury. Id. at 636.\n\nFinally, even when a juror testifies as to external evidence, that testimony must be parsed of all references regarding \"the effect of that information on the juror's mental processes or the jury's deliberations.\" Bibbins v. Dalsheim, 21 F.3d 13, 17 (2d Cir. 1994).\n\nUsing these standards in looking at Palmer's deposition and questionnaire, we conclude that very few of his statements are admissible. First, almost all questions and answers on the questionnaire involved inadmissible\"internal considerations\" because they involved the \"effect\" of the knowledge of parole on the jury's deliberations. For instance, the questionnaire asked of \"[t]he role parole played in your deliberation?\" Palmer answered: \"[A] big part.\" J.A. at 1168. The questionnaire then asked: How important was the fact that Gall was on parole? The answer \"Very important.\" The form then questioned the role publicity played in deliberations, the possible alternative sentences under different hypotheticals, and asked \"what convinced [Palmer] of\" different conclusions. J.A. at 1168-69. In short, most questions involved paradigmatic internal considerations--the effect of parole and other factors upon Palmer's or any other juror's \"mind or emotions as influencing the juror to assent to or dissent from the verdict.\" Fed. R. Evid. 601(b). Nevertheless, since Gall's parole status was never addressed at trial, see infra, the one question that is admissible as a purely external matter is--\"Did you as a juror know Gall was on parole?\" Answer: \"Yes.\" J.A. at 1168. Similarly, nearly all of Palmer's deposition comprised inadmissible statements of his and the jury's internal considerations at trial--questions concerning the effect the possibility of parole had on the jury's deliberations. J.A. at 1151-62. The only testimony that involved exclusively external influences was Palmer's acknowledgment, after having looked at his completed questionnaire, that he had known that Gall was on parole when he committed his crime. J.A. at 1155. He also stated that another juror had made him aware of that fact, a statement that was also admissible. J.A. at 1166.\n\n2.\n\nGall's arguments regarding state law violations are not cognizable on habeas review.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e Nevertheless, Gall does state a colorable constitutional claim, reviewable under § 2254, when he asserts that the juror's consideration of improper extraneous influences violated his Sixth Amendment right to an impartial jury, as well as his right of confrontation and cross-examination. At the time, Kentucky did not permit jurors to consider parole as an aspect of their sentencing decision; nor were counsel allowed to discuss parole in their arguments before the jury. Yet Barton conceded at voir dire that he had previously read about Gall's parole status, and Palmer conceded that he knew of Gall's parole during the deliberations, having heard that fact from another juror. This case is thus better cast as one involving the introduction of improper extraneous information into the trial that may have prejudiced Gall's case.\n\nIn a habeas petition, when claiming that a trial error violated his constitutional rights, a defendant must show that the error \"had substantial and injurious effect or influence in determining the jury's verdict.\" Brecht v. Abrahamson, 507 U.S. 619 (1993) (internal quotations and citation omitted); Nevers v. Killinger, 169 F.3d 352, 370 (6th Cir. 1999). A trial judge's finding on the impartiality of a juror or jury is a factual finding, presumed correct under § 2254 review unless Gall proves otherwise by convincing evidence. See Turpin v. Kassulke, 26 F.3d 1392, 1401 (6th Cir. 1994) (citing Patton, 467 U.S. at 1036).\n\nA defendant's Sixth Amendment rights are put in jeopardy when facts appear before a jury that were not developed at trial. Such extraneous influence may threaten the guarantee of an impartial jury, see Herndon, 156 F.3d at 636; Goins, 605 F.2d at 953, and may trammel a defendant's right to confrontation and cross-examination. See Parker v. Gladden, 385 U.S. 363, 364-66 (1966) (per curiam) (holding that statements by a court bailiff to jurors violated Sixth and Fourteenth Amendment rights). The Supreme Court has also found a due process violation when a \"death sentence was imposed, at least in part, on the basis of information which [a defendant] had no opportunity to deny or explain.\" Gardner v. Florida, 430 U.S. 349, 362 (1977); see also Sheppard, 384 U.S. at 351 (counting among essential legal procedures \"the requirement that the jury's verdict be based on evidence received in open court, not from outside sources\"); Irvin, 366 U.S. at 722 (stating that a juror's verdict \"must be based upon the evidence developed at the trial\").\n\nWe find that Gall's parole status was improper \"extraneous\" information. Despite the Commonwealth's argument to the contrary, there is no mention in the record that Gall had been on parole when he killed Jansen. The fact that his mother mentioned that he had been previously \"released\" did not indicate that he was released on parole. Nor did the lawyers, judge or other witnesses reveal that Gall was on parole at the time he committed the offense. With no sources from within the trial indicating his parole status, Palmer's knowledge of Gall's parole status was clearly extraneous information--as he himself stated under oath.\n\nDue to Kentucky rules, counsel never had a chance to \"explain\" this crucial fact that came before the jury. Although we are not permitted to note Palmer's testimony that the jury considered that fact \"very important,\" we do find that a reasonable juror would have likely considered the extraneous information of Gall's parole status in setting his sentence. See Bibbins, 21 F.3d at 17 (noting that when an extraneous influence is shown, a court must use an objective test to assess the likelihood that the influence would affect the typical juror). Thus, due process was violated because Gall's \"death sentence was imposed, at least in part, on the basis of information that he had no opportunity to deny or explain.\" Gardner, 430 U.S. at 362; see Herndon, 156 F.3d at 636 (noting that extraneous information \"taints [a jury's] deliberations with information not subject to a trial's procedural safeguards\").\n\nMoreover, the trial court's response to the prospect that the jury was \"tainted\" was unacceptably weak. He merely advised the jury that \"it would be error for this Court to instruct you or comment upon the subject of parole.\" J.A. at 1638. We agree with Gall that when faced with this question, the judge had a duty to admonish the jury more forcefully that it could not consider parole in its sentence determination--which would have reflected Kentucky law at the time. See Brown v. Commonwealth, 445 S.W.2d 845, 848 (Ky. 1969). This is particularly important in the context of death penalty cases, where the Supreme Court has clearly attempted to rein in jury discretion to impose death based on any aggravating factors it saw fit. See generally Beck, 447 U.S. at 639. Here, when faced with the clear prospect that the jury was considering an aggravating factor beyond what had been presented at trial, and which the lawyers had been forbidden from discussing, \"the trial court failed to take all appropriate steps to assure the integrity and dignity of the trial.\" Goins, 605 F.2d at 953.\n\nIn short, we believe that the jury's extraneous knowledge of Gall's parole status at the time of the killing, and the trial court's failure to respond appropriately to its question regarding parole, inflicted \"substantial and injurious effect or influence in determining the jury's verdict.\" Brecht, 507 U.S. at 638.\n\nV.\n\nDue to the constitutional violations stated above, this Court is compelled to grant Gall's petition for habeas relief. This Court has broad discretion in fashioning such relief. See Hilton v. Braunskill, 481 U.S. 770, 775 (1987). The law requires that we dispose of habeas corpus matters \"as law and justice require.\" 28 U.S.C. § 2243. The predecessor to that statute vested a federal court \"with the largest power to control and direct the form of judgment to be entered in cases brought up before it on habeas corpus.\" Hilton, 381 U.S. at 775 (internal quotation marks and citation omitted). Despite this discretion, double jeopardy prevents us from ordering a retrial of this case--the prosecution already had one attempt to make its case for murder and, as explained above, failed to prove an essential element. See United States v. Burks, 437 U.S. 1, 16-18 (1978); Stacy v. Love, 679 F.2d 1209, 1212-14 (1982).\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e Without that element proved, Gall's conviction would have been for manslaughter pursuant to Ky. Rev. Stat. Ann. § 507.030(b), which carried a maximum jail term of twenty years--a length of time he has already served.\n\nNonetheless, in looking at the trial record, we think that the overwhelming and undisputed evidence of Drs. Chutkow and Toppen was that Gall was not sane at the time he committed the acts in question. Moreover, the evidence clearly showed that Gall's psychotic condition is permanent, and that he would be extremely dangerous to his fellow citizens if released into free society. Dr. Noelker testified to Gall's dangerousness in the starkest of terms. He stated that Gall's condition was not curable, and \"[t]he best that we could hope to do would be to control his condition.\" J.A. at 970. Outside of an institution, he explained, this is not possible; \"we would have no means of knowing how or when he took his medication or what pressures would cause him to become psychotically obsessional.\" Id. In an uncontrolled setting, therefore, it was \"probable that [Gall] would act again in a similar manner\" to the grisly act committed in this case. J.A. at 962. It was therefore his \"strong recommendation\" that Gall \"never be allowed to become a free member of the society again.\" J.A. at 970. In 1983, he repeated his diagnosis that Gall would always suffer from a mental disease or defect. J.A. at 1093. At trial, Dr. Toppen reached the same conclusion, explaining the need for Gall to remain in a highly structured environment, whether that be a mental or penal institution. J.A. at 1215. A 1991 examination by another doctor confirmed that Gall is permanently dangerous. J.A. at 629 (concluding that Gall's violent propensities \"appear to be the result of a brain dysfunction which unleashes, without apparent internal controls, violent and aggressive behavior\").\n\nWith this overwhelming showing of Gall's severe mental illness and his high potential for future dangerousness, we condition the grant of Gall's habeas petition on the state's granting him an involuntary hospitalization proceeding, just as he would have been provided if he had been found insane under Ky. Rev. Stat. Ann. § 504.030 (requiring such a proceeding for defendants who are acquitted by reason of insanity). We leave it to that proceeding to determine if Gall meets the guidelines of Ky. Rev. Stat. Ann. ch. 202A, which provides for confinement and hospitalization of mentally ill and dangerous persons until a time when they no longer present a danger to themselves or others. As this Court once stated in similar circumstances, we can only hope that the Commonwealth will note the overwhelming evidence that this man is severely mentally ill and highly dangerous and commit him indefinitely on that basis. See Stacy v. Love, 679 F.2d at 1214.\n\nVI.\n\nThere can be little doubt that the fact that Gall committed a heinous crime drove the prosecution to secure a conviction at the expense of Gall's constitutional rights. We must remember, as Judge Cranch so eloquently stated almost two centuries ago, that the \"constitution was made for times of commotion.\" United States v. Bollman, 24 F.Cas. 1189, 1192 (C. D.C. 1807) (Cranch, J., dissenting). In these times, \"[w]e ought to be upon our guard lest our zeal for the public interest lead us to overstep the bounds of the law and the constitution; for although we may thereby bring one criminal to punishment, we may furnish the means by which an hundred innocent persons may suffer.\" Id. Unfortunately, the cumbersome circumstances of this trial and the Commonwealth's zeal in securing a murder conviction and death sentence overwhelmed the strictures of the Constitution. By failing to bind the Commonwealth to constitutional requirements, and by allowing constitutional error to infect the trial in ways that altered its outcome, the trial and appellate courts failed in their duty to \"administer justice [] according to the laws and constitution of the United States.\" Id. Specifically, Gall's trial, conviction and appeal contravened the fundamental elements discussed above. We are therefore compelled to REVERSE the district court's denial of habeas relief and REMAND for proceedings consistent with this opinion.\n\nCONCURRING IN PART, DISSENTING IN PART\n\nGUY, Circuit Judge, concurring in part and dissenting in part. In this death penalty habeas case, the court concludes that the jury's verdict of guilty should be overturned and the state trial court be ordered to enter a verdict of not guilty by reason of insanity. The court styles this relief as the granting of a conditional writ of habeas corpus. The \"condition,\" however, is not the usual one that the state either retry or release the prisoner. Rather, the court first rules that double jeopardy would preclude the retrial of the defendant, an issue that was not raised in this appeal and an issue on which the state has never had an opportunity to be heard. The result of this holding would be to release a person who is undoubtedly guilty of the heinous offense charged and whom the court itself characterizes as likely to commit a similar offense. In order to avoid this result the court next takes the unprecedented step of usurping the role of the trial jury, which rejected the insanity defense, and finds the defendant insane.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e The state trial court is then ordered to hold an involuntary hospitalization proceeding under Ky. Rev. Stat. Ann. § 504.030 (Banks-Baldwin 1995).\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nAlthough the court makes reference to the fact that defendant is very dangerous, incurable, and needs to be confined for the rest of his life, that is by no means the compelled result of the Kentucky civil involuntary hospitalization proceedings that will be conducted 22 years after the crime was committed. One can imagine the first thing the defendant will offer in his defense to hospitalization is that the jury found him to be sane, the state contended he was sane, and he, himself, never claimed to be insane. The defendant went so far as to act as his own counsel for much of the trial because he did not agree with his lawyer's urging of an insanity defense. Unless you can commit a person involuntarily in Kentucky for being \"crazy like a fox,\" there is no guarantee that Gall will not walk away a free man as a result of this decision.\n\nAlthough I have started my dissent by drawing attention to the possible dire consequences of the court's decision, this is not the basis of my dissent. Sometimes, as Judge Jones goes to great lengths to point out, judges just have to let the chips fall where they may. At the risk of pushing a metaphor too far, the \"chips\" in this case are from a tree that does not need to be chopped down.\n\nI.\n\nAfter analyzing defendant's claims of error as they relate to the guilt phase of the trial, the court rejects the majority of them, including the claim that Gall was not competent to stand trial. I agree with all of those sections of the court's opinion and will only address the findings with which I take issue.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nI begin with what I believe to be the key holding in the courts opinion and the one which I believe is most clearly erroneous. The court concludes that it was the government's responsibility to prove the absence of extreme emotional distress as an element of the offense charged.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e The court then compounds its error by concluding that mental illness equates with \"extreme emotional disturbance\" for purposes of the Kentucky murder statute. The applicable Kentucky statute reads in pertinent part:\n\n507.020 Murder\n\n(1)A person is guilty of murder when:\n\n(a)With intent to cause the death of another person, he causes the death of such person or of a third person; except that in any prosecution a person shall not be guilty under this subsection if he acted under the influence of extreme emotional disturbance for which there was a reasonable explanation or excuse, the reasonableness of which is to be determined from the viewpoint of a person in the defendant's situation under the circumstances as the defendant believed them to be. However, nothing contained in this section shall constitute a defense to a prosecution for or preclude a conviction of manslaughter in the first degree or any other crime[.] Ky. Rev. Stat. Ann. § 507.020(1)(a).\n\nNothing in the statute suggests that negating extreme emotional distress is an element of the crime of murder, or that mental illness, short of legal insanity, is a defense. That the court's reading of the statute is erroneous is demonstrated clearly by the Kentucky Supreme Court's holding in Wellman v. Commonwealth, 694 S.W.2d 696, 697-98 (Ky. 1985).\n\nThe contention that mental illness and extreme emotional disturbance are one and the same is without merit. Prior to the adoption of KRS 507.020 (murder) and KRS 507.030 (voluntary manslaughter), the differentiating standard between the two, under the common law, was \"sudden heat and passion.\" The principal change in the statute does not lie in the difference in the definitions between \"sudden heat and passion\" and \"extreme emotional disturbance,\" if there is such. It lies in the fact that the former requires adequate provocation in the eyes of a reasonable man under the circumstances, while the latter requires the jury \"to place themselves in the actors' position as he believed it to be at the time of the act.\" Gall, supra, at p. 108. Thus, the proper application, and point thereof, of mental illness, like intoxication on alcohol or drugs, is in the test of the effect thereof in considering such factors as events, acts or words as they relate to the particular defendant who contends that he was under extreme emotional disturbance at the time of his act.\n\nIn short, mental illness may be considered by the jury in the reaction by a particular defendant when there is probative, tangible and independent evidence of initiating circumstances, such as provocation at the time of his act which is contended to arouse extreme emotional disturbance. It is not such a disturbance when standing alone. Id. (emphasis added).\n\nStated another way, and relating the above to the facts of this case, the \"defense\" or mitigation exception provided for in the Kentucky murder statute comes into play only upon a showing of \"provocation,\" with the significant factor being that the jury must evaluate provocation through the eyes of the defendant. If the defendant has a mental illness such that he will see \"provocation\" where a normal person might not, the jury has to consider this deficiency on the part of the defendant.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e This is a far cry from the court's holding here that extreme emotional disturbance is at all times an element of the offense of murder that has to be negated even when there is no claim of \"provocation\" or other \"initiating circumstances,\" much less evidence of it. On this latter point the Kentucky Supreme Court in Gall's appeal specifically held:\n\nWhile it is true that the \"extreme emotional disturbance\" phase of the murder instruction did not include the additional statutory language, \"the reasonableness of which is to be determined from the standpoint of a person in the defendant's circumstances as the defendant believed them to be,\" we are of the opinion that the omission was proper. Obviously that particular language is appropriate only when there is evidence suggesting that the emotional disturbance was precipitated by some event or circumstance the defendant believed to exist. In this case there was no evidence to suggest that the appellant's motivation involved any \"belief\" on his part with regard to the circumstances that induced the alleged emotional disturbance. Ratliff v. Commonwealth, Ky., 567 S.W.2d 307 (1978), is factually distinguishable in this particular respect. Gall v. Commonwealth, 607 S.W.2d 97, 109 (Ky. 1980).\n\nThe United States Supreme Court in a case involving this same Kentucky statute stated:\n\nAt trial, petitioner attempted to establish the affirmative defense of \"extreme emotional disturbance.\"fn8 He called as his sole witness a social worker, Martha Elam, who formerly had been assigned to his case. At the request of petitioner's counsel, she read to the jury from several reports and letters dealing with evaluations of petitioner's mental condition. On cross-examination, the prosecutor had Elam read another progress report made while petitioner was institutionalized. The prosecutor then sought to have Elam read from a report of a psychological evaluation made by Doctor Robert J. G. Lange while petitioner was within the jurisdiction of the juvenile court after his arrest for Poore's murder. Counsel for petitioner and the prosecutor jointly had moved the juvenile court to order this evaluation under Ky. Rev. Stat. §§ 202A.010-202A.990 (1977), which, at the time, governed involuntary hospitalization for psychiatric treatment.\n\nfn8At the time of the offense, the settled law in Kentucky was that this defense was available only where the defendant established two elements: that the defendant had been provoked, and that the defendant had acted in a subjectively reasonable way given this provocation. See Gall v. Commonwealth, 607 S.W.2d 97, 108-109 (Ky. 1980); Wellman v. Commonwealth, 694 S.W.2d 696, 697-698 (Ky. 1985). The defendant has the burden of production on this defense, see Gall, supra, at 109, which cannot be established simply by a showing of mental illness, see Wellman, supra, at 697. Buchanan v. Kentucky, 483 U.S. 402, 408-11 (1987) (emphasis added) (some footnotes omitted).\n\nIn reaching its conclusion relative to the Kentucky murder statute, the court misreads Ratliff v. Commmonwealth, 567 S.W.2d 307 (Ky. 1978), and Edmonds v. Commonwealth, 586 S.W.2d 24 (Ky. 1979).\n\nThe defendant in Ratliff believed there was a conspiracy against her, and that the retail store clerk she shot and killed was part of the conspiracy.\n\nAppellant believed the store clerk was a conspirator against her. She testified: \". . . Charlie Gilbert went up and told that woman at the store, the one I shot; he went up there and told her not to sell me nothing out of the store . . . .\" \"They watched me, yes, and got smart with me and they acted like they wanted to bother me the Mullens girl and there's another girl come in from across the street, a little black headed girl, and they both got together there and I thought they was going to jump me.\" Appellant told state police detective Bellamy, \"That lady (the victim) looked at me as if she was going to pull my hair.\" Appellant had been on medication and had been visiting the local Comprehensive Care Center for some time prior to the shooting for treatment of her mental condition. Ratliff, 567 S.W.2d at 309.\n\nIn Ratliff there was also psychiatric evidence that the defendant was a paranoid schizophrenic, and a defense of insanity was asserted. Although the court instructed on the insanity defense, it did not give the first-degree manslaughter instruction contemplated by the statute when the facts justify mitigation as a result of extreme emotional disturbance. The conclusion of the Ratliff court was that the instruction should have been given because the defendant thought the victim was conspiring against her, and the jury should have evaluated this delusion based upon defendant's paranoid schizophrenia. Thus, clearly, the court found the necessary predicate provocation to be the defendant's delusion that the victim was plotting against her. Once the predicate provocation is found, then, and only then, the prosecution has the burden of negating extreme emotional disturbance as a mitigating factor. Illustrating this point, the court in Ratliff stated:\n\nIn the case presently before us, the prosecution carried the burden to satisfy the jury of the absence of extreme emotional disturbance as statutorily defined. The defendant carried the burden to convince the jury that she was legally insane at the time of the commission of the offense. KRS 504.020. If the jury had a reasonable doubt that the defendant had been proved not to have acted under the influence of extreme emotional disturbance for which there was a reasonable justification or excuse under the circumstances as she believed them to be, the punishment they could otherwise assess for murder could have been mitigated by a finding of first degree manslaughter. Of course, if the defense of legal insanity had been believed by the jury the result would have been complete exculpation and not mitigation of punishment. Id. at 309-10 (emphasis added).\n\nEven under these circumstances, three of the seven Kentucky justices dissented. The language in the dissent is illuminating:\n\nThere is no doubt that Clarsie [the defendant] was suffering from a mental disease. She was classified by a psychiatrist as a schizophrenic paranoid. A psychiatrist testified that she might commit a similar offense again and again. If an iota of evidence existed that Clarsie was acting under extreme emotional disturbance I would join the majority in saying that she was entitled to an instruction on first-degree manslaughter. I do not believe it is the function of this or any appellate court to embark on a crusade to find errors where none exist. Id. at 310.\n\nAt the risk of stating the obvious, the disagreement between the majority and dissent did not involve whether extreme emotional disturbance was an element of the crime of murder, but, rather, notwithstanding that defendant suffered from a serious mental illness, was there a factual predicate, i.e., provocation, sufficient to even require the jury to look at the killing through the eyes of the defendant.\n\nSimilarly, in Edmonds the defendant, who had a \"psychoneurotic condition,\" was infatuated with the woman he murdered. In describing the circumstances immediately surrounding the murder the court stated: \"The appellant [defendant] was jealous of Betty [the victim] and on this fateful afternoon was laboring under the impression that she was going out with another man.\" Edmonds, 586 S.W.2d at 26.\n\nAs in Ratliff, the issue in Edmonds was the trial court's failure to give a first-degree murder instruction. In finding error in the failure to do so, Edmonds is totally consistent with Ratliff. The predicate, the delusion that the victim was seeing another man, was present and, when coupled with the defendant's mental condition, would require the jury to look at the murder through the eyes of the defendant.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nIn Gall, the Kentucky Supreme Court did not find that there was insufficient evidence of any predicate which would trigger the extreme emotional disturbance defense, but that there was \"no evidence.\" In my view, this is a factual finding which must be accorded great deference. It also is clear beyond peradventure that it is correct. There was never even a suggestion that the 12-year-old girl, who Gall raped and then shot, somehow in Gall's eyes had done something to provide \"a reasonable explanation or excuse\" for his actions. The most Gall offers is that he doesn't remember the killing. This might be relevant to his insanity defense, but is not a basis for holding that the \"extreme emotional disturbance\" provision of the murder statute was called into play.\n\nOne additional Kentucky case is worthy of mention although it must be read against the backdrop of the other Kentucky cases which make it clear that the extreme emotional disturbance language in the murder statute is a term of art and is not intended to apply whenever a person, in the abstract, may be emotionally disturbed as that term is commonly understood. In Coffey v. Messer, 945 S.W.2d 944, 945 (Ky. 1997), the court added further clarification to this discussion:\n\nAlthough we have occasionally described EED as a mitigating circumstance, e.g., Gall v. Commonwealth, Ky., 607 S.W.2d 97, 108 (1980), overruled on other grounds, Payne v. Commonwealth, Ky., 623 S.W.2d 867 (1981), cert. denied, 450 U.S. 989, [ ] (1981), it is, in fact, a defense to the extent that its presence precludes a conviction of murder. KRS 507.020(1)(a). We have often characterized EED as a defense, and it is referred to as a \"defense to the crime\" in the mitigating circumstances section of our capital penalty statute. KRS 532.025(2)(b)2. Once evidence is introduced to prove the presence of EED, its absence becomes an element of the offense of murder. Gall v. Commonwealth, supra, at 109. As with other penal code defenses, the Commonwealth then assumes the burden of proof on the issue but is not required to produce direct evidence of its absence. Matthews v. Commonwealth, Ky., 709 S.W.2d 414, 421 (1985), cert. denied, 479 U.S. 871, [ ] (1986). Evidence of EED entitles the defendant to an instruction on the lesser included offense of first-degree manslaughter. KRS 507.030(1)(b). Although a lesser included offense is not a defense within the technical meaning of those terms as used in the penal code, it is, in fact and principle, a defense against the higher charge. Gall v. Commonwealth, supra, at 108; Brown v. Commonwealth, Ky., 555 S.W.2d 252, 257 (1977). . . . Id. at 945-46 (footnote omitted) (emphasis added).\n\nCoffey is significant for another reason. It makes clear that when a defendant introduces evidence that he was acting under extreme emotional disturbance, it is not a defense which could result in an acquittal, but only a defense that allows the defendant to have the jury instructed on the lesser included offense of first-degree manslaughter. Even though he wasn't entitled to it, Gall received the benefit of such an instruction. In short, the trial court actually proceeded as if it were a case in which the defendant was entitled to the instruction on the lesser included offense.\n\nHaving found the prosecution failed to prove an element of the offense, the majority next addresses the finding to the contrary by the Kentucky Supreme Court (section III B 2 c of the court's opinion). The court concludes that the Kentucky Supreme Court's decision violated due process by shifting \"the burden to defendants to produce evidence of emotional disturbance.\" There are several things wrong with this conclusion. First, what the Kentucky Supreme Court actually said was:\n\nThere is much to be said for the proposition that an emotional disturbance inhering in a mental illness is not the kind of an emotional disturbance contemplated by the statute, in view of its historical development and the expression in the Commentary to the effect that it may be aroused by \"any event, or even words,\" as quoted above. Assuming, however, that a mental disorder, whether or not it amounts to legal insanity, may constitute a reasonable \"explanation or excuse\" for extreme emotional disturbance, it was incumbent upon the trial court to require the negating of that factor in its instruction on murder, which was done. Gall, 607 S.W.2d at 109 (emphasis added).\n\nThis was the holding of the Kentucky court. Here, the majority, which quotes this portion of the Kentucky opinion, leaves out the language concerning the historical development of this section and then goes on to quote and rely upon language in the opinion that is clearly dicta and not controlling in this case. Nonetheless, the Kentucky court clearly found that the view of the statute which makes negating extreme emotional disturbance an element of the crime of murder was the one taken by the trial judge, and that this was demonstrated by the instruction the trial judge gave to that effect.\n\nStated another way, assuming arguendo that the Kentucky Supreme Court in Gall's direct appeal did place an interpretation on the murder statute that differed from the interpretation it was previously given in Ratliff and its progeny, it makes no difference because the trial court proceeded in a manner consistent with Ratliff. I say \"assuming arguendo\" because one must not lose sight of the fact that the Kentucky court in Gall concluded that Ratliff was \"factually distinguishable\" and, as I have pointed out earlier, such was indeed the case.\n\nIn addition to being based upon a misinterpretation of the Kentucky murder statute as well as the case law interpreting that statute, the majority's conclusion will not stand up under logical analysis. For example, if a person is charged with murder under the Kentucky statute and all that is offered by way of defense is a claim by the defendant that he was in another state at the time of the murder, there would be no need for the prosecution to offer any evidence of the defendant's mental state. Yet, if, as the majority claims, the absence of extreme emotional disturbance is an element of the crime of murder it would have to be proven in all cases. To merely state this proposition is to show its absurdity. When all of the Kentucky cases dealing with the Kentucky murder statute are read, both those that precede Gall's crime and those that follow, it is clear that when \"extreme emotional disturbance\" is referenced in the same breath with \"element,\" all that is intended is that once a defendant provides the necessary evidentiary predicate, the prosecution has the burden of proof on that issue.\n\nThus, the court's analysis concluding that the Kentucky Supreme Court violated due process, proceeds from an erroneous premise as to what the court actually ruled relative to Gall's appeal, as well as a misreading of the earlier cases. The trial judge, in fact, proceeded in a manner consistent with what the majority contends was the then-existing law and instructed the jury appropriately.\n\nIn a case in which there is a claim of acting under extreme emotional disturbance and an insanity defense, the difference between the two must be kept clear. The facts surrounding the murder are key to the extreme emotional disturbance defense. The facts surrounding defendant's mental disease or defect are key to the insanity defense. This distinction is critical in this case. Everyone would agree that Gall had mental problems and had previously been institutionalized. Yet, Gall presented nothing that would require or permit the jury to see the crime through his eyes because \"no reasonable explanation or excuse\" was offered as is required by the statute. At the risk of repeating myself, there has to be something either done by the victim or inherent in the circumstances surrounding the murder that would arouse extreme emotional disturbance and allow the jury to consider whether the defendant acted under such disturbance, which would then allow the crime to be viewed as first-degree manslaughter.\n\nAfter erroneously concluding that the prosecution failed to prove an element of the crime of murder, the court then goes on to further find Gall was insane when the crime was committed 22 years ago. This finding is made without any discussion of what must be shown under Kentucky law to establish the defense. In Kentucky, a defendant offering an insanity defense bears the burden of proof. The relevant Kentucky statutes provide:\n\n500.070 Burden of proof; defenses\n\n(1)The Commonwealth has the burden of proving every element of the case beyond a reasonable doubt, except as provided in subsection (3). This provision, however, does not require disproof of any element that is entitled a \"defense,\" as that term is used in this code, unless the evidence tending to support the defense is of such probative force that in the absence of countervailing evidence the defendant would be entitled to a directed verdict of acquittal.\n\n(2)No court can require notice of a defense prior to trial time.\n\n(3)The defendant has the burden of proving an element of a case only if the statute which contains that element provides that the defendant may prove such element in exculpation of his conduct. Ky. Rev. Stat. Ann. § 500.070.\n\n504.020 Mental illness or retardation\n\n(1)A person is not responsible for criminal conduct if at the time of such conduct, as a result of mental illness or retardation, he lacks substantial capacity either to appreciate the criminality of his conduct or to conform his conduct to the requirements of law.\n\n(2)As used in this chapter, the term \"mental illness or retardation\" does not include an abnormality manifested only by repeated criminal or otherwise antisocial conduct.\n\n(3)A defendant may prove mental illness or retardation, as used in this section, in exculpation of criminal conduct. Ky. Rev. Stat. Ann. § 504.020.\n\nThe commentary to § 504.020 states:\n\nThe section also adopts the prior law which governed the burden of proof on the issue of insanity. Previously the defendant had to bear that burden; and, subsection (3) of this section continues to require that the defendant prove his insanity.\n\nIn concluding Gall was insane, the court relies upon statements by two psychiatrists concerning Gall's existing mental condition who never unequivocally said that, on the day of the murder, Gall either didn't understand what he was doing or, if he did, that he was unable to resist the impulse to violate the law. There is no doubt that the \"mental disease or defect\" prong of the insanity defense was satisfied, but a \"snapshot\" of Gall's mental condition on the day of the murder was never presented to the jury with any degree of certainty, or in a form they would be compelled to accept. Upon cross-examination by the prosecutor, Dr. Noelker, the defense expert, was unable to specify even one event which might have caused Gall to leave the state of remission he was in and suddenly become legally insane at 8:00 a.m. on the day he murdered Lisa Jansen. Noelker also admitted that because of Gall's claimed amnesia, his mental condition on the day of the murder was difficult to ascertain.\n\nAlthough the majority concludes on the basis of the expert testimony that Gall was insane on the day of the rape and murder, the jury certainly was not required to reach that conclusion. As the Kentucky Supreme Court points out in its lengthy opinion affirming Gall's conviction, this was an unusual trial in many respects, not the least of which was that Gall acted, at least in part, as his own counsel. The Kentucky court found, and I agree, that some of the so-called bizarre trial tactics indulged in by Gall were actually very clever.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e The jury had an opportunity to observe the defendant in action in a manner seldom afforded to juries in criminal cases, much less those in which an insanity defense is offered. There is absolutely no rule of law, evidence, or procedure, which would have compelled this jury to find Gall insane. Neither does common sense compel that result. In addition to seeing Gall in action, the jury heard from several persons who had a chance to observe Gall and his demeanor within hours of the murder. The jury was entitled to credit this \"snapshot\" of Gall and conclude that he appreciated the criminality of his conduct and was able to resist the impulse to commit the murder if he had chosen to do so.\n\nII.\n\nThe court also concludes, as another ground for reversing Gall's conviction, that egregious prosecutorial misconduct occurred. I respectfully disagree. I first note that the court's decision to acquit the defendant by reason of insanity subsumes all other errors unless they relate to Gall's insanity defense. Thus, the focus, insofar as alleged prosecutorial misconduct is concerned, must be on the alleged acts of misconduct which bore on the insanity defense. The court does point to several comments made by the prosecutor in closing argument, but in each and every instance the remarks are taken out of context and ignore the very essence of the way this trial unfolded.\n\nAlthough not always the case, generally when a defendant offers an insanity defense there is little doubt that he committed the crime and the insanity defense is his last resort. Such is the case here. Gall never made a believable claim of innocence, and the majority opinion does not even hint at innocence. Therefore, it is understandable that under these circumstances the prosecutor would bring out his heaviest artillery and direct it at the insanity defense. This certainly is not a license to make improper arguments, but the arguments that were made have to be viewed against the backdrop of the nature of the insanity defense in this case.\n\nTo begin with, there is no doubt given Gall's history that any health professional brought in to testify would indicate Gall suffered from a mental disease. This explains why the government did not offer additional psychiatric testimony, a fact that the majority seems to find significant. But just as there are many schizophrenics who function day-to-day in society and commit no crimes, there are schizophrenics who, at the time they commit a crime, are able to distinguish right from wrong and are not acting under an irresistible impulse. In this case, the prosecution's theory was that Gall was faking the inability to remember the events surrounding Lisa Jansen's death. This point is worthy of further elaboration.\n\nGall was in a bind in that even though no eyewitness saw him rape and shoot Lisa Jansen, he was positively identified as the perpetrator of the store robbery and police officer's shooting that took place shortly after the time of Lisa's murder. Gall admitted that he remembered the police chasing him and remembered shooting the state trooper, but indicated he could not recall his actions immediately before that. The circumstantial evidence tying him to Lisa's murder was very strong. Under these circumstances, it should not be surprising that the prosecution felt this was a very convenient case of amnesia and argued accordingly. Into this mix came Gall's participation in his own trial. It is clear that Gall was seeking to get a full acquittal on the merits, even though his counsel was relying on an insanity defense. This working at cross purposes was further evidence in the eyes of the prosecutor that insanity was a sham defense in this case. Gall was doing his best to show the jury he was sane and innocent, while the experts called by his attorney were trying to show he was insane. The testimony of the experts thus became critical. Although the prosecutor's attacks on their testimony may have been inartful and at times even inappropriate, they were all for the purpose of trying to keep the jury from confusing the fact that Gall had a mental disease with the conclusion that as a result he was legally insane--a very legitimate goal. As the Supreme Court stated in Barefoot v. Estelle, 463 U.S. 880, 898 (1983), \"[p]sychiatric testimony predicting dangerousness may be countered not only as erroneous . . . but also as generally so unreliable that it should be ignored.\"\n\nTo the degree that the prosecutor committed the \"I believe\" sin, it was clearly harmless error. This was not a case of a prosecutor vouching for some government agent or secret informant's credibility, but, rather, of a prosecutor commenting on the testimony of experts in a field in which the jury knew the prosecutor had no special expertise. In light of the jury's extensive opportunity to see Gall in action, the jury was in a far better position than is usual in a case involving an insanity defense to weigh the testimony of the experts in the context of all the other relevant facts. Although the prosecutor arguably erred when he urged the jury to not let Gall return to society, the jury was already aware that a verdict of not guilty by reason of insanity would have its consequences. Furthermore, the prosecutor did not overstate the consequences. As I pointed out earlier, in any post-trial civil commitment proceeding the test is not whether the defendant was insane when he committed the crime, but whether he is insane now. As the Kentucky Supreme Court stated in Gall's appeal: \"it cannot be truthfully said that he will be committed, because if he is sane enough to be participating in the trial there is very little likelihood of his being validly found insane immediately thereafter.\" Gall, 607 S.W.2d at 111 (emphasis in original).\n\nOn direct appeal, the Kentucky Supreme Court thought so little of the allegations of prosecutorial misconduct that it spent little or no time in discussing them. Now, on habeas review, with its narrower scope, the majority finds these unobjected to instances of prosecutorial conduct to be sufficient to require a reversal. This hardly affords the decision of the state court the deference that is due.\n\nIII.\n\nI now turn, to the best of my ability to follow it, to the tortured path followed by the court to reach its conclusion that there was a violation of Gall's Sixth Amendment confrontation rights sufficient to mandate an acquittal. The government presented the testimony of its only mental health professional, Dr. Chutkow, by videotape deposition. We were not told why this was done. It is clear from the record, however, that Gall's counsel informed the court that if the prosecution did not offer Dr. Chutkow's testimony, he would. In any event, the court concludes that any claim of error was procedurally defaulted and that Gall cannot show cause for the default. Nonetheless, the court then goes on to find the circumstances here qualify for the \"fundamental miscarriage of justice\" exception because \"the Confrontation Clause violation clearly stood in the way of an acquittal for reason of insanity.\" This result-oriented conclusion simply won't hold water. Not speaking pejoratively, I use the term \"result-oriented\" because the court had to find a way to keep this defendant in custody after vacating his murder conviction, and this was the vehicle for doing so.\n\nIt was not the strategy of the government to try to find someone who would say that Gall was a perfectly normal human being. The government was content to counter the defense experts with the facts of the case and what the jury would learn for themselves from observing the defendant. Contrary to what the court concludes, the defendant was better off having Dr. Chutkow testify by deposition than in person. His deposition testimony, which was limited to his involvement in the competency phase of the trial, was of little value. So much was this the case that I firmly believe the defense decision not to raise an objection to the videotape deposition was a strategic decision and a good one to boot.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nDr. Chutkow could only have made his testimony more valuable to the government if he had testified in person. As the court points out--ironically it seems to me--Dr.Chutkow's testimony was of little or no value on the issue of insanity. Nonetheless, the court would elevate its significance through the bald and erroneous conclusion that \"Dr. Chutkow provided the only evidence rebutting [the] showing of insanity.\" This statement shows that, once again, the court simply misses the mark. There were no witnesses to the rape and murder or to Gall's claimed amnesia. The jury was free to draw its conclusion on the issue of insanity from (1) its impressions of Gall's demeanor; (2) testimony from lay witnesses about Gall's emotional and mental state near the time of the crime; (3) expert testimony offering post-hoc clinical conclusions as to Gall's general mental and emotional condition; and (4) conflicting opinions as to the genuineness of Gall's amnesia.\n\nGall's claim of amnesia was critical to his insanity defense, and a rational trier of fact need not have credited this claim. A rational trier of fact could have concluded that although Gall was a paranoid schizophrenic, he killed during a period of remission in which he understood the criminality of his actions and was not acting pursuant to an irresistible impulse.\n\nIn sum, it is impossible to conclude that the jury gave undue weight to Dr. Chudkow's testimony since all he said was that Gall was competent to stand trial, and the jury observed that for themselves. As the court concludes, the Confrontation Clause issue has been procedurally defaulted and not only has cause not been shown for the default, but, rather, a good reason why the issue was never raised is apparent. The only \"fundamental miscarriage of justice\" that has occurred is the court's conclusion that despite the jury's verdict to the contrary, Gall must be found not guilty by reason of insanity.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The 1989 deposition elaborated on Dr. Chutkow's testimony in significant detail. Dr. Chutkow concluded that his \"dialogue\" with Gall in April 1978 \"was sufficient for [determining] competency but not for sanity.\" J.A. at 412. First, he described the vast difference between competency and sanity exams, both in the substance of the examinations and in their length and scope, J.A. at 364-385, underscoring the inadequacy of the competency exam he conducted in determining Gall's sanity. (Indeed, he acknowledged that using a competency test to determine sanity \"would not have been proper.\" J.A. at 426). For instance, while he testified that a typical sanity exam takes from six hours to hundreds of hours, J.A. at 375, Dr. Chutkow testified that he examined Gall for only 90 minutes. J.A. at 387; only a fraction of those minutes were spent recounting the events of April 5, which Dr. Chutkow had testified would have been vital to assessing sanity. J.A. at 387-88. Upon reflection, Dr. Chutkow stated that a full sanity examination would have taken him from two to four weeks. J.A. at 400. Further, Dr. Chutkow testified that his conclusions as to Gall's sanity were not based on information (such as prior psychiatric or medical history) that is vital to such assessments, because he never received that information until after the trial was complete. J.A. at 397.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. These standards of review apply because Gall filed his petition for habeas review before April 1996. After that date, the new reviewing standards ushered in by the Antiterrorism and Effective Death Penalty Act, Pub.L. No. 104-132, 110 Stat. 1214 (1996), apply.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The Patterson Court cautioned that \"there are obviously constitutional limits beyond which the States may not go\" in defining the elements of a crime. 432 U.S. at 210. The recent Supreme Court decision in Apprendi demonstrates that in some circumstances, courts should look at factors beyond a state legislature's use of \"labels\" in determining if a given ingredient is a criminal element that implicates Winship and other protections. See 2000 WL 807189, at *7. See also Jones v. United States, 526 U.S. 227, 243 (1999) (noting that \"a State cannot manipulate its way out of Winship\"). This case, however, does not require us to look beyond the Commonwealth's own definition of the elements of murder.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Cases of this type are often complicated by several factors. First, an ingredient can arguably be both an element of a charged crime and of a defense, or the presence of a defense can arguably negate a required element. See, e.g., Rhodes v. Brigano, 91 F.3d 803, 808 (6th Cir. 1996) (stating test that \"[i]f an affirmative defense bears a necessary relationship to an element of the charged offense, the burden of proof of that defense may not be placed on the defendant\") (citation omitted); Thomas v. Arn, 704 F.2d 865, 875 (6th Cir. 1983) (rejecting argument that negating self-defense is a required element under Ohio law). There is also a recent line of cases addressing the complex distinction between a sentencing factor and an element. See Apprendi, 2000 WL 807819; United States v. Jones, 526 U.S. 227 (1999); Almandarez-Torres v. United States, 523 U.S. 224 (1998); McMillan v. Pennsylvania, 477 U.S. 79 (1986). We are not faced with such complexities here because we find that for the years relevant to Gall's crime, trial and appeal, Kentucky law clearly treated the absence of EED as an element under the murder statute.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The court clarified the distinction further, noting that a jury can only convict for murder if it concludes that a defendant \"did not act 'under the influence of extreme emotional disturbance.'\" Id. Conversely, it would be improper to frame the instructions so that a jury is \"required to believe [a defendant] acted 'under the influence of extreme emotional disturbance' . . . to trigger the mitigating element.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Indeed, while the dissent attacks the majority opinion for misreading Kentucky caselaw at the time, it concedes that \"the trial judge . . . proceeded in a manner consistent with what the majority contends was the then-existing law\" when instructing the jury. Post at 124.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. We recognize, of course, that a state's placing the burden on the prosecution to prove a particular circumstance beyond a reasonable doubt does not necessarily render that circumstance an element of the crime. See Engle v. Isaac, 456 U.S. 107, 120-21 (1982); Allen v. Redman, 858 F.2d 1194, 1197-98 (6th Cir. 1988). But in light of the clear decisions from the prior two terms that the absence of EED was an element of murder for which the prosecution bore the burden of proof, the Gall I Court's repeated assertions that the prosecutor must prove absence of EED beyond a reasonable doubt indicated its clear adherence to those holdings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Along these lines, the dissent in Patterson fretted that the majority opinion would allow a legislature to shift the burden of persuasion with respect to any factor in a criminal case, \"so long as it is careful not to mention the nonexistence of that factor in the statutory language that defines the crime. The sole requirement is that any references to the factor be confined to those sections that provide for an affirmative defense.\" 432 U.S. at 223 (Powell, J. dissenting). Kentucky did just the opposite--explicitly mentioning the nonexistence of EED in the statutory language that defines the crime and failing to mention EED as an affirmative defense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Contrary to even the Kentucky Supreme Court's interpretation of its own caselaw, the dissent opines that these decisions did not establish that a showing of severe mental illness sufficed to present evidence of EED. We address this argument infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The dissent argues that the Gall I Court distinguished Ratliff. In fact, it was in the context of a separate challenge by Gall that the Gall I Court distinguished Ratliff. As discussed in n. 18, infra, Gall argued that the trial court erred by not reading the portion of the EED instruction that required the jury to examine EED under a subjective standard--considering the circumstances as the defendant believed them to be. The Court distinguished Ratliff because Ratliff had testified about her perception of the circumstances around her, while Gall had not. Hence, the court concluded, the latter portion of the EED instruction was appropriate to Ratliff's case, but not to Gall's. Contrary to the dissent's implicit suggestion, the court did not indicate that Ratliff was distinguishable from Gall because Ratliff involved \"initiating circumstnaces\" that Gall had not shown, and that Gall had therefore failed to provide evidence of EED.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. While they use this evidence to state that there was a genuine issue before the jury on Gall's sanity, neither the district court nor the Commonwealth (in its brief) points to this evidence to rebut Gall's argument that no evidence was presented rebutting his showing that he suffered from EED at the time of the killing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Most recently, in Coffey v. Messer, 945 S.W.2d 944, 945-46 (Ky. 1997), the court explained that although it has \"occasionally described EED as a mitigating circumstance, e.g., Gall I, 607 S.W.2d at 108 . . . it is, in fact, a defense to the extent that its presence precludes a conviction of murder.\" The Coffey court further explained that \"once evidence of EED is introduced, the absence thereof becomes an element of the offense of murder.\" Id. at 946.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The dissent explains that a predicate provocation encompasses \"something either done by the victim or inherent in the circumstances surrounding the murder that would arouse extreme emotional disturbance.\" Post at 124.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The Commentary accompanying the introduction of the new provision into Kentucky law stated that the EED provision abandons the common law requirement \"that the killing occur in 'sudden heat if passion' upon 'adequate provocation.'\" Ky. St. § 507.030. comm. EED \"is not restricted to circumstances which would constitute provocation 'in the ordinary meaning of the term, ie. an injury, injustice or affront perpetrated by the deceased upon the actor.'\" Id. (quoting Model Penal Code, § 201.3). \"In other words, it is possible for any event, even words, to arouse extreme mental or emotional disturbance, as that phrase is used here.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The only act that Ratliff claimed the victim committed was that she \"looked at me as if she was going to pull my hair.\" Id. at 309.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The dissent points out that the disagreement between the majority and dissent in Ratliff did not involve whether EED was an element of the crime of murder. We agree. The majority plainly stated that the absence of EED was an element of murder, and the dissent did not disagree with this point.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. This quote shows that the dissent is in error when stating that the Gall I Court concluded that there was \"no evidence\" of EED, and that we owe that factual finding great deference. Post at 120. The Kentucky Supreme Court actually stated that there was no evidence of EED \"except for\" the evidence of mental illness, making clear--consistent with Ratliff and Edmonds--that such evidence was evidence of EED. Rather than stating that Gall had failed to present any evidence, the Gall I Court instead concluded that the burden had never shifted onto the prosecution because Gall had not presented evidence of such probative force that he was entitled to acquittal as a matter of law. Because this burden-shifting was unconstitutional under Mullaney, we owe this finding no deference.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Gall has separately challenged this instruction as a violation of due process. Like the Kentucky Supreme Court, we find that the instruction was proper in light of the factual circumstances of the crime, and did not \"by itself so infect the entire trial that the resulting conviction violates due process.\" Cupp v. Naughten, 414 U.S. 141, 146 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Gall also argues that the decision in Gall I violated Bouie v. Columbia, 378 U.S. 347 (1964) by retroactively applying new legal standards against him. Because we have found that the decision violated due process by contravening Mullaney, we need not address Gall's Bouie argument.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The dissent misinterprets our opinion as holding that \"Gall was insane when the crime was committed 22 years ago.\" We in fact do not address this issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Gall presents a dubious argument when he asserts that § 500.070(3) \"says that insanity remains an 'element.'\" Gall's Br.(II) at 119. The cited provision discusses \"element[s] of the case\" which defendants have to prove, one of which is insanity. Ky. Rev. Stat. Ann. § 500.070(3) (emphasis added). This is clearly not a suggestion that insanity or other defenses are elements of the offense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Examples Gall mentions include: failing to ask Dr. Chutkow to conduct a sanity exam on Gall and to provide him with the full information he needed to make such a determination; an inappropriate cross-examination of Dr. Noelker and improper closing argument; and informing the jurors that Gall would go free if found not guilty for reason of insanity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. We cannot accept the dissent's reasoning that these egregious comments were harmless because a jury would appreciate that a prosecutor had no special expertise in the field of mental illness. This reasoning not only would create a new and unjustifiable exception to what is otherwise clear misconduct, but it completely misunderstands the impropriety here. The prosecutor not only expressed his personal opinion casting doubt on the expert testimony, but he went so far as to assert that he had personal knowledge of the key expert witness in Gall's favor, and that based on his personal knowledge, the jury should doubt that expert's testimony. In other words, the prosecutor not only offered his opinion improperly, he bolstered that opinion by explicitly referring to his knowledge of the witness's character and motivations. This is precisely what the Young Court warned against when it cautioned that a prosecutor's expressing his personal beliefs suggests to the jury \"that evidence not presented to the jury, but known to the prosecutor, supports the charges against the defendant,\" and may therefore \"induce the jury to trust the Government's judgment rather than its own view of the evidence.\" 470 U.S. at 18. Moreover, as explained infra, the gist of the prosecutor's argument was not that the jury should believe that he had special expertise regarding mental illness, but the inverse: that the jury should feel free not to take the medical/scientific evidence of insanity seriously because an insanity defense was simply an act of desperation by a guilty defendant. As he summarized, \"When it is that bad folks, it is all over.\" J.A. at 1579-80. In short, he was calling on the jury to heed his expertise as a government prosecutor and simply dismiss the insanity defense out of hand.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Indeed, as discussed infra, no one examined Gall's mental condition on behalf of the Commonwealth to determine if he was sane on the day of the crime. Dr. Chutkow only examined Gall to see if he was competent to stand trial. This perhaps explains the prosecutor's need to resort to improper tactics in attacking Gall's insanity defense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Reversing a conviction where a witness's testimony was unnecessarily presented to the jury through a videotaped deposition rather than live testimony, this Court in Stoner emphasized that \"the deposition is a weak substitute for live testimony, a substitute that the Sixth Amendment does not countenance on a routine basis.\" Id. at 213. Despite the possible efficiencies of taped depositions, \"[t]he Constitution does not allow us to so water down the explicit requirement of live testimony in criminal cases,\" 997 F.2d at 213: A prosecutor will often prefer to offer deposition testimony because the witness need not be secured for trial and need not be subject to the vicissitudes of cross examination before the jury. . . . [T]he jury and the judge never actually see the witness. The witness is not confronted in the courtroom situation. The immediacy of a living person is lost. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Dr. Chutkow's habeas deposition and a series of letters between the prosecution and Drs. Noelker and Chutkow illustrate how events unfolded such that Dr. Chutkow was the Commonwealth's sole witness as to Gall's mental state even though he had never actually examined Gall's sanity. On May 4, 1978, Dr. Chutkow wrote the prosecution that after a 90-minute examination, he had concluded that Gall was competent for trial. J.A. at 1535-36. Dr. Chutkow again wrote the prosecution on May 5, explaining that Gall had refused to undergo a narcoanalytic examination, but concluding that he was still competent. J.A. at 1537. Dr. Chutkow made no mention in either letter as to whether Gall was legally sane or insane at the time of the crime. As he later testified, this was because the examination he conducted had only sought to determine Gall's competency. J.A. at 398. On June 8, a Commonwealth prosecutor wrote to both Drs. Noelker and Chutkow, asking whether, in light of Gall's claimed amnesia, either doctor could testify as to Gall's mental state at the time of the crime. \"I need the benefit of your expert advice in this regard . . . .\" J.A. at 1538. Both doctors responded to this request. Without further examining Gall, Dr. Chutkow wrote on June 12 that because Gall could not report his memory, \"I cannot acquire the most direct information about his mental state.\" J.A. at 1539. Nevertheless, he opined that he did not believe that he suffered from acute paranoid schizophrenia, and also suspected that the claimed amnesia was either a way to repress painful memories or a fabrication. As he later testified, he made no statement regarding Gall's sanity, and was not prepared to do so. J.A. at 403. He also had received no additional information between the time of his initial letters and the June 12 letter that would have assisted him in making a sanity determination, and never examined Gall after the initial competency examination. J.A. at 405. Responding to the prosecution's June 8 letter, Dr. Noelker emphasized that given the claimed amnesia and Gall's complicated profile, he had not yet reached a conclusion as to Gall's mental state, and that assessing his sanity would be difficult. He explained, however, that by using various sources of information and by examining Gall further, he would be able to provide an opinion on Gall's mental state by the time of the trial. After seeing Gall on 10 occasions and reviewing his previous mental history and hospitalization records, Dr. Noelker wrote to the court on September 19. He explained his belief that Gall was legally insane on the morning of April 5, and that his behavior that morning was \"primarily controlled\" by a \"highly psychotic\" act that was likely the end-product of a chronic and severe psychopathological disorder. J.A. at 1545. He further suggested that Gall never be considered for release to the open community. One day later, the Commonwealth prosecutor forwarded Dr. Noelker's letter to Dr. Chutkow, explaining that the conclusions therein \"makes it absolutely essential that we use you as a witness during the course of this trial to rebut his anticipated testimony.\" J.A. at 1546. Dr. Chutkow, despite receiving the letter, testified that he did not respond to the letter, did not meet with prosecutors to discuss the trial or Gall's mental status, and did not seek out or receive additional information on Gall's psychiatric history that was described in Dr. Noelker's report and that would have been necessary to draw conclusions as to Gall's sanity. J.A. at 407-10. Nonetheless, he was soon thereafter deposed on videotape, and that testimony was played at trial for the jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Gall also claims that his sentencers-both the jury and trial judge--violated his Eighth and Fourteenth Amendment rights under Lockett because they did not adequately consider evidence presented in mitigation of his crime. Specifically, Gall argues that there was \"massive evidence\" supporting the insanity defense and other evidence of mental illness, in the form of Dr. Noelker's and Dr. Toppen's testimony, as well as extensive testimony of Gall's personal and medical history. We need not address this evidentiary challenge to the sentencing decision because we find that the court's instructions to the jury were constitutionally flawed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. The Gall I Court said the following: In its instructions the trial court confined the consideration of aggravating circumstances to whether the murder was committed in the course of rape, but allowed the jury to consider four specific mitigating circumstances for which there was some semblance of evidentiary basis and a fifth or catch-all category, \"whether or not there are other mitigating circumstances presented through the evidence, not listed above.\" The instructions made it clear that the jury could not recommend the death penalty unless by unanimous verdict it found beyond a reasonable doubt that the aggravating circumstance existed, but that even in that event, and even though it might believe the aggravating circumstance outweighed such mitigating circumstances it might find to exist, it still did not have to recommend the death penalty. 607 S.W.2d at 112.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The Court elaborated that the scheme, as reasonably interpreted, would have allowed the following \"disturbing\" hypothetical: \"[a]ll 12 jurors might agree that some mitigating circumstances were present, and even that those mitigating circumstances were significant enough to outweigh any aggravating circumstance found to exist. But unless all 12 could agree that the same mitigating circumstance was present, they would never be permitted to engage in the weighing process or any deliberation on the appropriateness of the death penalty.\" Id. at 374.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The third and fourth sentences of Instruction V are far less \"open-ended\" than the Commonwealth suggests. Both sentences must be read in light of the combination of Instruction I--that \"[y]ou will deliberate and determine whether any mitigating or aggravating circumstances, as are hereinafter defined, exist\"--Instruction II--describing the aggravating and mitigating circumstances the jury \"may\" consider--and the second sentence of Instruction V--that \"You shall not recommend the death penalty unless you believe the weight of the aggravating circumstances, if any, exceeds the weight of the mitigating circumstances, if any.\" J.A. at 1624. Within this framework, the third sentence of Instruction V merely clarifies that \"[e]ven though you may find an aggravating circumstance, you do not have to recommend the death penalty,\" J.A. at 1624. That is true because if the jury would find one aggravating circumstance, but that that circumstance was outweighed by mitigating circumstances, a death sentence would not be warranted under the second sentence of Instruction V. Similarly, the trial court instructed that \"[e]ven though you may believe any aggravating circumstance outweighs any mitigating circumstance you do not have to recommend the death penalty.\" J.A. at 1624 (emphasis added). Once again, this clarifies that if any individual aggravating circumstance outweighs any individual mitigating circumstance, a penalty of death is not required. Neither sentence instructs the jury to turn away from its central task, outlined in Instructions I, II and V: determining the relative weight of the aggravating and mitigating circumstances it finds.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Although not a model of clarity, we find that Instruction V could be reasonably read as a two-way command: a command to the jury of what it shall not do (ie. render a death sentence when mitigating circumstances outweigh aggravating circumstances), and a simultaneous command that it shall recommend death on the condition that aggravating circumstances outweigh the mitigating circumstances. See Webster's New Collegiate Dictionary (1979) (defining \"unless\" as \"except under the condition that\" or \"under any other circumstance than\"). This interpretation would also make most sense of the language \"you do not have to\" in the third and fourth sentences of Instruction V. If the second sentence of Instruction V did not provide a command as to what the jury was required to do, there would be no reason to assure the jury of what it did not have to do.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Gall argues that because there is no clear showing that the trial court was applying the Witherspoon standards, and because the trial court made no written findings regarding Correll--and merely said \"sustained\" in response to the prosecution's strike for cause--the deferential standard should not be applied. We conclude that the presumption of correctness applies in this case. The trial judge did nothing less here than the Court required in Witt, which also rejected a defendant's argument that the trial judge's conclusion merited no deference since it was not \"evidenced by a written finding, written opinion, or other reliable and adequate written indicia.\" 469 U.S. at 430. There, the Witt Court stated: The transcript of the voir dire reprinted above shows that juror Colby was questioned in the presence of both counsel and the judge; at the end of the colloquy the prosecution challenged for cause; and the challenge was sustained when the judge asked juror Colby to \"step down.\" Nothing more was required under the circumstances to satisfy the [habeas] statute. Id. at 430.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Once again, a habeas court can only review claims that allege a violation of federal law. See Phillips, 455 U.S. at 221. Thus, Gall's argument that Kentucky law prohibits a jury from considering parole is not cognizable on habeas review. The Commonwealth also correctly points out that considering the potential for parole or a defendant's \"return to society\" does not violate constitutional norms. See, e.g., Simmons v. South Carolina, 512 U.S. 154, 163 (1994)(concluding that \"it is entirely reasonable for a sentencing jury to view a defendant who is eligible for parole as a greater threat to society than a defendant who is not\"); California v. Ramos, 463 U.S. 992 (1993) (upholding a judicial instruction regarding a governor's power to commute a life sentence); see also Romano v. Oklahoma, 512 U.S. 1, 12 (1994) (stating that the \"Eighth Amendment does not establish a federal code of evidence to supersede state evidentiary rules\"). Thus, neither of these arguments alone merits habeas review.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. If we believed that there was even a minimally plausible argument that double jeopardy did not apply here, we would certainly provide the Commonwealth an opportunity to make that case, as the dissent suggests. But Burks makes it clear beyond doubt that double jeopardy does apply in this instance.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Although Kentucky now provides that a jury may find a defendant guilty but mentally ill, this verdict was not an option for juries when Gall was tried.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. This section reads: 504.030 Disposition of person found not guilty by reason of insanity (1)When a defendant is found not guilty by reason of insanity, the court shall conduct an involuntary hospitalization proceeding under KRS Chapter 202A or 202B. (2)To facilitate the procedure established in subsection (1) of this section, the court may order the detention of the defendant for a period of ten (10) days to allow for proceedings to be initiated against the defendant for examination and possible detention pursuant to the provisions of KRS Chapter 202A or 202B. Ky. Rev. Stat. Ann. § 504.030.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. In overturning the defendant's conviction, the court makes the penalty phase of the trial moot. Since the court has addressed this issue, however, I would indicate my concurrence in the result reached on the penalty issue without subscribing to all of the analysis used by the court to reach its result.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. This conclusion is also the lynchpin of the court's double jeopardy analysis. Thus, if this conclusion is wrong, the double jeopardy analysis is also wrong, and retrial would not be barred.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. By \"provocation\" I do not mean to imply that the victim has to have done something to provoke the defendant. Although such might be the case as in the classic shooting of a spouse found in bed with another, the term, in this context, would include such claims by a defendant as \"God told me to shoot this person.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. Even if one were to assume that both Ratliff and Edmonds somehow presented a different view of the Kentucky murder statute than the view expressed in Gall, they would provide no support for the majority's conclusion that the decision in Gall, as it related to the extreme emotional disturbance defense, resulted in an ex post facto violation since both cases were decided after the date of Gall's offense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Gall has an I.Q. of 124.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Significantly, the court rejects Gall's claim of ineffective assistance of counsel.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. After I circulated my dissent the majority made revisions primarily aimed at responding to my dissent. After carefully reviewing the revisions, I have concluded no further modification of my dissent is necessary. I have clearly set forth the basis of my disagreement with the court's analysis and to write further would serve no useful purpose.\u003c/span\u003e\n\n",
    "body_length": 274882,
    "citedas": [
      "231 F.3d 265",
      "2000 Fed.App. 0379",
      "2000 Fed.App. 0379"
    ],
    "attorneys": "CounselArgued: Erwin W. Lewis, Edward C. Monahan, Department OF Public Advocacy, Frankfort, Kentucky, forAppellant. Rickie L. Pearson, Assistant Attorney General, Frankfort, Kentucky, for Appellee.ON Brief:Erwin W. Lewis, Edward C. Monahan, Department OF Public Advocacy, Frankfort, Kentucky, for Appellant.Rickie L. Pearson, Ian G. Sonego, Assistant Attorney General, Frankfort, Kentucky, for Appellee.",
    "category": [
      "36",
      "78",
      "75"
    ],
    "judges": "Before: Martin, Chief Judge; Jones and Guy, Circuit Judges.",
    "citation_count": 260
  }
}
