{
  "id": "bYH6PWYBTlTomsSBCofm",
  "document": {
    "title": "Riley v. Taylor",
    "full_title": "JAMES WILLIAM RILEY v. STANLEY W. TAYLOR; M. JANE BRADY",
    "jurisdiction": "Third Circuit",
    "date": "2001-01-17T00:00:00.000Z",
    "docket": "No. 98-9009",
    "body": "Opinion vacated January 25, 2002.\n\n(Pursuant to Rule 43(c), F.R.A.P.)\n\nArgued: November 29, 1999\n\nOPINION OF THE COURT\n\nThis is an appeal from the denial of a petition for a writ of habeas corpus in a capital case. We affirm.\n\nI.\n\nIn May 1982, James W. Riley and two co-defendants, Tyrone Baxter and Michael Williams, were indicted in Delaware for felony murder, intentional murder, and lesser offenses stemming from the robbery of a liquor store and the fatal shooting of the owner in February 1982. Riley pleaded not guilty to all of the charges and was tried by jury in Kent County Superior Court in December 1982. He was represented by appointed counsel.\n\nAt trial, Riley's co-defendants testified as follows for the prosecution. On the afternoon of the shooting, Williams agreed to give Riley and Baxter a ride to the bus station, but on the way, he stopped, at their request at a store called Sandbar Liquors, because Riley and Baxter wanted to get some beer and rob the store. Williams parked near the liquor store and waited in the car, while Riley and Baxter walked to the store. Armed with a gun, Riley placed a quart bottle of beer on the counter and announced that the store was being robbed. When the store owner, James Feeley, backed away from the cash register , Baxter grabbed the money out of the cash drawer. Riley tried to take Feeley's wallet, but Feeley resisted. At Baxter's urging, Riley shot Feeley in the leg. As Riley and Baxter were leaving, Feeley threw a wine bottle that struck Riley in the arm. Riley then shot Feeley in the chest, killing him. In addition to this testimony, the prosecution introduced evidence that Riley's fingerprints were found on the bottle of beer that had been placed on the counter.\n\nRiley took the stand in his own defense and testified that he was in Philadelphia with his mother celebrating her birthday when the robbery occurred. Although Riley's mother was present in court at the beginning of the trial, she did not testify, and no other alibi witnesses were presented. However, Gary Momenko, an inmate at the Delaware Correctional Center, testified that Baxter had admitted that he, rather than Riley, had fired the shot that killed Feeley.\n\nThe jury returned a verdict of guilty on all five counts. The state sought the death penalty on the felony mur der conviction, and four days later, the penalty phase of the trial was held. The jury unanimously recommended a sentence of death, and based on this recommendation, the trial court sentenced Riley to death. After Riley was sentenced on the remaining counts for which he had been convicted, he appealed.\n\nOn direct appeal, Riley continued to be r epresented by his trial counsel. In addition, the American Civil Liberties Union of Delaware, Inc., participated in the appeal by filing an amicus curiae brief and by assisting trial counsel.\n\nIn July 1985, the Delaware Supreme Court affirmed Riley's conviction and death sentence. Riley v. State, 496 A.2d 997 (Del. 1985) (\"Riley I \"). The Supr eme Court of the United States denied certiorari. Riley v. Delaware, 478 U.S. 1022 (1986).\n\nRepresented by new counsel, Riley filed a motion for post-conviction relief in Kent County Superior Court in March 1987. The court conducted three separate hearings on the issue of ineffective assistance of counsel, but ultimately the court denied Riley's motion. State v. Riley, 1988 WL 47076 (Del. Super. 1988) (\"Riley II\").\n\nIn May 1988, Riley moved for reargument and appealed to the Delaware Supreme Court. Shortly thereafter, he filed a motion to stay briefing his appeal and to r emand his case to the Superior Court to consider his motion for reargument. The Delaware Supr eme Court granted that motion.\n\nOn remand, the Superior Court granted r eargument in order to consider Riley's claim that the pr osecution had exercised its peremptory challenges in a racially discriminatory manner in violation of Batson v. Kentucky, 476 U.S. 79 (1986). State v. Riley, 1988 WL 130430 (Del. Super. 1988) (\"Riley III\"). Following an evidentiary hearing, the Superior Court rejected all of Riley's claims, including his Batson claim. Riley v. State, Del. Sup. Ct. No. 200, 1988, Status Report of the Trial Court (April 21, 1989) (\"Riley IV\"). On appeal, the Delaware Supreme Court affirmed, and the United States Supr eme Court again denied certiorari. Riley v. State, 585 A.2d 719 (Del. 1990) (\"Riley V\"), cert. denied, 501 U.S. 1223 (1991).\n\nIn August 1991, Riley filed a petition for a writ of habeas corpus in the United States District Court for the District of Delaware pursuant to 28 U.S.C. S 2254 (1988 \u0026 Supp. 1990) (amended 1996). The District Court granted Riley's motion to substitute attorneys from the law firm of Skadden Arps Slate Meagher \u0026 Flom as new lead counsel and to allow his post-conviction counsel to continue as co-counsel. However, the Court denied new counsel's request to file an amended petition. The Court then issued an opinion and final order denying the petition for a writ of habeas corpus. Riley v. Snyder, 840 F . Supp. 1012 (D. Del. 1993). Riley appealed.\n\nA panel of our court reversed the order denying Riley's motion for leave to amend his petition and r emanded the case for further proceedings. Riley v. T aylor, 62 F.3d 86 (3d Cir.1995).\n\nOn remand, Riley filed a lengthy amended petition in August 1995, and the state filed an answer . In his amended petition, Riley raised 12 grounds for r elief. In a comprehensive opinion, the District Court discussed and rejected all of these claims. Riley v. T aylor, Civ. Act. No. 91-438-JJF, 1998 WL 172856 (D. Del. Jan. 16, 1998). We granted a certificate of probable cause, and Riley then took this appeal.\n\nII.\n\nRiley, an African American, first contends that the prosecution violated Batson v. Kentucky, supra, by using peremptory challenges to strike three African Americans from the jury panel because of their race. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e As a result of these strikes, no African Americans sat on the jury.\n\nA.\n\nBefore reaching the merits of Riley's Batson claim, we must consider whether, as the District Court held and the state maintains, this claim is procedurally barred. This issue requires us to review the history of the litigation of this issue in the state courts.\n\n1.\n\nOn the eve of trial, Riley's attorney moved for disqualification of the jury panel. He \"did not attack the original array or venire,\" which was 16% black, but he \"claimed that the panel had later become racially disproportionate because the Court excused from service a substantial number of the prospective jur ors.\" Riley I, 496 A.2d at 1007. \"The thrust of [his] objection was that through judicial excusal of jurors for personal reasons, the remaining blacks had been reduced to an unacceptable number amounting to about 9% of the remaining venire.\" Id. However, Riley's attorney \"did not charge, or even imply, that the Trial Judge had excused jurors on racial grounds.\" Id. Riley's motion to disqualify the entir e panel was denied, and a jury was selected. Id. \"At no time did defendant challenge the State's use of its peremptory challenges or even imply that the State was exercising its challenge rights on racial grounds.\" Id. at 1010. After jury selection was completed, Riley's attorney raised what he characterized as \"something of a renewal of an earlier motion\" and again moved to dismiss the entire jury, arguing that it was not \"representative of the community and could not give a fair and impartial trial.\" Id. This motion was denied as well. Id.\n\nOn appeal to the Delaware Supreme Court, Riley argued that the prosecution had exercised thr ee of its peremptory challenges on racial grounds. Riley I, 496 A.2d at 1009. Addressing this argument, the Delawar e Supreme Court held:\n\nWe reject such contention for two r easons, each related to the inadequacy of the record to support the claim. We conclude (1) that no Sixth Amendment per emptory challenge claim was fairly presented to the T rial Court; but (2) even assuming the contrary, defendant failed to meet his burden of establishing a prima facie claim that the State exercised its peremptory challenges on racial grounds. Id. at 1010.\n\nWith respect to the merits of Riley's ar gument, the Court held for the first time that racially based per emptories violated state law, and the Court devised a pr ocedure much like that later adopted in Batson for dealing with objections to peremptories. Id. at 1010-13. Under this procedure, a defendant who wished to contest a peremptory strike was required to make out a prima facie case that the strike was based on race. Id. at 1013. The court held, however, that Riley had \"failed to make the requir ed prima facie showing.\" Id. at 1011.\n\nThe Delaware Supreme Court's decision on direct appeal did not mark the end of Riley's peremptory challenge claim in the state courts. When the Supreme Court decided Batson, Riley again raised the issue of racially based peremptories in his motion for post-conviction relief, but in a decision issued in April 1988, the trial judge r ejected this claim, along with all of Riley's other claims for post-conviction relief. Riley II, 1988 WL 47076, at *1. Reiterating the holding of the state supreme court, the trial judge wrote: \"Because the asserted violation was not argued and evidence of such violation was not offer ed at the trial level, the defendant's contention is without merit.\" Id.\n\nRiley appealed the denial of post-conviction r elief to the Delaware Supreme Court and then successfully moved that court to remand the case for re-ar gument before the Superior Court. On remand, Riley presented his peremptory challenge argument to a new judge, Judge Steele, who took a different view of the issue. After noting the state supreme court's holding on direct appeal that Riley had not adequately raised the issue at trial, Judge Steele stated that he did not think that the state supreme court would reach the same decision in light of its later decision in Baynard v. State, 518 A.2d 682 (Del. 1986), in which the state supreme court had held that the defendant had made out a prima facie case. See Riley III, 1988 WL 47076, at *2. Judge Steele wrote that the defendant in Baynard had \"objected to the exercise of each per emptory challenge against a black juror, noted the jur or's race for the record, moved the Court to refuse the challenges against two and moved to quash the entire panel.\" Id. Judge Steele then held that Riley's attorney had adequately raised an objection at trial and had made out a prima facie case. Id. at *3. Judge Steele therefore held that a hearing was needed for the purpose of determining the actual bases for the contested peremptories. After conducting such a hearing, Judge Steele found that the state had not exercised its peremptories based on race, and he denied Riley's Batson claim. Riley V. The Delaware Supreme Court affirmed that decision. See Riley V, 585 A.2d at 725.\n\n2.\n\nWhen a state court rejects a criminal defe ndant's federal constitutional claim because the defendant did not raise the claim in accordance with an independent and adequate state procedural rule, a federal habeas court may not entertain the constitutional claim on the merits unless the habeas petitioner can show either (a) that ther e was \"cause\" for the procedural default and that it resulted in \"prejudice\" or (b) that the failur e to entertain the claim would produce a \"fundamental miscarriage of justice.\" Coleman v. Thompson, 501 U.S. 722, 750 (1991). Here, as noted, one of the two alternative grounds given by the Delaware Supreme Court on direct appeal for rejecting Riley's claim that the prosecution had exer cised its peremptory challenges in a racially discriminatory manner was that Riley had not raised any such objection at trial. If the Delaware courts had adhered to this position, Riley's Batson claim would almost certainly be pr ocedurally barred. See Riley VI, 1998 WL 172856, at *14.\n\n\"State procedural bars are not immortal, however; they may expire because of later actions by state courts. If the last state court to be presented with a particular federal claim reaches the merits, it removes any bar to federal-court review that might otherwise have been available.\" Ylst v. Nunnemaker, 501 U.S. 797, 801 (1991). Unfortunately, \"[i]t is not always easy for a federal court to apply the independent and adequate state ground doctrine,\" Coleman, 501 U.S. at 732, and this is such a case. While it is perfectly clear that Judge Steele rejected Riley's Batson claim on the merits, the decision of the Delawar e Supreme Court affirming Judge Steele's decision is less clear. The Delaware Supreme Court's discussion of the Batson issue in its entirety is as follows:\n\nRiley's next contention, that the State exer cised its peremptory challenges for racial reasons, we find to be simply a renewed attempt to reopen pr eviously settled issues. In Riley I, we set forth a legal analysis functionally identical to the Supreme Court's analysis later articulated in Batson. 476 U.S. at 79, 106 S.Ct. at 1712, 90 L.Ed.2d at 69. In Riley I we found that Riley's constitutional right to an impartial jury had not been violated. 496 A.2d at 1009. The Superior Court, after an evidentiary hearing on Riley's motion for post-conviction relief, held that Riley had not been denied equal protection as a result of the State's use of peremptory challenges. The court found that the State had provided race-neutral explanations for its peremptory challenges. We find no err or in Superior Court's rejection of Riley's Batson claim. See Holland v. Illinois, 493 U.S. 474, 110 S.Ct. 803, 807, 107 L.Ed.2d 905, 916 (1990) (the Sixth Amendment fair cr oss- section requirement of an impartial jury does not deprive a party of the right to exercise per emptory challenges on racial or any other grounds fr om a venire that otherwise meets Sixth Amendment cross-sectional standards of representativeness). Mor eover, we reaffirm our earlier decision sustaining the State's per emptory challenges on state constitutional grounds. Riley I, 496 A.2d at 1010-1013. Riley V, 585 A.2d at 725.\n\nRiley interprets this passage as rejecting his claim on the merits, as Judge Steele had done. By contrast, the District Court held and the state now maintains, that the state supreme court reaffirmed its prior decision on direct appeal. Because one of the two alternative gr ounds for this former decision was procedural default, the District Court and the state interpret the state supreme court's later decision as reaffirming procedural default as a separate basis for its decision.\n\nWe do not interpret the most recent decision of the Delaware Supreme Court as reaffir ming its prior holding of procedural default; instead, we interpr et it as rejecting Riley's claim on the merits. In the passage set out above, the court refers expressly to its holding on the merits of Riley's Batson claim and to the Superior Court's rejection of that claim on the merits. Moreover, in the final sentence of the passage, the court expressly reaffir ms its holding on direct appeal that the prosecution's use of peremptory challenges in this case did not violate the state constitution. The absence of any express r eference to the court's prior holding concerning procedural default, much less a specific reaffirmation of that holding, is suggestive.\n\nThe only part of the passage that might be viewed as reaffirming the prior holding r egarding procedural default is the first sentence. But this sentence merely describes Riley's Batson argument as \"a r enewed attempt to reopen previously settled issues.\" Riley V, 585 A.2d at 725. To say that the Batson issue was \"previously settled\" is quite different from saying that each of the two grounds for the previous decision is reaffirmed. Finally, if the state supreme court continued to believe at the time of its most r ecent decision that Riley's Batson claim was for eclosed for failure to make a proper objection at the time of trial, it seems likely that the court would have made that point expressly and would not have relied on Judge Steele'sfindings. After all, if the holding on direct appeal remained operative, Judge Steele erred in refusing to follow that decision, and holding an evidentiary hearing.\n\nWe view this case as similar to Harris v. Reed, 489 U.S. 255 (1989). There, a state appellate court noted a rule of state law under which issues that could have been, but were not, raised on direct appeal wer e considered waived. See id. at 258. The state court also observed that certain issues could have been raised on direct appeal, but the court did not expressly state that it found the issues to have been waived, and it went on to reject them on the merits. Id. The United States Supreme Court interpreted the state court decision as one that appeared to rest primarily on federal law and thus presumed that there was no independent and adequate state ground for the decision. Id. at 261-63. See also Coleman, 501 U.S. at 734-40. We interpret the most recent decision of the Delaware Supreme Court in the same way and therefore view it as rejecting Riley's Batson claim on the merits. W e will therefore proceed to examine the merits of Riley's Batson argument.\n\nB.\n\n1.\n\nIn Batson, the Supreme Court held that it is a violation of the Equal Protection Clause for a prosecutor to strike a juror because of race. In order to raise a Batson claim, a defendant must attempt to make out a prima facie case. 476 U.S. at 96-97. If the defendant does so, the prosecutor must offer a race-neutral r eason for the strike, and the trial judge must make a factual finding on the question whether the strike was based on race. Id. at 97-98.\n\nIn this case, the Superior Court found that Riley had made out a prima facie case. See Riley IV at *2, and the state does not dispute this point. The state of fered race-neutral justifications for his strikes, and the state courts accepted those explanations. Id. at 3-6; Riley V, 585 A.2d at 725. Riley contends, however, that the state courts erred in finding that the strikes in question wer e not based on race.\n\nUnder the version of the federal habeas statute that applies in this case, 28 U.S.C. S 2254(d) (1988 \u0026 Supp. 1990) (amended 1996),\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e the state courts' findings must be presumed to be correct unless one of eight exceptions was shown. Riley relies on two of these exceptions. He maintains that the presumption of correctness does not apply because he \"did not receive a full, fair, and adequate hearing in the State court proceeding,\" and because the state court's \"factual determination is not fairly supported by the record as a whole.\" 28 U.S.C.S 2254(d)(6)(8)(1988 \u0026 Supp. 1990).\n\n2.\n\nRiley contends that he did not receive\"a full, fair, and adequate hearing in the State Court proceeding\" because the state courts misinterpreted the federal constitutional standard. He points to Judge Steele's statement in Riley IV that the state was required to show that its peremptories were not based \"solely on the ground of the jurors' race.\" Riley IV at 3. Riley argues that corr ect standard was set out in Jones v. Ryan, 987 F.2d 960 (3d Cir. 1993), where we said that \"a violation of the Batson rule occurs when race is used as a factor in the exercise of a peremptory challenge.\" Id. at 972 (emphasis added).\n\nWe reject this argument. When Judge Steele made the statement that Riley attacks, he was simply pr oviding a general description of the holding in Batson. He was not addressing the complicated issue of the pr ecise standard of causation that applies when a party contends that a peremptory challenge was based on an imper missible factor, e.g., whether a constitutional violation demands a finding that the impermissible factor was a motivating factor, a determinative factor, or the sole factor in the decision to exercise the strike. The language to which Riley objects is virtually identical to language in Batson itself, where the Supreme Court said that \"the Equal Protection Clause forbids the prosecutor to challenge potential jurors solely on account of their race.\" Batson , 476 U.S. at 89 (emphasis added). This language was quoted in Jones, the decision on which Riley relies. Jones, 987 F.2d at 974.\n\nThe statement that the prosecution must pr ove that its peremptories were not based solely on race is literally corrected as far as it goes: whether or not the prosecution must prove more, it most certainly must show that it did not strike potential jurors solely because of their race. Neither Judge Steele's statement nor the Supr eme Court's statement in Batson went on to explain whether the prosecution must show more than this (e.g., that race was not a but-for cause of the strikes), and it is a mistake to interpret them as addressing that question.\n\nIn this case, we need not decide what is the corr ect standard of causation under Batson because, when Judge Steele's discussion of the Batson question is read in its entirety, it is apparent that he found that the real reason for each of the strikes had nothing to do with race. With respect to Charles McGuire, he accepted the state's explanation, which he found to be \"entirely unrelated to race.\" Riley IV at 4-5. With r espect to Ray Nichols and Lois Beecher, he accepted the state's \"race-neutral\" explanations. Id. at 3-5. Thus, whatever the proper standard of causation for a Batson claim,\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e we see no basis for holding that Riley was denied a full, fair , and adequate hearing.\n\n3.\n\nWe turn, therefore, to R iley's argument that the findings of the state courts should not be pr esumed to be correct because they are not \"fairly supported by the record.\" 28 U.S.C. S 2254(d)(8) (1988 \u0026 Supp. 1990). Riley first advances several general reasons for concluding that the state court's findings are not fairly supported by the record. He then offers specific ar guments targeted at the findings regarding each of the potential jurors who was peremptorily challenged. We will begin by considering Riley's general arguments.\n\na.\n\nRiley points to the conduct of the prosecu tor before the 1988 evidentiary hearing as evidence that race played a part in the peremptory challenges. Riley notes that the state offered no race neutral justifications for its strikes at the time of trial or on direct appeal, and he argues that this conduct is evidence that the strikes were racially motivated.\n\nThese arguments have no merit. We see no reasonable basis for drawing any adverse inferences fr om the prosecution's failure to provide explanations for its strikes at the time of trial. At no time during the trial did Riley argue that the prosecution's peremptory challenges were racially motivated. Riley moved to have the entir e jury panel disqualified before any challenges wer e used. Then, after failing to object while the challenges were being exercised, Riley's attorney made a motion that he characterized as \"something of a renewal of [his] earlier motion\" and again requested dismissal of the entire panel. Furthermore, Riley's trial occurred four years befor e Batson was decided and two years before the Delaware Supr eme Court (in Riley's own appeal) adopted a similar rule as a matter of state law. In light of the nature of the motions made by Riley's trial counsel and the status of the law at the time of the trial, no adverse inferences can be drawn from the prosecution's failure to offer explanations for its strikes.\n\nThe same is true with respect to the brief that the state filed in Riley's direct appeal to the state supreme court. Riley makes much of the fact that the state, r elying on Swain v. Alabama, 380 U.S. 202 (1965), ar gued in its brief that the use of individual peremptory challenges to strike potential jurors based on race was not unconstitutional. Riley states:\n\n[I]n its first opportunity to defend in writing its peremptory strikes of Black jurors, the State did not even try to offer any race-neutral basis for its strikes (not even the implausible post hoc rationales it conjured up many years later in the 1989 state court Batson proceedings) -- not even as an alternative factual argument. Instead the State ar gued for 13 pages that there was nothing wrong with using peremptory strikes to exclude Black jur ors on the basis of race-based \"group association\" and\"predisposition.\" . . . . The implication is clear: In the State's 1984 view, \"group association\" was a perfectly appropriate and even desirable basis for peremptory strikes. Appellant's Br. at 23-24 (emphasis in original).\n\nThis argument is not well taken. No adverse inferences can reasonably be drawn from the state's r eliance on the rule of constitutional law accepted in Swain, which was then the governing Supreme Court decision. Nor can any adverse inferences be reasonably drawn fr om the state's failure to offer race-neutral explanations in its appellate brief. The state's brief specifically denied that its peremptories were based on race. See App. 896. Furthermore, since there was no evidence in the record regarding the reasons for the strikes, the state could hardly have expected the state supreme court to base a decision on explanations provided without recor d support in a brief.\n\nRiley contends that statistics concerning the use of peremptory challenges by the Kent County Pr osecutor's office fatally undermine the state court'sfindings with respect to the reasons for the strikes at issue in his case. In his brief, Riley states: \"At the state court Batson hearing,\n\nMr. Riley introduced summary evidence that in four Delaware first degree murder trials occurring in Kent County within one year of Mr. Riley's trial, every prospective Black and minority juror called was per emptorily struck by the prosecution.\" Appellant's Br. at 33. We found this assertion troubling and requested post-ar gument submissions related to it. However, after examination, we do not find the supporting evidence on which Riley relies to be helpful.\n\nThe four first-degree murder trials to which Riley referred were his own and those of Andre Deputy, an African American, and two whites, Daniel Pregent, who was acquitted,\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e and Judith McBride, who was convicted. See Dec. 16, 1999, Letter to Court from Thomas J. Allingham II, Appendix A (hereinafter \"Appendix A\"). W ith respect to these cases, no information has been pr ovided about the racial makeup of the venire, the identities of the prosecutors who participated in jury selection, or peremptories exercised by the defense.\n\nIn the trial of Andre Deputy, the state struck four whites, one African American, and one person listed as \"Indian.\" Appendix A. Deputy argued that the prosecution's peremptory challenge of the African American venireperson violated Batson. See Deputy v. Taylor, 19 F.3d 1485, 1492 (3d Cir. 1994). Deputy's Batson ar gument was rejected in the district court decision denying his petition for a writ of habeas corpus and on appeal. See id. at 1492. Since it has been held that no Batson violation was shown in Deputy, that case hardly supports Riley's argument here.\n\nIn Pregent's case, the state struck four whites and one black. There is nothing before us to indicate that any Batson objection was made, and it is doubtful that the pattern of strikes exercised by the pr osecution sufficed to make out a prima facie case.\n\nThe remaining case is the prosecution of Judith McBride for murdering her husband. See McBride v. State, 477 A.2d 174 (Del. 1984). The state exercised a total of 10 strikes, of which three were against potential jur ors identified as black.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Appendix A. There is nothing to indicate that any Batson objection was made. Without in effect holding a Batson hearing, there is no way of determining whether any prosecution peremptories were based on race.\n\nWe have given careful consideration to the statistics that Riley has presented, but we believe that it would be analytically unsound to give those statistics any weight. The dissent, however, makes much of this data. Indeed, the dissent goes so far as to assert that \"the most plausible . . . inference to be drawn from the data is that the Kent County Prosecutor followed a pattern of using peremptory challenges in a racially discriminatory manner .\" Dissent at 63. This conclusion is completely unwarranted.\n\nAccording to the data supplied to us, the pr osecutors in these cases exercised peremptory challenges against 25 potential jurors identified as white and eight identified as black. Thus, 24% of these peremptories wer e exercised against African Americans. Because we do not know the racial composition of the venires, we cannot even be sure that the number of African Americans peremptorily challenged by the prosecutors was dispr oportionally high.\n\nWe note that, according to the most r ecent census at the time of Riley's trial, the population of Kent County was 18 % black. BUREAU OF THE CENSUS, COUNTY AND CITY DATA BOOK -- 1983 at 74. If the potential jurors peremptorily challenged by the prosecutors had been proportional to the racial makeup of the county, the prosecutors would have stricken six African Americans, rather than eight. Even if it is assumed that the Kent County prosecutors followed the same jury selection strategy in all four cases,\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e the introduction of a single additional variable -- or pure chance -- could easily explain the data. We need not consider what weight should be given to a professional multiple-regression analysis of peremptory challenge statistics in determining whether a Batson violation occurred in a particular case. Cf. McClesky v. Kemp, 481 U.S. 279 (1987)(multiple-regr ession analysis of state's death penalty statistics insufficient to show that particular petitioner suffered discrimination). We are not presented here with anything that even r emotely approaches expert statistical evidence.\n\nCharacterizing Riley's data as merely \"imper fect,\" the dissent argues that an adverse inference should be drawn against the state for failing to come forwar d with additional information. We see no basis for this approach. First, as we have explained, Riley's data did not raise an infer ence of discrimination, and thus additional data wer e not needed to refute Riley's statistical showing. See McClesky, 481 U.S. at 296-97 (\"[A]bsent far stronger pr oof, it is not necessary to seek a rebuttal.\"). Second, the state was never given notice that it had any obligation to provide additional data. As we read the record, the state mer ely asked for the opportunity to provide additional information and then elected not to do so. There are obviously many reasons why the state might have made that choice, and we see no basis for speculating that it did so because any additional information would have been unfavorable to its position. Third and most important, the information that is most critically lacking --the prosecutors' reasons for striking thefive African American venire members in the Deputy, McBride, and Pregent cases -- probably could not be obtained without in effect conducting retrospective Batson hearings in those cases. We know of no precedent for such a practice --holding a Batson hearing regarding peremptory challenges exercised by prosecutors in other cases in which no claim of discrimination may have been made. For all these reasons, we do not find the statistics r egarding peremptory challenges exercised by prosecutors in Kent Count in other cases to be probative.\n\nb.\n\nWe come, now, to Riley's argument that the evidence in the record concerning the thr ee contested peremptories does not fairly support the state court's findings that these strikes were not based on race.\n\nRay Nichols Ray Nichols was the first black juror challenged by the prosecution. The prosecutor testified that he struck Nichols because he was uncertain that Nichols would be able to vote for a death sentence. See App. 797-99. According to the prosecutor's testimony, \"there was a pause and a significant pause in him answering Judge Bush's inquiry and that to me was enough to suggest that he might not be able to return a death penalty and I didn't want anyone that wasn't going to give me a death penalty.\" Id. Having heard the prosecutor's testimony, Judge Steele concluded: \"I find the State provided a cr edible, race-neutral reason for exercising its per emptory challenge after appraising the demeanor and credibility of the juror. The State's exercise of its peremptory challenge was non-discriminatory. I am satisfied that the per emptory challenge was not made on the ground of the juror's race.\" Id. at 889.\n\nRiley suggests that it is not believable that the pr osecutor was able to remember at the time of the evidentiary hearing in 1988 that Nichols had paused while answering a question during voir dire six years earlier . In addition, the dissent contrasts the prosecutor's ability to r emember this pause with his inability to remember another potentially significant aspect of the jury selection pr ocess,\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e and the dissent notes that the prosecutor was a friend and neighbor of the victim. Dissent at 59. These facts wer e highlighted during the cross-examination of the prosecutor at the Batson hearing, see App. at 820-29, and they wer e important factors to be considered in assessing the prosecutor's credibility. Judge Steele was aware of these facts and had the opportunity to observe the pr osecutor testify on the witness stand. Judge Steele found that the prosecutor's testimony was credible.\n\nOur standard of review of Judge Steele'sfinding is narrow. Under 28 U.S.C. S2254(d)(8)(1988 \u0026 Supp. 1990), we must accept any state court factual finding that is \"fairly supported by the record,\" and in this instance, because Judge Steele's finding was based squarely on an assessment of the credibility of a witness who appeared and testified before him, we must exercise special caution.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Under the very limited scope of review af forded by 28 U.S.C. S2254(d)(8)(1988 \u0026 Supp. 1990), we cannot overturn Judge Steele's credibility determination. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nLois Beecher During voir dire, Lois Beecher initially gave an answer that seemed to indicate a willingness to impose the death penalty in an appropriate case.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e When questioned further, however, she said that the questioning was \"making [her] think about it,\" and she ultimately said that she did not believe that she could impose the death penalty. App. 290-92. The state then peremptorily challenged her. See id. at 292. The prosecutor later testified that he struck Beecher because of her unwillingness to impose the death penalty and because she seemed confused during the voir dire. See id. at 803-05. Judge Steele accepted this explanation and found that the strike was not based on race. Riley IV at 5.\n\nRiley argues that the state court finding is not fairly supported by the record because Beecher's initial responses in the colloquy indicated a willingness to impose the death penalty if the evidence warranted. The fact r emains, however, that Beecher ultimately said that she could not vote for a death sentence. In light of that admission, the prosecutor could have reasonably viewed her attitude as troubling. We hold that the state courtfinding is fairly supported by the record.\n\nCharles McGuire Riley's strongest Batson claim concerns the prosecution's strike of Charles McGuir e. At trial, the prosecutor first used a peremptory challenge against McGuire and then immediately made the following application to the trial judge:\n\n[THE PROSECUTOR]: Your Honor , may I ask the Court to reconsider charging the State for that strike. This Mr. McGuire came to chambers yester day and expressed his belief that he didn't know if he could last the two weeks [the estimated length of the trial], there was some problem with work. He was an inspector or something for the Department of Labor. I know he came in yesterday.\n\nTHE COURT: I will not strike him for cause for that reason. He asked to be excused yesterday and I decided not to excuse him. App. 250.\n\nAt the evidentiary hearing held before Judge Steele as part of the post-conviction relief proceeding, the prosecutor testified that he struck McGuire because McGuire \"had previously requested to be excused fr om jury service\" and because the prosecutor \"wanted attentive jur ors\" who were not worried about missing other obligations or activities while the trial took place. App. 801.\n\nThe defense called McGuire as a witness at the evidentiary hearing. McGuire testified that he was employed by the State of Delaware as a Social Security\"disability adjudicator,\" App. 846-47; that he had been reporting for jury duty in the courthouse in Dover for two to thr ee weeks before he was questioned in connection with the Riley case but had not been seated on a jury, id. at 852-53; that while he was away from work, the disability claims assigned to him would \"just sit[ ],\" id. at 850; that the director of his office had told him that he was going to make a\"formal request\" that McGuire be excused, id. at 860; that such a request was sent, id. at 853, 856; and that the request had been discussed in chambers with the judge. Id . at 849-50, 856. McGuire said, however, that he himself had never expressed an unwillingness to serve on the jury and had been willing to do so. See id. at 850.\n\nJudge Steele accepted the prosecutor's explanation of the reason for striking McGuire. Judge Steele wrote:\n\nMcGuire's employer sent a letter requesting he be released from jury duty because he could not be replaced at his job if he was chosen for jury duty. The letter by McGuire's employer clearly gave the State reason to question whether McGuire would give his full time and attention to the trial and whether he would be able to serve for the entirety of the time projected for the trial. Whether McGuire, in fact, did not request relief from jury duty and did wish to serve is of no consequence. Riley IV at 4-5.\n\nJudge Steele then credited the state's explanation of the reason for striking McGuir e, terming it \"clear, reasonably specific and entirely unrelated to the juror's race.\" Id. at 5.\n\nSeveral factors provide substantial support for this finding. It is apparent that McGuire's work situation was on the prosecutor's minds when McGuire was peremptorily challenged because, as noted, immediately after striking McGuire, the prosecutor asked that McGuir e's dismissal be deemed for cause since he had \"expressed his belief that he didn't know if he could last the two weeks.\" App. 250. In addition, a reasonable prosecutor might well have wondered whether McGuire's work situation would adversely affect his attentiveness at trial. As noted, McGuir e's supervisor had made a \"formal request\" that he be excused \"because he could not be replaced at his job if he was chosen for jury duty.\"\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Whether or not McGuire himself in fact wished to serve on the jury, the impression appar ently was conveyed that McGuire wanted to be excused and to r eturn to work, since the trial judge commented: \"He asked to be excused yesterday and I decided not to excuse him.\" See App. 250. Under these circumstances, a reasonable pr osecutor could have been concerned that McGuire might have been inattentive at trial due to worry about missing work, leaving his duties unattended, and perhaps incurring his supervisor's displeasure.\n\nRiley attacks Judge Steele's finding on two gr ounds. First, he points out that, according to McGuir e's testimony at the post-conviction relief evidentiary hearing, McGuire himself did not ask to be excused. This argument is unpersuasive. Although McGuire testified that he did not ask to be excused, the trial judge, as noted, stated at the time of McGuire's dismissal: \"He asked to be excused yesterday and I decided not to excuse him.\" App. 250 (emphasis added). Thus, McGuire, who was unable to remember many details at the time of the post-conviction relief evidentiary hearing, see App. 853, 857-62, may have been mistaken, or he may have conveyed the impr ession at the time of trial that he personally wanted to be excused.\n\nSecond, Riley points out that a handwritten sheet prepared by the prosecutors during voir dire contains the following notation next to the name of a white jur or, Charles Reed, whom the prosecution did not per emptorily strike: \"works Lowe's, wants off.\" App. 823. One of the prosecutors was questioned about this notation by Riley's attorney at the post-conviction relief evidentiary hearing, but the prosecutor testified that he had no r ecollection of Reed. See id. at 823-24.\n\nThe notation by Reed's name and the prosecutor's testimony at the evidentiary hearing are certainly factors that Judge Steele could have viewed as tending to undermine the credibility of the pr osecutor's explanation for striking McGuire, but the notation and the prosecutor's testimony are insufficient to show that Judge Steele's finding is not \"fairly supported by the r ecord.\" 28 U.S.C. S 2254(d). It is reasonable to infer fr om the notation \"wants off \" that, at some point in the jury selection process, Reed expressed a desire to be excused for some reason. As far as we are aware, however, the record does not reveal why\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e or how strongly Reed wanted to be excused. The transcript of the voir dire on December 6 and 7, 1982, shows that, at the final stage of the jury selection process, the members of the venire were asked whether there was\"any reason why [they] absolutely [could not] serve,\" App. 223, that members of the venire then successfully asked to be r eleased for reasons such as a previously planned vacation, id. at 253, but that Reed made no request to be excused at that time. See id. at 229-30. Thus, as far as the r ecord appears to reveal, Reed may have had a relatively weak desire and reason to be excused, and his situation may not have been at all comparable in this respect to McGuir e's.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Our scope of review of Judge Steele's finding is narrow. Judge's Steele's finding \"on the ultimate question of discriminatory intent\" is entitled to \"gr eat deference,\" particularly because such findings \"lar gely turn on an evaluation of credibility.\" Hernandez v. New York, 500 U.S. 352, 353 (1991). See also Batson, 476 U.S. at 98 n.21 (\"Since the trial judge's findings in [this] context . . . largely will turn on evaluation of credibility, a reviewing court ordinarily should give those findings gr eat deference.\"). Here, although it would be satisfying to know why Reed was not stricken, that unanswered question is not enough, in view of the \"great deference\" owed Judge Steele's credibility determination, to demonstrate that Judge's Steele's finding is not \"fairly supported by the record.\"\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nIII.\n\nRiley next argues that adverse publicity pr evented him from obtaining a trial by an impartial jury. He contends, first, that it should be presumed that he was prejudiced by pretrial publicity because the recor d establishes the existence of a \"hostile trial atmosphere\" and, second, that the record shows that several jurors were unable to be impartial due to exposure to unfavorable pr etrial publicity.\n\nA.\n\n\"Where media or other community reaction to a crime or a defendant engenders an atmosphere so hostile and pervasive as to preclude a rational trial pr ocess, a court reviewing for constitutional error will pr esume prejudice to the defendant without reference to an examination of the attitudes of those who served as the defendant's jur ors.\" Rock v. Zimmerman, 959 F.2d 1237, 1252 (3d Cir. 1992). See also Sheppard v. Maxwell, 384 U.S. 333 (1966); Estes v. Texas, 381 U.S. 532 (1965); Rideau v. Louisiana, 373 U.S. 723 (1963); Flamer v. Delaware, 68 F.3d 736, 755 (3d Cir. 1995) (en banc). \"The community and media reaction, however, must have been so hostile and so pervasive as to make it apparent that even the most car eful voir dire process would be unable to assure an impartial jury. . . . Such cases are exceedingly rare.\" Rock, 959 F.2d at 1252-53.\n\nIn this case, the state courts made a finding of impartiality. Such a finding is entitled to defer ence, see Patton v. Yount, 467 U.S. 1025, 1031 \u0026 n. 7 (1984), and we find no basis for overturning that finding.\n\nRiley relies on a relatively small number of newspaper articles, almost half of which appeared six months or more before the trial. Although two of the articles named Riley as a suspect in Feeley's murder, and although a few of the articles discussed the plight of the Feeley childr en, who were orphaned by the murder, the articles were not inflammatory. In short, the media coverage was not\"so hostile and pervasive as to preclude a rational trial process.\" Rock, 959 F.2d at 1252.\n\nB.\n\nBecause Riley has not shown the presence of circumstances justifying a presumption of prejudice, he \"must establish that those who actually served on his jury lacked a capacity to reach a fair and impartial verdict based solely on the evidence they heard in the courtr oom.\" Rock, 959 F.2d at 1253. See also Patton, 467 U.S. at 1035; Irvin v. Dowd, 366 U.S. 717, 723 (1961). \"The fact that jury members may have been exposed to press r eports or other community reaction concerning the case and even the fact that they may have formed a tentative opinion based on that exposure will not establish a constitutional violation if the trial court has found, with record support, that each of the jurors was able to put aside extrinsic influences.\" Rock, 959 F.2d at 1253.\n\nRiley contends that two jurors, Leon Morris and Carl Patterson, were unable to be impartial due to exposure to pretrial publicity. We do not agr ee.\n\nMorris testified during voir dire that he\"had read something about\" the case in the newspaper at the time of the murder and that he had heard on the radio that the case was \"coming to trial.\" App. 277. The following exchange then occurred:\n\nQ. . . . Because of what you read in the newspaper, do you feel that you could sit here as an impartial jury?\n\nA. Yes, because I know nothing of the e vidence or anything else. App. 278.\n\nCarl Patterson during voir dire was asked whether anything he had read in the newspaper had cr eated bias or prejudice against the defendant. See App. 294 He responded that he could not remember a lot of what he read in the newspaper. See id. The following colloquy then occurred:\n\nQ. Then do you know of any reason why you can't render an impartial verdict based solely upon the law and the evidence?\n\nA. No, Your Honor. Id.\n\nThe trial judge implicitly found that these jur ors were impartial, and the Delaware Supreme Court agreed on direct appeal. Such implicit findings ar e entitled to a presumption of correctness. Parke v. Raley, 506 U.S. 20, 35 (1992); Weeks v. Snyder, 2000 WL 975043 (3d Cir. July 17, 2000); Campbell v. Vaughn, 209 F .3d 280, 290 (3d Cir. 2000), and we see no ground for holding that that presumption has been overcome.\n\nIV.\n\nRiley argues that the prosecution violated his right to due process by failing to disclose exculpatory evidence in its possession as required by Brady v. Maryland, 373 U.S. 83 (1963). In Brady, the Supreme Court held that \"the suppression by the prosecution of evidence favorable to an accused upon request violates due process where the evidence is material either to guilt or to punishment, irrespective of the good faith or bad faith of the prosecution.\" Id. at 87. To state a valid Brady claim, a plaintiff must show that the evidence was (1) suppressed, (2) favorable, and (3) material to the defense. See United States v. Perdomo, 929 F.2d 967, 970 (3d Cir. 1991). Evidence is material if there is a reasonable probability that the outcome would have been different had the evidence been disclosed to the defense. See United States v. Bagley, 473 U.S. 667, 678 (1985). Evidence that may be used to impeach may qualify as Brady material. See Kyles v. Whitley, 514 U.S. 419, 445 (1995); Bagley , 473 U.S. at 676.\n\nRiley's Brady argument concerns a wiretap on the telephone of the mother of Tyrone Baxter . Before trial, Riley's lawyer asked the state to produce r ecordings or transcripts of the intercepted calls, but the state refused, arguing that the tapes contained no exculpatory material. Without listening to the tape himself, the trial judge accepted the prosecutor's representation and denied Riley's motion for production. Throughout the subsequent proceedings in state and federal court, no judge listened to the tapes.\n\nIn his briefs in this appeal, Riley made a str ong Brady argument. He asserted that between the time of the Feeley murder and Baxter's arrest, \"Baxter spoke to his mother on the telephone on several occasions\"; that \"Baxter's testimony was the State's strongest evidence against\" him; and that statements made by Baxter to his mother might have provided valuable impeachment evidence. Appellant's Br. at 5. At a minimum, he contended, the state courts or the District Court should have listened to the tapes in camera to determine whether they contained Brady material.\n\nAt oral argument, however, counsel for the appellees represented that an examination of the logs of the wiretap on Mrs. Baxter's telephone did not reveal any intercepted conversations in which Baxter participated. Copies of the logs were provided to Riley's attor neys and to the court, and Riley's attorneys submitted a letter -brief commenting on the contents of the logs. We have examined the logs, and it appears that the state's representation is correct: we see no record of any conversations in which Baxter participated. The revelation that the logs do not mention any such conversations fatally undermines the Brady argument made in Riley's briefs.\n\nIn their post-argument letter-brief commenting on the logs, Riley's attorneys advance differ ent arguments to show that an in camera inspection of the wiretap r ecordings is required. A defendant seeking an in camera inspection to determine whether files contain Brady material must at least make a \"plausible showing\" that the inspection will reveal material evidence. Pennsylvania v. Ritchie, 480 U.S. 39, 58 n.15 (1987) (quoting United States v. V alenzuela-Bernal, 458 U.S. 858, 867 (1982)). Mer e speculation is not enough. United States v. Navarro, 737 F.2d 625, 631 (7th Cir. 1984). The arguments made by Riley's attorneys in their post-argument submission do not satisfy this standard.\n\nRiley's attorneys first note that several log entries \"expressly refer to conversations about Tyrone Baxter.\" 12/16/99 Letter-brief at 3 (emphasis added). But it is unlikely that statements \"about\" Baxter by third persons --unlike statements made by Baxter himself -- could have been used to impeach Baxter's testimony or could have been admitted at trial on some other ground. For that reason alone, it is unlikely that these statements are material. See Wood v. Bartholomew, 516 U.S. 1, 5-6 (1995). Moreover, even if the problem of admissibility is put aside, it is pure speculation to suppose that the contents of the statements are in any way exculpatory.\n\nRiley's attorneys also suggest that conversations between Baxter and his mother may have been intercepted and recorded but that the person or persons who compiled the logs may not have recognized Baxter's voice. This, however, is nothing but the purest speculation. W e note that the wiretap occurred while the police wer e seeking to arrest Baxter; they therefore had a strong incentive to identify him if he participated in any of the intercepted conversations. We have considered all of Riley's Brady arguments and find them to be without merit.\n\nV.\n\nRiley argues that he was denied the ef fective assistance of counsel at the penalty phase of his trial.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e The District Court held that many of Riley's arguments concerning the alleged deficiencies of his attorney's per formance were never presented to the Delaware Supr eme Court and were thus procedurally barred, and the District Court rejected Riley's remaining arguments regar ding this matter on the merits. On appeal, Riley attacks both parts of the District Court's holding.\n\nA.\n\nRiley contends that the District Court was r equired to hold an evidentiary hearing on the question of pr ocedural default for two reasons. First, he maintains that at least some of the arguments that the District Court held were procedurally barred might have been pr esented to the Delaware Supreme Court during the oral ar gument of his direct appeal even though those arguments were not contained in his brief. Because the recor d does not include a transcript of the oral argument, Riley maintains that the District Court should have held an evidentiary hearing for the purpose of reconstructing the recor d. See Appellant's Br. at 38-39. We disagree.\n\nOn direct appeal, Riley was represented by the same attorney who had represented him at trial. In his amended habeas petition, Riley acknowledges that no inef fective assistance argument was made in the dir ect appeal brief that was ultimately submitted on his behalf and accepted for filing by the Delaware Supreme Court.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e See App. 1198. In addition, the opinion issued by the Delawar e Supreme Court in the direct appeal makes no mention of ineffective assistance of counsel. See Riley I. Under these circumstances, the District Court was certainly not required to conduct an evidentiary hearing to determine whether the attorney who represented Riley at trial chose at oral argument before the state supr eme court to make arguments not mentioned in his brief and to condemn his own performance in the trial court.\n\nWith little elaboration, Riley also contends that the District Court should have held an evidentiary hearing so that Riley could show that he had \"cause\" for not raising the arguments in question in state court. See Appellant's Br. at 39. However, Riley has not even identified any \"cause\" that he would have attempted to show. We will not reverse the decision of the District Court and order that Court to conduct an evidentiary hearing so that Riley can develop the factual predicate for a \"cause\" that Riley has not even disclosed.\n\nPerhaps the most frequently asserted\"cause\" for procedural default is ineffective assistance of counsel, and we will therefore comment briefly on the steps that Riley should have taken if he wished to rely on this\"cause.\" As the District Court pointed out, in order for Riley to show that ineffective assistance provided\"cause\" for failing to raise the arguments in question in the state court proceedings, Riley would have to show that the new attorney who represented him in the state post-conviction relief proceedings was ineffective. See Dist. Ct. Op. at 50 \u0026 n.16, 56-57. This is so because Delaware per mits a claim of ineffective assistance to be raised in a post-conviction relief proceeding even if it was not raised on direct appeal. See Riley VI, 1998 WL 172856, at **17-18 \u0026 n.16. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nRiley has not argued, however, that the attorney who represented him in the state post-conviction relief proceedings provided ineffective assistance by failing to make the specific arguments that the District Court held were procedurally barred.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Moreover, because Riley never raised a claim in state court that his post-conviction relief attorney was ineffective, he runs afoul of the rule that \"a petitioner must demonstrate independent cause and prejudice excusing the default of the inef fectiveness claim before that claim can be assessed as cause in r elation to a second, substantive claim.\" Hill v. Jones, 81 F.3d 1015, 1030 (11th Cir. 1996). See also Justus v. Murray, 897 F.2d 709, 713 (4th Cir. 1990).\n\nB.\n\nWe will now discuss the ineffective assistance arguments that were not procedurally defaulted. In order to show that his constitutional right to the assistance of counsel was violated at the penalty phase, Riley must satisfy the two-pronged test of Strickland v. Washington, 466 U.S. 668, 687 (1984). First, he must demonstrate that his attor ney \"made errors so serious that counsel was not functioning as the `counsel' guaranteed the defendant by the Sixth Amendment.\" Id. at 687. \"Judicial scrutiny of counsel's performance must be highly defer ential. It is all too tempting for a defendant to second-guess counsel's assistance after . . . [an] adverse sentence, and it is all too easy for a court, examining counsel's defense after it has proved unsuccessful, to conclude that a particular act or omission of counsel was unreasonable.\" Id. at 689. Second, if counsel's representation is shown to fall outside \"the wide range of reasonable professional assistance,\" id., it must be shown that \"the deficient performance prejudiced the defense,\" that is, that \"there is a r easonable probability that, but for counsel's unprofessional err ors, the result of the proceeding would have been differ ent.\" Id. at 694.\n\n1.\n\nIn his brief in our court, Riley presented a greatly truncated version of arguments previously advanced regarding trial counsel's failure to call certain family members to testify at the penalty phase of the trial and trial counsel's failure to locate or contact other family members who might have testified. All of these family members, Riley argues, could have provided evidence about his traumatic experiences as a child and his \"severely dysfunctional family.\" Appellant's Br. at 41.\n\nThe Superior Court, the Delaware Supreme Court, and the District Court all addressed these ar guments in some detail and rejected them. They concluded that Riley's trial attorney made reasonable efforts tofind certain family members who could not be located, that he did not act unreasonably in failing to call others as witnesses, and that his failure to rely on what was ter med Riley's \"social history\" represented a reasonable strategy. See Riley II, 1988 WL 47076 at *3-4, *7-9; Riley V, 585 A.2d at 726-28; Riley VI, 1998 WL 172856, at **20-23.\n\nIn his brief in our court, Riley merely states without elaboration that \"trial counsel failed to call as witnesses members of Mr. Riley's immediate family, several of whom lived with a few hours of Dover, Delawar e\" and that these witnesses could have testified about his childhood and family. Appellant's Br. at 41. He provides no response to the detailed reasons given by the state courts and the District Court for holding that trial counsel was not ineffective in failing to call or locate family members for the purpose of eliciting testimony about Riley's childhood and family.\n\nNothing has been presented that convinces us that the state courts and the District Court erred. W e agree with the state courts and the District Court that Riley has not shown that trial counsel was ineffective in failing to call those family members who could be located, such as Riley's mother. The District Court analyzed trial counsel's decision not to put Riley's mother on the stand as follows:\n\nThe record is replete with cir cumstances that support trial counsel's decision not to call Petitioner's mother. First, Petitioner informed trial counsel that he did not wish to expose his mother's problems at trial. . . . Second, trial counsel testified that Petitioner's mother refused to support Petitioner's alibi, and as a result, he was concerned about the pr osecutor's cross- examination of her during the penalty phase. . . . Third, the record indicates that Petitioner's mother had a severe drinking problem and was drinking heavily at the time of the trial. . . . As a result, trial counsel believed that the witnesses that he chose to call in mitigation, instead, would make a better impr ession on the jury. . . . Under these circumstances, the Court finds trial counsel's decision not to call Petitioner's mother to be reasonable and within the bounds of his strategic discretion. Riley VI, 1998 WL 172856, at *2. We agree.\n\nWe also agree that Riley has not demonstrated that his trial attorney was ineffective in failing to locate certain other family members. See Riley II, **3-5; Riley V, 585 A.2d at 727-28; Riley VI, 1998 WL 172856, at *21. Finally, we agree that a strategy of not introducing evidence regarding Riley's background and family fell within \"the wide range of reasonable professional assistance.\" Strickland, 466 U.S. at 689. The Superior Court wrote as follows:\n\nThe adverse inferences to be drawn from the fact that defendant's parents were both alcoholics, his sister an unwed mother of three, his brother an incarcerated criminal and his home life a series of jails and temporary living quarters would no doubt have been magnified in the semi-rural county where this case was tried . . . . Likewise, it is certainly within the range of strategic choices to forego mitigating evidence, which may be seen as \"excuse making\" and rely upon a plea for mercy . . . . In Riley's case, evidence of fered as to mitigating circumstances included: that the actual killer was Tyrone Baxter, the co-defendant; that Baxter received a less severe penalty; and that Riley's background indicated that he was a diligent worker, possessing a non-violent and good character.\n\nIn this case, trial counsel gave a strong ar gument that Riley's life should be spared in light of the fact that Tyrone Baxter, defendant's accomplice and principal accuser, would be spared the death penalty as the result of a plea bargain. Moreover , Walter Ross testified without contradiction at the [post-conviction r elief] hearing that the defendant did not want his family background discussed at the penalty phase. Given defendant's wishes, the lack of positive evidence in mitigation, counsel's focused argument for leniency in light of Baxter's plea bargain, and the potentially negative impact the purportedly positive evidence would have wrought before the jury, defendant has failed to show that counsel's decision to limit the testimony at the penalty phase was constitutionally deficient. Riley II, 1988 WL 47076, at *11-12.\n\nThis analysis was accepted by the Delaware Supreme Court and the District Court. We cannot disagree.\n\n2.\n\nRiley contends that his trial attorney wa s ineffective because he did not present testimony by a mental health expert. Riley relies on the affidavits of two experts, who examined him in connection with the post-conviction relief proceeding. One of the experts characterized Riley as a person with \"borderline defective\" intelligence whose capacity \"for objectively analyzing events, cir cumstances and relationships [is] narrowed by stress and complexity.\" Appellant's Br. at 42. We agree with Riley that this explanation might have been helpful at the penalty phase. The question remains, however, whether trial counsel was ineffective in failing to obtain such evidence at the time.\n\nIn the post-conviction relief proceeding in Superior Court, trial counsel testified that he did not seek to have Riley examined by a mental health expert because he had no reason to think, in light of his conversations with Riley, that such an examination would have revealed anything useful. See App. 592-96. He testified that Riley appeared to understand what they discussed and that Riley pr epared and filed some motions on his own behalf. See App. 592-93. Trial counsel stated that Riley never mentioned any head injury or any psychological problems. See App. 590. Relying on this testimony, the Superior Court found that trial counsel \"had no inkling that evaluation of Mr. Riley's mental or emotional state might be helpful in mitigation.\" Riley II, 1988 WL 47076, at *7.\n\nBefore us, Riley has not argued that counsel in a capital case must always seek a mental examination of the defendant, and cases from other circuits r eject that proposition. Instead, they hold that a case-by-case determination must be made and that counsel is not ineffective if he or she has no reason to think that a mental examination would be useful. See Thomas v. Gilmore, 144 F.3d 513, 515-16 (7th Cir. 1998); United States v. Miller, 907 F.2d 994, 998-99 (10th Cir. 1990); United States ex rel. Rivera v. Franzen, 794 F.2d 314, 317 (7th Cir. 1986).\n\nUnder this standard, we see no ground for reversing the decision of the District Court here. Riley has simply not identified any fact that should have alerted his trial attorney that he had mental problems that might have provided the basis for mitigation. The only fact even mentioned in Riley's briefs is the \"implausible\" nature of Riley's alibi, see Reply Br. at 21, but this is insufficient to alert counsel to the possibility of mental pr oblems that might be relevant to mitigation. For the most part, Riley merely notes what the subsequent examinations by mental health experts revealed. However, \"[a] fair assessment of attorney performance requir es that every effort be made to eliminate the distorting effects of hindsight, to reconstruct the circumstances of counsel's challenged conduct, and to evaluate the conduct from counsel's perspective at the time.\" Strickland, 466 U.S. at 689.\n\n3.\n\nFinally, Riley cites trial counsel's inexperien ce and the fact that he spent only 14 hours preparing for the penalty phase of the trial. These facts are not comforting, but they do not in themselves establish that counsel was inef fective. We have taken them into account in evaluating the other deficiencies properly asserted in this appeal. We cannot say, however, that Riley's constitutional right to the effective assistance of counsel was denied.\n\nVI.\n\nRelying on Ake v. Oklahoma, 470 U.S. 68, 76-77 (1985), Riley argues that his right to due process was violated because the trial judge refused to appoint co-counsel or an investigator to assist his attorney. Riley again notes the inexperience of his attorney, and he asserts that co-counsel had been appointed in Kent County in prior capital cases. Although Riley claims that the lack of co-counsel and an investigator caused him \"extreme prejudice,\" his brief provides no details.\n\nA.\n\nWe turn first to Riley's ar gument that he was constitutionally entitled to the appointment of co-counsel. In some jurisdictions, there is a statutory right to the appointment of two defense attorneys in capital cases. See, e.g., 18 U.S.C. S 3005. However, we are aware of no authority holding that the federal Constitution confers such a right, and we see no basis for such a holding. The Constitution specifies the quality of r epresentation that all criminal defendants, including capital defendants, must receive, namely, \"reasonably ef fective assistance.\" Strickland, 466 U.S. at 687. The Constitution does not specify the number of lawyers who must be appointed. If a single attorney provides reasonably effective assistance, the Constitution is satisfied, and if a whole team of lawyers fails to provide such assistance, the Constitution is violated. Thus, there is no constitutional right per se to the appointment of co-counsel in a capital case. Bell v. Watkins, 692 F.2d 999, 1009 (5th Cir. 1982); Jimenez v. State, 703 So. 2d 437, 439 (Fla. 1997) (per curiam); State v. Phelps, 478 S.E.2d 563, 574-75 (W.Va. 1996) (per curiam); State v. Rodriguez, 921 P.2d 643, 652 (Ariz. 1996); Spranger v. State, 650 N.E.2d 1117, 1122-23 (Ind. 1995); Uptergrove v. State, 881 S.W.2d 529, 531 (Tex. Ct. App. 1994). Cf. Hatch v. Oklahoma, 58 F.3d 1447, 1456 (10th Cir . 1995).\n\nRiley's brief does not identify any unusual featur es of this case that demanded the appointment of a second attor ney. While he does cite the inexperience of his trial attorney, without a showing that this attorney did not provide the level of representation requir ed by the Constitution, we cannot hold that the failure to appoint co-counsel to assist him violated the Constitution.\n\nB.\n\nWe must also reject Riley's ar gument that the failure to appoint a private investigator violated the Constitution. In Caldwell v. Mississippi, 472 U.S. 320, 323 n.1 (1985), the Supreme Court made it clear that ther e is no constitutional right to the appointment of an investigator where the defendant offers \"little mor e than undeveloped assertions that the requested assistance would be beneficial.\" See also Gray v. Thompson, 58 F.3d 59, 66-67 (4th Cir. 1995), vacated on other gr ounds sub nom. Gray v. Netherland, 518 U.S. 152 (1996). Riley has of fered nothing more here.\n\nVII.\n\nRiley argues that his Eighth and Fourteenth Amendment rights were violated because the prosecutor and the trial judge allegedly made remarks to the jury during the sentencing phase of the trial that minimized the jury's sense of responsibility and led it to believe that its decision was not final. We do not agree.\n\nRiley's argument is based on Caldwell v. Mississippi, supra. In that case, the defense attorney, in closing argument to the jury at the sentencing phase, asked the jury to \"confront both the gravity and r esponsibility of calling for another's death.\" 472 U.S. at 324. In response, the prosecutor strongly disagreed with the defense attorney's comments and stated:\n\nNow, they would have you believe that you're going to kill this man and they know -- they know that your decision is not the final decision. My God, how unfair can you be? Your job is reviewable. They know it. . . . For they know, as I know, and as [the judge] has told you, that the decision you render is automatically reviewable by the Supreme Court. Id. at 325-26.\n\nBy a vote of five to three, the United States Supreme Court reversed the decision of the state supr eme court upholding the defendant's death sentence. In an opinion by Justice Marshall, the United States Supreme Court held that the prosecutor's comments had impr operly led the jurors to believe that the responsibility for determining the appropriateness of a death sentence lay elsewhere. In a portion of his opinion that was joined by only thr ee other justices, Justice Marshall responded to the state's argument that the prosecutor's comments were permissible because it is proper to give a capital sentencing jury accurate information about post-sentencing pr ocedures. 472 U.S. at 335-36. Justice Marshall rejected this argument on two grounds, viz., that the prosecutor's remarks were neither \"accurate\" nor\"relevant to a valid state penological interest.\" Id. at 336. He explained:\n\n[I]t was misleading as to the nature of the appellate court's review and because it depicted the jury's role in a way fundamentally at odds with the role that a capital sentencer must perform. Similarly, the prosecutor's argument is not linked to any arguably valid sentencing consideration. That appellate r review is available to a capital defendant sentenced to death is no valid basis for a jury to return such a sentence if otherwise it might not. It is simply a factor that in itself is wholly irrelevant to the determination of the appropriate sentence. Id.\n\nJustice O'Connor, who cast the deciding fifth vote for reversal, did not join this part of Justice Marshall's opinion. Justice O'Connor refused to endorse the principle that \"the giving of non-misleading and accurate information regarding the jury's role in the sentencing scheme is irr elevant to the sentencing decision.\" 472 U.S. at 341 (opinion of O'Connor, J.)(emphasis added). However, she agr eed that the prosecutor's statements were improper because they \"creat[ed] the mistaken impression that automatic appellate review of the jury's sentence would provide the authoritative determination of whether death was appropriate,\" whereas in fact the state supreme court exercised only a narrow scope of r review. Id.\n\nIn subsequent cases, the Court has clarified the holding in Caldwell. In Romano v. Oklahoma, 512 U.S. 1, 9 (1994), the Court wrote as follows:\n\nAs Justice O'CONNOR supplied the fifth vote in Caldwell, and concurred on grounds narrower than those put forth by the plurality, her position is controlling. See Marks v. United States, 430 U.S. 188, 193 (1977) . . . . Accordingly, we have since r ead Caldwell as \"relevant only to certain types of comment --those that mislead the jury as to its role in the sentencing process in a way that allows the jury to feel less responsible than it should for the sentencing decision.\" Durden v. Wainwright , 477 U.S. 168, 184, n.15 (1986). Thus, \"[t]o establish a Caldwell violation, a defendant necessarily must show that the r emarks to the jury improperly described the role assigned to the jury by local law.\" Dugger v. Adams, 489 U.S. 401, 407 (1989), see also Sawyer v. Smith, 497 U.S. 227, 233 (1990).\n\nThe Romano Court rejected the Caldwell argument advanced in that case because \"the jury was not affirmatively misled regarding its role in the sentencing process.\" Id. at 10. Thus, in or der to establish a Caldwell violation, a defendant must show that the pr osecutor's comments inaccurately or misleadingly minimized the finality or importance of the jury's verdict at the penalty phase.\n\nRiley's argument is based on a statement made by the prosecutor near the very beginning of his summation at the sentencing phase of the trial. The prosecutor stated:\n\nAs the Judge has explained to you we have a specific statute with regard to what occurr ed in a penalty hearing on a capital case.\n\nLet me say at the outset that what you do today is automatically reviewed by our Supreme Court and that is why there is an automatic review on the death penalty. That is why, if you return a decision of death, that is why you will receive and have tofill out a two- page interrogatory that the Court will give you. This is an interrogatory that specifically sets out the questions that the State request and whether or not you believe it beyond a reasonable doubt and if you want in your determination, if you believe the sentence should be death then each and every one of you has to sign this. This goes to the Supreme Court. That is why it is concise and we believe clear and it should be looked carefully on and answered appropriately. App. 393 (emphasis added).\n\nRiley points to the highlighted words quoted above and adds that \"the trial court enhanced the jury's sense that the responsibility for Mr. Riley's death sentence lay elsewhere by r epeatedly referring to the jury's sentencing of Mr. Riley as a `recommendation.' \" Appellant's Br . at 45.\n\nIn its decision on direct appeal, the Delawar e Supreme Court responded to this argument as follows:\n\n[T]he prosecutor's remarks in no way suggested that responsibility for ultimately determining whether defendant faced life imprisonment or death r ested elsewhere. The prosecutor's passing comment to the jury that its decision would be \"automatically r eviewed\" was fairly made in the context of the prosecutor's preceding reference to the \"specific statute [controlling] a penalty hearing on a capital case.\" 11 Del.C.S 4209. Since subsection (g) of S 4209 mandates the\"Automatic Review of Death Penalty by Delaware Supr eme Court\", the prosecutor in the instant case was simply quoting the statute. In no sense may it reasonably be said that the prosecutor was either misstating the law, misleading the jury as to its role, or minimizing its sentencing responsibility. 496 A.2d at 1025 (alteration in original).\n\nWe agree with this analysis.\n\nThe prosecutor's remarks in Caldwell were \"quite focused, unambiguous, and strong.\" 472 U.S. at 340. The clear message was that, contrary to the suggestion of defense counsel that the jury should \"confr ont both the gravity and responsibility of calling for another's death,\" id. at 324, the jury need not shoulder that responsibility because \"the authoritative determination of whether death was appropriate\" would be made by the state supreme court. Id. at 343 (Opinion of O'Connor , J.). It was in this sense that the remarks \" `impr operly described the role assigned to the jury by local law' \"\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e and thus \" `allowed the jury to feel less responsible than it should for the sentencing decision.' \"\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nThe prosecutor's remarks in this case wer e very different. Here, the prosecutor made accurate, unemotional, passing remarks in the context of describing the state statute and explaining why the jury would have to \"fill out a two-page interrogatory\" if it returned a capital sentence. These remarks did not convey the message that the jury should not confront the gravity of returning a death verdict, and thus the mere mention of the fact that ther e would be an automatic appeal to the state supreme court did not mislead the jury as to its role in the sentencing process. In this connection, it is noteworthy that after the closing arguments, the trial judge instructed the jury on its role using language that left no doubt about its r esponsibility. The trial judge stated: \"Where the jury submits such a finding and recommendation, the Court shall sentence the defendant to death.\" Riley V, 585 A.2d at 731 (emphasis added). A \"recommendation of death, supported by the evidence, shall be binding on the Court.\" Id. (emphasis added). \"Your unanimous recommendation for the imposition of the death penalty, if supported by the evidence, is binding on the Court.\" Id. at 734 (emphasis added). In light of the substantial factual dif ferences between Caldwell and this case, and in light of the Supreme Court's subsequent explanation of the meaning of Caldwell, we reject Riley's Caldwell claim.\n\nOur dissenting colleague would apparently hold that a Caldwell violation occurred simply because the prosecutor accurately stated that there would be an automatic appeal to the state supreme court without attempting to explain the scope of review that the state supr eme court would exercise. We do not agree with this reading of Caldwell. Neither Justice O'Connor's controlling opinion in Caldwell nor the Court's subsequent explanation in Romano took the position that an unadorned reference to automatic judicial review of a capital verdict is enough to violate the Constitution. Rather, \"[t]o establish a Caldwell violation, a defendant necessarily must show that the remarks to the jury improperly described the role assigned to the jury by local law.\" Romano, 512 U.S. at 9 (quoting Dugger v. Adams, 489 U.S. at 407).\n\nVIII.\n\nRiley contends that the trial judge contravened the holding of Witherspoon v. Illinois, 391 U.S. 510 (1968), when the judge dismissed two jurors for cause after they responded to voir dire questions concer ning capital punishment. In Witherspoon, the Supr eme Court held that members of a jury panel may not be excused for cause \"simply because they voiced general objections to the death penalty or expressed conscientious or r eligious scruples against its infliction.\" Id. at 522. Some lower courts, however, interpreted footnotes in W itherspoon to mean that potential jurors could be dismissed only if they stated unambiguously that they would automatically vote against the death penalty.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nThe Supreme Court clarified the meaning of Witherspoon in Wainwright v. Witt, 469 U.S. 412 (1985). The Court held that \"the proper standard for deter mining when a prospective juror may be excluded for cause because of his or her views on capital punishment . . . is whether the juror's views would `prevent or substantially impair the performance of his duties as a jur or in accordance with his instructions and his oath.' \" Id. at 424 (quoting Witherspoon, 391 U.S. at 45). The Court noted:\n\n[T]his standard . . . does not require that a juror's bias be proved with `unmistakable clarity' . . . because determinations of juror bias cannot be r educed to question-and-answer sessions which obtain results in the manner of a catechism. What common sense should have realized experience has proved: many veniremen simply cannot be asked enough questions to reach the point where their bias has been made \"unmistakably clear\"; these veniremen may not know how they will react when faced with imposing the death sentence, or may be unable to articulate, or may wish to hide their true feelings. Despite this lack of clarity in the printed record, however, ther e will be situations where the trial judge is left with the definite impression that a prospective juror would be unable to faithfully and impartially apply the law. Id. at 424-26 (footnote omitted).\n\nThe Court went on to hold that a trial judge's finding under this standar d is entitled to the presumption of correctness in 28 U.S.C. S 2254(d).\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e 469 U.S. at 428. Applying these standards, the Court sustained the dismissal of a juror who said, when asked whether her beliefs would interfere with her sitting as a juror in a capital case, \"I am afraid it would\" and \"I think it would.\" Id. at 416.\n\nThe two potential jurors at issue in the pr esent case are Mae Floyd and Gerald Moot. During Floyd's voir dir e, the following exchange occurred:\n\nThe Court: . . . Do you have any conscientious scruples against finding a verdict of guilty wher e the punishment might be death or against imposing the death penalty if the evidence should so warrant?\n\nMs. Floyd: I would say yes, I think so.\n\nThe Court: You do have conscientious scruples?\n\nMs. Floyd: Yes.\n\nThe Court: Regardless of any personal beliefs or feelings you have, if the evidence justified it, would you be able to find a person guilty of murder in the first degree and impose the death penalty?\n\nMs. Floyd: That is a hard one to tell you the truth.\n\nThe Court: I will repeat the question.\n\nMs. Floyd: I heard it. All right. Repeat the question.\n\nThe Court: I will repeat it. Regardless of your personal belief or feelings, if the evidence justified it, would you be able to find a person guilty of mur der in the first degree and would you be able to impose the death penalty?\n\nMs. Floyd: That is a two-part question, right?\n\nThe Court: Yes, it is.\n\nMs. Floyd: The latter part--\n\nThe Court: First of all, would you be able tofind a person guilty of murder in the first degr ee?\n\nMs Floyd: I may, yes.\n\nThe Court: And the second part is would you be able to impose the death penalty?\n\nMs. Floyd: I tell you the truth I don't think so.\n\nThe Court: I will excuse you. Thank you very much. App. 285-86 (emphasis added).\n\nAs both the Delaware Supreme Court and the District Court observed, Floyd's responses were very similar to those of the potential juror in question in Wainwright v. Witt, supra. See Riley I, 496 A.2d at 1005-06 Riley VI, 1998 WL 172856, at *11. We agree with their analysis and hold that Riley has not overcome the presumption of correctness that attaches to the implicit finding of the trial judge.\n\nThe dismissal of the other potential juror in question, Gerald Mood, took place after the following colloquy:\n\nThe Court: . . . . Do you have any conscientious scruples against finding a verdict of guilty when the punishment might be death or against imposing the death penalty if the evidence should so warrant?\n\nMr. Mood: I don't know. I have mixed emotions about that.\n\nThe Court: Regardless of any personal belief or feelings that you have, if the evidence justified it, would you be able to find a person guilty of murder in thefirst degree and would you be able to impose the death penalty?\n\nMr. Mood: Maybe I could. I don't really know.\n\nThe Court: I am going to excuse you sir . . . . App. 276.\n\nThe District Judge aptly analyzed the dismissal of Mood, and we adopt his analysis:\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nUnlike venireperson Floyd, venireperson Mood's responses were much more succinct. Mood twice responded to the trial court's capital punishment questions with the phrase, \"I don't know.\" . .. . Particularly in situations such as this, wher e an individual's record response is so brief that its printed reproduction reveals little, the Court should defer to those credibility factors that would only have been known to the trial court, such as the juror's demeanor, tone of voice and attitude. See Witt, 469 U.S. at 434 (emphasizing importance of trial court's assessment of venireperson's demeanor, particularly where printed record may not be \"crystal clear\"). Accordingly, the Court finds adequate record support for the trial court's decision to excuse venireperson Mood. Riley VI, 1998 WL 172856, at *12.\n\nIX.\n\nRelying on Morgan v. Illinois, 504 U.S. 719 (1992), Riley argues that the trial judge erred in failing sua sponte to ask prospective jurors during voir dir e whether they would automatically impose the death penalty if they found him guilty. The District Court rejected this claim on the ground that Morgan requires that such questions be asked only if the defense so requests. We agree.\n\nIn Morgan, the Supreme Court framed the relevant issue in these terms: \"whether on voir dir e the court must, on defendant's request, inquire into the prospective jurors' views on capital punishment.\" 504 U.S. at 726 (emphasis added). The Court stated its holding as follows:\n\nPetitioner was entitled, upon his request , to inquiry discerning those jurors who, even prior to the State's case in chief, had predetermined the ter minating issue of his trial, that being whether to impose the death penalty. Id. at 736 (emphasis added).\n\nThe dissent described the Court's holding in similar language: \"The Court today holds that . . . the Constitution requires that voir dire directed to [reverse-Witherspoon] `bias' be provided upon the defendant's request.\" Id. at 739 (Scalia, J., dissenting) (emphasis added).\n\nWe cannot regard the Court's choice of words as accidental, and we think that the holding of Mor gan is clear: a reverse-Witherspoon inquiry must be made \"on defendant's request.\" See United States v. Tipton, 90 F.3d 861, 879 (4th Cir. 1996).\n\nRiley makes two arguments in response. First, he notes that the state supreme court rejected his argument on the merits, and he contends that \"the State should not now be heard to raise alleged procedural bars to federal court resolution of the claim on the merits.\" Appellant's Br. at 52. Our holding, however, has nothing to do with a procedural bar, i.e., a state rule of procedur e that bars a federal habeas court from reaching the merits of a federal claim. Rather, our holding is based on the fact that the constitutional right recognized in Mor gan applies only if the defense makes a request for a reverse-Witherspoon inquiry.\n\nSecond, Riley argues that his trial attor ney was ineffective in failing to request r everse-Witherspoon questioning. However, this argument was not made in the state courts, and it is thus procedurally barr ed.\n\nX.\n\nUnder 11 Del. C. S 4209(g)(2), the Delawar e Supreme Court is required to undertake a pr oportionality review in death penalty cases. The statute mandates that the Court inquire into whether \"the death penalty was either arbitrarily or capriciously imposed or recommended, or disproportionate to the penalty recommended or imposed in similar cases.\" 11 Del. C. S 4209(g)(2)(a). In affirming Riley's death sentence, the Delaware Supreme Court examined 21 cases, including five in which the death penalty was imposed. It found that Riley's case was comparable to the five death penalty cases (Whalen, Rush, Deputy, Flamer and Bailey), because they all involved\n\nan unprovoked, cold-blooded murder of a helpless person (or persons) committed upon victims lacking the ability to defend themselves and solely for the purposes of pecuniary gain (except in Whalen's case). In none of these killings is there any evidence of pr ovocation or of homicide committed out of passion or rage. In each case, except Whalen, the murder occurred in the court of a robbery that was deliberately planned and carried out with the use of deadly weapons. In each case, the perpetrators of these crimes offered no extenuating circumstance for taking the life of another . Riley I, 496 A.2d at 1027.\n\nRiley challenges this finding on two grounds. First, he points to the fact that two of the death sentences r elied on -- Rush and Whalen -- had been vacated. Second, he argues that the remaining cases -- Deputy, Bailey, and Flamer -- do not furnish appropriate comparisons because each involved the killing of more than one person. He maintains that these errors violated the Eighth and Fourteenth Amendments.\n\nIt is clear that proportionality review is not required by the federal Constitution. See Pulley v. Harris , 465 U.S. 37, 50-51 (1984). Riley justifies advancing his pr oportionality argument in federal court on two grounds. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e First, he argues that the allegedly improper r review resulted in a punishment that was \"inherently dispr oportionate and, therefore, arbitrary and capricious\" in violation of the Eighth Amendment. Appellant's Br. at 56. Second, he argues that Delaware's failure to abide by its own statutory scheme for proportionality review violated due process. See Fetterly v. Paskett, 997 F.2d 1295, 1300 (9th Cir. 1993) (\"the failure of a state to abide by its own statutory commands may implicate a liberty interest pr otected by the Fourteenth Amendment against arbitrary deprivation by a state\").\n\nRiley bases his first argument on the principle that \"[i]f a State has determined that death should be an available penalty for certain crimes, then it must administer the penalty in a way that can rationally distinguish between those individuals for whom death is an appropriate sanction and those for whom it is not.\" Spaziano v. Florida, 468 U.S. 447, 460 (1984). Riley claims that the proportionality review conducted by the Delaware Supreme Court in his case failed to protect him fr om arbitrary imposition of the death penalty, and in fact upheld a disproportionate punishment. This argument rests on the premise that applying the death penalty in Riley's case would be so disproportionate as to constitute cruel and unusual punishment under the Eighth Amendment. Therefore, Riley's argument r eally attacks the imposition of the penalty itself, rather than the state's method of reviewing proportionality.\n\nRiley's argument is not tenable. The Supr eme Court has \"occasionally struck down punishments as inher ently disproportionate, and therefore cruel and unusual, when imposed for a particular crime or category of crime.\" Pulley, 465 U.S. at 43. However, in this case, Riley's crime --killing a defenseless person without provocation in the course of an armed robbery -- is not such that application of the death penalty in these circumstances would \"shock the conscience.\" See Lindsey v. Smith, 820 F.2d 1137, 1154 (11th Cir. 1987); Spinkellink v. W ainwright, 578 F.2d 582, 606 n.28 (5th Cir. 1976). Riley has thus failed to show an Eighth Amendment violation.\n\nRiley's second argument is based on the principle that when a state creates a right, the Due Pr ocess clause of the Fourteenth Amendment entitles a defendant to pr ocedures to ensure that the right is not arbitrarily denied. He argues that the Delaware Supreme Court, by failing to conduct an adequate proportionality review as r equired by state statute, denied him due process.\n\nAs a threshold matter, it is unclear whether, under Third Circuit law, a state proportionality-r review statute creates any cognizable liberty interest for due pr ocess purposes. See Frey v. Fulcomer, 132 F.3d 916, 925 n.7 (3d Cir. 1997) (noting that Supreme Court precedent on this issue is in flux). We need not address this question, however, because even if Riley has such a liberty interest, he has not shown any denial of due process. In evaluating a claim that a state court erred in conducting its proportionality review, a federal court may only inquire into whether the state court \"undertook its proportionality review in good faith and found that [the defendant's] sentence was pr oportional to the sentences imposed in cases similar to his.\" Walton v. Arizona, 497 U.S. 639, 656 (1990). Because ther e is no federal constitutional right to proportionality review, if the federal court finds that the review was undertaken in good faith, it cannot \"look behind\" the state court's conclusion of proportionality to consider whether the state court misapplied state proportionality law. See id.; Bannister v. Delo, 100 F.3d 610, 627 (8th Cir. 1996). In this case, the Delaware Supreme Court compared Riley's case with a substantial number of other death-eligible cases, and, even disregarding the two vacated death sentences, it found common characteristics between Riley's case and thr ee other cases in which the sentence was not vacated. Although Riley argues that these cases ar e not entirely analogous, because each contained an additional aggravating factor (more than one victim), ther e is no indication that the Delaware court acted in bad faith in conducting its review. We are thus without power to order habeas relief.\n\nXI.\n\nWe now turn to Riley's contentions concerning jury instructions given by the trial judge at the sentencing phase.\n\nA.\n\nRiley argues that the jury instructions at the penalty phase impermissibly restricted the jury's consideration of mitigating circumstances. He takes issue with the following instruction, issued at the start of the penalty hearing:\n\nA sentence of death shall not be imposed unless the jury finds:\n\n(1) Beyond a reasonable doubt at least one statutory aggravating circumstance; and\n\n(2) Unanimously recommends, after weighing all relevant evidence in aggravation or mitigation which bears upon the particular circumstances or details of the commission of the offense and the character and propensities of the offender, that a sentence of death shall be imposed. Where the jury submits such a finding and recommendation, the Court shall sentence the defendant to death. A finding by the jury of a statutory aggravating circumstance, and a consequent recommendation of death, supported by the evidence, shall be binding on the Court. App. 392 (emphasis added).\n\nRiley contends that, given the placement of the word \"consequent,\" \"a reasonable jury could understand the underscored sentence to mean that the effect of a finding that a statutory aggravating circumstance existed, is that the death penalty must be imposed.\" Appellant's Br. 59. Because the trial judge had previously informed the jury that the statutory aggravating circumstance -- commission of the mur der during a robbery -- had already been proven beyond a reasonable doubt in the guilt phase, Riley argues that a reasonable jury could have read the instruction to mean that it need not consider mitigation evidence.\n\nWhen reviewing a jury instruction that is claimed to impermissibly restrict a jury's consideration of relevant evidence, a court must ask \"whether there is a reasonable likelihood that the jury has applied the challenged instruction in a way that prevents the consideration of constitutionally relevant evidence.\" Boyde v. California, 494 U.S. 370, 380 (1990). If there is \"only a possibility\" of such inhibition, however, the challenge must fail. Id. Moreover, the challenged instructions \"must be evaluated not in isolation but in the context of the entire char ge.\" Jones v. United States, 527 U.S. 373, 391 (1999).\n\nWhen the jury charge is read as a whole, there is no reasonable likelihood that a jury could have understood it to preclude consideration of mitigating cir cumstances. At the close of the penalty hearing, the court again instructed the jury in terms that cleared up any ambiguity that might have been present in its earlier instruction:\n\nIn conclusion, a sentence of death shall not be imposed unless you, the jury, find:\n\n(1) Beyond a reasonable doubt at least one statutory aggravating circumstance has been established; and\n\n(2) Unanimously recommend that a sentence of death be imposed after weighing all relevant evidence in aggravation and mitigation which bear upon the particular circumstances and details of the commission of the offense and the character and propensities of the offender.\n\nShould you fail to agree unanimously to either of these two matters, the Court shall sentence the defendant to life imprisonment without benefit of probation or parole. App. 438-40 (emphasis added).\n\nThis instruction made it clear that a jury was r equired both to find at least one statutory aggravator and to weigh aggravating factors against mitigating factors in or der to support a death sentence. This belies Riley's ar gument that the jury was misled into believing that its job was done once the felony murder aggravator was found.\n\nB.\n\nRiley next takes issue with the trial court's failur e at the penalty phase to instruct the jury that it was r equired to conclude unanimously that aggravating circumstances outweigh mitigating circumstances befor e imposing death, as required by Delaware law. See Whalen v. State, 492 A.2d 552, 560 (Del. 1985) (setting forth \"outweighing\" standard). Rather, the court simply instructed the jury that it had to \"[u]nanimously recommend that a sentence of death be imposed after weighing all relevant evidence in aggravation and mitigation.\" App. 438; see also App. 392, 437.\n\nThis argument provides no grounds for habeas relief. The federal Constitution does not require\"specific standards for balancing aggravating against mitigating cir cumstances.\" Zant v. Stephens, 462 U.S. 862, 876 n.13 (1983). As long as a jury is permitted to consider all relevant mitigating circumstances in making its death recommendation, there is no federal constitutional problem. In addition, Riley has not suggested how a jury's decision would be any dif ferent under the language the court used in this case. Because the jury was instructed not to make a sentencing recommendation until after it had \"weigh[ed] all relevant evidence in aggravation and mitigation,\" the necessary inference was that the death penalty should be imposed only if aggravating factors outweighed mitigating factors (otherwise, the entire \"weighing\" pr ocess would be meaningless).\n\nC.\n\nFinally, Riley argues that the penalty phase instructions improperly suggested that the jury had to be unanimous in imposing a life sentence, in violation of Whalen v. State, 492 A.2d 552, 562 (Del. 1985). He points to the instruction that \"[i]f you are not unanimous in your recommendation to impose the death penalty, or you cannot agr ee unanimously as to your recommendation, then the Court is bound to impose a sentence of life.\" App. 438 (emphasis added). The word \"recommendation\" in the underlined phrase, he suggests, could be read to refer to a life sentence recommendation as well as to a recommendation of death.\n\nAs a threshold issue, the government ar gues that Riley failed to raise this issue before the District Court because he based his argument there \"solely on the interpretation of the interrogatories posed to the jury\" rather than on the jury instruction he points to here. Appellee's Br. at 75. However, Riley, although pointing specifically to the interrogatories to support his point, nevertheless raised the general argument in his amended petition that\"the instructions were likely to confuse the jury about whether the verdict must be unanimous.\" App. 1191. This is sufficient to preserve his argument before this Court.\n\nOn the merits, however, Riley's claim must fail. First, when the jury charge is viewed as a whole, it reveals several instances in which the word \"unanimous\" was explicitly paired solely with the death recommendation. In light of this pattern, it appears unlikely that the jury would have viewed the isolated passage that Riley relies on as extending the unanimity requirement to a r ecommendation of life imprisonment. Second, the Delaware Supr eme Court, in reviewing this allegation, stated that it was \"satisfied that the jury understood that, in the event of its failur e to unanimously agree upon imposition of a death penalty, an imposition of life imprisonment would result.\" Riley V, 585 A.2d at 725. Because the instruction made clear that the default rule in case of a lack of unanimity was life imprisonment, it is hard to see how the jury's deliberations would have been affected even had it adopted Riley's interpretation of the instruction. Finally, the challenged instruction was identical to one approved by the Delaware Supreme Court in Flamer v. State, 490 A.2d 104 (Del. 1984), aff 'd sub nom. Flamer v. Delaware, 68 F.3d 710 (3d Cir. 1995) and Flamer v. Delaware , 68 F.2d 736 (3d Cir. 1995) (en banc). The Delaware Supreme Court explicitly pointed to the similarities with Flamer, and distinguished the instructions from those in Whalen, in upholding the death sentence on direct appeal. See Riley , 585 A.2d at 722-25. For these reasons, we reject Riley's claim.\n\nXII.\n\nRiley was convicted of intentional murder and felony murder, with the underlying felony beingfirst-degree robbery. The statutory aggravating circumstance relied on for the death sentence was that the murder was committed while Riley was engaged in the commission of first degree robbery. See 11 Del. C. S 4209(e)(1)(j) (establishing felony murder aggravator). Riley argues that it is unconstitutional to double-count robbery as both an element of the crime (felony murder) that made Riley death-eligible and as a statutory aggravating circumstance.\n\nThis Court rejected precisely the same claim in Deputy v. Taylor, 19 F.3d 1485,1502 (3d Cir . 1994), holding that \"within the context of Delaware's death penalty statute, the provision requiring the double-counting of the felony at the guilty phase and sentencing phase does not imper missibly weaken the statute's constitutionally mandated narr owing function.\" This precedent binds our panel.\n\nXIII.\n\nRiley's final argument is that the District Court erred in denying his motion for funds for investigative and expert assistance and in refusing to conduct an evidentiary hearing. We disagree.\n\nA.\n\nUnder 18 U.S.C. S 3006A(e) and 21 U.S.C. S 848(q)(4)(B) and (9), Riley was entitled to investigative and expert assistance upon a finding that such assistance was \"necessary\" or \"reasonably necessary\" with respect to his representation in the habeas proceeding. Riley sought the services of an investigator to gather additional evidence concerning his childhood experiences. He sought the services of a forensic psychiatrist to develop further mitigating evidence concerning his mental pr oblems. All of these services were requested in or der to support Riley's arguments that his trial attorney was ineffective at the penalty phase and that the trial judge should have appointed a co-counsel and investigator to assist him.\n\nRiley has not shown that the services in question were \"necessary\" or \"reasonably necessary.\" The discovery at the time of the federal habeas proceeding of new evidence about Riley's childhood would not have shown that the ef forts of Riley's trial attorney to locate family members who might have testified about such matters were objectively unreasonable. See pages 30-33, supra. Nor would the discovery of such evidence have demonstrated that it was strategically unreasonable for Riley's trial attorney to eschew a penalty-phase defense based on Riley's\"social history.\" See id. Similarly, the development of additional evidence regarding Riley's mental condition at the time of the federal habeas proceeding would not have shown that Riley's trial attorney was objectively unr easonable in not seeking a mental examination prior to the penalty. See pages 33-35, supra.\n\nB.\n\n\"Where the District Court denies the petition for a writ of habeas corpus in the absence of an evidentiary hearing,\" we ask, first, \"whether the petitioner asserts facts which entitle him to relief \" and, second, \"whether an evidentiary hearing is needed.\" Todaro v. Fulcomer , 944 F.2d 1079, 1082 (3d Cir. 1991). See also Heiser v. Ryan, 951 F.2d 559, 561 (3d Cir. 1991). Riley argues that the District Court should have held an evidentiary hearing concerning the pr osecution's peremptory challenges, the impartiality of the jury, his Brady claim, and other unspecified issues. W e disagree. As previously discussed, we are requir ed to accept the state courts' findings regarding the per emptory challenges and the impartiality of the jury, and those findings are dispositive. Thus, an evidentiary hearing in federal court on those matters was not needed. In addition, in light of the revelation after briefing that no conversation in which Baxter participated is listed in the logs of the wir etap on Mrs. Baxter's telephone, it is clear that ther e was no need for an evidentiary hearing concerning Riley's Brady claim. Nor do we believe that the District Court was an evidentiary hearing was needed on any other matter.\n\nXIV.\n\nFor the reasons explained above, the decision of the District Court is affirmed.\n\nSLOVITER, Circuit Judge, Dissenting.\n\nThe considerable deference that we are obliged to give to state court findings of fact does not requir e that we give uncritical acceptance to a prosecutor's story merely because a state judge accepted it when the story cries out for skepticism and is inherently improbable. The prosecutor would have us believe that six years after the trial, without the help of contemporaneous notes, he remember ed (for the first time) that a prospective juror paused (\"a significant pause\") before the juror answer ed the trial judge's voir dire inquiry whether he would be able to retur n a death penalty. And the prosecutor would have us believe that he exercised one of the state's peremptory challenges to strike the juror for that reason. The fact that the juror was black supposedly was irrelevant to the prosecutor's decision.\n\nThe same prosecutor would also have us believe that he struck another juror (the second of the thr ee prospective black jurors) because he wanted to be excused so he could return to work (which the prospective juror later testified he never requested). Inexplicably, the prosecutor who remembered the black juror who allegedly paused (although he made no note of it) could not remember that he did not strike a white juror who really did want to be excused because of work, even though the prosecutor had made a note that that juror \"want[ed] off.\" As a result, there were no black or other minority jurors on appellant Riley's petit jury. And there were no black jurors on any capital case tried by that prosecutor's office that year . The prosecutor's story strains credulity even further when it is recalled that on the direct appeal to the Delaware Supr eme Court in this case the State's alternative argument defended the use of peremptory challenges to exclude jurors based on \"group association,\" a euphemism for race.\n\nI dissent from the majority opinion because I believe the record in this case compels the conclusion that the prosecution, in pursuing its express goal of \"mak[ing] sure that James Riley received the death penalty,\" App. at 797, violated Riley's constitutional rights under Batson v. Kentucky, 476 U.S. 79 (1986), and Caldwell v. Mississippi, 472 U.S. 320 (1985).\n\nI.\n\nThe victim in this case, James Feeley, was a 59 year old white man who was shot to death during a robbery of his liquor store in Dover, Delaware. As the majority notes, the robbers were leaving after grabbing some cash and shooting Feeley in the leg when Feeley threw a wine bottle, which apparently precipitated the shot that killed him. Appellant Riley, a 22 year old black man, Tyrone Baxter , and Michael Williams were arrested for his mur der. Riley was represented at trial by appointed counsel, a defense-side civil litigator who had never represented a criminal defendant in either a murder or a capital case. Riley was tried and convicted before an all-white jury and, four days later, was sentenced to death. Riley's attor ney, who spent only fourteen hours preparing for the penalty phase, explained to the trial court that he had been too busy \"with the defense and the merits\" to spend more time building a case in mitigation. App. at 443-44.\n\nThe prosecutors in Riley's case were James Liguori and Mark McNulty. Liguori, the lead prosecutor , was a friend and neighbor of Feeley's, and his stated intent was\"to make sure we were not only going to get a conviction of murder in the first degree, but also the death penalty.\" App. at 797. While that goal was not unlawful, on this r ecord I can only conclude that the prosecution, in at least two respects, overstepped the line drawn by Supr eme Court cases.\n\nII. The Batson Claim\n\nA. Evidence of Peremptory Strikes in Kent County\n\nAfter general voir dire and dismissals for cause in Riley's trial, three prospective black jur ors remained available to serve on the jury: Ray Nichols, Lois Beecher , and Charles McGuire. The prosecution used three of its peremptory challenges to remove them, and Riley was tried and sentenced before an all-white jury.\n\nIt is well-settled that the Equal Protection Clause prohibits discrimination on account of race in selection of both the venire and the petit jury. See Batson, 476 U.S. at 88. This principle, which dates back at least as far as Strauder v. West Virginia, 100 U.S. 303 (1880), recognizes that racial discrimination in selection of jur ors harms \"not only the accused whose life or liberty they ar e summoned to try,\" Batson, 476 U.S. at 87, but also harms the potential juror, whose race \"simply`is unrelated to his fitness as a juror.' \" Id. (quoting Thiel v. Southern Pac. Co., 328 U.S. 217, 227 (1946) (Frankfurter, J., dissenting)).\n\nUnder Batson, the defendant who seeks to establish that the state's use of peremptory challenges violated the Equal Protection Clause must first make a prima facie showing of a constitutional violation. Once the defendant makes that showing, the prosecution must articulate a race-neutral explanation for its use of a peremptory challenge and, if it does, the trial court must determine whether the defendant has proven purposeful discrimination. See Simmons v. Beyer, 44 F.3d 1160, 1167 (3d Cir . 1995). Judge Steele, the judge in the Superior Court of Delaware (a trial court) who presided over Riley's post-conviction pr oceedings, determined, and the state does not contest, that Riley made out a prima facie case of discrimination in jury selection. Accordingly, he conducted an evidentiary hearing to determine whether Riley had established purposeful discrimination.\n\nAt the hearing, Liguori, the state's principal witness, proffered race-neutral reasons for the prosecution's decision to strike three black jurors fr om Riley's case. In reply, Riley presented evidence that in addition to the three jurors in his trial, the Kent County Pr osecutor's office used its peremptory challenges to remove every prospective black juror in the three other first-degr ee murder trials that occurred within a year of his trial. Riley also presented evidence specific to his case that the prosecution had failed to apply its purportedly race-neutral criteria evenhandedly with respect to the prospective black jur ors. The court rejected Riley's Batson claim without mentioning any of this evidence, and the Delaware Supreme Court affirmed, likewise without discussion of this evidence. In my view, the record simply does not support the purported race-neutral reason with respect to at least one of the three jurors. Although I also question the state's use of peremptory challenges to strike the two other black jurors in Riley's case, the exclusion of even one jur or on the basis of race violates the Constitution. See Harrison v. Ryan, 909 F.2d 84, 88 (3d Cir. 1990). The evidence of the striking of the black jurors in Riley's trial is mor e telling when viewed in the light of the state's similar conduct in contemporaneous trials.\n\nAt the post-conviction hearing, Riley presented evidence that the Kent County Prosecutor used per emptory challenges to remove every prospective black juror, not only in his trial but also in three other first-degree murder trials that occurred within a year of his trial. In these four trials (including Riley's), the prosecution struck all eight prospective black jurors who were called, i.e., 100 percent. By contrast, the prosecution used its per emptory challenges to strike only 23 of the 71 prospective white jurors, or 32 percent.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nAt the post-conviction hearing, counsel for the state objected to the admission of this evidence, ar guing that evidence of general prosecutorial practices was relevant only to Riley's prima facie case. The court r ejected this argument and admitted the evidence, explaining that the evidence was being offered to show that\"the peremptory challenges in this particular case followed some kind of pattern that exists in the prosecutorial actions in first degree murder cases involving minority defendants.\"\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e App. at 872.\n\nCounsel for the state then requested and r eceived an additional month in which to \"attempt to pr epare the same sort of information which we feel would be contrary to the representations made by [Riley's counsel].\" App. at 874. He informed the Superior Court that he had not yet been able to obtain materials from other cases, but he assured the court that \"they do exist.\" App. at 874. However, approximately one month after the hearing the state submitted a letter expressly declining to supplement the record with evidence from other cases. In fact, the state never even argued to the Superior Court that Riley's evidence failed accurately to represent Kent County prosecutorial practices, and it has not so ar gued to this court either.\n\nTypically, \"[w]here relevant infor mation . . . is in the possession of one party and not provided, then an adverse inference may be drawn that such information would be harmful to the party who fails to provide it.\" McMahan \u0026 Co. v. Po Folks, Inc., 206 F.3d 627, 632 (6th Cir. 2000) (quotation omitted); see also Interstate Cir cuit, Inc. v. United States, 306 U.S. 208, 226 (1939) (\"The pr oduction of weak evidence when strong is available can lead only to the conclusion that the strong would have been adverse.\"). However, the majority declines to give Riley's evidence \"any weight\" whatsoever. Maj. Op. at 16. The majority gives several reasons for its decision to disr egard this evidence, none of which is persuasive and all of which ar e wrong. For example, the majority states that in two of the trials -- Daniel Pregent's and Judith McBride's-- the defense apparently did not raise a Batson objection. The majority argues that \"it is doubtful that the patter n of strikes [in Pregent's case] . . . sufficed to make out a prima facie case,\" id., and that, with respect to McBride's trial, there is no way of determining whether any jurors wer e removed because of their race. These are non-sequiturs. Riley had to prove discrimination in his trial, not in Pr egent's and McBride's. If the majority's point is that Riley's evidence is irrelevant unless each separate component was itself established to be a Batson violation, that proposition has no basis in the law or in common sense. The evidence demonstrates a pattern of striking black jur ors at significantly higher rates than white jurors. One permissible (indeed, the most plausible) infer ence to be drawn from the data is that the Kent County Pr osecutor followed a pattern of using peremptory challenges in a racially discriminatory manner. Indeed, that is precisely the purpose for which the Superior Court admitted this evidence.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nThe majority seeks to dispel, or at least neutralize, the unmistakable inference to be drawn from this pattern of striking all black jurors by pr offering explanations that the prosecutor never proffered in the state proceedings. The majority even excuses the failure of the state to produce any evidence to counter Riley's statistical evidence by suggesting that the data \"did not raise an infer ence of discrimination, and thus additional data wer e not needed to refute Riley's statistical showing.\" Maj. Op. at 17.\n\nAt most, the majority can simply state the obvious-- that the evidence presented by Riley is imper fect. The most glaring imperfection is, of course, the small size of Riley's sample. Conceivably, evidence from other trials might cast the practices in Kent County in a differ ent light. But it was the state, not Riley, that would have had access to such evidence, it was the state that asserted that such evidence was available and forthcoming, and it was the state, not Riley, that failed to provide it. Riley's evidence from prior trials was powerful evidence in his favor , and I believe the failure of the Superior Court, which had pr eviously acknowledged the relevance of this evidence, to mention it and include it in the calculus leading to its final decision to deny Riley's post-conviction motion undermines that decision.\n\nB. Evidence of Pretext\n\nI am equally troubled by the failure of the state courts to discuss the evidence Riley presented to contradict the race-neutral reasons offered by the pr osecution for striking the black jurors in his trial. At the post-conviction hearing, held six years after Riley's trial, Liguori testified that the prosecution's strategy in Riley's trial was\"to make sure we were not only going to get a conviction of mur der in the first degree, but also the death penalty.\" App. at 797. He also testified that the prosecutors wanted\"to have minority representation on the jury panel,\" App. at 792-93, and attempted to explain the prosecution's decision to challenge all three prospective black jurors. I will focus here on two of these jurors, Ray Nichols and Charles McGuir e.\n\nWith respect to Nichols, Liguori r emembered clearly that \"Mr. Nichols was an individual who, and unfortunately the record doesn't reflect this, who was not, in my particular mind, not certain with regard to being able to return a verdict for death.\" App. at 797-98. The r ecord reflects no such uncertainty on Nichols's part. At voir dir e, Nichols answered the two questions posed by the court r egarding the jurors' willingness to sentence a defendant to death in a manner seemingly favorable to the prosecution:\n\nQ: Do you have any conscientious scruples against finding a verdict of guilty where the punishment might be death or against imposing the death penalty even if the evidence should so warrant?\n\nA: No.\n\nQ: Regardless of any personal beliefs or feelings that you may have, if the evidence justified it, would you be able to find a person guilty of mur der in the first degree and would you be able to impose the death penalty.\n\nA: I think so. App. at 226-27.\n\nNonetheless, Liguori struck Nichols because, as he explained at the post-conviction hearing, \"ther e was a pause and a significant pause in [Nichols's] answering [the court's] inquiry.\" App. at 798-99. Despite this alleged pause, the prosecutors did not ask the trial court to remove Nichols for cause or to inquire further into Nichols's willingness to award the death penalty.\n\nWith respect to Charles McGuire, Liguori's memory was also clear. He stated:\n\nI remember this one. Mr. McGuire was an individual who had requested -- remember, this was going to be around Christmas also.\n\nMr. McGuire had previously requested to be excused from jury service. When Mr. McGuir e came up, the first thing I wanted to make clear -- as I said earlier , I wanted someone that was going to be attentive and you can read all the books you want with regar d to selecting prospective jurors and it is always make sure you have attentive jurors, people not concer ned about getting home early to take care of their kids, or vacation.\n\nMr. McGuire himself had requested the Court to excuse him. The Court didn't. When he went thr ough his inquiry, we asked the judge to excuse him for cause. The judge said no. It then left us with no alternative but to think he would not give his full time and attention and therefore we struck Mr . McGuire. App. at 801 (emphasis added).\n\nMcGuire's presumed inability to \"give his full time and attention\" was the only reason Liguori offered for excluding him.\n\nOn cross-examination, Riley's attorney introduced Liguori's handwritten notes from voir dir e at Riley's trial. Written next to McGuire's name was the word \"Out.\" Among the names on the same page was that of Charles Reed, a white man who was ultimately seated on the jury. Next to Reed's name on the sheet was written, \"works Lowe's, wants off.\" App. at 823.\n\nDespite repeated efforts by Riley's counsel to refresh his recollection, Liguori testified that he had no recollection of Reed, a juror who actually served on Riley's trial. Liguori agreed, however, that the notation next to Reed's name indicated that Reed had requested to be excused from service on the jury. Liguori offered no explanation for his decision not to strike Reed.\n\nThe similarity between the two prospective jur ors is obvious -- in each case the state believed that the juror wanted to be excused. The only distinction between the jurors apparent on the record is equally obvious --McGuire, who was struck, is black; Reed, who was retained, is white.\n\nNonetheless, as with Riley's evidence of the patter n of race-based strikes in other trials, the state courts failed even to mention this evidence and the majority strains to find reasons to disregard it. The majority asserts, for example, that \"Reed may have had a r elatively weak desire and reason to be excused, and his situation may not have been at all comparable in this respect to McGuire's.\" Maj. Op. at 24 (emphases added). The majority further explains that it is not willing to assume \"that Reed's desire to be excused was related to his employment.\" Id. at 24 n.12. This \"distinction\" between Reed and McGuir e is not only unsupported by the record, it is irr elevant. Liguori did not testify, nor can it be inferred from his testimony, that it was significant that McGuire's purported desir e to be excused was work-related. Instead, Liguori testified that he struck McGuire because he believed McGuire wanted off the jury and would therefore not be attentive at trial. The record strongly suggests that justification applied equally to Reed.\n\nThe comparison between Reed and McGuire is telling evidence that the prosecution's asserted justification for striking McGuire was pretextual. See Turner v. Marshall, 121 F.3d 1248, 1251-52 (9th Cir. 1997) (\"A comparative analysis of jurors struck and those remaining is a well-established tool for exploring the possibility that facially race-neutral reasons are a pretext for discrimination.\"). This evidence alone is strongly suggestive of the race-based use of peremptory challenges. See, e.g., Devose v. Norris, 53 F.3d 201 (8th Cir. 1995) (Batson violation where only justification prosecutor offered for striking three out of four black jurors with prior jury experience was that jurors might be \"burned out\" by prior service; at least five white jurors were not stricken although they had previously served on juries); Garrett v. Morris, 815 F.2d 509, 514 (8th Cir. 1987) (prosecutor's explanation for striking black jurors \"seems clearly pretextual in light of his decision not to strike white jurors who differed in no significant way\"); see also Turner, 121 F.3d 1253-54 (r eversing, under clear error standard, finding that prosecutor did not discriminate in jury selection where sole justification of fered for striking a black juror applied equally to non-stricken white juror); Jones v. Ryan, 987 F.2d 960 (3d Cir . 1993) (reversing, under plenary review, denial of habeas r elief where prosecutor did not apply purportedly race-neutral policy to similar white jurors).\n\nHowever, we need not view each piece of evidence in isolation. It is clear that \"[a]n explanation for a particular challenge need not necessarily be pigeon-holed as wholly acceptable or wholly unacceptable. The relative plausibility or implausibility of each explanation for a particular challenge . . . may strengthen or weaken the assessment of the prosecution's explanation as to other challenges.\" United States v. Alvarado, 923 F.3d 253, 256 (2d Cir. 1991). In short, \"[a] reviewing court's level of suspicion may also be raised by a series of very weak explanations for a prosecutor's peremptory challenges. The whole may be greater than the sum of its parts.\" Caldwell v. Maloney, 159 F.3d 639, 651 (1st Cir. 1998).\n\nDespite the majority's efforts to explain away the various parts of the evidentiary picture Riley has presented, the record as a whole squarely contradicts the Superior Court's decision. First, the prosecution offer ed a highly dubious justification for its decision to strike Ray Nichols. While standing alone the questionable nature of this explanation might not carry much weight, the prosecution's explanation for striking Nichols must be evaluated in light of not only the uncontested evidence of the use of peremptory strikes in Kent County but also the evidence of pretext in the striking of Charles McGuire. Viewed as a whole, I believe this evidence requires a finding contrary to that reached by the Superior Court.\n\nIn the end, the majority's result can be justified on little more than the presumption of correctness afforded state court fact-finding in habeas proceedings. The version of 28 U.S.C. S 2254(d) that applies to this case r equires us to defer to state court findings that are \"fairly supported by the record.\" 28 U.S.C. S 2254(d)(8). While I do not deny that the limited nature of our review r eflects important policy considerations, see, e.g., Miller v. Fenton, 474 U.S. 104, 114 (1985) (presumption recognizes that \"as a matter of the sound administration of justice, one judicial actor is better positioned than another to decide the issue\"), the presumption of correctness does not \"so limit federal review that it is a nullity.\" Caldwell v. Maloney , 159 F.3d 639, 651 (1st Cir. 1998). In this respect, Ligouri's explanation of the strikes of black jurors is neither \"coher ent\" nor \"facially plausible,\" the express limitation that the Supreme Court itself included in commenting on the deference to be given a judge's credibility finding in Anderson v. Bessemer City, 470 U.S. 564, 575 (1985), in the very quote r epeated by the majority. See Maj. Op. at 18-19 n.8.\n\nIn this case there is not only the substantial evidence of the race-based use of peremptory challenges in contemporary trials but there is also evidence that throws into question the explanation offered by the prosecutor for striking at least one of the black jurors in Riley's case. The state courts rejected Riley's Batson claim without discussing any of the ample evidence favorable to Riley and the majority points to nothing relevant in the record that might otherwise support the state courts' decisions. Looking at the key to the state's case, the striking of Nichols allegedly because he paused in answering the court's inquiry whether he could impose the death penalty, the majority lamely responds that a significant pause \"is not something that a transcript is likely to capture.\" Maj. Op. at 19 n.9. But the prosecutor did make notes during the voir dire as to decisions whether to strike other jurors, but offered no contemporaneous note as to Nichols' \"pause.\" In a death case, a pause, even \"a significant pause,\" conveniently recalled by the pr osecutor six years after jury selection, is a slim reed on which to sustain the prosecutor's explanation, particularly when that explanation is unsupported by any recor d evidence. No principle of deference to state court fact-finding can justify this court's rejection of Riley's Batson claim.\n\nIII. The Caldwell Claim\n\nI believe the majority's conclusion that Riley failed to establish a violation of Caldwell v. Mississippi , 472 U.S. 320 (1985), is similarly faulty. In Caldwell the Supreme Court held that prosecutorial comments str essing that the jury's sentence would be reviewed for corr ectness by the state supreme court violated the Eighth Amendment by leading the jury to believe that ultimate responsibility for determining the appropriateness of the death sentence rested with an appellate court. As the Supr eme Court later explained, prosecutorial comments that \"mislead the jury as to its role in the sentencing process in a way that allows the jury to feel less responsible than it should for the sentencing decision\" are prohibited. Romano v. Oklahoma, 512 U.S. 1, 9 (1994) (quotation omitted).\n\nRelying on the principle that a prosecutor's r emarks do not violate Caldwell unless \"they impr operly describe[ ] the role assigned to the jury by local law,\" id. (quotation omitted), the majority rejects Riley's Caldwell claim. The statements made by the prosecutor in Riley's trial, however, were no more accurate than those in Caldwell.\n\nIn Caldwell, the defense attorney in a capital murder case pleaded with the jury in closing arguments at the sentencing phase to spare the defendant's life. In reply, the prosecutor stated:\n\nLadies and gentlemen, I intend to be brief. I'm in complete disagreement with the approach the defense has taken. I don't think it's fair. I think it's unfair. I think the lawyers know better. Now, they would have you believe that you're going to kill this man and they know -- they know that your decision is not the final decision. My God, how unfair can you be? Y our job is reviewable. They know it. Caldwell, 472 U.S. at 325 (emphases added).\n\nDefense counsel objected to this statement but the trial court overruled the objection, stating that it was\"proper that the jury realizes that it is reviewable automatically as the death penalty commands.\" Id. The pr osecutor continued:\n\nThroughout their remarks, they attempted to give you the opposite, sparing the truth. They said `Thou shalt not kill.' If that applies to him, it applies to you, insinuating that your decision is the final decision and that they're gonna take Bobby Caldwell out in the front of this Courthouse in moments and string him up and that is terribly, terribly unfair. For they know, as I know, and as Judge Baker has told you, that the decision you render is automatically reviewable by the Supreme Court. Automatically, and I think it's unfair and I don't mind telling them so. Id. at 325-26.\n\nAlthough the jury's sentence in Caldwell was indeed subject to automatic review by the state supr eme court, Justice O'Connor, who cast the fifth and deciding vote, emphasized that \"[j]urors may harbor misconceptions about the power of state appellate courts or, for that matter, [the Supreme Court] to override a jury's sentence of death.\" Id. at 342 (O'Connor, J., concurring). Accor ding to Justice O'Connor, the prosecutor's statements were impermissible because they conveyed to the jury that automatic appellate review \"would provide the authoritative determination of whether death was appropriate\" whereas under state law\n\nthe relevant scope of review was limited to whether the verdict was \"so arbitrary that it was against the overwhelming weight of the evidence.\" Id. at 343 (O'Connor, J., concurring) (quotation omitted).\n\nIn Riley's case, Liguori began his opening comments in the penalty phase by stating:\n\nLet me say at the outset that what you do today is automatically reviewed by our Supreme Court and that is why there is an automatic review on the death penalty. That is why, if you return a decision of death, that is why you will receive and have to fill out a two- page interrogatory that the Court will give you. This is an interrogatory that specifically sets out the questions that the State request and whether or not you believe it beyond a reasonable doubt and if you want in your determination, if you believe the sentence should be death than each and every one of you has to sign this. This goes to the Supreme Court. That is why it is concise and we believe clear and it should be looked carefully on and answered appropriately. App. at 393 (emphasis added).\n\nThe majority concludes that this statement was accurate because Delaware law provides for automatic review of the jury's sentence. But, as in Caldwell, the automatic review conducted by the Delaware Supreme Court is extremely limited. At the time of Riley's sentencing hearing, the relevant portion of the capital sentencing statute provided:\n\nThe Supreme Court shall limit its review under this section to the recommendation on and imposition of the penalty of death and shall determine:\n\na. Whether, considering the totality of evi dence in aggravation and mitigation which bears upon the particular circumstances or details of the of fense and the character and propensities of the of fender, the death penalty was either arbitrarily or capriciously imposed or recommended . . . . Del. Code Ann. tit. 11, S 4209(g)(2) (emphasis added).\n\nLike the prosecutor's statement in Caldwell , Liguori's reference to automatic appellate r review was misleading as to the scope of appellate review. As a majority of the Court explained in Caldwell, jurors may not understand the limited nature of that review, which af fords substantial deference to a jury's determination that death is the appropriate sentence. See Caldwell, 472 U.S. at 330-31. Furthermore, jurors who are unconvinced that death is the appropriate punishment but who are eager to send a message of disapproval for the defendant's acts might be \"very receptive to the prosecutor's assurance that [they] can more freely err because the error may be corrected on appeal.\" Id. at 331 (quotation omitted). As one of our sister circuits has explained, \"[f]or the jury to see itself as advisory when it is not, or to be comforted by a belief that its decision will not have effect unless others make the same decision, is a frustration of the essence of the jury function.\" Sawyer v. Butler, 881 F .2d 1273, 1282 (5th Cir. 1989).\n\nThe majority suggests that Liguori's comments simply described to the jury the interrogatory for m they would have to answer during their deliberations. But the interrogatory form contained only two questions: whether the jury found, unanimously and beyond a reasonable doubt, that an aggravating circumstance existed,\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e and, if the jury answered \"yes,\" whether it unanimously recommended a sentence of death. Liguori's comments, then, were specifically directed to the jury's balancing of aggravating and mitigating factors and alerted the jury to the fact that the Delaware Supreme Court would automatically review its decision to impose a death sentence.\n\n\"The sentencing decision in capital cases is bor n out of an inherent and unique mixture of anger , judgment and retribution, and requires a deter mination whether certain acts are so beyond the pale of community standards as to warrant the execution of their author.\" Id. at 1278. Perhaps more than any other decision render ed by a jury, a sentence of death is \"irreducibl[y] discretionary.\" Id. Indeed, in Delaware the jury's weighing of aggravating and mitigating circumstances was, for all practical purposes, final. I have found no published opinion during the relevant time period in which the Delaware Supreme Court reversed a jury's sentence of death as arbitrarily or capriciously imposed.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nIn Caldwell, the Supreme Court noted that \"[b]elief in the truth of the assumption that sentencers treat their power to determine the appropriateness of death as an awesome responsibility has allowed this Court to view sentencer discretion as consistent with-and indeed as indispensable to-the Eighth Amendment's need for reliability in the determination that death is the appropriate punishment in a specific case.\" Caldwell, 472 U.S. at 330 (quotation omitted). It follows that there is particular concern \"when there are state-induced suggestions that the sentencing jury may shift its sense of responsibility to an appellate court.\" Id.\n\nI am unwilling to treat the prosecutor's pointed reference to appellate review of this crucial decision as lightly as does the majority. A statement, like that made by the pr osecutor here, \"can be literally true but quite misleading by failing, for example, to disclose information essential to make what was said not misleading.\" Sawyer, 881 F .2d at 1285. As a result, a violation of Caldwell may be established where a technically accurate statement describing the state appellate review process nonetheless \"misled the jury to minimize its role in the sentencing process.\" Driscoll v. Delo, 71 F.3d 701, 713 \u0026 n.10 (8th Cir. 1995) (prosecutor violated Caldwell by emphasizing that trial judge could disregard jury's recommendation of death; although technically an accurate statement of law, no state judge \"ha[d] ever spared a murder er the death penalty when a jury ha[d] recommended it\").\n\nGiven the limited nature of the Delawar e Supreme Court's review of a jury's sentence of death at the time, I believe that there was a Caldwell violation in this case. At no time did the prosecution bring the limited scope of review to the jury's attention and, despite the majority's statement to the contrary, nothing the trial court said could have corrected any misimpression left by the prosecution's comments.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e Moreover, although Liguori's remark was brief, the opening statement was too; it consumed only 3-1/2 pages of transcript, 1/2 page of which was the passage reprinted above. It is clear that a statement does not have to be lengthy to be effective in suggesting to the jury that ultimate responsibility for sentencing lies elsewhere. Unlike the facts in Jones v. Butler, 864 F.2d 348, 360 (5th Cir. 1988), where the court held that the pr osecutor's statement that \"[I]f, in fact, you do retur n the death penalty that yours will not be the last word. Every sentence is reviewed by the Supreme Court,\" was improper but cured by prompt defense objection and curative instruction, her e there was no curative instruction.\n\nOn these facts, I disagree with the majority that the prosecutor's comments were simply \"accurate unemotional, passing remarks in the context of describing the state statute.\" Maj. Op. at 42. Nothing in the r ecord indicates whether the statements were, in fact, \"unemotional,\" and I find it curious that the only portion of the Delaware statute the prosecutor chose to explain was the pr ovision for automatic review of the jury's sentence. Caldwell and its progeny make clear that \"the sentencing jury must continue to feel the weight of responsibility so long as it has responsibility.\" Sawyer, 881 F .2d at 1282. Because I believe that the prosecutor's remarks misled the jury into thinking the Delaware Supreme Court was the final arbiter of Riley's fate, I dissent from this portion of the majority opinion as well.\n\nIV. Conclusion\n\nI believe this is an appropriate case for the issuance of a writ of habeas corpus. One of the principal objections to the operation of the death penalty in this country is that it is applied unevenly, particularly against poor black defendants. I am afraid that the majority's decision will do nothing to dispel that view.\n\nA True Copy:\n\n\u003cspan class=\"fn\"\u003e1. Although Riley was tried years before Batson was decided, the Supreme Court did not deny certiorari in Riley's direct appeal until shortly after Batson was handed down, and therefore Riley is entitled to the benefit of that decision. Griffith v. Kentucky, 479 U.S. 314, 328 (1987); Deputy v. Taylor, 19 F.3d 1485, 1491 n.6 (3d Cir. 1994).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Riley's federal habeas petition was filed before the effective date of the current version of 28 U.S.C. S 2254, which was enacted as part of the Antiterrorism and Effective Death Penalty Act of 1996, 110 Stat. 1214. Therefore, the prior version of S 2254 applies. See Lindh v. Murphy, 521 U.S. 320 (1997).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The standard of causation for a discrimination claim has been explored in depth in other contexts. See, e.g., Price Waterhouse v. Hopkins, 490 U.S. 228 (1989) (Title VII);Watson v. SEPTA, 207 F.3d 207 (3d Cir. 2000) (same); Miller v. CIGNA Corp., 47 F.3d 586 (3d Cir. 1995) (en banc) (same). When a civil plaintiff seeks to recover for a constitutional violation, the plaintiff must initially show that an unconstitutional factor was a \"motivating factor\" in the decision. Mt. Healthy City School Dist. Bd. of Educ. v. Doyle, 429 U.S. 274, 287 (1977). The defendant may then avoid liability by pr oving that the same decision would have been made even if the unconstitutional factor had not been considered. Id. See Hunter v. Underwood, 471 U.S. 222, 227 (1985) (applying Mt. Healthy to a claim of racial discrimination). In the end, then, the standard is essentially but-for causation, and we are inclined to think that this is the proper standar d under Batson. This would mean that a peremptory challenge is unconstitutional if, and only if, the lawyer would not have made it but for the potential jur or's race, sex, etc. Here, however, because of the reasons explained in text, we do not find it necessary to resolve this question.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. See Van Arsdall v. State, 524 A.2d 3, 5 (Del. 1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. According to Riley's statistics, five of those struck by the state were white, and the race of two is not provided. Appendix A.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. There is no evidence that this was done. First, there is no evidence that the same prosecutors appeared in all four cases, and particularly in view of the differences in the four cases, there is no reason to suppose that the same strategies were used.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. See Dissent at 66-67 (discussing jur or Reed). We discuss this matter infra at 23-25.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. See Hernandez v. New York, 500 U.S. 352, 353 (1991); Batson, 476 U.S. at 98 n.21. In discussing a federal appellate court's standard of review in a direct federal appeal, the Supreme Court observed: \"When findings are based on determinations r egarding the credibility of witnesses,\" an appellate court must give \"even greater deference to the trial court's findings; for only the trial judge can be aware of the variations in demeanor and tone of voice that bear so heavily on the listener's . . . belief in what is said.\" Anderson v. Bessemer City, 470 U.S. 564, 575 (1985). Indeed, the Court added, that \"when a trial judge's finding is based on his decision to credit the testimony of [a] witness[ ] [who] has told a coherent and facially plausible story that is not contradicted by extrinsic evidence, that finding, if not internally inconsistent, can virtually never be clear error.\" Id. \"The respectpaid such findings in a habeas proceeding certainly should be no less.\" Patton v. Yount, 467 U.S. 1025, 1038 (1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Our dissenting colleague, by contrast, wouldfind on the cold record before us that the prosecutor was untruthful when he testified before Judge Steele. In fact, a centerpiece of the dissent is an attack upon the credibility of prosecutor James Liguori. W e reject the dissent's analysis of this issue and note that some of the facts on which the dissent relies are either insignificant or irrelevant. For example, the dissent repeatedly implies that Liguori's testimony is suspect because he testified at the Batson hearing that his objective at Riley's trial was to obtain a capital sentence. See Dissent at 60-61, 64. But is not this the objective of every prosecutor in a case in which the death penalty is sought? Are all such prosecutors presumptively unworthy of belief? The dissent also implies that Liguori discriminated in the use of per emptory challenges because an appellate brief on which his name does not even appear (see App. at 894) relied in part on Swain, which was then still good law. See Dissent at 59-60. The dissent points out that the recor d does not reflect any \"uncertainty on Nichols's part\" as to whether he could return a death sentence. Dissent at 64. But what the prosecutor claimed to have observed -- \"a significant pause\" -- is not something that a transcript is likely to capture. Likewise, the fact that the prosecutor did not have \"contemporaneous notes\" (see Dissent at 58) r egarding the pause reveals little, because, particularly in the pre-Batson era, a prosecutor had no strong reason for making or keeping such notes. The dissent's arguments do not persuade us to overtur n Judge Steele's credibility finding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The entire relevant colloquy was as follows: Q. Let me ask you several questions dealing with capital punishment, your attitude towards capital punishment. Do you have any conscientious scruples against finding a ver dict of guilty where the punishment might be death or against imposing the death penalty if the evidence should so warrant? A. Can I rephrase that in my own wor ds? Q. Yes, you may. A. If a person did something that was wrong and that was his punishment, then I would agree, you know. T o me it is okay if you done something wrong without, you know -- if you didn't have -- Q. If the evidence justified it, you couldfind a person guilty even though the punishment may be death? A. Yes, I could. Q. Or the penalty may be imposing the death penalty. Regardless of any personal beliefs or feelings you may have, if the evidence justified it, would you be able to find a person guilty of mur der in the first degree and would you be able to impose the death penalty? I will repeat the question. Regardless of any personal feelings or beliefs you may have, if the evidence in the case justified it, would you be able to find a person guilty of murder in the first degree and would you be able to impose the death penalty? A. I've got to say this. I may, could say that I agree, but I don't know whether I could say, you know -- I don't know whether I could draw the conclusion. Q. If the evidence justified it, do you feel your personal feelings against the death penalty may be such that you may not find this person guilty of murder in the first degree? A. I couldn't put my personal feelings in it. Q. Pardon? A. I couldn't put my personal -- Q. You would not? A. No, I couldn't put my personal feelings in it. Q. What would prevent you from finding this person guilty of murder in the first degree and imposing the death penalty then? Do you have some conscientious scruples against finding a person guilty? A. No. I just never had to do that and it's just making me think about it. App. 290-92 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Riley IV at 4. See also App. 860 (McGuire's testimony at the evidentiary hearing).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Just because the notation \"wants of f \" appear after the words \"works at Lowe's,\" it cannot be assumed that Reed's desire to be excused was related to his employment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Many decisions have held that Batson is not contravened simply because two jurors exhibit similar characteristics and one is excluded while the other is retained. See, e.g., Matthews v. Evatt, 105 F.3d 907, 918 (4th Cir. 1997); United States v. Spriggs, 102 F.3d 1245, 1255 (D.C. Cir. 1997); United States v. Stewart, 65 F.3d 918, 926 (11th Cir. 1995); United States v. Alvarado, 951 F.2d 22, 25 (2d Cir. 1991); United States v. Lance, 853 F.2d 1177, 1181 (5th Cir . 1988); United States v. McCoy, 848 F.2d 743, 745 (6th Cir. 1988); United States v. Lewis, 837 F.2d 415, 417 n.5 (9th Cir. 1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. This case is very different from Jones v. Ryan, supra, on which Riley relies. There, exercising plenary r review in the absence of any findings of fact by a state court, we held that Batson was violated where the prosecutor excluded a black juror who had a child approximately the same age as the defendant, while retaining a white juror who was similarly situated. Jones, 987 F.2d at 973. In the present case, we are limited to deciding whether the state court finding is fairly supported by the evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Riley's amended federal habeas petition raised claims regarding the alleged ineffectiveness of trial counsel at the guilty phase, but the District Court held that these claims were pr ocedurally barred. See Riley VI, 1998 WL 172856, at **18-20. On appeal, Riley refers to these claims in a footnote. See Appellant's Br. at 38 n.16. This footnote is inadequate to raise the issue on appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The first brief submitted by Riley's attor ney on direct appeal contained a conclusory passage that purported to raise the issue of ineffective assistance (without any factual elaboration) for the purpose of preserving the issue. See App. 1198. However, this brief was rejected by the Delaware Supreme Court, and the brief that was ultimately submitted and accepted contained no such passage. See App. 1198-99.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Indeed, in Riley's case, ineffective assistance was vigorously argued in the post-conviction relief proceedings, and the Delaware Supreme Court addressed these arguments on the merits. See Riley V, 585 A.2d at 726-29.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Even if Riley had asserted a \"cause\" for the procedural default, he would have to confront the rule that a habeas petitioner is not entitled to an evidentiary hearing in federal court to establish a factual record unless the petitioner can show \"cause\" for not making the necessary factual record in the state proceedings. See Keeney v. Tamayo-Reyes, 504 U.S. 1, 11-12 (1992).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Romano v. Oklahoma, 512 U.S. at 9 (quoting Dugger v. Adams, 489 U.S. at 407).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Romano v. Oklahoma, 512 U.S. at 9 (quoting Durden v. Wainwright, 477 U.S. at 184, n.15).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. See Wainwright v. Witt, 469 U.S. 412, 419 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. See also Deputy v. Taylor, 19 F .3d 1485, 1498 (3d Cir. 1994) (citations omitted) (internal quotation marks omitted)(\"a trial court may excuse a juror for cause where such jur or's views would prevent or substantially impair the performance of his duties as a juror in accordance with his instructions and his oath. . . . [and] that a state trial judge's finding that a prospective jur or is impermissibly biased against the death penalty is entitled to a presumption of correctness under S28 U.S.C.A. 2254(d).\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. In addition, as the District Court noted, some of the answers given by Floyd and Mood to questions not concerning capital punishment may have influenced the trial judge's decision to dismiss them. Floyd revealed that she knew Tyrone Baxter and was a casual friend of Baxter's mother. Mood said that he was a good friend of one of the police officers involved in the case and had served with him in the fir e department. See Riley VI, 1998 WL 172856, at *12.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Ordinarily, federal habeas relief is not available for an error of state law: the habeas statute provides that a writ disturbing a state court judgment may issue only if a prisoner is in custody\"in violation of the Constitution or laws or treaties of the United States.\" 28 U.S.C. S 2241(c)(3). See Pulley v. Harris, 465 U.S. 37, 41 (1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The four trials were: a. Andre Deputy -- state struck the lone prospective black juror, a second juror designated as \"Indian,\" and six prospective white jurors; b. Judith McBride -- state struck all thr ee prospective black jurors, five whites, plus two other jur ors whose race has not been identified; c. Riley -- state struck all three prospective black jurors and eight whites; and d. Daniel Pregent -- state struck the lone prospective black juror and four whites. Although the race of two of the jurors who were ultimately empaneled has not been identified, the state does not contest Riley's assertion that every empaneled juror was white.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. As the majority points out, not all of the defendants in Riley's sample were minorities, but that is immaterial to whether the Kent County prosecutor struck black jurors on account of their race. Excluding jurors on the basis of race is unconstitutional regardless of the race of the defendant. See Powers v. Ohio, 499 U.S. 400 (1991).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. The majority also asserts that Riley's data are flawed because we do not know the identity of the prosecutors who participated in jury selection in these cases. While this objection might have more force if there was evidence that the use of peremptory challenges in Kent County varied from case to case, there is no such evidence here. Moreover, a newspaper article published during the trial described Liguori, the lead prosecutor in Riley's trial, as \"the chief prosecutor in Kent County.\" App. at 1442.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. The jury had already been instructed that, by convicting Riley of felony murder, it had already found that an aggravating circumstance existed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The Delaware capital sentencing scheme was substantially amended in 1991. Under the amended statute, the \"jury now functions only in an advisory capacity. The judge, after taking the jury's recommendation into consideration, has the ultimate responsibility for determining whether the defendant will be sentenced to life imprisonment or death.\" State v. Cohen, 604 A.2d 846, 849 (Del. 1992). Of course, when Riley was sentenced the jury's death sentence was binding on the judge.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Although the trial court informed the jury that it was bound by the jury's recommendation of death, the court said nothing whatsoever about appellate review.\u003c/span\u003e\n\n",
    "body_length": 153926,
    "citedas": [
      "237 F.3d 300"
    ],
    "attorneys": "Thomas J. Allingham, II (Argued)Stephen D. DargitzOne Rodney SquareP.O. Box 636Wilmington, DE 19899.Mary M. Maloney Huss222 Delaware Avenue, Suite 1102Lawrence J. ConnellWidener University School of LawP.O. Box 7474Concord PikeWilmington, DE 19803Attorneys for Appellant.Loren C. Meyers (Argued)Chief of Appeals DivisionWilliam E. MolchenDeputy Attorney GeneralDepartment of JusticeState Office Building820 N. French StreetWilmington, DE 19801Attorney for Appellees.",
    "category": [
      "243",
      "36",
      "78"
    ],
    "judges": "Before: Sloviter, Alito, and Stapleton, Circuit Judges",
    "citation_count": 4
  }
}
